{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Aloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nReview Date: 2021/07/14\nStore: CIMIY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nReview Text: Well worthwhile the price. Has another of different purposes and delivers.\nReview Title: Delivers\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Bath Roman Japanese Cypress (Hinoki) Bath Salts - 680g\nEARTH\n['Japanese Bathsalt Bathroman cypress bath']\n{'Brand': 'EARTH', 'Unit Count': '680 gram', 'Number of Items': '1', 'Item Form': 'Powder', 'Item Weight': '1.8 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6.1 x 4.6 x 3.4 inches; 1.76 Pounds', 'Item model number': '4901080536013', 'Manufacturer': 'Bathroman'}\nI enjoy woodsy, earthy scents so this was a great choice. This hinoki smells like evergreen, dry cedar, with a lemon-like undertone; the scent has a calming effect and lasts throughout your soak. You can splurge a little for these salts because you only need to use a small amount to get the full effect.\nSacred Hinoki - Calming, Grounding Scent\nITECHNIK Sonic Rechargeable Electric Toothbrush for Adults, with TPU Wrapped Handle, Inductive Fast Charge, 5 Brushing Modes, Waterproof, Smart Timer, 3 Replacement Heads&Covers, ST-102 (Black)\nITECHNIK\n{'Product Dimensions': '7.87 x 3.94 x 1.97 inches; 0.01 Ounces', 'UPC': '779186943264'}\nThe top settings are very strong and get your teeth clean. The lowest setting however are perfect for sensitive teeth. Unit charges really fast and can be plugged into a laptop or phone charger for travel. I also like the fact that the charger is a little more present than some others, so you can find it more easier. I had one with just a cable and the cable got tossed. The faux leather on the back fits well into any size hands.\nFast and Functional\nQueendom Unlashed Mascara | Volumizing and Lengthening | Boosts Lash Length | Vegan, Cruelty Free, Paraben Free\nQueendom\n{'Package Dimensions': '5.28 x 0.94 x 0.63 inches; 0.85 Ounces'}\nThis mascara provides volume and length, but at a clumpy price. The wand is great for separation of each lash which helps evenly apply the formula to each lash. The formula goes on kind of clumpy as shown by other reviewers and flakes with wear. I had to wipe the fallout twice which would be terrible if I were wearing full coverage foundation. It does, however, remove easy with facial wipes.\nVolumizing at a Cost\nVeta – Lash and Eyebrow Serum – 2-in-1 Lash & Brow Pen – Produces Longer, Healthier, Denser Lashes and Thicker Brows – Eyelash Serum – Boosts Skin Collagen – Drug-Free Formula - 1 fl oz.\nVeta\n{'Color': 'Silver, Black', 'Brand': 'Veta', 'Item Form': 'lotion', 'Skin Type': 'All', 'Package Information': 'Tube', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.2 x 1.61 x 1.57 inches; 1.13 Ounces', 'UPC': '861121002645'}\nI thought this might be a gimmick, but it honestly showed results. It won't regrow lost hairs or give you brand new volume you never had, but it promotes healthy growth in the hair you have. I lost some eyelashes due to a cruddy fake lash application. Using this regrowth was pretty obvious and lashes looked longer and fuller.\nPromotes Healthy Hairs\nCremorlab Mineral Treatment Essence 9.1 Fl. Oz. 270ml Water Essence, Serum for Face, Face Moisturizer\nCREMORLAB\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.76 x 2.13 x 6.69 inches; 11.29 Ounces', 'Item model number': '8.80934E+12'}\nI used for more than a month with no visible results. I still have clogged pores and dry skin. I haven't experienced any I'll effects, but I was hoping for basic results.\nNo Effects\n2Pcs Mascara Black Volume and Length 4D Natural and Long Lasting Lash Blast Mascara, 0.27 Fl Oz\nMarine Forest\n{'Brand': 'Marine Forest', 'Number of Items': '2', 'Item Volume': '0.27 Fluid Ounces', 'Package Information': 'Tube', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '4.84 x 2.01 x 0.98 inches; 3.17 Ounces', 'UPC': '729843907382'}\nIt is on the dry side and eventually smudges or flakes. It doesn't curl and it's as good as discount store mascara.\nNo Curl\nDr. Bessette Naturals Facial Beauty Bars | Doctor Created (French Green Sea Clay)\nDR. BESSETTE NATURALS\n{'Item Form': 'Bar', 'Skin Type': 'All', 'Brand': 'DR. BESSETTE NATURALS', 'Scent': 'French Green', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.59 x 4.25 x 0.71 inches; 1.13 Ounces', 'UPC': '696550973774'}\nThis costs as much as a popular brand of 4 oz soaps, but in a small size. It comes in an envelope and is a sliver. I used it all quickly and it wasn't moisturizing.\nSample Size\nAloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nCIMIY\n{'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nWell worthwhile the price. Has another of different purposes and delivers.\nDelivers",
  "profile": "**User Preferences Summary:**\n\n- **Fragrance Preferences**: Enjoys woodsy and earthy scents that evoke nature, particularly cedar and evergreen, often with citrus undertones for calming effects.\n\n- **Product Types**: Prefers natural bath products and high-quality personal care items, focusing on those that enhance the bathing experience and provide functional benefits, with an increasing emphasis on efficacy following past dissatisfaction with perceived overpriced products.\n\n- **User Experience**: Values high-quality products with strong sensory experiences and lasting effects, gravitating towards premium options. Recently reaffirmed importance on effective and high-value personal care solutions after a disappointing experience with a facial beauty bar.\n\n- **Cosmetic Preferences**: Seeks volumizing and lengthening cosmetic products, reflecting a desire for effective solutions despite frustrations with product performance.\n\n- **Sensory Effects**: Pursues calming and grounding experiences from bath and skincare products, underscoring a focus on relaxation and stress relief, and is interested in user-friendly devices that promote overall well-being.\n\n- **Usage Pattern**: Values products that require small amounts for maximum benefit, indicative of a conscientious consumption philosophy, while favoring multifunctional cosmetics.\n\n- **Recent Interactions**: Recently purchased a natural aloe vera gel, rating it highly for its versatility and effectiveness, illustrating a positive alignment with their holistic self-care approach and ongoing prioritization of functional skincare solutions.\n\nOverall, the user demonstrates a preference for sensory-rich, high-quality products that provide relaxation, functionality, and effective performance, particularly in personal care and cosmetic choices.",
  "metrics": {
    "rouge1_f": 0.17846750727449082,
    "rouge2_f": 0.0272108843537415,
    "rougeL_f": 0.08341416100872939,
    "meteor": 0.07655425116617913,
    "bleu1": 0.02578333077898707,
    "bleu2": 0.006423417064508683,
    "bleu3": 0.0010335971614821066,
    "bleu4": 0.00041496846433732905,
    "bertscore_precision": 0.3808467388153076,
    "bertscore_recall": 0.4811585545539856,
    "bertscore_f1": 0.4251660108566284
  }
}