{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: L'ANGE HAIR Detangling Comb Brush | Lightweight, Comfortable, Non-slip Design | Easy Glide, Smooth, Snag-Free Comb | Blush\nReview Date: 2022/08/10\nStore: L'ANGE HAIR\nAverage Rating: 4.6\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Hair Type': 'All', 'Color': 'Blush', 'Unit Count': '1.00 Count', 'Package Dimensions': '11.1 x 3.5 x 0.51 inches; 1.76 Ounces', 'Item model number': '2335', 'UPC': '810108190264', 'Manufacturer': \"L'ANGE HAIR\"}\nReview Text: Another great product from Ľange! This pink comb is so cute and works good at getting those wet tangles loose. Very sturdy and good quality. Love this!\nReview Title: Cute pink comb!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "MRTREUP 5Pcs Hair Brushes for Women, Hair Comb for Women and Detangling Paddle Brush with Mist Spray Bottle for Wet or Dry Hair, Rail Tail Comb Set for Straight Long Thick Curly Natural Hair\nMRTREUP\n{'Brand': 'MRTREUP', 'Color': '5 Pack Muti-purpose Hair Brush Set', 'Shape': 'Oblong', 'Handle Material': 'Rubber', 'Product Benefits': 'Detangle，Eliminate the pain and pulling, Anti-Frizz, Anti-Breakage, Section, Curl Enhancing, Scalp Stimulation, Shine Enhancing, Moisturize, shape, sheenDetangle，Eliminate the pain and pulling, Anti-Frizz, Anti-Breakage, Section, Curl Enhancing, Scalp Stimulation, Shine Enhancing, Moisturize, shape, sheen   See more', 'Package Dimensions': '9.88 x 4.92 x 2.56 inches; 12.31 Ounces', 'Manufacturer': 'MRTREUP'}\nNice set of brushes and combs. And the spray bottle is nice but to my surprise as I squeezed the trigger it already had some sort of liquid in it. I'm not sure if that's from the company testing it or what. But to me that is strange when you receive a new product. However, the spray bottle does work well.\nSpray bottle already had liquid in it.\nYouClean 300 Antibacterial Travel Hand Soap Sheets - Pocket/Purse/Wallet/Backpack -Great for Outdoor Camping or Daily Use (Tea Party) (Tea Party)\nYouClean\n['Brand:', 'YouClean', 'Item Form:', 'Sheet', 'Formulation:', 'Concentrated plant-based soap', 'Scent:', 'Tea Party (Chamomile, Green Tea, Tea Tree)', 'Package Box Size:', '2 x 1 x 1.5 inch', 'www.shopyouclean.com', \"We are changing our packaging. No more small plastic cases!   Our new packaging is 100% biodegradable paper. All 300 sheets are tightly packed in 3 tiny paper boxes (100 sheets/box) which nicely fit in any purse/wallet, handbag, and kids' pack-backs.   Check out our 9 scent collections:   - Tea Party  - Citrus Collection  - Purple Heart  - Pink Pamper  - Red Passion  - Blanca Elegance  - Seaside Vacation  - The Adventure  - The Nonsense (unscented)\"]\n{'Item Form': 'Sheet', 'Skin Type': 'All', 'Brand': 'YouClean', 'Scent': 'Tea Party', 'Material Type Free': 'Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)  See more', 'Product Dimensions': '2 x 1 x 1.25 inches; 2.4 Ounces', 'UPC': '609670421100', 'Manufacturer': 'YouClean'}\nThese were so fun to wash hands with. The first few went down the sink. My kid had to learn to wet the opposite hand you held the soap in. It suds up really well and smells great! Taking these to the beach for the showers. Love!\nSo fun to use!\nL’ange Argan-Infused Round Brush | Lightweight & Ergonomic Design | 43MM Tourmaline Ceramic Barrel\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Color': 'Rose Gold, Black', 'Shape': 'Round', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Package Dimensions': '10.51 x 2.64 x 2.56 inches; 3.84 Ounces', 'UPC': '810108191223'}\nThis brush is another amazing product from Ľange. Very sturdy bristles and handle feels great in hand. Easy to create lift and style to hair.\nGreat round brush!\nGAQQI DIY Lash Extension Kit, 32 PCS Wide-Stem Cluster Lashes with Super Hold Bond and Seal Glue, Applicator, 12+14mm Mixed Length Individual Lashes, DIY Eyelash Extension Kit at Home - Style Natural\nGAQQI\n{'Brand': 'GAQQI', 'Material': 'Faux Mink', 'Material Feature': 'Natural', 'Item Form': 'Individual', 'Mounting Type': 'Tweezers', 'Package Dimensions': '6.77 x 4.25 x 0.83 inches; 2.89 Ounces'}\nThis is a great kit to do your own eyelashes. They eyelashes are clusters and are wispy and natural looking. Easy to apply. My lashes can look better and fuller all at home!\nGreat kit for eyelash extensions\nL'ANGE HAIR Rubber Sectioning Hair Clips | Narrow-Tipped Design | For Parting & Sectioning Hair | Easy Grip Handles | Professional Styling Results | 6-Pack (Blush)\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Hair Type': 'All', 'Color': 'Blush', 'Age Range (Description)': 'Adult', 'Embellishment': 'Bow', 'Package Dimensions': '8.46 x 5.71 x 1.14 inches; 2.89 Ounces', 'Item model number': '2323', 'UPC': '810108190585', 'Manufacturer': \"L'ANGE HAIR\"}\nThese clips work great for sectioning hair for highlights. I also use them to hold hair above each slice I weave to keep hair nice and clean while applying bleach. These work really well!\nGreat clips\nL'ANGE HAIR Detangling Comb Brush | Lightweight, Comfortable, Non-slip Design | Easy Glide, Smooth, Snag-Free Comb | Blush\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Hair Type': 'All', 'Color': 'Blush', 'Unit Count': '1.00 Count', 'Package Dimensions': '11.1 x 3.5 x 0.51 inches; 1.76 Ounces', 'Item model number': '2335', 'UPC': '810108190264', 'Manufacturer': \"L'ANGE HAIR\"}\nAnother great product from Ľange! This pink comb is so cute and works good at getting those wet tangles loose. Very sturdy and good quality. Love this!\nCute pink comb!",
  "profile": "**User Summary:**\n\n- **Product Preference:** The user continues to expand their interests in high-quality beauty tools, specifically showing an affinity for multifunctional hair care items. They increasingly value products that are not only effective but also aesthetically pleasing, as evidenced by their recent purchase of a vibrant, stylish comb.\n\n- **Experience Sensitivity:** They maintain a strong preference for clean and eco-friendly products, emphasizing sturdy designs that enhance usability. This highlights their commitment to functionality in both hair and lash care tools, focusing on items that deliver a polished appearance.\n\n- **Rating Behavior:** The user consistently leaves positive reviews that emphasize quality and functionality. Their latest review showcases their appreciation for effective grooming solutions, reinforcing their tendency to acknowledge product strengths while enjoying the experience.\n\n- **Functional Needs:** The user actively seeks features that ensure comfort during use and accommodate diverse hair types, demonstrating their desire for user-friendly products that simplify at-home grooming routines.\n\n- **Purchase Context:** Their purchases reflect a commitment to enhancing personal grooming habits, aligning with their overall focus on health, hygiene, and aesthetics.\n\n- **Consumer Attitude:** The user exhibits a discerning yet optimistic outlook on product evaluation, seamlessly blending enjoyment with effectiveness in their beauty practices. Their profile reflects a strong inclination towards high-quality, functional tools and a concern for both sustainability and performance in hair care.",
  "metrics": {
    "rouge1_f": 0.13333333333333333,
    "rouge2_f": 0.003988035892323031,
    "rougeL_f": 0.05771144278606964,
    "meteor": 0.056508377119064146,
    "bleu1": 0.016495160230342143,
    "bleu2": 0.002520041276354902,
    "bleu3": 0.00049690514139985,
    "bleu4": 0.00022085230747422832,
    "bertscore_precision": 0.3532547056674957,
    "bertscore_recall": 0.45049867033958435,
    "bertscore_f1": 0.39599406719207764
  }
}