{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Neutrogena Ultra Light Facial Cleansing Oil & Makeup Remover, Non-Comedogenic Face Oil Cleanser to Remove Dirt, Oil, Makeup & Waterproof Mascara, 4 fl. oz\nReview Date: 2017/07/02\nStore: Neutrogena\nProduct Description: [\"Remove makeup- even waterproof mascara- as well as dirt and oil from your skin with Neutrogena Ultra Light Cleansing Oil. This one-step facial cleansing and makeup remover oil completely cleans skin with a blend of fine oils that act like a magnet to effortlessly and effectively extract oil and impurities. Our oil face cleanser rinses clean with no greasy residue, leaving your skin feeling soft and healthy every day. The lightweight non-comedogenic formula won't clog pores and has been clinically tested by dermatologists.\"]\nAverage Rating: 4.4\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Sensitive', 'Brand': 'Neutrogena', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.83 x 1.83 x 6.75 inches; 4 Ounces', 'Item model number': '070501110720', 'UPC': '086800110736 070501110720', 'Manufacturer': 'Johnson & Johnson'}\nReview Text: I've only used this a few times so far, but so far, so good.  It does a great job removing make-up gently...including eye make-up.  Since it's oil based, I was worried it would break me out.  I'm 41, but my skin is very sensitive and I'm still prone to break-outs, particularly in my t-zone area.  Thankfully, so far, my skin seems to be liking this product.  I do think it's a little pricey for the size of the bottle you receive, but overall, I'm pleased.\nReview Title: My skin seems to like this product...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Tea Tree Lemon Sage Thickening Liter Duo Set\n{'Product Benefits': 'Thickening agents boost volume, while lightweight conditioners protect and add shine.', 'Item Form': 'Discrete Subunit', 'Brand': 'Tea Tree', 'Hair Type': 'Fine', 'Scent': 'Lemon,Peppermint', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6.5 x 3 x 9 inches; 4.3 Pounds', 'Item model number': 'EW-4266', 'UPC': '605925831670 009531523736 881200200212 887105561007 884312437323 009531550169 885596163335', 'Manufacturer': 'John Paul Mitchell Systems'}\nI can't speak to whether or not the product sold from Amazon is fake or not, as I don't order it from here.  I usually buy it from the salons or from trusted sellers on Ebay for a much more reasonable price.  Having said that, I really like this shampoo.  It smells amazing, the lather is plentiful and silky, and I can genuinely say that my hair does feel a bit thicker.  While I don't think this shampoo has caused new hair growth, I do feel as if it's strengthened each individual strand to give my hair a slightly fuller look.  Don't get me wrong...it's not an Earth-shattering change, but it's a step in the right direction.<br /><br />The reason this didn't get 5 stars is because every single shampoo bottle I have ever purchased has been faulty.  They leak, the pump either breaks or doesn't work from the start, and the plastic is flimsy.  If it's been mailed to me, it inevitably leaks all over the package and I lose a substantial amount of product, which is pretty frustrating.<br /><br />Overall though, a great product!\nGreat shampoo, crappy bottles and pumps...\nJordana Cat Eye Liner 03 Orchid\nJordana\n{'Brand': 'Jordana', 'Finish Type': 'Matte', 'Special Feature': 'Travel size', 'Number of Items': '1', 'Unit Count': '1.00 Count'}\nThe color is beautiful and it provides the perfect pop of brightness with a more neutral, smokey eye...BUT!  (You knew there was a but coming, right?)  It's not super pigmented and you have to go over it several times to get a good pop.  Since it's lighter, it's not ideal for a winged eye either.  I usually just flick it out on the edge a little, but don't do a full-on wing.  I'd say the color trends more toward violet (with red undertones), than purple (with blue). It doesn't bleed or run, and for the price, I think it's a good choice, if you're looking for a little spark with your eye make-up routine.\nBeautiful, but lightly pigmented.\nNeutrogena Ultra Light Facial Cleansing Oil & Makeup Remover, Non-Comedogenic Face Oil Cleanser to Remove Dirt, Oil, Makeup & Waterproof Mascara, 4 fl. oz\nNeutrogena\n[\"Remove makeup- even waterproof mascara- as well as dirt and oil from your skin with Neutrogena Ultra Light Cleansing Oil. This one-step facial cleansing and makeup remover oil completely cleans skin with a blend of fine oils that act like a magnet to effortlessly and effectively extract oil and impurities. Our oil face cleanser rinses clean with no greasy residue, leaving your skin feeling soft and healthy every day. The lightweight non-comedogenic formula won't clog pores and has been clinically tested by dermatologists.\"]\n{'Item Form': 'Oil', 'Skin Type': 'Sensitive', 'Brand': 'Neutrogena', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.83 x 1.83 x 6.75 inches; 4 Ounces', 'Item model number': '070501110720', 'UPC': '086800110736 070501110720', 'Manufacturer': 'Johnson & Johnson'}\nI've only used this a few times so far, but so far, so good.  It does a great job removing make-up gently...including eye make-up.  Since it's oil based, I was worried it would break me out.  I'm 41, but my skin is very sensitive and I'm still prone to break-outs, particularly in my t-zone area.  Thankfully, so far, my skin seems to be liking this product.  I do think it's a little pricey for the size of the bottle you receive, but overall, I'm pleased.\nMy skin seems to like this product...",
  "profile": "**User Summary**\n\n- **Product Preference:** Continues to prefer shampoos designed for fine hair with thickening properties, valuing products that enhance volume and shine through lightweight formulas. Recently showed interest in facial cleansing oils that are gentle and effective for sensitive skin.\n- **Scent Preference:** Enjoys refreshing and invigorating scents, particularly lemon and peppermint.\n- **Buying Behavior:** Maintains a strong inclination towards purchasing from salons or trusted sellers, emphasizing reliability and authenticity, while expanding interest into high-quality skincare products from reputable brands.\n- **Customer Experience:** Notable dissatisfaction with product packaging remains, especially concerning faulty bottles and pumps, indicating a preference for quality and usability in design across all products, including skincare and makeup.\n- **Overall Sentiment:** Generally positive about beauty products, appreciating performance and aesthetics. Frustration with pigmentation in cosmetics can dampen satisfaction, though they're pleased with products that are effective for sensitive skin. Values good price-to-value ratios and functionality over dramatic changes.\n- **Review Style:** Provides detailed feedback that balances personal experience with product effectiveness, consistently highlighting both strengths and weaknesses. Demonstrates a discerning taste, showcasing a preference for effective, visually appealing products that also consider skin sensitivity. \n\nThis profile reflects a user who is meticulous in their choices, seeking high-quality beauty and skincare products that align with their aesthetic preferences and usability needs.",
  "metrics": {
    "rouge1_f": 0.2246941045606229,
    "rouge2_f": 0.022296544035674472,
    "rougeL_f": 0.09566184649610679,
    "meteor": 0.0863044036608014,
    "bleu1": 0.04103663023838564,
    "bleu2": 0.012872665279474338,
    "bleu3": 0.004064750966069059,
    "bleu4": 0.0012856360972378282,
    "bertscore_precision": 0.39169740676879883,
    "bertscore_recall": 0.4888162612915039,
    "bertscore_f1": 0.43490082025527954
  }
}