{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Jordana Cat Eye Liner 03 Orchid\nReview Date: 2017/06/29\nStore: Jordana\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Jordana', 'Finish Type': 'Matte', 'Special Feature': 'Travel size', 'Number of Items': '1', 'Unit Count': '1.00 Count'}\nReview Text: The color is beautiful and it provides the perfect pop of brightness with a more neutral, smokey eye...BUT!  (You knew there was a but coming, right?)  It's not super pigmented and you have to go over it several times to get a good pop.  Since it's lighter, it's not ideal for a winged eye either.  I usually just flick it out on the edge a little, but don't do a full-on wing.  I'd say the color trends more toward violet (with red undertones), than purple (with blue). It doesn't bleed or run, and for the price, I think it's a good choice, if you're looking for a little spark with your eye make-up routine.\nReview Title: Beautiful, but lightly pigmented.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Tea Tree Lemon Sage Thickening Liter Duo Set\n{'Product Benefits': 'Thickening agents boost volume, while lightweight conditioners protect and add shine.', 'Item Form': 'Discrete Subunit', 'Brand': 'Tea Tree', 'Hair Type': 'Fine', 'Scent': 'Lemon,Peppermint', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6.5 x 3 x 9 inches; 4.3 Pounds', 'Item model number': 'EW-4266', 'UPC': '605925831670 009531523736 881200200212 887105561007 884312437323 009531550169 885596163335', 'Manufacturer': 'John Paul Mitchell Systems'}\nI can't speak to whether or not the product sold from Amazon is fake or not, as I don't order it from here.  I usually buy it from the salons or from trusted sellers on Ebay for a much more reasonable price.  Having said that, I really like this shampoo.  It smells amazing, the lather is plentiful and silky, and I can genuinely say that my hair does feel a bit thicker.  While I don't think this shampoo has caused new hair growth, I do feel as if it's strengthened each individual strand to give my hair a slightly fuller look.  Don't get me wrong...it's not an Earth-shattering change, but it's a step in the right direction.<br /><br />The reason this didn't get 5 stars is because every single shampoo bottle I have ever purchased has been faulty.  They leak, the pump either breaks or doesn't work from the start, and the plastic is flimsy.  If it's been mailed to me, it inevitably leaks all over the package and I lose a substantial amount of product, which is pretty frustrating.<br /><br />Overall though, a great product!\nGreat shampoo, crappy bottles and pumps...\nJordana Cat Eye Liner 03 Orchid\nJordana\n{'Brand': 'Jordana', 'Finish Type': 'Matte', 'Special Feature': 'Travel size', 'Number of Items': '1', 'Unit Count': '1.00 Count'}\nThe color is beautiful and it provides the perfect pop of brightness with a more neutral, smokey eye...BUT!  (You knew there was a but coming, right?)  It's not super pigmented and you have to go over it several times to get a good pop.  Since it's lighter, it's not ideal for a winged eye either.  I usually just flick it out on the edge a little, but don't do a full-on wing.  I'd say the color trends more toward violet (with red undertones), than purple (with blue). It doesn't bleed or run, and for the price, I think it's a good choice, if you're looking for a little spark with your eye make-up routine.\nBeautiful, but lightly pigmented.",
  "profile": "**User Summary**\n\n- **Product Preference:** Continues to prefer shampoos designed for fine hair with thickening properties, valuing products that enhance volume and shine through lightweight formulas.\n- **Scent Preference:** Enjoys refreshing and invigorating scents, particularly lemon and peppermint.\n- **Buying Behavior:** Maintains a strong inclination towards purchasing from salons or trusted sellers, emphasizing reliability and authenticity, but has shown interest in other beauty products from various brands.\n- **Customer Experience:** Notable dissatisfaction with product packaging remains, especially concerning faulty bottles and pumps, indicating a preference for quality and usability in design across all products, including makeup.\n- **Overall Sentiment:** Generally positive about beauty products, appreciating performance and aesthetics, though frustration with pigmentation in cosmetics can dampen satisfaction. The user favors products that offer good value for the price, with a preference for functionality over dramatic changes.\n- **Review Style:** Provides detailed feedback that balances personal experience with product effectiveness, consistently highlighting both strengths and weaknesses in an informatively critical manner. Demonstrates a discerning taste in both hair care and makeup, showing that they value visual appeal and practicality.\n\nThis profile showcases a user who is meticulous in their choices, seeking effective, high-quality products that align with their aesthetic preferences and maintain usability across different beauty categories.",
  "metrics": {
    "rouge1_f": 0.24761904761904757,
    "rouge2_f": 0.022292993630573247,
    "rougeL_f": 0.11746031746031745,
    "meteor": 0.11776783431124167,
    "bleu1": 0.10765865006316692,
    "bleu2": 0.03530675225362556,
    "bleu3": 0.016903393174999545,
    "bleu4": 0.008895460408434313,
    "bertscore_precision": 0.3881895840167999,
    "bertscore_recall": 0.46073511242866516,
    "bertscore_f1": 0.42136263847351074
  }
}