{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tea Tree Lemon Sage Thickening Liter Duo Set\nReview Date: 2017/06/18\nAverage Rating: 4.7\nProduct Details: {'Product Benefits': 'Thickening agents boost volume, while lightweight conditioners protect and add shine.', 'Item Form': 'Discrete Subunit', 'Brand': 'Tea Tree', 'Hair Type': 'Fine', 'Scent': 'Lemon,Peppermint', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6.5 x 3 x 9 inches; 4.3 Pounds', 'Item model number': 'EW-4266', 'UPC': '605925831670 009531523736 881200200212 887105561007 884312437323 009531550169 885596163335', 'Manufacturer': 'John Paul Mitchell Systems'}\nReview Text: I can't speak to whether or not the product sold from Amazon is fake or not, as I don't order it from here.  I usually buy it from the salons or from trusted sellers on Ebay for a much more reasonable price.  Having said that, I really like this shampoo.  It smells amazing, the lather is plentiful and silky, and I can genuinely say that my hair does feel a bit thicker.  While I don't think this shampoo has caused new hair growth, I do feel as if it's strengthened each individual strand to give my hair a slightly fuller look.  Don't get me wrong...it's not an Earth-shattering change, but it's a step in the right direction.<br /><br />The reason this didn't get 5 stars is because every single shampoo bottle I have ever purchased has been faulty.  They leak, the pump either breaks or doesn't work from the start, and the plastic is flimsy.  If it's been mailed to me, it inevitably leaks all over the package and I lose a substantial amount of product, which is pretty frustrating.<br /><br />Overall though, a great product!\nReview Title: Great shampoo, crappy bottles and pumps...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Tea Tree Lemon Sage Thickening Liter Duo Set\n{'Product Benefits': 'Thickening agents boost volume, while lightweight conditioners protect and add shine.', 'Item Form': 'Discrete Subunit', 'Brand': 'Tea Tree', 'Hair Type': 'Fine', 'Scent': 'Lemon,Peppermint', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6.5 x 3 x 9 inches; 4.3 Pounds', 'Item model number': 'EW-4266', 'UPC': '605925831670 009531523736 881200200212 887105561007 884312437323 009531550169 885596163335', 'Manufacturer': 'John Paul Mitchell Systems'}\nI can't speak to whether or not the product sold from Amazon is fake or not, as I don't order it from here.  I usually buy it from the salons or from trusted sellers on Ebay for a much more reasonable price.  Having said that, I really like this shampoo.  It smells amazing, the lather is plentiful and silky, and I can genuinely say that my hair does feel a bit thicker.  While I don't think this shampoo has caused new hair growth, I do feel as if it's strengthened each individual strand to give my hair a slightly fuller look.  Don't get me wrong...it's not an Earth-shattering change, but it's a step in the right direction.<br /><br />The reason this didn't get 5 stars is because every single shampoo bottle I have ever purchased has been faulty.  They leak, the pump either breaks or doesn't work from the start, and the plastic is flimsy.  If it's been mailed to me, it inevitably leaks all over the package and I lose a substantial amount of product, which is pretty frustrating.<br /><br />Overall though, a great product!\nGreat shampoo, crappy bottles and pumps...",
  "profile": "**User Summary**\n\n- **Product Preference:** Prefers shampoos designed for fine hair with thickening properties. Values products that offer both volume and shine, likely leaning towards lightweight formulas.\n- **Scent Preference:** Enjoys refreshing and invigorating scents, particularly lemon and peppermint.\n- **Buying Behavior:** Favors purchasing from salons or trusted sellers rather than online marketplaces, emphasizing a preference for reliability and authenticity in shopping.\n- **Customer Experience:** Has encountered consistent issues with product packaging, specifically with faulty bottles and pumps, which has impacted satisfaction. This suggests a keen eye for quality and usability in product design.\n- **Overall Sentiment:** Generally positive about hair care products when they meet performance expectations, although frustrations with packaging can lead to lower ratings. Believes in incremental improvements rather than dramatic results from hair treatments.\n- **Review Style:** Provides detailed feedback, mixing personal experience with product performance, and highlights both positives and negatives in an informatively critical manner. \n\nThis profile showcases a user who is discerning in both product choice and vendor reliability, with strong preferences for effectiveness and pleasant sensory experiences.",
  "metrics": {
    "rouge1_f": 0.24324324324324323,
    "rouge2_f": 0.01809954751131222,
    "rougeL_f": 0.12612612612612614,
    "meteor": 0.12394909267604555,
    "bleu1": 0.1534355375546628,
    "bleu2": 0.04862733334314778,
    "bleu3": 0.018272052803939655,
    "bleu4": 0.006305539718429922,
    "bertscore_precision": 0.4100777506828308,
    "bertscore_recall": 0.4702547788619995,
    "bertscore_f1": 0.43810951709747314
  }
}