{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Cancun Collection Cacao Body Bronzer – Superfood Infused Sunless Tanning Lotion with Cacao 5.1 fl.oz, For Instant Tan in 1 minute.\nReview Date: 2020/02/04\nStore: Cancun Collection\nAverage Rating: 3.8\nProduct Details: {'Item Form': 'Lotion', 'Skin Type': 'All', 'Brand': 'Cancun Collection', 'Skin Tone': 'All', 'Material Feature': 'Antioxidant', 'Package Dimensions': '5.1 x 4.6 x 1 inches; 14.39 Ounces', 'UPC': '659436986640'}\nReview Text: This Cancun Collection Cacao Bronzer is a fabulous alternative to getting a natural suntan from a tanning bed or from the sun due to harmful UV rays. It is also a great alternative if you do not like using self-tanners that can smell. This applies easily and blends with all skin tones. I have fair skin, but this even works on my skin color too. The bronzer blurs imperfections and stays on until you shower with soap!  I recommend this product!  See my pictures for more information.\nReview Title: Great, natural looking bronzer!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Brush Strokes Large Ball Tip Rounder Brush (Assorted Colors)\nBrush Strokes\n{'Brand': 'Brush Strokes', 'Shape': 'Oblong', 'Special Feature': 'Not-applicable', 'Unit Count': '1.00 Count', 'Hair Type': 'Fine', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.8 x 2.6 x 2.6 inches; 1.6 Ounces', 'Item model number': 'SG_B004F0KBDW_US', 'UPC': '794168349933'}\nPros: This brush is so light weight and makes it so easy to create a smooth, straight look with your hair. It does not tangle at all and is easy to use.<br />Cons: The brush made my hair a little flat, but I have thin, fine hair that requires work to create body.\nGreat for smoothing and straightening hair!\nCancun Collection Cacao Body Bronzer – Superfood Infused Sunless Tanning Lotion with Cacao 5.1 fl.oz, For Instant Tan in 1 minute.\nCancun Collection\n{'Item Form': 'Lotion', 'Skin Type': 'All', 'Brand': 'Cancun Collection', 'Skin Tone': 'All', 'Material Feature': 'Antioxidant', 'Package Dimensions': '5.1 x 4.6 x 1 inches; 14.39 Ounces', 'UPC': '659436986640'}\nThis Cancun Collection Cacao Bronzer is a fabulous alternative to getting a natural suntan from a tanning bed or from the sun due to harmful UV rays. It is also a great alternative if you do not like using self-tanners that can smell. This applies easily and blends with all skin tones. I have fair skin, but this even works on my skin color too. The bronzer blurs imperfections and stays on until you shower with soap!  I recommend this product!  See my pictures for more information.\nGreat, natural looking bronzer!",
  "profile": "**User Profile Summary:**\n\n- **Product Preferences:** \n  - Light-weight hair tools for ease of use.\n  - Focus on functionality, specifically smoothing and straightening capabilities.\n  - Preference for brushes that do not tangle hair.\n  - Interest in skin care products that offer effective results without harmful chemicals, especially alternatives to sun exposure.\n\n- **Hair Type Consideration:** \n  - Utilizes products designed for fine hair, attentive to their impact on body and volume.\n  \n- **Experience with Products:**\n  - Generally satisfied with product performance, indicated by a positive average rating.\n  - Recognizes the balance between functionality and specific hair needs, such as maintaining hair volume, while also appreciating products for skin care that provide natural finishes and ease of application.\n\n- **Overall Trends:**\n  - Values efficiency in styling tools.\n  - Attributes importance to both usability (easy handling and effective results) and personal hair characteristics (understanding certain tools' limitations on fine hair).\n  - Demonstrates an inclination for products that enhance natural beauty and offer quick, effective solutions, reflected in positive experiences with bronzers that provide a natural look and blend easily, indicating a preference for versatile and user-friendly beauty products.",
  "metrics": {
    "rouge1_f": 0.2632794457274827,
    "rouge2_f": 0.05104408352668213,
    "rougeL_f": 0.10623556581986142,
    "meteor": 0.13646730368856677,
    "bleu1": 0.18657199890237428,
    "bleu2": 0.05912626323809664,
    "bleu3": 0.021103334214589417,
    "bleu4": 0.007097533239019902,
    "bertscore_precision": 0.40550264716148376,
    "bertscore_recall": 0.48004066944122314,
    "bertscore_f1": 0.43963462114334106
  }
}