{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 613 Lace Front Wigs Human Hair Blonde Body Wave Wigs 13x6 HD Transparent Lace Front Wigs Brazilian Virgin Human Hair 150% Density Pre Plucked with Baby Hair Blonde Lace Frontal Wig for Women (20 Inch Body Wave )\nReview Date: 2022/05/30\nStore: Vligcor\nAverage Rating: 5.0\nProduct Details: {'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Vligcor', 'Package Dimensions': '9.61 x 6.77 x 2.36 inches; 13.12 Ounces', 'UPC': '759784671967'}\nReview Text: This is the first time I’ve ever ordered a human hair wig and man what a difference. Every time I order a synthetic hair wig I’m disappointed. I didn’t have to pluck this, the hair line looks very natural. The hair is soft, it feels like it’s my own. My only complaint is that it’s a very yellow blonde but I knew that when I ordered it. I’m wondering if I could maybe use my purple shampoo on it and tone it to a more natural blonde. I don’t want to ruin it but I think I’m going to give it a try. Will keep you posted on my results and show a before and after!\nReview Title: Gorgeous wig\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "613 Lace Front Wigs Human Hair Blonde Body Wave Wigs 13x6 HD Transparent Lace Front Wigs Brazilian Virgin Human Hair 150% Density Pre Plucked with Baby Hair Blonde Lace Frontal Wig for Women (20 Inch Body Wave )\nVligcor\n{'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Vligcor', 'Package Dimensions': '9.61 x 6.77 x 2.36 inches; 13.12 Ounces', 'UPC': '759784671967'}\nThis is the first time I’ve ever ordered a human hair wig and man what a difference. Every time I order a synthetic hair wig I’m disappointed. I didn’t have to pluck this, the hair line looks very natural. The hair is soft, it feels like it’s my own. My only complaint is that it’s a very yellow blonde but I knew that when I ordered it. I’m wondering if I could maybe use my purple shampoo on it and tone it to a more natural blonde. I don’t want to ruin it but I think I’m going to give it a try. Will keep you posted on my results and show a before and after!\nGorgeous wig",
  "profile": "**User Profile Summary:**\n\n- **Preference for Quality:** User prefers high-quality products, as evidenced by a transition from synthetic to human hair wigs, indicating a demand for realism and natural appearance.\n- **Hair Type:** Shows a clear inclination towards wavy styles, particularly in blonde shades, with a focus on softness and a natural hairline.\n- **Customization Interest:** User expresses a desire to customize hair color, showing an interest in personalizing their look (e.g., using purple shampoo to tone the wig).\n- **Positive Experience with Brands:** The user rates their experience highly, reflecting satisfaction with product performance and brand reliability.\n- **Engagement:** Willing to share experiences and results, suggesting a propensity for community engagement and sharing beauty tips.\n- **Color Sensitivity:** Awareness regarding color tones, favoring natural and flattering shades, with a willingness to experiment for improvement. \n\nOverall, the user appreciates high-quality hair products, values customization options, and is likely to engage in content sharing related to their beauty preferences.",
  "metrics": {
    "rouge1_f": 0.27745664739884396,
    "rouge2_f": 0.034883720930232565,
    "rougeL_f": 0.14450867052023122,
    "meteor": 0.16660422159361202,
    "bleu1": 0.25375347073885324,
    "bleu2": 0.05640531698539733,
    "bleu3": 0.011013542541115036,
    "bleu4": 0.004872383502044115,
    "bertscore_precision": 0.3957666754722595,
    "bertscore_recall": 0.42056137323379517,
    "bertscore_f1": 0.4077875018119812
  }
}