{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: By Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nReview Date: 2022/06/03\nStore: By Terry\nAverage Rating: 4.3\nProduct Details: {'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nReview Text: I was skeptical about this but decided to give it a try anyways. To my surprise it works pretty well. I don’t wear foundation during the summer, only bronzer/blush and highlighter. My skin gets extremely oily and shiny by the end of the day. I put my bronzer and highlighter on and then applied this powder using a powder brush. I would only use the applicator inclosed with it if I had no other choice. I went out in my yard and watered all of my flowers, it was 80 degrees out so quite warm. Came back inside and looked in the mirror and my face was still matte. Went about the rest of my day which included a 2.5 mile walk with my family. When I went to wash the makeup off my face my nose was only slightly shiny, that’s it. I deducted a star because my skin gets pretty bronzed this time of year, it seemed like the powder washed my color out a little bit. It wasn’t a huge difference but enough to notice.\nReview Title: Works well\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "613 Lace Front Wigs Human Hair Blonde Body Wave Wigs 13x6 HD Transparent Lace Front Wigs Brazilian Virgin Human Hair 150% Density Pre Plucked with Baby Hair Blonde Lace Frontal Wig for Women (20 Inch Body Wave )\nVligcor\n{'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Vligcor', 'Package Dimensions': '9.61 x 6.77 x 2.36 inches; 13.12 Ounces', 'UPC': '759784671967'}\nThis is the first time I’ve ever ordered a human hair wig and man what a difference. Every time I order a synthetic hair wig I’m disappointed. I didn’t have to pluck this, the hair line looks very natural. The hair is soft, it feels like it’s my own. My only complaint is that it’s a very yellow blonde but I knew that when I ordered it. I’m wondering if I could maybe use my purple shampoo on it and tone it to a more natural blonde. I don’t want to ruin it but I think I’m going to give it a try. Will keep you posted on my results and show a before and after!\nGorgeous wig\nBy Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nBy Terry\n{'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nI was skeptical about this but decided to give it a try anyways. To my surprise it works pretty well. I don’t wear foundation during the summer, only bronzer/blush and highlighter. My skin gets extremely oily and shiny by the end of the day. I put my bronzer and highlighter on and then applied this powder using a powder brush. I would only use the applicator inclosed with it if I had no other choice. I went out in my yard and watered all of my flowers, it was 80 degrees out so quite warm. Came back inside and looked in the mirror and my face was still matte. Went about the rest of my day which included a 2.5 mile walk with my family. When I went to wash the makeup off my face my nose was only slightly shiny, that’s it. I deducted a star because my skin gets pretty bronzed this time of year, it seemed like the powder washed my color out a little bit. It wasn’t a huge difference but enough to notice.\nWorks well",
  "profile": "**Updated User Profile Summary:**\n\n- **Preference for Quality:** User maintains a preference for high-quality products, reflected in their choice of natural materials in beauty essentials, seeking realism and effective performance.\n- **Hair Type:** Continues to favor wavy styles, particularly in blonde shades with a focus on softness and a natural hairline.\n- **Customization Interest:** User shows an ongoing desire to personalize their appearance, both in hair color and makeup application, indicating an appreciation for versatility in their beauty routine.\n- **Skin Care Awareness:** Demonstrates a strong awareness of skincare needs, particularly for managing oiliness, and favors products that offer long-lasting effects without compromising their natural skin tone.\n- **Positive Experience with Brands:** Consistently rates experiences highly, highlighting satisfaction with both product performance and brand reliability.\n- **Engagement:** Enthusiastic about sharing beauty tips and personal experiences, showing a proclivity for community engagement.\n- **Color Sensitivity:** Remains attuned to color tones and their effects, preferring flattering shades while being open to adjustments that enhance their overall look.\n  \nOverall, the user values high-quality, customizable beauty products, prioritizes effective solutions for both hair and skin, and enjoys engaging with others around their beauty experiences.",
  "metrics": {
    "rouge1_f": 0.1967213114754098,
    "rouge2_f": 0.01644736842105263,
    "rougeL_f": 0.08524590163934426,
    "meteor": 0.10054844606946982,
    "bleu1": 0.10316096088520757,
    "bleu2": 0.01193570720686852,
    "bleu3": 0.0027031510861808858,
    "bleu4": 0.001287705549748168,
    "bertscore_precision": 0.36250048875808716,
    "bertscore_recall": 0.41484498977661133,
    "bertscore_f1": 0.3869103491306305
  }
}