{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: L'ANGE HAIR Argan-Infused Round Brush | Lightweight & Ergonomic Design | 53MM Tourmaline Ceramic Barrel\nReview Date: 2022/08/21\nStore: L'ANGE HAIR\nAverage Rating: 4.8\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Shape': 'Round', 'Handle Material': 'Ceramic', 'Unit Count': '1.00 Count', 'Material': 'Ceramic', 'Package Dimensions': '12.32 x 4.76 x 3.58 inches; 5.29 Ounces', 'Item model number': '2456', 'UPC': '810108191339'}\nReview Text: These brushes are of excellent quality and comparable to Moroccan oil argon oil infused brushes. I own 2 of the 43 MM brushes and jumped on the 53 MM brush when I saw it was available. I love the Lange brushes I have but prefer larger barrels to give my long thin hair extra volume at the roots.  These brushes are great quality and deliver an excellent blow out. My hairs smooth and soft with minimal frizz and it stays that way throughout the day. Argan oil infused brushes have been a game changer with my wavy frizzy hair. While the price is high for some I can promise that it’s worth every cent and you won’t be disappointed.\nReview Title: Comparable to Moroccan Oil brushes\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "613 Lace Front Wigs Human Hair Blonde Body Wave Wigs 13x6 HD Transparent Lace Front Wigs Brazilian Virgin Human Hair 150% Density Pre Plucked with Baby Hair Blonde Lace Frontal Wig for Women (20 Inch Body Wave )\nVligcor\n{'Color': 'Brown', 'Material': 'Human', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Vligcor', 'Package Dimensions': '9.61 x 6.77 x 2.36 inches; 13.12 Ounces', 'UPC': '759784671967'}\nThis is the first time I’ve ever ordered a human hair wig and man what a difference. Every time I order a synthetic hair wig I’m disappointed. I didn’t have to pluck this, the hair line looks very natural. The hair is soft, it feels like it’s my own. My only complaint is that it’s a very yellow blonde but I knew that when I ordered it. I’m wondering if I could maybe use my purple shampoo on it and tone it to a more natural blonde. I don’t want to ruin it but I think I’m going to give it a try. Will keep you posted on my results and show a before and after!\nGorgeous wig\nBy Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nBy Terry\n{'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nI was skeptical about this but decided to give it a try anyways. To my surprise it works pretty well. I don’t wear foundation during the summer, only bronzer/blush and highlighter. My skin gets extremely oily and shiny by the end of the day. I put my bronzer and highlighter on and then applied this powder using a powder brush. I would only use the applicator inclosed with it if I had no other choice. I went out in my yard and watered all of my flowers, it was 80 degrees out so quite warm. Came back inside and looked in the mirror and my face was still matte. Went about the rest of my day which included a 2.5 mile walk with my family. When I went to wash the makeup off my face my nose was only slightly shiny, that’s it. I deducted a star because my skin gets pretty bronzed this time of year, it seemed like the powder washed my color out a little bit. It wasn’t a huge difference but enough to notice.\nWorks well\nL’ange Argan-Infused Round Brush | Lightweight & Ergonomic Design | 43MM Tourmaline Ceramic Barrel\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Color': 'Rose Gold, Black', 'Shape': 'Round', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Package Dimensions': '10.51 x 2.64 x 2.56 inches; 3.84 Ounces', 'UPC': '810108191223'}\nThis is my 2nd argon oil infused brush and I swear by these. My first one was made by Moroccan oil and I had it for years but it ended up cracking from heat. When I saw that Lange made them too I had to order this and I’m hoping it holds up better than the Moroccan brush. I love the light pink color. The brush is solid and high quality. When you blow out your hair with this brush it leaves your hair so soft and smooth. I have wavy frizzy hair and the argan infused brush is seriously a game changer. The price point is spot on. This Lange brush is worth every penny.\nSuch a great brush\nHempz Triple Moisture Hydrating Herbal Hand Creme, 4 oz\nHempz\n['We put hemp seed oil into everything we make, so you get vitamin E, amino acids, and omega fatty acids in every squeeze or swipe.']\n{'Product Dimensions': '2.13 x 1.38 x 7.25 inches; 4 Ounces', 'Item model number': '110-2758-03', 'UPC': '676280046580', 'Manufacturer': 'Hempz'}\nThus is a large tube, good for keeping in a end table or somewhere around the house. Too big for on the go. It smells nice and moisturizes my hands very well. It’s fast absorbing and not greasy at all. Great price and another great product from Hempz.\nNice size tube of cream\nBeauty Bakerie Lip Whip Liquid Metallic Lipstick, Long Lasting Lip Color, Smudge Proof Makeup, Berried, 3.5 mL\nBeauty Bakerie\n['Beauty Bakerie Berried metallic Lip whip is a metallic red liquid lipstick with hints of deep purple. It is long-lasting, smudge-proof and waterproof. Glides smoothly over lips, It is a weightless and non-sticky texture.']\n{'Brand': 'Beauty Bakerie', 'Color': 'Berried', 'Skin Type': 'All', 'Item Form': 'Liquid', 'Finish Type': 'Metallic', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.59 x 0.59 x 3.54 inches; 0.71 Ounces', 'Item model number': '754680458186', 'UPC': '754680458186', 'Manufacturer': 'Beauty Bakerie Cosmetics Brand'}\nThis is highly pigmented and you only need one coat. I personally think the color cinnamon roll is terrible but that doesn’t mean you won’t like it. It dries very quickly and that’s where it goes down hill. It starts to look dried out and cakey. Giving it 3 stars because it’s definitely smudge proof.\nHigh pigment but dries out\nL'ANGE HAIR Argan-Infused Round Brush | Lightweight & Ergonomic Design | 53MM Tourmaline Ceramic Barrel\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Shape': 'Round', 'Handle Material': 'Ceramic', 'Unit Count': '1.00 Count', 'Material': 'Ceramic', 'Package Dimensions': '12.32 x 4.76 x 3.58 inches; 5.29 Ounces', 'Item model number': '2456', 'UPC': '810108191339'}\nThese brushes are of excellent quality and comparable to Moroccan oil argon oil infused brushes. I own 2 of the 43 MM brushes and jumped on the 53 MM brush when I saw it was available. I love the Lange brushes I have but prefer larger barrels to give my long thin hair extra volume at the roots.  These brushes are great quality and deliver an excellent blow out. My hairs smooth and soft with minimal frizz and it stays that way throughout the day. Argan oil infused brushes have been a game changer with my wavy frizzy hair. While the price is high for some I can promise that it’s worth every cent and you won’t be disappointed.\nComparable to Moroccan Oil brushes",
  "profile": "**Updated User Profile Summary:**\n\n- **Preference for Quality:** The user continues to emphasize high-quality beauty essentials, particularly favoring products with natural ingredients and effective performance. They appreciate long-lasting formulas that are easy to use and suitable for diverse needs.\n- **Hair Type:** Retains a preference for wavy hairstyles in blonde shades, focusing on softness and a natural look; they also seek tools that enhance volume and manageability.\n- **Customization Interest:** Shows a strong desire for personalization in their beauty routine, embracing versatility in makeup and hair styling options.\n- **Skin Care Awareness:** Exhibits a keen understanding of skincare, especially oil control, and seeks products that maintain their natural skin tone while ensuring durability. They are critical of formulations that dry out or appear cakey.\n- **Positive Experience with Brands:** Maintains high satisfaction with reputable brands, showcasing their discerning nature through balanced reviews that highlight product performance.\n- **Engagement:** Actively engages in community discussions around beauty, sharing tips, recommendations, and experiences in the field.\n- **Color Sensitivity:** Remains attentive to color tones, favoring shades that complement their features while being open to exploring new options.\n- **Tool Preference:** Recently demonstrated a preference for high-quality hair tools, particularly those that enhance styling results while minimizing damage, further emphasizing their commitment to effective, premium beauty products.\n\nOverall, the user values high-quality, customizable beauty products and tools that effectively address skincare and styling needs while enjoying interaction with the beauty community.",
  "metrics": {
    "rouge1_f": 0.1588785046728972,
    "rouge2_f": 0.010920436817472701,
    "rougeL_f": 0.06853582554517133,
    "meteor": 0.05955334987593053,
    "bleu1": 0.013994276340294905,
    "bleu2": 0.002672932429160327,
    "bleu3": 0.0004505931738042317,
    "bleu4": 0.00018515573118299772,
    "bertscore_precision": 0.37982112169265747,
    "bertscore_recall": 0.4703075587749481,
    "bertscore_f1": 0.42024874687194824
  }
}