{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Rainbow - Stargazers DVD/Book\nReview Date: 2013/11/09\nStore: Rainbow  (Actor),     Abstract Sounds  (Director)    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Music Videos & Concerts\nAverage Rating: 3.8\nProduct Details: {'Format': 'NTSC', 'Contributor': 'Rainbow, Abstract Sounds', 'Number Of Discs': '4', 'Runtime': '4 hours', 'Publication Date': 'December 11, 2012', 'Package Dimensions': '11 x 11 x 0.6 inches; 2.15 Pounds', 'Director': 'Abstract Sounds', 'Media Format': 'NTSC', 'Run time': '4 hours', 'Release date': 'December 11, 2012', 'Actors': 'Rainbow', 'Studio': 'Abstract Sounds Book', 'Number of discs': '4'}\nReview Text: JUST GOT THIS DVD and book set in,it's ' very entertaining and gives you a good on-site on one of the best guitarist God's there is, and all about the great late Ronnie James DUO and  the Late  greatest drummer Cozy Powell. The book and DVD set is well worth reading and watching for any true Rainbow fan.\nReview Title: Great book and dvd set\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Rich Man, Poor Man: The Complete Collection\nPeter Strauss  (Actor),     Nick Nolte  (Actor),     David Greene  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', \"The first-ever dramatic miniseries to appear on American television, the multi-award winning RICH MAN, POOR MAN spans decades and generations to trace the epic story of the Jordache family from 1945 to the late 1960s.Now available for the first time on DVD, RICH MAN, POOR MAN: THE COMPLETE COLLECTION brings together all 34 episodes from Book I and II of this classic '70s series. Based on Irwin Shaw's best-selling novel and featuring an all-star cast (including Edward Asner, Bill Bixby, Susan Blakely, and Robert Reed), the series focuses in particular on Rudy Jordache (Peter Strauss) and his troubled brother Tom (Nick Nolte) as they navigate divergent paths away from their impoverished immigrant upbringing. While ambitious Rudy seems destined for success, Tom suffers from an endless string of bad luck but in the end, finds love. Encompassing a period of tremendous social and political upheaval, the Jordache saga explores timeless themes such as the difficulty of human relationships and the disillusionment of the American dream.An absorbing and masterful portrait of a fascinating and ill-fated family, RICH MAN, POOR MAN: THE COMPLETE COLLECTION recaptures a landmark moment in American broadcasting history.BONUS FEATURE: Brand-new audio commentary for Book I: Chapter 1 featuring star Peter Strauss and television historian David Bianculli\", 'Amazon.com', 'Rich Man, Poor Man', 'may not have been the first miniseries, but its success in 1976 gave the format legs and set the template for many that followed: based on a popular book, starring new faces but surrounded by familiar stars, with a panoramic sweep that juxtaposes personal trials against historical events.', 'Book I', 'of', 'Rich Man, Poor Man', 'follows the ups and downs of the Jordache brothers--Rudy (Peter Strauss,', 'Masada', ') and Tom (Nick Nolte,', '48 Hours', \")--starting at the close of World War II through to the late '60s. Allusions to race relations, the Rosenberg trials, and other topical issues provide a backdrop to the tumultuous soap opera of these two men and Julie Prescott (Susan Blakely,\", 'The Towering Inferno', \"), Rudy's high-school sweetheart and eventually his wife. Rudy's ambition leads him into politics, Tom struggles as a prizefighter and has children with a couple of women, and Julie falls into an unhappy marriage, a career in journalism, and alcoholism. Probably the most interesting aspect of\", 'Rich Man, Poor Man', \"for today's audiences is its sexual honesty; it's hard to imagine anything on contemporary broadcast television being as frank about women's desires and the instability of marriages (though cable series like\", 'Mad Men', 'have picked up that lead--in fact,', 'Mad Men', 'owes a considerable debt to', 'Rich Man, Poor Man', \"). It's no surprise that Nolte was the breakout star from the series; the rest of the cast varies from a bit wooden to solidly capable, but Nolte's energy and spontaneity--not to mention his six-pack abs!--pop out.\", 'The success of', 'Rich Man, Poor Man', 'led to', 'Rich Man, Poor Man: Book II', \", also included on this DVD set; almost twice as long, this second miniseries suffers from the absence of Nolte and from being more distanced from the source material. While Irwin Shaw's novel isn't great literature, he captures the rough chaos of life;\", 'Rich Man, Poor Man', \"changed much of the book's plot and characters but held on to the fundamental grit.\", 'Book II', \", which tried to replicate the two-brothers-on-different-tracks formula by following Tom's son Wesley and Julie's son Billy, feels melodramatic and half-baked. Still, it has its moments and features the ongoing malevolence of William Smith as the series' dominant villain, Falconetti--a character who made such an impression that the actor was harassed on the street by the miniseries' fans. All in all, worthwhile for the original\", 'Rich Man, Poor Man', ', which also features Ed Asner, Bill Bixby, Robert Reed (of', 'The Brady Bunch', '), Ray Milland (Oscar winner for', 'The Lost Weekend', '), film noir icon Gloria Grahame, and many others.', '--Bret Fetzer']\n{'Genre': 'Romance', 'Format': 'Multiple Formats, Color, Box set, NTSC, Miniseries', 'Contributor': 'David Greene, Susan Blakely, Nick Nolte, Edward Asner, Peter Strauss', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '9', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.48 x 1.39 x 7.65 inches; 10.56 Ounces', 'Director': 'David Greene', 'Media Format': 'Multiple Formats, Color, Box set, NTSC, Miniseries', 'Run time': '26 hours and 44 minutes', 'Release date': 'September 28, 2010', 'Actors': 'Peter Strauss, Nick Nolte, Susan Blakely, Edward Asner', 'Studio': 'A&E HOME VIDEO', 'Number of discs': '9'}\nI have waited  for every for this DVD to come  out, I watched  it as a teenage and loved it. I would check every month on line to see if it was out on DVD or even VHS just so I could have a copy of it and watch and again  and sience they never showed it on TV as a rerun. I thank it was one of the best Mimi Seriers that was ever made besides Gone with the Wind,and Roots. I can can still remember every little thing detail of the movie even after all these years. it is a must for the movie buff.This movie movie will have you on the edge of your seat at some and cring at others, It is a a the perfect gift for the movie buff in your family, my husband is getting it for me he just does'nt know it yet. you wont be disapointed in it If it can leave leave a very lasting remembering mark om a 13 or 14 tear old teenager you know hnow ot has to be a good movie with a good plot  and I love my nini  seriers . I have over 2000 movies and i still love that one . so go buy it soon toy wont regret it!!!!!\nRich Man Poor Man\nWiseguy: The Collector's Edition (Seasons 1- 4)\nKen Wahl  (Actor),     Jonathan Banks  (Actor),     Various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['NEW LOWER PRICE!!', \"His first wrong move will be his last - 67 Episode Set - Including 3 Unaired, Never Released Episodes!  Long before Donnie Brasco brought similar drama to the big screen, Golden Globe® winner Ken Wahl brought charisma, credibility and chutzpah to his small-screen role as Vincent Terranova, a handsome 30-year-old agent with the FBI's Organized Crime Bureau. The special Collector's Set presents 67 episodes that span the series' highly successful 4 season run on 13 DVDs! Also included are 3 unaired, never before seen episodes from the show's final season.  How does a deep-cover operative keep his sanity and morality intact when the criminal lifestyle he's sworn to bring down from within is more compelling than his own? Federal Agent Vincent Terranova (Ken Wahl) is plagued by the question in this innovative take on 80s cop dramas. Created by veteran hit producer Stephen J. Cannell, Wiseguy veers from traditional 'bad guy of the week' police procedural by breaking the drama into multi-episode story arcs that followed an Organized Crimes Bureau case - and its charismatic criminal suspects - to its logical conclusion. No matter the cost to criminal, victim, or cop.\", 'FEATURING:', 'Ken Wahl, Jonathan Banks, Jim Byrnes', 'Guest Starring:', 'Kevin Spacey, Michael Chiklis, Tim Curry, Jerry Lewis, David Strathairn and many more!', 'Popular Story Arcs:', 'Sonny Steelgrave - Guest starring Ray Sharkey', 'Sonny Steelgrave - Guest starring Ray Sharkey', 'Mel Profitt - Guest starring Kevin Spacey, Joan Severance', 'Mel Profitt - Guest starring Kevin Spacey, Joan Severance', 'White Supremacy - Guest starring Fred Thompson, Gerald Anthony', 'White Supremacy - Guest starring Fred Thompson, Gerald Anthony', 'Garment Trade - Guest starring Ron Silver, Jerry Lewis, Stanley Tucci', 'Garment Trade - Guest starring Ron Silver, Jerry Lewis, Stanley Tucci', 'Mafia Wars - Robert Davi, George O. Petrie', 'Mafia Wars - Robert Davi, George O. Petrie', 'Washington, DC Economics', 'Washington, DC Economics', 'Lynchboro/Seattle - Guest starring David Strathairn', 'Lynchboro/Seattle - Guest starring David Strathairn', 'Guzman/New York DA - Guest starring Steven Bauer, Billy Dee Williams', 'Guzman/New York DA - Guest starring Steven Bauer, Billy Dee Williams']\n{'Genre': 'Drama, Mystery & Thrillers', 'Format': \"Multiple Formats, Box set, Collector's Edition, Color, NTSC, Full Screen\", 'Contributor': 'Jim Byrnes, Steven Bauer, Ken Wahl, Jonathan Banks, William Russ, Various', 'Language': 'Unqualified', 'Number Of Discs': '13', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.23 x 1.58 x 7.41 inches; 13.28 Ounces', 'Item model number': '07087', 'Director': 'Various', 'Media Format': \"Multiple Formats, Box set, Collector's Edition, Color, NTSC, Full Screen\", 'Run time': '51 hours', 'Release date': 'March 9, 2010', 'Actors': 'Ken Wahl, Jonathan Banks, Jim Byrnes, William Russ, Steven Bauer', 'Studio': 'Mill Creek Ent', 'Number of discs': '13'}\nIt's not worth it with out the dead dog record episodes, I would pay the extra money for the complete editions, Don't buy it if you don't wont the music and the dead dog episodes your just wasteing your money.\nWiseguy\nLost Girl: Season 2\nAnna Silk  (Actor),     Ksenia Solo  (Actor),     Steve DiMarco  (Director),     Robert Lieberman  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Product Description', \"Bo is a gorgeous renegade. An irresistible beauty. And a deadly succubus. For years, she had no idea what she was or why every new lover died in the throes of passion. She fled one corpse after another until a chance encounter with the puckish thief Kenzi exposed Bo's existence to the clandestine order of the Fae. This ancient society of supernatural freaks exists outside the realm of mere mortals. Within their world, there are only two sides: Light and Dark. Each member of the Fae must choose who they will serve. But not Bo. Driven to understand her own aura of desire, Bo vows to live on her own terms - even if it means existing in the abyss between good and evil. With the help of the mischievous, but loyal, Kenzi and the handsome shape-shifter Dyson, Bo will use her powers of seduction to unravel the riddle of her mysterious past.\", 'Set Contains:', 'Uncut - featuring footage not seen on SYFY', 'Uncut - featuring footage not seen on SYFY', '60 minutes of extras featuring cast interviews, Making of Lost Girl featurettes, and bloopers', '60 minutes of extras featuring cast interviews, Making of Lost Girl featurettes, and bloopers', 'Episodes may be watched in English subtitles for the hearing impaired', 'Episodes may be watched in English subtitles for the hearing impaired']\n{'Genre': 'Television, Horror/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Clark Johnson, Ksenia Solo, Anna Silk, Steve DiMarco, Kris Holden-Ried, Richard Howland, Lynne Stopkewich, David Greene, Lee Rose, Robert Lieberman, George Mihalka, Paul Fox, Zoie Palmer, K. C. Collins, Gail HarveyClark Johnson, Ksenia Solo, Anna Silk, Steve DiMarco, Kris Holden-Ried, Richard Howland, Lynne Stopkewich, David Greene, Lee Rose, Robert Lieberman, George Mihalka, Paul Fox, Zoie Palmer, K. C. Collins, Gail Harvey   See more', 'Language': 'English', 'Number Of Discs': '8', 'Aspect Ratio': '1.77:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.4 Ounces', 'Item model number': '26346674', 'Director': 'Steve DiMarco, Robert Lieberman, George Mihalka, Clark Johnson, Gail Harvey', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '16 hours and 8 minutes', 'Release date': 'November 13, 2012', 'Actors': 'Anna Silk, Ksenia Solo, Kris Holden-Ried, Richard Howland, Zoie Palmer', 'Subtitles': 'English', 'Studio': 'Giant Ape', 'Country of Origin': 'USA', 'Number of discs': '8'}\nWhy pay the high price for The. DVD WHEN YOU CAN BUY T H E BLUE RAY DVD four less 10.00 cheaper then the rev. DVD. I GET ALL MY DVD FROM AMAZON AND HAVE NEVER HAVE A PROBLEM WITH THEN AND IF I did they fix it right then I just don't under stand why the blue ray is over 10.00 more then a blue ray of LOST GIRL SEASON SEASON 2 and SEASON 1 was only  like2 22.99 for the plan DVD AND SEASON 2 is IS over 44.00 and the blue ray is like 25 to 29 dollars. To me there seems to be something wrong with this.\nLOst girl\nThe Hardy Boys Nancy Drew Mysteries: Season Two\nParker Stevenson  (Actor),     Shaun Cassidy  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Mystery & Suspense\n['It\\'s the world\\'s greatest teen super-sleuths to the rescue as Nancy Drew and the Hardy Boys return in 22 hour-long episodes of The Hardy Boys Nancy Drew Mysteries: Season Two! Based on the hugely popular books and starring teen idols Shaun Cassidy, Parker Stevenson and Pamela Sue Martin, these thrilling episodes follow the determined detectives on spooky mysteries in Dracula\\'s Castle, at Mardi Gras in New Orleans and even in the Bermuda Triangle! Contributing to the fun and excitement are seven hit songs from Shaun Cassidy that made him a pop music sensation, including \"That\\'s Rock \\'N Roll\" and \"Hey Deanie.\" Also, along for the chase in Season Two are such special guest stars as Casey Kasem, Rick Springfield, Melanie Griffith and Valerie Bertinelli. Follow the clues to fantastic music and adventures with TV\\'s most famous teenage detectives!Bonus Content:', 'Disc 5 - The Hardy Boys Nancy Drew Mysteries Season One:', \"America's Top Sleuths\", \"America's Top Sleuths\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': '2288128', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen, Subtitled', 'Run time': '17 hours and 45 minutes', 'Release date': 'June 12, 2007', 'Actors': 'Parker Stevenson, Shaun Cassidy, Pamela Sue Martin', 'Subtitles': 'English', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Mono)', 'Studio': 'Studio Distribution Services', 'Number of discs': '5'}\nThey did not bother to let you know you was buying used DVD 's it never said anything about them being used and the DVD 's was' t even in the slots in the case when I got them and the corners of the box was peeled back and torn .\nUsed product\nSupernatural: Season 8\nJared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Supernatural: The Complete Eighth Season (DVD)', 'Sam and Dean have spent the last seven years battling the things that go bump in the night. Over the years, with the help of fallen-angel Castiel, and the King of Hell, Crowley, the Winchesters have straddled the line between good and evil. Last season, the boys encountered their worst enemy yet, Leviathan, a seemingly unkillable foe that, in the end, left Dean and Castiel stranded in Purgatory and Sam alone. Although Castiel is nowhere to be found, Dean manages a seemingly impossible escape from Purgatory – but not alone. He’s returned with a mysterious comrade-in-arms whose reason for escape is more than Dean bargained for. Meanwhile, Sam finds himself reconciling the life he rediscovered with Dean’s sudden reappearance. As the boys struggle with their unexpected reunion, they make a shocking discovery that could lead them on a deeply personal mission to settle old scores.', ']]>']\n{'Genre': 'Drama, Horror, Action & Adventure', 'Format': 'AC-3, Multiple Formats, Box set, NTSC, Color, Dolby, Subtitled, Widescreen', 'Contributor': 'Jared Padalecki, Jensen Ackles', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '1 x 5.4 x 7.6 inches; 8 Ounces', 'Item model number': '147594', 'Media Format': 'Multiple Formats, AC-3, Color, Box set, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 29 minutes', 'Release date': 'September 10, 2013', 'Actors': 'Jared Padalecki, Jensen Ackles', 'Subtitles': 'Spanish, Portuguese, Mandarin Chinese, French, Korean, Thai', 'Studio': 'Studio Distribution Services', 'Number of discs': '6'}\nAnyone who loves supernatural will love this the gag reel is so funny it is one of the best parts\nGreat show\nRainbow - Stargazers DVD/Book\nRainbow  (Actor),     Abstract Sounds  (Director)    Format: DVD\nMovies & TV, Genre for Featured Categories, Music Videos & Concerts\n{'Format': 'NTSC', 'Contributor': 'Rainbow, Abstract Sounds', 'Number Of Discs': '4', 'Runtime': '4 hours', 'Publication Date': 'December 11, 2012', 'Package Dimensions': '11 x 11 x 0.6 inches; 2.15 Pounds', 'Director': 'Abstract Sounds', 'Media Format': 'NTSC', 'Run time': '4 hours', 'Release date': 'December 11, 2012', 'Actors': 'Rainbow', 'Studio': 'Abstract Sounds Book', 'Number of discs': '4'}\nJUST GOT THIS DVD and book set in,it's ' very entertaining and gives you a good on-site on one of the best guitarist God's there is, and all about the great late Ronnie James DUO and  the Late  greatest drummer Cozy Powell. The book and DVD set is well worth reading and watching for any true Rainbow fan.\nGreat book and dvd set",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interest:** Historical drama miniseries, particularly those with significant emotional depth and character development.\n- **Nostalgia for Classic Television:** Shows from the 70s and 80s hold a special place, valuing productions that have significantly impacted television history.\n- **Appreciation for Family Dynamics:** Enjoys narratives that explore family relationships, personal struggles, and moral complexities.\n- **Critical of Modern Adaptations:** Often compares contemporary series unfavorably to classic narratives, emphasizing a strong preference for authenticity and depth in storytelling.\n- **Passionate Movie Buff:** Owns a vast collection (over 2000 movies) and favors thoughtful plotlines and character arcs.\n- **Strong Emotional Connection:** Prefers storytelling that evokes strong feelings and leaves a lasting impression.\n- **Social Viewing Experience:** Enjoys sharing beloved films with family, highlighting the social aspect of viewing.\n- **Recent Viewing Experience:** Recently engaged with a popular series, expressing enjoyment of its humor and entertainment value, showcasing an appreciation for character-driven narratives even in modern contexts.\n- **Value of Accessibility and Pricing:** Concerned about cost disparities in media formats, demonstrating a pragmatic approach to purchases while maintaining a focus on quality.\n- **Disappointment with Used Products:** Encountered issues with the quality of used media, emphasizing the importance of accurate representation in transactions.\n- **Interest in Music and Documentaries:** Recently purchased a DVD/book set that provides an insightful look into a significant musical figure, demonstrating a newfound appreciation for music documentaries alongside film.\n\nOverall, the user values storytelling that combines emotional engagement with quality, whether in classic series, modern narratives, or musical documentaries, while maintaining a critical eye on media purchases.",
  "metrics": {
    "rouge1_f": 0.08620135091669345,
    "rouge2_f": 0.011586739620212425,
    "rougeL_f": 0.04503055644901897,
    "meteor": 0.028909142694389062,
    "bleu1": 2.030214193797971e-05,
    "bleu2": 6.15003993224449e-06,
    "bleu3": 1.7153798586678458e-06,
    "bleu4": 5.098144563381819e-07,
    "bertscore_precision": 0.3786669671535492,
    "bertscore_recall": 0.5042487978935242,
    "bertscore_f1": 0.4325267970561981
  }
}