{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tombstone\nReview Date: 2018/01/30\nStore: Kurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Note :The opening scene is not a disc error .It was intentionally shot and presented in this format and aspect ratio as this was the directors vision for his film.A sizzling, star-studded cast brings to life the legendary battle to deliver justice to TOMBSTONE! Kurt Russell (MIRACLE, VANILLA SKY) turns in a gripping performance as U.S. Marshall Wyatt Earp and Val Kilmer (THE MISSING, BATMAN FOREVER) ignites the screen as the outrageous Doc Holliday. Together, they team up to bring law to the lawless in a notorious showdown with the ruthless outlaws at the O.K. Corral! The all-star ensemble also includes Sam Elliott, Bill Paxton, Dana Delany, Jason Priestley, Michael Biehn, and long-time Hollywood favorite Charlton Heston. Get ready for an explosive, action-packed adventure the Wild West would never forget!', 'Amazon.com', \"This Western has become a modest cult favorite since its release in 1993, when the film was met with mixed reviews but the performances of Kurt Russell (as Wyatt Earp) and especially Val Kilmer, for his memorably eccentric performance as the dying gunslinger Doc Holliday, garnered high praise. The movie opens with Wyatt Earp trying to put his violent past behind him, living happily in Tombstone with his brothers and the woman (Dana Delany) who puts his soul at ease. But a murderous gang called the Cowboys has burst on the scene, and Earp can't keep his gun belt off any longer. The plot sounds routine, and in many ways it is, but Western buffs won't mind a bit thanks to a fine cast and some well-handled action on the part of\", 'Rambo', 'director George P. Cosmatos, who has yet to make a better film than this.', '--Jeff Shannon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'RUSSELL, CORRAL, O.K., HOLIDAY, DOC, EARP, WYATT, Action/Adventure, KURT', 'Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Contributor': 'Charlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden ChurchCharlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden Church  See more', 'Language': 'Unqualified, French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': 'MFR717951000064#VG', 'Director': 'George P. Cosmatos', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Run time': '2 hours and 10 minutes', 'Release date': 'December 2, 1997', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Powers Boothe', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish', 'Studio': 'HOLLYWOOD PICTURES', 'Writers': 'Kevin Jarre', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I am not good at writing movie reviews, but this is one of my top ten favorite action Westerns.  My top one being Hildago if there is a comparison to be made.  I know it will be entertaining and enjoyed no matter what.\nReview Title: I am not good at writing movie reviews\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Last of the Summer Wine: Vintage 1985\nVarious  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['\"The world’s longest-running sitcom is back with more adventures from everyone’s favorite geriatrics! The year is 1985. Among many other things, Compo, Clegg and Foggy attempt to settle a question involving Nora Battys feet, an old mattress dumped in the countryside prompts Foggy to institute the Dewhirst Campaign for a Cleaner Countryside, and with the assistance of Comp & Clegg, Foggy sets out to show Digby’s donkey who\\'s the boss. \"']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Runtime': '4 hours and 59 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': '5957799', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '4 hours and 59 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nClean intelligent humor. I am so tired of during on the television to see and hear the subject matter that dominates the entertainment airwaves....sexually explicit themes, violence to the point of special effects to &#34; shock&#34; the already jaded mind, and other trash. The &#34; Last of the Summer Wine&#34; is one of the clearest funniest, most simply creative shows I have ever seen. Leave it to the English!\nCLEAN intelligent comedy. Not for many.\nLast of the Summer Wine: Vintage 1977 (Season 4) (Dbl DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Last of the Summer Wine: Vintage 1977 (Season 4) (Dbl DVD)', 'The picturesque Pennine village of Holmfirth in the Yorkshire Dales is the setting for this vintage comedy,which first began life in 1973. This is Brontë country miles and miles of unspoilt moorland and a breath-taking backdrop to the antics of our ageing delinquents and their demented friends.', ']]>']\n{'Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Runtime': '4 hours and 5 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 8.8 Ounces', 'Item model number': '883929023899', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Run time': '4 hours and 5 minutes', 'Release date': 'September 9, 2008', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nIf you hate camp dirty explicit American trash t.v. then you may enjoy a bit of clean English humor. Refreshing and intellectual.\nPro pure entertainment!\nLast of the Summer Wine: Vintage 1976 (Season 3) (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Last of the Summer Wine: Vintage 1976 (Season 3) (DVD)', 'The picturesque Pennine village of Holmfirth in the Yorkshire Dales is the setting for this vintage comedy, which first began life in 1973. This is Brontë country miles and miles of unspoilt moorland and a breath-taking backdrop to the antics of our ageing delinquents and their demented friends. Last of the Summer Wine has a strong ensemble cast of characters, though there has always been a central trio.', ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'Unqualified, English (Mono)', 'Runtime': '3 hours and 26 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '3707458', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC, Subtitled', 'Run time': '3 hours and 26 minutes', 'Release date': 'March 11, 2008', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '1'}\nI am almost afraid to rate this series five star. The American market limits the availability of this series hence the higher prices and low availability . I am collecting these and don't t want the competition.\nStick with your American \"drag \". Let the media manipulate your preferences.\nLast of the Summer Wine: Vintage 1979\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['The picturesque Pennine village of Holmfirth in the Yorkshire Dales is t he setting for this vintage comedy,which first began life in 1973. This is Brontë country miles and miles of unspoilt moorland and a breath-taking backdrop to the antics of our ageing delinquents and their demented friends.', ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.48 x 5.35 x 0.55 inches; 3.2 Ounces', 'Item model number': '883929069590', 'Director': 'Various', 'Media Format': 'Color, Full Screen, NTSC, Multiple Formats, Subtitled', 'Run time': '3 hours and 23 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Various', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 1.0), Unqualified', 'Studio': 'BBC Home Entertainment', 'Number of discs': '1'}\nIf you are of a younger or high fantasy generation. I am sure you won't get it. This is too pure and intelligent to squander on American entertainment.\nNot for the tainthearted.\nFoul Play\nGoldie Hawn  (Actor),     Chevy Chase  (Actor),     Colin Higgins  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Foul Play (DVD)', 'Beware of the Dwarf, whispers the hitchhiker to the beautiful librarian (Goldie Hawn) as he dies midway through a screening of This Gun Is Mine. Suddenly, Hawn is propelled into a world of wild chases, bizarre attemp ts on her life, and deadly encounters with an as sortment of weird under world characters. Academy Award winner Hawn teams with Chevy Chase (in h is first starring motion picture assi gnment) - and with hilarious resul ts. Chase plays the handsome San Francisco detective who becomes persona lly and professionally inv olved with all the off things happening to Ha wn. Costarring a pre-Arthur Dudley Moore in one of his most delightful c omic turns.', ']]>']\n{'Genre': 'Mystery & Suspense/Thrillers, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Ion Teodorescu, Marilyn Sokol, Rachel Roberts, Brian Dennehy, Pat Ast, Colin Higgins, Goldie Hawn, Burgess Meredith, Eugene Roche, Dudley Moore, Chuck McCann, Marc Lawrence, Cooper Huckabee, Chevy Chase, Billy Barty, Don Calfa, Bruce Solomon, John HancockIon Teodorescu, Marilyn Sokol, Rachel Roberts, Brian Dennehy, Pat Ast, Colin Higgins, Goldie Hawn, Burgess Meredith, Eugene Roche, Dudley Moore, Chuck McCann, Marc Lawrence, Cooper Huckabee, Chevy Chase, Billy Barty, Don Calfa, Bruce Solomon, John Hancock  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26341194', 'Director': 'Colin Higgins', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'November 16, 2004', 'Actors': 'Goldie Hawn, Chevy Chase, Burgess Meredith, Rachel Roberts, Eugene Roche', 'Studio': 'Paramount', 'Number of discs': '1'}\nFoul Play is one of the best movies that I have ever seen. It is clean and extremely funny!\nFive Stars\nComing To America\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Coming To America (DVD)', 'Coming to America casts comedian Eddie Murphy as pampered African prince Akeem, who rebels against an arranged marriage and heads to America to find a new bride. Murphy\\'s regal father (James Earl Jones) agrees to al low the prince 40 days to roam the U.S., sending the prince\\'s faithful r etainer Semmi (Arsenio Hall) along to make sure nothing untoward happens . To avoid fortune hunters, Prince Ak eem conceals his true identity and gets a \"Joe job\" at a fast-food restaurant. Murphy and Hall play multip le roles, and there are in numerable celebrity cameos peppered throughou t the proceedings — including the Duke Brothers (Don Ameche and Ralph Be llamy) from Tra ding Places. Coming to America made further headlines wh en humorist Art Buchwald sued the film\\'s producers for plagiarizing one of h is works. Buchwald carried the case to trial, where he won a sizeab le judgement against the film\\'s producers.', ']]>']\n{'Genre': 'Drama/Love & Romance, Comedy', 'Format': 'NTSC, Multiple Formats, Color, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '10393910', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Color, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'June 5, 2007', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nEddie Murphy and Arsenio Hall are so ingenious in this comedy.  It is one of my favorites!\nFive Stars\nM*A*S*H: The Complete Series + Movie\nAlan Alda  (Actor)    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Format': 'DVD', 'Contributor': 'Alan Alda', 'Language': 'English', 'Number Of Discs': '34', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.54 x 8.39 x 5.51 inches; 0.01 Ounces', 'Media Format': 'DVD', 'Actors': 'Alan Alda', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '34'}\nOh I can't say enough.  I am watching it right now.  This is my Mobius strip of a time that I am watching it.\nOh I can't say enough. I am watching it ...\nJesse Stone: Night Passage\nTom Selleck  (Actor),     Stephen Baldwin  (Actor),     Robert Harmon  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'A prequel to \"Stone Cold\" in the series of Jesse Stone novels by Robert B. Parker, the story picks up after Jesse Stone is fired from the Los Angeles Police Department. He becomes an unlikely candidate recruited by the town board of selectman to become police chief of Paradise, a small town on Boston\\'s North Shore. The board hopes his failed experience will keep him from digging too deep into the town\\'s secrets. Hungover on his first day on the job, he must investigate a domestic abuse case that ends up leaduing to a money laundering scheme perpetuated by a manager of a local bank.', 'Amazon.com', \"How Tom Selleck's world-weary cop Jesse Stone became the police chief of sleepy Paradise, Mass., is revealed in this engaging prequel to the first made-for-TV Stone feature,\", 'Stone Cold', \"(2005). Selleck is once again well cast as the rough-around-the-edges Stone, whose drinking problem gets him ejected from the Los Angeles police force; he soon finds himself the head lawman in a small New England fishing village, where his slow dissolution continues until a routine domestic disturbance case reveals connections to money laundering and murder, with several of the town's most affluent names as possible suspects. Selleck is well-matched by veteran scene stealer Saul Rubinek, and there's good work by Polly Shannon as a city attorney who becomes Stone's romantic interest, and Stephen Baldwin as an ill-tempered local. Fans of author Robert B. Parker (on whose books the Jesse Stone films are based) and Selleck won't be disappointed by this smart thriller.\", '--Paul Gaita']\n{'Genre': 'Drama, Mystery', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Polly Shannon, Sony Pictures Television, Tom Selleck, Steven J. Brandman, Stephen Baldwin, Kohl Sudduth, Viola Davis, Robert Harmon, Vito Rezza, Stephen McHattie, Saul Rubinek, Stephanie MarchPolly Shannon, Sony Pictures Television, Tom Selleck, Steven J. Brandman, Stephen Baldwin, Kohl Sudduth, Viola Davis, Robert Harmon, Vito Rezza, Stephen McHattie, Saul Rubinek, Stephanie March  See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2289013', 'Director': 'Robert Harmon', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'June 12, 2007', 'Actors': 'Tom Selleck, Stephen Baldwin, Stephanie March, Polly Shannon, Stephen McHattie', 'Dubbed': 'Thai, Portuguese, French', 'Subtitles': 'Thai, Mandarin Chinese, English, Portuguese, French, Spanish', 'Producers': 'Steven J. Brandman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIf you got this one get he rest.  From the start.\nFive Stars\nHidalgo (Widescreen Edition)\nViggo Mortensen  (Actor),     Omar Sharif  (Actor),     Joe Johnston  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"A sandstorm of epic proportions. A swarm of locusts so massive it obliterates the relentless sun. Deadly traps that defy imagination. These are just a few of the astonishing obstacles Frank T. Hopkins, the greatest long-distance racer ever, faces in the rousing action-adventure HIDALGO. Based on a true story and starring Viggo Mortensen (THE LORD OF THE RINGS Trilogy), Hopkins (Mortensen) and his mustang Hidalgo enter the ultimate extreme sport of its time -- the Ocean Of Fire. Underdogs challenging the finest Arabian horses and riders, they must not only survive the grueling race across 3,000 miles of the Arabian Desert's punishing terrain, but they must thwart the evil plots of competitors who vow victory at all costs! A great story of personal triumph, amazing special effects, and memorable characters make HIDALGO one of the most thrilling adventures ever.\", 'Review', '\" \\x91Hidalgo\\x92 is an old-fashioned saga with adventure writ large, grand vistas and a stalwart hero.\" --', 'USA Today/Claudia Puig', '\" \\x91Hidalgo\\x92 is the kind of sweeping epic adventure that reminds us why we love to go to the movies!\" --', 'Access Hollywood/Clay Smith', '\"A rousing action-adventure which confirms Viggo Mortensen is a star.\" --', 'Houston Chronicle/Bruce Westerbrook', '\"A welcome return to high adventure, the likes of which we haven\\x92t seen in a long time.\" --', 'Leonard Maltin/Hot Ticket', '\"Like \\x91Raiders of the Lost Ark\\x92 and \\x91The Mummy,\\x92 \\x91Hidalgo\\' is a rip-roaring adventure\\x85\" --', 'Daily Oklahoman/Brandy McDonnell']\n{'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'John Fusco, Viggo Mortensen, Said Taghmaoui, Omar Sharif, Silas Carson, J.K. Simmons, Adoni Maropis, Joe Johnston, Adam Alexi-Malle, Harsh Nayyar, Louise Lombard, Zuleikha RobinsonJohn Fusco, Viggo Mortensen, Said Taghmaoui, Omar Sharif, Silas Carson, J.K. Simmons, Adoni Maropis, Joe Johnston, Adam Alexi-Malle, Harsh Nayyar, Louise Lombard, Zuleikha Robinson  See more', 'Language': 'French, English (Dolby Digital 5.1), English (DTS ES), Spanish, Unqualified (DTS ES 6.1)', 'Runtime': '2 hours and 16 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Item model number': 'MFR786936228120#VG', 'Director': 'Joe Johnston', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 16 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Viggo Mortensen, Omar Sharif, Said Taghmaoui, Zuleikha Robinson, Louise Lombard', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'John Fusco', 'Number of discs': '1'}\nThis is my favorite all time movie, but when I tell people what my favorite movie is, I always get the named mixed up with the movie Silverado.  This movie has everything I like....beautiful horses, raging adventure,&#34; edge of your seat&#34; moments, and it is all clean.\nThis is my favorite all time movie\nHer Alibi [DVD]\nTom Selleck  (Actor),     Paulina Porizkova  (Actor),     Bruce Beresford  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product description', 'Her Alibi (Full Screen) [Import]', 'Amazon.com', \"To see why Tom Selleck's movie career has been a constant uphill battle, look no further than this tepid mystery/comedy from 1989. Selleck plays a successful mystery novelist who cures a persistent case of writer's block by visiting the courtroom trial of a young Romanian woman named Nina (played by late '80s supermodel Paulina Porizkova) who has been accused of murder. He supplies the alleged murderer with an alibi--she can claim she was having an affair with him at his Connecticut country home at the time of the murder--and then he brings her to Connecticut to make the alibi look legitimate. Is she in fact a killer? Did she serve poisoned casserole to a group of dinner guests? You'd have to be a major fan of Selleck or Porizkova to want to find out what happens next, because despite a few light moments of engaging comedy this is the kind of nonsensical fluff that quickly wears out its welcome.\", '--Jeff Shannon']\n{'Format': 'Closed-captioned, Color, Dolby, DVD, NTSC, Full Screen', 'Contributor': 'Patrick Wayne, Tom Selleck, Victor Argo, Jane Welch, Bill Smitrovich, Tess Harper, Bruce Beresford, William Daniels, Hurd Hatfield, James Farentino, Charlie Peters, Bobo Lewis, Paulina Porizkova, Ronald GuttmanPatrick Wayne, Tom Selleck, Victor Argo, Jane Welch, Bill Smitrovich, Tess Harper, Bruce Beresford, William Daniels, Hurd Hatfield, James Farentino, Charlie Peters, Bobo Lewis, Paulina Porizkova, Ronald Guttman  See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Director': 'Bruce Beresford', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, NTSC, Full Screen', 'Run time': '1 hour and 34 minutes', 'Release date': 'November 10, 1998', 'Actors': 'Tom Selleck, Paulina Porizkova, William Daniels, James Farentino, Hurd Hatfield', 'Subtitles': 'English', 'Studio': 'Warner Home Video', 'Writers': 'Charlie Peters', 'Number of discs': '1'}\nTom Selleck at his finest!  I have watched almost everything that Tom Selleck has acted in including the Jesse Stone series.  This is my utmost favorite movie with him.  It is too bad he took on such serious roles in most of his other films, he is an extremely funny man with his facial expressions and demeanor. Anyway, this is a great comedy. The movie is a must see!\nTom Selleck at his finest! I have watched almost everything that Tom Selleck ...\nThe Reluctant Saint\nArnoldo Foa  (Actor),     Maximillian Schell  (Actor),     Edward Dmytryk  (Director, Producer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['The story of the simple peasant boy who became known as Saint Joseph of Cupertino stars acclaimed Academy Award -winner Maximilian Schell (1961, Best Actor, Judgment at Nuremberg) as Giuseppe Desa, thought of by many as the village idiot. At a time when scholars filled the ranks of the monastery, Giuseppe longed to be a priest, and his devotion eventually won him a place among the Franciscans at Otranto, where he continued to struggle to meet the ideal. Only when Giuseppe is exiled to the stables does his true nature become recognized by another former peasant-turned-Bishop (played by Akim Tamiroff, Touch of Evil). The young priest\\'s faith was so great that he began to have visions and levitated during prayer, feats which would \"elevate\" him to sainthood. Directed by Edward Dmytryk (The Caine Mutiny, Crossfire), written by John Fante and Joseph Petracca and featuring Ricardo Montalban (Border Incident and TV\\'s \"Fantasy Island\"). Newly remastered.']\n{'Genre': 'Drama', 'Format': 'NTSC, Black & White', 'Contributor': 'Lea Padovani, Ricardo Montalban, Edward Dmytryk, Harold Goldblatt, Akim Tamiroff, Maximillian Schell, Arnoldo FoaLea Padovani, Ricardo Montalban, Edward Dmytryk, Harold Goldblatt, Akim Tamiroff, Maximillian Schell, Arnoldo Foa  See more', 'Language': 'English', 'Runtime': '1 hour', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Edward Dmytryk', 'Media Format': 'NTSC, Black & White', 'Run time': '1 hour', 'Release date': 'May 4, 2011', 'Actors': 'Arnoldo Foa, Maximillian Schell, Lea Padovani, Akim Tamiroff, Harold Goldblatt', 'Producers': 'Edward Dmytryk', 'Studio': 'SPE', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI wish I could do a remake of this movie.  It would probably destroy some beautiful integrity of the film if I had the money to do it.<br />This is an incredible and true story of one man who God used as an avenue of faith.<br />The character is a simple man who seems to be humanly cursed and suffer much perescution, but he is obviously favored by God.<br />This is a clean and inspirational film. I personally think there is not much like this anymore in the way of classic film. It was worthy of an award.\nA Real Miracle\nTombstone\nKurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Note :The opening scene is not a disc error .It was intentionally shot and presented in this format and aspect ratio as this was the directors vision for his film.A sizzling, star-studded cast brings to life the legendary battle to deliver justice to TOMBSTONE! Kurt Russell (MIRACLE, VANILLA SKY) turns in a gripping performance as U.S. Marshall Wyatt Earp and Val Kilmer (THE MISSING, BATMAN FOREVER) ignites the screen as the outrageous Doc Holliday. Together, they team up to bring law to the lawless in a notorious showdown with the ruthless outlaws at the O.K. Corral! The all-star ensemble also includes Sam Elliott, Bill Paxton, Dana Delany, Jason Priestley, Michael Biehn, and long-time Hollywood favorite Charlton Heston. Get ready for an explosive, action-packed adventure the Wild West would never forget!', 'Amazon.com', \"This Western has become a modest cult favorite since its release in 1993, when the film was met with mixed reviews but the performances of Kurt Russell (as Wyatt Earp) and especially Val Kilmer, for his memorably eccentric performance as the dying gunslinger Doc Holliday, garnered high praise. The movie opens with Wyatt Earp trying to put his violent past behind him, living happily in Tombstone with his brothers and the woman (Dana Delany) who puts his soul at ease. But a murderous gang called the Cowboys has burst on the scene, and Earp can't keep his gun belt off any longer. The plot sounds routine, and in many ways it is, but Western buffs won't mind a bit thanks to a fine cast and some well-handled action on the part of\", 'Rambo', 'director George P. Cosmatos, who has yet to make a better film than this.', '--Jeff Shannon']\n{'Genre': 'RUSSELL, CORRAL, O.K., HOLIDAY, DOC, EARP, WYATT, Action/Adventure, KURT', 'Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Contributor': 'Charlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden ChurchCharlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden Church  See more', 'Language': 'Unqualified, French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': 'MFR717951000064#VG', 'Director': 'George P. Cosmatos', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Run time': '2 hours and 10 minutes', 'Release date': 'December 2, 1997', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Powers Boothe', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish', 'Studio': 'HOLLYWOOD PICTURES', 'Writers': 'Kevin Jarre', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI am not good at writing movie reviews, but this is one of my top ten favorite action Westerns.  My top one being Hildago if there is a comparison to be made.  I know it will be entertaining and enjoyed no matter what.\nI am not good at writing movie reviews",
  "actual_interaction": {
    "rating": 5.0,
    "title": "I am not good at writing movie reviews",
    "text": "I am not good at writing movie reviews, but this is one of my top ten favorite action Westerns.  My top one being Hildago if there is a comparison to be made.  I know it will be entertaining and enjoyed no matter what.",
    "images": [],
    "asin": "6304711905",
    "parent_asin": "6304711905",
    "user_id": "AEEFMGZPLL5SFSPYSXWDJXFSRTKA",
    "timestamp": "2018-01-30 03:00:28.549000",
    "helpful_vote": 2,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Tombstone",
    "average_rating": 4.8,
    "rating_number": 50256,
    "features": [],
    "description": [
      "Product Description",
      "Note :The opening scene is not a disc error .It was intentionally shot and presented in this format and aspect ratio as this was the directors vision for his film.A sizzling, star-studded cast brings to life the legendary battle to deliver justice to TOMBSTONE! Kurt Russell (MIRACLE, VANILLA SKY) turns in a gripping performance as U.S. Marshall Wyatt Earp and Val Kilmer (THE MISSING, BATMAN FOREVER) ignites the screen as the outrageous Doc Holliday. Together, they team up to bring law to the lawless in a notorious showdown with the ruthless outlaws at the O.K. Corral! The all-star ensemble also includes Sam Elliott, Bill Paxton, Dana Delany, Jason Priestley, Michael Biehn, and long-time Hollywood favorite Charlton Heston. Get ready for an explosive, action-packed adventure the Wild West would never forget!",
      "Amazon.com",
      "This Western has become a modest cult favorite since its release in 1993, when the film was met with mixed reviews but the performances of Kurt Russell (as Wyatt Earp) and especially Val Kilmer, for his memorably eccentric performance as the dying gunslinger Doc Holliday, garnered high praise. The movie opens with Wyatt Earp trying to put his violent past behind him, living happily in Tombstone with his brothers and the woman (Dana Delany) who puts his soul at ease. But a murderous gang called the Cowboys has burst on the scene, and Earp can't keep his gun belt off any longer. The plot sounds routine, and in many ways it is, but Western buffs won't mind a bit thanks to a fine cast and some well-handled action on the part of",
      "Rambo",
      "director George P. Cosmatos, who has yet to make a better film than this.",
      "--Jeff Shannon"
    ],
    "price": 6.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41Tnp8I0h2L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Tnp8I0h2L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81IEoICimpL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5132sqUYiEL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/5132sqUYiEL.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/91YLHXuu2ZL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31mqVdAirtL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/31mqVdAirtL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71fXSiH0xmL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Fast shipping",
        "url": "https://www.amazon.com/vdp/b7278fed9d094b50bcd0d0c3fd8a692b?ref=dp_vse_rvc_0",
        "user_id": "AEKZUNPNU2EOYUOLP7LV7PSH2VDA"
      }
    ],
    "store": "Kurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Action & Adventure"
    ],
    "details": {
      "Genre": "RUSSELL, CORRAL, O.K., HOLIDAY, DOC, EARP, WYATT, Action/Adventure, KURT",
      "Format": "Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed",
      "Contributor": "Charlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden ChurchCharlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden Church  See more",
      "Language": "Unqualified, French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)",
      "Runtime": "2 hours and 10 minutes",
      "Aspect Ratio": "2.35:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "7.5 x 5.38 x 0.6 inches; 2.72 Ounces",
      "Item model number": "MFR717951000064#VG",
      "Director": "George P. Cosmatos",
      "Media Format": "Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed",
      "Run time": "2 hours and 10 minutes",
      "Release date": "December 2, 1997",
      "Actors": "Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Powers Boothe",
      "Dubbed": "Spanish",
      "Subtitles": "Spanish",
      "Studio": "HOLLYWOOD PICTURES",
      "Writers": "Kevin Jarre",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}