{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mountain Falls Nourishing Nail Polish Remover for Natural Nails, with Vitamin E and Panthenol, 6 Fluid Ounce\nReview Date: 2019/09/30\nStore: Mountain Falls\nProduct Description: [\"Don't wait for your next spa day to treat yourself. Mountain Falls Nourishing Nail Polish Remover has been carefully formulated to quickly and gently care for your nails. The salon quality formula softens cuticles and contains Vitamin E. Quickly, easily, and gently returns nails to their natural healthy appearance. Our formula is free of Parabens, and Phthalates.\"]\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Mountain Falls', 'Item Form': 'Liquid', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '6.38 x 3 x 1.18 inches; 4.8 Ounces', 'Manufacturer': 'Vi-Jon'}\nReview Text: Great polish remover.  I used it to remove three coats of polish and it took it off with one swipe.  Recommended\nReview Title: Great remover\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Pet Silk Top Knot Gel (4 Ounce) - Pet Hair Gel for Taming Frizzy Hair & Controlling Flyaways – Dog Anti-Static Lotion Cream with Floral Fragrance – Eliminates Static Charges\nPET SILK\n{'Brand': 'PET SILK', 'Scent': 'Floral', 'Item Form': 'Lotion,Cream,Gel', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.76 x 2.76 x 2.56 inches; 4 Ounces', 'Item model number': '844854', 'UPC': '872429001513', 'Manufacturer': 'Pet Silk'}\nThis stuff is amazing!  I didn't even know such a product existed and was excited to try it when I found it.  My baby shih tzu has a top knot that's in the awkward stage where most will stay in a band or clip but the lower pieces fall down into her eyes.<br /><br />I applied a bit of this and all the hair is staying put, LOVE THIS SO MICH!  This tub will probably last me awhile but when it's gone I will be back to buy more.\nKeeps puppy and dog fly-away hairs firmly in their bands\nELEVEN EVER Electric Nail Drill, Professional Portable Nail File Drill Grinder Manicure Pedicure Tools for Polishing, Sanding, Removing Gel and Acrylic Nails (silver) … (silver) (ND-02black)\nELEVEN EVER\n{'Brand': 'ELEVEN EVER', 'Material': 'Aluminum', 'Power Source': 'Corded Electric', 'Maximum Rotational Speed': '30000 RPM', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.17 x 6.22 x 2.91 inches; 1.06 Pounds', 'UPC': '722943850534'}\nNice nail kit, very thorough on the selection of accessories.  Works great.\nLots of accessories\nN3 No Name Necessary Pore Minimizing Moisturizing Scented Long-Lasting Anti-aging and Hydrating Face Primer Spray – (200ml)\nNo Name Necessary\n{'Brand': 'No Name Necessary', 'Skin Type': 'Normal', 'Package Information': 'Bottle', 'Specialty': 'Moisturizing, Cruelty Free, Vegan', 'Unit Count': '1.0 Ounce', 'Package Dimensions': '7.6 x 1.8 x 1.5 inches; 11.99 Ounces'}\nGood primer.  It sprays on and feels a little sticky for about thirty seconds but then dries and feels smooth on your face.  Makeup goes on great and stays on really well.  Wish it had an SPF.  Recommended.\nNo SPF but keeps makeup in place great\nJOYYUM 1000W 2-in-1 Hot Air Spin Brush Styler Auto-rotating Negative Ionic Hair Curler Dryer Brush, 1 1/2 Inch and 2 Inch Brush Attachments, Lavander Fog\nJOYYUM\n{'Brand': 'JOYYUM', 'Material': 'Titanium', 'Power Source': 'Corded Electric', 'Special Feature': 'Comb, Portable, Massage, Hot', 'Recommended Uses For Product': 'Curling', 'Package Dimensions': '16.3 x 5.4 x 3.2 inches; 1.85 Pounds', 'UPC': '787414814279', 'Manufacturer': 'JOYYUM'}\nI have shorter hair and this worked really well for me,  I honestly wasn’t expecting that it was going to work in my shorter hair as the Barrel seems large but to the contrary it does a fabulous job.  Recommended\nA real time saver\nMountain Falls Advanced Formula Nail Polish Remover Pads with 96% Acetone, for Natural Nails, 10 Count\nMountain Falls\n{'Brand': 'Mountain Falls', 'Item Form': 'Pad', 'Item Weight': '0.01 Pounds', 'Unit Count': '10 Count'}\nVery handy and work great.  Took these on vacation recently and it was great to not need to take the bottle and worry about leakage.  Usually one pad will do all your nails but sometimes it takes a couple.  Recommended\nGreat for travel\nMountain Falls Nourishing Nail Polish Remover for Natural Nails, with Vitamin E and Panthenol, 6 Fluid Ounce\nMountain Falls\n[\"Don't wait for your next spa day to treat yourself. Mountain Falls Nourishing Nail Polish Remover has been carefully formulated to quickly and gently care for your nails. The salon quality formula softens cuticles and contains Vitamin E. Quickly, easily, and gently returns nails to their natural healthy appearance. Our formula is free of Parabens, and Phthalates.\"]\n{'Brand': 'Mountain Falls', 'Item Form': 'Liquid', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '6.38 x 3 x 1.18 inches; 4.8 Ounces', 'Manufacturer': 'Vi-Jon'}\nGreat polish remover.  I used it to remove three coats of polish and it took it off with one swipe.  Recommended\nGreat remover",
  "profile": "**User Summary:**\n\n- **Pet Care Enthusiast:** Maintains a strong focus on grooming products for pets, particularly for long-haired breeds like shih tzus, consistently seeking solutions to grooming challenges during transitional hair stages.\n- **Grooming Challenges:** Values high-performance products that control flyaways and maintain hairstyles, essential in grooming routines, with a growing interest in personal grooming tools that enhance efficiency.\n- **Fragrance Preference:** Enjoys floral scents, favoring pleasant fragrances in both pet care and personal grooming items.\n- **Buying Behavior:** Exhibits brand loyalty and appreciates products that deliver satisfactory experiences, influencing future purchasing decisions. Recent engagements reflect an interest in practical, nourishing beauty care items that facilitate effective routines.\n- **Expanded Interests:** Demonstrates a proactive approach to self-care, engaging with innovative products that streamline personal grooming processes while maintaining results.\n- **Values:** Prioritizes cruelty-free and vegan options, reinforcing a commitment to ethical and sustainable products across both pet and personal grooming routines.\n\nThis user emphasizes practicality and functionality in grooming essentials for both pets and themselves, showcasing a holistic approach to care. Their positive experience with effective beauty care products highlights a focus on utility and quality, further guiding their purchasing decisions while balancing aesthetics and performance in grooming practices.",
  "metrics": {
    "rouge1_f": 0.16551724137931034,
    "rouge2_f": 0.006912442396313363,
    "rougeL_f": 0.07816091954022987,
    "meteor": 0.06385285249065252,
    "bleu1": 0.022904630594457513,
    "bleu2": 0.0027046659986274097,
    "bleu3": 0.0006167139203458532,
    "bleu4": 0.00029478169461233844,
    "bertscore_precision": 0.3539004921913147,
    "bertscore_recall": 0.4460054039955139,
    "bertscore_f1": 0.39465025067329407
  }
}