{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/02/18\nAverage Rating: 3.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Love'], 'Producers': ['Allan Niblo'], 'Starring': ['Stephen Dorff', 'Eddie Griffin'], 'Studio': ['More to Explore']}\nReview Text: A simple film about \"under-achievers\"(ie: Hancock). Shown as a simple man with telekinesis using it as a petty tool rather than as a world shaking discovery. It makes sense when viewed metaphorically, though the film itself left a bit to be desired. The film does however show a bit of the life that many of the \"lower class\" are forced to endure...the 2 stars are for that and nothing more.\nReview Title: Are you tired of metaphors?\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Bleach Uncut Set 17 (DVD)\nVarious  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Anime\n['Product Description', 'Bleach Uncut Set 17 (DVD)', 'Ichigo and the Soul Reapers find themselves in a brutal battle against their own Zanpakuto, who are being controlled by Muramasa. But the chaos in the Seireitei is just one part of Muramasa’s plan. His true objective lies in the World of the Living, and Ichigo is the key to his achieving it!', ']]>', 'Amazon.com', 'The 17th set of the hit fantasy-adventure', 'Bleach', 'comprises the second half of the \"Zanpakuto Unknown Tales Arc\" (episodes 230 to 265), an anime-only storyline. The Zanpakuto is both the weapon of a Soul Reaper and the mirror of his personality and strength. The appearance of the Zanpakuto as independent warriors threw the Soul Society into chaos in the first half of the adventure, but a series of unexpected revelations throws new light on those events. Ichigo and the Soul Reaper Captains continue their battle against Muramasa, the leader of the revolt. Centuries ago, this eerie, serpentine manifestation was the Zanpakuto of Koga, an extraordinarily powerful member of the Kuchiki clan, the family Rukia and Byakuya belong to. But Koga fell prey to arrogance, and the punishment for his crimes has stretched over the ages to the present day, threatening Ichigo and his friends in both the Seireitei and Karakura Town. Although the unexpected shifts in the plot give an added frisson of excitement to the battles, many of these episodes feel padded. The challenges, declarations, and boasts that precede the duels, while an essential part of', 'Bleach', '(and historic samurai culture), get a bit repetitious in the first episodes. And in the later ones, the viewer begins to wonder just how much killing Muramasa takes. The story concludes with a declaration of the singular bond between a Soul Reaper and a Zanpakuto that transcends even a samurai\\'s link to his swords. For once, Ichigo and Zangetsu, Byakuya, and Senbonzakura agree. After this adventure, director Noriyuki Abe and his crew returned to the storyline of Tite Kubo\\'s original manga with the 50-episode \"Arrancar: Downfall\" arc. (Rated Teen: violence, violence against women, grotesque imagery, risqué humor)', '--Charles Solomon', \"(243. One-to-One Fight! Ichigo vs. Senbonzakura! 244. The Long Awaited… Kenpachi Appears! 245. Pursue Byakuya! The Confused Gotei Divisions! 246. Special Mission! Rescue Captain-Commander Yamamoto! 247. Deceived Shinigami! The World Collapse Crisis! 248. Dragon of Ice and Dragon of Flame! The Strongest Showdown! 249. Senbonzakura's Bankai! Offense and Defense of the Living World! 250. That Man, For the Sake of the Kuchiki! 251. Dark History! The Worst Shinigami Is Born! 252. Byakuya, the Truth Behind His Betrayal! 253. Muramasa's True Identity Revealed! 254. Byakuya and Renji, the 6th Division Returns! 255. Final Chapter: Zanpakutō Unknown Tales!)\"]\n{'Genre': 'Anime', 'Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English, Japanese', 'Number Of Discs': '3', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Run time': '5 hours and 10 minutes', 'Release date': 'June 11, 2013', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nSadly the aspect ratio is still 1.33:1 ...the anime changed to 16:9 during the Amagai Shusuke arc. (ep 168). Though it remains a great example of anime.\nBleach\nHarsh Realm : The Ultimate Mind Game - The Complete Series (Three-Disc Collector's Edition)\nScott Bairstow  (Actor),     D.B. Sweeney  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', \"After Lieutenant Tom Hobbes agrees to test the military's virtual reality war game, he discovers his only way out of the game's deadly world is to kill the top player. The complete series of Harsh Realm.\", 'Amazon.com', 'The dark and fantastic', 'Harsh Realm', ', a science fiction series about a war fought by flesh-and-blood humans trapped inside virtual reality, was launched by', 'The X-Files', 'creator Chris Carter in 1999 and died a regrettable, premature death on the Fox channel after three episodes. The remaining six shows found sanctuary on the FX network, and then', 'Harsh Realm', 'slipped into history, its wild story, based on a comic book, far from resolved. Perhaps', 'Harsh Realm', \"'s ratings failure had something to do with its broad similarities to the hugely popular\", 'The Matrix', \", released only a few months before, or, for that matter, David Cronenberg's 1999\", 'eXistenZ', ', in which characters fight for their lives inside a video game. Whatever the reason, enough time has passed to take an objective look at', 'Harsh Realm', ', and there is a lot to be admired in its high level of imagination, complex plotting, and cutting-edge production values.', 'Scott Bairstow stars as U.S. Army Lieutenant Tom Hobbes, a decorated hero who risked his life rescuing a buddy, Major Mel Waters (Max Martini), during a peacekeeping mission in the former Yugoslavia. Set to return to civilian life and marry his fiancée, Sophie (Samantha Mathis), Hobbes is summoned by a mysterious superior (Lance Henriksen) and asked to test-run', 'Harsh Realm', ', a virtual reality war game devised by the Pentagon. Once he begins, however, Hobbes is mentally imprisoned in the dangerous game (his body, along with those of hundreds of other \"volunteers,\" is cared for in a secret military hospital), where he is identified by other, desperate captives as the savior they\\'ve been awaiting. D.B. Sweeney is very good as another soldier, Mike Pinocchio, whose sense of mission is re-awakened by Hobbes and who becomes a partner in an endless effort to defeat a madman named Santiago (Terry O\\'Quinn), who rules', 'Harsh Realm', 'from within. As with', 'The X-Files', ', the nine episodes in this boxed set are each very striking on their own terms, with post-apocalyptic sets, constant surprises, and that special Chris Carter touch (fans of his', 'Millennium', 'will like', 'Harsh Realm', ', too) that makes every story look and feel like a collision of a nightmare and a crisis of faith.', '--Tom Keogh']\n{'Genre': 'Science Fiction', 'Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Contributor': \"Cameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane RedmondCameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane Redmond   See more\", 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Surround)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Media Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Run time': '6 hours and 27 minutes', 'Release date': 'August 24, 2004', 'Actors': \"Scott Bairstow, D.B. Sweeney, Terry O'Quinn, Rachel Hayward, Max Martini\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Home Entertainment', 'Writers': 'Chris Carter', 'Number of discs': '3'}\nA fight for dominance in a VR world. As always a sim-ple foray into technology. An analogy of human vices and virtues. A few episodes were good, a few weren't.\nA few episodes were good, a few weren't\nV: The Original Miniseries [Blu-ray]\nThomas Hill  (Actor),     Marc Singer  (Actor),     Kenneth Johnson  (Director)    &                   0                  more   Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Fifty spaceships, each three miles across, hover ominously above Earth's major cities. The Visitors that emerge are humanlike in appearance and extend the hand of friendship. Our planet's resources are just what these aliens need to survive. And for its future survival, unsuspecting humankind will need...a miracle! Kenneth Johnson's science-fiction spectacular mixes dynamic special effects with cliffhanger thrills. As fascist rule enslaves the globe, freedom fighters battle to save our species. Marc Singer heads an epic-sized cast of human defenders and -- behind sleek uniforms and benevolent behavior -- reptilian invaders. For unparalleled extraterrestrial excitement, the invaders of V are unstoppable.\"]\n{'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'NTSC, Widescreen', 'Contributor': 'Momo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patterson, Russell Enoch, Eric Johnston, Richard Lawson, Michael Swan, William Russ, Blair Tefkin, Michael Alldredge, Stephanie Faulkner, Marin May, Jason Bernard, Richard Herd, Hansford Rowe, Wiley Harker, Diane Civita, Evan Kim, Frank Ashmore, Curt Lowens, David Packer, Camila Ashlend, Faye Grant, Penelope Windust, Camila Ashland, George Morfogen, Mary Alan Hokanson, Stack Pierce, Howard K. Smith, Bonnie Bartlett, Rafael Campos, Josh Brooks, Thomas Hill, Jennifer Perito, Michael Bond, Jenny Neumann, Peter NelsonMomo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patters…  See more', 'Language': 'English', 'Runtime': '3 hours and 17 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Kenneth Johnson', 'Media Format': 'NTSC, Widescreen', 'Run time': '3 hours and 17 minutes', 'Release date': 'August 27, 2019', 'Actors': 'Thomas Hill, Marc Singer, Faye Grant, Jane Badler, Michael Durrell', 'Subtitles': 'English', 'Studio': 'Warner Archives', 'Country of Origin': 'USA', 'Number of discs': '1'}\nto remind of how terrible this show was...hehe. Nice video quality. Happy with the buy.\nHad to watch it again\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zander Weaver'], 'Producers': ['Elliot Weaver', 'Zander Weaver'], 'Starring': ['Tom England', 'Joshua Ford']}\nnot the worst movie ever...though an hour and 50 minutes of three dudes in a car is a bit chintzy...dialogue wasn't horrible, there was some suspense...though the ending was like the main body of the film...no substance.\nlowest...budget...ever\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Love'], 'Producers': ['Allan Niblo'], 'Starring': ['Stephen Dorff', 'Eddie Griffin'], 'Studio': ['More to Explore']}\nA simple film about \"under-achievers\"(ie: Hancock). Shown as a simple man with telekinesis using it as a petty tool rather than as a world shaking discovery. It makes sense when viewed metaphorically, though the film itself left a bit to be desired. The film does however show a bit of the life that many of the \"lower class\" are forced to endure...the 2 stars are for that and nothing more.\nAre you tired of metaphors?",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user maintains a strong focus on anime series, particularly within the fantasy-adventure and action genres, while continuing to explore science fiction narratives that engage with complex themes and technology.\n\n- **Content Preference:** The user prefers box sets and complete collections, committed to experiencing entire series with rich storylines that emphasize personal growth, moral dilemmas, and critical examination of technology and human nature.\n\n- **Review Behavior:** The user’s average rating has decreased to 4.3, reflecting a more discerning approach. Their latest interaction involved a low rating of 2.0 for a film that was critiqued for lacking substantial narrative depth, though it offered some metaphorical insights on lower-class struggles.\n\n- **Rating Patterns:** The user emphasizes narrative quality and critiques technical aspects. Their recent reviews highlight a growing disappointment in productions that fail to deliver engaging stories, underscoring their critical stance on narrative depth and substance.\n\n- **Engagement Style:** The user engages meaningfully, providing analytical feedback on themes—particularly regarding the intersection of technology and humanity. Their recent review reflects an ongoing expectation for higher standards in both storytelling and production quality.\n\nThe user remains dedicated to collecting and enjoying well-developed series, persisting in their balance of narrative critiques with an appreciation for effective technical execution that enhances overall viewing experiences.",
  "metrics": {
    "rouge1_f": 0.10861983059292477,
    "rouge2_f": 0.00798004987531172,
    "rougeL_f": 0.05480817140009966,
    "meteor": 0.03179166267779358,
    "bleu1": 7.929281567889688e-05,
    "bleu2": 2.373809163922002e-05,
    "bleu3": 3.425567389473956e-06,
    "bleu4": 1.302535254143465e-06,
    "bertscore_precision": 0.34741130471229553,
    "bertscore_recall": 0.49501511454582214,
    "bertscore_f1": 0.40828216075897217
  }
}