{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 3 Pieces Messy Donut Chignons Hair Piece Scrunchies Synthetic Extensions Updo Hair Bun for Women Scrunchies #12/24 Dark Blonde\nReview Date: 2020/08/15\nStore: SHINYSHOW\nAverage Rating: 3.9\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'SHINYSHOW', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.94 x 3.94 x 1.18 inches; 2.47 Ounces', 'UPC': '738630490303'}\nReview Text: Wow, I can’t love these enough!! 3 curly bun wraps to add so much volume to my bun!! I got compliments on my hair all day by so many people!! The dark blonde matched my hair perfectly. I’m sleepy surprised by the quality. These are thick and lays pretty! No hair fell out and it only took me 5mins to pull my hair up, make a fast bun, use this curly bun wrap, and pull out some of my front curls! Fast, easy, and professional polished look in an instant. HUGE FAN!! Love these!!!\nReview Title: Beautiful and Great Quality!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\nYRMJK\n{'Brand': 'YRMJK', 'Age Range (Description)': 'Adult', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 3.1 x 2.7 inches; 13.76 Ounces', 'UPC': '738426030676', 'Manufacturer': 'MUTTUS'}\n[[VIDEOID:b2565b535e1d3f3297ca6703d7f26383]] A tip for those would never used an electric toothbrush: put the toothbrush into your mouth and then turn on (and off before removing from mouth). Lol, I got toothpaste everywhere and learned this the hard way. Functionally, the vibrations are powerful by default, so if you are sensitive like me, turn it down. I’ve used it 4 times now and the first time it was strange, but now I am use to it. There are 5 different pulsating settings (see video). The plus and minus icons allow for easy and quick adjustment of how hard/soft - fast/slow the vibrating brush-head will pulsate. The bristles on the brush attachment is firm, but soft on gums; so there is some bend to the bristles and was comfortable for me. It sits on a charger to power it up via usb cord that plugs into standard charger plug. The case is beyond awesome. I travel for conferences and this stores the brush and charger with the brush head in a beautiful pink bottom and clear top hard case. Easy to pack and go. My teeth feels very clean after using this electronic toothbrush. For my set, I have 5 extra brush head attachments for exchanging after wearing out. This set looks exactly like advertised. I love the pink design. It is long and slender with sliver trim. My video will show the different settings and I hope you can hear the slight vibration changes because you could easily tell from the sound of the pulse by which setting it is on through a couple of uses. My favorite thing about it is that the charger is small and doesn’t take up any room on the sink countertop. The travel case is sturdy. The quality of this brush is so great that I don’t want to ever go back to a standard manual toothbrush. I highly recommend if you need a travel brush that is electronic! Update: A week later and I still love it! Everything works very well!!\nGreat travel toothbrush!\nPersephone Ombre Blonde Lace Front Wig Wavy Soft Brown Roots Ash Blonde Ombre Wigs for Women Glueless Long Wavy Synthetic Wig with Middle Parting Heat Resistant 22 Inches\nPersephone\n{'Color': 'Brown Roots Ash Blonde Ombre', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.7 x 6.2 x 2.3 inches; 14.39 Ounces', 'UPC': '708210345712'}\n[[VIDEOID:e6486dec3002b28b72d65864eaf95d53]] Y’all!!! I can’t give this wig enough stars! For the price, this is an outstanding wig - Persephone Ombré Blonde! Now, I cut the pace all the way back and place it about 1-2” behind my hairline, so I’ve pulled out my front hair to blend with the wig. It does have wig combs to keep it secure and, although it comes with an awesome wig cap, I do NOT wear a cap. Stays on securely all day. Great wig cap construction with adjustable straps to help custom to head. Didn’t tangle. Soft! Huge fan!! This is an outstanding wig and the price is a great value!!! L O V E !!\nLOVE!\nMiss U Hair Long Wavy Dyeing Color Wig Burgundy Ombre Blonde Cosplay Costume Wig\nM MISS U HAIR\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'M MISS U HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.2 x 8 x 1.7 inches; 11.36 Ounces'}\n[[VIDEOID:70e9f5c0d3612527c251dde5937efab3]] This Miss U Hair is just pass shoulder length with good curl. This is a good quality character, cosplay, or Halloween wig. Cap construction is good and comfy, but no combs to secure in place, so it did slide around on my head. It came with a wig cap. The part is fluffy and thick, as is the hair line, so I was unable to get a natural look from forehead to hairline, but for the function of Cosplay character, this is on the higher quality.\nNice for Cosplay purposes.\nSam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nSam&Helen\n{'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\n[[VIDEOID:f429642b52f8b0f5ebb4606cb77edc77]] I love these magnetic eyelashes. It’s so much easier than applying glue, in my opinion. I did two thin layers of magnetic eyeliner and allowed to dry. It did stick to my upper lid when I moved my eyelids up as I waited for them to dry. Once dry, I used the tweezer to apply the magnet eyelash. Each eyelash has tiny magnetics that adhere to the liner. I was pleasantly surprised that it worked!! The tweezers was not helpful to me for applying, and the second lash I applied with my hands without a problem. Beautiful lashes!! Wore them all day yesterday and wasn’t uncomfortable at all. Didn’t come off in the wind going to dinner. I simply removed with my hands to replace on the storage palette and removed liner with coconut oil. Lashes are glamorous and reusable. LOVE THEM!!!\nWorks great for all day wear!!!\nAokiya Short Blonde Bob Wig with Bangs Ombre Brown Wigs for Women Straight Synthetic Cosplay Wigs (14 Inch)\nAokiya\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Aokiya', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.1 x 6.5 x 2.3 inches; 8.01 Ounces'}\n[[VIDEOID:b006e218d4cd890bb0d873b2068e6133]] This is a very pretty light brown ombré to blonde, above the shoulders, bob-style wig. Better than I expected! I was expecting a cosplay type, but this is a very natural and great quality wig! It didn’t have combs in the cap construction, but the adjustment hook straps in the back nape is present for tightening. Feels silky soft. Hair moves beautifully! The part is not a free- part and it will show some wefts if altered. I wanted to see if I could create a side vs middle part and was not successful. Overall, I’m surprised at the quality and realness of the wig! I recommend!\nGreat natural looking wig!!\nSUIBOBO skincare pink rose quartz jade roller and Essential Oil bottle eye roller-real jade crystal gem stone marble cuarzo ice cold anti aging anti puff facial face roller eye roller massager\nSUIBOBO\n['√ In Time Service -there is instruction paper in the set to help you to use them.And as you know the squeak free jade quartz roller is fragile, easy to be damage in transit, though we pack it very carefully. If you receive the broken jade eye roller, please contact us for new one or full refund.this item is made from 100% natural quartz stone so each piece will little different on color']\n{'Package Dimensions': '7.1 x 3.5 x 1.7 inches; 8.01 Ounces', 'UPC': '619470980783', 'Manufacturer': 'HENNSERY CRAFT LIMITED'}\nAn adorable set: soft snap close holder, pink rose quartz facial roller, essential oil roller-ball bottle with rose quartz pieces, essential oil pour filter, and essential oil bottle opener. The essential oil bottle rolls a smooth amount of my favorite RoseHip Oil on my face to follow up with a relaxing rose quartz face roller. Beautiful set! Calms my sensitive skin.\nOutstanding set!!!\nEMMOR Long Ash Blonde Wig for Women - Natural Straight Hair With Air Bang Wigs, Party Cosplay Daily Use\nEMMOR\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.19 x 9.29 x 2.72 inches; 10.62 Ounces'}\nI was surprised by the wig for a cosplay variety. It is very shiny and staticky, but a sprinkle of powder will tone that shine. I did it fast and it definitely needs a bit more powder, but it did reduce shine for a more realistic hair wig. The cap construction is very nice, but there are NO combs or clips, which is common for a banged wig. I’m a 21” wig wearer and this fit me comfortably with my long/thick hair in a bun at the nape of my neck. Long! I’m 5’2-ish and this hit me lower back. I brushed this wig several times and ran a dryer sheet over it for static. No loose hairs yet. Overall, this does look wiggy with shine and static, but for a cosplay wig, it lays very naturally and moves well. Decent wig for a natural wear and excellent wig for a cosplay wear!\nGreat Cosplay Wig!\n3 Pieces Messy Donut Chignons Hair Piece Scrunchies Synthetic Extensions Updo Hair Bun for Women Scrunchies #12/24 Dark Blonde\nSHINYSHOW\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'SHINYSHOW', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.94 x 3.94 x 1.18 inches; 2.47 Ounces', 'UPC': '738630490303'}\nWow, I can’t love these enough!! 3 curly bun wraps to add so much volume to my bun!! I got compliments on my hair all day by so many people!! The dark blonde matched my hair perfectly. I’m sleepy surprised by the quality. These are thick and lays pretty! No hair fell out and it only took me 5mins to pull my hair up, make a fast bun, use this curly bun wrap, and pull out some of my front curls! Fast, easy, and professional polished look in an instant. HUGE FAN!! Love these!!!\nBeautiful and Great Quality!",
  "profile": "**User Summary:**\n\n- **Product Preference:** The user continues to show a strong interest in electronic dental care products for travel use and fashionable beauty accessories tailored for cosplay, including items like hair extensions. Their ongoing exploration of holistic beauty routines emphasizes a blend of functionality and aesthetics.\n\n- **Usage Experience:** They highlight ease of use and provide helpful tips for first-time users, drawing from diverse experiences with beauty products. The user remains committed to practicality, favoring effortless application methods.\n\n- **Design & Features:** Aesthetics are essential; they prefer sleek, stylish designs in colors such as pink. Products that enhance appearance while ensuring comfort are particularly appealing.\n\n- **Sensitivity Consideration:** Comfort is a priority, reflected in their preference for adjustable and secure beauty accessories that meet their standards of satisfaction.\n\n- **Maintenance & Quality:** They seek high-quality, durable brands known for easy upkeep, emphasizing longevity across product categories.\n\n- **Positive Engagement:** The user displays a positive outlook on product performance, as seen through their enthusiasm for effective beauty items and loyalty to trusted brands.\n\n- **Recommendation Behavior:** They are eager to recommend effective personal care and beauty solutions, remaining engaged with products that fit their lifestyle for everyday use and cosplay events. Their latest purchase reinforces their focus on achieving professional looks effortlessly, highlighting their practical yet stylish approach.",
  "metrics": {
    "rouge1_f": 0.10383991346673878,
    "rouge2_f": 0.006497022198159177,
    "rougeL_f": 0.05191995673336939,
    "meteor": 0.03715721163910404,
    "bleu1": 0.0005801303000245348,
    "bleu2": 0.0001268214796257287,
    "bleu3": 2.0762439136240567e-05,
    "bleu4": 8.408381487137522e-06,
    "bertscore_precision": 0.3576176166534424,
    "bertscore_recall": 0.4745374917984009,
    "bertscore_f1": 0.4078637659549713
  }
}