{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Persephone Ombre Blonde Lace Front Wig Wavy Soft Brown Roots Ash Blonde Ombre Wigs for Women Glueless Long Wavy Synthetic Wig with Middle Parting Heat Resistant 22 Inches\nReview Date: 2020/06/15\nStore: Persephone\nAverage Rating: 4.1\nProduct Details: {'Color': 'Brown Roots Ash Blonde Ombre', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.7 x 6.2 x 2.3 inches; 14.39 Ounces', 'UPC': '708210345712'}\nReview Text: [[VIDEOID:e6486dec3002b28b72d65864eaf95d53]] Y’all!!! I can’t give this wig enough stars! For the price, this is an outstanding wig - Persephone Ombré Blonde! Now, I cut the pace all the way back and place it about 1-2” behind my hairline, so I’ve pulled out my front hair to blend with the wig. It does have wig combs to keep it secure and, although it comes with an awesome wig cap, I do NOT wear a cap. Stays on securely all day. Great wig cap construction with adjustable straps to help custom to head. Didn’t tangle. Soft! Huge fan!! This is an outstanding wig and the price is a great value!!! L O V E !!\nReview Title: LOVE!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\nYRMJK\n{'Brand': 'YRMJK', 'Age Range (Description)': 'Adult', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 3.1 x 2.7 inches; 13.76 Ounces', 'UPC': '738426030676', 'Manufacturer': 'MUTTUS'}\n[[VIDEOID:b2565b535e1d3f3297ca6703d7f26383]] A tip for those would never used an electric toothbrush: put the toothbrush into your mouth and then turn on (and off before removing from mouth). Lol, I got toothpaste everywhere and learned this the hard way. Functionally, the vibrations are powerful by default, so if you are sensitive like me, turn it down. I’ve used it 4 times now and the first time it was strange, but now I am use to it. There are 5 different pulsating settings (see video). The plus and minus icons allow for easy and quick adjustment of how hard/soft - fast/slow the vibrating brush-head will pulsate. The bristles on the brush attachment is firm, but soft on gums; so there is some bend to the bristles and was comfortable for me. It sits on a charger to power it up via usb cord that plugs into standard charger plug. The case is beyond awesome. I travel for conferences and this stores the brush and charger with the brush head in a beautiful pink bottom and clear top hard case. Easy to pack and go. My teeth feels very clean after using this electronic toothbrush. For my set, I have 5 extra brush head attachments for exchanging after wearing out. This set looks exactly like advertised. I love the pink design. It is long and slender with sliver trim. My video will show the different settings and I hope you can hear the slight vibration changes because you could easily tell from the sound of the pulse by which setting it is on through a couple of uses. My favorite thing about it is that the charger is small and doesn’t take up any room on the sink countertop. The travel case is sturdy. The quality of this brush is so great that I don’t want to ever go back to a standard manual toothbrush. I highly recommend if you need a travel brush that is electronic! Update: A week later and I still love it! Everything works very well!!\nGreat travel toothbrush!\nPersephone Ombre Blonde Lace Front Wig Wavy Soft Brown Roots Ash Blonde Ombre Wigs for Women Glueless Long Wavy Synthetic Wig with Middle Parting Heat Resistant 22 Inches\nPersephone\n{'Color': 'Brown Roots Ash Blonde Ombre', 'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.7 x 6.2 x 2.3 inches; 14.39 Ounces', 'UPC': '708210345712'}\n[[VIDEOID:e6486dec3002b28b72d65864eaf95d53]] Y’all!!! I can’t give this wig enough stars! For the price, this is an outstanding wig - Persephone Ombré Blonde! Now, I cut the pace all the way back and place it about 1-2” behind my hairline, so I’ve pulled out my front hair to blend with the wig. It does have wig combs to keep it secure and, although it comes with an awesome wig cap, I do NOT wear a cap. Stays on securely all day. Great wig cap construction with adjustable straps to help custom to head. Didn’t tangle. Soft! Huge fan!! This is an outstanding wig and the price is a great value!!! L O V E !!\nLOVE!",
  "profile": "**User Summary:**\n\n- **Product Preference:** Strong inclination towards electronic dental care products designed for travel and convenience, now expanding to include fashionable hair accessories, particularly wigs.\n- **Usage Experience:** Values functionality and ease of use, as shown by their tips for first-time users in dental care and their experiences with hair products. They adapt well to product settings and features that enhance usability.\n- **Design & Features:** Attracted to aesthetic elements, particularly liking pink hues and sleek designs, and now appreciates stylish wigs that enhance personal appearance without compromising on comfort. \n- **Sensitivity Consideration:** Shows awareness of personal comfort, preferring adjustable settings for sensitivity in dental products, similar to the need for comfort in wig fit and wear.\n- **Maintenance & Quality:** Prioritizes brands that maintain high-quality standards and efficiency, with a focus on durability and ease of maintenance in both dental and hair products.\n- **Positive Engagement:** Demonstrates a positive attitude towards product performance over time, indicating satisfaction and likely brand loyalty across both electronic dental care and wig purchases.\n- **Recommendation Behavior:** Willingness to recommend products to others, suggesting high trust in quality and functionality in both categories.\n\nOverall, the user enjoys effective, aesthetically pleasing, and travel-friendly products that enhance personal care routines, whether through dental hygiene or stylish hair options.",
  "metrics": {
    "rouge1_f": 0.20282413350449294,
    "rouge2_f": 0.012870012870012871,
    "rougeL_f": 0.08472400513478819,
    "meteor": 0.089666951323655,
    "bleu1": 0.062446569329382334,
    "bleu2": 0.011059151032878639,
    "bleu3": 0.0020011507973521593,
    "bleu4": 0.0008520318092341224,
    "bertscore_precision": 0.35830849409103394,
    "bertscore_recall": 0.42259424924850464,
    "bertscore_f1": 0.3878052830696106
  }
}