{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MBA Renewing Retinol Serum, 1.7 fl. oz, 0.5% Retinol Hydrates & Brightens Skin's Appearance by Diminishing the Look of Breakouts, Hyperpigmentation, and Signs of Aging by Higher Education Skincare\nReview Date: 2020/08/03\nStore: Higher Education\nAverage Rating: 2.8\nProduct Details: {'Skin Type': 'All', 'Scent': 'Aloe', 'Brand': 'Higher Education', 'Item Form': 'Serum', 'Unit Count': '1.7 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.5 x 3.4 x 1.5 inches; 3.99 Ounces', 'UPC': '811381034009'}\nReview Text: Received July 23, 2020.<br /><br />I use this 2x a week in the evenings after applying hyaluronic serum. I've experienced no allergic reaction. I chose this because the retinol concentration (0.5%) isn't too high.<br /><br />This is the second Higher Education skin care product I've purchased that has a very short expiration period - expires in less than 2 months (Sep 2020). The first was the \"Grinding Away skin polishing scrub\" that expires in less than 3 months (Oct 2020).<br /><br />I'm really annoyed that Higher Education is stocking Amazon with old products. If I were paying full price for this, I would expect to receive \"fresh\" products - with at least a year before expiration. If I were purchasing this from a physical store, I'd give this back to the counter lady and just look for something else.<br /><br />One star for sending me an old product. Amazon, stop selling old products! Customers who paid full price for this - you should be returning the product.\nReview Title: expires in less than 2 months\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Higher Education Skincare: Goal Digger - Silky Moisturizing Cucumber Creme; formulated for dry and sensitive skin; cucumber extract; natural extract: melon, kale, cabbage, ginger, turmeric - 1.7 fl oz\nHigher Education\n{'Brand': 'Higher Education', 'Scent': 'Cucumber', 'Item Form': 'Creme', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.88 x 2.88 x 2.13 inches; 7.2 Ounces', 'UPC': '811381032050'}\nNice green color with a refreshing cucumber scent. This feels light, not greasy and yet is very effective at moisturizing skin. It's quickly absorbed by my skin. I like that it doesn't have any AHA or retinol so that I can use this day or night in combination with different serums.\nlight but very effective\nGrinding Away Skin Polishing Scrub, 3 fl. oz., Polishing Scrub Works to Improve Skin's Texture and Tone by Buffing Away Dead Skin Cells by Higher Education Skincare\nHigher Education\n{'Brand': 'Higher Education', 'Skin Type': 'All', 'Product Benefits': 'Smoother', 'Material Feature': 'Gluten Free, Cruelty Free', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.59 x 3.58 x 1.61 inches; 3 Ounces', 'UPC': '811381031008'}\nI like that the particles are much finer than those in other facial scrubs. Other facial scrubs I've tried have coarser particles, so coarse it feels like I'm rubbing sand on my face.<br /><br />What I don't like is that the product I received will expire in less than 3 months - Oct 2020. This doesn't seem to be just a one-time occurrence. I also purchased the  \"Higher Education MBA Night Renewing Serum with 0.5% retinol\". That one expires even sooner - on Sep 2020.<br /><br />I don't know what Amazon's policy is on expiration dates for skin care products. But, if I were purchasing this from a physical store, I wouldn't get something that expires in less than 3 months. I expect a product to be good for at least a year. Granted, expired doesn't automatically mean that a product is unusable. However, customers don't like getting old stock especially when a customer still has to pay full price for it. I didn't it but, if I were, I'd be annoyed enough to return the item.<br /><br />I also don't know if Higher Education regularly sends soon-to-expire items to Amazon or if they're just doing this to Vine purchases. Either way, that's really not good practice. For a facial scrub that costs $25, I don't expect the seller to pass off expiring products on me.<br />UPDATE - After going through reviews of the two Higher Education products, it appears that they regularly send soon-to-expire products to customers. Bad seller - Higher Education. Really really bad.<br /><br />One star for sending me an old product. Amazon, stop selling old products! Customers who paid full price for this - you should return the product.\nexpires in less than 3 months\nMBA Renewing Retinol Serum, 1.7 fl. oz, 0.5% Retinol Hydrates & Brightens Skin's Appearance by Diminishing the Look of Breakouts, Hyperpigmentation, and Signs of Aging by Higher Education Skincare\nHigher Education\n{'Skin Type': 'All', 'Scent': 'Aloe', 'Brand': 'Higher Education', 'Item Form': 'Serum', 'Unit Count': '1.7 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.5 x 3.4 x 1.5 inches; 3.99 Ounces', 'UPC': '811381034009'}\nReceived July 23, 2020.<br /><br />I use this 2x a week in the evenings after applying hyaluronic serum. I've experienced no allergic reaction. I chose this because the retinol concentration (0.5%) isn't too high.<br /><br />This is the second Higher Education skin care product I've purchased that has a very short expiration period - expires in less than 2 months (Sep 2020). The first was the \"Grinding Away skin polishing scrub\" that expires in less than 3 months (Oct 2020).<br /><br />I'm really annoyed that Higher Education is stocking Amazon with old products. If I were paying full price for this, I would expect to receive \"fresh\" products - with at least a year before expiration. If I were purchasing this from a physical store, I'd give this back to the counter lady and just look for something else.<br /><br />One star for sending me an old product. Amazon, stop selling old products! Customers who paid full price for this - you should be returning the product.\nexpires in less than 2 months",
  "profile": "**User Summary:**\n\n- **Skincare Focus:** Prefers products for dry and sensitive skin, while continuing to experiment with gentle exfoliators and retinol at low concentrations.\n- **Texture Preference:** Enjoys lightweight, non-greasy formulas that absorb quickly, maintaining this preference despite recent trials.\n- **Scent Preference:** Favors refreshing, natural scents, particularly cucumber, although they have also experienced products with other scents.\n- **Ingredient Sensitivity:** Chooses gentle, versatile options, typically avoiding active ingredients like AHA or retinol. However, the user has shown a willingness to try low-concentration retinol without adverse reactions.\n- **Product Effectiveness:** Values efficacy in moisturizing and skin improvement without irritation. Significant dissatisfaction has arisen from receiving products with short expiration dates, leading to frustration over outdated stock—especially from one brand.\n- **Brand Affinity:** Generally positive towards brands but has expressed strong discontent regarding one specific brand’s inventory practices concerning product freshness. A recent interaction emphasized the user's expectation for new stock, expressing annoyance over receiving outdated products and highlighting their preference for items with a longer shelf life.\n\nOverall, the user leans towards effective, gentle skincare solutions that enhance moisture while remaining vigilant about product quality and freshness, ultimately avoiding brands that do not meet their expectations.",
  "metrics": {
    "rouge1_f": 0.20399579390115666,
    "rouge2_f": 0.023182297154899896,
    "rougeL_f": 0.08412197686645637,
    "meteor": 0.07628238698218338,
    "bleu1": 0.024966801668976663,
    "bleu2": 0.008020670150690933,
    "bleu3": 0.004229120540529615,
    "bleu4": 0.002444610718228309,
    "bertscore_precision": 0.37846046686172485,
    "bertscore_recall": 0.48327305912971497,
    "bertscore_f1": 0.42449256777763367
  }
}