{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Licorice Pizza - Blu-ray + DVD + Digital\nReview Date: 2022/12/29\nStore: Alana Haim  (Actor),     Cooper Hoffman  (Actor),     Paul Thomas Anderson  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Licorice Pizza is the timeless story of Alana Kane and Gary Valentine growing up, running around and falling in love in the San Fernando Valley, 1973. \"This hypnotically gorgeous, funny, romantic movie freewheels its way around from scene to scene, from character to character, from setpiece to setpiece, with absolute mastery.\"* \"Paul Thomas Anderson\\'s most lovable and magical work to date. The breakthrough performances from Alana Haim and Cooper Hoffman are so magnetic and natural that they feel like some kind of miracle.\"** \"Watching Licorice Pizza is like watching life with all the boring parts cut out and like watching movies with all the phony parts cut out.\" *** Featuring performances by Bradley Cooper, Sean Penn, Tom Waits and Benny Safdie.', 'Bonus Content:', 'Includes Blu-ray, DVD and a digital copy of Licorice Pizza (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Includes Blu-ray, DVD and a digital copy of Licorice Pizza (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Camera Tests', 'Camera Tests', 'The Handman Scene', 'The Handman Scene', \"Fat Bernie's Commercial\", \"Fat Bernie's Commercial\", 'Behind the Scenes', 'Behind the Scenes', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama, Comedy, Arthouse', 'Format': 'Blu-ray', 'Contributor': 'Tom Waits, Sara Murphy, Adam Somner, Paul Thomas Anderson, Sean Penn, Alana Haim, Cooper Hoffman, Benny Safdie, Bradley CooperTom Waits, Sara Murphy, Adam Somner, Paul Thomas Anderson, Sean Penn, Alana Haim, Cooper Hoffman, Benny Safdie, Bradley Cooper  See more', 'Initial release date': '2022-05-17', 'Language': 'English', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '6.69 x 5.43 x 0.55 inches; 3.52 Ounces', 'Director': 'Paul Thomas Anderson', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 14 minutes', 'Release date': 'May 17, 2022', 'Actors': 'Alana Haim, Cooper Hoffman, Sean Penn, Tom Waits, Bradley Cooper', 'Producers': 'Sara Murphy, Adam Somner, Paul Thomas Anderson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Paul Thomas Anderson', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: The boy is a month shy of sixteen, and he is headstrong and heartstrong and comes on hard to her. She’s an immature 25 year old who resists at first but falls in love with him. I really don’t get the outrage and accusations of pedophilia. It’s young love as it has been through the ages. He’s not 12. She’s not 45.<br /><br />Apart from all that, the movie is just scenes of typical dysfunction in America—can be found everywhere, particularly in families. No thanks. Could barely make it halfway through.\nReview Title: American Dysfunction Blah\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ken Kwapis'], 'Producers': ['Robert Redford', 'Bill Holderman', 'Chip Diggins', 'Jeremiah Samuels', 'Jake Eberts'], 'Starring': ['Robert Redford', 'Nick Nolte', 'Emma Thompson'], 'Studio': ['Broad Green Pictures']}\nNot a patch on the book. Bryson's wit replaced with vulgarity. Completely lacking in the true challenge of the experience. Ending anticlimactic. Insipid. I guess the money was too tempting. Only redeeming feature of this film was the acting.\nDisappointment.\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['Français'], 'Subtitles': ['English'], 'Directors': ['Anne Fontaine'], 'Producers': ['Eric Altmayer', 'Nicolas Altmayer'], 'Starring': ['Lou de Laage', 'Agata Buzek', 'Agata Kulesza'], 'Studio': ['Music Box Films']}\nA profound movie about the atrocities of war. Beautifully crafted, visually stunning, bleak and stark, but with moments of utter tenderness, I found it as heartwarming and it was painful. The atrocities themselves were not depicted, and this absence was the work of genius that left room for an examination of the depths and heights humanity can reach. There is hope to be found, and much love, and for some, faith. I'm so glad I found out about this film. I loved it. So very thought provoking.\nProfound movie, refreshing in its simplicity.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Hope Dickson Leach'], 'Producers': ['Rachel Robey'], 'Starring': ['Ellie Kendrick', 'David Troughton', 'Jack Holden'], 'Studio': ['Monterey Media']}\nA massive festival of human and animal misery and nothing else. Miserable people, miserable circumstances, miserable setting. Thoroughly depressing and unconvincing. Overacted, overwritten. Truly wretched. A study in how people do not behave in reality, no matter how dire the circumstances.\nOne Dimensional.\nA Street Cat Named Bob\nDrama, Kids, Cheerful, Emotional\n['Based on the international bestselling book. The true, feel-good story of how James Bowen, a busker and recovering drug addict, had his life transformed when he met a stray ginger cat.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Roger Spottiswoode'], 'Producers': ['Adam Rolston'], 'Starring': ['Luke Treadaway', 'Ruta Gedmintas', 'Joanne Froggatt']}\nThis was a sweet film handled very well. Full of hope and love but not overly sugar coating the grit and dangers of drugs and homelessness, it shows how the companionship of a remarkable animal can sometimes be the one thing that pulls people through really tough times. There were some very compassionate and loving humans involved too. Really glad I watched it. A unique story that made such a change from the doom and gloom of so much of what passes as entertainment. This would appeal to a wide age range I believe, and obviously a broad audience. I'm so happy for the success of all involved.\nUplifting Power of Animals\n{'Subtitles': ['None available'], 'Directors': ['John Stephenson'], 'Producers': ['Steve Christian', 'Alice Dawson', 'Ivan Dunleavy', 'Huw Penallt Jones', 'Hannah Leader', 'Candace Lee', 'Brian Lockhart', 'Christopher Morrow', 'Tom Newman'], 'Starring': ['Hans Matheson', 'Samantha Barks', 'Susan Boyle'], 'Studio': ['Group 1200 Media']}\nJust a sweet Christmas film with a religious theme that's uplifting more than annoying. I allowed myself to be swept into it, and enjoyed every moment of its sentimentality. Very beautiful scenery. British acting well done. Susan Boyle! If only it could be true...\nUnapologetically Sweet\nLoving Vincent\nSaoirse Ronan  (Actor),     Aidan Turner  (Actor),     Dorota Kobiela  (Director),     Hugh Welchman  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n['Product Description', 'Academy Award® Nominee Best Animated Feature FilmGolden Globe Nominee Best Animated Motion PictureThe life and controversial death of Vincent Van Gogh told by his paintings and by the characters that inhabit them. The intrigue unfolds through interviews with the characters closest to Vincent and through dramatic reconstructions of the events leading up to his death.', 'Starring', 'Saoirse Ronan (Brooklyn)', 'Saoirse', 'Ronan', '(', 'Brooklyn', ')', 'Aidan Turner (The Hobbit)', 'Aidan Turner', '(', 'The Hobbit', ')', 'Helen McCrory (Skyfall)', 'Helen', 'McCrory', '(', 'Skyfall', ')', 'Douglas Booth (Pride and Prejudice and Zombies)', 'Douglas', 'Booth', '(', 'Pride and Prejudice and Zombies', ')', \"Chris O'Dowd (Bridesmaids, Get Shorty)\", \"Chris O'Dowd\", '(', 'Bridesmaids', ',', 'Get', 'Shorty', ')', 'Review', '\"…the filmmakers transform famous works of modern art into a hypnotic and beguiling cartoon.\" --A. O. Scott, The New York Times\"Animated Feature Loving Vincent Takes Hand-Crafting to New Heights\" --Karen Idelson, Variety\"…a fitting, miraculous tribute to its subject.\" --Joe McGovern, Entertainment Weekly']\n{'Genre': 'Animation, Anime & Manga', 'Format': 'NTSC, Widescreen', 'Contributor': 'Jerome Flynn, Douglas Booth, Hugh Welchman, Saoirse Ronan, Dorota Kobiela, Aidan Turner, Helen McCrory, Chris O DowdJerome Flynn, Douglas Booth, Hugh Welchman, Saoirse Ronan, Dorota Kobiela, Aidan Turner, Helen McCrory, Chris O Dowd  See more', 'Language': 'English', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'GDDE5651DVD DVD', 'Director': 'Dorota Kobiela, Hugh Welchman', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 1, 2019', 'Actors': 'Saoirse Ronan, Aidan Turner, Helen McCrory, Douglas Booth, Chris O Dowd', 'Dubbed': 'English', 'Studio': 'Good Deed Entertainment', 'Number of discs': '1'}\nBeautiful and tender. I've heard the story of Vincent Van Gogh's life several times before, but this was the first time it really hit me in the heart. This movie is a masterpiece, the art of film at its finest. I plan to watch it again. I can count on one hand the number of movies I've said that about, and I've seen a lot!\nNow I think I know...\n{'Audio languages': ['Español'], 'Subtitles': ['None available'], 'Directors': ['Pablo Larraín'], 'Producers': ['Juan De Dios Larraín'], 'Starring': ['Gael García Bernal', 'Luis Gnecco', 'Mercedes Morán']}\nI watched it in two parts because I was fed up after half way through. This is the type of movie you might watch and discuss in a film appreciation class. It's overly esoteric. It needs an interpretation (not the language but the &#34;meaning&#34;). For those who are into film studies, I imagine it would be enjoyable. I was disappointed in the lack of clarity, the depressing, muddy depiction of Chile, and most of all Neruda, who used to be one of my favorite poets. I am all for arty, literary movies, but this one left me cold and confused. It's a difficult movie to watch with subtitles because it requires a lot of visual concentration. At one point I wondered if the color settings on my tv had been altered by mistake.\nBleak and Confusing\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Beeban Kidron', 'Tracey Seaward'], 'Starring': ['Judi Dench', 'Ali Fazal', 'Eddie Izzard'], 'Studio': ['Focus Features']}\nThe movie was just what I was in the mood for. I probably won't remember it for long, but it was enjoyable. Judi &#34;wonderful as usual&#34; Dench was wonderful as usual. The acting was very good all the way around. If not for that and the scenery it would have been perhaps a three star movie or even less. The reason? Because they used so much contemporary dialogue, including a lot of swearing, which coming from the mouths of the characters was jarring rather than amusing. Did they do it to avoid a PG rating? The opening scene even looks like it might be set today. They didn't quite pull it off, the mixture of contemporary and Victorian. I also didn't much appreciate the role of comics that the Indian characters were given in the beginning. The whole movie was on the shallow side. I would like to read the book to get to the heart of what is actually quite a deep story. However, in spite of all that, it gets four stars from me because I enjoyed it a lot anyway.\nSwearing out of place.\nThe Holiday\nCameron Diaz  (Actor),     Kate Winslet  (Actor),     Nancy Meyers  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', \"In Nancy Meyers'\", 'The Holiday', ', a romantic comedy from the director of', \"Something's Gotta Give\", 'and', 'What Women Want', \", two women trade homes only to find that a change of address can change their lives. Iris (Winslet) is in love with a man who is about to marry another woman. Across the globe, Amanda (Diaz), realizes the man she lives with has been unfaithful. Two women who have never met and live 6000 miles apart, find themselves in the exact same place. They meet online at a home exchange website and impulsively switch homes for the holiday. Iris moves into Amanda's L.A. house in sunny California as Amanda arrives in the snow covered English countryside. Shortly after arriving at their destinations, both women find the last thing either wants or expects: a new romance. Amanda is charmed by Iris' handsome brother Graham (Law) and Iris, with inspiration provided by legendary screenwriter Arthur (Wallach), mends her heart when she meets film composer Miles (Black).\", 'Amazon.com', 'As a pleasant dose of holiday cheer,', 'The Holiday', 'is a lovable love story with all the Christmas trimmings. In the capable hands of writer-director Nancy Meyers (making her first romantic comedy since', \"Something's Gotta Give\", '), it all begins when two successful yet unhappy women connect through a home-swapping website, and decide to trade houses for the Christmas holiday in a mutual effort to forget their man troubles. Iris (Kate Winslet) is a London-based journalist who lives in a picture-postcard cottage in Surrey, and Amanda (Cameron Diaz) owns a movie-trailer production company (leading her to cutely imagine most of her life as a \"coming attraction\") and lives in a posh mansion in Beverly Hills. Iris is heartbroken from unrequited love with a cad of a colleague (Rufus Sewell), and Amanda has just broken up with her cheating boyfriend (Edward Burns), so their home-swapping offers mutual downtime to reassess their love lives. This being a Nancy Meyers movie (where everything is fabulously decorated and romantic wish-fulfillment is virtually guaranteed), Amanda hooks up with Iris\\'s charming brother Graham (Jude Law), and Iris is unexpectedly smitten with Miles (Jack Black), a super-nice film composer on the downside of a failing relationship.', '--Jeff Shannon']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Eli Wallach, Rufus Sewell, Columbia Pictures, Nancy Meyers, Kate Winslet, Bruce A. Block, Jack Black, Jude Law, Edward Burns, Cameron DiazEli Wallach, Rufus Sewell, Columbia Pictures, Nancy Meyers, Kate Winslet, Bruce A. Block, Jack Black, Jude Law, Edward Burns, Cameron Diaz   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 16 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 0.01 Ounces', 'Item model number': '1201', 'Director': 'Nancy Meyers', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled', 'Run time': '2 hours and 16 minutes', 'Release date': 'March 13, 2007', 'Actors': 'Cameron Diaz, Kate Winslet, Jude Law, Jack Black, Eli Wallach', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Nancy Meyers, Bruce A. Block', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nTwo vacuous (but beautiful) women just can't get their acts together without a man. Saccharine and sappy and cliched. White as white can be.\nDated Hollywood Sap\nThe Shape of Water\nSuspense, Drama, Fantastic, Tense\n[\"From master storyteller Guillermo del Toro comes an otherworldly fairy tale set in 1960s America where a woman's life is changed forever after she discovers a secret experiment.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Guillermo Del Toro'], 'Producers': ['Guillermo del Toro', 'J. Miles Dale'], 'Starring': ['Sally Hawkins', 'Michael Shannon', 'Richard Jenkins']}\nI was enjoying it until the blood and dismembered body parts, only a few minutes in. At that point I stopped watching. What a waste of an otherwise seemingly original and intriguing movie.\nRuined by Gore\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Justin Chadwick'], 'Producers': ['Alison Owen'], 'Starring': ['Alicia Vikander', 'Cara Delevingne', 'Christoph Waltz'], 'Studio': ['Lionsgate']}\nLots of twists, which I actually enjoyed, even though they were a bit much. I was happy that Sofia found love in spite of being married off to an old man, however nice he might have been. And what she endured to keep that love was pretty heroic. But the end of the film did not speak to that. All the main characters had huge challenges in their lives and they bore them stoically. The costumes were wonderful. The sets were overdone, and the scenes so short to be annoying--more like the pace of an action flick than a period drama during a slow time in history. I knew about Tulip Fever as a part of history. I would have liked more emphasis on that. More tulips would have been nice. It was clearly going after Girl With A Pearl Earring, but it didn't get close. The sex scenes were Playboy-ish, teenage boy pleasers and took up too much time. So it lacked substance. But it kept me entertained in an acceptably high quality way, so I gave it four stars.\nEntertaining\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English'], 'Subtitles': ['English [CC]'], 'Directors': ['Liesl Tommy'], 'Producers': ['Jennifer Hudson', 'Liesl Tommy', 'Sue Baden-Powell', 'Aaron Gilbert', 'Jason Cloth', 'Harvey Mason Jr.', 'Jonathan Glickman', 'Stacey Sher', 'Scott Bernstein', ''], 'Starring': ['Jennifer Hudson', 'Forest Whitaker', 'Marlon Wayans'], 'Studio': ['MGM']}\nWooden dialogue, flat characters, cliches galore. This movie was completely lacking in spark, and any respect or depiction of the genius that was Aretha Franklin. If you have seen a documentary with footage of the queen, you will know that this dreary unimaginative film is nothing about her. Jennifer Hudson is talented and beautiful but this was too big an ask.\nWhere’s the genius?\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dietrich Teschner', 'Justin Black', 'Will Gemma'], 'Starring': ['Dietrich Teschner', 'Justin Black', 'Will Gemma'], 'Studio': ['Headwaters Down']}\nA gentle, beautiful, and informative film about paddling the mighty James. I learned quite a lot about the river that I love. The powers that be need to start treating it like the precious resource it is. Enjoyed all the adventures had by these guys. Thanks for bringing this film to us!\nBeautiful\nLicorice Pizza - Blu-ray + DVD + Digital\nAlana Haim  (Actor),     Cooper Hoffman  (Actor),     Paul Thomas Anderson  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Licorice Pizza is the timeless story of Alana Kane and Gary Valentine growing up, running around and falling in love in the San Fernando Valley, 1973. \"This hypnotically gorgeous, funny, romantic movie freewheels its way around from scene to scene, from character to character, from setpiece to setpiece, with absolute mastery.\"* \"Paul Thomas Anderson\\'s most lovable and magical work to date. The breakthrough performances from Alana Haim and Cooper Hoffman are so magnetic and natural that they feel like some kind of miracle.\"** \"Watching Licorice Pizza is like watching life with all the boring parts cut out and like watching movies with all the phony parts cut out.\" *** Featuring performances by Bradley Cooper, Sean Penn, Tom Waits and Benny Safdie.', 'Bonus Content:', 'Includes Blu-ray, DVD and a digital copy of Licorice Pizza (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Includes Blu-ray, DVD and a digital copy of Licorice Pizza (Digital Copy redemption code subject to expiration. See product insert for details.)', 'Camera Tests', 'Camera Tests', 'The Handman Scene', 'The Handman Scene', \"Fat Bernie's Commercial\", \"Fat Bernie's Commercial\", 'Behind the Scenes', 'Behind the Scenes', ']]>']\n{'Genre': 'Drama, Comedy, Arthouse', 'Format': 'Blu-ray', 'Contributor': 'Tom Waits, Sara Murphy, Adam Somner, Paul Thomas Anderson, Sean Penn, Alana Haim, Cooper Hoffman, Benny Safdie, Bradley CooperTom Waits, Sara Murphy, Adam Somner, Paul Thomas Anderson, Sean Penn, Alana Haim, Cooper Hoffman, Benny Safdie, Bradley Cooper  See more', 'Initial release date': '2022-05-17', 'Language': 'English', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '6.69 x 5.43 x 0.55 inches; 3.52 Ounces', 'Director': 'Paul Thomas Anderson', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 14 minutes', 'Release date': 'May 17, 2022', 'Actors': 'Alana Haim, Cooper Hoffman, Sean Penn, Tom Waits, Bradley Cooper', 'Producers': 'Sara Murphy, Adam Somner, Paul Thomas Anderson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Paul Thomas Anderson', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThe boy is a month shy of sixteen, and he is headstrong and heartstrong and comes on hard to her. She’s an immature 25 year old who resists at first but falls in love with him. I really don’t get the outrage and accusations of pedophilia. It’s young love as it has been through the ages. He’s not 12. She’s not 45.<br /><br />Apart from all that, the movie is just scenes of typical dysfunction in America—can be found everywhere, particularly in families. No thanks. Could barely make it halfway through.\nAmerican Dysfunction Blah",
  "actual_interaction": {
    "rating": 2.0,
    "title": "American Dysfunction Blah",
    "text": "The boy is a month shy of sixteen, and he is headstrong and heartstrong and comes on hard to her. She’s an immature 25 year old who resists at first but falls in love with him. I really don’t get the outrage and accusations of pedophilia. It’s young love as it has been through the ages. He’s not 12. She’s not 45.<br /><br />Apart from all that, the movie is just scenes of typical dysfunction in America—can be found everywhere, particularly in families. No thanks. Could barely make it halfway through.",
    "images": [],
    "asin": "B09M6M3KCF",
    "parent_asin": "B09M6M3KCF",
    "user_id": "AG67IE26M7OA4QMHHVSXIQU4WU7A",
    "timestamp": "2022-12-29 04:25:20.522000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Licorice Pizza - Blu-ray + DVD + Digital",
    "average_rating": 4.5,
    "rating_number": 674,
    "features": [],
    "description": [
      "Licorice Pizza is the timeless story of Alana Kane and Gary Valentine growing up, running around and falling in love in the San Fernando Valley, 1973. \"This hypnotically gorgeous, funny, romantic movie freewheels its way around from scene to scene, from character to character, from setpiece to setpiece, with absolute mastery.\"* \"Paul Thomas Anderson's most lovable and magical work to date. The breakthrough performances from Alana Haim and Cooper Hoffman are so magnetic and natural that they feel like some kind of miracle.\"** \"Watching Licorice Pizza is like watching life with all the boring parts cut out and like watching movies with all the phony parts cut out.\" *** Featuring performances by Bradley Cooper, Sean Penn, Tom Waits and Benny Safdie.",
      "Bonus Content:",
      "Includes Blu-ray, DVD and a digital copy of Licorice Pizza (Digital Copy redemption code subject to expiration. See product insert for details.)",
      "Includes Blu-ray, DVD and a digital copy of Licorice Pizza (Digital Copy redemption code subject to expiration. See product insert for details.)",
      "Camera Tests",
      "Camera Tests",
      "The Handman Scene",
      "The Handman Scene",
      "Fat Bernie's Commercial",
      "Fat Bernie's Commercial",
      "Behind the Scenes",
      "Behind the Scenes",
      "]]>"
    ],
    "price": 11.89,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51nIcoG5EeL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51nIcoG5EeL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81puOorMPFL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512ftNCLBCL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/512ftNCLBCL.jpg",
        "variant": "FRNT",
        "hi_res": "https://m.media-amazon.com/images/I/81IGU6aU5nL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5178OFKMpuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/5178OFKMpuL.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/81QAPPOpbtL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41nmH7m-CyL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41nmH7m-CyL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81qlkiWOFKL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Licorice Pizza Blu-Ray Unboxing",
        "url": "https://www.amazon.com/vdp/060fb760d75f4d1b9ecb0ae7a474eb7e?ref=dp_vse_rvc_0",
        "user_id": "/shop/bobbobson682"
      },
      {
        "title": "Liccorice Pizza Blu-Ray Unboxing",
        "url": "https://www.amazon.com/vdp/04324c68fe414083b8c8c6eed52849d2?ref=dp_vse_rvc_1",
        "user_id": "/shop/bobbobson682"
      }
    ],
    "store": "Alana Haim  (Actor),     Cooper Hoffman  (Actor),     Paul Thomas Anderson  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Genre": "Drama, Comedy, Arthouse",
      "Format": "Blu-ray",
      "Contributor": "Tom Waits, Sara Murphy, Adam Somner, Paul Thomas Anderson, Sean Penn, Alana Haim, Cooper Hoffman, Benny Safdie, Bradley CooperTom Waits, Sara Murphy, Adam Somner, Paul Thomas Anderson, Sean Penn, Alana Haim, Cooper Hoffman, Benny Safdie, Bradley Cooper  See more",
      "Initial release date": "2022-05-17",
      "Language": "English",
      "MPAA rating": "R (Restricted)",
      "Package Dimensions": "6.69 x 5.43 x 0.55 inches; 3.52 Ounces",
      "Director": "Paul Thomas Anderson",
      "Media Format": "Blu-ray",
      "Run time": "2 hours and 14 minutes",
      "Release date": "May 17, 2022",
      "Actors": "Alana Haim, Cooper Hoffman, Sean Penn, Tom Waits, Bradley Cooper",
      "Producers": "Sara Murphy, Adam Somner, Paul Thomas Anderson",
      "Studio": "Universal Pictures Home Entertainment",
      "Writers": "Paul Thomas Anderson",
      "Country of Origin": "USA",
      "Number of discs": "2"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}