{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Element: Barre Conditioning\nReview Date: 2014/02/10\nStore: Sadie Lincoln  (Actor),     Andrea Ambandos  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Exercise & Fitness\nProduct Description: ['Grace meets athleticism in these two innovative workouts. Shot in a picturesque garden overlooking the Pacific Ocean, the standing Burn & Firm program is designed to elevate your heart rate as is tones your upper body, lifts your seat, shapes your legs and strengthens your core. It starts with isometric conditioning using small controlled movements and then layers on larger low impact moves designed to build heat with a vigorous flow. This combination will help increase your energy level and sculpt the slim, well-proportioned physique (or silhouette) of a dancer. The Lengthen & Strengthen program is a dynamic combination of standing bare work and floor work focused on tightening and toning very precisely targeted areas to create a balanced body that is long, strong and lean.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Exercise & fitness - barre method, Exercise & fitness - barre method', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sadie Lincoln, Andrea Ambandos', 'Language': 'English', 'Runtime': '1 hour and 9 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Audio Description': 'English', 'Item model number': '28125333', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 9 minutes', 'Release date': 'December 3, 2013', 'Actors': 'Sadie Lincoln', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: There are two workouts on this video.  Burn and Firm is focused on conditioning the body through a tightly controlled isometric workout.  You won't find complex choreography work here.  You won't find &#34;tie yourself in a human knot&#34; type yoga poses.  You will find a really solid workout that leaves you feeling it the next day.  Each of the workouts automatically adjusts itself to your level as your form improves.  Lengthen and Strengthen reminds me of dance class more than yoga.  It is focused on improving both flexibility and balance.<br /><br />These are good for the beginner, as well as those returning to yoga or dance.\nReview Title: Straightforward and effective workouts\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Passion of the Christ (Widescreen Edition)\nJames Caviezel  (Actor),     Monica Bellucci  (Actor),     Mel Gibson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Drama/Religion', 'Format': 'Anamorphic, Closed-captioned, Color, AC-3, NTSC, Subtitled, DTS Surround Sound, Dolby, Widescreen', 'Contributor': 'James Caviezel, Monica Bellucci, Fabio Sartor, Mel Gibson, Toni Bertorelli, Luca Lionello, Francesco De Vito, Mattia Sbragia, Maia Morgenstern, Hristo Shopov, Christo Jivkov, Benedict Fitzgerald, Giacinto Ferro, Claudia GeriniJames Caviezel, Monica Bellucci, Fabio Sartor, Mel Gibson, Toni Bertorelli, Luca Lionello, Francesco De Vito, Mattia Sbragia, Maia Morgenstern, Hristo Shopov, Christo Jivkov, Benedict Fitzgerald, Giacinto Ferro, Claudia Gerini   See more', 'Language': 'Aramaic, Hebrew, Latin', 'Runtime': '2 hours and 6 minutes'}\nIf you want to view an interpretation of Christ that reduces him to little more than a helpless idiot, watch this movie.  If you actually respect him, avoid this film at all costs.  If Christ's life prior to the crucifixion is missing, then the story is pointless.  His great lessons are missing.  The sermon on the mount is reduced to one line.  And the most important point is missing -- CHRIST CHOSE THE CROSS.  Here, he is portrayed as a victim, dragged around by the jew-mob (there isn't a character there, just a mass-mob) completely unable to do a thing.  The focus isn't on Christ's message, love, pacificm, or teachings, it's a sensationalist view of his suffering, which doesn't fit well with the Christ story.\nAn affront to Christ\nYu-Gi-Oh! // Movie - Capsule Monsters / Part 1 [DVD]\n*  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Saving the world from destruction week after week is not an easy task, so when Joey wins an exotic trip for four, Yugi and his friends decide to take a much needed vacation\\x85or so they think! Before reaching their destination, their plane crash-lands in a deserted forest. Here in a remote area thousands of miles from Egypt lies a great pyramid that contains an incredible secret - a portal to another dimension! The World of the Capsule Monsters!\" It\\'s a battle for survival as Yugi trades in his Duel Disk for a Capsule Shooter in a life-threatening challenge that is so much more than just a game!\"']\n{'Genre': 'Kids & family', 'Format': 'Animated, Color, DVD, NTSC', 'Contributor': '*', 'Language': 'English, Japanese', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Item model number': '1-4210-0462-3', 'Director': '*', 'Media Format': 'Animated, Color, DVD, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'May 23, 2006', 'Actors': '*', 'Studio': 'Funimation Prod', 'Number of discs': '1'}\nThis anime is amazing.  The pacing is perfect.  The story is perfect.  The characters--well you know the characters.  The puzzles are great.  The only tiny thing missing was Kaiba.  As much as the original series was super fantastic wonderful, this one takes it up a notch.  I rented it and now I'm buying two copies.  I'm floored by what a good job they did.  The theatrical release has nothing on this.  This is what should have been in the movies.  This is good.  Buy it.  Watch it a dozen times.  If you like Yu-Gi-Oh you will love this.\nAnime Perfection\nThe Adventures of Sharkboy and Lavagirl in 3-D also includes 2d version [DVD]\nCayden Boyd  (Actor),     George Lopez  (Actor),     Robert Rodriguez  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Another family adventure from the hit-making director of SPY KIDS(TM), THE ADVENTURES OF SHARKBOY AND LAVAGIRL is nonstop fun and stars Hollywood favorites David Arquette, Kristin Davis, and George Lopez. Everyone always knew that Max had a wild imagination ... but no one believed that his wildest creations -- a boy raised by watchful great white sharks and a girl with the force of a volcano -- were real! Now, these two pint-sized action masters will show Max that even an ordinary kid has what it takes to be extraordinary! Bursting with cool, eye-popping 3-D special effects -- even the smallest dreamers can become the biggest heroes in this entertaining motion picture!']\n{'Genre': 'Action & Adventure', 'Format': 'Closed-captioned, AC-3, Color, Dolby, DVD, NTSC, Subtitled, 3D, Widescreen', 'Contributor': 'Tiger Darrow, David Arquette, Taylor Dooley, Rico Torres, Shane Graham, Cayden Boyd, Marc Musso, Jacob Davich, Sasha Pieterse, Taylor Lautner, Kristin Davis, George Lopez, Robert RodriguezTiger Darrow, David Arquette, Taylor Dooley, Rico Torres, Shane Graham, Cayden Boyd, Marc Musso, Jacob Davich, Sasha Pieterse, Taylor Lautner, Kristin Davis, George Lopez, Robert Rodriguez  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Robert Rodriguez', 'Media Format': 'Closed-captioned, AC-3, Color, Dolby, DVD, NTSC, Subtitled, 3D, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'September 20, 2005', 'Actors': 'Cayden Boyd, George Lopez, Kristin Davis, David Arquette, Taylor Lautner', 'Subtitles': 'Spanish', 'Studio': 'Dimension', 'Number of discs': '2'}\nThe product description very clearly states this product comes with four pair of the type of 3D glasses you need to view this movie (the red/blue kind).  I figured they would package in four very cheap pair of cardboard glasses.  There were no glasses at all.<br /><br />The movie is fun, but buy it from someone else. There are other, better, sellers here on Amazon.\nNo Glases\nHow to Train Your Dragon\nJay Baruchel  (Actor),     Gerard Butler  (Actor),     Chris Sanders  (Director, Writer),     Dean DeBlois  (Director, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, DreamWorks\n['A winner with audiences and critics alike, the Academy Award-Nominated DreamWorks Animation film, How to Train Your Dragon, rolls fire-breathing action, epic adventure and laughs into a captivating and original story. Hiccup is a young Viking who defies tradition when he befriends one of his deadliest foes — a ferocious dragon he calls Toothless. Together, the unlikely heroes must fight against all odds to save both their worlds in this \"wonderful good-time hit!\" (Gene Shalit, Today)Bonus Content:', 'Viking-Sized Cast', 'Viking-Sized Cast', 'The Technical Artistry of Dragon', 'The Technical Artistry of Dragon', \"Filmmakers' Commentary\", \"Filmmakers' Commentary\", 'Keep Out!', 'Keep Out!']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.5 x 5.25 x 0.25 inches; 3.2 Ounces', 'Item model number': '0988409821', 'Director': 'Chris Sanders, Dean DeBlois', 'Media Format': 'AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, 3D', 'Run time': '1 hour and 38 minutes', 'Release date': 'February 1, 2018', 'Actors': 'Jay Baruchel, Gerard Butler, Craig Ferguson, America Ferrera, Jonah Hill', 'Dubbed': 'English, French, Spanish, Portuguese', 'Subtitles': 'English, French, Spanish, Portuguese', 'Producers': 'Bonnie Arnold', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), French (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Davies, Dean DeBlois, Chris Sanders', 'Number of discs': '2'}\nFirst, this has little to nothing to do with the book of the same title.<br /><br />Second, this is loads of fun.<br /><br />Young Hiccup lives in a Viking village routinely raided by dragons (they don't leave because of \"stubbornness issues\").  He wants to train to fight dragons himself, but he's a skinny little boy, barely suited to the task.<br /><br />When he finally does get his chance to kill a dragon, he learns very little is what it first seems, and that is true of himself as much as it is true about the dragons.<br /><br />Thematically, this is about acceptance, and self-acceptance.  It's about using one's unique skills to succeed.  It's about looking deaper for the truth.<br /><br />In tone, it's hillarious.  One character, on speaking of why they're going to hunt dragons, says \"We're vikings.  It's an occupational hazzard.\"  It's suited to small children, even sensitive small children.  Adults will enjoy it too.\nGreat fun for kids and adults\nElement: Barre Conditioning\nSadie Lincoln  (Actor),     Andrea Ambandos  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Grace meets athleticism in these two innovative workouts. Shot in a picturesque garden overlooking the Pacific Ocean, the standing Burn & Firm program is designed to elevate your heart rate as is tones your upper body, lifts your seat, shapes your legs and strengthens your core. It starts with isometric conditioning using small controlled movements and then layers on larger low impact moves designed to build heat with a vigorous flow. This combination will help increase your energy level and sculpt the slim, well-proportioned physique (or silhouette) of a dancer. The Lengthen & Strengthen program is a dynamic combination of standing bare work and floor work focused on tightening and toning very precisely targeted areas to create a balanced body that is long, strong and lean.']\n{'Genre': 'Exercise & fitness - barre method, Exercise & fitness - barre method', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sadie Lincoln, Andrea Ambandos', 'Language': 'English', 'Runtime': '1 hour and 9 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Audio Description': 'English', 'Item model number': '28125333', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 9 minutes', 'Release date': 'December 3, 2013', 'Actors': 'Sadie Lincoln', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThere are two workouts on this video.  Burn and Firm is focused on conditioning the body through a tightly controlled isometric workout.  You won't find complex choreography work here.  You won't find &#34;tie yourself in a human knot&#34; type yoga poses.  You will find a really solid workout that leaves you feeling it the next day.  Each of the workouts automatically adjusts itself to your level as your form improves.  Lengthen and Strengthen reminds me of dance class more than yoga.  It is focused on improving both flexibility and balance.<br /><br />These are good for the beginner, as well as those returning to yoga or dance.\nStraightforward and effective workouts",
  "profile": "**User Profile Summary:**\n\n- **Preferences:**\n  - Strong interest in religious and dramatic themes, valuing authentic portrayals and teachings, particularly regarding significant religious figures.\n  - Disapproves of sensationalist interpretations of religious stories.\n  - Appreciates animated storytelling in family-friendly genres, focusing on engaging narratives that convey meaningful messages of acceptance and self-discovery.\n  - Recently expressed a growing interest in fitness and wellness content, indicating a desire for straightforward, effective programs that are accessible to various skill levels.\n\n- **Movie Viewing Trends:**\n  - Likely to critique films harshly if they diverge from established narratives or moral teachings, emphasizing themes of love and sacrifice over suffering.\n  - Enthusiastic about well-executed animated films featuring solid character development that appeal to both children and adults.\n  - Expresses frustration over insufficient product details, indicating a preference for quality and comprehensive information in both film and fitness content.\n\n- **Critique Style:**\n  - Articulates disappointment in artistic portrayals that disrespect religious figures while enjoying deeper thematic content.\n  - Engages with stories that offer meaningful representations rather than those that serve solely for entertainment.\n  - Enthusiastically recommends content that aligns with their interests while expressing discontent when expectations are not met.\n\n- **Overall Sentiment:**\n  - Maintains a critical stance on interpretations of crucial narratives while welcoming well-crafted, meaningful narratives across various genres, seeking authentic and enriching viewing and wellness experiences.",
  "metrics": {
    "rouge1_f": 0.10402855685874553,
    "rouge2_f": 0.006125574272588055,
    "rougeL_f": 0.041815400305966345,
    "meteor": 0.03323436876855586,
    "bleu1": 9.090455855408992e-05,
    "bleu2": 1.2753269805946087e-05,
    "bleu3": 2.4444035383836604e-06,
    "bleu4": 1.0711793603592499e-06,
    "bertscore_precision": 0.36498767137527466,
    "bertscore_recall": 0.4808274209499359,
    "bertscore_f1": 0.4149750769138336
  }
}