{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Last, The: Naruto the Movie (BD)\nReview Date: 2015/10/23\nStore: Various  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Anime\nProduct Description: ['Last, The: Naruto the Movie (BD)', \"Two years have passed since the fated battle between Naruto and Sasuke in the Village Hidden in the Leaves. A comfortable peace has The Last is the final story of Naruto as you knew him, the hero who was once an outcast, and the first chapter of the bond that will define his future. fallen over the village and the winter festival approaches with a bit more excitement than usual. Seasons of war have transformed Naruto and his friends into elite young warriors, but now they grow into the adults they were meant to be, forming bonds beyond friendship. Naruto and Hinata approach this next stage with trepidation and find their progress stalled when a mysterious and dangerous man appears with a disturbing message: the end of the world is upon them. Once again Naruto and his friends are sent to investigate and stop the impossible, a falling moon! What is the tragic fate that connects this disaster with Hinata's Hyuga Clan? And to what lengths will Naruto go to speak the words that will change his life?\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Item model number': '1000536049', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'October 6, 2015', 'Actors': 'Various', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Naruto and Hinata sittin' in a tree...<br /><br />This one is a little silly (ninja escapade on the moon) and a little flighty (there is more talk about knitting in this one movie than in the combined remaining body of ninja anime) and a lot of fun.  Naruto is at his best here, and Hinata comes more into her own.  This picks up sometime after the end of the series.  It is worth it for any Naruto fan.\nReview Title: Fun\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Passion of the Christ (Widescreen Edition)\nJames Caviezel  (Actor),     Monica Bellucci  (Actor),     Mel Gibson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Drama/Religion', 'Format': 'Anamorphic, Closed-captioned, Color, AC-3, NTSC, Subtitled, DTS Surround Sound, Dolby, Widescreen', 'Contributor': 'James Caviezel, Monica Bellucci, Fabio Sartor, Mel Gibson, Toni Bertorelli, Luca Lionello, Francesco De Vito, Mattia Sbragia, Maia Morgenstern, Hristo Shopov, Christo Jivkov, Benedict Fitzgerald, Giacinto Ferro, Claudia GeriniJames Caviezel, Monica Bellucci, Fabio Sartor, Mel Gibson, Toni Bertorelli, Luca Lionello, Francesco De Vito, Mattia Sbragia, Maia Morgenstern, Hristo Shopov, Christo Jivkov, Benedict Fitzgerald, Giacinto Ferro, Claudia Gerini   See more', 'Language': 'Aramaic, Hebrew, Latin', 'Runtime': '2 hours and 6 minutes'}\nIf you want to view an interpretation of Christ that reduces him to little more than a helpless idiot, watch this movie.  If you actually respect him, avoid this film at all costs.  If Christ's life prior to the crucifixion is missing, then the story is pointless.  His great lessons are missing.  The sermon on the mount is reduced to one line.  And the most important point is missing -- CHRIST CHOSE THE CROSS.  Here, he is portrayed as a victim, dragged around by the jew-mob (there isn't a character there, just a mass-mob) completely unable to do a thing.  The focus isn't on Christ's message, love, pacificm, or teachings, it's a sensationalist view of his suffering, which doesn't fit well with the Christ story.\nAn affront to Christ\nYu-Gi-Oh! // Movie - Capsule Monsters / Part 1 [DVD]\n*  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Saving the world from destruction week after week is not an easy task, so when Joey wins an exotic trip for four, Yugi and his friends decide to take a much needed vacation\\x85or so they think! Before reaching their destination, their plane crash-lands in a deserted forest. Here in a remote area thousands of miles from Egypt lies a great pyramid that contains an incredible secret - a portal to another dimension! The World of the Capsule Monsters!\" It\\'s a battle for survival as Yugi trades in his Duel Disk for a Capsule Shooter in a life-threatening challenge that is so much more than just a game!\"']\n{'Genre': 'Kids & family', 'Format': 'Animated, Color, DVD, NTSC', 'Contributor': '*', 'Language': 'English, Japanese', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Item model number': '1-4210-0462-3', 'Director': '*', 'Media Format': 'Animated, Color, DVD, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'May 23, 2006', 'Actors': '*', 'Studio': 'Funimation Prod', 'Number of discs': '1'}\nThis anime is amazing.  The pacing is perfect.  The story is perfect.  The characters--well you know the characters.  The puzzles are great.  The only tiny thing missing was Kaiba.  As much as the original series was super fantastic wonderful, this one takes it up a notch.  I rented it and now I'm buying two copies.  I'm floored by what a good job they did.  The theatrical release has nothing on this.  This is what should have been in the movies.  This is good.  Buy it.  Watch it a dozen times.  If you like Yu-Gi-Oh you will love this.\nAnime Perfection\nThe Adventures of Sharkboy and Lavagirl in 3-D also includes 2d version [DVD]\nCayden Boyd  (Actor),     George Lopez  (Actor),     Robert Rodriguez  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Another family adventure from the hit-making director of SPY KIDS(TM), THE ADVENTURES OF SHARKBOY AND LAVAGIRL is nonstop fun and stars Hollywood favorites David Arquette, Kristin Davis, and George Lopez. Everyone always knew that Max had a wild imagination ... but no one believed that his wildest creations -- a boy raised by watchful great white sharks and a girl with the force of a volcano -- were real! Now, these two pint-sized action masters will show Max that even an ordinary kid has what it takes to be extraordinary! Bursting with cool, eye-popping 3-D special effects -- even the smallest dreamers can become the biggest heroes in this entertaining motion picture!']\n{'Genre': 'Action & Adventure', 'Format': 'Closed-captioned, AC-3, Color, Dolby, DVD, NTSC, Subtitled, 3D, Widescreen', 'Contributor': 'Tiger Darrow, David Arquette, Taylor Dooley, Rico Torres, Shane Graham, Cayden Boyd, Marc Musso, Jacob Davich, Sasha Pieterse, Taylor Lautner, Kristin Davis, George Lopez, Robert RodriguezTiger Darrow, David Arquette, Taylor Dooley, Rico Torres, Shane Graham, Cayden Boyd, Marc Musso, Jacob Davich, Sasha Pieterse, Taylor Lautner, Kristin Davis, George Lopez, Robert Rodriguez  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Robert Rodriguez', 'Media Format': 'Closed-captioned, AC-3, Color, Dolby, DVD, NTSC, Subtitled, 3D, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'September 20, 2005', 'Actors': 'Cayden Boyd, George Lopez, Kristin Davis, David Arquette, Taylor Lautner', 'Subtitles': 'Spanish', 'Studio': 'Dimension', 'Number of discs': '2'}\nThe product description very clearly states this product comes with four pair of the type of 3D glasses you need to view this movie (the red/blue kind).  I figured they would package in four very cheap pair of cardboard glasses.  There were no glasses at all.<br /><br />The movie is fun, but buy it from someone else. There are other, better, sellers here on Amazon.\nNo Glases\nHow to Train Your Dragon\nJay Baruchel  (Actor),     Gerard Butler  (Actor),     Chris Sanders  (Director, Writer),     Dean DeBlois  (Director, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, DreamWorks\n['A winner with audiences and critics alike, the Academy Award-Nominated DreamWorks Animation film, How to Train Your Dragon, rolls fire-breathing action, epic adventure and laughs into a captivating and original story. Hiccup is a young Viking who defies tradition when he befriends one of his deadliest foes — a ferocious dragon he calls Toothless. Together, the unlikely heroes must fight against all odds to save both their worlds in this \"wonderful good-time hit!\" (Gene Shalit, Today)Bonus Content:', 'Viking-Sized Cast', 'Viking-Sized Cast', 'The Technical Artistry of Dragon', 'The Technical Artistry of Dragon', \"Filmmakers' Commentary\", \"Filmmakers' Commentary\", 'Keep Out!', 'Keep Out!']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.5 x 5.25 x 0.25 inches; 3.2 Ounces', 'Item model number': '0988409821', 'Director': 'Chris Sanders, Dean DeBlois', 'Media Format': 'AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen, 3D', 'Run time': '1 hour and 38 minutes', 'Release date': 'February 1, 2018', 'Actors': 'Jay Baruchel, Gerard Butler, Craig Ferguson, America Ferrera, Jonah Hill', 'Dubbed': 'English, French, Spanish, Portuguese', 'Subtitles': 'English, French, Spanish, Portuguese', 'Producers': 'Bonnie Arnold', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), French (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Davies, Dean DeBlois, Chris Sanders', 'Number of discs': '2'}\nFirst, this has little to nothing to do with the book of the same title.<br /><br />Second, this is loads of fun.<br /><br />Young Hiccup lives in a Viking village routinely raided by dragons (they don't leave because of \"stubbornness issues\").  He wants to train to fight dragons himself, but he's a skinny little boy, barely suited to the task.<br /><br />When he finally does get his chance to kill a dragon, he learns very little is what it first seems, and that is true of himself as much as it is true about the dragons.<br /><br />Thematically, this is about acceptance, and self-acceptance.  It's about using one's unique skills to succeed.  It's about looking deaper for the truth.<br /><br />In tone, it's hillarious.  One character, on speaking of why they're going to hunt dragons, says \"We're vikings.  It's an occupational hazzard.\"  It's suited to small children, even sensitive small children.  Adults will enjoy it too.\nGreat fun for kids and adults\nElement: Barre Conditioning\nSadie Lincoln  (Actor),     Andrea Ambandos  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Grace meets athleticism in these two innovative workouts. Shot in a picturesque garden overlooking the Pacific Ocean, the standing Burn & Firm program is designed to elevate your heart rate as is tones your upper body, lifts your seat, shapes your legs and strengthens your core. It starts with isometric conditioning using small controlled movements and then layers on larger low impact moves designed to build heat with a vigorous flow. This combination will help increase your energy level and sculpt the slim, well-proportioned physique (or silhouette) of a dancer. The Lengthen & Strengthen program is a dynamic combination of standing bare work and floor work focused on tightening and toning very precisely targeted areas to create a balanced body that is long, strong and lean.']\n{'Genre': 'Exercise & fitness - barre method, Exercise & fitness - barre method', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sadie Lincoln, Andrea Ambandos', 'Language': 'English', 'Runtime': '1 hour and 9 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Audio Description': 'English', 'Item model number': '28125333', 'Director': 'Andrea Ambandos', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 9 minutes', 'Release date': 'December 3, 2013', 'Actors': 'Sadie Lincoln', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThere are two workouts on this video.  Burn and Firm is focused on conditioning the body through a tightly controlled isometric workout.  You won't find complex choreography work here.  You won't find &#34;tie yourself in a human knot&#34; type yoga poses.  You will find a really solid workout that leaves you feeling it the next day.  Each of the workouts automatically adjusts itself to your level as your form improves.  Lengthen and Strengthen reminds me of dance class more than yoga.  It is focused on improving both flexibility and balance.<br /><br />These are good for the beginner, as well as those returning to yoga or dance.\nStraightforward and effective workouts\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Yoshitomo Yonetani'], 'Producers': ['Kazutaka Akimoto', 'Kôichi Inaba', 'Tokio Inoue', 'Kazumi Kawashiro', 'Muneyuki Kii', 'Joshua Lopez', 'Chika Matsui', 'Yasuo Miyakawa', 'Masayuki Ozaki']}\nI get this was true to the series and the franchise. The voice actors are the same, and great as always.<br /><br />Tiger is again the underestimated clown who wins more by grit and determination than raw power. Barnaby is still the cool, collected one who has more heart than he shows.<br /><br />Bison is played the fool a little more in this one, taking a role once reserved for Origami Cyclone, who in turn has shown tremendous growth as a result of the events of the first series. Dragon Kid and Blue Rose are a little underused -- fair enough given it's a movie, with the tune limits that implies. Fire Emblem gets some intense moments. He has a wonderful line, &#34;If a man is made of courage and a woman is made of love, gay people must be invincible.&#34; This might have been more impressive if he weren't knocked flat moments later.<br /><br />I really hope this means they're relaunching the series. This is a strong launch to a new season.\nLoved it\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Jay Oliva'], 'Producers': ['James Tucker'], 'Starring': ['Justin Chambers', 'Justin Chambers', 'Michael Jordan'], 'Studio': ['WARNER HOME VIDEO']}\nIt remains shockingly true to the comic despite it being compressed to a movie.  This is the story that spawned the New 52, making it a key moment in the DCU history.  This storyline is playing heavily into the Flash TV Series on the CW.  It's a must for fans of that series, or for comic fans who have not yet read this arc.  Those who have will enjoy the retelling.\nFans of the Flash TV series should see this\n{'Content advisory': ['Violence', 'frightening scenes', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Tadayoshi Yamamuro'], 'Producers': ['Norihiro Hayashida', 'Yasushi Ogawa', 'Shinji Shimizu', 'Rioko Tominaga', 'Atsutoshi Umezawa'], 'Starring': ['Hiromi Tsuru', 'Masako Nozawa', 'Ryô Horikawa'], 'Studio': ['FUNimation']}\nThis plays with much of the plot from Dragonball Super (which needs to come to the US already!).  Frieza is resurrected with the help of the newly upgraded dragon balls of earth (now Shenlong grants two wishes, the second one used is sort of a throwaway, so no reason to introduce it here).  He trains.  The Z-fighters train.  They come together in an exceedingly predictable fight and kick the snot out of each other.<br /><br />And it is so much fun.  Beerus is a trip the entire time.  Vegeta is at the top of his form, so much better than the last movie, Goku is that crazy combination of serious and funny that makes him so delightful and Krillian kicks it old school.  This is the movie for a grab a beer and shut of the brain night after a hard day of work.  This is pure fun, total brain candy, and absolutely worth it.  Fans will love it.\nFun, fluffy but fun\nLast, The: Naruto the Movie (BD)\nVarious  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Anime\n['Last, The: Naruto the Movie (BD)', \"Two years have passed since the fated battle between Naruto and Sasuke in the Village Hidden in the Leaves. A comfortable peace has The Last is the final story of Naruto as you knew him, the hero who was once an outcast, and the first chapter of the bond that will define his future. fallen over the village and the winter festival approaches with a bit more excitement than usual. Seasons of war have transformed Naruto and his friends into elite young warriors, but now they grow into the adults they were meant to be, forming bonds beyond friendship. Naruto and Hinata approach this next stage with trepidation and find their progress stalled when a mysterious and dangerous man appears with a disturbing message: the end of the world is upon them. Once again Naruto and his friends are sent to investigate and stop the impossible, a falling moon! What is the tragic fate that connects this disaster with Hinata's Hyuga Clan? And to what lengths will Naruto go to speak the words that will change his life?\", ']]>']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Item model number': '1000536049', 'Director': 'Various', 'Media Format': 'Blu-ray, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'October 6, 2015', 'Actors': 'Various', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nNaruto and Hinata sittin' in a tree...<br /><br />This one is a little silly (ninja escapade on the moon) and a little flighty (there is more talk about knitting in this one movie than in the combined remaining body of ninja anime) and a lot of fun.  Naruto is at his best here, and Hinata comes more into her own.  This picks up sometime after the end of the series.  It is worth it for any Naruto fan.\nFun",
  "profile": "**Updated User Profile Summary:**\n\n- **Preferences:**\n  - Strong interest in religious and dramatic themes, valuing authentic portrayals of significant religious figures and disapproving of sensationalist interpretations.\n  - Enjoys animated storytelling in family-friendly genres that convey meaningful messages about acceptance and self-discovery, focusing on diverse character dynamics and growth.\n  - Recently expressed a growing interest in fitness and wellness content, emphasizing straightforward, effective programs accessible to various skill levels.\n  - Enthusiastic about series and franchises with continuity and deep character development, particularly those that resonate with established narratives.\n\n- **Movie Viewing Trends:**\n  - Likely to critique films if they diverge from established narratives or moral teachings, favoring themes of love, sacrifice, and humor.\n  - Shows appreciation for animated films that appeal to both children and adults, enjoying lighthearted and fun narratives.\n  - Expresses frustration over insufficient product details, preferring comprehensive information in both film and fitness content.\n\n- **Critique Style:**\n  - Articulates disappointment in artistic portrayals that disrespect religious figures while valuing deeper thematic content.\n  - Enthusiastically recommends enjoyable, escapist content, especially within beloved franchises.\n\n- **Overall Sentiment:**\n  - Maintains a critical stance on interpretations of pivotal narratives while actively seeking authentic, enriching, and entertaining viewing experiences across various genres. The user displays a growing appreciation for lighthearted escapades that still provide character growth and tension, as seen in recent interactions.",
  "metrics": {
    "rouge1_f": 0.0750877192982456,
    "rouge2_f": 0.006320224719101123,
    "rougeL_f": 0.03508771929824561,
    "meteor": 0.023221416950155303,
    "bleu1": 1.1791509105120861e-06,
    "bleu2": 3.561851520305946e-07,
    "bleu3": 1.1106616586624545e-07,
    "bleu4": 3.4909138833460365e-08,
    "bertscore_precision": 0.3703378438949585,
    "bertscore_recall": 0.5031129717826843,
    "bertscore_f1": 0.42663371562957764
  }
}