{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/05/01\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Anna Foerster'], 'Producers': ['Tom Rosenberg', 'Gary Lucchesi', 'Len Wiseman', 'Richard S. Wright', 'David Kern'], 'Starring': ['Kate Beckinsale', 'Theo James', 'Tobias Menzies']}\nReview Text: Theo James as David, Bradley James as Varga and Tobias Menzies as Marius makes a hot cast. Very nice from a visual perspective. Lovely.\nReview Title: Excellent cast from a female point of view\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': ['Jay Chandrasekhar'], 'Producers': ['Jay Chandrasekhar', 'Mike Nelson', 'Colin Bates'], 'Starring': ['Jay Chandrasekhar', 'Sarah Chalke', 'Selma Blair']}\nI love the cast. The writers are good and I can actually see myself as one of this group. More, please.\nI enjoyed and want more.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Starring': ['Helen Mirren', 'Jeremy Irons', 'Hugh Dancy'], 'Studio': ['HBO']}\nThis is based on a historic novel by Alison Weir, who usually writes factual biographies and so is in the spirit of accuracy. Nice visually. Helen Mirren and Jeremy Irons are of course wonderful. I've watched this five times or more.\nWatch this\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Ben Taylor'], 'Producers': ['Rob Delaney', 'Sharon Horgan', 'Richard Allen-Turner', 'Kara Baker', 'Jon Thoday'], 'Starring': ['Sharon Horgan', 'Rob Delaney']}\nHilarious and quirky smart and that all on the first episode. She is English and he is American which creates opportunity for witty back-and-forth dialog. Great chemistry between the two.\nHilarious and quirky smart\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Anna Foerster'], 'Producers': ['Tom Rosenberg', 'Gary Lucchesi', 'Len Wiseman', 'Richard S. Wright', 'David Kern'], 'Starring': ['Kate Beckinsale', 'Theo James', 'Tobias Menzies']}\nTheo James as David, Bradley James as Varga and Tobias Menzies as Marius makes a hot cast. Very nice from a visual perspective. Lovely.\nExcellent cast from a female point of view",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference**: Enjoys comedic films and shows with strong ensemble casts, valuing the blend of humor and character-driven narratives, often enhanced by cultural contrasts in dialogue. Also appreciates historical narratives, particularly those adapted from respected literature. The user has shown interest in visually appealing productions with a strong focus on casting.\n\n- **Personal Connection**: Relates deeply to characters and stories that resonate personally, seeking content that balances entertainment with emotional depth. Finds joy in clever humor and quirky interactions, with a recent affinity for casts that reflect a strong visual aesthetic.\n\n- **Creativity Appreciation**: Demonstrates admiration for the work of writers and directors, particularly valuing projects that highlight strong chemistry between leads, especially in comedic settings. Shows particular appreciation for visual elements and the quality of the ensemble.\n\n- **Positive Engagement**: Exhibits enthusiasm for familiar actors, maintaining loyalty to specific performers and enjoying the works of acclaimed talents like Helen Mirren, Jeremy Irons, Kate Beckinsale, and Tobias Menzies.\n\n- **Desire for Quantity**: Craves more content from favorite creators, showing a preference for franchises or series and a willingness to revisit resonant works.\n\n- **Rating Behavior**: Tends to provide high ratings for content that aligns with personal taste and emotional engagement, reflecting consistent positive feedback while showcasing an ability to appreciate strong performances in varied genres, especially those that visually impress. \n\nOverall, the user favors humorous, visually appealing, character-driven stories with rich narratives, valuing emotional engagement and personal connection in their viewing choices.",
  "metrics": {
    "rouge1_f": 0.22664015904572565,
    "rouge2_f": 0.03592814371257485,
    "rougeL_f": 0.11133200795228629,
    "meteor": 0.11349618590287143,
    "bleu1": 0.15711793891354617,
    "bleu2": 0.04597981449488564,
    "bleu3": 0.015975314622946483,
    "bleu4": 0.005299592336569002,
    "bertscore_precision": 0.40380486845970154,
    "bertscore_recall": 0.4287458658218384,
    "bertscore_f1": 0.4159017503261566
  }
}