{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: By Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nReview Date: 2022/07/01\nStore: By Terry\nAverage Rating: 4.3\nProduct Details: {'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nReview Text: Nice mirrored compact with a basic powder puff. Does look white on your skin for awhile...definitely matte, and very smooth...however, makes my dry spots look more dry. Not everyone will have the same issue, but I won't be using it often!\nReview Title: Not for me\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Eyebrow Stencils & Eyebrow Pencil, 10 Styles of Eyebrow Shaper, Reusable Eyebrow Template with Dark Brown Dual-Ended Pencil & Eyebrow Razor, 3 Minutes Makeup, Suitable For All Face Shape\nVIAMAZ\n{'Brand': 'VIAMAZ', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Special Feature': 'Reusable', 'Material Feature': 'Reusable, Natural', 'Package Dimensions': '6.61 x 1.97 x 0.75 inches; 1.13 Ounces'}\nI don't wear makeup often, and since this was something new to me I wanted to try it out. I like the variety of stencils included. It was easy to position and hold one in place. The problem was with the pencil...every time you try to color your eyebrow, the tip just rolls back into the tube after each pass over, making it annoying to have to keep holding the stencil with one hand while constantly twisting the color back out of the applicator with the other! Will probably end up giving these to my daughter, she has more patience than I do!\nNot bad, but not great either!\nCell Fusion C Low pH pHarrier Mask*10sheets | Intensive weak acid care for all skin types, Korean Face Mask\nCell Fusion C\n{'Item Weight': '200 Grams', 'Unit Count': '10.00 Count', 'Item Dimensions LxWxH': '2.36 x 2.36 x 3.94 inches', 'Brand': 'Cell Fusion C', 'Item Volume': '250 Milliliters', 'Product Dimensions': '2.36 x 2.36 x 3.94 inches; 7.05 Ounces', 'Item model number': 'RLE22305'}\nThis is one of the best masks I've used in a while! It was slightly bigger than some, but you can easily fold over to fit. Holes for eyes and mouth were perfect size, and fits well over the nose! No unpleasant fragrance and lots of essence. The best part is that it doesn't leave your skin feeling even 1% sticky after taking it off! Great quantity for the price as well...definitely recommend!\nOne of the best!\nVOFEL Jelly Masks for Facials Mask Powder for Moisturizing Anti Aging Jelly Face Mask Peel Off 9 Pcs\nVOFEL\n{'Brand': 'VOFEL', 'Item Form': 'Powder', 'Scent': 'Vanilla,Lemon', 'Skin Type': 'All, Oily, Sensitive', 'Number of Items': '1', 'Package Dimensions': '6.5 x 3.46 x 1.46 inches; 5.86 Ounces', 'UPC': '770456407264'}\nThis was not my first time using a jelly mask and I followed mixing instructions as usual, so I have no clue why the mask ended up as it did. I put everything that was in the bowl onto my face...was going to wait the minimum 20 minutes before removing, however, the mask was already a dried, powdery clay-looking mess before the time was up. There was no peeling off, and I was barely able to rinse it off...was very hard, and looked like I was taking paint chips off my face! I used the lemon mask, which was the only one that was a whitening mask...I wonder though, since it definitely isn't going to whiten after just one mask, do I have to keep buying this set just to get the lemon one? Doesn't seem worth it. On the bright side, it did make my face feel soft after the irritation and annoyance of removing the mask...but, I can get the same results elsewhere, so definitely won't order again!\nVery disappointed\nBy Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nBy Terry\n{'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nNice mirrored compact with a basic powder puff. Does look white on your skin for awhile...definitely matte, and very smooth...however, makes my dry spots look more dry. Not everyone will have the same issue, but I won't be using it often!\nNot for me",
  "profile": "**User Summary Update:**\n\n- **Makeup Usage:** The user continues to rarely wear makeup and prefers minimalistic beauty routines.\n- **Skincare Enthusiasm:** An increasing interest in skincare products persists, highlighted by thoughtful reviews on various items, underscoring a commitment to enhancing skin wellness without relying on heavy makeup.\n- **Experimentation:** The user remains curious about trying new beauty innovations, particularly those that simplify application, and is embracing skincare tools and masks more than ever.\n- **Product Features:** Although the user values versatility, there is a stronger emphasis now on comfort and efficacy, particularly favoring non-sticky formulas that improve skin quality.\n- **Frustration with Application:** Recent experiences have led to significant frustration regarding the performance of certain products, reflecting high expectations for usability and effectiveness. This aligns with a consistent critical view of product performance.\n- **Intended Use:** The inclination to share products with family remains, highlighting a caring nature and potential for gifting.\n- **Review Tone:** The user provides balanced critiques, addressing both shortcomings and positive aspects of products, maintaining a discerning and honest review approach.\n- **Overall Rating Pattern:** A trend towards moderate to low ratings has emerged, especially when products do not meet expectations, reinforcing the user's demand for reliable and effective performance.\n\nThe updated summary reflects the user's minimalist approach, evolving skincare priorities, and a growing emphasis on practical, effective product performance amid consistent frustrations.",
  "metrics": {
    "rouge1_f": 0.16839677047289503,
    "rouge2_f": 0.009248554913294797,
    "rougeL_f": 0.08304498269896195,
    "meteor": 0.08654216674005841,
    "bleu1": 0.054367317134756045,
    "bleu2": 0.012765260166885537,
    "bleu3": 0.002140048076949495,
    "bleu4": 0.0008769738516010523,
    "bertscore_precision": 0.34864646196365356,
    "bertscore_recall": 0.427334725856781,
    "bertscore_f1": 0.38400089740753174
  }
}