{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MRTREUP Chrome Nail Powder Palette , Metallic Mirror Effect Chrome Powder for Nails , Rose Gold Sliver Pink Holographic Nail Glitter Nail Pigment Powder for DIY Salon Nail Art Decorations\nReview Date: 2022/08/01\nStore: MRTREUP\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '5.59 x 2.05 x 0.55 inches; 1.76 Ounces'}\nReview Text: Love this metallic nail powder! Nice colors, comes with 2 eyeshadow sticks, and very easy to use. Gives instructions for 2 types of applications: one on the back of the outer package and the other on the back of the palette. Both turn out really well! Great price...definitely recommend.\nReview Title: Awesome nail powder!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Eyebrow Stencils & Eyebrow Pencil, 10 Styles of Eyebrow Shaper, Reusable Eyebrow Template with Dark Brown Dual-Ended Pencil & Eyebrow Razor, 3 Minutes Makeup, Suitable For All Face Shape\nVIAMAZ\n{'Brand': 'VIAMAZ', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Special Feature': 'Reusable', 'Material Feature': 'Reusable, Natural', 'Package Dimensions': '6.61 x 1.97 x 0.75 inches; 1.13 Ounces'}\nI don't wear makeup often, and since this was something new to me I wanted to try it out. I like the variety of stencils included. It was easy to position and hold one in place. The problem was with the pencil...every time you try to color your eyebrow, the tip just rolls back into the tube after each pass over, making it annoying to have to keep holding the stencil with one hand while constantly twisting the color back out of the applicator with the other! Will probably end up giving these to my daughter, she has more patience than I do!\nNot bad, but not great either!\nCell Fusion C Low pH pHarrier Mask*10sheets | Intensive weak acid care for all skin types, Korean Face Mask\nCell Fusion C\n{'Item Weight': '200 Grams', 'Unit Count': '10.00 Count', 'Item Dimensions LxWxH': '2.36 x 2.36 x 3.94 inches', 'Brand': 'Cell Fusion C', 'Item Volume': '250 Milliliters', 'Product Dimensions': '2.36 x 2.36 x 3.94 inches; 7.05 Ounces', 'Item model number': 'RLE22305'}\nThis is one of the best masks I've used in a while! It was slightly bigger than some, but you can easily fold over to fit. Holes for eyes and mouth were perfect size, and fits well over the nose! No unpleasant fragrance and lots of essence. The best part is that it doesn't leave your skin feeling even 1% sticky after taking it off! Great quantity for the price as well...definitely recommend!\nOne of the best!\nVOFEL Jelly Masks for Facials Mask Powder for Moisturizing Anti Aging Jelly Face Mask Peel Off 9 Pcs\nVOFEL\n{'Brand': 'VOFEL', 'Item Form': 'Powder', 'Scent': 'Vanilla,Lemon', 'Skin Type': 'All, Oily, Sensitive', 'Number of Items': '1', 'Package Dimensions': '6.5 x 3.46 x 1.46 inches; 5.86 Ounces', 'UPC': '770456407264'}\nThis was not my first time using a jelly mask and I followed mixing instructions as usual, so I have no clue why the mask ended up as it did. I put everything that was in the bowl onto my face...was going to wait the minimum 20 minutes before removing, however, the mask was already a dried, powdery clay-looking mess before the time was up. There was no peeling off, and I was barely able to rinse it off...was very hard, and looked like I was taking paint chips off my face! I used the lemon mask, which was the only one that was a whitening mask...I wonder though, since it definitely isn't going to whiten after just one mask, do I have to keep buying this set just to get the lemon one? Doesn't seem worth it. On the bright side, it did make my face feel soft after the irritation and annoyance of removing the mask...but, I can get the same results elsewhere, so definitely won't order again!\nVery disappointed\nBy Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nBy Terry\n{'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nNice mirrored compact with a basic powder puff. Does look white on your skin for awhile...definitely matte, and very smooth...however, makes my dry spots look more dry. Not everyone will have the same issue, but I won't be using it often!\nNot for me\nYouClean 300 Antibacterial Travel Hand Soap Sheets - Pocket/Purse/Wallet/Backpack -Great for Outdoor Camping or Daily Use (Tea Party) (Tea Party)\nYouClean\n['Brand:', 'YouClean', 'Item Form:', 'Sheet', 'Formulation:', 'Concentrated plant-based soap', 'Scent:', 'Tea Party (Chamomile, Green Tea, Tea Tree)', 'Package Box Size:', '2 x 1 x 1.5 inch', 'www.shopyouclean.com', \"We are changing our packaging. No more small plastic cases!   Our new packaging is 100% biodegradable paper. All 300 sheets are tightly packed in 3 tiny paper boxes (100 sheets/box) which nicely fit in any purse/wallet, handbag, and kids' pack-backs.   Check out our 9 scent collections:   - Tea Party  - Citrus Collection  - Purple Heart  - Pink Pamper  - Red Passion  - Blanca Elegance  - Seaside Vacation  - The Adventure  - The Nonsense (unscented)\"]\n{'Item Form': 'Sheet', 'Skin Type': 'All', 'Brand': 'YouClean', 'Scent': 'Tea Party', 'Material Type Free': 'Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)  See more', 'Product Dimensions': '2 x 1 x 1.25 inches; 2.4 Ounces', 'UPC': '609670421100', 'Manufacturer': 'YouClean'}\nAdvertises 8 packs, you get 4....advertises 8 scents, you get 2 (3 packs all have the same scent). The product page states they are paraben-free, bleach-free, etc., however, no where on the page or any of the packages is there a list of ingredients. I'm still debating on whether or not I actually want to use them! However, as of right now, I do not recommend.\nNot as advertised\nVitamasques Cica Green Tea Jelly Facial Cleanser Gentle pH Cleanser is Refreshing, Cleansing & Exfoliating for Smooth, Clean & Radiant Skin - Vegan, Free from Parabens & Gluten\nVitamasques\n{'Item Form': 'Cream', 'Skin Type': 'All', 'Brand': 'Vitamasques', 'Scent': 'Tea Tree', 'Material Feature': 'Vegan', 'Package Dimensions': '5.24 x 1.81 x 1.38 inches; 2.89 Ounces', 'UPC': '750258969917'}\nI've liked all the Vitamasques products I've used so far, and this cleanser is added to that list! I was afraid that it would have a medicinal smell since the ingredients include Centella Asiatica, however I was surprised when I opened the tube and was hit with a fragrance that, to me, smells like fresh cut grass! Has a gel-like texture with added bits of what look like tea leaves. It doesn't lather much, but is more like a cream when you start to massage it over your skin. Very gentle, rinses without leaving any residue, and your skin will feel extra soft!\nGreat Vitamasques cleanser!\nMRTREUP Chrome Nail Powder Palette , Metallic Mirror Effect Chrome Powder for Nails , Rose Gold Sliver Pink Holographic Nail Glitter Nail Pigment Powder for DIY Salon Nail Art Decorations\nMRTREUP\n{'Package Dimensions': '5.59 x 2.05 x 0.55 inches; 1.76 Ounces'}\nLove this metallic nail powder! Nice colors, comes with 2 eyeshadow sticks, and very easy to use. Gives instructions for 2 types of applications: one on the back of the outer package and the other on the back of the palette. Both turn out really well! Great price...definitely recommend.\nAwesome nail powder!",
  "profile": "**User Summary Update:**\n\n- **Makeup Usage:** The user continues to rarely wear makeup, favoring minimalistic beauty routines while recently exploring nail art.\n- **Skincare Enthusiasm:** Their passion for skincare products remains strong, highlighted by thoughtful reviews that emphasize enhancing skin wellness with gentle formulas.\n- **Experimentation:** Curiosity about beauty innovations persists, particularly in skincare tools and masks, as well as interest in nail decoration techniques.\n- **Product Features:** The user values versatility and prioritizes comfort and efficacy, favoring non-sticky formulas that enhance skin quality and overall aesthetic.\n- **Frustration with Application:** They have heightened expectations for product performance, leading to frustrations with skincare products that fall short of claims, although they recently had a positive experience with a new cleanser.\n- **Intended Use:** Their caring nature reflects in sharing products with family, now expanding to include nail art supplies.\n- **Review Tone:** The user's balanced critiques maintain a discerning and honest approach, valuing transparency in both positive and negative aspects of products.\n- **Overall Rating Pattern:** A trend towards moderate to low ratings persists, particularly for products that do not meet expectations, reinforcing their demand for reliability and effectiveness in both skincare and beauty products.\n- **New Interests:** Recent enthusiasm for a nail product underlines a growing interest in diverse beauty expressions, while still adhering to their core values of quality and performance.",
  "metrics": {
    "rouge1_f": 0.13304410701373828,
    "rouge2_f": 0.008689355539464157,
    "rougeL_f": 0.05929139551699204,
    "meteor": 0.056741860061992444,
    "bleu1": 0.006092602949434913,
    "bleu2": 0.001289484748964419,
    "bleu3": 0.00020882887864819927,
    "bleu4": 8.411024962654786e-05,
    "bertscore_precision": 0.36178427934646606,
    "bertscore_recall": 0.45472994446754456,
    "bertscore_f1": 0.4029669761657715
  }
}