{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Celleanser Vegan Clean Serum100% Vegan Ingredients Quick Relief and Repair Hypoallergic Tested Hydrating Panthenol Silky Texture Made in Korea 30ml 1.01 fl. oz.\nReview Date: 2022/09/14\nStore: Celleanser\nAverage Rating: 4.4\nProduct Details: {'Package Dimensions': '5.83 x 1.26 x 1.26 inches; 2.89 Ounces'}\nReview Text: This is a nice pump serum, which I like better than those that use a dropper. Has a thick, milky texture and subtle medicinal scent that doesn't last long. Absorbs quickly and doesn't leave your skin feeling sticky, however, not much in the way of hydration until you add a cream! Like the other Celleanser products, ingredients listed in English on the box (if you open box by using the perforation, you'll see the ingredients and brand story inside, all written in Korean. It's reasonably priced, which is nice for those of us on a budget!\nReview Title: It's good\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Eyebrow Stencils & Eyebrow Pencil, 10 Styles of Eyebrow Shaper, Reusable Eyebrow Template with Dark Brown Dual-Ended Pencil & Eyebrow Razor, 3 Minutes Makeup, Suitable For All Face Shape\nVIAMAZ\n{'Brand': 'VIAMAZ', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Special Feature': 'Reusable', 'Material Feature': 'Reusable, Natural', 'Package Dimensions': '6.61 x 1.97 x 0.75 inches; 1.13 Ounces'}\nI don't wear makeup often, and since this was something new to me I wanted to try it out. I like the variety of stencils included. It was easy to position and hold one in place. The problem was with the pencil...every time you try to color your eyebrow, the tip just rolls back into the tube after each pass over, making it annoying to have to keep holding the stencil with one hand while constantly twisting the color back out of the applicator with the other! Will probably end up giving these to my daughter, she has more patience than I do!\nNot bad, but not great either!\nCell Fusion C Low pH pHarrier Mask*10sheets | Intensive weak acid care for all skin types, Korean Face Mask\nCell Fusion C\n{'Item Weight': '200 Grams', 'Unit Count': '10.00 Count', 'Item Dimensions LxWxH': '2.36 x 2.36 x 3.94 inches', 'Brand': 'Cell Fusion C', 'Item Volume': '250 Milliliters', 'Product Dimensions': '2.36 x 2.36 x 3.94 inches; 7.05 Ounces', 'Item model number': 'RLE22305'}\nThis is one of the best masks I've used in a while! It was slightly bigger than some, but you can easily fold over to fit. Holes for eyes and mouth were perfect size, and fits well over the nose! No unpleasant fragrance and lots of essence. The best part is that it doesn't leave your skin feeling even 1% sticky after taking it off! Great quantity for the price as well...definitely recommend!\nOne of the best!\nVOFEL Jelly Masks for Facials Mask Powder for Moisturizing Anti Aging Jelly Face Mask Peel Off 9 Pcs\nVOFEL\n{'Brand': 'VOFEL', 'Item Form': 'Powder', 'Scent': 'Vanilla,Lemon', 'Skin Type': 'All, Oily, Sensitive', 'Number of Items': '1', 'Package Dimensions': '6.5 x 3.46 x 1.46 inches; 5.86 Ounces', 'UPC': '770456407264'}\nThis was not my first time using a jelly mask and I followed mixing instructions as usual, so I have no clue why the mask ended up as it did. I put everything that was in the bowl onto my face...was going to wait the minimum 20 minutes before removing, however, the mask was already a dried, powdery clay-looking mess before the time was up. There was no peeling off, and I was barely able to rinse it off...was very hard, and looked like I was taking paint chips off my face! I used the lemon mask, which was the only one that was a whitening mask...I wonder though, since it definitely isn't going to whiten after just one mask, do I have to keep buying this set just to get the lemon one? Doesn't seem worth it. On the bright side, it did make my face feel soft after the irritation and annoyance of removing the mask...but, I can get the same results elsewhere, so definitely won't order again!\nVery disappointed\nBy Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan\nBy Terry\n{'Brand': 'By Terry', 'Item Form': 'powder', 'Finish Type': 'Matte', 'Number of Items': '1', 'Skin Tone': 'All', 'Package Dimensions': '3.19 x 3.15 x 0.75 inches; 2.82 Ounces', 'Item model number': '3700076457087'}\nNice mirrored compact with a basic powder puff. Does look white on your skin for awhile...definitely matte, and very smooth...however, makes my dry spots look more dry. Not everyone will have the same issue, but I won't be using it often!\nNot for me\nYouClean 300 Antibacterial Travel Hand Soap Sheets - Pocket/Purse/Wallet/Backpack -Great for Outdoor Camping or Daily Use (Tea Party) (Tea Party)\nYouClean\n['Brand:', 'YouClean', 'Item Form:', 'Sheet', 'Formulation:', 'Concentrated plant-based soap', 'Scent:', 'Tea Party (Chamomile, Green Tea, Tea Tree)', 'Package Box Size:', '2 x 1 x 1.5 inch', 'www.shopyouclean.com', \"We are changing our packaging. No more small plastic cases!   Our new packaging is 100% biodegradable paper. All 300 sheets are tightly packed in 3 tiny paper boxes (100 sheets/box) which nicely fit in any purse/wallet, handbag, and kids' pack-backs.   Check out our 9 scent collections:   - Tea Party  - Citrus Collection  - Purple Heart  - Pink Pamper  - Red Passion  - Blanca Elegance  - Seaside Vacation  - The Adventure  - The Nonsense (unscented)\"]\n{'Item Form': 'Sheet', 'Skin Type': 'All', 'Brand': 'YouClean', 'Scent': 'Tea Party', 'Material Type Free': 'Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)Plastic Free, Chemical Free (Not containing Sulfate, Phosphate, Paraffin, Phthalate, Gluten, Lead, Palm Oil and Mineral Oil)  See more', 'Product Dimensions': '2 x 1 x 1.25 inches; 2.4 Ounces', 'UPC': '609670421100', 'Manufacturer': 'YouClean'}\nAdvertises 8 packs, you get 4....advertises 8 scents, you get 2 (3 packs all have the same scent). The product page states they are paraben-free, bleach-free, etc., however, no where on the page or any of the packages is there a list of ingredients. I'm still debating on whether or not I actually want to use them! However, as of right now, I do not recommend.\nNot as advertised\nVitamasques Cica Green Tea Jelly Facial Cleanser Gentle pH Cleanser is Refreshing, Cleansing & Exfoliating for Smooth, Clean & Radiant Skin - Vegan, Free from Parabens & Gluten\nVitamasques\n{'Item Form': 'Cream', 'Skin Type': 'All', 'Brand': 'Vitamasques', 'Scent': 'Tea Tree', 'Material Feature': 'Vegan', 'Package Dimensions': '5.24 x 1.81 x 1.38 inches; 2.89 Ounces', 'UPC': '750258969917'}\nI've liked all the Vitamasques products I've used so far, and this cleanser is added to that list! I was afraid that it would have a medicinal smell since the ingredients include Centella Asiatica, however I was surprised when I opened the tube and was hit with a fragrance that, to me, smells like fresh cut grass! Has a gel-like texture with added bits of what look like tea leaves. It doesn't lather much, but is more like a cream when you start to massage it over your skin. Very gentle, rinses without leaving any residue, and your skin will feel extra soft!\nGreat Vitamasques cleanser!\nMRTREUP Chrome Nail Powder Palette , Metallic Mirror Effect Chrome Powder for Nails , Rose Gold Sliver Pink Holographic Nail Glitter Nail Pigment Powder for DIY Salon Nail Art Decorations\nMRTREUP\n{'Package Dimensions': '5.59 x 2.05 x 0.55 inches; 1.76 Ounces'}\nLove this metallic nail powder! Nice colors, comes with 2 eyeshadow sticks, and very easy to use. Gives instructions for 2 types of applications: one on the back of the outer package and the other on the back of the palette. Both turn out really well! Great price...definitely recommend.\nAwesome nail powder!\nPineapple Gommage Peeling Gel by Vitamasques - Gentle Botanical Cellulose Exfoliator for Sensitive Skin - De-Clogs Pores & Eliminates Dead Skin - Vegan, Free from Parabens & Gluten\nVitamasques\n{'Brand': 'Vitamasques', 'Skin Type': 'Sensitive', 'Material Feature': 'Cruelty Free, Vegan', 'Number of Items': '1', 'Scent': 'Pineapple', 'Package Dimensions': '4.92 x 2.2 x 1.38 inches; 2.08 Ounces', 'UPC': '750258970371'}\nThis is a nice peeling gel...very subtle pineapple fragrance and not greasy. This is like other peels that state they remove dead skin cells, however, at least this brand isn't trying to make you believe that the particles you see after massaging onto the skin are those cells, because they're not! You will see a small amount of particles or a lot, depending on how much you use, and it is only the product...that's how they work, the gel turns into an exfoliator! I've never had any of these peels, including this one, really clean the pores...however, it does leave the skin feeling soft and refreshed. I did take away 1 star because the tube seems to not contain much gel, as compared to other Vitamasques products. Overall, not a bad product for the price.\nGood exfoliator\n4240Pcs Flatback White Opal Rhinestones Glass Crystal Gemstones for Nail Art Face Makeup Glitter Round with Tweezers and Picking Pen (SS6~SS20 Set)\nMEIBITE\n{'Brand': 'MEIBITE', 'Shape': 'Round', 'Number of Pieces': '1', 'Item Form': 'Pen', 'Recommended Uses For Product': 'Crafts, Nail Arts, Arts', 'Package Dimensions': '7.2 x 4.33 x 0.59 inches; 2.4 Ounces', 'UPC': '749666774886'}\nThese are nice rhinestones, but I only gave 3 stars for having to spend so much time cleaning up the mess of the lid being popped up in the package. You do get a variety of sizes and an abundance of each size. Easy to apply and look nice on nails. Price is a bit steep for the product, and for the hassle of putting them all back in the container! Won't order again.\nLove the opal rhinestones, but...\nessence | Welcome to Miami Eyeshadow Palette | 12 Highly Pigmented, Blendable Shades | Matte & Metallic | Vegan & Cruelty Free | Made Without Oil, Fragrance, Parabens, Alcohol, & Microplastic Particles\nessence cosmetics\n[\"¡BIENVENIDOS A MIAMI! With the essence welcome to MIAMI eyeshadow palette, we're bringing the sunny vibes of Florida into our make-up bags. The bright and bold color palette is inspired by the iconic Miami beaches and art deco landmarks. The 12 highly-pigmented are sure to create a feeling of happiness with their nude, pink, violet, turquoise and green shades. Thanks to the diverse finishes ranging from matte to metallic, you can create countless looks for any occasion. This product is vegan & cruelty free and is formulated without oil, fragrance, parabens, alcohol, & microplastic particles.\"]\n{'Brand': 'essence cosmetics', 'Item Form': 'Powder', 'Finish Type': 'Metallic, Matte', 'Special Feature': 'Not Tested On Animals, Unscented', 'Material Type Free': 'Fragrance Free, Oil Free, Alcohol Free, Microplastic Particle Free, Paraben Free', 'Product Dimensions': '6.73 x 2.52 x 0.47 inches; 3.25 Ounces', 'Item model number': '934930', 'Manufacturer': 'essence cosmetics', 'Country of Origin': 'China'}\nNice eyeshadow palette. Vibrant colors with good pigment, can actually see the color when applied! I did take off 1 star because one color was broken up when I got it and now it's just making a mess on the whole palette! Doesn't come with an eyeshadow brush, but overall nice quality and a good price.\nNice colors!\nCELLEANSER Vegan Clean Cream 100% Vegan Ingredients Hydrating Nourishing Anti-Aging Balancing Panthenol Silky Made in Korea 60ml 2.02 fl.oz.\nCelleanser\n{'Brand': 'Celleanser', 'Item Form': 'Cream', 'Unit Count': '2.02 Fl Oz', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '5.67 x 1.65 x 1.65 inches; 2.89 Ounces'}\nThis Celleanser clean cream is good, but nothing spectacular. Has a medicinal fragrance that fades quickly. Doesn't leave your skin feeling heavy or greasy and absorbs quickly, but not much hydration! I usually follow about 30 minutes after applying with the Celleanser Therapy Water Bounce Cream for better results. Reasonably priced, and good for when you're on a budget.\nIt's okay\nCelleanser Vegan Clean Serum100% Vegan Ingredients Quick Relief and Repair Hypoallergic Tested Hydrating Panthenol Silky Texture Made in Korea 30ml 1.01 fl. oz.\nCelleanser\n{'Package Dimensions': '5.83 x 1.26 x 1.26 inches; 2.89 Ounces'}\nThis is a nice pump serum, which I like better than those that use a dropper. Has a thick, milky texture and subtle medicinal scent that doesn't last long. Absorbs quickly and doesn't leave your skin feeling sticky, however, not much in the way of hydration until you add a cream! Like the other Celleanser products, ingredients listed in English on the box (if you open box by using the perforation, you'll see the ingredients and brand story inside, all written in Korean. It's reasonably priced, which is nice for those of us on a budget!\nIt's good",
  "profile": "**User Summary Update:**\n\n- **Makeup and Nail Art:** The user remains committed to a minimalistic makeup style, favoring vibrant colors as they continue to explore new eyeshadow palettes. Their interest in nail art persists, although they encounter challenges with cleanup and costs associated with new supplies.\n\n- **Skincare Commitment:** The user is dedicated to skincare, focusing on gentle formulations and effective exfoliation. They value hydration and lightweight textures but express that some recent products did not meet their hydration needs, leading to moderate reviews.\n\n- **Product Exploration:** Their curiosity for beauty innovations is evident, particularly in versatile tools that enhance comfort and efficacy. The user approaches new products with cautious enthusiasm, often holding them to high standards.\n\n- **Expectations and Frustrations:** Elevated expectations may cause disappointment, especially for products that fail to deliver on hydration or other essential criteria. Despite positive reviews of effective skincare, they remain critical of items that fall short.\n\n- **Sharing and Reviews:** The user frequently shares products with family, crafting honest reviews that reflect their experiences. Moderate ratings are common for items that do not meet their criteria.\n\n- **Overall Trends:** The user values reliability and practicality across skincare and beauty, seeking effective solutions that promote skin wellness while maintaining a discerning eye for performance. Their recent purchase highlights a preference for user-friendly packaging and budget-friendly options.",
  "metrics": {
    "rouge1_f": 0.09442446043165467,
    "rouge2_f": 0.008100810081008101,
    "rougeL_f": 0.046762589928057555,
    "meteor": 0.036209541535568886,
    "bleu1": 0.00011578797085210824,
    "bleu2": 1.8189629738932907e-05,
    "bleu3": 3.162461555919158e-06,
    "bleu4": 1.3198319107890978e-06,
    "bertscore_precision": 0.3620989918708801,
    "bertscore_recall": 0.49996277689933777,
    "bertscore_f1": 0.42000705003738403
  }
}