{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/02/17\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Buck', 'Jennifer Lee'], 'Producers': ['Peter Del Vecho', 'Aimee Scribner'], 'Starring': ['Kristen Bell', 'Idina Menzel', 'Jonathan Groff'], 'Studio': ['Walt Disney Animation Studios']}\nReview Text: I didn't notice that this wasn't a full-length feature when I purchased it for my child. Three dollars for 7 minutes? I advise skipping it.\nReview Title: Complete rip off\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Seth Rogen'], 'Producers': ['Seth Rogen'], 'Starring': ['James Franco', 'Seth Rogen', 'Lizzy Caplan'], 'Studio': ['Columbia Pictures']}\nHilarious\nHilarious\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Tibbitt', 'Mike Mitchell'], 'Producers': ['Paul Tibbitt', 'Mary Parent', 'Stephen Hillenburg', 'Cale Boyter'], 'Starring': ['Antonio Banderas'], 'Studio': ['Paramount Pictures']}\nkids loved it\nkids loved it\n10 Movie Princess Collection\nFormat: DVD\nMovies & TV, Movies\n{'Product Dimensions': '0.7\"L x 7.5\"W', 'Item Weight': '0.32 Pounds', 'Number of Items': '1', 'Orientation': 'Portrait', 'Shape': 'Rectangular', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Item model number': 'GDTV4422DVD', 'Media Format': 'NTSC, Color, Multiple Formats', 'Run time': '8 hours and 20 minutes', 'Release date': 'March 5, 2013', 'Language': 'English (Stereo)', 'Studio': 'Good Times Video', 'Number of discs': '1'}\npoor quality and fairly tales are odd\nnot worth buying\nIdentity Thief\nJason Bateman  (Actor, Producer),     Melissa McCarthy  (Actor),     Seth Gordon  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'Jason Bateman (Horrible Bosses) and Melissa McCarthy (Bridesmaids) lead an all-star cast in this hilarious blockbuster hit. Unlimited funds have allowed Diana (McCarthy) to live it up on the outskirts of Orlando. There\\'s only one glitch: she\\'s financing her shopping sprees with an ID stolen from Sandy Patterson (Bateman), an accounts rep who lives halfway across the U.S. With only one week to hunt down the con artist before his world implodes, the real Sandy Patterson is forced to extreme measures to clear his name. From the director of Horrible Bosses and the producer of Ted, critics are calling Identity Thief \"smart, funny and surprisingly touching\" – Rafer Guzman, Newsday.Bonus Content:', 'Gag Reel', 'Gag Reel', 'The Making of Identity Thief', 'The Making of Identity Thief', 'Amazon.com', 'Identity Thief', 'is a hilarious romp/caper featuring the comedic skills of Melissa McCarthy (', 'Bridesmaids', ') and Jason Bateman (', 'Up in the Air', ',', 'Arrested Development', '. Whoever had the casting idea to hire these two as the leads was on to something. While the script for', 'Identity Thief', \"may be a bit weak and predictable, the chemistry of the film's two stars gives it more than its share of belly laughs. McCarthy stars as Diana, a credit-card scammer, and Bateman is Sandy, a straight-laced executive who becomes a victim of her fraud. Sandy takes it upon himself to track Diana down and bring her to justice.\", 'Identity Thief', 'echoes some of the best bits of', 'Midnight Run', \"(and Bateman himself seems to be paying homage to that film's costar, Charles Grodin).\", 'Identity Thief', 'gets its personality and true moments of comedy from the interplay of the odd-couple stars. The supporting cast is strong, including Eric Stonestreet, Amanda Peet, T.I., and Jon Favreau, though they ultimately seem a little superfluous. Which is totally fine, because with the interaction of the two stars, and especially the fearless performance of Melissa McCarthy,', 'Identity Thief', 'will stealthily steal your heart. --', 'A.T. Hurley']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '025192161445', 'Director': 'Seth Gordon', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 51 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Jason Bateman, Melissa McCarthy, John Cho, Amanda Peet, Jon Favreau', 'Producers': 'Dan Kolsrud, Jason Bateman, Mary Rohlich, Pamela Abdy, Peter Morgan', 'Language': 'English (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal', 'Writers': 'Craig Mazin, Jerry Eeten', 'Number of discs': '1'}\nfunny\nFive Stars\nThe Heat\nSandra Bullock  (Actor),     Melissa McCarthy  (Actor),     Paul Feig  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane CurtinMichael Rapaport, Paul Feig, Taran Killam, Michael McDonald, Peter Chernin, Dan Bakkedahl, Brandon Richardson, Marlon Wayans, Sandra Bullock, Melissa McCarthy, Jenno Topping, Spoken Reasons, Katie Dippold, Tom Wilson, Demian Bichir, Jane Curtin  See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes'}\nhilarious\nfunny\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Buck', 'Jennifer Lee'], 'Producers': ['Peter Del Vecho', 'Aimee Scribner'], 'Starring': ['Kristen Bell', 'Idina Menzel', 'Jonathan Groff'], 'Studio': ['Walt Disney Animation Studios']}\nI didn't notice that this wasn't a full-length feature when I purchased it for my child. Three dollars for 7 minutes? I advise skipping it.\nComplete rip off",
  "profile": "**User Summary:**\n\n- **Rating Preferences:** The user predominantly rates content highly, particularly enjoying comedic works. However, their recent negative review of a short children's content indicates a more discerning approach towards family-friendly films, reflecting a shift in attitude towards value for content length and quality. \n- **Content Type:** While the user continues to favor humorous entertainment and family-friendly comedies, their latest interaction emphasizes a heightened sensitivity to content length and type. They prefer well-crafted comedies that offer substantial entertainment value, blending both adult and children’s humor.\n- **Language & Accessibility:** The user maintains a clear preference for English-language content and values accessibility features like audio descriptions and closed captions, enhancing their viewing experience.\n- **Industry Connections:** The user shows a strong preference for projects featuring established comedic talents, including actors like Sandra Bullock and Melissa McCarthy, and directors such as Paul Feig, reinforcing their advocacy for renowned figures in the comedy sector.\n- **Overall Sentiment:** While generally positive towards comedy, the recent interaction highlights the user's discerning taste in family comedies, emphasizing their desire for quality storytelling and fair pricing. This indicates an evolving interest in comedic works that deliver both entertainment and perceived value for their investment.",
  "metrics": {
    "rouge1_f": 0.14717741935483872,
    "rouge2_f": 0.01414141414141414,
    "rougeL_f": 0.06451612903225806,
    "meteor": 0.04846412702277332,
    "bleu1": 0.005369117928364794,
    "bleu2": 0.001994900083394007,
    "bleu3": 0.0009312871860382067,
    "bleu4": 0.00027215822866654386,
    "bertscore_precision": 0.3472086489200592,
    "bertscore_recall": 0.42070433497428894,
    "bertscore_f1": 0.3804394006729126
  }
}