{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tombstone - The Director's Cut (Vista Series)\nReview Date: 2014/06/18\nStore: Kurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: [\"George P. Cosmatos presents the Director's Cut of his incredibly popular TOMBSTONE, the action-packed, star-studded western that brings the legendary feud between the Earps and the Clantons to life. Former U.S. Marshall Wyatt Earp's (Kurt Russell) plan for peace, quiet, and prosperity misfires when he, his brothers, and the outrageous rogue Doc Holliday (Val Kilmer) encounter that ruthless band of outlaws, the Clantons. Gripping performances and explosive action fill the screen in this legendary western about Tombstone and the gunfight at the O.K. Corral.\"]\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '786936158380', 'Director': 'George P. Cosmatos', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 15, 2002', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Powers Boothe', 'Subtitles': 'Spanish, French, English', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified', 'Studio': 'Hollywood Pictures Home Entertainment', 'Writers': 'Kevin Jarre', 'Number of discs': '1'}\nReview Text: I bought this as a gift for my father for Father's Day.  He used to have copy but it got lost somehow (not procured by his children as he claimed).  So I got him a replacement.  He was very happy.\nReview Title: Gift\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Sound of Music (Five Star Collection)\nRated:    G    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Musicals, General\n['Set Contains:', \"The first disc of this two-DVD set includes the film, plus the option to listen to audio commentary by director Robert Wise. During the songs and underscored passages, Wise's commentary is silent and the vocal tracks are removed, allowing the viewer to hear the score in isolation (or even sing along). The second disc is reserved for bonus material. In a 14-minute featurette from 1965,\", 'Salzburg: Sight and Sound', ', Charmian Carr (Liesl) narrates as she explores Salzburg and works on the set. More substantial is', 'The Sound of Music: From Fact to Phenomenon', ', an 87-minute documentary from 1994. Narrated by Claire Bloom, it includes biographical information and photos of the real Maria, clips from the 1956 German film', 'Die Trappe Familie', 'that inspired the Broadway musical, and details of the musical\\'s subsequent transformation into film. The movie\\'s creators and principals, including Robert Wise, Saul Chaplin, Julie Andrews, and Christopher Plummer, as well as members of the von Trapp family, contribute extensive comments, spotlight Maria von Trapp\\'s cameo in the film, explain the various sets and locations, and discuss the film\\'s effect on the family. The DVD also has seven previews and TV spots, four radio spots, several audio interviews with Andrews, Plummer, Wise, and others, and \"The Sound of Music Gallery,\" which offers stills and texts giving a history of Salzburg, production diaries and notes, and credits and a bibliography of recommended materials. DVD-ROM features include games and Web links.', '--David Horiuchi']\n{'Genre': 'Music Videos & Concerts', 'Format': 'Multiple Formats, Closed-captioned, Color, Special Edition, Widescreen, NTSC, THX', 'Contributor': 'Andrews, Plummer', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '9 x 5.5 x 1 inches; 6.4 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Special Edition, Widescreen, NTSC, THX', 'Release date': 'August 29, 2000', 'Actors': 'Andrews, Plummer', 'Studio': '20th Century Fox'}\nI bought this as a gift for my mother.  One of her (and my) favorite movies!  It was well received.\nGift\nTombstone - The Director's Cut (Vista Series)\nKurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"George P. Cosmatos presents the Director's Cut of his incredibly popular TOMBSTONE, the action-packed, star-studded western that brings the legendary feud between the Earps and the Clantons to life. Former U.S. Marshall Wyatt Earp's (Kurt Russell) plan for peace, quiet, and prosperity misfires when he, his brothers, and the outrageous rogue Doc Holliday (Val Kilmer) encounter that ruthless band of outlaws, the Clantons. Gripping performances and explosive action fill the screen in this legendary western about Tombstone and the gunfight at the O.K. Corral.\"]\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '786936158380', 'Director': 'George P. Cosmatos', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 15, 2002', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Powers Boothe', 'Subtitles': 'Spanish, French, English', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified', 'Studio': 'Hollywood Pictures Home Entertainment', 'Writers': 'Kevin Jarre', 'Number of discs': '1'}\nI bought this as a gift for my father for Father's Day.  He used to have copy but it got lost somehow (not procured by his children as he claimed).  So I got him a replacement.  He was very happy.\nGift",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user continues to show a strong affinity for classic films, now extending their appreciation to action-packed westerns. They value high-quality collections with extensive bonus content that enhance their viewing experience.\n\n- **Gift-Giving:** The user maintains a thoughtful and sentimental approach to gift-giving, as evidenced by their recent choice to replace a beloved movie for their father, indicating they take into account the emotional importance of shared memories in their selections.\n\n- **Family Influence:** Family tastes significantly shape the user's preferences, highlighting a deep sentimental connection to cinema shared with loved ones. They prioritize nostalgia and meaningful experiences over mere entertainment.\n\n- **Content Formats:** The user continues to prioritize DVDs, particularly those that provide special features, reflecting a sustained interest in behind-the-scenes insights and comprehensive media experiences.\n\n- **Ratings:** They consistently show a generous rating pattern, indicating a positive and enthusiastic outlook on their experiences with films and related products.\n\nOverall, the user remains someone who values classic cinema and family connections, cherishing the shared enjoyment of films while actively seeking out high-quality content for themselves and loved ones.",
  "metrics": {
    "rouge1_f": 0.17423312883435585,
    "rouge2_f": 0.002460024600246002,
    "rougeL_f": 0.0736196319018405,
    "meteor": 0.061465433300876345,
    "bleu1": 0.01892169814906784,
    "bleu2": 0.003138684378654362,
    "bleu3": 0.000636246628921021,
    "bleu4": 0.00028677114771078323,
    "bertscore_precision": 0.33833742141723633,
    "bertscore_recall": 0.472012996673584,
    "bertscore_f1": 0.39414963126182556
  }
}