{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Finding Nemo (Two-Disc Collector's Edition) [DVD]\nReview Date: 2014/07/15\nStore: Albert Brooks  (Actor),     Ellen DeGeneres  (Actor),     Lee Unkrich  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: ['Product Description', 'From the Academy Award(R)-winning creators of TOY STORY and MONSTERS, INC. (2001, Best Animated Short Film, FOR THE BIRDS), it\\'s FINDING NEMO, a hilarious adventure where you\\'ll meet colorful characters that take you into the breathtaking underwater world of Australia\\'s Great Barrier Reef. Nemo, an adventurous young clownfish, is unexpectedly taken to a dentist\\'s office aquarium. It\\'s up to Marlin (Albert Brooks), his worrisome father, and Dory (Ellen DeGeneres), a friendly but forgetful regal blue tang fish, to make the epic journey to bring Nemo home. Their adventure brings them face-to-face with vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more. Marlin discovers a bravery he never knew, but will he be able to find his son? FINDING NEMO\\'s breakthrough computer animation takes you into a whole new world with this undersea adventure about family, courage, and challenges. Take the plunge into FINDING NEMO, a \"spectacularly beautiful animated adventure for everyone\" -- David Sheehan, CBS-TV', 'Review', '\"Dizzy, dazzling hilarity \\x96 a DVD to cherish and enjoy over and over again.\" --', 'Gene Shalit, Today Show', '\"This DVD will reel you in, hook, line and sinker.\" --', 'Bruce Kluger, PARENTING MAGAZINE', 'Set Contains:', 'It\\'s not that the folks at Pixar are geniuses when it comes to DVDs... well, come to think of it, their fifth DVD set shows these folks are wizards. It\\'s not just that the two discs are packed with watchable extras that hardly reiterate the same information; it\\'s how they are handled--funny, inventive, with a light touch--unlike many PR-driven discs. A good place to start is the filmmakers\\' jolly commentary track, which branches off into 31 minutes of behind-the-scene stuff, deleted scenes, and curious anecdotes (they can also be watched separately). Pixar\\'s first making-of documentary is a most concise and interesting 25-minute examination that also sheds light on how the company works. With a digital-to-digital transfer, the film looks great and is available in widescreen or reformatted to full screen. The \"Family Fun\" disc includes another Pixar made-for-the-DVD gem, the 7-minute \"Exploring the Reef\" with Jean-Michel Cousteau (Jacques\\'s son) being upstaged by Dori and Marlin; it\\'s a hoot and teaches a fact or two you will remember about reefs. Both discs feature lovely menus that can be turned into virtual aquariums for your TV (by removing the text) featuring the knockout colors of the film\\'s settings. Watch long enough for some shenanigans from the film\\'s characters and vocal talent. Genius, pure genius.', '--Doug Thomas', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family, animation', 'Format': \"Anamorphic, Animated, Closed-captioned, Collector's Edition, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSCAnamorphic, Animated, Closed-captioned, Collector's Edition, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC   See more\", 'Contributor': 'Joe Ranft, Ellen DeGeneres, Vicki Lewis, Austin Pendleton, Albert Brooks, Brad Garrett, David Reynolds, Alexander Gould, Stephen Root, Willem Dafoe, Allison Janney, Andrew Stanton, Bob Peterson, Geoffrey Rush, Lee UnkrichJoe Ranft, Ellen DeGeneres, Vicki Lewis, Austin Pendleton, Albert Brooks, Brad Garrett, David Reynolds, Alexander Gould, Stephen Root, Willem Dafoe, Allison Janney, Andrew Stanton, Bob Peterson, Geoffrey Rush, Lee Unkrich   See more', 'Language': 'French, English (Dolby Digital 5.1 EX), Spanish (Dolby Digital 5.1 EX), Unqualified (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1 Pounds', 'Item model number': '30078', 'Director': 'Andrew Stanton, Lee Unkrich', 'Media Format': \"Anamorphic, Animated, Closed-captioned, Collector's Edition, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC\", 'Run time': '1 hour and 40 minutes', 'Release date': 'November 4, 2003', 'Actors': 'Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe, Brad Garrett', 'Subtitles': 'Spanish, French', 'Studio': 'Walt Disney Video / Pixar', 'Writers': 'Andrew Stanton, Bob Peterson, David Reynolds', 'Number of discs': '2'}\nReview Text: I like this movie very much.  The animated sea-creatures actually somewhat like they would in real life.\nReview Title: Nemo\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Sound of Music (Five Star Collection)\nRated:    G    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Musicals, General\n['Set Contains:', \"The first disc of this two-DVD set includes the film, plus the option to listen to audio commentary by director Robert Wise. During the songs and underscored passages, Wise's commentary is silent and the vocal tracks are removed, allowing the viewer to hear the score in isolation (or even sing along). The second disc is reserved for bonus material. In a 14-minute featurette from 1965,\", 'Salzburg: Sight and Sound', ', Charmian Carr (Liesl) narrates as she explores Salzburg and works on the set. More substantial is', 'The Sound of Music: From Fact to Phenomenon', ', an 87-minute documentary from 1994. Narrated by Claire Bloom, it includes biographical information and photos of the real Maria, clips from the 1956 German film', 'Die Trappe Familie', 'that inspired the Broadway musical, and details of the musical\\'s subsequent transformation into film. The movie\\'s creators and principals, including Robert Wise, Saul Chaplin, Julie Andrews, and Christopher Plummer, as well as members of the von Trapp family, contribute extensive comments, spotlight Maria von Trapp\\'s cameo in the film, explain the various sets and locations, and discuss the film\\'s effect on the family. The DVD also has seven previews and TV spots, four radio spots, several audio interviews with Andrews, Plummer, Wise, and others, and \"The Sound of Music Gallery,\" which offers stills and texts giving a history of Salzburg, production diaries and notes, and credits and a bibliography of recommended materials. DVD-ROM features include games and Web links.', '--David Horiuchi']\n{'Genre': 'Music Videos & Concerts', 'Format': 'Multiple Formats, Closed-captioned, Color, Special Edition, Widescreen, NTSC, THX', 'Contributor': 'Andrews, Plummer', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '9 x 5.5 x 1 inches; 6.4 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Special Edition, Widescreen, NTSC, THX', 'Release date': 'August 29, 2000', 'Actors': 'Andrews, Plummer', 'Studio': '20th Century Fox'}\nI bought this as a gift for my mother.  One of her (and my) favorite movies!  It was well received.\nGift\nTombstone - The Director's Cut (Vista Series)\nKurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"George P. Cosmatos presents the Director's Cut of his incredibly popular TOMBSTONE, the action-packed, star-studded western that brings the legendary feud between the Earps and the Clantons to life. Former U.S. Marshall Wyatt Earp's (Kurt Russell) plan for peace, quiet, and prosperity misfires when he, his brothers, and the outrageous rogue Doc Holliday (Val Kilmer) encounter that ruthless band of outlaws, the Clantons. Gripping performances and explosive action fill the screen in this legendary western about Tombstone and the gunfight at the O.K. Corral.\"]\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '786936158380', 'Director': 'George P. Cosmatos', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 15, 2002', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Powers Boothe', 'Subtitles': 'Spanish, French, English', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified', 'Studio': 'Hollywood Pictures Home Entertainment', 'Writers': 'Kevin Jarre', 'Number of discs': '1'}\nI bought this as a gift for my father for Father's Day.  He used to have copy but it got lost somehow (not procured by his children as he claimed).  So I got him a replacement.  He was very happy.\nGift\nStar Trek III: The Search for Spock (Two-Disc Special Collector's Edition) [DVD]\nJudith Anderson  (Actor),     Merritt Butrick  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\n['Product description', 'Star Trek III: The Search for Spock (Two-Disc', 'Set Contains:', 'Star Trek III: The Search for Spock', 'follows the same winning formula of the first two', 'Star Trek', 'special-edition DVD releases, although it has no extra footage as', 'The Motion Picture', 'and', 'The Wrath of Khan', 'did. The first disc presents the film with an audio commentary track, the bulk of it handled (appropriately) by director Leonard Nimoy. He doesn\\'t do it in character as Spock, but rather chortles and gushes about his cast and crew, especially William Shatner. Other contributors include Robin Curtis, who explains how Nimoy and writer Harve Bennett made it easy for her to take over Kirstie Alley\\'s role as Saavik. There\\'s also a subtitled commentary track full of trivia and details by Michael Okuda, joined this time by wife Denise. If you want, you can listen to the audio commentary while reading the subtitled commentary. The second disc offers the basic \"Captain\\'s Log\" documentary (2002, 26 min.) plus substantial documentaries about models, creatures, and Klingon and Vulcan languages and costumes. Last, in \"Terraforming and the Prime Directive,\" scientists discuss how a Genesis-like project could lead to humans colonizing Mars.', '--David Horiuchi']\n{'Format': 'Closed-captioned, Anamorphic, Color, Dolby, Subtitled, Widescreen, NTSC, DVD', 'Contributor': 'Miguel Ferrer, George Takei, Dave Cadiente, Chuck Hicks, Jim Halty, Doug Shanklin, Stephen Liska, Don Charles McGovern, Tom Morga, Robert Cummings, Judith Anderson, Leonard Nimoy, Teresa E. Victor, Vadia Potenza, John Meier, Eddy Donno, Judi M. Durand, Alan Oliney, Jeanne Mori, Alan Jones, Frank Force, Jeff Jensen, James B. Sikking, Scott McGinnis, Conroy Gedeon, Danny Rogers, Christopher Lloyd, Cathie Shirriff, Carl Steven, John Larroquette, James Doohan, William Shatner, Sharon Thomas, Phil Chong, Phil Morris, Nichelle Nichols, Allan Miller, Chuck Picerni, Jr., Phillip Richard Allen, Stephen Manley, Paul Sorenson, Mark Lenard, Walter Koenig, Gary Faga, Frank Welker, Joe W. Davis, DeForest Kelley, Branscombe Richmond, Grace Lee Whitney, Robin Curtis, Mario Marcelino, Merritt Butrick, Kenny Endoso, Harve Bennett, Robert Hooks, Bobby CummingsMiguel Ferrer, George Takei, Dave Cadiente, Chuck Hicks, Jim Halty, Doug Shanklin, Stephen Liska, Don Charles McGovern, Tom Morga, Robert Cummings, Judith Anderson, Leonard Nimoy, Teresa E. Victor, Vadia Potenza, John Meier, Eddy Donno, Judi M. Durand, Alan Oline…   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 45 minutes', 'Studio': 'Paramount', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 0.01 Ounces', 'Director': 'Leonard Nimoy', 'Media Format': 'Closed-captioned, Anamorphic, Color, Dolby, Subtitled, Widescreen, NTSC, DVD', 'Run time': '1 hour and 45 minutes', 'Release date': 'October 22, 2002', 'Actors': 'Judith Anderson, Merritt Butrick, Phil Chong, Robin Curtis, Joe W. Davis', 'Subtitles': 'English', 'Number of discs': '2'}\nThis is one of my favorite Star Trek movies.  I was glad to a special edition because I like to watch behind-the-scenes notes.\nThe third one\nElla Enchanted\nAnne Hathaway  (Actor),     Hugh Dancy  (Actor),     Tommy O'Haver  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Product Description', \"Anne Hathaway, the delightful star of THE PRINCESS DIARIES, is Ella in the charming fairy tale adventure ELLA ENCHANTED. On the day of her birth, Ella is given a gift by her Fairy Godmother -- the gift of obedience, which is also a curse. Under no circumstances can Ella refuse anything she is asked to do, no matter how wicked it may be. Tired of being taken advantage of, Ella, with a talking book as her companion, leaves home to find her Fairy Godmother and return her unwanted gift. This simple errand soon turns into an amazing journey filled with ogres, giants, wicked stepsisters, elves, and the plotting of Prince Charmont's evil uncle who wants to take over the Crown and rule the kingdom. Bursting with colorful characters, music, wit, and whimsy, ELLA ENCHANTED is a truly enchanting and heartwarming tale that will captivate the entire family.\", 'Review', '\"It\\'s a high-spirited charmer, a fantasy that sparkles with delights.\" --', 'Roger Ebert, CHICAGO SUN-TIMES', '\"Its knockabout humor grows on you, as does Anne Hathaway.\" --', 'Gene Seymour, NEWSDAY', '\"One of the most funshining and clever family films made in the past few years.\" --', 'Phil Villarreal, ARIZONA DAILY STAR', '\"The film\\'s lush scenery and sharp modern twists cast a powerful spell.\" --', \"Angel Cohn, TV GUIDE'S MOVIE GUIDE\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'MFR786936244892#VG', 'Director': \"Tommy O'Haver\", 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 24, 2004', 'Actors': 'Anne Hathaway, Hugh Dancy, Cary Elwes, Joanna Lumley, Aidan McArdle', 'Language': 'Unqualified', 'Studio': 'Miramax', 'Writers': 'Gail Carson Levine, Jennifer Heath, Karen McCullah Lutz, Kirsten Smith, Laurie Craig', 'Number of discs': '1'}\nI really adore this movie.  It's a classic fairy tale with a twist.\nElla\nShrek - The Story So Far (Shrek 1 & 2 Full Screen / Shrek 3D - Party in the Swamp) [DVD]\nMike Myers  (Actor),     Eddie Murphy  (Actor),     Andrew Adamson  (Director),     Vicky Jenson  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['SHREK: THE STORY SO FAR (4-Disc DVD Collection) is perfect for Shrek fans and gift givers! This super Shrek set gives consumers all of the Shrek movies in one place plus even more of what they love about Shrek with an extra bonus features DVD! It includes the following: \"Shrek\" (single disc full-frame), \"Shrek 3-D\" including a collectible lenticular and four sets of 3-D glasses, \"Shrek 2\" (full frame) and a special bonus disc featuring entertaining exclusives not available in the Shrek 2 DVD/VHS (features subject to change)! There\\'s nearly an hour of entertainment on this disc alone including: Puss In Boots Music Video, Learn How to Burp with Shrek and Fiona, A Making-Of Featurette, \"Shrek 2\" Around the World, Learn To Draw Shrek, Donkey and Puss In Boots.']\n{'Genre': 'Music Videos & Concerts', 'Format': 'Anamorphic, Animated, Box set, Closed-captioned, Color, Dolby, DVD, NTSC, Full Screen', 'Contributor': 'Antonio Banderas, Julie Andrews, Eddie Murphy, John Lithgow, Vicky Jenson, Rupert Everett, Jennifer Saunders, Andrew Adamson, Mike Myers, Cameron Diaz, John CleeseAntonio Banderas, Julie Andrews, Eddie Murphy, John Lithgow, Vicky Jenson, Rupert Everett, Jennifer Saunders, Andrew Adamson, Mike Myers, Cameron Diaz, John Cleese   See more', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '3 hours and 17 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '8.25 x 6 x 2.25 inches; 1.4 Pounds', 'Director': 'Andrew Adamson, Vicky Jenson', 'Media Format': 'Anamorphic, Animated, Box set, Closed-captioned, Color, Dolby, DVD, NTSC, Full Screen', 'Run time': '3 hours and 17 minutes', 'Release date': 'November 5, 2004', 'Actors': 'Mike Myers, Eddie Murphy, Cameron Diaz, John Lithgow, Antonio Banderas', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Dreamworks Animated', 'Number of discs': '4'}\nMy order was canceled but I liked the first Shrek movie.\nDid not receive\nDogma (Special Edition) [DVD]\nMatt Damon  (Actor),     Ben Affleck  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"One of the most talked-about movies of the year is also one of the funniest! In this hilarious comic fantasy from writer/director Kevin Smith (Clerks, Chasing Amy) two banished angels (Ben Affleck and Matt Damon) find a loophole that would get them back into Heaven. The only snag? They'll be destroying existence in the process. In an effort to stop them, The overworked Voice of God (Alan Rickman)taps cynical mortal Bethany (Linda Fiorentino) to save the world by preventing the angels from reaching their unholy destination: New Jersey! Throw in two unlikely prophets named Jay and Silent Bob (Jason Mewes and Kevin Smith), the quick-witted yet little-known thirteenth apostle (Chris Rock) and a sexy, former muse with a case of writer's block (Selma Hayek) and you've got an hysterical and thrilling race against time packed with an all-star cast.\"]\n{'Genre': 'Faith-Based, Comedy', 'Format': 'Color, Closed-captioned, Widescreen, NTSC, Special Edition, DVD, Subtitled, Anamorphic, Dolby', 'Contributor': 'Matt Damon, Kevin Smith, Jason Lee, Salma Hayek, George Carlin, Ben Affleck, Jason Mewes, Linda FiorentinoMatt Damon, Kevin Smith, Jason Lee, Salma Hayek, George Carlin, Ben Affleck, Jason Mewes, Linda Fiorentino   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 7.36 Ounces', 'Media Format': 'Color, Closed-captioned, Widescreen, NTSC, Special Edition, DVD, Subtitled, Anamorphic, Dolby', 'Run time': '2 hours and 13 minutes', 'Release date': 'January 2, 2008', 'Actors': 'Matt Damon, Ben Affleck, Kevin Smith, Salma Hayek, George Carlin', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nI bought this for my sister Hannah because she really likes this movie.  Well received.\nGift\nFinding Nemo (Two-Disc Collector's Edition) [DVD]\nAlbert Brooks  (Actor),     Ellen DeGeneres  (Actor),     Lee Unkrich  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', 'From the Academy Award(R)-winning creators of TOY STORY and MONSTERS, INC. (2001, Best Animated Short Film, FOR THE BIRDS), it\\'s FINDING NEMO, a hilarious adventure where you\\'ll meet colorful characters that take you into the breathtaking underwater world of Australia\\'s Great Barrier Reef. Nemo, an adventurous young clownfish, is unexpectedly taken to a dentist\\'s office aquarium. It\\'s up to Marlin (Albert Brooks), his worrisome father, and Dory (Ellen DeGeneres), a friendly but forgetful regal blue tang fish, to make the epic journey to bring Nemo home. Their adventure brings them face-to-face with vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more. Marlin discovers a bravery he never knew, but will he be able to find his son? FINDING NEMO\\'s breakthrough computer animation takes you into a whole new world with this undersea adventure about family, courage, and challenges. Take the plunge into FINDING NEMO, a \"spectacularly beautiful animated adventure for everyone\" -- David Sheehan, CBS-TV', 'Review', '\"Dizzy, dazzling hilarity \\x96 a DVD to cherish and enjoy over and over again.\" --', 'Gene Shalit, Today Show', '\"This DVD will reel you in, hook, line and sinker.\" --', 'Bruce Kluger, PARENTING MAGAZINE', 'Set Contains:', 'It\\'s not that the folks at Pixar are geniuses when it comes to DVDs... well, come to think of it, their fifth DVD set shows these folks are wizards. It\\'s not just that the two discs are packed with watchable extras that hardly reiterate the same information; it\\'s how they are handled--funny, inventive, with a light touch--unlike many PR-driven discs. A good place to start is the filmmakers\\' jolly commentary track, which branches off into 31 minutes of behind-the-scene stuff, deleted scenes, and curious anecdotes (they can also be watched separately). Pixar\\'s first making-of documentary is a most concise and interesting 25-minute examination that also sheds light on how the company works. With a digital-to-digital transfer, the film looks great and is available in widescreen or reformatted to full screen. The \"Family Fun\" disc includes another Pixar made-for-the-DVD gem, the 7-minute \"Exploring the Reef\" with Jean-Michel Cousteau (Jacques\\'s son) being upstaged by Dori and Marlin; it\\'s a hoot and teaches a fact or two you will remember about reefs. Both discs feature lovely menus that can be turned into virtual aquariums for your TV (by removing the text) featuring the knockout colors of the film\\'s settings. Watch long enough for some shenanigans from the film\\'s characters and vocal talent. Genius, pure genius.', '--Doug Thomas', 'See more']\n{'Genre': 'Family, animation', 'Format': \"Anamorphic, Animated, Closed-captioned, Collector's Edition, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSCAnamorphic, Animated, Closed-captioned, Collector's Edition, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC   See more\", 'Contributor': 'Joe Ranft, Ellen DeGeneres, Vicki Lewis, Austin Pendleton, Albert Brooks, Brad Garrett, David Reynolds, Alexander Gould, Stephen Root, Willem Dafoe, Allison Janney, Andrew Stanton, Bob Peterson, Geoffrey Rush, Lee UnkrichJoe Ranft, Ellen DeGeneres, Vicki Lewis, Austin Pendleton, Albert Brooks, Brad Garrett, David Reynolds, Alexander Gould, Stephen Root, Willem Dafoe, Allison Janney, Andrew Stanton, Bob Peterson, Geoffrey Rush, Lee Unkrich   See more', 'Language': 'French, English (Dolby Digital 5.1 EX), Spanish (Dolby Digital 5.1 EX), Unqualified (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1 Pounds', 'Item model number': '30078', 'Director': 'Andrew Stanton, Lee Unkrich', 'Media Format': \"Anamorphic, Animated, Closed-captioned, Collector's Edition, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC\", 'Run time': '1 hour and 40 minutes', 'Release date': 'November 4, 2003', 'Actors': 'Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe, Brad Garrett', 'Subtitles': 'Spanish, French', 'Studio': 'Walt Disney Video / Pixar', 'Writers': 'Andrew Stanton, Bob Peterson, David Reynolds', 'Number of discs': '2'}\nI like this movie very much.  The animated sea-creatures actually somewhat like they would in real life.\nNemo",
  "profile": "**Updated User Profile Summary:**\n\nThe user maintains a strong passion for classic films, particularly family-friendly narratives that blend fantasy with modern twists. Recent acquisitions showcase their continued interest in animated films that resonate with both children and adults, emphasizing their preference for stories that evoke nostalgia and family connections. \n\nTheir thoughtful approach to gift-giving further highlights their commitment to personal connections, as seen in their recent purchases, which prioritize shared viewing experiences. Family interactions are a key influence on their cinematic choices, reinforcing their desire for films that cater to a wide audience and foster collective enjoyment.\n\nThe user exhibits a clear preference for DVDs, especially editions featuring enriched bonus content that enhances storytelling depth and provides behind-the-scenes insights. This aligns with their appreciation for high-quality productions and well-crafted narratives in their film selections, contributing to a positive rating trend that reflects their discerning taste.\n\nOverall, the user embodies a diverse cinematic interest—balancing classic films with captivating stories—while their gift-giving and emphasis on family-centric experiences underline their sentimental values and enriched viewing practices. The recent addition to their collection highlights their enjoyment of animated family films that combine humor and adventure, appealing to their enduring love for engaging storytelling.",
  "metrics": {
    "rouge1_f": 0.06533460196638122,
    "rouge2_f": 0.004443033957473818,
    "rougeL_f": 0.03742467491278147,
    "meteor": 0.01771182878433544,
    "bleu1": 6.181145025775947e-09,
    "bleu2": 2.225373328113038e-09,
    "bleu3": 3.2144990390953173e-10,
    "bleu4": 1.2231097169883704e-10,
    "bertscore_precision": 0.32071736454963684,
    "bertscore_recall": 0.5050866007804871,
    "bertscore_f1": 0.39232081174850464
  }
}