{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/06/12\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Sam Miller'], 'Producers': ['Will Packer', 'Lee Clay'], 'Starring': ['Idris Elba', 'Taraji P. Henson', 'Kate del Castillo'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nReview Text: The movie was good, had she not invited a stranger into her house, then there wouldn't have been a movie. That part was unbelievable. If there is a strange man standing at my doorstep asking to come into my house, and he is not a service person with a pre-arranged appointment, there is no way in hell he is getting past the threshold.\nReview Title: First of all...\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Schwentke'], 'Producers': ['Douglas Wick', 'Lucy Fisher', 'Pouya Shahbazian'], 'Starring': ['Shailene Woodley', 'Theo James', 'Octavia Spencer']}\nGreat movie!\nGreat movie\n{'Content advisory': ['Violence', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth']}\nI expected more, but it was enough so that I could see Part 2 without wondering what happened in Part 1.\nExpected More\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Marc Forster'], 'Producers': ['Marc Forster', 'Mark Bakshi', 'Ian Bryce', 'David Ellison', 'Dede Gardner', 'Dana Goldberg', 'Tim Headington', 'Mark Huffam', 'Graham King', 'Jeremy Kleiner'], 'Starring': ['Brad Pitt', 'Mireille Enos', 'James Badgen Dale'], 'Studio': ['Paramount Pictures Corp.']}\nI would add this movie to my personal collection! WoW!\nWoW! Here's One for the Personal Collection!\n{'Content advisory': ['Violence', 'frightening scenes', 'substance use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English Dialogue Boost: High', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Cornish'], 'Producers': ['Nira Park', 'James Wilson'], 'Starring': ['John Boyega', 'Jodie Whittaker'], 'Studio': ['Epix']}\nGood, Even though the lighting in the movie was set at night. The night time set was a bit distracting, could barely see some of the characters interacting with the monsters in the apartment.\nGood Enough\nHow I Live Now\nInternational, Drama, Bleak, Eerie\n['Set in the near-future UK, Saoirse Ronan plays Daisy, an American teenager sent to stay with relatives in the English countryside. Initially withdrawn and alienated, she begins to warm up to her charming surroundings and strikes up a romance with the handsome Edmund (George MacKay). But on the fringes of their idyllic summer days are tense news reports of an escalating conflict in Europe. As the UK falls into a violent, chaotic military state, Daisy finds herself hiding and fighting to survive.']\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Kevin Macdonald'], 'Producers': ['Andrew Ruhemann', 'John Battsek', 'Charles Steel', 'Alasdair Flind'], 'Starring': ['Saoirse Ronan', 'George MacKay', 'Tom Holland']}\nI had high expectations for this movie since I saw that it was Sci-Fiction. Now while I was expecting aliens from outer space to impact the character's lives...apparently I knew nothing about it other than the preview and my imagination ran away filling in the blanks. It was a haunting story and exceeded my expectations even without the aliens since there weren't any. It was one of the best coming of age stories in an apocalyptic world that I have ever seen. The actors and actresses did a wonderful job securing the hopelessness and futility of nuclear war in a developed country.\nA Haunting Film\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Sam Miller'], 'Producers': ['Will Packer', 'Lee Clay'], 'Starring': ['Idris Elba', 'Taraji P. Henson', 'Kate del Castillo'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nThe movie was good, had she not invited a stranger into her house, then there wouldn't have been a movie. That part was unbelievable. If there is a strange man standing at my doorstep asking to come into my house, and he is not a service person with a pre-arranged appointment, there is no way in hell he is getting past the threshold.\nFirst of all...",
  "profile": "**Updated User Profile Summary:**\n\n- **Preference for Quality Entertainment**: The user continues to demonstrate a strong preference for high-caliber films, reflected in their average rating of 4.3. Their recent interaction, showcasing a rating of 3.0, indicates a nuanced but critical perspective toward narrative credibility, emphasizing their demand for logical coherence in storytelling.\n\n- **Interest in Specific Genres**: The user's enthusiasm for engaging dramas remains consistent, now further emphasizing their desire for realism within complex narratives. They appreciate thought-provoking tales that delve into human experiences, though they are increasingly discerning about plot plausibility.\n\n- **Value for Accessibility**: The user's priority for content featuring English audio with subtitles for enhanced comprehension persists, reinforcing their commitment to diverse storytelling.\n\n- **Engagement with Popular Titles**: While they enjoy mainstream films, the user has illustrated a readiness to critically engage with a wider array of stories, particularly those that may challenge conventional expectations.\n\n- **Critical Review Behavior**: The user's review behavior reflects an evolving critical lens, where they articulate thoughtful observations about narrative structure and logical consistency, balancing their enjoyment of compelling narratives with a demand for believable scenarios.\n\nOverall, the user maintains a strong appreciation for high-quality productions, accessibility, and realistic storytelling, indicating their dynamic engagement with cinema continues to mature and evolve based on their experiences.",
  "metrics": {
    "rouge1_f": 0.15344603381014305,
    "rouge2_f": 0.0052151238591916565,
    "rougeL_f": 0.08062418725617686,
    "meteor": 0.05352571561554572,
    "bleu1": 0.024982800577332927,
    "bleu2": 0.004033847721647023,
    "bleu3": 0.0008102333923741242,
    "bleu4": 0.00036346522316007065,
    "bertscore_precision": 0.3356837034225464,
    "bertscore_recall": 0.4065260887145996,
    "bertscore_f1": 0.3677240014076233
  }
}