{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Heroes: Season 3 [Blu-ray]\nReview Date: 2020/11/03\nStore: Masi Oka  (Actor),     Hayden Panettiere  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Experience all the explosive action and shocking twists as Heroes: Season 3 comes to Blu-ray™ Hi-Def! Rediscover the phenomenon in this five-disc set that includes all 25 suspenseful episodes from the third season’s volumes, Villains and Fugitives. Plus, go behind the scenes with the show’s writers, stars and artists as you explore hours of exclusive and revealing bonus features.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Jack Coleman, Ali Larter, James K. Lee, Masi Oka, Adrian Pasdar, Greg Grunberg, Dania Ramirez, Sendhil Ramamurthy, Hayden Panettiere, Milo Ventimiglia, Christine Rose, Tim Kring, Zachary QuintoJack Coleman, Ali Larter, James K. Lee, Masi Oka, Adrian Pasdar, Greg Grunberg, Dania Ramirez, Sendhil Ramamurthy, Hayden Panettiere, Milo Ventimiglia, Christine Rose, Tim Kring, Zachary Quinto  See more', 'Initial release date': '2009-09-01', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '5823036', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '17 hours and 55 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Masi Oka, Hayden Panettiere, Zachary Quinto, Sendhil Ramamurthy, Milo Ventimiglia', 'Subtitles': 'French, Spanish', 'Producers': 'Tim Kring', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Blu-ray is my favorite media. One of my favorite series when it was on the air.  Blu-ray provides a beautiful picture.\nReview Title: I like it.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Les Misérables (2012) [Blu-ray]\nHugh Jackman  (Actor),     Russell Crowe  (Actor),     Tom Hooper  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Hugh Jackman, Academy Award® winner Russell Crowe and Anne Hathaway star in this critically-acclaimed adaptation of the epic musical phenomenon. Set against the backdrop of 19th-century France, Les Misérables tells the story of ex-prisoner Jean Valjean (Jackman), hunted for decades by the ruthless policeman Javert (Crowe), after he breaks parole. When Valjean agrees to care for factory worker Fantine\\'s (Hathaway) young daughter, Cosette, their lives change forever. This enthralling story is a timeless testament to the survival of the human spirit and \"an unforgettable experience\" (Richard Roeper, RichardRoeper.com).', 'Bonus Content:', 'Les Miserables: A Revolutionary Approach: The Stars of Les Misérable', 'Les Miserables: A Revolutionary Approach: The Stars of Les Misérable', 'Les Miserables: A Revolutionary Approach: The West End Connection', 'Les Miserables: A Revolutionary Approach: The West End Connection', 'Les Miserables: A Revolutionary Approach: Les Misérables on Location', 'Les Miserables: A Revolutionary Approach: Les Misérables on Location', 'Les Miserables: A Revolutionary Approach: Creating the Perfect Paris', 'Les Miserables: A Revolutionary Approach: Creating the Perfect Paris', 'Les Miserables: A Revolutionary Approach: Battle at the Barricade', 'Les Miserables: A Revolutionary Approach: Battle at the Barricade', 'Les Miserables: A Revolutionary Approach: Les Misérables Singing Live', 'Les Miserables: A Revolutionary Approach: Les Misérables Singing Live', \"The Original Masterwork: Victor Hugo's Les Misérables\", \"The Original Masterwork: Victor Hugo's Les Misérables\", 'Feature Commentary with Director Tom Hooper', 'Feature Commentary with Director Tom Hooper', ']]>']\n{'Genre': 'Musicals & Performing Arts/Musicals, Drama', 'Format': 'NTSC, Subtitled', 'Contributor': 'Amanda Seyfried, Eric Fellner, Eve Stewart, Herbert Kretzmer, Anne Hathaway, William Nicholson, Cameron Mackintosh, Paco Delgado, Russell Crowe, Debra Hayward, Mark Paterson, Helena Bonham Carter, Andy Nelson, Tom Hooper, Anna Lynch-Robinson, Tim Bevan, Claude-Michel Schonberg, Simon Hayes, Hugh Jackman, Eddie Redmayne, Sacha Baron Cohen, Alain BoublilAmanda Seyfried, Eric Fellner, Eve Stewart, Herbert Kretzmer, Anne Hathaway, William Nicholson, Cameron Mackintosh, Paco Delgado, Russell Crowe, Debra Hayward, Mark Paterson, Helena Bonham Carter, Andy Nelson, Tom Hooper, Anna Lynch-Robinson, Tim B…   See more', 'Initial release date': '2019-01-15', 'Language': 'English (DTS 5.1), English (DTS-HD Master Audio 7.1)', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.26 Ounces', 'Director': 'Tom Hooper', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 38 minutes', 'Release date': 'January 15, 2019', 'Actors': 'Hugh Jackman, Russell Crowe, Anne Hathaway, Amanda Seyfried, Eddie Redmayne', 'Subtitles': 'Spanish, French', 'Producers': 'Tim Bevan, Eric Fellner, Debra Hayward, Cameron Mackintosh', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Nicholson, Alain Boublil, Claude-Michel Schonberg, Herbert Kretzmer', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA good show, a great price fast delivery, I'd buy it again but I already got it!\nI liked it a lot.\nNCIS: Season 7 [DVD]\nDavid McCallum  (Actor),     Cote de Pablo  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'AC-3, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Sean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael WeatherlySean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael Weatherly   See more', 'Language': 'English', 'Number Of Discs': '6'}\nI used it for home viewing.  I liked it a lot\nFast delivery, great product\nHeroes: Season 4 [Blu-ray]\nMilo Ventimiglia  (Actor),     Zachary Quinto  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Experience all the intrigue and suspense of', 'Heroes: Season Four', 'in this 4-disc set that includes all 18 gripping episodes from the fourth season’s volume, \"Redemption.\" As the Heroes mourn fallen friends and face dangerous new foes, prepare for a wild ride -- filled with shocking twists and turns -- through an ominous funhouse that culminates in a Brave New World.']\n{'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Contributor': 'Milo Ventimiglia, Zachary Quinto', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '13 hours and 33 minutes', 'Release date': 'August 3, 2010', 'Actors': 'Milo Ventimiglia, Zachary Quinto', 'Subtitles': 'French, Spanish', 'Studio': 'Universal', 'Number of discs': '4'}\nI bought this to add to my video collection.  I watched it on broadcast TV and haven't opened it.\nfast delivery in perfect condition\nLongmire: The Complete Sixth and Final Season (DVD)\nRobert Taylor  (Actor),     Katee Sackhoff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Longmire: The Complete Sixth and Final Season (DVD)', 'Season Six of Longmire finds Sheriff Walt Longmire (Robert Taylor), his deputies Vic Moretti (Katee Sackhoff), and The Ferg (Adam Bartley), his best friend Henry Standing Bear (Lou Diamond Phillips), and daughter, Cady (Cassidy Freeman) facing the biggest personal and professional crises of their lives. Walt’s job and home are under threat by a powerful, but unscrupulous lawyer. Vic must decide what to do about her secret pregnancy. Ferg struggles to balance a new relationship with his commitment to his job. Cady is torn between her loyalties to dueling father figures. And Henry’s very life is in danger as an old nemesis is bent on revenge. With their world in turmoil, Walt and all the people he cares about most must ultimately face the most difficult decision of their lives: when is it time to pack it in, and when is it time to fight to the end?', ']]>']\n{'Genre': 'Drama, Westerns, Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Lou Diamond Phillips, Robert Taylor, Adam Bartley, Craig Johnson, Cassidy Freeman, Greer Shephard, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt BaldwinLou Diamond Phillips, Robert Taylor, Adam Bartley, Craig Johnson, Cassidy Freeman, Greer Shephard, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt Baldwin   See more', 'Number Of Discs': '2', 'Runtime': '600 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Item model number': '1000693157', 'Media Format': 'DVD, NTSC', 'Run time': '600 minutes', 'Release date': 'November 20, 2018', 'Actors': 'Robert Taylor, Katee Sackhoff, Lou Diamond Phillips, Cassidy Freeman, Adam Bartley', 'Producers': 'Greer Shephard, Michael M. Robin, Hunt Baldwin, John Coveny', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI am so glad that this season is out there.  I thought the series only had 5!  I wish there were more, but that's life.\nPromptly arrived in new condition\nLongmire: The Complete Fifth Season (DVD)\nRobert Taylor  (Actor),     Katee Sackhoff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Longmire: The Complete Fifth Season (DVD)', \"Longmire’s fifth season finds Sheriff Walt Longmire in the crosshairs of a wrongful-death civil suit by Barlow Connally's estate. With his best friend and daughter working for his nemesis, Jacob Nighthorse, and new mysteries and cases weighing down Walt and his team of deputies, the noble but stubborn Sheriff doubles down on his own self-reliance. And it just might be his downfall...\", ']]>']\n{'Genre': 'Drama, Westerns, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Lou Diamond Phillips, Bailey Chase, Robert Taylor, Adam Bartley, Craig Johnson, Greer Shephard, Cassidy Freeman, A Martinez, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt BaldwinLou Diamond Phillips, Bailey Chase, Robert Taylor, Adam Bartley, Craig Johnson, Greer Shephard, Cassidy Freeman, A Martinez, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt Baldwin   See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Media Format': 'NTSC', 'Release date': 'September 26, 2017', 'Actors': 'Robert Taylor, Katee Sackhoff, Lou Diamond Phillips, Cassidy Freeman, Bailey Chase', 'Dubbed': 'English', 'Producers': 'Greer Shephard, Michael M. Robin, Hunt Baldwin, John Coveny', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nIt's a great product.  Unfortunately, I misordered intending to buy season six.  I already have season 5.  I corrected that mistake and intend to donate the extra copy.\nIt's a season of my favorite police drama TV series.\nTitans: The Complete Second Season (Blu-ray + Digital)\nBrenton Thwaites  (Actor),     Anna Diop  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Titans: The Complete Second Season (Blu-ray + Digital)', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC, Blu-ray', 'Contributor': 'Greg Berlanti, Joshua Orpin, Alan Ritchson, Greg Walker, Conor Leslie, Sarah Schechter, Minka Kelly, Geoff Johns, Chelsea Zhang, Teagan Croft, John Fawcett, Esai Morales, Brenton Thwaites, Akiva Goldsman, Ryan Potter, Curran Walters, Anna DiopGreg Berlanti, Joshua Orpin, Alan Ritchson, Greg Walker, Conor Leslie, Sarah Schechter, Minka Kelly, Geoff Johns, Chelsea Zhang, Teagan Croft, John Fawcett, Esai Morales, Brenton Thwaites, Akiva Goldsman, Ryan Potter, Curran Walters, Anna Diop  See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.67 Ounces', 'Item model number': 'BR750620', 'Media Format': 'NTSC, Blu-ray', 'Run time': '576 minutes', 'Release date': 'March 3, 2020', 'Actors': 'Brenton Thwaites, Anna Diop, Teagan Croft, Ryan Potter, Curran Walters', 'Subtitles': 'English', 'Producers': 'Akiva Goldsman, Geoff Johns, Greg Berlanti, Greg Walker, Sarah Schechter', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI like the story line.  the production is Great!  Blu-ray is my favorite media.\nI hope there's a third season\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Alan Fine'], 'Starring': ['Charlie Cox', 'Deborah Ann Woll', 'Elden Henson'], 'Studio': ['Marvel Television']}\nI wanted it on any media but prime video or streaming.  I looked at it on Amazon.  I tried to leave the site since it isn't available on DVD or Blu-ray.  The next day I was notified I had bought it for 29.99.  I can find NO WAY to contact Prime video.  I DON'T do streaming.  Seasons 1 & 2 were great.  I bet 3 is too.  Someday I'll buy it on Blu-ray or DVD.\nI wanted it on any media but prime video or streaming\nHeroes: Season 3 [Blu-ray]\nMasi Oka  (Actor),     Hayden Panettiere  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Experience all the explosive action and shocking twists as Heroes: Season 3 comes to Blu-ray™ Hi-Def! Rediscover the phenomenon in this five-disc set that includes all 25 suspenseful episodes from the third season’s volumes, Villains and Fugitives. Plus, go behind the scenes with the show’s writers, stars and artists as you explore hours of exclusive and revealing bonus features.']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Jack Coleman, Ali Larter, James K. Lee, Masi Oka, Adrian Pasdar, Greg Grunberg, Dania Ramirez, Sendhil Ramamurthy, Hayden Panettiere, Milo Ventimiglia, Christine Rose, Tim Kring, Zachary QuintoJack Coleman, Ali Larter, James K. Lee, Masi Oka, Adrian Pasdar, Greg Grunberg, Dania Ramirez, Sendhil Ramamurthy, Hayden Panettiere, Milo Ventimiglia, Christine Rose, Tim Kring, Zachary Quinto  See more', 'Initial release date': '2009-09-01', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '5823036', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '17 hours and 55 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Masi Oka, Hayden Panettiere, Zachary Quinto, Sendhil Ramamurthy, Milo Ventimiglia', 'Subtitles': 'French, Spanish', 'Producers': 'Tim Kring', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nBlu-ray is my favorite media. One of my favorite series when it was on the air.  Blu-ray provides a beautiful picture.\nI like it.",
  "profile": "**User Preferences Summary:**\n\n- **Genre Preference:** The user maintains a strong inclination towards action and adventure, alongside an appreciation for dramas and complex narratives. Their recent engagement with popular series demonstrates a continued interest in well-developed characters.\n\n- **Format Choice:** Blu-ray remains their primary format for home entertainment, underscoring their commitment to high-quality viewing experiences. Their latest purchase solidifies this preference, though they exhibit a slight flexibility for non-Blu-ray options when specific titles are unavailable.\n\n- **Content Appreciation:** The user values critically acclaimed works featuring notable actors and intricate character dynamics. Their thoughtful reviews reflect a deep consideration for narrative quality.\n\n- **Value Focus:** Fast delivery and competitive pricing remain essential to their purchasing decisions. Their recent experiences highlight ongoing challenges with format availability, yet they are still inclined towards making repeat purchases for appealing titles in their preferred genres.\n\n- **Review Behavior:** The user consistently provides feedback, typically favoring high ratings, though they have recently expressed frustration regarding the availability of preferred formats. This marks a notable shift from their usual satisfaction-driven reviews.\n\n- **Re-Engagement Intent:** Despite recent disappointments, the user shows readiness to continue expanding their collection with captivating series that align with their interests, emphasizing a lasting commitment to high-quality content in their viewing experience.",
  "metrics": {
    "rouge1_f": 0.07394209354120268,
    "rouge2_f": 0.008024966562639322,
    "rougeL_f": 0.03652561247216035,
    "meteor": 0.020937196532724,
    "bleu1": 7.876338292832717e-06,
    "bleu2": 2.096625750121193e-06,
    "bleu3": 3.449517901879857e-07,
    "bleu4": 1.400540083933803e-07,
    "bertscore_precision": 0.3300640881061554,
    "bertscore_recall": 0.4710649251937866,
    "bertscore_f1": 0.3881562650203705
  }
}