{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dune (Blu-ray + DVD)\nReview Date: 2022/09/05\nStore: Timothée Chalamet  (Actor),     Rebecca Ferguson  (Actor)    Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['A mythic and emotionally charged hero’s journey, “Dune” tells the story of Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, who must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet’s exclusive supply of the most precious resource in existence—a commodity capable of unlocking humanity’s greatest potential—only those who can conquer their fear will survive.', 'Bonus Content:', 'The Royal Houses Filmbooks: House Atreides Filmbooks: House Harkonnen Filmbooks: House Harkonnen Filmbooks: The Fremen Filmbooks: The Spice Melange Inside Dune: The Training Room Inside Dune: The Spice Harvester Inside Dune: The Sardaukar Battle Building the Ancient Future My Desert, My Dune Constructing the Ornithopters Designing the Sandworm Beware the Baron Wardrobe from Another World A New Soundscape', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Blade Runner:2049, Dune, Denis, Legendary, Action Adventure, Syfy, Sci Fi, Science Fiction', 'Format': 'NTSC, Subtitled', 'Contributor': 'Brian Herbert, Jon Spaihts, Stephen McKinley Henderson, Herbert W. Gains, Javier Bardem, Sharon Duncan-Brewster, Jason Momoa, Denis Villeneuve, Frank Herbert, Timothée Chalamet, Stellan Skarsgård, Dave Bautista, Kim Herbert, Joseph M. Caracciolo Jr., Joshua Grode, John Harrison, Thomas Tull, Zendaya, Charlotte Rampling, Chang Chen, Mary Parent, Richard P. Rubinstein, Josh Brolin, Eric Roth, Byron Merritt, Tanya Lapointe, Oscar Isaac, Rebecca Ferguson, Cale BoyterBrian Herbert, Jon Spaihts, Stephen McKinley Henderson, Herbert W. Gains, Javier Bardem, Sharon Duncan-Brewster, Jason Momoa, Denis Villeneuve, Frank Herbert, Timothée Chalamet, Stellan Skarsgård, Dave Bautista, Kim Herbert, Joseph M. Caracciolo Jr., Joshua…  See more', 'Initial release date': '2022-01-11', 'Language': 'Spanish (Dolby Digital 5.1), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1)', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.31 x 6.81 x 0.63 inches; 2.82 Ounces', 'Item model number': '3SS-DP58', 'Director': 'Denis Villeneuve', 'Media Format': 'NTSC, Subtitled', 'Release date': 'January 11, 2022', 'Actors': 'Timothée Chalamet, Rebecca Ferguson, Oscar Isaac, Josh Brolin, Stellan Skarsgård', 'Dubbed': 'Spanish, Japanese, Hungarian', 'Subtitles': 'Japanese, Spanish, French, Italian', 'Producers': 'Mary Parent, Tanya Lapointe, Joshua Grode, Denis Villeneuve, Herbert W. Gains', 'Studio': 'Warner Bros.', 'Writers': 'Jon Spaihts, Denis Villeneuve, Eric Roth', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I didn't expect it to stop when it did.  I'm waiting for the other half!\nReview Title: A well produced move of the first half of the story.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Les Misérables (2012) [Blu-ray]\nHugh Jackman  (Actor),     Russell Crowe  (Actor),     Tom Hooper  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Hugh Jackman, Academy Award® winner Russell Crowe and Anne Hathaway star in this critically-acclaimed adaptation of the epic musical phenomenon. Set against the backdrop of 19th-century France, Les Misérables tells the story of ex-prisoner Jean Valjean (Jackman), hunted for decades by the ruthless policeman Javert (Crowe), after he breaks parole. When Valjean agrees to care for factory worker Fantine\\'s (Hathaway) young daughter, Cosette, their lives change forever. This enthralling story is a timeless testament to the survival of the human spirit and \"an unforgettable experience\" (Richard Roeper, RichardRoeper.com).', 'Bonus Content:', 'Les Miserables: A Revolutionary Approach: The Stars of Les Misérable', 'Les Miserables: A Revolutionary Approach: The Stars of Les Misérable', 'Les Miserables: A Revolutionary Approach: The West End Connection', 'Les Miserables: A Revolutionary Approach: The West End Connection', 'Les Miserables: A Revolutionary Approach: Les Misérables on Location', 'Les Miserables: A Revolutionary Approach: Les Misérables on Location', 'Les Miserables: A Revolutionary Approach: Creating the Perfect Paris', 'Les Miserables: A Revolutionary Approach: Creating the Perfect Paris', 'Les Miserables: A Revolutionary Approach: Battle at the Barricade', 'Les Miserables: A Revolutionary Approach: Battle at the Barricade', 'Les Miserables: A Revolutionary Approach: Les Misérables Singing Live', 'Les Miserables: A Revolutionary Approach: Les Misérables Singing Live', \"The Original Masterwork: Victor Hugo's Les Misérables\", \"The Original Masterwork: Victor Hugo's Les Misérables\", 'Feature Commentary with Director Tom Hooper', 'Feature Commentary with Director Tom Hooper', ']]>']\n{'Genre': 'Musicals & Performing Arts/Musicals, Drama', 'Format': 'NTSC, Subtitled', 'Contributor': 'Amanda Seyfried, Eric Fellner, Eve Stewart, Herbert Kretzmer, Anne Hathaway, William Nicholson, Cameron Mackintosh, Paco Delgado, Russell Crowe, Debra Hayward, Mark Paterson, Helena Bonham Carter, Andy Nelson, Tom Hooper, Anna Lynch-Robinson, Tim Bevan, Claude-Michel Schonberg, Simon Hayes, Hugh Jackman, Eddie Redmayne, Sacha Baron Cohen, Alain BoublilAmanda Seyfried, Eric Fellner, Eve Stewart, Herbert Kretzmer, Anne Hathaway, William Nicholson, Cameron Mackintosh, Paco Delgado, Russell Crowe, Debra Hayward, Mark Paterson, Helena Bonham Carter, Andy Nelson, Tom Hooper, Anna Lynch-Robinson, Tim B…   See more', 'Initial release date': '2019-01-15', 'Language': 'English (DTS 5.1), English (DTS-HD Master Audio 7.1)', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.26 Ounces', 'Director': 'Tom Hooper', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 38 minutes', 'Release date': 'January 15, 2019', 'Actors': 'Hugh Jackman, Russell Crowe, Anne Hathaway, Amanda Seyfried, Eddie Redmayne', 'Subtitles': 'Spanish, French', 'Producers': 'Tim Bevan, Eric Fellner, Debra Hayward, Cameron Mackintosh', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Nicholson, Alain Boublil, Claude-Michel Schonberg, Herbert Kretzmer', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA good show, a great price fast delivery, I'd buy it again but I already got it!\nI liked it a lot.\nNCIS: Season 7 [DVD]\nDavid McCallum  (Actor),     Cote de Pablo  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'AC-3, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Sean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael WeatherlySean Murray, Mark Harmon, David McCallum, Rocky Carroll, Pauley Perrette, Cote de Pablo, Michael Weatherly   See more', 'Language': 'English', 'Number Of Discs': '6'}\nI used it for home viewing.  I liked it a lot\nFast delivery, great product\nHeroes: Season 4 [Blu-ray]\nMilo Ventimiglia  (Actor),     Zachary Quinto  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Experience all the intrigue and suspense of', 'Heroes: Season Four', 'in this 4-disc set that includes all 18 gripping episodes from the fourth season’s volume, \"Redemption.\" As the Heroes mourn fallen friends and face dangerous new foes, prepare for a wild ride -- filled with shocking twists and turns -- through an ominous funhouse that culminates in a Brave New World.']\n{'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Contributor': 'Milo Ventimiglia, Zachary Quinto', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '13 hours and 33 minutes', 'Release date': 'August 3, 2010', 'Actors': 'Milo Ventimiglia, Zachary Quinto', 'Subtitles': 'French, Spanish', 'Studio': 'Universal', 'Number of discs': '4'}\nI bought this to add to my video collection.  I watched it on broadcast TV and haven't opened it.\nfast delivery in perfect condition\nLongmire: The Complete Sixth and Final Season (DVD)\nRobert Taylor  (Actor),     Katee Sackhoff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Longmire: The Complete Sixth and Final Season (DVD)', 'Season Six of Longmire finds Sheriff Walt Longmire (Robert Taylor), his deputies Vic Moretti (Katee Sackhoff), and The Ferg (Adam Bartley), his best friend Henry Standing Bear (Lou Diamond Phillips), and daughter, Cady (Cassidy Freeman) facing the biggest personal and professional crises of their lives. Walt’s job and home are under threat by a powerful, but unscrupulous lawyer. Vic must decide what to do about her secret pregnancy. Ferg struggles to balance a new relationship with his commitment to his job. Cady is torn between her loyalties to dueling father figures. And Henry’s very life is in danger as an old nemesis is bent on revenge. With their world in turmoil, Walt and all the people he cares about most must ultimately face the most difficult decision of their lives: when is it time to pack it in, and when is it time to fight to the end?', ']]>']\n{'Genre': 'Drama, Westerns, Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Lou Diamond Phillips, Robert Taylor, Adam Bartley, Craig Johnson, Cassidy Freeman, Greer Shephard, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt BaldwinLou Diamond Phillips, Robert Taylor, Adam Bartley, Craig Johnson, Cassidy Freeman, Greer Shephard, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt Baldwin   See more', 'Number Of Discs': '2', 'Runtime': '600 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Item model number': '1000693157', 'Media Format': 'DVD, NTSC', 'Run time': '600 minutes', 'Release date': 'November 20, 2018', 'Actors': 'Robert Taylor, Katee Sackhoff, Lou Diamond Phillips, Cassidy Freeman, Adam Bartley', 'Producers': 'Greer Shephard, Michael M. Robin, Hunt Baldwin, John Coveny', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI am so glad that this season is out there.  I thought the series only had 5!  I wish there were more, but that's life.\nPromptly arrived in new condition\nLongmire: The Complete Fifth Season (DVD)\nRobert Taylor  (Actor),     Katee Sackhoff  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Longmire: The Complete Fifth Season (DVD)', \"Longmire’s fifth season finds Sheriff Walt Longmire in the crosshairs of a wrongful-death civil suit by Barlow Connally's estate. With his best friend and daughter working for his nemesis, Jacob Nighthorse, and new mysteries and cases weighing down Walt and his team of deputies, the noble but stubborn Sheriff doubles down on his own self-reliance. And it just might be his downfall...\", ']]>']\n{'Genre': 'Drama, Westerns, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Lou Diamond Phillips, Bailey Chase, Robert Taylor, Adam Bartley, Craig Johnson, Greer Shephard, Cassidy Freeman, A Martinez, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt BaldwinLou Diamond Phillips, Bailey Chase, Robert Taylor, Adam Bartley, Craig Johnson, Greer Shephard, Cassidy Freeman, A Martinez, Michael M. Robin, John Coveny, Katee Sackhoff, Hunt Baldwin   See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Media Format': 'NTSC', 'Release date': 'September 26, 2017', 'Actors': 'Robert Taylor, Katee Sackhoff, Lou Diamond Phillips, Cassidy Freeman, Bailey Chase', 'Dubbed': 'English', 'Producers': 'Greer Shephard, Michael M. Robin, Hunt Baldwin, John Coveny', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nIt's a great product.  Unfortunately, I misordered intending to buy season six.  I already have season 5.  I corrected that mistake and intend to donate the extra copy.\nIt's a season of my favorite police drama TV series.\nTitans: The Complete Second Season (Blu-ray + Digital)\nBrenton Thwaites  (Actor),     Anna Diop  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Titans: The Complete Second Season (Blu-ray + Digital)', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC, Blu-ray', 'Contributor': 'Greg Berlanti, Joshua Orpin, Alan Ritchson, Greg Walker, Conor Leslie, Sarah Schechter, Minka Kelly, Geoff Johns, Chelsea Zhang, Teagan Croft, John Fawcett, Esai Morales, Brenton Thwaites, Akiva Goldsman, Ryan Potter, Curran Walters, Anna DiopGreg Berlanti, Joshua Orpin, Alan Ritchson, Greg Walker, Conor Leslie, Sarah Schechter, Minka Kelly, Geoff Johns, Chelsea Zhang, Teagan Croft, John Fawcett, Esai Morales, Brenton Thwaites, Akiva Goldsman, Ryan Potter, Curran Walters, Anna Diop  See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.67 Ounces', 'Item model number': 'BR750620', 'Media Format': 'NTSC, Blu-ray', 'Run time': '576 minutes', 'Release date': 'March 3, 2020', 'Actors': 'Brenton Thwaites, Anna Diop, Teagan Croft, Ryan Potter, Curran Walters', 'Subtitles': 'English', 'Producers': 'Akiva Goldsman, Geoff Johns, Greg Berlanti, Greg Walker, Sarah Schechter', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI like the story line.  the production is Great!  Blu-ray is my favorite media.\nI hope there's a third season\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Alan Fine'], 'Starring': ['Charlie Cox', 'Deborah Ann Woll', 'Elden Henson'], 'Studio': ['Marvel Television']}\nI wanted it on any media but prime video or streaming.  I looked at it on Amazon.  I tried to leave the site since it isn't available on DVD or Blu-ray.  The next day I was notified I had bought it for 29.99.  I can find NO WAY to contact Prime video.  I DON'T do streaming.  Seasons 1 & 2 were great.  I bet 3 is too.  Someday I'll buy it on Blu-ray or DVD.\nI wanted it on any media but prime video or streaming\nHeroes: Season 3 [Blu-ray]\nMasi Oka  (Actor),     Hayden Panettiere  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Experience all the explosive action and shocking twists as Heroes: Season 3 comes to Blu-ray™ Hi-Def! Rediscover the phenomenon in this five-disc set that includes all 25 suspenseful episodes from the third season’s volumes, Villains and Fugitives. Plus, go behind the scenes with the show’s writers, stars and artists as you explore hours of exclusive and revealing bonus features.']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Jack Coleman, Ali Larter, James K. Lee, Masi Oka, Adrian Pasdar, Greg Grunberg, Dania Ramirez, Sendhil Ramamurthy, Hayden Panettiere, Milo Ventimiglia, Christine Rose, Tim Kring, Zachary QuintoJack Coleman, Ali Larter, James K. Lee, Masi Oka, Adrian Pasdar, Greg Grunberg, Dania Ramirez, Sendhil Ramamurthy, Hayden Panettiere, Milo Ventimiglia, Christine Rose, Tim Kring, Zachary Quinto  See more', 'Initial release date': '2009-09-01', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '5823036', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '17 hours and 55 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Masi Oka, Hayden Panettiere, Zachary Quinto, Sendhil Ramamurthy, Milo Ventimiglia', 'Subtitles': 'French, Spanish', 'Producers': 'Tim Kring', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nBlu-ray is my favorite media. One of my favorite series when it was on the air.  Blu-ray provides a beautiful picture.\nI like it.\nDaredevil: The Complete Second Season\nRoyce Johnson  (Actor),     Deborah Ann Woll  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Marvel Comics\\' \"The Man Without Fear\" comes to the small screen in this gritty and action-packed superhero series that debuted in 2015. By day, blind attorney Matt Murdock (Charlie Cox) helps the good people of New York City\\'s Hell\\'s Kitchen neighborhood with all their legal needs. By night, he uses his enhanced senses-the result of the accident that took his sight as a child-and exceptional fighting skills to battle all manner of criminal threats. Deborah Ann Woll, Elden Henson, Vincent D\\'Onofrio, and Rosario Dawson also star.13 episodes on 4 discs. 11 3/4 hrs. Widescreen; Soundtrack: English. Region Free']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '6.77 x 5.39 x 0.71 inches; 2.93 Ounces', 'Item model number': 'BUY0276701', 'Media Format': 'Import', 'Run time': '11 hours and 13 minutes', 'Release date': 'May 22, 2017', 'Actors': \"Royce Johnson, Deborah Ann Woll, Elden Henson, Vincent D'Onofrio, Charlie Cox\", 'Subtitles': 'German', 'Language': 'English (DTS 5.1)', 'Studio': 'ABC', 'Number of discs': '1'}\nBlu-ray is my favorite media.  The picture is more vivid.  The series is like an action soap opera.  All the episodes follow one story line.  The production, writing, direction, acting, soundtrack and special effects are excellent.\nWatch season one first to get the whole story.\nStar Trek: The Next Generation: Season 2 [Blu-ray]\nMichael Dorn  (Actor),     Marina Sirtis  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Star Trek: The Next Generation - Season Two', 'travels warp speed into the next realm of adventure. Under the leadership of Captain Jean-Luc Picard (Patrick Stewart), the Enterprise faces a season of new changes and big challenges. With Dr. Crusher on sabbatical, Chief Medical Officer Katherine Pulaski (Diana Muldaur) fills in. And Guinan (Whoopi Goldberg) arrives as 10 Forward’s wise El-Aurian bartender. This voyage explores watershed moments, including Riker (Jonathan Frakes) experiencing the Klingon culture, Data (Brent Spiner) defending his humanity and the introduction of the Borg, a species of terrifying cybernetic conquerors threatening the fate of intelligent life. Presented for the first time on Blu-ray in 1080p high definition and digitally remastered 7.1 sound, this mission is not to be missed.']\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Box set, Subtitled, Dubbed, DTS Surround Sound', 'Contributor': 'Whoopi Goldberg, Diana Muldaur, LeVar Burton, Marina Sirtis, Patrick Stewart, Michael Dorn, Brent Spiner, Wil WheatonWhoopi Goldberg, Diana Muldaur, LeVar Burton, Marina Sirtis, Patrick Stewart, Michael Dorn, Brent Spiner, Wil Wheaton  See more', 'Language': 'English', 'Runtime': '19 hours and 56 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.28 Ounces', 'Item model number': '25938606', 'Media Format': 'Box set, Subtitled, Dubbed, DTS Surround Sound', 'Run time': '19 hours and 56 minutes', 'Release date': 'December 4, 2012', 'Actors': 'Michael Dorn, Marina Sirtis, Patrick Stewart, Diana Muldaur, Brent Spiner', 'Dubbed': 'French', 'Subtitles': 'English, Japanese, German, French', 'Studio': 'Paramount', 'Number of discs': '5'}\nI like Bluray better than the alternative media choices.\nAnother piece in my Star Trek collection.\nDune (Blu-ray + DVD)\nTimothée Chalamet  (Actor),     Rebecca Ferguson  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['A mythic and emotionally charged hero’s journey, “Dune” tells the story of Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, who must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet’s exclusive supply of the most precious resource in existence—a commodity capable of unlocking humanity’s greatest potential—only those who can conquer their fear will survive.', 'Bonus Content:', 'The Royal Houses Filmbooks: House Atreides Filmbooks: House Harkonnen Filmbooks: House Harkonnen Filmbooks: The Fremen Filmbooks: The Spice Melange Inside Dune: The Training Room Inside Dune: The Spice Harvester Inside Dune: The Sardaukar Battle Building the Ancient Future My Desert, My Dune Constructing the Ornithopters Designing the Sandworm Beware the Baron Wardrobe from Another World A New Soundscape', ']]>']\n{'Genre': 'Blade Runner:2049, Dune, Denis, Legendary, Action Adventure, Syfy, Sci Fi, Science Fiction', 'Format': 'NTSC, Subtitled', 'Contributor': 'Brian Herbert, Jon Spaihts, Stephen McKinley Henderson, Herbert W. Gains, Javier Bardem, Sharon Duncan-Brewster, Jason Momoa, Denis Villeneuve, Frank Herbert, Timothée Chalamet, Stellan Skarsgård, Dave Bautista, Kim Herbert, Joseph M. Caracciolo Jr., Joshua Grode, John Harrison, Thomas Tull, Zendaya, Charlotte Rampling, Chang Chen, Mary Parent, Richard P. Rubinstein, Josh Brolin, Eric Roth, Byron Merritt, Tanya Lapointe, Oscar Isaac, Rebecca Ferguson, Cale BoyterBrian Herbert, Jon Spaihts, Stephen McKinley Henderson, Herbert W. Gains, Javier Bardem, Sharon Duncan-Brewster, Jason Momoa, Denis Villeneuve, Frank Herbert, Timothée Chalamet, Stellan Skarsgård, Dave Bautista, Kim Herbert, Joseph M. Caracciolo Jr., Joshua…  See more', 'Initial release date': '2022-01-11', 'Language': 'Spanish (Dolby Digital 5.1), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1)', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.31 x 6.81 x 0.63 inches; 2.82 Ounces', 'Item model number': '3SS-DP58', 'Director': 'Denis Villeneuve', 'Media Format': 'NTSC, Subtitled', 'Release date': 'January 11, 2022', 'Actors': 'Timothée Chalamet, Rebecca Ferguson, Oscar Isaac, Josh Brolin, Stellan Skarsgård', 'Dubbed': 'Spanish, Japanese, Hungarian', 'Subtitles': 'Japanese, Spanish, French, Italian', 'Producers': 'Mary Parent, Tanya Lapointe, Joshua Grode, Denis Villeneuve, Herbert W. Gains', 'Studio': 'Warner Bros.', 'Writers': 'Jon Spaihts, Denis Villeneuve, Eric Roth', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI didn't expect it to stop when it did.  I'm waiting for the other half!\nA well produced move of the first half of the story.",
  "profile": "**User Preferences Summary:**\n\n- **Genre Preference:** The user continues to show a strong affinity for action, adventure, and intricate narratives, solidified by their recent engagement with notable science fiction titles featuring themes of destiny and conflict.\n\n- **Format Choice:** Blu-ray remains the user's preferred format, underscoring their commitment to high-quality viewing experiences. Their latest acquisition reaffirms this choice, illustrating consistent brand loyalty and recognition of value in visual fidelity.\n\n- **Content Appreciation:** The user values critically acclaimed productions with prominent actors and complex character dynamics. Their feedback highlights a preference for narratives that explore profound themes and emotional journeys, indicating thoughtful engagement with writing and direction.\n\n- **Value Focus:** Quick delivery and competitive pricing are important to the user’s purchasing decisions. They embody loyalty to captivating titles within preferred genres, navigating format availability challenges to enrich their collection.\n\n- **Review Behavior:** The user consistently offers high ratings and thoughtful feedback, reflecting satisfaction with their latest additions and an ongoing commitment to enhancing their collection.\n\n- **Re-Engagement Intent:** The user's intent to explore captivating series is evident, demonstrating a resilient dedication to finding immersive viewing experiences despite previous setbacks. Their ongoing engagement suggests a desire for continued expansion in beloved genres, particularly in well-produced narratives.",
  "metrics": {
    "rouge1_f": 0.06401491609695463,
    "rouge2_f": 0.00808457711442786,
    "rougeL_f": 0.035425730267246734,
    "meteor": 0.017517730128179688,
    "bleu1": 4.9857277113363336e-08,
    "bleu2": 1.3085933806049338e-08,
    "bleu3": 2.035562093037809e-09,
    "bleu4": 8.036019137074675e-10,
    "bertscore_precision": 0.33222052454948425,
    "bertscore_recall": 0.485853374004364,
    "bertscore_f1": 0.3946109712123871
  }
}