{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Chocolat [Blu-ray]\nReview Date: 2014/03/29\nStore: Juliette Binoche  (Actor),     Johnny Depp  (Actor),     Lasse Hallstr m  (Director),     Lasse Hallstrom  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Juliette Binoche and Johnny Depp star in the “delicious” (Good Morning America) romantic comedy that swept audiences off their feet and earned 5 Oscar® nominations including Best Picture. When Vianne (Binoche) arrives into a sleepy, old-fashioned French village and opens a chocolate shop, she sends the townspeople into a flutter with her uniquely gifted treats. Before long the straitlaced villagers find themselves abandoning their reservations and succumbing to their deepest desires! But when the handsome stranger Roux (Depp) breezes into town, Vianne discovers that she too is susceptible to the charms of love in this sweet confection from the director of', 'The Cider House Rules', '.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': \"Arnaud Adam, Guillaume Tardieu, Alfred Molina, Victoire Thivisol, Elizabeth Commelin, Peter Stormare, Ged Barry, Iain Stoddard, Malcolm Ross, Helene Cardona, Christianne Gadd, John Wood, Sally Isherwood-Taylor, Lasse Hallstr m, Esteban Antonio, Sally (Sally), Lena Olin, Carrie-Anne Moss, Ron Cook, Marion Hauducoeur, Leslie Caron, Lasse Hallstrom, Hugh O'Conor, Jeffrey Poskin, Johnny Depp, Antonio Gil-Martinez, Leslie Holleran, J J Holiday, Tatyana Yassukovich, Judi Dench, Juliette Binoche, Gaelan Connell, Kit Golden, David Brown, Aurelien Parent Koenig, Michele Gleizer, Dominique Macavoy, Lasse Hallström, Harrison PrattArnaud Adam, Guillaume Tardieu, Alfred Molina, Victoire Thivisol, Elizabeth Commelin, Peter Stormare, Ged Barry, Iain Stoddard, Malcolm Ross, Helene Cardona, Christianne Gadd, John Wood, Sally Isherwood-Taylor, Lasse Hallstr m, Esteban Antonio, Sally (Sally), Lena Olin, C…  See more\", 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '17521069', 'Director': 'Lasse Hallstr m, Lasse Hallstrom, Lasse Hallström', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 19, 2011', 'Actors': 'Juliette Binoche, Johnny Depp, Lena Olin, Judi Dench, Alfred Molina', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Producers': 'Kit Golden, David Brown, Leslie Holleran', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: There are many lessons to be learned in this sweet story.  It really isn't THAT sweet because underneath the story of a woman who rents a pâtisserie and specializes in chocolate - amazing, chocolate decadence - is some ugliness.  It really makes you want to learn how to make all her chocolate goodness but it is a story of bias.  It is a story of fear and hatred of what is not known.  But it is also a glorious story of second chances.  There is romance but it is, at heart, a story of finding ones self.  Superb acting by everyone in it.  Loved it.\nReview Title: Sweet but Tart\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "O Brother, Where Art Thou? [Blu-ray]\nGeorge Clooney  (Actor),     John Turturro  (Actor),     Joel Coen  (Director, Writer),     Roger Deakins  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'George Clooney (', 'The Perfect Storm', ') and John Turturro (', 'Cars 2', \")embark on the adventure of a lifetime in this hilarious, offbeat road picture. And now, for the first time, this quirky gem shines more brightly than ever in Blu-ray High Definition! Fed up with crushing rocks on a prison farm in Mississippi, the dapper, silver-tongued Ulysses Everett McGill (Clooney) busts loose...except he's still shackled to two misfits from his chain gang: bad-tempered Pete (Turturro), and sweet, dimwitted Delmar (Tim Blake Nelson). With nothing to lose and buried loot to regain, the three embark on a riotous odyssey filled with chases, close calls, near misses and betrayal. Experience every unpredictable moment as it plays out in the crystal-clear sound and breathtaking picture quality of Blu-ray. Populated with strange characters, including a blind prophet, sexy sirens, and a one-eyed Bible salesman (John Goodman),\", 'O Brother, Where Art Thou', '? will leave you laughing at every outrageous and surprising twist and turn', 'Amazon.com', 'Only Joel and Ethan Coen, the fraternal director and producer team behind art-house hits such as', 'The Big Lebowski', 'and', 'Fargo', \"and masters of quirky and ultra-stylish genre subversion, would dare nick the plot line of Homer's Odyssey for a comic picaresque saga about three cons on the run in 1930s Mississippi. Our wandering hero in this case is one Ulysses Everett McGill, a slick-tongued wise guy with a thing about hair pomade (George Clooney, blithely sending up his own dapper image) who talks his chain-gang buddies (Coen-movie regular John Turturro and newcomer Tim Blake Nelson) into lighting out after some buried loot he claims to know of. En route they come up against a prophetic blind man on a railroad truck, a burly, one-eyed baddie (the ever-magnificent John Goodman), a trio of sexy singing ladies, a blues guitarist who's sold his soul to the devil, a brace of crooked politicos on the stump, a manic-depressive bank robber, and--well, you get the idea. Into this, their most relaxed film yet, the Coens have tossed a beguiling ragbag of inconsequential situations, a wealth of looping, left-field dialogue, and a whole stash of gags both verbal and visual. O Brother (the title's lifted from Preston Sturges's classic 1941 comedy\", \"Sullivan's Travels\", \") is furthermore graced with glowing, burnished photography from Roger Deakins and a masterly soundtrack from T-Bone Burnett that pays loving homage to American '30s folk styles--blues, gospel, bluegrass, jazz, and more. And just to prove that the brothers haven't lost their knack for bad-taste humor, we get a Ku Klux Klan rally choreographed like a cross between a Nuremberg rally and a Busby Berkeley musical. --\", 'Philip Kemp']\n{'Genre': 'Comedy', 'Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Wayne Duvall, Ed Gale, Daniel Von Bargen, Ray McKinnon, Brian Reddy, Del Pentecost, Joel Coen, Chris Thomas King, Michael Badalucco, J.R. Horne, Tim Blake Nelson, Charles Durning, Ethan Coen, George Clooney, John Turturro, John Goodman, Holly Hunter, Roger DeakinsWayne Duvall, Ed Gale, Daniel Von Bargen, Ray McKinnon, Brian Reddy, Del Pentecost, Joel Coen, Chris Thomas King, Michael Badalucco, J.R. Horne, Tim Blake Nelson, Charles Durning, Ethan Coen, George Clooney, John Turturro, John Goodman, Holly Hunter, Roger Deakins  See more', 'Language': 'Spanish (Dolby Digital 2.0), English (DTS-HD High Res Audio)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'French', 'Item model number': 'Relay time: 107min', 'Director': 'Joel Coen, Roger Deakins', 'Media Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 47 minutes', 'Release date': 'September 13, 2011', 'Actors': 'George Clooney, John Turturro, Tim Blake Nelson, John Goodman, Holly Hunter', 'Subtitles': 'French, Spanish, English', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Ethan Coen, Joel Coen', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of my husband's favorite DVDs so to be able to go from VHS to the sharpness of a Blu-Ray was a nice switch!  A wonderful romp and take on Homer's story Odyssey!  I love the &#34;look&#34; of the 1930's and we just laughed our way all the way through this DVD.  My husband also likes Bluegrass, so he loved the music, too.\nSo Funny\nSweatin' to the Oldies: The Complete Collection\nRichard Simmons  (Actor),     E.H. Shipley  (Director),     Christopher Cohen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n[\"The Complete Collection of Sweatin' to the Oldies presents all 4 of Richard Simmons' original Sweatin' to the Oldies workouts on DVD plus Richard's brand new show, Love Yourself and Win as a bonus DVD. You'll get forty-one exercise routines set to forty-one rock 'n' roll classics like: It's My Party, Big Girls Don't Cry, Gimme Some Lovin', Oh, Pretty Woman, and more. This 20th Anniversary edition also includes 2 hours of brand new, exclusive bonus material featuring an interview with Richard, incredible success stories from his students, and more.\"]\n{'Genre': 'Exercise & Fitness, Music Videos & Concerts', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Richard Simmons, E.H. Shipley, Christopher Cohen', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 1.7 inches; 15.2 Ounces', 'Director': 'E.H. Shipley, Christopher Cohen', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'January 8, 2008', 'Actors': 'Richard Simmons', 'Studio': 'Time Life Records', 'Number of discs': '5'}\nThis was a great inexpensive set to purchase.  I have fluctuated between #1 and #2 of the Sweating' program with my VHS copies and it was past time to get this on DVD.  The quality is great and while I haven't used #3-#5 of the DVDs, I'm sure they are just as good.  This is a great starter exercise program, especially if you haven't exercised in a while.  The songs are fun and the moves very easy.  The people working with Richard are all different sizes (i.e., not perfect size 6's) so you can workout without being intimidated by skinny people (smile).  Richard Simmons may come across as hokey but you can't fault that this form of exercise is enjoyable!  Time actually passes by quickly as you workout to songs from the 60's!\nGreat DVDs and Program\nChocolat [Blu-ray]\nJuliette Binoche  (Actor),     Johnny Depp  (Actor),     Lasse Hallstr m  (Director),     Lasse Hallstrom  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Juliette Binoche and Johnny Depp star in the “delicious” (Good Morning America) romantic comedy that swept audiences off their feet and earned 5 Oscar® nominations including Best Picture. When Vianne (Binoche) arrives into a sleepy, old-fashioned French village and opens a chocolate shop, she sends the townspeople into a flutter with her uniquely gifted treats. Before long the straitlaced villagers find themselves abandoning their reservations and succumbing to their deepest desires! But when the handsome stranger Roux (Depp) breezes into town, Vianne discovers that she too is susceptible to the charms of love in this sweet confection from the director of', 'The Cider House Rules', '.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': \"Arnaud Adam, Guillaume Tardieu, Alfred Molina, Victoire Thivisol, Elizabeth Commelin, Peter Stormare, Ged Barry, Iain Stoddard, Malcolm Ross, Helene Cardona, Christianne Gadd, John Wood, Sally Isherwood-Taylor, Lasse Hallstr m, Esteban Antonio, Sally (Sally), Lena Olin, Carrie-Anne Moss, Ron Cook, Marion Hauducoeur, Leslie Caron, Lasse Hallstrom, Hugh O'Conor, Jeffrey Poskin, Johnny Depp, Antonio Gil-Martinez, Leslie Holleran, J J Holiday, Tatyana Yassukovich, Judi Dench, Juliette Binoche, Gaelan Connell, Kit Golden, David Brown, Aurelien Parent Koenig, Michele Gleizer, Dominique Macavoy, Lasse Hallström, Harrison PrattArnaud Adam, Guillaume Tardieu, Alfred Molina, Victoire Thivisol, Elizabeth Commelin, Peter Stormare, Ged Barry, Iain Stoddard, Malcolm Ross, Helene Cardona, Christianne Gadd, John Wood, Sally Isherwood-Taylor, Lasse Hallstr m, Esteban Antonio, Sally (Sally), Lena Olin, C…  See more\", 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '17521069', 'Director': 'Lasse Hallstr m, Lasse Hallstrom, Lasse Hallström', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 19, 2011', 'Actors': 'Juliette Binoche, Johnny Depp, Lena Olin, Judi Dench, Alfred Molina', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Producers': 'Kit Golden, David Brown, Leslie Holleran', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nThere are many lessons to be learned in this sweet story.  It really isn't THAT sweet because underneath the story of a woman who rents a pâtisserie and specializes in chocolate - amazing, chocolate decadence - is some ugliness.  It really makes you want to learn how to make all her chocolate goodness but it is a story of bias.  It is a story of fear and hatred of what is not known.  But it is also a glorious story of second chances.  There is romance but it is, at heart, a story of finding ones self.  Superb acting by everyone in it.  Loved it.\nSweet but Tart",
  "profile": "The user continues to exhibit a strong preference for classic and comedic films, particularly those that blend quirky narratives with deeper themes. Their recent engagement with a romantic comedy showcases an appreciation for storytelling that, while entertaining, also offers poignant life lessons and character development. The user enjoys narratives that evoke nostalgia, often featuring strong performances by renowned actors, reflecting their appreciation for high-quality cinematography and soundtracks. \n\nIn addition to classic films, the user values narratives that explore complex human emotions and societal themes, highlighting their interest in both lighthearted and thought-provoking content. Their focus on family-oriented viewing remains evident, as they seek productions that can engage and foster meaningful experiences with loved ones. The user maintains their affinity for fitness-related content that can also provide entertainment and comfort, making a seamless blend of their interests in music, movement, and storytelling. Overall, they cherish high-quality productions that resonate across generations, successfully merging their love for classic cinema with modern elements that promote enjoyment and wellness in family activities.",
  "metrics": {
    "rouge1_f": 0.09010989010989011,
    "rouge2_f": 0.0033003300330033,
    "rougeL_f": 0.03956043956043956,
    "meteor": 0.027112706561471845,
    "bleu1": 7.311695552670827e-06,
    "bleu2": 2.155175948361758e-06,
    "bleu3": 3.486431604372966e-07,
    "bleu4": 1.4041569787537752e-07,
    "bertscore_precision": 0.31062057614326477,
    "bertscore_recall": 0.46585217118263245,
    "bertscore_f1": 0.37271949648857117
  }
}