{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: When Harry Met Sally 2 with Billy Crystal & Helen Mirren\nReview Date: 2018/04/30\nCategories: Comedy\nProduct Description: [\"The remake of 'When Harry Met Sally' that everyone has been waiting for is finally here. Starring Billy Crystal, Helen Mirren and featuring the many talents of Rob Reiner, Adam Scott, Mike Tyson, Rob Riggle, Maya Rudolph, Jennifer Crystal Foley, Mike O'Malley & Josh Fadem.\"]\nAverage Rating: 2.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Lindsay Crystal'], 'Producers': ['Funny Or Die', 'Ally Hord', 'Samantha Sprecher', 'Betsy Koch'], 'Starring': ['Billy Crystal', 'Helen Mirren', 'Rob Reiner']}\nReview Text: I was absolutely livid when I realized it was NOT a real movie - just a 5 minute satire. It was just hysterical although people who don't like blood dripping all over the place (vampires ARE messy, you know), might not like it.  It is a perfect showcase for both Helen and Billy's comedic chops!\nReview Title: Too too funny... where's the whole movie?\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "O Brother, Where Art Thou? [Blu-ray]\nGeorge Clooney  (Actor),     John Turturro  (Actor),     Joel Coen  (Director, Writer),     Roger Deakins  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'George Clooney (', 'The Perfect Storm', ') and John Turturro (', 'Cars 2', \")embark on the adventure of a lifetime in this hilarious, offbeat road picture. And now, for the first time, this quirky gem shines more brightly than ever in Blu-ray High Definition! Fed up with crushing rocks on a prison farm in Mississippi, the dapper, silver-tongued Ulysses Everett McGill (Clooney) busts loose...except he's still shackled to two misfits from his chain gang: bad-tempered Pete (Turturro), and sweet, dimwitted Delmar (Tim Blake Nelson). With nothing to lose and buried loot to regain, the three embark on a riotous odyssey filled with chases, close calls, near misses and betrayal. Experience every unpredictable moment as it plays out in the crystal-clear sound and breathtaking picture quality of Blu-ray. Populated with strange characters, including a blind prophet, sexy sirens, and a one-eyed Bible salesman (John Goodman),\", 'O Brother, Where Art Thou', '? will leave you laughing at every outrageous and surprising twist and turn', 'Amazon.com', 'Only Joel and Ethan Coen, the fraternal director and producer team behind art-house hits such as', 'The Big Lebowski', 'and', 'Fargo', \"and masters of quirky and ultra-stylish genre subversion, would dare nick the plot line of Homer's Odyssey for a comic picaresque saga about three cons on the run in 1930s Mississippi. Our wandering hero in this case is one Ulysses Everett McGill, a slick-tongued wise guy with a thing about hair pomade (George Clooney, blithely sending up his own dapper image) who talks his chain-gang buddies (Coen-movie regular John Turturro and newcomer Tim Blake Nelson) into lighting out after some buried loot he claims to know of. En route they come up against a prophetic blind man on a railroad truck, a burly, one-eyed baddie (the ever-magnificent John Goodman), a trio of sexy singing ladies, a blues guitarist who's sold his soul to the devil, a brace of crooked politicos on the stump, a manic-depressive bank robber, and--well, you get the idea. Into this, their most relaxed film yet, the Coens have tossed a beguiling ragbag of inconsequential situations, a wealth of looping, left-field dialogue, and a whole stash of gags both verbal and visual. O Brother (the title's lifted from Preston Sturges's classic 1941 comedy\", \"Sullivan's Travels\", \") is furthermore graced with glowing, burnished photography from Roger Deakins and a masterly soundtrack from T-Bone Burnett that pays loving homage to American '30s folk styles--blues, gospel, bluegrass, jazz, and more. And just to prove that the brothers haven't lost their knack for bad-taste humor, we get a Ku Klux Klan rally choreographed like a cross between a Nuremberg rally and a Busby Berkeley musical. --\", 'Philip Kemp']\n{'Genre': 'Comedy', 'Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Wayne Duvall, Ed Gale, Daniel Von Bargen, Ray McKinnon, Brian Reddy, Del Pentecost, Joel Coen, Chris Thomas King, Michael Badalucco, J.R. Horne, Tim Blake Nelson, Charles Durning, Ethan Coen, George Clooney, John Turturro, John Goodman, Holly Hunter, Roger DeakinsWayne Duvall, Ed Gale, Daniel Von Bargen, Ray McKinnon, Brian Reddy, Del Pentecost, Joel Coen, Chris Thomas King, Michael Badalucco, J.R. Horne, Tim Blake Nelson, Charles Durning, Ethan Coen, George Clooney, John Turturro, John Goodman, Holly Hunter, Roger Deakins  See more', 'Language': 'Spanish (Dolby Digital 2.0), English (DTS-HD High Res Audio)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'French', 'Item model number': 'Relay time: 107min', 'Director': 'Joel Coen, Roger Deakins', 'Media Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 47 minutes', 'Release date': 'September 13, 2011', 'Actors': 'George Clooney, John Turturro, Tim Blake Nelson, John Goodman, Holly Hunter', 'Subtitles': 'French, Spanish, English', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Ethan Coen, Joel Coen', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of my husband's favorite DVDs so to be able to go from VHS to the sharpness of a Blu-Ray was a nice switch!  A wonderful romp and take on Homer's story Odyssey!  I love the &#34;look&#34; of the 1930's and we just laughed our way all the way through this DVD.  My husband also likes Bluegrass, so he loved the music, too.\nSo Funny\nSweatin' to the Oldies: The Complete Collection\nRichard Simmons  (Actor),     E.H. Shipley  (Director),     Christopher Cohen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n[\"The Complete Collection of Sweatin' to the Oldies presents all 4 of Richard Simmons' original Sweatin' to the Oldies workouts on DVD plus Richard's brand new show, Love Yourself and Win as a bonus DVD. You'll get forty-one exercise routines set to forty-one rock 'n' roll classics like: It's My Party, Big Girls Don't Cry, Gimme Some Lovin', Oh, Pretty Woman, and more. This 20th Anniversary edition also includes 2 hours of brand new, exclusive bonus material featuring an interview with Richard, incredible success stories from his students, and more.\"]\n{'Genre': 'Exercise & Fitness, Music Videos & Concerts', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Richard Simmons, E.H. Shipley, Christopher Cohen', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 1.7 inches; 15.2 Ounces', 'Director': 'E.H. Shipley, Christopher Cohen', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'January 8, 2008', 'Actors': 'Richard Simmons', 'Studio': 'Time Life Records', 'Number of discs': '5'}\nThis was a great inexpensive set to purchase.  I have fluctuated between #1 and #2 of the Sweating' program with my VHS copies and it was past time to get this on DVD.  The quality is great and while I haven't used #3-#5 of the DVDs, I'm sure they are just as good.  This is a great starter exercise program, especially if you haven't exercised in a while.  The songs are fun and the moves very easy.  The people working with Richard are all different sizes (i.e., not perfect size 6's) so you can workout without being intimidated by skinny people (smile).  Richard Simmons may come across as hokey but you can't fault that this form of exercise is enjoyable!  Time actually passes by quickly as you workout to songs from the 60's!\nGreat DVDs and Program\nChocolat [Blu-ray]\nJuliette Binoche  (Actor),     Johnny Depp  (Actor),     Lasse Hallstr m  (Director),     Lasse Hallstrom  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Juliette Binoche and Johnny Depp star in the “delicious” (Good Morning America) romantic comedy that swept audiences off their feet and earned 5 Oscar® nominations including Best Picture. When Vianne (Binoche) arrives into a sleepy, old-fashioned French village and opens a chocolate shop, she sends the townspeople into a flutter with her uniquely gifted treats. Before long the straitlaced villagers find themselves abandoning their reservations and succumbing to their deepest desires! But when the handsome stranger Roux (Depp) breezes into town, Vianne discovers that she too is susceptible to the charms of love in this sweet confection from the director of', 'The Cider House Rules', '.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': \"Arnaud Adam, Guillaume Tardieu, Alfred Molina, Victoire Thivisol, Elizabeth Commelin, Peter Stormare, Ged Barry, Iain Stoddard, Malcolm Ross, Helene Cardona, Christianne Gadd, John Wood, Sally Isherwood-Taylor, Lasse Hallstr m, Esteban Antonio, Sally (Sally), Lena Olin, Carrie-Anne Moss, Ron Cook, Marion Hauducoeur, Leslie Caron, Lasse Hallstrom, Hugh O'Conor, Jeffrey Poskin, Johnny Depp, Antonio Gil-Martinez, Leslie Holleran, J J Holiday, Tatyana Yassukovich, Judi Dench, Juliette Binoche, Gaelan Connell, Kit Golden, David Brown, Aurelien Parent Koenig, Michele Gleizer, Dominique Macavoy, Lasse Hallström, Harrison PrattArnaud Adam, Guillaume Tardieu, Alfred Molina, Victoire Thivisol, Elizabeth Commelin, Peter Stormare, Ged Barry, Iain Stoddard, Malcolm Ross, Helene Cardona, Christianne Gadd, John Wood, Sally Isherwood-Taylor, Lasse Hallstr m, Esteban Antonio, Sally (Sally), Lena Olin, C…  See more\", 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '17521069', 'Director': 'Lasse Hallstr m, Lasse Hallstrom, Lasse Hallström', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'July 19, 2011', 'Actors': 'Juliette Binoche, Johnny Depp, Lena Olin, Judi Dench, Alfred Molina', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Producers': 'Kit Golden, David Brown, Leslie Holleran', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nThere are many lessons to be learned in this sweet story.  It really isn't THAT sweet because underneath the story of a woman who rents a pâtisserie and specializes in chocolate - amazing, chocolate decadence - is some ugliness.  It really makes you want to learn how to make all her chocolate goodness but it is a story of bias.  It is a story of fear and hatred of what is not known.  But it is also a glorious story of second chances.  There is romance but it is, at heart, a story of finding ones self.  Superb acting by everyone in it.  Loved it.\nSweet but Tart\nSafe [DVD + Digital Copy]\nStatham, Jason  (Actor),     Chan, Catherine  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"A former elite agent encounters and rescues a twelve-year-old Chinese girl who's been abducted by the Triads. Armed with a safe-cracking combination, they find themselves in the middle of a stand-off between Triads, the Russian Mafia and high-level corrupt New York City politicians and police.\"]\n{'Genre': 'Action', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Chan, Catherine, Mount, Anson, Burke, Robert John, Hong, James, Statham, Jason', 'Language': 'Unqualified (Dolby Surround)', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'unknown', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 35 minutes', 'Release date': 'September 4, 2012', 'Actors': 'Statham, Jason, Chan, Catherine, Burke, Robert John, Mount, Anson, Hong, James', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love this movie - this little girl is sharp - smart, smart sharp. She works well with Jason Statham's character. It is a feel-good movie with the prerequisite Statham violence. If you like his movies, you'll love this one!\nGreat Movie\nHomefront\nJason Statham  (Actor),     James Franco  (Actor),     Gary Fleder  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Jason Statham, James Franco, Winona Ryder and Kate Bosworth star in this action-packed thriller about how far one man will go to protect his family. Widowed ex-DEA agent Phil Broker (Statham) retires to a quiet Southern town with his 10-year-old daughter and discovers that the idyllic setting is riddled with drugs and violence. When a riveting chain of events forces him to face off with psychotic local drug lord Gator Bodine (Franco), Broker must retaliate using the fearsome skills he hoped to keep in his past. From screenwriter Sylvester Stallone, Homefront is \"An absolute blast! A thrill ride from start to finish!\" (Chris Parente, FOX-TV)', 'Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Standoff', 'Standoff', ']]>']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '29093443', 'Director': 'Gary Fleder', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'March 11, 2014', 'Actors': 'Jason Statham, James Franco, Winona Ryder, Kate Bosworth, Rachelle Lefevre', 'Subtitles': 'Spanish, French', 'Producers': 'John Thompson, Kevin King Templeton, Sylvester Stallone', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Sylvester Stallone', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was a really good movie. There were a couple of parts where I wanted to smack his &#34;daughter&#34; (spank, not abuse) but overall, good plot, a few really neat twists, a beautiful Wynona Ryder as a small part side-character (haven't seen her in awhile) and typical Statham &#34;take out all the bad-guys&#34; fun! If you like his movies, you'll love this one!\nGreat Twists and Plot\nSunset\nBruce Willis  (Actor),     James Garner  (Actor),     Blake Edwards  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Bruce Willis and James Garner are out to make a movie and solve a murder in Blake Edward's SUNSET, the fictional adventures of two of America's greatest real-life heroes.Willis (The Fifth Element, Die Hard) stars as Tom Mix - Hollywood's hottest action-hero who's been cast to play the legendary lawman Wyatt Earp. Trouble is, Earp (Garner, Twilight, Maverick) has been hired to work as a technical expert on the film - and this doesn't sit too well with the big at-the-top-of-his-career movie star Mix. Even worse... Earp doesn't take too well to movie moguls and the fancy studio life. So, Old West and New Hollywood collide and inadvertently become a vivid backdrop for one of the most shocking murder mysteries ever to scorch the silver screen. Come back to a lost time when movies were movies, murders were mayhem and heroes were just plain outrageous, in SUNSET... the action-packed adventure this side of Hollywood and Vine. It's the truth, every word of it... give or take a lie or two!\"]\n{'Genre': 'Crime', 'Format': 'Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Contributor': 'Patricia Hodge, Joe Dallesandro, Mariel Hemingway, Andreas Katsulas, Jennifer Edwards, Bruce Willis, Blake Edwards, Richard Bradford, M. Walsh, James Garner, Kathleen Quinlan, Tony Adams, Dermot Mulroney, Malcolm McDowell, Artista Management, A.G.; TriStar PicturesPatricia Hodge, Joe Dallesandro, Mariel Hemingway, Andreas Katsulas, Jennifer Edwards, Bruce Willis, Blake Edwards, Richard Bradford, M. Walsh, James Garner, Kathleen Quinlan, Tony Adams, Dermot Mulroney, Malcolm McDowell, Artista Management, A.G.; TriStar Pict…   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Blake Edwards', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'August 25, 1998', 'Actors': 'Bruce Willis, James Garner, Mariel Hemingway, Kathleen Quinlan, Jennifer Edwards', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Tony Adams', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis DVD is so hard to find now - I looked everywhere and they wanted upwards to $100 for this on other sites. I had it and lost it accidentally so when I discovered this here and, while high, at a great price compared to others (smile). It is a very funny DVD with Bruce Willis and James Garner being tongue-in-cheek funny. If you like either of these actors, you need to add this DVD to your collection!\nA Keeper\nFinding Dory\nEllen DeGeneres  (Actor),     Albert Brooks  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From the Academy Award(R)-winning creators of Disney-Pixar's FINDING NEMO (Best Animated Feature, 2003) comes an epic undersea adventure filled with imagination, humor and heart. When Dory, the forgetful blue tang (Ellen DeGeneres), suddenly remembers she has a family who may be looking for her, she, Marlin (Albert Brooks) and Nemo (Hayden Rolence) take off on a life-changing quest to find them...with help from Hank, a cantankerous octopus; Bailey, a beluga whale who's convinced his biological sonar skills are on the fritz' and Destiny, a nearsighted whale shark! Bring home the movie overflowing with unforgettable characters, dazzling animation and gallons of bonus extras!\"]\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 10.72 Ounces', 'Item model number': '43243034', 'Director': 'Andrew Stanton', 'Media Format': 'AC-3, Dolby, NTSC, Subtitled, DTS Surround Sound, Dubbed', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 15, 2016', 'Actors': 'Ellen DeGeneres, Albert Brooks, Hayden Rolence, Diane Keaton, Eugene Levy', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, Spanish, English', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Walt Disney Studios', 'Writers': 'Screenplay By Andrew Stanton, Story By Andrew Stanton and Victoria Strouse & Bob', 'Number of discs': '3'}\nThis DVD is a combo-pack so no matter what type DVD player you have it works. The movie is hysterical and had no issues with playback of the DVD!!\nGreat Product\n3 Days to Kill\nTomas Lemarquis  (Actor),     Marie Guillard  (Actor),     McG  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"In this heart pounding action-thriller, Kevin Costner is a dangerous international spy, who is determined to give up his high stakes life to finally build a closer relationship with his estranged wife and daughter, whom he's previously kept at arm's length to keep out of danger. But first, he must complete one last mission- even if it means juggling the two toughest assignments yet: hunting down the world's most ruthless terrorist and looking after his teenage daughter for the first time in ten years, while his wife is out of town.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': 'FOX2290955BR', 'Director': 'McG', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, DTS Surround Sound, Subtitled, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'May 20, 2014', 'Actors': 'Tomas Lemarquis, Marie Guillard, Raymond J Barry, Tómas Lemarquis, James Owen', 'Subtitles': 'English, Spanish', 'Producers': 'Ryan Kavanaugh, Virginie Besson-Silla, Marc Libert, Luc Besson, Adi Hasak', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nI had no idea what to expect when I first saw this movie - I loved it enough to buy the DVD to keep on hand to watch again. Kevin Costner and his teen-age daughter - together they've made a very funny movie.\nA Keeper\nThe Bourne Legacy\nJeremy Renner  (Actor),     Rachel Weisz  (Actor),     Tony Gilroy  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The Bourne Legacy takes the action-packed Bourne series to an explosive new level. On the verge of having their conspiracy exposed, members of the government\\'s intelligence community will stop at nothing to erase all evidence of their top secret programs—even the agents involved. Aaron Cross (Jeremy Renner) must use his genetically-engineered skills to survive the ultimate game of cat-and-mouse and finish what Jason Bourne started. Also starring Academy Award® winner Rachel Weisz and Academy Award® nominee Edward Norton, critics are calling this a \"thrilling, edge-of-your-seat heart-pounder\" (Meg Porter Berns, WSVN-TV (FOX), Miami).']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.35 inches; 2.4 Ounces', 'Item model number': '61177492', 'Director': 'Tony Gilroy', 'Media Format': 'NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 15 minutes', 'Release date': 'April 5, 2016', 'Actors': 'Jeremy Renner, Rachel Weisz, Edward Norton, Stacy Keach, Dennis Boutsikaris', 'Subtitles': 'French, Spanish', 'Producers': 'Frank Marshall, Patrick Crowley, Jeffrey M. Weiner, Ben Smith', 'Language': 'French Canadian (DTS 5.1), English (DTS 5.1), Spanish (DTS 5.1), English (DTS-HD 2.0)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Tony Gilroy, Dan Gilroy', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWasn't sure I'd like this because it wasn't Matt Damon - but I can say Jeremy Renner made an excellent movie to add to the Bourne collection. My husband and I have watched it several times, liking it more each time.\nExcellent Bourne\nIce Age: Collision Course\nJennifer Lopez  (Actor),     Jennifer Lopez & Maluma  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['When sabre-toothed squirrel Scrat blasts off into outer space on an alien ship, he winds up accidentally sending a massive asteroid hurtling towards Earth. Now, Manny, Sid, Diego, and the rest of the Herd set out on their most important journey ever as they desperately try to find a way to help one-eyed, dinosaur-hunting weasel Buck divert the giant space rock and save the world. The fifth installment in the computer-animated series features the voices of Ray Romano, John Leguizamo, Denis Leary, Queen Latifah, Simon Pegg. 94 min. Widescreen; Soundtracks: English Dolby Digital 5.1, Spanish Dolby Digital Surround stereo, French Dolby Digital Surround stereo; Subtitles: English (SDH), Spanish, French; featurettes; sing-along songs; more. Two-disc set.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 6.7 inches; 8.32 Ounces', 'Item model number': '43212579', 'Media Format': 'DVD', 'Release date': 'October 11, 2016', 'Actors': 'Jennifer Lopez, Jennifer Lopez & Maluma', 'Dubbed': 'French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nLove all the Ice Age movies (and don’t even have kids in the house).\nFive Stars\nSharknado 5: Global Swarming\nTara Reid  (Actor),     Ian Ziering  (Actor),     Anthony C. Ferrante  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['With much of North America lying in ruins, the rest of the world braces for the inevitable: a global sharknado. The mission gets personal for Fin Shepard (Ian Ziering) and his bionic wife, April (Tara Reid) when their young son gets trapped in a traveling nado and transported all over the world.\\xa0From London to Asia, Australia to Italy, Fin and his family must put a stop to the sharknados once and for all.']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Director': 'Anthony C. Ferrante', 'Media Format': 'Dolby, NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 3, 2017', 'Actors': 'Tara Reid, Ian Ziering, Cassie Scerbo, Masiela Lusha, Cody Linley', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nThese movies you either like or hate. My husband and I love them knowing they are silly and just perfect for relaxing and enjoying. The actors really make it look real so it’s just a lot of fun\nAnother great shark attack!!\nWhen Harry Met Sally 2 with Billy Crystal & Helen Mirren\nComedy\n[\"The remake of 'When Harry Met Sally' that everyone has been waiting for is finally here. Starring Billy Crystal, Helen Mirren and featuring the many talents of Rob Reiner, Adam Scott, Mike Tyson, Rob Riggle, Maya Rudolph, Jennifer Crystal Foley, Mike O'Malley & Josh Fadem.\"]\n{'Subtitles': ['None available'], 'Directors': ['Lindsay Crystal'], 'Producers': ['Funny Or Die', 'Ally Hord', 'Samantha Sprecher', 'Betsy Koch'], 'Starring': ['Billy Crystal', 'Helen Mirren', 'Rob Reiner']}\nI was absolutely livid when I realized it was NOT a real movie - just a 5 minute satire. It was just hysterical although people who don't like blood dripping all over the place (vampires ARE messy, you know), might not like it.  It is a perfect showcase for both Helen and Billy's comedic chops!\nToo too funny... where's the whole movie?",
  "profile": "The user continues to express a robust preference for films that intertwine humor, emotional depth, and intricate storytelling, demonstrating adaptability in their viewing choices. Their recent acquisition highlights a willingness to embrace lighthearted, entertainment-driven narratives while still appreciating the comedic elements of familiar actors. This latest interaction reveals an affinity for satire and humor, even when it strays from traditional film formats, further enriching their diverse cinematic palate.\n\nTheir established love for wellness themes, dynamic character interactions, and societal issues persists, reinforcing their enthusiasm for emotionally resonant storytelling. The user seeks well-crafted cinematography and soundtracks that resonate across generations, skillfully blending classic and contemporary elements. This evolving taste reflects their identity as a cinephile who values both depth in character and engaging narratives.\n\nThe recent engagement indicates an enjoyment of films that prioritize fun and comedic exploration alongside emotional insights, underscoring their openness to varied storytelling. Their ongoing pursuit of content that entertains while offering reflections on relationships and personal journeys remains a core aspect of their profile, regardless of genre. This adaptability showcases a rich appreciation for the nuances of cinema, constantly driven by the desire for meaningful and enjoyable viewing experiences.",
  "metrics": {
    "rouge1_f": 0.047921071176885134,
    "rouge2_f": 0.00282021151586369,
    "rougeL_f": 0.027719050974864934,
    "meteor": 0.013730913057027111,
    "bleu1": 4.272707882181953e-12,
    "bleu2": 1.4762009526823885e-12,
    "bleu3": 2.103345172348894e-13,
    "bleu4": 7.948844818352463e-14,
    "bertscore_precision": 0.3113447427749634,
    "bertscore_recall": 0.48753440380096436,
    "bertscore_f1": 0.38001060485839844
  }
}