{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sweatin' to the Oldies: The Complete Collection\nReview Date: 2014/03/20\nStore: Richard Simmons  (Actor),     E.H. Shipley  (Director),     Christopher Cohen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Exercise & Fitness\nProduct Description: [\"The Complete Collection of Sweatin' to the Oldies presents all 4 of Richard Simmons' original Sweatin' to the Oldies workouts on DVD plus Richard's brand new show, Love Yourself and Win as a bonus DVD. You'll get forty-one exercise routines set to forty-one rock 'n' roll classics like: It's My Party, Big Girls Don't Cry, Gimme Some Lovin', Oh, Pretty Woman, and more. This 20th Anniversary edition also includes 2 hours of brand new, exclusive bonus material featuring an interview with Richard, incredible success stories from his students, and more.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Exercise & Fitness, Music Videos & Concerts', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Richard Simmons, E.H. Shipley, Christopher Cohen', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 1.7 inches; 15.2 Ounces', 'Director': 'E.H. Shipley, Christopher Cohen', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'January 8, 2008', 'Actors': 'Richard Simmons', 'Studio': 'Time Life Records', 'Number of discs': '5'}\nReview Text: This was a great inexpensive set to purchase.  I have fluctuated between #1 and #2 of the Sweating' program with my VHS copies and it was past time to get this on DVD.  The quality is great and while I haven't used #3-#5 of the DVDs, I'm sure they are just as good.  This is a great starter exercise program, especially if you haven't exercised in a while.  The songs are fun and the moves very easy.  The people working with Richard are all different sizes (i.e., not perfect size 6's) so you can workout without being intimidated by skinny people (smile).  Richard Simmons may come across as hokey but you can't fault that this form of exercise is enjoyable!  Time actually passes by quickly as you workout to songs from the 60's!\nReview Title: Great DVDs and Program\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "O Brother, Where Art Thou? [Blu-ray]\nGeorge Clooney  (Actor),     John Turturro  (Actor),     Joel Coen  (Director, Writer),     Roger Deakins  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'George Clooney (', 'The Perfect Storm', ') and John Turturro (', 'Cars 2', \")embark on the adventure of a lifetime in this hilarious, offbeat road picture. And now, for the first time, this quirky gem shines more brightly than ever in Blu-ray High Definition! Fed up with crushing rocks on a prison farm in Mississippi, the dapper, silver-tongued Ulysses Everett McGill (Clooney) busts loose...except he's still shackled to two misfits from his chain gang: bad-tempered Pete (Turturro), and sweet, dimwitted Delmar (Tim Blake Nelson). With nothing to lose and buried loot to regain, the three embark on a riotous odyssey filled with chases, close calls, near misses and betrayal. Experience every unpredictable moment as it plays out in the crystal-clear sound and breathtaking picture quality of Blu-ray. Populated with strange characters, including a blind prophet, sexy sirens, and a one-eyed Bible salesman (John Goodman),\", 'O Brother, Where Art Thou', '? will leave you laughing at every outrageous and surprising twist and turn', 'Amazon.com', 'Only Joel and Ethan Coen, the fraternal director and producer team behind art-house hits such as', 'The Big Lebowski', 'and', 'Fargo', \"and masters of quirky and ultra-stylish genre subversion, would dare nick the plot line of Homer's Odyssey for a comic picaresque saga about three cons on the run in 1930s Mississippi. Our wandering hero in this case is one Ulysses Everett McGill, a slick-tongued wise guy with a thing about hair pomade (George Clooney, blithely sending up his own dapper image) who talks his chain-gang buddies (Coen-movie regular John Turturro and newcomer Tim Blake Nelson) into lighting out after some buried loot he claims to know of. En route they come up against a prophetic blind man on a railroad truck, a burly, one-eyed baddie (the ever-magnificent John Goodman), a trio of sexy singing ladies, a blues guitarist who's sold his soul to the devil, a brace of crooked politicos on the stump, a manic-depressive bank robber, and--well, you get the idea. Into this, their most relaxed film yet, the Coens have tossed a beguiling ragbag of inconsequential situations, a wealth of looping, left-field dialogue, and a whole stash of gags both verbal and visual. O Brother (the title's lifted from Preston Sturges's classic 1941 comedy\", \"Sullivan's Travels\", \") is furthermore graced with glowing, burnished photography from Roger Deakins and a masterly soundtrack from T-Bone Burnett that pays loving homage to American '30s folk styles--blues, gospel, bluegrass, jazz, and more. And just to prove that the brothers haven't lost their knack for bad-taste humor, we get a Ku Klux Klan rally choreographed like a cross between a Nuremberg rally and a Busby Berkeley musical. --\", 'Philip Kemp']\n{'Genre': 'Comedy', 'Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Wayne Duvall, Ed Gale, Daniel Von Bargen, Ray McKinnon, Brian Reddy, Del Pentecost, Joel Coen, Chris Thomas King, Michael Badalucco, J.R. Horne, Tim Blake Nelson, Charles Durning, Ethan Coen, George Clooney, John Turturro, John Goodman, Holly Hunter, Roger DeakinsWayne Duvall, Ed Gale, Daniel Von Bargen, Ray McKinnon, Brian Reddy, Del Pentecost, Joel Coen, Chris Thomas King, Michael Badalucco, J.R. Horne, Tim Blake Nelson, Charles Durning, Ethan Coen, George Clooney, John Turturro, John Goodman, Holly Hunter, Roger Deakins  See more', 'Language': 'Spanish (Dolby Digital 2.0), English (DTS-HD High Res Audio)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'French', 'Item model number': 'Relay time: 107min', 'Director': 'Joel Coen, Roger Deakins', 'Media Format': 'Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 47 minutes', 'Release date': 'September 13, 2011', 'Actors': 'George Clooney, John Turturro, Tim Blake Nelson, John Goodman, Holly Hunter', 'Subtitles': 'French, Spanish, English', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Ethan Coen, Joel Coen', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of my husband's favorite DVDs so to be able to go from VHS to the sharpness of a Blu-Ray was a nice switch!  A wonderful romp and take on Homer's story Odyssey!  I love the &#34;look&#34; of the 1930's and we just laughed our way all the way through this DVD.  My husband also likes Bluegrass, so he loved the music, too.\nSo Funny\nSweatin' to the Oldies: The Complete Collection\nRichard Simmons  (Actor),     E.H. Shipley  (Director),     Christopher Cohen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n[\"The Complete Collection of Sweatin' to the Oldies presents all 4 of Richard Simmons' original Sweatin' to the Oldies workouts on DVD plus Richard's brand new show, Love Yourself and Win as a bonus DVD. You'll get forty-one exercise routines set to forty-one rock 'n' roll classics like: It's My Party, Big Girls Don't Cry, Gimme Some Lovin', Oh, Pretty Woman, and more. This 20th Anniversary edition also includes 2 hours of brand new, exclusive bonus material featuring an interview with Richard, incredible success stories from his students, and more.\"]\n{'Genre': 'Exercise & Fitness, Music Videos & Concerts', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Richard Simmons, E.H. Shipley, Christopher Cohen', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 1.7 inches; 15.2 Ounces', 'Director': 'E.H. Shipley, Christopher Cohen', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '6 hours and 25 minutes', 'Release date': 'January 8, 2008', 'Actors': 'Richard Simmons', 'Studio': 'Time Life Records', 'Number of discs': '5'}\nThis was a great inexpensive set to purchase.  I have fluctuated between #1 and #2 of the Sweating' program with my VHS copies and it was past time to get this on DVD.  The quality is great and while I haven't used #3-#5 of the DVDs, I'm sure they are just as good.  This is a great starter exercise program, especially if you haven't exercised in a while.  The songs are fun and the moves very easy.  The people working with Richard are all different sizes (i.e., not perfect size 6's) so you can workout without being intimidated by skinny people (smile).  Richard Simmons may come across as hokey but you can't fault that this form of exercise is enjoyable!  Time actually passes by quickly as you workout to songs from the 60's!\nGreat DVDs and Program",
  "profile": "The user demonstrates a strong affinity for classic, comedic films, particularly those with quirky narratives and historical settings, especially from the 1930s. Their appreciation for well-crafted cinematography and storytelling is evident, as is their enjoyment of soundtracks featuring traditional American music genres, such as bluegrass. The user values high-quality visual and audio experiences, shown by their transition from VHS to Blu-ray.\n\nTheir recent purchase reflects a broader interest in nostalgic and family-oriented media, indicating they also appreciate fitness-related content that can foster a fun, shared experience. The user enjoys engaging their family in viewing activities, as illustrated by their husband's involvement. Their tastes align with entertaining narratives that evoke nostalgia while also delivering humor, and they maintain an openness to diverse genres that promote enjoyment and comfort in fitness, blending their love for music with physical activity. Overall, the user seeks high-quality productions that enhance the family experience while embracing both classic entertainment and modern fitness approaches.",
  "metrics": {
    "rouge1_f": 0.13824884792626727,
    "rouge2_f": 0.010769230769230769,
    "rougeL_f": 0.0629800307219662,
    "meteor": 0.0382115563174059,
    "bleu1": 0.00023015006165960658,
    "bleu2": 8.522964544924434e-05,
    "bleu3": 2.6784384340815433e-05,
    "bleu4": 8.455696015071139e-06,
    "bertscore_precision": 0.31243088841438293,
    "bertscore_recall": 0.4461921155452728,
    "bertscore_f1": 0.3675190210342407
  }
}