{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bitter Harvest (2016)\nReview Date: 2019/07/12\nCategories: Action, Drama, Gritty, Harrowing\nProduct Description: ['Starring Academy Award® nominee Terence Stamp, BITTER HARVEST is a powerful story of survival, honor, and rebellion told through the eyes of two star-crossed lovers.']\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['George Mendeluk'], 'Producers': ['Stuart Baird', 'Chard Barager', 'Jaye Gazeley', 'Ian Ihnatowycz'], 'Starring': ['Max Irons', 'Samantha Barks', 'Barry Pepper']}\nReview Text: The film had superb cinematography.  This was a historical drama in remembrance of the Holodomor Genocide in Ukraine 1932-33.<br />I had never heard of this horrific tragedy in the history of mankind.  It was a sad representation of the horrors of the Ukranian people but at the same time showing the determination of the people's desire to fight back.<br />Highly recommended for world history students.\nReview Title: Bitter Harvest - Remembering the genocide in Ukraine 1932-33\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Terry McDonagh'], 'Starring': ['Ray Winstone', 'Suranne Jones'], 'Studio': ['FilmRise']}\nOn a whim, I came across this British mystery series and decided to watch.  I'm on the 2nd season and have thoroughly enjoyed the series ... it's too bad that it ends with 2nd season.  would've been nice to have more added.\nOn a whim\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Byrum Geisler'], 'Producers': ['Brandon Garza', 'Alex Bice', 'Wes Ross'], 'Starring': ['Ethan Sharrett', 'Chase Conner', 'Brandi Price'], 'Studio': ['Washington House']}\nI decided to give this film 5 stars because of the movie's themes even though the story was somewhat slow to develop.  These are new actors that I wasn't familiar with but I especially developed a strong bond with Ben Bennett.  You could see how much he wanted to tell Lee about his feelings but was afraid to do so.<br />The film deals with the real problems that a relationship like this one can bring.  It was moving to see a happy ending like this one.\nMakes You Think\n{'Content advisory': ['Smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['John Korty', 'Arthur Hiller'], 'Producers': ['David Golden', 'Howard G. Minsky'], 'Starring': ['Ali MacGraw', \"Ryan O'Neal\", 'John Marley'], 'Studio': ['Paramount Pictures']}\nI watched this in 1970 & loved it.  Now 49 yrs later, it still has the same effect ... a universal love theme with a sad ending.  superb acting by R. O'Neal and A. McGraw\nEpic Love Story\n{'Subtitles': ['None available'], 'Directors': ['Alejandro Bazzano'], 'Producers': ['Nacho Manubens', 'Sonia Martinez', 'Josep Cister Rubio', 'Aitor Montanchez'], 'Starring': ['Miguel angel Muñoz', 'Susi Sanchez', 'Elvira Minguez'], 'Studio': ['Atresmedia Television']}\nThis was one of the best productions I've seen from Spain.  Beautiful cinematography and breathtaking scenes of the Basque country.  One of the reasons I chose to watch it is just that to see the country scenes.  This seems to be a \"film noir\" type with a good plot and an unexpected ending.  All new actors for me however, I had seen Susi Sanchez acting in a previous Spanish film.  The only thing that I felt was NOT NECESSARY were all the sex scenes in the earlier episodes ... don't believe this contributed to the plot or if they had to throw in sex, the directors could have given it a \"softer\" touch ... I didn't dock any stars for that though.  For those language fans out there, there's a lot of the Basque language you see in the film ... and I picked up some of the simpler Basque greetings.  Recommended for mature audiences.\nGood Acting and Unexpected Ending\nAshes in the Snow\nHistorical, Romance, Downbeat, Emotional\n[\"During World War II, a 16 year-old aspiring artist and her family are deported to Siberia amidst Stalin's brutal dismantling of the Baltic region. One girl's passion for art and her never-ending hope will break the silence of history.\"]\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Marius Markevicius'], 'Producers': ['Marius Markevicius', 'Zilvinas Naujokas', 'Chris Coen', 'Prithvi Chavan'], 'Starring': ['Bel Powley', 'Sophia Cookson', 'Lisa Loven Kongsli']}\nIf I could give this 10 stars I would.  I always enjoy historical films and I was blown away by this film.  Beautiful cinematography and outstanding acting.  Although it had some violent scenes, I believe the film conveyed the message how these innocent families struggled, survived and perished under Stalin's rule.  Recommended for those interested in history.\nExtraordinary  historical account\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rose Bosch'], 'Producers': ['Jean-Robert Gibard', 'Alain Goldman', 'Catherine Morisse', 'Christer von Lindequist'], 'Starring': ['Jean Reno', 'Melanie Laurent', 'Gad Elmaleh'], 'Studio': ['Menemsha Films']}\nAn explicit historical account of the Velodrome d'hiver Round up (La Rafle) in Paris where thousands of Jews were arrested in mass and placed in extremely crowded conditions at the velodrome.<br />A very emotional film depicting the horror of mass murder of innocent people in transit to Auschwitz.<br />Beautiful cinematography and outstanding acting.  Highly recommended for those interested in historical drama.\nEmotional Account of the Vel D'Hiver Round up in Paris\nBitter Harvest (2016)\nAction, Drama, Gritty, Harrowing\n['Starring Academy Award® nominee Terence Stamp, BITTER HARVEST is a powerful story of survival, honor, and rebellion told through the eyes of two star-crossed lovers.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['George Mendeluk'], 'Producers': ['Stuart Baird', 'Chard Barager', 'Jaye Gazeley', 'Ian Ihnatowycz'], 'Starring': ['Max Irons', 'Samantha Barks', 'Barry Pepper']}\nThe film had superb cinematography.  This was a historical drama in remembrance of the Holodomor Genocide in Ukraine 1932-33.<br />I had never heard of this horrific tragedy in the history of mankind.  It was a sad representation of the horrors of the Ukranian people but at the same time showing the determination of the people's desire to fight back.<br />Highly recommended for world history students.\nBitter Harvest - Remembering the genocide in Ukraine 1932-33",
  "profile": "**User Summary:**\n\n- **Content Preference:** The user continues to enjoy British mystery series and has a strong interest in international productions, particularly those with beautiful cinematography and historical narratives. They are increasingly drawn to films that tackle significant historical events while exploring themes of love and emotional depth. Character-driven storytelling remains a key focus.\n\n- **Engagement Style:** The user engages spontaneously with both series and films, showing a preference for narratives that evoke strong emotional responses. They appreciate various genres, particularly those with gritty, historical contexts that feature compelling character development.\n\n- **Viewing Habits:** The user is invested in longer series and standalone films that deeply explore characters and convey substantial emotional weight. They value narratives with unique cultural elements and thoughtful conclusions.\n\n- **Language:** Prefers content in English but is open to films in other languages, using subtitles to enhance engagement.\n\n- **Emotional Response:** The user exhibits a profound appreciation for intricate storytelling, emphasizing emotional complexity and visual beauty in reviews. They are especially drawn to narratives that portray historical tragedies with poignant representations and demonstrate human resilience.\n\n- **Rating Behavior:** Rates content variably (3.0 to 5.0), with recent ratings reflecting strong opinions on narrative quality and emotional impact. A recent 5-star rating showcased their enthusiasm for emotionally rich historical dramas with a focus on significant but often overlooked events.\n\nOverall, the user demonstrates a clear affinity for intricate, emotional narratives that blend elements of history, depth, and compelling character arcs.",
  "metrics": {
    "rouge1_f": 0.19636363636363638,
    "rouge2_f": 0.020036429872495442,
    "rougeL_f": 0.08909090909090908,
    "meteor": 0.06387752496224015,
    "bleu1": 0.014385421148782477,
    "bleu2": 0.00396267265183256,
    "bleu3": 0.0015634573834096203,
    "bleu4": 0.0008264922473122045,
    "bertscore_precision": 0.3723774552345276,
    "bertscore_recall": 0.48573172092437744,
    "bertscore_f1": 0.4215676486492157
  }
}