{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Rachel Getting Married\nReview Date: 2009/04/08\nStore: Anne Hathaway  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"When Kym (Anne Hathaway - Golden Globe Nominee, Best Actress, Motion Picture (Drama)), returns to the Buchman family home for the wedding of her sister Rachel (Rosemarie DeWitt), she brings a long history of personal crises, family conflict and tragedy along with her. The wedding couple's abundant party of friends and relations have gathered for a joyful weekend of feasting, music and love, but Kym - with her biting one-liners and flair for bombshell drama - is a catalyst for long-simmering tensions in the family dynamic. Filled with the rich and eclectic characters that remain a hallmark of Jonathan Demme's films, RACHEL GETTING MARRIED paints a heartfelt, perceptive and sometimes hilarious family portrait.\", 'Amazon.com', \"Pitched between Robert Altman's\", 'A Wedding', \"and Noah Baumbach's\", 'Margot at the Wedding', '--but more cautiously optimistic than both--', 'Rachel Getting Married', 'marks a change in course for director Jonathan Demme. Granted, few Oscar winners have walked a more diverse path. After a series of documentaries and remakes, the', 'Silence of the Lambs', \"helmer tries his hand at the intimate chamber drama. With the help of actress Anne Hathaway and screenwriter Jenny Lumet, daughter of filmmaker Sidney, he pulls it off. The festivities kick into high gear once Kym (Hathaway, with smeared eyeliner and unkempt hair) takes a break from rehab for her sister's big day. It soon transpires that Kym, who hides her wounded soul behind a veil of sarcasm, serves as the Buchman's resident black sheep. The problem goes deeper than drugs to a tragedy in which she played a part. As Kym, bride Rachel (\", 'Mad Men', \"'s Rosemary DeWitt), their parents (Bill Irwin and Debra Winger), groom Sidney (TV on the Radio's Tunde Adebimpe), and the rest of the bohemian Connecticut brood struggle with the past, the nuptials continue, graced by performances from past Demme collaborators like Sister Carol East (\", 'Something Wild', ') and Robyn Hitchcock (', 'Storefront Hitchcock', '). The hours between reception and after-party contain humor, affection, and painful revelations. In the press notes, Demme claims that he and cinematographer Declan Quinn (', 'In America', ') attempted to make a film that looked like \"The most beautiful home movie ever made.\" Using handheld cameras and believably flawed characters, they\\'ve done just that.', '--Kathleen C. Fennessy', 'Stills from', 'Rachel Getting Married', '(Click for larger image)']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Anne Hathaway', 'Language': 'Unqualified', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '5068392', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 10, 2009', 'Actors': 'Anne Hathaway', 'Dubbed': 'French', 'Subtitles': 'French', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\nReview Text: After my sister saw RACHEL GETTING MARRIED in the theater, she called me to say she had seen the best film of the year.  I never saw the film, so I watched the DVD and tried to see what my sister loved so much.  Anne Hathaway gave a stellar performance and I see why she was nominated for various awards, but I saw nothing else in the film to make me consider it with such high regard as did my sister.  For me, the story dragged and needed tighter editing.  I wasn't too fond of the camera work, but that's my humble opinion.  When the DVD finished playing, I tried watching the special features, but after a few minutes, I ejected the DVD and went on about my business.<br /><br />I'm a fan of films which concentrate on dysfunctional families.  Perhaps it makes my own family seem more normal or perhaps they give me more ammunition for taking our interactions to a new level of absurdity.  What this film lacked for me was that ammunition because there was nothing extraordinary.  In the film, we have one sister who needs to be the center of the world, or does the world simply see her as the center and everyone follows that plan?  We have a mother who is aloof, or is she simply surviving as she knows how, removed from the daily existence of those she left behind?  We have a father who only knows the path of least resistance, or is he simply being passive aggressive in order to forge ahead and keep afloat?  We have a multicultural, multiracial, multireligious gathering for a celebration that brings with it baggage of a hundred years and lives.  For Hathaway's portrayal of a young woman who is broken and unable to fix herself without bits chipping away with every move, I recommend this DVD.  That's about it for me.\nReview Title: Hathaway's performance is reason to watch\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Juno (Single-Disc Edition)\nEllen Page  (Actor),     Michael Cera  (Actor),     Jason Reitman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'The word \"quirky\" has become the quick and easy way to describe films such as LITTLE MISS SUNSHINE and LARS AND THE REAL GIRL that straddle the lines between indie and studio films and comedy and drama. While JUNO fits into that same category, this distinctive dramedy is in a class all it\\'s own. Ellen Page (X-MEN: THE LAST STAND) stars as Juno, a witty teenage girl whose boredom doesn\\'t lead her to the mall. Instead, she makes a one-time trip into the arms of her best friend Paulie Bleeker (Michael Cera). When Juno discovers that she\\'s pregnant, she\\'s forced to grow up fast as she tries to find adoptive parents for her quickly growing child. Director Jason Reitman Star Ellen Page, Michael Cera, Allison Janney, J.K. Simmons, Rainn Wilson, Jason Bateman, Jennifer Garner, Olivia Thirlby Special Features: Widescreen - 1.85 Audio: Dolby Digital Surround - Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish - Optional Additional Release Material: Alternate Scenes - Deleted Scenes (11; w/ Optional Commentary) Audio Commentaries - Jason Reitman Director; Diablo Cody - Screenwriter Behind the Scenes - 1. Screen Tests 2. \"Honest to Blog! Creating JUNO\" Featurettes - 1. Cast & Crew Jam 2. Way Beyond \"Our\" Maturity Level\" 3. \"Diablo Cody is Totally Boss\" 4. \"Jason Reitman for Shizz\" Outtakes - 1. Gag Reel 2. Gag Takes.', 'Amazon.com', 'Somewhere between the sharp satire of', 'Election', 'and the rich human comedy of', 'You Can Count On Me', 'lies', 'Juno', ', a sardonic but ultimately compassionate story of a pregnant teenage girl who wants to give her baby up for adoption. Social misfit Juno (Ellen Page,', 'Hard Candy', ',', 'X-Men: The Last Stand', ') protects herself with a caustic wit, but when she gets pregnant by her friend Paulie (Michael Cera,', 'Superbad', '), Juno finds herself unwilling to terminate the pregnancy. When she chooses a couple who place a classified ad looking to adopt, Juno gets drawn further into their lives than she anticipated. But', 'Juno', 'is much more than its plot; the stylized dialogue (by screenwriter Diablo Cody) seems forced at first, but soon creates a richly textured world, greatly aided by superb performances by Page, Cera, Jennifer Garner and Jason Bateman as the prospective parents, and J.K. Simmons (', 'Spider-Man', \") and Allison Janney as Juno's father and stepmother. Director Jason Reitman (\", 'Thank You For Smoking', \") deftly keeps the movie from slipping into easy, shallow sarcasm or foundering in sentimentality. The result is smarter and funnier than you might expect from the subject matter, and warmer and more touching than you might expect from the cocky attitude. Page's performance is deceptively simple; she never asks the audience to love her, yet she effortlessly carries a movie in which she's in almost every scene. That's star power. --\", 'Bret Fetzer', 'Get to Know', 'Juno', \"'s Cast\", 'Ellen Page (Juno MacGuff)', 'Michael Cera (Paulie Bleeker)', 'Jennifer Garner (Vanessa Loring)', 'Jason Bateman (Mark Loring)', 'Allison Janney (Bren MacGuff)', 'J.K. Simmons (Mac MacGuff)', 'Beyond', 'Juno', 'Juno', 'Soundtrack', 'More from Screenwriter Diablo Cody', 'More from Fox', 'Stills from', 'Juno']\n{'Genre': 'Comedy', 'Format': 'Color, Widescreen, NTSC', 'Contributor': 'Jason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla FayJason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla Fay  See more', 'Language': 'Unqualified, Unknown (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.55 x 5.34 x 7.46 inches; 0.32 Ounces', 'Item model number': '2250687', 'Director': 'Jason Reitman', 'Media Format': 'Color, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'April 15, 2008', 'Actors': 'Ellen Page, Michael Cera, Jennifer Garner, Jason Bateman, Allison Janney', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Diablo Cody', 'Number of discs': '1'}\nWith the opening sequence, I thought I was in for a very creative film akin to \"Napolean Dynamite, \" but I was so wrong.  Though the film was not long, I felt it drag and assumed I had missed something critical perhaps while putting my hand into the popcorn or jordan almonds which I'd prepared in advance.  Every aspect of the script seemed to be contrived and the language grew thin with Juno's quips becoming boring after awhile.  The tension never actually climaxed and I was more entertained by the music than the story.  In a nutshell, this movie is far from a classic and weak in the entertainment.  I prefer my films to be more full bodied than light unless the characters or story can carry them to fruition as entertainment.\nNapolean Dynamite it's not\nRatatouille\nBrad Garrett  (Actor),     Lou Romano  (Actor),     Brad Bird  (Director),     Jan Pinkava  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'From the creators of CARS and THE INCREDIBLES comes a break-through comedy with something for everyone. With delightful new characters, experience Paris from an all-new perspective. It\\'s \"terrific movie making\" raves Leonard Maltin of ENTERTAINMENT TONIGHT. In one of Paris\\' finest restaurants, Remy, a determined young rat, dreams of becoming a renowned French chef. Torn between his family\\'s wishes and his true calling, Remy and his pal Linguini set in motion a hilarious chain of events that turns the City of Lights upside down. RATATOUILLE is a treat you\\'ll want to enjoy again and again.', 'Amazon.com', 'One key point: if you can get over the natural gag reflex of seeing hundreds of rodents swarming over a restaurant kitchen, you will be free to enjoy the glory of', 'Ratatouille', \", a delectable Pixar hit. Our hero is Remy, a French rat (voiced by Patton Oswalt) with a cultivated palate, who rises from his humble beginnings to become head chef at a Paris restaurant. How this happens is the stuff of Pixar magic, that ineffable blend of headlong comedy, seamless technology, and wonder (in the latter department, this movie's views of nighttime Paris are on a par with French cinema at its most lyrical). Director Brad Bird (\", 'The Incredibles', \") doesn't quite keep all his spinning plates in the air, but the gags are great and the animation amazingly expressive--Remy's shrugs and nods are nimbler than many flesh-and-blood actors can manage. Refreshingly, the movie's characters aren't celebrity-reliant, with the most recognizable voice coming from Peter O'Toole's snide food critic. (This fellow provides the film's sole sour note--an oddly pointed slap at critics, those craven souls who have done nothing but rave about Pixar's movies over the years.) Brad Bird's style is more quick-hit and less resonant than the approach of Pixar honcho John Lasseter, but it's hard to complain about a movie that cooks up such bountiful pleasure. --\", 'Robert Horton', 'Beyond', 'Ratatouille', 'on DVD', 'Ratatouille', 'on Blu-ray', 'Ratatouille', 'Toys & More', 'Other Classic Pixar Hits', 'Stills from', 'Ratatouille', '(Click for larger image)']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'WD05371400DVD', 'Director': 'Brad Bird, Jan Pinkava', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen, Digital Sound', 'Run time': '1 hour and 51 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Brad Garrett, Lou Romano, Patton Oswalt', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS-HD Master Audio 7.1)', 'Studio': 'DISNEY/PIXAR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAs a child, I think I would not have been scared of animated rats in the kitchen.  Mice made the most entertaining cartoon characters.  Despite my understanding the magic of animation and being that I did indeed have an unwelcome rat in my kitchen a couple years ago, the notion of rats running through the food, let alone cooking, nauseates me beyond any level of comfort and I found myself cringing throughout \"Ratatouille.\"  Each time I saw the Little Chef on the head of Linguini, I thought it as creepy as the scariest of horror films, particularly since they resembled each other in profile.  I couldn't erase from memory the vision of a three dimensional rodent I photographed running across my balcony.  Nevertheless, I think this film is an outstanding representation of an imaginative story that was successfully translated to film via the collaborative efforts of creative artists.  Mickey Mouse and Mighty Mouse never frightened me as did this film, so I can only assume that had I retained the innocence of youth, I would have been thrilled with the success of the film's heroic underdog, er rather, rat, and not repulsed.  I think kids will love this film.\nMice never scared me like Ratatouille\nI'm Not There (Two-Disc Collector's Edition)\nChristian Bale  (Actor),     David Cross  (Actor),     Todd Haynes  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n[\"Since arriving in New York City's folk music scene in the 1960s, American singer-songwriter Bob Dylan has become a major figure in popular music, influencing millions with his chart topping songs. His records have earned Grammy, Golden Globe, and Academy Awards, and he has been inducted into the Rock and Roll Hall of Fame, Nashville Songwriters Hall of Fame and Songwriters Hall of Fame.\"]\n{'Genre': 'Drama', 'Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Contributor': 'Christian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce GreenwoodChristian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce Greenwood  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.64 x 5.35 x 7.57 inches; 4 Ounces', 'Item model number': '81090', 'Director': 'Todd Haynes', 'Media Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Run time': '2 hours and 15 minutes', 'Release date': 'February 1, 2019', 'Actors': 'Christian Bale, David Cross, Charlotte Gainsbourg, Richard Gere, Bruce Greenwood', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '2'}\nBob Dylan as poet, artist, chameleon, activist and inspiration.  Language and rhythm.  The poetry and music of the man are the foundation of this film, but, \"I'm Not There,\" offers an architectural disaster built upon that base.  I'm a fan of black and white films, particularly of the fifties and sixties, genres which this attempts to mimic, so I was disappointed when scenes and characters bounced around more haphazardly than kids in the bubble room at Ikea.  Rather than go with the flow, I wanted to stop the DVD and do some research to make sense of the random personas and make some sense of chaos.  My mind set is different now than it was in decades past and I'm less impressed by free-interpretation without reason.  As a college student, I'd studied and written about the art of Bob Dylan, so his words and delivery are not unfamiliar.  I played his music on the guitar and hi-fi, in pre-iPod times.  I've been a fan for many years and have friends who were neighbors of Bob Dylan in Minnesota when he was Robert Allen Zimmerman.  I expected much from this film but basically received flashbacks of the music with allusions to times past.  I gave this film 3 stars for the following positive reasons:  1. Cate Blanchett as Jude Quinn, 2. Richie Havens in the opening scene, 3. Throw away lines that are actually Dylan's lyrics, 4. Remembering the time I had a conversation with Joan Baez at the University of Florida, and 5. The impetus to listen to Bob Dylan on my iPod, then read Allen Ginsberg.<br /><br />If you're a fan of Dylan, I recommend the film/DVD and expect that you too will find things to like even if you may not care for the assembly of this abstract interpretation of the artist as a young/er/est man.\nThe muse of the music was the times. The times, they've changed.\nMillions\nAlex Etel  (Actor),     James Nesbitt  (Actor),     Danny Boyle  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Indie & Art House\n['From legendary director Danny Boyle (Trainspotting, 28 Days Later) comes ?a family film of limitless imagination and surprising joy!? (Chicago Sun-Times)', 'It?s holiday season and seven-year-old Damian believes he?s received a divine gift from above when a suitcase filled with cash literally falls out of the sky. Damian is anxious to share the wealth with those less fortunate while his fun-loving brother Anthony would rather spend it like there?s no tomorrow! But when the loot turns out to be stolen, both the boys? plans are put to the test?with heartwarming and hilarious results.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.54 x 5.35 x 7.49 inches; 2.72 Ounces', 'Item model number': '24543198932', 'Director': 'Danny Boyle', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC, Dubbed', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 1, 2005', 'Actors': 'Alex Etel, James Nesbitt, Daisy Donovan, Lewis McGibbon, Christopher Fulford', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Fox Searchlight', 'Writers': 'Frank Cottrell Boyce', 'Number of discs': '1'}\nI don't know how I actually came to watch Danny Boyle's, \"Millions,\" but I sure am glad it came my way.  Before I realized he was the director, as I watched this film, I felt the cinematography, bright colors, and wonderful performances by children were similar to \"Slumdog Millionaire,\" which I saw last month.  Although I'm also a fan of \"Trainspotting,\" I didn't even connect Mr. Boyle to all three films until a few minutes ago.<br /><br />This story is lovely, inspiring, surprising and educational.  Each time the character Damian met a Saint, I learned a little about religion and was amazed at the delivery by this innocent young boy with his lovely and stoic face.  The older brother, Anthony was equally as excellent, showing the determination and strength of the character, but not detracting from his sometimes obscured brotherly love.  The Saints were perfect delusions and the Latter-Day \"Saints\" were not.  The plot inspires discussion and reminds me of the time my sister and I found money outside of a department store and we were fortunate enough to receive it two weeks after we turned it in to security.  Some people thought we should have kept it, but I turned it in without a second's hesitation.  I don't know if I'd do that now as an adult, particularly since well over a hundred dollars can buy a lot of goods off Amazon if you're a seasoned shopper.  Or I could donate it to charity.  Or I could keep half and donate half.<br /><br />Directing child actors is not an easy task and Danny Boyle excels time and again.  I would recommend this film for children as well as adults, followed by a \"what if\" conversation.\nDanny Boyle is all that and a bag of chips\nBlack Book\nCarice van Houten  (Actor),     Sebastian Koch  (Actor),     Paul Verhoeven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Drama\n['Product Description', \"In the darkest days of World War II, Jewish fugitives attempt to escape occupied Holland -- only to face a Nazi ambush. Rachel Stein (Carice van Houten) alone survives the attack and joins the Dutch Resistance to avenge her family. She soon confronts the ultimate test: she must infiltrate German headquarters by tempting Captain Ludwig Mÿntze (Sebastian Hoch). In the heat of passion, he uncovers her duplicity...but keeps her secret. Then Rachel's espionage reveals that a murderous traitor lurks within Resistance ranks. Unable to fully trust anyone, Rachel navigates a minefield of deception and becomes an enemy to both sides. Epic, passionate, breathtaking, Black Book relates an untold story of World War II where the distinctions between good and evil become blurred by the complexities of human nature.\", 'Amazon.com', 'As in', 'Basic Instinct', ', a lovely lady takes the lead in', 'Black Book', \", but this time Paul Verhoeven has more than cheap thrills in mind. Towards the end of WWII, Rachel Stein (the vibrant Carice von Houten), a Jewish singer, is living with a gentile family in the countryside. When Allied forces bomb the area, she's forced to flee. On her perilous journey to The Hague (Verhoeven's hometown), brunette Rachel joins the Resistance and changes her identity to blonde Ellis de Vries. Her next order of business: infiltrate Gestapo headquarters. Like many Verhoeven heroines, Rachel aces her assignment--and then some. First, she seduces the handsome Captain Müntze (Sebastian Koch,\", 'The Lives of Others', \"), then she falls in love with him. Müntze, who returns her affection, isn't what he appears to be, but their relationship puts both at great risk. At this point, the filmmaker expertly kicks the proceedings into high gear, before concluding on a bittersweet note. Naturally, since this is a Verhoeven picture, there's plenty of wry humor and uninhibited sexuality along the way. Starting with 1985's\", 'Flesh + Blood', ', the Dutch director released an American movie every two to three years. After the poorly received', 'Hollow Man', ', however, Verhoeven took a six-year break.', 'Black Book', \", a return to his native Holland, was worth the wait. (He began work on the screenplay in the 1980s.) It works triple-time as a thriller, a tribute to Holland's Jewish population, and a poison pen letter to the Dutch opportunists who would attempt to sell them out.\", '--Kathleen C. Fennessy']\n{'Genre': 'Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom HoffmanPaul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom Hoffman  See more', 'Language': 'Dutch (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 26 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 2.4 Ounces', 'Item model number': '3342210', 'Director': 'Paul Verhoeven', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 26 minutes', 'Release date': 'September 25, 2007', 'Actors': 'Carice van Houten, Sebastian Koch, Thom Hoffman, Halina Reijn', 'Subtitles': 'English, Spanish, French', 'Producers': 'Teun Hilte, Jos van der Linden, Frans van Gestel, San Fu Maltha, Jereon Beker', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI'm not quite sure how I stumbled across this DVD but I sure am glad I spent this afternoon watching the 2 ½ hours of this film.  The story takes place in Holland nearing the end of World War II and the main character is a young Jewish woman, but Anne Frank this is not.  The film opens with a young woman teaching a class in an Israeli kibbutz as another woman who photographs her after exiting a tourist bus recognizes her.  Following a brief interlude, we move into flashback of over a decade earlier, 1944, and we are introduced to Rachel who lives in a farmhouse.  Immediately, we understand that Rachel is Jewish and she lives with a family that is protecting her from the Nazis.  Verhoeven creates in this film a realistic story that apparently is based on true events and since we saw Rachel in the 1956 opening scene, we know she survived WWII and emigrated from Holland to Israel.  This relieves any tension regarding her possible demise as we watch the next two hours of the film, spoiler unnecessary.<br /><br />The photography was beautiful, the acting superb, the story interesting, and it was rewarding to know that digital effects were kept at an absolute minimum in producing the film, \"Black Book.\"  Verhoeven's commentary was filled with interesting information regarding the filming as well as the history, past and more current, so I also recommend listening after viewing the film.  Details were exceptional and I was mesmerized by the makeup, although I did find it rather annoying to see van Houten always with beautiful makeup regardless of the fact that she endured some horrible experiences.  Her comfort in the naked scenes was exceptional and done very tastefully in each case.  I describe these as \"naked\" rather than \"nude\" because I really felt as though I was observing her and not watching from afar.  This film was part history, part war, part romance, part adventure, and a small part mystery.  All in all, watching this was a rewarding way to spend an afternoon.  It has given me much to think about regarding the humanity of people who demonstrate inhumane actions.  Think it's time now to see, \"The Reader.\"\nThe humanity of the inhumane\nFraulein\nMirjana Karanovic  (Actor),     Andrea Zogg  (Actor),     Andrea Staka  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'This is a story of the friendship among 3 Yugoslavian women. Reza left Belgrade more than 30 years ago to seek a new life in Zurich. Now in her 50s, she has completely detached herself from the past.', 'Review', \"Most people, upon reading that this is a Swiss film about women rebuilding their lives in Zurich after fleeing the former Yugoslavia, will feel their eyes involuntarily rolling up into their heads.But despite the occasional sluggish passage, Fraulein is an intriguing picture about people struggling in ways that are so personal that they become universal.Ana (Marija Skaricic) is young and pretty, and has fled the Balkans without a plan she lives out of a bus station locker until she gets a job at a cafe. Her boss, Ruza (Mirjana Karanovic), is older and has had more time to adjust to her new life, adopting a hard-as-nails Germanic attitude. Another cafe employee, Mila (Ljubica Jovic), dreams of returning to Croatia where her husband is building a house. It s primarily a character study, and an excellent one. Director Andrea Staka plays the actors like a fine instrument, eliciting anxiety, pain, passion and joy that feel genuine. --Portland TribuneLOCARNO, Switzerland -- The heartache that accompanies reluctant exile as experienced by three women from the former Yugoslavia underpins Andrea Staka's poignant drama Fraulein which won the Golden Leopard for best film in competition at the Locarno International Film Festival. The film is set in Zurich, where one woman from Belgrade, in what is now Serbia, and another from a seaside town in what is now Croatia have spent about 25 years acclimating to life in Switzerland. Their carefully constructed lives are shaken by the arrival of a vivacious young woman from Sarajevo, in what is now Bosnia, who spurns the older pair's cautious way of life. The clash of viewpoints is explored in touching scenes as the three find their assumptions about survival challenged by a jolting reminder of life's unfairness. Making her feature debut, Swiss-born writer-director Staka, whose parents were Yugoslavian exiles, uses the Zurich locations evocatively, writes in-sightful dialogue and draws naturalistic acting from the principals. The result is a picture that should thrive in Europe and at art houses and suggests a bright future for the filmmaker. The contrasts be-tween the two older women are established quickly with Ruza (Mirjana Karanovic), the stern and disciplined unmarried owner of a charmless but busy diner, and Mila (Ljubica Jovic), a jovial and happily married waitress. Both long exiled, Ruza has put Belgrade behind her and is focused on being totally efficient both in her business and her joyless single life, while Mila dreams of retiring to a house on the Adriatic in Croatia. Into the diner one day comes Ana (Marija Skaricic), who drifts contentedly but proves helpful at the restaurant and is offered a job. Her high spirits and engaging willingness to break the rules, even Ruza's, endear her not only to the others in the place but also to its chilly owner. Ana brings a refreshing indifference to flags and borders, and her ability to enjoy life proves infectious. All three women begin to embrace life more until fate deals another bad hand. The scenes of expatriates torn by nostalgic yearning yet determined to make new lives are well drawn, and the sequences in which Ana helps Ruza shake off her inhibitions also have a keen edge. Skaricic and Jovic show how wisdom and joy are not determined by age. And Karanovic is moving as a woman who has buried both her emotions and any ability to connect with life beyond work until suddenly freed by youthful exuberance. --The Hollywood ReporterWar-torn countries are a popular setting for drama after all war is, perhaps unfortunately, a great dramatic device. But what of the long-term aftermath? What happens to those who flee? Set in Switzerland, this feature debut from Andrea Staka tells the story of three former Yugoslavians not focusing directly on their past but showing, through a complex character study, how that past has shaped their present. Ruza (Mirjana Karanovic) is fiftysomething Serbian, who has filled her life with daily routine. She runs a café and has no time for frivolity, or the past. She is like a piece of piano wire, which you sense could snap with disastrous consequences. One of her staff, Mila (Ljubica Jovic), is Croatian. Anxious and fussy, she dreams of a return to her homeland and frets about the money her husband is spending on their house back in the old country. Into their lives comes Ana (Marija Skaricic). Fresh from Bosnia, she lives out of a railway station locker, living fast at night, so she can bed hop for comfort. A chance encounter sees her get a job at the café, at which point she begins to reshape Ruza and Mila s routine and perception of their lives, as Ana brings a joie de vivre, even as she struggles with her own pain and past. As a character study, this feels as real as a knife cut, slicing to the heart of shattered dreams, long-forgotten hopes and aspirations which may go unfulfilled. Staka gets to the heart of things. Emotion is kept locked in a box, but when it surfaces, the joy is palpable, like a rainbow on a stormy day. Ruza finds passion and compassion, which well up like an oil strike, bursting to the surface in a blaze of glory. Life and relationships are complex Staka shows us just how much. --Amber Wilkinson, Eye for Film\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Pablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko JelcicPablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko Jelcic   See more', 'Language': 'German, Croatian, Serbian', 'Runtime': '1 hour and 21 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FILM1502DVD', 'Director': 'Andrea Staka', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 21 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Mirjana Karanovic, Andrea Zogg, Zdenko Jelcic, Marija Skaricic, Pablo Aguilar', 'Studio': 'Film Movement', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMirjana Karanovic gives a stellar performance in \"Das Fraulein.\"  Actually every actor is superb and although this story leaves much to the imagination, as a lover of simplicity, I adore this character driven film.  Every frame is intentional, each action is necessary, there is not a thing wasted in this low budget production which surpasses many films that cost ten times its budget.  The audio effects were expertly done, including even the background movement of cars in a parking lot.  From a production standpoint, this was a ten.  In less than an hour and a half, we learned how humans share their lives with only a few words spoken relying on their gestures and actions to propel the story.  Where Woody Allen's characters erupt in verbose thoughts, these characters internalize, reminiscent of New Wave films.  As an example, rather than carry on about a woman watching her life go down the drain, we see her watch the sudsy water flow from the sink.  What could be a morose story becomes uplifting and I'm going to watch this again.\nStill thinking about this superb film\nTell No One [DVD]\nFrançois Cluzet  (Actor),     Marie-Josée Croze  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Genre: Suspense Rating: UN Release Date: 25-NOV-2008 Media Type: DVD', 'Amazon.com', \"Based on the book by American author Harlan Coben, this French suspense thriller is one of those exhilarating word-of-mouth gems one can't to tell everyone about. Francois Cluzet stars as Alex, a pediatrician whose beloved wife, Margot (Marie-Josee Croze) was shockingly murdered eight years before. As the anniversary of her death approaches, Alex begins to receive cryptic emails and a video that seems to suggest that she is alive. The discovery of two long-buried bodies at the crime scene turn Alex into some kind of Hitchcockian Everyman, implicated in a crime he could not possibly have committed. But when he makes a mad dash from the police who visit him at his office, he seems to have signed his own confession. This synopsis doesn't even begin to hint at the genuinely exciting and surprising twists, turns, and revelations that await Alex in this Chinese box of a mystery. Brilliantly acted by an ensemble that includes Kristin Scott Thomas and French movie icon Jean Rochefort (\", 'Pardon Mon Affaire', '),', 'Tell No One', 'invites repeat viewings, the better to appreciate the intricacies of its plotting and construction. And if you think you have it figured out, there\\'s this from one character who tells Alex at a climactic point, \"Wait, there\\'s more.\"', '--Donald Liebenson', 'Review', '...it s one of the best movies of the year. --Richard Roeper, Ebert and Roeper...a top-notch thriller so twisty you may forget to breathe...Tell everyone about Tell No One. --Kenneth Turan, Los Angeles TimesVertigo meets The Fugitive by way of The Big Sleep...A labyrinth in which to get deliriously lost...It was even better the second time. --Stephen Holden, New York Times', 'See more']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Contributor': 'François Cluzet, André Dussollier, Marie-Josée Croze', 'Language': 'French, English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Media Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Run time': '2 hours and 11 minutes', 'Release date': 'March 31, 2009', 'Actors': 'François Cluzet, Marie-Josée Croze, André Dussollier', 'Studio': 'Music Box Films', 'Number of discs': '1'}\nAfter receiving the DVD, I realized that I saw this film in a theater last year but never got the title.  I may forget the title, but I seldom forget a film as good as, TELL NO ONE.<br /><br />The music selections are quite interesting, often not what I would have chosen, but perfect in so many instances.  The photography is beautiful but some times the cuts didn't make sense to me -- jarring, inappropriate for the emotion, or leading me to think something was edited out.  Camera movements flowed well for the most part with some intriguing approaches.  Audio editing was done well, with a couple instances which were actually a part of the plot.  I have no criticism of the acting and found the casting to be right on, particularly with the female thug who scares me to this day.  I get queasy and flinch when thinking about her scenes and don't recall her speaking a single word.<br /><br />The plot.  Well, the plot is layered and not very predictable at all, but this film lost one star from me for not having all the layers fused.  I watched the deleted scenes and outtakes but still found sections where maybe a train couldn't drive through, but a little vehicle could pass through without difficulty.  When watching the first time and the last, I didn't get the finale without it being fed to me as it was in the end.  I watched to see if there were subliminal messages but found none, so that's a definite asset to the film, or was it?  I do like to see hints before I'm hit over the head with a payoff, but this story isn't so generous.<br /><br />In retrospect, this isn't Hitchcock, but I was frightened and did develop an interest in the characters, so I would recommend watching it from the comfort of your own home.  I think it made more sense to me in DVD format because I was able to go back and review sections to see if I'd missed something.  Oh, yes, the true love drive made for a breath of fresh air in these times.\nWorth watching this suspenseful film\nInnocent Voices [DVD]\nDaniel Jiménez Cacho  (Actor),     Ofelia Medina  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Based on the true story of screenwriter Oscar Torres\\'s embattled childhood in 1980\\'s El Salvador, Innocent Voices is the poignant tale of Chava, an eleven-year-old boy. Chava suddenly becomes the \"man of the house\" in a time when the government\\'s army is forcibly recruiting twelve year olds to battle against the peasant rebels of the FMLN. It is a story of life, love, the hope of peace, and the ennobling power of the human spirit.', 'Review', \"Innocent Voices is a raw, powerful portrait of childhood spent in a war zone. The images are harrowing... And the emotion feelsreal. Padilla's earnest, natural presence lends an almost documentary-style realism to Chava's plight. --Associated PressIt is at once intimate and epic. --Hollywood ReporterWe applaud the director, Luis Mandoki, for shining a light on the plight of children during wartime. --UNICEF Executive Director Ann M. Veneman\"]\n{'Genre': 'Drama, Romance', 'Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Contributor': 'Ofelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adrian Alonso, Héctor Jimenez, Ana Paulina Cáceres, Gustavo Munoz, Xuna Primus, Luis Mandoki, Victor (Kino) Gonzalez, Alejandro Felipe FloresOfelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adri…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.4 inches; 3.2 Ounces', 'Director': 'Luis Mandoki', 'Media Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'April 8, 2008', 'Actors': 'Daniel Jiménez Cacho, Ofelia Medina, Guillermo Rios, Victor (Kino) Gonzalez, Jésus Ochoa', 'Subtitles': 'English', 'Studio': 'Polychrome', 'Number of discs': '1'}\nI live in an area of the US with many immigrants from El Salvador.  I have a childhood friend who disappeared in El Salvador in the 1970's.  I know virtually nothing about the history of the country or the people, but through INNOCENT VOICES, I have learned much.  I recognized many faces, not because I know the actors, but because I see from their faces the people who experienced the civil war of their time in their country.  I feel naive about my limited historical knowledge, but I can address the filmmaking, which I think is superb.  I often say that children are magic on-screen and they are so unpredictable and pliable with a good director.  The children in this film (as well as the adults) are worth studying by young actors because they appear to lose themselves in their characters.  The language spoken of course is Spanish with English subtitles that were very well done.  The lush wooded locale was captured beautifully and the devastation caused by the armies was done by a first rate special effects team.  The wardrobe was outstanding and set design very realistic.  Mid-way through the film, I felt the pacing slow down a bit, but the film still held my interest throughout.  The characters were very well done and full bodied, so many creating a strong impression.  I consider this an historical film which brought to light a time which changed many lives and the landscape, so I now see survivors of the time from my more enlightened eyes.  For a well made film that will motivate you to think about war, love, family, resistance and survival, try INNOCENT VOICES.\nInnocent Voices Speak So Loudly\nRachel Getting Married\nAnne Hathaway  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"When Kym (Anne Hathaway - Golden Globe Nominee, Best Actress, Motion Picture (Drama)), returns to the Buchman family home for the wedding of her sister Rachel (Rosemarie DeWitt), she brings a long history of personal crises, family conflict and tragedy along with her. The wedding couple's abundant party of friends and relations have gathered for a joyful weekend of feasting, music and love, but Kym - with her biting one-liners and flair for bombshell drama - is a catalyst for long-simmering tensions in the family dynamic. Filled with the rich and eclectic characters that remain a hallmark of Jonathan Demme's films, RACHEL GETTING MARRIED paints a heartfelt, perceptive and sometimes hilarious family portrait.\", 'Amazon.com', \"Pitched between Robert Altman's\", 'A Wedding', \"and Noah Baumbach's\", 'Margot at the Wedding', '--but more cautiously optimistic than both--', 'Rachel Getting Married', 'marks a change in course for director Jonathan Demme. Granted, few Oscar winners have walked a more diverse path. After a series of documentaries and remakes, the', 'Silence of the Lambs', \"helmer tries his hand at the intimate chamber drama. With the help of actress Anne Hathaway and screenwriter Jenny Lumet, daughter of filmmaker Sidney, he pulls it off. The festivities kick into high gear once Kym (Hathaway, with smeared eyeliner and unkempt hair) takes a break from rehab for her sister's big day. It soon transpires that Kym, who hides her wounded soul behind a veil of sarcasm, serves as the Buchman's resident black sheep. The problem goes deeper than drugs to a tragedy in which she played a part. As Kym, bride Rachel (\", 'Mad Men', \"'s Rosemary DeWitt), their parents (Bill Irwin and Debra Winger), groom Sidney (TV on the Radio's Tunde Adebimpe), and the rest of the bohemian Connecticut brood struggle with the past, the nuptials continue, graced by performances from past Demme collaborators like Sister Carol East (\", 'Something Wild', ') and Robyn Hitchcock (', 'Storefront Hitchcock', '). The hours between reception and after-party contain humor, affection, and painful revelations. In the press notes, Demme claims that he and cinematographer Declan Quinn (', 'In America', ') attempted to make a film that looked like \"The most beautiful home movie ever made.\" Using handheld cameras and believably flawed characters, they\\'ve done just that.', '--Kathleen C. Fennessy', 'Stills from', 'Rachel Getting Married', '(Click for larger image)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Anne Hathaway', 'Language': 'Unqualified', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '5068392', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 10, 2009', 'Actors': 'Anne Hathaway', 'Dubbed': 'French', 'Subtitles': 'French', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\nAfter my sister saw RACHEL GETTING MARRIED in the theater, she called me to say she had seen the best film of the year.  I never saw the film, so I watched the DVD and tried to see what my sister loved so much.  Anne Hathaway gave a stellar performance and I see why she was nominated for various awards, but I saw nothing else in the film to make me consider it with such high regard as did my sister.  For me, the story dragged and needed tighter editing.  I wasn't too fond of the camera work, but that's my humble opinion.  When the DVD finished playing, I tried watching the special features, but after a few minutes, I ejected the DVD and went on about my business.<br /><br />I'm a fan of films which concentrate on dysfunctional families.  Perhaps it makes my own family seem more normal or perhaps they give me more ammunition for taking our interactions to a new level of absurdity.  What this film lacked for me was that ammunition because there was nothing extraordinary.  In the film, we have one sister who needs to be the center of the world, or does the world simply see her as the center and everyone follows that plan?  We have a mother who is aloof, or is she simply surviving as she knows how, removed from the daily existence of those she left behind?  We have a father who only knows the path of least resistance, or is he simply being passive aggressive in order to forge ahead and keep afloat?  We have a multicultural, multiracial, multireligious gathering for a celebration that brings with it baggage of a hundred years and lives.  For Hathaway's portrayal of a young woman who is broken and unable to fix herself without bits chipping away with every move, I recommend this DVD.  That's about it for me.\nHathaway's performance is reason to watch",
  "profile": "**Updated User Profile Summary:**\n\n- **Movie Preferences:** The user continues to show a strong preference for films centered on complex family dynamics and emotional struggles, especially within the drama genre. Their recent viewing of a film featuring a dysfunctional family suggests a deep interest in narratives that explore interpersonal conflicts and personal crises, further emphasizing their enjoyment of character-driven stories.\n\n- **Critical Engagement:** The user maintains a discerning viewpoint, appreciating strong performances while expressing thoughtful critiques regarding narrative pacing and editing. Their latest review highlights the importance of impactful storytelling, indicating a nuanced perspective on cinematic execution that balances heartfelt situations with the need for tighter narratives.\n\n- **Entertainment Experience:** Immersive storytelling remains a core attraction, particularly narratives that delve into the psychological intricacies of family relationships. The user values films that provoke reflection on human experiences, resonating with themes of conflict, survival, and emotional complexity.\n\n- **Rating Behavior:** The user rates films with a keen eye for thematic substance and performance quality. Their latest review, while recognizing a standout performance, reveals their appreciation for meaningful storytelling and an expectation for narrative engagement, showcasing a sophisticated viewing disposition.\n\nOverall, the user's evolving preferences reflect a commitment to meaningful cinematic experiences that illuminate the complexities of familial relationships, fostering thoughtful engagement with diverse narratives.",
  "metrics": {
    "rouge1_f": 0.03834808259587021,
    "rouge2_f": 0.006169527896995708,
    "rougeL_f": 0.02064896755162242,
    "meteor": 0.01130865724250153,
    "bleu1": 3.874937959106241e-16,
    "bleu2": 1.6369562400443104e-16,
    "bleu3": 5.3718674481303135e-17,
    "bleu4": 1.4565718500914484e-17,
    "bertscore_precision": 0.3438316881656647,
    "bertscore_recall": 0.544678270816803,
    "bertscore_f1": 0.4215543866157532
  }
}