{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Facial Cleansing Brush [Newest 2021], Waterproof face scrubber with 8 Brush Heads for Deep Cleansing, Gentle Exfoliating, Removing Blackhead, Massaging ，skin care\nReview Date: 2021/09/09\nStore: M/B\nProduct Description: ['Welcome to Yima store, wish you have a pleasant shopping experience!', 'Our Face Brush Set is designed to give your skin the treatment it needs to look and feel its best, our spin brush kit is the BEST way to clean your skin, removing makeup, and other toxins.', '8 Rotating Brush Heads:', '4 x Soft Brush Head for gentle, daily cleansing. 1 x Sponge Brush Head for cleaning skin and absorbs grease 1x Pumice Head for removing calluses 1x Massage Wheel Head for face massaging', 'Why can you choice 8 in 1 Facial Cleansing Brush Set?', '➢Two speeds High and low, for a tailored spa-like experience for your skin. ➢8 different replacement heads for different types of cleansing, from a gentle wash to deep-cleansing and exfoliation, plus a pumice head for removing calluses. ➢ makes travel and storage simple ➢ Waterproof makes it totally safe to use in the shower or tub. ➢ The face exfoliating brush set works for everyone - men, women, acne-prone skin, sensitive skin, dry skin', 'What You Get', '1x Facial Cleansing Device 4 x Soft Brush Head 1 x Sponge Brush Head 1 x Pumice Head 1 x Massage Head', 'NOTE: Powered by 2 AA batteries (not included).', '100% Satisfaction Service:', 'If you have any questions, please feel free to contact us firstly, We provide 24-hours online customer services with our friendly support team.']\nAverage Rating: 3.9\nProduct Details: {'Package Dimensions': '8.19 x 4.49 x 2.05 inches; 5.93 Ounces'}\nReview Text: I ended up having to order another one my spouse took mine. It’s an excellent way to wash and cleanse your face. Brushes are of different degrees of softness. Great for deep cleaning my nose. Recommended for sensitive skin. Gentle scrub but very effective cleaning. Quality brushes and easy to hold and use. Seems very durable. I’ve used my salt scrub followed by my facial soap and my face is shiny.\nReview Title: Facial soft cleaning brush\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "MOULOSY Eyeshadow Palette, 26 Colors Professional Matte Shimmer Makeup Palette, Highly Pigmented Colorful Powder, Easy to Blend Waterproof and Sweatproof\nMOULOSY\n{'Brand': 'MOULOSY', 'Item Form': 'Powder', 'Finish Type': 'Metallic,Glitter,Shimmers,Matte,Shimmer,Satin,Natural', 'Special Feature': 'Waterproof', 'Product Benefits': 'Smoothening', 'Product Dimensions': '7.8 x 5.9 x 0.5 inches; 9.81 Ounces', 'UPC': '749965963288'}\nEyeshadow this is a very nice set of eyeshadow it got some beautiful colors in it I got it as a gift for my wife for her birthday and she loves it she can put it in her purse because it’s the perfect size\nEyeshadow palette\nJSY 30PCS Spiral Hair Ties No Crease For Women Girls,Coil Hair Ties, hair ties for women, Phone Cord Hair Ties Waterproof, Hair Coils\nJSY\n{'Material': 'Plastic', 'Item Form': 'Spiral', 'Brand': 'JSY', 'Hair Type': 'Curly', 'Number of Pieces': '30', 'Package Dimensions': '5.35 x 4.45 x 1.57 inches; 2.4 Ounces'}\nSpiral hair ties very stretchy and durable great for putting ur hair up in a pony tail my daughter love them there will worth the money\nSpiral hair ties\nJSY Continuous Spray Bottle, Premium Hair Spray Bottles，Ultra Fine, Aerosol, Solvent & BPA Free Plastic, With Pump, Pressurized Mist Spray Bottles, For Cleaning，3 Pack 5.4oz/160ml(2While+1Black)\nJSY\n{'Brand': 'JSY', 'Material': 'Plastic', 'Capacity': '5.4 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray, Continuous Spray'}\nSpray bottles I use these at the beach to keep me cool there very heavy duty and are not the cheap bottles very easy to spray you can use them for multiple different things\nSpray bottles\nAnti-aging Face Jade Roller and Gua Sha Tool Set - Anti Wrinkle And Skin Rejuvenate - Premium Natural smooth Jade Stone\nHIZLY\n{'Package Dimensions': '6.54 x 2.76 x 1.54 inches; 5.61 Ounces', 'Item model number': 'FBM-JADE-0225', 'UPC': '712673003546'}\nJade roller this is great for keeping your face from getting wrinkles it also helps remove wrinkles it is well worth the money but also make a great gift I actually love the J roller I use it all the time it’s a great face massager highly recommend it\nJade roller\nGegado Headbands with Buttons for Mask, Nurse Gifts for Women, Nurse Accessories for Work, Nurse headbands Non-Slip Stretchy Moisture Wicking Sweatband Sports Headbands 6pcs\nGegado\n{'Age Range (Description)': 'Adult', 'Material': 'Spandex', 'Fabric Type': 'Spandex', 'Number of Items': '1', 'Brand': 'Gegado', 'Package Dimensions': '6.93 x 5.51 x 1.69 inches; 4.97 Ounces', 'UPC': '787823050800'}\nExcellent selection of headbands. Quality material used. Even has a button on each side you can hook your mask on instead of around your ears. Comfortable to wear. Material is elastic. Great for working out or putting your hair back on those lazy days. Great buy\nAwesome headbands , stretching and buttons for mask\nQTH Hydrocolloid Acne Pimple Patch 15 Count Absorbing Acne Spot Treatment for Face, Pimple Zit, Blemish Patches for Face, Certified Vegan,Cruelty-Free…\nQTH\n{'Brand': 'QTH', 'Item Form': 'Stick', 'Skin Type': 'Acne Prone', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '15.00 Count', 'Package Dimensions': '6.61 x 4.25 x 0.28 inches; 0.32 Ounces'}\nAnce pimple patch this is a great way to keep your ance off your face I have been using it to keep pimple off my face there work great\nAnce pimple patch\n8 Colors Liquid Glitter Eyeshadow Set, Glitter Shimmer Colorful Eye look Long Lasting High Pigmented Eye Shadow Makeup Kits\nCaliGlam\n{'Brand': 'CaliGlam', 'Item Form': 'Liquid', 'Finish Type': 'Shimmery', 'Special Feature': 'Long last', 'Product Benefits': 'Long Lasting', 'Package Dimensions': '6.1 x 2.99 x 0.87 inches; 5.93 Ounces', 'UPC': '765495987457'}\nLiquid glitter eyeshadow very easy to put on and take off it will make you eyes pop there are 8 different colors my daughter love the glitter eyeshadow so this was a great birthday gift for her\nLiquid eyeshadow\nFacial Cleansing Brush [Newest 2021], Waterproof face scrubber with 8 Brush Heads for Deep Cleansing, Gentle Exfoliating, Removing Blackhead, Massaging ，skin care\nM/B\n['Welcome to Yima store, wish you have a pleasant shopping experience!', 'Our Face Brush Set is designed to give your skin the treatment it needs to look and feel its best, our spin brush kit is the BEST way to clean your skin, removing makeup, and other toxins.', '8 Rotating Brush Heads:', '4 x Soft Brush Head for gentle, daily cleansing. 1 x Sponge Brush Head for cleaning skin and absorbs grease 1x Pumice Head for removing calluses 1x Massage Wheel Head for face massaging', 'Why can you choice 8 in 1 Facial Cleansing Brush Set?', '➢Two speeds High and low, for a tailored spa-like experience for your skin. ➢8 different replacement heads for different types of cleansing, from a gentle wash to deep-cleansing and exfoliation, plus a pumice head for removing calluses. ➢ makes travel and storage simple ➢ Waterproof makes it totally safe to use in the shower or tub. ➢ The face exfoliating brush set works for everyone - men, women, acne-prone skin, sensitive skin, dry skin', 'What You Get', '1x Facial Cleansing Device 4 x Soft Brush Head 1 x Sponge Brush Head 1 x Pumice Head 1 x Massage Head', 'NOTE: Powered by 2 AA batteries (not included).', '100% Satisfaction Service:', 'If you have any questions, please feel free to contact us firstly, We provide 24-hours online customer services with our friendly support team.']\n{'Package Dimensions': '8.19 x 4.49 x 2.05 inches; 5.93 Ounces'}\nI ended up having to order another one my spouse took mine. It’s an excellent way to wash and cleanse your face. Brushes are of different degrees of softness. Great for deep cleaning my nose. Recommended for sensitive skin. Gentle scrub but very effective cleaning. Quality brushes and easy to hold and use. Seems very durable. I’ve used my salt scrub followed by my facial soap and my face is shiny.\nFacial soft cleaning brush",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** The user maintains a strong focus on cosmetics, particularly diverse eyeshadow palettes, and continues exploring skincare tools and practical hair accessories. Their proactive skincare approach is evident with the addition of cleansing tools, continuing their interest in acne treatments and long-lasting eye makeup.\n\n- **Preference for Quality:** A commitment to high-quality, effective cosmetics and durable skincare tools persists, prioritizing performance across all categories. \n\n- **Special Features:** The user demonstrates a clear preference for waterproof and sweatproof products, reflecting their need for longevity. Recent purchases highlight their enthusiasm for multifunctional items that offer versatile skincare solutions.\n\n- **Gift-Giving:** Their thoughtful shopping habits are emphasized through a focus on practical gifts that cater to specific needs, enhancing the gifting experience.\n\n- **Packaging Size:** Consistency remains in their preference for compact and functional packaging, enhancing convenience across cosmetics, skincare, and accessories.\n\n- **Positive Experience:** The user actively shares their positive experiences by leaving glowing reviews and endorsing products that align with their high standards.\n\n- **Skincare Tools:** The introduction of a facial cleansing brush signifies an interest in comprehensive skincare routines and the effectiveness of tools that enhance cleansing and exfoliation.\n\nOverall, the user exemplifies a preference for versatile, high-quality items that effectively meet their cosmetic and skincare needs, while maintaining a practical and thoughtful shopping approach.",
  "metrics": {
    "rouge1_f": 0.1558654634946678,
    "rouge2_f": 0.018077239112571898,
    "rougeL_f": 0.07383100902378999,
    "meteor": 0.05471956224350205,
    "bleu1": 0.010353111377268166,
    "bleu2": 0.0021394537734049763,
    "bleu3": 0.0003702877626024034,
    "bleu4": 0.0001541854110220314,
    "bertscore_precision": 0.3773667812347412,
    "bertscore_recall": 0.47723376750946045,
    "bertscore_f1": 0.421465128660202
  }
}