{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: JSY Continuous Spray Bottle, Premium Hair Spray Bottles，Ultra Fine, Aerosol, Solvent & BPA Free Plastic, With Pump, Pressurized Mist Spray Bottles, For Cleaning，3 Pack 5.4oz/160ml(2While+1Black)\nReview Date: 2021/05/19\nStore: JSY\nAverage Rating: 3.7\nProduct Details: {'Brand': 'JSY', 'Material': 'Plastic', 'Capacity': '5.4 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray, Continuous Spray'}\nReview Text: Spray bottles I use these at the beach to keep me cool there very heavy duty and are not the cheap bottles very easy to spray you can use them for multiple different things\nReview Title: Spray bottles\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "MOULOSY Eyeshadow Palette, 26 Colors Professional Matte Shimmer Makeup Palette, Highly Pigmented Colorful Powder, Easy to Blend Waterproof and Sweatproof\nMOULOSY\n{'Brand': 'MOULOSY', 'Item Form': 'Powder', 'Finish Type': 'Metallic,Glitter,Shimmers,Matte,Shimmer,Satin,Natural', 'Special Feature': 'Waterproof', 'Product Benefits': 'Smoothening', 'Product Dimensions': '7.8 x 5.9 x 0.5 inches; 9.81 Ounces', 'UPC': '749965963288'}\nEyeshadow this is a very nice set of eyeshadow it got some beautiful colors in it I got it as a gift for my wife for her birthday and she loves it she can put it in her purse because it’s the perfect size\nEyeshadow palette\nJSY 30PCS Spiral Hair Ties No Crease For Women Girls,Coil Hair Ties, hair ties for women, Phone Cord Hair Ties Waterproof, Hair Coils\nJSY\n{'Material': 'Plastic', 'Item Form': 'Spiral', 'Brand': 'JSY', 'Hair Type': 'Curly', 'Number of Pieces': '30', 'Package Dimensions': '5.35 x 4.45 x 1.57 inches; 2.4 Ounces'}\nSpiral hair ties very stretchy and durable great for putting ur hair up in a pony tail my daughter love them there will worth the money\nSpiral hair ties\nJSY Continuous Spray Bottle, Premium Hair Spray Bottles，Ultra Fine, Aerosol, Solvent & BPA Free Plastic, With Pump, Pressurized Mist Spray Bottles, For Cleaning，3 Pack 5.4oz/160ml(2While+1Black)\nJSY\n{'Brand': 'JSY', 'Material': 'Plastic', 'Capacity': '5.4 Ounces', 'Number of Items': '3', 'Special Feature': 'Mist Spray, Continuous Spray'}\nSpray bottles I use these at the beach to keep me cool there very heavy duty and are not the cheap bottles very easy to spray you can use them for multiple different things\nSpray bottles",
  "profile": "**User Profile Summary:**\n\n- **Product Interest:** The user continues to focus on cosmetics, with a keen interest in eyeshadow palettes featuring diverse colors and finishes. They've broadened their interest to include practical hair accessories like durable hair ties, and now, functional spray bottles for various uses.\n- **Preference for Quality:** The user values highly pigmented and easy-to-blend makeup, indicating a strong emphasis on performance. Their recent purchase of spray bottles showcases an appreciation for heavy-duty, well-made items, reinforcing their focus on quality across all products.\n- **Special Features:** They favor waterproof and sweatproof cosmetics, along with durable and versatile hair accessories and spray bottles, reflecting a consistent desire for long-lasting utility in their purchases.\n- **Gift-Giving:** The user engages in thoughtful shopping behaviors, shown by past purchases for family and partners. This recent purchase also aligns with their inclination to choose practical items for family needs.\n- **Packaging Size:** They appreciate compact and practical packaging in cosmetics and hair accessories, now extending this preference to spray bottles, emphasizing functionality and convenience.\n- **Positive Experience:** The user is likely to review products favorably when satisfied, as demonstrated by their recent praise for spray bottles, highlighting their willingness to provide positive feedback on quality items within broader categories.\n\nOverall, the user demonstrates a consistent preference for versatile, high-quality products that combine aesthetic appeal with practical attributes across cosmetics and functional accessories.",
  "metrics": {
    "rouge1_f": 0.28286852589641437,
    "rouge2_f": 0.064,
    "rougeL_f": 0.1195219123505976,
    "meteor": 0.13733161470016703,
    "bleu1": 0.1533387861096186,
    "bleu2": 0.0287726371215288,
    "bleu3": 0.006075481052188424,
    "bleu4": 0.0027942085657265353,
    "bertscore_precision": 0.3917869031429291,
    "bertscore_recall": 0.4119800627231598,
    "bertscore_f1": 0.40162983536720276
  }
}