{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: BeautyBio GloPRO Attachment Heads\nReview Date: 2018/09/07\nAverage Rating: 4.6\nProduct Details: {'Product Dimensions': '4 x 2.1 x 4 inches; 4.16 Ounces', 'Item model number': '78355R.V1', 'UPC': '810813030398', 'Manufacturer': 'Beauty Bioscience', 'Country of Origin': 'China'}\nReview Text: This is an impressive item.  Goes with the GloPRO package that has several attachments.  This is one of the attachments.<br />I don't have the GloPRO system yet but may soon purchase one.  In the meantime I used this manually to get a feel of what it would be like.<br />This is a great product.  It is nicely packaged.  It makes your skin glowing with health....truly it does.<br />My dermatologist is a big fan of this product.\nReview Title: I am very impressed\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "6 Pack Wig Caps, Neutral Nude Beige and Black, Nylon and Mesh\nBTOOP\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Brand': 'BTOOP', 'Age Range (Description)': 'Adult', 'Package Dimensions': '5.98 x 4.02 x 2.01 inches; 1.59 Ounces', 'UPC': '711420853809'}\nThese are so helpful to wear underneath my wig.  It keeps all my natural hair flat and tucked under the cap so that I don't get those little strays that poke out the sides or out the bottom.<br />These are just a great solution for that issue and these are the best I have ever used.<br />Great price and well made.  What more could you ask?\nIt will take you a long time to wear these out and I don't ever want to be without them.  Highly recommended\nBeautyBio GloPRO Attachment Heads\n{'Product Dimensions': '4 x 2.1 x 4 inches; 4.16 Ounces', 'Item model number': '78355R.V1', 'UPC': '810813030398', 'Manufacturer': 'Beauty Bioscience', 'Country of Origin': 'China'}\nThis is an impressive item.  Goes with the GloPRO package that has several attachments.  This is one of the attachments.<br />I don't have the GloPRO system yet but may soon purchase one.  In the meantime I used this manually to get a feel of what it would be like.<br />This is a great product.  It is nicely packaged.  It makes your skin glowing with health....truly it does.<br />My dermatologist is a big fan of this product.\nI am very impressed",
  "profile": "**User Summary:**\n\n- **Preferred Product Types**: Continues to favor wig accessories, specifically wig caps, while showing interest in beauty tools that enhance skin health.\n- **Material Preference**: Favors synthetic materials for wig accessories, emphasizing functionality and comfort.\n- **Quality and Durability**: Strongly values well-made products that offer longevity and has shown appreciation for effective skincare tools with high ratings.\n- **Functionality**: Prioritizes solutions that enhance personal grooming, both for wig wear and skin health, indicating a holistic approach to beauty and grooming.\n- **Price Sensitivity**: Appreciates competitive pricing on products without compromising quality, indicating a savvy consumer mindset.\n- **User Experience**: Seeks practical products that address specific issues related to both wig wear and skincare, as evidenced by hands-on testing of various attachments.\n- **Overall Satisfaction**: Exhibits a high likelihood of recommending products, particularly those that exceed expectations in both beauty and grooming, and values expert endorsements.\n\nThe user demonstrates a consistent trend toward finding practical, durable, and cost-effective solutions while exploring new avenues for enhancing both hair care and skincare.",
  "metrics": {
    "rouge1_f": 0.2318840579710145,
    "rouge2_f": 0.00970873786407767,
    "rougeL_f": 0.10628019323671498,
    "meteor": 0.1189710610932476,
    "bleu1": 0.17051352733409283,
    "bleu2": 0.022438355197872004,
    "bleu3": 0.005305202395606866,
    "bleu4": 0.0025824663645915235,
    "bertscore_precision": 0.3818104863166809,
    "bertscore_recall": 0.44225695729255676,
    "bertscore_f1": 0.40981680154800415
  }
}