{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Badgley Mischka 1.7floz/50mL Body Wash Toiletries for Bathroom, Guests, Hotels, Motels, and Lodging (30 pack)\nReview Date: 2021/09/08\nStore: HOTEL EMPORIUM, INC.\nAverage Rating: 4.5\nProduct Details: {'Skin Type': 'All', 'Brand': 'HOTEL EMPORIUM, INC.', 'Scent': 'Citrus, Tea Tree, Ginger', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Count', 'Package Dimensions': '9.8 x 6.3 x 4.09 inches; 4.27 Pounds', 'UPC': '810053620212'}\nReview Text: What you get is exactly what you should expect, which is a large (30) number of little bottles that you can take with you if you don't use them while a guest. Which is a good thing, given that the current trend seems to be large dispensers, things that it would be difficult to take because they are large and taking them would be considered 'theft'.  Not to mention that said dispensers are not as sanitary as little 'use once, then throw away' bottles.<br />So, good marks for hygiene and also for a decent body wash.\nReview Title: Good marks for hygiene\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Philips Sonicare HX3351/02 Xtreme Battery Operated Toothbrush\nPHILIPS\n['Product Description', \"Improved Oral ExperiencePhilips Sonicare Xtreme Battery Toothbrush gives better plaque removal than traditional brushes. This toothbrush with advanced technology has a dynamic cleaning action that drives fluid between teeth, it helps clean difficult places in mouth too. It's also proven to be gentle on braces and brackets.Drives fluid between teethBetter plaque removalComes with smart timerThis toothbrush helps orthodontic patients with effective cleaning around bands, brackets and wires. It's also gentle on dental restorations such as veneers, crowns and fillings.Just For You: The entire familyA Closer Look: Philips Sonicare Xtreme Battery Toothbrush has an angled head and fluid driving technology that helps cleaning along the gum line. Moreover, its two-minute timer helps give your teeth the recommended brushing time.Get Started: Charge the brush and use after every meal or at least twice daily for better results.\", 'From the Manufacturer', 'The', 'Philips Sonicare Xtreme Battery-Operated Toothbrush', 'improves oral health with a special emphasis on portability. Safe, comfortable, and effective, the Xtreme encourages healthy oral hygiene habits for life.', 'The Extreme e3000 is extremely portable.', 'Patented Technology and Dynamic Fluid Action', \"The Xtreme creates a dynamic fluid cleaning action that drives fluids deep into the tight spaces between your teeth. In fact, the patented sonic technology behind the Xtreme's cleaning action can actually make it easier to clean plaque along the gum line, which results in a cleaner, healthier mouth. A combination of high frequency and high amplitude bristle motions remove more plaque than a manual toothbrush. These bristles are also designed to be extra gentle on teeth and gums.\", 'Safely and Effectively Improves Oral Health', \"Sonicare's dynamic cleaning action results in better plaque removal, improved gum health, and naturally whiter teeth. The uniquely angled brush head neck makes it easier to reach back teeth, removing plaque in those hard-to-reach areas. Easy and comfortable to use, thanks to the contoured brush head, the Xtreme also features a Smartimer that automatically shuts off after the two-minute dentist recommended brushing time.\", \"What's in the Box\", 'One Philips Sonicare Xtreme Battery-Operated Toothbrush and two AA batteries.', 'HX3351/02 Xtreme Battery-Operated Toothbrush At a Glance:', 'Two-minute Smartimer ensures dentist-recommended brushing time', 'Two-minute Smartimer ensures dentist-recommended brushing time', 'Safe for use with braces', 'Safe for use with braces', 'Includes two AA batteries', 'Includes two AA batteries', 'Philips Sonicare Toothbrushes For Kids Essential Clean Whiter, Healthier Teeth Advanced Cleaning Gum Care Ultimate Cleaning Air Floss Sonicare for Kids Xtreme e3000Essence5600 EasyClean Healthy White 710 Healthy White R732 FlexCareR910 FlexCareRS930 FlexCare Plus Diamond Clean Air Floss Model # HX6311/02 HX3351/02 HX5610/01 HX6511/50 HX6711/02 HX6732/02 HX6911/02 HX6932/10 HX6972/10 HX9332/05 HX8111/02 Rechargeable An easier wayto floss • Battery• • • • • • • • Quadpacer For best results use your Philips Sonicare rechargeable toothbrush with Air Floss • • • • • • • • Brushing Modes Ages 4 - 7 CleanClean Clean Clean Clean Clean Clean Clean Clean Ages 7 - 10 Clean and White Clean and White White Sensitive Sensitive Sensitive Sensitive Sensitive Massage Massage Massage Go Care/Max Care Go Care/Max Care Refresh Polish Gum Care Gum Care Air & Microdroplet Technology Handles 1 11 1 1 1 1 1 1 1 Clean between all teeth in only 60 seconds with one teaspoon of water or mouthwash Included Brush Heads 2 11 1 1 2 1 2 2 2 UV Brush Head Sanitizer • • Travel Charger • • • • • Deluxe travel case with USB Charger Illuminated Display • •']\n{'Brand': 'PHILIPS', 'Age Range (Description)': 'Kid', 'Special Feature': 'Brushing Timer', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Extra Soft', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 10 inches; 8 Ounces', 'Item model number': 'HX3351', 'Department': 'General Health and Beauty', 'UPC': '075020803337 885582058195 877775811328', 'Manufacturer': 'Philips Sonicare'}\nThe lifespan of this device seems to be quite limited. A couple of years ago, I bought 2 of these for my 2 boys. One of them stopped working after a couple of weeks - was able to return it to Amazon and get a replacement - and the other stopped after a little over one month. The replacement stopped working after about one month as well.<br /><br />The big problem with this toothbrush is the battery compartment. Since it's using 'throw away' batteries, a bad thing by itself, there is a need for a lid to allow removal/insertion of batteries. At this price, the lid does not close tightly and water creeps in. Eventually, the entire thing stops working.<br /><br />Pros for this toothbrush:<br />- low price.<br /><br />Cons:<br />- short life due to almost inevitable water damage<br />- use of 'throw away' batteries<br /><br />My recommendation: avoid.<br /><br />Spend a few more and get a true Sonicare. You won't regret it. I've been using Sonicare tooth brushes for almost 10 years now. My first one was replaced after more than 5 years, mostly because I wanted a new one. My current is alive and kicking and it's likely to last for many more years if I don't choose to replace it.\nAvoid. Buy a 'true' Sonicare\nPhilips Norelco QC5055 Power Hair Clipper\nPHILIPS\n['Product Description', \"Philips Norelco's Power Hair Clipper cuts normal, coarse and curly hair. The turbo power option can be turned on when hair is more difficult to get through. This easy-to-use hair clipper brings simplicity to you life, giving you all the options without all the pieces. Three hair clipper combs provide 15 length options (up to 1-3/5 inch long), while the no slip grip ensures that the Philips Norelco Power Hair Clipper cuts exactly where it should--with or without a cord. Attachments can be rinsed clean with some running water and blades are self-sharpening, needing only minimal maintenance.\", 'Amazon.com', \"100% turbo power. Cuts all hair types. The Philips Power Clipper gives you the power of a corded clipper with all the benefits of a rechargable one. Thanks to its powerful motor and battery, it is suited to cut all hair types with ease--even coarse, curly and thick hair. The clipper can be used both cordless -for up to 35 minutes of running time- and corded. It comes with a special comb for that almost bald look. As with all Philips hair clippers, there aren't extra pieces to juggle: this clipper has simply two integrated guide combs that adjust to cover all hair lengths up to 1 3/5in. Once a length is selected, the guide comb is locked to ensure a clean and even haircut. Cleaning is easy, fast and hygienic as this clipper's cutting unit can be rinsed under the tap.\", 'Technology Explained', 'Best performance that feels great', 'Safely cleans under the tap', 'Quick and easy thanks to the unique bayonet fixture.', 'SteelWave self-sharpening blades for precise results', 'Revolutionary wave-shaped, self-sharpening blades channel and cut hair for a precise and even result.', 'Create the look you want', '14 integrated length settings up to 41mm', 'Select and locks your desired length within a versatile range of possible lengths.', 'Short length comb to cut your hair to 1.6mm', 'A dedicated comb to cut your head hair for an extra short hair style.', 'Brings maximum ease of use', 'Ultra silent to keep children calm', 'Provides optimal power', 'Extra powerful battery for easily cutting all hair types', 'Perfectly balanced for optimal control and handling', 'Specifications', 'Guarantee', '2-year worldwide guarantee Yes', 'Power system', 'Charging time 10 hour(s) Operating time 35 minute(s) Rechargeable - Cord/Cordless Corded or cordless operation', 'Accessories', 'Cleaning brush Yes Charger Yes', 'Cutting system', 'Steelwave technology Yes Cutter width 41 mm Lubrication for life Yes', 'Design', 'Extra powerful design Yes']\n{'Recommended Uses For Product': 'Clipping', 'Color': 'Black', 'Hair Type': 'All', 'Brand': 'PHILIPS', 'Power Source': 'Corded Electric', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '3.34 x 6.57 x 9.64 inches; 1.2 Pounds', 'Item model number': 'QC5055', 'UPC': '075020007575', 'Manufacturer': 'Philips Norelco'}\nFor more than one reason, I haven't seen the insides of a hair-cuttery in more than a decade. Flowbee was my trusted hair-management solution for all these years until I had the opportunity to try Norelco's 'Power Hair Clipper', model QC5055.<br /><br />I am unlikely to ever return to Flowbee now because the QC5055 does the job much faster, it's less noisy and delivers a much better quality haircut.<br /><br />Operation:<br /><br />Once charged, all you need to do is attach the proper comb (see below), select the desired hair length and proceed with cutting.<br /><br />Hair-cutting tends to be a borderline traumatic experience for me - I'm a long hair type person - but this was a near-painless experience. I am looking forward to more future haircuts. It goes fast, smooth and easy. From time to time, you may have to clean the comb and/or the clipping attachment but that can be done quickly and easily. My wife gave me a near-professional-quality haircut in about 10-15 minutes and finished me with sufficient momentum to place our 12 yr. son under the cutter and 'even him out' as well.<br /><br />What you get:<br /><br />- The hair clipper body hosting the rechargeable batteries.<br />- The clipping attachment<br />- Stainless steel, self-sharpening cutting blades<br />- Large comb<br />- Small comb<br />- Stubble comb<br />- Charger<br />- Cleaning brush<br />- English/Spanish instructions<br />- Registration card with $20 coupon offer<br /><br />Some specs:<br /><br />- Battery life is rated at about 35 minutes.<br />- Charge time is 10 hours.<br />- Cuts hair from .12 in./3 mm to 1.61 in./41 mm.<br />- 15 length settings between the 3 combs (seven on each of the large and small combs plus the stubble comb)<br /><br />Returns and warranties:<br /><br />There's a 45-day money back guarantee promise if the customer can provide proof of purchase and ships the item, insured, to Norelco at own expense.<br /><br />The 2-year warranty promises to replace defective products for as long as the customer didn't do anything 'unreasonable' and he/she paid for shipping the item to Norelco, preferably insured. Proof of purchase, of course, is a must.<br /><br />What I liked:<br /><br />Other than the surprising ease of use and operation and the quality of the haircut, I liked the easy cleaning and maintenance and the fact that, if needed, it can operate in a 'corded' mode. The comfortable, rubberized grip makes hair cutting, even self-cutting easy and efficient.<br /><br />The brief manual is written in good English and is very good at illustrating cleaning and assembly and has very good advice on maintenance, preserving battery life and even some haircutting tips.<br /><br />Issues:<br /><br />My big problem and the only one so far is the lack of some case or storage box. With so many parts of which some are small and/or fragile, not providing some way to store them, protect them and keeping them organized is inexcusable.<br /><br />Rating:<br /><br />This would have been an easy 5-star if it came with a case. Since it doesn't, it gets 4.<br /><br />I still recommend the QC5055 most highly but be prepared to supply your own box or pouch - I did - or risk losing combs or the cleaning tools or maybe misplace the essential charger.\nHello QC5055, Goodbye Flowbee :)\nPhilips Norelco arcitec 1050 Men's Shaver\nPHILIPS\n['From the Manufacturer', 'Select the right shaving head for you!Renew for better results series shaving head', 'arc', 'itec', '1050CC', ',', '1060', '1050/1050X', ',', '1090', 'Smart-Touch XL', '9199XL', 'Speed-XL', '8240XL', ',', '8260XLCC', '7310XL', ',', '7340XL', '7810XL', '7400 - 7800', '6940LC', '5400 - 5800', '4000', 'NIVEA FOR MEN Razor', '8020X/33', '8040X/18', '8060X/25', 'HS 800Nivea Shaving conditioner for NIVEA FOR MEN razor 7700', 'HQ 170Shaving lotion for Cool Skin HQ 171Shaving gel for Cool Skin 6700', 'HQ 170Shaving lotion for Cool Skin HQ 171Shaving gel for Cool Skin Cleaningaccessory', 'HQ 200', 'Cleaning solution for JetClean System']\n{'Brand': 'PHILIPS', 'Power Source': 'Battery Powered', 'Included Components': 'Battery', 'Item Weight': '0.01 Ounces', 'Color': 'Black/Gray', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.4 x 2.2 x 6.2 inches; 0.01 Ounces', 'Item model number': '1050/1050X', 'Department': 'Shaving and Hair Removal', 'UPC': '075020000958', 'Manufacturer': 'Philips Norelco'}\nThe Arcitec is replacing my almost 3 year old [[ASIN:B0012TLPBQ Philips Norelco Speedxl Men's Shave]] which served me well for all this time but, when the time came to replace the old 8140XL's heads I happened to notice that a brand-new Arcitec was available as a 'lightning deal' for some $35 more so I took advantage of the opportunity. After several weeks of using it I can say that the Arcitec is 'better' that the 8140XL and I am therefore pleased with my purchase. While the end result of shaving is basically the same which is not surprising because the Arcitec implements the same 'lift and cut' technology, it appears to be much gentler to my skin, the more flexible shaving heads better follow my face and neck, has a better grip, comes with a more protective storage/charger pod and, of course, is prettier.<br /><br />But, let's go into some details:<br /><br />PACKAGING, CONTENTS AND PRESENTATION<br /><br />The shaver comes to you inside a triple-layered protective/defensive enclosure, hard plastic over cardboard over another clamshell (but easy to open) protective plastic layer. It's not totally bullet-proof but it probably ensures that most units don't suffer any damage while in transit.<br /><br />Inside I found:<br /><br />- The shaver itself<br />- Super-protective (for travel mostly) charging pod<br />- Cleaning brush<br />- Charging stand<br />- Sliding razor head cap<br />- 100/240V power cord<br />- User manual and warranty statement (English/Spanish)<br />- Quick start guide card<br /><br />Taking the shaver out of its packaging, understanding its operation and making it work was relatively easy.<br /><br />The manual, covering FOUR separate models is surprisingly well written to the extent that you are not annoyed by having to find the paragraph that applies to your specific model so, know thy model number (it's a 1050). It covers everything, from features, charging options, shaving tips and techniques, cleaning, storage and replacement of the razor head. I've actually read it and I am better off for it.<br /><br />FEATURES AND OPERATION<br /><br />Charging<br />--------<br />This is one of Arcitec's better features. The manual claims (verified) that it can take a full charge in about one hour and, once charged. I didn't count shaving minutes but, at least with a brand-new battery you won't need to recharge it very often. In 'emergencies', just 3 minutes of charging should give you 3 minutes of shave time.<br /><br />There is no way to replace the battery inside the shaver but, based on my experience with Architec's precursor, my 2.5 year old 8140XL, this should not be an issue. After all these years the battery still allows me to shave several times before a recharge is needed.<br /><br />You charge your shaver by either placing it on the charging stand or inside the charging pod. Philips recommends that you do not keep the charging stand continuously connected to the power outlet and I have no problem with that. One one-hour charge session keeps my shaver going for several weeks (I only shave 2-3 times per week).<br /><br />Shaving<br />--------<br />The feature most of us buy a shaver for :)... It's okay, for an electric shaver. I won't say that \"it's as close as a blade\" because it isn't but that's not why I switched from blade shaving to electric some 7 years ago. I am using an electric shaver because shaving with a blade had my skin irritated, especially on my neck. The 8140XL was okay but my neck still felt uncomfortable. The Architec does NOT irritate my neck at all and this is a very good thing.<br /><br />The above comes with a price. Shaving takes a lot longer. You need to go over the same area several times before all the hairs are 'lifted and cut' but that was a tradeoff I understood and I accepted. Norleco claim that the Arcitec has \"50% more shaving surface\" (compare with the old 8140XL claim of \"up to 50% more shaving surface\") is just marketing hype and always left me ask myself \"50% more than what?\". The reality is that the 3 heads together add up to a decent shaving surface, and the Arcitec's are not larger than the 8140XL's but I would not call them 'humongously large\". And, again, contrary to marketing claims, shaving with the Arcitec or with just about any other electric shaver is not 'fast'.<br /><br />As I noted before, the Arcitec is very gentle to my skin and this is the main reason, other than good looks, that I prefer it over the older model. Sometimes you need to go several times over the same neck spot because 'lift and cut' is good but not perfect but my experience with the Arcitec is that my skin tolerates it pretty well.<br /><br />Trimmer<br />--------<br />A small trimmer can be pulled out when needed. I am not going to use it that much but I was able to successfully and quickly trim my mustache. It's a useful feature.<br /><br />Other bells and whistles<br />-----------------------<br />When needed, a number of indicators/warnings discretely light up on shaver's body: low battery, charing indicator, needs cleaning indicator, travel lock and shaving head replacement indicator.<br /><br />MAINTENANCE<br /><br />I don't like spending a lot of time taking care of my shaving tools and the Arcitec does not need a lot of maintenance. Each of the 3 individual heads can be opened and the hair fragments stored inside are washed away in seconds. Any that don't go can be removed with the providing brush. It's possible to also use liquid soap or degreasing liquid (alcohol) solutions for cleaning but I haven't yet.<br /><br />The trimmer, if used extensively, could use a couple of drops of mineral oil once or twice per year.<br /><br />Norelco recommends that the full shaving head assembly is replaced once a year and an 'replace head' indicator should light up on the shaver when that time comes but we are not there yet and I will be making that decision when the time comes.<br /><br />SUPPORT AND WARRANTY<br /><br />There is a 45-day money back guarantee. Philips Norelco promise to fully refund your purchase price if you ship them back the product within 45 days of your purchase date. You will be paying for shipping and insurance and they are not responsible for lost items - therefore the need for insurance.<br /><br />In addition, there is a 2-year limited warranty and warrants against defects and, of course, you lose coverage if you abuse your shaver or you try to fix it your self or through unauthorized repairers.<br /><br />The 800 numbers you need to call for support or warranty service are printed on several locations on the box and on the manual.<br /><br />Made in Holland.<br /><br />DESIGN AND ERGONOMICS<br /><br />'The looks' is clearly Arcitec's distinguishing feature. I like it but I'm not going to say more because everyone can see the images posted on Amazon's page. As I noted above, all indicators and warnings light up when only when needed and are invisible at any other time. The Arcitec's body shape makes for a very comfortable grip while shaving. I also appreciated the little suction cups at the bottom of the charging stand that add to its stability.<br /><br />The charging pod, on the other hand, is a little too bulky and it's not easy to close/open and it can't store then shaver while the heads cap is on. I didn't take it on the road yet but, when I do I may appreciate how it protects my shaver but, on the other hand, I don't believe any of my shavers was ever damaged while travelling so I'm not so sure the bulkiness is justified.<br /><br />Finally, I wish there was some 'case' to carry or store everything. The way the shaver comes, it's possibly to store it inside the pod but then the heads cap, the cleaning brush and the charging cord are 'outside' and they are easy to lose, especially the first two.<br /><br />MY RATING<br /><br />I am pleased with my purchase and Arcitec is now my 'regular' shaver. Losing the occasional red spots on my neck was very much worth it. Besides the comfortable shave the Arcitec comes with pretty good support (money back promise, 800 support number), looks good and, based on my prior experience with an earlier Philips Norelco shaver, is likely to last for a long, long time. Some of the marketing claims: quick shave, 50% larger (than what???) are a little bit exaggerated but... that's what our reviews are for.<br /><br />I hesitated between 4 (I like it) and 5 (I love it) stars. If you expect the Arcitec to fulfill all the marketing claims, you may be slightly disappointed but if you know what to expect from an electric shaver and understand that real-world miracles are very rare, then a 5 star may be the fair rating. I will do a 4 stars at this time for a good quality, well designed electric shaver that appears to be an incremental improvement over previous generations but whose capabilities may be a little over-hyped.<br /><br />--<br />>> Brush your teeth, it's the law! &lt;&lt;\nAbove average shaver, doesn't irritate my skin, pretty\nPhilips Norelco 8140XL SpeedXL Men's Shaver\nPhilips Norelco\n[\"Norelco's New Speed-XL Shaving System has Speed-XL Shaving Heads which have 3 rows of Blades and Slots and Holes, and covers 50% more shaving surface for a faster, smoother and closer shave! The Speed-XL Power System is Rechargeable Cord / Cordless. It can be used anywhere! This model has a 2 LED Display which displays Battery Full and Charging Indicators. One hour full charge for up to 55 minutes of shave time -- over two weeks! Shaver has a Spring Release, Full-Width Trimmer, automatic Worldwide Voltage, and 60 Day Money Back Guarantee and Full Two-Year Warranty! Accessories to use with this shaver are #HQ9 Speed-XL Replacement Heads and #HQ8010 Car Cord Adaptor.\"]\n{'Brand': 'Philips Norelco', 'Power Source': 'Battery Powered', 'Included Components': 'Battery', 'Item Weight': '2 Pounds', 'Color': 'Grey', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.5 x 2.13 x 5.75 inches; 2 Pounds', 'Item model number': '8140XL', 'UPC': '099325061599 075020218131', 'Manufacturer': 'Philips Norelco'}\nAccording to my Amazon's purchase records, I bought this shaver back in June 2008 and I've used it almost exclusively up until recently when it was replaced by a [[ASIN:B000PKNPES Philips Norelco arcitec 1050 Men's Shaver]] not because it stopped working but because the Arcitec was on sale for a price where it made more sense to buy a brand-new shaver than to replace the old SpeedXL's shaving heads. As of now, the SpeedXL is still in perfect working order and it's likely to be one of my kids first shavers when they are going to need a first shaver (soon).<br /><br />I am writing this only to testify to the quality of this product. I had no problems with it whatsoever, it never let me down, the battery still holds enough charge for maybe half a dozen shaves, runs as silently as on day one and it's a near-zero maintenance item, requiring nothing beyond the heads cleaning after each shave by placing them under the faucet. The one issue I had was that the skin on my neck got irritated from time to time but it was never anything major that wouldn't go away after a few hours.<br /><br />Si, it's goodbye to the SpeedXL for me (hello Arcitec) but it's not this shaver's end of career. It's going to be in service, again, in about a year or two, who knows for how much longer :)\nTest of time: Aced!\nArgan Oil Shampoo - Best For Dry, Damaged, Thinning Hair & Split Ends - Natural, Enriched With Vitamin E - Restoration, Shine And Repair Treatment For Women - Sulfate Free - From Andre Lorent\nAndre Lorent\n{'Brand': 'Andre Lorent', 'Item Form': 'Liquid', 'Hair Type': 'Damaged,Dry', 'Age Range (Description)': 'Adult', 'Recommended Uses For Product': 'Split Hair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.12 x 2.12 x 9.5 inches; 10.08 Ounces', 'UPC': '638302687515'}\nI've been used this specific shampoo only a couple of times as it was offered by vendor as a 'for review' item but we've been into Argan Oil shampoos for the past half year or so and we are very happy with the results. In fact our teenage daughter insists that whatever shampoo we purchase it contains the Argan Oil.<br /><br />This shampoo provided a thorough, gentle cleaning of my hair and scalp and there is not discomfort or itchy feeling whatsoever after use which is a good thing. Our daughter likes it too but she observed that 'it smells funny'. I do agree that there is a strong, not necessarily unpleasant, smell for a brief few seconds while you are applying the shampoo on hair.<br /><br />Additional facts worth sharing:<br /><br />- It comes in a tube and a tube this size should probably last 2-3 months if used by a couple of people so, while the price is higher than what you'll typically see at a supermarket, it's not THAT high when spread over several months and it's worth the extra few dollars.<br />- While it's not stated anywhere, it seems to act as a conditioner. I would not use use a conditioner after this shampoo myself.<br />- For what is worth, the ingredients include: Aloe leaf extract, Argan oil, Xanthan gum and dozen of ingredients that are difficult to spell or pronounce but the maker promise that there are no petrochemical derivatives or parabens and that no animal testing was conducted.<br /><br />The odds are I will continue to use this shampoo until I am made aware of a superior product. Until then, I am happy with it.<br />____________________________________________________<br /><br />NOTE: If you are curious about Argan oil - apparently very good for both hair and skin - Wikipedia has a very good article.\nArgan Oil Is Not Snake Oil\nHair Clippers and Trimers for Men Cordless Rechargeable Hair Cutter Kit\nMayBuy\n['Hair Clippers and Trimers for Men Cordless Rechargeable Hair Cutter Kit']\n{'Recommended Uses For Product': 'Shaving', 'Color': 'Black', 'Hair Type': 'All', 'Brand': 'MayBuy', 'Power Source': 'Battery Powered', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.99 x 2.99 x 0.71 inches; 3.21 Ounces', 'Item model number': 'PINK55', 'Batteries': '1 Lithium Ion batteries required. (included)', 'UPC': '682500548413', 'Manufacturer': 'Maybuy'}\nSurprisingly, this small set, probably the smallest I've seen so far, comes with everything you will need for beard-mustache trimming and it could be used for hair styling for as long as your hair is not too long.<br />I would recommend it as a travel option because of its small and efficient size but it could also be used as the default beard or generally facial hair tool if your needs aren't anything special.\nSmall is useful\nWater Flosser Cordless Teeth Cleaner, SOOCAS Professional Oral Irrigator 230ML Portable and Rechargeable Water Dental Flosser with 3 Modes and 4 Jet Tips, IPX7 Waterproof, USB Charged for 30 Days Use\nSOOCAS\n{'Brand': 'SOOCAS', 'Power Source': 'Battery Powered', 'Special Feature': 'Por, Multiple Operation Modes, Multiple Tips', 'Unit Count': '1.00 Count', 'Tank Volume': '230 Milliliters', 'Package Dimensions': '9.49 x 4.41 x 3.23 inches; 1.08 Pounds', 'Item model number': 'SOOCAS W3', 'Manufacturer': 'SOOCAS'}\nI am one of those who prefer water flossers to string-based flossing. Process is much cleaner and, in my view, cleaning is more thorough.<br />This Chinese designed and made unit works well. You fill it with warm water, select the mode, possibly select a specific pick - but I always use the regular one - and you start flossing away.<br />Item design and ergonomics are generally Okay. However, the manual is not exactly helpful but most of us should be able to figure it out, eventually. Charging is via a custom USB cable but there is no actual charging unit so you need to find one such as your phone charger. You only need to charge it once every couple of weeks if you use it once daily.<br />Overall, a useful item and it does appear to be durable. Time will tell.\nGood so far\nGentlehomme Face Moisturizer For Men - Mens Facial Lotion with Neroli Essential Oil Scent - Collagen & Stem Cells - Daily Anti-Aging Moisturizer for Dry & Oily Skin - 4 oz\nGentlehomme\n{'Brand': 'Gentlehomme', 'Scent': 'Fresh', 'Item Form': 'Lotion', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '3 x 2.83 x 2.4 inches; 4 Ounces', 'UPC': '860001419924'}\nThe marketing blurb says, among other things \"this advanced man face care formula features stem cells to help revive the skin and smooth out imperfections\".<br />Well... stem cells, if they were actually somehow harvested, in a cosmetics container, mixed with various other chemicals and ingredients would necessarily be dead and therefore completely irrelevant. And, of course, the stem cells would help address things such as diabetes and repair of heart muscle following heart attack, not zits on one's face. Not to mention that they would need to be live and 'human' cells. So, I am quite confident that the 'stem cells' claim is untrue and, even if it were true, the presence of dead stem cells in a cream would make zero difference.<br />Other than that, the cream is thick and, as other reviewer found, it has an aggressive smell that reminded me of Noxzema. So I would never use it during the day. At night, it would probably be Okay if used by men who sleep alone.\nIf you sleep alone\nBalance White Mud Balancing Mask by Au Natural Skinfood | Rotorua Exfoliating Mask with 16+ Manuka Honey | Certified | Food For Your Skin | All Skin Types | Made in New Zealand | 1.7 oz\nAÚ NATURAL SKINFOOD\n{'Brand': 'AÚ NATURAL SKINFOOD', 'Item Form': 'Mask', 'Product Benefits': 'Exfoliates,Hydrates,Exfoliating', 'Scent': 'Honey', 'Skin Type': 'All', 'Product Dimensions': '9.65 x 6.1 x 1.77 inches; 1.7 Ounces'}\nIt's a good mask, according to my wife and daughter. They both tried it and, after they did, there was enough left for maybe one application. Strangely, the tin came only half-full and I don't know if it was so only because it was from a batch sent to Vine reviewers.<br />The mask gets pretty dry after application but skin underneath stays Okay. Of course, it has all the right ingredients so, no surprises such as allergic reactions, swelling or redness. It's probably something that you would want to use once weekly but not more often.\nAlmost everything you ever wanted and less\nFASCY LAB GREEN+ Korean Sunscreen — SPF 50+PA++++, Daily Facial Sunscreen, Sun Cream With Patented Ingredients, Korean Spf, Korean Sun Cream for Face — Paraben Free [1 x 1.69 Fl.Oz.]\nFascy\n{'Sun Protection': '50 SPF', 'Item Weight': '50 Milligrams', 'Number of Items': '1', 'Unit Count': '1.69 Fl Oz', 'Skin Type': 'Dry', 'Item model number': 'KC'}\nIndeed, for a while we thought then name was slightly misspelled because the product is somewhat fancy. It's clearly  a good quality sunscreen and experience has shown us that the odds for a Korean cosmetics product to be good are quite... good.<br />This sunscreen appears to be no exception. Texture is light and face feels good if used when spending a few hours at the pool or at the beach, and we tried both. And, yes, this is for face only, mostly because there's not much of it and it's not exactly cheap so enjoy it while it lasts.\nFancy but excellent\nBadgley Mischka 1.7floz/50mL Body Wash Toiletries for Bathroom, Guests, Hotels, Motels, and Lodging (30 pack)\nHOTEL EMPORIUM, INC.\n{'Skin Type': 'All', 'Brand': 'HOTEL EMPORIUM, INC.', 'Scent': 'Citrus, Tea Tree, Ginger', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Count', 'Package Dimensions': '9.8 x 6.3 x 4.09 inches; 4.27 Pounds', 'UPC': '810053620212'}\nWhat you get is exactly what you should expect, which is a large (30) number of little bottles that you can take with you if you don't use them while a guest. Which is a good thing, given that the current trend seems to be large dispensers, things that it would be difficult to take because they are large and taking them would be considered 'theft'.  Not to mention that said dispensers are not as sanitary as little 'use once, then throw away' bottles.<br />So, good marks for hygiene and also for a decent body wash.\nGood marks for hygiene",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Good marks for hygiene",
    "text": "What you get is exactly what you should expect, which is a large (30) number of little bottles that you can take with you if you don't use them while a guest. Which is a good thing, given that the current trend seems to be large dispensers, things that it would be difficult to take because they are large and taking them would be considered 'theft'.  Not to mention that said dispensers are not as sanitary as little 'use once, then throw away' bottles.<br />So, good marks for hygiene and also for a decent body wash.",
    "images": [],
    "asin": "B09BDD8NVX",
    "parent_asin": "B09BDD8NVX",
    "user_id": "AEHOFUNZP6VT74RUDDCJ2VVIT56A",
    "timestamp": "2021-09-08 16:35:55.288000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Badgley Mischka 1.7floz/50mL Body Wash Toiletries for Bathroom, Guests, Hotels, Motels, and Lodging (30 pack)",
    "average_rating": 4.5,
    "rating_number": 2,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/413h55XTV2L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/413h55XTV2L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71viJ6NhF0L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31UHq9TMGiL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31UHq9TMGiL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61kH1FfhAiL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/21JJKhTgpEL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/21JJKhTgpEL.jpg",
        "variant": "PT02",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "Badgley Mischka Collection",
        "url": "https://www.amazon.com/vdp/0490525b3ba14d25883ad887710635c0?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "HOTEL EMPORIUM, INC.",
    "categories": [],
    "details": {
      "Skin Type": "All",
      "Brand": "HOTEL EMPORIUM, INC.",
      "Scent": "Citrus, Tea Tree, Ginger",
      "Age Range (Description)": "Adult",
      "Unit Count": "1.00 Count",
      "Package Dimensions": "9.8 x 6.3 x 4.09 inches; 4.27 Pounds",
      "UPC": "810053620212"
    },
    "bought_together": null
  }
}