{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hercules (2014)\nReview Date: 2020/10/04\nStore: Dwayne Johnson  (Actor),     Joseph Fiennes  (Actor),     Brett Ratner  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: [\"Dwayne Johnson delivers an unforgettable performance as the mighty HERCULES! When a terrifying new enemy threatens the innocent, Hercules and his fearless team of warriors must lead their army in a battle against overwhelming odds. It will take the strength of a god for Hercules to overcome his past and conquer his foes in the epic adventure that critics are calling 'fast-paced and packed with eye-popping action!' Weitzman, New York Daily News).\"]\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Rufus Sewell, Peter Mullan, Joseph Fiennes, John Hurt, Ian McShane, Dwayne Johnson, Brett Ratner', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': 'PRT360254DVD', 'Director': 'Brett Ratner', 'Media Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Dwayne Johnson, Joseph Fiennes, John Hurt, Peter Mullan, Ian McShane', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Don't know, wasna gift.\nReview Title: Gift: Don't know.\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Riding Rio Branco\nAlex Jr.  (Actor),     Carlos Gomes  (Actor),     Vidway  (Director)    &                   0                  more   Rated:    X    Format: DVD\nMovies & TV, Featured Categories, DVD, LGBT\n['This bucking bronco is looking for a bucking hard cock to fuck and suck until the sun comes up.']\n{'MPAA rating': 'X (Mature Audiences Only)', 'Package Dimensions': '7.52 x 5.39 x 0.55 inches; 3.03 Ounces', 'Director': 'Vidway', 'Media Format': 'NTSC', 'Run time': '1 hour', 'Release date': 'June 2, 2010', 'Actors': 'Alex Jr., Carlos Gomes, Ramon Lemos', 'Studio': 'Pau Brasil', 'Country of Origin': 'USA', 'Number of discs': '1'}\nBad video..video kept skipping the end of dvd.\nNothing\nDoris Day: The Essential Collection\nRock Hudson  (Actor),     Doris Day  (Actor),     Norman Jewison  (Director),     Michael Gordon  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Classics\n['Charismatic and beautiful, Doris Day is America\\'s original sweetheart who delighted audiences with her comedic timing, silky-smooth voice and sunny personality during the 1950s and 1960s. A box-office sensation for many years, her hugely successful acting career is celebrated in Doris Day: The Essential Collection which includes a selection of her most popular screen appearances: Pillow Talk, Lover Come Back, Send Me No Flowers, The Thrill Of It All!, Midnight Lace and The Man Who Knew Too Much. Co-starring Hollywood legends including Rock Hudson, James Stewart, Tony Randall, Rex Harrison and James Garner, this timeless collection is a stunning tribute to the \"girl next door\" who continues to capture hearts on and off the screen.Bonus Content:', 'Disc 1 - Pillow Talk:', 'Back in Bed with Pillow Talk', 'Back in Bed with Pillow Talk', 'Chemistry 101: The Film Duo of Doris Day and Rock Hudson', 'Chemistry 101: The Film Duo of Doris Day and Rock Hudson', 'Feature Commentary with Film Historians Jeff Bond, Julie Kirgo and Nick Redman', 'Feature Commentary with Film Historians Jeff Bond, Julie Kirgo and Nick Redman', 'Trailer', 'Trailer', 'Disc 4 - The Man Who Knew Too Much:', 'The Making of The Man Who Knew Too Much', 'The Making of The Man Who Knew Too Much', 'Production Photographs', 'Production Photographs', 'Trailers', 'Trailers', 'Production Notes.', 'Production Notes.']\n{'Genre': 'Drama, Comedy, Suspense', 'Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Contributor': 'Brenda de Banzie, Maurice Richlin, Ben Roberts, Julia Meade, Delbert Mann, John Gavin, Jack Oakie, Stanley Shapiro, Julius Epstein, Rex Harrison, Michael Gordon, Thelma Ritter, John Williams (II), Harry Keller, Jack Kruschen, Ralph Truman, Patricia Barry, Clint Walker, Martin Melcher, Tony Randall, Marcel Dalio, Ann B. Davis, Natasha Parry, Paul Lynde, Mogens Wieth, Edward Andrews, Alan Mowbray, Doris Day, Edie Adams, Norman Jewison, Hal March, Daniel Gelin, Carl Reiner, Nick Adams, James Stewart, Bernard Miles, Hermione Baddeley, Rock Hudson, Ross Hunter, Russel Rouse, Clarence Greene, John Michael Hayes, David Miller, Hillary Brooke, Paul Henning, Alfred Hitchcock, James Garner, Roddy McDowall, Carolyn Jones, Irene, Myrna Loy, Ivan Goff, Zasu Pitts, Herbert MarshallBrenda de Banzie, Maurice Richlin, Ben Roberts, Julia Meade, Delbert Mann, John Gavin, Jack Oakie, Stanley Shapiro, Julius Epstein, Rex Harrison, Michael Gordon, Thelma Ritter, John Williams (II), Harry Keller, Jack Kruschen, Ralph Truman, Patricia Barry, Clint Walker, Martin…  See more', 'Initial release date': '2015-04-07', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '2.35:1, 2:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '61168894', 'Director': 'Norman Jewison, Michael Gordon, Delbert Mann, David Miller, Alfred Hitchcock', 'Media Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Run time': '10 hours and 46 minutes', 'Release date': 'April 7, 2015', 'Actors': 'Rock Hudson, Doris Day, James Stewart, Rex Harrison, James Garner', 'Subtitles': 'French, Spanish', 'Producers': 'Ross Hunter, Martin Melcher, Stanley Shapiro, Harry Keller, Alfred Hitchcock', 'Studio': 'Studio Distribution Services', 'Writers': 'Carl Reiner, Stanley Shapiro, Julius Epstein, Maurice Richlin, Paul Henning', 'Number of discs': '4'}\nPresent.\nPresent.\nThe Six Million Dollar Man: Season 1\nLee Majors  (Actor),     Richard Anderson  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Grievously injured in the crash of an experimental aircraft, Colonel Steve Austin\\'s shattered body is covertly rebuilt via the miracle of modern science known as bionics. Equipped with atomic-powered limbs that make him \"better, stronger, faster\" than the average mortal, Austin (Lee Majors) can now run at speeds exceeding 60 miles per hour, overturn cars with ease, and spot an encroaching enemy from over a mile away. Under the watchful eye of OSI director Oscar Goldman (Richard Anderson), Steve repays his debt to the taxpayers by taking on perilous missions of a highly classified nature. Season 1 chronicles Steve Austin\\'s amazing metamorphosis from \"a man barely alive\" to cyborg to patriotic superspy. Armed with futuristic abilities, Austin is dispatched to do battle with kidnappers, arms smugglers, evil scientists, political assassins, and a diabolical robot—with time enough to spare to counsel a troubled astronaut (William Shatner) and clear his dead father\\'s name. Relive the thrill of Steve\\'s first bionic run in this digitally remastered 6-DVD set featuring 13 uncut episodes; all three made-for-TV movies in their original, unedited versions; and over two hours of never-before-seen bonus materials!', 'Bonus Content:', 'Disc 6:', 'Real Bionics', 'Real Bionics', 'An Iconic Opening', 'An Iconic Opening', 'Season 1 VIPs: A celebration of The Six Million Dollar Man Guest Stars', 'Season 1 VIPs: A celebration of The Six Million Dollar Man Guest Stars', 'OSI Mission Debriefing: Executive Producer Harve Bennett', 'OSI Mission Debriefing: Executive Producer Harve Bennett', 'Interactive Bonus Feature: Bionic Breakdown', 'Interactive Bonus Feature: Bionic Breakdown', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Lee Majors, Richard Anderson', 'Language': 'English (Dolby Digital 2.0)', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.35 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '14 hours and 44 minutes', 'Release date': 'November 29, 2011', 'Actors': 'Lee Majors, Richard Anderson', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '6'}\nPresent.\nPresent.\nYoga for the Rest of Us: Easy Yoga for Arthritis\n.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n[\"Join yoga teacher Peggy Cappy as she demonstrates movements to use at home to strengthen muscles and help increase mobility for people who are challenged by arthritis or the stiffness that comes with age or injury. This new special is divided into seven easy-to-use segments that will leave you energized and feeling more flexible: • Gentle Warm-ups to loosen shoulders, neck and back, legs and feet• Warm-ups for the hands, wrists, and arms• Standing poses• Seated poses• Reclining poses• Deep relaxation techniques• MeditationThis gentle yoga routine is perfect for people of all ages and abilities as Peggy's unique approach allows for three modifications for each pose: standing, seated or using a chair for support. Plus, Peggy incorporates meditation into this workout, a technique proven to increase our ability to deal with stress.\"]\n{'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, NTSC', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Item model number': 'YOAR601', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'November 9, 2010', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\nGreat workout.\nToo long..have alot to do in the morning..don't need to spent more than hour on yoga.\nYoga for Seniors with Jane Adams (2nd edition): Improve Balance, Strength & Flexibility with Gentle Senior Yoga, now with 3 complete practices.\nJane Adams  (Actor),     Paul Neff  (Director)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['Senior bodies are not all the same! Physical abilities can vary widely from one person to another, and even from day to day. This DVD has 3 complete yoga practices to meet the varying needs of people over 70. Level 1 (26 minutes) is done all seated in a chair, and emphasizes gentle movements to improve strength, range-of-motion, joint health, and posture, and works the body as fully as possible while sitting in a chair. Level 2 (40 minutes) alternates sitting in a chair, with standing alongside and holding onto a chair for stability. Level 2 works on developing strength and flexibility evenly throughout the entire body, and includes many easy movements to improve balance and increase foot, ankle and leg strength. Level 3 (55 minutes) also alternates sitting in a chair with standing, but is an overall stronger and longer practice than level 2, with more time spent on the standing and balancing poses. Level 3 is broken down into 6 shorter segments for greater choice. The goal of this DVD is to help seniors live fuller, more independent lives. Special emphasis is placed on working the muscles and joints most needed in everyday life and to prevent falls. All 3 practices emphasize good posture, full deep breathing, and end with a short relaxation and meditation for a more alert and relaxed body and mind. Filmed in the beautiful Bibler Gardens. Designed and taught by Jane Adams, RYT 500, a yoga practitioner since 1976 who specializes in yoga for healthy ageing.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.52 x 5.31 x 0.55 inches; 2.88 Ounces', 'Director': 'Paul Neff', 'Media Format': 'Color', 'Run time': '126 minutes', 'Actors': 'Jane Adams', 'Studio': 'Jane Adams Yoga', 'Number of discs': '1'}\nLove it great for my arthritis..great workout for morning.\nGood price.\nHercules (2014)\nDwayne Johnson  (Actor),     Joseph Fiennes  (Actor),     Brett Ratner  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n[\"Dwayne Johnson delivers an unforgettable performance as the mighty HERCULES! When a terrifying new enemy threatens the innocent, Hercules and his fearless team of warriors must lead their army in a battle against overwhelming odds. It will take the strength of a god for Hercules to overcome his past and conquer his foes in the epic adventure that critics are calling 'fast-paced and packed with eye-popping action!' Weitzman, New York Daily News).\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Rufus Sewell, Peter Mullan, Joseph Fiennes, John Hurt, Ian McShane, Dwayne Johnson, Brett Ratner', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': 'PRT360254DVD', 'Director': 'Brett Ratner', 'Media Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Dwayne Johnson, Joseph Fiennes, John Hurt, Peter Mullan, Ian McShane', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nDon't know, wasna gift.\nGift: Don't know.",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user maintains a strong interest in LGBT-themed adult movies while diversifying their media repertoire to include exercise and fitness content for seniors, classic, and action-themed television series. Their recent engagement with action films indicates a slight shift towards mainstream entertainment, showcasing an evolving taste.\n- **Media Format:** Continuing to prefer DVDs for adult content and boxed sets of classic series, the user is now also exploring multiple formats for action movies, reflecting their adaptability to different genres while remaining grounded in traditional formats.\n- **Quality Expectations:** The user emphasizes high production quality across all media types. Their recent negative rating of an action film indicates a heightened scrutiny and suggests that they are less inclined to appreciate low-quality productions, regardless of genre.\n- **Rating Behavior:** Historically inclined to rate content based on quality, the user’s critical approach remains consistent. Their latest rating reveals a clear dissatisfaction with a gift received, hinting at a personal stake in the quality of the media they engage with.\n- **Engagement with Content:** While the user actively engages with explicit media and fitness routines, recent experiences suggest they are also selective with mainstream action releases, advocating for high standards that align with their established preferences across diverse entertainment genres.\n\nOverall, the user maintains a multifaceted interest, underscoring a commitment to quality and thoughtful engagement with their entertainment choices.",
  "metrics": {
    "rouge1_f": 0.11201531833413118,
    "rouge2_f": 0.008624820316243412,
    "rougeL_f": 0.05169937769267592,
    "meteor": 0.02984280601054211,
    "bleu1": 7.697793552445484e-05,
    "bleu2": 1.8611836325586663e-05,
    "bleu3": 2.9652335500370305e-06,
    "bleu4": 1.184621042329834e-06,
    "bertscore_precision": 0.34581130743026733,
    "bertscore_recall": 0.46885302662849426,
    "bertscore_f1": 0.39804044365882874
  }
}