{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nReview Date: 2020/07/02\nStore: Sdara Skincare\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nReview Text: but it isn't certified organic, so is it? I have Aloe plants, but when traveling having Aloe Vera in a bottle is terrific. Also if you are looking to make your own hand sanitizer this is great to add to isopropyl alcohol.<br /><br />Sdara is a Canadian Company that has been around since at least 2016.\nReview Title: It says Organic\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Oral-B Smartseries 4000 Professional Care Rechargeable Electric Toothbrush\nOral-B\n['Product Description', 'Experience the future of oral care. Oral-B Professional Care Smart Series 4000 Rechargeable Electric Toothbrush (formerly known as the Oral-B Triumph), provides extraordinary cleaning and improves brushing habits.', 'Amazon.com', 'Experience the future of oral care with Oral-B® Professional™ SmartSeries™ 4000 rechargeable toothbrush. It provides extraordinary cleaning and improves brushing habits. It has a Deep Clean mode to remove up to 99.7% of plaque from hard to reach areas. It is gentle on teeth and gums and improves gum health better than Sonicare Flexcare, with outstanding whitening and polishing results in 3 weeks.', 'Product Description', 'Experience the future of oral care. Oral-B', '®', 'Professional', '™', 'SmartSeries', '™', '4000 rechargeable toothbrush provides extraordinary cleaning and improves brushing habits.', 'Deep Clean mode removes up to 99.7% of plaque from hard to reach areas', 'Deep Clean mode removes up to 99.7% of plaque from hard to reach areas', 'Gentle on teeth and gums', 'Gentle on teeth and gums', 'Improves gum health better than Sonicare Flexcare', 'Improves gum health better than Sonicare Flexcare', 'Outstanding whitening and polishing in 3 weeks', 'Outstanding whitening and polishing in 3 weeks', 'FlossAction™technology for superior overall clean', 'FlossAction', '™', 'technology for superior overall clean', '4 modes: Daily Clean, Sensitive, Whitening, Deep Clean', '4 modes: Daily Clean, Sensitive, Whitening, Deep Clean', 'Can be used with the following Oral-B', '®', 'refill heads: Oral-B FlossAction', '™', ', Oral-B ProWhite', '™', ', Oral-B Dual Clean, Oral-B Precision Clean', '™', ', Oral-B Sensitive', '™', ', Oral-B Ortho', '™', 'Comparison Chart', 'Power Vs. Manual', 'Scroll to top of page to view video', 'Customize Your Clean', 'With Oral-B Professional Care 4000, you can customize your routine with a variety of Oral-B replacement heads:', 'Oral-B Floss Action', '• Advanced cleaning deep between teeth• Features soft MicroPulse bristles', 'Oral-B Precision Clean', '• Cleaner teeth, healthier gums', '(vs. a regular manual toothbrush)', '• Features more cleaning bristles and superior tooth cupping', '(vs. original Precision Clean)', 'Oral-B Pro White', '• Advanced cleaning and whitening• Features dentist-inspired polishing cup', 'Oral-B Dual Clean', '• Breaks up and sweeps away plaque• Features two moving heads', 'Oral-B Sensitive Clean', '• Gentle, effective cleaning• Features extra soft bristles', 'Subscribe & Save', 'Save 15% on replacement brush heads with Subscribe & Save', 'Don’t forget to replace your brush heads. Join Subscribe & Save and save 15% PLUS get free shipping.', 'Sign up today to automatically receive new replacement brush heads in the intervals you select.', 'Buy These Products and Related Accessories', 'Crest Pro-Health ToothpasteCrest Pro-Health Rinse', 'Change Your Brush', 'Dentists recommend a new brush every season.']\n{'Product Dimensions': '11.63 x 9.63 x 3.5 inches; 1.75 Pounds', 'Item model number': 'SmartSeries 4000', 'Batteries': '2 AA batteries required.', 'UPC': '069055866030', 'Manufacturer': 'Braun'}\nUnbeatable! The next best thing to going to your dental hygenist daily.  I have been using the same one for 10 years, never needed to buy a new one.  I switch the brush out every 3 months or so.  I can still remember the epic difference between my regular toothbrush and this. a small amount of toothpaste does a great job. Worth Every Penney, do yourself a favor and get one today.\nworth every penney\nRoyal Locks Curl Rescue Leave in Conditioner | Curly Hair Therapy | Keravis Ultra Conditioning Formula | 4 Oz\nRoyal Locks\n{'Brand': 'Royal Locks', 'Material Feature': 'Paraben Free', 'Hair Type': 'Frizzy, Curly, Thick, Damaged', 'Age Range (Description)': 'Adult', 'Unit Count': '4 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 3 x 5 inches; 4 Ounces', 'UPC': '651536096977'}\nThis is the real deal. Designed for naturally curly, wavy or grey hair,  or any hair type that needs deep conditioning.  I have 50 year old curly highlighted Irish hair. My styist actually noticed how soft it felt and controllable it looked.  The product calls it Curl Rescue with Keravis Ultra Conditioning Formula for Curls. No Sulfate or paraben; alcohol & cruelty free. With keratin and Vitamin B5.<br /><br />It is doubled packaged inside a mylar container to control any spill in transit.\nLeave in Conditioner for Curly Hair Therapy by Royal Locks\nWater Flosser Cordless Teeth Cleaner, SOOCAS Professional Oral Irrigator 230ML Portable and Rechargeable Water Dental Flosser with 3 Modes and 4 Jet Tips, IPX7 Waterproof, USB Charged for 30 Days Use\nSOOCAS\n{'Brand': 'SOOCAS', 'Power Source': 'Battery Powered', 'Special Feature': 'Por, Multiple Operation Modes, Multiple Tips', 'Unit Count': '1.00 Count', 'Tank Volume': '230 Milliliters', 'Package Dimensions': '9.49 x 4.41 x 3.23 inches; 1.08 Pounds', 'Item model number': 'SOOCAS W3', 'Manufacturer': 'SOOCAS'}\nThe Removable/detachable Water Tank is not removable nor detachable. I studied the user manual and no mention on how to remove it so you can clean it.<br /><br />It doesn't come with an adapter so unless you have an extra you will be charging with your laptop. FYI will not operate while charging.<br /><br />The full water tank lasts for 50 seconds of continuous flossing.<br /><br />A Full battery will last 30 minutes before needing a recharge. Charging time:4-6 Hours. Charging voltage:5V.<br />Cleaning modes are gentle/standard/pulse massage. High pressure water pulse, 20-140PSI water pressure. ** Make sure to not lose the little white tab that covers the charger port - you'll need it to keep it waterproof.\nCordless Water Flosser, USB Rechargeable, 3-Mode, 4 different Jet Tips by SOOCAS W3\nAloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nCIMIY\n{'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nIt's like having your own Aloe plant in a bottle because the first ingredient is Aloe. We do have an Aloe plant in our home.  The bonus is the vitamin E and Hyaluronic Acid (improves skin elasticity). This works great on sunburn!!!<br /><br />In a pinch you can use this and mix with isopropyl alcohol (30/70 mix) and make hand sanitizer.<br /><br />This really well packaged to prevent leakage in transit and you can reuse it to keep little fingers from depressing the product.\nNot just organic\nIryasa Night Indulge Cream - Natural Face Cream for Dry Skin - Vegan Anti Aging Night Cream for Women - Firming Cream for Face and Neck - Organic Vitamin C Moisturizer for Face - 1.7oz\nIRYASA\n{'Brand': 'IRYASA', 'Item Form': 'Cream', 'Unit Count': '1.7 Ounce', 'Use for': 'Face', 'Skin Type': 'Mature', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.76 x 2.76 x 2.2 inches; 1.76 Ounces'}\nI smell like furniture polish, it was piercingly unpleasant.\nDid not like the scent at all\nSdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nSdara Skincare\n{'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nbut it isn't certified organic, so is it? I have Aloe plants, but when traveling having Aloe Vera in a bottle is terrific. Also if you are looking to make your own hand sanitizer this is great to add to isopropyl alcohol.<br /><br />Sdara is a Canadian Company that has been around since at least 2016.\nIt says Organic",
  "profile": "**User Summary:**\n\nThis user demonstrates a strong preference for high-quality grooming products that prioritize effectiveness and meet specific needs, particularly in oral care with their long-term use of an electric toothbrush for deep cleaning and gum sensitivity. Recently, they have expanded their interest to hair care, focusing on products for curly hair that emphasize deep conditioning and natural ingredients, free from harsh chemicals. Their positive experiences with hair products, including leave-in conditioners, highlight their pursuit of effective hair management.\n\nThe user also values natural skincare solutions but has shown discernment, particularly regarding scent and product integrity, as evidenced by their dissatisfaction with a previous night cream. Their recent purchase of an aloe vera gel raises questions about product certification, reflecting their commitment to quality and transparency in ingredient sourcing. \n\nAdditionally, the user is interested in versatile products that serve multiple purposes, such as using aloe vera for skincare and as an additive for hand sanitizer. With a focus on sustainable performance and user-friendly designs, they are keen on ongoing recommendations for top-notch grooming and skincare products. Their consistent five-star ratings underscore a discerning nature, balanced by a willingness to provide critical feedback when products fall short. The user continues to seek innovative, effective personal care solutions that support a holistic approach to their grooming routine.",
  "metrics": {
    "rouge1_f": 0.16194331983805668,
    "rouge2_f": 0.025675675675675677,
    "rougeL_f": 0.07557354925775978,
    "meteor": 0.050738355376653235,
    "bleu1": 0.001082157298329452,
    "bleu2": 0.0003565455169751318,
    "bleu3": 0.00010771153171105011,
    "bleu4": 3.33263125353599e-05,
    "bertscore_precision": 0.34003815054893494,
    "bertscore_recall": 0.4724245071411133,
    "bertscore_f1": 0.39544549584388733
  }
}