{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ruairie False Eyelashes Natural Fluffy 3D Faux Mink Lashes Pack Volume Fake Eyelashes 16 Pairs 2 Styles\nReview Date: 2021/03/08\nStore: Ruairie\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Ruairie', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '7.32 x 6.3 x 0.55 inches; 1.13 Ounces'}\nReview Text: Super cute lashes. I love the product for the price. Now I have a lot of lashes, super flexible band and fluffy.\nReview Title: Cute\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 3D False Eyelashes 4 Styles Volume Soft Lashes Hand-made Reusable Long Lash\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Item Dimensions LxWxH': '3.94 x 3.94 x 0.59 inches', 'Material Feature': 'Lash', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '3.94 x 3.94 x 0.59 inches; 0.81 Ounces', 'UPC': '734830078440'}\nWhen I received the lashes (which was in two days from purchase date), I immediately was fond of the packaging. The package was cute and then I opened the boxes the lashes came in. There were multiple styles! All were so pretty and unique. I recommend these lashes for the quality and price. I will recommend these to my friends!\nGreat\nJIMIRE False Eyelashes with Glue, Full Volume Lashes 3 Pairs with Drying Clear Adhesive\nJIMIRE\n{'Brand': 'JIMIRE', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Glue Free', 'Item Form': 'Pair', 'Unit Count': '4.00 Count', 'Package Dimensions': '5.3 x 3.5 x 0.7 inches; 0.63 Ounces', 'UPC': '732376371186'}\nVery nice lashes. They’re nice quality and soft. I picked the full volume ones not the wispy.\nMust buy\nMagnetic Eyelashes with Eyeliner, Magnetic Eyeliner and Lashes Kit, With Reusable False Eyelashes - No Glue Needed\nRuairie\n{'Brand': 'Ruairie', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '8.00 Count', 'Package Dimensions': '5.71 x 5.63 x 0.71 inches; 5.61 Ounces', 'UPC': '734830950838'}\nThese lashes are so pretty! And they stick to the magnetic eyeliner like no tomorrow. I love it. They’re a natural fit and they’re lightweight. I use them for my natural make up looks. I’ll recommend these to my friends ♥️\nGreat Buy!\nRuairie 25mm Lashes Fluffy 7 Styles False Eyelashes Long Dramatic Volume 3D Fake Eye Lashes Wispies Eyelashes\nRuairie\n{'Package Dimensions': '6.54 x 6.5 x 0.59 inches; 1.41 Ounces'}\nThese are super cute.  they are meant for dramatic looks and they do the job well. They're fluffy and flexible to fit your eyes. Overall I recommend these. Great buy for a great price.\nVery cute\nRuairie False Eyelashes, 20MM Lashes Long Dramatic Fluffy 5D Faux Mink Lashes Pack 4 Styles 20 Pairs Wholesale\nRuairie\n{'Color': 'Black', 'Brand': 'Ruairie', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Package Dimensions': '8.74 x 7.6 x 0.67 inches; 1.41 Ounces'}\nGorgeous lashes I cannot wait to wear out at night :)\nWorth it\n20mm Fluffy 6D Faux Mink Lashes 10 Pairs Dramatic Long Strips False Eyelashes Wispy Soft Reusable Handmade Fake Eyelashes Pack by Pawotence\nPawotence\n{'Brand': 'Pawotence', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.3 x 6.2 x 0.5 inches; 0.81 Ounces'}\nThese lashes are very soft and pretty. I like how they are fluffy and look super cute. I would recommend to a friend. Very nice product for the price :)\nA Must Buy\nRuairie False Eyelashes Volume Natural False Lashes Wholesale 3D Fake Eyelashes Strip Fluffy Wispy Lashes 30 Pairs 6 Styles\nRuairie\n{'Brand': 'Ruairie', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '10.35 x 7.76 x 0.71 inches; 2.08 Ounces', 'UPC': '702571914013'}\n[[VIDEOID:a74f6762d443c8c38c8c2d2fa9355e81]] Super pretty and light lashes a lot of the price I cannot wait to use.\nGorgeous\nRuairie False Eyelashes Natural Fluffy 3D Faux Mink Lashes Pack Volume Fake Eyelashes 16 Pairs 2 Styles\nRuairie\n{'Brand': 'Ruairie', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '7.32 x 6.3 x 0.55 inches; 1.13 Ounces'}\nSuper cute lashes. I love the product for the price. Now I have a lot of lashes, super flexible band and fluffy.\nCute",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preferences**: The user maintains a strong affinity for beauty products, specifically false eyelashes, with a notable interest in versatile, fluffy styles that enhance their makeup. Their recent purchase emphasizes their desire for both quantity and quality.\n\n- **Quality Sensitivity**: They continue to prioritize high standards for quality, favoring lightweight lashes that display a natural appearance. Their selections reflect a consistent effort to find products that integrate seamlessly into their beauty routine.\n\n- **Value for Money**: The user exhibits a keen eye for value, actively seeking dramatic effects at affordable prices. Their latest interaction highlights their satisfaction with cost-effective products that deliver impressive performance.\n\n- **Aesthetics**: Visual appeal remains a significant factor, as they gravitate towards lashes that enhance their overall aesthetics while achieving striking looks.\n\n- **Social Influence**: They regularly advocate for products within their social circles, reinforcing their reputation as a trusted beauty enthusiast driven by positive experiences.\n\n- **Positive Feedback**: The user consistently rates products highly, indicating ongoing satisfaction with choices that balance quality, value, and style. Their latest review praising the affordability and fluffiness of the lashes further underscores their commitment to beauty standards that align with their established preferences.\n\nOverall, the user exemplifies an engaged beauty lover who values high-quality, dramatic, and versatile eyelash options while effectively balancing cost considerations. Their recent interactions reinforce their established behavior patterns.",
  "metrics": {
    "rouge1_f": 0.13904982618771727,
    "rouge2_f": 0.013937282229965157,
    "rougeL_f": 0.06720741599073002,
    "meteor": 0.06220744025622074,
    "bleu1": 0.035897594662408626,
    "bleu2": 0.009104547074694082,
    "bleu3": 0.0015661666227315262,
    "bleu4": 0.0006501417663389592,
    "bertscore_precision": 0.35367780923843384,
    "bertscore_recall": 0.44709402322769165,
    "bertscore_f1": 0.39493703842163086
  }
}