{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ruairie False Eyelashes, 20MM Lashes Long Dramatic Fluffy 5D Faux Mink Lashes Pack 4 Styles 20 Pairs Wholesale\nReview Date: 2020/10/12\nStore: Ruairie\nAverage Rating: 4.5\nProduct Details: {'Color': 'Black', 'Brand': 'Ruairie', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Package Dimensions': '8.74 x 7.6 x 0.67 inches; 1.41 Ounces'}\nReview Text: Gorgeous lashes I cannot wait to wear out at night :)\nReview Title: Worth it\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 3D False Eyelashes 4 Styles Volume Soft Lashes Hand-made Reusable Long Lash\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Item Dimensions LxWxH': '3.94 x 3.94 x 0.59 inches', 'Material Feature': 'Lash', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '3.94 x 3.94 x 0.59 inches; 0.81 Ounces', 'UPC': '734830078440'}\nWhen I received the lashes (which was in two days from purchase date), I immediately was fond of the packaging. The package was cute and then I opened the boxes the lashes came in. There were multiple styles! All were so pretty and unique. I recommend these lashes for the quality and price. I will recommend these to my friends!\nGreat\nJIMIRE False Eyelashes with Glue, Full Volume Lashes 3 Pairs with Drying Clear Adhesive\nJIMIRE\n{'Brand': 'JIMIRE', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Glue Free', 'Item Form': 'Pair', 'Unit Count': '4.00 Count', 'Package Dimensions': '5.3 x 3.5 x 0.7 inches; 0.63 Ounces', 'UPC': '732376371186'}\nVery nice lashes. They’re nice quality and soft. I picked the full volume ones not the wispy.\nMust buy\nMagnetic Eyelashes with Eyeliner, Magnetic Eyeliner and Lashes Kit, With Reusable False Eyelashes - No Glue Needed\nRuairie\n{'Brand': 'Ruairie', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '8.00 Count', 'Package Dimensions': '5.71 x 5.63 x 0.71 inches; 5.61 Ounces', 'UPC': '734830950838'}\nThese lashes are so pretty! And they stick to the magnetic eyeliner like no tomorrow. I love it. They’re a natural fit and they’re lightweight. I use them for my natural make up looks. I’ll recommend these to my friends ♥️\nGreat Buy!\nRuairie 25mm Lashes Fluffy 7 Styles False Eyelashes Long Dramatic Volume 3D Fake Eye Lashes Wispies Eyelashes\nRuairie\n{'Package Dimensions': '6.54 x 6.5 x 0.59 inches; 1.41 Ounces'}\nThese are super cute.  they are meant for dramatic looks and they do the job well. They're fluffy and flexible to fit your eyes. Overall I recommend these. Great buy for a great price.\nVery cute\nRuairie False Eyelashes, 20MM Lashes Long Dramatic Fluffy 5D Faux Mink Lashes Pack 4 Styles 20 Pairs Wholesale\nRuairie\n{'Color': 'Black', 'Brand': 'Ruairie', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Package Dimensions': '8.74 x 7.6 x 0.67 inches; 1.41 Ounces'}\nGorgeous lashes I cannot wait to wear out at night :)\nWorth it",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preferences**: The user shows a robust interest in beauty products, particularly false eyelashes, with a keen enthusiasm for dramatic and fluffy styles that elevate their makeup looks. Their latest purchase emphasizes a desire for options that offer substantial volume and flexibility, ensuring suitability for various occasions.\n\n- **Quality Sensitivity**: They prioritize high-quality materials, favoring lashes that are lightweight and natural in appearance. The user values products that integrate well with their existing makeup routine.\n\n- **Value for Money**: They appreciate products that provide both quality and affordability, gravitating towards options that deliver dramatic effects without sacrificing usability. Their recent choice reflects this balance well.\n\n- **Aesthetics**: The visual appeal of products is critical, as the user enjoys items that enhance their overall makeup aesthetics while achieving the desired dramatic effect.\n\n- **Social Influence**: They actively recommend products to friends, showcasing their positive experiences and solidifying their role as a trusted beauty enthusiast within their social network.\n\n- **Positive Feedback**: The user consistently provides high ratings, particularly when products meet or exceed expectations, highlighting their satisfaction with recent purchases that blend value and attractiveness.\n\nOverall, the user embodies an engaged beauty lover who seeks high-quality, dramatic, and flexible beauty options, especially in false eyelashes, while being mindful of price and usability. Their recent interactions further emphasize these consistent preferences.",
  "metrics": {
    "rouge1_f": 0.18987341772151897,
    "rouge2_f": 0.01904761904761905,
    "rougeL_f": 0.08544303797468356,
    "meteor": 0.09950626577042543,
    "bleu1": 0.10750363575105402,
    "bleu2": 0.03205712560706243,
    "bleu3": 0.005202812202407288,
    "bleu4": 0.002097879952770481,
    "bertscore_precision": 0.3649791479110718,
    "bertscore_recall": 0.43225204944610596,
    "bertscore_f1": 0.39577725529670715
  }
}