{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ruairie 25mm Lashes Fluffy 7 Styles False Eyelashes Long Dramatic Volume 3D Fake Eye Lashes Wispies Eyelashes\nReview Date: 2020/09/05\nStore: Ruairie\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '6.54 x 6.5 x 0.59 inches; 1.41 Ounces'}\nReview Text: These are super cute.  they are meant for dramatic looks and they do the job well. They're fluffy and flexible to fit your eyes. Overall I recommend these. Great buy for a great price.\nReview Title: Very cute\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 3D False Eyelashes 4 Styles Volume Soft Lashes Hand-made Reusable Long Lash\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Item Dimensions LxWxH': '3.94 x 3.94 x 0.59 inches', 'Material Feature': 'Lash', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '3.94 x 3.94 x 0.59 inches; 0.81 Ounces', 'UPC': '734830078440'}\nWhen I received the lashes (which was in two days from purchase date), I immediately was fond of the packaging. The package was cute and then I opened the boxes the lashes came in. There were multiple styles! All were so pretty and unique. I recommend these lashes for the quality and price. I will recommend these to my friends!\nGreat\nJIMIRE False Eyelashes with Glue, Full Volume Lashes 3 Pairs with Drying Clear Adhesive\nJIMIRE\n{'Brand': 'JIMIRE', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Glue Free', 'Item Form': 'Pair', 'Unit Count': '4.00 Count', 'Package Dimensions': '5.3 x 3.5 x 0.7 inches; 0.63 Ounces', 'UPC': '732376371186'}\nVery nice lashes. They’re nice quality and soft. I picked the full volume ones not the wispy.\nMust buy\nMagnetic Eyelashes with Eyeliner, Magnetic Eyeliner and Lashes Kit, With Reusable False Eyelashes - No Glue Needed\nRuairie\n{'Brand': 'Ruairie', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '8.00 Count', 'Package Dimensions': '5.71 x 5.63 x 0.71 inches; 5.61 Ounces', 'UPC': '734830950838'}\nThese lashes are so pretty! And they stick to the magnetic eyeliner like no tomorrow. I love it. They’re a natural fit and they’re lightweight. I use them for my natural make up looks. I’ll recommend these to my friends ♥️\nGreat Buy!\nRuairie 25mm Lashes Fluffy 7 Styles False Eyelashes Long Dramatic Volume 3D Fake Eye Lashes Wispies Eyelashes\nRuairie\n{'Package Dimensions': '6.54 x 6.5 x 0.59 inches; 1.41 Ounces'}\nThese are super cute.  they are meant for dramatic looks and they do the job well. They're fluffy and flexible to fit your eyes. Overall I recommend these. Great buy for a great price.\nVery cute",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preferences**: The user maintains a strong interest in beauty products, particularly false eyelashes, with a growing enthusiasm for dramatic and fluffy styles that enhance their makeup looks. Their latest purchase underscores a preference for options that provide both volume and flexibility, making them suitable for various applications.\n\n- **Quality Sensitivity**: They prioritize high-quality materials, favoring lashes that feel lightweight and natural. The user values products that blend seamlessly with their existing makeup routine.\n\n- **Value for Money**: This user appreciates products that deliver both quality and affordability. They lean toward options that offer dramatic effects without compromising ease of use, as seen in their preference for lashes that perform well at reasonable prices.\n\n- **Aesthetics**: Visual appeal is crucial, with the user expressing satisfaction in products that effectively enhance their overall makeup aesthetics and deliver the desired dramatic effect.\n\n- **Social Influence**: They actively recommend products to friends, demonstrating their positive experiences and helping to establish their role as a trusted beauty enthusiast in their social circle.\n\n- **Positive Feedback**: The user consistently provides high ratings, especially when experiences align with expectations, reflecting their satisfaction with recent purchases highlighting value and attractiveness.\n\nOverall, the user embodies the profile of an engaged beauty lover who values high-quality, dramatic, and flexible beauty options, especially in false eyelashes, while being mindful of price and usability.",
  "metrics": {
    "rouge1_f": 0.2222222222222222,
    "rouge2_f": 0.020905923344947737,
    "rougeL_f": 0.09375,
    "meteor": 0.11712863685803641,
    "bleu1": 0.15126433028427422,
    "bleu2": 0.044545205958414234,
    "bleu3": 0.007199408720423454,
    "bleu4": 0.002896852542358214,
    "bertscore_precision": 0.37232568860054016,
    "bertscore_recall": 0.4306577444076538,
    "bertscore_f1": 0.39937299489974976
  }
}