{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Magnetic Eyelashes with Eyeliner, Magnetic Eyeliner and Lashes Kit, With Reusable False Eyelashes - No Glue Needed\nReview Date: 2020/06/16\nStore: Ruairie\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Ruairie', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '8.00 Count', 'Package Dimensions': '5.71 x 5.63 x 0.71 inches; 5.61 Ounces', 'UPC': '734830950838'}\nReview Text: These lashes are so pretty! And they stick to the magnetic eyeliner like no tomorrow. I love it. They’re a natural fit and they’re lightweight. I use them for my natural make up looks. I’ll recommend these to my friends ♥️\nReview Title: Great Buy!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 3D False Eyelashes 4 Styles Volume Soft Lashes Hand-made Reusable Long Lash\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Item Dimensions LxWxH': '3.94 x 3.94 x 0.59 inches', 'Material Feature': 'Lash', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '3.94 x 3.94 x 0.59 inches; 0.81 Ounces', 'UPC': '734830078440'}\nWhen I received the lashes (which was in two days from purchase date), I immediately was fond of the packaging. The package was cute and then I opened the boxes the lashes came in. There were multiple styles! All were so pretty and unique. I recommend these lashes for the quality and price. I will recommend these to my friends!\nGreat\nJIMIRE False Eyelashes with Glue, Full Volume Lashes 3 Pairs with Drying Clear Adhesive\nJIMIRE\n{'Brand': 'JIMIRE', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Glue Free', 'Item Form': 'Pair', 'Unit Count': '4.00 Count', 'Package Dimensions': '5.3 x 3.5 x 0.7 inches; 0.63 Ounces', 'UPC': '732376371186'}\nVery nice lashes. They’re nice quality and soft. I picked the full volume ones not the wispy.\nMust buy\nMagnetic Eyelashes with Eyeliner, Magnetic Eyeliner and Lashes Kit, With Reusable False Eyelashes - No Glue Needed\nRuairie\n{'Brand': 'Ruairie', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '8.00 Count', 'Package Dimensions': '5.71 x 5.63 x 0.71 inches; 5.61 Ounces', 'UPC': '734830950838'}\nThese lashes are so pretty! And they stick to the magnetic eyeliner like no tomorrow. I love it. They’re a natural fit and they’re lightweight. I use them for my natural make up looks. I’ll recommend these to my friends ♥️\nGreat Buy!",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preferences**: The user continues to have a strong interest in beauty products, particularly false eyelashes, now showing enthusiasm for innovative options like magnetic lashes that enhance convenience and usability. They maintain a focus on styles that provide full volume and fit into their natural makeup looks.\n\n- **Quality Sensitivity**: They prioritize high-quality materials, favoring lightweight and natural-feeling lashes. The user's recent purchase emphasizes their preference for products that blend effectively with their makeup routine.\n\n- **Value for Money**: The user appreciates products offering both quality and convenience, as seen in their choice of glue-free lashes that simplify application without compromising performance.\n\n- **Aesthetics**: Visual appeal remains crucial, with the user expressing satisfaction with the look of their lashes and recognizing their enhancement of overall makeup aesthetics.\n\n- **Social Influence**: The user actively recommends products to friends, reflecting their positive experiences and reinforcing their role as a beauty enthusiast within their social circle.\n\n- **Positive Feedback**: The user consistently provides high ratings when the product experience meets or exceeds expectations, as demonstrated by their enthusiastic feedback on their latest purchase.\n\nOverall, the user embodies the profile of an engaged beauty lover who values high-quality, innovative, and visually appealing beauty options, especially in false eyelashes, while remaining mindful of affordability and ease of use.",
  "metrics": {
    "rouge1_f": 0.232,
    "rouge2_f": 0.020080321285140562,
    "rougeL_f": 0.104,
    "meteor": 0.12804113928552666,
    "bleu1": 0.1705653663853784,
    "bleu2": 0.04967391248240333,
    "bleu3": 0.00842079500504576,
    "bleu4": 0.003470275022848451,
    "bertscore_precision": 0.37959498167037964,
    "bertscore_recall": 0.42978435754776,
    "bertscore_f1": 0.4031335711479187
  }
}