{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Snow Dogs\nReview Date: 2013/11/16\nCategories: Comedy, Sports, Adventure, Heartwarming\nProduct Description: [\"When a Miami dentist inherits a team of sled dogs, he's got to learn the trade or lose his pack to a crusty mountain man.\"]\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English [CC]', 'Español (Latinoamérica) [CC]'], 'Directors': ['Brian Levant'], 'Producers': ['Jordan Kerner', 'Michael Frislev', 'Chad Oakes'], 'Starring': ['Cuba Gooding Jr.', 'James Coburn', 'Sisqo']}\nReview Text: This is a great family movie! Made me laugh and cry. I love to watch it again and again on a winter's day. I recommend this to everyone and you should make it a part of your video library.\nReview Title: My review of Snow Dogs\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stephen King Gift Set (The Langoliers / The Stand / Golden Years)\nRated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['The Langoliers', 'Ten passengers on a red-eye flight from L.A. to Boston discover that they are not the only people on the plane, but after making an emergency landing in Bangor, Maine, they discover that they are the only people on the planet. This film was based off the Stephen King short story', 'Four Past Midnight', '.', 'The Stand', \"Originally aired as a television mini-series, this all-star filmization of Stephen King's gripping epic of good versus evil chronicles the episodic adventures of a disparate group of people who struggle to reestablish civilization after a man-made catastrophe wipes out most of the world's population. The world abruptly ends when a deadly virus accidentally escapes from a government sponsored biological warfare laboratory. Soon people are dropping like flies from the plague, but a few survive and find themselves strangely compelled to head into the West. Good-hearted people follow the voice of an ancient black woman and head for Boulder, Colorado. Bad people follow the enigmatic Walkin' Dude to Las Vegas. It is only a matter of time before the two sides are forced into a climactic battle over the final fate of humanity.\", 'Golden Years', 'This made-for-TV mini-series from the notorious horror writer centers upon a hapless old janitor who begins undergoing incredible physical changes after he is accidentally covered with experimental chemicals following a laboratory mishap. Now the government will stop at nothing to get him back.']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, NTSC', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 7.2 Ounces', 'Item model number': 'PARD130784D', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, NTSC', 'Release date': 'September 25, 2007', 'Studio': 'Paramount'}\nThis was very conveinent having the all three movies in one case, in perfect condition with no flaws whatsoever, perfect for collectors and all your favorite movies in one place, especially if your a Stephen King fan, helps on space too!\nexcellent\nThe Reef\nDamian Walshe  (Actor),     Gyton Grantley  (Actor),     Andrew Traucki  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'On the beautiful but dangerous waters of Australia’s Great Barrier Reef, ship delivery man Luke and four friends chart a yacht to its new owner. Along the way, their ship is torn open by sharp rocks and begins to sink, leaving the passengers with a terrifying choice: stay on board with slim hope of rescue, or swim twelve miles to the nearest island… through shark-infested waters. When they enter the water, an unstoppable, relentless Great White immediately follows their trail for a white-knuckle chase that will fill the waters with blood! From the director of the acclaimed monster hit,', 'Black Water', ', comes a pulse-pounding, visually stunning thriller that never lets go until the final, heart-stopping scream!', 'Amazon.com', \"There are sharks in the water--and that's really all you need to know about\", 'The Reef', \", an effective little nerve-twister from Australia. Five people embark on an innocent sailing trip around the Great Barrier Reef, but when said reef comes into sharp proximity with the bottom of their boat, they have a choice: stay on the capsized craft as the current drags it to the open ocean, or swim for it. (It's not a spoiler to report that not everybody takes the plunge.) As dorsal fins are flashing in the vicinity, this is going to be one long swim. While the swimmers find themselves surrounded by open water, the movie itself is surrounded by\", 'Open Water', ', the 2003 film on a very similar subject.', 'Reef', \"director Andrew Traucki has no shyness about telegraphing his effects (hmmm, I'm sure paddling over by myself to retrieve that broken float just after the shark finally got quiet is probably a good idea, right?) or leaning heavily on nature footage of great whites circling ominously; supposedly there are no CGI sharks or animatronic beasties here. A couple of moments are genuinely popcorn-dropping, no doubt about it. The stock characters may be nothing to rave about, but the actors themselves are agreeable, and the movie's do-or-die situation provides an elemental tug that's hard to resist, even if you know better.\", '--Robert Horton']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Kieran Darcy-Smith, Andrew Traucki, Mark Simpson, Gyton Grantley, Damian Walshe, Adrienne Pickering, Zoe NaylorKieran Darcy-Smith, Andrew Traucki, Mark Simpson, Gyton Grantley, Damian Walshe, Adrienne Pickering, Zoe Naylor   See more', 'Language': 'English', 'Runtime': '1 hour and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.12 Ounces', 'Item model number': '17520531', 'Director': 'Andrew Traucki', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'July 19, 2011', 'Actors': 'Damian Walshe, Gyton Grantley, Adrienne Pickering, Zoe Naylor, Kieran Darcy-Smith', 'Subtitles': 'English, Spanish', 'Studio': 'IMAGE ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is filmed in beautiful Australia. It's exciting and keeps you on the edge of your seat. If you love Jaws and Open Water,<br />this is for you.\nMy review of The Reef\nJohn Edward Cross Country Season 1 (10 DVD Set)\nFormat: DVD\nMovies & TV, TV\n['John Edward Cross Country Season.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.2 x 5.9 x 3.4 inches; 1.45 Pounds', 'Media Format': 'Special Limited Edition, DVD'}\nBeing a Medium myself, I love John Edward. He brings so much peace and hope to those in crisis or looking to connect. He gave me answers that I was looking for and peace with death. If you are very spiritual and interested and interested in life after death. Try reading one of his books or just get a video or two. You won't be disappointed.<br /><br /> The one thing with this package though is, that the 2nd CD in each one, is a repeat of the first, just with added bonus footage. So it was really false advertised that it was complete season 1.\nJohn Edward Cross Country Season 1 Review\n{'Subtitles': ['None available'], 'Directors': ['Steven Cantor', 'Peter Spirer'], 'Producers': ['Steven Cantor', 'Paul Dokuchitz', 'Mark Mori', 'Constance Van Flandern', 'Zeitgeist Films'], 'Starring': ['Sally Mann'], 'Studio': ['Zeitgeist Films']}\nI highly recommend this to photographers and alike. Sally Mann is wonderful and her work has so much feeling. Not just a picture. I look up to her and she is aspiring. You won't be disappointed.\nReview of What Remains: The Life and Work of Sally Mann\nChasing Mavericks\nGerard Butler  (Actor),     Elisabeth Shue  (Actor),     Curtis Hanson  (Director, Producer),     Michael Apted  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Based on the inspirational true story of surfing icon Jay Moriarty, OF MEN AND MAVERICKS tells the story of a young man's quest to surf Northern California's most dangerous wave, and the local legend who takes him under his wing. What begins as a mentorship turns into a unique lifelong bond, as the two unlikely friends discover that there is nothing more powerful than pushing your limits and chasing a nearly impossible dream.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Jonny Weston, Leven Rambin, Brandon Hooper, Jim Meenaghan, Elisabeth Shue, Devin Crittenden, Abigail Spencer, Mark Johnson, Gerard Butler, Michael Apted, Taylor Handley, Curtis HansonJonny Weston, Leven Rambin, Brandon Hooper, Jim Meenaghan, Elisabeth Shue, Devin Crittenden, Abigail Spencer, Mark Johnson, Gerard Butler, Michael Apted, Taylor Handley, Curtis Hanson   See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2282786', 'Director': 'Curtis Hanson, Michael Apted', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'February 26, 2013', 'Actors': 'Gerard Butler, Elisabeth Shue, Jonny Weston, Abigail Spencer, Leven Rambin', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Curtis Hanson, Jim Meenaghan, Brandon Hooper, Mark Johnson', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nDo yourself a favor? If you haven't seen this movie, stream it on Netflix or buy it, rent it etc. It is playing right now on HBO too. You won't be sorry. One of the best movies I have ever seen!!! Based on a true story, it was nothing short of amazing and beautiful. I love everything about surfing and I was just amazed. Enjoy as I cannot say enough about Chasing Mavericks.\nChasing Mavericks Review\nSnow Dogs\nComedy, Sports, Adventure, Heartwarming\n[\"When a Miami dentist inherits a team of sled dogs, he's got to learn the trade or lose his pack to a crusty mountain man.\"]\n{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English [CC]', 'Español (Latinoamérica) [CC]'], 'Directors': ['Brian Levant'], 'Producers': ['Jordan Kerner', 'Michael Frislev', 'Chad Oakes'], 'Starring': ['Cuba Gooding Jr.', 'James Coburn', 'Sisqo']}\nThis is a great family movie! Made me laugh and cry. I love to watch it again and again on a winter's day. I recommend this to everyone and you should make it a part of your video library.\nMy review of Snow Dogs",
  "profile": "The user profile showcases a passionate collector of horror-focused media, particularly adaptations of Stephen King's works, while emphasizing quality and condition within their collection. Their preference for convenience and organization is evident through their appreciation for boxed sets that optimize space.\n\nRecently, the user has broadened their interests, exploring thrillers and dramas that offer engaging narratives. This is highlighted by their acquisition of a thriller with survival horror elements and a limited edition DVD on life after death, reflecting their openness to spiritual themes. Their enthusiastic reviews indicate a consistent appreciation of well-crafted storytelling that is emotionally resonant.\n\nMost recently, the user expressed a fondness for family-oriented content by praising a heartwarming film that blends comedy, sports, and adventure. Their review highlights a strong emotional engagement with the film and a desire to include diverse media in their collection.\n\nOverall, the user exhibits a wide-ranging interest in thrilling, heartwarming, and thought-provoking narratives, demonstrating a commitment to quality, organization, and the emotional depth of their viewing experiences, which now spans genres beyond horror and thriller.",
  "metrics": {
    "rouge1_f": 0.10837988826815642,
    "rouge2_f": 0.016778523489932886,
    "rougeL_f": 0.06033519553072625,
    "meteor": 0.03405116793778975,
    "bleu1": 1.8815025369414867e-05,
    "bleu2": 7.4952844150147e-06,
    "bleu3": 3.555839766342737e-06,
    "bleu4": 1.73404188057703e-06,
    "bertscore_precision": 0.3099961578845978,
    "bertscore_recall": 0.4679147005081177,
    "bertscore_f1": 0.3729264438152313
  }
}