{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/11/05\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Steven Cantor', 'Peter Spirer'], 'Producers': ['Steven Cantor', 'Paul Dokuchitz', 'Mark Mori', 'Constance Van Flandern', 'Zeitgeist Films'], 'Starring': ['Sally Mann'], 'Studio': ['Zeitgeist Films']}\nReview Text: I highly recommend this to photographers and alike. Sally Mann is wonderful and her work has so much feeling. Not just a picture. I look up to her and she is aspiring. You won't be disappointed.\nReview Title: Review of What Remains: The Life and Work of Sally Mann\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stephen King Gift Set (The Langoliers / The Stand / Golden Years)\nRated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['The Langoliers', 'Ten passengers on a red-eye flight from L.A. to Boston discover that they are not the only people on the plane, but after making an emergency landing in Bangor, Maine, they discover that they are the only people on the planet. This film was based off the Stephen King short story', 'Four Past Midnight', '.', 'The Stand', \"Originally aired as a television mini-series, this all-star filmization of Stephen King's gripping epic of good versus evil chronicles the episodic adventures of a disparate group of people who struggle to reestablish civilization after a man-made catastrophe wipes out most of the world's population. The world abruptly ends when a deadly virus accidentally escapes from a government sponsored biological warfare laboratory. Soon people are dropping like flies from the plague, but a few survive and find themselves strangely compelled to head into the West. Good-hearted people follow the voice of an ancient black woman and head for Boulder, Colorado. Bad people follow the enigmatic Walkin' Dude to Las Vegas. It is only a matter of time before the two sides are forced into a climactic battle over the final fate of humanity.\", 'Golden Years', 'This made-for-TV mini-series from the notorious horror writer centers upon a hapless old janitor who begins undergoing incredible physical changes after he is accidentally covered with experimental chemicals following a laboratory mishap. Now the government will stop at nothing to get him back.']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, NTSC', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 7.2 Ounces', 'Item model number': 'PARD130784D', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, NTSC', 'Release date': 'September 25, 2007', 'Studio': 'Paramount'}\nThis was very conveinent having the all three movies in one case, in perfect condition with no flaws whatsoever, perfect for collectors and all your favorite movies in one place, especially if your a Stephen King fan, helps on space too!\nexcellent\nThe Reef\nDamian Walshe  (Actor),     Gyton Grantley  (Actor),     Andrew Traucki  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'On the beautiful but dangerous waters of Australia’s Great Barrier Reef, ship delivery man Luke and four friends chart a yacht to its new owner. Along the way, their ship is torn open by sharp rocks and begins to sink, leaving the passengers with a terrifying choice: stay on board with slim hope of rescue, or swim twelve miles to the nearest island… through shark-infested waters. When they enter the water, an unstoppable, relentless Great White immediately follows their trail for a white-knuckle chase that will fill the waters with blood! From the director of the acclaimed monster hit,', 'Black Water', ', comes a pulse-pounding, visually stunning thriller that never lets go until the final, heart-stopping scream!', 'Amazon.com', \"There are sharks in the water--and that's really all you need to know about\", 'The Reef', \", an effective little nerve-twister from Australia. Five people embark on an innocent sailing trip around the Great Barrier Reef, but when said reef comes into sharp proximity with the bottom of their boat, they have a choice: stay on the capsized craft as the current drags it to the open ocean, or swim for it. (It's not a spoiler to report that not everybody takes the plunge.) As dorsal fins are flashing in the vicinity, this is going to be one long swim. While the swimmers find themselves surrounded by open water, the movie itself is surrounded by\", 'Open Water', ', the 2003 film on a very similar subject.', 'Reef', \"director Andrew Traucki has no shyness about telegraphing his effects (hmmm, I'm sure paddling over by myself to retrieve that broken float just after the shark finally got quiet is probably a good idea, right?) or leaning heavily on nature footage of great whites circling ominously; supposedly there are no CGI sharks or animatronic beasties here. A couple of moments are genuinely popcorn-dropping, no doubt about it. The stock characters may be nothing to rave about, but the actors themselves are agreeable, and the movie's do-or-die situation provides an elemental tug that's hard to resist, even if you know better.\", '--Robert Horton']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Kieran Darcy-Smith, Andrew Traucki, Mark Simpson, Gyton Grantley, Damian Walshe, Adrienne Pickering, Zoe NaylorKieran Darcy-Smith, Andrew Traucki, Mark Simpson, Gyton Grantley, Damian Walshe, Adrienne Pickering, Zoe Naylor   See more', 'Language': 'English', 'Runtime': '1 hour and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.12 Ounces', 'Item model number': '17520531', 'Director': 'Andrew Traucki', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'July 19, 2011', 'Actors': 'Damian Walshe, Gyton Grantley, Adrienne Pickering, Zoe Naylor, Kieran Darcy-Smith', 'Subtitles': 'English, Spanish', 'Studio': 'IMAGE ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is filmed in beautiful Australia. It's exciting and keeps you on the edge of your seat. If you love Jaws and Open Water,<br />this is for you.\nMy review of The Reef\nJohn Edward Cross Country Season 1 (10 DVD Set)\nFormat: DVD\nMovies & TV, TV\n['John Edward Cross Country Season.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.2 x 5.9 x 3.4 inches; 1.45 Pounds', 'Media Format': 'Special Limited Edition, DVD'}\nBeing a Medium myself, I love John Edward. He brings so much peace and hope to those in crisis or looking to connect. He gave me answers that I was looking for and peace with death. If you are very spiritual and interested and interested in life after death. Try reading one of his books or just get a video or two. You won't be disappointed.<br /><br /> The one thing with this package though is, that the 2nd CD in each one, is a repeat of the first, just with added bonus footage. So it was really false advertised that it was complete season 1.\nJohn Edward Cross Country Season 1 Review\n{'Subtitles': ['None available'], 'Directors': ['Steven Cantor', 'Peter Spirer'], 'Producers': ['Steven Cantor', 'Paul Dokuchitz', 'Mark Mori', 'Constance Van Flandern', 'Zeitgeist Films'], 'Starring': ['Sally Mann'], 'Studio': ['Zeitgeist Films']}\nI highly recommend this to photographers and alike. Sally Mann is wonderful and her work has so much feeling. Not just a picture. I look up to her and she is aspiring. You won't be disappointed.\nReview of What Remains: The Life and Work of Sally Mann",
  "profile": "The user profile reflects a devoted collector of horror-focused media, especially adaptations of Stephen King's works, emphasizing quality and condition in their collection. Their strong preference for convenience and organization is evident in their appreciation for boxed sets that streamline space management.\n\nRecently, the user expanded their interests by acquiring a thriller marked by intense suspense and aquatic terror, suggesting a readiness to explore genres that evoke excitement akin to survival horror. Their positive review of this film demonstrates their commitment to quality storytelling.\n\nIn another interaction, the user purchased a limited edition DVD that delves into themes of life after death, showcasing a personal connection to the subject matter and revealing their spiritual interests. This highlights their openness to diverse media while maintaining a consistent focus on quality, convenience, and organization.\n\nMost recently, the user reviewed a documentary centered on a renowned photographer, praising the emotional depth of the subject's work. Their high rating and enthusiastic recommendation reflect a continued appreciation for well-crafted content, even beyond their established horror and thriller preferences. Overall, the user exhibits a broad interest in engaging, thrilling, and thought-provoking narratives across various formats, all while prioritizing a well-organized and high-quality collection.",
  "metrics": {
    "rouge1_f": 0.1561119293078056,
    "rouge2_f": 0.02064896755162242,
    "rougeL_f": 0.07363770250368189,
    "meteor": 0.051884179572453754,
    "bleu1": 0.0013646441370297072,
    "bleu2": 0.0005194267574256361,
    "bleu3": 0.0002204733924612893,
    "bleu4": 0.00010926578814010116,
    "bertscore_precision": 0.3186088800430298,
    "bertscore_recall": 0.45694106817245483,
    "bertscore_f1": 0.37543803453445435
  }
}