{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/02/02\nAverage Rating: 4.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Frederick E.O. Toye', 'Chris Fisher', 'Paul Holahan', 'Scott Lautanen', 'Rod Holcomb', 'Michael Fields', 'John T. Kretchmer', 'Dennis Smith', 'James Whitmore Jr.', 'David Barrett'], 'Producers': ['Not Specified'], 'Starring': [\"Alex O'Loughlin\", 'Sophia Myles', 'Jason Dohring'], 'Studio': ['CBS']}\nReview Text: best show ever want to watch again when available luv luv\nReview Title: moonlite tv series\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stephen King Gift Set (The Langoliers / The Stand / Golden Years)\nRated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['The Langoliers', 'Ten passengers on a red-eye flight from L.A. to Boston discover that they are not the only people on the plane, but after making an emergency landing in Bangor, Maine, they discover that they are the only people on the planet. This film was based off the Stephen King short story', 'Four Past Midnight', '.', 'The Stand', \"Originally aired as a television mini-series, this all-star filmization of Stephen King's gripping epic of good versus evil chronicles the episodic adventures of a disparate group of people who struggle to reestablish civilization after a man-made catastrophe wipes out most of the world's population. The world abruptly ends when a deadly virus accidentally escapes from a government sponsored biological warfare laboratory. Soon people are dropping like flies from the plague, but a few survive and find themselves strangely compelled to head into the West. Good-hearted people follow the voice of an ancient black woman and head for Boulder, Colorado. Bad people follow the enigmatic Walkin' Dude to Las Vegas. It is only a matter of time before the two sides are forced into a climactic battle over the final fate of humanity.\", 'Golden Years', 'This made-for-TV mini-series from the notorious horror writer centers upon a hapless old janitor who begins undergoing incredible physical changes after he is accidentally covered with experimental chemicals following a laboratory mishap. Now the government will stop at nothing to get him back.']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, NTSC', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 7.2 Ounces', 'Item model number': 'PARD130784D', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, NTSC', 'Release date': 'September 25, 2007', 'Studio': 'Paramount'}\nThis was very conveinent having the all three movies in one case, in perfect condition with no flaws whatsoever, perfect for collectors and all your favorite movies in one place, especially if your a Stephen King fan, helps on space too!\nexcellent\nThe Reef\nDamian Walshe  (Actor),     Gyton Grantley  (Actor),     Andrew Traucki  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'On the beautiful but dangerous waters of Australia’s Great Barrier Reef, ship delivery man Luke and four friends chart a yacht to its new owner. Along the way, their ship is torn open by sharp rocks and begins to sink, leaving the passengers with a terrifying choice: stay on board with slim hope of rescue, or swim twelve miles to the nearest island… through shark-infested waters. When they enter the water, an unstoppable, relentless Great White immediately follows their trail for a white-knuckle chase that will fill the waters with blood! From the director of the acclaimed monster hit,', 'Black Water', ', comes a pulse-pounding, visually stunning thriller that never lets go until the final, heart-stopping scream!', 'Amazon.com', \"There are sharks in the water--and that's really all you need to know about\", 'The Reef', \", an effective little nerve-twister from Australia. Five people embark on an innocent sailing trip around the Great Barrier Reef, but when said reef comes into sharp proximity with the bottom of their boat, they have a choice: stay on the capsized craft as the current drags it to the open ocean, or swim for it. (It's not a spoiler to report that not everybody takes the plunge.) As dorsal fins are flashing in the vicinity, this is going to be one long swim. While the swimmers find themselves surrounded by open water, the movie itself is surrounded by\", 'Open Water', ', the 2003 film on a very similar subject.', 'Reef', \"director Andrew Traucki has no shyness about telegraphing his effects (hmmm, I'm sure paddling over by myself to retrieve that broken float just after the shark finally got quiet is probably a good idea, right?) or leaning heavily on nature footage of great whites circling ominously; supposedly there are no CGI sharks or animatronic beasties here. A couple of moments are genuinely popcorn-dropping, no doubt about it. The stock characters may be nothing to rave about, but the actors themselves are agreeable, and the movie's do-or-die situation provides an elemental tug that's hard to resist, even if you know better.\", '--Robert Horton']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Kieran Darcy-Smith, Andrew Traucki, Mark Simpson, Gyton Grantley, Damian Walshe, Adrienne Pickering, Zoe NaylorKieran Darcy-Smith, Andrew Traucki, Mark Simpson, Gyton Grantley, Damian Walshe, Adrienne Pickering, Zoe Naylor   See more', 'Language': 'English', 'Runtime': '1 hour and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.12 Ounces', 'Item model number': '17520531', 'Director': 'Andrew Traucki', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'July 19, 2011', 'Actors': 'Damian Walshe, Gyton Grantley, Adrienne Pickering, Zoe Naylor, Kieran Darcy-Smith', 'Subtitles': 'English, Spanish', 'Studio': 'IMAGE ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is filmed in beautiful Australia. It's exciting and keeps you on the edge of your seat. If you love Jaws and Open Water,<br />this is for you.\nMy review of The Reef\nJohn Edward Cross Country Season 1 (10 DVD Set)\nFormat: DVD\nMovies & TV, TV\n['John Edward Cross Country Season.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.2 x 5.9 x 3.4 inches; 1.45 Pounds', 'Media Format': 'Special Limited Edition, DVD'}\nBeing a Medium myself, I love John Edward. He brings so much peace and hope to those in crisis or looking to connect. He gave me answers that I was looking for and peace with death. If you are very spiritual and interested and interested in life after death. Try reading one of his books or just get a video or two. You won't be disappointed.<br /><br /> The one thing with this package though is, that the 2nd CD in each one, is a repeat of the first, just with added bonus footage. So it was really false advertised that it was complete season 1.\nJohn Edward Cross Country Season 1 Review\n{'Subtitles': ['None available'], 'Directors': ['Steven Cantor', 'Peter Spirer'], 'Producers': ['Steven Cantor', 'Paul Dokuchitz', 'Mark Mori', 'Constance Van Flandern', 'Zeitgeist Films'], 'Starring': ['Sally Mann'], 'Studio': ['Zeitgeist Films']}\nI highly recommend this to photographers and alike. Sally Mann is wonderful and her work has so much feeling. Not just a picture. I look up to her and she is aspiring. You won't be disappointed.\nReview of What Remains: The Life and Work of Sally Mann\nChasing Mavericks\nGerard Butler  (Actor),     Elisabeth Shue  (Actor),     Curtis Hanson  (Director, Producer),     Michael Apted  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Based on the inspirational true story of surfing icon Jay Moriarty, OF MEN AND MAVERICKS tells the story of a young man's quest to surf Northern California's most dangerous wave, and the local legend who takes him under his wing. What begins as a mentorship turns into a unique lifelong bond, as the two unlikely friends discover that there is nothing more powerful than pushing your limits and chasing a nearly impossible dream.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Jonny Weston, Leven Rambin, Brandon Hooper, Jim Meenaghan, Elisabeth Shue, Devin Crittenden, Abigail Spencer, Mark Johnson, Gerard Butler, Michael Apted, Taylor Handley, Curtis HansonJonny Weston, Leven Rambin, Brandon Hooper, Jim Meenaghan, Elisabeth Shue, Devin Crittenden, Abigail Spencer, Mark Johnson, Gerard Butler, Michael Apted, Taylor Handley, Curtis Hanson   See more', 'Language': 'English', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2282786', 'Director': 'Curtis Hanson, Michael Apted', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'February 26, 2013', 'Actors': 'Gerard Butler, Elisabeth Shue, Jonny Weston, Abigail Spencer, Leven Rambin', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Curtis Hanson, Jim Meenaghan, Brandon Hooper, Mark Johnson', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nDo yourself a favor? If you haven't seen this movie, stream it on Netflix or buy it, rent it etc. It is playing right now on HBO too. You won't be sorry. One of the best movies I have ever seen!!! Based on a true story, it was nothing short of amazing and beautiful. I love everything about surfing and I was just amazed. Enjoy as I cannot say enough about Chasing Mavericks.\nChasing Mavericks Review\nSnow Dogs\nComedy, Sports, Adventure, Heartwarming\n[\"When a Miami dentist inherits a team of sled dogs, he's got to learn the trade or lose his pack to a crusty mountain man.\"]\n{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English [CC]', 'Español (Latinoamérica) [CC]'], 'Directors': ['Brian Levant'], 'Producers': ['Jordan Kerner', 'Michael Frislev', 'Chad Oakes'], 'Starring': ['Cuba Gooding Jr.', 'James Coburn', 'Sisqo']}\nThis is a great family movie! Made me laugh and cry. I love to watch it again and again on a winter's day. I recommend this to everyone and you should make it a part of your video library.\nMy review of Snow Dogs\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kasdan', 'Lawrence'], 'Producers': ['Michael Shamberg'], 'Starring': ['Jeff Goldblum', 'Glenn Close', 'Kevin Kline'], 'Studio': ['Crowd Pleasers']}\nOne of the best movies ever made. It remains a favorite of mine until this day. It hits on all levels of our own lives. Makes<br />you reflect. An absolute all star cast!\nMy review of The Big Chill\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Roger Donaldson'], 'Producers': ['Gale Anne Hurd', 'Joseph M. Singer'], 'Starring': ['Pierce Brosnan', 'Linda Hamilton', 'Charles Hallahan'], 'Studio': ['UNIVERSAL PAY TELEVISION']}\nOne of many of my favorite movies. If you like adventure, than this is for you. With an all star cast it is quite the fun movie!\nDante's Peak\nEddie and the Cruisers / Eddie and the Cruisers II: Eddie Lives! (Double Feature) [Blu-ray]\nTom Berenger  (Actor),     Michael Pare  (Actor),     Martin Davidson  (Director),     Jean-Claude Lord  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Two Iconic Films About The Ultimate Rebel, Rocker & Idol! Eddie And The Cruisers - They say rock 'n' roll never dies, but one dark night in 1963, Eddie Wilson's car took a dive off a Jersey bridge with the troubled rock idol at the wheel. His body was never found. Tom Berenger (Sniper), Michael Paré (Streets of Fire), Joe Pantoliano (The Matrix) and Ellen Barkin (Sea of Love) star in this cool, compelling classic that really rocks! Twenty years after the lead singer (Paré) of 'Eddie and the Cruisers' disappeared, the band's songs are hotter than ever. And renewed interest in the band leads TV reporter Maggie Foley (Barkin) to pursue a tantalizing mystery: what if Eddie is still alive? Eddie And The Cruisers II: Eddie Lives! - Get ready to rock! Michael Pare reprises his role as the hot-blooded rebel rocker Eddie Wilson, who, after twenty years, still has 'the kind of charisma that drives adolescent girls wild' (L.A. Herald-Examiner). At the height of fame, rock legend Eddie Wilson (Pare) drove his car into the river and disappeared from the limelight. Twenty years later, his band Eddie and the Cruisers is hotter than ever. Posing as construction worker, Eddie has maintained a quiet life in Canada. But his relentless desire to make music pulls him back to the stage where he forms a new band and an even hotter sound. Meanwhile, to cash in on the revived interest in the band, record executives release an Eddie and the Cruisers 'lost tapes' album and promote a worldwide search for the mysterious rocker. As his new band hits center stage, Eddie finally faces the past - his way.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Contributor': 'Ellen Barkin, Michael Pare, Joe Pantoliano, Martin Davidson, Jean-Claude Lord, Tom Berenger', 'Language': 'English', 'Runtime': '3 hours and 19 minutes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '15712', 'Director': 'Martin Davidson, Jean-Claude Lord', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '3 hours and 19 minutes', 'Release date': 'April 14, 2015', 'Actors': 'Tom Berenger, Michael Pare, Joe Pantoliano, Ellen Barkin', 'Subtitles': 'English, English', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSome of the best music ever! The story is rich and moving. Not only a classic but a favorite.\nReview for Eddie and the Cruisers 1 and 2\nJoshua\nTony Goldwyn  (Actor),     F. Murray Abraham  (Actor),     Jon Purdy  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', \"When a well-intentioned stranger, Joshua (Tony Goldwyn), shows up in a newtown, the locals are at first suspicious, then overjoyed with his presence. He has a charisma that makes everybody feel good. However, the local priests are mystified by him, and cannot explain why they feel that way. JOSHUA is a Christian drama directed by Jon Purdy. Joshua is based on the first novel of Jospeh Girzone's wildly successful Joshua series which has sold over 40 million copies worldwide.\", 'Amazon.com', 'The world can be divided into two camps: those who will watch', 'Joshua', \"reverently and gratefully, and those who will not touch it with a 10-foot pole. The reverent probably own Joseph F. Girzone's bestselling novel about a mysterious but friendly loner who shows up in a small American town and blesses every life he touches. Whites and blacks, Catholics, Protestants, and Jews will work side by side as newly recognized brethren; an estranged couple will resolve to save their marriage; the lonely and disconnected will embrace and be embraced by community; etc. The message--the healing power of Christ's love--is beyond reproach, the intentions of the filmmakers entirely benign, but there is not one whit of dramatic tension or narrative complication to any of it. The cast is stronger than usual in such religious projects (Tony Goldwyn, Oscar winner F. Murray Abraham, Giancarlo Giannini as the Pope), but no one has a prayer with a script that posits the hero's Christhood on the fact that 12 people show up for his going-away dinner.\", '--Richard T. Jameson']\n{'Genre': 'Drama, Drama/Religion', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Kurt Fuller, Michael Guido, Giancarlo Giannini, Dale Calandra, Keith Giglio, Marc Grapey, Brad Mirman, F. Murray Abraham, Matt Zeigler, Eddie Bo Smith Jr., Tony Goldwyn, Rich Komenich, Colleen Camp, Joseph F. Girzone, Jon Purdy, Stacy EdwardsKurt Fuller, Michael Guido, Giancarlo Giannini, Dale Calandra, Keith Giglio, Marc Grapey, Brad Mirman, F. Murray Abraham, Matt Zeigler, Eddie Bo Smith Jr., Tony Goldwyn, Rich Komenich, Colleen Camp, Joseph F. Girzone, Jon Purdy, Stacy Edwards   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'LGT13483DVD', 'Director': 'Jon Purdy', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'October 22, 2002', 'Actors': 'Tony Goldwyn, F. Murray Abraham, Kurt Fuller, Stacy Edwards, Giancarlo Giannini', 'Studio': 'Lionsgate', 'Writers': 'Brad Mirman, Joseph F. Girzone, Keith Giglio', 'Number of discs': '1'}\nOne of the most moving movies that changed my life and gave me my faith back. Do yourself a favor and watch this. You will over and over again. The most wonderful movie and the message it sends really hits home.\nReview of Joshua\n{'Subtitles': ['None available'], 'Directors': ['Frederick E.O. Toye', 'Chris Fisher', 'Paul Holahan', 'Scott Lautanen', 'Rod Holcomb', 'Michael Fields', 'John T. Kretchmer', 'Dennis Smith', 'James Whitmore Jr.', 'David Barrett'], 'Producers': ['Not Specified'], 'Starring': [\"Alex O'Loughlin\", 'Sophia Myles', 'Jason Dohring'], 'Studio': ['CBS']}\nbest show ever want to watch again when available luv luv\nmoonlite tv series",
  "actual_interaction": {
    "rating": 5.0,
    "title": "moonlite tv series",
    "text": "best show ever want to watch again when available luv luv",
    "images": [],
    "asin": "B000WHIIOQ",
    "parent_asin": "B000WHIIOQ",
    "user_id": "AGOLC6PSBLADO4RSCY72J7FK4SPQ",
    "timestamp": "2021-02-02 16:12:04.972000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.6,
    "rating_number": 412,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/964f39cb462b7145d827a950ce67706fbc260dcfbbd03185ff74b1512bd4c828._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/964f39cb462b7145d827a950ce67706fbc260dcfbbd03185ff74b1512bd4c828._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/964f39cb462b7145d827a950ce67706fbc260dcfbbd03185ff74b1512bd4c828._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/964f39cb462b7145d827a950ce67706fbc260dcfbbd03185ff74b1512bd4c828._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/964f39cb462b7145d827a950ce67706fbc260dcfbbd03185ff74b1512bd4c828._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/964f39cb462b7145d827a950ce67706fbc260dcfbbd03185ff74b1512bd4c828._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Subtitles": [
        "None available"
      ],
      "Directors": [
        "Frederick E.O. Toye",
        "Chris Fisher",
        "Paul Holahan",
        "Scott Lautanen",
        "Rod Holcomb",
        "Michael Fields",
        "John T. Kretchmer",
        "Dennis Smith",
        "James Whitmore Jr.",
        "David Barrett"
      ],
      "Producers": [
        "Not Specified"
      ],
      "Starring": [
        "Alex O'Loughlin",
        "Sophia Myles",
        "Jason Dohring"
      ],
      "Studio": [
        "CBS"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}