{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Messy Bun Hair Piece Scrunchy Hair Extensions Tousled Updo Ponytail With Synthetic Hair Elastic Rubber Band Accessories Light Warm Brown\nReview Date: 2020/09/01\nStore: Aileam\nAverage Rating: 3.4\nProduct Details: {'Package Dimensions': '4.3 x 4.2 x 1.2 inches; 0.49 Ounces', 'UPC': '780682649574'}\nReview Text: This messy bun hair piece does look exactly like the additional photos in the add. However, it doesn’t look anything like the woman’s hair in the main/first picture. I snapped some photos of me wrapping it around my bun and then just adding it to a “messy bun”. If you want more volume it definitely works! I didn’t quite get the right color so it doesn’t work perfectly for me. It’s hard to pick a color on a screen but it wasn’t too far off. If you are doing a lot of zoom meetings this can help add some volume and change up your look. Since the cameras aren’t extremely clear it definitely would pass for me as part of my bun. It came with a fun colorful hair tie and some Bobby pins.\nReview Title: Adds volume. Try to match your color.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Amtidy Solid Color Vintage Modern Style Elastic Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nAmtidy\n{'Material': 'Rubber', 'Fabric Type': 'Elastic', 'Brand': 'Amtidy', 'Item Form': 'Spiral', 'Unit Count': '10.00 Count', 'Package Dimensions': '11.65 x 5.63 x 3.23 inches; 12.03 Ounces', 'UPC': '782931993780'}\nThese headbands are really nice quality. They are like women’s stocking or tights fabric. The colors are very vibrant and the bands are stitched so the knot stays in place. I can’t quite figure out how to style them but overall they are cute, great quality, and good value.<br />If you found this review helpful please click “helpful” below. Thank you.\nVibrant colors, soft, good quality.\nMessy Bun Hair Piece Scrunchy Hair Extensions Tousled Updo Ponytail With Synthetic Hair Elastic Rubber Band Accessories Light Warm Brown\nAileam\n{'Package Dimensions': '4.3 x 4.2 x 1.2 inches; 0.49 Ounces', 'UPC': '780682649574'}\nThis messy bun hair piece does look exactly like the additional photos in the add. However, it doesn’t look anything like the woman’s hair in the main/first picture. I snapped some photos of me wrapping it around my bun and then just adding it to a “messy bun”. If you want more volume it definitely works! I didn’t quite get the right color so it doesn’t work perfectly for me. It’s hard to pick a color on a screen but it wasn’t too far off. If you are doing a lot of zoom meetings this can help add some volume and change up your look. Since the cameras aren’t extremely clear it definitely would pass for me as part of my bun. It came with a fun colorful hair tie and some Bobby pins.\nAdds volume. Try to match your color.",
  "profile": "**User Profile Summary:**\n\n- **Product Interest:** The user consistently focuses on fashion accessories, particularly hair adornments suited for special occasions such as weddings and parties, while also exploring practical items for everyday use, including hair pieces that enhance hairstyles for virtual meetings.\n- **Quality Appreciation:** Values high-quality materials and craftsmanship, as indicated by an emphasis on good quality and vibrant colors in their reviews. They notice discrepancies in product expectations based on visuals.\n- **Price Sensitivity:** Considers value for money important, often commenting on the good value ratio of products, highlighting a balance between cost and functionality.\n- **Style Exploration:** Demonstrates a willingness to experiment with styles despite occasional uncertainty, reflecting an ongoing interest in personal aesthetics and enhancing appearances for various contexts, including social and professional settings.\n- **Engagement Behavior:** Actively participates in product reviews, sharing personal experiences and tips, such as color matching advice, and expresses a helpful attitude towards other shoppers, fostering a sense of community engagement within the shopping experience.\n\nOverall, this user maintains a preference for stylish, high-quality accessories while balancing affordability, practical applications, and community feedback to inform their shopping choices.",
  "metrics": {
    "rouge1_f": 0.20481927710843373,
    "rouge2_f": 0.020161290322580645,
    "rougeL_f": 0.09638554216867469,
    "meteor": 0.11629329082878222,
    "bleu1": 0.14863648477546548,
    "bleu2": 0.031998973386949126,
    "bleu3": 0.006180725861298478,
    "bleu4": 0.002719245085270608,
    "bertscore_precision": 0.3757461905479431,
    "bertscore_recall": 0.4234243333339691,
    "bertscore_f1": 0.3981630504131317
  }
}