{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: DNA vs. The Book of Mormon\nReview Date: 2008/04/16\nStore: Richard Southerton  (Actor),     Thomas Murphy  (Actor),     Joel Kramer  (Director),     Jeremy Reyes  (Director)    &                   1                  more   Format: DVD\nCategories: Movies & TV, Independently Distributed, Special Interests\nAverage Rating: 4.0\nProduct Details: {'Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Contributor': 'Thomas Murphy, Richard Southerton, Jeremy Reyes, Joel Kramer', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '49 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Director': 'Joel Kramer, Jeremy Reyes', 'Media Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Run time': '49 minutes', 'Release date': 'February 1, 2003', 'Actors': 'Richard Southerton, Thomas Murphy', 'Studio': 'Living Hope Ministries', 'Number of discs': '1'}\nReview Text: I am glad that this was made to show  Mormons that DNA research shows where Native American roots really come from.\nReview Title: interesting\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Tess of the d'Urbervilles\nJustine Waddell  (Actor),     Jason Flemyng  (Actor),     Ian Sharp  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Justine Waddell. The poignant story of the beautiful Tess, who fights for love and personal happiness in the face of adversity. 1998/color/3 hrs/NR/fullscreen.', 'Amazon.com', 'No one does tragedies as well as Thomas Hardy, and this new BBC production of his', '1891 novel', \"is a peach. Tess is a teenager captured between happiness with an educated man (Oliver Milburn) and a dreadful existence with a scheming aristocrat (Jason Flemyng). Compared to Roman Polanski's 1980 Oscar-winning film\", 'Tess', \", the BBC version is far more interested in Hardy's text than in directorial exportations. Hence, the famous strawberry scene in which the aristocrat seduces the young Tess is just long enough to plumb the emotions; Polanski's version made the scene into a miniature classic of innocence and seduction. Both versions are worth seeing.\", \"Star Justine Waddell gives Tess more pluck and less innocence than Natassja Kinski does. She makes Tess a character to root for, which can lead to your own tragedy when working through Hardy's tale. The film doesn't have the drop-dead gorgeousness of Polanski's version but is quite beautiful. Director Ian Sharp keeps in line with Hardy's affection for rural settings and vistas. Flemyng is such a great cad it leads one to wonder what he might have done with Billy Zane's role in\", 'Titanic', '. Another winning adaptation of a classic from the BBC.', '--Doug Thomas']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.52 Ounces', 'Director': 'Ian Sharp', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '3 hours', 'Release date': 'March 25, 2003', 'Actors': 'Justine Waddell, Jason Flemyng, Oliver Milburn, John McEnery, Lesley Dunlop', 'Producers': 'Delia Fine, Sally Head, Sarah Wilson', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'A&E Home Video', 'Writers': 'Ted Whitehead, Thomas Hardy', 'Number of discs': '1'}\nThis version is soooooooooooo much better than the polanski one that one was boring this Tess has much better acting and is much more interesting. One day I was in the mood to watch this with my hubby at the starting of the film my sister& mother & niece came over they(all of them including hubby who has never seen it before ended up on really getting into it my mom was even talking about it the next day( if you knew my mother she is not that type of person) it is really  a good movie\nThis is one good movie\nAll the King's Men\nSean Penn  (Actor),     Jude Law  (Actor),     Steve Zaillian  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Oscar(r)-winning actor Sean Penn (Best Actor, Mystic River, 2003), two-time Academy Award(r) nominee Jude Law (Best Supporting Actor, The Talented Mr. Ripley, 1999; Best Actor, Cold Mountain, 2003), four-time Academy Award(r) nominee Kate Winslet (Best Supporting Actress, Sense and Sensibility, 1995; Iris, 2001, Best Actress, Titanic, 1997; Eternal Sunshine of the Spotless Mind, 2004), and Oscar(r) winner Anthony Hopkins (Best Actor, The Silence of the Lambs, 1991) star in this riveting story of a humble man's rise to political power and the destructive force of corruption and betrayal that would ultimately unravel his soul, based on Robert Penn Warren's 1946 classic Pulitzer Prize-winning novel. Willie Stark (Penn) is an ordinary man from a rural town, demanding that crooked politicians and shady businessmen in Lousiana be held accountable for the collapse of a poorly built school. Urged to run for Governor by a dubious political advisor, Tiny Duffy (three-time Emmy(r) Award winner\", 'Amazon.com', 'Sean Penn gives another powerhouse performance in', \"All the King's Men\", \", leading a topnotch cast in writer-director Steven Zaillian's underrated adaptation of the\", 'Pulitzer prize-winning 1946 novel', 'by Robert Penn Warren. When you consider that the previous', '1949 film version', \"earned well-deserved Academy Awards for director Robert Rossen and actors Broderick Crawford and Mercedes McCambridge, it's no surprise that Zaillian's film was expected to earn similar acclaim, but lukewarm critical reception and disappointing box-office gave it the stigma of a noble failure. And while the film (which moves Warren's story from the Depression-era '30s to the early 1950s) suffers from uneven pacing, partial miscasting, and an occasional lack of dramatic tension, it still qualifies as a first-class production that resonates with the timeless relevance of Warren's piercing political classic. Like Broderick before him, Penn is riveting as Louisiana governor Willie Stark, an upstart political dynamo (freely inspired by controversial real-life Louisiana governor Huey P. Long) whose rise to power is ultimately doomed by corruption and betrayal.\", \"Jude Law costars as political reporter Jack Burden, our firsthand witness to Stark's rise and inevitable fall; his orbit of political insiders includes a corrupt judge (Anthony Hopkins) with a dark secret to hide; a longtime friend (Mark Ruffalo) and former lover (Kate Winslet) who fall victim to Stark's influence; and political staffers (James Gandolfini, Patricia Clarkson) who remain powerless against Stark's ill-fated populist juggernaut. At Sean Penn's request, former child star Jackie Earle Haley (from the original\", 'Bad News Bears', ') makes a welcome return to movies as Willie Stark\\'s quietly intense bodyguard, \"Sugar-Boy.\" Coproduced by Louisiana-born political consultant James Carville, filmed on authentic Louisiana locations and boasting all the stately, luxurious production values of a would-be Oscar contender,', \"All the King's Men\", \"clearly benefits from Penn's fiery performance and Zaillian's earnest embrace of Warren's still-potent subject matter. And while the film's shortcomings may have prevented it from achieving unanimous acclaim, this is still a serious, well-crafted drama with much to say about the insidious potential for fascism in America, especially when well-meaning politicians lose their souls to power.\", '--Jeff Shannon', 'On the DVD', 'The special features that accompany', \"All the King's Men\", 'further demonstrate the film\\'s in-production status as a potential classic. While the \"making of\" featurette is perfunctory at best, the other featurettes are definitely worthwhile despite Sean Penn\\'s conspicuous absence. In \"Shake Hands with the Devil,\" the film\\'s cast, producer, and writer-director Steven Zaillian discuss the timeless theme of political corruption; \"An American Classic\" is a concise profile of Robert Penn Warren, paying tribute to the poet and author\\'s literary achievements; and \"The Legend and Lore of Huey Long\" examines the life and legacy of the still-beloved governor who won the hearts of working-class Louisianans while falling prey to his own ambition. \"LA Confidential\" is a brief featurette about the film\\'s use of authentic Louisiana locations and the positive effect they had on cast and crew; three deleted scenes were obviously cut from the film for purposes of time, yet offer ample proof of Zaillian\\'s established skill as one of Hollywood\\'s top screenwriters; and the alternate ending extends beyond the film\\'s final shot, with a funeral scene that serves as a melancholy (and ultimately unnecessary) coda to the film\\'s Greek-tragic drama.', '--Jeff Shannon']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '043396114364', 'Director': 'Steve Zaillian', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'December 19, 2006', 'Actors': 'Sean Penn, Jude Law, Kate Winslet, Anthony Hopkins, James Gandolfini', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Steven Zaillian, Ken Lemberger, Mike Medavoy, Arnold Messer', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI saw this at my sister's house she tends to buy DVDs she has never seen before just because she likes the actors but after she & I watch this she wished she had not bought it. It was boring.\nBORING\nCaillou - Caillou's World of Wonder\n.  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"Join Caillou in four fun adventures! In Caillou the Magnificent Caillou makes Rosie disappear and becomes the King of the Castle! In Caillou the Musician Caillou leads the marching band and sings with a friend! In Caillou the Sports Star Caillou realizes he's getting stronger every day and that it is okay to need his training wheels. In Caillou the Explorer Caillou imagines playing with the penguins and searching out alligators.\"]\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Contributor': 'N/a, .', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.34 x 7.58 inches; 2.72 Ounces', 'Item model number': '884857', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 8, 2006', 'Studio': 'PBS', 'Number of discs': '1'}\nI don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nDon't recommed Caillou\nAlex Haley's Queen (DVD)\nJohn Erman  (Director),     Halle Berry  (Actor),     Ann-Margret  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Mini-DVD, Television\n[\"Alex Haley's Queen (DVD)\", \"“There are two sides to every story”, or so the saying goes. For best-selling author Alex Haley, one side was Roots – the towering chronicle tracing seven generations of his mother's family. The other side comes to the screen in Alex Haley's Queen, the remarkable history of a paternal side of the author's family. David L. Wolper (Roots, The Thorn Birds) is the executive producer of this acclaimed adaption of the story Haley was working on when he died. Oscar® and Emmy® winner Halle Berry plays Queen, daughter of a slave and a plantation owner. During the turbulent decades of the antebellum South, the Civil War, Reconstruction and beyond, she searches for a home in the two cultures of her heritage – and at times is shunned by both. But rejection and hate are no match for her unconquerable will. Ann-Margret, Danny Glover, Martin Sheen and Ossie Davis also star in this poignant, uplifting final chapter of the Haley legacy.\", ']]>']\n{'Genre': 'Documentary, Drama, Historical', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Sada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul WinfieldSada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul Winfield  See more', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Item model number': '403898855', 'Director': 'John Erman', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 43 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Halle Berry, Ann-Margret, Tim Daly, Danny Glover, Dennis Haysbert', 'Subtitles': 'English', 'Producers': 'David L. Wolper, Mark M Wolper, Bernard Sofronski', 'Studio': 'Studio Distribution Services', 'Writers': 'David Stevens, Alex Haley', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI love this movie I remember watching it when I was a teen I couldn't wait for the next episodes to watch it is really entertaining true story.\nFavorite Hallle Flick\nCaillou - Caillou the Creative\n.  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Join Caillou in four fun adventures! In Caillou the Artiste,Caillou makes something for Mommy and has a pizza party with Jeffrey and Jason. In Springtime for Caillou Caillou delivers his Valentines cards a special way. In Caillou Outdoors, Caillou helps Mommy make a scarecrow for the garden and discovers how much fun road trips can be. In Caillous Surprise, Caillou makes a cup for Mommy at Grandmas pottery class.']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.38 x 7.41 inches; 2.72 Ounces', 'Item model number': 'PBSDCAIU621DVD', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'May 1, 2007', 'Studio': 'PBS', 'Number of discs': '1'}\nI don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nBad role model\nCaillou's Holiday Movie [DVD]\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Caillou's First Full-Length Animated Movie! When winter comes to Caillou's house, this curious 4-year-old tackles all kinds of big boy activities like helping Daddy shovel snow, making holiday presents for his family and even discovering the traditions of other little boys and girls around the world! And when Caillou learns about the spirit of the holidays, your little one will follow right along! Kids love Caillou for his real-world perspective on the life of a preschooler. Moms love Caillou for being a friend with whom their children can identify. Filled with the excitement and anticipation of holiday happenings, kids of all ages will love celebrating the season with Caillou! More than 90 minutes of frosty fun and eight all-new songs, too!\", 'DVD Features:', 'Challenges:', 'Six Caillou challenges', 'Interviews:', 'Animated interview with Caillou', 'Other:', \"Two holiday songs; 'Twas the Night Before Christmas story\", 'Amazon.com', 'Celebrate the 12 days of Christmas with Caillou and his family. Caillou receives a special advent calendar from his parents to count down the days until Christmas, and each night Caillou and his parents open a flap to discover a new picture of a holiday celebration somewhere in the world. As the family talks about different Christmas traditions, Caillou learns that a young boy in Germany started the tradition of the Christmas tree, that English school children made the first Christmas cards, and that Christmas stockings (and shoes) figure prominently in holiday celebrations in France and Hungary. He also learns about Hanukkah and the lighting of the Menorah from his friend Leo. As Caillou and his family enjoy their own holiday traditions, they discover the universal importance of giving and sharing. Music, including eight original songs, abounds in this 73-minute program. Unlike more typical', 'Caillou', 'episodes, there are no animated segments focusing on the interactions between Teddy, Rexi, and Gilbert in this presentation nor does Caillou find much to whine about in this festive season. DVD extras include an interview with Caillou, a holiday sing-along, and six challenges. (Ages 2 to 6)', '--Tami Horiuchi']\n{'Genre': 'Kids & Family, Romance', 'Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Run time': '1 hour and 13 minutes', 'Release date': 'October 7, 2003', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nI don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nBad role model\nDNA vs. The Book of Mormon\nRichard Southerton  (Actor),     Thomas Murphy  (Actor),     Joel Kramer  (Director),     Jeremy Reyes  (Director)    &                   1                  more   Format: DVD\nMovies & TV, Independently Distributed, Special Interests\n{'Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Contributor': 'Thomas Murphy, Richard Southerton, Jeremy Reyes, Joel Kramer', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '49 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Director': 'Joel Kramer, Jeremy Reyes', 'Media Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Run time': '49 minutes', 'Release date': 'February 1, 2003', 'Actors': 'Richard Southerton, Thomas Murphy', 'Studio': 'Living Hope Ministries', 'Number of discs': '1'}\nI am glad that this was made to show  Mormons that DNA research shows where Native American roots really come from.\ninteresting",
  "profile": "The user has a strong affinity for dramatic narratives that explore themes of love, adversity, and human emotion, with a preference for quality adaptations of classic literature that emphasize storytelling and character development. Their previous experiences underscore a desire for engaging communal viewing, while recent insights reveal an increasingly discerning attitude towards film execution, particularly concerning pacing.\n\nIn a recent interaction, the user expanded their interests by purchasing a family-oriented film but maintained a critical perspective on character portrayal, especially about role modeling for children. Concerns were raised about negative traits attributed to the protagonist, indicating their heightened sensitivity to how narratives affect young audiences. This underscores their focus on narrative influence and ethical implications.\n\nFurthermore, the user’s latest engagement with a documentary-style film displays their interest in diverse storytelling formats. They still seek emotionally resonant dramas with thematic depth, while also evolving their exploration into educational and thought-provoking content. Their critiques on character development and pacing remain significant, reflecting a balanced approach to viewing that values both emotional impact and the moral considerations of character portrayal in narratives. This multifaceted perspective positions them as an engaged viewer seeking to understand the broader implications of storytelling across various genres.",
  "metrics": {
    "rouge1_f": 0.06910167818361303,
    "rouge2_f": 0.008561080013170892,
    "rougeL_f": 0.036854228364593615,
    "meteor": 0.021245528901862588,
    "bleu1": 3.590488793259247e-08,
    "bleu2": 1.2165622760534497e-08,
    "bleu3": 3.710169139655745e-09,
    "bleu4": 1.1535071628936747e-09,
    "bertscore_precision": 0.312757670879364,
    "bertscore_recall": 0.49246424436569214,
    "bertscore_f1": 0.38255780935287476
  }
}