{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Heart Guy, The: Series 1\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole Da Silva  (Actor),     Peter Salmon  (Director),     Jeremy Sims  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Gifted, but arrogant heart surgeon Hugh Knight (Rodger Corser, Glitch, The Doctor Blake Mysteries) leads a charmed life in Sydney. He believes his talent lets him live outside the rules—until an incident involving drugs and alcohol brings his world crashing down. Placed on probation and banned from performing surgery, Hugh is forced to retreat to his rarely-visited hometown of Whyhope in rural Australia. Working as a GP at an underfunded hospital under his no-nonsense new boss (Hayley McElhinney, The Babadook), Hugh struggles to re-acclimate to rural life. And his complicated family situation makes his fall from grace even worse. Between his politically-ambitious mother (Tina Bursill, Prisoner: Cell Block H), emotionally distant father (Steve Bisley, The Great Gatsby, Mad Max), and his ex-girlfriend Charlie (Nicole da Silva, Wentworth, Rush) now married to his younger brother, Hugh is constantly reminded why he left Whyhope. Can he start afresh with a clean slate or will his bad-boy tendencies end his medical career for good?']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Tina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe BaylissTina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe Bayliss   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Peter Salmon, Jeremy Sims, Kriv Stenders', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 9 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Rodger Corser, Nicole Da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nReview Text: Arrived in excellent condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "800 Words : Season 1 [Blu-ray]\nPino Amenta  (Director),     Mike Smith  (Director),     Erik Thomson  (Actor),     Melina Vidler  (Actor)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Successful newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) has his world turned upside down when his wife suddenly dies. Looking for a fresh start, George packs up and moves his two teenaged children, Shay (Melina Vidler) and Arlo (Benson Jack Anthony), from the bustle of Sydney to the picturesque seaside town of Weld, New Zealand. But the Turners’ new life doesn’t go as planned when they face a series of setbacks and meet the eccentric townsfolk, including handyman Woody (Rick Donald, Friends with Better Lives) and the “women of Weld”—four single ladies who are intrigued by the handsome widower and his offspring. Hailed for its “warmth and inclusiveness” (The Australian), this award-winning series is a heartfelt comedy/drama about a family searching for healing in the midst of tragedy.']\n{'Genre': 'Drama/Television, Television', 'Format': 'Blu-ray', 'Contributor': 'James Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim BalmeJames Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim Balme   See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.82 Ounces', 'Director': 'Pino Amenta, Mike Smith', 'Media Format': 'Blu-ray', 'Run time': '6 hours and 3 minutes', 'Release date': 'January 23, 2020', 'Actors': 'Erik Thomson, Melina Vidler, Benson Jack Anthony, Rick Donald, Anna Jullienne', 'Producers': 'Chris Hampson', 'Studio': 'Acorn', 'Writers': 'James Griffin, Maxine Fleming, Tim Balme, Natalie Medlock', 'Number of discs': '2'}\nIt's a wonderful DVD, story.<br />Arrived in perfect condition.<br />Thank you\nGreat,funny story,excellently delivered and received when expected\n800 Words: Season 3 Part 1\nErik Thomson  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['As the award-winning dramedy returns, new challenges await newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) and his family, now settled in a charming New Zealand community after moving from Australia. Following last season\\'s harrowing boating accident, the townsfolk of Weld mount a search-and-rescue operation for the missing men, including the boyfriend of George\\'s daughter, Shay (Melina Vidler). Meanwhile, George anxiously considers the possibility of becoming a father again as his editor Jan (Bridie Carter, McLeod\\'s Daughters) goes into labor, but her twins\\' paternity is still unknown. Later, George\\'s teenage son, Arlo (Benson Jack Anthony), faces relationship problems, and George gets dragged into an elaborate scheme to help his friend Woody (Rick Donald, A Place to Call Home) out of a predicament that could ruin Woody\\'s forthcoming wedding. Set against the stunning scenery of the New Zealand coast, this \"amiable and touching\" (The New York Times) series also stars Emma Leonard (Home and Away), Michelle Langstone (The Almighty Johnsons), and Jonny Brugh (What We Do in the Shadows).']\n{'Genre': 'Drama/Television, Television', 'Contributor': 'Erik Thomson', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'February 20, 2020', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Release date': 'February 20, 2020', 'Actors': 'Erik Thomson', 'Studio': 'Acorn Media', 'Number of discs': '2'}\nArrived in exceptional condition  and when expected.\nFun story\nHeart Guy, The: Series 1\nRodger Corser  (Actor),     Nicole Da Silva  (Actor),     Peter Salmon  (Director),     Jeremy Sims  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Gifted, but arrogant heart surgeon Hugh Knight (Rodger Corser, Glitch, The Doctor Blake Mysteries) leads a charmed life in Sydney. He believes his talent lets him live outside the rules—until an incident involving drugs and alcohol brings his world crashing down. Placed on probation and banned from performing surgery, Hugh is forced to retreat to his rarely-visited hometown of Whyhope in rural Australia. Working as a GP at an underfunded hospital under his no-nonsense new boss (Hayley McElhinney, The Babadook), Hugh struggles to re-acclimate to rural life. And his complicated family situation makes his fall from grace even worse. Between his politically-ambitious mother (Tina Bursill, Prisoner: Cell Block H), emotionally distant father (Steve Bisley, The Great Gatsby, Mad Max), and his ex-girlfriend Charlie (Nicole da Silva, Wentworth, Rush) now married to his younger brother, Hugh is constantly reminded why he left Whyhope. Can he start afresh with a clean slate or will his bad-boy tendencies end his medical career for good?']\n{'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Tina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe BaylissTina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe Bayliss   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Peter Salmon, Jeremy Sims, Kriv Stenders', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 9 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Rodger Corser, Nicole Da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nArrived in excellent condition, wonderful story\nWonderful",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** Enjoys heartfelt comedy/drama narratives that explore themes of family, healing, personal growth, and community dynamics. Recently engaged with series featuring complex characters facing new challenges and emotional stories, highlighting a continued appreciation for emotional and relatable storytelling.\n\n- **Media Format:** Prefers physical media formats, particularly DVDs, for their collections, consistently seeking high-quality presentations.\n\n- **Quality Expectations:** Maintains high-quality content standards; recent purchases reflect a consistent tendency towards positive ratings, with an average rating of 5.0, showcasing satisfaction with product quality.\n\n- **User Feedback:** Typically provides positive feedback, especially noting product condition and timely delivery of purchases. This indicates a strong appreciation for reliable shopping experiences.\n\n- **Interests in Storytelling:** Attracted to narratives that delve into relationships and community interactions, balancing lightheartedness with meaningful storytelling. Engaged with series depicting relatable family dynamics and personal dilemmas, signaling a preference for complex character arcs.\n\n- **Community Engagement:** Exhibits a strong interest in character-driven plots involving community members, favoring narratives that emphasize social bonds within charming settings. Recent activity further underscores engagement with emotionally resonant stories that reflect personal challenges and community ties.",
  "metrics": {
    "rouge1_f": 0.11160318866253321,
    "rouge2_f": 0.010647737355811891,
    "rougeL_f": 0.051372896368467674,
    "meteor": 0.03788081662718515,
    "bleu1": 0.0032909949034376157,
    "bleu2": 0.0009327472549456705,
    "bleu3": 0.00015671941022503633,
    "bleu4": 6.43060411364974e-05,
    "bertscore_precision": 0.34543710947036743,
    "bertscore_recall": 0.447586327791214,
    "bertscore_f1": 0.389932781457901
  }
}