{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/11/08\nAverage Rating: 4.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Fenton Bailey', 'Randy Barbato'], 'Producers': ['Fenton Bailey', 'Randy Barbato', 'John Hoffman', 'Harry Knapp', 'Sheila Nevins', 'Gabriel Rotello', 'Thairin Smothers'], 'Starring': ['RuPaul', 'Tammy Faye Bakker', 'Virginia Fairchild'], 'Studio': ['Lionsgate']}\nReview Text: Just so sad! Interesting way of telling a story, for sure. Too entertaining at some points but tried to look beyond that as I loved Tammy Faye, the real one underneath the showiness which was just her way.\nReview Title: Just so sad! Interesting way of telling a story\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Shattered Trust: The Shari Karney Story\nFormat: DVD\nMovies & TV, Movies\n{'Aspect Ratio': '1.33:1', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Number of discs': '1'}\nVery informative. It was a good movie. I was with Melissa Gilbert in every situation that came up.  This is a movie everyone should see, including predators so they find out what they are in for. Didn't give 5 stars only because some situations I feel needed a little more details and finishing out some of them.  Just my own opinion others may think it is fine the way it is.\nIt was a good movie. I was with Melissa Gilbert in every ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Yates'], 'Producers': ['Peter Yates', 'Ruth Biswell'], 'Starring': ['Albert Finney', 'Matt Keeslar', 'Victoria Smurfit'], 'Studio': ['WARNER BROS.']}\nIT JUST STUNK and I never finished it.\nOne Star\nThe Missing & The Three Burials of Melquiades Estrada\nTommy Lee Jones  (Actor, Director),     Barry Pepper  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['The Missing/The Three Burials of Melquiades Estrada (DVD, 2009, 2-Disc Set) (DVD, 2009)']\n{'Format': 'Multiple Formats, NTSC, Color, Subtitled', 'Contributor': 'Levon Helm, Julio Cedillo, Ignacio Guadalupe, Guillermo Arriaga, Cecilia Surez, Melissa Leo, January Jones, Dwight Yoakam, Vanessa Bauche, Mel Rodriguez, Barry Pepper, Irineo Alvarez, Tommy Lee JonesLevon Helm, Julio Cedillo, Ignacio Guadalupe, Guillermo Arriaga, Cecilia Surez, Melissa Leo, January Jones, Dwight Yoakam, Vanessa Bauche, Mel Rodriguez, Barry Pepper, Irineo Alvarez, Tommy Lee Jones   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1, 1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.48 x 5.31 x 0.55 inches; 4 Ounces', 'Director': 'Tommy Lee Jones', 'Media Format': 'Multiple Formats, NTSC, Color, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'December 29, 2009', 'Actors': 'Tommy Lee Jones, Barry Pepper, Dwight Yoakam, January Jones, Julio Cedillo', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Guillermo Arriaga', 'Number of discs': '1'}\ntoo much violence and emotional charging for this old girl. &#34;Missing&#34;, just couldn't get into it.\nTwo Stars\n{'Subtitles': ['None available'], 'Directors': ['Fenton Bailey', 'Randy Barbato'], 'Producers': ['Fenton Bailey', 'Randy Barbato', 'John Hoffman', 'Harry Knapp', 'Sheila Nevins', 'Gabriel Rotello', 'Thairin Smothers'], 'Starring': ['RuPaul', 'Tammy Faye Bakker', 'Virginia Fairchild'], 'Studio': ['Lionsgate']}\nJust so sad! Interesting way of telling a story, for sure. Too entertaining at some points but tried to look beyond that as I loved Tammy Faye, the real one underneath the showiness which was just her way.\nJust so sad! Interesting way of telling a story",
  "profile": "**User Profile Summary**\n\n- **Media Preferences**: The user continues to appreciate movies with strong narratives and informative content that address serious themes. Recent interactions reveal a continued fascination with storytelling techniques, particularly those that blend entertainment with emotional depth and personal insight. However, there’s a growing expectation for films to deliver on both narrative quality and emotional resonance.\n\n- **Rating Tendencies**: The user frequently rates films around 4 stars, signaling a commitment to quality. The recent engagement reflects a nuanced appreciation of storytelling, occasionally leading to higher ratings when execution captivates, despite some narrative elements being overly entertaining. \n\n- **Emotional Engagement**: The user remains deeply engaged with characters and storylines but is increasingly critical of films that fail to sustain emotional investment. This suggests a strategic approach to enjoyment, weighing entertainment against authenticity.\n\n- **Educational Value**: The user values films that provoke thought and illuminate social issues, maintaining a critical lens on narratives that do not effectively convey their message or theme. \n\n- **Subject Matter Interest**: Continued interest in biographical adaptations and personal struggles persists, bolstered by a keener sensitivity to storytelling quality and execution.\n\n- **Constructive Critique**: The user exhibits balanced feedback and a willingness to recognize storytelling flaws. This acute sensitivity indicates a progression toward disengagement from films that do not meet their heightened narrative standards.\n\nOverall, the user prioritizes meaningful cinema that intertwines educational value with entertainment while becoming progressively discerning about storytelling quality.",
  "metrics": {
    "rouge1_f": 0.14055636896046853,
    "rouge2_f": 0.0029368575624082235,
    "rougeL_f": 0.07613469985358712,
    "meteor": 0.06324404761904762,
    "bleu1": 0.04890837478403588,
    "bleu2": 0.012649619351165434,
    "bleu3": 0.00235930338822812,
    "bleu4": 0.0010197868891901585,
    "bertscore_precision": 0.33284762501716614,
    "bertscore_recall": 0.396920382976532,
    "bertscore_f1": 0.3620712459087372
  }
}