{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/10/28\nAverage Rating: 4.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Victor Fleming'], 'Producers': ['Mervyn LeRoy', 'Arthur Freed'], 'Starring': ['Judy Garland', 'Frank Morgan', 'Ray Bolger'], 'Studio': ['WARNER BROS.']}\nReview Text: It was fun to be able to rent this to watch during a family trip. Nice and nostalgic and great to share with my little girl!\nReview Title: Classic\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Subtitles': ['None available'], 'Directors': [\"Darragh O'Connell\", 'Timothy Björklund'], 'Producers': ['Kate Boutilier', 'Eryk Casemiro', 'Patricia Resnick', 'Cathal Gaffney', 'Gillian Higgins', 'Karen Ialacci', 'Megan Laughton', 'Diana Manson'], 'Starring': ['Olivia']}\nReally wish this show was still on the air! It's clever in a way that makes me laugh almost as much as my daughter. Adorable!\nOlivia is adorable\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'David Evans', 'Philip John', 'Andy Goddard', 'Catherine Morshead', 'Minkie Spiro', 'Brian Kelly', 'Michael Engler', 'Ben Bolt', 'Ashley Pearce'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nI didn't really understand the hoopla surrounding this show. From the outside it just looked like a show about a bunch of stuffy nobles, but one episode and I was hooked! Great show!\nNow I get it...\nThe Little Mermaid (Two-Disc Diamond Edition: Blu-ray / DVD + Digital Copy)\nJodi Benson  (Actor),     Christopher Daniel Barnes  (Actor),     Ron Clements  (Director, Writer),     John Musker  (Director, Writer)    &                   1                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Kids & Family\n['THE LITTLE MERMAID, one of the most celebrated animated films of all time, is now spectacularly transformed for the first time on Blu-ray, with a state-of-the-art digitally restored picture and brilliant high-definition sound! Venture under the sea where Ariel, a free-spirited mermaid princess, longs to be part of the human world. After bravely striking a bargain with Ursula, a sneaky sea witch, Ariel embarks on the adventure of a lifetime. With Flounder and Sebastian at her side, Ariel will need all of her courage and determination to make things right in both her worlds.']\n{'Genre': 'Kids & Family, Action & Adventure', 'Format': 'AC-3, Blu-ray, Color, Multiple Formats, Dubbed, Dolby, Animated, DTS Surround Sound, NTSC, Subtitled, Widescreen, Digital_copyAC-3, Blu-ray, Color, Multiple Formats, Dubbed, Dolby, Animated, DTS Surround Sound, NTSC, Subtitled, Widescreen, Digital_copy   See more', 'Contributor': 'Buddy Hackett, Samuel E. Wright, Pat Carroll, Christopher Daniel Barnes, Edie McClurg, Jodi Benson, Ron Clements, Will Ryan, Kenneth Mars, Rene Auberjonois, John Musker, Paddi Edwards, Jason Marin, Ben WrightBuddy Hackett, Samuel E. Wright, Pat Carroll, Christopher Daniel Barnes, Edie McClurg, Jodi Benson, Ron Clements, Will Ryan, Kenneth Mars, Rene Auberjonois, John Musker, Paddi Edwards, Jason Marin, Ben Wright   See more', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Runtime': '1 hour and 23 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8.32 Ounces', 'Item model number': 'WD11171300BR', 'Director': 'Ron Clements, John Musker', 'Media Format': 'AC-3, Blu-ray, Color, Multiple Formats, Dubbed, Dolby, Animated, DTS Surround Sound, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 23 minutes', 'Release date': 'October 1, 2013', 'Actors': 'Jodi Benson, Christopher Daniel Barnes, Rene Auberjonois, Pat Carroll, Paddi Edwards', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Ron Clements, John Musker', 'Number of discs': '2'}\nBought a few of these for Christmas gifts and one for my own daughter. Looks great and still as fun as it was when I was a kid! Some of the best Disney songs ever in this film.\nWho doesn't love The Little Mermaid?\nEveryone's Hero\nJake T. Austin  (Actor),     Brian Dennehy  (Actor),     Christopher Reeve  (Director),     Colin Brady  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\n['Product Description', \"Ten-year-old baseball fanatic Yankee Irving (voiced by newcomer Jake T. Austin) is always the last one picked for sandlot baseball games. But when Babe Ruth's prized bat is stolen during the 1932 World Series, Yankee steps up to the plate to help retrieve it for his beloved idol. He embarks on a wild cross-country journey that teaches him the stuff real heroes are made of, and along the way, Yankee learns the importance of perseverance and the true meaning of friendship.\", 'Amazon.com', 'A talking baseball and a talking bat might not be the most likely characters to inspire a personal revelation about perseverance and self-esteem, but in', \"Everyone's Hero\", 'it\\'s just those two things that help young Yankee Irving (Jake T. Austin) overcome his reputation as a baseball loser and become a true American hero. A ten-year old spurned by the neighborhood kids because of his repeated strike-outs at bat, Yankee is at a point of personal crisis. A chance encounter with a talking foul ball named Screwie (Rob Reiner) and some time spent with his father (Mandy Patinkin), who\\'s a janitor for the New York Yankees, gives Yankee cause for some serious reflection. When Babe Ruth\\'s famous bat \"Darlin\\'\" (Whoopi Goldberg) is stolen by opposing teammate Lefty Maginnis (William H. Macy) and Yankee\\'s father is fired as a result of the theft, it suddenly falls to Yankee and his new friend Screwie to find Darlin\\' and return her to Babe Ruth before the Chicago Cubs loose the final game of the World Series to the New York Yankees. The combined efforts of Screwie, Darlin\\', and new friend Marti Brewster (Raven-Symoné) aid Yankee in conquering his own self-doubt and infuse him with the self-confidence and strength to profoundly affect both his family and the entire baseball world. Produced by Christopher Reeve, this CGI animated presentation features a great cast of characters and voice talent, and an important message about the power of perseverance. (Ages 5 and older) --', 'Tami Horiuchi', 'Beyond', \"Everyone's Hero\", \"Everyone's Hero: The Movie Storybook (Paperback)\", 'More Sports-Themed Family Films', 'Nothing is Impossible: Reflections on a New Life', 'by Christopher Reeve', 'Stills from', \"Everyone's Hero\"]\n{'Genre': \"Children's\", 'Format': 'Multiple Formats, AC-3, Color, Animated, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Colin Brady, Robert Kurtz, Ralph Coppola, Brian Dennehy, Whoopi Goldberg, Raven-Symon, Ritchie Allen, Jason Harris, Ed Helms, Howard Jonas, Robert Wagner, Cherise Boothe, Jesse Bronstein, Jeff Hand, Christopher Reeve, Rob Reiner, Jake T. Austin, Dan St. PierreColin Brady, Robert Kurtz, Ralph Coppola, Brian Dennehy, Whoopi Goldberg, Raven-Symon, Ritchie Allen, Jason Harris, Ed Helms, Howard Jonas, Robert Wagner, Cherise Boothe, Jesse Bronstein, Jeff Hand, Christopher Reeve, Rob Reiner, Jake T. Austin, Dan St. Pierre  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 2.4 Ounces', 'Item model number': '886377', 'Director': 'Christopher Reeve, Colin Brady, Dan St. Pierre', 'Media Format': 'Multiple Formats, AC-3, Color, Animated, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Jake T. Austin, Brian Dennehy, Whoopi Goldberg, Ritchie Allen, Rob Reiner', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Writers': 'Howard Jonas, Jeff Hand, Robert Kurtz', 'Number of discs': '1'}\nI'm not sure why this got such bad cinematic reviews. My daughter thinks it's hysterical and she loves watching it with her grandpa, who is an umpire!\nCute little baseball movie\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lawrence Trilling', 'Patrick R. Norris', 'Michael Weaver', 'Allison Liddi-Brown', 'Ken Whittingham', 'Adam Davidson', 'Jessica Yu', 'Jason Katims', 'Dylan K. Massin', 'Peter Krause'], 'Starring': ['Peter Krause', 'Lauren Graham', 'Dax Shepard'], 'Studio': ['NBC']}\nI just started watching this series and am so glad it's on Prime, since I am totally late to discover this one. You care about the characters and what happens to them, all though it does get slow sometimes. There's nothing super earth-shattering in the plot line, but you do appreciate the small details in the conversations and scenarios, especially as a parent.\nI shoulda gotten on the bandwagon sooner\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lawrence Trilling', 'Patrick R. Norris', 'Michael Weaver', 'Allison Liddi-Brown', 'Ken Whittingham', 'Adam Davidson', 'Jessica Yu', 'Jason Katims', 'Dylan K. Massin', 'Peter Krause'], 'Starring': ['Peter Krause', 'Craig T. Nelson', 'Lauren Graham'], 'Studio': ['NBC']}\nThe first season took awhile to build some momentum, and things are rolling in the second season. Wish I would have started this series earlier! Great music too.\nGreat sophomore season\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lawrence Trilling', 'Patrick R. Norris', 'Michael Weaver', 'Allison Liddi-Brown', 'Ken Whittingham', 'Adam Davidson', 'Jessica Yu', 'Jason Katims', 'Dylan K. Massin', 'Peter Krause'], 'Starring': ['Peter Krause', 'Lauren Graham', 'Dax Shepard'], 'Studio': ['NBC']}\nAs the characters continue to develop, each season gets richer. So glad to have this as a Prime option! Already excited to stream Season 5 when it becomes available on Prime!\nGets better and better\nGirl Most Likely\nComedy, Drama, Joyous, Touching\n['Kristen Wiig stars in this sweet and funny movie about a failed playwright who returns home to her eccentric mother (Annette Bening) and a house of full of oddballs in order to get her career-and her life-back on track. Matt Dillon and Darren Criss costar in this comedy most likely to make you laugh out loud!']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Shari Springer Berman', 'Robert Pulcini'], 'Producers': ['Mark Amin', 'Alix Madigan (Alix Madigan-Yorkin)', 'Celine Rattray', 'Trudie Styler'], 'Starring': ['Kristen Wiig', 'Darren Criss', 'Matt Dillon']}\nIt's an odd little movie. Not horrible but not the best. As always, Kristen Wiig is lovable and you pull for her character.\nQuirky, not for everyone\n{'Subtitles': ['None available'], 'Directors': ['Victor Fleming'], 'Producers': ['Mervyn LeRoy', 'Arthur Freed'], 'Starring': ['Judy Garland', 'Frank Morgan', 'Ray Bolger'], 'Studio': ['WARNER BROS.']}\nIt was fun to be able to rent this to watch during a family trip. Nice and nostalgic and great to share with my little girl!\nClassic",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preferences:** The user continues to enjoy clever, family-friendly programming with a fondness for classic films that evoke nostalgia. Their appreciation for stylistic quirks and offbeat humor persists, particularly in storytelling that engages all ages.\n\n- **Viewership Patterns:** Recent engagements reflect a strong interest in narratives showcasing character development, especially those exploring family dynamics. The user values the blend of lightheartedness and deeper themes, indicating a growing openness to complex storytelling.\n\n- **Emotional Engagement:** Their recent interactions underscore a heightened appreciation for character growth, particularly within familial contexts. This emphasis on emotional depth and relatable family relationships signifies a desire for narratives that resonate across generations.\n\n- **Sentiment Analysis:** The user's positivity is combined with a more discerning outlook, favoring narratives that evoke joy and quirkiness. Their nuanced taste is evident in their ratings, which prioritize quality storytelling that entertains both children and adults.\n\n- **Younger Audience Appeal:** While maintaining a focus on family-oriented content for younger viewers, the user increasingly seeks narratives that incorporate mature themes and unique humor, reflecting a desire for shared enjoyment across different audience segments.\n\nIn summary, the user exemplifies a sophisticated blend of nostalgia-driven family entertainment and intricate, character-driven storytelling with a penchant for quirky and engaging narratives.",
  "metrics": {
    "rouge1_f": 0.09143457698370992,
    "rouge2_f": 0.003156233561283535,
    "rougeL_f": 0.04729374671571203,
    "meteor": 0.025515673913975724,
    "bleu1": 5.057890369588998e-05,
    "bleu2": 1.0743306937414247e-05,
    "bleu3": 1.8767166424609795e-06,
    "bleu4": 7.851435740199829e-07,
    "bertscore_precision": 0.339473694562912,
    "bertscore_recall": 0.4710994362831116,
    "bertscore_f1": 0.3945994973182678
  }
}