{
  "user_id": "AHJIG2OSUZ2B5J3J3XJNXBAZOTJA",
  "summary": "=== Purchase Information ===\nProduct Title: 800 Words : Season 1 [Blu-ray]\nReview Date: 2021/07/05\nStore: Pino Amenta  (Director),     Mike Smith  (Director),     Erik Thomson  (Actor),     Melina Vidler  (Actor)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['Successful newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) has his world turned upside down when his wife suddenly dies. Looking for a fresh start, George packs up and moves his two teenaged children, Shay (Melina Vidler) and Arlo (Benson Jack Anthony), from the bustle of Sydney to the picturesque seaside town of Weld, New Zealand. But the Turners’ new life doesn’t go as planned when they face a series of setbacks and meet the eccentric townsfolk, including handyman Woody (Rick Donald, Friends with Better Lives) and the “women of Weld”—four single ladies who are intrigued by the handsome widower and his offspring. Hailed for its “warmth and inclusiveness” (The Australian), this award-winning series is a heartfelt comedy/drama about a family searching for healing in the midst of tragedy.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Blu-ray', 'Contributor': 'James Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim BalmeJames Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim Balme   See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.82 Ounces', 'Director': 'Pino Amenta, Mike Smith', 'Media Format': 'Blu-ray', 'Run time': '6 hours and 3 minutes', 'Release date': 'January 23, 2020', 'Actors': 'Erik Thomson, Melina Vidler, Benson Jack Anthony, Rick Donald, Anna Jullienne', 'Producers': 'Chris Hampson', 'Studio': 'Acorn', 'Writers': 'James Griffin, Maxine Fleming, Tim Balme, Natalie Medlock', 'Number of discs': '2'}\nReview Text: It's a wonderful DVD, story.<br />Arrived in perfect condition.<br />Thank you\nReview Title: Great,funny story,excellently delivered and received when expected\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 800 Words: Season 3 Part 1\nReview Date: 2021/07/05\nStore: Erik Thomson  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: ['As the award-winning dramedy returns, new challenges await newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) and his family, now settled in a charming New Zealand community after moving from Australia. Following last season\\'s harrowing boating accident, the townsfolk of Weld mount a search-and-rescue operation for the missing men, including the boyfriend of George\\'s daughter, Shay (Melina Vidler). Meanwhile, George anxiously considers the possibility of becoming a father again as his editor Jan (Bridie Carter, McLeod\\'s Daughters) goes into labor, but her twins\\' paternity is still unknown. Later, George\\'s teenage son, Arlo (Benson Jack Anthony), faces relationship problems, and George gets dragged into an elaborate scheme to help his friend Woody (Rick Donald, A Place to Call Home) out of a predicament that could ruin Woody\\'s forthcoming wedding. Set against the stunning scenery of the New Zealand coast, this \"amiable and touching\" (The New York Times) series also stars Emma Leonard (Home and Away), Michelle Langstone (The Almighty Johnsons), and Jonny Brugh (What We Do in the Shadows).']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama/Television, Television', 'Contributor': 'Erik Thomson', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'February 20, 2020', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Release date': 'February 20, 2020', 'Actors': 'Erik Thomson', 'Studio': 'Acorn Media', 'Number of discs': '2'}\nReview Text: Arrived in exceptional condition  and when expected.\nReview Title: Fun story\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heart Guy, The: Series 1\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole Da Silva  (Actor),     Peter Salmon  (Director),     Jeremy Sims  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Gifted, but arrogant heart surgeon Hugh Knight (Rodger Corser, Glitch, The Doctor Blake Mysteries) leads a charmed life in Sydney. He believes his talent lets him live outside the rules—until an incident involving drugs and alcohol brings his world crashing down. Placed on probation and banned from performing surgery, Hugh is forced to retreat to his rarely-visited hometown of Whyhope in rural Australia. Working as a GP at an underfunded hospital under his no-nonsense new boss (Hayley McElhinney, The Babadook), Hugh struggles to re-acclimate to rural life. And his complicated family situation makes his fall from grace even worse. Between his politically-ambitious mother (Tina Bursill, Prisoner: Cell Block H), emotionally distant father (Steve Bisley, The Great Gatsby, Mad Max), and his ex-girlfriend Charlie (Nicole da Silva, Wentworth, Rush) now married to his younger brother, Hugh is constantly reminded why he left Whyhope. Can he start afresh with a clean slate or will his bad-boy tendencies end his medical career for good?']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Tina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe BaylissTina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe Bayliss   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Peter Salmon, Jeremy Sims, Kriv Stenders', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 9 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Rodger Corser, Nicole Da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nReview Text: Arrived in excellent condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 800 Words: Season 2 Part 2 [Blu-ray]\nReview Date: 2021/07/29\nStore: Erik Thomson  (Actor),     Melina Vidler  (Actor),     Mike Smith  (Director),     Michael Hurst  (Director)    &                   1                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['With his family back together, George Turner (Erik Thomson, Packed to the Rafters) and his kids, Shay and Arlo (Melina Vidler, Benson Jack Anthony), fall into the comfortable routine of life in the small, quirky New Zealand town of Weld. Arlo prepares for the new school term and tries to maintain a long-distance relationship, while Shay considers becoming an artist. George has a steady job writing for the local newspaper, and his budding relationship with Fiona (Michelle Langstone, The Almighty Johnsons) is the talk of the town. But shocking news from Jan (Bridie Carter, McLeod\\'s Daughters) threatens to turn George\\'s comfortable life upside down. This \"explicitly heartwarming family tale\" (The New York Times) also stars Rick Donald (A Place to Call Home), Emma Leonard (Home and Away), Anna Jullienne (The Blue Rose), and Ditch Davey (Spartacus: War of the Damned).']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Blu-ray', 'Contributor': 'James Griffin, Cian Elyse White, Michelle Langstone, Rick Donald, Mike Smith, Anna Jullienne, Erik Thomson, Benson Jack Anthony, Sarah-Kate Lynch, Emma Leonard, Caroline Bell-Booth, Kate McDermott, Melina Vidler, Michael Hurst, Michael Beran, Tim Balme, Chris BaileyJames Griffin, Cian Elyse White, Michelle Langstone, Rick Donald, Mike Smith, Anna Jullienne, Erik Thomson, Benson Jack Anthony, Sarah-Kate Lynch, Emma Leonard, Caroline Bell-Booth, Kate McDermott, Melina Vidler, Michael Hurst, Michael Beran, Tim Balme, Chris Bailey  See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Mike Smith, Michael Hurst, Caroline Bell-Booth', 'Media Format': 'Blu-ray', 'Run time': '6 hours and 7 minutes', 'Release date': 'February 6, 2020', 'Actors': 'Erik Thomson, Melina Vidler, Benson Jack Anthony, Rick Donald, Anna Jullienne', 'Producers': 'Chris Bailey', 'Studio': 'Acorn', 'Writers': 'Kate McDermott, Michael Beran, James Griffin, Sarah-Kate Lynch, Tim Balme', 'Number of discs': '2'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 800 Words: Season 3 Part 2\nReview Date: 2021/07/29\nStore: Erik Thomson  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: [\"Australian newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) and his family have settled into their lives in New Zealand, but things are far from calm in their small coastal town. Following the wedding of his friend Woody (Rick Donald, A Place to Call Home), George begins dating someone new, providing endless fodder for the gossiping townsfolk. George's teenagers face their own relationship issues as Shay (Melina Vidler) tries to get over her messy breakup, and Arlo (Benson Jack Anthony) becomes romantically involved with two girls at once. Later, the citizens of Weld fear that their town may be taken over by a neighboring community, and the Turners are rocked by revelations about the death of George's wife a few years earlier.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television', 'Contributor': 'Erik Thomson', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'February 20, 2020', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Release date': 'February 20, 2020', 'Actors': 'Erik Thomson', 'Studio': 'Acorn Media', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Heart Guy: Series 3\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole da Silva  (Actor),     Geoff Bennett  (Director),     Lucy Gaffy  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, TV\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Uli Latukefu, Ben Chessell, Tina Bursill, Nicole da Silva, Geoff Bennett, Matt Castley, Brittany Clark, Jennifer Leacey, Lucy Gaffy, Hayley McElhinney, Charles Wu, Steve Bisley, Belinda Bromilow, Rodger Corser, Ian Watson, Ryan Johnson, Chloe BaylissUli Latukefu, Ben Chessell, Tina Bursill, Nicole da Silva, Geoff Bennett, Matt Castley, Brittany Clark, Jennifer Leacey, Lucy Gaffy, Hayley McElhinney, Charles Wu, Steve Bisley, Belinda Bromilow, Rodger Corser, Ian Watson, Ryan Johnson, Chloe Bayliss  See more', 'Number Of Discs': '4', 'Runtime': '7 hours and 53 minutes'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heart Guy Series 4\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole da Silva  (Actor),     Erin White  (Director),     Geoff Bennet  (Director)    &                   1                  more   Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['After serving out his probation in his rural Australian hometown and saving the family farm, hotshot surgeon Hugh Knight (Rodger Corser, “The Doctor Blake Mysteries”) is flying high. Will Whyhope’s naughtiest doctor have the right stuff, or will he self-destruct and lose everything?']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Julietta Boscolo, Hayley McElhinney, Kriv Stenders, Erin White, Rodger Corser, Nicole da Silva, Geoff Bennet, Ryan Johnson, Lisa MatthewsJulietta Boscolo, Hayley McElhinney, Kriv Stenders, Erin White, Rodger Corser, Nicole da Silva, Geoff Bennet, Ryan Johnson, Lisa Matthews   See more', 'Number Of Discs': '3', 'Runtime': '8 hours and 4 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'AMP2828', 'Director': 'Erin White, Geoff Bennet, Julietta Boscolo, Kriv Stenders, Lisa Matthews', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 4 minutes', 'Release date': 'April 14, 2020', 'Actors': 'Rodger Corser, Nicole da Silva, Hayley McElhinney, Ryan Johnson', 'Studio': 'ACORN MEDIA', 'Number of discs': '3'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Heart Guy: Series 2\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole da Silva  (Actor),     Ian Watson  (Director),     Tori Garrett  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: ['As the hit Australian dramedy returns, hotshot surgeon Hugh Knight (Rodger Corser, The Doctor Blake Mysteries) continues to serve out his probation in his rural hometown, while his family faces struggles that could bring them closer together, or tear them apart.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Widescreen', 'Contributor': 'Ben Chessell, Tina Bursill, Tori Garrett, Kriv Stenders, Nicole da Silva, Matt Castley, Brittany Clark, Lucy Gaffy, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Ian Watson, Ryan Johnson, Chloe BaylissBen Chessell, Tina Bursill, Tori Garrett, Kriv Stenders, Nicole da Silva, Matt Castley, Brittany Clark, Lucy Gaffy, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Ian Watson, Ryan Johnson, Chloe Bayliss  See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'AMP2643', 'Director': 'Ian Watson, Tori Garrett, Kriv Stenders, Lucy Gaffy, Ben Chessell', 'Media Format': 'NTSC, Widescreen', 'Run time': '7 hours and 51 minutes', 'Release date': 'June 26, 2018', 'Actors': 'Rodger Corser, Nicole da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Crown: The Complete Seasons 1 & 2\nReview Date: 2021/07/29\nStore: Claire Foy  (Actor),     Matt Smith  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['Season 1 The British Empire is in decline, the political world is in disarray, and a young woman takes the throne... a new era is dawning. Queen Elizabeth II is a 25-year-old newlywed faced with the daunting prospect of leading the world’s most famous monarchy while forging a relationship with legendary Prime Minister Sir Winston Churchill. Golden Globe winner for Best TV Drama Series, “The Crown,” created by Peter Morgan, explores the Queen’s private journey behind the public facade with daring frankness.  Season 2 The Crown, created by Peter Morgan, follows Queen Elizabeth through the late 1950s and early ‘60s as she struggles to navigate a world that’s changing around her. She must face the challenges of a new era, from the Suez Canal crisis to the assassination of John F. Kennedy, while preserving both the monarchy and her marriage.']\nAverage Rating: 4.6\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7 x 5.6 x 2.2 inches; 13.62 Ounces', 'Run time': '1207 minutes', 'Actors': 'Claire Foy, Matt Smith, Vanessa Kirby', 'Subtitles': 'English, French, Spanish', 'Number of discs': '8'}\nReview Text: Arrived in perfect condition and wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Doc Martin Series 9\nReview Date: 2021/07/29\nStore: Martin Clunes  (Actor),     Caroline Catz  (Actor),     Nigel Cole  (Director),     Charlie Palmer  (Director)    &                   1                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['All is not well for brilliant but boorish Dr. Martin Ellingham (Martin Clunes, Manhunt) as the hit British dramedy returns. To Martin’s utter disgust, his medical practice remains under official scrutiny because of his pre-existing blood phobia, and he is forced to attend refresher courses starting with phlebotomy. His wife, Louisa (Caroline Catz, DCI Banks) and aunt Ruth (Emmy winner Eileen Atkins, Cranford) urge him to take this risk to his career seriously, but events conspire against him.  While Louisa focuses on her own job change and studies child psychology, she worries that their son, James, is becoming too much like his father, and decides James needs a sibling. As the other residents of picturesque Portwenn contend with love and life changes, Martin remains stuck in his ways. Can he appease the medical board or will his days as the village GP soon be at an end?']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy/Television, Television/British Television', 'Format': 'NTSC, Widescreen, Subtitled', 'Contributor': 'Ian McNeice, Martin Clunes, Caroline Catz, Eileen Atkins, Charlie Palmer, Nigel Cole', 'Number Of Discs': '3', 'Runtime': '6 hours and 2 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Nigel Cole, Charlie Palmer', 'Media Format': 'NTSC, Widescreen, Subtitled', 'Run time': '6 hours and 2 minutes', 'Release date': 'December 10, 2019', 'Actors': 'Martin Clunes, Caroline Catz, Ian McNeice, Eileen Atkins', 'Studio': 'ACORN MEDIA', 'Number of discs': '3'}\nReview Text: Doc Martin is totally enjoyable,  the story and acting are wonderful, and the landscape is like a travelogue/like being there!\nReview Title: Arrived in perfect condition and wonderful story\nRating: 5.0\n--------------------------------------------------",
  "reference": "800 Words : Season 1 [Blu-ray]\nPino Amenta  (Director),     Mike Smith  (Director),     Erik Thomson  (Actor),     Melina Vidler  (Actor)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Successful newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) has his world turned upside down when his wife suddenly dies. Looking for a fresh start, George packs up and moves his two teenaged children, Shay (Melina Vidler) and Arlo (Benson Jack Anthony), from the bustle of Sydney to the picturesque seaside town of Weld, New Zealand. But the Turners’ new life doesn’t go as planned when they face a series of setbacks and meet the eccentric townsfolk, including handyman Woody (Rick Donald, Friends with Better Lives) and the “women of Weld”—four single ladies who are intrigued by the handsome widower and his offspring. Hailed for its “warmth and inclusiveness” (The Australian), this award-winning series is a heartfelt comedy/drama about a family searching for healing in the midst of tragedy.']\n{'Genre': 'Drama/Television, Television', 'Format': 'Blu-ray', 'Contributor': 'James Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim BalmeJames Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim Balme   See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.82 Ounces', 'Director': 'Pino Amenta, Mike Smith', 'Media Format': 'Blu-ray', 'Run time': '6 hours and 3 minutes', 'Release date': 'January 23, 2020', 'Actors': 'Erik Thomson, Melina Vidler, Benson Jack Anthony, Rick Donald, Anna Jullienne', 'Producers': 'Chris Hampson', 'Studio': 'Acorn', 'Writers': 'James Griffin, Maxine Fleming, Tim Balme, Natalie Medlock', 'Number of discs': '2'}\nIt's a wonderful DVD, story.<br />Arrived in perfect condition.<br />Thank you\nGreat,funny story,excellently delivered and received when expected\n800 Words: Season 3 Part 1\nErik Thomson  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['As the award-winning dramedy returns, new challenges await newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) and his family, now settled in a charming New Zealand community after moving from Australia. Following last season\\'s harrowing boating accident, the townsfolk of Weld mount a search-and-rescue operation for the missing men, including the boyfriend of George\\'s daughter, Shay (Melina Vidler). Meanwhile, George anxiously considers the possibility of becoming a father again as his editor Jan (Bridie Carter, McLeod\\'s Daughters) goes into labor, but her twins\\' paternity is still unknown. Later, George\\'s teenage son, Arlo (Benson Jack Anthony), faces relationship problems, and George gets dragged into an elaborate scheme to help his friend Woody (Rick Donald, A Place to Call Home) out of a predicament that could ruin Woody\\'s forthcoming wedding. Set against the stunning scenery of the New Zealand coast, this \"amiable and touching\" (The New York Times) series also stars Emma Leonard (Home and Away), Michelle Langstone (The Almighty Johnsons), and Jonny Brugh (What We Do in the Shadows).']\n{'Genre': 'Drama/Television, Television', 'Contributor': 'Erik Thomson', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'February 20, 2020', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Release date': 'February 20, 2020', 'Actors': 'Erik Thomson', 'Studio': 'Acorn Media', 'Number of discs': '2'}\nArrived in exceptional condition  and when expected.\nFun story\nHeart Guy, The: Series 1\nRodger Corser  (Actor),     Nicole Da Silva  (Actor),     Peter Salmon  (Director),     Jeremy Sims  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Gifted, but arrogant heart surgeon Hugh Knight (Rodger Corser, Glitch, The Doctor Blake Mysteries) leads a charmed life in Sydney. He believes his talent lets him live outside the rules—until an incident involving drugs and alcohol brings his world crashing down. Placed on probation and banned from performing surgery, Hugh is forced to retreat to his rarely-visited hometown of Whyhope in rural Australia. Working as a GP at an underfunded hospital under his no-nonsense new boss (Hayley McElhinney, The Babadook), Hugh struggles to re-acclimate to rural life. And his complicated family situation makes his fall from grace even worse. Between his politically-ambitious mother (Tina Bursill, Prisoner: Cell Block H), emotionally distant father (Steve Bisley, The Great Gatsby, Mad Max), and his ex-girlfriend Charlie (Nicole da Silva, Wentworth, Rush) now married to his younger brother, Hugh is constantly reminded why he left Whyhope. Can he start afresh with a clean slate or will his bad-boy tendencies end his medical career for good?']\n{'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Tina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe BaylissTina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe Bayliss   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Peter Salmon, Jeremy Sims, Kriv Stenders', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 9 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Rodger Corser, Nicole Da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nArrived in excellent condition, wonderful story\nWonderful\n800 Words: Season 2 Part 2 [Blu-ray]\nErik Thomson  (Actor),     Melina Vidler  (Actor),     Mike Smith  (Director),     Michael Hurst  (Director)    &                   1                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['With his family back together, George Turner (Erik Thomson, Packed to the Rafters) and his kids, Shay and Arlo (Melina Vidler, Benson Jack Anthony), fall into the comfortable routine of life in the small, quirky New Zealand town of Weld. Arlo prepares for the new school term and tries to maintain a long-distance relationship, while Shay considers becoming an artist. George has a steady job writing for the local newspaper, and his budding relationship with Fiona (Michelle Langstone, The Almighty Johnsons) is the talk of the town. But shocking news from Jan (Bridie Carter, McLeod\\'s Daughters) threatens to turn George\\'s comfortable life upside down. This \"explicitly heartwarming family tale\" (The New York Times) also stars Rick Donald (A Place to Call Home), Emma Leonard (Home and Away), Anna Jullienne (The Blue Rose), and Ditch Davey (Spartacus: War of the Damned).']\n{'Genre': 'Drama/Television, Television', 'Format': 'Blu-ray', 'Contributor': 'James Griffin, Cian Elyse White, Michelle Langstone, Rick Donald, Mike Smith, Anna Jullienne, Erik Thomson, Benson Jack Anthony, Sarah-Kate Lynch, Emma Leonard, Caroline Bell-Booth, Kate McDermott, Melina Vidler, Michael Hurst, Michael Beran, Tim Balme, Chris BaileyJames Griffin, Cian Elyse White, Michelle Langstone, Rick Donald, Mike Smith, Anna Jullienne, Erik Thomson, Benson Jack Anthony, Sarah-Kate Lynch, Emma Leonard, Caroline Bell-Booth, Kate McDermott, Melina Vidler, Michael Hurst, Michael Beran, Tim Balme, Chris Bailey  See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Mike Smith, Michael Hurst, Caroline Bell-Booth', 'Media Format': 'Blu-ray', 'Run time': '6 hours and 7 minutes', 'Release date': 'February 6, 2020', 'Actors': 'Erik Thomson, Melina Vidler, Benson Jack Anthony, Rick Donald, Anna Jullienne', 'Producers': 'Chris Bailey', 'Studio': 'Acorn', 'Writers': 'Kate McDermott, Michael Beran, James Griffin, Sarah-Kate Lynch, Tim Balme', 'Number of discs': '2'}\nArrived in perfect condition, wonderful story\nWonderful\n800 Words: Season 3 Part 2\nErik Thomson  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n[\"Australian newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) and his family have settled into their lives in New Zealand, but things are far from calm in their small coastal town. Following the wedding of his friend Woody (Rick Donald, A Place to Call Home), George begins dating someone new, providing endless fodder for the gossiping townsfolk. George's teenagers face their own relationship issues as Shay (Melina Vidler) tries to get over her messy breakup, and Arlo (Benson Jack Anthony) becomes romantically involved with two girls at once. Later, the citizens of Weld fear that their town may be taken over by a neighboring community, and the Turners are rocked by revelations about the death of George's wife a few years earlier.\"]\n{'Genre': 'Drama/Television, Television', 'Contributor': 'Erik Thomson', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'February 20, 2020', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Release date': 'February 20, 2020', 'Actors': 'Erik Thomson', 'Studio': 'Acorn Media', 'Country of Origin': 'USA', 'Number of discs': '2'}\nArrived in perfect condition, wonderful story\nWonderful\nThe Heart Guy: Series 3\nRodger Corser  (Actor),     Nicole da Silva  (Actor),     Geoff Bennett  (Director),     Lucy Gaffy  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, TV\n{'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Uli Latukefu, Ben Chessell, Tina Bursill, Nicole da Silva, Geoff Bennett, Matt Castley, Brittany Clark, Jennifer Leacey, Lucy Gaffy, Hayley McElhinney, Charles Wu, Steve Bisley, Belinda Bromilow, Rodger Corser, Ian Watson, Ryan Johnson, Chloe BaylissUli Latukefu, Ben Chessell, Tina Bursill, Nicole da Silva, Geoff Bennett, Matt Castley, Brittany Clark, Jennifer Leacey, Lucy Gaffy, Hayley McElhinney, Charles Wu, Steve Bisley, Belinda Bromilow, Rodger Corser, Ian Watson, Ryan Johnson, Chloe Bayliss  See more', 'Number Of Discs': '4', 'Runtime': '7 hours and 53 minutes'}\nArrived in perfect condition, wonderful story\nWonderful\nHeart Guy Series 4\nRodger Corser  (Actor),     Nicole da Silva  (Actor),     Erin White  (Director),     Geoff Bennet  (Director)    &                   1                  more   Format: DVD\nMovies & TV, Featured Categories, DVD\n['After serving out his probation in his rural Australian hometown and saving the family farm, hotshot surgeon Hugh Knight (Rodger Corser, “The Doctor Blake Mysteries”) is flying high. Will Whyhope’s naughtiest doctor have the right stuff, or will he self-destruct and lose everything?']\n{'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Julietta Boscolo, Hayley McElhinney, Kriv Stenders, Erin White, Rodger Corser, Nicole da Silva, Geoff Bennet, Ryan Johnson, Lisa MatthewsJulietta Boscolo, Hayley McElhinney, Kriv Stenders, Erin White, Rodger Corser, Nicole da Silva, Geoff Bennet, Ryan Johnson, Lisa Matthews   See more', 'Number Of Discs': '3', 'Runtime': '8 hours and 4 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'AMP2828', 'Director': 'Erin White, Geoff Bennet, Julietta Boscolo, Kriv Stenders, Lisa Matthews', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 4 minutes', 'Release date': 'April 14, 2020', 'Actors': 'Rodger Corser, Nicole da Silva, Hayley McElhinney, Ryan Johnson', 'Studio': 'ACORN MEDIA', 'Number of discs': '3'}\nArrived in perfect condition, wonderful story\nWonderful\nThe Heart Guy: Series 2\nRodger Corser  (Actor),     Nicole da Silva  (Actor),     Ian Watson  (Director),     Tori Garrett  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, TV\n['As the hit Australian dramedy returns, hotshot surgeon Hugh Knight (Rodger Corser, The Doctor Blake Mysteries) continues to serve out his probation in his rural hometown, while his family faces struggles that could bring them closer together, or tear them apart.']\n{'Genre': 'Television', 'Format': 'NTSC, Widescreen', 'Contributor': 'Ben Chessell, Tina Bursill, Tori Garrett, Kriv Stenders, Nicole da Silva, Matt Castley, Brittany Clark, Lucy Gaffy, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Ian Watson, Ryan Johnson, Chloe BaylissBen Chessell, Tina Bursill, Tori Garrett, Kriv Stenders, Nicole da Silva, Matt Castley, Brittany Clark, Lucy Gaffy, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Ian Watson, Ryan Johnson, Chloe Bayliss  See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'AMP2643', 'Director': 'Ian Watson, Tori Garrett, Kriv Stenders, Lucy Gaffy, Ben Chessell', 'Media Format': 'NTSC, Widescreen', 'Run time': '7 hours and 51 minutes', 'Release date': 'June 26, 2018', 'Actors': 'Rodger Corser, Nicole da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nArrived in perfect condition, wonderful story\nWonderful\nThe Crown: The Complete Seasons 1 & 2\nClaire Foy  (Actor),     Matt Smith  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Season 1 The British Empire is in decline, the political world is in disarray, and a young woman takes the throne... a new era is dawning. Queen Elizabeth II is a 25-year-old newlywed faced with the daunting prospect of leading the world’s most famous monarchy while forging a relationship with legendary Prime Minister Sir Winston Churchill. Golden Globe winner for Best TV Drama Series, “The Crown,” created by Peter Morgan, explores the Queen’s private journey behind the public facade with daring frankness.  Season 2 The Crown, created by Peter Morgan, follows Queen Elizabeth through the late 1950s and early ‘60s as she struggles to navigate a world that’s changing around her. She must face the challenges of a new era, from the Suez Canal crisis to the assassination of John F. Kennedy, while preserving both the monarchy and her marriage.']\n{'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7 x 5.6 x 2.2 inches; 13.62 Ounces', 'Run time': '1207 minutes', 'Actors': 'Claire Foy, Matt Smith, Vanessa Kirby', 'Subtitles': 'English, French, Spanish', 'Number of discs': '8'}\nArrived in perfect condition and wonderful story\nWonderful\nDoc Martin Series 9\nMartin Clunes  (Actor),     Caroline Catz  (Actor),     Nigel Cole  (Director),     Charlie Palmer  (Director)    &                   1                  more   Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['All is not well for brilliant but boorish Dr. Martin Ellingham (Martin Clunes, Manhunt) as the hit British dramedy returns. To Martin’s utter disgust, his medical practice remains under official scrutiny because of his pre-existing blood phobia, and he is forced to attend refresher courses starting with phlebotomy. His wife, Louisa (Caroline Catz, DCI Banks) and aunt Ruth (Emmy winner Eileen Atkins, Cranford) urge him to take this risk to his career seriously, but events conspire against him.  While Louisa focuses on her own job change and studies child psychology, she worries that their son, James, is becoming too much like his father, and decides James needs a sibling. As the other residents of picturesque Portwenn contend with love and life changes, Martin remains stuck in his ways. Can he appease the medical board or will his days as the village GP soon be at an end?']\n{'Genre': 'Comedy/Television, Television/British Television', 'Format': 'NTSC, Widescreen, Subtitled', 'Contributor': 'Ian McNeice, Martin Clunes, Caroline Catz, Eileen Atkins, Charlie Palmer, Nigel Cole', 'Number Of Discs': '3', 'Runtime': '6 hours and 2 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Nigel Cole, Charlie Palmer', 'Media Format': 'NTSC, Widescreen, Subtitled', 'Run time': '6 hours and 2 minutes', 'Release date': 'December 10, 2019', 'Actors': 'Martin Clunes, Caroline Catz, Ian McNeice, Eileen Atkins', 'Studio': 'ACORN MEDIA', 'Number of discs': '3'}\nDoc Martin is totally enjoyable,  the story and acting are wonderful, and the landscape is like a travelogue/like being there!\nArrived in perfect condition and wonderful story",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: 800 Words : Season 1 [Blu-ray]\nReview Date: 2021/07/05\nStore: Pino Amenta  (Director),     Mike Smith  (Director),     Erik Thomson  (Actor),     Melina Vidler  (Actor)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['Successful newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) has his world turned upside down when his wife suddenly dies. Looking for a fresh start, George packs up and moves his two teenaged children, Shay (Melina Vidler) and Arlo (Benson Jack Anthony), from the bustle of Sydney to the picturesque seaside town of Weld, New Zealand. But the Turners’ new life doesn’t go as planned when they face a series of setbacks and meet the eccentric townsfolk, including handyman Woody (Rick Donald, Friends with Better Lives) and the “women of Weld”—four single ladies who are intrigued by the handsome widower and his offspring. Hailed for its “warmth and inclusiveness” (The Australian), this award-winning series is a heartfelt comedy/drama about a family searching for healing in the midst of tragedy.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Blu-ray', 'Contributor': 'James Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim BalmeJames Griffin, Natalie Medlock, Cian Elyse White, Michelle Langstone, Mike Smith, Rick Donald, Anna Jullienne, Erik Thomson, Chris Hampson, Benson Jack Anthony, Emma Leonard, Pino Amenta, Melina Vidler, Maxine Fleming, Tim Balme   See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.82 Ounces', 'Director': 'Pino Amenta, Mike Smith', 'Media Format': 'Blu-ray', 'Run time': '6 hours and 3 minutes', 'Release date': 'January 23, 2020', 'Actors': 'Erik Thomson, Melina Vidler, Benson Jack Anthony, Rick Donald, Anna Jullienne', 'Producers': 'Chris Hampson', 'Studio': 'Acorn', 'Writers': 'James Griffin, Maxine Fleming, Tim Balme, Natalie Medlock', 'Number of discs': '2'}\nReview Text: It's a wonderful DVD, story.<br />Arrived in perfect condition.<br />Thank you\nReview Title: Great,funny story,excellently delivered and received when expected\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 800 Words: Season 3 Part 1\nReview Date: 2021/07/05\nStore: Erik Thomson  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: ['As the award-winning dramedy returns, new challenges await newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) and his family, now settled in a charming New Zealand community after moving from Australia. Following last season\\'s harrowing boating accident, the townsfolk of Weld mount a search-and-rescue operation for the missing men, including the boyfriend of George\\'s daughter, Shay (Melina Vidler). Meanwhile, George anxiously considers the possibility of becoming a father again as his editor Jan (Bridie Carter, McLeod\\'s Daughters) goes into labor, but her twins\\' paternity is still unknown. Later, George\\'s teenage son, Arlo (Benson Jack Anthony), faces relationship problems, and George gets dragged into an elaborate scheme to help his friend Woody (Rick Donald, A Place to Call Home) out of a predicament that could ruin Woody\\'s forthcoming wedding. Set against the stunning scenery of the New Zealand coast, this \"amiable and touching\" (The New York Times) series also stars Emma Leonard (Home and Away), Michelle Langstone (The Almighty Johnsons), and Jonny Brugh (What We Do in the Shadows).']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama/Television, Television', 'Contributor': 'Erik Thomson', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'February 20, 2020', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Release date': 'February 20, 2020', 'Actors': 'Erik Thomson', 'Studio': 'Acorn Media', 'Number of discs': '2'}\nReview Text: Arrived in exceptional condition  and when expected.\nReview Title: Fun story\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heart Guy, The: Series 1\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole Da Silva  (Actor),     Peter Salmon  (Director),     Jeremy Sims  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Gifted, but arrogant heart surgeon Hugh Knight (Rodger Corser, Glitch, The Doctor Blake Mysteries) leads a charmed life in Sydney. He believes his talent lets him live outside the rules—until an incident involving drugs and alcohol brings his world crashing down. Placed on probation and banned from performing surgery, Hugh is forced to retreat to his rarely-visited hometown of Whyhope in rural Australia. Working as a GP at an underfunded hospital under his no-nonsense new boss (Hayley McElhinney, The Babadook), Hugh struggles to re-acclimate to rural life. And his complicated family situation makes his fall from grace even worse. Between his politically-ambitious mother (Tina Bursill, Prisoner: Cell Block H), emotionally distant father (Steve Bisley, The Great Gatsby, Mad Max), and his ex-girlfriend Charlie (Nicole da Silva, Wentworth, Rush) now married to his younger brother, Hugh is constantly reminded why he left Whyhope. Can he start afresh with a clean slate or will his bad-boy tendencies end his medical career for good?']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Tina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe BaylissTina Bursill, Kriv Stenders, Matt Castley, Nicole Da Silva, Shalom Brune-Franklin, Jeremy Sims, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Peter Salmon, Ryan Johnson, Chloe Bayliss   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Peter Salmon, Jeremy Sims, Kriv Stenders', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 9 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Rodger Corser, Nicole Da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nReview Text: Arrived in excellent condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 800 Words: Season 2 Part 2 [Blu-ray]\nReview Date: 2021/07/29\nStore: Erik Thomson  (Actor),     Melina Vidler  (Actor),     Mike Smith  (Director),     Michael Hurst  (Director)    &                   1                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['With his family back together, George Turner (Erik Thomson, Packed to the Rafters) and his kids, Shay and Arlo (Melina Vidler, Benson Jack Anthony), fall into the comfortable routine of life in the small, quirky New Zealand town of Weld. Arlo prepares for the new school term and tries to maintain a long-distance relationship, while Shay considers becoming an artist. George has a steady job writing for the local newspaper, and his budding relationship with Fiona (Michelle Langstone, The Almighty Johnsons) is the talk of the town. But shocking news from Jan (Bridie Carter, McLeod\\'s Daughters) threatens to turn George\\'s comfortable life upside down. This \"explicitly heartwarming family tale\" (The New York Times) also stars Rick Donald (A Place to Call Home), Emma Leonard (Home and Away), Anna Jullienne (The Blue Rose), and Ditch Davey (Spartacus: War of the Damned).']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'Blu-ray', 'Contributor': 'James Griffin, Cian Elyse White, Michelle Langstone, Rick Donald, Mike Smith, Anna Jullienne, Erik Thomson, Benson Jack Anthony, Sarah-Kate Lynch, Emma Leonard, Caroline Bell-Booth, Kate McDermott, Melina Vidler, Michael Hurst, Michael Beran, Tim Balme, Chris BaileyJames Griffin, Cian Elyse White, Michelle Langstone, Rick Donald, Mike Smith, Anna Jullienne, Erik Thomson, Benson Jack Anthony, Sarah-Kate Lynch, Emma Leonard, Caroline Bell-Booth, Kate McDermott, Melina Vidler, Michael Hurst, Michael Beran, Tim Balme, Chris Bailey  See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Mike Smith, Michael Hurst, Caroline Bell-Booth', 'Media Format': 'Blu-ray', 'Run time': '6 hours and 7 minutes', 'Release date': 'February 6, 2020', 'Actors': 'Erik Thomson, Melina Vidler, Benson Jack Anthony, Rick Donald, Anna Jullienne', 'Producers': 'Chris Bailey', 'Studio': 'Acorn', 'Writers': 'Kate McDermott, Michael Beran, James Griffin, Sarah-Kate Lynch, Tim Balme', 'Number of discs': '2'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 800 Words: Season 3 Part 2\nReview Date: 2021/07/29\nStore: Erik Thomson  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: [\"Australian newspaper columnist George Turner (Erik Thomson, Packed to the Rafters) and his family have settled into their lives in New Zealand, but things are far from calm in their small coastal town. Following the wedding of his friend Woody (Rick Donald, A Place to Call Home), George begins dating someone new, providing endless fodder for the gossiping townsfolk. George's teenagers face their own relationship issues as Shay (Melina Vidler) tries to get over her messy breakup, and Arlo (Benson Jack Anthony) becomes romantically involved with two girls at once. Later, the citizens of Weld fear that their town may be taken over by a neighboring community, and the Turners are rocked by revelations about the death of George's wife a few years earlier.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television', 'Contributor': 'Erik Thomson', 'Language': 'English', 'Number Of Discs': '2', 'Publication Date': 'February 20, 2020', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Release date': 'February 20, 2020', 'Actors': 'Erik Thomson', 'Studio': 'Acorn Media', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Heart Guy: Series 3\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole da Silva  (Actor),     Geoff Bennett  (Director),     Lucy Gaffy  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, TV\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Uli Latukefu, Ben Chessell, Tina Bursill, Nicole da Silva, Geoff Bennett, Matt Castley, Brittany Clark, Jennifer Leacey, Lucy Gaffy, Hayley McElhinney, Charles Wu, Steve Bisley, Belinda Bromilow, Rodger Corser, Ian Watson, Ryan Johnson, Chloe BaylissUli Latukefu, Ben Chessell, Tina Bursill, Nicole da Silva, Geoff Bennett, Matt Castley, Brittany Clark, Jennifer Leacey, Lucy Gaffy, Hayley McElhinney, Charles Wu, Steve Bisley, Belinda Bromilow, Rodger Corser, Ian Watson, Ryan Johnson, Chloe Bayliss  See more', 'Number Of Discs': '4', 'Runtime': '7 hours and 53 minutes'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Heart Guy Series 4\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole da Silva  (Actor),     Erin White  (Director),     Geoff Bennet  (Director)    &                   1                  more   Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['After serving out his probation in his rural Australian hometown and saving the family farm, hotshot surgeon Hugh Knight (Rodger Corser, “The Doctor Blake Mysteries”) is flying high. Will Whyhope’s naughtiest doctor have the right stuff, or will he self-destruct and lose everything?']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Julietta Boscolo, Hayley McElhinney, Kriv Stenders, Erin White, Rodger Corser, Nicole da Silva, Geoff Bennet, Ryan Johnson, Lisa MatthewsJulietta Boscolo, Hayley McElhinney, Kriv Stenders, Erin White, Rodger Corser, Nicole da Silva, Geoff Bennet, Ryan Johnson, Lisa Matthews   See more', 'Number Of Discs': '3', 'Runtime': '8 hours and 4 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'AMP2828', 'Director': 'Erin White, Geoff Bennet, Julietta Boscolo, Kriv Stenders, Lisa Matthews', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 4 minutes', 'Release date': 'April 14, 2020', 'Actors': 'Rodger Corser, Nicole da Silva, Hayley McElhinney, Ryan Johnson', 'Studio': 'ACORN MEDIA', 'Number of discs': '3'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Heart Guy: Series 2\nReview Date: 2021/07/29\nStore: Rodger Corser  (Actor),     Nicole da Silva  (Actor),     Ian Watson  (Director),     Tori Garrett  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: ['As the hit Australian dramedy returns, hotshot surgeon Hugh Knight (Rodger Corser, The Doctor Blake Mysteries) continues to serve out his probation in his rural hometown, while his family faces struggles that could bring them closer together, or tear them apart.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television', 'Format': 'NTSC, Widescreen', 'Contributor': 'Ben Chessell, Tina Bursill, Tori Garrett, Kriv Stenders, Nicole da Silva, Matt Castley, Brittany Clark, Lucy Gaffy, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Ian Watson, Ryan Johnson, Chloe BaylissBen Chessell, Tina Bursill, Tori Garrett, Kriv Stenders, Nicole da Silva, Matt Castley, Brittany Clark, Lucy Gaffy, Hayley McElhinney, Charles Wu, Belinda Bromilow, Steve Bisley, Rodger Corser, Ian Watson, Ryan Johnson, Chloe Bayliss  See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'AMP2643', 'Director': 'Ian Watson, Tori Garrett, Kriv Stenders, Lucy Gaffy, Ben Chessell', 'Media Format': 'NTSC, Widescreen', 'Run time': '7 hours and 51 minutes', 'Release date': 'June 26, 2018', 'Actors': 'Rodger Corser, Nicole da Silva, Ryan Johnson, Tina Bursill, Hayley McElhinney', 'Subtitles': 'English', 'Studio': 'Acorn', 'Number of discs': '3'}\nReview Text: Arrived in perfect condition, wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Crown: The Complete Seasons 1 & 2\nReview Date: 2021/07/29\nStore: Claire Foy  (Actor),     Matt Smith  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['Season 1 The British Empire is in decline, the political world is in disarray, and a young woman takes the throne... a new era is dawning. Queen Elizabeth II is a 25-year-old newlywed faced with the daunting prospect of leading the world’s most famous monarchy while forging a relationship with legendary Prime Minister Sir Winston Churchill. Golden Globe winner for Best TV Drama Series, “The Crown,” created by Peter Morgan, explores the Queen’s private journey behind the public facade with daring frankness.  Season 2 The Crown, created by Peter Morgan, follows Queen Elizabeth through the late 1950s and early ‘60s as she struggles to navigate a world that’s changing around her. She must face the challenges of a new era, from the Suez Canal crisis to the assassination of John F. Kennedy, while preserving both the monarchy and her marriage.']\nAverage Rating: 4.6\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7 x 5.6 x 2.2 inches; 13.62 Ounces', 'Run time': '1207 minutes', 'Actors': 'Claire Foy, Matt Smith, Vanessa Kirby', 'Subtitles': 'English, French, Spanish', 'Number of discs': '8'}\nReview Text: Arrived in perfect condition and wonderful story\nReview Title: Wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Doc Martin Series 9\nReview Date: 2021/07/29\nStore: Martin Clunes  (Actor),     Caroline Catz  (Actor),     Nigel Cole  (Director),     Charlie Palmer  (Director)    &                   1                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['All is not well for brilliant but boorish Dr. Martin Ellingham (Martin Clunes, Manhunt) as the hit British dramedy returns. To Martin’s utter disgust, his medical practice remains under official scrutiny because of his pre-existing blood phobia, and he is forced to attend refresher courses starting with phlebotomy. His wife, Louisa (Caroline Catz, DCI Banks) and aunt Ruth (Emmy winner Eileen Atkins, Cranford) urge him to take this risk to his career seriously, but events conspire against him.  While Louisa focuses on her own job change and studies child psychology, she worries that their son, James, is becoming too much like his father, and decides James needs a sibling. As the other residents of picturesque Portwenn contend with love and life changes, Martin remains stuck in his ways. Can he appease the medical board or will his days as the village GP soon be at an end?']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy/Television, Television/British Television', 'Format': 'NTSC, Widescreen, Subtitled', 'Contributor': 'Ian McNeice, Martin Clunes, Caroline Catz, Eileen Atkins, Charlie Palmer, Nigel Cole', 'Number Of Discs': '3', 'Runtime': '6 hours and 2 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Nigel Cole, Charlie Palmer', 'Media Format': 'NTSC, Widescreen, Subtitled', 'Run time': '6 hours and 2 minutes', 'Release date': 'December 10, 2019', 'Actors': 'Martin Clunes, Caroline Catz, Ian McNeice, Eileen Atkins', 'Studio': 'ACORN MEDIA', 'Number of discs': '3'}\nReview Text: Doc Martin is totally enjoyable,  the story and acting are wonderful, and the landscape is like a travelogue/like being there!\nReview Title: Arrived in perfect condition and wonderful story\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has consistently reported highly favorable experiences with their purchases, emphasizing the quality of the stories and the condition of the items upon arrival. Multiple interactions highlight the user’s appreciation for engaging narratives that are delivered in excellent condition and on time. The warmth and entertainment value of the shows, along with the strong performances from the cast, appear to have resonated well. Overall, the user values well-crafted stories and reliable service, creating a positive shopping experience.\n\nNEGATIVE SUMMARY:\nWhile the purchase history is largely positive, there are no overt negative experiences or complaints explicitly mentioned by the user. However, the absence of specific critiques might suggest a lack of variety in their choices or potential missed expectations from other genres that were not explored. The reviews posted reflect satisfaction, without room for dissatisfaction, indicating that if there were any negative aspects, the user did not express them in the available reviews.\n\nOVERALL SUMMARY:\nThe user exhibits a strong preference for heartfelt and well-crafted dramatic narratives, with consistently high ratings across their purchases. The experiences imply a focus on quality storytelling and effective delivery, often praising the condition of items upon arrival. Although no significant negative feedback or frustrations are communicated, the potential for exploration in other categories remains unaddressed. Overall, the user enjoys a positive shopping journey characterized by reliable service and engaging content.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Great story",
    "text": "Arrived in perfect condition, and the story and acting  are superb- good  story",
    "images": [],
    "asin": "B087CVXTFV",
    "parent_asin": "B087CVXTFV",
    "user_id": "AHJIG2OSUZ2B5J3J3XJNXBAZOTJA",
    "timestamp": "2021-07-29 20:21:42.937000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Outlander: Season 5 [Blu-ray]",
    "average_rating": 4.9,
    "rating_number": 13487,
    "features": [],
    "description": [
      "The fifth season of Outlander sees a continuation of Claire and Jamie’s fight to protect those they love, as they navigate the trials and tribulations of life in colonial America. The Frasers strive to flourish within a society which is unwittingly marching toward Revolution, and Jamie must now defend the home they have built together at Fraser’s Ridge while Claire seeks to put her own skills and medical expertise to use in keeping her family together and safe from harm. Meanwhile, Brianna and Roger MacKenzie struggle to find their respective places in this world and chase away the shadow cast over their lives by Stephen Bonnet as they raise their son in this brave new world. For the Frasers and their family, “home” is more than simply a site on which they live, it is the place in which they are laying the foundations for the rest of their lives."
    ],
    "price": 22.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51IpL0Z6fDL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51IpL0Z6fDL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71F3e7zZi-L._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Caitriona Balfe  (Actor, Producer),     Sam Heughan  (Actor, Producer),     Jamie Payne  (Director),     Stephen Woolfenden  (Director)    &                   1                  more   Rated:    NR    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "TV"
    ],
    "details": {
      "Genre": "Drama",
      "Format": "Subtitled",
      "Contributor": "Edward Speleers, Jamie Payne, Caitlin O'Ryan, Michael Wilson, Maria Doyle Kennedy, Michael O'Halloran, Caitriona Balfe, John Bell, Stephen Woolfenden, Elicia Bessette, Duncan Lacroix, Sam Heughan, Colin McFarlane, César Domboy, Lauren Lyle, Meera Menon, Annie Griffin, Guy Tannahill, Sophie Skelton, Richard Rankin, David Berry, Graham McTavishEdward Speleers, Jamie Payne, Caitlin O'Ryan, Michael Wilson, Maria Doyle Kennedy, Michael O'Halloran, Caitriona Balfe, John Bell, Stephen Woolfenden, Elicia Bessette, Duncan Lacroix, Sam Heughan, Colin McFarlane, César Domboy, Lauren Lyle, Meera Menon, Annie Griffin, G…  See more",
      "Language": "English",
      "Number Of Discs": "4",
      "Aspect Ratio": "1.78:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 4.16 Ounces",
      "Item model number": "56732 BLU-RAY",
      "Director": "Jamie Payne, Stephen Woolfenden, Annie Griffin, Meera Menon",
      "Media Format": "Subtitled",
      "Run time": "11 hours and 44 minutes",
      "Release date": "September 15, 2020",
      "Actors": "Caitriona Balfe, Sam Heughan, Sophie Skelton, Richard Rankin, Maria Doyle Kennedy",
      "Dubbed": "French",
      "Subtitles": "English, French",
      "Producers": "Elicia Bessette, Sam Heughan, Guy Tannahill, Caitriona Balfe, Michael Wilson",
      "Studio": "Sony Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "4"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}