{
  "user_id": "AHOSYOBPI56HIJLCZJSHTX437KKQ",
  "summary": "=== Purchase Information ===\nProduct Title: The Lord of the Rings: The Motion Picture Trilogy (The Fellowship of the Ring / The Two Towers / The Return of the King Extended Editions)\nReview Date: 2012/01/08\nStore: Elijah Wood  (Actor),     Viggo Mortensen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', 'The Quest Is Over: All three extended versions in dazzling 1080p and DTS HD-MA 5.1 Audio. Deluxe set includes over 26 Hours of spellbinding behind-the- moviemaking material, including the Rare Costa Botes documentaries, on 15 discs.', 'The Lord of the Rings: The Fellowship of the Ring Extended Edition', ': With the help of a courageous fellowship of friends and allies, Frodo embarks on a perilous mission to destroy the legendary One Ring.', 'The Lord of the Rings: The Two Towers Extended Edition', ': In the middle chapter of this historic movie trilogy, the Fellowship is broken but its quest to destroy the One Ring continues.', 'The Lord of the Rings: The Return of the King Extended Edition', ': The final battle for Middle-earth begins. Frodo and Sam, led by Gollum, continue their dangerous mission toward the fires of Mount Doom in order to destroy the One Ring.', 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Versions of', 'Lord of the Rings: The Motion Picture Trilogy', 'on Blu-ray and DVD', 'Original Theatrical Edition', 'Platinum Series Special Extended Edition', 'Original Theatrical and Extended Limited Edition', 'Original Theatrical Edition [Blu-ray]', 'Extended Edition [Blu-ray]', 'Release Date', 'May 25, 2004 Dec. 14, 2004 Aug. 29, 2006 Apr. 16, 2010 TBA', 'Format/Disc #', 'Three DVDs 12 DVDs Six DVDs Three Blu-ray Discs, Three DVDs, Three Digital Copies 15 Discs Total: Films are on Blu-ray, with Special Features on DVDs', 'Digital Copies', 'No No No Yes, on three discs (expired Apr. 4, 2011) Yes, online (expires Jun. 26, 2012)', 'Extra footage', 'None 30 minutes added to', 'Return of the King', '; 43 minutes added to', 'The Two Towers', '; 50 minutes added to', 'Return of the King', 'For all three films: Both the theatrical and extended edition on one disc None Same as extended-edition DVD', 'Commentaries', 'None Commentary by Peter Jackson, Fran Walsh, and Philippa Boyens; Commentary by the design team; Commentary by the production/post-production team; Commentary by the cast, including Elijah Wood, Ian McKellen, Sean Astin, Andy Serkis, John Rhys-Davies, Orlando Bloom, Christopher Lee, and Miranda Otto None None Same commentaries as extended-edition DVD', 'Documentaries', 'Fellowship of the Ring', ': \"Welcome to Middle-earth,\" \"The Quest for the Ring,\" \"A Passage to Middle-earth\";', 'The Two Towers', ': \"On the Set: The Lord of the Rings: The Two Towers\"; \"Return to Middle- earth\"', 'Return of the King', ': Three documentaries: \"The Quest Fulfilled: A Director\\'s Vision,\" \"A Filmmaker\\'s Journey: Making The Return of The King,\" \"National Geographic Special: Beyond the Movie\" \"From Book to Vision,\" \"From Vision to Reality,\" \"The Journey Continues...,\" Documentaries on J.R.R. Tolkein, \"From Book to Script\" documentaries, \"Designing and Building Middle-earth,\" \"Home of the Horse Lords,\" \"Gollum,\" \"Filming \\'The Two Towers,\\'\" \"Visual Effects,\" \"Editorial: Refining the Story,\" \"Music and Sound,\" \"The Battle for Helm\\'s Deep is Over...\"; \"Filming The Return of the King,\" \"Weta Digital,\" \"Post-Production: Journey\\'s End,\" \"The Passing of an Age,\" \"Cameron Duncan: The Inspiration for \\'Into the West\\'\" Three behind-the-scenes documentaries by Costa Botes, the filmmaker director Peter Jackson personally hired Same as theatrical-edition DVD Same as extended-edition DVD, plus Costa Botes documentaries from the Original Theatrical & Extended Limited Edition', 'Featurettes', 'Fellowship of the Ring', ': 15 featurettes originally created for lordoftherings.net;', 'The Two Towers', ': Eight featurettes originally created for lordoftherings.net;', 'Return of the King', ': Six featurettes None None Same as theatrical-edition DVD None', 'Other Features', 'Exclusive 10-minute behind-the-scenes previews of', 'The Two Towers', 'and', 'The Fellowship of the Ring', '; Enya \"May It Be\" music video; An inside look at the Special Extended DVD Edition of', 'The Lord of the Rings Trilogy', '; Preview of Electronic Arts\\' video games; DVD-ROM features: Exclusive online content; Emiliana Torrini \"Gollum Song\" music video; \"The Long and Short of It,\" a short film by Sean Astin; \"The Lord of The Rings\" Trilogy Supertrailer Design Galleries; \"Middle-earth Atlas: Tracing the Journeys of the Fellowship\" interactive map; \"New Zealand as Middle-earth\" interactive map w/on-location footage; production photos; \"The Mumakil Battle\" demonstration / multi-angle interactive feature; \"DFK6498\" short film, \"Strike Zone\" short film, DVD-ROM access to exclusive online features None Same as theatrical-edition DVD Same as extended edition DVDs; see above for complete special features']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 6 x 2.25 inches; 1.84 Pounds', 'Director': 'Peter Jackson', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 22 minutes', 'Release date': 'June 28, 2011', 'Actors': 'Elijah Wood, Viggo Mortensen, Ian McKellen', 'Subtitles': 'French, English', 'Studio': 'New Line Home Video', 'Number of discs': '15'}\nReview Text: I love the extended blu ray version of the lotr. Its worth the money and I havent even watched it all yet.  I love it!!!!!!\nReview Title: Excellent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dark Shadows DVD Collection 9\nReview Date: 2013/05/11\nStore: Jonathan Frid  (Actor),     Grayson Hall  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['With its alluring tales of gothic mystery and supernatural intrigue, Dark Shadows became the most popular daytime series of all time during its run on ABC from 1966-71. Muck like the show\\x92s character Barnabas Collins, a guilt-ridden vampire released from his chained coffin after nearly 200 years, Dark Shadows retains an immortality that time steadfastly fails to erode.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'Box set, Color, DVD, NTSC', 'Contributor': 'David Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John KarlenDavid Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John Karlen  See more', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1.75 inches; 8.47 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '14 hours', 'Release date': 'November 25, 2003', 'Actors': 'Jonathan Frid, Grayson Hall, Nancy Barrett, Joan Bennett, Alexandra Isles', 'Studio': 'Mpi Home Video', 'Writers': 'Dan Curtis', 'Number of discs': '4'}\nReview Text: Dark Shadows.......classic .....awesome....what more can I say??  Its just a fun, clean series that is great for everyone to watch.  I love it, always have!\nReview Title: Awesome\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nReview Date: 2014/01/10\nStore: Ian McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\nAverage Rating: 4.8\nProduct Details: {'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nReview Text: I love all of the extended LOTR movies, and now the extended Hobbit movie.  It does not disappoint. I especially love the beginning with Frodo and the older Bilbo.  Fantastic scenery, costumes and graphics.\nReview Title: Excellent Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Arsenic and Old Lace\nReview Date: 2014/01/10\nStore: Cary Grant  (Actor),     Raymond Massey  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Arsenic and Old Lace (DVD) (Rpkg)', \"Cary Grant stars as the one sane member of a charmingly lunatic family in director Frank Capra's classic comedy. When Mortimer Brewster (Grant) brings his new bride to meet his two kindly aunts, he discovers that, among many other acts of charity, the two genteel ladies help lonely old men die happy ... by feeding them a wonderful meal before poisoning them. Now, Mortimer desperately wants to protect the two serial murderers he loves, stop them from killing anyone else and keep his bride from discovering how deranged his family really is.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Mystery & Suspense', 'Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': 'Raymond Massey, Frank Capra, Cary Grant', 'Language': 'Unqualified (DTS ES 6.1), English (Mono)', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '163719', 'Director': 'Frank Capra', 'Media Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 54 minutes', 'Release date': 'November 9, 2010', 'Actors': 'Cary Grant, Raymond Massey', 'Subtitles': 'French, English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: I love this movie. It a fun clean movie for the whole family. The expressions on Cary Grants face are hilarious.  Wish they would make more movies like this one!\nReview Title: Great Classic Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bishop's Wife, The (BD)\nReview Date: 2017/07/11\nStore: Cary Grant  (Actor),     Loretta Young  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Bishop's Wife, The (BD)\", 'Heavenly bells are ringing, jubilant choirs are singing, and Christmas joy is blanketing the world like freshly fallen snow. But the Yuletide spirit has yet to warm Bishop Henry Brougham’s Victorian home. Struggling to raise funds for a new cathedral, the preoccupied young clergyman has neglected his loving wife, Julia, and now only divine intervention can save their marriage! But the powerful and handsome angel sent from above has a mind of his own…and teaching mortal Henry an immortal lesson in romance isn’t all he has planned! Starring Oscar® winners Cary Grant, Loretta Young and David Niven*, and featuring “a stellar supporting cast” (The Hollywood Reporter), which includes James Gleason and Monty Woolley, this delightful romantic comedy is wondrous, witty and truly divine!', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Cary Grant, Henry Koster, David Niven, Loretta Young', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000360166BR', 'Director': 'Henry Koster', 'Media Format': 'NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Cary Grant, Loretta Young, David Niven', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Wish they made more movies like this.  Its nice to have movies you dont have to be afraid to let your kids watch.  Refreshing, funny and just a good overall movie.\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pollyanna (Vault Disney Collection)\nReview Date: 2017/07/11\nStore: Hayley Mills  (Actor),     Jane Wyman  (Actor),     David Swift  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\nProduct Description: ['Product Description', 'Hayley Mills received a special Academy Award(R) for her performance as Pollyanna in this timeless Walt Disney tapestry of small-town Americana. Here you\\'ll meet Pollyanna, the orphan who brings sunshine into the lives of everyone she meets. But her Aunt Polly (Jane Wyman) is too concerned with appearances, propriety, and local politics to appreciate her effervescent niece. It isn\\'t until the town almost loses their \"Glad Girl\" that Aunt Polly realizes the power of love and lightheartedness. Featuring an impressive all-star cast and a story filled with fun, laughter, and tears, POLLYANNA will inspire your entire family and prove that the art of positive thinking is just as delightful today as it was at the turn of the century!|This was Hayley Mills\\' first film for Disney, and she immediately became the Studio\\'s newest star. She won an Academy Award(R) for the most outstanding juvenile performance of 1960.|The film was based on the 1913 book by Eleanor H. Porter. With a then lavish $2.5 million budget, director David Swift gathered a crew and cast unlike any other Disney live-action feature. Disney set decorator Emile Kuri was on hand but outsiders Walter Plunkett (costumes), Russell Harlan (cinematographers), and art directors Carroll Clark and Robert Clatworthy came from established careers at other studios.|To find a house to use as the residence of Aunt Polly, Walt Disney had to go far from his studio in Burbank. An ideal house was found in Santa Rosa, near Napa Valley. It occupied a full block in the center of town and was surrounded by spacious lawns and gardens. It was built in 1877 as a replica of an old Natchez, Mississippi, antebellum house. The vintage train station and water hole were also filmed in Santa Rosa, but the interiors were completed at the Disney Studio.', 'Amazon.com', \"Optimism shines in this classic 1960 Disney film starring Hayley Mills. When the newly orphaned Pollyanna comes to live with her wealthy aunt in Harrington Town, life looks promising. Despite her aunt's insistence on propriety and modesty, Pollyanna's cheerful, optimistic ways spread throughout the town--converting even a cantankerous recluse and a whining hypochondriac. Only Aunt Polly has trouble welcoming her young niece into her heart. In a clash between the townspeople and Aunt Polly over local politics, it's Pollyanna's influence that helps individual townspeople find the inner strength to stand up for their own beliefs. When Pollyanna is involved in a serious accident, Aunt Polly finally realizes how much she loves her niece. Can Aunt Polly and the entire town somehow restore Polly's optimism and ensure a full recovery?\", 'Pollyanna', 'is wholesome entertainment that will leave the entire family eager to play the \"glad game.\"', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, ACTION, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Nancy Olson, Richard Egan, Hayley Mills, Agnes Moorehead, Kevin Corcoran, James Drury, Karl Malden, Adolphe Menjou, David Swift, Jane Wyman, Reta ShawNancy Olson, Richard Egan, Hayley Mills, Agnes Moorehead, Kevin Corcoran, James Drury, Karl Malden, Adolphe Menjou, David Swift, Jane Wyman, Reta Shaw  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 14 minutes', 'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 3.2 Ounces', 'Item model number': '0078693614392', 'Director': 'David Swift', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'May 7, 2002', 'Actors': 'Hayley Mills, Jane Wyman, Nancy Olson, James Drury, Reta Shaw', 'Subtitles': 'Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Number of discs': '2'}\nReview Text: Another nice, clean refreshing movie for the whole family.  They dont make too many movies like this anymore.  So glad you can get clean wholesome movies on dvd. So much better than the trash that is on tv these days.\nReview Title: Wonderful movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: On Borrowed Time\nReview Date: 2017/07/11\nStore: Harold S. Bucquet  (Director),     Lionel Barrymore, Cedric Hardwicke, Beulah Bondi  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Death has come for Gramps Northrup. But Gramps has important work to do: raising his orphaned grandson. So he uses a bit of magic to trap Death in the branches of an apple tree. Clever work, Gramps! Or is it? With Death on hiatus, other folks whose time has come -- folks who are worn out, ill and in pain -- can't be released from their earthly suffering. And Gramps begins to wonder if he's done the right thing. From the beloved Paul Osborn play, this endearing fantasy of family, love and mortality moves effortlessly from rollicking to whimsical to tragic. Lionel Barrymore plays Gramps, leading a sterling cast of character stars, including Beulah Bondi, Una Merkel, Henry Travers and, as a most wry and gentlemanly Grim Reaper, Sir Cedric Hardwicke\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': 'Lionel Barrymore, Cedric Hardwicke, Beulah Bondi, Harold S. Bucquet', 'Language': 'Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Harold S. Bucquet', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 39 minutes', 'Release date': 'June 22, 2009', 'Actors': 'Lionel Barrymore, Cedric Hardwicke, Beulah Bondi', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Another wonderful old movie.  So much better than most of the trashy movies nowadays.  Nice to be able to watch a good clean movie!!!!!!!!\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/10/13\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Tobe Hooper'], 'Producers': ['Richard Kobritz'], 'Starring': ['David Soul', 'James Mason', 'Bonnie Bedelia'], 'Studio': ['AMC Plus Horror']}\nReview Text: One of the most terrifying movies ever!!  I love it, but still so horrifying I can't watch it alone, even in the daytime!!\nReview Title: Scary\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2022/02/18\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence'], 'Subtitles': ['None available'], 'Directors': ['Ken Klein'], 'Starring': ['Ken Klein'], 'Studio': ['Total Content Digital']}\nReview Text: I must agree with the person who said “everything makes sense now.”\nReview Title: Excellent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rodgers & Hammerstein's Cinderella\nReview Date: 2022/07/29\nStore: Ginger Rogers  (Actor),     Walter Pidgeon  (Actor),     Charles S. Dubin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: [\"CINDERELLA comes to life in this 50th Anniversary Edition of the most beloved fairy tale of all time. A sparkling fantasy of music, magic and romance, RODGERS & HAMMERSTEIN'S CINDERELLA captivates from overture to finale with a delightful score and stunning flittering performances from an all-star cast. Academy Award nominee Lesley Ann Warren is charming as the raggedy waif turned belle of the ball with Broadway star Stuart Damon as the Prince. Also starring Academy Award nominee Walter Pidgeon, Academy Award Winners Ginger Rogers and Celeste Hold as the Fairy Godmother, Cinderella will waltz into the hearts of the entire family and live happily ever after as one of the most irresistible musicals ever made.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Musicals & Performing Arts/Musicals/General', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Contributor': 'Celeste Holm, Walter Pidgeon, Charles S. Dubin, Ginger Rogers, Lesley Ann Warren', 'Language': 'English', 'Runtime': '1 hour and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'SFY15113DVD', 'Director': 'Charles S. Dubin', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '1 hour and 23 minutes', 'Release date': 'September 9, 2014', 'Actors': 'Ginger Rogers, Walter Pidgeon, Celeste Holm, Lesley Ann Warren', 'Subtitles': 'English, Spanish', 'Studio': 'SHOUT! FACTORY', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I absolutely love this beautiful musical adaptation of Cinderella. An outstanding cast of entertainers, especially the handsome Stuart Damon as the prince.  Watched it as a child when it first came on tv in 1965. I have bought the dvd, not only for myself but also for my grand daughter to watch since decent, moral shows, even cartoons are getting scarce. Rodgers and Hammerstein had the magic touch for so many movies. Their music is amazing. You can't go wrong with this musical, I love watching it and would give it 10 stars if I could.\nReview Title: Beautiful Musical Cinderella\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Lord of the Rings: The Motion Picture Trilogy (The Fellowship of the Ring / The Two Towers / The Return of the King Extended Editions)\nElijah Wood  (Actor),     Viggo Mortensen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', 'The Quest Is Over: All three extended versions in dazzling 1080p and DTS HD-MA 5.1 Audio. Deluxe set includes over 26 Hours of spellbinding behind-the- moviemaking material, including the Rare Costa Botes documentaries, on 15 discs.', 'The Lord of the Rings: The Fellowship of the Ring Extended Edition', ': With the help of a courageous fellowship of friends and allies, Frodo embarks on a perilous mission to destroy the legendary One Ring.', 'The Lord of the Rings: The Two Towers Extended Edition', ': In the middle chapter of this historic movie trilogy, the Fellowship is broken but its quest to destroy the One Ring continues.', 'The Lord of the Rings: The Return of the King Extended Edition', ': The final battle for Middle-earth begins. Frodo and Sam, led by Gollum, continue their dangerous mission toward the fires of Mount Doom in order to destroy the One Ring.', 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Versions of', 'Lord of the Rings: The Motion Picture Trilogy', 'on Blu-ray and DVD', 'Original Theatrical Edition', 'Platinum Series Special Extended Edition', 'Original Theatrical and Extended Limited Edition', 'Original Theatrical Edition [Blu-ray]', 'Extended Edition [Blu-ray]', 'Release Date', 'May 25, 2004 Dec. 14, 2004 Aug. 29, 2006 Apr. 16, 2010 TBA', 'Format/Disc #', 'Three DVDs 12 DVDs Six DVDs Three Blu-ray Discs, Three DVDs, Three Digital Copies 15 Discs Total: Films are on Blu-ray, with Special Features on DVDs', 'Digital Copies', 'No No No Yes, on three discs (expired Apr. 4, 2011) Yes, online (expires Jun. 26, 2012)', 'Extra footage', 'None 30 minutes added to', 'Return of the King', '; 43 minutes added to', 'The Two Towers', '; 50 minutes added to', 'Return of the King', 'For all three films: Both the theatrical and extended edition on one disc None Same as extended-edition DVD', 'Commentaries', 'None Commentary by Peter Jackson, Fran Walsh, and Philippa Boyens; Commentary by the design team; Commentary by the production/post-production team; Commentary by the cast, including Elijah Wood, Ian McKellen, Sean Astin, Andy Serkis, John Rhys-Davies, Orlando Bloom, Christopher Lee, and Miranda Otto None None Same commentaries as extended-edition DVD', 'Documentaries', 'Fellowship of the Ring', ': \"Welcome to Middle-earth,\" \"The Quest for the Ring,\" \"A Passage to Middle-earth\";', 'The Two Towers', ': \"On the Set: The Lord of the Rings: The Two Towers\"; \"Return to Middle- earth\"', 'Return of the King', ': Three documentaries: \"The Quest Fulfilled: A Director\\'s Vision,\" \"A Filmmaker\\'s Journey: Making The Return of The King,\" \"National Geographic Special: Beyond the Movie\" \"From Book to Vision,\" \"From Vision to Reality,\" \"The Journey Continues...,\" Documentaries on J.R.R. Tolkein, \"From Book to Script\" documentaries, \"Designing and Building Middle-earth,\" \"Home of the Horse Lords,\" \"Gollum,\" \"Filming \\'The Two Towers,\\'\" \"Visual Effects,\" \"Editorial: Refining the Story,\" \"Music and Sound,\" \"The Battle for Helm\\'s Deep is Over...\"; \"Filming The Return of the King,\" \"Weta Digital,\" \"Post-Production: Journey\\'s End,\" \"The Passing of an Age,\" \"Cameron Duncan: The Inspiration for \\'Into the West\\'\" Three behind-the-scenes documentaries by Costa Botes, the filmmaker director Peter Jackson personally hired Same as theatrical-edition DVD Same as extended-edition DVD, plus Costa Botes documentaries from the Original Theatrical & Extended Limited Edition', 'Featurettes', 'Fellowship of the Ring', ': 15 featurettes originally created for lordoftherings.net;', 'The Two Towers', ': Eight featurettes originally created for lordoftherings.net;', 'Return of the King', ': Six featurettes None None Same as theatrical-edition DVD None', 'Other Features', 'Exclusive 10-minute behind-the-scenes previews of', 'The Two Towers', 'and', 'The Fellowship of the Ring', '; Enya \"May It Be\" music video; An inside look at the Special Extended DVD Edition of', 'The Lord of the Rings Trilogy', '; Preview of Electronic Arts\\' video games; DVD-ROM features: Exclusive online content; Emiliana Torrini \"Gollum Song\" music video; \"The Long and Short of It,\" a short film by Sean Astin; \"The Lord of The Rings\" Trilogy Supertrailer Design Galleries; \"Middle-earth Atlas: Tracing the Journeys of the Fellowship\" interactive map; \"New Zealand as Middle-earth\" interactive map w/on-location footage; production photos; \"The Mumakil Battle\" demonstration / multi-angle interactive feature; \"DFK6498\" short film, \"Strike Zone\" short film, DVD-ROM access to exclusive online features None Same as theatrical-edition DVD Same as extended edition DVDs; see above for complete special features']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 6 x 2.25 inches; 1.84 Pounds', 'Director': 'Peter Jackson', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 22 minutes', 'Release date': 'June 28, 2011', 'Actors': 'Elijah Wood, Viggo Mortensen, Ian McKellen', 'Subtitles': 'French, English', 'Studio': 'New Line Home Video', 'Number of discs': '15'}\nI love the extended blu ray version of the lotr. Its worth the money and I havent even watched it all yet.  I love it!!!!!!\nExcellent\nDark Shadows DVD Collection 9\nJonathan Frid  (Actor),     Grayson Hall  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['With its alluring tales of gothic mystery and supernatural intrigue, Dark Shadows became the most popular daytime series of all time during its run on ABC from 1966-71. Muck like the show\\x92s character Barnabas Collins, a guilt-ridden vampire released from his chained coffin after nearly 200 years, Dark Shadows retains an immortality that time steadfastly fails to erode.']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Box set, Color, DVD, NTSC', 'Contributor': 'David Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John KarlenDavid Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John Karlen  See more', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1.75 inches; 8.47 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '14 hours', 'Release date': 'November 25, 2003', 'Actors': 'Jonathan Frid, Grayson Hall, Nancy Barrett, Joan Bennett, Alexandra Isles', 'Studio': 'Mpi Home Video', 'Writers': 'Dan Curtis', 'Number of discs': '4'}\nDark Shadows.......classic .....awesome....what more can I say??  Its just a fun, clean series that is great for everyone to watch.  I love it, always have!\nAwesome\nThe Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\n{'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nI love all of the extended LOTR movies, and now the extended Hobbit movie.  It does not disappoint. I especially love the beginning with Frodo and the older Bilbo.  Fantastic scenery, costumes and graphics.\nExcellent Movie\nArsenic and Old Lace\nCary Grant  (Actor),     Raymond Massey  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Arsenic and Old Lace (DVD) (Rpkg)', \"Cary Grant stars as the one sane member of a charmingly lunatic family in director Frank Capra's classic comedy. When Mortimer Brewster (Grant) brings his new bride to meet his two kindly aunts, he discovers that, among many other acts of charity, the two genteel ladies help lonely old men die happy ... by feeding them a wonderful meal before poisoning them. Now, Mortimer desperately wants to protect the two serial murderers he loves, stop them from killing anyone else and keep his bride from discovering how deranged his family really is.\", ']]>']\n{'Genre': 'Comedy, Mystery & Suspense', 'Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': 'Raymond Massey, Frank Capra, Cary Grant', 'Language': 'Unqualified (DTS ES 6.1), English (Mono)', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '163719', 'Director': 'Frank Capra', 'Media Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 54 minutes', 'Release date': 'November 9, 2010', 'Actors': 'Cary Grant, Raymond Massey', 'Subtitles': 'French, English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nI love this movie. It a fun clean movie for the whole family. The expressions on Cary Grants face are hilarious.  Wish they would make more movies like this one!\nGreat Classic Movie\nBishop's Wife, The (BD)\nCary Grant  (Actor),     Loretta Young  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Bishop's Wife, The (BD)\", 'Heavenly bells are ringing, jubilant choirs are singing, and Christmas joy is blanketing the world like freshly fallen snow. But the Yuletide spirit has yet to warm Bishop Henry Brougham’s Victorian home. Struggling to raise funds for a new cathedral, the preoccupied young clergyman has neglected his loving wife, Julia, and now only divine intervention can save their marriage! But the powerful and handsome angel sent from above has a mind of his own…and teaching mortal Henry an immortal lesson in romance isn’t all he has planned! Starring Oscar® winners Cary Grant, Loretta Young and David Niven*, and featuring “a stellar supporting cast” (The Hollywood Reporter), which includes James Gleason and Monty Woolley, this delightful romantic comedy is wondrous, witty and truly divine!', ']]>']\n{'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Cary Grant, Henry Koster, David Niven, Loretta Young', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000360166BR', 'Director': 'Henry Koster', 'Media Format': 'NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Cary Grant, Loretta Young, David Niven', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nWish they made more movies like this.  Its nice to have movies you dont have to be afraid to let your kids watch.  Refreshing, funny and just a good overall movie.\nGreat Movie\nPollyanna (Vault Disney Collection)\nHayley Mills  (Actor),     Jane Wyman  (Actor),     David Swift  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['Product Description', 'Hayley Mills received a special Academy Award(R) for her performance as Pollyanna in this timeless Walt Disney tapestry of small-town Americana. Here you\\'ll meet Pollyanna, the orphan who brings sunshine into the lives of everyone she meets. But her Aunt Polly (Jane Wyman) is too concerned with appearances, propriety, and local politics to appreciate her effervescent niece. It isn\\'t until the town almost loses their \"Glad Girl\" that Aunt Polly realizes the power of love and lightheartedness. Featuring an impressive all-star cast and a story filled with fun, laughter, and tears, POLLYANNA will inspire your entire family and prove that the art of positive thinking is just as delightful today as it was at the turn of the century!|This was Hayley Mills\\' first film for Disney, and she immediately became the Studio\\'s newest star. She won an Academy Award(R) for the most outstanding juvenile performance of 1960.|The film was based on the 1913 book by Eleanor H. Porter. With a then lavish $2.5 million budget, director David Swift gathered a crew and cast unlike any other Disney live-action feature. Disney set decorator Emile Kuri was on hand but outsiders Walter Plunkett (costumes), Russell Harlan (cinematographers), and art directors Carroll Clark and Robert Clatworthy came from established careers at other studios.|To find a house to use as the residence of Aunt Polly, Walt Disney had to go far from his studio in Burbank. An ideal house was found in Santa Rosa, near Napa Valley. It occupied a full block in the center of town and was surrounded by spacious lawns and gardens. It was built in 1877 as a replica of an old Natchez, Mississippi, antebellum house. The vintage train station and water hole were also filmed in Santa Rosa, but the interiors were completed at the Disney Studio.', 'Amazon.com', \"Optimism shines in this classic 1960 Disney film starring Hayley Mills. When the newly orphaned Pollyanna comes to live with her wealthy aunt in Harrington Town, life looks promising. Despite her aunt's insistence on propriety and modesty, Pollyanna's cheerful, optimistic ways spread throughout the town--converting even a cantankerous recluse and a whining hypochondriac. Only Aunt Polly has trouble welcoming her young niece into her heart. In a clash between the townspeople and Aunt Polly over local politics, it's Pollyanna's influence that helps individual townspeople find the inner strength to stand up for their own beliefs. When Pollyanna is involved in a serious accident, Aunt Polly finally realizes how much she loves her niece. Can Aunt Polly and the entire town somehow restore Polly's optimism and ensure a full recovery?\", 'Pollyanna', 'is wholesome entertainment that will leave the entire family eager to play the \"glad game.\"', '--Tami Horiuchi']\n{'Genre': 'Drama, ACTION, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Nancy Olson, Richard Egan, Hayley Mills, Agnes Moorehead, Kevin Corcoran, James Drury, Karl Malden, Adolphe Menjou, David Swift, Jane Wyman, Reta ShawNancy Olson, Richard Egan, Hayley Mills, Agnes Moorehead, Kevin Corcoran, James Drury, Karl Malden, Adolphe Menjou, David Swift, Jane Wyman, Reta Shaw  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 14 minutes', 'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 3.2 Ounces', 'Item model number': '0078693614392', 'Director': 'David Swift', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'May 7, 2002', 'Actors': 'Hayley Mills, Jane Wyman, Nancy Olson, James Drury, Reta Shaw', 'Subtitles': 'Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Number of discs': '2'}\nAnother nice, clean refreshing movie for the whole family.  They dont make too many movies like this anymore.  So glad you can get clean wholesome movies on dvd. So much better than the trash that is on tv these days.\nWonderful movie\nOn Borrowed Time\nHarold S. Bucquet  (Director),     Lionel Barrymore, Cedric Hardwicke, Beulah Bondi  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Death has come for Gramps Northrup. But Gramps has important work to do: raising his orphaned grandson. So he uses a bit of magic to trap Death in the branches of an apple tree. Clever work, Gramps! Or is it? With Death on hiatus, other folks whose time has come -- folks who are worn out, ill and in pain -- can't be released from their earthly suffering. And Gramps begins to wonder if he's done the right thing. From the beloved Paul Osborn play, this endearing fantasy of family, love and mortality moves effortlessly from rollicking to whimsical to tragic. Lionel Barrymore plays Gramps, leading a sterling cast of character stars, including Beulah Bondi, Una Merkel, Henry Travers and, as a most wry and gentlemanly Grim Reaper, Sir Cedric Hardwicke\"]\n{'Genre': 'Drama', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': 'Lionel Barrymore, Cedric Hardwicke, Beulah Bondi, Harold S. Bucquet', 'Language': 'Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Harold S. Bucquet', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 39 minutes', 'Release date': 'June 22, 2009', 'Actors': 'Lionel Barrymore, Cedric Hardwicke, Beulah Bondi', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAnother wonderful old movie.  So much better than most of the trashy movies nowadays.  Nice to be able to watch a good clean movie!!!!!!!!\nGreat Movie\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Tobe Hooper'], 'Producers': ['Richard Kobritz'], 'Starring': ['David Soul', 'James Mason', 'Bonnie Bedelia'], 'Studio': ['AMC Plus Horror']}\nOne of the most terrifying movies ever!!  I love it, but still so horrifying I can't watch it alone, even in the daytime!!\nScary\n{'Content advisory': ['Violence'], 'Subtitles': ['None available'], 'Directors': ['Ken Klein'], 'Starring': ['Ken Klein'], 'Studio': ['Total Content Digital']}\nI must agree with the person who said “everything makes sense now.”\nExcellent\nRodgers & Hammerstein's Cinderella\nGinger Rogers  (Actor),     Walter Pidgeon  (Actor),     Charles S. Dubin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n[\"CINDERELLA comes to life in this 50th Anniversary Edition of the most beloved fairy tale of all time. A sparkling fantasy of music, magic and romance, RODGERS & HAMMERSTEIN'S CINDERELLA captivates from overture to finale with a delightful score and stunning flittering performances from an all-star cast. Academy Award nominee Lesley Ann Warren is charming as the raggedy waif turned belle of the ball with Broadway star Stuart Damon as the Prince. Also starring Academy Award nominee Walter Pidgeon, Academy Award Winners Ginger Rogers and Celeste Hold as the Fairy Godmother, Cinderella will waltz into the hearts of the entire family and live happily ever after as one of the most irresistible musicals ever made.\"]\n{'Genre': 'Kids & Family, Musicals & Performing Arts/Musicals/General', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Contributor': 'Celeste Holm, Walter Pidgeon, Charles S. Dubin, Ginger Rogers, Lesley Ann Warren', 'Language': 'English', 'Runtime': '1 hour and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'SFY15113DVD', 'Director': 'Charles S. Dubin', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '1 hour and 23 minutes', 'Release date': 'September 9, 2014', 'Actors': 'Ginger Rogers, Walter Pidgeon, Celeste Holm, Lesley Ann Warren', 'Subtitles': 'English, Spanish', 'Studio': 'SHOUT! FACTORY', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI absolutely love this beautiful musical adaptation of Cinderella. An outstanding cast of entertainers, especially the handsome Stuart Damon as the prince.  Watched it as a child when it first came on tv in 1965. I have bought the dvd, not only for myself but also for my grand daughter to watch since decent, moral shows, even cartoons are getting scarce. Rodgers and Hammerstein had the magic touch for so many movies. Their music is amazing. You can't go wrong with this musical, I love watching it and would give it 10 stars if I could.\nBeautiful Musical Cinderella",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: The Lord of the Rings: The Motion Picture Trilogy (The Fellowship of the Ring / The Two Towers / The Return of the King Extended Editions)\nReview Date: 2012/01/08\nStore: Elijah Wood  (Actor),     Viggo Mortensen  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', 'The Quest Is Over: All three extended versions in dazzling 1080p and DTS HD-MA 5.1 Audio. Deluxe set includes over 26 Hours of spellbinding behind-the- moviemaking material, including the Rare Costa Botes documentaries, on 15 discs.', 'The Lord of the Rings: The Fellowship of the Ring Extended Edition', ': With the help of a courageous fellowship of friends and allies, Frodo embarks on a perilous mission to destroy the legendary One Ring.', 'The Lord of the Rings: The Two Towers Extended Edition', ': In the middle chapter of this historic movie trilogy, the Fellowship is broken but its quest to destroy the One Ring continues.', 'The Lord of the Rings: The Return of the King Extended Edition', ': The final battle for Middle-earth begins. Frodo and Sam, led by Gollum, continue their dangerous mission toward the fires of Mount Doom in order to destroy the One Ring.', 'Amazon.com', 'As the triumphant start of a trilogy,', 'The Lord of the Rings: The Fellowship of the Ring', \"leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic\", 'The Lord of the Rings', \", but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure, and ends on a perfect note of heroic loyalty and rich anticipation.\", 'After the breaking of the Fellowship, Frodo and Sam journey to Mordor with the creature Gollum as their guide in', 'The Two Towers', \". Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make\", 'The Two Towers', 'a worthy successor to', 'The Fellowship of the Ring', \", grander in scale but retaining the story's emotional intimacy.\", 'With', 'The Return of the King', \", the greatest fantasy epic in film history draws to a grand and glorious conclusion. The trilogy could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as Frodo and Sam continue their mission to Mordor to destroy the soul-corrupting One Ring. While the heir to the kingdom of Men, Aragorn, endures the massive battle at Minas Tirith with the allegiance of Legolas, Gimli, and Gandalf, Frodo and Sam must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation. Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that\", 'The Return of the King', \"maintains the trilogy's emphasis on intimate fellowship and remains faithful to Tolkien's overall vision. By ending the\", 'LOTR', 'trilogy with noble integrity and faith in the power of imaginative storytelling,', 'The Return of the King', ', like its predecessors, will stand as an adventure for the ages.', '--Jeff Shannon and David Horiuchi', 'Our Review of the Extended Edition on DVD (Dec. 14, 2004)', ':', \"The extended editions of Peter Jackson's\", 'The Lord of the Rings', \"present the greatest trilogy in film history in the most ambitious sets in DVD history. In bringing J.R.R. Tolkien's nearly unfilmable work to the screen, Jackson benefited from extraordinary special effects, evocative New Zealand locales, and an exceptionally well-chosen cast, but most of all from his own adaptation with co-writers Fran Walsh and Philippa Boyens, preserving Tolkien's vision and often his very words, but also making logical changes to accommodate the medium of film. While purists complained about these changes and about characters and scenes left out of the films, the almost two additional hours of material in the extended editions (about 11 hours total) help appease them by delving more deeply into Tolkien's music, the characters, and loose ends that enrich the story, such as an explanation of the Faramir-Denethor relationship, and the appearance of the Mouth of Sauron at the gates of Mordor. In addition, the extended editions offer more bridge material between the films, further confirming that the trilogy is really one long film presented in three pieces (which is why it's the greatest trilogy ever--there's no weak link). The scene of Galadriel's gifts to the Fellowship added to the first film proves significant over the course of the story, while the new Faramir scene at the end of the second film helps set up the third and the new Saruman scene at the beginning of the third film helps conclude the plot of the second.\", 'To top it all off, the extended editions offer four discs per film: two for the longer movie, plus four commentary tracks and stupendous DTS 6.1 ES sound; and two for the bonus material, which covers just about everything from script creation to special effects. The argument was that fans would need both versions because the bonus material is completely different, but the features on the theatrical releases are so vastly inferior that the only reason a fan would need them would be if they wanted to watch the shorter versions they saw in theaters (the last of which,', 'The Return of the King', ', merely won 11 Oscars). The', 'LOTR', \"extended editions without exception have set the DVD standard by providing a richer film experience that pulls the three films together and further embraces Tolkien's world, a reference-quality home theater experience, and generous, intelligent, and engrossing bonus features.\", '--David Horiuchi', 'Versions of', 'Lord of the Rings: The Motion Picture Trilogy', 'on Blu-ray and DVD', 'Original Theatrical Edition', 'Platinum Series Special Extended Edition', 'Original Theatrical and Extended Limited Edition', 'Original Theatrical Edition [Blu-ray]', 'Extended Edition [Blu-ray]', 'Release Date', 'May 25, 2004 Dec. 14, 2004 Aug. 29, 2006 Apr. 16, 2010 TBA', 'Format/Disc #', 'Three DVDs 12 DVDs Six DVDs Three Blu-ray Discs, Three DVDs, Three Digital Copies 15 Discs Total: Films are on Blu-ray, with Special Features on DVDs', 'Digital Copies', 'No No No Yes, on three discs (expired Apr. 4, 2011) Yes, online (expires Jun. 26, 2012)', 'Extra footage', 'None 30 minutes added to', 'Return of the King', '; 43 minutes added to', 'The Two Towers', '; 50 minutes added to', 'Return of the King', 'For all three films: Both the theatrical and extended edition on one disc None Same as extended-edition DVD', 'Commentaries', 'None Commentary by Peter Jackson, Fran Walsh, and Philippa Boyens; Commentary by the design team; Commentary by the production/post-production team; Commentary by the cast, including Elijah Wood, Ian McKellen, Sean Astin, Andy Serkis, John Rhys-Davies, Orlando Bloom, Christopher Lee, and Miranda Otto None None Same commentaries as extended-edition DVD', 'Documentaries', 'Fellowship of the Ring', ': \"Welcome to Middle-earth,\" \"The Quest for the Ring,\" \"A Passage to Middle-earth\";', 'The Two Towers', ': \"On the Set: The Lord of the Rings: The Two Towers\"; \"Return to Middle- earth\"', 'Return of the King', ': Three documentaries: \"The Quest Fulfilled: A Director\\'s Vision,\" \"A Filmmaker\\'s Journey: Making The Return of The King,\" \"National Geographic Special: Beyond the Movie\" \"From Book to Vision,\" \"From Vision to Reality,\" \"The Journey Continues...,\" Documentaries on J.R.R. Tolkein, \"From Book to Script\" documentaries, \"Designing and Building Middle-earth,\" \"Home of the Horse Lords,\" \"Gollum,\" \"Filming \\'The Two Towers,\\'\" \"Visual Effects,\" \"Editorial: Refining the Story,\" \"Music and Sound,\" \"The Battle for Helm\\'s Deep is Over...\"; \"Filming The Return of the King,\" \"Weta Digital,\" \"Post-Production: Journey\\'s End,\" \"The Passing of an Age,\" \"Cameron Duncan: The Inspiration for \\'Into the West\\'\" Three behind-the-scenes documentaries by Costa Botes, the filmmaker director Peter Jackson personally hired Same as theatrical-edition DVD Same as extended-edition DVD, plus Costa Botes documentaries from the Original Theatrical & Extended Limited Edition', 'Featurettes', 'Fellowship of the Ring', ': 15 featurettes originally created for lordoftherings.net;', 'The Two Towers', ': Eight featurettes originally created for lordoftherings.net;', 'Return of the King', ': Six featurettes None None Same as theatrical-edition DVD None', 'Other Features', 'Exclusive 10-minute behind-the-scenes previews of', 'The Two Towers', 'and', 'The Fellowship of the Ring', '; Enya \"May It Be\" music video; An inside look at the Special Extended DVD Edition of', 'The Lord of the Rings Trilogy', '; Preview of Electronic Arts\\' video games; DVD-ROM features: Exclusive online content; Emiliana Torrini \"Gollum Song\" music video; \"The Long and Short of It,\" a short film by Sean Astin; \"The Lord of The Rings\" Trilogy Supertrailer Design Galleries; \"Middle-earth Atlas: Tracing the Journeys of the Fellowship\" interactive map; \"New Zealand as Middle-earth\" interactive map w/on-location footage; production photos; \"The Mumakil Battle\" demonstration / multi-angle interactive feature; \"DFK6498\" short film, \"Strike Zone\" short film, DVD-ROM access to exclusive online features None Same as theatrical-edition DVD Same as extended edition DVDs; see above for complete special features']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 6 x 2.25 inches; 1.84 Pounds', 'Director': 'Peter Jackson', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '11 hours and 22 minutes', 'Release date': 'June 28, 2011', 'Actors': 'Elijah Wood, Viggo Mortensen, Ian McKellen', 'Subtitles': 'French, English', 'Studio': 'New Line Home Video', 'Number of discs': '15'}\nReview Text: I love the extended blu ray version of the lotr. Its worth the money and I havent even watched it all yet.  I love it!!!!!!\nReview Title: Excellent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dark Shadows DVD Collection 9\nReview Date: 2013/05/11\nStore: Jonathan Frid  (Actor),     Grayson Hall  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['With its alluring tales of gothic mystery and supernatural intrigue, Dark Shadows became the most popular daytime series of all time during its run on ABC from 1966-71. Muck like the show\\x92s character Barnabas Collins, a guilt-ridden vampire released from his chained coffin after nearly 200 years, Dark Shadows retains an immortality that time steadfastly fails to erode.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'Box set, Color, DVD, NTSC', 'Contributor': 'David Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John KarlenDavid Selby, Louis Edmonds, David Henesy, Lara Parker, Joan Bennett, Kathryn Leigh Scott, Thayer David, Nancy Barrett, Grayson Hall, Dan Curtis, Jonathan Frid, Alexandra Isles, John Karlen  See more', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1.75 inches; 8.47 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '14 hours', 'Release date': 'November 25, 2003', 'Actors': 'Jonathan Frid, Grayson Hall, Nancy Barrett, Joan Bennett, Alexandra Isles', 'Studio': 'Mpi Home Video', 'Writers': 'Dan Curtis', 'Number of discs': '4'}\nReview Text: Dark Shadows.......classic .....awesome....what more can I say??  Its just a fun, clean series that is great for everyone to watch.  I love it, always have!\nReview Title: Awesome\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hobbit: An Unexpected Journey (Extended Edition) (Blu-ray)\nReview Date: 2014/01/10\nStore: Ian McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director, Producer, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Join Peter Jackson on the Journey to the World’s Greatest Adventure Three-disc Extended Edition includes 13 minutes of revealing never-before-seen film footage and nearly 9 hours of fascinating in-depth looks at the production.']\nAverage Rating: 4.8\nProduct Details: {'Brand': 'NEW LINE HOME VIDEO', 'Package Type': 'Standard Packaging', 'Number of Items': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '27724716', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Producers': 'Peter Jackson, Alan Horn, Toby Emmerich, Fran Walsh, Carolynne Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Peter Jackson, Fran Walsh, Philippa Boyens, Guillermo del Toro', 'Number of discs': '3'}\nReview Text: I love all of the extended LOTR movies, and now the extended Hobbit movie.  It does not disappoint. I especially love the beginning with Frodo and the older Bilbo.  Fantastic scenery, costumes and graphics.\nReview Title: Excellent Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Arsenic and Old Lace\nReview Date: 2014/01/10\nStore: Cary Grant  (Actor),     Raymond Massey  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Arsenic and Old Lace (DVD) (Rpkg)', \"Cary Grant stars as the one sane member of a charmingly lunatic family in director Frank Capra's classic comedy. When Mortimer Brewster (Grant) brings his new bride to meet his two kindly aunts, he discovers that, among many other acts of charity, the two genteel ladies help lonely old men die happy ... by feeding them a wonderful meal before poisoning them. Now, Mortimer desperately wants to protect the two serial murderers he loves, stop them from killing anyone else and keep his bride from discovering how deranged his family really is.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Mystery & Suspense', 'Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': 'Raymond Massey, Frank Capra, Cary Grant', 'Language': 'Unqualified (DTS ES 6.1), English (Mono)', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '163719', 'Director': 'Frank Capra', 'Media Format': 'Multiple Formats, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 54 minutes', 'Release date': 'November 9, 2010', 'Actors': 'Cary Grant, Raymond Massey', 'Subtitles': 'French, English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: I love this movie. It a fun clean movie for the whole family. The expressions on Cary Grants face are hilarious.  Wish they would make more movies like this one!\nReview Title: Great Classic Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bishop's Wife, The (BD)\nReview Date: 2017/07/11\nStore: Cary Grant  (Actor),     Loretta Young  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Bishop's Wife, The (BD)\", 'Heavenly bells are ringing, jubilant choirs are singing, and Christmas joy is blanketing the world like freshly fallen snow. But the Yuletide spirit has yet to warm Bishop Henry Brougham’s Victorian home. Struggling to raise funds for a new cathedral, the preoccupied young clergyman has neglected his loving wife, Julia, and now only divine intervention can save their marriage! But the powerful and handsome angel sent from above has a mind of his own…and teaching mortal Henry an immortal lesson in romance isn’t all he has planned! Starring Oscar® winners Cary Grant, Loretta Young and David Niven*, and featuring “a stellar supporting cast” (The Hollywood Reporter), which includes James Gleason and Monty Woolley, this delightful romantic comedy is wondrous, witty and truly divine!', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'Cary Grant, Henry Koster, David Niven, Loretta Young', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000360166BR', 'Director': 'Henry Koster', 'Media Format': 'NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Cary Grant, Loretta Young, David Niven', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Wish they made more movies like this.  Its nice to have movies you dont have to be afraid to let your kids watch.  Refreshing, funny and just a good overall movie.\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pollyanna (Vault Disney Collection)\nReview Date: 2017/07/11\nStore: Hayley Mills  (Actor),     Jane Wyman  (Actor),     David Swift  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\nProduct Description: ['Product Description', 'Hayley Mills received a special Academy Award(R) for her performance as Pollyanna in this timeless Walt Disney tapestry of small-town Americana. Here you\\'ll meet Pollyanna, the orphan who brings sunshine into the lives of everyone she meets. But her Aunt Polly (Jane Wyman) is too concerned with appearances, propriety, and local politics to appreciate her effervescent niece. It isn\\'t until the town almost loses their \"Glad Girl\" that Aunt Polly realizes the power of love and lightheartedness. Featuring an impressive all-star cast and a story filled with fun, laughter, and tears, POLLYANNA will inspire your entire family and prove that the art of positive thinking is just as delightful today as it was at the turn of the century!|This was Hayley Mills\\' first film for Disney, and she immediately became the Studio\\'s newest star. She won an Academy Award(R) for the most outstanding juvenile performance of 1960.|The film was based on the 1913 book by Eleanor H. Porter. With a then lavish $2.5 million budget, director David Swift gathered a crew and cast unlike any other Disney live-action feature. Disney set decorator Emile Kuri was on hand but outsiders Walter Plunkett (costumes), Russell Harlan (cinematographers), and art directors Carroll Clark and Robert Clatworthy came from established careers at other studios.|To find a house to use as the residence of Aunt Polly, Walt Disney had to go far from his studio in Burbank. An ideal house was found in Santa Rosa, near Napa Valley. It occupied a full block in the center of town and was surrounded by spacious lawns and gardens. It was built in 1877 as a replica of an old Natchez, Mississippi, antebellum house. The vintage train station and water hole were also filmed in Santa Rosa, but the interiors were completed at the Disney Studio.', 'Amazon.com', \"Optimism shines in this classic 1960 Disney film starring Hayley Mills. When the newly orphaned Pollyanna comes to live with her wealthy aunt in Harrington Town, life looks promising. Despite her aunt's insistence on propriety and modesty, Pollyanna's cheerful, optimistic ways spread throughout the town--converting even a cantankerous recluse and a whining hypochondriac. Only Aunt Polly has trouble welcoming her young niece into her heart. In a clash between the townspeople and Aunt Polly over local politics, it's Pollyanna's influence that helps individual townspeople find the inner strength to stand up for their own beliefs. When Pollyanna is involved in a serious accident, Aunt Polly finally realizes how much she loves her niece. Can Aunt Polly and the entire town somehow restore Polly's optimism and ensure a full recovery?\", 'Pollyanna', 'is wholesome entertainment that will leave the entire family eager to play the \"glad game.\"', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, ACTION, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Nancy Olson, Richard Egan, Hayley Mills, Agnes Moorehead, Kevin Corcoran, James Drury, Karl Malden, Adolphe Menjou, David Swift, Jane Wyman, Reta ShawNancy Olson, Richard Egan, Hayley Mills, Agnes Moorehead, Kevin Corcoran, James Drury, Karl Malden, Adolphe Menjou, David Swift, Jane Wyman, Reta Shaw  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 14 minutes', 'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 3.2 Ounces', 'Item model number': '0078693614392', 'Director': 'David Swift', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'May 7, 2002', 'Actors': 'Hayley Mills, Jane Wyman, Nancy Olson, James Drury, Reta Shaw', 'Subtitles': 'Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Number of discs': '2'}\nReview Text: Another nice, clean refreshing movie for the whole family.  They dont make too many movies like this anymore.  So glad you can get clean wholesome movies on dvd. So much better than the trash that is on tv these days.\nReview Title: Wonderful movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: On Borrowed Time\nReview Date: 2017/07/11\nStore: Harold S. Bucquet  (Director),     Lionel Barrymore, Cedric Hardwicke, Beulah Bondi  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Death has come for Gramps Northrup. But Gramps has important work to do: raising his orphaned grandson. So he uses a bit of magic to trap Death in the branches of an apple tree. Clever work, Gramps! Or is it? With Death on hiatus, other folks whose time has come -- folks who are worn out, ill and in pain -- can't be released from their earthly suffering. And Gramps begins to wonder if he's done the right thing. From the beloved Paul Osborn play, this endearing fantasy of family, love and mortality moves effortlessly from rollicking to whimsical to tragic. Lionel Barrymore plays Gramps, leading a sterling cast of character stars, including Beulah Bondi, Una Merkel, Henry Travers and, as a most wry and gentlemanly Grim Reaper, Sir Cedric Hardwicke\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': 'Lionel Barrymore, Cedric Hardwicke, Beulah Bondi, Harold S. Bucquet', 'Language': 'Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Harold S. Bucquet', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 39 minutes', 'Release date': 'June 22, 2009', 'Actors': 'Lionel Barrymore, Cedric Hardwicke, Beulah Bondi', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Another wonderful old movie.  So much better than most of the trashy movies nowadays.  Nice to be able to watch a good clean movie!!!!!!!!\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/10/13\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Tobe Hooper'], 'Producers': ['Richard Kobritz'], 'Starring': ['David Soul', 'James Mason', 'Bonnie Bedelia'], 'Studio': ['AMC Plus Horror']}\nReview Text: One of the most terrifying movies ever!!  I love it, but still so horrifying I can't watch it alone, even in the daytime!!\nReview Title: Scary\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2022/02/18\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence'], 'Subtitles': ['None available'], 'Directors': ['Ken Klein'], 'Starring': ['Ken Klein'], 'Studio': ['Total Content Digital']}\nReview Text: I must agree with the person who said “everything makes sense now.”\nReview Title: Excellent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rodgers & Hammerstein's Cinderella\nReview Date: 2022/07/29\nStore: Ginger Rogers  (Actor),     Walter Pidgeon  (Actor),     Charles S. Dubin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: [\"CINDERELLA comes to life in this 50th Anniversary Edition of the most beloved fairy tale of all time. A sparkling fantasy of music, magic and romance, RODGERS & HAMMERSTEIN'S CINDERELLA captivates from overture to finale with a delightful score and stunning flittering performances from an all-star cast. Academy Award nominee Lesley Ann Warren is charming as the raggedy waif turned belle of the ball with Broadway star Stuart Damon as the Prince. Also starring Academy Award nominee Walter Pidgeon, Academy Award Winners Ginger Rogers and Celeste Hold as the Fairy Godmother, Cinderella will waltz into the hearts of the entire family and live happily ever after as one of the most irresistible musicals ever made.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Musicals & Performing Arts/Musicals/General', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Contributor': 'Celeste Holm, Walter Pidgeon, Charles S. Dubin, Ginger Rogers, Lesley Ann Warren', 'Language': 'English', 'Runtime': '1 hour and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'SFY15113DVD', 'Director': 'Charles S. Dubin', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '1 hour and 23 minutes', 'Release date': 'September 9, 2014', 'Actors': 'Ginger Rogers, Walter Pidgeon, Celeste Holm, Lesley Ann Warren', 'Subtitles': 'English, Spanish', 'Studio': 'SHOUT! FACTORY', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I absolutely love this beautiful musical adaptation of Cinderella. An outstanding cast of entertainers, especially the handsome Stuart Damon as the prince.  Watched it as a child when it first came on tv in 1965. I have bought the dvd, not only for myself but also for my grand daughter to watch since decent, moral shows, even cartoons are getting scarce. Rodgers and Hammerstein had the magic touch for so many movies. Their music is amazing. You can't go wrong with this musical, I love watching it and would give it 10 stars if I could.\nReview Title: Beautiful Musical Cinderella\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has expressed consistent enthusiasm for a variety of films across multiple genres. They appreciate extended editions that provide additional content, enhancing their viewing experience. They frequently highlight the quality of production, scenic visuals, and the emotional depth of stories. The user celebrates classic films, finding them refreshing and suitable for family viewing. Overall, the user demonstrates a strong affinity for movies that blend entertainment with wholesome, uplifting themes.\n\nNEGATIVE SUMMARY:\nWhile the user mostly shares positive reviews, they imply disappointment with the scarcity of modern, high-quality films compared to older classics. They also exhibit some discomfort with content in contemporary films, expressing a desire for more clean and moral storytelling. Specific instances of dislike toward \"trashy\" movies are noted, reflecting a concern over the current state of family-friendly film options.\n\nOVERALL SUMMARY:\nThe user's purchasing history reflects a profound love for classic and extended films, particularly those that offer rich emotional narratives and production quality. They favor content that is suitable for families, often lamenting the decline of wholesome movies in today's market. Despite their generally positive experiences, there is a notable frustration with the lack of appealing modern films, which they find less engaging compared to the timeless classics that fill their collection.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Good series",
    "text": "My husband and I watched this series the first time it was on tv. Since we couldn’t find it to watch it free anywhere on tv, we just bought the dvds. It’s a really good show and we have been enjoying watching some of the episodes every night.",
    "images": [],
    "asin": "B07BF2PQL7",
    "parent_asin": "B07BF2PQL7",
    "user_id": "AHOSYOBPI56HIJLCZJSHTX437KKQ",
    "timestamp": "2023-01-16 19:19:48.602000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Jericho: The Complete Series",
    "average_rating": 4.8,
    "rating_number": 1567,
    "features": [],
    "description": [
      "The residents of the small Kansas town of Jericho are isolated from the rest of the world after a terrorist attack results in a nuclear holocaust. Unsure if they're the only survivors left on the planet, they must stand together to overcome massive panic, fear and paranoia if any of them hope to make it out alive. CBS' gripping 2006-08 sci-fi drama stars Skeet Ulrich, Ashley Scott, Pamela Reed, and Gerald McRaney.29 episodes on 9 discs. 21 3/4 hrs. Widescreen (Enhanced); Soundtrack: English Dolby Digital 5.1; Subtitles: English, Spanish, Portuguese; audio commentary; featurettes; deleted scenes."
    ],
    "price": 22.49,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/511iAJGXcML._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/511iAJGXcML.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91Zr79OdtuL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51ER7fkqMML._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ER7fkqMML.jpg",
        "variant": "PT01",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/410WZyyTfuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/410WZyyTfuL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71cYUd2DSaL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Skeet Ulrich  (Actor),     Ashley Scott  (Actor)    Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "Paramount Home Entertainment",
      "Drama"
    ],
    "details": {
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 1.37 Pounds",
      "Item model number": "3876125",
      "Media Format": "AC-3, Box set, NTSC, Subtitled, Widescreen",
      "Run time": "21 hours and 52 minutes",
      "Release date": "June 5, 2018",
      "Actors": "Skeet Ulrich, Ashley Scott, Pamela Reed, Erik Knudsen, Kenneth Mitchell",
      "Subtitles": "Portuguese, Spanish, English",
      "Studio": "Paramount Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "9"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}