{
  "user_id": "AGEFGQNUBPAGS4JYBD664PSZKDNQ",
  "summary": "=== Purchase Information ===\nProduct Title: Tess of the d'Urbervilles\nReview Date: 2007/01/02\nStore: Justine Waddell  (Actor),     Jason Flemyng  (Actor),     Ian Sharp  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Justine Waddell. The poignant story of the beautiful Tess, who fights for love and personal happiness in the face of adversity. 1998/color/3 hrs/NR/fullscreen.', 'Amazon.com', 'No one does tragedies as well as Thomas Hardy, and this new BBC production of his', '1891 novel', \"is a peach. Tess is a teenager captured between happiness with an educated man (Oliver Milburn) and a dreadful existence with a scheming aristocrat (Jason Flemyng). Compared to Roman Polanski's 1980 Oscar-winning film\", 'Tess', \", the BBC version is far more interested in Hardy's text than in directorial exportations. Hence, the famous strawberry scene in which the aristocrat seduces the young Tess is just long enough to plumb the emotions; Polanski's version made the scene into a miniature classic of innocence and seduction. Both versions are worth seeing.\", \"Star Justine Waddell gives Tess more pluck and less innocence than Natassja Kinski does. She makes Tess a character to root for, which can lead to your own tragedy when working through Hardy's tale. The film doesn't have the drop-dead gorgeousness of Polanski's version but is quite beautiful. Director Ian Sharp keeps in line with Hardy's affection for rural settings and vistas. Flemyng is such a great cad it leads one to wonder what he might have done with Billy Zane's role in\", 'Titanic', '. Another winning adaptation of a classic from the BBC.', '--Doug Thomas']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.52 Ounces', 'Director': 'Ian Sharp', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '3 hours', 'Release date': 'March 25, 2003', 'Actors': 'Justine Waddell, Jason Flemyng, Oliver Milburn, John McEnery, Lesley Dunlop', 'Producers': 'Delia Fine, Sally Head, Sarah Wilson', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'A&E Home Video', 'Writers': 'Ted Whitehead, Thomas Hardy', 'Number of discs': '1'}\nReview Text: This version is soooooooooooo much better than the polanski one that one was boring this Tess has much better acting and is much more interesting. One day I was in the mood to watch this with my hubby at the starting of the film my sister& mother & niece came over they(all of them including hubby who has never seen it before ended up on really getting into it my mom was even talking about it the next day( if you knew my mother she is not that type of person) it is really  a good movie\nReview Title: This is one good movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: All the King's Men\nReview Date: 2007/01/22\nStore: Sean Penn  (Actor),     Jude Law  (Actor),     Steve Zaillian  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Oscar(r)-winning actor Sean Penn (Best Actor, Mystic River, 2003), two-time Academy Award(r) nominee Jude Law (Best Supporting Actor, The Talented Mr. Ripley, 1999; Best Actor, Cold Mountain, 2003), four-time Academy Award(r) nominee Kate Winslet (Best Supporting Actress, Sense and Sensibility, 1995; Iris, 2001, Best Actress, Titanic, 1997; Eternal Sunshine of the Spotless Mind, 2004), and Oscar(r) winner Anthony Hopkins (Best Actor, The Silence of the Lambs, 1991) star in this riveting story of a humble man's rise to political power and the destructive force of corruption and betrayal that would ultimately unravel his soul, based on Robert Penn Warren's 1946 classic Pulitzer Prize-winning novel. Willie Stark (Penn) is an ordinary man from a rural town, demanding that crooked politicians and shady businessmen in Lousiana be held accountable for the collapse of a poorly built school. Urged to run for Governor by a dubious political advisor, Tiny Duffy (three-time Emmy(r) Award winner\", 'Amazon.com', 'Sean Penn gives another powerhouse performance in', \"All the King's Men\", \", leading a topnotch cast in writer-director Steven Zaillian's underrated adaptation of the\", 'Pulitzer prize-winning 1946 novel', 'by Robert Penn Warren. When you consider that the previous', '1949 film version', \"earned well-deserved Academy Awards for director Robert Rossen and actors Broderick Crawford and Mercedes McCambridge, it's no surprise that Zaillian's film was expected to earn similar acclaim, but lukewarm critical reception and disappointing box-office gave it the stigma of a noble failure. And while the film (which moves Warren's story from the Depression-era '30s to the early 1950s) suffers from uneven pacing, partial miscasting, and an occasional lack of dramatic tension, it still qualifies as a first-class production that resonates with the timeless relevance of Warren's piercing political classic. Like Broderick before him, Penn is riveting as Louisiana governor Willie Stark, an upstart political dynamo (freely inspired by controversial real-life Louisiana governor Huey P. Long) whose rise to power is ultimately doomed by corruption and betrayal.\", \"Jude Law costars as political reporter Jack Burden, our firsthand witness to Stark's rise and inevitable fall; his orbit of political insiders includes a corrupt judge (Anthony Hopkins) with a dark secret to hide; a longtime friend (Mark Ruffalo) and former lover (Kate Winslet) who fall victim to Stark's influence; and political staffers (James Gandolfini, Patricia Clarkson) who remain powerless against Stark's ill-fated populist juggernaut. At Sean Penn's request, former child star Jackie Earle Haley (from the original\", 'Bad News Bears', ') makes a welcome return to movies as Willie Stark\\'s quietly intense bodyguard, \"Sugar-Boy.\" Coproduced by Louisiana-born political consultant James Carville, filmed on authentic Louisiana locations and boasting all the stately, luxurious production values of a would-be Oscar contender,', \"All the King's Men\", \"clearly benefits from Penn's fiery performance and Zaillian's earnest embrace of Warren's still-potent subject matter. And while the film's shortcomings may have prevented it from achieving unanimous acclaim, this is still a serious, well-crafted drama with much to say about the insidious potential for fascism in America, especially when well-meaning politicians lose their souls to power.\", '--Jeff Shannon', 'On the DVD', 'The special features that accompany', \"All the King's Men\", 'further demonstrate the film\\'s in-production status as a potential classic. While the \"making of\" featurette is perfunctory at best, the other featurettes are definitely worthwhile despite Sean Penn\\'s conspicuous absence. In \"Shake Hands with the Devil,\" the film\\'s cast, producer, and writer-director Steven Zaillian discuss the timeless theme of political corruption; \"An American Classic\" is a concise profile of Robert Penn Warren, paying tribute to the poet and author\\'s literary achievements; and \"The Legend and Lore of Huey Long\" examines the life and legacy of the still-beloved governor who won the hearts of working-class Louisianans while falling prey to his own ambition. \"LA Confidential\" is a brief featurette about the film\\'s use of authentic Louisiana locations and the positive effect they had on cast and crew; three deleted scenes were obviously cut from the film for purposes of time, yet offer ample proof of Zaillian\\'s established skill as one of Hollywood\\'s top screenwriters; and the alternate ending extends beyond the film\\'s final shot, with a funeral scene that serves as a melancholy (and ultimately unnecessary) coda to the film\\'s Greek-tragic drama.', '--Jeff Shannon']\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '043396114364', 'Director': 'Steve Zaillian', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'December 19, 2006', 'Actors': 'Sean Penn, Jude Law, Kate Winslet, Anthony Hopkins, James Gandolfini', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Steven Zaillian, Ken Lemberger, Mike Medavoy, Arnold Messer', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: I saw this at my sister's house she tends to buy DVDs she has never seen before just because she likes the actors but after she & I watch this she wished she had not bought it. It was boring.\nReview Title: BORING\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou - Caillou's World of Wonder\nReview Date: 2008/01/17\nStore: .  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: [\"Join Caillou in four fun adventures! In Caillou the Magnificent Caillou makes Rosie disappear and becomes the King of the Castle! In Caillou the Musician Caillou leads the marching band and sings with a friend! In Caillou the Sports Star Caillou realizes he's getting stronger every day and that it is okay to need his training wheels. In Caillou the Explorer Caillou imagines playing with the penguins and searching out alligators.\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Contributor': 'N/a, .', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.34 x 7.58 inches; 2.72 Ounces', 'Item model number': '884857', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 8, 2006', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nReview Title: Don't recommed Caillou\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alex Haley's Queen (DVD)\nReview Date: 2008/01/18\nStore: John Erman  (Director),     Halle Berry  (Actor),     Ann-Margret  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Mini-DVD, Television\nProduct Description: [\"Alex Haley's Queen (DVD)\", \"“There are two sides to every story”, or so the saying goes. For best-selling author Alex Haley, one side was Roots – the towering chronicle tracing seven generations of his mother's family. The other side comes to the screen in Alex Haley's Queen, the remarkable history of a paternal side of the author's family. David L. Wolper (Roots, The Thorn Birds) is the executive producer of this acclaimed adaption of the story Haley was working on when he died. Oscar® and Emmy® winner Halle Berry plays Queen, daughter of a slave and a plantation owner. During the turbulent decades of the antebellum South, the Civil War, Reconstruction and beyond, she searches for a home in the two cultures of her heritage – and at times is shunned by both. But rejection and hate are no match for her unconquerable will. Ann-Margret, Danny Glover, Martin Sheen and Ossie Davis also star in this poignant, uplifting final chapter of the Haley legacy.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Documentary, Drama, Historical', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Sada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul WinfieldSada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul Winfield  See more', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Item model number': '403898855', 'Director': 'John Erman', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 43 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Halle Berry, Ann-Margret, Tim Daly, Danny Glover, Dennis Haysbert', 'Subtitles': 'English', 'Producers': 'David L. Wolper, Mark M Wolper, Bernard Sofronski', 'Studio': 'Studio Distribution Services', 'Writers': 'David Stevens, Alex Haley', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I love this movie I remember watching it when I was a teen I couldn't wait for the next episodes to watch it is really entertaining true story.\nReview Title: Favorite Hallle Flick\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou - Caillou the Creative\nReview Date: 2008/02/12\nStore: .  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Join Caillou in four fun adventures! In Caillou the Artiste,Caillou makes something for Mommy and has a pizza party with Jeffrey and Jason. In Springtime for Caillou Caillou delivers his Valentines cards a special way. In Caillou Outdoors, Caillou helps Mommy make a scarecrow for the garden and discovers how much fun road trips can be. In Caillous Surprise, Caillou makes a cup for Mommy at Grandmas pottery class.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.38 x 7.41 inches; 2.72 Ounces', 'Item model number': 'PBSDCAIU621DVD', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'May 1, 2007', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nReview Title: Bad role model\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou's Holiday Movie [DVD]\nReview Date: 2008/02/12\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"Caillou's First Full-Length Animated Movie! When winter comes to Caillou's house, this curious 4-year-old tackles all kinds of big boy activities like helping Daddy shovel snow, making holiday presents for his family and even discovering the traditions of other little boys and girls around the world! And when Caillou learns about the spirit of the holidays, your little one will follow right along! Kids love Caillou for his real-world perspective on the life of a preschooler. Moms love Caillou for being a friend with whom their children can identify. Filled with the excitement and anticipation of holiday happenings, kids of all ages will love celebrating the season with Caillou! More than 90 minutes of frosty fun and eight all-new songs, too!\", 'DVD Features:', 'Challenges:', 'Six Caillou challenges', 'Interviews:', 'Animated interview with Caillou', 'Other:', \"Two holiday songs; 'Twas the Night Before Christmas story\", 'Amazon.com', 'Celebrate the 12 days of Christmas with Caillou and his family. Caillou receives a special advent calendar from his parents to count down the days until Christmas, and each night Caillou and his parents open a flap to discover a new picture of a holiday celebration somewhere in the world. As the family talks about different Christmas traditions, Caillou learns that a young boy in Germany started the tradition of the Christmas tree, that English school children made the first Christmas cards, and that Christmas stockings (and shoes) figure prominently in holiday celebrations in France and Hungary. He also learns about Hanukkah and the lighting of the Menorah from his friend Leo. As Caillou and his family enjoy their own holiday traditions, they discover the universal importance of giving and sharing. Music, including eight original songs, abounds in this 73-minute program. Unlike more typical', 'Caillou', 'episodes, there are no animated segments focusing on the interactions between Teddy, Rexi, and Gilbert in this presentation nor does Caillou find much to whine about in this festive season. DVD extras include an interview with Caillou, a holiday sing-along, and six challenges. (Ages 2 to 6)', '--Tami Horiuchi']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family, Romance', 'Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Run time': '1 hour and 13 minutes', 'Release date': 'October 7, 2003', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nReview Text: I don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nReview Title: Bad role model\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DNA vs. The Book of Mormon\nReview Date: 2008/04/16\nStore: Richard Southerton  (Actor),     Thomas Murphy  (Actor),     Joel Kramer  (Director),     Jeremy Reyes  (Director)    &                   1                  more   Format: DVD\nCategories: Movies & TV, Independently Distributed, Special Interests\nAverage Rating: 4.0\nProduct Details: {'Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Contributor': 'Thomas Murphy, Richard Southerton, Jeremy Reyes, Joel Kramer', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '49 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Director': 'Joel Kramer, Jeremy Reyes', 'Media Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Run time': '49 minutes', 'Release date': 'February 1, 2003', 'Actors': 'Richard Southerton, Thomas Murphy', 'Studio': 'Living Hope Ministries', 'Number of discs': '1'}\nReview Text: I am glad that this was made to show  Mormons that DNA research shows where Native American roots really come from.\nReview Title: interesting\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Semi-Pro (Unrated Edition)\nReview Date: 2008/06/19\nStore: Will Ferrell  (Actor),     Woody Harrelson  (Actor),     Kent Alterman  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Semi-Pro 2-Disc Special Edition (WS/DVD)', 'Will Ferrell stars in Semi-Pro, an outrageous comedy set in 1976 against the backdrop of the maverick ABA - a fast-paced, wild and crazy basketball league that rivaled the NBA and made a name for itself with innovations like the three-point shot and slam dunk contest. Ferrell plays Jackie Moon, a one-hit wonder who used the profits from the success of his chart-topping song \"Love Me Sexy\" to achieve his dream of owning a basketball team. But Moon\\'s franchise, the Flint Michigan Tropics, is the worst team in the league and in danger of folding when the ABA announces its plans to merge with the NBA. If they want to survive, Jackie and the Tropics must now do the seemingly impossible - win.', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Sports, Comedy', 'Format': 'Multiple Formats, Color, AC-3, NTSC, Dolby, Full Screen, Subtitled, Special Edition, Widescreen', 'Contributor': 'Rob Corddry, DeRay Davis, David Koechner, Scot Armstrong, Woody Harrelson, Jimmy Miller, Will Ferrell, Maura Tierney, Kent Alterman, Will Arnett, Jackie Earle Haley, Andy Richter, Andre BenjaminRob Corddry, DeRay Davis, David Koechner, Scot Armstrong, Woody Harrelson, Jimmy Miller, Will Ferrell, Maura Tierney, Kent Alterman, Will Arnett, Jackie Earle Haley, Andy Richter, Andre Benjamin  See more', 'Language': 'English (Dolby Digital 5.1 EX)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 4.25 x 1.12 inches; 2.88 Ounces', 'Item model number': '1000038648', 'Director': 'Kent Alterman', 'Media Format': 'Multiple Formats, Color, AC-3, NTSC, Dolby, Full Screen, Subtitled, Special Edition, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Will Ferrell, Woody Harrelson, Andre Benjamin, Maura Tierney, Will Arnett', 'Subtitles': 'English, Spanish', 'Producers': 'Jimmy Miller', 'Studio': 'WarnerBrothers', 'Writers': 'Scot Armstrong', 'Number of discs': '2'}\nReview Text: This movie is really vulgar and not funny at all. I like most of his films. I didn't even want to finish it it's that bad.\nReview Title: Worst movie he ever made\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tropic Thunder\nReview Date: 2008/11/19\nStore: Ben Stiller  (Actor, Director, Writer),     Jack Black  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: ['Product Description', 'In the action comedy \"Tropic Thunder,\" a group of actors shooting a war movie is led by Tugg Speedman (Ben Stiller), a pampered action superstar, Kirk Lazarus (Robert Downey Jr.), an over-the-top Australian-born method actor who has gone to extremes to get into character, and Jeff Portnoy (Jack Black), a gross-out comedy star.', 'Amazon.com', \"It's not really a knock to say that nothing in\", 'Tropic Thunder', \"is funnier than its first five minutes, so sly that--especially for people watching in theaters--you don't realize right away they\", 'are', 'the opening minutes of the movie. This outrageous comedy begins with a series of fake previews, each introducing one of the main characters in the film-proper (not that there\\'s anything proper about this film) and each bearing the familiar logo of a different motion picture studio: Universal, DreamWorks SKG, et al. Such playing fast and loose with corporate talismans verges on sacrilege, but it\\'s an index of how much le tout Tinseltown endorses the movie as a demented valentine to itself. The premise is that the cast of a would-be \"Son of Rambo\" movie shooting in some Southeast Asian jungle get into a real shooting war with drug-smuggling montagnards. Don\\'t ask--though the movie does have an answer--why such highly paid, usually ultra-pampered personnel as superhero Tugg Speedman (Ben Stiller), Mozart of fart comedy Jeff Portnoy (Jack Black), hip-hop artist Alpa Chino (Brandon T. Jackson), and five-time Oscar-winner Kirk Lazarus from Aus-try-leeah (Robert Downey Jr.) should be running through the jungle unattended and very vulnerable. It matters only that the real-life cast has a high time kidding their own profession and flexing their comedic muscles. Bonus points go to Stiller for co-writing the script (with Justin Theroux) and directing, and to Downey, brilliant as a white actor surgically turned black actor for his role and utterly committed to staying in character no matter what (\"I don\\'t drop character till I done the DVD commentary\").', 'Be warned: The movie, too, is committed--to being an equal-opportunity offender. Its political incorrectness extends not only to Lazarus\\'s black-like-me posturing but also Speedman\\'s recent, Sean Penn\\x96style Oscar bid playing a cognitively challenged farmboy--or, in Lazarus\\'s deathless phrase, \"going the full retard.\" Others in the cast include Steve Coogan as a director out of his depth, Nick Nolte as the Viet-vet novelist whose book inspired the film-within-the-film, Matthew McConaughey as Speedman\\'s sun-blissed agent back home, and Tom Cruise--bald, fat-suited, and profane--as an epically repulsive studio head. Two hours running time is a mite excessive, but otherwise, what\\'s not to like?', '--Richard T. Jameson', 'Stills from', 'Tropic Thunder', '(Click for larger image)']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Military & War, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Justin Theroux, Anthony Ruivivar, David Pressman, Brandon T. Jackson, Matt Levin, Etan Cohen, Ben Stiller, Jeff Kahn, Valerie Azlynn, Robert Downey Jr., Jack Black, Jay Baruchel, Eric Winzenried, Steve CooganJustin Theroux, Anthony Ruivivar, David Pressman, Brandon T. Jackson, Matt Levin, Etan Cohen, Ben Stiller, Jeff Kahn, Valerie Azlynn, Robert Downey Jr., Jack Black, Jay Baruchel, Eric Winzenried, Steve Coogan  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.57 x 5.47 x 7.48 inches; 2.88 Ounces', 'Item model number': 'MFR097363501541#VG', 'Director': 'Ben Stiller', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Ben Stiller, Jack Black, Robert Downey Jr., Jeff Kahn, Anthony Ruivivar', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Dreamworks Video', 'Writers': 'Ben Stiller, Etan Cohen, Justin Theroux', 'Number of discs': '1'}\nReview Text: I like Ben but it has way too much foul language and Tom Cruise looks horrible and his Character is not likeable. If you think cussing and putting down others with foul language funny then you will like this. This movie is not for children.\nReview Title: Vulgar\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Baby Genius: A Trip to the San Diego Zoo\nReview Date: 2011/04/04\nStore: Artist Not Provided  (Actor),     Pacific  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Special Interests\nProduct Description: ['This outstanding collection of Baby Genius DVDs includes themes about playtime outings and little children interacting in the events and places around them. The focus is on entertainment and teaching children in an environment filled with fun and adventure. Animation is combined with children\\x92s songs and includes fun-loving Baby Genius characters like DJ the Dinosaur, Vinko the Dancing Bear and more']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '10408278', 'Director': 'Pacific', 'Media Format': 'Color, Multiple Formats, NTSC, Full Screen, Animated, Digital Sound', 'Run time': '30 minutes', 'Release date': 'November 14, 2006', 'Actors': 'Artist Not Provided', 'Dubbed': 'Spanish', 'Language': 'Unqualified', 'Studio': 'Pacific Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My one year old Daughter loves this. I love how it shows so many different animals. It looks like the zoo cleaned up the park because it looks cleaner than usual. The animals have  way more energy than when I have been there in person usually they hide out or are sleeping but on this video they are really fun to watch. They even have a counting song thats catchy too.  It's my favorite Baby Genius Dvd. People complain about the pop up cartoons but that just makes it more fun for the kids to watch. I also enjoy the classical music that plays while they show the animals.\nReview Title: Great DVD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jojo's Circus - Animal a Go Go\nReview Date: 2011/09/07\nStore: Madeleine Martin  (Actor),     Robert Smith  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: [\"Laaadies and Gentlemen, boys and girls ... it's time to get up and move with JOJO'S CIRCUS: ANIMAL A GO-GO. Join JoJo, a funny, curious clown and her best friend, Goliath, in stories full of music, dance, imaginative movement, engaging games, and activities that encourage your child to get up and start moving. Child participation is part of the fun in four lively stories. There are bouncy moves ahead when JoJo discovers that she's not quite ready to fill some pretty big shoes. But she's always ready to figure things out, including learning a silly slinky snake dance to help pick a flower for her dad. From using teamwork to helping Goliath learn, your child will discover valuable lessons about kindness, teamwork, and belonging.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Preschool', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Animated', 'Contributor': 'Noah Weisberg, Robert Smith, Andy Yerkes, Taylor Masamitsu, Shelly Goldstein, Marnie McPhail, Kathryn Greenwood, Madeleine Martin, Tony Daniels, Diana Peressini, David Sparrow, Jayne Eastwood, Tajja Isen, Austin Di IulioNoah Weisberg, Robert Smith, Andy Yerkes, Taylor Masamitsu, Shelly Goldstein, Marnie McPhail, Kathryn Greenwood, Madeleine Martin, Tony Daniels, Diana Peressini, David Sparrow, Jayne Eastwood, Tajja Isen, Austin Di Iulio  See more', 'Language': 'Unqualified', 'Runtime': '50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '2259969', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Animated', 'Run time': '50 minutes', 'Release date': 'March 21, 2005', 'Actors': 'Madeleine Martin, Robert Smith, Diana Peressini, Jayne Eastwood, Marnie McPhail', 'Studio': 'Buena Vista Home Entertainment / Disney', 'Writers': 'Andy Yerkes, Shelly Goldstein', 'Number of discs': '1'}\nReview Text: I really enjoyed watching this with my child. I own the Animal Go Go and The Take A Bow dvd if any one is debating which one is better. I think The Animal Go Go is better of the two.\nReview Title: Fun for Parent and Kids\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Little Rascals, Vol. 7\nReview Date: 2011/10/22\nStore: George &#34  (Actor),     Spanky&#34  (Actor),     -  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Volume 7 includes shorts spanning from 1937-1938.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Full Screen, NTSC, Black & White', 'Contributor': 'Thomas, McFarland, Alfalfa&#34, Billie &#34, George &#34, Spanky&#34, Carl &#34, Jackie Cooper, Switzer, -, Buckwheat&#34Thomas, McFarland, Alfalfa&#34, Billie &#34, George &#34, Spanky&#34, Carl &#34, Jackie Cooper, Switzer, -, Buckwheat&#34  See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6788169', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Black & White', 'Run time': '3 hours and 14 minutes', 'Release date': 'June 14, 2011', 'Actors': 'George &#34, Spanky&#34, McFarland, Carl &#34, Alfalfa&#34', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nReview Text: If you don't want to buy all the Little Rascals dvd volumes and you wonder which one has Spanky, Alfalfa,and Darla this one has them. This dvd is one of the better volume to get.\nReview Title: This one has Spanky,Alfalfa and Darla\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Love on the Land - From the Producers of Anne of Green Gables\nReview Date: 2012/04/19\nStore: Peter Strauss  (Actor),     Rachel Ward  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Thomas Linthorne is a farmer, who, with his bride, Kate, settles a parcel of untilled Midwestern farmland in 1866. Linthorne is a dynamic and driven man who eventually becomes a pillar of the close-knit community. But there are trials and tribulations that eventually plague his dreams of the perfect life he has tried to create for his family. Over the span of fifty years, the Linthorne family will weather more than their share of hardship that affects each of them in dramatic ways. The Linthorne saga, set against the daily rituals and chores of life on the land, reveals the determination, strength and indomitable spirit of the families who settled America.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Daniel Petrie, Rachel Ward, John Finn, Rip Torn, Kevin Sullivan, Peter Strauss, Chandra West', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': 'SULDV23132', 'Director': 'Daniel Petrie', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 57 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Peter Strauss, Rachel Ward, Rip Torn, John Finn, Chandra West', 'Producers': 'Kevin Sullivan', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: My mom watched this a least 5 times while she stayed over my house for a few days. If you knew my mom you would know this is not her normal behavior. I had a feeling she would like it, but I didn't think she would ask to watch it this much. I really liked it too. I thought the acting was perfect. I loved the scenery and music in the start of the film. Yes it is not Green Gables but it never claimed to be. If you look on the cover you can figure that out.\nReview Title: My mom loved this!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/02/20\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['---'], 'Studio': ['Line Upon Line Productions']}\nReview Text: I want to recommend the movie The Bible vs The Book of Mormon. It is very interesting to watch. PLEASE LOOK INTO IT.\nReview Title: heres some good advice\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/09/07\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duane Barnhart'], 'Producers': ['Duane Barnhart', 'Kirk Cameron', 'Angie Alvarez', 'John Bona', 'Bill Hough', 'Mark Gambee'], 'Starring': ['Kirk Cameron'], 'Studio': ['GoDigital']}\nReview Text: Very interesting almost didn't watch glad I did. I learned about the pilgrims and their beliefs.  If your on the fence give it a shot worth watching for sure.\nReview Title: Worth Your Time\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/11/26\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Byron Howard', 'Rich Moore'], 'Producers': ['Clark Spencer'], 'Starring': ['Ginnifer Goodwin', 'Jason Bateman', 'Idris Elba'], 'Studio': ['Walt Disney Animation Studios']}\nReview Text: Didn't like parts the movie. Don't like the Try Everything message. Had to have a talk with my daughter about there is some things you don't try (illegal drugs). Don't like the yoga scene with the naturalist reference.\nReview Title: My opinion\nRating: 1.0\n--------------------------------------------------",
  "reference": "Tess of the d'Urbervilles\nJustine Waddell  (Actor),     Jason Flemyng  (Actor),     Ian Sharp  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Justine Waddell. The poignant story of the beautiful Tess, who fights for love and personal happiness in the face of adversity. 1998/color/3 hrs/NR/fullscreen.', 'Amazon.com', 'No one does tragedies as well as Thomas Hardy, and this new BBC production of his', '1891 novel', \"is a peach. Tess is a teenager captured between happiness with an educated man (Oliver Milburn) and a dreadful existence with a scheming aristocrat (Jason Flemyng). Compared to Roman Polanski's 1980 Oscar-winning film\", 'Tess', \", the BBC version is far more interested in Hardy's text than in directorial exportations. Hence, the famous strawberry scene in which the aristocrat seduces the young Tess is just long enough to plumb the emotions; Polanski's version made the scene into a miniature classic of innocence and seduction. Both versions are worth seeing.\", \"Star Justine Waddell gives Tess more pluck and less innocence than Natassja Kinski does. She makes Tess a character to root for, which can lead to your own tragedy when working through Hardy's tale. The film doesn't have the drop-dead gorgeousness of Polanski's version but is quite beautiful. Director Ian Sharp keeps in line with Hardy's affection for rural settings and vistas. Flemyng is such a great cad it leads one to wonder what he might have done with Billy Zane's role in\", 'Titanic', '. Another winning adaptation of a classic from the BBC.', '--Doug Thomas']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.52 Ounces', 'Director': 'Ian Sharp', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '3 hours', 'Release date': 'March 25, 2003', 'Actors': 'Justine Waddell, Jason Flemyng, Oliver Milburn, John McEnery, Lesley Dunlop', 'Producers': 'Delia Fine, Sally Head, Sarah Wilson', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'A&E Home Video', 'Writers': 'Ted Whitehead, Thomas Hardy', 'Number of discs': '1'}\nThis version is soooooooooooo much better than the polanski one that one was boring this Tess has much better acting and is much more interesting. One day I was in the mood to watch this with my hubby at the starting of the film my sister& mother & niece came over they(all of them including hubby who has never seen it before ended up on really getting into it my mom was even talking about it the next day( if you knew my mother she is not that type of person) it is really  a good movie\nThis is one good movie\nAll the King's Men\nSean Penn  (Actor),     Jude Law  (Actor),     Steve Zaillian  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Oscar(r)-winning actor Sean Penn (Best Actor, Mystic River, 2003), two-time Academy Award(r) nominee Jude Law (Best Supporting Actor, The Talented Mr. Ripley, 1999; Best Actor, Cold Mountain, 2003), four-time Academy Award(r) nominee Kate Winslet (Best Supporting Actress, Sense and Sensibility, 1995; Iris, 2001, Best Actress, Titanic, 1997; Eternal Sunshine of the Spotless Mind, 2004), and Oscar(r) winner Anthony Hopkins (Best Actor, The Silence of the Lambs, 1991) star in this riveting story of a humble man's rise to political power and the destructive force of corruption and betrayal that would ultimately unravel his soul, based on Robert Penn Warren's 1946 classic Pulitzer Prize-winning novel. Willie Stark (Penn) is an ordinary man from a rural town, demanding that crooked politicians and shady businessmen in Lousiana be held accountable for the collapse of a poorly built school. Urged to run for Governor by a dubious political advisor, Tiny Duffy (three-time Emmy(r) Award winner\", 'Amazon.com', 'Sean Penn gives another powerhouse performance in', \"All the King's Men\", \", leading a topnotch cast in writer-director Steven Zaillian's underrated adaptation of the\", 'Pulitzer prize-winning 1946 novel', 'by Robert Penn Warren. When you consider that the previous', '1949 film version', \"earned well-deserved Academy Awards for director Robert Rossen and actors Broderick Crawford and Mercedes McCambridge, it's no surprise that Zaillian's film was expected to earn similar acclaim, but lukewarm critical reception and disappointing box-office gave it the stigma of a noble failure. And while the film (which moves Warren's story from the Depression-era '30s to the early 1950s) suffers from uneven pacing, partial miscasting, and an occasional lack of dramatic tension, it still qualifies as a first-class production that resonates with the timeless relevance of Warren's piercing political classic. Like Broderick before him, Penn is riveting as Louisiana governor Willie Stark, an upstart political dynamo (freely inspired by controversial real-life Louisiana governor Huey P. Long) whose rise to power is ultimately doomed by corruption and betrayal.\", \"Jude Law costars as political reporter Jack Burden, our firsthand witness to Stark's rise and inevitable fall; his orbit of political insiders includes a corrupt judge (Anthony Hopkins) with a dark secret to hide; a longtime friend (Mark Ruffalo) and former lover (Kate Winslet) who fall victim to Stark's influence; and political staffers (James Gandolfini, Patricia Clarkson) who remain powerless against Stark's ill-fated populist juggernaut. At Sean Penn's request, former child star Jackie Earle Haley (from the original\", 'Bad News Bears', ') makes a welcome return to movies as Willie Stark\\'s quietly intense bodyguard, \"Sugar-Boy.\" Coproduced by Louisiana-born political consultant James Carville, filmed on authentic Louisiana locations and boasting all the stately, luxurious production values of a would-be Oscar contender,', \"All the King's Men\", \"clearly benefits from Penn's fiery performance and Zaillian's earnest embrace of Warren's still-potent subject matter. And while the film's shortcomings may have prevented it from achieving unanimous acclaim, this is still a serious, well-crafted drama with much to say about the insidious potential for fascism in America, especially when well-meaning politicians lose their souls to power.\", '--Jeff Shannon', 'On the DVD', 'The special features that accompany', \"All the King's Men\", 'further demonstrate the film\\'s in-production status as a potential classic. While the \"making of\" featurette is perfunctory at best, the other featurettes are definitely worthwhile despite Sean Penn\\'s conspicuous absence. In \"Shake Hands with the Devil,\" the film\\'s cast, producer, and writer-director Steven Zaillian discuss the timeless theme of political corruption; \"An American Classic\" is a concise profile of Robert Penn Warren, paying tribute to the poet and author\\'s literary achievements; and \"The Legend and Lore of Huey Long\" examines the life and legacy of the still-beloved governor who won the hearts of working-class Louisianans while falling prey to his own ambition. \"LA Confidential\" is a brief featurette about the film\\'s use of authentic Louisiana locations and the positive effect they had on cast and crew; three deleted scenes were obviously cut from the film for purposes of time, yet offer ample proof of Zaillian\\'s established skill as one of Hollywood\\'s top screenwriters; and the alternate ending extends beyond the film\\'s final shot, with a funeral scene that serves as a melancholy (and ultimately unnecessary) coda to the film\\'s Greek-tragic drama.', '--Jeff Shannon']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '043396114364', 'Director': 'Steve Zaillian', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'December 19, 2006', 'Actors': 'Sean Penn, Jude Law, Kate Winslet, Anthony Hopkins, James Gandolfini', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Steven Zaillian, Ken Lemberger, Mike Medavoy, Arnold Messer', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI saw this at my sister's house she tends to buy DVDs she has never seen before just because she likes the actors but after she & I watch this she wished she had not bought it. It was boring.\nBORING\nCaillou - Caillou's World of Wonder\n.  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"Join Caillou in four fun adventures! In Caillou the Magnificent Caillou makes Rosie disappear and becomes the King of the Castle! In Caillou the Musician Caillou leads the marching band and sings with a friend! In Caillou the Sports Star Caillou realizes he's getting stronger every day and that it is okay to need his training wheels. In Caillou the Explorer Caillou imagines playing with the penguins and searching out alligators.\"]\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Contributor': 'N/a, .', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.34 x 7.58 inches; 2.72 Ounces', 'Item model number': '884857', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 8, 2006', 'Studio': 'PBS', 'Number of discs': '1'}\nI don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nDon't recommed Caillou\nAlex Haley's Queen (DVD)\nJohn Erman  (Director),     Halle Berry  (Actor),     Ann-Margret  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Mini-DVD, Television\n[\"Alex Haley's Queen (DVD)\", \"“There are two sides to every story”, or so the saying goes. For best-selling author Alex Haley, one side was Roots – the towering chronicle tracing seven generations of his mother's family. The other side comes to the screen in Alex Haley's Queen, the remarkable history of a paternal side of the author's family. David L. Wolper (Roots, The Thorn Birds) is the executive producer of this acclaimed adaption of the story Haley was working on when he died. Oscar® and Emmy® winner Halle Berry plays Queen, daughter of a slave and a plantation owner. During the turbulent decades of the antebellum South, the Civil War, Reconstruction and beyond, she searches for a home in the two cultures of her heritage – and at times is shunned by both. But rejection and hate are no match for her unconquerable will. Ann-Margret, Danny Glover, Martin Sheen and Ossie Davis also star in this poignant, uplifting final chapter of the Haley legacy.\", ']]>']\n{'Genre': 'Documentary, Drama, Historical', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Sada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul WinfieldSada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul Winfield  See more', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Item model number': '403898855', 'Director': 'John Erman', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 43 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Halle Berry, Ann-Margret, Tim Daly, Danny Glover, Dennis Haysbert', 'Subtitles': 'English', 'Producers': 'David L. Wolper, Mark M Wolper, Bernard Sofronski', 'Studio': 'Studio Distribution Services', 'Writers': 'David Stevens, Alex Haley', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI love this movie I remember watching it when I was a teen I couldn't wait for the next episodes to watch it is really entertaining true story.\nFavorite Hallle Flick\nCaillou - Caillou the Creative\n.  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Join Caillou in four fun adventures! In Caillou the Artiste,Caillou makes something for Mommy and has a pizza party with Jeffrey and Jason. In Springtime for Caillou Caillou delivers his Valentines cards a special way. In Caillou Outdoors, Caillou helps Mommy make a scarecrow for the garden and discovers how much fun road trips can be. In Caillous Surprise, Caillou makes a cup for Mommy at Grandmas pottery class.']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.38 x 7.41 inches; 2.72 Ounces', 'Item model number': 'PBSDCAIU621DVD', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'May 1, 2007', 'Studio': 'PBS', 'Number of discs': '1'}\nI don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nBad role model\nCaillou's Holiday Movie [DVD]\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Caillou's First Full-Length Animated Movie! When winter comes to Caillou's house, this curious 4-year-old tackles all kinds of big boy activities like helping Daddy shovel snow, making holiday presents for his family and even discovering the traditions of other little boys and girls around the world! And when Caillou learns about the spirit of the holidays, your little one will follow right along! Kids love Caillou for his real-world perspective on the life of a preschooler. Moms love Caillou for being a friend with whom their children can identify. Filled with the excitement and anticipation of holiday happenings, kids of all ages will love celebrating the season with Caillou! More than 90 minutes of frosty fun and eight all-new songs, too!\", 'DVD Features:', 'Challenges:', 'Six Caillou challenges', 'Interviews:', 'Animated interview with Caillou', 'Other:', \"Two holiday songs; 'Twas the Night Before Christmas story\", 'Amazon.com', 'Celebrate the 12 days of Christmas with Caillou and his family. Caillou receives a special advent calendar from his parents to count down the days until Christmas, and each night Caillou and his parents open a flap to discover a new picture of a holiday celebration somewhere in the world. As the family talks about different Christmas traditions, Caillou learns that a young boy in Germany started the tradition of the Christmas tree, that English school children made the first Christmas cards, and that Christmas stockings (and shoes) figure prominently in holiday celebrations in France and Hungary. He also learns about Hanukkah and the lighting of the Menorah from his friend Leo. As Caillou and his family enjoy their own holiday traditions, they discover the universal importance of giving and sharing. Music, including eight original songs, abounds in this 73-minute program. Unlike more typical', 'Caillou', 'episodes, there are no animated segments focusing on the interactions between Teddy, Rexi, and Gilbert in this presentation nor does Caillou find much to whine about in this festive season. DVD extras include an interview with Caillou, a holiday sing-along, and six challenges. (Ages 2 to 6)', '--Tami Horiuchi']\n{'Genre': 'Kids & Family, Romance', 'Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Run time': '1 hour and 13 minutes', 'Release date': 'October 7, 2003', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nI don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nBad role model\nDNA vs. The Book of Mormon\nRichard Southerton  (Actor),     Thomas Murphy  (Actor),     Joel Kramer  (Director),     Jeremy Reyes  (Director)    &                   1                  more   Format: DVD\nMovies & TV, Independently Distributed, Special Interests\n{'Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Contributor': 'Thomas Murphy, Richard Southerton, Jeremy Reyes, Joel Kramer', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '49 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Director': 'Joel Kramer, Jeremy Reyes', 'Media Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Run time': '49 minutes', 'Release date': 'February 1, 2003', 'Actors': 'Richard Southerton, Thomas Murphy', 'Studio': 'Living Hope Ministries', 'Number of discs': '1'}\nI am glad that this was made to show  Mormons that DNA research shows where Native American roots really come from.\ninteresting\nSemi-Pro (Unrated Edition)\nWill Ferrell  (Actor),     Woody Harrelson  (Actor),     Kent Alterman  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Semi-Pro 2-Disc Special Edition (WS/DVD)', 'Will Ferrell stars in Semi-Pro, an outrageous comedy set in 1976 against the backdrop of the maverick ABA - a fast-paced, wild and crazy basketball league that rivaled the NBA and made a name for itself with innovations like the three-point shot and slam dunk contest. Ferrell plays Jackie Moon, a one-hit wonder who used the profits from the success of his chart-topping song \"Love Me Sexy\" to achieve his dream of owning a basketball team. But Moon\\'s franchise, the Flint Michigan Tropics, is the worst team in the league and in danger of folding when the ABA announces its plans to merge with the NBA. If they want to survive, Jackie and the Tropics must now do the seemingly impossible - win.', ']]>']\n{'Genre': 'Drama/Sports, Comedy', 'Format': 'Multiple Formats, Color, AC-3, NTSC, Dolby, Full Screen, Subtitled, Special Edition, Widescreen', 'Contributor': 'Rob Corddry, DeRay Davis, David Koechner, Scot Armstrong, Woody Harrelson, Jimmy Miller, Will Ferrell, Maura Tierney, Kent Alterman, Will Arnett, Jackie Earle Haley, Andy Richter, Andre BenjaminRob Corddry, DeRay Davis, David Koechner, Scot Armstrong, Woody Harrelson, Jimmy Miller, Will Ferrell, Maura Tierney, Kent Alterman, Will Arnett, Jackie Earle Haley, Andy Richter, Andre Benjamin  See more', 'Language': 'English (Dolby Digital 5.1 EX)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 4.25 x 1.12 inches; 2.88 Ounces', 'Item model number': '1000038648', 'Director': 'Kent Alterman', 'Media Format': 'Multiple Formats, Color, AC-3, NTSC, Dolby, Full Screen, Subtitled, Special Edition, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Will Ferrell, Woody Harrelson, Andre Benjamin, Maura Tierney, Will Arnett', 'Subtitles': 'English, Spanish', 'Producers': 'Jimmy Miller', 'Studio': 'WarnerBrothers', 'Writers': 'Scot Armstrong', 'Number of discs': '2'}\nThis movie is really vulgar and not funny at all. I like most of his films. I didn't even want to finish it it's that bad.\nWorst movie he ever made\nTropic Thunder\nBen Stiller  (Actor, Director, Writer),     Jack Black  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['Product Description', 'In the action comedy \"Tropic Thunder,\" a group of actors shooting a war movie is led by Tugg Speedman (Ben Stiller), a pampered action superstar, Kirk Lazarus (Robert Downey Jr.), an over-the-top Australian-born method actor who has gone to extremes to get into character, and Jeff Portnoy (Jack Black), a gross-out comedy star.', 'Amazon.com', \"It's not really a knock to say that nothing in\", 'Tropic Thunder', \"is funnier than its first five minutes, so sly that--especially for people watching in theaters--you don't realize right away they\", 'are', 'the opening minutes of the movie. This outrageous comedy begins with a series of fake previews, each introducing one of the main characters in the film-proper (not that there\\'s anything proper about this film) and each bearing the familiar logo of a different motion picture studio: Universal, DreamWorks SKG, et al. Such playing fast and loose with corporate talismans verges on sacrilege, but it\\'s an index of how much le tout Tinseltown endorses the movie as a demented valentine to itself. The premise is that the cast of a would-be \"Son of Rambo\" movie shooting in some Southeast Asian jungle get into a real shooting war with drug-smuggling montagnards. Don\\'t ask--though the movie does have an answer--why such highly paid, usually ultra-pampered personnel as superhero Tugg Speedman (Ben Stiller), Mozart of fart comedy Jeff Portnoy (Jack Black), hip-hop artist Alpa Chino (Brandon T. Jackson), and five-time Oscar-winner Kirk Lazarus from Aus-try-leeah (Robert Downey Jr.) should be running through the jungle unattended and very vulnerable. It matters only that the real-life cast has a high time kidding their own profession and flexing their comedic muscles. Bonus points go to Stiller for co-writing the script (with Justin Theroux) and directing, and to Downey, brilliant as a white actor surgically turned black actor for his role and utterly committed to staying in character no matter what (\"I don\\'t drop character till I done the DVD commentary\").', 'Be warned: The movie, too, is committed--to being an equal-opportunity offender. Its political incorrectness extends not only to Lazarus\\'s black-like-me posturing but also Speedman\\'s recent, Sean Penn\\x96style Oscar bid playing a cognitively challenged farmboy--or, in Lazarus\\'s deathless phrase, \"going the full retard.\" Others in the cast include Steve Coogan as a director out of his depth, Nick Nolte as the Viet-vet novelist whose book inspired the film-within-the-film, Matthew McConaughey as Speedman\\'s sun-blissed agent back home, and Tom Cruise--bald, fat-suited, and profane--as an epically repulsive studio head. Two hours running time is a mite excessive, but otherwise, what\\'s not to like?', '--Richard T. Jameson', 'Stills from', 'Tropic Thunder', '(Click for larger image)']\n{'Genre': 'Military & War, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Justin Theroux, Anthony Ruivivar, David Pressman, Brandon T. Jackson, Matt Levin, Etan Cohen, Ben Stiller, Jeff Kahn, Valerie Azlynn, Robert Downey Jr., Jack Black, Jay Baruchel, Eric Winzenried, Steve CooganJustin Theroux, Anthony Ruivivar, David Pressman, Brandon T. Jackson, Matt Levin, Etan Cohen, Ben Stiller, Jeff Kahn, Valerie Azlynn, Robert Downey Jr., Jack Black, Jay Baruchel, Eric Winzenried, Steve Coogan  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.57 x 5.47 x 7.48 inches; 2.88 Ounces', 'Item model number': 'MFR097363501541#VG', 'Director': 'Ben Stiller', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Ben Stiller, Jack Black, Robert Downey Jr., Jeff Kahn, Anthony Ruivivar', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Dreamworks Video', 'Writers': 'Ben Stiller, Etan Cohen, Justin Theroux', 'Number of discs': '1'}\nI like Ben but it has way too much foul language and Tom Cruise looks horrible and his Character is not likeable. If you think cussing and putting down others with foul language funny then you will like this. This movie is not for children.\nVulgar\nBaby Genius: A Trip to the San Diego Zoo\nArtist Not Provided  (Actor),     Pacific  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n['This outstanding collection of Baby Genius DVDs includes themes about playtime outings and little children interacting in the events and places around them. The focus is on entertainment and teaching children in an environment filled with fun and adventure. Animation is combined with children\\x92s songs and includes fun-loving Baby Genius characters like DJ the Dinosaur, Vinko the Dancing Bear and more']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '10408278', 'Director': 'Pacific', 'Media Format': 'Color, Multiple Formats, NTSC, Full Screen, Animated, Digital Sound', 'Run time': '30 minutes', 'Release date': 'November 14, 2006', 'Actors': 'Artist Not Provided', 'Dubbed': 'Spanish', 'Language': 'Unqualified', 'Studio': 'Pacific Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy one year old Daughter loves this. I love how it shows so many different animals. It looks like the zoo cleaned up the park because it looks cleaner than usual. The animals have  way more energy than when I have been there in person usually they hide out or are sleeping but on this video they are really fun to watch. They even have a counting song thats catchy too.  It's my favorite Baby Genius Dvd. People complain about the pop up cartoons but that just makes it more fun for the kids to watch. I also enjoy the classical music that plays while they show the animals.\nGreat DVD\nJojo's Circus - Animal a Go Go\nMadeleine Martin  (Actor),     Robert Smith  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"Laaadies and Gentlemen, boys and girls ... it's time to get up and move with JOJO'S CIRCUS: ANIMAL A GO-GO. Join JoJo, a funny, curious clown and her best friend, Goliath, in stories full of music, dance, imaginative movement, engaging games, and activities that encourage your child to get up and start moving. Child participation is part of the fun in four lively stories. There are bouncy moves ahead when JoJo discovers that she's not quite ready to fill some pretty big shoes. But she's always ready to figure things out, including learning a silly slinky snake dance to help pick a flower for her dad. From using teamwork to helping Goliath learn, your child will discover valuable lessons about kindness, teamwork, and belonging.\"]\n{'Genre': 'Preschool', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Animated', 'Contributor': 'Noah Weisberg, Robert Smith, Andy Yerkes, Taylor Masamitsu, Shelly Goldstein, Marnie McPhail, Kathryn Greenwood, Madeleine Martin, Tony Daniels, Diana Peressini, David Sparrow, Jayne Eastwood, Tajja Isen, Austin Di IulioNoah Weisberg, Robert Smith, Andy Yerkes, Taylor Masamitsu, Shelly Goldstein, Marnie McPhail, Kathryn Greenwood, Madeleine Martin, Tony Daniels, Diana Peressini, David Sparrow, Jayne Eastwood, Tajja Isen, Austin Di Iulio  See more', 'Language': 'Unqualified', 'Runtime': '50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '2259969', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Animated', 'Run time': '50 minutes', 'Release date': 'March 21, 2005', 'Actors': 'Madeleine Martin, Robert Smith, Diana Peressini, Jayne Eastwood, Marnie McPhail', 'Studio': 'Buena Vista Home Entertainment / Disney', 'Writers': 'Andy Yerkes, Shelly Goldstein', 'Number of discs': '1'}\nI really enjoyed watching this with my child. I own the Animal Go Go and The Take A Bow dvd if any one is debating which one is better. I think The Animal Go Go is better of the two.\nFun for Parent and Kids\nThe Little Rascals, Vol. 7\nGeorge &#34  (Actor),     Spanky&#34  (Actor),     -  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Volume 7 includes shorts spanning from 1937-1938.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Full Screen, NTSC, Black & White', 'Contributor': 'Thomas, McFarland, Alfalfa&#34, Billie &#34, George &#34, Spanky&#34, Carl &#34, Jackie Cooper, Switzer, -, Buckwheat&#34Thomas, McFarland, Alfalfa&#34, Billie &#34, George &#34, Spanky&#34, Carl &#34, Jackie Cooper, Switzer, -, Buckwheat&#34  See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6788169', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Black & White', 'Run time': '3 hours and 14 minutes', 'Release date': 'June 14, 2011', 'Actors': 'George &#34, Spanky&#34, McFarland, Carl &#34, Alfalfa&#34', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nIf you don't want to buy all the Little Rascals dvd volumes and you wonder which one has Spanky, Alfalfa,and Darla this one has them. This dvd is one of the better volume to get.\nThis one has Spanky,Alfalfa and Darla\nLove on the Land - From the Producers of Anne of Green Gables\nPeter Strauss  (Actor),     Rachel Ward  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Thomas Linthorne is a farmer, who, with his bride, Kate, settles a parcel of untilled Midwestern farmland in 1866. Linthorne is a dynamic and driven man who eventually becomes a pillar of the close-knit community. But there are trials and tribulations that eventually plague his dreams of the perfect life he has tried to create for his family. Over the span of fifty years, the Linthorne family will weather more than their share of hardship that affects each of them in dramatic ways. The Linthorne saga, set against the daily rituals and chores of life on the land, reveals the determination, strength and indomitable spirit of the families who settled America.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Daniel Petrie, Rachel Ward, John Finn, Rip Torn, Kevin Sullivan, Peter Strauss, Chandra West', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': 'SULDV23132', 'Director': 'Daniel Petrie', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 57 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Peter Strauss, Rachel Ward, Rip Torn, John Finn, Chandra West', 'Producers': 'Kevin Sullivan', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nMy mom watched this a least 5 times while she stayed over my house for a few days. If you knew my mom you would know this is not her normal behavior. I had a feeling she would like it, but I didn't think she would ask to watch it this much. I really liked it too. I thought the acting was perfect. I loved the scenery and music in the start of the film. Yes it is not Green Gables but it never claimed to be. If you look on the cover you can figure that out.\nMy mom loved this!!!\n{'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['---'], 'Studio': ['Line Upon Line Productions']}\nI want to recommend the movie The Bible vs The Book of Mormon. It is very interesting to watch. PLEASE LOOK INTO IT.\nheres some good advice\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duane Barnhart'], 'Producers': ['Duane Barnhart', 'Kirk Cameron', 'Angie Alvarez', 'John Bona', 'Bill Hough', 'Mark Gambee'], 'Starring': ['Kirk Cameron'], 'Studio': ['GoDigital']}\nVery interesting almost didn't watch glad I did. I learned about the pilgrims and their beliefs.  If your on the fence give it a shot worth watching for sure.\nWorth Your Time\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Byron Howard', 'Rich Moore'], 'Producers': ['Clark Spencer'], 'Starring': ['Ginnifer Goodwin', 'Jason Bateman', 'Idris Elba'], 'Studio': ['Walt Disney Animation Studios']}\nDidn't like parts the movie. Don't like the Try Everything message. Had to have a talk with my daughter about there is some things you don't try (illegal drugs). Don't like the yoga scene with the naturalist reference.\nMy opinion",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Tess of the d'Urbervilles\nReview Date: 2007/01/02\nStore: Justine Waddell  (Actor),     Jason Flemyng  (Actor),     Ian Sharp  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Justine Waddell. The poignant story of the beautiful Tess, who fights for love and personal happiness in the face of adversity. 1998/color/3 hrs/NR/fullscreen.', 'Amazon.com', 'No one does tragedies as well as Thomas Hardy, and this new BBC production of his', '1891 novel', \"is a peach. Tess is a teenager captured between happiness with an educated man (Oliver Milburn) and a dreadful existence with a scheming aristocrat (Jason Flemyng). Compared to Roman Polanski's 1980 Oscar-winning film\", 'Tess', \", the BBC version is far more interested in Hardy's text than in directorial exportations. Hence, the famous strawberry scene in which the aristocrat seduces the young Tess is just long enough to plumb the emotions; Polanski's version made the scene into a miniature classic of innocence and seduction. Both versions are worth seeing.\", \"Star Justine Waddell gives Tess more pluck and less innocence than Natassja Kinski does. She makes Tess a character to root for, which can lead to your own tragedy when working through Hardy's tale. The film doesn't have the drop-dead gorgeousness of Polanski's version but is quite beautiful. Director Ian Sharp keeps in line with Hardy's affection for rural settings and vistas. Flemyng is such a great cad it leads one to wonder what he might have done with Billy Zane's role in\", 'Titanic', '. Another winning adaptation of a classic from the BBC.', '--Doug Thomas']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.52 Ounces', 'Director': 'Ian Sharp', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '3 hours', 'Release date': 'March 25, 2003', 'Actors': 'Justine Waddell, Jason Flemyng, Oliver Milburn, John McEnery, Lesley Dunlop', 'Producers': 'Delia Fine, Sally Head, Sarah Wilson', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'A&E Home Video', 'Writers': 'Ted Whitehead, Thomas Hardy', 'Number of discs': '1'}\nReview Text: This version is soooooooooooo much better than the polanski one that one was boring this Tess has much better acting and is much more interesting. One day I was in the mood to watch this with my hubby at the starting of the film my sister& mother & niece came over they(all of them including hubby who has never seen it before ended up on really getting into it my mom was even talking about it the next day( if you knew my mother she is not that type of person) it is really  a good movie\nReview Title: This is one good movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: All the King's Men\nReview Date: 2007/01/22\nStore: Sean Penn  (Actor),     Jude Law  (Actor),     Steve Zaillian  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Oscar(r)-winning actor Sean Penn (Best Actor, Mystic River, 2003), two-time Academy Award(r) nominee Jude Law (Best Supporting Actor, The Talented Mr. Ripley, 1999; Best Actor, Cold Mountain, 2003), four-time Academy Award(r) nominee Kate Winslet (Best Supporting Actress, Sense and Sensibility, 1995; Iris, 2001, Best Actress, Titanic, 1997; Eternal Sunshine of the Spotless Mind, 2004), and Oscar(r) winner Anthony Hopkins (Best Actor, The Silence of the Lambs, 1991) star in this riveting story of a humble man's rise to political power and the destructive force of corruption and betrayal that would ultimately unravel his soul, based on Robert Penn Warren's 1946 classic Pulitzer Prize-winning novel. Willie Stark (Penn) is an ordinary man from a rural town, demanding that crooked politicians and shady businessmen in Lousiana be held accountable for the collapse of a poorly built school. Urged to run for Governor by a dubious political advisor, Tiny Duffy (three-time Emmy(r) Award winner\", 'Amazon.com', 'Sean Penn gives another powerhouse performance in', \"All the King's Men\", \", leading a topnotch cast in writer-director Steven Zaillian's underrated adaptation of the\", 'Pulitzer prize-winning 1946 novel', 'by Robert Penn Warren. When you consider that the previous', '1949 film version', \"earned well-deserved Academy Awards for director Robert Rossen and actors Broderick Crawford and Mercedes McCambridge, it's no surprise that Zaillian's film was expected to earn similar acclaim, but lukewarm critical reception and disappointing box-office gave it the stigma of a noble failure. And while the film (which moves Warren's story from the Depression-era '30s to the early 1950s) suffers from uneven pacing, partial miscasting, and an occasional lack of dramatic tension, it still qualifies as a first-class production that resonates with the timeless relevance of Warren's piercing political classic. Like Broderick before him, Penn is riveting as Louisiana governor Willie Stark, an upstart political dynamo (freely inspired by controversial real-life Louisiana governor Huey P. Long) whose rise to power is ultimately doomed by corruption and betrayal.\", \"Jude Law costars as political reporter Jack Burden, our firsthand witness to Stark's rise and inevitable fall; his orbit of political insiders includes a corrupt judge (Anthony Hopkins) with a dark secret to hide; a longtime friend (Mark Ruffalo) and former lover (Kate Winslet) who fall victim to Stark's influence; and political staffers (James Gandolfini, Patricia Clarkson) who remain powerless against Stark's ill-fated populist juggernaut. At Sean Penn's request, former child star Jackie Earle Haley (from the original\", 'Bad News Bears', ') makes a welcome return to movies as Willie Stark\\'s quietly intense bodyguard, \"Sugar-Boy.\" Coproduced by Louisiana-born political consultant James Carville, filmed on authentic Louisiana locations and boasting all the stately, luxurious production values of a would-be Oscar contender,', \"All the King's Men\", \"clearly benefits from Penn's fiery performance and Zaillian's earnest embrace of Warren's still-potent subject matter. And while the film's shortcomings may have prevented it from achieving unanimous acclaim, this is still a serious, well-crafted drama with much to say about the insidious potential for fascism in America, especially when well-meaning politicians lose their souls to power.\", '--Jeff Shannon', 'On the DVD', 'The special features that accompany', \"All the King's Men\", 'further demonstrate the film\\'s in-production status as a potential classic. While the \"making of\" featurette is perfunctory at best, the other featurettes are definitely worthwhile despite Sean Penn\\'s conspicuous absence. In \"Shake Hands with the Devil,\" the film\\'s cast, producer, and writer-director Steven Zaillian discuss the timeless theme of political corruption; \"An American Classic\" is a concise profile of Robert Penn Warren, paying tribute to the poet and author\\'s literary achievements; and \"The Legend and Lore of Huey Long\" examines the life and legacy of the still-beloved governor who won the hearts of working-class Louisianans while falling prey to his own ambition. \"LA Confidential\" is a brief featurette about the film\\'s use of authentic Louisiana locations and the positive effect they had on cast and crew; three deleted scenes were obviously cut from the film for purposes of time, yet offer ample proof of Zaillian\\'s established skill as one of Hollywood\\'s top screenwriters; and the alternate ending extends beyond the film\\'s final shot, with a funeral scene that serves as a melancholy (and ultimately unnecessary) coda to the film\\'s Greek-tragic drama.', '--Jeff Shannon']\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '043396114364', 'Director': 'Steve Zaillian', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'December 19, 2006', 'Actors': 'Sean Penn, Jude Law, Kate Winslet, Anthony Hopkins, James Gandolfini', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Steven Zaillian, Ken Lemberger, Mike Medavoy, Arnold Messer', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: I saw this at my sister's house she tends to buy DVDs she has never seen before just because she likes the actors but after she & I watch this she wished she had not bought it. It was boring.\nReview Title: BORING\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou - Caillou's World of Wonder\nReview Date: 2008/01/17\nStore: .  (Actor),     n/a  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: [\"Join Caillou in four fun adventures! In Caillou the Magnificent Caillou makes Rosie disappear and becomes the King of the Castle! In Caillou the Musician Caillou leads the marching band and sings with a friend! In Caillou the Sports Star Caillou realizes he's getting stronger every day and that it is okay to need his training wheels. In Caillou the Explorer Caillou imagines playing with the penguins and searching out alligators.\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Contributor': 'N/a, .', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.34 x 7.58 inches; 2.72 Ounces', 'Item model number': '884857', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Closed-captioned', 'Run time': '1 hour and 30 minutes', 'Release date': 'August 8, 2006', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nReview Title: Don't recommed Caillou\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Alex Haley's Queen (DVD)\nReview Date: 2008/01/18\nStore: John Erman  (Director),     Halle Berry  (Actor),     Ann-Margret  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Mini-DVD, Television\nProduct Description: [\"Alex Haley's Queen (DVD)\", \"“There are two sides to every story”, or so the saying goes. For best-selling author Alex Haley, one side was Roots – the towering chronicle tracing seven generations of his mother's family. The other side comes to the screen in Alex Haley's Queen, the remarkable history of a paternal side of the author's family. David L. Wolper (Roots, The Thorn Birds) is the executive producer of this acclaimed adaption of the story Haley was working on when he died. Oscar® and Emmy® winner Halle Berry plays Queen, daughter of a slave and a plantation owner. During the turbulent decades of the antebellum South, the Civil War, Reconstruction and beyond, she searches for a home in the two cultures of her heritage – and at times is shunned by both. But rejection and hate are no match for her unconquerable will. Ann-Margret, Danny Glover, Martin Sheen and Ossie Davis also star in this poignant, uplifting final chapter of the Haley legacy.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Documentary, Drama, Historical', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Sada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul WinfieldSada Thompson, Alex Haley, Halle Berry, Tim Daly, Martin Sheen, Ossie Davis, David Stevens, Danny Glover, Madge Sinclair, David L. Wolper, John Erman, Ann-Margret, Jasmine Guy, Patricia Clarkson, Mark M Wolper, Bernard Sofronski, Dennis Haysbert, Paul Winfield  See more', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Item model number': '403898855', 'Director': 'John Erman', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 43 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Halle Berry, Ann-Margret, Tim Daly, Danny Glover, Dennis Haysbert', 'Subtitles': 'English', 'Producers': 'David L. Wolper, Mark M Wolper, Bernard Sofronski', 'Studio': 'Studio Distribution Services', 'Writers': 'David Stevens, Alex Haley', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I love this movie I remember watching it when I was a teen I couldn't wait for the next episodes to watch it is really entertaining true story.\nReview Title: Favorite Hallle Flick\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou - Caillou the Creative\nReview Date: 2008/02/12\nStore: .  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Join Caillou in four fun adventures! In Caillou the Artiste,Caillou makes something for Mommy and has a pizza party with Jeffrey and Jason. In Springtime for Caillou Caillou delivers his Valentines cards a special way. In Caillou Outdoors, Caillou helps Mommy make a scarecrow for the garden and discovers how much fun road trips can be. In Caillous Surprise, Caillou makes a cup for Mommy at Grandmas pottery class.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Feature', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.38 x 7.41 inches; 2.72 Ounces', 'Item model number': 'PBSDCAIU621DVD', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'May 1, 2007', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nReview Title: Bad role model\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Caillou's Holiday Movie [DVD]\nReview Date: 2008/02/12\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"Caillou's First Full-Length Animated Movie! When winter comes to Caillou's house, this curious 4-year-old tackles all kinds of big boy activities like helping Daddy shovel snow, making holiday presents for his family and even discovering the traditions of other little boys and girls around the world! And when Caillou learns about the spirit of the holidays, your little one will follow right along! Kids love Caillou for his real-world perspective on the life of a preschooler. Moms love Caillou for being a friend with whom their children can identify. Filled with the excitement and anticipation of holiday happenings, kids of all ages will love celebrating the season with Caillou! More than 90 minutes of frosty fun and eight all-new songs, too!\", 'DVD Features:', 'Challenges:', 'Six Caillou challenges', 'Interviews:', 'Animated interview with Caillou', 'Other:', \"Two holiday songs; 'Twas the Night Before Christmas story\", 'Amazon.com', 'Celebrate the 12 days of Christmas with Caillou and his family. Caillou receives a special advent calendar from his parents to count down the days until Christmas, and each night Caillou and his parents open a flap to discover a new picture of a holiday celebration somewhere in the world. As the family talks about different Christmas traditions, Caillou learns that a young boy in Germany started the tradition of the Christmas tree, that English school children made the first Christmas cards, and that Christmas stockings (and shoes) figure prominently in holiday celebrations in France and Hungary. He also learns about Hanukkah and the lighting of the Menorah from his friend Leo. As Caillou and his family enjoy their own holiday traditions, they discover the universal importance of giving and sharing. Music, including eight original songs, abounds in this 73-minute program. Unlike more typical', 'Caillou', 'episodes, there are no animated segments focusing on the interactions between Teddy, Rexi, and Gilbert in this presentation nor does Caillou find much to whine about in this festive season. DVD extras include an interview with Caillou, a holiday sing-along, and six challenges. (Ages 2 to 6)', '--Tami Horiuchi']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family, Romance', 'Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Media Format': 'Animated, Closed-captioned, Color, DVD, NTSC', 'Run time': '1 hour and 13 minutes', 'Release date': 'October 7, 2003', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nReview Text: I don't think Caillou is a good role model for kids he is very disobiedent and bratty. Kids already have don't need extra help with that.\nReview Title: Bad role model\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DNA vs. The Book of Mormon\nReview Date: 2008/04/16\nStore: Richard Southerton  (Actor),     Thomas Murphy  (Actor),     Joel Kramer  (Director),     Jeremy Reyes  (Director)    &                   1                  more   Format: DVD\nCategories: Movies & TV, Independently Distributed, Special Interests\nAverage Rating: 4.0\nProduct Details: {'Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Contributor': 'Thomas Murphy, Richard Southerton, Jeremy Reyes, Joel Kramer', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '49 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Director': 'Joel Kramer, Jeremy Reyes', 'Media Format': 'Color, Full length, Original recording remastered, Subtitled, NTSC, Full Screen', 'Run time': '49 minutes', 'Release date': 'February 1, 2003', 'Actors': 'Richard Southerton, Thomas Murphy', 'Studio': 'Living Hope Ministries', 'Number of discs': '1'}\nReview Text: I am glad that this was made to show  Mormons that DNA research shows where Native American roots really come from.\nReview Title: interesting\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Semi-Pro (Unrated Edition)\nReview Date: 2008/06/19\nStore: Will Ferrell  (Actor),     Woody Harrelson  (Actor),     Kent Alterman  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Semi-Pro 2-Disc Special Edition (WS/DVD)', 'Will Ferrell stars in Semi-Pro, an outrageous comedy set in 1976 against the backdrop of the maverick ABA - a fast-paced, wild and crazy basketball league that rivaled the NBA and made a name for itself with innovations like the three-point shot and slam dunk contest. Ferrell plays Jackie Moon, a one-hit wonder who used the profits from the success of his chart-topping song \"Love Me Sexy\" to achieve his dream of owning a basketball team. But Moon\\'s franchise, the Flint Michigan Tropics, is the worst team in the league and in danger of folding when the ABA announces its plans to merge with the NBA. If they want to survive, Jackie and the Tropics must now do the seemingly impossible - win.', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Sports, Comedy', 'Format': 'Multiple Formats, Color, AC-3, NTSC, Dolby, Full Screen, Subtitled, Special Edition, Widescreen', 'Contributor': 'Rob Corddry, DeRay Davis, David Koechner, Scot Armstrong, Woody Harrelson, Jimmy Miller, Will Ferrell, Maura Tierney, Kent Alterman, Will Arnett, Jackie Earle Haley, Andy Richter, Andre BenjaminRob Corddry, DeRay Davis, David Koechner, Scot Armstrong, Woody Harrelson, Jimmy Miller, Will Ferrell, Maura Tierney, Kent Alterman, Will Arnett, Jackie Earle Haley, Andy Richter, Andre Benjamin  See more', 'Language': 'English (Dolby Digital 5.1 EX)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 4.25 x 1.12 inches; 2.88 Ounces', 'Item model number': '1000038648', 'Director': 'Kent Alterman', 'Media Format': 'Multiple Formats, Color, AC-3, NTSC, Dolby, Full Screen, Subtitled, Special Edition, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 3, 2008', 'Actors': 'Will Ferrell, Woody Harrelson, Andre Benjamin, Maura Tierney, Will Arnett', 'Subtitles': 'English, Spanish', 'Producers': 'Jimmy Miller', 'Studio': 'WarnerBrothers', 'Writers': 'Scot Armstrong', 'Number of discs': '2'}\nReview Text: This movie is really vulgar and not funny at all. I like most of his films. I didn't even want to finish it it's that bad.\nReview Title: Worst movie he ever made\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tropic Thunder\nReview Date: 2008/11/19\nStore: Ben Stiller  (Actor, Director, Writer),     Jack Black  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: ['Product Description', 'In the action comedy \"Tropic Thunder,\" a group of actors shooting a war movie is led by Tugg Speedman (Ben Stiller), a pampered action superstar, Kirk Lazarus (Robert Downey Jr.), an over-the-top Australian-born method actor who has gone to extremes to get into character, and Jeff Portnoy (Jack Black), a gross-out comedy star.', 'Amazon.com', \"It's not really a knock to say that nothing in\", 'Tropic Thunder', \"is funnier than its first five minutes, so sly that--especially for people watching in theaters--you don't realize right away they\", 'are', 'the opening minutes of the movie. This outrageous comedy begins with a series of fake previews, each introducing one of the main characters in the film-proper (not that there\\'s anything proper about this film) and each bearing the familiar logo of a different motion picture studio: Universal, DreamWorks SKG, et al. Such playing fast and loose with corporate talismans verges on sacrilege, but it\\'s an index of how much le tout Tinseltown endorses the movie as a demented valentine to itself. The premise is that the cast of a would-be \"Son of Rambo\" movie shooting in some Southeast Asian jungle get into a real shooting war with drug-smuggling montagnards. Don\\'t ask--though the movie does have an answer--why such highly paid, usually ultra-pampered personnel as superhero Tugg Speedman (Ben Stiller), Mozart of fart comedy Jeff Portnoy (Jack Black), hip-hop artist Alpa Chino (Brandon T. Jackson), and five-time Oscar-winner Kirk Lazarus from Aus-try-leeah (Robert Downey Jr.) should be running through the jungle unattended and very vulnerable. It matters only that the real-life cast has a high time kidding their own profession and flexing their comedic muscles. Bonus points go to Stiller for co-writing the script (with Justin Theroux) and directing, and to Downey, brilliant as a white actor surgically turned black actor for his role and utterly committed to staying in character no matter what (\"I don\\'t drop character till I done the DVD commentary\").', 'Be warned: The movie, too, is committed--to being an equal-opportunity offender. Its political incorrectness extends not only to Lazarus\\'s black-like-me posturing but also Speedman\\'s recent, Sean Penn\\x96style Oscar bid playing a cognitively challenged farmboy--or, in Lazarus\\'s deathless phrase, \"going the full retard.\" Others in the cast include Steve Coogan as a director out of his depth, Nick Nolte as the Viet-vet novelist whose book inspired the film-within-the-film, Matthew McConaughey as Speedman\\'s sun-blissed agent back home, and Tom Cruise--bald, fat-suited, and profane--as an epically repulsive studio head. Two hours running time is a mite excessive, but otherwise, what\\'s not to like?', '--Richard T. Jameson', 'Stills from', 'Tropic Thunder', '(Click for larger image)']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Military & War, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Justin Theroux, Anthony Ruivivar, David Pressman, Brandon T. Jackson, Matt Levin, Etan Cohen, Ben Stiller, Jeff Kahn, Valerie Azlynn, Robert Downey Jr., Jack Black, Jay Baruchel, Eric Winzenried, Steve CooganJustin Theroux, Anthony Ruivivar, David Pressman, Brandon T. Jackson, Matt Levin, Etan Cohen, Ben Stiller, Jeff Kahn, Valerie Azlynn, Robert Downey Jr., Jack Black, Jay Baruchel, Eric Winzenried, Steve Coogan  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.57 x 5.47 x 7.48 inches; 2.88 Ounces', 'Item model number': 'MFR097363501541#VG', 'Director': 'Ben Stiller', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Ben Stiller, Jack Black, Robert Downey Jr., Jeff Kahn, Anthony Ruivivar', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Dreamworks Video', 'Writers': 'Ben Stiller, Etan Cohen, Justin Theroux', 'Number of discs': '1'}\nReview Text: I like Ben but it has way too much foul language and Tom Cruise looks horrible and his Character is not likeable. If you think cussing and putting down others with foul language funny then you will like this. This movie is not for children.\nReview Title: Vulgar\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Baby Genius: A Trip to the San Diego Zoo\nReview Date: 2011/04/04\nStore: Artist Not Provided  (Actor),     Pacific  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Special Interests\nProduct Description: ['This outstanding collection of Baby Genius DVDs includes themes about playtime outings and little children interacting in the events and places around them. The focus is on entertainment and teaching children in an environment filled with fun and adventure. Animation is combined with children\\x92s songs and includes fun-loving Baby Genius characters like DJ the Dinosaur, Vinko the Dancing Bear and more']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '10408278', 'Director': 'Pacific', 'Media Format': 'Color, Multiple Formats, NTSC, Full Screen, Animated, Digital Sound', 'Run time': '30 minutes', 'Release date': 'November 14, 2006', 'Actors': 'Artist Not Provided', 'Dubbed': 'Spanish', 'Language': 'Unqualified', 'Studio': 'Pacific Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My one year old Daughter loves this. I love how it shows so many different animals. It looks like the zoo cleaned up the park because it looks cleaner than usual. The animals have  way more energy than when I have been there in person usually they hide out or are sleeping but on this video they are really fun to watch. They even have a counting song thats catchy too.  It's my favorite Baby Genius Dvd. People complain about the pop up cartoons but that just makes it more fun for the kids to watch. I also enjoy the classical music that plays while they show the animals.\nReview Title: Great DVD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jojo's Circus - Animal a Go Go\nReview Date: 2011/09/07\nStore: Madeleine Martin  (Actor),     Robert Smith  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: [\"Laaadies and Gentlemen, boys and girls ... it's time to get up and move with JOJO'S CIRCUS: ANIMAL A GO-GO. Join JoJo, a funny, curious clown and her best friend, Goliath, in stories full of music, dance, imaginative movement, engaging games, and activities that encourage your child to get up and start moving. Child participation is part of the fun in four lively stories. There are bouncy moves ahead when JoJo discovers that she's not quite ready to fill some pretty big shoes. But she's always ready to figure things out, including learning a silly slinky snake dance to help pick a flower for her dad. From using teamwork to helping Goliath learn, your child will discover valuable lessons about kindness, teamwork, and belonging.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Preschool', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Animated', 'Contributor': 'Noah Weisberg, Robert Smith, Andy Yerkes, Taylor Masamitsu, Shelly Goldstein, Marnie McPhail, Kathryn Greenwood, Madeleine Martin, Tony Daniels, Diana Peressini, David Sparrow, Jayne Eastwood, Tajja Isen, Austin Di IulioNoah Weisberg, Robert Smith, Andy Yerkes, Taylor Masamitsu, Shelly Goldstein, Marnie McPhail, Kathryn Greenwood, Madeleine Martin, Tony Daniels, Diana Peressini, David Sparrow, Jayne Eastwood, Tajja Isen, Austin Di Iulio  See more', 'Language': 'Unqualified', 'Runtime': '50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '2259969', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Animated', 'Run time': '50 minutes', 'Release date': 'March 21, 2005', 'Actors': 'Madeleine Martin, Robert Smith, Diana Peressini, Jayne Eastwood, Marnie McPhail', 'Studio': 'Buena Vista Home Entertainment / Disney', 'Writers': 'Andy Yerkes, Shelly Goldstein', 'Number of discs': '1'}\nReview Text: I really enjoyed watching this with my child. I own the Animal Go Go and The Take A Bow dvd if any one is debating which one is better. I think The Animal Go Go is better of the two.\nReview Title: Fun for Parent and Kids\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Little Rascals, Vol. 7\nReview Date: 2011/10/22\nStore: George &#34  (Actor),     Spanky&#34  (Actor),     -  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Volume 7 includes shorts spanning from 1937-1938.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Full Screen, NTSC, Black & White', 'Contributor': 'Thomas, McFarland, Alfalfa&#34, Billie &#34, George &#34, Spanky&#34, Carl &#34, Jackie Cooper, Switzer, -, Buckwheat&#34Thomas, McFarland, Alfalfa&#34, Billie &#34, George &#34, Spanky&#34, Carl &#34, Jackie Cooper, Switzer, -, Buckwheat&#34  See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6788169', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Black & White', 'Run time': '3 hours and 14 minutes', 'Release date': 'June 14, 2011', 'Actors': 'George &#34, Spanky&#34, McFarland, Carl &#34, Alfalfa&#34', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nReview Text: If you don't want to buy all the Little Rascals dvd volumes and you wonder which one has Spanky, Alfalfa,and Darla this one has them. This dvd is one of the better volume to get.\nReview Title: This one has Spanky,Alfalfa and Darla\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Love on the Land - From the Producers of Anne of Green Gables\nReview Date: 2012/04/19\nStore: Peter Strauss  (Actor),     Rachel Ward  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Thomas Linthorne is a farmer, who, with his bride, Kate, settles a parcel of untilled Midwestern farmland in 1866. Linthorne is a dynamic and driven man who eventually becomes a pillar of the close-knit community. But there are trials and tribulations that eventually plague his dreams of the perfect life he has tried to create for his family. Over the span of fifty years, the Linthorne family will weather more than their share of hardship that affects each of them in dramatic ways. The Linthorne saga, set against the daily rituals and chores of life on the land, reveals the determination, strength and indomitable spirit of the families who settled America.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Daniel Petrie, Rachel Ward, John Finn, Rip Torn, Kevin Sullivan, Peter Strauss, Chandra West', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': 'SULDV23132', 'Director': 'Daniel Petrie', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 57 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Peter Strauss, Rachel Ward, Rip Torn, John Finn, Chandra West', 'Producers': 'Kevin Sullivan', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: My mom watched this a least 5 times while she stayed over my house for a few days. If you knew my mom you would know this is not her normal behavior. I had a feeling she would like it, but I didn't think she would ask to watch it this much. I really liked it too. I thought the acting was perfect. I loved the scenery and music in the start of the film. Yes it is not Green Gables but it never claimed to be. If you look on the cover you can figure that out.\nReview Title: My mom loved this!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/02/20\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['---'], 'Studio': ['Line Upon Line Productions']}\nReview Text: I want to recommend the movie The Bible vs The Book of Mormon. It is very interesting to watch. PLEASE LOOK INTO IT.\nReview Title: heres some good advice\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/09/07\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duane Barnhart'], 'Producers': ['Duane Barnhart', 'Kirk Cameron', 'Angie Alvarez', 'John Bona', 'Bill Hough', 'Mark Gambee'], 'Starring': ['Kirk Cameron'], 'Studio': ['GoDigital']}\nReview Text: Very interesting almost didn't watch glad I did. I learned about the pilgrims and their beliefs.  If your on the fence give it a shot worth watching for sure.\nReview Title: Worth Your Time\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/11/26\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Byron Howard', 'Rich Moore'], 'Producers': ['Clark Spencer'], 'Starring': ['Ginnifer Goodwin', 'Jason Bateman', 'Idris Elba'], 'Studio': ['Walt Disney Animation Studios']}\nReview Text: Didn't like parts the movie. Don't like the Try Everything message. Had to have a talk with my daughter about there is some things you don't try (illegal drugs). Don't like the yoga scene with the naturalist reference.\nReview Title: My opinion\nRating: 1.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user enjoys engaging narratives and compelling performances, particularly highlighting the emotional depth and character-driven stories. Several purchases showcase a trend towards appreciating adaptations of classic literature, with specific adaptations resonating more than others. The viewer's experience with animated children's movies suggests a preference for content that captivates and educates young audiences, noting how one DVD sparked enthusiasm among family members. The user also appreciates documentaries and films that provoke thought, reflecting an interest in understanding broader cultural and historical contexts.\n\nNEGATIVE SUMMARY:\nThe user expresses significant dissatisfaction with certain titles, emphasizing a dislike for films perceived as boring, vulgar, or unfunny. Reviews indicate frustration with characters in kids’ programming that exhibit undesirable behaviors, which the user finds inappropriate as role models. There are strong disapprovals for films with excessive foul language and content deemed unsuitable for children, underscoring a preference for more wholesome entertainment. Additionally, critiques of pacing and storytelling reflect an expectation for engaging and well-crafted narratives.\n\nOVERALL SUMMARY:\nThe purchase history reflects a balance between positive and negative experiences. The user values powerful storytelling and engaging content, particularly in adaptations and family-oriented films, with a tendency to critique pieces that fall short of expectations in entertainment quality. The user's reviews highlight a clear distinction between liked and disliked content, illustrating a personal standard for narratives that provide both entertainment and meaningful engagement, which is particularly evident in the context of family and children's programming.",
  "target_interaction": {
    "rating": 1.0,
    "title": "Not cool. DO NOT BUY",
    "text": "This is a bad Jurassic movie I could only see the dilophosaurus only once,DO NOT BUY. This is stupid there is a stupid trex taking down velociraptors.",
    "images": [],
    "asin": "B0087ZG7HK",
    "parent_asin": "B0087ZG7HK",
    "user_id": "AGEFGQNUBPAGS4JYBD664PSZKDNQ",
    "timestamp": "2019-09-12 05:02:31.966000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Jurassic Park",
    "average_rating": 4.8,
    "rating_number": 39859,
    "features": [],
    "description": [
      "Experience one of the biggest films in motion picture history with director Steven Spielberg's ultimate thrill ride, Jurassic Park. Featuring Academy Award® winning visual effects and groundbreaking filmmaking that has been hailed as \"a triumph of special effects artistry\" (Roger Ebert, Chicago Sun-Times), this epic film is sheer movie-making magic that was 65 million years in the making. Jurassic Park takes you to an amazing theme park on a remote island where dinosaurs once again roam the earth and five people must battle to survive among the prehistoric predators. Starring Sam Neill, Laura Dern, Jeff Goldblum and Richard Attenborough, discover the breathtaking adventure you will want to experience again and again.",
      "Bonus Content:",
      "Theatrical Trailer",
      "Theatrical Trailer",
      "]]>"
    ],
    "price": 12.82,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51P2EDpzUXL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51P2EDpzUXL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91QBImIxqWL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Sam Neill  (Actor),     Laura Dern  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD",
    "categories": [
      "Movies & TV",
      "Science Fiction & Fantasy",
      "Fantasy"
    ],
    "details": {
      "Genre": "thriller movie, Science Fiction & Fantasy, movie night, dinosaur movie, DVD movie, buy movie, Blu-ray movie, Oscar movie, Steven Spielberg movie, Academy Award movie, 4K movie, Mystery & Suspense/Thrillers, summer blockbuster movie, digital movie, sci-fi movie, Mystery & Suspense, Action & Adventure, action movie, adventure movie, rent moviethriller movie, Science Fiction & Fantasy, movie night, dinosaur movie, DVD movie, buy movie, Blu-ray movie, Oscar movie, Steven Spielberg movie, Academy Award movie, 4K movie, Mystery & Suspense/Thrillers, summer blockbuster movie, digital movie, sci-fi m…  See more",
      "Format": "Multiple Formats, Color, NTSC, Widescreen",
      "Contributor": "Gerald R. Molen, Ron Judkins, Richard Attenborough, Joseph Mazzello, Steven Spielberg, Samuel L. Jackson, David Koepp, Shawn Murphy, Bob Peck, Miguel Sandoval, Sam Neill, Jeff Goldblum, Richard Hymns, Martin Ferrero, Ariana Richards, Gary Rydstrom, Kathleen Kennedy, Wayne Knight, Michael Crichton, Laura Dern, Gary Summers, BD WongGerald R. Molen, Ron Judkins, Richard Attenborough, Joseph Mazzello, Steven Spielberg, Samuel L. Jackson, David Koepp, Shawn Murphy, Bob Peck, Miguel Sandoval, Sam Neill, Jeff Goldblum, Richard Hymns, Martin Ferrero, Ariana Richards, Gary Rydstrom, Kathleen Kenne…  See more",
      "Language": "English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)",
      "Runtime": "2 hours and 7 minutes",
      "Aspect Ratio": "1.85:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.4 Ounces",
      "Item model number": "25674457",
      "Director": "Steven Spielberg",
      "Media Format": "Multiple Formats, Color, NTSC, Widescreen",
      "Run time": "2 hours and 7 minutes",
      "Release date": "August 28, 2012",
      "Actors": "Sam Neill, Laura Dern, Jeff Goldblum, Richard Attenborough, Bob Peck",
      "Subtitles": "French, Spanish",
      "Producers": "Kathleen Kennedy, Gerald R. Molen",
      "Studio": "Universal Pictures Home Entertainment",
      "Writers": "Michael Crichton, David Koepp",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}