{
  "user_id": "AFGWR7GZLOWSTFN2QJBE5NMGVEGQ",
  "summary": "=== Purchase Information ===\nProduct Title: Disappearance [VHS]\nReview Date: 2009/02/12\nStore: Harry Hamlin  (Actor),     Susan Dey  (Actor),     Walter Klenhard  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Weaver, New Mexico... Population 0... is about to welcome its latest visitors. Or are they victims? For the Henley family is about to discover why Weaver is the last place on earth you want to be stranded. Everybody has disappeared without a trace. Even the town has vanished from the map. An unseen and malicious force stalks this town, and it's not going to let them escape without a fight!\"]\nAverage Rating: 3.4\nProduct Details: {'Format': 'Closed-captioned, Color, NTSC', 'Contributor': \"Rob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy Lelliott, Basia A'Hern, Susan DeyRob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy L…   See more\", 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 32 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Walter Klenhard', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 21, 2003', 'Date First Available': 'September 29, 2006', 'Actors': \"Harry Hamlin, Susan Dey, Jeremy Lelliott, Basia A'Hern, Jamie Croft\", 'Studio': 'New Concorde', 'Producers': 'Ashley Aitken, Brad Gordon, Laurie Goldstein, Michael O. Gallant, Philip K. Kleinbart', 'Writers': 'Walter Klenhard'}\nReview Text: This is a very good creepy and erie movie. Has alot of suspense and mystery. If you like Harry Hamlin and Susan Day of the Partridge Family I well reccommened this movie.\nReview Title: diaaappearence\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Family That Preys (Full Screen Edition)\nReview Date: 2011/12/21\nStore: Kathy Bates  (Actor),     Alfre Woodard  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Full Screen edition. Working-class Alice (Academy Award nominee Alfre Woodard) and wealthy Charlotte (Academy Award winner Kathy Bates) are friends and mothers who have supported each other through all that their families have gone through over the years. But now their families are embroiled in new turmoil - with each other. Can the two women save their children from the dark secrets and dirty deeds that threaten to destroy them all?', 'Amazon.com', 'Academy Award®-winner Kathy Bates (Lead Actress,', 'Misery', ', 1990) and Academy Award®-nominee Alfre Woodard (Supporting Actress,', 'Cross Creek', ', 1983) star as the matriarchs of two very different families being torn apart by greed and scandal in the contemporary drama', \"Tyler Perry's The Family That Preys\", '. The sixth feature film by Perry chronicles the inner workings of two families—one upper-crust and the other working class—that become inextricably linked by scandal. Wealthy socialite Charlotte Cartwright (Kathy Bates) and her dear friend Alice Pratt (Alfre Woodard), a working class woman of high ideals, have enjoyed a lasting friendship throughout many years. Suddenly, their lives become mired in turmoil as their adult children’s extramarital affairs, unethical business practices and a dark paternity secret threaten to derail family fortunes and unravel the lives of all involved. Alice’s self-centered newlywed daughter Andrea (Sanaa Lathan) is betraying her trusting husband Chris (Rockmond Dunbar) by engaging in a torrid affair with her boss and mother’s best friend’s son William (Cole Hauser). While cheating on his wife Jillian (KaDee Strickland) with a string of ongoing dalliances with his mistress Andrea, William’s true focus is to replace the COO of his mother’s lucrative construction corporation. Meanwhile, Alice’s other daughter Pam (Taraji P. Henson), a kind but no nonsense woman married to a hard working construction worker (Tyler Perry), tries to steer the family in a more positive direction. While paternity secrets, marital infidelity, greed and unsavory business dealings threaten to derail both families, Charlotte and Alice decide to take a breather from it all by making a cross-country road trip in which they rediscover themselves and possibly find a way to save their families from ruin in', \"Tyler Perry's The Family That Preys\", '.', 'Beyond', \"Tyler Perry's The Family That Preys\", 'on DVD', \"Tyler Perry's Meet the Browns\", 'on DVD', \"Tyler Perry's Why Did I Get Married\", 'on DVD', \"Tyler Perry's Daddy's Little Girls\", 'on DVD']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Contributor': 'Rockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana PruittRockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana Pruitt  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Item model number': 'LGT24756DVD', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 51 minutes', 'Release date': 'January 13, 2009', 'Actors': 'Kathy Bates, Alfre Woodard, Sanaa Lathan, Rockmond Dunbar, KaDee Strickland', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Writers': 'Tyler Perry', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Well worth seeing one of Tyler Perrys best movies!!!  I would reccommened this movie to any one that is a Tyler Peerry fan.\nReview Title: the family that preys together\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tyler Perry's Madea's Big Happy Family [DVD]\nReview Date: 2013/06/02\nStore: Tyler Perry  (Actor, Director),     Loretta Devine  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Madea, everyone’s favorite wise-cracking, take-no-prisoners grandma, jumps into action when her niece, Shirley, receives distressing news about her health. All Shirley wants is to gather her three adult children around her and share the news as a family. But Tammy, Kimberly and Byron are too distracted by their own problems: Tammy can’t manage her unruly children or her broken marriage; Kimberly is gripped with anger and takes it out on her husband; and Byron, after spending two years in jail, is under pressure to deal drugs again. It’s up to Madea, with the help of the equally rambunctious Aunt Bam, to gather the clan together and make things right the only way she knows how: with a lot of tough love, laughter…and the revelation of a long-buried family secret.', 'Amazon.com', \"Tyler Perry's entertainment empire continues its long march toward ubiquity with another installment chronicling the slapstick soap opera lives of the squabbling Simmons/Brown family. For Perry fans, who are legion, the fact that his output of movie and TV projects keeps growing larger than the bust lines of his matriarchal characters is nothing but good news. And\", \"Madea's Big Happy Family\", \"will certainly be the crowd-pleasingly funny, moralistic piece of uplifting fluff that they have every right to expect from the multi-hyphenated man on the throne. Based on one of his popular road show plays (as were many of his other movies), this one features as big and juicy a role for his in-drag alter ego as any. The pistol-packing, vitriol-spewing Madea steals the show all over the place, whether she's raging with one-liner insults, babbling down-home homilies, sweet-talking, or slapping someone silly. Perry also gives himself even more in-character fun playing crotchety old Uncle Joe, who has some choice observations about the obesity that's on display among more than half the cast. The story centers on Madea's niece Shirley (Loretta Devine, giving the only performance that's anywhere near understated), who is quickly succumbing to cancer, but resigned that it's God's will, and is OK with it because she'll soon be going home to Jesus. Her dying wish is to gather her loved ones to break the news, a task that proves nearly impossible given how fractious every single relationship is involving the lives of her children and extended family. Yes, the family is certainly big--but happy?--not so much. Swooping down on them in her bouncing boat of a broken-down Cadillac, Madea orders them together and orchestrates the many revelatory or shocking crises and catharses that finally bring some closure to the bickering. It's done in typical Tyler Perry fashion with bursts of pop-Christian and pop-psychological moralizing filtered straight outta Madea's motor-mouth and standup comic delivery. The men fare better than the women in Perry's philosophical, literary, and directorial intention. Without exception, the young female characters are portrayed as horrible shrews, and their men burdened providers who require the backhanded wisdom of Madea to set everyone straight. In his own performance and in the funny, sad, or inspirational messages laced throughout, Perry is playing to his core demographic to great effect. Though unremarkable in its stylistic and technical specifications,\", \"Madea's Big Happy Family\", 'has all the right stuff to fill the hearts and souls of all those who appreciate his very specific brand of ethnic family values. And that seems to be a group that grows with every project bearing his imprimatur.', '--Ted Fry']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Loretta Devine, Tyler Perry, Bow Wow, Natalie Desselle, Shannon Kane', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '64804845805', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Tyler Perry, Loretta Devine, Natalie Desselle, Shannon Kane, Bow Wow', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: one of the funniest movies I've seen..Tyler Perry came up with a winner..I would recommend this movie will tickle ur funnybone\nReview Title: madea's happy family\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: All in the Family - Dingbat's Liberation VHS\nReview Date: 2013/08/02\nStore: Rated:    Unrated    Format: VHS Tape\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Amazon.com', 'Armchair commentators may prefer to forever seal up the character of Edith Bunker within the Dingbat nutshell, but the real', 'All in the Family', 'aficionado will realize this is not the case. As was true for all of the principal players, the character of Edith was about evolution beyond that easy archetype. Here as testimony to that journey are three stepping-stone episodes toward', \"Dingbat's Liberation\", ', the first and third episodes being more obvious instances of Edith\\'s rebellion. In \"The Threat,\" a combination of Archie\\'s lust and big mouth cause the often-mousy Edith to throw the bombshell wife of Archie\\'s buddy out of the house. In \"Archie Goes Too Far,\" the Bunker doyenne demands an apology from Archie and lets loose at Gloria\\'s friend\\'s slumber party. While featuring the least onscreen time, \"Archie the Hero\" is perhaps the most important of the three episodes presented here, in that it serves to introduce Beverly LaSalle, the transsexual character whose ultimate fate brings about \"Edith\\'s Crisis of Faith,\" an episode unfortunately unavailable on tape.', '--Bob Michaels']\nAverage Rating: 5.0\nProduct Details: {'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'November 24, 1998', 'Date First Available': 'October 26, 2006', 'Actors': 'All in the Family', 'Studio': 'Sony Pictures'}\nReview Text: I just absolutely love this version of this comedy!  The best one on here is about Beverly LaSalle, will have u in tears....\nReview Title: all in the family\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Flight\nReview Date: 2013/08/26\nStore: Denzel Washington  (Actor),     Don Cheadle  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen, Multiple Formats', 'Contributor': 'Kelly Reilly, Denzel Washington, Don Cheadle, Robert Zemeckis, Melissa Leo, John Goodman, Bruce GreenwoodKelly Reilly, Denzel Washington, Don Cheadle, Robert Zemeckis, Melissa Leo, John Goodman, Bruce Greenwood  See more', 'Language': 'English', 'Runtime': '2 hours and 18 minutes'}\nReview Text: First off I love Denzel Washington! He is a great actor and he really shines in this movie, I would recomend this  to any fan or not well worth watching!\nReview Title: flight\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Life of Pi (Blu-ray + DVD + Digital Copy)\nReview Date: 2013/08/26\nStore: Suraj Sharma  (Actor),     Irrfan Khan  (Actor),     Ang Lee  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: [\"Director Ang Lee creates a groundbreaking movie event about a young man who survives a tragic disaster at sea and is hurtled into an epic journey of adventure and discovery. While marooned on a lifeboat, he forms an amazing and unexpected connection with the ship's only other survivor...a fearsome Bengal tiger.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray, Color, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Gérard Depardieu, Ang Lee, Irrfan Khan, Tabu, Suraj Sharma', 'Language': 'English, French', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 0.32 Ounces', 'Item model number': '940499', 'Director': 'Ang Lee', 'Media Format': 'Blu-ray, Color, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Release date': 'March 12, 2013', 'Actors': 'Suraj Sharma, Irrfan Khan, Tabu, Gérard Depardieu', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish', 'Studio': 'Fox', 'Number of discs': '2'}\nReview Text: Very very good movie, has a fantastic meaning to it!  You will not be disappointed trust me! Great for the old and the young and inbetween....\nReview Title: Life of Pi\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Movie Marathon: Cult Horror Collection (The Funhouse / Phantasm II / The Serpent and the Rainbow / Sssssss)\nReview Date: 2013/11/07\nStore: Elizabeth Berridge  (Actor),     Cooper Huckabee  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['The 4-Movie Marathon: Cult Horror Collection includes The Funhouse, Phantasm II, The Serpent and the Rainbow and Sssssss. Chilling favorites from directors Wes Craven, Don Coscarelli and more!', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'The Serpent and The Rainbow, Science Fiction & Fantasy, Horror, DVD Movie, 4 Movie Marathon, The Funhouse, Phantasm II, Mystery & Suspense/Thrillers, Blu-ray Movie, Action & Adventure, Mystery & Suspense, SssssssThe Serpent and The Rainbow, Science Fiction & Fantasy, Horror, DVD Movie, 4 Movie Marathon, The Funhouse, Phantasm II, Mystery & Suspense/Thrillers, Blu-ray Movie, Action & Adventure, Mystery & Suspense, Sssssss   See more', 'Format': 'Multiple Formats, Color, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'James LeGros, Angus Scrimm, Bill Pullman, Cathy Tyson, Largo Woodruff, Cooper Huckabee, Miles Chapin, Elizabeth Berridge, Reggie BannisterJames LeGros, Angus Scrimm, Bill Pullman, Cathy Tyson, Largo Woodruff, Cooper Huckabee, Miles Chapin, Elizabeth Berridge, Reggie Bannister   See more', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '7 hours and 5 minutes', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Media Format': 'Multiple Formats, Color, DTS Surround Sound, NTSC, Widescreen', 'Run time': '7 hours and 5 minutes', 'Release date': 'March 22, 2011', 'Actors': 'Elizabeth Berridge, Cooper Huckabee, Miles Chapin, Largo Woodruff, James LeGros', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: every one of theses movies are woth seeing. All are classics, but my favorite is Ssssssss.  These are for anyone who loves horror.\nReview Title: cult horror collection\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Ten Commandments [Blu-ray]\nReview Date: 2013/11/07\nStore: Omar Sharif  (Actor),     Dougray Scott  (Actor),     Robert Dornhelm  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['Now Available on Blu-Ray', 'The Ten Commandments', 'unfolds with all of the spectacle, violent human drama, and grand inspiration that have earned it its distinction as the greatest story ever told.', 'When an oracle prophesizes that a child will become Prince of Egypt, a time of danger approaches the kingdom. The Egyptian Pharaoh (', 'Paul Rhys', ',', 'From Hell', ') orders the massacre of all newborn males. But one child, Moses--the son of a Hebrew slave--escapes certain death when he is set adrift on the Nile. As years pass, he is raised in a royal Egyptian household and, with no memory of his family, rises to the stature of prince. Upon discovery of his true heritage, and inspired by a fiery message from God, Moses (', 'Dougray Scott', ',', 'Mission: Impossible II', ') embarks upon a noble and desperate fight to reclaim his destiny as the leader and liberator of the Hebrew people.', \"With a stellar cast that includes Mia Maestro (TV's\", 'Alias', ') and Golden Globe® winner', 'Omar Sharif', '(', 'Lawrence of Arabia', '),', 'The Ten Commandments', 'is unsurpassed in its vision--both intimate and grand.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Blu-ray', 'Contributor': \"Susan Lynch, Dougray Scott, Richard O'Brien, Mía Maestro, Padma Lakshmi, Linus Roache, Omar Sharif, Paul Rhys, Robert Dornhelm, Naveen Andrews, Claire BloomSusan Lynch, Dougray Scott, Richard O'Brien, Mía Maestro, Padma Lakshmi, Linus Roache, Omar Sharif, Paul Rhys, Robert Dornhelm, Naveen Andrews, Claire Bloom   See more\", 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '131', 'Director': 'Robert Dornhelm', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Blu-ray', 'Run time': '2 hours and 56 minutes', 'Release date': 'August 19, 2008', 'Actors': 'Omar Sharif, Dougray Scott, Linus Roache, Naveen Andrews, Mía Maestro', 'Studio': 'Echo Bridge Home Entertainment', 'Number of discs': '1'}\nReview Text: this is a great remake of the classic.  I enjoyed it more than I thought I would. I love the graphics in this movie.\nReview Title: the ten commandments\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Claudine\nReview Date: 2014/01/09\nStore: Diahann Carroll  (Actor),     James Earl Jones  (Actor),     John Berry  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'A single woman with six children tries to make a life with a garbageman in Harlem.', 'Amazon.com', \"It's easy to get hooked by\", 'Claudine', \", a lean, funny, Nixon-era movie about a romance nearly undone by a patronizing welfare system. Diahann Carroll stars as Claudine, single mother of six children in Harlem and a maid working for under-the-table wages. Forever worried that her white caseworker will discover her meager, outside income (thus eliminating meager government benefits), Claudine further complicates her domestic situation by falling in love with Roop (James Earl Jones). An affable Romeo and absent but financially supportive father of several kids, Roop by his presence jeopardizes Claudine's official status as a mom without means. The couple's decision to go forward results in welfare backlash, personal humiliation, family strain, and corrosive behavior. A sharp script layers the personal story within a socially conscious treatment, while Jones and Carroll's special chemistry turns the characters into fully rounded people. John Berry (\", 'From This Day Forward', '), an interesting if forgotten director, brings a clipped vitality to this urban affair.', '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Adam Wade, Lester Pine, Socorro Stephens, Tina Pine, Mordecai Lawner, David Kruger, C. Harrison Avery, Tamu Blackwell, Yvette Curtis, Diahann Carroll, Eric Jones, Elisa Loti, Lawrence Hilton-Jacobs, James Earl Jones, John BerryAdam Wade, Lester Pine, Socorro Stephens, Tina Pine, Mordecai Lawner, David Kruger, C. Harrison Avery, Tamu Blackwell, Yvette Curtis, Diahann Carroll, Eric Jones, Elisa Loti, Lawrence Hilton-Jacobs, James Earl Jones, John Berry  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.33 x 7.49 inches; 2.4 Ounces', 'Item model number': '2006183', 'Director': 'John Berry', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 14, 2003', 'Actors': 'Diahann Carroll, James Earl Jones, Lawrence Hilton-Jacobs, Tamu Blackwell, David Kruger', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Studio': '20th Century Fox', 'Writers': 'Lester Pine, Tina Pine', 'Number of discs': '1'}\nReview Text: Love love this movie!!!!!!  A true classic I recommend this dvd  it will truly make you smile!  I'm so glad they remastered this movie....\nReview Title: Claudine\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Twilight Zone: Little Girl Lost / A Game of Pool / A Sport Drink From A Certain Fountain / It's a Good Life (Collector's Edition)\nReview Date: 2014/03/20\nStore: Format: VHS Tape\nCategories: Movies & TV, Movies\nAverage Rating: 5.0\nProduct Details: {'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Date First Available': 'January 19, 2005'}\nReview Text: love this one  has one of my fave episoides It's a good life with Billy Mummy from Lost in space.\nReview Title: the twlight zone\nRating: 5.0\n--------------------------------------------------",
  "reference": "Disappearance [VHS]\nHarry Hamlin  (Actor),     Susan Dey  (Actor),     Walter Klenhard  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n[\"Weaver, New Mexico... Population 0... is about to welcome its latest visitors. Or are they victims? For the Henley family is about to discover why Weaver is the last place on earth you want to be stranded. Everybody has disappeared without a trace. Even the town has vanished from the map. An unseen and malicious force stalks this town, and it's not going to let them escape without a fight!\"]\n{'Format': 'Closed-captioned, Color, NTSC', 'Contributor': \"Rob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy Lelliott, Basia A'Hern, Susan DeyRob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy L…   See more\", 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 32 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Walter Klenhard', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 21, 2003', 'Date First Available': 'September 29, 2006', 'Actors': \"Harry Hamlin, Susan Dey, Jeremy Lelliott, Basia A'Hern, Jamie Croft\", 'Studio': 'New Concorde', 'Producers': 'Ashley Aitken, Brad Gordon, Laurie Goldstein, Michael O. Gallant, Philip K. Kleinbart', 'Writers': 'Walter Klenhard'}\nThis is a very good creepy and erie movie. Has alot of suspense and mystery. If you like Harry Hamlin and Susan Day of the Partridge Family I well reccommened this movie.\ndiaaappearence\nThe Family That Preys (Full Screen Edition)\nKathy Bates  (Actor),     Alfre Woodard  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Full Screen edition. Working-class Alice (Academy Award nominee Alfre Woodard) and wealthy Charlotte (Academy Award winner Kathy Bates) are friends and mothers who have supported each other through all that their families have gone through over the years. But now their families are embroiled in new turmoil - with each other. Can the two women save their children from the dark secrets and dirty deeds that threaten to destroy them all?', 'Amazon.com', 'Academy Award®-winner Kathy Bates (Lead Actress,', 'Misery', ', 1990) and Academy Award®-nominee Alfre Woodard (Supporting Actress,', 'Cross Creek', ', 1983) star as the matriarchs of two very different families being torn apart by greed and scandal in the contemporary drama', \"Tyler Perry's The Family That Preys\", '. The sixth feature film by Perry chronicles the inner workings of two families—one upper-crust and the other working class—that become inextricably linked by scandal. Wealthy socialite Charlotte Cartwright (Kathy Bates) and her dear friend Alice Pratt (Alfre Woodard), a working class woman of high ideals, have enjoyed a lasting friendship throughout many years. Suddenly, their lives become mired in turmoil as their adult children’s extramarital affairs, unethical business practices and a dark paternity secret threaten to derail family fortunes and unravel the lives of all involved. Alice’s self-centered newlywed daughter Andrea (Sanaa Lathan) is betraying her trusting husband Chris (Rockmond Dunbar) by engaging in a torrid affair with her boss and mother’s best friend’s son William (Cole Hauser). While cheating on his wife Jillian (KaDee Strickland) with a string of ongoing dalliances with his mistress Andrea, William’s true focus is to replace the COO of his mother’s lucrative construction corporation. Meanwhile, Alice’s other daughter Pam (Taraji P. Henson), a kind but no nonsense woman married to a hard working construction worker (Tyler Perry), tries to steer the family in a more positive direction. While paternity secrets, marital infidelity, greed and unsavory business dealings threaten to derail both families, Charlotte and Alice decide to take a breather from it all by making a cross-country road trip in which they rediscover themselves and possibly find a way to save their families from ruin in', \"Tyler Perry's The Family That Preys\", '.', 'Beyond', \"Tyler Perry's The Family That Preys\", 'on DVD', \"Tyler Perry's Meet the Browns\", 'on DVD', \"Tyler Perry's Why Did I Get Married\", 'on DVD', \"Tyler Perry's Daddy's Little Girls\", 'on DVD']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Contributor': 'Rockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana PruittRockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana Pruitt  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Item model number': 'LGT24756DVD', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 51 minutes', 'Release date': 'January 13, 2009', 'Actors': 'Kathy Bates, Alfre Woodard, Sanaa Lathan, Rockmond Dunbar, KaDee Strickland', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Writers': 'Tyler Perry', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWell worth seeing one of Tyler Perrys best movies!!!  I would reccommened this movie to any one that is a Tyler Peerry fan.\nthe family that preys together\nTyler Perry's Madea's Big Happy Family [DVD]\nTyler Perry  (Actor, Director),     Loretta Devine  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'Madea, everyone’s favorite wise-cracking, take-no-prisoners grandma, jumps into action when her niece, Shirley, receives distressing news about her health. All Shirley wants is to gather her three adult children around her and share the news as a family. But Tammy, Kimberly and Byron are too distracted by their own problems: Tammy can’t manage her unruly children or her broken marriage; Kimberly is gripped with anger and takes it out on her husband; and Byron, after spending two years in jail, is under pressure to deal drugs again. It’s up to Madea, with the help of the equally rambunctious Aunt Bam, to gather the clan together and make things right the only way she knows how: with a lot of tough love, laughter…and the revelation of a long-buried family secret.', 'Amazon.com', \"Tyler Perry's entertainment empire continues its long march toward ubiquity with another installment chronicling the slapstick soap opera lives of the squabbling Simmons/Brown family. For Perry fans, who are legion, the fact that his output of movie and TV projects keeps growing larger than the bust lines of his matriarchal characters is nothing but good news. And\", \"Madea's Big Happy Family\", \"will certainly be the crowd-pleasingly funny, moralistic piece of uplifting fluff that they have every right to expect from the multi-hyphenated man on the throne. Based on one of his popular road show plays (as were many of his other movies), this one features as big and juicy a role for his in-drag alter ego as any. The pistol-packing, vitriol-spewing Madea steals the show all over the place, whether she's raging with one-liner insults, babbling down-home homilies, sweet-talking, or slapping someone silly. Perry also gives himself even more in-character fun playing crotchety old Uncle Joe, who has some choice observations about the obesity that's on display among more than half the cast. The story centers on Madea's niece Shirley (Loretta Devine, giving the only performance that's anywhere near understated), who is quickly succumbing to cancer, but resigned that it's God's will, and is OK with it because she'll soon be going home to Jesus. Her dying wish is to gather her loved ones to break the news, a task that proves nearly impossible given how fractious every single relationship is involving the lives of her children and extended family. Yes, the family is certainly big--but happy?--not so much. Swooping down on them in her bouncing boat of a broken-down Cadillac, Madea orders them together and orchestrates the many revelatory or shocking crises and catharses that finally bring some closure to the bickering. It's done in typical Tyler Perry fashion with bursts of pop-Christian and pop-psychological moralizing filtered straight outta Madea's motor-mouth and standup comic delivery. The men fare better than the women in Perry's philosophical, literary, and directorial intention. Without exception, the young female characters are portrayed as horrible shrews, and their men burdened providers who require the backhanded wisdom of Madea to set everyone straight. In his own performance and in the funny, sad, or inspirational messages laced throughout, Perry is playing to his core demographic to great effect. Though unremarkable in its stylistic and technical specifications,\", \"Madea's Big Happy Family\", 'has all the right stuff to fill the hearts and souls of all those who appreciate his very specific brand of ethnic family values. And that seems to be a group that grows with every project bearing his imprimatur.', '--Ted Fry']\n{'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Loretta Devine, Tyler Perry, Bow Wow, Natalie Desselle, Shannon Kane', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '64804845805', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Tyler Perry, Loretta Devine, Natalie Desselle, Shannon Kane, Bow Wow', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Number of discs': '1'}\none of the funniest movies I've seen..Tyler Perry came up with a winner..I would recommend this movie will tickle ur funnybone\nmadea's happy family\nAll in the Family - Dingbat's Liberation VHS\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Amazon.com', 'Armchair commentators may prefer to forever seal up the character of Edith Bunker within the Dingbat nutshell, but the real', 'All in the Family', 'aficionado will realize this is not the case. As was true for all of the principal players, the character of Edith was about evolution beyond that easy archetype. Here as testimony to that journey are three stepping-stone episodes toward', \"Dingbat's Liberation\", ', the first and third episodes being more obvious instances of Edith\\'s rebellion. In \"The Threat,\" a combination of Archie\\'s lust and big mouth cause the often-mousy Edith to throw the bombshell wife of Archie\\'s buddy out of the house. In \"Archie Goes Too Far,\" the Bunker doyenne demands an apology from Archie and lets loose at Gloria\\'s friend\\'s slumber party. While featuring the least onscreen time, \"Archie the Hero\" is perhaps the most important of the three episodes presented here, in that it serves to introduce Beverly LaSalle, the transsexual character whose ultimate fate brings about \"Edith\\'s Crisis of Faith,\" an episode unfortunately unavailable on tape.', '--Bob Michaels']\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'November 24, 1998', 'Date First Available': 'October 26, 2006', 'Actors': 'All in the Family', 'Studio': 'Sony Pictures'}\nI just absolutely love this version of this comedy!  The best one on here is about Beverly LaSalle, will have u in tears....\nall in the family\nFlight\nDenzel Washington  (Actor),     Don Cheadle  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n{'Genre': 'Drama', 'Format': 'Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen, Multiple Formats', 'Contributor': 'Kelly Reilly, Denzel Washington, Don Cheadle, Robert Zemeckis, Melissa Leo, John Goodman, Bruce GreenwoodKelly Reilly, Denzel Washington, Don Cheadle, Robert Zemeckis, Melissa Leo, John Goodman, Bruce Greenwood  See more', 'Language': 'English', 'Runtime': '2 hours and 18 minutes'}\nFirst off I love Denzel Washington! He is a great actor and he really shines in this movie, I would recomend this  to any fan or not well worth watching!\nflight\nLife of Pi (Blu-ray + DVD + Digital Copy)\nSuraj Sharma  (Actor),     Irrfan Khan  (Actor),     Ang Lee  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"Director Ang Lee creates a groundbreaking movie event about a young man who survives a tragic disaster at sea and is hurtled into an epic journey of adventure and discovery. While marooned on a lifeboat, he forms an amazing and unexpected connection with the ship's only other survivor...a fearsome Bengal tiger.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, Color, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Gérard Depardieu, Ang Lee, Irrfan Khan, Tabu, Suraj Sharma', 'Language': 'English, French', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 0.32 Ounces', 'Item model number': '940499', 'Director': 'Ang Lee', 'Media Format': 'Blu-ray, Color, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Release date': 'March 12, 2013', 'Actors': 'Suraj Sharma, Irrfan Khan, Tabu, Gérard Depardieu', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish', 'Studio': 'Fox', 'Number of discs': '2'}\nVery very good movie, has a fantastic meaning to it!  You will not be disappointed trust me! Great for the old and the young and inbetween....\nLife of Pi\n4 Movie Marathon: Cult Horror Collection (The Funhouse / Phantasm II / The Serpent and the Rainbow / Sssssss)\nElizabeth Berridge  (Actor),     Cooper Huckabee  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['The 4-Movie Marathon: Cult Horror Collection includes The Funhouse, Phantasm II, The Serpent and the Rainbow and Sssssss. Chilling favorites from directors Wes Craven, Don Coscarelli and more!', ']]>']\n{'Genre': 'The Serpent and The Rainbow, Science Fiction & Fantasy, Horror, DVD Movie, 4 Movie Marathon, The Funhouse, Phantasm II, Mystery & Suspense/Thrillers, Blu-ray Movie, Action & Adventure, Mystery & Suspense, SssssssThe Serpent and The Rainbow, Science Fiction & Fantasy, Horror, DVD Movie, 4 Movie Marathon, The Funhouse, Phantasm II, Mystery & Suspense/Thrillers, Blu-ray Movie, Action & Adventure, Mystery & Suspense, Sssssss   See more', 'Format': 'Multiple Formats, Color, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'James LeGros, Angus Scrimm, Bill Pullman, Cathy Tyson, Largo Woodruff, Cooper Huckabee, Miles Chapin, Elizabeth Berridge, Reggie BannisterJames LeGros, Angus Scrimm, Bill Pullman, Cathy Tyson, Largo Woodruff, Cooper Huckabee, Miles Chapin, Elizabeth Berridge, Reggie Bannister   See more', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '7 hours and 5 minutes', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Media Format': 'Multiple Formats, Color, DTS Surround Sound, NTSC, Widescreen', 'Run time': '7 hours and 5 minutes', 'Release date': 'March 22, 2011', 'Actors': 'Elizabeth Berridge, Cooper Huckabee, Miles Chapin, Largo Woodruff, James LeGros', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nevery one of theses movies are woth seeing. All are classics, but my favorite is Ssssssss.  These are for anyone who loves horror.\ncult horror collection\nThe Ten Commandments [Blu-ray]\nOmar Sharif  (Actor),     Dougray Scott  (Actor),     Robert Dornhelm  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Now Available on Blu-Ray', 'The Ten Commandments', 'unfolds with all of the spectacle, violent human drama, and grand inspiration that have earned it its distinction as the greatest story ever told.', 'When an oracle prophesizes that a child will become Prince of Egypt, a time of danger approaches the kingdom. The Egyptian Pharaoh (', 'Paul Rhys', ',', 'From Hell', ') orders the massacre of all newborn males. But one child, Moses--the son of a Hebrew slave--escapes certain death when he is set adrift on the Nile. As years pass, he is raised in a royal Egyptian household and, with no memory of his family, rises to the stature of prince. Upon discovery of his true heritage, and inspired by a fiery message from God, Moses (', 'Dougray Scott', ',', 'Mission: Impossible II', ') embarks upon a noble and desperate fight to reclaim his destiny as the leader and liberator of the Hebrew people.', \"With a stellar cast that includes Mia Maestro (TV's\", 'Alias', ') and Golden Globe® winner', 'Omar Sharif', '(', 'Lawrence of Arabia', '),', 'The Ten Commandments', 'is unsurpassed in its vision--both intimate and grand.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Blu-ray', 'Contributor': \"Susan Lynch, Dougray Scott, Richard O'Brien, Mía Maestro, Padma Lakshmi, Linus Roache, Omar Sharif, Paul Rhys, Robert Dornhelm, Naveen Andrews, Claire BloomSusan Lynch, Dougray Scott, Richard O'Brien, Mía Maestro, Padma Lakshmi, Linus Roache, Omar Sharif, Paul Rhys, Robert Dornhelm, Naveen Andrews, Claire Bloom   See more\", 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '131', 'Director': 'Robert Dornhelm', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Blu-ray', 'Run time': '2 hours and 56 minutes', 'Release date': 'August 19, 2008', 'Actors': 'Omar Sharif, Dougray Scott, Linus Roache, Naveen Andrews, Mía Maestro', 'Studio': 'Echo Bridge Home Entertainment', 'Number of discs': '1'}\nthis is a great remake of the classic.  I enjoyed it more than I thought I would. I love the graphics in this movie.\nthe ten commandments\nClaudine\nDiahann Carroll  (Actor),     James Earl Jones  (Actor),     John Berry  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'A single woman with six children tries to make a life with a garbageman in Harlem.', 'Amazon.com', \"It's easy to get hooked by\", 'Claudine', \", a lean, funny, Nixon-era movie about a romance nearly undone by a patronizing welfare system. Diahann Carroll stars as Claudine, single mother of six children in Harlem and a maid working for under-the-table wages. Forever worried that her white caseworker will discover her meager, outside income (thus eliminating meager government benefits), Claudine further complicates her domestic situation by falling in love with Roop (James Earl Jones). An affable Romeo and absent but financially supportive father of several kids, Roop by his presence jeopardizes Claudine's official status as a mom without means. The couple's decision to go forward results in welfare backlash, personal humiliation, family strain, and corrosive behavior. A sharp script layers the personal story within a socially conscious treatment, while Jones and Carroll's special chemistry turns the characters into fully rounded people. John Berry (\", 'From This Day Forward', '), an interesting if forgotten director, brings a clipped vitality to this urban affair.', '--Tom Keogh']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Adam Wade, Lester Pine, Socorro Stephens, Tina Pine, Mordecai Lawner, David Kruger, C. Harrison Avery, Tamu Blackwell, Yvette Curtis, Diahann Carroll, Eric Jones, Elisa Loti, Lawrence Hilton-Jacobs, James Earl Jones, John BerryAdam Wade, Lester Pine, Socorro Stephens, Tina Pine, Mordecai Lawner, David Kruger, C. Harrison Avery, Tamu Blackwell, Yvette Curtis, Diahann Carroll, Eric Jones, Elisa Loti, Lawrence Hilton-Jacobs, James Earl Jones, John Berry  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.33 x 7.49 inches; 2.4 Ounces', 'Item model number': '2006183', 'Director': 'John Berry', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 14, 2003', 'Actors': 'Diahann Carroll, James Earl Jones, Lawrence Hilton-Jacobs, Tamu Blackwell, David Kruger', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Studio': '20th Century Fox', 'Writers': 'Lester Pine, Tina Pine', 'Number of discs': '1'}\nLove love this movie!!!!!!  A true classic I recommend this dvd  it will truly make you smile!  I'm so glad they remastered this movie....\nClaudine\nTwilight Zone: Little Girl Lost / A Game of Pool / A Sport Drink From A Certain Fountain / It's a Good Life (Collector's Edition)\nFormat: VHS Tape\nMovies & TV, Movies\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Date First Available': 'January 19, 2005'}\nlove this one  has one of my fave episoides It's a good life with Billy Mummy from Lost in space.\nthe twlight zone",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Disappearance [VHS]\nReview Date: 2009/02/12\nStore: Harry Hamlin  (Actor),     Susan Dey  (Actor),     Walter Klenhard  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Weaver, New Mexico... Population 0... is about to welcome its latest visitors. Or are they victims? For the Henley family is about to discover why Weaver is the last place on earth you want to be stranded. Everybody has disappeared without a trace. Even the town has vanished from the map. An unseen and malicious force stalks this town, and it's not going to let them escape without a fight!\"]\nAverage Rating: 3.4\nProduct Details: {'Format': 'Closed-captioned, Color, NTSC', 'Contributor': \"Rob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy Lelliott, Basia A'Hern, Susan DeyRob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy L…   See more\", 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 32 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Walter Klenhard', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 21, 2003', 'Date First Available': 'September 29, 2006', 'Actors': \"Harry Hamlin, Susan Dey, Jeremy Lelliott, Basia A'Hern, Jamie Croft\", 'Studio': 'New Concorde', 'Producers': 'Ashley Aitken, Brad Gordon, Laurie Goldstein, Michael O. Gallant, Philip K. Kleinbart', 'Writers': 'Walter Klenhard'}\nReview Text: This is a very good creepy and erie movie. Has alot of suspense and mystery. If you like Harry Hamlin and Susan Day of the Partridge Family I well reccommened this movie.\nReview Title: diaaappearence\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Family That Preys (Full Screen Edition)\nReview Date: 2011/12/21\nStore: Kathy Bates  (Actor),     Alfre Woodard  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Full Screen edition. Working-class Alice (Academy Award nominee Alfre Woodard) and wealthy Charlotte (Academy Award winner Kathy Bates) are friends and mothers who have supported each other through all that their families have gone through over the years. But now their families are embroiled in new turmoil - with each other. Can the two women save their children from the dark secrets and dirty deeds that threaten to destroy them all?', 'Amazon.com', 'Academy Award®-winner Kathy Bates (Lead Actress,', 'Misery', ', 1990) and Academy Award®-nominee Alfre Woodard (Supporting Actress,', 'Cross Creek', ', 1983) star as the matriarchs of two very different families being torn apart by greed and scandal in the contemporary drama', \"Tyler Perry's The Family That Preys\", '. The sixth feature film by Perry chronicles the inner workings of two families—one upper-crust and the other working class—that become inextricably linked by scandal. Wealthy socialite Charlotte Cartwright (Kathy Bates) and her dear friend Alice Pratt (Alfre Woodard), a working class woman of high ideals, have enjoyed a lasting friendship throughout many years. Suddenly, their lives become mired in turmoil as their adult children’s extramarital affairs, unethical business practices and a dark paternity secret threaten to derail family fortunes and unravel the lives of all involved. Alice’s self-centered newlywed daughter Andrea (Sanaa Lathan) is betraying her trusting husband Chris (Rockmond Dunbar) by engaging in a torrid affair with her boss and mother’s best friend’s son William (Cole Hauser). While cheating on his wife Jillian (KaDee Strickland) with a string of ongoing dalliances with his mistress Andrea, William’s true focus is to replace the COO of his mother’s lucrative construction corporation. Meanwhile, Alice’s other daughter Pam (Taraji P. Henson), a kind but no nonsense woman married to a hard working construction worker (Tyler Perry), tries to steer the family in a more positive direction. While paternity secrets, marital infidelity, greed and unsavory business dealings threaten to derail both families, Charlotte and Alice decide to take a breather from it all by making a cross-country road trip in which they rediscover themselves and possibly find a way to save their families from ruin in', \"Tyler Perry's The Family That Preys\", '.', 'Beyond', \"Tyler Perry's The Family That Preys\", 'on DVD', \"Tyler Perry's Meet the Browns\", 'on DVD', \"Tyler Perry's Why Did I Get Married\", 'on DVD', \"Tyler Perry's Daddy's Little Girls\", 'on DVD']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Contributor': 'Rockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana PruittRockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana Pruitt  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Item model number': 'LGT24756DVD', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 51 minutes', 'Release date': 'January 13, 2009', 'Actors': 'Kathy Bates, Alfre Woodard, Sanaa Lathan, Rockmond Dunbar, KaDee Strickland', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Writers': 'Tyler Perry', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Well worth seeing one of Tyler Perrys best movies!!!  I would reccommened this movie to any one that is a Tyler Peerry fan.\nReview Title: the family that preys together\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tyler Perry's Madea's Big Happy Family [DVD]\nReview Date: 2013/06/02\nStore: Tyler Perry  (Actor, Director),     Loretta Devine  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Madea, everyone’s favorite wise-cracking, take-no-prisoners grandma, jumps into action when her niece, Shirley, receives distressing news about her health. All Shirley wants is to gather her three adult children around her and share the news as a family. But Tammy, Kimberly and Byron are too distracted by their own problems: Tammy can’t manage her unruly children or her broken marriage; Kimberly is gripped with anger and takes it out on her husband; and Byron, after spending two years in jail, is under pressure to deal drugs again. It’s up to Madea, with the help of the equally rambunctious Aunt Bam, to gather the clan together and make things right the only way she knows how: with a lot of tough love, laughter…and the revelation of a long-buried family secret.', 'Amazon.com', \"Tyler Perry's entertainment empire continues its long march toward ubiquity with another installment chronicling the slapstick soap opera lives of the squabbling Simmons/Brown family. For Perry fans, who are legion, the fact that his output of movie and TV projects keeps growing larger than the bust lines of his matriarchal characters is nothing but good news. And\", \"Madea's Big Happy Family\", \"will certainly be the crowd-pleasingly funny, moralistic piece of uplifting fluff that they have every right to expect from the multi-hyphenated man on the throne. Based on one of his popular road show plays (as were many of his other movies), this one features as big and juicy a role for his in-drag alter ego as any. The pistol-packing, vitriol-spewing Madea steals the show all over the place, whether she's raging with one-liner insults, babbling down-home homilies, sweet-talking, or slapping someone silly. Perry also gives himself even more in-character fun playing crotchety old Uncle Joe, who has some choice observations about the obesity that's on display among more than half the cast. The story centers on Madea's niece Shirley (Loretta Devine, giving the only performance that's anywhere near understated), who is quickly succumbing to cancer, but resigned that it's God's will, and is OK with it because she'll soon be going home to Jesus. Her dying wish is to gather her loved ones to break the news, a task that proves nearly impossible given how fractious every single relationship is involving the lives of her children and extended family. Yes, the family is certainly big--but happy?--not so much. Swooping down on them in her bouncing boat of a broken-down Cadillac, Madea orders them together and orchestrates the many revelatory or shocking crises and catharses that finally bring some closure to the bickering. It's done in typical Tyler Perry fashion with bursts of pop-Christian and pop-psychological moralizing filtered straight outta Madea's motor-mouth and standup comic delivery. The men fare better than the women in Perry's philosophical, literary, and directorial intention. Without exception, the young female characters are portrayed as horrible shrews, and their men burdened providers who require the backhanded wisdom of Madea to set everyone straight. In his own performance and in the funny, sad, or inspirational messages laced throughout, Perry is playing to his core demographic to great effect. Though unremarkable in its stylistic and technical specifications,\", \"Madea's Big Happy Family\", 'has all the right stuff to fill the hearts and souls of all those who appreciate his very specific brand of ethnic family values. And that seems to be a group that grows with every project bearing his imprimatur.', '--Ted Fry']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Loretta Devine, Tyler Perry, Bow Wow, Natalie Desselle, Shannon Kane', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '64804845805', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Tyler Perry, Loretta Devine, Natalie Desselle, Shannon Kane, Bow Wow', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: one of the funniest movies I've seen..Tyler Perry came up with a winner..I would recommend this movie will tickle ur funnybone\nReview Title: madea's happy family\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: All in the Family - Dingbat's Liberation VHS\nReview Date: 2013/08/02\nStore: Rated:    Unrated    Format: VHS Tape\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Amazon.com', 'Armchair commentators may prefer to forever seal up the character of Edith Bunker within the Dingbat nutshell, but the real', 'All in the Family', 'aficionado will realize this is not the case. As was true for all of the principal players, the character of Edith was about evolution beyond that easy archetype. Here as testimony to that journey are three stepping-stone episodes toward', \"Dingbat's Liberation\", ', the first and third episodes being more obvious instances of Edith\\'s rebellion. In \"The Threat,\" a combination of Archie\\'s lust and big mouth cause the often-mousy Edith to throw the bombshell wife of Archie\\'s buddy out of the house. In \"Archie Goes Too Far,\" the Bunker doyenne demands an apology from Archie and lets loose at Gloria\\'s friend\\'s slumber party. While featuring the least onscreen time, \"Archie the Hero\" is perhaps the most important of the three episodes presented here, in that it serves to introduce Beverly LaSalle, the transsexual character whose ultimate fate brings about \"Edith\\'s Crisis of Faith,\" an episode unfortunately unavailable on tape.', '--Bob Michaels']\nAverage Rating: 5.0\nProduct Details: {'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'November 24, 1998', 'Date First Available': 'October 26, 2006', 'Actors': 'All in the Family', 'Studio': 'Sony Pictures'}\nReview Text: I just absolutely love this version of this comedy!  The best one on here is about Beverly LaSalle, will have u in tears....\nReview Title: all in the family\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Flight\nReview Date: 2013/08/26\nStore: Denzel Washington  (Actor),     Don Cheadle  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen, Multiple Formats', 'Contributor': 'Kelly Reilly, Denzel Washington, Don Cheadle, Robert Zemeckis, Melissa Leo, John Goodman, Bruce GreenwoodKelly Reilly, Denzel Washington, Don Cheadle, Robert Zemeckis, Melissa Leo, John Goodman, Bruce Greenwood  See more', 'Language': 'English', 'Runtime': '2 hours and 18 minutes'}\nReview Text: First off I love Denzel Washington! He is a great actor and he really shines in this movie, I would recomend this  to any fan or not well worth watching!\nReview Title: flight\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Life of Pi (Blu-ray + DVD + Digital Copy)\nReview Date: 2013/08/26\nStore: Suraj Sharma  (Actor),     Irrfan Khan  (Actor),     Ang Lee  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: [\"Director Ang Lee creates a groundbreaking movie event about a young man who survives a tragic disaster at sea and is hurtled into an epic journey of adventure and discovery. While marooned on a lifeboat, he forms an amazing and unexpected connection with the ship's only other survivor...a fearsome Bengal tiger.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Blu-ray, Color, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Gérard Depardieu, Ang Lee, Irrfan Khan, Tabu, Suraj Sharma', 'Language': 'English, French', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 0.32 Ounces', 'Item model number': '940499', 'Director': 'Ang Lee', 'Media Format': 'Blu-ray, Color, AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Release date': 'March 12, 2013', 'Actors': 'Suraj Sharma, Irrfan Khan, Tabu, Gérard Depardieu', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish', 'Studio': 'Fox', 'Number of discs': '2'}\nReview Text: Very very good movie, has a fantastic meaning to it!  You will not be disappointed trust me! Great for the old and the young and inbetween....\nReview Title: Life of Pi\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Movie Marathon: Cult Horror Collection (The Funhouse / Phantasm II / The Serpent and the Rainbow / Sssssss)\nReview Date: 2013/11/07\nStore: Elizabeth Berridge  (Actor),     Cooper Huckabee  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['The 4-Movie Marathon: Cult Horror Collection includes The Funhouse, Phantasm II, The Serpent and the Rainbow and Sssssss. Chilling favorites from directors Wes Craven, Don Coscarelli and more!', ']]>']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'The Serpent and The Rainbow, Science Fiction & Fantasy, Horror, DVD Movie, 4 Movie Marathon, The Funhouse, Phantasm II, Mystery & Suspense/Thrillers, Blu-ray Movie, Action & Adventure, Mystery & Suspense, SssssssThe Serpent and The Rainbow, Science Fiction & Fantasy, Horror, DVD Movie, 4 Movie Marathon, The Funhouse, Phantasm II, Mystery & Suspense/Thrillers, Blu-ray Movie, Action & Adventure, Mystery & Suspense, Sssssss   See more', 'Format': 'Multiple Formats, Color, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'James LeGros, Angus Scrimm, Bill Pullman, Cathy Tyson, Largo Woodruff, Cooper Huckabee, Miles Chapin, Elizabeth Berridge, Reggie BannisterJames LeGros, Angus Scrimm, Bill Pullman, Cathy Tyson, Largo Woodruff, Cooper Huckabee, Miles Chapin, Elizabeth Berridge, Reggie Bannister   See more', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '7 hours and 5 minutes', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Media Format': 'Multiple Formats, Color, DTS Surround Sound, NTSC, Widescreen', 'Run time': '7 hours and 5 minutes', 'Release date': 'March 22, 2011', 'Actors': 'Elizabeth Berridge, Cooper Huckabee, Miles Chapin, Largo Woodruff, James LeGros', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: every one of theses movies are woth seeing. All are classics, but my favorite is Ssssssss.  These are for anyone who loves horror.\nReview Title: cult horror collection\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Ten Commandments [Blu-ray]\nReview Date: 2013/11/07\nStore: Omar Sharif  (Actor),     Dougray Scott  (Actor),     Robert Dornhelm  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['Now Available on Blu-Ray', 'The Ten Commandments', 'unfolds with all of the spectacle, violent human drama, and grand inspiration that have earned it its distinction as the greatest story ever told.', 'When an oracle prophesizes that a child will become Prince of Egypt, a time of danger approaches the kingdom. The Egyptian Pharaoh (', 'Paul Rhys', ',', 'From Hell', ') orders the massacre of all newborn males. But one child, Moses--the son of a Hebrew slave--escapes certain death when he is set adrift on the Nile. As years pass, he is raised in a royal Egyptian household and, with no memory of his family, rises to the stature of prince. Upon discovery of his true heritage, and inspired by a fiery message from God, Moses (', 'Dougray Scott', ',', 'Mission: Impossible II', ') embarks upon a noble and desperate fight to reclaim his destiny as the leader and liberator of the Hebrew people.', \"With a stellar cast that includes Mia Maestro (TV's\", 'Alias', ') and Golden Globe® winner', 'Omar Sharif', '(', 'Lawrence of Arabia', '),', 'The Ten Commandments', 'is unsurpassed in its vision--both intimate and grand.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Blu-ray', 'Contributor': \"Susan Lynch, Dougray Scott, Richard O'Brien, Mía Maestro, Padma Lakshmi, Linus Roache, Omar Sharif, Paul Rhys, Robert Dornhelm, Naveen Andrews, Claire BloomSusan Lynch, Dougray Scott, Richard O'Brien, Mía Maestro, Padma Lakshmi, Linus Roache, Omar Sharif, Paul Rhys, Robert Dornhelm, Naveen Andrews, Claire Bloom   See more\", 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '131', 'Director': 'Robert Dornhelm', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Blu-ray', 'Run time': '2 hours and 56 minutes', 'Release date': 'August 19, 2008', 'Actors': 'Omar Sharif, Dougray Scott, Linus Roache, Naveen Andrews, Mía Maestro', 'Studio': 'Echo Bridge Home Entertainment', 'Number of discs': '1'}\nReview Text: this is a great remake of the classic.  I enjoyed it more than I thought I would. I love the graphics in this movie.\nReview Title: the ten commandments\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Claudine\nReview Date: 2014/01/09\nStore: Diahann Carroll  (Actor),     James Earl Jones  (Actor),     John Berry  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'A single woman with six children tries to make a life with a garbageman in Harlem.', 'Amazon.com', \"It's easy to get hooked by\", 'Claudine', \", a lean, funny, Nixon-era movie about a romance nearly undone by a patronizing welfare system. Diahann Carroll stars as Claudine, single mother of six children in Harlem and a maid working for under-the-table wages. Forever worried that her white caseworker will discover her meager, outside income (thus eliminating meager government benefits), Claudine further complicates her domestic situation by falling in love with Roop (James Earl Jones). An affable Romeo and absent but financially supportive father of several kids, Roop by his presence jeopardizes Claudine's official status as a mom without means. The couple's decision to go forward results in welfare backlash, personal humiliation, family strain, and corrosive behavior. A sharp script layers the personal story within a socially conscious treatment, while Jones and Carroll's special chemistry turns the characters into fully rounded people. John Berry (\", 'From This Day Forward', '), an interesting if forgotten director, brings a clipped vitality to this urban affair.', '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Adam Wade, Lester Pine, Socorro Stephens, Tina Pine, Mordecai Lawner, David Kruger, C. Harrison Avery, Tamu Blackwell, Yvette Curtis, Diahann Carroll, Eric Jones, Elisa Loti, Lawrence Hilton-Jacobs, James Earl Jones, John BerryAdam Wade, Lester Pine, Socorro Stephens, Tina Pine, Mordecai Lawner, David Kruger, C. Harrison Avery, Tamu Blackwell, Yvette Curtis, Diahann Carroll, Eric Jones, Elisa Loti, Lawrence Hilton-Jacobs, James Earl Jones, John Berry  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.33 x 7.49 inches; 2.4 Ounces', 'Item model number': '2006183', 'Director': 'John Berry', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 14, 2003', 'Actors': 'Diahann Carroll, James Earl Jones, Lawrence Hilton-Jacobs, Tamu Blackwell, David Kruger', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Studio': '20th Century Fox', 'Writers': 'Lester Pine, Tina Pine', 'Number of discs': '1'}\nReview Text: Love love this movie!!!!!!  A true classic I recommend this dvd  it will truly make you smile!  I'm so glad they remastered this movie....\nReview Title: Claudine\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Twilight Zone: Little Girl Lost / A Game of Pool / A Sport Drink From A Certain Fountain / It's a Good Life (Collector's Edition)\nReview Date: 2014/03/20\nStore: Format: VHS Tape\nCategories: Movies & TV, Movies\nAverage Rating: 5.0\nProduct Details: {'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Date First Available': 'January 19, 2005'}\nReview Text: love this one  has one of my fave episoides It's a good life with Billy Mummy from Lost in space.\nReview Title: the twlight zone\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user enjoys a variety of movies, particularly those featuring strong narratives and engaging characters. They express admiration for suspenseful and creepy films, as indicated by their high praise for certain thrillers. There is a clear appreciation for heartfelt dramas and comedies, especially those crafted by notable directors and actors, signifying that the user seeks out quality storytelling. Additionally, they are enthusiastic about the emotional impact of films, noting positive feelings evoked by classic and inspiring narratives, along with a fondness for movies that deliver laughs and memorable moments.\n\nNEGATIVE SUMMARY:\nWhile the purchase history highlights numerous positive experiences, there are underlying concerns about specific portrayals and themes in some films. The user appears critical of representations, especially regarding character arcs in certain comedies, suggesting that they may find some content less appealing or problematic. They may also be cautious about how socially sensitive topics are handled in films, pointing toward a nuanced expectation of thoughtful storytelling that aligns with their values, leading to potential disappointment when these expectations are not met.\n\nOVERALL SUMMARY:\nThe user's movie experience is marked by a love for diverse genres, emphasizing thrillers and comedies that resonate emotionally. They frequently celebrate well-crafted films, especially those with strong performances from beloved actors. However, there is an evident critical lens regarding character portrayals and societal themes, suggesting that while the user is generally positive about their film selections, they demand a certain depth and sensitivity in storytelling. This mix of enthusiasm and critical evaluation signifies a discerning viewer who values both entertainment and meaningful content in their movie choices.",
  "target_interaction": {
    "rating": 5.0,
    "title": "the twlight zone",
    "text": "Very good bought it for the episode Night Call very good one about an old lady that gets a special call every night!",
    "images": [],
    "asin": "B000055ZCW",
    "parent_asin": "B000055ZCW",
    "user_id": "AFGWR7GZLOWSTFN2QJBE5NMGVEGQ",
    "timestamp": "2014-03-20 09:46:29",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The Twilight Zone, Vol. 41",
    "average_rating": 4.5,
    "rating_number": 130,
    "features": [],
    "description": [
      "THE MIGHTY CASEY WILL THE REAL MARTIAN PLEASE STAND UP THE CHANGING OF THE GUARD COME WANDER WITH ME"
    ],
    "price": 15.72,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51k1SD2ZmBL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51k1SD2ZmBL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/816bz1RgbeL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Fukclc1xL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Fukclc1xL.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/914xBos76zL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Rod Serling  (Actor, Writer),     Robert McCord  (Actor)    Rated:    Unrated    Format: DVD",
    "categories": [
      "Movies & TV",
      "Science Fiction & Fantasy",
      "Science Fiction",
      "Classics"
    ],
    "details": {
      "Genre": "Science Fiction",
      "Format": "Multiple Formats, Black & White, NTSC",
      "Contributor": "Vaughn Taylor, Barney Phillips, Robert McCord, Burgess Meredith, Cyril Delevanti, Jay Overholts, James Turley, George Mitchell, John Anderson, Jack Klugman, Rod Serling, J. Pat O'MalleyVaughn Taylor, Barney Phillips, Robert McCord, Burgess Meredith, Cyril Delevanti, Jay Overholts, James Turley, George Mitchell, John Anderson, Jack Klugman, Rod Serling, J. Pat O'Malley  See more",
      "Language": "Unqualified (DTS ES 6.1)",
      "Number Of Discs": "1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "Unrated (Not Rated)",
      "Product Dimensions": "7.5 x 0.7 x 5.4 inches; 3.2 Ounces",
      "Media Format": "Multiple Formats, Black & White, NTSC",
      "Run time": "1 hour and 40 minutes",
      "Release date": "January 16, 2001",
      "Actors": "Rod Serling, Robert McCord, Jay Overholts, Vaughn Taylor, James Turley",
      "Studio": "IMAGE ENTERTAINMENT",
      "Writers": "Rod Serling",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}