{
  "user_id": "AGDVASPKRF5YGUZHNEYZNNMI3GQA",
  "summary": "=== Purchase Information ===\nProduct Title: Good Morning, Vietnam (Special Edition)\nReview Date: 2014/10/31\nStore: Robin Williams  (Actor),     Forest Whitaker  (Actor),     Barry Levinson  (Director),     Peter Sova  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['When the U.S. Army engages irreverent, nonconformist radio deejay Adrian Cronauer, it unleashes a secret, if unpredictable, weapon: laughter. Academy Award(R) winner Robin Williams (Best Supporting Actor, GOOD WILL HUNTING, 1997) shakes up 1965 Saigon in the role that garnered him his very first Oscar(R) nomination. Imported by the military to host an early a.m. radio show, Cronauer (Williams) blasts the formerly serene, sanitized airwaves with a constant barrage of rapid-fire humor and the hottest hits from back home. The G.I.s love him, but the top brass is up in arms. Riddled with sidesplitting comic salvos, bittersweet bombshells, and hot \\'60s rock \\'n\\' roll, this landmark film chronicles one man\\'s raucous Saigon adventures amidst a world gone mad. Featuring all-new bonus material that includes hilarious outtakes from Robin Williams\\' \"raw\" monologues, this Special Edition of GOOD MORNING, VIETNAM, scores a direct hit every time you watch.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Contributor': 'Richard Portnow, Mitch Markowitz, Bruno Kirby, Forest Whitaker, Chintara Sukapatana, Juney Smith, Barry Levinson, Robert Wuhl, Floyd Vivino, Tung Thanh Tran, Noble Willingham, Robin Williams, Don Stanton, J.T. Walsh, Dan Stanton, Cu Ba Nguyen, Peter Sova, Richard EdsonRichard Portnow, Mitch Markowitz, Bruno Kirby, Forest Whitaker, Chintara Sukapatana, Juney Smith, Barry Levinson, Robert Wuhl, Floyd Vivino, Tung Thanh Tran, Noble Willingham, Robin Williams, Don Stanton, J.T. Walsh, Dan Stanton, Cu Ba Nguyen, Peter Sova, Richard Edson   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '5.3 x 0.6 x 7.5 inches; 2.4 Ounces', 'Item model number': 'good-morning-vietnam-special-edition', 'Director': 'Barry Levinson, Peter Sova', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Run time': '2 hours and 1 minute', 'Release date': 'September 1, 2006', 'Actors': 'Robin Williams, Forest Whitaker, Tung Thanh Tran, Chintara Sukapatana, Bruno Kirby', 'Studio': 'Buena Vista Home Entertainment / Touchstone', 'Writers': 'Mitch Markowitz', 'Number of discs': '1'}\nReview Text: a good time for Vietnam vets\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Penguins of Madagascar Operation: DVD Premier\nReview Date: 2015/06/03\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['Watch out – the boys finally get their own DVD! Get more Penguins, more Madagascar and more fun with the world debut of', 'The Penguins of Madagascar Operations', '. Their mission? To maintain order in the zoo. Their nemesis? Their obnoxious neighbor, King Julien. Join Skipper and the crew as they outwit anyone and everything crossing their path as they rule the zoo.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Media Format': 'AC-3, Color, Animated, Multiple Formats, Subtitled, Dubbed, Dolby, Widescreen, NTSC', 'Run time': '2 hours and 10 minutes', 'Release date': 'February 9, 2010', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Language': 'Unqualified', 'Studio': 'Dreamworks Animated', 'Number of discs': '1'}\nReview Text: kids loved It\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Paddington\nReview Date: 2015/06/03\nStore: Nicole Kidman  (Actor),     Hugh Bonneville  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Paddington tells the story of the comic misadventures of a young Peruvian bear who travels to the city in search of a home. Finding himself lost and alone, he begins to realize that city life is not all he had imagined -until he meets the kindly Brown family who read the label around his neck that says \"Please look after this bear. Thank you,\" and offer him a temporary haven. It looks as though his luck has changed until this rare talking bear catches the eye of a museum taxidermist. The film features an entirely computer-generated bear who interacts with a cast of esteemed actors.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'WC62068', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 28, 2015', 'Actors': 'Nicole Kidman, Hugh Bonneville, Sally Hawkins, Julie Walters, Ben Wishaw', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: kids loved It\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ratatouille\nReview Date: 2015/06/03\nStore: Brad Garrett  (Actor),     Lou Romano  (Actor),     Brad Bird  (Director),     Jan Pinkava  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From the creators of CARS and THE INCREDIBLES comes a break-through comedy with something for everyone. With delightful new characters, experience Paris from an all-new perspective. It\\'s \"terrific movie making\" raves Leonard Maltin of ENTERTAINMENT TONIGHT. In one of Paris\\' finest restaurants, Remy, a determined young rat, dreams of becoming a renowned French chef. Torn between his family\\'s wishes and his true calling, Remy and his pal Linguini set in motion a hilarious chain of events that turns the City of Lights upside down. RATATOUILLE is a treat you\\'ll want to enjoy again and again.', 'Amazon.com', 'One key point: if you can get over the natural gag reflex of seeing hundreds of rodents swarming over a restaurant kitchen, you will be free to enjoy the glory of', 'Ratatouille', \", a delectable Pixar hit. Our hero is Remy, a French rat (voiced by Patton Oswalt) with a cultivated palate, who rises from his humble beginnings to become head chef at a Paris restaurant. How this happens is the stuff of Pixar magic, that ineffable blend of headlong comedy, seamless technology, and wonder (in the latter department, this movie's views of nighttime Paris are on a par with French cinema at its most lyrical). Director Brad Bird (\", 'The Incredibles', \") doesn't quite keep all his spinning plates in the air, but the gags are great and the animation amazingly expressive--Remy's shrugs and nods are nimbler than many flesh-and-blood actors can manage. Refreshingly, the movie's characters aren't celebrity-reliant, with the most recognizable voice coming from Peter O'Toole's snide food critic. (This fellow provides the film's sole sour note--an oddly pointed slap at critics, those craven souls who have done nothing but rave about Pixar's movies over the years.) Brad Bird's style is more quick-hit and less resonant than the approach of Pixar honcho John Lasseter, but it's hard to complain about a movie that cooks up such bountiful pleasure. --\", 'Robert Horton', 'Beyond', 'Ratatouille', 'on DVD', 'Ratatouille', 'on Blu-ray', 'Ratatouille', 'Toys & More', 'Other Classic Pixar Hits', 'Stills from', 'Ratatouille', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'WD05371400DVD', 'Director': 'Brad Bird, Jan Pinkava', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen, Digital Sound', 'Run time': '1 hour and 51 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Brad Garrett, Lou Romano, Patton Oswalt', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS-HD Master Audio 7.1)', 'Studio': 'DISNEY/PIXAR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Kids loved It\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Planes\nReview Date: 2015/08/04\nStore: Dane Cook  (Actor),     Stacy Keach  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nAverage Rating: 4.7\nProduct Details: {}\nReview Text: grandkids loved it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cars 2\nReview Date: 2015/08/04\nStore: Larry the Cable Guy  (Actor),     Owen Wilson  (Actor),     Brad Lewis  (Director),     John Lasseter  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From the creators of CARS and TOY STORY 3 comes a new, laugh-out-loud, heartwarming adventure geared for the entire family. Star race car Lightning McQueen (Owen Wilson) and the incomparable tow truck Mater (Larry the Cable Guy) take their friendship on the road from Radiator Springs to exciting new places when they head overseas to compete in the first-ever World Grand Prix to determine the world\\'s fastest car. But the road to the championship is filled with plenty of potholes, detours and hilarious surprises when Mater gets caught up in an intriguing adventure of his own: international espionage! Experience all the fast-paced fun with an \"all-car\" cast -- plus enjoy two hilarious short films, \"Air Mater\" and \"Hawaiian Vacation.\" It\\'s turbocharged action and thrills and \"even better than before,\" raves Peter Travers of Rolling Stone.', 'Amazon.com', \"Lightning McQueen (voice by Owen Wilson), Mater (Larry the Cable Guy), Sally (Bonnie Hunt), and the rest of the gang from Radiator Springs return to the screen in this sequel to Pixar's\", 'Cars', \"(2006). But instead of evoking a nostalgic vision of Route 66 through the American Southwest, director John Lasseter and his artists spoof James Bond films in a fast-paced adventure that mixes espionage and road racing. After a successful season on the track, Lightning is looking forward to some rest at home, but Mater gets him involved in an elaborate three-part international race sponsored by Sir Miles Axlerod (Eddie Izzard) to promote his new synthetic auto fuel. While serving on Lightning's pit crew, Mater inadvertently gets mixed up with two British secret agent cars, Finn McMissile (Michael Caine) and Holley Shiftwell (Emily Mortimer), who are investigating a plot to sabotage the race. Myriad complications ensue before Lightning and Mater get back to the (relative) peace of Radiator Springs. The Pixar artists clearly had a lot of fun spoofing locations in Tokyo, London, Paris, and the Italian Riviera, and creating auto versions of sumo wrestlers, kabuki actors, Queen Elizabeth II, and a doting Italian mother. The use of 3-D adds adrenaline to the racing sequences.\", 'Cars 2', 'lacks the emotional impact of', 'Toy Story 2', ',', 'Up', ', and most of the other Pixar features, but that will do little to lessen its appeal to its target audience, boys who love cars, driving games, and car toys.', 'Cars 2', 'is screening with', 'Toy Story Toons: Hawaiian Vacation', ', a new short with Woody, Buzz, Barbie, Ken, and the rest of the', 'Toy Story', 'gang. (Rated G: minor toilet humor and a few scary moments.)', '--Charles Solomon', 'Related Products', 'Versions of', 'Cars 2', 'on Blu-ray and DVD']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Michael Caine, Larry the Cable Guy, John Lasseter, Joe Mantegna, Owen Wilson, Brent Musburger, Peter Jacobson, Bonnie Hunt, Eddie Izzard, Thomas Kretschmann, Brad Lewis, John Turturro, Emily MortimerMichael Caine, Larry the Cable Guy, John Lasseter, Joe Mantegna, Owen Wilson, Brent Musburger, Peter Jacobson, Bonnie Hunt, Eddie Izzard, Thomas Kretschmann, Brad Lewis, John Turturro, Emily Mortimer  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '14EFP405434', 'Director': 'Brad Lewis, John Lasseter', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 46 minutes', 'Release date': 'November 1, 2011', 'Actors': 'Larry the Cable Guy, Owen Wilson, Michael Caine, Emily Mortimer, Eddie Izzard', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Disney Pixar', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: grandkids loved it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monsters University (DVD)\nReview Date: 2015/08/04\nStore: Billy Crystal  (Actor),     John Goodman  (Actor),     Dan Scanlon  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'Disney Pixar proudly presents the hilarious story of how two mismatched monsters met and became lifelong friends in a movie screaming with laughter and oozing with heart. Ever since college-bound Mike Wazowski (Billy Crystal) was a little monster, he dreamed of becoming a Scarer - and he knows better than anyone that the best Scarers come from Monsters University (MU). But during his first semester at MU, Mike\\'s plans are derailed when he crosses paths with hotshot, James P. Sullivan, \"Sulley\" (John Goodman), a natural-born Scarer. The pair\\'s out of control competitive spirit gets them both kicked out of the University\\'s elite Scare Program. With their dreams temporarily dashed, they realize they will have to work together, along with an odd bunch of misfit monsters, if they ever hope to make things right. Pull an all-nighter with hours of exclusive bonus extras, including an inside look at the world of monsters and the animated theatrical short film The Blue Umbrella. Monsters University opens the door to huge laughs on Disney Blu-ray.', 'Amazon.com', 'Ever wonder how Mike Wazowski and James P. Sullivan paired up to become the top scaring team at Monsters, Inc.? Somebody at Pixar did, and it turns out that the seemingly made-for-each-other partnership had an unexpectedly rocky beginning. Wazowski\\'s childhood dream was to become a professional scarer, and his acceptance into Monsters University was a dream come true--until an unfortunate encounter with \"Jimmy\" Sullivan ignited a rivalry that threatened both monsters\\' chances of success. True opposites, Wazowski is studious, uptight, and completely intent on learning the history and theory behind scaring, but lacks any semblance of actual scare factor, while the boisterous Sulley relies on natural scaring ability and his family\\'s reputation, but devotes virtually no time or attention to his studies. When an argument between the two classmates gets out of hand, they are expelled from the scare program, and the fraternity-sponsored Scare Games offers them one last-chance opportunity to get back into the program. Wazowski and Sulley reluctantly join forces with one another and a hodge-podge of other misfits out of sheer necessity, but they are a team in name only, with each of the two monsters vowing to pull the \"team\" to victory through his individual efforts and sheer willpower. What the pair discovers is that only by working together and taking advantage of each member\\'s individual differences do they have a chance of winning the contest. The animation in this film is absolutely stellar, the story is intriguing, the development of favorite characters is believable, and the foreshadowing of', 'Monsters, Inc.', 'events is skillful and subtle. Humor abounds throughout the film and the jokes and gags flow freely on a variety of levels, ensuring that kids and adults alike are kept laughing and wondering what\\'s coming next. Returning voice talent Billy Crystal and John Goodman are joined by Nathan Fillion, Helen Mirren, and Julia Sweeney, among others. While the film lacks the sweetness of Boo\\'s relationship with \"Kitty\" in', 'Monsters, Inc.', ',', 'Monsters University', 'is a prequel that complements the original film well and will weather repeated viewings.', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Alfred Molina, Steve Buscemi, Billy Crystal, Screenplay by Daniel Gerson & Robert L. Baird and, Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Joel Murray, Peter Sohn, Helen Mirren, Dave Foley, Sean P. Hayes, John Goodman, Tyler Labine, Nathan Fillion, Charlie Day, Dan ScanlonAlfred Molina, Steve Buscemi, Billy Crystal, Screenplay by Daniel Gerson & Robert L. Baird and, Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Joel Murray, Peter Sohn, Helen Mirren, Dave Foley, Sean P. Hayes, John Goodman, Tyler Labine, Nathan Fillion, Charlie Day,…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 2.0)', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Item model number': '203208', 'Director': 'Dan Scanlon', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'October 29, 2013', 'Actors': 'Billy Crystal, John Goodman, Steve Buscemi, Helen Mirren, Peter Sohn', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Screenplay by Daniel Gerson & Robert L. Baird and', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: grand daughter love it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monsters, Inc. (Two-Disc Collector's Edition) [DVD]\nReview Date: 2015/08/04\nStore: Billy Crystal  (Actor),     John Goodman  (Actor),     David Silverman  (Director),     Lee Unkrich  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation, Action & Adventure', 'Format': 'Animated, Closed-captioned, Color, NTSC, Dolby, DVD, Widescreen, Dubbed', 'Contributor': 'James Coburn, Frank Oz, Pete Docter, David Silverman, Steve Buscemi, Billy Crystal, Roger Gould, Daniel Gerson, Steve Susskind, Bonnie Hunt, Jeff Pidgeon, Ralph Eggleston, John Ratzenberger, Andrew Stanton, Bob Peterson, Mary Gibbs, Jennifer Tilly, John Goodman, Lee UnkrichJames Coburn, Frank Oz, Pete Docter, David Silverman, Steve Buscemi, Billy Crystal, Roger Gould, Daniel Gerson, Steve Susskind, Bonnie Hunt, Jeff Pidgeon, Ralph Eggleston, John Ratzenberger, Andrew Stanton, Bob Peterson, Mary Gibbs, Jennifer Tilly, John Goodman,…   See more', 'Language': 'English', 'Runtime': '1 hour and 33 minutes'}\nReview Text: grand daughter loved it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/09\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['Brian Chung', 'Greg Bishop'], 'Studio': ['Musa Productions']}\nReview Text: great movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/09\nAverage Rating: 4.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Harris Done'], 'Producers': ['James Moll'], 'Starring': ['Mike Dowling', 'Alexandria Lopez', 'Bryan Manthey'], 'Studio': ['FilmBuff']}\nReview Text: this will warm your heart\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Against the Sun\nReview Date: 2015/08/17\nCategories: Drama, Adventure, Downbeat, Emotional\nProduct Description: ['In one of the most harrowing true stories of World War II, three US Navy airmen crash land their torpedo bomber in the South Pacific and find themselves on a tiny life raft, surrounded by open ocean. No food. No water. No hope of rescue. Against incredible odds, these three virtual strangers must survive storms, sharks, starvation and each other as they try to sail to safety.']\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Brian Falk'], 'Producers': ['Brian Falk', 'Mark Moran', 'Joe Ricketts', 'Kurt Graver', 'Luisa Gomez de Silva'], 'Starring': ['Garrett Dillahunt', 'Tom Felton', 'Jake Abel']}\nReview Text: a little long\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/17\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ross Katz'], 'Producers': ['Brad Krevoy', 'Cathy Wischner-Sola', 'Ross Katz', 'Lori Keith Douglas'], 'Starring': ['Kevin Bacon', 'Tom Aldredge', 'Blanche Baker'], 'Studio': ['HBO']}\nReview Text: great movie and very moving\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Zootopia\nReview Date: 2016/07/15\nStore: Ginnifer Goodwin  (Actor),     Jason Bateman  (Actor),     Byron Howard  (Director),     Rich Moore  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From Walt Disney Animation Studios comes a comedy-adventure set in the modern mammal metropolis of ZOOTOPIA. Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case -- even if it means partnering with scam-artist fox Nick Wilde to solve the mystery. Bring home this hilarious adventure full of action and heart. It's big fun for all shapes and species!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'John DiMaggio, Maurice LaMarche, Phil Johnston, Don Lake, Tommy Chong, Byron Howard, Jenny Slate, Alan Tudyk, Ginnifer Goodwin, Raymond S. Persi, Rich Moore, Shakira, Della Saba, Jason Bateman, Jared Bush, Idris Elba, J.K. Simmons, Jesse Corti, Fuschia!, Bonnie Hunt, Gita Reddy, Katie Lowes, Octavia Spencer, Nate Torrence, Tiny ListerJohn DiMaggio, Maurice LaMarche, Phil Johnston, Don Lake, Tommy Chong, Byron Howard, Jenny Slate, Alan Tudyk, Ginnifer Goodwin, Raymond S. Persi, Rich Moore, Shakira, Della Saba, Jason Bateman, Jared Bush, Idris Elba, J.K. Simmons, Jesse Corti, Fuschia!, Bonnie Hunt, Git…  See more', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.5 x 5.4 x 6.7 inches; 3.2 Ounces', 'Item model number': '35437824', 'Director': 'Byron Howard, Rich Moore', 'Media Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'June 7, 2016', 'Actors': 'Ginnifer Goodwin, Jason Bateman, Idris Elba, Jenny Slate, Nate Torrence', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Jared Bush, Phil Johnston', 'Number of discs': '2'}\nReview Text: Was a gift.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference": "Good Morning, Vietnam (Special Edition)\nRobin Williams  (Actor),     Forest Whitaker  (Actor),     Barry Levinson  (Director),     Peter Sova  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['When the U.S. Army engages irreverent, nonconformist radio deejay Adrian Cronauer, it unleashes a secret, if unpredictable, weapon: laughter. Academy Award(R) winner Robin Williams (Best Supporting Actor, GOOD WILL HUNTING, 1997) shakes up 1965 Saigon in the role that garnered him his very first Oscar(R) nomination. Imported by the military to host an early a.m. radio show, Cronauer (Williams) blasts the formerly serene, sanitized airwaves with a constant barrage of rapid-fire humor and the hottest hits from back home. The G.I.s love him, but the top brass is up in arms. Riddled with sidesplitting comic salvos, bittersweet bombshells, and hot \\'60s rock \\'n\\' roll, this landmark film chronicles one man\\'s raucous Saigon adventures amidst a world gone mad. Featuring all-new bonus material that includes hilarious outtakes from Robin Williams\\' \"raw\" monologues, this Special Edition of GOOD MORNING, VIETNAM, scores a direct hit every time you watch.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Contributor': 'Richard Portnow, Mitch Markowitz, Bruno Kirby, Forest Whitaker, Chintara Sukapatana, Juney Smith, Barry Levinson, Robert Wuhl, Floyd Vivino, Tung Thanh Tran, Noble Willingham, Robin Williams, Don Stanton, J.T. Walsh, Dan Stanton, Cu Ba Nguyen, Peter Sova, Richard EdsonRichard Portnow, Mitch Markowitz, Bruno Kirby, Forest Whitaker, Chintara Sukapatana, Juney Smith, Barry Levinson, Robert Wuhl, Floyd Vivino, Tung Thanh Tran, Noble Willingham, Robin Williams, Don Stanton, J.T. Walsh, Dan Stanton, Cu Ba Nguyen, Peter Sova, Richard Edson   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '5.3 x 0.6 x 7.5 inches; 2.4 Ounces', 'Item model number': 'good-morning-vietnam-special-edition', 'Director': 'Barry Levinson, Peter Sova', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Run time': '2 hours and 1 minute', 'Release date': 'September 1, 2006', 'Actors': 'Robin Williams, Forest Whitaker, Tung Thanh Tran, Chintara Sukapatana, Bruno Kirby', 'Studio': 'Buena Vista Home Entertainment / Touchstone', 'Writers': 'Mitch Markowitz', 'Number of discs': '1'}\na good time for Vietnam vets\nFive Stars\nThe Penguins of Madagascar Operation: DVD Premier\nRated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Watch out – the boys finally get their own DVD! Get more Penguins, more Madagascar and more fun with the world debut of', 'The Penguins of Madagascar Operations', '. Their mission? To maintain order in the zoo. Their nemesis? Their obnoxious neighbor, King Julien. Join Skipper and the crew as they outwit anyone and everything crossing their path as they rule the zoo.']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Media Format': 'AC-3, Color, Animated, Multiple Formats, Subtitled, Dubbed, Dolby, Widescreen, NTSC', 'Run time': '2 hours and 10 minutes', 'Release date': 'February 9, 2010', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Language': 'Unqualified', 'Studio': 'Dreamworks Animated', 'Number of discs': '1'}\nkids loved It\nFive Stars\nPaddington\nNicole Kidman  (Actor),     Hugh Bonneville  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Paddington tells the story of the comic misadventures of a young Peruvian bear who travels to the city in search of a home. Finding himself lost and alone, he begins to realize that city life is not all he had imagined -until he meets the kindly Brown family who read the label around his neck that says \"Please look after this bear. Thank you,\" and offer him a temporary haven. It looks as though his luck has changed until this rare talking bear catches the eye of a museum taxidermist. The film features an entirely computer-generated bear who interacts with a cast of esteemed actors.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'WC62068', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 28, 2015', 'Actors': 'Nicole Kidman, Hugh Bonneville, Sally Hawkins, Julie Walters, Ben Wishaw', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nkids loved It\nFive Stars\nRatatouille\nBrad Garrett  (Actor),     Lou Romano  (Actor),     Brad Bird  (Director),     Jan Pinkava  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'From the creators of CARS and THE INCREDIBLES comes a break-through comedy with something for everyone. With delightful new characters, experience Paris from an all-new perspective. It\\'s \"terrific movie making\" raves Leonard Maltin of ENTERTAINMENT TONIGHT. In one of Paris\\' finest restaurants, Remy, a determined young rat, dreams of becoming a renowned French chef. Torn between his family\\'s wishes and his true calling, Remy and his pal Linguini set in motion a hilarious chain of events that turns the City of Lights upside down. RATATOUILLE is a treat you\\'ll want to enjoy again and again.', 'Amazon.com', 'One key point: if you can get over the natural gag reflex of seeing hundreds of rodents swarming over a restaurant kitchen, you will be free to enjoy the glory of', 'Ratatouille', \", a delectable Pixar hit. Our hero is Remy, a French rat (voiced by Patton Oswalt) with a cultivated palate, who rises from his humble beginnings to become head chef at a Paris restaurant. How this happens is the stuff of Pixar magic, that ineffable blend of headlong comedy, seamless technology, and wonder (in the latter department, this movie's views of nighttime Paris are on a par with French cinema at its most lyrical). Director Brad Bird (\", 'The Incredibles', \") doesn't quite keep all his spinning plates in the air, but the gags are great and the animation amazingly expressive--Remy's shrugs and nods are nimbler than many flesh-and-blood actors can manage. Refreshingly, the movie's characters aren't celebrity-reliant, with the most recognizable voice coming from Peter O'Toole's snide food critic. (This fellow provides the film's sole sour note--an oddly pointed slap at critics, those craven souls who have done nothing but rave about Pixar's movies over the years.) Brad Bird's style is more quick-hit and less resonant than the approach of Pixar honcho John Lasseter, but it's hard to complain about a movie that cooks up such bountiful pleasure. --\", 'Robert Horton', 'Beyond', 'Ratatouille', 'on DVD', 'Ratatouille', 'on Blu-ray', 'Ratatouille', 'Toys & More', 'Other Classic Pixar Hits', 'Stills from', 'Ratatouille', '(Click for larger image)']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'WD05371400DVD', 'Director': 'Brad Bird, Jan Pinkava', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen, Digital Sound', 'Run time': '1 hour and 51 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Brad Garrett, Lou Romano, Patton Oswalt', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS-HD Master Audio 7.1)', 'Studio': 'DISNEY/PIXAR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nKids loved It\nFive Stars\nPlanes\nDane Cook  (Actor),     Stacy Keach  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{}\ngrandkids loved it\nFive Stars\nCars 2\nLarry the Cable Guy  (Actor),     Owen Wilson  (Actor),     Brad Lewis  (Director),     John Lasseter  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'From the creators of CARS and TOY STORY 3 comes a new, laugh-out-loud, heartwarming adventure geared for the entire family. Star race car Lightning McQueen (Owen Wilson) and the incomparable tow truck Mater (Larry the Cable Guy) take their friendship on the road from Radiator Springs to exciting new places when they head overseas to compete in the first-ever World Grand Prix to determine the world\\'s fastest car. But the road to the championship is filled with plenty of potholes, detours and hilarious surprises when Mater gets caught up in an intriguing adventure of his own: international espionage! Experience all the fast-paced fun with an \"all-car\" cast -- plus enjoy two hilarious short films, \"Air Mater\" and \"Hawaiian Vacation.\" It\\'s turbocharged action and thrills and \"even better than before,\" raves Peter Travers of Rolling Stone.', 'Amazon.com', \"Lightning McQueen (voice by Owen Wilson), Mater (Larry the Cable Guy), Sally (Bonnie Hunt), and the rest of the gang from Radiator Springs return to the screen in this sequel to Pixar's\", 'Cars', \"(2006). But instead of evoking a nostalgic vision of Route 66 through the American Southwest, director John Lasseter and his artists spoof James Bond films in a fast-paced adventure that mixes espionage and road racing. After a successful season on the track, Lightning is looking forward to some rest at home, but Mater gets him involved in an elaborate three-part international race sponsored by Sir Miles Axlerod (Eddie Izzard) to promote his new synthetic auto fuel. While serving on Lightning's pit crew, Mater inadvertently gets mixed up with two British secret agent cars, Finn McMissile (Michael Caine) and Holley Shiftwell (Emily Mortimer), who are investigating a plot to sabotage the race. Myriad complications ensue before Lightning and Mater get back to the (relative) peace of Radiator Springs. The Pixar artists clearly had a lot of fun spoofing locations in Tokyo, London, Paris, and the Italian Riviera, and creating auto versions of sumo wrestlers, kabuki actors, Queen Elizabeth II, and a doting Italian mother. The use of 3-D adds adrenaline to the racing sequences.\", 'Cars 2', 'lacks the emotional impact of', 'Toy Story 2', ',', 'Up', ', and most of the other Pixar features, but that will do little to lessen its appeal to its target audience, boys who love cars, driving games, and car toys.', 'Cars 2', 'is screening with', 'Toy Story Toons: Hawaiian Vacation', ', a new short with Woody, Buzz, Barbie, Ken, and the rest of the', 'Toy Story', 'gang. (Rated G: minor toilet humor and a few scary moments.)', '--Charles Solomon', 'Related Products', 'Versions of', 'Cars 2', 'on Blu-ray and DVD']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Michael Caine, Larry the Cable Guy, John Lasseter, Joe Mantegna, Owen Wilson, Brent Musburger, Peter Jacobson, Bonnie Hunt, Eddie Izzard, Thomas Kretschmann, Brad Lewis, John Turturro, Emily MortimerMichael Caine, Larry the Cable Guy, John Lasseter, Joe Mantegna, Owen Wilson, Brent Musburger, Peter Jacobson, Bonnie Hunt, Eddie Izzard, Thomas Kretschmann, Brad Lewis, John Turturro, Emily Mortimer  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '14EFP405434', 'Director': 'Brad Lewis, John Lasseter', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 46 minutes', 'Release date': 'November 1, 2011', 'Actors': 'Larry the Cable Guy, Owen Wilson, Michael Caine, Emily Mortimer, Eddie Izzard', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Disney Pixar', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngrandkids loved it\nFive Stars\nMonsters University (DVD)\nBilly Crystal  (Actor),     John Goodman  (Actor),     Dan Scanlon  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'Disney Pixar proudly presents the hilarious story of how two mismatched monsters met and became lifelong friends in a movie screaming with laughter and oozing with heart. Ever since college-bound Mike Wazowski (Billy Crystal) was a little monster, he dreamed of becoming a Scarer - and he knows better than anyone that the best Scarers come from Monsters University (MU). But during his first semester at MU, Mike\\'s plans are derailed when he crosses paths with hotshot, James P. Sullivan, \"Sulley\" (John Goodman), a natural-born Scarer. The pair\\'s out of control competitive spirit gets them both kicked out of the University\\'s elite Scare Program. With their dreams temporarily dashed, they realize they will have to work together, along with an odd bunch of misfit monsters, if they ever hope to make things right. Pull an all-nighter with hours of exclusive bonus extras, including an inside look at the world of monsters and the animated theatrical short film The Blue Umbrella. Monsters University opens the door to huge laughs on Disney Blu-ray.', 'Amazon.com', 'Ever wonder how Mike Wazowski and James P. Sullivan paired up to become the top scaring team at Monsters, Inc.? Somebody at Pixar did, and it turns out that the seemingly made-for-each-other partnership had an unexpectedly rocky beginning. Wazowski\\'s childhood dream was to become a professional scarer, and his acceptance into Monsters University was a dream come true--until an unfortunate encounter with \"Jimmy\" Sullivan ignited a rivalry that threatened both monsters\\' chances of success. True opposites, Wazowski is studious, uptight, and completely intent on learning the history and theory behind scaring, but lacks any semblance of actual scare factor, while the boisterous Sulley relies on natural scaring ability and his family\\'s reputation, but devotes virtually no time or attention to his studies. When an argument between the two classmates gets out of hand, they are expelled from the scare program, and the fraternity-sponsored Scare Games offers them one last-chance opportunity to get back into the program. Wazowski and Sulley reluctantly join forces with one another and a hodge-podge of other misfits out of sheer necessity, but they are a team in name only, with each of the two monsters vowing to pull the \"team\" to victory through his individual efforts and sheer willpower. What the pair discovers is that only by working together and taking advantage of each member\\'s individual differences do they have a chance of winning the contest. The animation in this film is absolutely stellar, the story is intriguing, the development of favorite characters is believable, and the foreshadowing of', 'Monsters, Inc.', 'events is skillful and subtle. Humor abounds throughout the film and the jokes and gags flow freely on a variety of levels, ensuring that kids and adults alike are kept laughing and wondering what\\'s coming next. Returning voice talent Billy Crystal and John Goodman are joined by Nathan Fillion, Helen Mirren, and Julia Sweeney, among others. While the film lacks the sweetness of Boo\\'s relationship with \"Kitty\" in', 'Monsters, Inc.', ',', 'Monsters University', 'is a prequel that complements the original film well and will weather repeated viewings.', '--Tami Horiuchi']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Alfred Molina, Steve Buscemi, Billy Crystal, Screenplay by Daniel Gerson & Robert L. Baird and, Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Joel Murray, Peter Sohn, Helen Mirren, Dave Foley, Sean P. Hayes, John Goodman, Tyler Labine, Nathan Fillion, Charlie Day, Dan ScanlonAlfred Molina, Steve Buscemi, Billy Crystal, Screenplay by Daniel Gerson & Robert L. Baird and, Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Joel Murray, Peter Sohn, Helen Mirren, Dave Foley, Sean P. Hayes, John Goodman, Tyler Labine, Nathan Fillion, Charlie Day,…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 2.0)', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Item model number': '203208', 'Director': 'Dan Scanlon', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'October 29, 2013', 'Actors': 'Billy Crystal, John Goodman, Steve Buscemi, Helen Mirren, Peter Sohn', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Screenplay by Daniel Gerson & Robert L. Baird and', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngrand daughter love it\nFive Stars\nMonsters, Inc. (Two-Disc Collector's Edition) [DVD]\nBilly Crystal  (Actor),     John Goodman  (Actor),     David Silverman  (Director),     Lee Unkrich  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{'Genre': 'Animation, Action & Adventure', 'Format': 'Animated, Closed-captioned, Color, NTSC, Dolby, DVD, Widescreen, Dubbed', 'Contributor': 'James Coburn, Frank Oz, Pete Docter, David Silverman, Steve Buscemi, Billy Crystal, Roger Gould, Daniel Gerson, Steve Susskind, Bonnie Hunt, Jeff Pidgeon, Ralph Eggleston, John Ratzenberger, Andrew Stanton, Bob Peterson, Mary Gibbs, Jennifer Tilly, John Goodman, Lee UnkrichJames Coburn, Frank Oz, Pete Docter, David Silverman, Steve Buscemi, Billy Crystal, Roger Gould, Daniel Gerson, Steve Susskind, Bonnie Hunt, Jeff Pidgeon, Ralph Eggleston, John Ratzenberger, Andrew Stanton, Bob Peterson, Mary Gibbs, Jennifer Tilly, John Goodman,…   See more', 'Language': 'English', 'Runtime': '1 hour and 33 minutes'}\ngrand daughter loved it\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['Brian Chung', 'Greg Bishop'], 'Studio': ['Musa Productions']}\ngreat movie\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Harris Done'], 'Producers': ['James Moll'], 'Starring': ['Mike Dowling', 'Alexandria Lopez', 'Bryan Manthey'], 'Studio': ['FilmBuff']}\nthis will warm your heart\nFive Stars\nAgainst the Sun\nDrama, Adventure, Downbeat, Emotional\n['In one of the most harrowing true stories of World War II, three US Navy airmen crash land their torpedo bomber in the South Pacific and find themselves on a tiny life raft, surrounded by open ocean. No food. No water. No hope of rescue. Against incredible odds, these three virtual strangers must survive storms, sharks, starvation and each other as they try to sail to safety.']\n{'Subtitles': ['None available'], 'Directors': ['Brian Falk'], 'Producers': ['Brian Falk', 'Mark Moran', 'Joe Ricketts', 'Kurt Graver', 'Luisa Gomez de Silva'], 'Starring': ['Garrett Dillahunt', 'Tom Felton', 'Jake Abel']}\na little long\nFour Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ross Katz'], 'Producers': ['Brad Krevoy', 'Cathy Wischner-Sola', 'Ross Katz', 'Lori Keith Douglas'], 'Starring': ['Kevin Bacon', 'Tom Aldredge', 'Blanche Baker'], 'Studio': ['HBO']}\ngreat movie and very moving\nFive Stars\nZootopia\nGinnifer Goodwin  (Actor),     Jason Bateman  (Actor),     Byron Howard  (Director),     Rich Moore  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From Walt Disney Animation Studios comes a comedy-adventure set in the modern mammal metropolis of ZOOTOPIA. Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case -- even if it means partnering with scam-artist fox Nick Wilde to solve the mystery. Bring home this hilarious adventure full of action and heart. It's big fun for all shapes and species!\"]\n{'Genre': 'Animation', 'Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'John DiMaggio, Maurice LaMarche, Phil Johnston, Don Lake, Tommy Chong, Byron Howard, Jenny Slate, Alan Tudyk, Ginnifer Goodwin, Raymond S. Persi, Rich Moore, Shakira, Della Saba, Jason Bateman, Jared Bush, Idris Elba, J.K. Simmons, Jesse Corti, Fuschia!, Bonnie Hunt, Gita Reddy, Katie Lowes, Octavia Spencer, Nate Torrence, Tiny ListerJohn DiMaggio, Maurice LaMarche, Phil Johnston, Don Lake, Tommy Chong, Byron Howard, Jenny Slate, Alan Tudyk, Ginnifer Goodwin, Raymond S. Persi, Rich Moore, Shakira, Della Saba, Jason Bateman, Jared Bush, Idris Elba, J.K. Simmons, Jesse Corti, Fuschia!, Bonnie Hunt, Git…  See more', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.5 x 5.4 x 6.7 inches; 3.2 Ounces', 'Item model number': '35437824', 'Director': 'Byron Howard, Rich Moore', 'Media Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'June 7, 2016', 'Actors': 'Ginnifer Goodwin, Jason Bateman, Idris Elba, Jenny Slate, Nate Torrence', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Jared Bush, Phil Johnston', 'Number of discs': '2'}\nWas a gift.\nFive Stars",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Good Morning, Vietnam (Special Edition)\nReview Date: 2014/10/31\nStore: Robin Williams  (Actor),     Forest Whitaker  (Actor),     Barry Levinson  (Director),     Peter Sova  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['When the U.S. Army engages irreverent, nonconformist radio deejay Adrian Cronauer, it unleashes a secret, if unpredictable, weapon: laughter. Academy Award(R) winner Robin Williams (Best Supporting Actor, GOOD WILL HUNTING, 1997) shakes up 1965 Saigon in the role that garnered him his very first Oscar(R) nomination. Imported by the military to host an early a.m. radio show, Cronauer (Williams) blasts the formerly serene, sanitized airwaves with a constant barrage of rapid-fire humor and the hottest hits from back home. The G.I.s love him, but the top brass is up in arms. Riddled with sidesplitting comic salvos, bittersweet bombshells, and hot \\'60s rock \\'n\\' roll, this landmark film chronicles one man\\'s raucous Saigon adventures amidst a world gone mad. Featuring all-new bonus material that includes hilarious outtakes from Robin Williams\\' \"raw\" monologues, this Special Edition of GOOD MORNING, VIETNAM, scores a direct hit every time you watch.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Contributor': 'Richard Portnow, Mitch Markowitz, Bruno Kirby, Forest Whitaker, Chintara Sukapatana, Juney Smith, Barry Levinson, Robert Wuhl, Floyd Vivino, Tung Thanh Tran, Noble Willingham, Robin Williams, Don Stanton, J.T. Walsh, Dan Stanton, Cu Ba Nguyen, Peter Sova, Richard EdsonRichard Portnow, Mitch Markowitz, Bruno Kirby, Forest Whitaker, Chintara Sukapatana, Juney Smith, Barry Levinson, Robert Wuhl, Floyd Vivino, Tung Thanh Tran, Noble Willingham, Robin Williams, Don Stanton, J.T. Walsh, Dan Stanton, Cu Ba Nguyen, Peter Sova, Richard Edson   See more', 'Language': 'English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '5.3 x 0.6 x 7.5 inches; 2.4 Ounces', 'Item model number': 'good-morning-vietnam-special-edition', 'Director': 'Barry Levinson, Peter Sova', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition', 'Run time': '2 hours and 1 minute', 'Release date': 'September 1, 2006', 'Actors': 'Robin Williams, Forest Whitaker, Tung Thanh Tran, Chintara Sukapatana, Bruno Kirby', 'Studio': 'Buena Vista Home Entertainment / Touchstone', 'Writers': 'Mitch Markowitz', 'Number of discs': '1'}\nReview Text: a good time for Vietnam vets\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Penguins of Madagascar Operation: DVD Premier\nReview Date: 2015/06/03\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: ['Watch out – the boys finally get their own DVD! Get more Penguins, more Madagascar and more fun with the world debut of', 'The Penguins of Madagascar Operations', '. Their mission? To maintain order in the zoo. Their nemesis? Their obnoxious neighbor, King Julien. Join Skipper and the crew as they outwit anyone and everything crossing their path as they rule the zoo.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Media Format': 'AC-3, Color, Animated, Multiple Formats, Subtitled, Dubbed, Dolby, Widescreen, NTSC', 'Run time': '2 hours and 10 minutes', 'Release date': 'February 9, 2010', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Language': 'Unqualified', 'Studio': 'Dreamworks Animated', 'Number of discs': '1'}\nReview Text: kids loved It\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Paddington\nReview Date: 2015/06/03\nStore: Nicole Kidman  (Actor),     Hugh Bonneville  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Paddington tells the story of the comic misadventures of a young Peruvian bear who travels to the city in search of a home. Finding himself lost and alone, he begins to realize that city life is not all he had imagined -until he meets the kindly Brown family who read the label around his neck that says \"Please look after this bear. Thank you,\" and offer him a temporary haven. It looks as though his luck has changed until this rare talking bear catches the eye of a museum taxidermist. The film features an entirely computer-generated bear who interacts with a cast of esteemed actors.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'WC62068', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 28, 2015', 'Actors': 'Nicole Kidman, Hugh Bonneville, Sally Hawkins, Julie Walters, Ben Wishaw', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: kids loved It\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ratatouille\nReview Date: 2015/06/03\nStore: Brad Garrett  (Actor),     Lou Romano  (Actor),     Brad Bird  (Director),     Jan Pinkava  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From the creators of CARS and THE INCREDIBLES comes a break-through comedy with something for everyone. With delightful new characters, experience Paris from an all-new perspective. It\\'s \"terrific movie making\" raves Leonard Maltin of ENTERTAINMENT TONIGHT. In one of Paris\\' finest restaurants, Remy, a determined young rat, dreams of becoming a renowned French chef. Torn between his family\\'s wishes and his true calling, Remy and his pal Linguini set in motion a hilarious chain of events that turns the City of Lights upside down. RATATOUILLE is a treat you\\'ll want to enjoy again and again.', 'Amazon.com', 'One key point: if you can get over the natural gag reflex of seeing hundreds of rodents swarming over a restaurant kitchen, you will be free to enjoy the glory of', 'Ratatouille', \", a delectable Pixar hit. Our hero is Remy, a French rat (voiced by Patton Oswalt) with a cultivated palate, who rises from his humble beginnings to become head chef at a Paris restaurant. How this happens is the stuff of Pixar magic, that ineffable blend of headlong comedy, seamless technology, and wonder (in the latter department, this movie's views of nighttime Paris are on a par with French cinema at its most lyrical). Director Brad Bird (\", 'The Incredibles', \") doesn't quite keep all his spinning plates in the air, but the gags are great and the animation amazingly expressive--Remy's shrugs and nods are nimbler than many flesh-and-blood actors can manage. Refreshingly, the movie's characters aren't celebrity-reliant, with the most recognizable voice coming from Peter O'Toole's snide food critic. (This fellow provides the film's sole sour note--an oddly pointed slap at critics, those craven souls who have done nothing but rave about Pixar's movies over the years.) Brad Bird's style is more quick-hit and less resonant than the approach of Pixar honcho John Lasseter, but it's hard to complain about a movie that cooks up such bountiful pleasure. --\", 'Robert Horton', 'Beyond', 'Ratatouille', 'on DVD', 'Ratatouille', 'on Blu-ray', 'Ratatouille', 'Toys & More', 'Other Classic Pixar Hits', 'Stills from', 'Ratatouille', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'WD05371400DVD', 'Director': 'Brad Bird, Jan Pinkava', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen, Digital Sound', 'Run time': '1 hour and 51 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Brad Garrett, Lou Romano, Patton Oswalt', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS-HD Master Audio 7.1)', 'Studio': 'DISNEY/PIXAR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Kids loved It\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Planes\nReview Date: 2015/08/04\nStore: Dane Cook  (Actor),     Stacy Keach  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nAverage Rating: 4.7\nProduct Details: {}\nReview Text: grandkids loved it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cars 2\nReview Date: 2015/08/04\nStore: Larry the Cable Guy  (Actor),     Owen Wilson  (Actor),     Brad Lewis  (Director),     John Lasseter  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From the creators of CARS and TOY STORY 3 comes a new, laugh-out-loud, heartwarming adventure geared for the entire family. Star race car Lightning McQueen (Owen Wilson) and the incomparable tow truck Mater (Larry the Cable Guy) take their friendship on the road from Radiator Springs to exciting new places when they head overseas to compete in the first-ever World Grand Prix to determine the world\\'s fastest car. But the road to the championship is filled with plenty of potholes, detours and hilarious surprises when Mater gets caught up in an intriguing adventure of his own: international espionage! Experience all the fast-paced fun with an \"all-car\" cast -- plus enjoy two hilarious short films, \"Air Mater\" and \"Hawaiian Vacation.\" It\\'s turbocharged action and thrills and \"even better than before,\" raves Peter Travers of Rolling Stone.', 'Amazon.com', \"Lightning McQueen (voice by Owen Wilson), Mater (Larry the Cable Guy), Sally (Bonnie Hunt), and the rest of the gang from Radiator Springs return to the screen in this sequel to Pixar's\", 'Cars', \"(2006). But instead of evoking a nostalgic vision of Route 66 through the American Southwest, director John Lasseter and his artists spoof James Bond films in a fast-paced adventure that mixes espionage and road racing. After a successful season on the track, Lightning is looking forward to some rest at home, but Mater gets him involved in an elaborate three-part international race sponsored by Sir Miles Axlerod (Eddie Izzard) to promote his new synthetic auto fuel. While serving on Lightning's pit crew, Mater inadvertently gets mixed up with two British secret agent cars, Finn McMissile (Michael Caine) and Holley Shiftwell (Emily Mortimer), who are investigating a plot to sabotage the race. Myriad complications ensue before Lightning and Mater get back to the (relative) peace of Radiator Springs. The Pixar artists clearly had a lot of fun spoofing locations in Tokyo, London, Paris, and the Italian Riviera, and creating auto versions of sumo wrestlers, kabuki actors, Queen Elizabeth II, and a doting Italian mother. The use of 3-D adds adrenaline to the racing sequences.\", 'Cars 2', 'lacks the emotional impact of', 'Toy Story 2', ',', 'Up', ', and most of the other Pixar features, but that will do little to lessen its appeal to its target audience, boys who love cars, driving games, and car toys.', 'Cars 2', 'is screening with', 'Toy Story Toons: Hawaiian Vacation', ', a new short with Woody, Buzz, Barbie, Ken, and the rest of the', 'Toy Story', 'gang. (Rated G: minor toilet humor and a few scary moments.)', '--Charles Solomon', 'Related Products', 'Versions of', 'Cars 2', 'on Blu-ray and DVD']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Michael Caine, Larry the Cable Guy, John Lasseter, Joe Mantegna, Owen Wilson, Brent Musburger, Peter Jacobson, Bonnie Hunt, Eddie Izzard, Thomas Kretschmann, Brad Lewis, John Turturro, Emily MortimerMichael Caine, Larry the Cable Guy, John Lasseter, Joe Mantegna, Owen Wilson, Brent Musburger, Peter Jacobson, Bonnie Hunt, Eddie Izzard, Thomas Kretschmann, Brad Lewis, John Turturro, Emily Mortimer  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '14EFP405434', 'Director': 'Brad Lewis, John Lasseter', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 46 minutes', 'Release date': 'November 1, 2011', 'Actors': 'Larry the Cable Guy, Owen Wilson, Michael Caine, Emily Mortimer, Eddie Izzard', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Disney Pixar', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: grandkids loved it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monsters University (DVD)\nReview Date: 2015/08/04\nStore: Billy Crystal  (Actor),     John Goodman  (Actor),     Dan Scanlon  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'Disney Pixar proudly presents the hilarious story of how two mismatched monsters met and became lifelong friends in a movie screaming with laughter and oozing with heart. Ever since college-bound Mike Wazowski (Billy Crystal) was a little monster, he dreamed of becoming a Scarer - and he knows better than anyone that the best Scarers come from Monsters University (MU). But during his first semester at MU, Mike\\'s plans are derailed when he crosses paths with hotshot, James P. Sullivan, \"Sulley\" (John Goodman), a natural-born Scarer. The pair\\'s out of control competitive spirit gets them both kicked out of the University\\'s elite Scare Program. With their dreams temporarily dashed, they realize they will have to work together, along with an odd bunch of misfit monsters, if they ever hope to make things right. Pull an all-nighter with hours of exclusive bonus extras, including an inside look at the world of monsters and the animated theatrical short film The Blue Umbrella. Monsters University opens the door to huge laughs on Disney Blu-ray.', 'Amazon.com', 'Ever wonder how Mike Wazowski and James P. Sullivan paired up to become the top scaring team at Monsters, Inc.? Somebody at Pixar did, and it turns out that the seemingly made-for-each-other partnership had an unexpectedly rocky beginning. Wazowski\\'s childhood dream was to become a professional scarer, and his acceptance into Monsters University was a dream come true--until an unfortunate encounter with \"Jimmy\" Sullivan ignited a rivalry that threatened both monsters\\' chances of success. True opposites, Wazowski is studious, uptight, and completely intent on learning the history and theory behind scaring, but lacks any semblance of actual scare factor, while the boisterous Sulley relies on natural scaring ability and his family\\'s reputation, but devotes virtually no time or attention to his studies. When an argument between the two classmates gets out of hand, they are expelled from the scare program, and the fraternity-sponsored Scare Games offers them one last-chance opportunity to get back into the program. Wazowski and Sulley reluctantly join forces with one another and a hodge-podge of other misfits out of sheer necessity, but they are a team in name only, with each of the two monsters vowing to pull the \"team\" to victory through his individual efforts and sheer willpower. What the pair discovers is that only by working together and taking advantage of each member\\'s individual differences do they have a chance of winning the contest. The animation in this film is absolutely stellar, the story is intriguing, the development of favorite characters is believable, and the foreshadowing of', 'Monsters, Inc.', 'events is skillful and subtle. Humor abounds throughout the film and the jokes and gags flow freely on a variety of levels, ensuring that kids and adults alike are kept laughing and wondering what\\'s coming next. Returning voice talent Billy Crystal and John Goodman are joined by Nathan Fillion, Helen Mirren, and Julia Sweeney, among others. While the film lacks the sweetness of Boo\\'s relationship with \"Kitty\" in', 'Monsters, Inc.', ',', 'Monsters University', 'is a prequel that complements the original film well and will weather repeated viewings.', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Alfred Molina, Steve Buscemi, Billy Crystal, Screenplay by Daniel Gerson & Robert L. Baird and, Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Joel Murray, Peter Sohn, Helen Mirren, Dave Foley, Sean P. Hayes, John Goodman, Tyler Labine, Nathan Fillion, Charlie Day, Dan ScanlonAlfred Molina, Steve Buscemi, Billy Crystal, Screenplay by Daniel Gerson & Robert L. Baird and, Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Joel Murray, Peter Sohn, Helen Mirren, Dave Foley, Sean P. Hayes, John Goodman, Tyler Labine, Nathan Fillion, Charlie Day,…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 2.0)', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.24 Ounces', 'Item model number': '203208', 'Director': 'Dan Scanlon', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'October 29, 2013', 'Actors': 'Billy Crystal, John Goodman, Steve Buscemi, Helen Mirren, Peter Sohn', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Story by Dan Scanlon, Daniel Gerson & Robert L. Ba, Screenplay by Daniel Gerson & Robert L. Baird and', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: grand daughter love it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monsters, Inc. (Two-Disc Collector's Edition) [DVD]\nReview Date: 2015/08/04\nStore: Billy Crystal  (Actor),     John Goodman  (Actor),     David Silverman  (Director),     Lee Unkrich  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation, Action & Adventure', 'Format': 'Animated, Closed-captioned, Color, NTSC, Dolby, DVD, Widescreen, Dubbed', 'Contributor': 'James Coburn, Frank Oz, Pete Docter, David Silverman, Steve Buscemi, Billy Crystal, Roger Gould, Daniel Gerson, Steve Susskind, Bonnie Hunt, Jeff Pidgeon, Ralph Eggleston, John Ratzenberger, Andrew Stanton, Bob Peterson, Mary Gibbs, Jennifer Tilly, John Goodman, Lee UnkrichJames Coburn, Frank Oz, Pete Docter, David Silverman, Steve Buscemi, Billy Crystal, Roger Gould, Daniel Gerson, Steve Susskind, Bonnie Hunt, Jeff Pidgeon, Ralph Eggleston, John Ratzenberger, Andrew Stanton, Bob Peterson, Mary Gibbs, Jennifer Tilly, John Goodman,…   See more', 'Language': 'English', 'Runtime': '1 hour and 33 minutes'}\nReview Text: grand daughter loved it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/09\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['Brian Chung', 'Greg Bishop'], 'Studio': ['Musa Productions']}\nReview Text: great movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/09\nAverage Rating: 4.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Harris Done'], 'Producers': ['James Moll'], 'Starring': ['Mike Dowling', 'Alexandria Lopez', 'Bryan Manthey'], 'Studio': ['FilmBuff']}\nReview Text: this will warm your heart\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Against the Sun\nReview Date: 2015/08/17\nCategories: Drama, Adventure, Downbeat, Emotional\nProduct Description: ['In one of the most harrowing true stories of World War II, three US Navy airmen crash land their torpedo bomber in the South Pacific and find themselves on a tiny life raft, surrounded by open ocean. No food. No water. No hope of rescue. Against incredible odds, these three virtual strangers must survive storms, sharks, starvation and each other as they try to sail to safety.']\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Brian Falk'], 'Producers': ['Brian Falk', 'Mark Moran', 'Joe Ricketts', 'Kurt Graver', 'Luisa Gomez de Silva'], 'Starring': ['Garrett Dillahunt', 'Tom Felton', 'Jake Abel']}\nReview Text: a little long\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/17\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ross Katz'], 'Producers': ['Brad Krevoy', 'Cathy Wischner-Sola', 'Ross Katz', 'Lori Keith Douglas'], 'Starring': ['Kevin Bacon', 'Tom Aldredge', 'Blanche Baker'], 'Studio': ['HBO']}\nReview Text: great movie and very moving\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Zootopia\nReview Date: 2016/07/15\nStore: Ginnifer Goodwin  (Actor),     Jason Bateman  (Actor),     Byron Howard  (Director),     Rich Moore  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From Walt Disney Animation Studios comes a comedy-adventure set in the modern mammal metropolis of ZOOTOPIA. Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case -- even if it means partnering with scam-artist fox Nick Wilde to solve the mystery. Bring home this hilarious adventure full of action and heart. It's big fun for all shapes and species!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'John DiMaggio, Maurice LaMarche, Phil Johnston, Don Lake, Tommy Chong, Byron Howard, Jenny Slate, Alan Tudyk, Ginnifer Goodwin, Raymond S. Persi, Rich Moore, Shakira, Della Saba, Jason Bateman, Jared Bush, Idris Elba, J.K. Simmons, Jesse Corti, Fuschia!, Bonnie Hunt, Gita Reddy, Katie Lowes, Octavia Spencer, Nate Torrence, Tiny ListerJohn DiMaggio, Maurice LaMarche, Phil Johnston, Don Lake, Tommy Chong, Byron Howard, Jenny Slate, Alan Tudyk, Ginnifer Goodwin, Raymond S. Persi, Rich Moore, Shakira, Della Saba, Jason Bateman, Jared Bush, Idris Elba, J.K. Simmons, Jesse Corti, Fuschia!, Bonnie Hunt, Git…  See more', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.5 x 5.4 x 6.7 inches; 3.2 Ounces', 'Item model number': '35437824', 'Director': 'Byron Howard, Rich Moore', 'Media Format': 'Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'June 7, 2016', 'Actors': 'Ginnifer Goodwin, Jason Bateman, Idris Elba, Jenny Slate, Nate Torrence', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Jared Bush, Phil Johnston', 'Number of discs': '2'}\nReview Text: Was a gift.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThis user has consistently experienced positive interactions when purchasing movies, particularly those catering to children and families. High ratings, often at 5 stars, indicate satisfaction with the entertainment value and engagement these films provide. Favorites include comedic and animated titles that have garnered enthusiastic responses from kids and grandkids, highlighting the joy and fun these films bring. Comments reflect delight in not only the content but also memorable family moments, reinforcing that these selections resonate well with both young audiences and their adult companions.\n\nNEGATIVE SUMMARY:\nWhile the overall sentiment is positive, there are a few instances where dissatisfaction is evident. One specific comment mentions that a film felt \"a little long,\" indicating pacing issues that detracted from the experience. Additionally, another review implies a longing for deeper emotional connections and storytelling, suggesting that some films may lack substance compared to other celebrated animated works. These critiques highlight that while the user enjoys various titles, there are occasional shortcomings noted in pacing and emotional depth.\n\nOVERALL SUMMARY:\nThe user's purchase history demonstrates a robust preference for family-friendly and comedic films, resulting in overwhelmingly positive feedback, especially from younger audiences. Ratings frequently reflect high satisfaction levels, emphasizing the role of these titles in creating joyful family experiences. However, minor criticisms related to pacing and depth indicate that there is room for improvement in certain selections. Overall, the user enjoys a diverse range of entertaining movies while occasionally seeking more impactful storytelling.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Three Stars",
    "text": "Ok but slow.",
    "images": [],
    "asin": "B01LWQMX2E",
    "parent_asin": "B01LWQMX2E",
    "user_id": "AGDVASPKRF5YGUZHNEYZNNMI3GQA",
    "timestamp": "2016-12-14 18:11:12",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": "The Enigma of Flight MH370",
    "average_rating": 3.4,
    "rating_number": 204,
    "features": [
      "IMDb 6.2",
      "52min",
      "2015",
      "PG-13"
    ],
    "description": [
      "After an enigmatic last message from MH370, the airplane carrying 239 passengers vanished from radar. Eight hours later, a last signal provided an approximate location in the middle of the Indian Ocean. Why did MH370 change its course so radically? Why did it turn off all communication systems? What really happened on board? Its disappearance has become the greatest mystery in aviation history."
    ],
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9240ee19478988055bff38bd6d00dbd157f3dddb25dc009e907cdc64092c4621._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9240ee19478988055bff38bd6d00dbd157f3dddb25dc009e907cdc64092c4621._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9240ee19478988055bff38bd6d00dbd157f3dddb25dc009e907cdc64092c4621._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9240ee19478988055bff38bd6d00dbd157f3dddb25dc009e907cdc64092c4621._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9240ee19478988055bff38bd6d00dbd157f3dddb25dc009e907cdc64092c4621._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9240ee19478988055bff38bd6d00dbd157f3dddb25dc009e907cdc64092c4621._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": [
      "Documentary",
      "Cerebral",
      "Mysterious",
      "Tense"
    ],
    "details": {
      "Subtitles": [
        "None available"
      ],
      "Directors": [
        "Luc David"
      ],
      "Producers": [
        "Galaxie Presse"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}