{
  "user_id": "AE2SXNCVU3ZPHIYP2LAPXMM5PDXA",
  "summary": "=== Purchase Information ===\nProduct Title: The Piglet Files: A Question of Intelligence\nReview Date: 2008/06/16\nStore: Louise Catt  (Actor),     Nicholas Lyndhurst  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Don\\'t be fooled by the title: this arch British comedy series has nothing to do with Pooh Bear\\'s porcine pal. Instead, it concerns the misadventures of Peter Chapman, a college professor whose life takes surprising turns after he and his wife encounter two bungling spies. He loses his job in academia only to find himself thrust into the shadowy world of espionage, where he assumes the unlikely code name of \"Piglet.\" About 3 hours on 3 DVDs.']\nAverage Rating: 4.4\nProduct Details: {'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'Color, NTSC, DVD', 'Run time': '2 hours and 51 minutes', 'Release date': 'April 29, 2003', 'Actors': 'Louise Catt, Nicholas Lyndhurst, Serena Evans, Clive Francis, John Ringham', 'Studio': 'Bfs Entertainment', 'Number of discs': '2'}\nReview Text: I found this by accident in my library and really enjoyed it! If you like spy-parody comedies, this is worth you're while.\nReview Title: This is a Great Series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Burn Notice: Season 1\nReview Date: 2008/10/06\nStore: Jeffrey Donovan  (Actor),     Sharon Gless  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'Covert intelligence operative Michael Westen has been punched, kicked, choked and shot. Now he\\'s being burned, and someone\\'s going to pay! When Michael receives a \"burn notice,\" blacklisting him from the intelligence community and compromising his very identity, he must track down a faceless nemesis without getting himself killed in the process. Meanwhile, Michael is forced to double as a private investigator on the dangerous streets of Miami in order to survive.', 'Amazon.com', 'Burn Notice', 'is a canny, clever comedy-thriller show about a covert operative with a heart of gold. Michael Westen (Jeffrey Donovan) is in the middle of a top-secret mission when he discovers he\\'s been \"burned\"--basically, fired without warning. After barely extricating himself from danger, he wakes up in Miami, where the government has abandoned him and locked him out of his own bank account. To make ends meet, he takes on private detective jobs (helping an old lady who\\'s fallen victim to a con artist; rescuing a young girl who\\'s being tricked into white slavery; helping a mother whose son has been kidnapped by the boy\\'s father... only it turns out the father is the rightful parent and the \"mom\" is an assassin sent to kill him--a nice guest star appearance by Lucy Lawless,', 'Xena: Warrior Princess', '), while trying to figure out who burned him and why. Westen tries to remain clinical in his approach to these problems, but he always ends up protecting the helpless with his sophisticated spy skills. Over the course of the first season, he gradually uncovers a mysterious conspiracy that plans to use his talents for their own nefarious ends.', 'Burn Notice', 'deftly mixes the old and the new. The old: Our hero has a hot ex-girlfriend (Gabrielle Anwar,', 'Scent of a Woman', '), a goofy sidekick (cult hero Bruce Campbell of the Evil Dead movies), and a meddling mom (Sharon Gless,', 'Cagney & Lacey', ') who help and hinder him in his investigations, as well as a', 'MacGyver', '-esque skill for making deadly devices out of common household products. The new: A media-savvy way of deconstructing the tricks and techniques of spies and government agencies, often resulting in smart and highly entertaining plot twists. Donovan, handsome but cheeky, combines a light comic touch with a convincing secret agent cool, and the supporting cast fill their niches with aplomb. Their escapades are pretty breezy and occasionally skirt being glib, but most of the time the show finds an extremely entertaining balance between action, romance, and humor. The extras are few (some montages of characteristic moments from the series, including one of the many bikini-clad girls the Miami locale provides) and the commentaries, rather than covering entire episodes, just discuss a few select scenes from each show. Fortunately, the series itself holds up; imagine a cross between', 'Magnum, P.I.', 'and', 'The Wild Wild West', \"(the classic series, not the insulting Will Smith movie) and you're on the right track. --\", 'Bret Fetzer', 'Stills from', 'Burn Notice', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure/Television', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Contributor': 'Sharon Gless, Bruce Campbell, Gabrielle Anwar, Jeffrey Donovan', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Surround), Spanish (Dolby Surround)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 7.8 Ounces', 'Item model number': '19840984922', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Run time': '8 hours and 55 minutes', 'Release date': 'June 17, 2008', 'Actors': 'Jeffrey Donovan, Sharon Gless, Bruce Campbell, Gabrielle Anwar', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nReview Text: I only began watching Burn Notice because Bruce Campbell was in the mix... I've always been a fan of his... Fortunately, the other stars of the show are just as entertaining and the stories aren't half bad either.\nReview Title: It's an Enjoyable Show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night of the Comet [DVD]\nReview Date: 2009/08/01\nStore: Catherine Mary Stewart  (Actor),     Kelli Maroney  (Actor),     Thom Eberhardt  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: ['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG13', 'Release Date:', '6-MAR-2007', 'Media Type:', 'DVD', 'Amazon.com', \"A sleeper at the time of its release in 1984, Thom Eberhardt's\", 'Night of the Comet', \"has built a small cadre of fans thanks to its breezy performances and blend of comedy and tongue-in-cheek science fiction. Catherine Mary Stewart and Kelli Maroney are thoroughly likable as a pair of San Fernando Valley sisters who find themselves completely alone after the arrival of Halley's Comet reduces their affluent community--and most of Los Angeles--to dust. Their subsequent nonstop shopping spree is soon interrupted by predatory zombies, as well as a sinister scientific cabal (led by cult favorites Mary Woronov and Geoffrey Lewis) with designs on the girls. Stewart and Maroney are terrifically game as the heroines (especially Maroney, whose flair for bubbly comedy was never given another chance on screen), and Robert (\", 'Star Trek: Voyager', \") Beltran is also on hand as a fellow survivor and romantic lead. Fun for '80s enthusiasts and sci-fi fiends who don't mind a little fizz in their end-of-the-world scenarios.\", '-- Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Contributor': 'Peter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon EricsonPeter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon Ericson   See more', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.55 inches; 2.4 Ounces', 'Director': 'Thom Eberhardt', 'Media Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'March 6, 2007', 'Actors': 'Catherine Mary Stewart, Kelli Maroney, Robert Beltran, Sharon Farrell, Mary Woronov', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Thom Eberhardt', 'Number of discs': '1'}\nReview Text: It's Hokey & Badly Acted for the most part but it screams Bad Old Science Fiction Horror from the 50's and anyone that's seen those films, knows what I mean.<br />I really Enjoyed it.\nReview Title: You Gotta Luv It\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Sentinel\nReview Date: 2010/03/21\nStore: Chris Sarandon  (Actor),     Cristina Raines  (Actor),     Michael Winner  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: [\"When a beautiful model, Alison Parker (Cristina Raines), rents an apartment in a gloomy New York brownstone, little does she realize the unspeakable horrors that await her behind its mysterious doors. Based on Jeffrey Konvitz's best-selling novel, this contemporary gothic chiller features jump-out-of-your-seat special effects and an incredible assemblage of stars including Ava Gardner, Jose Ferrer, John Carradine, Burgess Meredith, Deborah Raffin, Chris Sarandon, Eli Wallach and Martin Balsam. Alison likes her eccentric new neighbors, so it comes as a shock when she's told that, except for a strange old priest, she's the only tenant. Director Michael Winner comes up with something to terrify everyone in this spine-tingling exercise in supernatural suspense.\", 'Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Anamorphic, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Walken, Eli Wallach, Michael Winner, Martin Balsam, Arthur Kennedy, Ava Gardner, Chris Sarandon, John Carradine, Jose Ferrer, Cristina Raines, Burgess Meredith, Jeffrey Konvitz, Deborah Raffin, Sylvia MilesChristopher Walken, Eli Wallach, Michael Winner, Martin Balsam, Arthur Kennedy, Ava Gardner, Chris Sarandon, John Carradine, Jose Ferrer, Cristina Raines, Burgess Meredith, Jeffrey Konvitz, Deborah Raffin, Sylvia Miles  See more', 'Initial release date': '2009-08-30', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.44 x 5.35 x 0.67 inches; 2.26 Ounces', 'Item model number': '2219754', 'Director': 'Michael Winner', 'Media Format': 'Multiple Formats, Anamorphic, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Chris Sarandon, Cristina Raines, Martin Balsam, John Carradine, Jose Ferrer', 'Subtitles': 'French, Spanish', 'Producers': 'Michael Winner, Jeffrey Konvitz', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Michael Winner, Jeffrey Konvitz', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I just recently read the book. I'd never seen the movie, so it was a surprise. It's not really a Horror novel so much as perhaps a supernatural mystery.  The movie was decent and it gave the chance to see the ending horror.\nReview Title: The Book is Always Better\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Spell (1977)\nReview Date: 2010/04/23\nStore: Lee Philips  (Director),     Lee Grant  (Actor),     James Olson  (Actor)    &                   0                  more   Rated:    NR    Format: VHS Tape\nCategories: Movies & TV, Movies\nProduct Description: ['A teenage girl with incredible occult powers spends her time making life miserable for her supercilious tormentors. Made for television.']\nAverage Rating: 4.0\nProduct Details: {'Language': 'English', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Lee Philips', 'Run time': '1 hour and 26 minutes', 'Date First Available': 'September 8, 2005', 'Actors': 'Lee Grant, James Olson, Susan Myers', 'Studio': 'Worldvision Enterprises'}\nReview Text: I was around when Carrie was an original movie in the theaters & of course liked it.. This TV-version \"The Spell\" was enjoyable for me back then as well. And I recently was able to catch it on television. Me, personally, I like the movie and would watch it again but it's very difficult to see the old TV-movies from years ago..\nReview Title: Most Certainly Inspired by Uncle Stevie's 'Carrie'\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Supernatural: Season 5\nReview Date: 2011/02/10\nStore: Jared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"Twenty-six years ago, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force. Subsequently, their father raised them to be soldiers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America ... and he taught them how to kill it. This haunting series follows the Winchester brothers as they crisscross the lonely and mysterious back roads of the country in their '67 Chevy Impala, hunting down every evil supernatural force they encounter along the way. At the end of the fourth season, Sam unwittingly broke the final seal – that held Lucifer captive in Hell. Now, Lucifer is free, the Apocalypse is here and angels prepare for a spectacular final battle. Against a landscape of celestial violence, natural disasters and a rising human death toll, Sam and Dean, with the help of fallen angel Castiel, must find a way to achieve the impossible: Kill the Devil.\", 'Amazon.com', \"How's this for a story arc: the Gates of Hell are opened, unleashing both Lucifer himself and the Four Horsemen of the Apocalypse, and bringing to an end civilization as we know it. That's what awaits fans of\", 'Supernatural', 'in its fifth and most epic season to date. The stumbles in plot or character that are typical to most long-running series are largely missing from this season (though some might consider the stunt casting of Paris Hilton as a pagan goddess in \"Hammer of the Gods\" as such); instead, there\\'s a solid, complex, and entirely satisfying run of episodes, and even a pair of series highlights in \"Changing Channels\" and \"The Real Ghostbusters.\" The former finds heroes Sam and Dean (Jensen Ackles and Jared Padalecki) trapped in a TV-influenced netherworld populated by perverse small-screen archetypes, while the latter is a clever bit of meta-fiction involving a real ghost at a', 'Supernatural', \"fan convention, complete with Winchester brothers look-alikes. The other 20 episodes bounce between stand-alone adventures and the larger story at hand, which finds the brothers racing to collect the rings of the Four Horsemen, which will return Lucifer to his prison. This is fantasy storytelling for television at its best--broad in scope and heavy with special effects, but never forgetting that the core of the show is the relationship between Sam and Dean and their joint quest to rid the world of evil. Both are well represented here in a season that brings the show's main story line to its fitting and satisfying conclusion.\", 'Fans should also be pleased with most of the extras on the six-disc set for', 'Season 5', '. The most ambitious feature is the Apocalypse Survival Guide, hosted by Bobby Singer (Jim Beaver). Presented as a tour through Bobby\\'s house, the guide gives viewers a detailed lowdown on the major players in the war against Satan, including the Horsemen, various demons, and the Man in Red himself. Navigating one\\'s way through the interactive videos can be a challenge, as the layout requires viewers to constantly restart the disc in order to review certain videos, but for sheer informational content, it\\'s hard to beat. Also present is a commentary track by series creator Eric Kripke (who left the series at the end of this season) and writer Ben Edlund on \"The End,\" which required such elaborate sets that the show earned its own back lot; said location also gets a once-over, as does an unaired scene from \"The Real Ghostbusters.\" Best of all is perhaps the entire web series', 'Ghostfacers', ', which pokes much-needed fun at the reality show', 'Ghost Hunters', 'in addition to providing some minor scares.', '--Paul Gaita']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Horror, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Drama, Horror, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Subtitled, Widescreen, Dubbed, NTSC', 'Contributor': 'Jared Padalecki, Jensen Ackles, Misha Collins', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'False', 'MPAA rating': 'NR (Not Rated)', 'Item model number': 'Sup Season 5', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Subtitled, Widescreen, Dubbed, NTSC', 'Run time': '15 hours and 24 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Jared Padalecki, Jensen Ackles, Misha Collins', 'Dubbed': 'Portuguese', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Home Video', 'Number of discs': '6'}\nReview Text: I was So Hooked on this show; not since I was a kid did I have to watch every week. It does start out fairly well IMO but the continued struggle back & forth between Dean & the Angels just seemed to prolong the agony of what needed to be done.. It just kept going back & forth & wasting time w/what they could have been doing. And bringing in the old favorite characters & doing what the writers did, really ticked me off. I think it was definitely a cheap move. Not sure if they had planned a 6th season but why just obliterate all the supporting characters.. It was Stoopid. I collected all of the 1st four seasons but have no intention of owning the 5th & don't have a clue what happened in the 6th. They really should have went out in a blaze of glory instead of jumping the shark.  I will remember \"The Boys\" fondly & Loved the 4 years of Pure Entertainment they brought... Thank You Sam & Dean\nReview Title: Season 5 was A HUGE DISAPOINTMENT\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vanishing on 7th Street\nReview Date: 2011/10/09\nStore: Hayden Christensen  (Actor),     John Leguizamo  (Actor),     Brad Anderson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', \"From director Brad Anderson (SESSION 9, TRANSSIBERIAN, THE MACHINIST) comes VANISHING ON 7TH STREET, a terrifying, apocalyptic thriller that taps into one of humankind's most primal anxieties: fear of the dark. An unexplained blackout plunges the city of Detroit into total darkness, and by the time the sun rises, only a few people remain surrounded by heaps of empty clothing, abandoned cars and lengthening shadows. A small handful of strangers that have survived the night (Hayden Christensen, Thandie Newton, John Leguizamo and newcomer Jacob Latimore) each find their way to a rundown bar, whose gasoline powered generator and stockpile of food and drink make it the last refuge in a deserted city. With daylight beginning to disappear completely and whispering shadows surrounding the survivors, they soon discover that the enemy is the darkness itself, and only the few remaining light sources can keep them safe. As time begins to run out for them, darkness closes in and they must face the ultimate terror.\", 'Amazon.com', 'Beginning with its title--a combination of promisingly enigmatic and weirdly specific--this ambitious melding of the', 'Left Behind', 'series,', 'Pitch Black', ', and any number of', 'Twilight Zone', \"episodes has creepy atmosphere to burn, but its refusal to finally turn over its cards may frustrate viewers in the mood for closure. The plot turns on an admittedly monster hook: following an unexplained mass vanishing, a handful of Detroit residents (including Hayden Christensen, Thandie Newton, and an uncharacteristically muted John Leguizamo) find themselves surrounded by leagues of whispering, carnivorous shadows, kept at bay only by the city's dwindling sources of light. Anthony Jaswinski's script drops tantalizing references to religious prophecies, human-made catastrophes, and real-life phenomena (including the still unexplained 16th-century disappearance of the entire Roanoke Colony), but never really seems to fix on the specifics of its particular spooky situation, leaving the audience to fill in an increasing number of blanks. That the film ultimately works as well as it does is due to director Brad Anderson, a filmmaker whose previous work (including\", 'The Machinist', 'and the wonderfully upsetting', 'Session 9', \") has displayed a firm grasp of place. Here, he outdoes himself, creating a barren, unstable metropolis with barely glimpsed slitherings in virtually every corner. If the narrative lived up to its surroundings, this could have been a small classic of the genre. As it stands, it's a case of the frame overshadowing the contents. --\", 'Andrew Wright']\nAverage Rating: 3.8\nProduct Details: {'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MGNO10387DVD', 'Director': 'Brad Anderson', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 31 minutes', 'Release date': 'May 17, 2011', 'Actors': 'Hayden Christensen, John Leguizamo, Thandie Newton', 'Subtitles': 'Spanish', 'Studio': 'Magnolia Home Ent', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I just finished watching this unknown movie in my world, quite Pleased w/Vanishing on 7th St. ... Obviously, this movie has plenty of Mixed Reviews. I personally thought it was quite well done. Perhaps if bigger names had been attached; the reviews would have been less mixed.\nReview Title: Perhaps if the movie had bigger names??\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Legit: Season 1\nReview Date: 2014/05/31\nStore: Jefferies, Jim  (Director),     O'Fallon, Peter  (Director),     Bakkedahl, Dan  (Actor),     Qualls, Dj  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\nProduct Description: ['This outrageous new comedy stars Australian Jim Jefferies as an edgy, foul-mouthed stand-up comic living in Los Angeles, struggling to make his life and career more \"legit.\" But every time Jim tries to do the right thing, his good deeds turn into wildly inappropriate and utterly hilarious escapades. Joined by his neurotic best friend and roommate, Steve, and Steve\\'s wheelchair-bound brother, Billy, Jim takes comedy to a whole new level, whether it\\'s visiting a Las Vegas brothel, partying with the mentally-challenged or trying to pick up women at a gay bar.']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Bakkedahl, Dan, Jefferies, Jim, Qualls, Dj, O'Fallon, Peter\", 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Runtime': '4 hours and 46 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '24543929932', 'Director': \"Jefferies, Jim, O'Fallon, Peter\", 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 46 minutes', 'Release date': 'February 25, 2014', 'Actors': 'Bakkedahl, Dan, Qualls, Dj', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: I Love the Show. Especially the HandiCap~able actors they include in the stories. I think it's Great & Hope they keep it going... Acceptance is Great\nReview Title: I Enjoy this Guy Very Much\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Planet Earth 5-Dvd Collector's Edition Boxed Set! Discovery Channel\nReview Date: 2014/06/08\nStore: Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Disc 1: Pole to Pole, Mountains, Deep Ocean Disc 2: Deserts, Ice Worlds, Shallow Seas Disc 3: Great Plains, Jungles, Fresh Water Disc 4: Seasonal Forests, Caves Disc 5 (Bonus Disc): Planet Earth: The Future']\nAverage Rating: 4.5\nProduct Details: {'Format': 'NTSC, Color, Box set, Widescreen, Full length', 'Contributor': 'Sigourney Weaver', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.4 x 5.6 x 1.3 inches; 9.6 Ounces', 'Media Format': 'NTSC, Color, Box set, Widescreen, Full length', 'Number of discs': '5'}\nReview Text: I only say you would like the narration with Ms. Weaver much better. I personally couldn't understand Mr. Attenborough well at all & he seems nonstop in speaking thru every scene; (in my opinion)  How Can You Not Love This Series. The Wonders of Nature you might never have seen in your lifetime. And it is Heartbreaking at moments, since that is the Nature. Such Beauty for your mind and soul to enjoy. You'd have to be the Grinch, not to Love It.\nReview Title: You want Sigourney Weaver unless you can easily understand Mr. Attenborough\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/10/11\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Sackheim', 'Adam Arkin', 'David Boreanaz', 'Alex Chapple', 'Milan Cheylov', 'James Hayman', 'Kevin Hooks', 'Dwight H. Little', 'Seith Mann', 'Vahan Moosekian'], 'Studio': ['FOX']}\nReview Text: I was So Pleased to discover this show on Netflix.. I believed it was Well Written & the Cast quite Enjoyable to Watch Interact as their Characters. It's Too Bad about the cancellation since last episode's leave you hanging Like most shows do now-a-days; I do believe the story did not end w/the 13th episode. And the death of  Michael Clarke Duncan is so Tragic..  I don't believe they could have found his replacement but perhaps they could have made his death part of the show??? But I am not the person who decides what shows continue & which 1's get axed. Regardless, I have to scratch my head @ their choices.... I DO LOVE THIS SHOW!!!\nReview Title: Come Back to Us!!!  MORE OF \"THE FINDER\" PLEASE!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The 100: Season 1\nReview Date: 2014/11/06\nStore: Eliza Taylor  (Actor),     Paige Turco  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['The 100: The Complete First Season (DVD)', 'It’s been nearly 100 years since Earth was devastated by a nuclear apocalypse, with the only survivors being the 400 inhabitants of 12 international space stations that were in orbit at the time. Three generations later, the survivors number 4,000 — and resources are running out on their dying “Ark” (the 12 stations now linked together and repurposed to keep the survivors alive). Draconian measures including capital punishment and population control are the order of the day, as the leaders of the Ark take ruthless steps to ensure their future — including secretly exiling a group of 100 juvenile prisoners to the Earth’s surface to test whether it’s habitable. No one has set foot on the planet in nearly a century — until now. For the 100 on Earth, the alien planet they’ve never known is a mysterious realm that can be magical one moment and lethal the next.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, NTSC, Subtitled', 'Contributor': 'Elizabeth Craft, Eliza Taylor, Jason Rothenberg, Thomas McDonell, Paige Turco', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 4.8 Ounces', 'Item model number': '883929424382', 'Media Format': 'Multiple Formats, NTSC, Subtitled', 'Run time': '9 hours and 32 minutes', 'Release date': 'September 23, 2014', 'Actors': 'Eliza Taylor, Paige Turco, Thomas McDonell', 'Subtitles': 'Spanish, French', 'Producers': 'Jason Rothenberg, Elizabeth Craft', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nReview Text: I'm a 50+ woman who really enjoyed watching the 1st season. The young cast are fortunately are great actors & pretty believable for me.  The story-lines I thought were solid and surprisingly entertaining. Hope 2nd season doesn't let me down..\nReview Title: I'm a 50+ woman who really enjoyed watching the 1st season\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Damnation Alley\nReview Date: 2015/01/02\nStore: Jan-Michael Vincent  (Actor),     George Peppard  (Actor),     Jack Smight  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', 'After a horrific nuclear assault, three soldiers band together in a special all-terrain land cruiser and head for Albany, NY-the only American city to be spared in the attack. As they travel through the post-nuke wastelands, they pick up a beautiful woman and an incorrigible teenager (Jackie Earle Haley) while battling mutant insects, packs of violent survivors and brutal electrical storms that savage the already barren plains.', 'Amazon.com', \"A low-wattage cult hit among post-apocalypse movie fans, Jack Smight's\", 'Damnation Alley', \"arrives on DVD in a deluxe presentation that underscores its troubled production, as well as its modest charms. Based very loosely on the 1967 novel of the same name by Roger Zelazny (who loathed the movie version), the film stars George Peppard and Jan-Michael Vincent as Air Force officers crisscrossing the ruins of America in massive armored personnel carriers (the 10-ton Landmaster, originally designed to lug trucks, and the film's most enduring image) in search of survivors. Their journey brings them in contact with shotgun-toting killers and giant, flesh-eating cockroaches, plus Jackie Earle Haley and Dominique Sanda as the final pieces in their new model of a nuclear family. Plagued by special-effects issues and reedits,\", 'Damnation Alley', \"arrived with a thud in the wake of 20th Century Fox's other science-fiction release,\", 'Star Wars', ', which the studio initially regarded as', 'Damnation', \"'s second-string support. The film developed a modest following in the ensuing decades among late-night TV habitués, who can finally retire their gray market dupes of the 1985 VHS release, thanks to Shout Factory's DVD release. The disc offers a new anamorphic widescreen presentation (minus the Sound 360 process, which was too damaged to preserve, but with three newer audio options), as well as commentary by veteran producer Paul Maslansky and a trio of interesting making-of documentaries, the most interesting of which features an interview with co-screenwriter Alan Sharp (\", \"Ulzana's Raid\", ',', 'Night Moves', \"), whose assessment of his work isn't too far from Zelazny's reaction. Meanwhile, a look at the Landmaster with designer Dean Jeffries should satisfy fans of that unique vehicle.\", '--Paul Gaita']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '12623', 'Director': 'Jack Smight', 'Media Format': 'Multiple Formats, Dolby, Widescreen, Color, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 12, 2011', 'Actors': 'Jan-Michael Vincent, George Peppard, Jackie Earle Haley, Paul Winfield', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This came out in the 70's and I believe it was a Great Flick for the Time. It's still a Fun Watch. It probably comes across as bad Sci/Fi meets the world's end... It's not horrible, just cheesy by some peoples opinion's in this day or age of CGI. I Did Read the Book & believe me.. The movie is better (:\nReview Title: So Glad it's on DVD now.. Definitely Buying a Copy.\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Piglet Files: A Question of Intelligence\nLouise Catt  (Actor),     Nicholas Lyndhurst  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Don\\'t be fooled by the title: this arch British comedy series has nothing to do with Pooh Bear\\'s porcine pal. Instead, it concerns the misadventures of Peter Chapman, a college professor whose life takes surprising turns after he and his wife encounter two bungling spies. He loses his job in academia only to find himself thrust into the shadowy world of espionage, where he assumes the unlikely code name of \"Piglet.\" About 3 hours on 3 DVDs.']\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'Color, NTSC, DVD', 'Run time': '2 hours and 51 minutes', 'Release date': 'April 29, 2003', 'Actors': 'Louise Catt, Nicholas Lyndhurst, Serena Evans, Clive Francis, John Ringham', 'Studio': 'Bfs Entertainment', 'Number of discs': '2'}\nI found this by accident in my library and really enjoyed it! If you like spy-parody comedies, this is worth you're while.\nThis is a Great Series!\nBurn Notice: Season 1\nJeffrey Donovan  (Actor),     Sharon Gless  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'Covert intelligence operative Michael Westen has been punched, kicked, choked and shot. Now he\\'s being burned, and someone\\'s going to pay! When Michael receives a \"burn notice,\" blacklisting him from the intelligence community and compromising his very identity, he must track down a faceless nemesis without getting himself killed in the process. Meanwhile, Michael is forced to double as a private investigator on the dangerous streets of Miami in order to survive.', 'Amazon.com', 'Burn Notice', 'is a canny, clever comedy-thriller show about a covert operative with a heart of gold. Michael Westen (Jeffrey Donovan) is in the middle of a top-secret mission when he discovers he\\'s been \"burned\"--basically, fired without warning. After barely extricating himself from danger, he wakes up in Miami, where the government has abandoned him and locked him out of his own bank account. To make ends meet, he takes on private detective jobs (helping an old lady who\\'s fallen victim to a con artist; rescuing a young girl who\\'s being tricked into white slavery; helping a mother whose son has been kidnapped by the boy\\'s father... only it turns out the father is the rightful parent and the \"mom\" is an assassin sent to kill him--a nice guest star appearance by Lucy Lawless,', 'Xena: Warrior Princess', '), while trying to figure out who burned him and why. Westen tries to remain clinical in his approach to these problems, but he always ends up protecting the helpless with his sophisticated spy skills. Over the course of the first season, he gradually uncovers a mysterious conspiracy that plans to use his talents for their own nefarious ends.', 'Burn Notice', 'deftly mixes the old and the new. The old: Our hero has a hot ex-girlfriend (Gabrielle Anwar,', 'Scent of a Woman', '), a goofy sidekick (cult hero Bruce Campbell of the Evil Dead movies), and a meddling mom (Sharon Gless,', 'Cagney & Lacey', ') who help and hinder him in his investigations, as well as a', 'MacGyver', '-esque skill for making deadly devices out of common household products. The new: A media-savvy way of deconstructing the tricks and techniques of spies and government agencies, often resulting in smart and highly entertaining plot twists. Donovan, handsome but cheeky, combines a light comic touch with a convincing secret agent cool, and the supporting cast fill their niches with aplomb. Their escapades are pretty breezy and occasionally skirt being glib, but most of the time the show finds an extremely entertaining balance between action, romance, and humor. The extras are few (some montages of characteristic moments from the series, including one of the many bikini-clad girls the Miami locale provides) and the commentaries, rather than covering entire episodes, just discuss a few select scenes from each show. Fortunately, the series itself holds up; imagine a cross between', 'Magnum, P.I.', 'and', 'The Wild Wild West', \"(the classic series, not the insulting Will Smith movie) and you're on the right track. --\", 'Bret Fetzer', 'Stills from', 'Burn Notice', '(Click for larger image)']\n{'Genre': 'Action & Adventure/Television', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Contributor': 'Sharon Gless, Bruce Campbell, Gabrielle Anwar, Jeffrey Donovan', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Surround), Spanish (Dolby Surround)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 7.8 Ounces', 'Item model number': '19840984922', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Run time': '8 hours and 55 minutes', 'Release date': 'June 17, 2008', 'Actors': 'Jeffrey Donovan, Sharon Gless, Bruce Campbell, Gabrielle Anwar', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nI only began watching Burn Notice because Bruce Campbell was in the mix... I've always been a fan of his... Fortunately, the other stars of the show are just as entertaining and the stories aren't half bad either.\nIt's an Enjoyable Show\nNight of the Comet [DVD]\nCatherine Mary Stewart  (Actor),     Kelli Maroney  (Actor),     Thom Eberhardt  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG13', 'Release Date:', '6-MAR-2007', 'Media Type:', 'DVD', 'Amazon.com', \"A sleeper at the time of its release in 1984, Thom Eberhardt's\", 'Night of the Comet', \"has built a small cadre of fans thanks to its breezy performances and blend of comedy and tongue-in-cheek science fiction. Catherine Mary Stewart and Kelli Maroney are thoroughly likable as a pair of San Fernando Valley sisters who find themselves completely alone after the arrival of Halley's Comet reduces their affluent community--and most of Los Angeles--to dust. Their subsequent nonstop shopping spree is soon interrupted by predatory zombies, as well as a sinister scientific cabal (led by cult favorites Mary Woronov and Geoffrey Lewis) with designs on the girls. Stewart and Maroney are terrifically game as the heroines (especially Maroney, whose flair for bubbly comedy was never given another chance on screen), and Robert (\", 'Star Trek: Voyager', \") Beltran is also on hand as a fellow survivor and romantic lead. Fun for '80s enthusiasts and sci-fi fiends who don't mind a little fizz in their end-of-the-world scenarios.\", '-- Paul Gaita']\n{'Genre': 'Comedy', 'Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Contributor': 'Peter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon EricsonPeter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon Ericson   See more', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.55 inches; 2.4 Ounces', 'Director': 'Thom Eberhardt', 'Media Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'March 6, 2007', 'Actors': 'Catherine Mary Stewart, Kelli Maroney, Robert Beltran, Sharon Farrell, Mary Woronov', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Thom Eberhardt', 'Number of discs': '1'}\nIt's Hokey & Badly Acted for the most part but it screams Bad Old Science Fiction Horror from the 50's and anyone that's seen those films, knows what I mean.<br />I really Enjoyed it.\nYou Gotta Luv It\nThe Sentinel\nChris Sarandon  (Actor),     Cristina Raines  (Actor),     Michael Winner  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n[\"When a beautiful model, Alison Parker (Cristina Raines), rents an apartment in a gloomy New York brownstone, little does she realize the unspeakable horrors that await her behind its mysterious doors. Based on Jeffrey Konvitz's best-selling novel, this contemporary gothic chiller features jump-out-of-your-seat special effects and an incredible assemblage of stars including Ava Gardner, Jose Ferrer, John Carradine, Burgess Meredith, Deborah Raffin, Chris Sarandon, Eli Wallach and Martin Balsam. Alison likes her eccentric new neighbors, so it comes as a shock when she's told that, except for a strange old priest, she's the only tenant. Director Michael Winner comes up with something to terrify everyone in this spine-tingling exercise in supernatural suspense.\", 'Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Anamorphic, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Walken, Eli Wallach, Michael Winner, Martin Balsam, Arthur Kennedy, Ava Gardner, Chris Sarandon, John Carradine, Jose Ferrer, Cristina Raines, Burgess Meredith, Jeffrey Konvitz, Deborah Raffin, Sylvia MilesChristopher Walken, Eli Wallach, Michael Winner, Martin Balsam, Arthur Kennedy, Ava Gardner, Chris Sarandon, John Carradine, Jose Ferrer, Cristina Raines, Burgess Meredith, Jeffrey Konvitz, Deborah Raffin, Sylvia Miles  See more', 'Initial release date': '2009-08-30', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.44 x 5.35 x 0.67 inches; 2.26 Ounces', 'Item model number': '2219754', 'Director': 'Michael Winner', 'Media Format': 'Multiple Formats, Anamorphic, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Chris Sarandon, Cristina Raines, Martin Balsam, John Carradine, Jose Ferrer', 'Subtitles': 'French, Spanish', 'Producers': 'Michael Winner, Jeffrey Konvitz', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Michael Winner, Jeffrey Konvitz', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI just recently read the book. I'd never seen the movie, so it was a surprise. It's not really a Horror novel so much as perhaps a supernatural mystery.  The movie was decent and it gave the chance to see the ending horror.\nThe Book is Always Better\nThe Spell (1977)\nLee Philips  (Director),     Lee Grant  (Actor),     James Olson  (Actor)    &                   0                  more   Rated:    NR    Format: VHS Tape\nMovies & TV, Movies\n['A teenage girl with incredible occult powers spends her time making life miserable for her supercilious tormentors. Made for television.']\n{'Language': 'English', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Lee Philips', 'Run time': '1 hour and 26 minutes', 'Date First Available': 'September 8, 2005', 'Actors': 'Lee Grant, James Olson, Susan Myers', 'Studio': 'Worldvision Enterprises'}\nI was around when Carrie was an original movie in the theaters & of course liked it.. This TV-version \"The Spell\" was enjoyable for me back then as well. And I recently was able to catch it on television. Me, personally, I like the movie and would watch it again but it's very difficult to see the old TV-movies from years ago..\nMost Certainly Inspired by Uncle Stevie's 'Carrie'\nSupernatural: Season 5\nJared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"Twenty-six years ago, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force. Subsequently, their father raised them to be soldiers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America ... and he taught them how to kill it. This haunting series follows the Winchester brothers as they crisscross the lonely and mysterious back roads of the country in their '67 Chevy Impala, hunting down every evil supernatural force they encounter along the way. At the end of the fourth season, Sam unwittingly broke the final seal – that held Lucifer captive in Hell. Now, Lucifer is free, the Apocalypse is here and angels prepare for a spectacular final battle. Against a landscape of celestial violence, natural disasters and a rising human death toll, Sam and Dean, with the help of fallen angel Castiel, must find a way to achieve the impossible: Kill the Devil.\", 'Amazon.com', \"How's this for a story arc: the Gates of Hell are opened, unleashing both Lucifer himself and the Four Horsemen of the Apocalypse, and bringing to an end civilization as we know it. That's what awaits fans of\", 'Supernatural', 'in its fifth and most epic season to date. The stumbles in plot or character that are typical to most long-running series are largely missing from this season (though some might consider the stunt casting of Paris Hilton as a pagan goddess in \"Hammer of the Gods\" as such); instead, there\\'s a solid, complex, and entirely satisfying run of episodes, and even a pair of series highlights in \"Changing Channels\" and \"The Real Ghostbusters.\" The former finds heroes Sam and Dean (Jensen Ackles and Jared Padalecki) trapped in a TV-influenced netherworld populated by perverse small-screen archetypes, while the latter is a clever bit of meta-fiction involving a real ghost at a', 'Supernatural', \"fan convention, complete with Winchester brothers look-alikes. The other 20 episodes bounce between stand-alone adventures and the larger story at hand, which finds the brothers racing to collect the rings of the Four Horsemen, which will return Lucifer to his prison. This is fantasy storytelling for television at its best--broad in scope and heavy with special effects, but never forgetting that the core of the show is the relationship between Sam and Dean and their joint quest to rid the world of evil. Both are well represented here in a season that brings the show's main story line to its fitting and satisfying conclusion.\", 'Fans should also be pleased with most of the extras on the six-disc set for', 'Season 5', '. The most ambitious feature is the Apocalypse Survival Guide, hosted by Bobby Singer (Jim Beaver). Presented as a tour through Bobby\\'s house, the guide gives viewers a detailed lowdown on the major players in the war against Satan, including the Horsemen, various demons, and the Man in Red himself. Navigating one\\'s way through the interactive videos can be a challenge, as the layout requires viewers to constantly restart the disc in order to review certain videos, but for sheer informational content, it\\'s hard to beat. Also present is a commentary track by series creator Eric Kripke (who left the series at the end of this season) and writer Ben Edlund on \"The End,\" which required such elaborate sets that the show earned its own back lot; said location also gets a once-over, as does an unaired scene from \"The Real Ghostbusters.\" Best of all is perhaps the entire web series', 'Ghostfacers', ', which pokes much-needed fun at the reality show', 'Ghost Hunters', 'in addition to providing some minor scares.', '--Paul Gaita']\n{'Genre': 'Science Fiction & Fantasy, Drama, Horror, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Drama, Horror, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Subtitled, Widescreen, Dubbed, NTSC', 'Contributor': 'Jared Padalecki, Jensen Ackles, Misha Collins', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'False', 'MPAA rating': 'NR (Not Rated)', 'Item model number': 'Sup Season 5', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Subtitled, Widescreen, Dubbed, NTSC', 'Run time': '15 hours and 24 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Jared Padalecki, Jensen Ackles, Misha Collins', 'Dubbed': 'Portuguese', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Home Video', 'Number of discs': '6'}\nI was So Hooked on this show; not since I was a kid did I have to watch every week. It does start out fairly well IMO but the continued struggle back & forth between Dean & the Angels just seemed to prolong the agony of what needed to be done.. It just kept going back & forth & wasting time w/what they could have been doing. And bringing in the old favorite characters & doing what the writers did, really ticked me off. I think it was definitely a cheap move. Not sure if they had planned a 6th season but why just obliterate all the supporting characters.. It was Stoopid. I collected all of the 1st four seasons but have no intention of owning the 5th & don't have a clue what happened in the 6th. They really should have went out in a blaze of glory instead of jumping the shark.  I will remember \"The Boys\" fondly & Loved the 4 years of Pure Entertainment they brought... Thank You Sam & Dean\nSeason 5 was A HUGE DISAPOINTMENT\nVanishing on 7th Street\nHayden Christensen  (Actor),     John Leguizamo  (Actor),     Brad Anderson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', \"From director Brad Anderson (SESSION 9, TRANSSIBERIAN, THE MACHINIST) comes VANISHING ON 7TH STREET, a terrifying, apocalyptic thriller that taps into one of humankind's most primal anxieties: fear of the dark. An unexplained blackout plunges the city of Detroit into total darkness, and by the time the sun rises, only a few people remain surrounded by heaps of empty clothing, abandoned cars and lengthening shadows. A small handful of strangers that have survived the night (Hayden Christensen, Thandie Newton, John Leguizamo and newcomer Jacob Latimore) each find their way to a rundown bar, whose gasoline powered generator and stockpile of food and drink make it the last refuge in a deserted city. With daylight beginning to disappear completely and whispering shadows surrounding the survivors, they soon discover that the enemy is the darkness itself, and only the few remaining light sources can keep them safe. As time begins to run out for them, darkness closes in and they must face the ultimate terror.\", 'Amazon.com', 'Beginning with its title--a combination of promisingly enigmatic and weirdly specific--this ambitious melding of the', 'Left Behind', 'series,', 'Pitch Black', ', and any number of', 'Twilight Zone', \"episodes has creepy atmosphere to burn, but its refusal to finally turn over its cards may frustrate viewers in the mood for closure. The plot turns on an admittedly monster hook: following an unexplained mass vanishing, a handful of Detroit residents (including Hayden Christensen, Thandie Newton, and an uncharacteristically muted John Leguizamo) find themselves surrounded by leagues of whispering, carnivorous shadows, kept at bay only by the city's dwindling sources of light. Anthony Jaswinski's script drops tantalizing references to religious prophecies, human-made catastrophes, and real-life phenomena (including the still unexplained 16th-century disappearance of the entire Roanoke Colony), but never really seems to fix on the specifics of its particular spooky situation, leaving the audience to fill in an increasing number of blanks. That the film ultimately works as well as it does is due to director Brad Anderson, a filmmaker whose previous work (including\", 'The Machinist', 'and the wonderfully upsetting', 'Session 9', \") has displayed a firm grasp of place. Here, he outdoes himself, creating a barren, unstable metropolis with barely glimpsed slitherings in virtually every corner. If the narrative lived up to its surroundings, this could have been a small classic of the genre. As it stands, it's a case of the frame overshadowing the contents. --\", 'Andrew Wright']\n{'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MGNO10387DVD', 'Director': 'Brad Anderson', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 31 minutes', 'Release date': 'May 17, 2011', 'Actors': 'Hayden Christensen, John Leguizamo, Thandie Newton', 'Subtitles': 'Spanish', 'Studio': 'Magnolia Home Ent', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI just finished watching this unknown movie in my world, quite Pleased w/Vanishing on 7th St. ... Obviously, this movie has plenty of Mixed Reviews. I personally thought it was quite well done. Perhaps if bigger names had been attached; the reviews would have been less mixed.\nPerhaps if the movie had bigger names??\nLegit: Season 1\nJefferies, Jim  (Director),     O'Fallon, Peter  (Director),     Bakkedahl, Dan  (Actor),     Qualls, Dj  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['This outrageous new comedy stars Australian Jim Jefferies as an edgy, foul-mouthed stand-up comic living in Los Angeles, struggling to make his life and career more \"legit.\" But every time Jim tries to do the right thing, his good deeds turn into wildly inappropriate and utterly hilarious escapades. Joined by his neurotic best friend and roommate, Steve, and Steve\\'s wheelchair-bound brother, Billy, Jim takes comedy to a whole new level, whether it\\'s visiting a Las Vegas brothel, partying with the mentally-challenged or trying to pick up women at a gay bar.']\n{'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Bakkedahl, Dan, Jefferies, Jim, Qualls, Dj, O'Fallon, Peter\", 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Runtime': '4 hours and 46 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '24543929932', 'Director': \"Jefferies, Jim, O'Fallon, Peter\", 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 46 minutes', 'Release date': 'February 25, 2014', 'Actors': 'Bakkedahl, Dan, Qualls, Dj', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nI Love the Show. Especially the HandiCap~able actors they include in the stories. I think it's Great & Hope they keep it going... Acceptance is Great\nI Enjoy this Guy Very Much\nPlanet Earth 5-Dvd Collector's Edition Boxed Set! Discovery Channel\nRated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Disc 1: Pole to Pole, Mountains, Deep Ocean Disc 2: Deserts, Ice Worlds, Shallow Seas Disc 3: Great Plains, Jungles, Fresh Water Disc 4: Seasonal Forests, Caves Disc 5 (Bonus Disc): Planet Earth: The Future']\n{'Format': 'NTSC, Color, Box set, Widescreen, Full length', 'Contributor': 'Sigourney Weaver', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.4 x 5.6 x 1.3 inches; 9.6 Ounces', 'Media Format': 'NTSC, Color, Box set, Widescreen, Full length', 'Number of discs': '5'}\nI only say you would like the narration with Ms. Weaver much better. I personally couldn't understand Mr. Attenborough well at all & he seems nonstop in speaking thru every scene; (in my opinion)  How Can You Not Love This Series. The Wonders of Nature you might never have seen in your lifetime. And it is Heartbreaking at moments, since that is the Nature. Such Beauty for your mind and soul to enjoy. You'd have to be the Grinch, not to Love It.\nYou want Sigourney Weaver unless you can easily understand Mr. Attenborough\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Sackheim', 'Adam Arkin', 'David Boreanaz', 'Alex Chapple', 'Milan Cheylov', 'James Hayman', 'Kevin Hooks', 'Dwight H. Little', 'Seith Mann', 'Vahan Moosekian'], 'Studio': ['FOX']}\nI was So Pleased to discover this show on Netflix.. I believed it was Well Written & the Cast quite Enjoyable to Watch Interact as their Characters. It's Too Bad about the cancellation since last episode's leave you hanging Like most shows do now-a-days; I do believe the story did not end w/the 13th episode. And the death of  Michael Clarke Duncan is so Tragic..  I don't believe they could have found his replacement but perhaps they could have made his death part of the show??? But I am not the person who decides what shows continue & which 1's get axed. Regardless, I have to scratch my head @ their choices.... I DO LOVE THIS SHOW!!!\nCome Back to Us!!!  MORE OF \"THE FINDER\" PLEASE!!!!\nThe 100: Season 1\nEliza Taylor  (Actor),     Paige Turco  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['The 100: The Complete First Season (DVD)', 'It’s been nearly 100 years since Earth was devastated by a nuclear apocalypse, with the only survivors being the 400 inhabitants of 12 international space stations that were in orbit at the time. Three generations later, the survivors number 4,000 — and resources are running out on their dying “Ark” (the 12 stations now linked together and repurposed to keep the survivors alive). Draconian measures including capital punishment and population control are the order of the day, as the leaders of the Ark take ruthless steps to ensure their future — including secretly exiling a group of 100 juvenile prisoners to the Earth’s surface to test whether it’s habitable. No one has set foot on the planet in nearly a century — until now. For the 100 on Earth, the alien planet they’ve never known is a mysterious realm that can be magical one moment and lethal the next.', ']]>']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, NTSC, Subtitled', 'Contributor': 'Elizabeth Craft, Eliza Taylor, Jason Rothenberg, Thomas McDonell, Paige Turco', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 4.8 Ounces', 'Item model number': '883929424382', 'Media Format': 'Multiple Formats, NTSC, Subtitled', 'Run time': '9 hours and 32 minutes', 'Release date': 'September 23, 2014', 'Actors': 'Eliza Taylor, Paige Turco, Thomas McDonell', 'Subtitles': 'Spanish, French', 'Producers': 'Jason Rothenberg, Elizabeth Craft', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nI'm a 50+ woman who really enjoyed watching the 1st season. The young cast are fortunately are great actors & pretty believable for me.  The story-lines I thought were solid and surprisingly entertaining. Hope 2nd season doesn't let me down..\nI'm a 50+ woman who really enjoyed watching the 1st season\nDamnation Alley\nJan-Michael Vincent  (Actor),     George Peppard  (Actor),     Jack Smight  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', 'After a horrific nuclear assault, three soldiers band together in a special all-terrain land cruiser and head for Albany, NY-the only American city to be spared in the attack. As they travel through the post-nuke wastelands, they pick up a beautiful woman and an incorrigible teenager (Jackie Earle Haley) while battling mutant insects, packs of violent survivors and brutal electrical storms that savage the already barren plains.', 'Amazon.com', \"A low-wattage cult hit among post-apocalypse movie fans, Jack Smight's\", 'Damnation Alley', \"arrives on DVD in a deluxe presentation that underscores its troubled production, as well as its modest charms. Based very loosely on the 1967 novel of the same name by Roger Zelazny (who loathed the movie version), the film stars George Peppard and Jan-Michael Vincent as Air Force officers crisscrossing the ruins of America in massive armored personnel carriers (the 10-ton Landmaster, originally designed to lug trucks, and the film's most enduring image) in search of survivors. Their journey brings them in contact with shotgun-toting killers and giant, flesh-eating cockroaches, plus Jackie Earle Haley and Dominique Sanda as the final pieces in their new model of a nuclear family. Plagued by special-effects issues and reedits,\", 'Damnation Alley', \"arrived with a thud in the wake of 20th Century Fox's other science-fiction release,\", 'Star Wars', ', which the studio initially regarded as', 'Damnation', \"'s second-string support. The film developed a modest following in the ensuing decades among late-night TV habitués, who can finally retire their gray market dupes of the 1985 VHS release, thanks to Shout Factory's DVD release. The disc offers a new anamorphic widescreen presentation (minus the Sound 360 process, which was too damaged to preserve, but with three newer audio options), as well as commentary by veteran producer Paul Maslansky and a trio of interesting making-of documentaries, the most interesting of which features an interview with co-screenwriter Alan Sharp (\", \"Ulzana's Raid\", ',', 'Night Moves', \"), whose assessment of his work isn't too far from Zelazny's reaction. Meanwhile, a look at the Landmaster with designer Dean Jeffries should satisfy fans of that unique vehicle.\", '--Paul Gaita']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '12623', 'Director': 'Jack Smight', 'Media Format': 'Multiple Formats, Dolby, Widescreen, Color, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 12, 2011', 'Actors': 'Jan-Michael Vincent, George Peppard, Jackie Earle Haley, Paul Winfield', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis came out in the 70's and I believe it was a Great Flick for the Time. It's still a Fun Watch. It probably comes across as bad Sci/Fi meets the world's end... It's not horrible, just cheesy by some peoples opinion's in this day or age of CGI. I Did Read the Book & believe me.. The movie is better (:\nSo Glad it's on DVD now.. Definitely Buying a Copy.",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: The Piglet Files: A Question of Intelligence\nReview Date: 2008/06/16\nStore: Louise Catt  (Actor),     Nicholas Lyndhurst  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Don\\'t be fooled by the title: this arch British comedy series has nothing to do with Pooh Bear\\'s porcine pal. Instead, it concerns the misadventures of Peter Chapman, a college professor whose life takes surprising turns after he and his wife encounter two bungling spies. He loses his job in academia only to find himself thrust into the shadowy world of espionage, where he assumes the unlikely code name of \"Piglet.\" About 3 hours on 3 DVDs.']\nAverage Rating: 4.4\nProduct Details: {'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'Color, NTSC, DVD', 'Run time': '2 hours and 51 minutes', 'Release date': 'April 29, 2003', 'Actors': 'Louise Catt, Nicholas Lyndhurst, Serena Evans, Clive Francis, John Ringham', 'Studio': 'Bfs Entertainment', 'Number of discs': '2'}\nReview Text: I found this by accident in my library and really enjoyed it! If you like spy-parody comedies, this is worth you're while.\nReview Title: This is a Great Series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Burn Notice: Season 1\nReview Date: 2008/10/06\nStore: Jeffrey Donovan  (Actor),     Sharon Gless  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'Covert intelligence operative Michael Westen has been punched, kicked, choked and shot. Now he\\'s being burned, and someone\\'s going to pay! When Michael receives a \"burn notice,\" blacklisting him from the intelligence community and compromising his very identity, he must track down a faceless nemesis without getting himself killed in the process. Meanwhile, Michael is forced to double as a private investigator on the dangerous streets of Miami in order to survive.', 'Amazon.com', 'Burn Notice', 'is a canny, clever comedy-thriller show about a covert operative with a heart of gold. Michael Westen (Jeffrey Donovan) is in the middle of a top-secret mission when he discovers he\\'s been \"burned\"--basically, fired without warning. After barely extricating himself from danger, he wakes up in Miami, where the government has abandoned him and locked him out of his own bank account. To make ends meet, he takes on private detective jobs (helping an old lady who\\'s fallen victim to a con artist; rescuing a young girl who\\'s being tricked into white slavery; helping a mother whose son has been kidnapped by the boy\\'s father... only it turns out the father is the rightful parent and the \"mom\" is an assassin sent to kill him--a nice guest star appearance by Lucy Lawless,', 'Xena: Warrior Princess', '), while trying to figure out who burned him and why. Westen tries to remain clinical in his approach to these problems, but he always ends up protecting the helpless with his sophisticated spy skills. Over the course of the first season, he gradually uncovers a mysterious conspiracy that plans to use his talents for their own nefarious ends.', 'Burn Notice', 'deftly mixes the old and the new. The old: Our hero has a hot ex-girlfriend (Gabrielle Anwar,', 'Scent of a Woman', '), a goofy sidekick (cult hero Bruce Campbell of the Evil Dead movies), and a meddling mom (Sharon Gless,', 'Cagney & Lacey', ') who help and hinder him in his investigations, as well as a', 'MacGyver', '-esque skill for making deadly devices out of common household products. The new: A media-savvy way of deconstructing the tricks and techniques of spies and government agencies, often resulting in smart and highly entertaining plot twists. Donovan, handsome but cheeky, combines a light comic touch with a convincing secret agent cool, and the supporting cast fill their niches with aplomb. Their escapades are pretty breezy and occasionally skirt being glib, but most of the time the show finds an extremely entertaining balance between action, romance, and humor. The extras are few (some montages of characteristic moments from the series, including one of the many bikini-clad girls the Miami locale provides) and the commentaries, rather than covering entire episodes, just discuss a few select scenes from each show. Fortunately, the series itself holds up; imagine a cross between', 'Magnum, P.I.', 'and', 'The Wild Wild West', \"(the classic series, not the insulting Will Smith movie) and you're on the right track. --\", 'Bret Fetzer', 'Stills from', 'Burn Notice', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure/Television', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Contributor': 'Sharon Gless, Bruce Campbell, Gabrielle Anwar, Jeffrey Donovan', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Surround), Spanish (Dolby Surround)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 7.8 Ounces', 'Item model number': '19840984922', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Run time': '8 hours and 55 minutes', 'Release date': 'June 17, 2008', 'Actors': 'Jeffrey Donovan, Sharon Gless, Bruce Campbell, Gabrielle Anwar', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nReview Text: I only began watching Burn Notice because Bruce Campbell was in the mix... I've always been a fan of his... Fortunately, the other stars of the show are just as entertaining and the stories aren't half bad either.\nReview Title: It's an Enjoyable Show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Night of the Comet [DVD]\nReview Date: 2009/08/01\nStore: Catherine Mary Stewart  (Actor),     Kelli Maroney  (Actor),     Thom Eberhardt  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: ['Product description', 'No Description Available.', 'Genre:', 'Feature Film-Comedy', 'Rating:', 'PG13', 'Release Date:', '6-MAR-2007', 'Media Type:', 'DVD', 'Amazon.com', \"A sleeper at the time of its release in 1984, Thom Eberhardt's\", 'Night of the Comet', \"has built a small cadre of fans thanks to its breezy performances and blend of comedy and tongue-in-cheek science fiction. Catherine Mary Stewart and Kelli Maroney are thoroughly likable as a pair of San Fernando Valley sisters who find themselves completely alone after the arrival of Halley's Comet reduces their affluent community--and most of Los Angeles--to dust. Their subsequent nonstop shopping spree is soon interrupted by predatory zombies, as well as a sinister scientific cabal (led by cult favorites Mary Woronov and Geoffrey Lewis) with designs on the girls. Stewart and Maroney are terrifically game as the heroines (especially Maroney, whose flair for bubbly comedy was never given another chance on screen), and Robert (\", 'Star Trek: Voyager', \") Beltran is also on hand as a fellow survivor and romantic lead. Fun for '80s enthusiasts and sci-fi fiends who don't mind a little fizz in their end-of-the-world scenarios.\", '-- Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Contributor': 'Peter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon EricsonPeter Fox, John Achorn, Geoffrey Lewis, Kelli Maroney, Ivan E. Roth, Sharon Farrell, Mary Woronov, Thom Eberhardt, Catherine Mary Stewart, Robert Beltran, Lissa Layng, Michael Bowen, Devon Ericson   See more', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.55 inches; 2.4 Ounces', 'Director': 'Thom Eberhardt', 'Media Format': 'Color, DVD, NTSC, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'March 6, 2007', 'Actors': 'Catherine Mary Stewart, Kelli Maroney, Robert Beltran, Sharon Farrell, Mary Woronov', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Thom Eberhardt', 'Number of discs': '1'}\nReview Text: It's Hokey & Badly Acted for the most part but it screams Bad Old Science Fiction Horror from the 50's and anyone that's seen those films, knows what I mean.<br />I really Enjoyed it.\nReview Title: You Gotta Luv It\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Sentinel\nReview Date: 2010/03/21\nStore: Chris Sarandon  (Actor),     Cristina Raines  (Actor),     Michael Winner  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: [\"When a beautiful model, Alison Parker (Cristina Raines), rents an apartment in a gloomy New York brownstone, little does she realize the unspeakable horrors that await her behind its mysterious doors. Based on Jeffrey Konvitz's best-selling novel, this contemporary gothic chiller features jump-out-of-your-seat special effects and an incredible assemblage of stars including Ava Gardner, Jose Ferrer, John Carradine, Burgess Meredith, Deborah Raffin, Chris Sarandon, Eli Wallach and Martin Balsam. Alison likes her eccentric new neighbors, so it comes as a shock when she's told that, except for a strange old priest, she's the only tenant. Director Michael Winner comes up with something to terrify everyone in this spine-tingling exercise in supernatural suspense.\", 'Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Anamorphic, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Walken, Eli Wallach, Michael Winner, Martin Balsam, Arthur Kennedy, Ava Gardner, Chris Sarandon, John Carradine, Jose Ferrer, Cristina Raines, Burgess Meredith, Jeffrey Konvitz, Deborah Raffin, Sylvia MilesChristopher Walken, Eli Wallach, Michael Winner, Martin Balsam, Arthur Kennedy, Ava Gardner, Chris Sarandon, John Carradine, Jose Ferrer, Cristina Raines, Burgess Meredith, Jeffrey Konvitz, Deborah Raffin, Sylvia Miles  See more', 'Initial release date': '2009-08-30', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.44 x 5.35 x 0.67 inches; 2.26 Ounces', 'Item model number': '2219754', 'Director': 'Michael Winner', 'Media Format': 'Multiple Formats, Anamorphic, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Chris Sarandon, Cristina Raines, Martin Balsam, John Carradine, Jose Ferrer', 'Subtitles': 'French, Spanish', 'Producers': 'Michael Winner, Jeffrey Konvitz', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Michael Winner, Jeffrey Konvitz', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I just recently read the book. I'd never seen the movie, so it was a surprise. It's not really a Horror novel so much as perhaps a supernatural mystery.  The movie was decent and it gave the chance to see the ending horror.\nReview Title: The Book is Always Better\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Spell (1977)\nReview Date: 2010/04/23\nStore: Lee Philips  (Director),     Lee Grant  (Actor),     James Olson  (Actor)    &                   0                  more   Rated:    NR    Format: VHS Tape\nCategories: Movies & TV, Movies\nProduct Description: ['A teenage girl with incredible occult powers spends her time making life miserable for her supercilious tormentors. Made for television.']\nAverage Rating: 4.0\nProduct Details: {'Language': 'English', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Lee Philips', 'Run time': '1 hour and 26 minutes', 'Date First Available': 'September 8, 2005', 'Actors': 'Lee Grant, James Olson, Susan Myers', 'Studio': 'Worldvision Enterprises'}\nReview Text: I was around when Carrie was an original movie in the theaters & of course liked it.. This TV-version \"The Spell\" was enjoyable for me back then as well. And I recently was able to catch it on television. Me, personally, I like the movie and would watch it again but it's very difficult to see the old TV-movies from years ago..\nReview Title: Most Certainly Inspired by Uncle Stevie's 'Carrie'\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Supernatural: Season 5\nReview Date: 2011/02/10\nStore: Jared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', \"Twenty-six years ago, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force. Subsequently, their father raised them to be soldiers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America ... and he taught them how to kill it. This haunting series follows the Winchester brothers as they crisscross the lonely and mysterious back roads of the country in their '67 Chevy Impala, hunting down every evil supernatural force they encounter along the way. At the end of the fourth season, Sam unwittingly broke the final seal – that held Lucifer captive in Hell. Now, Lucifer is free, the Apocalypse is here and angels prepare for a spectacular final battle. Against a landscape of celestial violence, natural disasters and a rising human death toll, Sam and Dean, with the help of fallen angel Castiel, must find a way to achieve the impossible: Kill the Devil.\", 'Amazon.com', \"How's this for a story arc: the Gates of Hell are opened, unleashing both Lucifer himself and the Four Horsemen of the Apocalypse, and bringing to an end civilization as we know it. That's what awaits fans of\", 'Supernatural', 'in its fifth and most epic season to date. The stumbles in plot or character that are typical to most long-running series are largely missing from this season (though some might consider the stunt casting of Paris Hilton as a pagan goddess in \"Hammer of the Gods\" as such); instead, there\\'s a solid, complex, and entirely satisfying run of episodes, and even a pair of series highlights in \"Changing Channels\" and \"The Real Ghostbusters.\" The former finds heroes Sam and Dean (Jensen Ackles and Jared Padalecki) trapped in a TV-influenced netherworld populated by perverse small-screen archetypes, while the latter is a clever bit of meta-fiction involving a real ghost at a', 'Supernatural', \"fan convention, complete with Winchester brothers look-alikes. The other 20 episodes bounce between stand-alone adventures and the larger story at hand, which finds the brothers racing to collect the rings of the Four Horsemen, which will return Lucifer to his prison. This is fantasy storytelling for television at its best--broad in scope and heavy with special effects, but never forgetting that the core of the show is the relationship between Sam and Dean and their joint quest to rid the world of evil. Both are well represented here in a season that brings the show's main story line to its fitting and satisfying conclusion.\", 'Fans should also be pleased with most of the extras on the six-disc set for', 'Season 5', '. The most ambitious feature is the Apocalypse Survival Guide, hosted by Bobby Singer (Jim Beaver). Presented as a tour through Bobby\\'s house, the guide gives viewers a detailed lowdown on the major players in the war against Satan, including the Horsemen, various demons, and the Man in Red himself. Navigating one\\'s way through the interactive videos can be a challenge, as the layout requires viewers to constantly restart the disc in order to review certain videos, but for sheer informational content, it\\'s hard to beat. Also present is a commentary track by series creator Eric Kripke (who left the series at the end of this season) and writer Ben Edlund on \"The End,\" which required such elaborate sets that the show earned its own back lot; said location also gets a once-over, as does an unaired scene from \"The Real Ghostbusters.\" Best of all is perhaps the entire web series', 'Ghostfacers', ', which pokes much-needed fun at the reality show', 'Ghost Hunters', 'in addition to providing some minor scares.', '--Paul Gaita']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Horror, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Drama, Horror, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Subtitled, Widescreen, Dubbed, NTSC', 'Contributor': 'Jared Padalecki, Jensen Ackles, Misha Collins', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'False', 'MPAA rating': 'NR (Not Rated)', 'Item model number': 'Sup Season 5', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Subtitled, Widescreen, Dubbed, NTSC', 'Run time': '15 hours and 24 minutes', 'Release date': 'September 7, 2010', 'Actors': 'Jared Padalecki, Jensen Ackles, Misha Collins', 'Dubbed': 'Portuguese', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Home Video', 'Number of discs': '6'}\nReview Text: I was So Hooked on this show; not since I was a kid did I have to watch every week. It does start out fairly well IMO but the continued struggle back & forth between Dean & the Angels just seemed to prolong the agony of what needed to be done.. It just kept going back & forth & wasting time w/what they could have been doing. And bringing in the old favorite characters & doing what the writers did, really ticked me off. I think it was definitely a cheap move. Not sure if they had planned a 6th season but why just obliterate all the supporting characters.. It was Stoopid. I collected all of the 1st four seasons but have no intention of owning the 5th & don't have a clue what happened in the 6th. They really should have went out in a blaze of glory instead of jumping the shark.  I will remember \"The Boys\" fondly & Loved the 4 years of Pure Entertainment they brought... Thank You Sam & Dean\nReview Title: Season 5 was A HUGE DISAPOINTMENT\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vanishing on 7th Street\nReview Date: 2011/10/09\nStore: Hayden Christensen  (Actor),     John Leguizamo  (Actor),     Brad Anderson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', \"From director Brad Anderson (SESSION 9, TRANSSIBERIAN, THE MACHINIST) comes VANISHING ON 7TH STREET, a terrifying, apocalyptic thriller that taps into one of humankind's most primal anxieties: fear of the dark. An unexplained blackout plunges the city of Detroit into total darkness, and by the time the sun rises, only a few people remain surrounded by heaps of empty clothing, abandoned cars and lengthening shadows. A small handful of strangers that have survived the night (Hayden Christensen, Thandie Newton, John Leguizamo and newcomer Jacob Latimore) each find their way to a rundown bar, whose gasoline powered generator and stockpile of food and drink make it the last refuge in a deserted city. With daylight beginning to disappear completely and whispering shadows surrounding the survivors, they soon discover that the enemy is the darkness itself, and only the few remaining light sources can keep them safe. As time begins to run out for them, darkness closes in and they must face the ultimate terror.\", 'Amazon.com', 'Beginning with its title--a combination of promisingly enigmatic and weirdly specific--this ambitious melding of the', 'Left Behind', 'series,', 'Pitch Black', ', and any number of', 'Twilight Zone', \"episodes has creepy atmosphere to burn, but its refusal to finally turn over its cards may frustrate viewers in the mood for closure. The plot turns on an admittedly monster hook: following an unexplained mass vanishing, a handful of Detroit residents (including Hayden Christensen, Thandie Newton, and an uncharacteristically muted John Leguizamo) find themselves surrounded by leagues of whispering, carnivorous shadows, kept at bay only by the city's dwindling sources of light. Anthony Jaswinski's script drops tantalizing references to religious prophecies, human-made catastrophes, and real-life phenomena (including the still unexplained 16th-century disappearance of the entire Roanoke Colony), but never really seems to fix on the specifics of its particular spooky situation, leaving the audience to fill in an increasing number of blanks. That the film ultimately works as well as it does is due to director Brad Anderson, a filmmaker whose previous work (including\", 'The Machinist', 'and the wonderfully upsetting', 'Session 9', \") has displayed a firm grasp of place. Here, he outdoes himself, creating a barren, unstable metropolis with barely glimpsed slitherings in virtually every corner. If the narrative lived up to its surroundings, this could have been a small classic of the genre. As it stands, it's a case of the frame overshadowing the contents. --\", 'Andrew Wright']\nAverage Rating: 3.8\nProduct Details: {'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MGNO10387DVD', 'Director': 'Brad Anderson', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 31 minutes', 'Release date': 'May 17, 2011', 'Actors': 'Hayden Christensen, John Leguizamo, Thandie Newton', 'Subtitles': 'Spanish', 'Studio': 'Magnolia Home Ent', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I just finished watching this unknown movie in my world, quite Pleased w/Vanishing on 7th St. ... Obviously, this movie has plenty of Mixed Reviews. I personally thought it was quite well done. Perhaps if bigger names had been attached; the reviews would have been less mixed.\nReview Title: Perhaps if the movie had bigger names??\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Legit: Season 1\nReview Date: 2014/05/31\nStore: Jefferies, Jim  (Director),     O'Fallon, Peter  (Director),     Bakkedahl, Dan  (Actor),     Qualls, Dj  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\nProduct Description: ['This outrageous new comedy stars Australian Jim Jefferies as an edgy, foul-mouthed stand-up comic living in Los Angeles, struggling to make his life and career more \"legit.\" But every time Jim tries to do the right thing, his good deeds turn into wildly inappropriate and utterly hilarious escapades. Joined by his neurotic best friend and roommate, Steve, and Steve\\'s wheelchair-bound brother, Billy, Jim takes comedy to a whole new level, whether it\\'s visiting a Las Vegas brothel, partying with the mentally-challenged or trying to pick up women at a gay bar.']\nAverage Rating: 4.7\nProduct Details: {'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Bakkedahl, Dan, Jefferies, Jim, Qualls, Dj, O'Fallon, Peter\", 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Runtime': '4 hours and 46 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '24543929932', 'Director': \"Jefferies, Jim, O'Fallon, Peter\", 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 46 minutes', 'Release date': 'February 25, 2014', 'Actors': 'Bakkedahl, Dan, Qualls, Dj', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: I Love the Show. Especially the HandiCap~able actors they include in the stories. I think it's Great & Hope they keep it going... Acceptance is Great\nReview Title: I Enjoy this Guy Very Much\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Planet Earth 5-Dvd Collector's Edition Boxed Set! Discovery Channel\nReview Date: 2014/06/08\nStore: Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Disc 1: Pole to Pole, Mountains, Deep Ocean Disc 2: Deserts, Ice Worlds, Shallow Seas Disc 3: Great Plains, Jungles, Fresh Water Disc 4: Seasonal Forests, Caves Disc 5 (Bonus Disc): Planet Earth: The Future']\nAverage Rating: 4.5\nProduct Details: {'Format': 'NTSC, Color, Box set, Widescreen, Full length', 'Contributor': 'Sigourney Weaver', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.4 x 5.6 x 1.3 inches; 9.6 Ounces', 'Media Format': 'NTSC, Color, Box set, Widescreen, Full length', 'Number of discs': '5'}\nReview Text: I only say you would like the narration with Ms. Weaver much better. I personally couldn't understand Mr. Attenborough well at all & he seems nonstop in speaking thru every scene; (in my opinion)  How Can You Not Love This Series. The Wonders of Nature you might never have seen in your lifetime. And it is Heartbreaking at moments, since that is the Nature. Such Beauty for your mind and soul to enjoy. You'd have to be the Grinch, not to Love It.\nReview Title: You want Sigourney Weaver unless you can easily understand Mr. Attenborough\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/10/11\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Sackheim', 'Adam Arkin', 'David Boreanaz', 'Alex Chapple', 'Milan Cheylov', 'James Hayman', 'Kevin Hooks', 'Dwight H. Little', 'Seith Mann', 'Vahan Moosekian'], 'Studio': ['FOX']}\nReview Text: I was So Pleased to discover this show on Netflix.. I believed it was Well Written & the Cast quite Enjoyable to Watch Interact as their Characters. It's Too Bad about the cancellation since last episode's leave you hanging Like most shows do now-a-days; I do believe the story did not end w/the 13th episode. And the death of  Michael Clarke Duncan is so Tragic..  I don't believe they could have found his replacement but perhaps they could have made his death part of the show??? But I am not the person who decides what shows continue & which 1's get axed. Regardless, I have to scratch my head @ their choices.... I DO LOVE THIS SHOW!!!\nReview Title: Come Back to Us!!!  MORE OF \"THE FINDER\" PLEASE!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The 100: Season 1\nReview Date: 2014/11/06\nStore: Eliza Taylor  (Actor),     Paige Turco  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['The 100: The Complete First Season (DVD)', 'It’s been nearly 100 years since Earth was devastated by a nuclear apocalypse, with the only survivors being the 400 inhabitants of 12 international space stations that were in orbit at the time. Three generations later, the survivors number 4,000 — and resources are running out on their dying “Ark” (the 12 stations now linked together and repurposed to keep the survivors alive). Draconian measures including capital punishment and population control are the order of the day, as the leaders of the Ark take ruthless steps to ensure their future — including secretly exiling a group of 100 juvenile prisoners to the Earth’s surface to test whether it’s habitable. No one has set foot on the planet in nearly a century — until now. For the 100 on Earth, the alien planet they’ve never known is a mysterious realm that can be magical one moment and lethal the next.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, NTSC, Subtitled', 'Contributor': 'Elizabeth Craft, Eliza Taylor, Jason Rothenberg, Thomas McDonell, Paige Turco', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 4.8 Ounces', 'Item model number': '883929424382', 'Media Format': 'Multiple Formats, NTSC, Subtitled', 'Run time': '9 hours and 32 minutes', 'Release date': 'September 23, 2014', 'Actors': 'Eliza Taylor, Paige Turco, Thomas McDonell', 'Subtitles': 'Spanish, French', 'Producers': 'Jason Rothenberg, Elizabeth Craft', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nReview Text: I'm a 50+ woman who really enjoyed watching the 1st season. The young cast are fortunately are great actors & pretty believable for me.  The story-lines I thought were solid and surprisingly entertaining. Hope 2nd season doesn't let me down..\nReview Title: I'm a 50+ woman who really enjoyed watching the 1st season\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Damnation Alley\nReview Date: 2015/01/02\nStore: Jan-Michael Vincent  (Actor),     George Peppard  (Actor),     Jack Smight  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', 'After a horrific nuclear assault, three soldiers band together in a special all-terrain land cruiser and head for Albany, NY-the only American city to be spared in the attack. As they travel through the post-nuke wastelands, they pick up a beautiful woman and an incorrigible teenager (Jackie Earle Haley) while battling mutant insects, packs of violent survivors and brutal electrical storms that savage the already barren plains.', 'Amazon.com', \"A low-wattage cult hit among post-apocalypse movie fans, Jack Smight's\", 'Damnation Alley', \"arrives on DVD in a deluxe presentation that underscores its troubled production, as well as its modest charms. Based very loosely on the 1967 novel of the same name by Roger Zelazny (who loathed the movie version), the film stars George Peppard and Jan-Michael Vincent as Air Force officers crisscrossing the ruins of America in massive armored personnel carriers (the 10-ton Landmaster, originally designed to lug trucks, and the film's most enduring image) in search of survivors. Their journey brings them in contact with shotgun-toting killers and giant, flesh-eating cockroaches, plus Jackie Earle Haley and Dominique Sanda as the final pieces in their new model of a nuclear family. Plagued by special-effects issues and reedits,\", 'Damnation Alley', \"arrived with a thud in the wake of 20th Century Fox's other science-fiction release,\", 'Star Wars', ', which the studio initially regarded as', 'Damnation', \"'s second-string support. The film developed a modest following in the ensuing decades among late-night TV habitués, who can finally retire their gray market dupes of the 1985 VHS release, thanks to Shout Factory's DVD release. The disc offers a new anamorphic widescreen presentation (minus the Sound 360 process, which was too damaged to preserve, but with three newer audio options), as well as commentary by veteran producer Paul Maslansky and a trio of interesting making-of documentaries, the most interesting of which features an interview with co-screenwriter Alan Sharp (\", \"Ulzana's Raid\", ',', 'Night Moves', \"), whose assessment of his work isn't too far from Zelazny's reaction. Meanwhile, a look at the Landmaster with designer Dean Jeffries should satisfy fans of that unique vehicle.\", '--Paul Gaita']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '12623', 'Director': 'Jack Smight', 'Media Format': 'Multiple Formats, Dolby, Widescreen, Color, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 12, 2011', 'Actors': 'Jan-Michael Vincent, George Peppard, Jackie Earle Haley, Paul Winfield', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This came out in the 70's and I believe it was a Great Flick for the Time. It's still a Fun Watch. It probably comes across as bad Sci/Fi meets the world's end... It's not horrible, just cheesy by some peoples opinion's in this day or age of CGI. I Did Read the Book & believe me.. The movie is better (:\nReview Title: So Glad it's on DVD now.. Definitely Buying a Copy.\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has expressed a keen enjoyment for various movies and television shows, emphasizing the charm of specific genres like spy-parody comedies and action-packed series. Positive sentiments highlight a love for the humor and engaging plots, as well as the quality of performances by recognizable actors. They appreciated the clever storytelling, character development, and entertaining escapades within these productions. The user also found nostalgic enjoyment in classic science fiction films and acclaimed documentaries, particularly appreciating their beautiful portrayals of nature.\n\nNEGATIVE SUMMARY:\nDespite the overall positive experiences, the user encountered several disappointing elements as well. They specifically criticized a season of a favored series for its narrative pacing and character treatment, feeling that it failed to meet the high standards set by earlier seasons. A few movies were viewed as hokey or poorly executed, with critiques directed at uneven performances and unsatisfactory conclusions. The user sometimes expressed frustration over the neglect of supporting characters or abrupt cancellations, indicating a desire for more thoughtful storytelling.\n\nOVERALL SUMMARY:\nThe user’s purchase history showcases a diverse taste in movies and television, gravitating towards action, comedy, and classic sci-fi. While they have enjoyed many experiences, particularly appreciating humor, narrative creativity, and performances, there have been notable disappointments with certain series and films. Critiques primarily arise from uneven storytelling, poor character arcs, and feelings of nostalgia not being honored. Overall, the user maintains a strong enthusiasm for entertainment, albeit with discernment regarding quality and emotional connection to the content.",
  "target_interaction": {
    "rating": 5.0,
    "title": "there are cool little robots",
    "text": "It's an ecology movie from the Old Skool b4 the eighties arrived and changed where we were heading... Plus, there are cool little robots.",
    "images": [],
    "asin": "B000063UR1",
    "parent_asin": "B000063UR1",
    "user_id": "AE2SXNCVU3ZPHIYP2LAPXMM5PDXA",
    "timestamp": "2015-01-03 19:27:55",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Silent Running",
    "average_rating": 4.5,
    "rating_number": 3350,
    "features": [],
    "description": [
      "As this science fiction classic opens, botanist Freeman Lowell (Bruce Dern) has spent eight years aboard the space freighter \"Valley Forge\" preserving the only botanical specimens left from Earth under huge geodesic domes. When he receives orders to destroy the project and return home, Lowell rebels and hijacks the freighter, while plunging the craft into the gaseous Rings of Saturn. From that moment on, he has only the trees, the gardens and two \"Drone\" robots, Huey and Dewey, to keep him company on his greatest adventure of all.Bonus Content:",
      "The Making of Silent Running",
      "The Making of Silent Running",
      "Feature Commentary with Director Director Douglas Trumbull and Cast Member Bruce Dern",
      "Feature Commentary with Director Director Douglas Trumbull and Cast Member Bruce Dern",
      "Silent Running by Douglas Trumbull",
      "Silent Running by Douglas Trumbull",
      "A Conversation With Bruce Dern",
      "A Conversation With Bruce Dern",
      "Douglas Trumbull: Then and Now",
      "Douglas Trumbull: Then and Now",
      "Theatrical Trailer",
      "Theatrical Trailer",
      "Production Notes",
      "Production Notes",
      "Cast and Filmmakers",
      "Cast and Filmmakers"
    ],
    "price": 9.29,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/61+pSO06nUL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61+pSO06nUL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Bruce Dern  (Actor),     Cliff Potts  (Actor),     Douglas Trumbull  (Director)    &                   0                  more   Rated:    G    Format: DVD",
    "categories": [
      "Movies & TV",
      "Science Fiction & Fantasy",
      "Science Fiction",
      "Futuristic"
    ],
    "details": {
      "Genre": "Drama, Fantasy, Science Fiction",
      "Format": "Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen",
      "Contributor": "Ron Rifkin, Bruce Dern, Douglas Trumbull, Steven Bochco, Deric Washburn, Michael Cimino, Cliff Potts, Jesse Vint, Michael GruskoffRon Rifkin, Bruce Dern, Douglas Trumbull, Steven Bochco, Deric Washburn, Michael Cimino, Cliff Potts, Jesse Vint, Michael Gruskoff  See more",
      "Initial release date": "2002-05-21",
      "Language": "English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1), Spanish (Dolby Digital 2.0 Mono)",
      "Aspect Ratio": "1.85:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "G (General Audience)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.4 Ounces",
      "Item model number": "2219807",
      "Director": "Douglas Trumbull",
      "Media Format": "Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen",
      "Run time": "1 hour and 30 minutes",
      "Release date": "May 21, 2002",
      "Actors": "Bruce Dern, Cliff Potts, Ron Rifkin, Jesse Vint",
      "Dubbed": "Spanish",
      "Producers": "Michael Gruskoff",
      "Studio": "Studio Distribution Services",
      "Writers": "Deric Washburn, Michael Cimino, Steven Bochco",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}