{
  "user_id": "AHBHQ7IK4QHRYI3OHC7PLSQLXPOQ",
  "summary": "=== Purchase Information ===\nProduct Title: Charlotte Rampling: The Look\nReview Date: 2017/05/27\nStore: Charlotte Rampling  (Actor),     Angelina Maccarone  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['A biographical study of legendary actress Charlotte Rampling (Babylon A.D., Swimming Pool), told through her own conversations with artist friends and collaborators, including Peter Lindbergh, Paul Auster, and Juergen Teller. Intercut with footage from some of Rampling\\'s most famous films, this \"self-portrait through others\" is a revealing look at one of our most iconic screen stars.']\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Documentary/Biography, Special Interests', 'Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Contributor': 'Charlotte Rampling, Angelina Maccarone', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '25093537', 'Director': 'Angelina Maccarone', 'Media Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2012', 'Actors': 'Charlotte Rampling', 'Studio': 'Kino Lorber', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Absolutely amazing film. If you are a fan of Charlotte Rampling, you'll love it, of course. But what she has to say has significance far beyond her own life. A must-see.\nReview Title: Absolutely amazing film. If you are a fan of Charlotte ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Statement\nReview Date: 2017/06/09\nStore: Michael Caine  (Actor),     Tilda Swinton  (Actor),     Norman Jewison  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Veteran actor and two-time Oscar(r) winner Michael Caine stars with Tilda Swinton and Jeremy Northam in THE STATEMENT, a shocking and provoking thriller that delves into a fascinating chapter in modernevents! An ambitious Judge (Swinton) and an exacting Colonel (Jeremy Northam) re-open the sixty-year-old case of Pierre Brossard (Michael Caine), an escaped Nazi collaborator accused of murdering seven Jews. Now an old man living a sheltered life within the Catholic Church, Brossard is also being trailed by mysterious hit men, determined to kill him before he's arrested. When the Church shuts outBrossard to protect their dirty secret, it's a race against time, the government, and the hit men to discover whether justice will prevail or revenge will be served!\"]\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Thriller', 'Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, WidescreenMultiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen   See more', 'Contributor': 'John Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy NorthamJohn Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy Northam   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.32 Ounces', 'Item model number': '2225824', 'Director': 'Norman Jewison', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'April 27, 2004', 'Actors': 'Michael Caine, Tilda Swinton, Jeremy Northam, Alan Bates, John Neville', 'Subtitles': 'English', 'Producers': 'Robert Lantos, Norman Jewison', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Thoroughly enjoyed this chase thriller. Good story, complex characters, good acting. The fact that Michael Caine's character wasn't entirely despicabledisturbed many viewers when the film was released, so it wasn't a hit at the box office and received some poor reviews. They should take another look now.\nReview Title: Thoroughly enjoyed this chase thriller\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 45 Years\nReview Date: 2017/06/09\nStore: Charlotte Rampling  (Actor),     Tom Courtenay  (Actor),     Andrew Haigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['Award-winning actors Charlotte Rampling (Swimming Pool) and Tom Courtenay (Doctor Zhviago) give career-defining performances in 45 Years. As Kate and Geoff prepare to celebrate their 45th wedding anniversary, their marriage is shaken when unexpected news threatens to change their lives. The body of his first love has been discovered, frozen and preserved in the icy glaciers of the Swiss Alps. By the time the party is upon them, five days later, there may not be a marriage left to celebrate.']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Charlotte Rampling, Andrew Haigh, Tom Courtenay, Geraldine James', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35375576', 'Director': 'Andrew Haigh', 'Media Format': 'NTSC', 'Release date': 'June 14, 2016', 'Actors': 'Charlotte Rampling, Tom Courtenay, Geraldine James', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: An exceptional film. If you cannot appreciate the small movements and the subtleties of changes in facial expressions, you will fail to see what an amazing film this is. Charlotte Rampling at her very best...so far.\nReview Title: you will fail to see what an amazing film this is\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Lives of Others\nReview Date: 2017/06/09\nStore: Martina Gedeck  (Actor),     Ulrich Mühe  (Actor),     Florian Henckel von Donnersmarck  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Drama\nProduct Description: ['Product Description', 'This critically-acclaimed, Oscar®-winning film (Best Foreign Language Film, 2006) is the erotic, emotionally-charged experience Lisa Schwarzbaum (Entertainment Weekly) calls \"a nail-biter of a thriller!\" Before the collapse of the Berlin Wall, East Germany\\x92s population was closely monitored by the State Secret Police (Stasi). Only a few citizens above suspicion, like renowned pro-Socialist playwright Georg Dreyman, were permitted to lead private lives. But when a corrupt government official falls for Georg\\x92s stunning actress-girlfriend, Christa, an ambitious Stasi policeman is ordered to bug the writer\\x92s apartment to gain incriminating evidence against the rival. Now, what the officer discovers is about to dramatically change their lives - as well as his - in this seductive political thriller Peter Travers (Rolling Stone) proclaims is \"the best kind of movie: one you can\\x92t get out of your head.\"', 'Amazon.com', \"Nominated for a Best Foreign Language Film Oscar, this is a first-rate thriller that, like Bertolucci's\", 'The Conformist', \"and Coppola's\", 'The Conversation', ', opts for character development over car chases. The place is East Berlin, the year is 1984, and it all begins with a simple surveillance assignment: Capt. Gerd Wiesler (Ulrich Mühe in a restrained, yet deeply felt performance), a Stasi officer and a specialist in this kind of thing, has been assigned to keep an eye on Georg Dreyman (Sebastian Koch,', 'Black Book', '), a respected playwright, and his actress girlfriend, Christa-Maria Sieland (Martina Gedeck,', 'Mostly Martha', \"). Though Dreyman is known to associate with the occasional dissident, like blacklisted director Albert Jerska (Volkmar Kleinert), his record is spotless. Everything changes when Wiesler discovers that Minister Hempf (Thomas Thieme) has an ulterior motive in spying on this seemingly upright citizen. In other words, it's personal, and Wiesler's sympathies shift from the government to its people--or at least to this one particular person. That would be risky enough, but then Wiesler uses his privileged position to affect a change in Dreyman's life. The God-like move he makes may be minor and untraceable, but it will have major consequences for all concerned, including Wiesler himself. Writer/director Florian Henckel von Donnersmarck starts with a simple premise that becomes more complicated and emotionally involving as his assured debut unfolds. Though three epilogues is, arguably, two too many,\", 'The Lives of Others', \"is always elegant, never confusing. It's class with feeling. --\", 'Kathleen C. Fennessy', 'Beyond', 'The Lives of Others', 'Films from Germany', 'Other Cold War Films', 'More Arthouse Selections from Sony Pictures Classics', 'Stills from', 'The Lives of Others', '(click for larger image)']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'AC-3, Color, Dolby, Widescreen, Subtitled, NTSC', 'Contributor': 'Ulrich Tukur, Thomas Thieme, Hans-Uwe Bauer, Ulrich Mühe, Sebastian Koch, Florian Henckel von Donnersmarck, Charly Hübner, Volkmar Kleinert, Matthias Brenner, Herbert Knaup, Martina GedeckUlrich Tukur, Thomas Thieme, Hans-Uwe Bauer, Ulrich Mühe, Sebastian Koch, Florian Henckel von Donnersmarck, Charly Hübner, Volkmar Kleinert, Matthias Brenner, Herbert Knaup, Martina Gedeck  See more', 'Language': 'German (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 18 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Florian Henckel von Donnersmarck', 'Media Format': 'AC-3, Color, Dolby, Widescreen, Subtitled, NTSC', 'Run time': '2 hours and 18 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Martina Gedeck, Ulrich Mühe, Sebastian Koch, Ulrich Tukur, Thomas Thieme', 'Subtitles': 'English, Spanish, French', 'Studio': 'Sony Pictures', 'Number of discs': '1'}\nReview Text: A film that can change your life. In German, with excellent English subtitles. Every prop historically accurate. Even the color scheme and lighting contribute. Contrary to how it's billed in the popular press, this is not a sensual romance. It's about...redemption. See it!\nReview Title: with excellent English subtitles\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Doctor Strange\nReview Date: 2017/06/09\nStore: Benedict Cumberbatch  (Actor),     Chiwetel Ejiofor  (Actor),     Scott Derrickson  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['From Marvel Studios comes DOCTOR STRANGE, the story of world-famous neurosurgeon Dr. Stephen Strange (Benedict Cumberbatch), whose life changes forever after a horrific car accident renders his hands useless. When traditional medicine fails him, he travels to remote Kamar-Taj in search of a cure, but instead discovers the mystical arts and becomes a powerful sorcerer battling dark forces bent on destroying our reality.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936852240', 'Director': 'Scott Derrickson', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours', 'Release date': 'February 28, 2017', 'Actors': 'Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams, Benedict Wong, Michael Stuhlbarg', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'MARVEL', 'Writers': 'Jon Spaihts, Scott Derrickson, C. Robert Cargill', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Thoroughly enjoyed. Great special effects. Cumberbatch was very good as the Doctor, and Swinton was perfect as the Ancient One. Be sure to watch all the way through the credits. When will Doctor Strange return?\nReview Title: Thoroughly enjoyed. Great special effects\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Princess and the Warrior\nReview Date: 2017/06/09\nStore: Franka Potente  (Actor),     Benno Furmann  (Actor),     Tom Tykwer  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['From the director (Tom Tykwer) and star (Franka Potente) of the internationally acclaimed, fast-paced smash hit, Run Lola Run, comes a startling fresh and compelling romantic drama that will leave you breathless. When shy, beautiful nurse Sissi is the victim of a horrible car accident, a handsome small-time criminal miraculously saves her life. When she recovers, Sissi sets out to find him and discovers a violent man with a conflicted past and dangerous future. Soon, the two meet again in the middle of a deadly bank robbery, and Sissi realizes her fate is pre-destined. Or is it?']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': '043396063907', 'Director': 'Tom Tykwer', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 1, 2002', 'Actors': 'Franka Potente, Benno Furmann', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Stefan Arndt', 'Language': 'German (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: When I first saw this movie a number of years ago, I missed the beginning. I recommend you skip the first 5 minutes or so, start watching with the auto accident. Then go back and watch the entire movie. Your perception of what's going on will be very different. Either way, it's a disturbing story, well-acted and well-written. In German with good subtitles.\nReview Title: I recommend you skip the first 5 minutes or so\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Sense of an Ending [DVD]\nReview Date: 2017/06/21\nStore: Michelle Dockery  (Actor),     Emily Mortimer  (Actor),     Ritesh Batra  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Suspense', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Charlotte Rampling, Ritesh Batra, BBC Films; CBS Films; FilmNation Entertainment; Origin Pictures, David Thompson, Ed Rubin, Jim Broadbent, Harriet Walter, Michelle Dockery, Emily MortimerCharlotte Rampling, Ritesh Batra, BBC Films; CBS Films; FilmNation Entertainment; Origin Pictures, David Thompson, Ed Rubin, Jim Broadbent, Harriet Walter, Michelle Dockery, Emily Mortimer   See more', 'Language': 'English', 'Runtime': '1 hour and 48 minutes'}\nReview Text: Well written and well acted.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Seasons in Quincy\nReview Date: 2017/06/21\nStore: Tilda Swinton  (Actor, Director),     John Berger  (Actor),     Bartek Dziadosz  (Director),     Colin MacCabe  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Independently Distributed, Documentary\nProduct Description: ['Product Description', 'Prolific artist, philosopher, writer, storyteller and \"radical humanist\" John Berger is the focus of tjos vovod fpir-part cinematic portrait. In 1973 he moved from urban London to the tiny Alpine villate of Quincy. THE SEASON IN QUINCY: FOUR PORTRAITS OF JOHN BERGER examines different aspects of Berger\\'s life in this remote village in the Alps. In four seasonal chapters, the film combines ideas and motifs from his work with the texture and history of his mountain home.', 'Review', 'An impressively high-minded documentary about writer John Berger ... As a collection, THE SEASONS OF QUINCY is an absolutely inspired way of approaching its subject. --The GuardianIntimate and revealing: a portrait of its subject in which we get closer to him as a personality than a more conventional film could ever take us. --The Independent']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Special Interests', 'Format': 'NTSC, Widescreen', 'Contributor': 'Christopher Roth, Bartek Dziadosz, John Berger, Tilda Swinton, Colin MacCabe', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Bartek Dziadosz, Colin MacCabe, Christopher Roth, Tilda Swinton', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'December 6, 2016', 'Actors': 'Tilda Swinton, John Berger', 'Studio': 'Icarus Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Outstanding!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Invisible Frame / Cycling the Frame\nReview Date: 2017/07/28\nStore: Tilda Swinton  (Actor),     Cynthia Beatt  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'In 1988 director Cynthia Beatt and the Tilda Swinton embarked on a filmic journey along the Berlin Wall to create the short film CYCLING THE FRAME. Riding her bicycle from the Brandenburg Gate to the suburbs, passying by lakes, fields, and checkpoints, Swinton retraced the concrete and oppressive structure encircling West Berlin, cutting through neighborhoods and buildings, seeming indestructible at the time. One year after filming, the Wall was opened and the process of reunification of Germany began. More than 20 years later, in 2009, Beatt and Swinton reteamed and retraced their ride, but this time weaving through both sides of the fallen wall. THE INVISIBLE FRAME depicts this poetic passage and reflects on history, memory and freedom.', 'About the Actor', 'Katherine Mathilda Swinton\\xa0(born 5 November 1960) is a British actress known for both arthouse\\xa0and\\xa0mainstream films. She has appeared in a number of films including\\xa0The Curious Case of Benjamin Button,\\xa0Burn After Reading,\\xa0The Beach,\\xa0We Need to Talk About Kevin\\xa0and was nominated for a\\xa0Golden Globe\\xa0for her performance in\\xa0The Deep End. She won the 2007\\xa0Academy Award for Best Supporting Actress\\xa0for\\xa0Michael Clayton.', 'About the Director', 'Cynthia Beatt was born in Jamaica and lived there until the age of ten. Her parents (mother American, father British) then moved to the Fiji Islands and remained there for 15 years. Like many British colonial children, Beatt was sent off to English boarding school and upon finishing, she attended Art College where she discovered the world of independent and experimental cinema. During the 70s she worked in London distributing and exhibiting experimental films before traveling for a year through the Middle East, Iran and India. Beatt moved to Berlin in 1976, where she is now based, and began curating extensive retrospectives for the Arsenal Cinema. She also collaborated with Yvonne Rainer, Joan Jonas, Ulrike Ottinger, and Tilda Swinton on diverse films. Since 1979 Beatt has directed critically acclaimed features and essay films, all presented at international film festivals, such as Study of An Island, the award-winning Fury is a Feeling Too, The Party - Nature Morte and The Invisible Frame. The landscapes, architecture and music, cultures, and social-political histories of Berlin, the Middle East and South Pacific continue to influence her work, as does the quest for formal innovation determined by subject matter. In 1985-86 Beatt returned to the South Seas and traveled through the islands to write a script that delved into the true heart of Fijian life while mirroring European myths of paradise. She is completing the feature A House in Berlin, to be released in 2012, a story of post-Wall Jewish restitution in East Berlin, which inevitably leads the main character to Palestine, to other questions of dispossession and Walls.', 'See more']\nAverage Rating: 3.9\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 4 Ounces', 'Director': 'Cynthia Beatt', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 27 minutes', 'Release date': 'November 8, 2011', 'Actors': 'Tilda Swinton', 'Studio': 'Icarus Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Two films, circling Berlin with sights you'd  never see otherwise, especially in the earlier of the two before the Wall came down. Intriguing insights.\nReview Title: Two films, circling Berlin with sights you'd never see ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: When Night Is Falling\nReview Date: 2018/03/26\nStore: Pascale Bussières  (Actor),     Rachael Crawford  (Actor),     Patricia Rozema  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product description', \"Camille and Martin are in love and teachers at a christian college; they get the opportunity to get a better job, but they would have to marry for that. But when Camille's dog dies, she recognizes that her love for Martin is not even as big as the love for her dog. After that, Camille gets to know Petra, and Petra falls in love with Camille. They meet again, but Camille is very unsure about her feelings. When Martin is away for a weekend, Camille and Petra meet in the Circus where Petra is working as an acrobat. They spend the night together, but Martin finds out about it and is shocked. He has an argument with Camille, and she goes burying her dog in the snow, and falls asleep.\", 'Amazon.com', 'Throughout Patricia Rozema\\x92s third film, conservatives tangle with liberals, men with women, and heterosexuals with those of more fluid sexual persuasions. Surface tension aside,', 'When Night Is Falling', 'feels more personal than political. Camille (Pascale Bussières) teaches mythology at a Christian college in Toronto, while her fiancé, Martin (Henry Czerny,', 'Clear and Present Danger', '), is a fellow theologian. Their superior, Reverend DeBoer (David Fox,', 'The Saddest Music in the World', '), encourages them to marry. When Camille\\x92s dog dies, she neglects to inform Martin, but instead confides in Petra (Rachael Crawford), a circus performer she meets at a laundromat. Petra leaves her card, so Camille seeks her out, but when she makes a pass, Camille flees. Later, she suggests they remain friends... until mutual attraction proves too strong to resist. A simplistic reading suggests that the death of a pet can lead to experimentation, except Rozema (', 'I\\x92ve Heard the Mermaids Singing', \") aims for a metaphorical reading rather than a literal one. Though the narrative isn't autobiographical, she too attended a Calvinist institution (the same one as writer/director Paul Schrader). It's a testament to her skill that the film feels so fresh, since the storyline echoes\", 'Lianna', '(the academic milieu) and anticipates', 'Tipping the Velvet', '(the circus angle). It\\'s also one of the more quotable same-sex love stories of the 1990s. As Martin tells Camille, \"Maybe you can imagine more intoxicating options. That\\'s okay--that\\'s what imagination\\'s for.\" To Rozema\\'s heroine, however, fulfillment is for', 'experiencing', ', not imagining.', '--Kathleen C. Fennessy']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Gay & Lesbian', 'Format': 'Multiple Formats, NTSC, Import', 'Contributor': 'Don McKellar, Rachael Crawford, Pascale Bussières, Henry Czerny, Patricia Rozema, David Fox', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '95 minutes', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Patricia Rozema', 'Media Format': 'Multiple Formats, NTSC, Import', 'Run time': '95 minutes', 'Release date': 'July 5, 2007', 'Actors': 'Pascale Bussières, Rachael Crawford, Henry Czerny, David Fox, Don McKellar', 'Subtitles': 'English, French', 'Studio': 'Ais', 'Number of discs': '1'}\nReview Text: DVD as described & well-packaged.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aberdeen\nReview Date: 2018/03/26\nStore: Stellan Skarsgård  (Actor),     Jean Anderson (II)  (Actor),     Hans Petter Moland  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', \"Kaisa (Lena Headey), a beautiful and feisty Scottish woman, finally has her life together - at least until her mother (Charlotte Rampling) asks an enormous favor: To bring back to her Kaisa's estranged, larger-than-life father (Stellan Skarsgard). The two of them, father and daughter together, set out on a wild, brutally funny yet heartbreaking journey, which takes them their emotional past before reaching their ultimate destination. Includes: Trailer; Cast/Crew Biographies; Interview with Hans Petter Moland (2001) Running time: 103 minutes.\", 'Amazon.com', 'An achingly beautiful film,', 'Aberdeen', \"has an outrageously sentimental premise: Kaisa (Lena Headey) is asked by her fatally ill mother (Charlotte Rampling) to bring her estranged father Tomas (Stellan Skarsgård,) to visit before her mother dies. Kaisa finds Tomas--a jobless drunk--at his home in Norway, and basically drags him on a road trip back to Scotland, over the course of which they're forced to grapple with their past. This could be a recipe for maudlin sap, but instead--thanks to sharp incisive writing, unexpected characters, and performances that encompass humor, brutally honest self-destructive behavior, and subtle gentleness--\", 'Aberdeen', 'is bracing, constantly surprising, and deeply engaging. The entire cast (including the always solid Ian Hart, of', 'Backbeat', 'and', 'Hollow Reed', ') is incredibly good. Highly recommended.', '--Bret Fetzer', 'Review', 'Ravishing... harsh but strangely lyrical. The near-perfect cast has talent to burn. --Village Voice', 'See more']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Drama/British Empire', 'Format': 'NTSC, Widescreen, Color, Multiple Formats, Letterboxed', 'Contributor': 'John Killoran, Gard B. Eidsvold, Fergis McLarnon, Hans Petter Moland, Jean Anderson (II), Henriette Steenstrup, Jon Erling Wevling, Kate Lynn Evans, John Harwood (II), Nina Andresen Borud, Kari Simonsen, Lena Headey, Charlotte Rampling, Richard Laing, Louise Goodall, Jan Grønli, Anders T. Andersen, Jason Hetherington, Frøydis Armand, Stellan Skarsgård, Justine MiddaJohn Killoran, Gard B. Eidsvold, Fergis McLarnon, Hans Petter Moland, Jean Anderson (II), Henriette Steenstrup, Jon Erling Wevling, Kate Lynn Evans, John Harwood (II), Nina Andresen Borud, Kari Simonsen, Lena Headey, Charlotte Rampling, Richard Laing, Louise Goodall, Jan…   See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'FIRF910095DVD', 'Director': 'Hans Petter Moland', 'Media Format': 'NTSC, Widescreen, Color, Multiple Formats, Letterboxed', 'Run time': '1 hour and 43 minutes', 'Release date': 'April 23, 2002', 'Actors': 'Stellan Skarsgård, Jean Anderson (II), Lena Headey, Charlotte Rampling, Louise Goodall', 'Studio': 'First Run Features', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Quite a good film.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Desert Hearts (The Criterion Collection) [DVD]\nReview Date: 2018/06/02\nStore: Patricia Charbonneau  (Actor),     Helen Shaver  (Actor),     Donna Deitch  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"Donna Deitch's swooning and sensual first narrative feature, 'Desert Hearts', was groundbreaking upon its 1985 release: a love story about two women, made entirely independently, on a self-financed shoestring budget, by a woman. In the 1959-set film, an adaptation of a beloved novel by Jane Rule, straitlaced East Coast professor Vivian Bell (Helen Shaver) arrives in Reno to file for divorce but winds up catching the eye of someone new, the younger free spirit Cay (Patricia Charbonneau), touching off a slow seduction that unfolds against a breathtaking desert landscape. With undeniable chemistry between its two leads, an evocative jukebox soundtrack, and vivid cinematography by Robert Elswit, Desert Hearts beautifully exudes a sense of tender yearning and emotional candor.DIRECTOR-APPROVED DVD SPECIAL EDITION FEATURES- New, restored 4K digital transfer, supervised by cinematographer Robert Elswit- Audio commentary from 2007 featuring director Donna Deitch- New conversation between Deitch and actor Jane Lynch - New conversation between Deitch, Elswit, and production designer Jeannine Oppewall about the film s visual style - New interviews with actors Helen Shaver and Patricia Charbonneau - Excerpt from Fiction and Other Truths: A Film About Jane Rule, a 1995 documentary about the author of Desert of the Heart, the 1964 novel on which the film is based - Trailer- PLUS: An essay by critic B. Ruby Rich\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Gay & Lesbian, Drama', 'Format': 'Subtitled, Widescreen, NTSC', 'Contributor': 'Helen Shaver, Patricia Charbonneau, Donna Deitch', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Donna Deitch', 'Media Format': 'Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'November 14, 2017', 'Actors': 'Patricia Charbonneau, Helen Shaver', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: An oldie but goodie. Arrived in good order.\nReview Title: Arrived in good order.\nRating: 5.0\n--------------------------------------------------",
  "reference": "Charlotte Rampling: The Look\nCharlotte Rampling  (Actor),     Angelina Maccarone  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['A biographical study of legendary actress Charlotte Rampling (Babylon A.D., Swimming Pool), told through her own conversations with artist friends and collaborators, including Peter Lindbergh, Paul Auster, and Juergen Teller. Intercut with footage from some of Rampling\\'s most famous films, this \"self-portrait through others\" is a revealing look at one of our most iconic screen stars.']\n{'Genre': 'Documentary/Biography, Special Interests', 'Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Contributor': 'Charlotte Rampling, Angelina Maccarone', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '25093537', 'Director': 'Angelina Maccarone', 'Media Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2012', 'Actors': 'Charlotte Rampling', 'Studio': 'Kino Lorber', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAbsolutely amazing film. If you are a fan of Charlotte Rampling, you'll love it, of course. But what she has to say has significance far beyond her own life. A must-see.\nAbsolutely amazing film. If you are a fan of Charlotte ...\nThe Statement\nMichael Caine  (Actor),     Tilda Swinton  (Actor),     Norman Jewison  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Veteran actor and two-time Oscar(r) winner Michael Caine stars with Tilda Swinton and Jeremy Northam in THE STATEMENT, a shocking and provoking thriller that delves into a fascinating chapter in modernevents! An ambitious Judge (Swinton) and an exacting Colonel (Jeremy Northam) re-open the sixty-year-old case of Pierre Brossard (Michael Caine), an escaped Nazi collaborator accused of murdering seven Jews. Now an old man living a sheltered life within the Catholic Church, Brossard is also being trailed by mysterious hit men, determined to kill him before he's arrested. When the Church shuts outBrossard to protect their dirty secret, it's a race against time, the government, and the hit men to discover whether justice will prevail or revenge will be served!\"]\n{'Genre': 'Thriller', 'Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, WidescreenMultiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen   See more', 'Contributor': 'John Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy NorthamJohn Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy Northam   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.32 Ounces', 'Item model number': '2225824', 'Director': 'Norman Jewison', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'April 27, 2004', 'Actors': 'Michael Caine, Tilda Swinton, Jeremy Northam, Alan Bates, John Neville', 'Subtitles': 'English', 'Producers': 'Robert Lantos, Norman Jewison', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThoroughly enjoyed this chase thriller. Good story, complex characters, good acting. The fact that Michael Caine's character wasn't entirely despicabledisturbed many viewers when the film was released, so it wasn't a hit at the box office and received some poor reviews. They should take another look now.\nThoroughly enjoyed this chase thriller\n45 Years\nCharlotte Rampling  (Actor),     Tom Courtenay  (Actor),     Andrew Haigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Award-winning actors Charlotte Rampling (Swimming Pool) and Tom Courtenay (Doctor Zhviago) give career-defining performances in 45 Years. As Kate and Geoff prepare to celebrate their 45th wedding anniversary, their marriage is shaken when unexpected news threatens to change their lives. The body of his first love has been discovered, frozen and preserved in the icy glaciers of the Swiss Alps. By the time the party is upon them, five days later, there may not be a marriage left to celebrate.']\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Charlotte Rampling, Andrew Haigh, Tom Courtenay, Geraldine James', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35375576', 'Director': 'Andrew Haigh', 'Media Format': 'NTSC', 'Release date': 'June 14, 2016', 'Actors': 'Charlotte Rampling, Tom Courtenay, Geraldine James', 'Studio': 'Paramount', 'Number of discs': '1'}\nAn exceptional film. If you cannot appreciate the small movements and the subtleties of changes in facial expressions, you will fail to see what an amazing film this is. Charlotte Rampling at her very best...so far.\nyou will fail to see what an amazing film this is\nThe Lives of Others\nMartina Gedeck  (Actor),     Ulrich Mühe  (Actor),     Florian Henckel von Donnersmarck  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Drama\n['Product Description', 'This critically-acclaimed, Oscar®-winning film (Best Foreign Language Film, 2006) is the erotic, emotionally-charged experience Lisa Schwarzbaum (Entertainment Weekly) calls \"a nail-biter of a thriller!\" Before the collapse of the Berlin Wall, East Germany\\x92s population was closely monitored by the State Secret Police (Stasi). Only a few citizens above suspicion, like renowned pro-Socialist playwright Georg Dreyman, were permitted to lead private lives. But when a corrupt government official falls for Georg\\x92s stunning actress-girlfriend, Christa, an ambitious Stasi policeman is ordered to bug the writer\\x92s apartment to gain incriminating evidence against the rival. Now, what the officer discovers is about to dramatically change their lives - as well as his - in this seductive political thriller Peter Travers (Rolling Stone) proclaims is \"the best kind of movie: one you can\\x92t get out of your head.\"', 'Amazon.com', \"Nominated for a Best Foreign Language Film Oscar, this is a first-rate thriller that, like Bertolucci's\", 'The Conformist', \"and Coppola's\", 'The Conversation', ', opts for character development over car chases. The place is East Berlin, the year is 1984, and it all begins with a simple surveillance assignment: Capt. Gerd Wiesler (Ulrich Mühe in a restrained, yet deeply felt performance), a Stasi officer and a specialist in this kind of thing, has been assigned to keep an eye on Georg Dreyman (Sebastian Koch,', 'Black Book', '), a respected playwright, and his actress girlfriend, Christa-Maria Sieland (Martina Gedeck,', 'Mostly Martha', \"). Though Dreyman is known to associate with the occasional dissident, like blacklisted director Albert Jerska (Volkmar Kleinert), his record is spotless. Everything changes when Wiesler discovers that Minister Hempf (Thomas Thieme) has an ulterior motive in spying on this seemingly upright citizen. In other words, it's personal, and Wiesler's sympathies shift from the government to its people--or at least to this one particular person. That would be risky enough, but then Wiesler uses his privileged position to affect a change in Dreyman's life. The God-like move he makes may be minor and untraceable, but it will have major consequences for all concerned, including Wiesler himself. Writer/director Florian Henckel von Donnersmarck starts with a simple premise that becomes more complicated and emotionally involving as his assured debut unfolds. Though three epilogues is, arguably, two too many,\", 'The Lives of Others', \"is always elegant, never confusing. It's class with feeling. --\", 'Kathleen C. Fennessy', 'Beyond', 'The Lives of Others', 'Films from Germany', 'Other Cold War Films', 'More Arthouse Selections from Sony Pictures Classics', 'Stills from', 'The Lives of Others', '(click for larger image)']\n{'Genre': 'Mystery & Thrillers', 'Format': 'AC-3, Color, Dolby, Widescreen, Subtitled, NTSC', 'Contributor': 'Ulrich Tukur, Thomas Thieme, Hans-Uwe Bauer, Ulrich Mühe, Sebastian Koch, Florian Henckel von Donnersmarck, Charly Hübner, Volkmar Kleinert, Matthias Brenner, Herbert Knaup, Martina GedeckUlrich Tukur, Thomas Thieme, Hans-Uwe Bauer, Ulrich Mühe, Sebastian Koch, Florian Henckel von Donnersmarck, Charly Hübner, Volkmar Kleinert, Matthias Brenner, Herbert Knaup, Martina Gedeck  See more', 'Language': 'German (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 18 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Florian Henckel von Donnersmarck', 'Media Format': 'AC-3, Color, Dolby, Widescreen, Subtitled, NTSC', 'Run time': '2 hours and 18 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Martina Gedeck, Ulrich Mühe, Sebastian Koch, Ulrich Tukur, Thomas Thieme', 'Subtitles': 'English, Spanish, French', 'Studio': 'Sony Pictures', 'Number of discs': '1'}\nA film that can change your life. In German, with excellent English subtitles. Every prop historically accurate. Even the color scheme and lighting contribute. Contrary to how it's billed in the popular press, this is not a sensual romance. It's about...redemption. See it!\nwith excellent English subtitles\nDoctor Strange\nBenedict Cumberbatch  (Actor),     Chiwetel Ejiofor  (Actor),     Scott Derrickson  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['From Marvel Studios comes DOCTOR STRANGE, the story of world-famous neurosurgeon Dr. Stephen Strange (Benedict Cumberbatch), whose life changes forever after a horrific car accident renders his hands useless. When traditional medicine fails him, he travels to remote Kamar-Taj in search of a cure, but instead discovers the mystical arts and becomes a powerful sorcerer battling dark forces bent on destroying our reality.']\n{'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936852240', 'Director': 'Scott Derrickson', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours', 'Release date': 'February 28, 2017', 'Actors': 'Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams, Benedict Wong, Michael Stuhlbarg', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'MARVEL', 'Writers': 'Jon Spaihts, Scott Derrickson, C. Robert Cargill', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThoroughly enjoyed. Great special effects. Cumberbatch was very good as the Doctor, and Swinton was perfect as the Ancient One. Be sure to watch all the way through the credits. When will Doctor Strange return?\nThoroughly enjoyed. Great special effects\nThe Princess and the Warrior\nFranka Potente  (Actor),     Benno Furmann  (Actor),     Tom Tykwer  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['From the director (Tom Tykwer) and star (Franka Potente) of the internationally acclaimed, fast-paced smash hit, Run Lola Run, comes a startling fresh and compelling romantic drama that will leave you breathless. When shy, beautiful nurse Sissi is the victim of a horrible car accident, a handsome small-time criminal miraculously saves her life. When she recovers, Sissi sets out to find him and discovers a violent man with a conflicted past and dangerous future. Soon, the two meet again in the middle of a deadly bank robbery, and Sissi realizes her fate is pre-destined. Or is it?']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': '043396063907', 'Director': 'Tom Tykwer', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 1, 2002', 'Actors': 'Franka Potente, Benno Furmann', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Stefan Arndt', 'Language': 'German (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nWhen I first saw this movie a number of years ago, I missed the beginning. I recommend you skip the first 5 minutes or so, start watching with the auto accident. Then go back and watch the entire movie. Your perception of what's going on will be very different. Either way, it's a disturbing story, well-acted and well-written. In German with good subtitles.\nI recommend you skip the first 5 minutes or so\nThe Sense of an Ending [DVD]\nMichelle Dockery  (Actor),     Emily Mortimer  (Actor),     Ritesh Batra  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n{'Genre': 'Suspense', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Charlotte Rampling, Ritesh Batra, BBC Films; CBS Films; FilmNation Entertainment; Origin Pictures, David Thompson, Ed Rubin, Jim Broadbent, Harriet Walter, Michelle Dockery, Emily MortimerCharlotte Rampling, Ritesh Batra, BBC Films; CBS Films; FilmNation Entertainment; Origin Pictures, David Thompson, Ed Rubin, Jim Broadbent, Harriet Walter, Michelle Dockery, Emily Mortimer   See more', 'Language': 'English', 'Runtime': '1 hour and 48 minutes'}\nWell written and well acted.\nFive Stars\nThe Seasons in Quincy\nTilda Swinton  (Actor, Director),     John Berger  (Actor),     Bartek Dziadosz  (Director),     Colin MacCabe  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Documentary\n['Product Description', 'Prolific artist, philosopher, writer, storyteller and \"radical humanist\" John Berger is the focus of tjos vovod fpir-part cinematic portrait. In 1973 he moved from urban London to the tiny Alpine villate of Quincy. THE SEASON IN QUINCY: FOUR PORTRAITS OF JOHN BERGER examines different aspects of Berger\\'s life in this remote village in the Alps. In four seasonal chapters, the film combines ideas and motifs from his work with the texture and history of his mountain home.', 'Review', 'An impressively high-minded documentary about writer John Berger ... As a collection, THE SEASONS OF QUINCY is an absolutely inspired way of approaching its subject. --The GuardianIntimate and revealing: a portrait of its subject in which we get closer to him as a personality than a more conventional film could ever take us. --The Independent']\n{'Genre': 'Special Interests', 'Format': 'NTSC, Widescreen', 'Contributor': 'Christopher Roth, Bartek Dziadosz, John Berger, Tilda Swinton, Colin MacCabe', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Bartek Dziadosz, Colin MacCabe, Christopher Roth, Tilda Swinton', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'December 6, 2016', 'Actors': 'Tilda Swinton, John Berger', 'Studio': 'Icarus Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOutstanding!\nFive Stars\nThe Invisible Frame / Cycling the Frame\nTilda Swinton  (Actor),     Cynthia Beatt  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['Product Description', 'In 1988 director Cynthia Beatt and the Tilda Swinton embarked on a filmic journey along the Berlin Wall to create the short film CYCLING THE FRAME. Riding her bicycle from the Brandenburg Gate to the suburbs, passying by lakes, fields, and checkpoints, Swinton retraced the concrete and oppressive structure encircling West Berlin, cutting through neighborhoods and buildings, seeming indestructible at the time. One year after filming, the Wall was opened and the process of reunification of Germany began. More than 20 years later, in 2009, Beatt and Swinton reteamed and retraced their ride, but this time weaving through both sides of the fallen wall. THE INVISIBLE FRAME depicts this poetic passage and reflects on history, memory and freedom.', 'About the Actor', 'Katherine Mathilda Swinton\\xa0(born 5 November 1960) is a British actress known for both arthouse\\xa0and\\xa0mainstream films. She has appeared in a number of films including\\xa0The Curious Case of Benjamin Button,\\xa0Burn After Reading,\\xa0The Beach,\\xa0We Need to Talk About Kevin\\xa0and was nominated for a\\xa0Golden Globe\\xa0for her performance in\\xa0The Deep End. She won the 2007\\xa0Academy Award for Best Supporting Actress\\xa0for\\xa0Michael Clayton.', 'About the Director', 'Cynthia Beatt was born in Jamaica and lived there until the age of ten. Her parents (mother American, father British) then moved to the Fiji Islands and remained there for 15 years. Like many British colonial children, Beatt was sent off to English boarding school and upon finishing, she attended Art College where she discovered the world of independent and experimental cinema. During the 70s she worked in London distributing and exhibiting experimental films before traveling for a year through the Middle East, Iran and India. Beatt moved to Berlin in 1976, where she is now based, and began curating extensive retrospectives for the Arsenal Cinema. She also collaborated with Yvonne Rainer, Joan Jonas, Ulrike Ottinger, and Tilda Swinton on diverse films. Since 1979 Beatt has directed critically acclaimed features and essay films, all presented at international film festivals, such as Study of An Island, the award-winning Fury is a Feeling Too, The Party - Nature Morte and The Invisible Frame. The landscapes, architecture and music, cultures, and social-political histories of Berlin, the Middle East and South Pacific continue to influence her work, as does the quest for formal innovation determined by subject matter. In 1985-86 Beatt returned to the South Seas and traveled through the islands to write a script that delved into the true heart of Fijian life while mirroring European myths of paradise. She is completing the feature A House in Berlin, to be released in 2012, a story of post-Wall Jewish restitution in East Berlin, which inevitably leads the main character to Palestine, to other questions of dispossession and Walls.', 'See more']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 4 Ounces', 'Director': 'Cynthia Beatt', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 27 minutes', 'Release date': 'November 8, 2011', 'Actors': 'Tilda Swinton', 'Studio': 'Icarus Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nTwo films, circling Berlin with sights you'd  never see otherwise, especially in the earlier of the two before the Wall came down. Intriguing insights.\nTwo films, circling Berlin with sights you'd never see ...\nWhen Night Is Falling\nPascale Bussières  (Actor),     Rachael Crawford  (Actor),     Patricia Rozema  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product description', \"Camille and Martin are in love and teachers at a christian college; they get the opportunity to get a better job, but they would have to marry for that. But when Camille's dog dies, she recognizes that her love for Martin is not even as big as the love for her dog. After that, Camille gets to know Petra, and Petra falls in love with Camille. They meet again, but Camille is very unsure about her feelings. When Martin is away for a weekend, Camille and Petra meet in the Circus where Petra is working as an acrobat. They spend the night together, but Martin finds out about it and is shocked. He has an argument with Camille, and she goes burying her dog in the snow, and falls asleep.\", 'Amazon.com', 'Throughout Patricia Rozema\\x92s third film, conservatives tangle with liberals, men with women, and heterosexuals with those of more fluid sexual persuasions. Surface tension aside,', 'When Night Is Falling', 'feels more personal than political. Camille (Pascale Bussières) teaches mythology at a Christian college in Toronto, while her fiancé, Martin (Henry Czerny,', 'Clear and Present Danger', '), is a fellow theologian. Their superior, Reverend DeBoer (David Fox,', 'The Saddest Music in the World', '), encourages them to marry. When Camille\\x92s dog dies, she neglects to inform Martin, but instead confides in Petra (Rachael Crawford), a circus performer she meets at a laundromat. Petra leaves her card, so Camille seeks her out, but when she makes a pass, Camille flees. Later, she suggests they remain friends... until mutual attraction proves too strong to resist. A simplistic reading suggests that the death of a pet can lead to experimentation, except Rozema (', 'I\\x92ve Heard the Mermaids Singing', \") aims for a metaphorical reading rather than a literal one. Though the narrative isn't autobiographical, she too attended a Calvinist institution (the same one as writer/director Paul Schrader). It's a testament to her skill that the film feels so fresh, since the storyline echoes\", 'Lianna', '(the academic milieu) and anticipates', 'Tipping the Velvet', '(the circus angle). It\\'s also one of the more quotable same-sex love stories of the 1990s. As Martin tells Camille, \"Maybe you can imagine more intoxicating options. That\\'s okay--that\\'s what imagination\\'s for.\" To Rozema\\'s heroine, however, fulfillment is for', 'experiencing', ', not imagining.', '--Kathleen C. Fennessy']\n{'Genre': 'Gay & Lesbian', 'Format': 'Multiple Formats, NTSC, Import', 'Contributor': 'Don McKellar, Rachael Crawford, Pascale Bussières, Henry Czerny, Patricia Rozema, David Fox', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '95 minutes', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Patricia Rozema', 'Media Format': 'Multiple Formats, NTSC, Import', 'Run time': '95 minutes', 'Release date': 'July 5, 2007', 'Actors': 'Pascale Bussières, Rachael Crawford, Henry Czerny, David Fox, Don McKellar', 'Subtitles': 'English, French', 'Studio': 'Ais', 'Number of discs': '1'}\nDVD as described & well-packaged.\nFive Stars\nAberdeen\nStellan Skarsgård  (Actor),     Jean Anderson (II)  (Actor),     Hans Petter Moland  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', \"Kaisa (Lena Headey), a beautiful and feisty Scottish woman, finally has her life together - at least until her mother (Charlotte Rampling) asks an enormous favor: To bring back to her Kaisa's estranged, larger-than-life father (Stellan Skarsgard). The two of them, father and daughter together, set out on a wild, brutally funny yet heartbreaking journey, which takes them their emotional past before reaching their ultimate destination. Includes: Trailer; Cast/Crew Biographies; Interview with Hans Petter Moland (2001) Running time: 103 minutes.\", 'Amazon.com', 'An achingly beautiful film,', 'Aberdeen', \"has an outrageously sentimental premise: Kaisa (Lena Headey) is asked by her fatally ill mother (Charlotte Rampling) to bring her estranged father Tomas (Stellan Skarsgård,) to visit before her mother dies. Kaisa finds Tomas--a jobless drunk--at his home in Norway, and basically drags him on a road trip back to Scotland, over the course of which they're forced to grapple with their past. This could be a recipe for maudlin sap, but instead--thanks to sharp incisive writing, unexpected characters, and performances that encompass humor, brutally honest self-destructive behavior, and subtle gentleness--\", 'Aberdeen', 'is bracing, constantly surprising, and deeply engaging. The entire cast (including the always solid Ian Hart, of', 'Backbeat', 'and', 'Hollow Reed', ') is incredibly good. Highly recommended.', '--Bret Fetzer', 'Review', 'Ravishing... harsh but strangely lyrical. The near-perfect cast has talent to burn. --Village Voice', 'See more']\n{'Genre': 'Drama/British Empire', 'Format': 'NTSC, Widescreen, Color, Multiple Formats, Letterboxed', 'Contributor': 'John Killoran, Gard B. Eidsvold, Fergis McLarnon, Hans Petter Moland, Jean Anderson (II), Henriette Steenstrup, Jon Erling Wevling, Kate Lynn Evans, John Harwood (II), Nina Andresen Borud, Kari Simonsen, Lena Headey, Charlotte Rampling, Richard Laing, Louise Goodall, Jan Grønli, Anders T. Andersen, Jason Hetherington, Frøydis Armand, Stellan Skarsgård, Justine MiddaJohn Killoran, Gard B. Eidsvold, Fergis McLarnon, Hans Petter Moland, Jean Anderson (II), Henriette Steenstrup, Jon Erling Wevling, Kate Lynn Evans, John Harwood (II), Nina Andresen Borud, Kari Simonsen, Lena Headey, Charlotte Rampling, Richard Laing, Louise Goodall, Jan…   See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'FIRF910095DVD', 'Director': 'Hans Petter Moland', 'Media Format': 'NTSC, Widescreen, Color, Multiple Formats, Letterboxed', 'Run time': '1 hour and 43 minutes', 'Release date': 'April 23, 2002', 'Actors': 'Stellan Skarsgård, Jean Anderson (II), Lena Headey, Charlotte Rampling, Louise Goodall', 'Studio': 'First Run Features', 'Country of Origin': 'USA', 'Number of discs': '1'}\nQuite a good film.\nFive Stars\nDesert Hearts (The Criterion Collection) [DVD]\nPatricia Charbonneau  (Actor),     Helen Shaver  (Actor),     Donna Deitch  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Donna Deitch's swooning and sensual first narrative feature, 'Desert Hearts', was groundbreaking upon its 1985 release: a love story about two women, made entirely independently, on a self-financed shoestring budget, by a woman. In the 1959-set film, an adaptation of a beloved novel by Jane Rule, straitlaced East Coast professor Vivian Bell (Helen Shaver) arrives in Reno to file for divorce but winds up catching the eye of someone new, the younger free spirit Cay (Patricia Charbonneau), touching off a slow seduction that unfolds against a breathtaking desert landscape. With undeniable chemistry between its two leads, an evocative jukebox soundtrack, and vivid cinematography by Robert Elswit, Desert Hearts beautifully exudes a sense of tender yearning and emotional candor.DIRECTOR-APPROVED DVD SPECIAL EDITION FEATURES- New, restored 4K digital transfer, supervised by cinematographer Robert Elswit- Audio commentary from 2007 featuring director Donna Deitch- New conversation between Deitch and actor Jane Lynch - New conversation between Deitch, Elswit, and production designer Jeannine Oppewall about the film s visual style - New interviews with actors Helen Shaver and Patricia Charbonneau - Excerpt from Fiction and Other Truths: A Film About Jane Rule, a 1995 documentary about the author of Desert of the Heart, the 1964 novel on which the film is based - Trailer- PLUS: An essay by critic B. Ruby Rich\"]\n{'Genre': 'Gay & Lesbian, Drama', 'Format': 'Subtitled, Widescreen, NTSC', 'Contributor': 'Helen Shaver, Patricia Charbonneau, Donna Deitch', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Donna Deitch', 'Media Format': 'Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'November 14, 2017', 'Actors': 'Patricia Charbonneau, Helen Shaver', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAn oldie but goodie. Arrived in good order.\nArrived in good order.",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Charlotte Rampling: The Look\nReview Date: 2017/05/27\nStore: Charlotte Rampling  (Actor),     Angelina Maccarone  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['A biographical study of legendary actress Charlotte Rampling (Babylon A.D., Swimming Pool), told through her own conversations with artist friends and collaborators, including Peter Lindbergh, Paul Auster, and Juergen Teller. Intercut with footage from some of Rampling\\'s most famous films, this \"self-portrait through others\" is a revealing look at one of our most iconic screen stars.']\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Documentary/Biography, Special Interests', 'Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Contributor': 'Charlotte Rampling, Angelina Maccarone', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '25093537', 'Director': 'Angelina Maccarone', 'Media Format': 'Multiple Formats, Anamorphic, NTSC, Black & White, Widescreen, Color, Surround Sound', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2012', 'Actors': 'Charlotte Rampling', 'Studio': 'Kino Lorber', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Absolutely amazing film. If you are a fan of Charlotte Rampling, you'll love it, of course. But what she has to say has significance far beyond her own life. A must-see.\nReview Title: Absolutely amazing film. If you are a fan of Charlotte ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Statement\nReview Date: 2017/06/09\nStore: Michael Caine  (Actor),     Tilda Swinton  (Actor),     Norman Jewison  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Veteran actor and two-time Oscar(r) winner Michael Caine stars with Tilda Swinton and Jeremy Northam in THE STATEMENT, a shocking and provoking thriller that delves into a fascinating chapter in modernevents! An ambitious Judge (Swinton) and an exacting Colonel (Jeremy Northam) re-open the sixty-year-old case of Pierre Brossard (Michael Caine), an escaped Nazi collaborator accused of murdering seven Jews. Now an old man living a sheltered life within the Catholic Church, Brossard is also being trailed by mysterious hit men, determined to kill him before he's arrested. When the Church shuts outBrossard to protect their dirty secret, it's a race against time, the government, and the hit men to discover whether justice will prevail or revenge will be served!\"]\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Thriller', 'Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, WidescreenMultiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen   See more', 'Contributor': 'John Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy NorthamJohn Neville, Company Pictures; Odessa Films; Serendipity Point Films Inc.; Summit Entertainment; Yorktown Product, Charlotte Rampling, Michael Caine, Alan Bates, Robert Lantos, Tilda Swinton, Norman Jewison, Jeremy Northam   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.32 Ounces', 'Item model number': '2225824', 'Director': 'Norman Jewison', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Color, Closed-captioned, DTS Surround Sound, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 59 minutes', 'Release date': 'April 27, 2004', 'Actors': 'Michael Caine, Tilda Swinton, Jeremy Northam, Alan Bates, John Neville', 'Subtitles': 'English', 'Producers': 'Robert Lantos, Norman Jewison', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Thoroughly enjoyed this chase thriller. Good story, complex characters, good acting. The fact that Michael Caine's character wasn't entirely despicabledisturbed many viewers when the film was released, so it wasn't a hit at the box office and received some poor reviews. They should take another look now.\nReview Title: Thoroughly enjoyed this chase thriller\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 45 Years\nReview Date: 2017/06/09\nStore: Charlotte Rampling  (Actor),     Tom Courtenay  (Actor),     Andrew Haigh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['Award-winning actors Charlotte Rampling (Swimming Pool) and Tom Courtenay (Doctor Zhviago) give career-defining performances in 45 Years. As Kate and Geoff prepare to celebrate their 45th wedding anniversary, their marriage is shaken when unexpected news threatens to change their lives. The body of his first love has been discovered, frozen and preserved in the icy glaciers of the Swiss Alps. By the time the party is upon them, five days later, there may not be a marriage left to celebrate.']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Charlotte Rampling, Andrew Haigh, Tom Courtenay, Geraldine James', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35375576', 'Director': 'Andrew Haigh', 'Media Format': 'NTSC', 'Release date': 'June 14, 2016', 'Actors': 'Charlotte Rampling, Tom Courtenay, Geraldine James', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: An exceptional film. If you cannot appreciate the small movements and the subtleties of changes in facial expressions, you will fail to see what an amazing film this is. Charlotte Rampling at her very best...so far.\nReview Title: you will fail to see what an amazing film this is\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Lives of Others\nReview Date: 2017/06/09\nStore: Martina Gedeck  (Actor),     Ulrich Mühe  (Actor),     Florian Henckel von Donnersmarck  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Drama\nProduct Description: ['Product Description', 'This critically-acclaimed, Oscar®-winning film (Best Foreign Language Film, 2006) is the erotic, emotionally-charged experience Lisa Schwarzbaum (Entertainment Weekly) calls \"a nail-biter of a thriller!\" Before the collapse of the Berlin Wall, East Germany\\x92s population was closely monitored by the State Secret Police (Stasi). Only a few citizens above suspicion, like renowned pro-Socialist playwright Georg Dreyman, were permitted to lead private lives. But when a corrupt government official falls for Georg\\x92s stunning actress-girlfriend, Christa, an ambitious Stasi policeman is ordered to bug the writer\\x92s apartment to gain incriminating evidence against the rival. Now, what the officer discovers is about to dramatically change their lives - as well as his - in this seductive political thriller Peter Travers (Rolling Stone) proclaims is \"the best kind of movie: one you can\\x92t get out of your head.\"', 'Amazon.com', \"Nominated for a Best Foreign Language Film Oscar, this is a first-rate thriller that, like Bertolucci's\", 'The Conformist', \"and Coppola's\", 'The Conversation', ', opts for character development over car chases. The place is East Berlin, the year is 1984, and it all begins with a simple surveillance assignment: Capt. Gerd Wiesler (Ulrich Mühe in a restrained, yet deeply felt performance), a Stasi officer and a specialist in this kind of thing, has been assigned to keep an eye on Georg Dreyman (Sebastian Koch,', 'Black Book', '), a respected playwright, and his actress girlfriend, Christa-Maria Sieland (Martina Gedeck,', 'Mostly Martha', \"). Though Dreyman is known to associate with the occasional dissident, like blacklisted director Albert Jerska (Volkmar Kleinert), his record is spotless. Everything changes when Wiesler discovers that Minister Hempf (Thomas Thieme) has an ulterior motive in spying on this seemingly upright citizen. In other words, it's personal, and Wiesler's sympathies shift from the government to its people--or at least to this one particular person. That would be risky enough, but then Wiesler uses his privileged position to affect a change in Dreyman's life. The God-like move he makes may be minor and untraceable, but it will have major consequences for all concerned, including Wiesler himself. Writer/director Florian Henckel von Donnersmarck starts with a simple premise that becomes more complicated and emotionally involving as his assured debut unfolds. Though three epilogues is, arguably, two too many,\", 'The Lives of Others', \"is always elegant, never confusing. It's class with feeling. --\", 'Kathleen C. Fennessy', 'Beyond', 'The Lives of Others', 'Films from Germany', 'Other Cold War Films', 'More Arthouse Selections from Sony Pictures Classics', 'Stills from', 'The Lives of Others', '(click for larger image)']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'AC-3, Color, Dolby, Widescreen, Subtitled, NTSC', 'Contributor': 'Ulrich Tukur, Thomas Thieme, Hans-Uwe Bauer, Ulrich Mühe, Sebastian Koch, Florian Henckel von Donnersmarck, Charly Hübner, Volkmar Kleinert, Matthias Brenner, Herbert Knaup, Martina GedeckUlrich Tukur, Thomas Thieme, Hans-Uwe Bauer, Ulrich Mühe, Sebastian Koch, Florian Henckel von Donnersmarck, Charly Hübner, Volkmar Kleinert, Matthias Brenner, Herbert Knaup, Martina Gedeck  See more', 'Language': 'German (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 18 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Florian Henckel von Donnersmarck', 'Media Format': 'AC-3, Color, Dolby, Widescreen, Subtitled, NTSC', 'Run time': '2 hours and 18 minutes', 'Release date': 'August 21, 2007', 'Actors': 'Martina Gedeck, Ulrich Mühe, Sebastian Koch, Ulrich Tukur, Thomas Thieme', 'Subtitles': 'English, Spanish, French', 'Studio': 'Sony Pictures', 'Number of discs': '1'}\nReview Text: A film that can change your life. In German, with excellent English subtitles. Every prop historically accurate. Even the color scheme and lighting contribute. Contrary to how it's billed in the popular press, this is not a sensual romance. It's about...redemption. See it!\nReview Title: with excellent English subtitles\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Doctor Strange\nReview Date: 2017/06/09\nStore: Benedict Cumberbatch  (Actor),     Chiwetel Ejiofor  (Actor),     Scott Derrickson  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['From Marvel Studios comes DOCTOR STRANGE, the story of world-famous neurosurgeon Dr. Stephen Strange (Benedict Cumberbatch), whose life changes forever after a horrific car accident renders his hands useless. When traditional medicine fails him, he travels to remote Kamar-Taj in search of a cure, but instead discovers the mystical arts and becomes a powerful sorcerer battling dark forces bent on destroying our reality.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936852240', 'Director': 'Scott Derrickson', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours', 'Release date': 'February 28, 2017', 'Actors': 'Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams, Benedict Wong, Michael Stuhlbarg', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'MARVEL', 'Writers': 'Jon Spaihts, Scott Derrickson, C. Robert Cargill', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Thoroughly enjoyed. Great special effects. Cumberbatch was very good as the Doctor, and Swinton was perfect as the Ancient One. Be sure to watch all the way through the credits. When will Doctor Strange return?\nReview Title: Thoroughly enjoyed. Great special effects\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Princess and the Warrior\nReview Date: 2017/06/09\nStore: Franka Potente  (Actor),     Benno Furmann  (Actor),     Tom Tykwer  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['From the director (Tom Tykwer) and star (Franka Potente) of the internationally acclaimed, fast-paced smash hit, Run Lola Run, comes a startling fresh and compelling romantic drama that will leave you breathless. When shy, beautiful nurse Sissi is the victim of a horrible car accident, a handsome small-time criminal miraculously saves her life. When she recovers, Sissi sets out to find him and discovers a violent man with a conflicted past and dangerous future. Soon, the two meet again in the middle of a deadly bank robbery, and Sissi realizes her fate is pre-destined. Or is it?']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': '043396063907', 'Director': 'Tom Tykwer', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 1, 2002', 'Actors': 'Franka Potente, Benno Furmann', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Stefan Arndt', 'Language': 'German (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: When I first saw this movie a number of years ago, I missed the beginning. I recommend you skip the first 5 minutes or so, start watching with the auto accident. Then go back and watch the entire movie. Your perception of what's going on will be very different. Either way, it's a disturbing story, well-acted and well-written. In German with good subtitles.\nReview Title: I recommend you skip the first 5 minutes or so\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Sense of an Ending [DVD]\nReview Date: 2017/06/21\nStore: Michelle Dockery  (Actor),     Emily Mortimer  (Actor),     Ritesh Batra  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Suspense', 'Format': 'NTSC, Subtitled, Widescreen', 'Contributor': 'Charlotte Rampling, Ritesh Batra, BBC Films; CBS Films; FilmNation Entertainment; Origin Pictures, David Thompson, Ed Rubin, Jim Broadbent, Harriet Walter, Michelle Dockery, Emily MortimerCharlotte Rampling, Ritesh Batra, BBC Films; CBS Films; FilmNation Entertainment; Origin Pictures, David Thompson, Ed Rubin, Jim Broadbent, Harriet Walter, Michelle Dockery, Emily Mortimer   See more', 'Language': 'English', 'Runtime': '1 hour and 48 minutes'}\nReview Text: Well written and well acted.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Seasons in Quincy\nReview Date: 2017/06/21\nStore: Tilda Swinton  (Actor, Director),     John Berger  (Actor),     Bartek Dziadosz  (Director),     Colin MacCabe  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Independently Distributed, Documentary\nProduct Description: ['Product Description', 'Prolific artist, philosopher, writer, storyteller and \"radical humanist\" John Berger is the focus of tjos vovod fpir-part cinematic portrait. In 1973 he moved from urban London to the tiny Alpine villate of Quincy. THE SEASON IN QUINCY: FOUR PORTRAITS OF JOHN BERGER examines different aspects of Berger\\'s life in this remote village in the Alps. In four seasonal chapters, the film combines ideas and motifs from his work with the texture and history of his mountain home.', 'Review', 'An impressively high-minded documentary about writer John Berger ... As a collection, THE SEASONS OF QUINCY is an absolutely inspired way of approaching its subject. --The GuardianIntimate and revealing: a portrait of its subject in which we get closer to him as a personality than a more conventional film could ever take us. --The Independent']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Special Interests', 'Format': 'NTSC, Widescreen', 'Contributor': 'Christopher Roth, Bartek Dziadosz, John Berger, Tilda Swinton, Colin MacCabe', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Bartek Dziadosz, Colin MacCabe, Christopher Roth, Tilda Swinton', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'December 6, 2016', 'Actors': 'Tilda Swinton, John Berger', 'Studio': 'Icarus Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Outstanding!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Invisible Frame / Cycling the Frame\nReview Date: 2017/07/28\nStore: Tilda Swinton  (Actor),     Cynthia Beatt  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nProduct Description: ['Product Description', 'In 1988 director Cynthia Beatt and the Tilda Swinton embarked on a filmic journey along the Berlin Wall to create the short film CYCLING THE FRAME. Riding her bicycle from the Brandenburg Gate to the suburbs, passying by lakes, fields, and checkpoints, Swinton retraced the concrete and oppressive structure encircling West Berlin, cutting through neighborhoods and buildings, seeming indestructible at the time. One year after filming, the Wall was opened and the process of reunification of Germany began. More than 20 years later, in 2009, Beatt and Swinton reteamed and retraced their ride, but this time weaving through both sides of the fallen wall. THE INVISIBLE FRAME depicts this poetic passage and reflects on history, memory and freedom.', 'About the Actor', 'Katherine Mathilda Swinton\\xa0(born 5 November 1960) is a British actress known for both arthouse\\xa0and\\xa0mainstream films. She has appeared in a number of films including\\xa0The Curious Case of Benjamin Button,\\xa0Burn After Reading,\\xa0The Beach,\\xa0We Need to Talk About Kevin\\xa0and was nominated for a\\xa0Golden Globe\\xa0for her performance in\\xa0The Deep End. She won the 2007\\xa0Academy Award for Best Supporting Actress\\xa0for\\xa0Michael Clayton.', 'About the Director', 'Cynthia Beatt was born in Jamaica and lived there until the age of ten. Her parents (mother American, father British) then moved to the Fiji Islands and remained there for 15 years. Like many British colonial children, Beatt was sent off to English boarding school and upon finishing, she attended Art College where she discovered the world of independent and experimental cinema. During the 70s she worked in London distributing and exhibiting experimental films before traveling for a year through the Middle East, Iran and India. Beatt moved to Berlin in 1976, where she is now based, and began curating extensive retrospectives for the Arsenal Cinema. She also collaborated with Yvonne Rainer, Joan Jonas, Ulrike Ottinger, and Tilda Swinton on diverse films. Since 1979 Beatt has directed critically acclaimed features and essay films, all presented at international film festivals, such as Study of An Island, the award-winning Fury is a Feeling Too, The Party - Nature Morte and The Invisible Frame. The landscapes, architecture and music, cultures, and social-political histories of Berlin, the Middle East and South Pacific continue to influence her work, as does the quest for formal innovation determined by subject matter. In 1985-86 Beatt returned to the South Seas and traveled through the islands to write a script that delved into the true heart of Fijian life while mirroring European myths of paradise. She is completing the feature A House in Berlin, to be released in 2012, a story of post-Wall Jewish restitution in East Berlin, which inevitably leads the main character to Palestine, to other questions of dispossession and Walls.', 'See more']\nAverage Rating: 3.9\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 4 Ounces', 'Director': 'Cynthia Beatt', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 27 minutes', 'Release date': 'November 8, 2011', 'Actors': 'Tilda Swinton', 'Studio': 'Icarus Films', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Two films, circling Berlin with sights you'd  never see otherwise, especially in the earlier of the two before the Wall came down. Intriguing insights.\nReview Title: Two films, circling Berlin with sights you'd never see ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: When Night Is Falling\nReview Date: 2018/03/26\nStore: Pascale Bussières  (Actor),     Rachael Crawford  (Actor),     Patricia Rozema  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product description', \"Camille and Martin are in love and teachers at a christian college; they get the opportunity to get a better job, but they would have to marry for that. But when Camille's dog dies, she recognizes that her love for Martin is not even as big as the love for her dog. After that, Camille gets to know Petra, and Petra falls in love with Camille. They meet again, but Camille is very unsure about her feelings. When Martin is away for a weekend, Camille and Petra meet in the Circus where Petra is working as an acrobat. They spend the night together, but Martin finds out about it and is shocked. He has an argument with Camille, and she goes burying her dog in the snow, and falls asleep.\", 'Amazon.com', 'Throughout Patricia Rozema\\x92s third film, conservatives tangle with liberals, men with women, and heterosexuals with those of more fluid sexual persuasions. Surface tension aside,', 'When Night Is Falling', 'feels more personal than political. Camille (Pascale Bussières) teaches mythology at a Christian college in Toronto, while her fiancé, Martin (Henry Czerny,', 'Clear and Present Danger', '), is a fellow theologian. Their superior, Reverend DeBoer (David Fox,', 'The Saddest Music in the World', '), encourages them to marry. When Camille\\x92s dog dies, she neglects to inform Martin, but instead confides in Petra (Rachael Crawford), a circus performer she meets at a laundromat. Petra leaves her card, so Camille seeks her out, but when she makes a pass, Camille flees. Later, she suggests they remain friends... until mutual attraction proves too strong to resist. A simplistic reading suggests that the death of a pet can lead to experimentation, except Rozema (', 'I\\x92ve Heard the Mermaids Singing', \") aims for a metaphorical reading rather than a literal one. Though the narrative isn't autobiographical, she too attended a Calvinist institution (the same one as writer/director Paul Schrader). It's a testament to her skill that the film feels so fresh, since the storyline echoes\", 'Lianna', '(the academic milieu) and anticipates', 'Tipping the Velvet', '(the circus angle). It\\'s also one of the more quotable same-sex love stories of the 1990s. As Martin tells Camille, \"Maybe you can imagine more intoxicating options. That\\'s okay--that\\'s what imagination\\'s for.\" To Rozema\\'s heroine, however, fulfillment is for', 'experiencing', ', not imagining.', '--Kathleen C. Fennessy']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Gay & Lesbian', 'Format': 'Multiple Formats, NTSC, Import', 'Contributor': 'Don McKellar, Rachael Crawford, Pascale Bussières, Henry Czerny, Patricia Rozema, David Fox', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '95 minutes', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Patricia Rozema', 'Media Format': 'Multiple Formats, NTSC, Import', 'Run time': '95 minutes', 'Release date': 'July 5, 2007', 'Actors': 'Pascale Bussières, Rachael Crawford, Henry Czerny, David Fox, Don McKellar', 'Subtitles': 'English, French', 'Studio': 'Ais', 'Number of discs': '1'}\nReview Text: DVD as described & well-packaged.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Aberdeen\nReview Date: 2018/03/26\nStore: Stellan Skarsgård  (Actor),     Jean Anderson (II)  (Actor),     Hans Petter Moland  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', \"Kaisa (Lena Headey), a beautiful and feisty Scottish woman, finally has her life together - at least until her mother (Charlotte Rampling) asks an enormous favor: To bring back to her Kaisa's estranged, larger-than-life father (Stellan Skarsgard). The two of them, father and daughter together, set out on a wild, brutally funny yet heartbreaking journey, which takes them their emotional past before reaching their ultimate destination. Includes: Trailer; Cast/Crew Biographies; Interview with Hans Petter Moland (2001) Running time: 103 minutes.\", 'Amazon.com', 'An achingly beautiful film,', 'Aberdeen', \"has an outrageously sentimental premise: Kaisa (Lena Headey) is asked by her fatally ill mother (Charlotte Rampling) to bring her estranged father Tomas (Stellan Skarsgård,) to visit before her mother dies. Kaisa finds Tomas--a jobless drunk--at his home in Norway, and basically drags him on a road trip back to Scotland, over the course of which they're forced to grapple with their past. This could be a recipe for maudlin sap, but instead--thanks to sharp incisive writing, unexpected characters, and performances that encompass humor, brutally honest self-destructive behavior, and subtle gentleness--\", 'Aberdeen', 'is bracing, constantly surprising, and deeply engaging. The entire cast (including the always solid Ian Hart, of', 'Backbeat', 'and', 'Hollow Reed', ') is incredibly good. Highly recommended.', '--Bret Fetzer', 'Review', 'Ravishing... harsh but strangely lyrical. The near-perfect cast has talent to burn. --Village Voice', 'See more']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Drama/British Empire', 'Format': 'NTSC, Widescreen, Color, Multiple Formats, Letterboxed', 'Contributor': 'John Killoran, Gard B. Eidsvold, Fergis McLarnon, Hans Petter Moland, Jean Anderson (II), Henriette Steenstrup, Jon Erling Wevling, Kate Lynn Evans, John Harwood (II), Nina Andresen Borud, Kari Simonsen, Lena Headey, Charlotte Rampling, Richard Laing, Louise Goodall, Jan Grønli, Anders T. Andersen, Jason Hetherington, Frøydis Armand, Stellan Skarsgård, Justine MiddaJohn Killoran, Gard B. Eidsvold, Fergis McLarnon, Hans Petter Moland, Jean Anderson (II), Henriette Steenstrup, Jon Erling Wevling, Kate Lynn Evans, John Harwood (II), Nina Andresen Borud, Kari Simonsen, Lena Headey, Charlotte Rampling, Richard Laing, Louise Goodall, Jan…   See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'FIRF910095DVD', 'Director': 'Hans Petter Moland', 'Media Format': 'NTSC, Widescreen, Color, Multiple Formats, Letterboxed', 'Run time': '1 hour and 43 minutes', 'Release date': 'April 23, 2002', 'Actors': 'Stellan Skarsgård, Jean Anderson (II), Lena Headey, Charlotte Rampling, Louise Goodall', 'Studio': 'First Run Features', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Quite a good film.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Desert Hearts (The Criterion Collection) [DVD]\nReview Date: 2018/06/02\nStore: Patricia Charbonneau  (Actor),     Helen Shaver  (Actor),     Donna Deitch  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"Donna Deitch's swooning and sensual first narrative feature, 'Desert Hearts', was groundbreaking upon its 1985 release: a love story about two women, made entirely independently, on a self-financed shoestring budget, by a woman. In the 1959-set film, an adaptation of a beloved novel by Jane Rule, straitlaced East Coast professor Vivian Bell (Helen Shaver) arrives in Reno to file for divorce but winds up catching the eye of someone new, the younger free spirit Cay (Patricia Charbonneau), touching off a slow seduction that unfolds against a breathtaking desert landscape. With undeniable chemistry between its two leads, an evocative jukebox soundtrack, and vivid cinematography by Robert Elswit, Desert Hearts beautifully exudes a sense of tender yearning and emotional candor.DIRECTOR-APPROVED DVD SPECIAL EDITION FEATURES- New, restored 4K digital transfer, supervised by cinematographer Robert Elswit- Audio commentary from 2007 featuring director Donna Deitch- New conversation between Deitch and actor Jane Lynch - New conversation between Deitch, Elswit, and production designer Jeannine Oppewall about the film s visual style - New interviews with actors Helen Shaver and Patricia Charbonneau - Excerpt from Fiction and Other Truths: A Film About Jane Rule, a 1995 documentary about the author of Desert of the Heart, the 1964 novel on which the film is based - Trailer- PLUS: An essay by critic B. Ruby Rich\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Gay & Lesbian, Drama', 'Format': 'Subtitled, Widescreen, NTSC', 'Contributor': 'Helen Shaver, Patricia Charbonneau, Donna Deitch', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Donna Deitch', 'Media Format': 'Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'November 14, 2017', 'Actors': 'Patricia Charbonneau, Helen Shaver', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: An oldie but goodie. Arrived in good order.\nReview Title: Arrived in good order.\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user's purchasing history reveals a strong appreciation for well-crafted films, particularly within the documentary and drama genres. They consistently commend exceptional storytelling, strong character development, and the performances of notable actors, especially when it involves iconic figures. Reviews often highlight the emotional depth and intellectual engagement of the films, with the user expressing enjoyment and recommending several titles as must-sees for fans of unique narratives. The user values insightful content that transcends mere entertainment, showcasing a preference for films that resonate on a deeper level.\n\nNEGATIVE SUMMARY:\nDespite the overall positive experiences, the user has encountered some disappointment regarding films that did not meet expectations in terms of complexity or appeal. A noted trend involves a disconnect between initial interest and execution, particularly with certain films labeled as thrillers or dramas that may not have delivered on their narrative promise. Additionally, there is a critique of how some stories may come across as simplistic or overly sentimental, detracting from their potential impact. Users expressed frustration with select titles receiving poor reviews, suggesting they deserved a reevaluation.\n\nOVERALL SUMMARY:\nThe user’s purchase history indicates a discerning taste in film, favoring thought-provoking documentaries and compelling dramas. Positive experiences include engaging performances and rich narratives, leading to high ratings and enthusiastic recommendations. However, there are instances where expectations were not met, particularly regarding narrative complexity and originality. Despite some negative experiences, the overall trend points to a robust engagement with quality cinema, evident in their consistent selection of acclaimed works that reflect a desire for meaningful storytelling.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Wonderful, memorable music!",
    "text": "Great to be able to see this again. The music is wonderful and memorable, enjoyable story and well-acted. The DVD arrived well-packaged and in perfect condition.",
    "images": [],
    "asin": "B000H1RFPA",
    "parent_asin": "B000H1RFPA",
    "user_id": "AHBHQ7IK4QHRYI3OHC7PLSQLXPOQ",
    "timestamp": "2018-10-01 21:06:23.444000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Flower Drum Song",
    "average_rating": 4.8,
    "rating_number": 1263,
    "features": [],
    "description": [
      "Nominated for 5 Academy Awards, including Best Music, this romantic comedy tells the story of a young Chinese girl who travels to the United States as part of an arranged marriage and discovers a new and modern world. Featuring an all-new digitally remastered picture, 5.1 Surround Sound, never-before-seen bonus materials, and timeless musical numbers such as \"I Enjoy Being a Girl,\" Flower Drum Song is a lavish song and dance extravaganza.Bonus Content:",
      "A Classic Evolves: From Print to Stage to Screen",
      "A Classic Evolves: From Print to Stage to Screen",
      "Facts of the East: Casting Flower Drum Song",
      "Facts of the East: Casting Flower Drum Song",
      "The Songs of Flower Drum Song",
      "The Songs of Flower Drum Song",
      "An All-Access Pass to the Sets and Costumes of Flower Drum Song",
      "An All-Access Pass to the Sets and Costumes of Flower Drum Song",
      "The Legacy of Rodgers and Hammerstein",
      "The Legacy of Rodgers and Hammerstein",
      "Feature Commentary with Actress Nancy Kwan and Film Historian Nick Redman",
      "Feature Commentary with Actress Nancy Kwan and Film Historian Nick Redman"
    ],
    "price": 8.49,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/517ySsiZ44L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/517ySsiZ44L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/811vWCJTUeL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51-s3vCv9jL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-s3vCv9jL.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/91VeJFBkCXL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/418Tzxl7BEL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/418Tzxl7BEL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81d9sUfRfqL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Video clip ",
        "url": "https://www.amazon.com/vdp/1280c02be3b54164b60a5c596f1f0674?ref=dp_vse_rvc_0",
        "user_id": "AGH5WPWJOPDX7Q36CLCQ2H7XAKBA"
      }
    ],
    "store": "Nancy Kwan  (Actor),     Miyoshi Umeki  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "Musicals & Performing Arts",
      "Musicals"
    ],
    "details": {
      "Genre": "Musicals & Performing Arts, DVD Movie, Comedy/Love & Romance, Blu-ray Movie, Comedy",
      "Format": "Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen",
      "Contributor": "Nancy Kwan, James Shigeta, Miyoshi Umeki, Henry Koster",
      "Language": "English (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)",
      "Runtime": "2 hours and 12 minutes",
      "Aspect Ratio": "2.35:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "7.5 x 5.5 x 0.75 inches; 2.4 Ounces",
      "Item model number": "61024190",
      "Director": "Henry Koster",
      "Media Format": "Multiple Formats, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen",
      "Run time": "2 hours and 12 minutes",
      "Release date": "May 6, 2008",
      "Actors": "Nancy Kwan, Miyoshi Umeki, James Shigeta",
      "Subtitles": "English, Spanish, French",
      "Studio": "Universal Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}