{
  "user_id": "AGCA64OUVM2TJGNN3IUXMEU7KF6Q",
  "summary": "=== Purchase Information ===\nProduct Title: Juno (Single-Disc Edition)\nReview Date: 2009/01/08\nStore: Ellen Page  (Actor),     Michael Cera  (Actor),     Jason Reitman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'The word \"quirky\" has become the quick and easy way to describe films such as LITTLE MISS SUNSHINE and LARS AND THE REAL GIRL that straddle the lines between indie and studio films and comedy and drama. While JUNO fits into that same category, this distinctive dramedy is in a class all it\\'s own. Ellen Page (X-MEN: THE LAST STAND) stars as Juno, a witty teenage girl whose boredom doesn\\'t lead her to the mall. Instead, she makes a one-time trip into the arms of her best friend Paulie Bleeker (Michael Cera). When Juno discovers that she\\'s pregnant, she\\'s forced to grow up fast as she tries to find adoptive parents for her quickly growing child. Director Jason Reitman Star Ellen Page, Michael Cera, Allison Janney, J.K. Simmons, Rainn Wilson, Jason Bateman, Jennifer Garner, Olivia Thirlby Special Features: Widescreen - 1.85 Audio: Dolby Digital Surround - Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish - Optional Additional Release Material: Alternate Scenes - Deleted Scenes (11; w/ Optional Commentary) Audio Commentaries - Jason Reitman Director; Diablo Cody - Screenwriter Behind the Scenes - 1. Screen Tests 2. \"Honest to Blog! Creating JUNO\" Featurettes - 1. Cast & Crew Jam 2. Way Beyond \"Our\" Maturity Level\" 3. \"Diablo Cody is Totally Boss\" 4. \"Jason Reitman for Shizz\" Outtakes - 1. Gag Reel 2. Gag Takes.', 'Amazon.com', 'Somewhere between the sharp satire of', 'Election', 'and the rich human comedy of', 'You Can Count On Me', 'lies', 'Juno', ', a sardonic but ultimately compassionate story of a pregnant teenage girl who wants to give her baby up for adoption. Social misfit Juno (Ellen Page,', 'Hard Candy', ',', 'X-Men: The Last Stand', ') protects herself with a caustic wit, but when she gets pregnant by her friend Paulie (Michael Cera,', 'Superbad', '), Juno finds herself unwilling to terminate the pregnancy. When she chooses a couple who place a classified ad looking to adopt, Juno gets drawn further into their lives than she anticipated. But', 'Juno', 'is much more than its plot; the stylized dialogue (by screenwriter Diablo Cody) seems forced at first, but soon creates a richly textured world, greatly aided by superb performances by Page, Cera, Jennifer Garner and Jason Bateman as the prospective parents, and J.K. Simmons (', 'Spider-Man', \") and Allison Janney as Juno's father and stepmother. Director Jason Reitman (\", 'Thank You For Smoking', \") deftly keeps the movie from slipping into easy, shallow sarcasm or foundering in sentimentality. The result is smarter and funnier than you might expect from the subject matter, and warmer and more touching than you might expect from the cocky attitude. Page's performance is deceptively simple; she never asks the audience to love her, yet she effortlessly carries a movie in which she's in almost every scene. That's star power. --\", 'Bret Fetzer', 'Get to Know', 'Juno', \"'s Cast\", 'Ellen Page (Juno MacGuff)', 'Michael Cera (Paulie Bleeker)', 'Jennifer Garner (Vanessa Loring)', 'Jason Bateman (Mark Loring)', 'Allison Janney (Bren MacGuff)', 'J.K. Simmons (Mac MacGuff)', 'Beyond', 'Juno', 'Juno', 'Soundtrack', 'More from Screenwriter Diablo Cody', 'More from Fox', 'Stills from', 'Juno']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, Widescreen, NTSC', 'Contributor': 'Jason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla FayJason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla Fay  See more', 'Language': 'Unqualified, Unknown (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.55 x 5.34 x 7.46 inches; 0.32 Ounces', 'Item model number': '2250687', 'Director': 'Jason Reitman', 'Media Format': 'Color, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'April 15, 2008', 'Actors': 'Ellen Page, Michael Cera, Jennifer Garner, Jason Bateman, Allison Janney', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Diablo Cody', 'Number of discs': '1'}\nReview Text: With the opening sequence, I thought I was in for a very creative film akin to \"Napolean Dynamite, \" but I was so wrong.  Though the film was not long, I felt it drag and assumed I had missed something critical perhaps while putting my hand into the popcorn or jordan almonds which I'd prepared in advance.  Every aspect of the script seemed to be contrived and the language grew thin with Juno's quips becoming boring after awhile.  The tension never actually climaxed and I was more entertained by the music than the story.  In a nutshell, this movie is far from a classic and weak in the entertainment.  I prefer my films to be more full bodied than light unless the characters or story can carry them to fruition as entertainment.\nReview Title: Napolean Dynamite it's not\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ratatouille\nReview Date: 2009/01/13\nStore: Brad Garrett  (Actor),     Lou Romano  (Actor),     Brad Bird  (Director),     Jan Pinkava  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From the creators of CARS and THE INCREDIBLES comes a break-through comedy with something for everyone. With delightful new characters, experience Paris from an all-new perspective. It\\'s \"terrific movie making\" raves Leonard Maltin of ENTERTAINMENT TONIGHT. In one of Paris\\' finest restaurants, Remy, a determined young rat, dreams of becoming a renowned French chef. Torn between his family\\'s wishes and his true calling, Remy and his pal Linguini set in motion a hilarious chain of events that turns the City of Lights upside down. RATATOUILLE is a treat you\\'ll want to enjoy again and again.', 'Amazon.com', 'One key point: if you can get over the natural gag reflex of seeing hundreds of rodents swarming over a restaurant kitchen, you will be free to enjoy the glory of', 'Ratatouille', \", a delectable Pixar hit. Our hero is Remy, a French rat (voiced by Patton Oswalt) with a cultivated palate, who rises from his humble beginnings to become head chef at a Paris restaurant. How this happens is the stuff of Pixar magic, that ineffable blend of headlong comedy, seamless technology, and wonder (in the latter department, this movie's views of nighttime Paris are on a par with French cinema at its most lyrical). Director Brad Bird (\", 'The Incredibles', \") doesn't quite keep all his spinning plates in the air, but the gags are great and the animation amazingly expressive--Remy's shrugs and nods are nimbler than many flesh-and-blood actors can manage. Refreshingly, the movie's characters aren't celebrity-reliant, with the most recognizable voice coming from Peter O'Toole's snide food critic. (This fellow provides the film's sole sour note--an oddly pointed slap at critics, those craven souls who have done nothing but rave about Pixar's movies over the years.) Brad Bird's style is more quick-hit and less resonant than the approach of Pixar honcho John Lasseter, but it's hard to complain about a movie that cooks up such bountiful pleasure. --\", 'Robert Horton', 'Beyond', 'Ratatouille', 'on DVD', 'Ratatouille', 'on Blu-ray', 'Ratatouille', 'Toys & More', 'Other Classic Pixar Hits', 'Stills from', 'Ratatouille', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'WD05371400DVD', 'Director': 'Brad Bird, Jan Pinkava', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen, Digital Sound', 'Run time': '1 hour and 51 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Brad Garrett, Lou Romano, Patton Oswalt', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS-HD Master Audio 7.1)', 'Studio': 'DISNEY/PIXAR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: As a child, I think I would not have been scared of animated rats in the kitchen.  Mice made the most entertaining cartoon characters.  Despite my understanding the magic of animation and being that I did indeed have an unwelcome rat in my kitchen a couple years ago, the notion of rats running through the food, let alone cooking, nauseates me beyond any level of comfort and I found myself cringing throughout \"Ratatouille.\"  Each time I saw the Little Chef on the head of Linguini, I thought it as creepy as the scariest of horror films, particularly since they resembled each other in profile.  I couldn't erase from memory the vision of a three dimensional rodent I photographed running across my balcony.  Nevertheless, I think this film is an outstanding representation of an imaginative story that was successfully translated to film via the collaborative efforts of creative artists.  Mickey Mouse and Mighty Mouse never frightened me as did this film, so I can only assume that had I retained the innocence of youth, I would have been thrilled with the success of the film's heroic underdog, er rather, rat, and not repulsed.  I think kids will love this film.\nReview Title: Mice never scared me like Ratatouille\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: I'm Not There (Two-Disc Collector's Edition)\nReview Date: 2009/01/13\nStore: Christian Bale  (Actor),     David Cross  (Actor),     Todd Haynes  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: [\"Since arriving in New York City's folk music scene in the 1960s, American singer-songwriter Bob Dylan has become a major figure in popular music, influencing millions with his chart topping songs. His records have earned Grammy, Golden Globe, and Academy Awards, and he has been inducted into the Rock and Roll Hall of Fame, Nashville Songwriters Hall of Fame and Songwriters Hall of Fame.\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Drama', 'Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Contributor': 'Christian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce GreenwoodChristian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce Greenwood  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.64 x 5.35 x 7.57 inches; 4 Ounces', 'Item model number': '81090', 'Director': 'Todd Haynes', 'Media Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Run time': '2 hours and 15 minutes', 'Release date': 'February 1, 2019', 'Actors': 'Christian Bale, David Cross, Charlotte Gainsbourg, Richard Gere, Bruce Greenwood', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '2'}\nReview Text: Bob Dylan as poet, artist, chameleon, activist and inspiration.  Language and rhythm.  The poetry and music of the man are the foundation of this film, but, \"I'm Not There,\" offers an architectural disaster built upon that base.  I'm a fan of black and white films, particularly of the fifties and sixties, genres which this attempts to mimic, so I was disappointed when scenes and characters bounced around more haphazardly than kids in the bubble room at Ikea.  Rather than go with the flow, I wanted to stop the DVD and do some research to make sense of the random personas and make some sense of chaos.  My mind set is different now than it was in decades past and I'm less impressed by free-interpretation without reason.  As a college student, I'd studied and written about the art of Bob Dylan, so his words and delivery are not unfamiliar.  I played his music on the guitar and hi-fi, in pre-iPod times.  I've been a fan for many years and have friends who were neighbors of Bob Dylan in Minnesota when he was Robert Allen Zimmerman.  I expected much from this film but basically received flashbacks of the music with allusions to times past.  I gave this film 3 stars for the following positive reasons:  1. Cate Blanchett as Jude Quinn, 2. Richie Havens in the opening scene, 3. Throw away lines that are actually Dylan's lyrics, 4. Remembering the time I had a conversation with Joan Baez at the University of Florida, and 5. The impetus to listen to Bob Dylan on my iPod, then read Allen Ginsberg.<br /><br />If you're a fan of Dylan, I recommend the film/DVD and expect that you too will find things to like even if you may not care for the assembly of this abstract interpretation of the artist as a young/er/est man.\nReview Title: The muse of the music was the times. The times, they've changed.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Millions\nReview Date: 2009/01/27\nStore: Alex Etel  (Actor),     James Nesbitt  (Actor),     Danny Boyle  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Indie & Art House\nProduct Description: ['From legendary director Danny Boyle (Trainspotting, 28 Days Later) comes ?a family film of limitless imagination and surprising joy!? (Chicago Sun-Times)', 'It?s holiday season and seven-year-old Damian believes he?s received a divine gift from above when a suitcase filled with cash literally falls out of the sky. Damian is anxious to share the wealth with those less fortunate while his fun-loving brother Anthony would rather spend it like there?s no tomorrow! But when the loot turns out to be stolen, both the boys? plans are put to the test?with heartwarming and hilarious results.']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.54 x 5.35 x 7.49 inches; 2.72 Ounces', 'Item model number': '24543198932', 'Director': 'Danny Boyle', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC, Dubbed', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 1, 2005', 'Actors': 'Alex Etel, James Nesbitt, Daisy Donovan, Lewis McGibbon, Christopher Fulford', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Fox Searchlight', 'Writers': 'Frank Cottrell Boyce', 'Number of discs': '1'}\nReview Text: I don't know how I actually came to watch Danny Boyle's, \"Millions,\" but I sure am glad it came my way.  Before I realized he was the director, as I watched this film, I felt the cinematography, bright colors, and wonderful performances by children were similar to \"Slumdog Millionaire,\" which I saw last month.  Although I'm also a fan of \"Trainspotting,\" I didn't even connect Mr. Boyle to all three films until a few minutes ago.<br /><br />This story is lovely, inspiring, surprising and educational.  Each time the character Damian met a Saint, I learned a little about religion and was amazed at the delivery by this innocent young boy with his lovely and stoic face.  The older brother, Anthony was equally as excellent, showing the determination and strength of the character, but not detracting from his sometimes obscured brotherly love.  The Saints were perfect delusions and the Latter-Day \"Saints\" were not.  The plot inspires discussion and reminds me of the time my sister and I found money outside of a department store and we were fortunate enough to receive it two weeks after we turned it in to security.  Some people thought we should have kept it, but I turned it in without a second's hesitation.  I don't know if I'd do that now as an adult, particularly since well over a hundred dollars can buy a lot of goods off Amazon if you're a seasoned shopper.  Or I could donate it to charity.  Or I could keep half and donate half.<br /><br />Directing child actors is not an easy task and Danny Boyle excels time and again.  I would recommend this film for children as well as adults, followed by a \"what if\" conversation.\nReview Title: Danny Boyle is all that and a bag of chips\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Black Book\nReview Date: 2009/02/21\nStore: Carice van Houten  (Actor),     Sebastian Koch  (Actor),     Paul Verhoeven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Drama\nProduct Description: ['Product Description', \"In the darkest days of World War II, Jewish fugitives attempt to escape occupied Holland -- only to face a Nazi ambush. Rachel Stein (Carice van Houten) alone survives the attack and joins the Dutch Resistance to avenge her family. She soon confronts the ultimate test: she must infiltrate German headquarters by tempting Captain Ludwig Mÿntze (Sebastian Hoch). In the heat of passion, he uncovers her duplicity...but keeps her secret. Then Rachel's espionage reveals that a murderous traitor lurks within Resistance ranks. Unable to fully trust anyone, Rachel navigates a minefield of deception and becomes an enemy to both sides. Epic, passionate, breathtaking, Black Book relates an untold story of World War II where the distinctions between good and evil become blurred by the complexities of human nature.\", 'Amazon.com', 'As in', 'Basic Instinct', ', a lovely lady takes the lead in', 'Black Book', \", but this time Paul Verhoeven has more than cheap thrills in mind. Towards the end of WWII, Rachel Stein (the vibrant Carice von Houten), a Jewish singer, is living with a gentile family in the countryside. When Allied forces bomb the area, she's forced to flee. On her perilous journey to The Hague (Verhoeven's hometown), brunette Rachel joins the Resistance and changes her identity to blonde Ellis de Vries. Her next order of business: infiltrate Gestapo headquarters. Like many Verhoeven heroines, Rachel aces her assignment--and then some. First, she seduces the handsome Captain Müntze (Sebastian Koch,\", 'The Lives of Others', \"), then she falls in love with him. Müntze, who returns her affection, isn't what he appears to be, but their relationship puts both at great risk. At this point, the filmmaker expertly kicks the proceedings into high gear, before concluding on a bittersweet note. Naturally, since this is a Verhoeven picture, there's plenty of wry humor and uninhibited sexuality along the way. Starting with 1985's\", 'Flesh + Blood', ', the Dutch director released an American movie every two to three years. After the poorly received', 'Hollow Man', ', however, Verhoeven took a six-year break.', 'Black Book', \", a return to his native Holland, was worth the wait. (He began work on the screenplay in the 1980s.) It works triple-time as a thriller, a tribute to Holland's Jewish population, and a poison pen letter to the Dutch opportunists who would attempt to sell them out.\", '--Kathleen C. Fennessy']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom HoffmanPaul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom Hoffman  See more', 'Language': 'Dutch (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 26 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 2.4 Ounces', 'Item model number': '3342210', 'Director': 'Paul Verhoeven', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 26 minutes', 'Release date': 'September 25, 2007', 'Actors': 'Carice van Houten, Sebastian Koch, Thom Hoffman, Halina Reijn', 'Subtitles': 'English, Spanish, French', 'Producers': 'Teun Hilte, Jos van der Linden, Frans van Gestel, San Fu Maltha, Jereon Beker', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: I'm not quite sure how I stumbled across this DVD but I sure am glad I spent this afternoon watching the 2 ½ hours of this film.  The story takes place in Holland nearing the end of World War II and the main character is a young Jewish woman, but Anne Frank this is not.  The film opens with a young woman teaching a class in an Israeli kibbutz as another woman who photographs her after exiting a tourist bus recognizes her.  Following a brief interlude, we move into flashback of over a decade earlier, 1944, and we are introduced to Rachel who lives in a farmhouse.  Immediately, we understand that Rachel is Jewish and she lives with a family that is protecting her from the Nazis.  Verhoeven creates in this film a realistic story that apparently is based on true events and since we saw Rachel in the 1956 opening scene, we know she survived WWII and emigrated from Holland to Israel.  This relieves any tension regarding her possible demise as we watch the next two hours of the film, spoiler unnecessary.<br /><br />The photography was beautiful, the acting superb, the story interesting, and it was rewarding to know that digital effects were kept at an absolute minimum in producing the film, \"Black Book.\"  Verhoeven's commentary was filled with interesting information regarding the filming as well as the history, past and more current, so I also recommend listening after viewing the film.  Details were exceptional and I was mesmerized by the makeup, although I did find it rather annoying to see van Houten always with beautiful makeup regardless of the fact that she endured some horrible experiences.  Her comfort in the naked scenes was exceptional and done very tastefully in each case.  I describe these as \"naked\" rather than \"nude\" because I really felt as though I was observing her and not watching from afar.  This film was part history, part war, part romance, part adventure, and a small part mystery.  All in all, watching this was a rewarding way to spend an afternoon.  It has given me much to think about regarding the humanity of people who demonstrate inhumane actions.  Think it's time now to see, \"The Reader.\"\nReview Title: The humanity of the inhumane\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fraulein\nReview Date: 2009/02/24\nStore: Mirjana Karanovic  (Actor),     Andrea Zogg  (Actor),     Andrea Staka  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'This is a story of the friendship among 3 Yugoslavian women. Reza left Belgrade more than 30 years ago to seek a new life in Zurich. Now in her 50s, she has completely detached herself from the past.', 'Review', \"Most people, upon reading that this is a Swiss film about women rebuilding their lives in Zurich after fleeing the former Yugoslavia, will feel their eyes involuntarily rolling up into their heads.But despite the occasional sluggish passage, Fraulein is an intriguing picture about people struggling in ways that are so personal that they become universal.Ana (Marija Skaricic) is young and pretty, and has fled the Balkans without a plan she lives out of a bus station locker until she gets a job at a cafe. Her boss, Ruza (Mirjana Karanovic), is older and has had more time to adjust to her new life, adopting a hard-as-nails Germanic attitude. Another cafe employee, Mila (Ljubica Jovic), dreams of returning to Croatia where her husband is building a house. It s primarily a character study, and an excellent one. Director Andrea Staka plays the actors like a fine instrument, eliciting anxiety, pain, passion and joy that feel genuine. --Portland TribuneLOCARNO, Switzerland -- The heartache that accompanies reluctant exile as experienced by three women from the former Yugoslavia underpins Andrea Staka's poignant drama Fraulein which won the Golden Leopard for best film in competition at the Locarno International Film Festival. The film is set in Zurich, where one woman from Belgrade, in what is now Serbia, and another from a seaside town in what is now Croatia have spent about 25 years acclimating to life in Switzerland. Their carefully constructed lives are shaken by the arrival of a vivacious young woman from Sarajevo, in what is now Bosnia, who spurns the older pair's cautious way of life. The clash of viewpoints is explored in touching scenes as the three find their assumptions about survival challenged by a jolting reminder of life's unfairness. Making her feature debut, Swiss-born writer-director Staka, whose parents were Yugoslavian exiles, uses the Zurich locations evocatively, writes in-sightful dialogue and draws naturalistic acting from the principals. The result is a picture that should thrive in Europe and at art houses and suggests a bright future for the filmmaker. The contrasts be-tween the two older women are established quickly with Ruza (Mirjana Karanovic), the stern and disciplined unmarried owner of a charmless but busy diner, and Mila (Ljubica Jovic), a jovial and happily married waitress. Both long exiled, Ruza has put Belgrade behind her and is focused on being totally efficient both in her business and her joyless single life, while Mila dreams of retiring to a house on the Adriatic in Croatia. Into the diner one day comes Ana (Marija Skaricic), who drifts contentedly but proves helpful at the restaurant and is offered a job. Her high spirits and engaging willingness to break the rules, even Ruza's, endear her not only to the others in the place but also to its chilly owner. Ana brings a refreshing indifference to flags and borders, and her ability to enjoy life proves infectious. All three women begin to embrace life more until fate deals another bad hand. The scenes of expatriates torn by nostalgic yearning yet determined to make new lives are well drawn, and the sequences in which Ana helps Ruza shake off her inhibitions also have a keen edge. Skaricic and Jovic show how wisdom and joy are not determined by age. And Karanovic is moving as a woman who has buried both her emotions and any ability to connect with life beyond work until suddenly freed by youthful exuberance. --The Hollywood ReporterWar-torn countries are a popular setting for drama after all war is, perhaps unfortunately, a great dramatic device. But what of the long-term aftermath? What happens to those who flee? Set in Switzerland, this feature debut from Andrea Staka tells the story of three former Yugoslavians not focusing directly on their past but showing, through a complex character study, how that past has shaped their present. Ruza (Mirjana Karanovic) is fiftysomething Serbian, who has filled her life with daily routine. She runs a café and has no time for frivolity, or the past. She is like a piece of piano wire, which you sense could snap with disastrous consequences. One of her staff, Mila (Ljubica Jovic), is Croatian. Anxious and fussy, she dreams of a return to her homeland and frets about the money her husband is spending on their house back in the old country. Into their lives comes Ana (Marija Skaricic). Fresh from Bosnia, she lives out of a railway station locker, living fast at night, so she can bed hop for comfort. A chance encounter sees her get a job at the café, at which point she begins to reshape Ruza and Mila s routine and perception of their lives, as Ana brings a joie de vivre, even as she struggles with her own pain and past. As a character study, this feels as real as a knife cut, slicing to the heart of shattered dreams, long-forgotten hopes and aspirations which may go unfulfilled. Staka gets to the heart of things. Emotion is kept locked in a box, but when it surfaces, the joy is palpable, like a rainbow on a stormy day. Ruza finds passion and compassion, which well up like an oil strike, bursting to the surface in a blaze of glory. Life and relationships are complex Staka shows us just how much. --Amber Wilkinson, Eye for Film\"]\nAverage Rating: 3.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Pablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko JelcicPablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko Jelcic   See more', 'Language': 'German, Croatian, Serbian', 'Runtime': '1 hour and 21 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FILM1502DVD', 'Director': 'Andrea Staka', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 21 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Mirjana Karanovic, Andrea Zogg, Zdenko Jelcic, Marija Skaricic, Pablo Aguilar', 'Studio': 'Film Movement', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Mirjana Karanovic gives a stellar performance in \"Das Fraulein.\"  Actually every actor is superb and although this story leaves much to the imagination, as a lover of simplicity, I adore this character driven film.  Every frame is intentional, each action is necessary, there is not a thing wasted in this low budget production which surpasses many films that cost ten times its budget.  The audio effects were expertly done, including even the background movement of cars in a parking lot.  From a production standpoint, this was a ten.  In less than an hour and a half, we learned how humans share their lives with only a few words spoken relying on their gestures and actions to propel the story.  Where Woody Allen's characters erupt in verbose thoughts, these characters internalize, reminiscent of New Wave films.  As an example, rather than carry on about a woman watching her life go down the drain, we see her watch the sudsy water flow from the sink.  What could be a morose story becomes uplifting and I'm going to watch this again.\nReview Title: Still thinking about this superb film\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tell No One [DVD]\nReview Date: 2009/04/01\nStore: François Cluzet  (Actor),     Marie-Josée Croze  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Genre: Suspense Rating: UN Release Date: 25-NOV-2008 Media Type: DVD', 'Amazon.com', \"Based on the book by American author Harlan Coben, this French suspense thriller is one of those exhilarating word-of-mouth gems one can't to tell everyone about. Francois Cluzet stars as Alex, a pediatrician whose beloved wife, Margot (Marie-Josee Croze) was shockingly murdered eight years before. As the anniversary of her death approaches, Alex begins to receive cryptic emails and a video that seems to suggest that she is alive. The discovery of two long-buried bodies at the crime scene turn Alex into some kind of Hitchcockian Everyman, implicated in a crime he could not possibly have committed. But when he makes a mad dash from the police who visit him at his office, he seems to have signed his own confession. This synopsis doesn't even begin to hint at the genuinely exciting and surprising twists, turns, and revelations that await Alex in this Chinese box of a mystery. Brilliantly acted by an ensemble that includes Kristin Scott Thomas and French movie icon Jean Rochefort (\", 'Pardon Mon Affaire', '),', 'Tell No One', 'invites repeat viewings, the better to appreciate the intricacies of its plotting and construction. And if you think you have it figured out, there\\'s this from one character who tells Alex at a climactic point, \"Wait, there\\'s more.\"', '--Donald Liebenson', 'Review', '...it s one of the best movies of the year. --Richard Roeper, Ebert and Roeper...a top-notch thriller so twisty you may forget to breathe...Tell everyone about Tell No One. --Kenneth Turan, Los Angeles TimesVertigo meets The Fugitive by way of The Big Sleep...A labyrinth in which to get deliriously lost...It was even better the second time. --Stephen Holden, New York Times', 'See more']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Contributor': 'François Cluzet, André Dussollier, Marie-Josée Croze', 'Language': 'French, English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Media Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Run time': '2 hours and 11 minutes', 'Release date': 'March 31, 2009', 'Actors': 'François Cluzet, Marie-Josée Croze, André Dussollier', 'Studio': 'Music Box Films', 'Number of discs': '1'}\nReview Text: After receiving the DVD, I realized that I saw this film in a theater last year but never got the title.  I may forget the title, but I seldom forget a film as good as, TELL NO ONE.<br /><br />The music selections are quite interesting, often not what I would have chosen, but perfect in so many instances.  The photography is beautiful but some times the cuts didn't make sense to me -- jarring, inappropriate for the emotion, or leading me to think something was edited out.  Camera movements flowed well for the most part with some intriguing approaches.  Audio editing was done well, with a couple instances which were actually a part of the plot.  I have no criticism of the acting and found the casting to be right on, particularly with the female thug who scares me to this day.  I get queasy and flinch when thinking about her scenes and don't recall her speaking a single word.<br /><br />The plot.  Well, the plot is layered and not very predictable at all, but this film lost one star from me for not having all the layers fused.  I watched the deleted scenes and outtakes but still found sections where maybe a train couldn't drive through, but a little vehicle could pass through without difficulty.  When watching the first time and the last, I didn't get the finale without it being fed to me as it was in the end.  I watched to see if there were subliminal messages but found none, so that's a definite asset to the film, or was it?  I do like to see hints before I'm hit over the head with a payoff, but this story isn't so generous.<br /><br />In retrospect, this isn't Hitchcock, but I was frightened and did develop an interest in the characters, so I would recommend watching it from the comfort of your own home.  I think it made more sense to me in DVD format because I was able to go back and review sections to see if I'd missed something.  Oh, yes, the true love drive made for a breath of fresh air in these times.\nReview Title: Worth watching this suspenseful film\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Innocent Voices [DVD]\nReview Date: 2009/04/02\nStore: Daniel Jiménez Cacho  (Actor),     Ofelia Medina  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Based on the true story of screenwriter Oscar Torres\\'s embattled childhood in 1980\\'s El Salvador, Innocent Voices is the poignant tale of Chava, an eleven-year-old boy. Chava suddenly becomes the \"man of the house\" in a time when the government\\'s army is forcibly recruiting twelve year olds to battle against the peasant rebels of the FMLN. It is a story of life, love, the hope of peace, and the ennobling power of the human spirit.', 'Review', \"Innocent Voices is a raw, powerful portrait of childhood spent in a war zone. The images are harrowing... And the emotion feelsreal. Padilla's earnest, natural presence lends an almost documentary-style realism to Chava's plight. --Associated PressIt is at once intimate and epic. --Hollywood ReporterWe applaud the director, Luis Mandoki, for shining a light on the plight of children during wartime. --UNICEF Executive Director Ann M. Veneman\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama, Romance', 'Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Contributor': 'Ofelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adrian Alonso, Héctor Jimenez, Ana Paulina Cáceres, Gustavo Munoz, Xuna Primus, Luis Mandoki, Victor (Kino) Gonzalez, Alejandro Felipe FloresOfelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adri…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.4 inches; 3.2 Ounces', 'Director': 'Luis Mandoki', 'Media Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'April 8, 2008', 'Actors': 'Daniel Jiménez Cacho, Ofelia Medina, Guillermo Rios, Victor (Kino) Gonzalez, Jésus Ochoa', 'Subtitles': 'English', 'Studio': 'Polychrome', 'Number of discs': '1'}\nReview Text: I live in an area of the US with many immigrants from El Salvador.  I have a childhood friend who disappeared in El Salvador in the 1970's.  I know virtually nothing about the history of the country or the people, but through INNOCENT VOICES, I have learned much.  I recognized many faces, not because I know the actors, but because I see from their faces the people who experienced the civil war of their time in their country.  I feel naive about my limited historical knowledge, but I can address the filmmaking, which I think is superb.  I often say that children are magic on-screen and they are so unpredictable and pliable with a good director.  The children in this film (as well as the adults) are worth studying by young actors because they appear to lose themselves in their characters.  The language spoken of course is Spanish with English subtitles that were very well done.  The lush wooded locale was captured beautifully and the devastation caused by the armies was done by a first rate special effects team.  The wardrobe was outstanding and set design very realistic.  Mid-way through the film, I felt the pacing slow down a bit, but the film still held my interest throughout.  The characters were very well done and full bodied, so many creating a strong impression.  I consider this an historical film which brought to light a time which changed many lives and the landscape, so I now see survivors of the time from my more enlightened eyes.  For a well made film that will motivate you to think about war, love, family, resistance and survival, try INNOCENT VOICES.\nReview Title: Innocent Voices Speak So Loudly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rachel Getting Married\nReview Date: 2009/04/08\nStore: Anne Hathaway  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"When Kym (Anne Hathaway - Golden Globe Nominee, Best Actress, Motion Picture (Drama)), returns to the Buchman family home for the wedding of her sister Rachel (Rosemarie DeWitt), she brings a long history of personal crises, family conflict and tragedy along with her. The wedding couple's abundant party of friends and relations have gathered for a joyful weekend of feasting, music and love, but Kym - with her biting one-liners and flair for bombshell drama - is a catalyst for long-simmering tensions in the family dynamic. Filled with the rich and eclectic characters that remain a hallmark of Jonathan Demme's films, RACHEL GETTING MARRIED paints a heartfelt, perceptive and sometimes hilarious family portrait.\", 'Amazon.com', \"Pitched between Robert Altman's\", 'A Wedding', \"and Noah Baumbach's\", 'Margot at the Wedding', '--but more cautiously optimistic than both--', 'Rachel Getting Married', 'marks a change in course for director Jonathan Demme. Granted, few Oscar winners have walked a more diverse path. After a series of documentaries and remakes, the', 'Silence of the Lambs', \"helmer tries his hand at the intimate chamber drama. With the help of actress Anne Hathaway and screenwriter Jenny Lumet, daughter of filmmaker Sidney, he pulls it off. The festivities kick into high gear once Kym (Hathaway, with smeared eyeliner and unkempt hair) takes a break from rehab for her sister's big day. It soon transpires that Kym, who hides her wounded soul behind a veil of sarcasm, serves as the Buchman's resident black sheep. The problem goes deeper than drugs to a tragedy in which she played a part. As Kym, bride Rachel (\", 'Mad Men', \"'s Rosemary DeWitt), their parents (Bill Irwin and Debra Winger), groom Sidney (TV on the Radio's Tunde Adebimpe), and the rest of the bohemian Connecticut brood struggle with the past, the nuptials continue, graced by performances from past Demme collaborators like Sister Carol East (\", 'Something Wild', ') and Robyn Hitchcock (', 'Storefront Hitchcock', '). The hours between reception and after-party contain humor, affection, and painful revelations. In the press notes, Demme claims that he and cinematographer Declan Quinn (', 'In America', ') attempted to make a film that looked like \"The most beautiful home movie ever made.\" Using handheld cameras and believably flawed characters, they\\'ve done just that.', '--Kathleen C. Fennessy', 'Stills from', 'Rachel Getting Married', '(Click for larger image)']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Anne Hathaway', 'Language': 'Unqualified', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '5068392', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 10, 2009', 'Actors': 'Anne Hathaway', 'Dubbed': 'French', 'Subtitles': 'French', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\nReview Text: After my sister saw RACHEL GETTING MARRIED in the theater, she called me to say she had seen the best film of the year.  I never saw the film, so I watched the DVD and tried to see what my sister loved so much.  Anne Hathaway gave a stellar performance and I see why she was nominated for various awards, but I saw nothing else in the film to make me consider it with such high regard as did my sister.  For me, the story dragged and needed tighter editing.  I wasn't too fond of the camera work, but that's my humble opinion.  When the DVD finished playing, I tried watching the special features, but after a few minutes, I ejected the DVD and went on about my business.<br /><br />I'm a fan of films which concentrate on dysfunctional families.  Perhaps it makes my own family seem more normal or perhaps they give me more ammunition for taking our interactions to a new level of absurdity.  What this film lacked for me was that ammunition because there was nothing extraordinary.  In the film, we have one sister who needs to be the center of the world, or does the world simply see her as the center and everyone follows that plan?  We have a mother who is aloof, or is she simply surviving as she knows how, removed from the daily existence of those she left behind?  We have a father who only knows the path of least resistance, or is he simply being passive aggressive in order to forge ahead and keep afloat?  We have a multicultural, multiracial, multireligious gathering for a celebration that brings with it baggage of a hundred years and lives.  For Hathaway's portrayal of a young woman who is broken and unable to fix herself without bits chipping away with every move, I recommend this DVD.  That's about it for me.\nReview Title: Hathaway's performance is reason to watch\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Big Shot's Funeral\nReview Date: 2009/04/09\nStore: Donald Sutherland  (Actor),     Paul Mazursky  (Actor),     Feng Xiaogang  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'World famous film director Don Tyler (Donald Sutherland) is surrounded by hundreds of costumed extras in China\\'s fantastic Forbidden City when a creative drought hits and he has no idea where to put the camera. Tossed off the picture by his studio boss (Paul Mazursky), Tyler\\'s depression is only relieved by his unlikely friendship with down-on-his-luck cameraman YoYo (Ge You). Knowing he\\'s not well, Tyler asks his friend to plan a \"comedy funeral\" for him where people leave feeling happy, as they do at Chinese funerals of the elderly. When Tyler eventually falls into a coma, YoYo begins the task of granting Tyler\\'s last wish. However, when the costs of his spectacular funeral spin wildly out of control, can YoYo hold it all together by selling prime ad space at this unique event to be televised around the world? And more importantly for YoYo, can he convince Tyler\\'s lovely assistant Lucy (Rosamund Kwan) that he isn\\'t just selling Tyler out to the highest bidder? That\\'s the world of BIG', 'Amazon.com', 'Eastern religion collides with Western capitalism in', \"Big Shot's Funeral\", \", a satirical comedy about a cameraman named Yoyo (Ge You) hired to shoot a making-of documentary about a world-famous director (Donald Sutherland), who's creating a sequel to Bertolucci's\", 'The Last Emperor', \". When the director has a stroke and goes into a coma, the director's assistant Lucy (Rosamund Kwan) commissions Yoyo to organize the director's funeral. At a loss, Yoyo asks for help from a friend who promotes concerts--and before long the funeral has turned into a vast media spectacle with product placement running amok, so absurd that when the director recovers, he refuses to let Lucy stop the funeral because he's so enchanted.\", \"Big Shot's Funeral\", 'entertainingly mixes sweetness and dark humor as it interlaces a romance between Yoyo and Lucy with the escalating madness of the funeral.', '--Bret Fetzer']\nAverage Rating: 4.1\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Feng Xiaogang', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'April 15, 2003', 'Actors': 'Donald Sutherland, Paul Mazursky, Ge You, Rosamund Kwan', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Yang Buting, Wang Zhongjun', 'Language': 'French (Dolby Digital 2.0 Surround), Mandarin Chinese (Dolby Digital 5.1)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: What begins as a questionable film becomes an amusing story with hilarious notions.  Auteur filmmaker Tyler of the USA lays dying in China while his new best friend YoYo, a cameraman with auteur tendencies becomes determined to fulfill Tyler's final wish of a grand comedy funeral.  If you've ever made a film on a shoestring budget, you get \"it\" while watching this DVD and if you've illegally burned the DVD you're watching, you must destroy it after viewing or suffer the guilt of stealing from the filmmakers.  As a viewer who is constantly aware of product placement, this film is like a smorgasbord of products thrown on the screen in a most absurd fashion.  As a student of philosophy, I enjoyed hearing beliefs which were thrown on the screen in a most absurd fashion.  As a devotee of romance, a budding love was thrown on the screen in an even more absurd fashion with no apparent chemistry between the two parties.  Nevertheless, this film provided a laminate which actually works and provided laughs along the way, and I mean robust roars, not the more common little giggles.  Paul Mazursky, in his documentary, YIPPEE, says,  \"I am a famous movie director.\"  Mazursky's role in BIG SHOT'S FUNERAL is perfectly cast and worth the price of admission.  Donald Sutherland as Tyler is perfectly played, a man of few words, grand ideas, and a receptive but forceful personality.  I think only Peter Sellers could have been cast as successfully in the role, had he lived beyond 1980.  Actually, an aside is that Sellers had, \"In the Mood,\" played at his own funeral.  BIG SHOT'S FUNERAL was like jumping from 1970 to 2001 and skipping all the years between.  It's a film that makes you think and reflect upon the auteurs who have come and gone, leaving behind celluloid that's been the foundation for today's film students.  It helps us remember that reality television was not born of an immaculate conception.\nReview Title: \"I am a famous movie director\"\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Choke\nReview Date: 2009/04/12\nStore: Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product description', 'A SEX-ADDICTED MED-SCHOOL DROPOUT, WHO KEEPS HIS INCREASINGLY DERANGED MOTHER, IDA (HUSTON), IN AN EXPENSIVE PRIVATE MEDICALHOSPITAL BY WORKING DAYS AS A HISTORICAL REENACTOR AT A COLONIALWILLIAMSBURG THEME PARK.', 'Amazon.com', 'Not many movies about addiction and terminal illness can end up comedies, but', 'Choke', \"pulls it off. Protagonist Victor Mancini (Sam Rockwell), a disgruntled, unrepentant sex addict, works at a cheesy colonial theme park, while his dying, addled mother Ida (Anjelica Huston) thinks he's her lawyer instead of her son. Ida's doctor Paige (Kelly Macdonald,\", 'Trainspotting', ',', 'No County for Old Men', \") says the only way Victor can save his mother is to impregnate Paige for a controversial stem-cell treatment--and according to his mother's diary, Victor himself is the result of a questioable fertility experiment with a particularly intimate holy relic...by now you may have recognized the darkly satirical hand of author Chuck Palahniuk, whose prickly comic novels (\", 'Snuff', ',', 'Invisible Monsters', ',', 'Lullaby', ') smash taboos with brutal glee.', 'Choke', \"doesn't achieve the broad cultural scope or cinematic spectacle of\", 'Fight Club', ', but fans will find plenty to enjoy--consider', 'Choke', 'a more intimate examination of Palahniukian themes. Rockwell, star of', 'Confessions of a Dangerous Mind', 'and', 'Matchstick Men', ', always seems on the brink of true stardom; here he gives another freewheeling but emotionally rich performance that will add to his offbeat but compelling repertoire. The strong supporting cast, including Joel Grey, Brad William Henke (', 'Me and You and Everyone We Know', '), Bijou Phillips (', 'Hostel: Part II', '), and screenwriter/director Clark Gregg (', 'The Adventures of Sebastian Cole', ',', 'Spartan', \"), flesh out Palahniuk's caustic yet funny world.\", '--Bret Fetzer', 'Stills from', 'Choke', '(Click for larger image)']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Romance', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Release date': 'February 17, 2009', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: Chuck Palahniuk has a huge following and I'm one of those who read and/or listen to his words.  After reading CHOKE, I listened to the book on CD and was impressed by Palahniuk's reading and interview which followed.  Unfortunately, I was quite disappointed in the DVD for a number of reasons which I'll briefly describe.  For a film that was less than 90 minutes in length, it felt long in keeping my interest.  The acting was inconsistent although the characters were well developed, and I found myself wishing Sam Rockwell, not the character Victor Mancini, would actually choke and be removed from the set.  I wanted Anjelica Hutson, not the character Ida Mancini, to  walk out of the home and let someone else take the bed.  As the younger Ida, I felt she was no younger than the elder character, just dressed more darkly to convince us of her dark personality.  Paige Marshall as Kelly Macdonald worked well and the characters emotions were evident in each scene.  I thought that Beth was so benign that she could have been represented by a different actress for each of her hair styles.  Brad William Henke as Denny was so believable, especially as he caressed his rocks.  Joel Grey was superb as a stalking sexual addict in recovery.  I guess I just preferred the men in shorts in this film.  For me, the weakness of this film was in the delivery of a very serious message which was spoonfed at the end, demonstrating a weakness in the script's success in conveying the storyline on it's own.  Perhaps if I had not been familiar with Palahniuk's original work, I would not be so critical, but I can't undo what's been done.  If you have the time and interest in seeing how sexual addiction, human frailties, the symbiotic relationship between a mother and her son, lusting for love, and the reasons Victor Mancini works in a puritanical Colonial American theme park and chokes for rebirthing, monetary compensation and emotional fulfillment, then I'd recommend reading or listening to the novel instead of the film.  If you only want to spend 90 minutes, then watch the film and use your imagination.\nReview Title: I gagged on the DVD but savored the novel CHOKE\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Woman is a Woman\nReview Date: 2009/04/15\nStore: Anna Karina  (Actor),     Jean-Claude Brialy  (Actor),     Jean-Luc Godard  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['With A Woman Is a Woman (Une Femme est une femme), compulsively innovative director Jean-Luc Godard presents \"a neorealist musical, that is, a contradiction in terms.\" Featuring French superstars Anna Karina, Jean-Paul Belmondo, and Jean-Claude Brialy at their peak of adorability, A Woman Is a Woman is a sly, playful tribute to - and interrogation of - the American musical comedy, showcasing Godard#s signature wit and intellectual acumen. The film tells the story of exotic dancer Angéla (Karina) as she attempts to have a child with her unwilling lover Émile (Brialy). In the process, she finds herself torn between him and his best friend Alfred (Belmondo). A dizzying compendium of color, humor, and the music of renowned composer Michel Legrand, A Woman Is a Woman finds the young Godard at his warmest and most accessible, reveling in and scrutinizing the mechanics of his great obsession - the cinema.']\nAverage Rating: 4.4\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 5.6 Ounces', 'Director': 'Jean-Luc Godard', 'Media Format': 'Anamorphic, Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 24 minutes', 'Release date': 'June 22, 2004', 'Actors': 'Anna Karina, Jean-Claude Brialy, Jean-Paul Belmondo, Anne Collette, Nicole Berger', 'Subtitles': 'English', 'Language': 'French (Dolby Digital 2.0 Mono)', 'Studio': 'Criterion', 'Writers': 'Eric Rohmer, Jean-Luc Godard', 'Number of discs': '1'}\nReview Text: Jean-luc Godard's first color film, A WOMAN IS A WOMAN, (Une Femme est une femme) features his then wife Anna Karina, who surprised everyone with her performance.  I thought I'd watched every Godard film but came upon this DVD, and watched yesterday.  I must first state that I was disheartened by the portrayal of a young woman, her desire to have a baby, her manipulativeness, and her acceptance of demeaning treatment by her boyfriend.  Then I remembered that the film was released in 1961 and accepted it as representative of the time, sort of how I accept and love the AMC series, \"Mad Men.\"<br /><br />From the opening, we know the film was directed by Godard.  The music stops and starts.  People look into the camera or watch the actors perform.  What's a little different is his take on the Hollywood musical and the adorable approach he takes as actors break into song and dance or make comments about previous films.  From the start, we see foreshadowing as a young boy follows his mother in her place of employment, a strip club where Angela works in the afternoons.  We also expect a sort of menage a trois, with Jean Paul Belmondo (a man whom I adored years ago) entering the scene as a potential paramour of Angela.  Communication is enhanced at night by a carrying of the lamp to the books so Jean-Claude Brialy as Emile and Karina's Angela can select the books to create their outre behavior before an otherwise puritanical bedtime.<br /><br />What put this film over the top for me was the cafe scene where Belmondo selects Charles Aznavour's song, \"You've let yourself go\" (Tu t'Laisses Aller), a song so preposterous as representative of Angela that it brings the musical comedy to the next level.  I enjoyed this film and recommend that you watch it to see the beauty of 1961 in set design, wardrobe, and the reactions of the men on the street when approached, tearing down the wall between filmmaking and reality.\nReview Title: You've let yourself go, I think not\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Janie Jones\nReview Date: 2012/01/24\nStore: Abigail Breslin  (Actor),     Alessandro Nivola  (Actor),     David M. Rosenthal  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Product Description', \"Ethan Brand (Alessandro Nivola, Junebug, Face/Off) and his band are on the comeback trail when a former flame (Academy Award® nominee Elisabeth Shue, Leaving Las Vegas) drops a bomb in his lap: their 13-year-old daughter, Janie Jones (Academy Award® nominee Abigail Breslin, Little Miss Sunshine, Zombieland). Ethan refuses to believe Janie is his kid, but when her mom suddenly leaves for rehab, the child has no place to go but into the tour bus and on the road with the band. With no inclination toward fatherhood, Ethan continues his hard-living ways, leaving Janie to fend for herself in dive bars and sleazy motels along the way. As Ethan's self-destructive spiral threatens to destroy his band's future, Janie uses her own surprising musical talents to help guide him down the rocky road to redemption. Featuring original music by Gemma Hayes and Eef Barzelay - sung by Nivola and Breslin, who both give impeccably detailed performances. JANIE JONES is a rock-and-roll road movie that can t be missed.\", 'Special Features', 'Interview with JANIE JONES Team, presented by American Express', 'Interview with JANIE JONES Team, presented by American Express', 'Audio Commentary with Director and Producers', 'Audio Commentary with Director and Producers', 'Review', 'A tuneful family flick…driven by impressive lead performances.\" --Screen DailyImpeccably detailed performances. --Stephen Holden, The New York Times']\nAverage Rating: 4.2\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '24192845', 'Director': 'David M. Rosenthal', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'January 31, 2012', 'Actors': 'Abigail Breslin, Alessandro Nivola, Elisabeth Shue', 'Studio': 'Tribeca', 'Number of discs': '1'}\nReview Text: Alessandro Nivola and Abigail Breslin turn in excellent performances in [[ASIN:B005DNWE9Y Janie Jones]], the music is excellent, the production values are better than many, but the weakness here is a story that drags with holes of passivity.  The writer/director, David M. Rosenthal, came up with the narrative after he was introduced to his daughter when she was eleven and he was thirty.  The notion is very sweet, the actors are terrific and many are recognizable from television shows, but there was just something lacking which did not grab me and propel me to tell everyone they need to see the film.  The weakest scene was the trip to Ethan's mother, and my favorite framing was Ethan and Janie playing the guitar at the back of the motel.  All was predictable, the conflicts were simplistic, and although I tried to watch a second time with the commentary provided by Rosenthal and two producers, I was quickly bored.  I'm not sure about the budget for this film, but I'm certain they pulled off a presentable film without spending much.  For this reason, I've given the film three stars and appreciate that they've completed a good film economically.  My biggest criticism of the actual DVD is that I was unable to read the credits which I really, really wanted to read.  My television set is large, but the font was not crisp.  I called in a friend to check it out for me, and he agreed.  I've lent him the DVD and if he loves it, I'll update this review with his comments when it's returned to me.\nReview Title: Okay film is not memorable, but has good production values\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/27\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Fawcett', 'David Frazee', 'Ken Girotti', 'T.J. Scott', 'Grant Harvey', 'Helen Shaver', 'Aaron Morton', 'David Wellington', 'Brett Sullivan', 'Chris Grismer'], 'Producers': ['Ivan Schneeberg', 'David Fortier', 'John Fawcett', 'Graeme Manson', 'Alex Levine'], 'Starring': ['Tatiana Maslany', 'Jordan Gavaris', 'Maria Doyle Kennedy'], 'Studio': ['BBC America']}\nReview Text: Just when you think you're on top of the story and characters, you are introduced to more of both and is impossible to not think about the next episode.  Production values are excellent, too.\nReview Title: Ensemble is like a mosaic\nRating: 5.0\n--------------------------------------------------",
  "reference": "Juno (Single-Disc Edition)\nEllen Page  (Actor),     Michael Cera  (Actor),     Jason Reitman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'The word \"quirky\" has become the quick and easy way to describe films such as LITTLE MISS SUNSHINE and LARS AND THE REAL GIRL that straddle the lines between indie and studio films and comedy and drama. While JUNO fits into that same category, this distinctive dramedy is in a class all it\\'s own. Ellen Page (X-MEN: THE LAST STAND) stars as Juno, a witty teenage girl whose boredom doesn\\'t lead her to the mall. Instead, she makes a one-time trip into the arms of her best friend Paulie Bleeker (Michael Cera). When Juno discovers that she\\'s pregnant, she\\'s forced to grow up fast as she tries to find adoptive parents for her quickly growing child. Director Jason Reitman Star Ellen Page, Michael Cera, Allison Janney, J.K. Simmons, Rainn Wilson, Jason Bateman, Jennifer Garner, Olivia Thirlby Special Features: Widescreen - 1.85 Audio: Dolby Digital Surround - Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish - Optional Additional Release Material: Alternate Scenes - Deleted Scenes (11; w/ Optional Commentary) Audio Commentaries - Jason Reitman Director; Diablo Cody - Screenwriter Behind the Scenes - 1. Screen Tests 2. \"Honest to Blog! Creating JUNO\" Featurettes - 1. Cast & Crew Jam 2. Way Beyond \"Our\" Maturity Level\" 3. \"Diablo Cody is Totally Boss\" 4. \"Jason Reitman for Shizz\" Outtakes - 1. Gag Reel 2. Gag Takes.', 'Amazon.com', 'Somewhere between the sharp satire of', 'Election', 'and the rich human comedy of', 'You Can Count On Me', 'lies', 'Juno', ', a sardonic but ultimately compassionate story of a pregnant teenage girl who wants to give her baby up for adoption. Social misfit Juno (Ellen Page,', 'Hard Candy', ',', 'X-Men: The Last Stand', ') protects herself with a caustic wit, but when she gets pregnant by her friend Paulie (Michael Cera,', 'Superbad', '), Juno finds herself unwilling to terminate the pregnancy. When she chooses a couple who place a classified ad looking to adopt, Juno gets drawn further into their lives than she anticipated. But', 'Juno', 'is much more than its plot; the stylized dialogue (by screenwriter Diablo Cody) seems forced at first, but soon creates a richly textured world, greatly aided by superb performances by Page, Cera, Jennifer Garner and Jason Bateman as the prospective parents, and J.K. Simmons (', 'Spider-Man', \") and Allison Janney as Juno's father and stepmother. Director Jason Reitman (\", 'Thank You For Smoking', \") deftly keeps the movie from slipping into easy, shallow sarcasm or foundering in sentimentality. The result is smarter and funnier than you might expect from the subject matter, and warmer and more touching than you might expect from the cocky attitude. Page's performance is deceptively simple; she never asks the audience to love her, yet she effortlessly carries a movie in which she's in almost every scene. That's star power. --\", 'Bret Fetzer', 'Get to Know', 'Juno', \"'s Cast\", 'Ellen Page (Juno MacGuff)', 'Michael Cera (Paulie Bleeker)', 'Jennifer Garner (Vanessa Loring)', 'Jason Bateman (Mark Loring)', 'Allison Janney (Bren MacGuff)', 'J.K. Simmons (Mac MacGuff)', 'Beyond', 'Juno', 'Juno', 'Soundtrack', 'More from Screenwriter Diablo Cody', 'More from Fox', 'Stills from', 'Juno']\n{'Genre': 'Comedy', 'Format': 'Color, Widescreen, NTSC', 'Contributor': 'Jason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla FayJason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla Fay  See more', 'Language': 'Unqualified, Unknown (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.55 x 5.34 x 7.46 inches; 0.32 Ounces', 'Item model number': '2250687', 'Director': 'Jason Reitman', 'Media Format': 'Color, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'April 15, 2008', 'Actors': 'Ellen Page, Michael Cera, Jennifer Garner, Jason Bateman, Allison Janney', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Diablo Cody', 'Number of discs': '1'}\nWith the opening sequence, I thought I was in for a very creative film akin to \"Napolean Dynamite, \" but I was so wrong.  Though the film was not long, I felt it drag and assumed I had missed something critical perhaps while putting my hand into the popcorn or jordan almonds which I'd prepared in advance.  Every aspect of the script seemed to be contrived and the language grew thin with Juno's quips becoming boring after awhile.  The tension never actually climaxed and I was more entertained by the music than the story.  In a nutshell, this movie is far from a classic and weak in the entertainment.  I prefer my films to be more full bodied than light unless the characters or story can carry them to fruition as entertainment.\nNapolean Dynamite it's not\nRatatouille\nBrad Garrett  (Actor),     Lou Romano  (Actor),     Brad Bird  (Director),     Jan Pinkava  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'From the creators of CARS and THE INCREDIBLES comes a break-through comedy with something for everyone. With delightful new characters, experience Paris from an all-new perspective. It\\'s \"terrific movie making\" raves Leonard Maltin of ENTERTAINMENT TONIGHT. In one of Paris\\' finest restaurants, Remy, a determined young rat, dreams of becoming a renowned French chef. Torn between his family\\'s wishes and his true calling, Remy and his pal Linguini set in motion a hilarious chain of events that turns the City of Lights upside down. RATATOUILLE is a treat you\\'ll want to enjoy again and again.', 'Amazon.com', 'One key point: if you can get over the natural gag reflex of seeing hundreds of rodents swarming over a restaurant kitchen, you will be free to enjoy the glory of', 'Ratatouille', \", a delectable Pixar hit. Our hero is Remy, a French rat (voiced by Patton Oswalt) with a cultivated palate, who rises from his humble beginnings to become head chef at a Paris restaurant. How this happens is the stuff of Pixar magic, that ineffable blend of headlong comedy, seamless technology, and wonder (in the latter department, this movie's views of nighttime Paris are on a par with French cinema at its most lyrical). Director Brad Bird (\", 'The Incredibles', \") doesn't quite keep all his spinning plates in the air, but the gags are great and the animation amazingly expressive--Remy's shrugs and nods are nimbler than many flesh-and-blood actors can manage. Refreshingly, the movie's characters aren't celebrity-reliant, with the most recognizable voice coming from Peter O'Toole's snide food critic. (This fellow provides the film's sole sour note--an oddly pointed slap at critics, those craven souls who have done nothing but rave about Pixar's movies over the years.) Brad Bird's style is more quick-hit and less resonant than the approach of Pixar honcho John Lasseter, but it's hard to complain about a movie that cooks up such bountiful pleasure. --\", 'Robert Horton', 'Beyond', 'Ratatouille', 'on DVD', 'Ratatouille', 'on Blu-ray', 'Ratatouille', 'Toys & More', 'Other Classic Pixar Hits', 'Stills from', 'Ratatouille', '(Click for larger image)']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'WD05371400DVD', 'Director': 'Brad Bird, Jan Pinkava', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen, Digital Sound', 'Run time': '1 hour and 51 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Brad Garrett, Lou Romano, Patton Oswalt', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS-HD Master Audio 7.1)', 'Studio': 'DISNEY/PIXAR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAs a child, I think I would not have been scared of animated rats in the kitchen.  Mice made the most entertaining cartoon characters.  Despite my understanding the magic of animation and being that I did indeed have an unwelcome rat in my kitchen a couple years ago, the notion of rats running through the food, let alone cooking, nauseates me beyond any level of comfort and I found myself cringing throughout \"Ratatouille.\"  Each time I saw the Little Chef on the head of Linguini, I thought it as creepy as the scariest of horror films, particularly since they resembled each other in profile.  I couldn't erase from memory the vision of a three dimensional rodent I photographed running across my balcony.  Nevertheless, I think this film is an outstanding representation of an imaginative story that was successfully translated to film via the collaborative efforts of creative artists.  Mickey Mouse and Mighty Mouse never frightened me as did this film, so I can only assume that had I retained the innocence of youth, I would have been thrilled with the success of the film's heroic underdog, er rather, rat, and not repulsed.  I think kids will love this film.\nMice never scared me like Ratatouille\nI'm Not There (Two-Disc Collector's Edition)\nChristian Bale  (Actor),     David Cross  (Actor),     Todd Haynes  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n[\"Since arriving in New York City's folk music scene in the 1960s, American singer-songwriter Bob Dylan has become a major figure in popular music, influencing millions with his chart topping songs. His records have earned Grammy, Golden Globe, and Academy Awards, and he has been inducted into the Rock and Roll Hall of Fame, Nashville Songwriters Hall of Fame and Songwriters Hall of Fame.\"]\n{'Genre': 'Drama', 'Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Contributor': 'Christian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce GreenwoodChristian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce Greenwood  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.64 x 5.35 x 7.57 inches; 4 Ounces', 'Item model number': '81090', 'Director': 'Todd Haynes', 'Media Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Run time': '2 hours and 15 minutes', 'Release date': 'February 1, 2019', 'Actors': 'Christian Bale, David Cross, Charlotte Gainsbourg, Richard Gere, Bruce Greenwood', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '2'}\nBob Dylan as poet, artist, chameleon, activist and inspiration.  Language and rhythm.  The poetry and music of the man are the foundation of this film, but, \"I'm Not There,\" offers an architectural disaster built upon that base.  I'm a fan of black and white films, particularly of the fifties and sixties, genres which this attempts to mimic, so I was disappointed when scenes and characters bounced around more haphazardly than kids in the bubble room at Ikea.  Rather than go with the flow, I wanted to stop the DVD and do some research to make sense of the random personas and make some sense of chaos.  My mind set is different now than it was in decades past and I'm less impressed by free-interpretation without reason.  As a college student, I'd studied and written about the art of Bob Dylan, so his words and delivery are not unfamiliar.  I played his music on the guitar and hi-fi, in pre-iPod times.  I've been a fan for many years and have friends who were neighbors of Bob Dylan in Minnesota when he was Robert Allen Zimmerman.  I expected much from this film but basically received flashbacks of the music with allusions to times past.  I gave this film 3 stars for the following positive reasons:  1. Cate Blanchett as Jude Quinn, 2. Richie Havens in the opening scene, 3. Throw away lines that are actually Dylan's lyrics, 4. Remembering the time I had a conversation with Joan Baez at the University of Florida, and 5. The impetus to listen to Bob Dylan on my iPod, then read Allen Ginsberg.<br /><br />If you're a fan of Dylan, I recommend the film/DVD and expect that you too will find things to like even if you may not care for the assembly of this abstract interpretation of the artist as a young/er/est man.\nThe muse of the music was the times. The times, they've changed.\nMillions\nAlex Etel  (Actor),     James Nesbitt  (Actor),     Danny Boyle  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Indie & Art House\n['From legendary director Danny Boyle (Trainspotting, 28 Days Later) comes ?a family film of limitless imagination and surprising joy!? (Chicago Sun-Times)', 'It?s holiday season and seven-year-old Damian believes he?s received a divine gift from above when a suitcase filled with cash literally falls out of the sky. Damian is anxious to share the wealth with those less fortunate while his fun-loving brother Anthony would rather spend it like there?s no tomorrow! But when the loot turns out to be stolen, both the boys? plans are put to the test?with heartwarming and hilarious results.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.54 x 5.35 x 7.49 inches; 2.72 Ounces', 'Item model number': '24543198932', 'Director': 'Danny Boyle', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC, Dubbed', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 1, 2005', 'Actors': 'Alex Etel, James Nesbitt, Daisy Donovan, Lewis McGibbon, Christopher Fulford', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Fox Searchlight', 'Writers': 'Frank Cottrell Boyce', 'Number of discs': '1'}\nI don't know how I actually came to watch Danny Boyle's, \"Millions,\" but I sure am glad it came my way.  Before I realized he was the director, as I watched this film, I felt the cinematography, bright colors, and wonderful performances by children were similar to \"Slumdog Millionaire,\" which I saw last month.  Although I'm also a fan of \"Trainspotting,\" I didn't even connect Mr. Boyle to all three films until a few minutes ago.<br /><br />This story is lovely, inspiring, surprising and educational.  Each time the character Damian met a Saint, I learned a little about religion and was amazed at the delivery by this innocent young boy with his lovely and stoic face.  The older brother, Anthony was equally as excellent, showing the determination and strength of the character, but not detracting from his sometimes obscured brotherly love.  The Saints were perfect delusions and the Latter-Day \"Saints\" were not.  The plot inspires discussion and reminds me of the time my sister and I found money outside of a department store and we were fortunate enough to receive it two weeks after we turned it in to security.  Some people thought we should have kept it, but I turned it in without a second's hesitation.  I don't know if I'd do that now as an adult, particularly since well over a hundred dollars can buy a lot of goods off Amazon if you're a seasoned shopper.  Or I could donate it to charity.  Or I could keep half and donate half.<br /><br />Directing child actors is not an easy task and Danny Boyle excels time and again.  I would recommend this film for children as well as adults, followed by a \"what if\" conversation.\nDanny Boyle is all that and a bag of chips\nBlack Book\nCarice van Houten  (Actor),     Sebastian Koch  (Actor),     Paul Verhoeven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Drama\n['Product Description', \"In the darkest days of World War II, Jewish fugitives attempt to escape occupied Holland -- only to face a Nazi ambush. Rachel Stein (Carice van Houten) alone survives the attack and joins the Dutch Resistance to avenge her family. She soon confronts the ultimate test: she must infiltrate German headquarters by tempting Captain Ludwig Mÿntze (Sebastian Hoch). In the heat of passion, he uncovers her duplicity...but keeps her secret. Then Rachel's espionage reveals that a murderous traitor lurks within Resistance ranks. Unable to fully trust anyone, Rachel navigates a minefield of deception and becomes an enemy to both sides. Epic, passionate, breathtaking, Black Book relates an untold story of World War II where the distinctions between good and evil become blurred by the complexities of human nature.\", 'Amazon.com', 'As in', 'Basic Instinct', ', a lovely lady takes the lead in', 'Black Book', \", but this time Paul Verhoeven has more than cheap thrills in mind. Towards the end of WWII, Rachel Stein (the vibrant Carice von Houten), a Jewish singer, is living with a gentile family in the countryside. When Allied forces bomb the area, she's forced to flee. On her perilous journey to The Hague (Verhoeven's hometown), brunette Rachel joins the Resistance and changes her identity to blonde Ellis de Vries. Her next order of business: infiltrate Gestapo headquarters. Like many Verhoeven heroines, Rachel aces her assignment--and then some. First, she seduces the handsome Captain Müntze (Sebastian Koch,\", 'The Lives of Others', \"), then she falls in love with him. Müntze, who returns her affection, isn't what he appears to be, but their relationship puts both at great risk. At this point, the filmmaker expertly kicks the proceedings into high gear, before concluding on a bittersweet note. Naturally, since this is a Verhoeven picture, there's plenty of wry humor and uninhibited sexuality along the way. Starting with 1985's\", 'Flesh + Blood', ', the Dutch director released an American movie every two to three years. After the poorly received', 'Hollow Man', ', however, Verhoeven took a six-year break.', 'Black Book', \", a return to his native Holland, was worth the wait. (He began work on the screenplay in the 1980s.) It works triple-time as a thriller, a tribute to Holland's Jewish population, and a poison pen letter to the Dutch opportunists who would attempt to sell them out.\", '--Kathleen C. Fennessy']\n{'Genre': 'Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom HoffmanPaul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom Hoffman  See more', 'Language': 'Dutch (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 26 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 2.4 Ounces', 'Item model number': '3342210', 'Director': 'Paul Verhoeven', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 26 minutes', 'Release date': 'September 25, 2007', 'Actors': 'Carice van Houten, Sebastian Koch, Thom Hoffman, Halina Reijn', 'Subtitles': 'English, Spanish, French', 'Producers': 'Teun Hilte, Jos van der Linden, Frans van Gestel, San Fu Maltha, Jereon Beker', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI'm not quite sure how I stumbled across this DVD but I sure am glad I spent this afternoon watching the 2 ½ hours of this film.  The story takes place in Holland nearing the end of World War II and the main character is a young Jewish woman, but Anne Frank this is not.  The film opens with a young woman teaching a class in an Israeli kibbutz as another woman who photographs her after exiting a tourist bus recognizes her.  Following a brief interlude, we move into flashback of over a decade earlier, 1944, and we are introduced to Rachel who lives in a farmhouse.  Immediately, we understand that Rachel is Jewish and she lives with a family that is protecting her from the Nazis.  Verhoeven creates in this film a realistic story that apparently is based on true events and since we saw Rachel in the 1956 opening scene, we know she survived WWII and emigrated from Holland to Israel.  This relieves any tension regarding her possible demise as we watch the next two hours of the film, spoiler unnecessary.<br /><br />The photography was beautiful, the acting superb, the story interesting, and it was rewarding to know that digital effects were kept at an absolute minimum in producing the film, \"Black Book.\"  Verhoeven's commentary was filled with interesting information regarding the filming as well as the history, past and more current, so I also recommend listening after viewing the film.  Details were exceptional and I was mesmerized by the makeup, although I did find it rather annoying to see van Houten always with beautiful makeup regardless of the fact that she endured some horrible experiences.  Her comfort in the naked scenes was exceptional and done very tastefully in each case.  I describe these as \"naked\" rather than \"nude\" because I really felt as though I was observing her and not watching from afar.  This film was part history, part war, part romance, part adventure, and a small part mystery.  All in all, watching this was a rewarding way to spend an afternoon.  It has given me much to think about regarding the humanity of people who demonstrate inhumane actions.  Think it's time now to see, \"The Reader.\"\nThe humanity of the inhumane\nFraulein\nMirjana Karanovic  (Actor),     Andrea Zogg  (Actor),     Andrea Staka  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'This is a story of the friendship among 3 Yugoslavian women. Reza left Belgrade more than 30 years ago to seek a new life in Zurich. Now in her 50s, she has completely detached herself from the past.', 'Review', \"Most people, upon reading that this is a Swiss film about women rebuilding their lives in Zurich after fleeing the former Yugoslavia, will feel their eyes involuntarily rolling up into their heads.But despite the occasional sluggish passage, Fraulein is an intriguing picture about people struggling in ways that are so personal that they become universal.Ana (Marija Skaricic) is young and pretty, and has fled the Balkans without a plan she lives out of a bus station locker until she gets a job at a cafe. Her boss, Ruza (Mirjana Karanovic), is older and has had more time to adjust to her new life, adopting a hard-as-nails Germanic attitude. Another cafe employee, Mila (Ljubica Jovic), dreams of returning to Croatia where her husband is building a house. It s primarily a character study, and an excellent one. Director Andrea Staka plays the actors like a fine instrument, eliciting anxiety, pain, passion and joy that feel genuine. --Portland TribuneLOCARNO, Switzerland -- The heartache that accompanies reluctant exile as experienced by three women from the former Yugoslavia underpins Andrea Staka's poignant drama Fraulein which won the Golden Leopard for best film in competition at the Locarno International Film Festival. The film is set in Zurich, where one woman from Belgrade, in what is now Serbia, and another from a seaside town in what is now Croatia have spent about 25 years acclimating to life in Switzerland. Their carefully constructed lives are shaken by the arrival of a vivacious young woman from Sarajevo, in what is now Bosnia, who spurns the older pair's cautious way of life. The clash of viewpoints is explored in touching scenes as the three find their assumptions about survival challenged by a jolting reminder of life's unfairness. Making her feature debut, Swiss-born writer-director Staka, whose parents were Yugoslavian exiles, uses the Zurich locations evocatively, writes in-sightful dialogue and draws naturalistic acting from the principals. The result is a picture that should thrive in Europe and at art houses and suggests a bright future for the filmmaker. The contrasts be-tween the two older women are established quickly with Ruza (Mirjana Karanovic), the stern and disciplined unmarried owner of a charmless but busy diner, and Mila (Ljubica Jovic), a jovial and happily married waitress. Both long exiled, Ruza has put Belgrade behind her and is focused on being totally efficient both in her business and her joyless single life, while Mila dreams of retiring to a house on the Adriatic in Croatia. Into the diner one day comes Ana (Marija Skaricic), who drifts contentedly but proves helpful at the restaurant and is offered a job. Her high spirits and engaging willingness to break the rules, even Ruza's, endear her not only to the others in the place but also to its chilly owner. Ana brings a refreshing indifference to flags and borders, and her ability to enjoy life proves infectious. All three women begin to embrace life more until fate deals another bad hand. The scenes of expatriates torn by nostalgic yearning yet determined to make new lives are well drawn, and the sequences in which Ana helps Ruza shake off her inhibitions also have a keen edge. Skaricic and Jovic show how wisdom and joy are not determined by age. And Karanovic is moving as a woman who has buried both her emotions and any ability to connect with life beyond work until suddenly freed by youthful exuberance. --The Hollywood ReporterWar-torn countries are a popular setting for drama after all war is, perhaps unfortunately, a great dramatic device. But what of the long-term aftermath? What happens to those who flee? Set in Switzerland, this feature debut from Andrea Staka tells the story of three former Yugoslavians not focusing directly on their past but showing, through a complex character study, how that past has shaped their present. Ruza (Mirjana Karanovic) is fiftysomething Serbian, who has filled her life with daily routine. She runs a café and has no time for frivolity, or the past. She is like a piece of piano wire, which you sense could snap with disastrous consequences. One of her staff, Mila (Ljubica Jovic), is Croatian. Anxious and fussy, she dreams of a return to her homeland and frets about the money her husband is spending on their house back in the old country. Into their lives comes Ana (Marija Skaricic). Fresh from Bosnia, she lives out of a railway station locker, living fast at night, so she can bed hop for comfort. A chance encounter sees her get a job at the café, at which point she begins to reshape Ruza and Mila s routine and perception of their lives, as Ana brings a joie de vivre, even as she struggles with her own pain and past. As a character study, this feels as real as a knife cut, slicing to the heart of shattered dreams, long-forgotten hopes and aspirations which may go unfulfilled. Staka gets to the heart of things. Emotion is kept locked in a box, but when it surfaces, the joy is palpable, like a rainbow on a stormy day. Ruza finds passion and compassion, which well up like an oil strike, bursting to the surface in a blaze of glory. Life and relationships are complex Staka shows us just how much. --Amber Wilkinson, Eye for Film\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Pablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko JelcicPablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko Jelcic   See more', 'Language': 'German, Croatian, Serbian', 'Runtime': '1 hour and 21 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FILM1502DVD', 'Director': 'Andrea Staka', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 21 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Mirjana Karanovic, Andrea Zogg, Zdenko Jelcic, Marija Skaricic, Pablo Aguilar', 'Studio': 'Film Movement', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMirjana Karanovic gives a stellar performance in \"Das Fraulein.\"  Actually every actor is superb and although this story leaves much to the imagination, as a lover of simplicity, I adore this character driven film.  Every frame is intentional, each action is necessary, there is not a thing wasted in this low budget production which surpasses many films that cost ten times its budget.  The audio effects were expertly done, including even the background movement of cars in a parking lot.  From a production standpoint, this was a ten.  In less than an hour and a half, we learned how humans share their lives with only a few words spoken relying on their gestures and actions to propel the story.  Where Woody Allen's characters erupt in verbose thoughts, these characters internalize, reminiscent of New Wave films.  As an example, rather than carry on about a woman watching her life go down the drain, we see her watch the sudsy water flow from the sink.  What could be a morose story becomes uplifting and I'm going to watch this again.\nStill thinking about this superb film\nTell No One [DVD]\nFrançois Cluzet  (Actor),     Marie-Josée Croze  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Genre: Suspense Rating: UN Release Date: 25-NOV-2008 Media Type: DVD', 'Amazon.com', \"Based on the book by American author Harlan Coben, this French suspense thriller is one of those exhilarating word-of-mouth gems one can't to tell everyone about. Francois Cluzet stars as Alex, a pediatrician whose beloved wife, Margot (Marie-Josee Croze) was shockingly murdered eight years before. As the anniversary of her death approaches, Alex begins to receive cryptic emails and a video that seems to suggest that she is alive. The discovery of two long-buried bodies at the crime scene turn Alex into some kind of Hitchcockian Everyman, implicated in a crime he could not possibly have committed. But when he makes a mad dash from the police who visit him at his office, he seems to have signed his own confession. This synopsis doesn't even begin to hint at the genuinely exciting and surprising twists, turns, and revelations that await Alex in this Chinese box of a mystery. Brilliantly acted by an ensemble that includes Kristin Scott Thomas and French movie icon Jean Rochefort (\", 'Pardon Mon Affaire', '),', 'Tell No One', 'invites repeat viewings, the better to appreciate the intricacies of its plotting and construction. And if you think you have it figured out, there\\'s this from one character who tells Alex at a climactic point, \"Wait, there\\'s more.\"', '--Donald Liebenson', 'Review', '...it s one of the best movies of the year. --Richard Roeper, Ebert and Roeper...a top-notch thriller so twisty you may forget to breathe...Tell everyone about Tell No One. --Kenneth Turan, Los Angeles TimesVertigo meets The Fugitive by way of The Big Sleep...A labyrinth in which to get deliriously lost...It was even better the second time. --Stephen Holden, New York Times', 'See more']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Contributor': 'François Cluzet, André Dussollier, Marie-Josée Croze', 'Language': 'French, English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Media Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Run time': '2 hours and 11 minutes', 'Release date': 'March 31, 2009', 'Actors': 'François Cluzet, Marie-Josée Croze, André Dussollier', 'Studio': 'Music Box Films', 'Number of discs': '1'}\nAfter receiving the DVD, I realized that I saw this film in a theater last year but never got the title.  I may forget the title, but I seldom forget a film as good as, TELL NO ONE.<br /><br />The music selections are quite interesting, often not what I would have chosen, but perfect in so many instances.  The photography is beautiful but some times the cuts didn't make sense to me -- jarring, inappropriate for the emotion, or leading me to think something was edited out.  Camera movements flowed well for the most part with some intriguing approaches.  Audio editing was done well, with a couple instances which were actually a part of the plot.  I have no criticism of the acting and found the casting to be right on, particularly with the female thug who scares me to this day.  I get queasy and flinch when thinking about her scenes and don't recall her speaking a single word.<br /><br />The plot.  Well, the plot is layered and not very predictable at all, but this film lost one star from me for not having all the layers fused.  I watched the deleted scenes and outtakes but still found sections where maybe a train couldn't drive through, but a little vehicle could pass through without difficulty.  When watching the first time and the last, I didn't get the finale without it being fed to me as it was in the end.  I watched to see if there were subliminal messages but found none, so that's a definite asset to the film, or was it?  I do like to see hints before I'm hit over the head with a payoff, but this story isn't so generous.<br /><br />In retrospect, this isn't Hitchcock, but I was frightened and did develop an interest in the characters, so I would recommend watching it from the comfort of your own home.  I think it made more sense to me in DVD format because I was able to go back and review sections to see if I'd missed something.  Oh, yes, the true love drive made for a breath of fresh air in these times.\nWorth watching this suspenseful film\nInnocent Voices [DVD]\nDaniel Jiménez Cacho  (Actor),     Ofelia Medina  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Based on the true story of screenwriter Oscar Torres\\'s embattled childhood in 1980\\'s El Salvador, Innocent Voices is the poignant tale of Chava, an eleven-year-old boy. Chava suddenly becomes the \"man of the house\" in a time when the government\\'s army is forcibly recruiting twelve year olds to battle against the peasant rebels of the FMLN. It is a story of life, love, the hope of peace, and the ennobling power of the human spirit.', 'Review', \"Innocent Voices is a raw, powerful portrait of childhood spent in a war zone. The images are harrowing... And the emotion feelsreal. Padilla's earnest, natural presence lends an almost documentary-style realism to Chava's plight. --Associated PressIt is at once intimate and epic. --Hollywood ReporterWe applaud the director, Luis Mandoki, for shining a light on the plight of children during wartime. --UNICEF Executive Director Ann M. Veneman\"]\n{'Genre': 'Drama, Romance', 'Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Contributor': 'Ofelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adrian Alonso, Héctor Jimenez, Ana Paulina Cáceres, Gustavo Munoz, Xuna Primus, Luis Mandoki, Victor (Kino) Gonzalez, Alejandro Felipe FloresOfelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adri…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.4 inches; 3.2 Ounces', 'Director': 'Luis Mandoki', 'Media Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'April 8, 2008', 'Actors': 'Daniel Jiménez Cacho, Ofelia Medina, Guillermo Rios, Victor (Kino) Gonzalez, Jésus Ochoa', 'Subtitles': 'English', 'Studio': 'Polychrome', 'Number of discs': '1'}\nI live in an area of the US with many immigrants from El Salvador.  I have a childhood friend who disappeared in El Salvador in the 1970's.  I know virtually nothing about the history of the country or the people, but through INNOCENT VOICES, I have learned much.  I recognized many faces, not because I know the actors, but because I see from their faces the people who experienced the civil war of their time in their country.  I feel naive about my limited historical knowledge, but I can address the filmmaking, which I think is superb.  I often say that children are magic on-screen and they are so unpredictable and pliable with a good director.  The children in this film (as well as the adults) are worth studying by young actors because they appear to lose themselves in their characters.  The language spoken of course is Spanish with English subtitles that were very well done.  The lush wooded locale was captured beautifully and the devastation caused by the armies was done by a first rate special effects team.  The wardrobe was outstanding and set design very realistic.  Mid-way through the film, I felt the pacing slow down a bit, but the film still held my interest throughout.  The characters were very well done and full bodied, so many creating a strong impression.  I consider this an historical film which brought to light a time which changed many lives and the landscape, so I now see survivors of the time from my more enlightened eyes.  For a well made film that will motivate you to think about war, love, family, resistance and survival, try INNOCENT VOICES.\nInnocent Voices Speak So Loudly\nRachel Getting Married\nAnne Hathaway  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"When Kym (Anne Hathaway - Golden Globe Nominee, Best Actress, Motion Picture (Drama)), returns to the Buchman family home for the wedding of her sister Rachel (Rosemarie DeWitt), she brings a long history of personal crises, family conflict and tragedy along with her. The wedding couple's abundant party of friends and relations have gathered for a joyful weekend of feasting, music and love, but Kym - with her biting one-liners and flair for bombshell drama - is a catalyst for long-simmering tensions in the family dynamic. Filled with the rich and eclectic characters that remain a hallmark of Jonathan Demme's films, RACHEL GETTING MARRIED paints a heartfelt, perceptive and sometimes hilarious family portrait.\", 'Amazon.com', \"Pitched between Robert Altman's\", 'A Wedding', \"and Noah Baumbach's\", 'Margot at the Wedding', '--but more cautiously optimistic than both--', 'Rachel Getting Married', 'marks a change in course for director Jonathan Demme. Granted, few Oscar winners have walked a more diverse path. After a series of documentaries and remakes, the', 'Silence of the Lambs', \"helmer tries his hand at the intimate chamber drama. With the help of actress Anne Hathaway and screenwriter Jenny Lumet, daughter of filmmaker Sidney, he pulls it off. The festivities kick into high gear once Kym (Hathaway, with smeared eyeliner and unkempt hair) takes a break from rehab for her sister's big day. It soon transpires that Kym, who hides her wounded soul behind a veil of sarcasm, serves as the Buchman's resident black sheep. The problem goes deeper than drugs to a tragedy in which she played a part. As Kym, bride Rachel (\", 'Mad Men', \"'s Rosemary DeWitt), their parents (Bill Irwin and Debra Winger), groom Sidney (TV on the Radio's Tunde Adebimpe), and the rest of the bohemian Connecticut brood struggle with the past, the nuptials continue, graced by performances from past Demme collaborators like Sister Carol East (\", 'Something Wild', ') and Robyn Hitchcock (', 'Storefront Hitchcock', '). The hours between reception and after-party contain humor, affection, and painful revelations. In the press notes, Demme claims that he and cinematographer Declan Quinn (', 'In America', ') attempted to make a film that looked like \"The most beautiful home movie ever made.\" Using handheld cameras and believably flawed characters, they\\'ve done just that.', '--Kathleen C. Fennessy', 'Stills from', 'Rachel Getting Married', '(Click for larger image)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Anne Hathaway', 'Language': 'Unqualified', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '5068392', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 10, 2009', 'Actors': 'Anne Hathaway', 'Dubbed': 'French', 'Subtitles': 'French', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\nAfter my sister saw RACHEL GETTING MARRIED in the theater, she called me to say she had seen the best film of the year.  I never saw the film, so I watched the DVD and tried to see what my sister loved so much.  Anne Hathaway gave a stellar performance and I see why she was nominated for various awards, but I saw nothing else in the film to make me consider it with such high regard as did my sister.  For me, the story dragged and needed tighter editing.  I wasn't too fond of the camera work, but that's my humble opinion.  When the DVD finished playing, I tried watching the special features, but after a few minutes, I ejected the DVD and went on about my business.<br /><br />I'm a fan of films which concentrate on dysfunctional families.  Perhaps it makes my own family seem more normal or perhaps they give me more ammunition for taking our interactions to a new level of absurdity.  What this film lacked for me was that ammunition because there was nothing extraordinary.  In the film, we have one sister who needs to be the center of the world, or does the world simply see her as the center and everyone follows that plan?  We have a mother who is aloof, or is she simply surviving as she knows how, removed from the daily existence of those she left behind?  We have a father who only knows the path of least resistance, or is he simply being passive aggressive in order to forge ahead and keep afloat?  We have a multicultural, multiracial, multireligious gathering for a celebration that brings with it baggage of a hundred years and lives.  For Hathaway's portrayal of a young woman who is broken and unable to fix herself without bits chipping away with every move, I recommend this DVD.  That's about it for me.\nHathaway's performance is reason to watch\nBig Shot's Funeral\nDonald Sutherland  (Actor),     Paul Mazursky  (Actor),     Feng Xiaogang  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'World famous film director Don Tyler (Donald Sutherland) is surrounded by hundreds of costumed extras in China\\'s fantastic Forbidden City when a creative drought hits and he has no idea where to put the camera. Tossed off the picture by his studio boss (Paul Mazursky), Tyler\\'s depression is only relieved by his unlikely friendship with down-on-his-luck cameraman YoYo (Ge You). Knowing he\\'s not well, Tyler asks his friend to plan a \"comedy funeral\" for him where people leave feeling happy, as they do at Chinese funerals of the elderly. When Tyler eventually falls into a coma, YoYo begins the task of granting Tyler\\'s last wish. However, when the costs of his spectacular funeral spin wildly out of control, can YoYo hold it all together by selling prime ad space at this unique event to be televised around the world? And more importantly for YoYo, can he convince Tyler\\'s lovely assistant Lucy (Rosamund Kwan) that he isn\\'t just selling Tyler out to the highest bidder? That\\'s the world of BIG', 'Amazon.com', 'Eastern religion collides with Western capitalism in', \"Big Shot's Funeral\", \", a satirical comedy about a cameraman named Yoyo (Ge You) hired to shoot a making-of documentary about a world-famous director (Donald Sutherland), who's creating a sequel to Bertolucci's\", 'The Last Emperor', \". When the director has a stroke and goes into a coma, the director's assistant Lucy (Rosamund Kwan) commissions Yoyo to organize the director's funeral. At a loss, Yoyo asks for help from a friend who promotes concerts--and before long the funeral has turned into a vast media spectacle with product placement running amok, so absurd that when the director recovers, he refuses to let Lucy stop the funeral because he's so enchanted.\", \"Big Shot's Funeral\", 'entertainingly mixes sweetness and dark humor as it interlaces a romance between Yoyo and Lucy with the escalating madness of the funeral.', '--Bret Fetzer']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Feng Xiaogang', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'April 15, 2003', 'Actors': 'Donald Sutherland, Paul Mazursky, Ge You, Rosamund Kwan', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Yang Buting, Wang Zhongjun', 'Language': 'French (Dolby Digital 2.0 Surround), Mandarin Chinese (Dolby Digital 5.1)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nWhat begins as a questionable film becomes an amusing story with hilarious notions.  Auteur filmmaker Tyler of the USA lays dying in China while his new best friend YoYo, a cameraman with auteur tendencies becomes determined to fulfill Tyler's final wish of a grand comedy funeral.  If you've ever made a film on a shoestring budget, you get \"it\" while watching this DVD and if you've illegally burned the DVD you're watching, you must destroy it after viewing or suffer the guilt of stealing from the filmmakers.  As a viewer who is constantly aware of product placement, this film is like a smorgasbord of products thrown on the screen in a most absurd fashion.  As a student of philosophy, I enjoyed hearing beliefs which were thrown on the screen in a most absurd fashion.  As a devotee of romance, a budding love was thrown on the screen in an even more absurd fashion with no apparent chemistry between the two parties.  Nevertheless, this film provided a laminate which actually works and provided laughs along the way, and I mean robust roars, not the more common little giggles.  Paul Mazursky, in his documentary, YIPPEE, says,  \"I am a famous movie director.\"  Mazursky's role in BIG SHOT'S FUNERAL is perfectly cast and worth the price of admission.  Donald Sutherland as Tyler is perfectly played, a man of few words, grand ideas, and a receptive but forceful personality.  I think only Peter Sellers could have been cast as successfully in the role, had he lived beyond 1980.  Actually, an aside is that Sellers had, \"In the Mood,\" played at his own funeral.  BIG SHOT'S FUNERAL was like jumping from 1970 to 2001 and skipping all the years between.  It's a film that makes you think and reflect upon the auteurs who have come and gone, leaving behind celluloid that's been the foundation for today's film students.  It helps us remember that reality television was not born of an immaculate conception.\n\"I am a famous movie director\"\nChoke\nRated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product description', 'A SEX-ADDICTED MED-SCHOOL DROPOUT, WHO KEEPS HIS INCREASINGLY DERANGED MOTHER, IDA (HUSTON), IN AN EXPENSIVE PRIVATE MEDICALHOSPITAL BY WORKING DAYS AS A HISTORICAL REENACTOR AT A COLONIALWILLIAMSBURG THEME PARK.', 'Amazon.com', 'Not many movies about addiction and terminal illness can end up comedies, but', 'Choke', \"pulls it off. Protagonist Victor Mancini (Sam Rockwell), a disgruntled, unrepentant sex addict, works at a cheesy colonial theme park, while his dying, addled mother Ida (Anjelica Huston) thinks he's her lawyer instead of her son. Ida's doctor Paige (Kelly Macdonald,\", 'Trainspotting', ',', 'No County for Old Men', \") says the only way Victor can save his mother is to impregnate Paige for a controversial stem-cell treatment--and according to his mother's diary, Victor himself is the result of a questioable fertility experiment with a particularly intimate holy relic...by now you may have recognized the darkly satirical hand of author Chuck Palahniuk, whose prickly comic novels (\", 'Snuff', ',', 'Invisible Monsters', ',', 'Lullaby', ') smash taboos with brutal glee.', 'Choke', \"doesn't achieve the broad cultural scope or cinematic spectacle of\", 'Fight Club', ', but fans will find plenty to enjoy--consider', 'Choke', 'a more intimate examination of Palahniukian themes. Rockwell, star of', 'Confessions of a Dangerous Mind', 'and', 'Matchstick Men', ', always seems on the brink of true stardom; here he gives another freewheeling but emotionally rich performance that will add to his offbeat but compelling repertoire. The strong supporting cast, including Joel Grey, Brad William Henke (', 'Me and You and Everyone We Know', '), Bijou Phillips (', 'Hostel: Part II', '), and screenwriter/director Clark Gregg (', 'The Adventures of Sebastian Cole', ',', 'Spartan', \"), flesh out Palahniuk's caustic yet funny world.\", '--Bret Fetzer', 'Stills from', 'Choke', '(Click for larger image)']\n{'Genre': 'Romance', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Release date': 'February 17, 2009', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nChuck Palahniuk has a huge following and I'm one of those who read and/or listen to his words.  After reading CHOKE, I listened to the book on CD and was impressed by Palahniuk's reading and interview which followed.  Unfortunately, I was quite disappointed in the DVD for a number of reasons which I'll briefly describe.  For a film that was less than 90 minutes in length, it felt long in keeping my interest.  The acting was inconsistent although the characters were well developed, and I found myself wishing Sam Rockwell, not the character Victor Mancini, would actually choke and be removed from the set.  I wanted Anjelica Hutson, not the character Ida Mancini, to  walk out of the home and let someone else take the bed.  As the younger Ida, I felt she was no younger than the elder character, just dressed more darkly to convince us of her dark personality.  Paige Marshall as Kelly Macdonald worked well and the characters emotions were evident in each scene.  I thought that Beth was so benign that she could have been represented by a different actress for each of her hair styles.  Brad William Henke as Denny was so believable, especially as he caressed his rocks.  Joel Grey was superb as a stalking sexual addict in recovery.  I guess I just preferred the men in shorts in this film.  For me, the weakness of this film was in the delivery of a very serious message which was spoonfed at the end, demonstrating a weakness in the script's success in conveying the storyline on it's own.  Perhaps if I had not been familiar with Palahniuk's original work, I would not be so critical, but I can't undo what's been done.  If you have the time and interest in seeing how sexual addiction, human frailties, the symbiotic relationship between a mother and her son, lusting for love, and the reasons Victor Mancini works in a puritanical Colonial American theme park and chokes for rebirthing, monetary compensation and emotional fulfillment, then I'd recommend reading or listening to the novel instead of the film.  If you only want to spend 90 minutes, then watch the film and use your imagination.\nI gagged on the DVD but savored the novel CHOKE\nA Woman is a Woman\nAnna Karina  (Actor),     Jean-Claude Brialy  (Actor),     Jean-Luc Godard  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['With A Woman Is a Woman (Une Femme est une femme), compulsively innovative director Jean-Luc Godard presents \"a neorealist musical, that is, a contradiction in terms.\" Featuring French superstars Anna Karina, Jean-Paul Belmondo, and Jean-Claude Brialy at their peak of adorability, A Woman Is a Woman is a sly, playful tribute to - and interrogation of - the American musical comedy, showcasing Godard#s signature wit and intellectual acumen. The film tells the story of exotic dancer Angéla (Karina) as she attempts to have a child with her unwilling lover Émile (Brialy). In the process, she finds herself torn between him and his best friend Alfred (Belmondo). A dizzying compendium of color, humor, and the music of renowned composer Michel Legrand, A Woman Is a Woman finds the young Godard at his warmest and most accessible, reveling in and scrutinizing the mechanics of his great obsession - the cinema.']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 5.6 Ounces', 'Director': 'Jean-Luc Godard', 'Media Format': 'Anamorphic, Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 24 minutes', 'Release date': 'June 22, 2004', 'Actors': 'Anna Karina, Jean-Claude Brialy, Jean-Paul Belmondo, Anne Collette, Nicole Berger', 'Subtitles': 'English', 'Language': 'French (Dolby Digital 2.0 Mono)', 'Studio': 'Criterion', 'Writers': 'Eric Rohmer, Jean-Luc Godard', 'Number of discs': '1'}\nJean-luc Godard's first color film, A WOMAN IS A WOMAN, (Une Femme est une femme) features his then wife Anna Karina, who surprised everyone with her performance.  I thought I'd watched every Godard film but came upon this DVD, and watched yesterday.  I must first state that I was disheartened by the portrayal of a young woman, her desire to have a baby, her manipulativeness, and her acceptance of demeaning treatment by her boyfriend.  Then I remembered that the film was released in 1961 and accepted it as representative of the time, sort of how I accept and love the AMC series, \"Mad Men.\"<br /><br />From the opening, we know the film was directed by Godard.  The music stops and starts.  People look into the camera or watch the actors perform.  What's a little different is his take on the Hollywood musical and the adorable approach he takes as actors break into song and dance or make comments about previous films.  From the start, we see foreshadowing as a young boy follows his mother in her place of employment, a strip club where Angela works in the afternoons.  We also expect a sort of menage a trois, with Jean Paul Belmondo (a man whom I adored years ago) entering the scene as a potential paramour of Angela.  Communication is enhanced at night by a carrying of the lamp to the books so Jean-Claude Brialy as Emile and Karina's Angela can select the books to create their outre behavior before an otherwise puritanical bedtime.<br /><br />What put this film over the top for me was the cafe scene where Belmondo selects Charles Aznavour's song, \"You've let yourself go\" (Tu t'Laisses Aller), a song so preposterous as representative of Angela that it brings the musical comedy to the next level.  I enjoyed this film and recommend that you watch it to see the beauty of 1961 in set design, wardrobe, and the reactions of the men on the street when approached, tearing down the wall between filmmaking and reality.\nYou've let yourself go, I think not\nJanie Jones\nAbigail Breslin  (Actor),     Alessandro Nivola  (Actor),     David M. Rosenthal  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Product Description', \"Ethan Brand (Alessandro Nivola, Junebug, Face/Off) and his band are on the comeback trail when a former flame (Academy Award® nominee Elisabeth Shue, Leaving Las Vegas) drops a bomb in his lap: their 13-year-old daughter, Janie Jones (Academy Award® nominee Abigail Breslin, Little Miss Sunshine, Zombieland). Ethan refuses to believe Janie is his kid, but when her mom suddenly leaves for rehab, the child has no place to go but into the tour bus and on the road with the band. With no inclination toward fatherhood, Ethan continues his hard-living ways, leaving Janie to fend for herself in dive bars and sleazy motels along the way. As Ethan's self-destructive spiral threatens to destroy his band's future, Janie uses her own surprising musical talents to help guide him down the rocky road to redemption. Featuring original music by Gemma Hayes and Eef Barzelay - sung by Nivola and Breslin, who both give impeccably detailed performances. JANIE JONES is a rock-and-roll road movie that can t be missed.\", 'Special Features', 'Interview with JANIE JONES Team, presented by American Express', 'Interview with JANIE JONES Team, presented by American Express', 'Audio Commentary with Director and Producers', 'Audio Commentary with Director and Producers', 'Review', 'A tuneful family flick…driven by impressive lead performances.\" --Screen DailyImpeccably detailed performances. --Stephen Holden, The New York Times']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '24192845', 'Director': 'David M. Rosenthal', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'January 31, 2012', 'Actors': 'Abigail Breslin, Alessandro Nivola, Elisabeth Shue', 'Studio': 'Tribeca', 'Number of discs': '1'}\nAlessandro Nivola and Abigail Breslin turn in excellent performances in [[ASIN:B005DNWE9Y Janie Jones]], the music is excellent, the production values are better than many, but the weakness here is a story that drags with holes of passivity.  The writer/director, David M. Rosenthal, came up with the narrative after he was introduced to his daughter when she was eleven and he was thirty.  The notion is very sweet, the actors are terrific and many are recognizable from television shows, but there was just something lacking which did not grab me and propel me to tell everyone they need to see the film.  The weakest scene was the trip to Ethan's mother, and my favorite framing was Ethan and Janie playing the guitar at the back of the motel.  All was predictable, the conflicts were simplistic, and although I tried to watch a second time with the commentary provided by Rosenthal and two producers, I was quickly bored.  I'm not sure about the budget for this film, but I'm certain they pulled off a presentable film without spending much.  For this reason, I've given the film three stars and appreciate that they've completed a good film economically.  My biggest criticism of the actual DVD is that I was unable to read the credits which I really, really wanted to read.  My television set is large, but the font was not crisp.  I called in a friend to check it out for me, and he agreed.  I've lent him the DVD and if he loves it, I'll update this review with his comments when it's returned to me.\nOkay film is not memorable, but has good production values\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Fawcett', 'David Frazee', 'Ken Girotti', 'T.J. Scott', 'Grant Harvey', 'Helen Shaver', 'Aaron Morton', 'David Wellington', 'Brett Sullivan', 'Chris Grismer'], 'Producers': ['Ivan Schneeberg', 'David Fortier', 'John Fawcett', 'Graeme Manson', 'Alex Levine'], 'Starring': ['Tatiana Maslany', 'Jordan Gavaris', 'Maria Doyle Kennedy'], 'Studio': ['BBC America']}\nJust when you think you're on top of the story and characters, you are introduced to more of both and is impossible to not think about the next episode.  Production values are excellent, too.\nEnsemble is like a mosaic",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Juno (Single-Disc Edition)\nReview Date: 2009/01/08\nStore: Ellen Page  (Actor),     Michael Cera  (Actor),     Jason Reitman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'The word \"quirky\" has become the quick and easy way to describe films such as LITTLE MISS SUNSHINE and LARS AND THE REAL GIRL that straddle the lines between indie and studio films and comedy and drama. While JUNO fits into that same category, this distinctive dramedy is in a class all it\\'s own. Ellen Page (X-MEN: THE LAST STAND) stars as Juno, a witty teenage girl whose boredom doesn\\'t lead her to the mall. Instead, she makes a one-time trip into the arms of her best friend Paulie Bleeker (Michael Cera). When Juno discovers that she\\'s pregnant, she\\'s forced to grow up fast as she tries to find adoptive parents for her quickly growing child. Director Jason Reitman Star Ellen Page, Michael Cera, Allison Janney, J.K. Simmons, Rainn Wilson, Jason Bateman, Jennifer Garner, Olivia Thirlby Special Features: Widescreen - 1.85 Audio: Dolby Digital Surround - Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish - Optional Additional Release Material: Alternate Scenes - Deleted Scenes (11; w/ Optional Commentary) Audio Commentaries - Jason Reitman Director; Diablo Cody - Screenwriter Behind the Scenes - 1. Screen Tests 2. \"Honest to Blog! Creating JUNO\" Featurettes - 1. Cast & Crew Jam 2. Way Beyond \"Our\" Maturity Level\" 3. \"Diablo Cody is Totally Boss\" 4. \"Jason Reitman for Shizz\" Outtakes - 1. Gag Reel 2. Gag Takes.', 'Amazon.com', 'Somewhere between the sharp satire of', 'Election', 'and the rich human comedy of', 'You Can Count On Me', 'lies', 'Juno', ', a sardonic but ultimately compassionate story of a pregnant teenage girl who wants to give her baby up for adoption. Social misfit Juno (Ellen Page,', 'Hard Candy', ',', 'X-Men: The Last Stand', ') protects herself with a caustic wit, but when she gets pregnant by her friend Paulie (Michael Cera,', 'Superbad', '), Juno finds herself unwilling to terminate the pregnancy. When she chooses a couple who place a classified ad looking to adopt, Juno gets drawn further into their lives than she anticipated. But', 'Juno', 'is much more than its plot; the stylized dialogue (by screenwriter Diablo Cody) seems forced at first, but soon creates a richly textured world, greatly aided by superb performances by Page, Cera, Jennifer Garner and Jason Bateman as the prospective parents, and J.K. Simmons (', 'Spider-Man', \") and Allison Janney as Juno's father and stepmother. Director Jason Reitman (\", 'Thank You For Smoking', \") deftly keeps the movie from slipping into easy, shallow sarcasm or foundering in sentimentality. The result is smarter and funnier than you might expect from the subject matter, and warmer and more touching than you might expect from the cocky attitude. Page's performance is deceptively simple; she never asks the audience to love her, yet she effortlessly carries a movie in which she's in almost every scene. That's star power. --\", 'Bret Fetzer', 'Get to Know', 'Juno', \"'s Cast\", 'Ellen Page (Juno MacGuff)', 'Michael Cera (Paulie Bleeker)', 'Jennifer Garner (Vanessa Loring)', 'Jason Bateman (Mark Loring)', 'Allison Janney (Bren MacGuff)', 'J.K. Simmons (Mac MacGuff)', 'Beyond', 'Juno', 'Juno', 'Soundtrack', 'More from Screenwriter Diablo Cody', 'More from Fox', 'Stills from', 'Juno']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy', 'Format': 'Color, Widescreen, NTSC', 'Contributor': 'Jason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla FayJason Bateman, J.K. Simmons, Aman Johal, Michael Cera, Rainn Wilson, Jason Reitman, Eileen Pedde, Diablo Cody, Allison Janney, Olivia Thirlby, Ellen Page, Daniel Clark, Jennifer Garner, Darla Fay  See more', 'Language': 'Unqualified, Unknown (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.55 x 5.34 x 7.46 inches; 0.32 Ounces', 'Item model number': '2250687', 'Director': 'Jason Reitman', 'Media Format': 'Color, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'April 15, 2008', 'Actors': 'Ellen Page, Michael Cera, Jennifer Garner, Jason Bateman, Allison Janney', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Diablo Cody', 'Number of discs': '1'}\nReview Text: With the opening sequence, I thought I was in for a very creative film akin to \"Napolean Dynamite, \" but I was so wrong.  Though the film was not long, I felt it drag and assumed I had missed something critical perhaps while putting my hand into the popcorn or jordan almonds which I'd prepared in advance.  Every aspect of the script seemed to be contrived and the language grew thin with Juno's quips becoming boring after awhile.  The tension never actually climaxed and I was more entertained by the music than the story.  In a nutshell, this movie is far from a classic and weak in the entertainment.  I prefer my films to be more full bodied than light unless the characters or story can carry them to fruition as entertainment.\nReview Title: Napolean Dynamite it's not\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ratatouille\nReview Date: 2009/01/13\nStore: Brad Garrett  (Actor),     Lou Romano  (Actor),     Brad Bird  (Director),     Jan Pinkava  (Director)    &                   1                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: ['Product Description', 'From the creators of CARS and THE INCREDIBLES comes a break-through comedy with something for everyone. With delightful new characters, experience Paris from an all-new perspective. It\\'s \"terrific movie making\" raves Leonard Maltin of ENTERTAINMENT TONIGHT. In one of Paris\\' finest restaurants, Remy, a determined young rat, dreams of becoming a renowned French chef. Torn between his family\\'s wishes and his true calling, Remy and his pal Linguini set in motion a hilarious chain of events that turns the City of Lights upside down. RATATOUILLE is a treat you\\'ll want to enjoy again and again.', 'Amazon.com', 'One key point: if you can get over the natural gag reflex of seeing hundreds of rodents swarming over a restaurant kitchen, you will be free to enjoy the glory of', 'Ratatouille', \", a delectable Pixar hit. Our hero is Remy, a French rat (voiced by Patton Oswalt) with a cultivated palate, who rises from his humble beginnings to become head chef at a Paris restaurant. How this happens is the stuff of Pixar magic, that ineffable blend of headlong comedy, seamless technology, and wonder (in the latter department, this movie's views of nighttime Paris are on a par with French cinema at its most lyrical). Director Brad Bird (\", 'The Incredibles', \") doesn't quite keep all his spinning plates in the air, but the gags are great and the animation amazingly expressive--Remy's shrugs and nods are nimbler than many flesh-and-blood actors can manage. Refreshingly, the movie's characters aren't celebrity-reliant, with the most recognizable voice coming from Peter O'Toole's snide food critic. (This fellow provides the film's sole sour note--an oddly pointed slap at critics, those craven souls who have done nothing but rave about Pixar's movies over the years.) Brad Bird's style is more quick-hit and less resonant than the approach of Pixar honcho John Lasseter, but it's hard to complain about a movie that cooks up such bountiful pleasure. --\", 'Robert Horton', 'Beyond', 'Ratatouille', 'on DVD', 'Ratatouille', 'on Blu-ray', 'Ratatouille', 'Toys & More', 'Other Classic Pixar Hits', 'Stills from', 'Ratatouille', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'WD05371400DVD', 'Director': 'Brad Bird, Jan Pinkava', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen, Digital Sound', 'Run time': '1 hour and 51 minutes', 'Release date': 'November 6, 2007', 'Actors': 'Brad Garrett, Lou Romano, Patton Oswalt', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Unqualified (DTS-HD Master Audio 7.1)', 'Studio': 'DISNEY/PIXAR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: As a child, I think I would not have been scared of animated rats in the kitchen.  Mice made the most entertaining cartoon characters.  Despite my understanding the magic of animation and being that I did indeed have an unwelcome rat in my kitchen a couple years ago, the notion of rats running through the food, let alone cooking, nauseates me beyond any level of comfort and I found myself cringing throughout \"Ratatouille.\"  Each time I saw the Little Chef on the head of Linguini, I thought it as creepy as the scariest of horror films, particularly since they resembled each other in profile.  I couldn't erase from memory the vision of a three dimensional rodent I photographed running across my balcony.  Nevertheless, I think this film is an outstanding representation of an imaginative story that was successfully translated to film via the collaborative efforts of creative artists.  Mickey Mouse and Mighty Mouse never frightened me as did this film, so I can only assume that had I retained the innocence of youth, I would have been thrilled with the success of the film's heroic underdog, er rather, rat, and not repulsed.  I think kids will love this film.\nReview Title: Mice never scared me like Ratatouille\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: I'm Not There (Two-Disc Collector's Edition)\nReview Date: 2009/01/13\nStore: Christian Bale  (Actor),     David Cross  (Actor),     Todd Haynes  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: [\"Since arriving in New York City's folk music scene in the 1960s, American singer-songwriter Bob Dylan has become a major figure in popular music, influencing millions with his chart topping songs. His records have earned Grammy, Golden Globe, and Academy Awards, and he has been inducted into the Rock and Roll Hall of Fame, Nashville Songwriters Hall of Fame and Songwriters Hall of Fame.\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Drama', 'Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Contributor': 'Christian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce GreenwoodChristian Bale, Michelle Williams, Heath Ledger, Todd Haynes, Cate Blanchett, Edward Lachman, Richard Gere, Julianne Moore, Marcus Carl Franklin, Charlotte Gainsbourg, David Cross, Ben Whishaw, Bruce Greenwood  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.64 x 5.35 x 7.57 inches; 4 Ounces', 'Item model number': '81090', 'Director': 'Todd Haynes', 'Media Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Collector's Edition\", 'Run time': '2 hours and 15 minutes', 'Release date': 'February 1, 2019', 'Actors': 'Christian Bale, David Cross, Charlotte Gainsbourg, Richard Gere, Bruce Greenwood', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '2'}\nReview Text: Bob Dylan as poet, artist, chameleon, activist and inspiration.  Language and rhythm.  The poetry and music of the man are the foundation of this film, but, \"I'm Not There,\" offers an architectural disaster built upon that base.  I'm a fan of black and white films, particularly of the fifties and sixties, genres which this attempts to mimic, so I was disappointed when scenes and characters bounced around more haphazardly than kids in the bubble room at Ikea.  Rather than go with the flow, I wanted to stop the DVD and do some research to make sense of the random personas and make some sense of chaos.  My mind set is different now than it was in decades past and I'm less impressed by free-interpretation without reason.  As a college student, I'd studied and written about the art of Bob Dylan, so his words and delivery are not unfamiliar.  I played his music on the guitar and hi-fi, in pre-iPod times.  I've been a fan for many years and have friends who were neighbors of Bob Dylan in Minnesota when he was Robert Allen Zimmerman.  I expected much from this film but basically received flashbacks of the music with allusions to times past.  I gave this film 3 stars for the following positive reasons:  1. Cate Blanchett as Jude Quinn, 2. Richie Havens in the opening scene, 3. Throw away lines that are actually Dylan's lyrics, 4. Remembering the time I had a conversation with Joan Baez at the University of Florida, and 5. The impetus to listen to Bob Dylan on my iPod, then read Allen Ginsberg.<br /><br />If you're a fan of Dylan, I recommend the film/DVD and expect that you too will find things to like even if you may not care for the assembly of this abstract interpretation of the artist as a young/er/est man.\nReview Title: The muse of the music was the times. The times, they've changed.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Millions\nReview Date: 2009/01/27\nStore: Alex Etel  (Actor),     James Nesbitt  (Actor),     Danny Boyle  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Indie & Art House\nProduct Description: ['From legendary director Danny Boyle (Trainspotting, 28 Days Later) comes ?a family film of limitless imagination and surprising joy!? (Chicago Sun-Times)', 'It?s holiday season and seven-year-old Damian believes he?s received a divine gift from above when a suitcase filled with cash literally falls out of the sky. Damian is anxious to share the wealth with those less fortunate while his fun-loving brother Anthony would rather spend it like there?s no tomorrow! But when the loot turns out to be stolen, both the boys? plans are put to the test?with heartwarming and hilarious results.']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.54 x 5.35 x 7.49 inches; 2.72 Ounces', 'Item model number': '24543198932', 'Director': 'Danny Boyle', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC, Dubbed', 'Run time': '1 hour and 38 minutes', 'Release date': 'November 1, 2005', 'Actors': 'Alex Etel, James Nesbitt, Daisy Donovan, Lewis McGibbon, Christopher Fulford', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Fox Searchlight', 'Writers': 'Frank Cottrell Boyce', 'Number of discs': '1'}\nReview Text: I don't know how I actually came to watch Danny Boyle's, \"Millions,\" but I sure am glad it came my way.  Before I realized he was the director, as I watched this film, I felt the cinematography, bright colors, and wonderful performances by children were similar to \"Slumdog Millionaire,\" which I saw last month.  Although I'm also a fan of \"Trainspotting,\" I didn't even connect Mr. Boyle to all three films until a few minutes ago.<br /><br />This story is lovely, inspiring, surprising and educational.  Each time the character Damian met a Saint, I learned a little about religion and was amazed at the delivery by this innocent young boy with his lovely and stoic face.  The older brother, Anthony was equally as excellent, showing the determination and strength of the character, but not detracting from his sometimes obscured brotherly love.  The Saints were perfect delusions and the Latter-Day \"Saints\" were not.  The plot inspires discussion and reminds me of the time my sister and I found money outside of a department store and we were fortunate enough to receive it two weeks after we turned it in to security.  Some people thought we should have kept it, but I turned it in without a second's hesitation.  I don't know if I'd do that now as an adult, particularly since well over a hundred dollars can buy a lot of goods off Amazon if you're a seasoned shopper.  Or I could donate it to charity.  Or I could keep half and donate half.<br /><br />Directing child actors is not an easy task and Danny Boyle excels time and again.  I would recommend this film for children as well as adults, followed by a \"what if\" conversation.\nReview Title: Danny Boyle is all that and a bag of chips\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Black Book\nReview Date: 2009/02/21\nStore: Carice van Houten  (Actor),     Sebastian Koch  (Actor),     Paul Verhoeven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Drama\nProduct Description: ['Product Description', \"In the darkest days of World War II, Jewish fugitives attempt to escape occupied Holland -- only to face a Nazi ambush. Rachel Stein (Carice van Houten) alone survives the attack and joins the Dutch Resistance to avenge her family. She soon confronts the ultimate test: she must infiltrate German headquarters by tempting Captain Ludwig Mÿntze (Sebastian Hoch). In the heat of passion, he uncovers her duplicity...but keeps her secret. Then Rachel's espionage reveals that a murderous traitor lurks within Resistance ranks. Unable to fully trust anyone, Rachel navigates a minefield of deception and becomes an enemy to both sides. Epic, passionate, breathtaking, Black Book relates an untold story of World War II where the distinctions between good and evil become blurred by the complexities of human nature.\", 'Amazon.com', 'As in', 'Basic Instinct', ', a lovely lady takes the lead in', 'Black Book', \", but this time Paul Verhoeven has more than cheap thrills in mind. Towards the end of WWII, Rachel Stein (the vibrant Carice von Houten), a Jewish singer, is living with a gentile family in the countryside. When Allied forces bomb the area, she's forced to flee. On her perilous journey to The Hague (Verhoeven's hometown), brunette Rachel joins the Resistance and changes her identity to blonde Ellis de Vries. Her next order of business: infiltrate Gestapo headquarters. Like many Verhoeven heroines, Rachel aces her assignment--and then some. First, she seduces the handsome Captain Müntze (Sebastian Koch,\", 'The Lives of Others', \"), then she falls in love with him. Müntze, who returns her affection, isn't what he appears to be, but their relationship puts both at great risk. At this point, the filmmaker expertly kicks the proceedings into high gear, before concluding on a bittersweet note. Naturally, since this is a Verhoeven picture, there's plenty of wry humor and uninhibited sexuality along the way. Starting with 1985's\", 'Flesh + Blood', ', the Dutch director released an American movie every two to three years. After the poorly received', 'Hollow Man', ', however, Verhoeven took a six-year break.', 'Black Book', \", a return to his native Holland, was worth the wait. (He began work on the screenplay in the 1980s.) It works triple-time as a thriller, a tribute to Holland's Jewish population, and a poison pen letter to the Dutch opportunists who would attempt to sell them out.\", '--Kathleen C. Fennessy']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom HoffmanPaul Verhoeven, Clockwork Pictures; Egoli Tossel Films AG; Fu Works Productions, BV; Motel Films, Jos van der Linden, Sebastian Koch, Halina Reijn, Teun Hilte, Jens Meurer, Carice van Houten, San Fu Maltha, Jereon Beker, Frans van Gestel, Thom Hoffman  See more', 'Language': 'Dutch (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 26 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 2.4 Ounces', 'Item model number': '3342210', 'Director': 'Paul Verhoeven', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 26 minutes', 'Release date': 'September 25, 2007', 'Actors': 'Carice van Houten, Sebastian Koch, Thom Hoffman, Halina Reijn', 'Subtitles': 'English, Spanish, French', 'Producers': 'Teun Hilte, Jos van der Linden, Frans van Gestel, San Fu Maltha, Jereon Beker', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: I'm not quite sure how I stumbled across this DVD but I sure am glad I spent this afternoon watching the 2 ½ hours of this film.  The story takes place in Holland nearing the end of World War II and the main character is a young Jewish woman, but Anne Frank this is not.  The film opens with a young woman teaching a class in an Israeli kibbutz as another woman who photographs her after exiting a tourist bus recognizes her.  Following a brief interlude, we move into flashback of over a decade earlier, 1944, and we are introduced to Rachel who lives in a farmhouse.  Immediately, we understand that Rachel is Jewish and she lives with a family that is protecting her from the Nazis.  Verhoeven creates in this film a realistic story that apparently is based on true events and since we saw Rachel in the 1956 opening scene, we know she survived WWII and emigrated from Holland to Israel.  This relieves any tension regarding her possible demise as we watch the next two hours of the film, spoiler unnecessary.<br /><br />The photography was beautiful, the acting superb, the story interesting, and it was rewarding to know that digital effects were kept at an absolute minimum in producing the film, \"Black Book.\"  Verhoeven's commentary was filled with interesting information regarding the filming as well as the history, past and more current, so I also recommend listening after viewing the film.  Details were exceptional and I was mesmerized by the makeup, although I did find it rather annoying to see van Houten always with beautiful makeup regardless of the fact that she endured some horrible experiences.  Her comfort in the naked scenes was exceptional and done very tastefully in each case.  I describe these as \"naked\" rather than \"nude\" because I really felt as though I was observing her and not watching from afar.  This film was part history, part war, part romance, part adventure, and a small part mystery.  All in all, watching this was a rewarding way to spend an afternoon.  It has given me much to think about regarding the humanity of people who demonstrate inhumane actions.  Think it's time now to see, \"The Reader.\"\nReview Title: The humanity of the inhumane\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fraulein\nReview Date: 2009/02/24\nStore: Mirjana Karanovic  (Actor),     Andrea Zogg  (Actor),     Andrea Staka  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'This is a story of the friendship among 3 Yugoslavian women. Reza left Belgrade more than 30 years ago to seek a new life in Zurich. Now in her 50s, she has completely detached herself from the past.', 'Review', \"Most people, upon reading that this is a Swiss film about women rebuilding their lives in Zurich after fleeing the former Yugoslavia, will feel their eyes involuntarily rolling up into their heads.But despite the occasional sluggish passage, Fraulein is an intriguing picture about people struggling in ways that are so personal that they become universal.Ana (Marija Skaricic) is young and pretty, and has fled the Balkans without a plan she lives out of a bus station locker until she gets a job at a cafe. Her boss, Ruza (Mirjana Karanovic), is older and has had more time to adjust to her new life, adopting a hard-as-nails Germanic attitude. Another cafe employee, Mila (Ljubica Jovic), dreams of returning to Croatia where her husband is building a house. It s primarily a character study, and an excellent one. Director Andrea Staka plays the actors like a fine instrument, eliciting anxiety, pain, passion and joy that feel genuine. --Portland TribuneLOCARNO, Switzerland -- The heartache that accompanies reluctant exile as experienced by three women from the former Yugoslavia underpins Andrea Staka's poignant drama Fraulein which won the Golden Leopard for best film in competition at the Locarno International Film Festival. The film is set in Zurich, where one woman from Belgrade, in what is now Serbia, and another from a seaside town in what is now Croatia have spent about 25 years acclimating to life in Switzerland. Their carefully constructed lives are shaken by the arrival of a vivacious young woman from Sarajevo, in what is now Bosnia, who spurns the older pair's cautious way of life. The clash of viewpoints is explored in touching scenes as the three find their assumptions about survival challenged by a jolting reminder of life's unfairness. Making her feature debut, Swiss-born writer-director Staka, whose parents were Yugoslavian exiles, uses the Zurich locations evocatively, writes in-sightful dialogue and draws naturalistic acting from the principals. The result is a picture that should thrive in Europe and at art houses and suggests a bright future for the filmmaker. The contrasts be-tween the two older women are established quickly with Ruza (Mirjana Karanovic), the stern and disciplined unmarried owner of a charmless but busy diner, and Mila (Ljubica Jovic), a jovial and happily married waitress. Both long exiled, Ruza has put Belgrade behind her and is focused on being totally efficient both in her business and her joyless single life, while Mila dreams of retiring to a house on the Adriatic in Croatia. Into the diner one day comes Ana (Marija Skaricic), who drifts contentedly but proves helpful at the restaurant and is offered a job. Her high spirits and engaging willingness to break the rules, even Ruza's, endear her not only to the others in the place but also to its chilly owner. Ana brings a refreshing indifference to flags and borders, and her ability to enjoy life proves infectious. All three women begin to embrace life more until fate deals another bad hand. The scenes of expatriates torn by nostalgic yearning yet determined to make new lives are well drawn, and the sequences in which Ana helps Ruza shake off her inhibitions also have a keen edge. Skaricic and Jovic show how wisdom and joy are not determined by age. And Karanovic is moving as a woman who has buried both her emotions and any ability to connect with life beyond work until suddenly freed by youthful exuberance. --The Hollywood ReporterWar-torn countries are a popular setting for drama after all war is, perhaps unfortunately, a great dramatic device. But what of the long-term aftermath? What happens to those who flee? Set in Switzerland, this feature debut from Andrea Staka tells the story of three former Yugoslavians not focusing directly on their past but showing, through a complex character study, how that past has shaped their present. Ruza (Mirjana Karanovic) is fiftysomething Serbian, who has filled her life with daily routine. She runs a café and has no time for frivolity, or the past. She is like a piece of piano wire, which you sense could snap with disastrous consequences. One of her staff, Mila (Ljubica Jovic), is Croatian. Anxious and fussy, she dreams of a return to her homeland and frets about the money her husband is spending on their house back in the old country. Into their lives comes Ana (Marija Skaricic). Fresh from Bosnia, she lives out of a railway station locker, living fast at night, so she can bed hop for comfort. A chance encounter sees her get a job at the café, at which point she begins to reshape Ruza and Mila s routine and perception of their lives, as Ana brings a joie de vivre, even as she struggles with her own pain and past. As a character study, this feels as real as a knife cut, slicing to the heart of shattered dreams, long-forgotten hopes and aspirations which may go unfulfilled. Staka gets to the heart of things. Emotion is kept locked in a box, but when it surfaces, the joy is palpable, like a rainbow on a stormy day. Ruza finds passion and compassion, which well up like an oil strike, bursting to the surface in a blaze of glory. Life and relationships are complex Staka shows us just how much. --Amber Wilkinson, Eye for Film\"]\nAverage Rating: 3.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Pablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko JelcicPablo Aguilar, Kenneth Huber, Sebastian Krahenbuehl, Annette Wunsch, David Imhoof, Aniko Donath, Marija Skaricic, Oliver Zgorelec, Andrea Staka, Andrea Zogg, Ljubica Jovic, Mirjana Karanovic, Zdenko Jelcic   See more', 'Language': 'German, Croatian, Serbian', 'Runtime': '1 hour and 21 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FILM1502DVD', 'Director': 'Andrea Staka', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 21 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Mirjana Karanovic, Andrea Zogg, Zdenko Jelcic, Marija Skaricic, Pablo Aguilar', 'Studio': 'Film Movement', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Mirjana Karanovic gives a stellar performance in \"Das Fraulein.\"  Actually every actor is superb and although this story leaves much to the imagination, as a lover of simplicity, I adore this character driven film.  Every frame is intentional, each action is necessary, there is not a thing wasted in this low budget production which surpasses many films that cost ten times its budget.  The audio effects were expertly done, including even the background movement of cars in a parking lot.  From a production standpoint, this was a ten.  In less than an hour and a half, we learned how humans share their lives with only a few words spoken relying on their gestures and actions to propel the story.  Where Woody Allen's characters erupt in verbose thoughts, these characters internalize, reminiscent of New Wave films.  As an example, rather than carry on about a woman watching her life go down the drain, we see her watch the sudsy water flow from the sink.  What could be a morose story becomes uplifting and I'm going to watch this again.\nReview Title: Still thinking about this superb film\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tell No One [DVD]\nReview Date: 2009/04/01\nStore: François Cluzet  (Actor),     Marie-Josée Croze  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Genre: Suspense Rating: UN Release Date: 25-NOV-2008 Media Type: DVD', 'Amazon.com', \"Based on the book by American author Harlan Coben, this French suspense thriller is one of those exhilarating word-of-mouth gems one can't to tell everyone about. Francois Cluzet stars as Alex, a pediatrician whose beloved wife, Margot (Marie-Josee Croze) was shockingly murdered eight years before. As the anniversary of her death approaches, Alex begins to receive cryptic emails and a video that seems to suggest that she is alive. The discovery of two long-buried bodies at the crime scene turn Alex into some kind of Hitchcockian Everyman, implicated in a crime he could not possibly have committed. But when he makes a mad dash from the police who visit him at his office, he seems to have signed his own confession. This synopsis doesn't even begin to hint at the genuinely exciting and surprising twists, turns, and revelations that await Alex in this Chinese box of a mystery. Brilliantly acted by an ensemble that includes Kristin Scott Thomas and French movie icon Jean Rochefort (\", 'Pardon Mon Affaire', '),', 'Tell No One', 'invites repeat viewings, the better to appreciate the intricacies of its plotting and construction. And if you think you have it figured out, there\\'s this from one character who tells Alex at a climactic point, \"Wait, there\\'s more.\"', '--Donald Liebenson', 'Review', '...it s one of the best movies of the year. --Richard Roeper, Ebert and Roeper...a top-notch thriller so twisty you may forget to breathe...Tell everyone about Tell No One. --Kenneth Turan, Los Angeles TimesVertigo meets The Fugitive by way of The Big Sleep...A labyrinth in which to get deliriously lost...It was even better the second time. --Stephen Holden, New York Times', 'See more']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Contributor': 'François Cluzet, André Dussollier, Marie-Josée Croze', 'Language': 'French, English', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Media Format': 'Color, DVD, NTSC, Widescreen, Anamorphic', 'Run time': '2 hours and 11 minutes', 'Release date': 'March 31, 2009', 'Actors': 'François Cluzet, Marie-Josée Croze, André Dussollier', 'Studio': 'Music Box Films', 'Number of discs': '1'}\nReview Text: After receiving the DVD, I realized that I saw this film in a theater last year but never got the title.  I may forget the title, but I seldom forget a film as good as, TELL NO ONE.<br /><br />The music selections are quite interesting, often not what I would have chosen, but perfect in so many instances.  The photography is beautiful but some times the cuts didn't make sense to me -- jarring, inappropriate for the emotion, or leading me to think something was edited out.  Camera movements flowed well for the most part with some intriguing approaches.  Audio editing was done well, with a couple instances which were actually a part of the plot.  I have no criticism of the acting and found the casting to be right on, particularly with the female thug who scares me to this day.  I get queasy and flinch when thinking about her scenes and don't recall her speaking a single word.<br /><br />The plot.  Well, the plot is layered and not very predictable at all, but this film lost one star from me for not having all the layers fused.  I watched the deleted scenes and outtakes but still found sections where maybe a train couldn't drive through, but a little vehicle could pass through without difficulty.  When watching the first time and the last, I didn't get the finale without it being fed to me as it was in the end.  I watched to see if there were subliminal messages but found none, so that's a definite asset to the film, or was it?  I do like to see hints before I'm hit over the head with a payoff, but this story isn't so generous.<br /><br />In retrospect, this isn't Hitchcock, but I was frightened and did develop an interest in the characters, so I would recommend watching it from the comfort of your own home.  I think it made more sense to me in DVD format because I was able to go back and review sections to see if I'd missed something.  Oh, yes, the true love drive made for a breath of fresh air in these times.\nReview Title: Worth watching this suspenseful film\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Innocent Voices [DVD]\nReview Date: 2009/04/02\nStore: Daniel Jiménez Cacho  (Actor),     Ofelia Medina  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Based on the true story of screenwriter Oscar Torres\\'s embattled childhood in 1980\\'s El Salvador, Innocent Voices is the poignant tale of Chava, an eleven-year-old boy. Chava suddenly becomes the \"man of the house\" in a time when the government\\'s army is forcibly recruiting twelve year olds to battle against the peasant rebels of the FMLN. It is a story of life, love, the hope of peace, and the ennobling power of the human spirit.', 'Review', \"Innocent Voices is a raw, powerful portrait of childhood spent in a war zone. The images are harrowing... And the emotion feelsreal. Padilla's earnest, natural presence lends an almost documentary-style realism to Chava's plight. --Associated PressIt is at once intimate and epic. --Hollywood ReporterWe applaud the director, Luis Mandoki, for shining a light on the plight of children during wartime. --UNICEF Executive Director Ann M. Veneman\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama, Romance', 'Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Contributor': 'Ofelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adrian Alonso, Héctor Jimenez, Ana Paulina Cáceres, Gustavo Munoz, Xuna Primus, Luis Mandoki, Victor (Kino) Gonzalez, Alejandro Felipe FloresOfelia Medina, Leonor Varela, Jose Maria Yazpik, Guillermo Rios, Carlos Padilla, Gustavo Sanchez Parra, Andrés Marquez, Alan Andreé, Daniel Jiménez Cacho, Jorge Angel Toriello, Jésus Ochoa, Antonio Garcia, Juan Ruiz-Anchia, Juan Ruíz Anchiá, Paulina Gaytan Ruíz, Adri…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.4 inches; 3.2 Ounces', 'Director': 'Luis Mandoki', 'Media Format': 'Closed-captioned, Color, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'April 8, 2008', 'Actors': 'Daniel Jiménez Cacho, Ofelia Medina, Guillermo Rios, Victor (Kino) Gonzalez, Jésus Ochoa', 'Subtitles': 'English', 'Studio': 'Polychrome', 'Number of discs': '1'}\nReview Text: I live in an area of the US with many immigrants from El Salvador.  I have a childhood friend who disappeared in El Salvador in the 1970's.  I know virtually nothing about the history of the country or the people, but through INNOCENT VOICES, I have learned much.  I recognized many faces, not because I know the actors, but because I see from their faces the people who experienced the civil war of their time in their country.  I feel naive about my limited historical knowledge, but I can address the filmmaking, which I think is superb.  I often say that children are magic on-screen and they are so unpredictable and pliable with a good director.  The children in this film (as well as the adults) are worth studying by young actors because they appear to lose themselves in their characters.  The language spoken of course is Spanish with English subtitles that were very well done.  The lush wooded locale was captured beautifully and the devastation caused by the armies was done by a first rate special effects team.  The wardrobe was outstanding and set design very realistic.  Mid-way through the film, I felt the pacing slow down a bit, but the film still held my interest throughout.  The characters were very well done and full bodied, so many creating a strong impression.  I consider this an historical film which brought to light a time which changed many lives and the landscape, so I now see survivors of the time from my more enlightened eyes.  For a well made film that will motivate you to think about war, love, family, resistance and survival, try INNOCENT VOICES.\nReview Title: Innocent Voices Speak So Loudly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rachel Getting Married\nReview Date: 2009/04/08\nStore: Anne Hathaway  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"When Kym (Anne Hathaway - Golden Globe Nominee, Best Actress, Motion Picture (Drama)), returns to the Buchman family home for the wedding of her sister Rachel (Rosemarie DeWitt), she brings a long history of personal crises, family conflict and tragedy along with her. The wedding couple's abundant party of friends and relations have gathered for a joyful weekend of feasting, music and love, but Kym - with her biting one-liners and flair for bombshell drama - is a catalyst for long-simmering tensions in the family dynamic. Filled with the rich and eclectic characters that remain a hallmark of Jonathan Demme's films, RACHEL GETTING MARRIED paints a heartfelt, perceptive and sometimes hilarious family portrait.\", 'Amazon.com', \"Pitched between Robert Altman's\", 'A Wedding', \"and Noah Baumbach's\", 'Margot at the Wedding', '--but more cautiously optimistic than both--', 'Rachel Getting Married', 'marks a change in course for director Jonathan Demme. Granted, few Oscar winners have walked a more diverse path. After a series of documentaries and remakes, the', 'Silence of the Lambs', \"helmer tries his hand at the intimate chamber drama. With the help of actress Anne Hathaway and screenwriter Jenny Lumet, daughter of filmmaker Sidney, he pulls it off. The festivities kick into high gear once Kym (Hathaway, with smeared eyeliner and unkempt hair) takes a break from rehab for her sister's big day. It soon transpires that Kym, who hides her wounded soul behind a veil of sarcasm, serves as the Buchman's resident black sheep. The problem goes deeper than drugs to a tragedy in which she played a part. As Kym, bride Rachel (\", 'Mad Men', \"'s Rosemary DeWitt), their parents (Bill Irwin and Debra Winger), groom Sidney (TV on the Radio's Tunde Adebimpe), and the rest of the bohemian Connecticut brood struggle with the past, the nuptials continue, graced by performances from past Demme collaborators like Sister Carol East (\", 'Something Wild', ') and Robyn Hitchcock (', 'Storefront Hitchcock', '). The hours between reception and after-party contain humor, affection, and painful revelations. In the press notes, Demme claims that he and cinematographer Declan Quinn (', 'In America', ') attempted to make a film that looked like \"The most beautiful home movie ever made.\" Using handheld cameras and believably flawed characters, they\\'ve done just that.', '--Kathleen C. Fennessy', 'Stills from', 'Rachel Getting Married', '(Click for larger image)']\nAverage Rating: 4.0\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Anne Hathaway', 'Language': 'Unqualified', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '5068392', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 10, 2009', 'Actors': 'Anne Hathaway', 'Dubbed': 'French', 'Subtitles': 'French', 'Studio': 'Sony Pictures Classics', 'Number of discs': '1'}\nReview Text: After my sister saw RACHEL GETTING MARRIED in the theater, she called me to say she had seen the best film of the year.  I never saw the film, so I watched the DVD and tried to see what my sister loved so much.  Anne Hathaway gave a stellar performance and I see why she was nominated for various awards, but I saw nothing else in the film to make me consider it with such high regard as did my sister.  For me, the story dragged and needed tighter editing.  I wasn't too fond of the camera work, but that's my humble opinion.  When the DVD finished playing, I tried watching the special features, but after a few minutes, I ejected the DVD and went on about my business.<br /><br />I'm a fan of films which concentrate on dysfunctional families.  Perhaps it makes my own family seem more normal or perhaps they give me more ammunition for taking our interactions to a new level of absurdity.  What this film lacked for me was that ammunition because there was nothing extraordinary.  In the film, we have one sister who needs to be the center of the world, or does the world simply see her as the center and everyone follows that plan?  We have a mother who is aloof, or is she simply surviving as she knows how, removed from the daily existence of those she left behind?  We have a father who only knows the path of least resistance, or is he simply being passive aggressive in order to forge ahead and keep afloat?  We have a multicultural, multiracial, multireligious gathering for a celebration that brings with it baggage of a hundred years and lives.  For Hathaway's portrayal of a young woman who is broken and unable to fix herself without bits chipping away with every move, I recommend this DVD.  That's about it for me.\nReview Title: Hathaway's performance is reason to watch\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Big Shot's Funeral\nReview Date: 2009/04/09\nStore: Donald Sutherland  (Actor),     Paul Mazursky  (Actor),     Feng Xiaogang  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'World famous film director Don Tyler (Donald Sutherland) is surrounded by hundreds of costumed extras in China\\'s fantastic Forbidden City when a creative drought hits and he has no idea where to put the camera. Tossed off the picture by his studio boss (Paul Mazursky), Tyler\\'s depression is only relieved by his unlikely friendship with down-on-his-luck cameraman YoYo (Ge You). Knowing he\\'s not well, Tyler asks his friend to plan a \"comedy funeral\" for him where people leave feeling happy, as they do at Chinese funerals of the elderly. When Tyler eventually falls into a coma, YoYo begins the task of granting Tyler\\'s last wish. However, when the costs of his spectacular funeral spin wildly out of control, can YoYo hold it all together by selling prime ad space at this unique event to be televised around the world? And more importantly for YoYo, can he convince Tyler\\'s lovely assistant Lucy (Rosamund Kwan) that he isn\\'t just selling Tyler out to the highest bidder? That\\'s the world of BIG', 'Amazon.com', 'Eastern religion collides with Western capitalism in', \"Big Shot's Funeral\", \", a satirical comedy about a cameraman named Yoyo (Ge You) hired to shoot a making-of documentary about a world-famous director (Donald Sutherland), who's creating a sequel to Bertolucci's\", 'The Last Emperor', \". When the director has a stroke and goes into a coma, the director's assistant Lucy (Rosamund Kwan) commissions Yoyo to organize the director's funeral. At a loss, Yoyo asks for help from a friend who promotes concerts--and before long the funeral has turned into a vast media spectacle with product placement running amok, so absurd that when the director recovers, he refuses to let Lucy stop the funeral because he's so enchanted.\", \"Big Shot's Funeral\", 'entertainingly mixes sweetness and dark humor as it interlaces a romance between Yoyo and Lucy with the escalating madness of the funeral.', '--Bret Fetzer']\nAverage Rating: 4.1\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Feng Xiaogang', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'April 15, 2003', 'Actors': 'Donald Sutherland, Paul Mazursky, Ge You, Rosamund Kwan', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French, Portuguese', 'Producers': 'Yang Buting, Wang Zhongjun', 'Language': 'French (Dolby Digital 2.0 Surround), Mandarin Chinese (Dolby Digital 5.1)', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: What begins as a questionable film becomes an amusing story with hilarious notions.  Auteur filmmaker Tyler of the USA lays dying in China while his new best friend YoYo, a cameraman with auteur tendencies becomes determined to fulfill Tyler's final wish of a grand comedy funeral.  If you've ever made a film on a shoestring budget, you get \"it\" while watching this DVD and if you've illegally burned the DVD you're watching, you must destroy it after viewing or suffer the guilt of stealing from the filmmakers.  As a viewer who is constantly aware of product placement, this film is like a smorgasbord of products thrown on the screen in a most absurd fashion.  As a student of philosophy, I enjoyed hearing beliefs which were thrown on the screen in a most absurd fashion.  As a devotee of romance, a budding love was thrown on the screen in an even more absurd fashion with no apparent chemistry between the two parties.  Nevertheless, this film provided a laminate which actually works and provided laughs along the way, and I mean robust roars, not the more common little giggles.  Paul Mazursky, in his documentary, YIPPEE, says,  \"I am a famous movie director.\"  Mazursky's role in BIG SHOT'S FUNERAL is perfectly cast and worth the price of admission.  Donald Sutherland as Tyler is perfectly played, a man of few words, grand ideas, and a receptive but forceful personality.  I think only Peter Sellers could have been cast as successfully in the role, had he lived beyond 1980.  Actually, an aside is that Sellers had, \"In the Mood,\" played at his own funeral.  BIG SHOT'S FUNERAL was like jumping from 1970 to 2001 and skipping all the years between.  It's a film that makes you think and reflect upon the auteurs who have come and gone, leaving behind celluloid that's been the foundation for today's film students.  It helps us remember that reality television was not born of an immaculate conception.\nReview Title: \"I am a famous movie director\"\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Choke\nReview Date: 2009/04/12\nStore: Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product description', 'A SEX-ADDICTED MED-SCHOOL DROPOUT, WHO KEEPS HIS INCREASINGLY DERANGED MOTHER, IDA (HUSTON), IN AN EXPENSIVE PRIVATE MEDICALHOSPITAL BY WORKING DAYS AS A HISTORICAL REENACTOR AT A COLONIALWILLIAMSBURG THEME PARK.', 'Amazon.com', 'Not many movies about addiction and terminal illness can end up comedies, but', 'Choke', \"pulls it off. Protagonist Victor Mancini (Sam Rockwell), a disgruntled, unrepentant sex addict, works at a cheesy colonial theme park, while his dying, addled mother Ida (Anjelica Huston) thinks he's her lawyer instead of her son. Ida's doctor Paige (Kelly Macdonald,\", 'Trainspotting', ',', 'No County for Old Men', \") says the only way Victor can save his mother is to impregnate Paige for a controversial stem-cell treatment--and according to his mother's diary, Victor himself is the result of a questioable fertility experiment with a particularly intimate holy relic...by now you may have recognized the darkly satirical hand of author Chuck Palahniuk, whose prickly comic novels (\", 'Snuff', ',', 'Invisible Monsters', ',', 'Lullaby', ') smash taboos with brutal glee.', 'Choke', \"doesn't achieve the broad cultural scope or cinematic spectacle of\", 'Fight Club', ', but fans will find plenty to enjoy--consider', 'Choke', 'a more intimate examination of Palahniukian themes. Rockwell, star of', 'Confessions of a Dangerous Mind', 'and', 'Matchstick Men', ', always seems on the brink of true stardom; here he gives another freewheeling but emotionally rich performance that will add to his offbeat but compelling repertoire. The strong supporting cast, including Joel Grey, Brad William Henke (', 'Me and You and Everyone We Know', '), Bijou Phillips (', 'Hostel: Part II', '), and screenwriter/director Clark Gregg (', 'The Adventures of Sebastian Cole', ',', 'Spartan', \"), flesh out Palahniuk's caustic yet funny world.\", '--Bret Fetzer', 'Stills from', 'Choke', '(Click for larger image)']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Romance', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Release date': 'February 17, 2009', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: Chuck Palahniuk has a huge following and I'm one of those who read and/or listen to his words.  After reading CHOKE, I listened to the book on CD and was impressed by Palahniuk's reading and interview which followed.  Unfortunately, I was quite disappointed in the DVD for a number of reasons which I'll briefly describe.  For a film that was less than 90 minutes in length, it felt long in keeping my interest.  The acting was inconsistent although the characters were well developed, and I found myself wishing Sam Rockwell, not the character Victor Mancini, would actually choke and be removed from the set.  I wanted Anjelica Hutson, not the character Ida Mancini, to  walk out of the home and let someone else take the bed.  As the younger Ida, I felt she was no younger than the elder character, just dressed more darkly to convince us of her dark personality.  Paige Marshall as Kelly Macdonald worked well and the characters emotions were evident in each scene.  I thought that Beth was so benign that she could have been represented by a different actress for each of her hair styles.  Brad William Henke as Denny was so believable, especially as he caressed his rocks.  Joel Grey was superb as a stalking sexual addict in recovery.  I guess I just preferred the men in shorts in this film.  For me, the weakness of this film was in the delivery of a very serious message which was spoonfed at the end, demonstrating a weakness in the script's success in conveying the storyline on it's own.  Perhaps if I had not been familiar with Palahniuk's original work, I would not be so critical, but I can't undo what's been done.  If you have the time and interest in seeing how sexual addiction, human frailties, the symbiotic relationship between a mother and her son, lusting for love, and the reasons Victor Mancini works in a puritanical Colonial American theme park and chokes for rebirthing, monetary compensation and emotional fulfillment, then I'd recommend reading or listening to the novel instead of the film.  If you only want to spend 90 minutes, then watch the film and use your imagination.\nReview Title: I gagged on the DVD but savored the novel CHOKE\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Woman is a Woman\nReview Date: 2009/04/15\nStore: Anna Karina  (Actor),     Jean-Claude Brialy  (Actor),     Jean-Luc Godard  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['With A Woman Is a Woman (Une Femme est une femme), compulsively innovative director Jean-Luc Godard presents \"a neorealist musical, that is, a contradiction in terms.\" Featuring French superstars Anna Karina, Jean-Paul Belmondo, and Jean-Claude Brialy at their peak of adorability, A Woman Is a Woman is a sly, playful tribute to - and interrogation of - the American musical comedy, showcasing Godard#s signature wit and intellectual acumen. The film tells the story of exotic dancer Angéla (Karina) as she attempts to have a child with her unwilling lover Émile (Brialy). In the process, she finds herself torn between him and his best friend Alfred (Belmondo). A dizzying compendium of color, humor, and the music of renowned composer Michel Legrand, A Woman Is a Woman finds the young Godard at his warmest and most accessible, reveling in and scrutinizing the mechanics of his great obsession - the cinema.']\nAverage Rating: 4.4\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 5.6 Ounces', 'Director': 'Jean-Luc Godard', 'Media Format': 'Anamorphic, Color, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 24 minutes', 'Release date': 'June 22, 2004', 'Actors': 'Anna Karina, Jean-Claude Brialy, Jean-Paul Belmondo, Anne Collette, Nicole Berger', 'Subtitles': 'English', 'Language': 'French (Dolby Digital 2.0 Mono)', 'Studio': 'Criterion', 'Writers': 'Eric Rohmer, Jean-Luc Godard', 'Number of discs': '1'}\nReview Text: Jean-luc Godard's first color film, A WOMAN IS A WOMAN, (Une Femme est une femme) features his then wife Anna Karina, who surprised everyone with her performance.  I thought I'd watched every Godard film but came upon this DVD, and watched yesterday.  I must first state that I was disheartened by the portrayal of a young woman, her desire to have a baby, her manipulativeness, and her acceptance of demeaning treatment by her boyfriend.  Then I remembered that the film was released in 1961 and accepted it as representative of the time, sort of how I accept and love the AMC series, \"Mad Men.\"<br /><br />From the opening, we know the film was directed by Godard.  The music stops and starts.  People look into the camera or watch the actors perform.  What's a little different is his take on the Hollywood musical and the adorable approach he takes as actors break into song and dance or make comments about previous films.  From the start, we see foreshadowing as a young boy follows his mother in her place of employment, a strip club where Angela works in the afternoons.  We also expect a sort of menage a trois, with Jean Paul Belmondo (a man whom I adored years ago) entering the scene as a potential paramour of Angela.  Communication is enhanced at night by a carrying of the lamp to the books so Jean-Claude Brialy as Emile and Karina's Angela can select the books to create their outre behavior before an otherwise puritanical bedtime.<br /><br />What put this film over the top for me was the cafe scene where Belmondo selects Charles Aznavour's song, \"You've let yourself go\" (Tu t'Laisses Aller), a song so preposterous as representative of Angela that it brings the musical comedy to the next level.  I enjoyed this film and recommend that you watch it to see the beauty of 1961 in set design, wardrobe, and the reactions of the men on the street when approached, tearing down the wall between filmmaking and reality.\nReview Title: You've let yourself go, I think not\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Janie Jones\nReview Date: 2012/01/24\nStore: Abigail Breslin  (Actor),     Alessandro Nivola  (Actor),     David M. Rosenthal  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Product Description', 'Product Description', \"Ethan Brand (Alessandro Nivola, Junebug, Face/Off) and his band are on the comeback trail when a former flame (Academy Award® nominee Elisabeth Shue, Leaving Las Vegas) drops a bomb in his lap: their 13-year-old daughter, Janie Jones (Academy Award® nominee Abigail Breslin, Little Miss Sunshine, Zombieland). Ethan refuses to believe Janie is his kid, but when her mom suddenly leaves for rehab, the child has no place to go but into the tour bus and on the road with the band. With no inclination toward fatherhood, Ethan continues his hard-living ways, leaving Janie to fend for herself in dive bars and sleazy motels along the way. As Ethan's self-destructive spiral threatens to destroy his band's future, Janie uses her own surprising musical talents to help guide him down the rocky road to redemption. Featuring original music by Gemma Hayes and Eef Barzelay - sung by Nivola and Breslin, who both give impeccably detailed performances. JANIE JONES is a rock-and-roll road movie that can t be missed.\", 'Special Features', 'Interview with JANIE JONES Team, presented by American Express', 'Interview with JANIE JONES Team, presented by American Express', 'Audio Commentary with Director and Producers', 'Audio Commentary with Director and Producers', 'Review', 'A tuneful family flick…driven by impressive lead performances.\" --Screen DailyImpeccably detailed performances. --Stephen Holden, The New York Times']\nAverage Rating: 4.2\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '24192845', 'Director': 'David M. Rosenthal', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'January 31, 2012', 'Actors': 'Abigail Breslin, Alessandro Nivola, Elisabeth Shue', 'Studio': 'Tribeca', 'Number of discs': '1'}\nReview Text: Alessandro Nivola and Abigail Breslin turn in excellent performances in [[ASIN:B005DNWE9Y Janie Jones]], the music is excellent, the production values are better than many, but the weakness here is a story that drags with holes of passivity.  The writer/director, David M. Rosenthal, came up with the narrative after he was introduced to his daughter when she was eleven and he was thirty.  The notion is very sweet, the actors are terrific and many are recognizable from television shows, but there was just something lacking which did not grab me and propel me to tell everyone they need to see the film.  The weakest scene was the trip to Ethan's mother, and my favorite framing was Ethan and Janie playing the guitar at the back of the motel.  All was predictable, the conflicts were simplistic, and although I tried to watch a second time with the commentary provided by Rosenthal and two producers, I was quickly bored.  I'm not sure about the budget for this film, but I'm certain they pulled off a presentable film without spending much.  For this reason, I've given the film three stars and appreciate that they've completed a good film economically.  My biggest criticism of the actual DVD is that I was unable to read the credits which I really, really wanted to read.  My television set is large, but the font was not crisp.  I called in a friend to check it out for me, and he agreed.  I've lent him the DVD and if he loves it, I'll update this review with his comments when it's returned to me.\nReview Title: Okay film is not memorable, but has good production values\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/27\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Fawcett', 'David Frazee', 'Ken Girotti', 'T.J. Scott', 'Grant Harvey', 'Helen Shaver', 'Aaron Morton', 'David Wellington', 'Brett Sullivan', 'Chris Grismer'], 'Producers': ['Ivan Schneeberg', 'David Fortier', 'John Fawcett', 'Graeme Manson', 'Alex Levine'], 'Starring': ['Tatiana Maslany', 'Jordan Gavaris', 'Maria Doyle Kennedy'], 'Studio': ['BBC America']}\nReview Text: Just when you think you're on top of the story and characters, you are introduced to more of both and is impossible to not think about the next episode.  Production values are excellent, too.\nReview Title: Ensemble is like a mosaic\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user exhibits a clear preference for engaging films with strong narratives and character-driven stories. They particularly enjoyed performances that showcased depth and complexity, highlighting stellar portrayals and the chemistry between actors. The user appreciated films with imaginative direction and unique storytelling techniques, often celebrating how visual and narrative artistry can elevate the viewing experience. Several mentions of well-executed cinematography and memorable soundtracks speak to their enjoyment of films that offer a vibrant sensory experience.\n\nNEGATIVE SUMMARY:\nThe user expressed disappointment regarding specific narratives that they found lacking in coherence or drive. They criticized films for feeling overly long or dragging without sufficient character development, leading to feelings of frustration. The user also noted instances where they found the humor or themes less effective, particularly when they felt the execution did not live up to the source material or expectations set by the film's premise. Some reviews indicate dissatisfaction with aspects such as editing, pacing, and certain performances that detracted from the overall enjoyment.\n\nOVERALL SUMMARY:\nThe user's purchasing habits reflect a blend of appreciation for both poignant storytelling and discontent with films that miss the mark. They display admiration for character depth and striking performances while simultaneously critiquing narratives that lack momentum or clear direction. The contrasting reactions to various films highlight a discerning taste, favoring thoughtful, innovative storytelling over conventional or predictable plots. While positive experiences dominate, their feedback underscores a need for strong narrative cohesion and genuine character engagement in their viewing preferences.",
  "target_interaction": {
    "rating": 5.0,
    "title": "A classic to rival Citizen Kane",
    "text": "Perhaps my favorite movie of all times, this is a brilliant satire mockumentary that is unsurpassed in its genre. Each actor is perfectly cat, the narrative is hysterical and the dogs are better than any I've worked with. I don't know a single person who did not become enchanted by Best in Show. The only problem is that I fond myself quoting lines under the most unusual circumstances, even if I'm the only pong that gets it.",
    "images": [],
    "asin": "B008Q0C5I6",
    "parent_asin": "B008Q0C5I6",
    "user_id": "AGCA64OUVM2TJGNN3IUXMEU7KF6Q",
    "timestamp": "2016-07-24 02:37:12",
    "helpful_vote": 10,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.6,
    "rating_number": 13805,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9773bbbc34eb98a12eda06e48add2943e17e5b0ce6ad7bd50c2d94382cacf36a._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9773bbbc34eb98a12eda06e48add2943e17e5b0ce6ad7bd50c2d94382cacf36a._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9773bbbc34eb98a12eda06e48add2943e17e5b0ce6ad7bd50c2d94382cacf36a._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9773bbbc34eb98a12eda06e48add2943e17e5b0ce6ad7bd50c2d94382cacf36a._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9773bbbc34eb98a12eda06e48add2943e17e5b0ce6ad7bd50c2d94382cacf36a._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/9773bbbc34eb98a12eda06e48add2943e17e5b0ce6ad7bd50c2d94382cacf36a._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "alcohol use",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English",
        "English [Audio Description]"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Christopher Guest"
      ],
      "Producers": [
        "Karen Murphy"
      ],
      "Starring": [
        "Jennifer Coolidge",
        "Christopher Guest",
        "John Michael Higgins"
      ],
      "Studio": [
        "WARNER BROS."
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}