{
  "user_id": "AH4IB62EYR2M5H5CF2ZSEI5YSIRA",
  "summary": "=== Purchase Information ===\nProduct Title: Columbo - The Complete Fifth Season\nReview Date: 2006/11/15\nStore: Peter Falk  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', \"Peter Falk dons his famous trenchcoat again as he returns in his 4-time Emmy award-winning role as everyone's favorite Police Lieutenant in Columbo: The Complete Fifth Season! Join Columbo in this three-disc set as he asks all the right questions in some of the most deceptive and deadly cases. The Fascinating Fifth season also features such brilliant guest stars as Janet Leigh, Sal Mineo, Robert Vaughn, Ricardo Montalban, Hector Elizondo, Robert Loggia, Patrick McGoohan, and more. The landmark crime series returns, and no murderer can hide for long with Columbo on the beat!\", 'Bonus Content:', 'Disc 1:', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', ']]>', 'Amazon.com', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show\\x92s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn\\x92s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set\\x92s sole extra.', '--Paul Gaita', 'Review', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set s sole extra.', '--Paul Gaita', '--Amazon.com', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Peter Falk', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.28 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '8 hours and 49 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Peter Falk', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: This package of Columbo is as good as the previously released version.  This is wonderful to enjoy Columbo at any time and a choice of shows.  I cannot wait until the other shows are released.  I am a Columbo fan, and this package and the others I have purchased have been GREAT!\nReview Title: Good Collection\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Rockford Files - Season Two\nReview Date: 2006/11/15\nStore: James Garner  (Actor),     Noah Beery, Jr.  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Product Description', \"Jim Rockford is back and better than ever in all 22 Season Two episodes of the celebrated detective hit The Rockford Files. Join James Garner in his breakout Emmy-winning role as the cool, calm and collected ex-con-turned-detective who loves to mouth off but avoids using his fists at all costs. He takes his time, but always solves the crime - whether it be blackmail, theft, scams or murder! Along for the ride on this five-time Emmy-winning series are such stellar guest stars as Rob Reiner, Louis Gossett Jr., Linda Evans, Isaac Hayes and Dick Butkus. Also included for the first time on DVD is the original series pilot. With his no-nonsense approach and wisecracking wit, it's no mystery that Rockford always gets his man.Bonus Content:\", 'Disc 6:', 'Stephen J. Cannell On-Camera Interview', 'Stephen J. Cannell On-Camera Interview', 'Bonus Episode: The Rockford Files Series Pilot', 'Bonus Episode: The Rockford Files Series Pilot', 'Amazon.com', '\"The best detective series ever,\" according to', 'TV Guide', ', the second', 'Rockford Files', 'set begins at the beginning. That\\'s because the double-length pilot (\"Backlash of the Hunter\") appears as an extra. In this episode, Jim Rockford (James Garner) explains to guest star Lindsay Wagner, \"I only handle criminal cases that are closed.\" The first Rockford file also introduces his errant father, Rocky (Robert Donley, who\\'ll soon be replaced by Noah Beery Jr.), detective buddy Dennis (Joe Santos,', 'The Sopranos', '), and squirrelly pal Angel (Emmy winner Stuart Margolin) with whom he did time at San Quentin (before being granted a full pardon). Season two highlights include the two-part \"Gearjammers,\" in which Rockford discovers his dad\\'s secret life, \"Chicken Little Is a Little Chicken,\" in which Rockford helps Angel fake his death, and \"The Hammer of C Block,\" with Isaac \"Shaft\" Hayes as a former cellmate who just can\\'t get his name straight\\x97he thinks it\\'s \"Rockfish.\" (The Oscar-winning Hayes also contributes an original number called \"Gandy\\'s Theme.\") Even when the episodes are less memorable, Garner\\'s easygoing Oklahoma charm and potent chemistry with his co-stars, including lawyer/ex-girlfriend girlfriend Beth (Gretchen Corbett), makes each one worth watching. Like most Stephen J. Cannell programs (', 'Baretta', ',', '21 Jump Street', ', etc.),', 'The Rockford Files', 'never had any difficulty attracting famous (and soon-to-be-famous) guests. The second year claims such notables as Linda Evans (\"The Farnsworth Stratagem\"), Stefanie Powers (\"The Real Easy Red Dog\"), Blair Brown (\"The Girl in the Bay City Boys Club\"), Rob Reiner (\"The No-Cut Contract\"), and Louis Gossett Jr. (\"Foul on the First Play\\'). The only other bonus feature is a short, if informative interview with Cannell, who reveals that the character of Joseph \"Rocky\" Rockford was modeled after his own father.', '--Kathleen C. Fennessy']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'James Garner, Joe Santos, Noah Beery, Jr., Stuart Margolin', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '18 hours and 29 minutes', 'Release date': 'June 13, 2006', 'Actors': 'James Garner, Noah Beery, Jr., Joe Santos, Stuart Margolin', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '6'}\nReview Text: I have truly enjoyed watching the Rockford Files. This was one of my favorites shows on television and to have this collection is great.  It is Rockford at his best.  I am waiting for the release of the next season.\nReview Title: Rockford Files are the Best\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Adventures of Superman: The Complete Third & Fourth Seasons\nReview Date: 2006/11/15\nStore: George Reeves  (Actor),     Phyllis Coates  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['Adventures of Superman, The Complete 3rd & 4th Seasons (DVD) (Multi-Title)', \"George Reeves returns as Superman (aka Clark Kent) in 26 episodes comprising Season 3 and Season 4 of the program that ran six seasons total. This time his exploits take him to stuffy European monarchy, a remote desert isle and even a cave in the year 50,000 BC. And now for the first time the Man of Steel's exciting flights, fights, and super heroics are presented in color!\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Action & Adventure', 'Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Contributor': 'Noel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert MaxwellNoel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert Maxwell  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 1 inches; 8.8 Ounces', 'Item model number': '2210928', 'Media Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Run time': '11 hours and 46 minutes', 'Release date': 'June 20, 2006', 'Actors': 'George Reeves, Phyllis Coates, Noel Neill, Jack Larson, John Hamilton', 'Subtitles': 'Spanish, French', 'Producers': 'Whitney Ellsworth, Bernard Luber, Robert Maxwell', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nReview Text: I remember seeing these shows on TV as a child.  It is such a releef to see these shows again.  They are so relaxing and comforting knowing how the world is these days.  A Super hero for the imigination as a series is wonderful.  I am happy to be able to see these shows again and remember when.  They may not have the action and effects as current day superman movies, but these are great to have in any film library.\nReview Title: TV's Superman\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lackawanna Blues\nReview Date: 2008/12/16\nStore: S. Epatha Merkerson  (Actor),     Marcus Carl Franklin  (Actor),     George C. Wolfe  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Product Description', 'Based on the award winning play by Ruben Santiago-Hudson, this poignant and colorful drama tells the inspirational story of a courageous woman, Nanny, whose spirit and strength served as the foundation for a struggling community trying to survive during the segregation era. Starring an exceptional ensemble cast led by Jimmy Smits, Rosie Perez, and Macy Gray, this inspiring drama from HBO Films is a celebration of the good things in life, no matter how tough times may be.', 'DVD Features:', 'Audio Commentary:', 'Audio Commentary with director George C. Wolfe and writer Ruben Santiago-Hudson', 'Deleted Scenes', 'Featurette', 'Amazon.com', 'Cool music, a wonderful atmospheric feel, and first-rate performances by a stellar cast distinguish', 'Lackawanna Blues', \", a 2005, 90-minute film originally broadcast by HBO. Director George C. Wolfe's theater background (as a writer and/or director he's been responsible for\", 'The Colored Museum', ',', \"Jelly's Last Jam\", ', and', 'Bring in Da Noise, Bring in Da Funk', ') is apparent; adapted by scriptwriter Ruben Santiago-Hudson from his own autobiographical play,', 'Lackawanna Blues', 'is less a story than a reminiscence, told by a young man (an affecting performance by Marcus Carl Franklin) raised by the indefatigable Rachel \"Nanny\" Crosby (an equally fine turn by S. Epatha Merkerson, known to many from her role in TV\\'s', 'Law & Order', \") in that upstate New York town. The focus is on Nanny's rooming house, which is populated by all manner of colorful characters (played by the likes of Macy Gray, Jeffrey Wright, and many others, with Jimmy Smits and Carmen Ejogo as the boy's wayward parents). The roomers include drunks, hustlers, ex-cons, and other shady types, but while plenty of bad stuff goes on, it's all coated with a certain patina of sentiment that tends to minimize the hard realities of life for African Americans in the early 1960s. That's fine; Wolfe, with the help of some superb editing by Brian Kates, gives the film such a delightful period vibe that it's easy to overlook its few shortcomings. The music (available on a\", 'soundtrack CD', '), ranging from downhome country blues to uptown swing, jump blues, and more, also makes a major contribution to the delightful diversion that is', 'Lackawanna Blues', '.', '--Sam Graham']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'DRAMA', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Delroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Louis Gossett Jr., Rosie PerezDelroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Loui…   See more', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': '92749', 'Director': 'George C. Wolfe', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'August 23, 2005', 'Actors': 'S. Epatha Merkerson, Marcus Carl Franklin, Yasiin Bey, Carmen Ejogo, Bill Simms Jr.', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Halle Berry, Nellie Nugiel, Ruben Santiago-Hudson, Shelby Stone, Vincent Cirrincione', 'Studio': 'HBO Studios', 'Writers': 'Ruben Santiago-Hudson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This was a very heart warming movie.  Very good acting.  I truly enjoyed it.\nReview Title: Very Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Richard Pryor Here and Now / Richard Pryor Live on the Sunset Strip - Set\nReview Date: 2011/01/29\nStore: Richard Pryor  (Actor, Director, Writer),     Gene Cross  (Actor),     Joe Layton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Double Feature - 2 Discs.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Gene Cross, Jesse Jackson, Paul Mooney, Richard Pryor, Julie Hampton, Joe Layton', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2226995', 'Director': 'Joe Layton, Richard Pryor', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Richard Pryor, Gene Cross, Julie Hampton, Jesse Jackson, Paul Mooney', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Paul Mooney, Richard Pryor', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: This was a wonder DVD, to have two shows in one is just wonderful.  My family really enjoyed him.\nReview Title: Richard Pryor\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 5, Vol. 2\nReview Date: 2011/01/29\nStore: Raymond Burr  (Actor),     William Hopper  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'William Talman, William Hopper, Raymond Burr, Barbara Hale, Ray Collins', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.57 x 5.4 x 7.49 inches; 5.15 Ounces', 'Item model number': '540985592', 'Media Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Run time': '12 hours and 53 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, William Hopper, William Talman, Ray Collins', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I have the complete set of all TV shows of Perry Mason, and cannot get enough of watching them. Just a Perry Mason FAN for a very long time.  I JUST LOVE THEM...\nReview Title: Perry Mason\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nick Carter Mysteries Triple Feature\nReview Date: 2013/08/15\nStore: Walter Pidgeon  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Private eye Nick Carter\\'s detective adventures encompassed over 1000 stories, a 1943-1955 radio series and, among his screen heroics, these three MGM \"Bs\" starring Walter Pidgeon (soon to be Greer Garson\\'s costar in nine films, including Mrs. Miniver). In Nick Carter, Master Detective, someone is sabotaging the creation of an innovative high-speed aircraft at Radex Corporation. Can Carter, posing as an executive at Radex, unmask the culprits and save the project? Phantom Raiders has Carter taking on a deadly case involving the mysterious sinking of cargo ships leaving Colon, Panama. In Sky Murder, our hero exposes an anti-U.S. spy operation while protecting a woman marked for death. Sharing the adventures and adding to the frequently comic tone of the storylines is beekeeper and Carter\\'s assistant \"Beeswax\" (Donald Meek), who sometimes sends a fistful of bees into action to help him escape a dire situation.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Walter Pidgeon', 'Language': 'English', 'Runtime': '3 hours and 21 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '397720', 'Media Format': 'NTSC', 'Run time': '3 hours and 21 minutes', 'Release date': 'April 23, 2013', 'Actors': 'Walter Pidgeon', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Just what I expected.  The quality of the DVD is very good.  I have enjoyed these mysteries and to have three on the same DVD is so great.  It had been a long time since I saw any of these movies, but now I can watch as I wish, and as I said the quality if very good.\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 8, Vol. 2\nReview Date: 2013/08/15\nStore: Raymond Burr  (Actor),     Barbara Hale  (Actor),     Arthu Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Renowned defense attorney Perry Mason is back on the front lines of justice in the 15 final episodes of Season Eight. Two-time Emmy® winner Raymond Burr brings his signature brand of clever questioning and deductive reasoning to cap off a killer season, which includes mischievous dolls, deadly debts and murderous mermaids. Always by his side are Detective Paul Drake (William Hopper), loyal secretary Della Street (Barbara Hale), and homicide officer Andy Anderson (Wesley Lau). In this four-disc, digitally remastered collection, courtroom fireworks are on full display, and one of television’s most iconic legal thrillers is at its peak.']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.96 Ounces', 'Item model number': '35048550908', 'Director': 'Arthu Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Full Screen, Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 52 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I thought I had all of the Perry Mason series, from Columbia House back in the day, but I find out from this one I do not.  I now have to get vol 1.  I have always enjoyed Perry Mason, and this DVD just adds to the enjoyment.\nReview Title: GREAT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 8, Vol. 1\nReview Date: 2013/11/11\nStore: Raymond Burr  (Actor),     Barbara Hale  (Actor),     Arthur Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Contributor': 'Jerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray CollinsJerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray Collins   See more', 'Language': 'English', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 3.21 Ounces', 'Item model number': '2409811098', 'Director': 'Arthur Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Run time': '12 hours and 54 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Subtitles': 'English', 'Studio': 'Paramount', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I love me some Perry Mason, and years ago I thought I had all episodes but this set I did not have.  The quality was great and it was a great addition to my collection.\nReview Title: wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Winter Kill (1974 Tvm)\nReview Date: 2013/11/11\nStore: Andy Griffith  (Actor),     John Larch  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: [\"Six years after he completed his long run as Sheriff Andy Taylor on The Andy Griffith Show, the beloved TV star returned as a small-town lawman in Winter Kill. Griffith brought the same common sense and friendly, laconic style to his new role, but Police Chief Sam McNeill has something more challenging than Mayberry's town drunk to deal with: life-and-death mystery. The ski resort Sam protects is the target of a serial killer who leaves no clues except taunting messages spray-painted next to the bodies of his -- or her -- victims. Among the supporting cast, look for a fresh-faced Nick Nolte as a womanizing ski instructor.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': \"Tim O'Connor, Lawrence Pressman, Eugene Roche, Andy Griffith, John Larch, Jud Taylor\", 'Language': 'Unqualified', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 34 minutes', 'Release date': 'February 24, 2010', 'Actors': \"Andy Griffith, John Larch, Tim O'Connor, Lawrence Pressman, Eugene Roche\", 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have always enjoyed Andy Griffith, and this movie is one of a series of three that I remember, and it is a good movie.  I truly enjoyed this movie and waiting for the other one called \"The empty grave\"  .\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hildegarde Withers Mysteries Movies Collection [DVD]\nReview Date: 2014/01/19\nStore: Edna May Oliver  (Actor),     Robert Armstrong  (Actor),     George Archainbaud  (Director),     Lloyd Corrigan  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Stuart Palmer's immortal crime-solving school teacher Hildegarde Withers came to the screen courtesy of a series of mysteries from RKO Pictures. Memorably played by character great Edna May Oliver in three features, Hildegarde was ably paired with her flirty foil of Inspector Piper in the person of James Gleason. Gleason would go on to anchor the series, appearing in all six, alongside Helen Broderick for one and Zasu Pitts for the final two.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Bruce Cabot, Lloyd Corrigan, Edna May Oliver, Edward F. Cline, Ben Holmes, Joan Woodbury, Zasu Pitts, Marjorie Lord, George Archainbaud, Mae Clarke, Lola Lane, William Hamilton, Robert Armstrong, James Gleason, Regis Toomey, Helen Broderick, Stuart Palmer, Leo G. Carroll, Edward Killy, Paul FixBruce Cabot, Lloyd Corrigan, Edna May Oliver, Edward F. Cline, Ben Holmes, Joan Woodbury, Zasu Pitts, Marjorie Lord, George Archainbaud, Mae Clarke, Lola Lane, William Hamilton, Robert Armstrong, James Gleason, Regis Toomey, Helen Broderick, Stuart Palmer, Leo G.…   See more', 'Language': 'English', 'Runtime': '6 hours and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '402733', 'Director': 'George Archainbaud, Lloyd Corrigan, William Hamilton, Edward Killy, Ben Holmes', 'Media Format': 'DVD, NTSC', 'Run time': '6 hours and 47 minutes', 'Release date': 'July 23, 2013', 'Actors': 'Edna May Oliver, Robert Armstrong, James Gleason, Mae Clarke, Bruce Cabot', 'Studio': 'Warner Archive Collection', 'Writers': 'Stuart Palmer', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I have waited for these movies to be released.  I watched these movies, not knowing that there had been three women to play Hildagard Withers.  Edna May Oliver is my favorite.  Helen Crawford and Zusa P. were good, but no one is or was as good as Edna May Oliver.  There are eight good movies in the package.  The picture quality is good.  I simply enjoy good entertainment with simple plots and the characters are that ---entertaining.\nReview Title: Enjoyed the Movies\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Deadly Game (1977 Tvm)\nReview Date: 2014/01/19\nStore: Andy Griffith  (Actor),     Mitzi Hoag  (Actor),     Lane Slate  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"A truckload of lethal U.S. Army chemicals spills in Police Chief Abel Marsh's town. People die. Land is contaminated. What a dreadful accident if it is an accident. And if it isn't, just what the heck is going on? Andy Griffith is back as Abel Marsh in a second telefilm about dark doings in the quirky mountain village of Jasper Lake. The fine supporting cast includes James Cromwell (Babe, The Queen) as Abel's bashful deputy. But it's Griffith's show all the way as he proves that when it comes to playing a deadly game, never underestimate laid-back, down-home and very able Abel Marsh.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC', 'Contributor': 'Claude Earl Jones, Lane Slate, James Cromwell, Andy Griffith, Mitzi Hoag, Sharon Spelman', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Lane Slate', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 24, 2010', 'Actors': 'Andy Griffith, Mitzi Hoag, James Cromwell, Claude Earl Jones, Sharon Spelman', 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I like this movie.  It was made for TV and it is not shown very often, so I was pleased when I saw it on video.  Another movie wit Andy Griffin in the same character called empty grave, I am waiting for.  I am an Andy Griffin fan.\nReview Title: Good Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaka Zulu - The Complete 10 Part Television Epic\nReview Date: 2014/01/19\nStore: Edward Fox  (Actor),     Robert Powell  (Actor),     William C. Faure  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, A&E Home Video, All A&E Titles\nProduct Description: ['Product Description', \"England is spreading its control in Africa. Also amassing control is Shaka, the great leader of the Zulu nation. His innovations in warfare and brutal treatment of both friend and enemy allow him to dominate surrounding tribes. On Queen Victoria's command, the two superpowers collide in epic battle. 8-1/2 hours on 4 DVDs.\", 'Amazon.com', 'This sweeping miniseries from 1986 captures the rise and fall of an African emperor.', 'Shaka Zulu', 'begins following a British expedition sent to bargain with the fearsome Zulu army assembling on the outer edges of the British colonies in South Africa. Led by Lt. Francis Farewell (', 'The Day of the Jackal', ',', 'A Bridge Too Far', \"), the expedition hopes to bamboozle a superstitious primitive, but their arrogance gets taken down a notch by a cunning and ruthless warlord who has unified vast territories through a combination of political charisma and military discipline. At this point, the focus shifts to how Shaka (the riveting Henry Cele), king of the Zulus, rose from a brutal childhood to royal grandeur--a semi-mythological tale filled with family strife, political intrigue, witchcraft, and bloody warfare. Powerful performances by Cele and Dudu Mikhize (as Shaka's iron-willed mother, Nandi) give this sprawling epic the drive and emotional scope of a Shakespearean drama.\", 'Shaka Zulu', 'also draws sneaky parallels between the Zulu and British empires, often to sharp satirical effect. Full of richly conceived characters and compelling political maneuvering, this eight-hour series brings faraway history to living, breathing life. Also featuring Christopher Lee (whose always-steady career exploded at age 79 with juicy roles in', 'The Lord of the Rings', 'and', 'Star Wars: Episode II, Attack of the Clones', ').', '--Bret Fetzer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Edward Fox, Patrick Ndlovu, Christopher Lee, William C. Faure, Trevor Howard, Robert Powell, Gordon Jackson, Henry Cele, Conrad Magwaza, Joshua Sinclair, Fiona Fullerton, Kenneth Griffith, Dudu Mkhize, Roy DotriceEdward Fox, Patrick Ndlovu, Christopher Lee, William C. Faure, Trevor Howard, Robert Powell, Gordon Jackson, Henry Cele, Conrad Magwaza, Joshua Sinclair, Fiona Fullerton, Kenneth Griffith, Dudu Mkhize, Roy Dotrice  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 11.2 Ounces', 'Director': 'William C. Faure', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '8 hours and 20 minutes', 'Release date': 'October 29, 2002', 'Actors': 'Edward Fox, Robert Powell, Trevor Howard, Fiona Fullerton, Christopher Lee', 'Studio': 'A&E Home Video', 'Writers': 'Joshua Sinclair', 'Number of discs': '4'}\nReview Text: I purchased this for my husband who loves the movie.  It is not for me but he loves it.  There is not much else I can say.\nReview Title: Good movie\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Falcon Mystery Movie Collection, Volume 1 (3 Discs) [DVD]\nReview Date: 2014/01/19\nStore: George Sanders  (Actor),     Tom Conway  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Miscreants beware! The Falcon is on the hunt! Suave, sophisticated, hard-boiled and high-minded, amateur sleuths Gay and Tom Lawrence AKA The Falcon were a perfect fit for the acerbic styling of siblings George Sanders and Tom Conway. Follow the saga from the start with this 3-disc, 7 film collection.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Tom Conway, George Sanders', 'Language': 'English', 'Studio': 'Warner Archive', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'DVD, NTSC', 'Release date': 'December 6, 2011', 'Actors': 'George Sanders, Tom Conway', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I love this series of movies, and to get them in a package it is great.  I love these old movies and enjoy them as easy and simple stories, with interesting characters, no deep meaning.\nReview Title: Great, Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dangerous Dames Collection\nReview Date: 2014/01/19\nStore: Barbara Stanwyck  (Actor),     Kirk Douglas  (Actor),     Various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['1. The Strange Love Of Martha Ivers', 'Cast: Barbara Stanwyck, Kirk Douglas, Van Heflin A predatory female (Stanwyck) plots to rid herself of a meek husband (Douglas) and silence a former lover (Heflin) who may have witnessed the \"untimely\" death of her mean-spirited, wealthy stepmother. (1 hr 56 min, B&W)', '2. Too Late For Tears', 'Cast: Lizabeth Scott, Arthur Kennedy Pennies from heaven quickly turn to blood money when a married couple (Scott, Kennedy) mistakenly receives a satchel of stolen cash and the faithless wife schemes to keep the loot for herself! (1 hr 39 min, B&W)', '3. Lady Of Burlesque', \"Cast: Barbara Stanwyck, Michael O'Shea A striptease artist (Stanwyck) is up to her neck in trouble when two fellow dancers are found strangled by their own g-strings and she becomes the prime suspect! (1 hr 31 min, B&W)\", '4. Blonde Ice', 'Cast: Leslie Brooks, Robert Paige A blonde bombshell (Brooks) rises from humble beginnings to become a successful society columnist by romancing wealthy men who all die under mysterious circumstances. One of the most deadly femme fatales in the history of film noir! (1 hr 13 min, B&W)', '5. A Life At Stake', 'Cast: Angela Lansbury, Keith Andes An enterprising businesswoman (Lansbury) has big plans for an out-of-work architect (Andes)--a lucrative job and an illicit love affair. Unfortunately for him, her plans also include murder! (1 hr 18 min, B&W)', '6. Please Murder Me', \"Cast: Angela Lansbury, Raymond Burr A sultry femme fatale (Lansbury) accused of killing her husband tricks a love-smitten attorney (Burr) into acquitting her. But when the lawyer learns he's been duped, he sets an ingenious trap to bring the murderess to justice. (1 hr 18 min, B&W)\"]\nAverage Rating: 4.1\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '8 hours and 48 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Barbara Stanwyck, Kirk Douglas, Van Heflin, Lizabeth Scott, Arthur Kennedy', 'Language': 'Unqualified', 'Studio': 'Pop Flix', 'Number of discs': '2'}\nReview Text: I am one of those classic movie fans, and just adore old black and white movies.  This collection is good for the ones I have seen.\nReview Title: Love It\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TCM Spotlight: Charlie Chan Collection (Dark Alibi / Dangerous Money / The Trap / The Chinese Ring)\nReview Date: 2014/01/19\nStore: Sidney Toler  (Actor),     Roland Winters  (Actor),     Phil Karlson  (Director),     Terry O. Morse  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['TCM Spotlight: Charlie Chan Collection']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Suspense/Thrillers, Comedy, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Black & White, NTSC, Subtitled', 'Contributor': 'Benson Fong, Gloria Warren, Roland Winters, Sidney Toler, Mantan Moreland, William Beaudine, Howard Bretherton, Victor Sen Yung, Terry O. Morse, Phil KarlsonBenson Fong, Gloria Warren, Roland Winters, Sidney Toler, Mantan Moreland, William Beaudine, Howard Bretherton, Victor Sen Yung, Terry O. Morse, Phil Karlson  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 19 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.6 Ounces', 'Item model number': 'WARD120258D', 'Director': 'Phil Karlson, Terry O. Morse, Howard Bretherton, William Beaudine', 'Media Format': 'Multiple Formats, Box set, Black & White, NTSC, Subtitled', 'Run time': '3 hours and 19 minutes', 'Release date': 'June 8, 2010', 'Actors': 'Sidney Toler, Roland Winters, Benson Fong, Victor Sen Yung, Gloria Warren', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: I am a Charlie Chan fan, and like all of the Chan movies.  This package is very good.  The quality is wonderful.  No complaints\nReview Title: Glove them\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/12/09\nAverage Rating: 4.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Phil Rosen'], 'Producers': ['James S. Burkett'], 'Starring': ['Sidney Toler', 'Benson Fong']}\nReview Text: I do not care what movie of Charlie Chan I watch, I just love the series.  Any Charlie Chan move is a go for me at any time.\nReview Title: Charlie Chan, entertainment to enjoy\nRating: 5.0\n--------------------------------------------------",
  "reference": "Columbo - The Complete Fifth Season\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"Peter Falk dons his famous trenchcoat again as he returns in his 4-time Emmy award-winning role as everyone's favorite Police Lieutenant in Columbo: The Complete Fifth Season! Join Columbo in this three-disc set as he asks all the right questions in some of the most deceptive and deadly cases. The Fascinating Fifth season also features such brilliant guest stars as Janet Leigh, Sal Mineo, Robert Vaughn, Ricardo Montalban, Hector Elizondo, Robert Loggia, Patrick McGoohan, and more. The landmark crime series returns, and no murderer can hide for long with Columbo on the beat!\", 'Bonus Content:', 'Disc 1:', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', ']]>', 'Amazon.com', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show\\x92s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn\\x92s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set\\x92s sole extra.', '--Paul Gaita', 'Review', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set s sole extra.', '--Paul Gaita', '--Amazon.com', 'See more']\n{'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Peter Falk', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.28 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '8 hours and 49 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Peter Falk', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nThis package of Columbo is as good as the previously released version.  This is wonderful to enjoy Columbo at any time and a choice of shows.  I cannot wait until the other shows are released.  I am a Columbo fan, and this package and the others I have purchased have been GREAT!\nGood Collection\nThe Rockford Files - Season Two\nJames Garner  (Actor),     Noah Beery, Jr.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', \"Jim Rockford is back and better than ever in all 22 Season Two episodes of the celebrated detective hit The Rockford Files. Join James Garner in his breakout Emmy-winning role as the cool, calm and collected ex-con-turned-detective who loves to mouth off but avoids using his fists at all costs. He takes his time, but always solves the crime - whether it be blackmail, theft, scams or murder! Along for the ride on this five-time Emmy-winning series are such stellar guest stars as Rob Reiner, Louis Gossett Jr., Linda Evans, Isaac Hayes and Dick Butkus. Also included for the first time on DVD is the original series pilot. With his no-nonsense approach and wisecracking wit, it's no mystery that Rockford always gets his man.Bonus Content:\", 'Disc 6:', 'Stephen J. Cannell On-Camera Interview', 'Stephen J. Cannell On-Camera Interview', 'Bonus Episode: The Rockford Files Series Pilot', 'Bonus Episode: The Rockford Files Series Pilot', 'Amazon.com', '\"The best detective series ever,\" according to', 'TV Guide', ', the second', 'Rockford Files', 'set begins at the beginning. That\\'s because the double-length pilot (\"Backlash of the Hunter\") appears as an extra. In this episode, Jim Rockford (James Garner) explains to guest star Lindsay Wagner, \"I only handle criminal cases that are closed.\" The first Rockford file also introduces his errant father, Rocky (Robert Donley, who\\'ll soon be replaced by Noah Beery Jr.), detective buddy Dennis (Joe Santos,', 'The Sopranos', '), and squirrelly pal Angel (Emmy winner Stuart Margolin) with whom he did time at San Quentin (before being granted a full pardon). Season two highlights include the two-part \"Gearjammers,\" in which Rockford discovers his dad\\'s secret life, \"Chicken Little Is a Little Chicken,\" in which Rockford helps Angel fake his death, and \"The Hammer of C Block,\" with Isaac \"Shaft\" Hayes as a former cellmate who just can\\'t get his name straight\\x97he thinks it\\'s \"Rockfish.\" (The Oscar-winning Hayes also contributes an original number called \"Gandy\\'s Theme.\") Even when the episodes are less memorable, Garner\\'s easygoing Oklahoma charm and potent chemistry with his co-stars, including lawyer/ex-girlfriend girlfriend Beth (Gretchen Corbett), makes each one worth watching. Like most Stephen J. Cannell programs (', 'Baretta', ',', '21 Jump Street', ', etc.),', 'The Rockford Files', 'never had any difficulty attracting famous (and soon-to-be-famous) guests. The second year claims such notables as Linda Evans (\"The Farnsworth Stratagem\"), Stefanie Powers (\"The Real Easy Red Dog\"), Blair Brown (\"The Girl in the Bay City Boys Club\"), Rob Reiner (\"The No-Cut Contract\"), and Louis Gossett Jr. (\"Foul on the First Play\\'). The only other bonus feature is a short, if informative interview with Cannell, who reveals that the character of Joseph \"Rocky\" Rockford was modeled after his own father.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'James Garner, Joe Santos, Noah Beery, Jr., Stuart Margolin', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '18 hours and 29 minutes', 'Release date': 'June 13, 2006', 'Actors': 'James Garner, Noah Beery, Jr., Joe Santos, Stuart Margolin', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '6'}\nI have truly enjoyed watching the Rockford Files. This was one of my favorites shows on television and to have this collection is great.  It is Rockford at his best.  I am waiting for the release of the next season.\nRockford Files are the Best\nAdventures of Superman: The Complete Third & Fourth Seasons\nGeorge Reeves  (Actor),     Phyllis Coates  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Adventures of Superman, The Complete 3rd & 4th Seasons (DVD) (Multi-Title)', \"George Reeves returns as Superman (aka Clark Kent) in 26 episodes comprising Season 3 and Season 4 of the program that ran six seasons total. This time his exploits take him to stuffy European monarchy, a remote desert isle and even a cave in the year 50,000 BC. And now for the first time the Man of Steel's exciting flights, fights, and super heroics are presented in color!\", ']]>']\n{'Genre': 'Television, Action & Adventure', 'Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Contributor': 'Noel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert MaxwellNoel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert Maxwell  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 1 inches; 8.8 Ounces', 'Item model number': '2210928', 'Media Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Run time': '11 hours and 46 minutes', 'Release date': 'June 20, 2006', 'Actors': 'George Reeves, Phyllis Coates, Noel Neill, Jack Larson, John Hamilton', 'Subtitles': 'Spanish, French', 'Producers': 'Whitney Ellsworth, Bernard Luber, Robert Maxwell', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nI remember seeing these shows on TV as a child.  It is such a releef to see these shows again.  They are so relaxing and comforting knowing how the world is these days.  A Super hero for the imigination as a series is wonderful.  I am happy to be able to see these shows again and remember when.  They may not have the action and effects as current day superman movies, but these are great to have in any film library.\nTV's Superman\nLackawanna Blues\nS. Epatha Merkerson  (Actor),     Marcus Carl Franklin  (Actor),     George C. Wolfe  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'Based on the award winning play by Ruben Santiago-Hudson, this poignant and colorful drama tells the inspirational story of a courageous woman, Nanny, whose spirit and strength served as the foundation for a struggling community trying to survive during the segregation era. Starring an exceptional ensemble cast led by Jimmy Smits, Rosie Perez, and Macy Gray, this inspiring drama from HBO Films is a celebration of the good things in life, no matter how tough times may be.', 'DVD Features:', 'Audio Commentary:', 'Audio Commentary with director George C. Wolfe and writer Ruben Santiago-Hudson', 'Deleted Scenes', 'Featurette', 'Amazon.com', 'Cool music, a wonderful atmospheric feel, and first-rate performances by a stellar cast distinguish', 'Lackawanna Blues', \", a 2005, 90-minute film originally broadcast by HBO. Director George C. Wolfe's theater background (as a writer and/or director he's been responsible for\", 'The Colored Museum', ',', \"Jelly's Last Jam\", ', and', 'Bring in Da Noise, Bring in Da Funk', ') is apparent; adapted by scriptwriter Ruben Santiago-Hudson from his own autobiographical play,', 'Lackawanna Blues', 'is less a story than a reminiscence, told by a young man (an affecting performance by Marcus Carl Franklin) raised by the indefatigable Rachel \"Nanny\" Crosby (an equally fine turn by S. Epatha Merkerson, known to many from her role in TV\\'s', 'Law & Order', \") in that upstate New York town. The focus is on Nanny's rooming house, which is populated by all manner of colorful characters (played by the likes of Macy Gray, Jeffrey Wright, and many others, with Jimmy Smits and Carmen Ejogo as the boy's wayward parents). The roomers include drunks, hustlers, ex-cons, and other shady types, but while plenty of bad stuff goes on, it's all coated with a certain patina of sentiment that tends to minimize the hard realities of life for African Americans in the early 1960s. That's fine; Wolfe, with the help of some superb editing by Brian Kates, gives the film such a delightful period vibe that it's easy to overlook its few shortcomings. The music (available on a\", 'soundtrack CD', '), ranging from downhome country blues to uptown swing, jump blues, and more, also makes a major contribution to the delightful diversion that is', 'Lackawanna Blues', '.', '--Sam Graham']\n{'Genre': 'DRAMA', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Delroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Louis Gossett Jr., Rosie PerezDelroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Loui…   See more', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': '92749', 'Director': 'George C. Wolfe', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'August 23, 2005', 'Actors': 'S. Epatha Merkerson, Marcus Carl Franklin, Yasiin Bey, Carmen Ejogo, Bill Simms Jr.', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Halle Berry, Nellie Nugiel, Ruben Santiago-Hudson, Shelby Stone, Vincent Cirrincione', 'Studio': 'HBO Studios', 'Writers': 'Ruben Santiago-Hudson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was a very heart warming movie.  Very good acting.  I truly enjoyed it.\nVery Good\nRichard Pryor Here and Now / Richard Pryor Live on the Sunset Strip - Set\nRichard Pryor  (Actor, Director, Writer),     Gene Cross  (Actor),     Joe Layton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Double Feature - 2 Discs.']\n{'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Gene Cross, Jesse Jackson, Paul Mooney, Richard Pryor, Julie Hampton, Joe Layton', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2226995', 'Director': 'Joe Layton, Richard Pryor', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Richard Pryor, Gene Cross, Julie Hampton, Jesse Jackson, Paul Mooney', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Paul Mooney, Richard Pryor', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis was a wonder DVD, to have two shows in one is just wonderful.  My family really enjoyed him.\nRichard Pryor\nPerry Mason: Season 5, Vol. 2\nRaymond Burr  (Actor),     William Hopper  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'William Talman, William Hopper, Raymond Burr, Barbara Hale, Ray Collins', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.57 x 5.4 x 7.49 inches; 5.15 Ounces', 'Item model number': '540985592', 'Media Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Run time': '12 hours and 53 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, William Hopper, William Talman, Ray Collins', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nI have the complete set of all TV shows of Perry Mason, and cannot get enough of watching them. Just a Perry Mason FAN for a very long time.  I JUST LOVE THEM...\nPerry Mason\nNick Carter Mysteries Triple Feature\nWalter Pidgeon  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Private eye Nick Carter\\'s detective adventures encompassed over 1000 stories, a 1943-1955 radio series and, among his screen heroics, these three MGM \"Bs\" starring Walter Pidgeon (soon to be Greer Garson\\'s costar in nine films, including Mrs. Miniver). In Nick Carter, Master Detective, someone is sabotaging the creation of an innovative high-speed aircraft at Radex Corporation. Can Carter, posing as an executive at Radex, unmask the culprits and save the project? Phantom Raiders has Carter taking on a deadly case involving the mysterious sinking of cargo ships leaving Colon, Panama. In Sky Murder, our hero exposes an anti-U.S. spy operation while protecting a woman marked for death. Sharing the adventures and adding to the frequently comic tone of the storylines is beekeeper and Carter\\'s assistant \"Beeswax\" (Donald Meek), who sometimes sends a fistful of bees into action to help him escape a dire situation.']\n{'Genre': 'Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Walter Pidgeon', 'Language': 'English', 'Runtime': '3 hours and 21 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '397720', 'Media Format': 'NTSC', 'Run time': '3 hours and 21 minutes', 'Release date': 'April 23, 2013', 'Actors': 'Walter Pidgeon', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nJust what I expected.  The quality of the DVD is very good.  I have enjoyed these mysteries and to have three on the same DVD is so great.  It had been a long time since I saw any of these movies, but now I can watch as I wish, and as I said the quality if very good.\nGreat\nPerry Mason: Season 8, Vol. 2\nRaymond Burr  (Actor),     Barbara Hale  (Actor),     Arthu Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Renowned defense attorney Perry Mason is back on the front lines of justice in the 15 final episodes of Season Eight. Two-time Emmy® winner Raymond Burr brings his signature brand of clever questioning and deductive reasoning to cap off a killer season, which includes mischievous dolls, deadly debts and murderous mermaids. Always by his side are Detective Paul Drake (William Hopper), loyal secretary Della Street (Barbara Hale), and homicide officer Andy Anderson (Wesley Lau). In this four-disc, digitally remastered collection, courtroom fireworks are on full display, and one of television’s most iconic legal thrillers is at its peak.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.96 Ounces', 'Item model number': '35048550908', 'Director': 'Arthu Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Full Screen, Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 52 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nI thought I had all of the Perry Mason series, from Columbia House back in the day, but I find out from this one I do not.  I now have to get vol 1.  I have always enjoyed Perry Mason, and this DVD just adds to the enjoyment.\nGREAT\nPerry Mason: Season 8, Vol. 1\nRaymond Burr  (Actor),     Barbara Hale  (Actor),     Arthur Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Contributor': 'Jerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray CollinsJerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray Collins   See more', 'Language': 'English', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 3.21 Ounces', 'Item model number': '2409811098', 'Director': 'Arthur Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Run time': '12 hours and 54 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Subtitles': 'English', 'Studio': 'Paramount', 'Country of Origin': 'USA', 'Number of discs': '4'}\nI love me some Perry Mason, and years ago I thought I had all episodes but this set I did not have.  The quality was great and it was a great addition to my collection.\nwonderful\nThe Winter Kill (1974 Tvm)\nAndy Griffith  (Actor),     John Larch  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"Six years after he completed his long run as Sheriff Andy Taylor on The Andy Griffith Show, the beloved TV star returned as a small-town lawman in Winter Kill. Griffith brought the same common sense and friendly, laconic style to his new role, but Police Chief Sam McNeill has something more challenging than Mayberry's town drunk to deal with: life-and-death mystery. The ski resort Sam protects is the target of a serial killer who leaves no clues except taunting messages spray-painted next to the bodies of his -- or her -- victims. Among the supporting cast, look for a fresh-faced Nick Nolte as a womanizing ski instructor.\"]\n{'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': \"Tim O'Connor, Lawrence Pressman, Eugene Roche, Andy Griffith, John Larch, Jud Taylor\", 'Language': 'Unqualified', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 34 minutes', 'Release date': 'February 24, 2010', 'Actors': \"Andy Griffith, John Larch, Tim O'Connor, Lawrence Pressman, Eugene Roche\", 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have always enjoyed Andy Griffith, and this movie is one of a series of three that I remember, and it is a good movie.  I truly enjoyed this movie and waiting for the other one called \"The empty grave\"  .\nGreat Movie\nThe Hildegarde Withers Mysteries Movies Collection [DVD]\nEdna May Oliver  (Actor),     Robert Armstrong  (Actor),     George Archainbaud  (Director),     Lloyd Corrigan  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Stuart Palmer's immortal crime-solving school teacher Hildegarde Withers came to the screen courtesy of a series of mysteries from RKO Pictures. Memorably played by character great Edna May Oliver in three features, Hildegarde was ably paired with her flirty foil of Inspector Piper in the person of James Gleason. Gleason would go on to anchor the series, appearing in all six, alongside Helen Broderick for one and Zasu Pitts for the final two.\"]\n{'Genre': 'Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Bruce Cabot, Lloyd Corrigan, Edna May Oliver, Edward F. Cline, Ben Holmes, Joan Woodbury, Zasu Pitts, Marjorie Lord, George Archainbaud, Mae Clarke, Lola Lane, William Hamilton, Robert Armstrong, James Gleason, Regis Toomey, Helen Broderick, Stuart Palmer, Leo G. Carroll, Edward Killy, Paul FixBruce Cabot, Lloyd Corrigan, Edna May Oliver, Edward F. Cline, Ben Holmes, Joan Woodbury, Zasu Pitts, Marjorie Lord, George Archainbaud, Mae Clarke, Lola Lane, William Hamilton, Robert Armstrong, James Gleason, Regis Toomey, Helen Broderick, Stuart Palmer, Leo G.…   See more', 'Language': 'English', 'Runtime': '6 hours and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '402733', 'Director': 'George Archainbaud, Lloyd Corrigan, William Hamilton, Edward Killy, Ben Holmes', 'Media Format': 'DVD, NTSC', 'Run time': '6 hours and 47 minutes', 'Release date': 'July 23, 2013', 'Actors': 'Edna May Oliver, Robert Armstrong, James Gleason, Mae Clarke, Bruce Cabot', 'Studio': 'Warner Archive Collection', 'Writers': 'Stuart Palmer', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI have waited for these movies to be released.  I watched these movies, not knowing that there had been three women to play Hildagard Withers.  Edna May Oliver is my favorite.  Helen Crawford and Zusa P. were good, but no one is or was as good as Edna May Oliver.  There are eight good movies in the package.  The picture quality is good.  I simply enjoy good entertainment with simple plots and the characters are that ---entertaining.\nEnjoyed the Movies\nDeadly Game (1977 Tvm)\nAndy Griffith  (Actor),     Mitzi Hoag  (Actor),     Lane Slate  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n[\"A truckload of lethal U.S. Army chemicals spills in Police Chief Abel Marsh's town. People die. Land is contaminated. What a dreadful accident if it is an accident. And if it isn't, just what the heck is going on? Andy Griffith is back as Abel Marsh in a second telefilm about dark doings in the quirky mountain village of Jasper Lake. The fine supporting cast includes James Cromwell (Babe, The Queen) as Abel's bashful deputy. But it's Griffith's show all the way as he proves that when it comes to playing a deadly game, never underestimate laid-back, down-home and very able Abel Marsh.\"]\n{'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC', 'Contributor': 'Claude Earl Jones, Lane Slate, James Cromwell, Andy Griffith, Mitzi Hoag, Sharon Spelman', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Lane Slate', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 24, 2010', 'Actors': 'Andy Griffith, Mitzi Hoag, James Cromwell, Claude Earl Jones, Sharon Spelman', 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI like this movie.  It was made for TV and it is not shown very often, so I was pleased when I saw it on video.  Another movie wit Andy Griffin in the same character called empty grave, I am waiting for.  I am an Andy Griffin fan.\nGood Movie\nShaka Zulu - The Complete 10 Part Television Epic\nEdward Fox  (Actor),     Robert Powell  (Actor),     William C. Faure  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, A&E Home Video, All A&E Titles\n['Product Description', \"England is spreading its control in Africa. Also amassing control is Shaka, the great leader of the Zulu nation. His innovations in warfare and brutal treatment of both friend and enemy allow him to dominate surrounding tribes. On Queen Victoria's command, the two superpowers collide in epic battle. 8-1/2 hours on 4 DVDs.\", 'Amazon.com', 'This sweeping miniseries from 1986 captures the rise and fall of an African emperor.', 'Shaka Zulu', 'begins following a British expedition sent to bargain with the fearsome Zulu army assembling on the outer edges of the British colonies in South Africa. Led by Lt. Francis Farewell (', 'The Day of the Jackal', ',', 'A Bridge Too Far', \"), the expedition hopes to bamboozle a superstitious primitive, but their arrogance gets taken down a notch by a cunning and ruthless warlord who has unified vast territories through a combination of political charisma and military discipline. At this point, the focus shifts to how Shaka (the riveting Henry Cele), king of the Zulus, rose from a brutal childhood to royal grandeur--a semi-mythological tale filled with family strife, political intrigue, witchcraft, and bloody warfare. Powerful performances by Cele and Dudu Mikhize (as Shaka's iron-willed mother, Nandi) give this sprawling epic the drive and emotional scope of a Shakespearean drama.\", 'Shaka Zulu', 'also draws sneaky parallels between the Zulu and British empires, often to sharp satirical effect. Full of richly conceived characters and compelling political maneuvering, this eight-hour series brings faraway history to living, breathing life. Also featuring Christopher Lee (whose always-steady career exploded at age 79 with juicy roles in', 'The Lord of the Rings', 'and', 'Star Wars: Episode II, Attack of the Clones', ').', '--Bret Fetzer']\n{'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Edward Fox, Patrick Ndlovu, Christopher Lee, William C. Faure, Trevor Howard, Robert Powell, Gordon Jackson, Henry Cele, Conrad Magwaza, Joshua Sinclair, Fiona Fullerton, Kenneth Griffith, Dudu Mkhize, Roy DotriceEdward Fox, Patrick Ndlovu, Christopher Lee, William C. Faure, Trevor Howard, Robert Powell, Gordon Jackson, Henry Cele, Conrad Magwaza, Joshua Sinclair, Fiona Fullerton, Kenneth Griffith, Dudu Mkhize, Roy Dotrice  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 11.2 Ounces', 'Director': 'William C. Faure', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '8 hours and 20 minutes', 'Release date': 'October 29, 2002', 'Actors': 'Edward Fox, Robert Powell, Trevor Howard, Fiona Fullerton, Christopher Lee', 'Studio': 'A&E Home Video', 'Writers': 'Joshua Sinclair', 'Number of discs': '4'}\nI purchased this for my husband who loves the movie.  It is not for me but he loves it.  There is not much else I can say.\nGood movie\nThe Falcon Mystery Movie Collection, Volume 1 (3 Discs) [DVD]\nGeorge Sanders  (Actor),     Tom Conway  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Miscreants beware! The Falcon is on the hunt! Suave, sophisticated, hard-boiled and high-minded, amateur sleuths Gay and Tom Lawrence AKA The Falcon were a perfect fit for the acerbic styling of siblings George Sanders and Tom Conway. Follow the saga from the start with this 3-disc, 7 film collection.']\n{'Genre': 'Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Tom Conway, George Sanders', 'Language': 'English', 'Studio': 'Warner Archive', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'DVD, NTSC', 'Release date': 'December 6, 2011', 'Actors': 'George Sanders, Tom Conway', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI love this series of movies, and to get them in a package it is great.  I love these old movies and enjoy them as easy and simple stories, with interesting characters, no deep meaning.\nGreat, Great\nDangerous Dames Collection\nBarbara Stanwyck  (Actor),     Kirk Douglas  (Actor),     Various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['1. The Strange Love Of Martha Ivers', 'Cast: Barbara Stanwyck, Kirk Douglas, Van Heflin A predatory female (Stanwyck) plots to rid herself of a meek husband (Douglas) and silence a former lover (Heflin) who may have witnessed the \"untimely\" death of her mean-spirited, wealthy stepmother. (1 hr 56 min, B&W)', '2. Too Late For Tears', 'Cast: Lizabeth Scott, Arthur Kennedy Pennies from heaven quickly turn to blood money when a married couple (Scott, Kennedy) mistakenly receives a satchel of stolen cash and the faithless wife schemes to keep the loot for herself! (1 hr 39 min, B&W)', '3. Lady Of Burlesque', \"Cast: Barbara Stanwyck, Michael O'Shea A striptease artist (Stanwyck) is up to her neck in trouble when two fellow dancers are found strangled by their own g-strings and she becomes the prime suspect! (1 hr 31 min, B&W)\", '4. Blonde Ice', 'Cast: Leslie Brooks, Robert Paige A blonde bombshell (Brooks) rises from humble beginnings to become a successful society columnist by romancing wealthy men who all die under mysterious circumstances. One of the most deadly femme fatales in the history of film noir! (1 hr 13 min, B&W)', '5. A Life At Stake', 'Cast: Angela Lansbury, Keith Andes An enterprising businesswoman (Lansbury) has big plans for an out-of-work architect (Andes)--a lucrative job and an illicit love affair. Unfortunately for him, her plans also include murder! (1 hr 18 min, B&W)', '6. Please Murder Me', \"Cast: Angela Lansbury, Raymond Burr A sultry femme fatale (Lansbury) accused of killing her husband tricks a love-smitten attorney (Burr) into acquitting her. But when the lawyer learns he's been duped, he sets an ingenious trap to bring the murderess to justice. (1 hr 18 min, B&W)\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '8 hours and 48 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Barbara Stanwyck, Kirk Douglas, Van Heflin, Lizabeth Scott, Arthur Kennedy', 'Language': 'Unqualified', 'Studio': 'Pop Flix', 'Number of discs': '2'}\nI am one of those classic movie fans, and just adore old black and white movies.  This collection is good for the ones I have seen.\nLove It\nTCM Spotlight: Charlie Chan Collection (Dark Alibi / Dangerous Money / The Trap / The Chinese Ring)\nSidney Toler  (Actor),     Roland Winters  (Actor),     Phil Karlson  (Director),     Terry O. Morse  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['TCM Spotlight: Charlie Chan Collection']\n{'Genre': 'Mystery & Suspense/Thrillers, Comedy, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Black & White, NTSC, Subtitled', 'Contributor': 'Benson Fong, Gloria Warren, Roland Winters, Sidney Toler, Mantan Moreland, William Beaudine, Howard Bretherton, Victor Sen Yung, Terry O. Morse, Phil KarlsonBenson Fong, Gloria Warren, Roland Winters, Sidney Toler, Mantan Moreland, William Beaudine, Howard Bretherton, Victor Sen Yung, Terry O. Morse, Phil Karlson  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 19 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.6 Ounces', 'Item model number': 'WARD120258D', 'Director': 'Phil Karlson, Terry O. Morse, Howard Bretherton, William Beaudine', 'Media Format': 'Multiple Formats, Box set, Black & White, NTSC, Subtitled', 'Run time': '3 hours and 19 minutes', 'Release date': 'June 8, 2010', 'Actors': 'Sidney Toler, Roland Winters, Benson Fong, Victor Sen Yung, Gloria Warren', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nI am a Charlie Chan fan, and like all of the Chan movies.  This package is very good.  The quality is wonderful.  No complaints\nGlove them\n{'Subtitles': ['None available'], 'Directors': ['Phil Rosen'], 'Producers': ['James S. Burkett'], 'Starring': ['Sidney Toler', 'Benson Fong']}\nI do not care what movie of Charlie Chan I watch, I just love the series.  Any Charlie Chan move is a go for me at any time.\nCharlie Chan, entertainment to enjoy",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Columbo - The Complete Fifth Season\nReview Date: 2006/11/15\nStore: Peter Falk  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', \"Peter Falk dons his famous trenchcoat again as he returns in his 4-time Emmy award-winning role as everyone's favorite Police Lieutenant in Columbo: The Complete Fifth Season! Join Columbo in this three-disc set as he asks all the right questions in some of the most deceptive and deadly cases. The Fascinating Fifth season also features such brilliant guest stars as Janet Leigh, Sal Mineo, Robert Vaughn, Ricardo Montalban, Hector Elizondo, Robert Loggia, Patrick McGoohan, and more. The landmark crime series returns, and no murderer can hide for long with Columbo on the beat!\", 'Bonus Content:', 'Disc 1:', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', 'Bonus Episode: Mrs. Columbo \"Caviar With Everything\"', ']]>', 'Amazon.com', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show\\x92s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn\\x92s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set\\x92s sole extra.', '--Paul Gaita', 'Review', 'Peter Falk took home back-to-back Emmy Awards for his portrayal of the indefatigable Lt. Columbo during the show s fifth season in 1975-76, and the series itself earned two Emmy nominations, which should give an indication of the quality of the episodes contained in this double-disc set. Although the fifth season only featured six episodes, the quality of writing and acting talent is impressive, to say the least: Janet Leigh, John Payne, Sam Jaffe, and Maurice Evans star in the season opener, \"Forgotten Lady,\" about a faded movie queen who may have murdered her elderly husband to finance a comeback; Patrick McGoohan, who won an Emmy for his performance in the fourth-season episode \"By Dawn s Early Light,\" returns to direct \"Identity Crisis\", which pits Columbo against a deceptive secret agent (McGoohan, who makes slyly overt references to his', 'Prisoner', 'character throughout the episode), and \"Last Salute to the Commodore,\" with John Dehner and Robert Vaughn as relatives whose disagreement over the fate of a shipping line turns deadly; and then-newcomers Steven Bocho and Steven Spielberg write and direct, respectively, \"Murder by the Book,\" with Jack Cassidy returning for his fourth', 'Columbo', 'turn as a devious PR agent. As far as TV mysteries go, few have been as clever, well acted, and intricately plotted as', 'Columbo', ', and home detectives should find plenty of sleuthing material to enjoy here. Unfortunately, as with all previous', 'Columbo', 'boxes, the supplemental material is limited; the \"Caviar with Everything\" episode of the', 'Mrs. Columbo', 'series with Kate Mulgrew is this set s sole extra.', '--Paul Gaita', '--Amazon.com', 'See more']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Peter Falk', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.28 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC, Full Screen', 'Run time': '8 hours and 49 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Peter Falk', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: This package of Columbo is as good as the previously released version.  This is wonderful to enjoy Columbo at any time and a choice of shows.  I cannot wait until the other shows are released.  I am a Columbo fan, and this package and the others I have purchased have been GREAT!\nReview Title: Good Collection\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Rockford Files - Season Two\nReview Date: 2006/11/15\nStore: James Garner  (Actor),     Noah Beery, Jr.  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Product Description', \"Jim Rockford is back and better than ever in all 22 Season Two episodes of the celebrated detective hit The Rockford Files. Join James Garner in his breakout Emmy-winning role as the cool, calm and collected ex-con-turned-detective who loves to mouth off but avoids using his fists at all costs. He takes his time, but always solves the crime - whether it be blackmail, theft, scams or murder! Along for the ride on this five-time Emmy-winning series are such stellar guest stars as Rob Reiner, Louis Gossett Jr., Linda Evans, Isaac Hayes and Dick Butkus. Also included for the first time on DVD is the original series pilot. With his no-nonsense approach and wisecracking wit, it's no mystery that Rockford always gets his man.Bonus Content:\", 'Disc 6:', 'Stephen J. Cannell On-Camera Interview', 'Stephen J. Cannell On-Camera Interview', 'Bonus Episode: The Rockford Files Series Pilot', 'Bonus Episode: The Rockford Files Series Pilot', 'Amazon.com', '\"The best detective series ever,\" according to', 'TV Guide', ', the second', 'Rockford Files', 'set begins at the beginning. That\\'s because the double-length pilot (\"Backlash of the Hunter\") appears as an extra. In this episode, Jim Rockford (James Garner) explains to guest star Lindsay Wagner, \"I only handle criminal cases that are closed.\" The first Rockford file also introduces his errant father, Rocky (Robert Donley, who\\'ll soon be replaced by Noah Beery Jr.), detective buddy Dennis (Joe Santos,', 'The Sopranos', '), and squirrelly pal Angel (Emmy winner Stuart Margolin) with whom he did time at San Quentin (before being granted a full pardon). Season two highlights include the two-part \"Gearjammers,\" in which Rockford discovers his dad\\'s secret life, \"Chicken Little Is a Little Chicken,\" in which Rockford helps Angel fake his death, and \"The Hammer of C Block,\" with Isaac \"Shaft\" Hayes as a former cellmate who just can\\'t get his name straight\\x97he thinks it\\'s \"Rockfish.\" (The Oscar-winning Hayes also contributes an original number called \"Gandy\\'s Theme.\") Even when the episodes are less memorable, Garner\\'s easygoing Oklahoma charm and potent chemistry with his co-stars, including lawyer/ex-girlfriend girlfriend Beth (Gretchen Corbett), makes each one worth watching. Like most Stephen J. Cannell programs (', 'Baretta', ',', '21 Jump Street', ', etc.),', 'The Rockford Files', 'never had any difficulty attracting famous (and soon-to-be-famous) guests. The second year claims such notables as Linda Evans (\"The Farnsworth Stratagem\"), Stefanie Powers (\"The Real Easy Red Dog\"), Blair Brown (\"The Girl in the Bay City Boys Club\"), Rob Reiner (\"The No-Cut Contract\"), and Louis Gossett Jr. (\"Foul on the First Play\\'). The only other bonus feature is a short, if informative interview with Cannell, who reveals that the character of Joseph \"Rocky\" Rockford was modeled after his own father.', '--Kathleen C. Fennessy']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'James Garner, Joe Santos, Noah Beery, Jr., Stuart Margolin', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 0.01 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '18 hours and 29 minutes', 'Release date': 'June 13, 2006', 'Actors': 'James Garner, Noah Beery, Jr., Joe Santos, Stuart Margolin', 'Subtitles': 'English', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '6'}\nReview Text: I have truly enjoyed watching the Rockford Files. This was one of my favorites shows on television and to have this collection is great.  It is Rockford at his best.  I am waiting for the release of the next season.\nReview Title: Rockford Files are the Best\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Adventures of Superman: The Complete Third & Fourth Seasons\nReview Date: 2006/11/15\nStore: George Reeves  (Actor),     Phyllis Coates  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['Adventures of Superman, The Complete 3rd & 4th Seasons (DVD) (Multi-Title)', \"George Reeves returns as Superman (aka Clark Kent) in 26 episodes comprising Season 3 and Season 4 of the program that ran six seasons total. This time his exploits take him to stuffy European monarchy, a remote desert isle and even a cave in the year 50,000 BC. And now for the first time the Man of Steel's exciting flights, fights, and super heroics are presented in color!\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Action & Adventure', 'Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Contributor': 'Noel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert MaxwellNoel Neill, Whitney Ellsworth, Bernard Luber, Phyllis Coates, Robert Shayne, John Hamilton, George Reeves, Jack Larson, Robert Maxwell  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 1 inches; 8.8 Ounces', 'Item model number': '2210928', 'Media Format': 'Color, NTSC, Box set, Multiple Formats, Closed-captioned, Subtitled', 'Run time': '11 hours and 46 minutes', 'Release date': 'June 20, 2006', 'Actors': 'George Reeves, Phyllis Coates, Noel Neill, Jack Larson, John Hamilton', 'Subtitles': 'Spanish, French', 'Producers': 'Whitney Ellsworth, Bernard Luber, Robert Maxwell', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nReview Text: I remember seeing these shows on TV as a child.  It is such a releef to see these shows again.  They are so relaxing and comforting knowing how the world is these days.  A Super hero for the imigination as a series is wonderful.  I am happy to be able to see these shows again and remember when.  They may not have the action and effects as current day superman movies, but these are great to have in any film library.\nReview Title: TV's Superman\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lackawanna Blues\nReview Date: 2008/12/16\nStore: S. Epatha Merkerson  (Actor),     Marcus Carl Franklin  (Actor),     George C. Wolfe  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Product Description', 'Based on the award winning play by Ruben Santiago-Hudson, this poignant and colorful drama tells the inspirational story of a courageous woman, Nanny, whose spirit and strength served as the foundation for a struggling community trying to survive during the segregation era. Starring an exceptional ensemble cast led by Jimmy Smits, Rosie Perez, and Macy Gray, this inspiring drama from HBO Films is a celebration of the good things in life, no matter how tough times may be.', 'DVD Features:', 'Audio Commentary:', 'Audio Commentary with director George C. Wolfe and writer Ruben Santiago-Hudson', 'Deleted Scenes', 'Featurette', 'Amazon.com', 'Cool music, a wonderful atmospheric feel, and first-rate performances by a stellar cast distinguish', 'Lackawanna Blues', \", a 2005, 90-minute film originally broadcast by HBO. Director George C. Wolfe's theater background (as a writer and/or director he's been responsible for\", 'The Colored Museum', ',', \"Jelly's Last Jam\", ', and', 'Bring in Da Noise, Bring in Da Funk', ') is apparent; adapted by scriptwriter Ruben Santiago-Hudson from his own autobiographical play,', 'Lackawanna Blues', 'is less a story than a reminiscence, told by a young man (an affecting performance by Marcus Carl Franklin) raised by the indefatigable Rachel \"Nanny\" Crosby (an equally fine turn by S. Epatha Merkerson, known to many from her role in TV\\'s', 'Law & Order', \") in that upstate New York town. The focus is on Nanny's rooming house, which is populated by all manner of colorful characters (played by the likes of Macy Gray, Jeffrey Wright, and many others, with Jimmy Smits and Carmen Ejogo as the boy's wayward parents). The roomers include drunks, hustlers, ex-cons, and other shady types, but while plenty of bad stuff goes on, it's all coated with a certain patina of sentiment that tends to minimize the hard realities of life for African Americans in the early 1960s. That's fine; Wolfe, with the help of some superb editing by Brian Kates, gives the film such a delightful period vibe that it's easy to overlook its few shortcomings. The music (available on a\", 'soundtrack CD', '), ranging from downhome country blues to uptown swing, jump blues, and more, also makes a major contribution to the delightful diversion that is', 'Lackawanna Blues', '.', '--Sam Graham']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'DRAMA', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Delroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Louis Gossett Jr., Rosie PerezDelroy Lindo, Halle Berry, Terrence Howard, S. Epatha Merkerson, George C. Wolfe, Ivan Strasburg, Ernie Hudson, Ruben Santiago-Hudson, Yasiin Bey, Carmen Ejogo, Vincent Cirrincione, Bill Simms Jr., Macy Gray, Marcus Carl Franklin, Nellie Nugiel, Shelby Stone, Loui…   See more', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': '92749', 'Director': 'George C. Wolfe', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'August 23, 2005', 'Actors': 'S. Epatha Merkerson, Marcus Carl Franklin, Yasiin Bey, Carmen Ejogo, Bill Simms Jr.', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Halle Berry, Nellie Nugiel, Ruben Santiago-Hudson, Shelby Stone, Vincent Cirrincione', 'Studio': 'HBO Studios', 'Writers': 'Ruben Santiago-Hudson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This was a very heart warming movie.  Very good acting.  I truly enjoyed it.\nReview Title: Very Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Richard Pryor Here and Now / Richard Pryor Live on the Sunset Strip - Set\nReview Date: 2011/01/29\nStore: Richard Pryor  (Actor, Director, Writer),     Gene Cross  (Actor),     Joe Layton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Double Feature - 2 Discs.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Stand-Up', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Gene Cross, Jesse Jackson, Paul Mooney, Richard Pryor, Julie Hampton, Joe Layton', 'Language': 'Unqualified', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2226995', 'Director': 'Joe Layton, Richard Pryor', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'September 1, 2009', 'Actors': 'Richard Pryor, Gene Cross, Julie Hampton, Jesse Jackson, Paul Mooney', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Paul Mooney, Richard Pryor', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: This was a wonder DVD, to have two shows in one is just wonderful.  My family really enjoyed him.\nReview Title: Richard Pryor\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 5, Vol. 2\nReview Date: 2011/01/29\nStore: Raymond Burr  (Actor),     William Hopper  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'William Talman, William Hopper, Raymond Burr, Barbara Hale, Ray Collins', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.57 x 5.4 x 7.49 inches; 5.15 Ounces', 'Item model number': '540985592', 'Media Format': 'Multiple Formats, Box set, Black & White, Color, Full Screen, NTSC, Subtitled', 'Run time': '12 hours and 53 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, William Hopper, William Talman, Ray Collins', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I have the complete set of all TV shows of Perry Mason, and cannot get enough of watching them. Just a Perry Mason FAN for a very long time.  I JUST LOVE THEM...\nReview Title: Perry Mason\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nick Carter Mysteries Triple Feature\nReview Date: 2013/08/15\nStore: Walter Pidgeon  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Private eye Nick Carter\\'s detective adventures encompassed over 1000 stories, a 1943-1955 radio series and, among his screen heroics, these three MGM \"Bs\" starring Walter Pidgeon (soon to be Greer Garson\\'s costar in nine films, including Mrs. Miniver). In Nick Carter, Master Detective, someone is sabotaging the creation of an innovative high-speed aircraft at Radex Corporation. Can Carter, posing as an executive at Radex, unmask the culprits and save the project? Phantom Raiders has Carter taking on a deadly case involving the mysterious sinking of cargo ships leaving Colon, Panama. In Sky Murder, our hero exposes an anti-U.S. spy operation while protecting a woman marked for death. Sharing the adventures and adding to the frequently comic tone of the storylines is beekeeper and Carter\\'s assistant \"Beeswax\" (Donald Meek), who sometimes sends a fistful of bees into action to help him escape a dire situation.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'NTSC', 'Contributor': 'Walter Pidgeon', 'Language': 'English', 'Runtime': '3 hours and 21 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '397720', 'Media Format': 'NTSC', 'Run time': '3 hours and 21 minutes', 'Release date': 'April 23, 2013', 'Actors': 'Walter Pidgeon', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Just what I expected.  The quality of the DVD is very good.  I have enjoyed these mysteries and to have three on the same DVD is so great.  It had been a long time since I saw any of these movies, but now I can watch as I wish, and as I said the quality if very good.\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 8, Vol. 2\nReview Date: 2013/08/15\nStore: Raymond Burr  (Actor),     Barbara Hale  (Actor),     Arthu Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Renowned defense attorney Perry Mason is back on the front lines of justice in the 15 final episodes of Season Eight. Two-time Emmy® winner Raymond Burr brings his signature brand of clever questioning and deductive reasoning to cap off a killer season, which includes mischievous dolls, deadly debts and murderous mermaids. Always by his side are Detective Paul Drake (William Hopper), loyal secretary Della Street (Barbara Hale), and homicide officer Andy Anderson (Wesley Lau). In this four-disc, digitally remastered collection, courtroom fireworks are on full display, and one of television’s most iconic legal thrillers is at its peak.']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.96 Ounces', 'Item model number': '35048550908', 'Director': 'Arthu Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Full Screen, Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 52 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I thought I had all of the Perry Mason series, from Columbia House back in the day, but I find out from this one I do not.  I now have to get vol 1.  I have always enjoyed Perry Mason, and this DVD just adds to the enjoyment.\nReview Title: GREAT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Perry Mason: Season 8, Vol. 1\nReview Date: 2013/11/11\nStore: Raymond Burr  (Actor),     Barbara Hale  (Actor),     Arthur Marks  (Director),     Jesse Hibbs  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Contributor': 'Jerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray CollinsJerry Hopper, Arthur Marks, William Talman, William Hopper, Harmon Jones, Raymond Burr, Jesse Hibbs, Barbara Hale, Ray Collins   See more', 'Language': 'English', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 3.21 Ounces', 'Item model number': '2409811098', 'Director': 'Arthur Marks, Jesse Hibbs, Jerry Hopper, Harmon Jones', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Black & White', 'Run time': '12 hours and 54 minutes', 'Release date': 'August 4, 2015', 'Actors': 'Raymond Burr, Barbara Hale, William Hopper, Ray Collins, William Talman', 'Subtitles': 'English', 'Studio': 'Paramount', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I love me some Perry Mason, and years ago I thought I had all episodes but this set I did not have.  The quality was great and it was a great addition to my collection.\nReview Title: wonderful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Winter Kill (1974 Tvm)\nReview Date: 2013/11/11\nStore: Andy Griffith  (Actor),     John Larch  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: [\"Six years after he completed his long run as Sheriff Andy Taylor on The Andy Griffith Show, the beloved TV star returned as a small-town lawman in Winter Kill. Griffith brought the same common sense and friendly, laconic style to his new role, but Police Chief Sam McNeill has something more challenging than Mayberry's town drunk to deal with: life-and-death mystery. The ski resort Sam protects is the target of a serial killer who leaves no clues except taunting messages spray-painted next to the bodies of his -- or her -- victims. Among the supporting cast, look for a fresh-faced Nick Nolte as a womanizing ski instructor.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC, Black & White', 'Contributor': \"Tim O'Connor, Lawrence Pressman, Eugene Roche, Andy Griffith, John Larch, Jud Taylor\", 'Language': 'Unqualified', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'Full Screen, NTSC, Black & White', 'Run time': '1 hour and 34 minutes', 'Release date': 'February 24, 2010', 'Actors': \"Andy Griffith, John Larch, Tim O'Connor, Lawrence Pressman, Eugene Roche\", 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have always enjoyed Andy Griffith, and this movie is one of a series of three that I remember, and it is a good movie.  I truly enjoyed this movie and waiting for the other one called \"The empty grave\"  .\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hildegarde Withers Mysteries Movies Collection [DVD]\nReview Date: 2014/01/19\nStore: Edna May Oliver  (Actor),     Robert Armstrong  (Actor),     George Archainbaud  (Director),     Lloyd Corrigan  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Stuart Palmer's immortal crime-solving school teacher Hildegarde Withers came to the screen courtesy of a series of mysteries from RKO Pictures. Memorably played by character great Edna May Oliver in three features, Hildegarde was ably paired with her flirty foil of Inspector Piper in the person of James Gleason. Gleason would go on to anchor the series, appearing in all six, alongside Helen Broderick for one and Zasu Pitts for the final two.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Bruce Cabot, Lloyd Corrigan, Edna May Oliver, Edward F. Cline, Ben Holmes, Joan Woodbury, Zasu Pitts, Marjorie Lord, George Archainbaud, Mae Clarke, Lola Lane, William Hamilton, Robert Armstrong, James Gleason, Regis Toomey, Helen Broderick, Stuart Palmer, Leo G. Carroll, Edward Killy, Paul FixBruce Cabot, Lloyd Corrigan, Edna May Oliver, Edward F. Cline, Ben Holmes, Joan Woodbury, Zasu Pitts, Marjorie Lord, George Archainbaud, Mae Clarke, Lola Lane, William Hamilton, Robert Armstrong, James Gleason, Regis Toomey, Helen Broderick, Stuart Palmer, Leo G.…   See more', 'Language': 'English', 'Runtime': '6 hours and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '402733', 'Director': 'George Archainbaud, Lloyd Corrigan, William Hamilton, Edward Killy, Ben Holmes', 'Media Format': 'DVD, NTSC', 'Run time': '6 hours and 47 minutes', 'Release date': 'July 23, 2013', 'Actors': 'Edna May Oliver, Robert Armstrong, James Gleason, Mae Clarke, Bruce Cabot', 'Studio': 'Warner Archive Collection', 'Writers': 'Stuart Palmer', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I have waited for these movies to be released.  I watched these movies, not knowing that there had been three women to play Hildagard Withers.  Edna May Oliver is my favorite.  Helen Crawford and Zusa P. were good, but no one is or was as good as Edna May Oliver.  There are eight good movies in the package.  The picture quality is good.  I simply enjoy good entertainment with simple plots and the characters are that ---entertaining.\nReview Title: Enjoyed the Movies\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Deadly Game (1977 Tvm)\nReview Date: 2014/01/19\nStore: Andy Griffith  (Actor),     Mitzi Hoag  (Actor),     Lane Slate  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"A truckload of lethal U.S. Army chemicals spills in Police Chief Abel Marsh's town. People die. Land is contaminated. What a dreadful accident if it is an accident. And if it isn't, just what the heck is going on? Andy Griffith is back as Abel Marsh in a second telefilm about dark doings in the quirky mountain village of Jasper Lake. The fine supporting cast includes James Cromwell (Babe, The Queen) as Abel's bashful deputy. But it's Griffith's show all the way as he proves that when it comes to playing a deadly game, never underestimate laid-back, down-home and very able Abel Marsh.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': 'Full Screen, NTSC', 'Contributor': 'Claude Earl Jones, Lane Slate, James Cromwell, Andy Griffith, Mitzi Hoag, Sharon Spelman', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Lane Slate', 'Media Format': 'Full Screen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 24, 2010', 'Actors': 'Andy Griffith, Mitzi Hoag, James Cromwell, Claude Earl Jones, Sharon Spelman', 'Studio': 'MGMTV', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I like this movie.  It was made for TV and it is not shown very often, so I was pleased when I saw it on video.  Another movie wit Andy Griffin in the same character called empty grave, I am waiting for.  I am an Andy Griffin fan.\nReview Title: Good Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shaka Zulu - The Complete 10 Part Television Epic\nReview Date: 2014/01/19\nStore: Edward Fox  (Actor),     Robert Powell  (Actor),     William C. Faure  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, A&E Home Video, All A&E Titles\nProduct Description: ['Product Description', \"England is spreading its control in Africa. Also amassing control is Shaka, the great leader of the Zulu nation. His innovations in warfare and brutal treatment of both friend and enemy allow him to dominate surrounding tribes. On Queen Victoria's command, the two superpowers collide in epic battle. 8-1/2 hours on 4 DVDs.\", 'Amazon.com', 'This sweeping miniseries from 1986 captures the rise and fall of an African emperor.', 'Shaka Zulu', 'begins following a British expedition sent to bargain with the fearsome Zulu army assembling on the outer edges of the British colonies in South Africa. Led by Lt. Francis Farewell (', 'The Day of the Jackal', ',', 'A Bridge Too Far', \"), the expedition hopes to bamboozle a superstitious primitive, but their arrogance gets taken down a notch by a cunning and ruthless warlord who has unified vast territories through a combination of political charisma and military discipline. At this point, the focus shifts to how Shaka (the riveting Henry Cele), king of the Zulus, rose from a brutal childhood to royal grandeur--a semi-mythological tale filled with family strife, political intrigue, witchcraft, and bloody warfare. Powerful performances by Cele and Dudu Mikhize (as Shaka's iron-willed mother, Nandi) give this sprawling epic the drive and emotional scope of a Shakespearean drama.\", 'Shaka Zulu', 'also draws sneaky parallels between the Zulu and British empires, often to sharp satirical effect. Full of richly conceived characters and compelling political maneuvering, this eight-hour series brings faraway history to living, breathing life. Also featuring Christopher Lee (whose always-steady career exploded at age 79 with juicy roles in', 'The Lord of the Rings', 'and', 'Star Wars: Episode II, Attack of the Clones', ').', '--Bret Fetzer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Edward Fox, Patrick Ndlovu, Christopher Lee, William C. Faure, Trevor Howard, Robert Powell, Gordon Jackson, Henry Cele, Conrad Magwaza, Joshua Sinclair, Fiona Fullerton, Kenneth Griffith, Dudu Mkhize, Roy DotriceEdward Fox, Patrick Ndlovu, Christopher Lee, William C. Faure, Trevor Howard, Robert Powell, Gordon Jackson, Henry Cele, Conrad Magwaza, Joshua Sinclair, Fiona Fullerton, Kenneth Griffith, Dudu Mkhize, Roy Dotrice  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '4', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 11.2 Ounces', 'Director': 'William C. Faure', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '8 hours and 20 minutes', 'Release date': 'October 29, 2002', 'Actors': 'Edward Fox, Robert Powell, Trevor Howard, Fiona Fullerton, Christopher Lee', 'Studio': 'A&E Home Video', 'Writers': 'Joshua Sinclair', 'Number of discs': '4'}\nReview Text: I purchased this for my husband who loves the movie.  It is not for me but he loves it.  There is not much else I can say.\nReview Title: Good movie\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Falcon Mystery Movie Collection, Volume 1 (3 Discs) [DVD]\nReview Date: 2014/01/19\nStore: George Sanders  (Actor),     Tom Conway  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Miscreants beware! The Falcon is on the hunt! Suave, sophisticated, hard-boiled and high-minded, amateur sleuths Gay and Tom Lawrence AKA The Falcon were a perfect fit for the acerbic styling of siblings George Sanders and Tom Conway. Follow the saga from the start with this 3-disc, 7 film collection.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Suspense', 'Format': 'DVD, NTSC', 'Contributor': 'Tom Conway, George Sanders', 'Language': 'English', 'Studio': 'Warner Archive', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'DVD, NTSC', 'Release date': 'December 6, 2011', 'Actors': 'George Sanders, Tom Conway', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I love this series of movies, and to get them in a package it is great.  I love these old movies and enjoy them as easy and simple stories, with interesting characters, no deep meaning.\nReview Title: Great, Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dangerous Dames Collection\nReview Date: 2014/01/19\nStore: Barbara Stanwyck  (Actor),     Kirk Douglas  (Actor),     Various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['1. The Strange Love Of Martha Ivers', 'Cast: Barbara Stanwyck, Kirk Douglas, Van Heflin A predatory female (Stanwyck) plots to rid herself of a meek husband (Douglas) and silence a former lover (Heflin) who may have witnessed the \"untimely\" death of her mean-spirited, wealthy stepmother. (1 hr 56 min, B&W)', '2. Too Late For Tears', 'Cast: Lizabeth Scott, Arthur Kennedy Pennies from heaven quickly turn to blood money when a married couple (Scott, Kennedy) mistakenly receives a satchel of stolen cash and the faithless wife schemes to keep the loot for herself! (1 hr 39 min, B&W)', '3. Lady Of Burlesque', \"Cast: Barbara Stanwyck, Michael O'Shea A striptease artist (Stanwyck) is up to her neck in trouble when two fellow dancers are found strangled by their own g-strings and she becomes the prime suspect! (1 hr 31 min, B&W)\", '4. Blonde Ice', 'Cast: Leslie Brooks, Robert Paige A blonde bombshell (Brooks) rises from humble beginnings to become a successful society columnist by romancing wealthy men who all die under mysterious circumstances. One of the most deadly femme fatales in the history of film noir! (1 hr 13 min, B&W)', '5. A Life At Stake', 'Cast: Angela Lansbury, Keith Andes An enterprising businesswoman (Lansbury) has big plans for an out-of-work architect (Andes)--a lucrative job and an illicit love affair. Unfortunately for him, her plans also include murder! (1 hr 18 min, B&W)', '6. Please Murder Me', \"Cast: Angela Lansbury, Raymond Burr A sultry femme fatale (Lansbury) accused of killing her husband tricks a love-smitten attorney (Burr) into acquitting her. But when the lawyer learns he's been duped, he sets an ingenious trap to bring the murderess to justice. (1 hr 18 min, B&W)\"]\nAverage Rating: 4.1\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '8 hours and 48 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Barbara Stanwyck, Kirk Douglas, Van Heflin, Lizabeth Scott, Arthur Kennedy', 'Language': 'Unqualified', 'Studio': 'Pop Flix', 'Number of discs': '2'}\nReview Text: I am one of those classic movie fans, and just adore old black and white movies.  This collection is good for the ones I have seen.\nReview Title: Love It\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TCM Spotlight: Charlie Chan Collection (Dark Alibi / Dangerous Money / The Trap / The Chinese Ring)\nReview Date: 2014/01/19\nStore: Sidney Toler  (Actor),     Roland Winters  (Actor),     Phil Karlson  (Director),     Terry O. Morse  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['TCM Spotlight: Charlie Chan Collection']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Suspense/Thrillers, Comedy, Mystery & Suspense/Crime, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Black & White, NTSC, Subtitled', 'Contributor': 'Benson Fong, Gloria Warren, Roland Winters, Sidney Toler, Mantan Moreland, William Beaudine, Howard Bretherton, Victor Sen Yung, Terry O. Morse, Phil KarlsonBenson Fong, Gloria Warren, Roland Winters, Sidney Toler, Mantan Moreland, William Beaudine, Howard Bretherton, Victor Sen Yung, Terry O. Morse, Phil Karlson  See more', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 19 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 9.6 Ounces', 'Item model number': 'WARD120258D', 'Director': 'Phil Karlson, Terry O. Morse, Howard Bretherton, William Beaudine', 'Media Format': 'Multiple Formats, Box set, Black & White, NTSC, Subtitled', 'Run time': '3 hours and 19 minutes', 'Release date': 'June 8, 2010', 'Actors': 'Sidney Toler, Roland Winters, Benson Fong, Victor Sen Yung, Gloria Warren', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: I am a Charlie Chan fan, and like all of the Chan movies.  This package is very good.  The quality is wonderful.  No complaints\nReview Title: Glove them\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/12/09\nAverage Rating: 4.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Phil Rosen'], 'Producers': ['James S. Burkett'], 'Starring': ['Sidney Toler', 'Benson Fong']}\nReview Text: I do not care what movie of Charlie Chan I watch, I just love the series.  Any Charlie Chan move is a go for me at any time.\nReview Title: Charlie Chan, entertainment to enjoy\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user exhibits a strong preference for classic television shows and films, enjoying the nostalgia and high-quality storytelling they provide. They consistently praise the acting, particularly highlighting iconic performances, and express excitement over acquiring complete seasons or collections. The user appreciates well-crafted narratives and characters that resonate with them, indicating satisfaction with their purchases. There is a recurring theme of eagerness for upcoming releases, showcasing an enthusiasm for the genre. Overall, the sentiment towards their purchases is overwhelmingly positive, portraying a deep appreciation for the entertainment value.\n\nNEGATIVE SUMMARY:\nWhile the user generally enjoys their selections, some comments hint at certain limitations within the collections. Concerns are noted about the lack of supplemental material accompanying certain titles, potentially leaving fans wanting more in terms of behind-the-scenes insights or additional content. In instances where they purchased sets without prior knowledge of the complete series, slight disappointment is evident. Additionally, there is an acknowledgment that certain classic productions may not hold up to the standards of modern filmmaking, which could affect their overall enjoyment despite the charm of the originals.\n\nOVERALL SUMMARY:\nThe user's purchase history reveals a passionate affinity for classic movies and television series, particularly in the mystery, drama, and adventure genres. Positive experiences are highlighted by admiration for the performances, writing quality, and nostalgic value of the shows. However, there are slight criticisms regarding the absence of additional features in some collections and the contrast between classic and contemporary production values. Nonetheless, the user remains committed to expanding their collection and reliving the beloved gems of television history, resulting in a rewarding, albeit occasionally mixed, viewing experience.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Good Movie",
    "text": "I just love this movie, it is so good to see how prayer is so wonderful",
    "images": [],
    "asin": "B014Q781VM",
    "parent_asin": "B014Q781VM",
    "user_id": "AH4IB62EYR2M5H5CF2ZSEI5YSIRA",
    "timestamp": "2017-08-17 19:04:17.950000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.9,
    "rating_number": 39054,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/0f22b53fb2315ae0001d02556d8f88b32db6112952de46b335273005bc9ca608._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/0f22b53fb2315ae0001d02556d8f88b32db6112952de46b335273005bc9ca608._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/0f22b53fb2315ae0001d02556d8f88b32db6112952de46b335273005bc9ca608._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/0f22b53fb2315ae0001d02556d8f88b32db6112952de46b335273005bc9ca608._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/0f22b53fb2315ae0001d02556d8f88b32db6112952de46b335273005bc9ca608._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/0f22b53fb2315ae0001d02556d8f88b32db6112952de46b335273005bc9ca608._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English",
        "English [Audio Description]"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Alex Kendrick"
      ],
      "Producers": [
        "Stephen Kendrick"
      ],
      "Starring": [
        "Karen Abercrombie",
        "Priscilla Shirer",
        "T.C. Stallings"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}