{
  "user_id": "AG5OIS47JWSGCXYGRGA5HBZPHKTQ",
  "summary": "=== Purchase Information ===\nProduct Title: Bleach Uncut Set 17 (DVD)\nReview Date: 2013/07/05\nStore: Various  (Actor, Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Anime\nProduct Description: ['Product Description', 'Bleach Uncut Set 17 (DVD)', 'Ichigo and the Soul Reapers find themselves in a brutal battle against their own Zanpakuto, who are being controlled by Muramasa. But the chaos in the Seireitei is just one part of Muramasa’s plan. His true objective lies in the World of the Living, and Ichigo is the key to his achieving it!', ']]>', 'Amazon.com', 'The 17th set of the hit fantasy-adventure', 'Bleach', 'comprises the second half of the \"Zanpakuto Unknown Tales Arc\" (episodes 230 to 265), an anime-only storyline. The Zanpakuto is both the weapon of a Soul Reaper and the mirror of his personality and strength. The appearance of the Zanpakuto as independent warriors threw the Soul Society into chaos in the first half of the adventure, but a series of unexpected revelations throws new light on those events. Ichigo and the Soul Reaper Captains continue their battle against Muramasa, the leader of the revolt. Centuries ago, this eerie, serpentine manifestation was the Zanpakuto of Koga, an extraordinarily powerful member of the Kuchiki clan, the family Rukia and Byakuya belong to. But Koga fell prey to arrogance, and the punishment for his crimes has stretched over the ages to the present day, threatening Ichigo and his friends in both the Seireitei and Karakura Town. Although the unexpected shifts in the plot give an added frisson of excitement to the battles, many of these episodes feel padded. The challenges, declarations, and boasts that precede the duels, while an essential part of', 'Bleach', '(and historic samurai culture), get a bit repetitious in the first episodes. And in the later ones, the viewer begins to wonder just how much killing Muramasa takes. The story concludes with a declaration of the singular bond between a Soul Reaper and a Zanpakuto that transcends even a samurai\\'s link to his swords. For once, Ichigo and Zangetsu, Byakuya, and Senbonzakura agree. After this adventure, director Noriyuki Abe and his crew returned to the storyline of Tite Kubo\\'s original manga with the 50-episode \"Arrancar: Downfall\" arc. (Rated Teen: violence, violence against women, grotesque imagery, risqué humor)', '--Charles Solomon', \"(243. One-to-One Fight! Ichigo vs. Senbonzakura! 244. The Long Awaited… Kenpachi Appears! 245. Pursue Byakuya! The Confused Gotei Divisions! 246. Special Mission! Rescue Captain-Commander Yamamoto! 247. Deceived Shinigami! The World Collapse Crisis! 248. Dragon of Ice and Dragon of Flame! The Strongest Showdown! 249. Senbonzakura's Bankai! Offense and Defense of the Living World! 250. That Man, For the Sake of the Kuchiki! 251. Dark History! The Worst Shinigami Is Born! 252. Byakuya, the Truth Behind His Betrayal! 253. Muramasa's True Identity Revealed! 254. Byakuya and Renji, the 6th Division Returns! 255. Final Chapter: Zanpakutō Unknown Tales!)\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Anime', 'Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English, Japanese', 'Number Of Discs': '3', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Run time': '5 hours and 10 minutes', 'Release date': 'June 11, 2013', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Sadly the aspect ratio is still 1.33:1 ...the anime changed to 16:9 during the Amagai Shusuke arc. (ep 168). Though it remains a great example of anime.\nReview Title: Bleach\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harsh Realm : The Ultimate Mind Game - The Complete Series (Three-Disc Collector's Edition)\nReview Date: 2016/09/30\nStore: Scott Bairstow  (Actor),     D.B. Sweeney  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', \"After Lieutenant Tom Hobbes agrees to test the military's virtual reality war game, he discovers his only way out of the game's deadly world is to kill the top player. The complete series of Harsh Realm.\", 'Amazon.com', 'The dark and fantastic', 'Harsh Realm', ', a science fiction series about a war fought by flesh-and-blood humans trapped inside virtual reality, was launched by', 'The X-Files', 'creator Chris Carter in 1999 and died a regrettable, premature death on the Fox channel after three episodes. The remaining six shows found sanctuary on the FX network, and then', 'Harsh Realm', 'slipped into history, its wild story, based on a comic book, far from resolved. Perhaps', 'Harsh Realm', \"'s ratings failure had something to do with its broad similarities to the hugely popular\", 'The Matrix', \", released only a few months before, or, for that matter, David Cronenberg's 1999\", 'eXistenZ', ', in which characters fight for their lives inside a video game. Whatever the reason, enough time has passed to take an objective look at', 'Harsh Realm', ', and there is a lot to be admired in its high level of imagination, complex plotting, and cutting-edge production values.', 'Scott Bairstow stars as U.S. Army Lieutenant Tom Hobbes, a decorated hero who risked his life rescuing a buddy, Major Mel Waters (Max Martini), during a peacekeeping mission in the former Yugoslavia. Set to return to civilian life and marry his fiancée, Sophie (Samantha Mathis), Hobbes is summoned by a mysterious superior (Lance Henriksen) and asked to test-run', 'Harsh Realm', ', a virtual reality war game devised by the Pentagon. Once he begins, however, Hobbes is mentally imprisoned in the dangerous game (his body, along with those of hundreds of other \"volunteers,\" is cared for in a secret military hospital), where he is identified by other, desperate captives as the savior they\\'ve been awaiting. D.B. Sweeney is very good as another soldier, Mike Pinocchio, whose sense of mission is re-awakened by Hobbes and who becomes a partner in an endless effort to defeat a madman named Santiago (Terry O\\'Quinn), who rules', 'Harsh Realm', 'from within. As with', 'The X-Files', ', the nine episodes in this boxed set are each very striking on their own terms, with post-apocalyptic sets, constant surprises, and that special Chris Carter touch (fans of his', 'Millennium', 'will like', 'Harsh Realm', ', too) that makes every story look and feel like a collision of a nightmare and a crisis of faith.', '--Tom Keogh']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Science Fiction', 'Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Contributor': \"Cameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane RedmondCameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane Redmond   See more\", 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Surround)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Media Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Run time': '6 hours and 27 minutes', 'Release date': 'August 24, 2004', 'Actors': \"Scott Bairstow, D.B. Sweeney, Terry O'Quinn, Rachel Hayward, Max Martini\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Home Entertainment', 'Writers': 'Chris Carter', 'Number of discs': '3'}\nReview Text: A fight for dominance in a VR world. As always a sim-ple foray into technology. An analogy of human vices and virtues. A few episodes were good, a few weren't.\nReview Title: A few episodes were good, a few weren't\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: V: The Original Miniseries [Blu-ray]\nReview Date: 2020/05/10\nStore: Thomas Hill  (Actor),     Marc Singer  (Actor),     Kenneth Johnson  (Director)    &                   0                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Fifty spaceships, each three miles across, hover ominously above Earth's major cities. The Visitors that emerge are humanlike in appearance and extend the hand of friendship. Our planet's resources are just what these aliens need to survive. And for its future survival, unsuspecting humankind will need...a miracle! Kenneth Johnson's science-fiction spectacular mixes dynamic special effects with cliffhanger thrills. As fascist rule enslaves the globe, freedom fighters battle to save our species. Marc Singer heads an epic-sized cast of human defenders and -- behind sleek uniforms and benevolent behavior -- reptilian invaders. For unparalleled extraterrestrial excitement, the invaders of V are unstoppable.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'NTSC, Widescreen', 'Contributor': 'Momo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patterson, Russell Enoch, Eric Johnston, Richard Lawson, Michael Swan, William Russ, Blair Tefkin, Michael Alldredge, Stephanie Faulkner, Marin May, Jason Bernard, Richard Herd, Hansford Rowe, Wiley Harker, Diane Civita, Evan Kim, Frank Ashmore, Curt Lowens, David Packer, Camila Ashlend, Faye Grant, Penelope Windust, Camila Ashland, George Morfogen, Mary Alan Hokanson, Stack Pierce, Howard K. Smith, Bonnie Bartlett, Rafael Campos, Josh Brooks, Thomas Hill, Jennifer Perito, Michael Bond, Jenny Neumann, Peter NelsonMomo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patters…  See more', 'Language': 'English', 'Runtime': '3 hours and 17 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Kenneth Johnson', 'Media Format': 'NTSC, Widescreen', 'Run time': '3 hours and 17 minutes', 'Release date': 'August 27, 2019', 'Actors': 'Thomas Hill, Marc Singer, Faye Grant, Jane Badler, Michael Durrell', 'Subtitles': 'English', 'Studio': 'Warner Archives', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: to remind of how terrible this show was...hehe. Nice video quality. Happy with the buy.\nReview Title: Had to watch it again\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/06/10\nAverage Rating: 3.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zander Weaver'], 'Producers': ['Elliot Weaver', 'Zander Weaver'], 'Starring': ['Tom England', 'Joshua Ford']}\nReview Text: not the worst movie ever...though an hour and 50 minutes of three dudes in a car is a bit chintzy...dialogue wasn't horrible, there was some suspense...though the ending was like the main body of the film...no substance.\nReview Title: lowest...budget...ever\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/02/18\nAverage Rating: 3.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Love'], 'Producers': ['Allan Niblo'], 'Starring': ['Stephen Dorff', 'Eddie Griffin'], 'Studio': ['More to Explore']}\nReview Text: A simple film about \"under-achievers\"(ie: Hancock). Shown as a simple man with telekinesis using it as a petty tool rather than as a world shaking discovery. It makes sense when viewed metaphorically, though the film itself left a bit to be desired. The film does however show a bit of the life that many of the \"lower class\" are forced to endure...the 2 stars are for that and nothing more.\nReview Title: Are you tired of metaphors?\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Tomorrow War\nReview Date: 2021/07/17\nCategories: Suspense, Drama, Compelling, Frightening\nProduct Description: ['Time travelers arrive from 2051 to deliver an urgent message: 30 years in the future mankind is losing a war against a deadly alien species. The only hope for survival is for soldiers and civilians to be transported to the future and join the fight. Determined to save the world for his daughter, Dan Forester teams up with a brilliant scientist and his estranged father to rewrite the planet’s fate.']\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Italiano', '日本語', 'Português', 'Deutsch', 'தமிழ்', 'हिन्दी', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'తెలుగు', 'Français (France)'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Chris McKay'], 'Producers': ['Rob Cowan', 'Leifur B. Dagfinnsson', 'Jules Daly', 'David Ellison', 'Bradley J. Fischer', 'Dana Goldberg', 'David S. Goyer', 'Don Granger', 'Hjortur Gretarsson'], 'Starring': ['Chris Pratt', 'J.K. Simmons', 'Yvonne Strahovski']}\nReview Text: Yet another wild metaphor filled journey into a family's struggle to make it through the tough times...Hollywood is good at exaggerating everyone's struggle while they don't live through any of it.\nReview Title: A crazy family flick\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/07/21\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chip Chalmers', 'Cliff Bole', 'Corey Allen', 'David Carson', 'David Livingston', 'Gabrielle Beaumont', 'Jonathan Frakes', 'Les Landau', 'Patrick Stewart', 'Paul Lynch', 'Peter Lauritson', 'Robert Lederman', 'Robert Scheerer', 'Robert Weimer', 'Winrich Kolbe'], 'Producers': ['Rick Berman', 'Michael Piller', 'Jeri Taylor'], 'Starring': ['Patrick Stewart', 'Jonathan Frakes', 'Levar Burton'], 'Studio': ['CBS']}\nReview Text: This episode was a commentary on why a species went extinct. Picard and the Enterprise encounter a probe, the probe forces it's way into Picard's mind and sends him into \"the Matrix\", a 40 year simulation in his mind, while his crew can do nothing to help him without killing him. From within this \"matrix\" he is forced to live someone else's perspective and life for several decades. The species eventually goes extinct while forcing Picard to watch as the probes that r*pe him later are sent into space. He awakens on his own ship with a flute and a song...wow (like your r*pist giving you flowers and a mix-tape.) This is not a story of love or courage etc etc...it is a sad tale of why that species went extinct...because they were selfish and didn't care about others.<br /><br />Ask yourself, \"was the first time I cried emotionally because of my own life or was it because of a fictional character in a movie, book or TV?\"\nReview Title: The title and episode showing that time is relative...\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2022/11/21\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'ಕನ್ನಡ', 'Italiano', 'Deutsch', 'தமிழ்', 'עברית', 'Indonesia', 'Português (Portugal)', 'Tiếng Việt', 'Español (Latinoamérica)', 'Ελληνικά', 'తెలుగు', 'Français (France)', 'Bahasa Melayu', 'Français (Canada)', 'Filipino', '日本語', 'Português (Brasil)', 'Nederlands', 'മലയാളം', 'Español (España)', 'हिन्दी', 'العربية', 'Polski', 'Čeština', 'Magyar', 'Türkçe', 'ไทย', 'Català', 'Română'], 'Subtitles': ['English [CC]', 'العربية', 'Català', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Euskara', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'Galego', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', 'ಕನ್ನಡ', '한국어', 'മലയാളം', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Vincenzo Natali', 'Alrick Riley'], 'Producers': ['Jonah Nolan', 'Lisa Joy', 'Athena Wickham'], 'Starring': ['Chloe Grace Moretz', 'Jack Reynor', 'Gary Carr']}\nReview Text: Nothing new here, just the same old stuff. Sims and time-travel etc etc. It started decently for the first 2 eps and then it fell apart. Way too much elitist snobbery and blah blah blah. Probably last 1 season, maybe 2.\nReview Title: Same old stuff\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2023/01/04\nAverage Rating: 2.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Kyle Newman'], 'Producers': ['Jason Moring', 'Michael Philip', 'Richard Alan Reid'], 'Starring': ['Paris Berelc', 'Taylor Zakhar Perez', 'Hari Nef'], 'Studio': ['STARZ']}\nReview Text: Teaching children to be confused. Sorry, not for me\nReview Title: Another wasted day\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2023/01/04\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Currie'], 'Producers': ['Paul Currie', 'Jodi Matterson', 'Bruce Davey', 'Steve Hutensky'], 'Starring': ['Teresa Palmer', 'Sam Reid', 'Michiel Huisman'], 'Studio': ['Magnolia Pictures']}\nReview Text: Of all of the movies I've seen, this is one of them. Another Groundhog Day-esque movie. It was worth watching once. Acting was decent. Chemistry and such was also pretty good. The story however lacked a real punch, it was awkward and seemed slapped together quickly. A lot of little elements from other works.<br /> I see patterns too.\nReview Title: Meh\nRating: 3.0\n--------------------------------------------------",
  "reference": "Bleach Uncut Set 17 (DVD)\nVarious  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Anime\n['Product Description', 'Bleach Uncut Set 17 (DVD)', 'Ichigo and the Soul Reapers find themselves in a brutal battle against their own Zanpakuto, who are being controlled by Muramasa. But the chaos in the Seireitei is just one part of Muramasa’s plan. His true objective lies in the World of the Living, and Ichigo is the key to his achieving it!', ']]>', 'Amazon.com', 'The 17th set of the hit fantasy-adventure', 'Bleach', 'comprises the second half of the \"Zanpakuto Unknown Tales Arc\" (episodes 230 to 265), an anime-only storyline. The Zanpakuto is both the weapon of a Soul Reaper and the mirror of his personality and strength. The appearance of the Zanpakuto as independent warriors threw the Soul Society into chaos in the first half of the adventure, but a series of unexpected revelations throws new light on those events. Ichigo and the Soul Reaper Captains continue their battle against Muramasa, the leader of the revolt. Centuries ago, this eerie, serpentine manifestation was the Zanpakuto of Koga, an extraordinarily powerful member of the Kuchiki clan, the family Rukia and Byakuya belong to. But Koga fell prey to arrogance, and the punishment for his crimes has stretched over the ages to the present day, threatening Ichigo and his friends in both the Seireitei and Karakura Town. Although the unexpected shifts in the plot give an added frisson of excitement to the battles, many of these episodes feel padded. The challenges, declarations, and boasts that precede the duels, while an essential part of', 'Bleach', '(and historic samurai culture), get a bit repetitious in the first episodes. And in the later ones, the viewer begins to wonder just how much killing Muramasa takes. The story concludes with a declaration of the singular bond between a Soul Reaper and a Zanpakuto that transcends even a samurai\\'s link to his swords. For once, Ichigo and Zangetsu, Byakuya, and Senbonzakura agree. After this adventure, director Noriyuki Abe and his crew returned to the storyline of Tite Kubo\\'s original manga with the 50-episode \"Arrancar: Downfall\" arc. (Rated Teen: violence, violence against women, grotesque imagery, risqué humor)', '--Charles Solomon', \"(243. One-to-One Fight! Ichigo vs. Senbonzakura! 244. The Long Awaited… Kenpachi Appears! 245. Pursue Byakuya! The Confused Gotei Divisions! 246. Special Mission! Rescue Captain-Commander Yamamoto! 247. Deceived Shinigami! The World Collapse Crisis! 248. Dragon of Ice and Dragon of Flame! The Strongest Showdown! 249. Senbonzakura's Bankai! Offense and Defense of the Living World! 250. That Man, For the Sake of the Kuchiki! 251. Dark History! The Worst Shinigami Is Born! 252. Byakuya, the Truth Behind His Betrayal! 253. Muramasa's True Identity Revealed! 254. Byakuya and Renji, the 6th Division Returns! 255. Final Chapter: Zanpakutō Unknown Tales!)\"]\n{'Genre': 'Anime', 'Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English, Japanese', 'Number Of Discs': '3', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Run time': '5 hours and 10 minutes', 'Release date': 'June 11, 2013', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nSadly the aspect ratio is still 1.33:1 ...the anime changed to 16:9 during the Amagai Shusuke arc. (ep 168). Though it remains a great example of anime.\nBleach\nHarsh Realm : The Ultimate Mind Game - The Complete Series (Three-Disc Collector's Edition)\nScott Bairstow  (Actor),     D.B. Sweeney  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', \"After Lieutenant Tom Hobbes agrees to test the military's virtual reality war game, he discovers his only way out of the game's deadly world is to kill the top player. The complete series of Harsh Realm.\", 'Amazon.com', 'The dark and fantastic', 'Harsh Realm', ', a science fiction series about a war fought by flesh-and-blood humans trapped inside virtual reality, was launched by', 'The X-Files', 'creator Chris Carter in 1999 and died a regrettable, premature death on the Fox channel after three episodes. The remaining six shows found sanctuary on the FX network, and then', 'Harsh Realm', 'slipped into history, its wild story, based on a comic book, far from resolved. Perhaps', 'Harsh Realm', \"'s ratings failure had something to do with its broad similarities to the hugely popular\", 'The Matrix', \", released only a few months before, or, for that matter, David Cronenberg's 1999\", 'eXistenZ', ', in which characters fight for their lives inside a video game. Whatever the reason, enough time has passed to take an objective look at', 'Harsh Realm', ', and there is a lot to be admired in its high level of imagination, complex plotting, and cutting-edge production values.', 'Scott Bairstow stars as U.S. Army Lieutenant Tom Hobbes, a decorated hero who risked his life rescuing a buddy, Major Mel Waters (Max Martini), during a peacekeeping mission in the former Yugoslavia. Set to return to civilian life and marry his fiancée, Sophie (Samantha Mathis), Hobbes is summoned by a mysterious superior (Lance Henriksen) and asked to test-run', 'Harsh Realm', ', a virtual reality war game devised by the Pentagon. Once he begins, however, Hobbes is mentally imprisoned in the dangerous game (his body, along with those of hundreds of other \"volunteers,\" is cared for in a secret military hospital), where he is identified by other, desperate captives as the savior they\\'ve been awaiting. D.B. Sweeney is very good as another soldier, Mike Pinocchio, whose sense of mission is re-awakened by Hobbes and who becomes a partner in an endless effort to defeat a madman named Santiago (Terry O\\'Quinn), who rules', 'Harsh Realm', 'from within. As with', 'The X-Files', ', the nine episodes in this boxed set are each very striking on their own terms, with post-apocalyptic sets, constant surprises, and that special Chris Carter touch (fans of his', 'Millennium', 'will like', 'Harsh Realm', ', too) that makes every story look and feel like a collision of a nightmare and a crisis of faith.', '--Tom Keogh']\n{'Genre': 'Science Fiction', 'Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Contributor': \"Cameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane RedmondCameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane Redmond   See more\", 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Surround)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Media Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Run time': '6 hours and 27 minutes', 'Release date': 'August 24, 2004', 'Actors': \"Scott Bairstow, D.B. Sweeney, Terry O'Quinn, Rachel Hayward, Max Martini\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Home Entertainment', 'Writers': 'Chris Carter', 'Number of discs': '3'}\nA fight for dominance in a VR world. As always a sim-ple foray into technology. An analogy of human vices and virtues. A few episodes were good, a few weren't.\nA few episodes were good, a few weren't\nV: The Original Miniseries [Blu-ray]\nThomas Hill  (Actor),     Marc Singer  (Actor),     Kenneth Johnson  (Director)    &                   0                  more   Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Fifty spaceships, each three miles across, hover ominously above Earth's major cities. The Visitors that emerge are humanlike in appearance and extend the hand of friendship. Our planet's resources are just what these aliens need to survive. And for its future survival, unsuspecting humankind will need...a miracle! Kenneth Johnson's science-fiction spectacular mixes dynamic special effects with cliffhanger thrills. As fascist rule enslaves the globe, freedom fighters battle to save our species. Marc Singer heads an epic-sized cast of human defenders and -- behind sleek uniforms and benevolent behavior -- reptilian invaders. For unparalleled extraterrestrial excitement, the invaders of V are unstoppable.\"]\n{'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'NTSC, Widescreen', 'Contributor': 'Momo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patterson, Russell Enoch, Eric Johnston, Richard Lawson, Michael Swan, William Russ, Blair Tefkin, Michael Alldredge, Stephanie Faulkner, Marin May, Jason Bernard, Richard Herd, Hansford Rowe, Wiley Harker, Diane Civita, Evan Kim, Frank Ashmore, Curt Lowens, David Packer, Camila Ashlend, Faye Grant, Penelope Windust, Camila Ashland, George Morfogen, Mary Alan Hokanson, Stack Pierce, Howard K. Smith, Bonnie Bartlett, Rafael Campos, Josh Brooks, Thomas Hill, Jennifer Perito, Michael Bond, Jenny Neumann, Peter NelsonMomo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patters…  See more', 'Language': 'English', 'Runtime': '3 hours and 17 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Kenneth Johnson', 'Media Format': 'NTSC, Widescreen', 'Run time': '3 hours and 17 minutes', 'Release date': 'August 27, 2019', 'Actors': 'Thomas Hill, Marc Singer, Faye Grant, Jane Badler, Michael Durrell', 'Subtitles': 'English', 'Studio': 'Warner Archives', 'Country of Origin': 'USA', 'Number of discs': '1'}\nto remind of how terrible this show was...hehe. Nice video quality. Happy with the buy.\nHad to watch it again\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zander Weaver'], 'Producers': ['Elliot Weaver', 'Zander Weaver'], 'Starring': ['Tom England', 'Joshua Ford']}\nnot the worst movie ever...though an hour and 50 minutes of three dudes in a car is a bit chintzy...dialogue wasn't horrible, there was some suspense...though the ending was like the main body of the film...no substance.\nlowest...budget...ever\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Love'], 'Producers': ['Allan Niblo'], 'Starring': ['Stephen Dorff', 'Eddie Griffin'], 'Studio': ['More to Explore']}\nA simple film about \"under-achievers\"(ie: Hancock). Shown as a simple man with telekinesis using it as a petty tool rather than as a world shaking discovery. It makes sense when viewed metaphorically, though the film itself left a bit to be desired. The film does however show a bit of the life that many of the \"lower class\" are forced to endure...the 2 stars are for that and nothing more.\nAre you tired of metaphors?\nThe Tomorrow War\nSuspense, Drama, Compelling, Frightening\n['Time travelers arrive from 2051 to deliver an urgent message: 30 years in the future mankind is losing a war against a deadly alien species. The only hope for survival is for soldiers and civilians to be transported to the future and join the fight. Determined to save the world for his daughter, Dan Forester teams up with a brilliant scientist and his estranged father to rewrite the planet’s fate.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Italiano', '日本語', 'Português', 'Deutsch', 'தமிழ்', 'हिन्दी', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'తెలుగు', 'Français (France)'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Chris McKay'], 'Producers': ['Rob Cowan', 'Leifur B. Dagfinnsson', 'Jules Daly', 'David Ellison', 'Bradley J. Fischer', 'Dana Goldberg', 'David S. Goyer', 'Don Granger', 'Hjortur Gretarsson'], 'Starring': ['Chris Pratt', 'J.K. Simmons', 'Yvonne Strahovski']}\nYet another wild metaphor filled journey into a family's struggle to make it through the tough times...Hollywood is good at exaggerating everyone's struggle while they don't live through any of it.\nA crazy family flick\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chip Chalmers', 'Cliff Bole', 'Corey Allen', 'David Carson', 'David Livingston', 'Gabrielle Beaumont', 'Jonathan Frakes', 'Les Landau', 'Patrick Stewart', 'Paul Lynch', 'Peter Lauritson', 'Robert Lederman', 'Robert Scheerer', 'Robert Weimer', 'Winrich Kolbe'], 'Producers': ['Rick Berman', 'Michael Piller', 'Jeri Taylor'], 'Starring': ['Patrick Stewart', 'Jonathan Frakes', 'Levar Burton'], 'Studio': ['CBS']}\nThis episode was a commentary on why a species went extinct. Picard and the Enterprise encounter a probe, the probe forces it's way into Picard's mind and sends him into \"the Matrix\", a 40 year simulation in his mind, while his crew can do nothing to help him without killing him. From within this \"matrix\" he is forced to live someone else's perspective and life for several decades. The species eventually goes extinct while forcing Picard to watch as the probes that r*pe him later are sent into space. He awakens on his own ship with a flute and a song...wow (like your r*pist giving you flowers and a mix-tape.) This is not a story of love or courage etc etc...it is a sad tale of why that species went extinct...because they were selfish and didn't care about others.<br /><br />Ask yourself, \"was the first time I cried emotionally because of my own life or was it because of a fictional character in a movie, book or TV?\"\nThe title and episode showing that time is relative...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'ಕನ್ನಡ', 'Italiano', 'Deutsch', 'தமிழ்', 'עברית', 'Indonesia', 'Português (Portugal)', 'Tiếng Việt', 'Español (Latinoamérica)', 'Ελληνικά', 'తెలుగు', 'Français (France)', 'Bahasa Melayu', 'Français (Canada)', 'Filipino', '日本語', 'Português (Brasil)', 'Nederlands', 'മലയാളം', 'Español (España)', 'हिन्दी', 'العربية', 'Polski', 'Čeština', 'Magyar', 'Türkçe', 'ไทย', 'Català', 'Română'], 'Subtitles': ['English [CC]', 'العربية', 'Català', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Euskara', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'Galego', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', 'ಕನ್ನಡ', '한국어', 'മലയാളം', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Vincenzo Natali', 'Alrick Riley'], 'Producers': ['Jonah Nolan', 'Lisa Joy', 'Athena Wickham'], 'Starring': ['Chloe Grace Moretz', 'Jack Reynor', 'Gary Carr']}\nNothing new here, just the same old stuff. Sims and time-travel etc etc. It started decently for the first 2 eps and then it fell apart. Way too much elitist snobbery and blah blah blah. Probably last 1 season, maybe 2.\nSame old stuff\n{'Content advisory': ['Violence', 'substance use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Kyle Newman'], 'Producers': ['Jason Moring', 'Michael Philip', 'Richard Alan Reid'], 'Starring': ['Paris Berelc', 'Taylor Zakhar Perez', 'Hari Nef'], 'Studio': ['STARZ']}\nTeaching children to be confused. Sorry, not for me\nAnother wasted day\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Currie'], 'Producers': ['Paul Currie', 'Jodi Matterson', 'Bruce Davey', 'Steve Hutensky'], 'Starring': ['Teresa Palmer', 'Sam Reid', 'Michiel Huisman'], 'Studio': ['Magnolia Pictures']}\nOf all of the movies I've seen, this is one of them. Another Groundhog Day-esque movie. It was worth watching once. Acting was decent. Chemistry and such was also pretty good. The story however lacked a real punch, it was awkward and seemed slapped together quickly. A lot of little elements from other works.<br /> I see patterns too.\nMeh",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Bleach Uncut Set 17 (DVD)\nReview Date: 2013/07/05\nStore: Various  (Actor, Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Anime\nProduct Description: ['Product Description', 'Bleach Uncut Set 17 (DVD)', 'Ichigo and the Soul Reapers find themselves in a brutal battle against their own Zanpakuto, who are being controlled by Muramasa. But the chaos in the Seireitei is just one part of Muramasa’s plan. His true objective lies in the World of the Living, and Ichigo is the key to his achieving it!', ']]>', 'Amazon.com', 'The 17th set of the hit fantasy-adventure', 'Bleach', 'comprises the second half of the \"Zanpakuto Unknown Tales Arc\" (episodes 230 to 265), an anime-only storyline. The Zanpakuto is both the weapon of a Soul Reaper and the mirror of his personality and strength. The appearance of the Zanpakuto as independent warriors threw the Soul Society into chaos in the first half of the adventure, but a series of unexpected revelations throws new light on those events. Ichigo and the Soul Reaper Captains continue their battle against Muramasa, the leader of the revolt. Centuries ago, this eerie, serpentine manifestation was the Zanpakuto of Koga, an extraordinarily powerful member of the Kuchiki clan, the family Rukia and Byakuya belong to. But Koga fell prey to arrogance, and the punishment for his crimes has stretched over the ages to the present day, threatening Ichigo and his friends in both the Seireitei and Karakura Town. Although the unexpected shifts in the plot give an added frisson of excitement to the battles, many of these episodes feel padded. The challenges, declarations, and boasts that precede the duels, while an essential part of', 'Bleach', '(and historic samurai culture), get a bit repetitious in the first episodes. And in the later ones, the viewer begins to wonder just how much killing Muramasa takes. The story concludes with a declaration of the singular bond between a Soul Reaper and a Zanpakuto that transcends even a samurai\\'s link to his swords. For once, Ichigo and Zangetsu, Byakuya, and Senbonzakura agree. After this adventure, director Noriyuki Abe and his crew returned to the storyline of Tite Kubo\\'s original manga with the 50-episode \"Arrancar: Downfall\" arc. (Rated Teen: violence, violence against women, grotesque imagery, risqué humor)', '--Charles Solomon', \"(243. One-to-One Fight! Ichigo vs. Senbonzakura! 244. The Long Awaited… Kenpachi Appears! 245. Pursue Byakuya! The Confused Gotei Divisions! 246. Special Mission! Rescue Captain-Commander Yamamoto! 247. Deceived Shinigami! The World Collapse Crisis! 248. Dragon of Ice and Dragon of Flame! The Strongest Showdown! 249. Senbonzakura's Bankai! Offense and Defense of the Living World! 250. That Man, For the Sake of the Kuchiki! 251. Dark History! The Worst Shinigami Is Born! 252. Byakuya, the Truth Behind His Betrayal! 253. Muramasa's True Identity Revealed! 254. Byakuya and Renji, the 6th Division Returns! 255. Final Chapter: Zanpakutō Unknown Tales!)\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Anime', 'Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English, Japanese', 'Number Of Discs': '3', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC, Subtitled', 'Run time': '5 hours and 10 minutes', 'Release date': 'June 11, 2013', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Sadly the aspect ratio is still 1.33:1 ...the anime changed to 16:9 during the Amagai Shusuke arc. (ep 168). Though it remains a great example of anime.\nReview Title: Bleach\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harsh Realm : The Ultimate Mind Game - The Complete Series (Three-Disc Collector's Edition)\nReview Date: 2016/09/30\nStore: Scott Bairstow  (Actor),     D.B. Sweeney  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', \"After Lieutenant Tom Hobbes agrees to test the military's virtual reality war game, he discovers his only way out of the game's deadly world is to kill the top player. The complete series of Harsh Realm.\", 'Amazon.com', 'The dark and fantastic', 'Harsh Realm', ', a science fiction series about a war fought by flesh-and-blood humans trapped inside virtual reality, was launched by', 'The X-Files', 'creator Chris Carter in 1999 and died a regrettable, premature death on the Fox channel after three episodes. The remaining six shows found sanctuary on the FX network, and then', 'Harsh Realm', 'slipped into history, its wild story, based on a comic book, far from resolved. Perhaps', 'Harsh Realm', \"'s ratings failure had something to do with its broad similarities to the hugely popular\", 'The Matrix', \", released only a few months before, or, for that matter, David Cronenberg's 1999\", 'eXistenZ', ', in which characters fight for their lives inside a video game. Whatever the reason, enough time has passed to take an objective look at', 'Harsh Realm', ', and there is a lot to be admired in its high level of imagination, complex plotting, and cutting-edge production values.', 'Scott Bairstow stars as U.S. Army Lieutenant Tom Hobbes, a decorated hero who risked his life rescuing a buddy, Major Mel Waters (Max Martini), during a peacekeeping mission in the former Yugoslavia. Set to return to civilian life and marry his fiancée, Sophie (Samantha Mathis), Hobbes is summoned by a mysterious superior (Lance Henriksen) and asked to test-run', 'Harsh Realm', ', a virtual reality war game devised by the Pentagon. Once he begins, however, Hobbes is mentally imprisoned in the dangerous game (his body, along with those of hundreds of other \"volunteers,\" is cared for in a secret military hospital), where he is identified by other, desperate captives as the savior they\\'ve been awaiting. D.B. Sweeney is very good as another soldier, Mike Pinocchio, whose sense of mission is re-awakened by Hobbes and who becomes a partner in an endless effort to defeat a madman named Santiago (Terry O\\'Quinn), who rules', 'Harsh Realm', 'from within. As with', 'The X-Files', ', the nine episodes in this boxed set are each very striking on their own terms, with post-apocalyptic sets, constant surprises, and that special Chris Carter touch (fans of his', 'Millennium', 'will like', 'Harsh Realm', ', too) that makes every story look and feel like a collision of a nightmare and a crisis of faith.', '--Tom Keogh']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Science Fiction', 'Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Contributor': \"Cameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane RedmondCameron K. Smith, Rachel Hayward, D.B. Sweeney, Chris Carter, Max Martini, Brad Greenquist, Raymond Cruz, Vinnie, Scott Bairstow, Terry O'Quinn, Michael David Simms, Samantha Mathis, Sarah-Jane Redmond   See more\", 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Surround)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Media Format': 'Color, Dubbed, Full Screen, Closed-captioned, NTSC, Subtitled', 'Run time': '6 hours and 27 minutes', 'Release date': 'August 24, 2004', 'Actors': \"Scott Bairstow, D.B. Sweeney, Terry O'Quinn, Rachel Hayward, Max Martini\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Home Entertainment', 'Writers': 'Chris Carter', 'Number of discs': '3'}\nReview Text: A fight for dominance in a VR world. As always a sim-ple foray into technology. An analogy of human vices and virtues. A few episodes were good, a few weren't.\nReview Title: A few episodes were good, a few weren't\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: V: The Original Miniseries [Blu-ray]\nReview Date: 2020/05/10\nStore: Thomas Hill  (Actor),     Marc Singer  (Actor),     Kenneth Johnson  (Director)    &                   0                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Fifty spaceships, each three miles across, hover ominously above Earth's major cities. The Visitors that emerge are humanlike in appearance and extend the hand of friendship. Our planet's resources are just what these aliens need to survive. And for its future survival, unsuspecting humankind will need...a miracle! Kenneth Johnson's science-fiction spectacular mixes dynamic special effects with cliffhanger thrills. As fascist rule enslaves the globe, freedom fighters battle to save our species. Marc Singer heads an epic-sized cast of human defenders and -- behind sleek uniforms and benevolent behavior -- reptilian invaders. For unparalleled extraterrestrial excitement, the invaders of V are unstoppable.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'NTSC, Widescreen', 'Contributor': 'Momo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patterson, Russell Enoch, Eric Johnston, Richard Lawson, Michael Swan, William Russ, Blair Tefkin, Michael Alldredge, Stephanie Faulkner, Marin May, Jason Bernard, Richard Herd, Hansford Rowe, Wiley Harker, Diane Civita, Evan Kim, Frank Ashmore, Curt Lowens, David Packer, Camila Ashlend, Faye Grant, Penelope Windust, Camila Ashland, George Morfogen, Mary Alan Hokanson, Stack Pierce, Howard K. Smith, Bonnie Bartlett, Rafael Campos, Josh Brooks, Thomas Hill, Jennifer Perito, Michael Bond, Jenny Neumann, Peter NelsonMomo Yashima, Denny Miller, Marc Singer, David Hooks, Jenny Sullivan, Robert Englund, Viveka Davis, Andrew Prine, Tommy Petersen, Jane Badler, Myron Healey, Clete Roberts, Kenneth Johnson, Michael Durrell, Michael Wright, Joanna Kerns, Leo Cimino, Neva Patters…  See more', 'Language': 'English', 'Runtime': '3 hours and 17 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Kenneth Johnson', 'Media Format': 'NTSC, Widescreen', 'Run time': '3 hours and 17 minutes', 'Release date': 'August 27, 2019', 'Actors': 'Thomas Hill, Marc Singer, Faye Grant, Jane Badler, Michael Durrell', 'Subtitles': 'English', 'Studio': 'Warner Archives', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: to remind of how terrible this show was...hehe. Nice video quality. Happy with the buy.\nReview Title: Had to watch it again\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/06/10\nAverage Rating: 3.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zander Weaver'], 'Producers': ['Elliot Weaver', 'Zander Weaver'], 'Starring': ['Tom England', 'Joshua Ford']}\nReview Text: not the worst movie ever...though an hour and 50 minutes of three dudes in a car is a bit chintzy...dialogue wasn't horrible, there was some suspense...though the ending was like the main body of the film...no substance.\nReview Title: lowest...budget...ever\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/02/18\nAverage Rating: 3.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Love'], 'Producers': ['Allan Niblo'], 'Starring': ['Stephen Dorff', 'Eddie Griffin'], 'Studio': ['More to Explore']}\nReview Text: A simple film about \"under-achievers\"(ie: Hancock). Shown as a simple man with telekinesis using it as a petty tool rather than as a world shaking discovery. It makes sense when viewed metaphorically, though the film itself left a bit to be desired. The film does however show a bit of the life that many of the \"lower class\" are forced to endure...the 2 stars are for that and nothing more.\nReview Title: Are you tired of metaphors?\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Tomorrow War\nReview Date: 2021/07/17\nCategories: Suspense, Drama, Compelling, Frightening\nProduct Description: ['Time travelers arrive from 2051 to deliver an urgent message: 30 years in the future mankind is losing a war against a deadly alien species. The only hope for survival is for soldiers and civilians to be transported to the future and join the fight. Determined to save the world for his daughter, Dan Forester teams up with a brilliant scientist and his estranged father to rewrite the planet’s fate.']\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Italiano', '日本語', 'Português', 'Deutsch', 'தமிழ்', 'हिन्दी', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'తెలుగు', 'Français (France)'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Chris McKay'], 'Producers': ['Rob Cowan', 'Leifur B. Dagfinnsson', 'Jules Daly', 'David Ellison', 'Bradley J. Fischer', 'Dana Goldberg', 'David S. Goyer', 'Don Granger', 'Hjortur Gretarsson'], 'Starring': ['Chris Pratt', 'J.K. Simmons', 'Yvonne Strahovski']}\nReview Text: Yet another wild metaphor filled journey into a family's struggle to make it through the tough times...Hollywood is good at exaggerating everyone's struggle while they don't live through any of it.\nReview Title: A crazy family flick\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/07/21\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chip Chalmers', 'Cliff Bole', 'Corey Allen', 'David Carson', 'David Livingston', 'Gabrielle Beaumont', 'Jonathan Frakes', 'Les Landau', 'Patrick Stewart', 'Paul Lynch', 'Peter Lauritson', 'Robert Lederman', 'Robert Scheerer', 'Robert Weimer', 'Winrich Kolbe'], 'Producers': ['Rick Berman', 'Michael Piller', 'Jeri Taylor'], 'Starring': ['Patrick Stewart', 'Jonathan Frakes', 'Levar Burton'], 'Studio': ['CBS']}\nReview Text: This episode was a commentary on why a species went extinct. Picard and the Enterprise encounter a probe, the probe forces it's way into Picard's mind and sends him into \"the Matrix\", a 40 year simulation in his mind, while his crew can do nothing to help him without killing him. From within this \"matrix\" he is forced to live someone else's perspective and life for several decades. The species eventually goes extinct while forcing Picard to watch as the probes that r*pe him later are sent into space. He awakens on his own ship with a flute and a song...wow (like your r*pist giving you flowers and a mix-tape.) This is not a story of love or courage etc etc...it is a sad tale of why that species went extinct...because they were selfish and didn't care about others.<br /><br />Ask yourself, \"was the first time I cried emotionally because of my own life or was it because of a fictional character in a movie, book or TV?\"\nReview Title: The title and episode showing that time is relative...\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2022/11/21\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'ಕನ್ನಡ', 'Italiano', 'Deutsch', 'தமிழ்', 'עברית', 'Indonesia', 'Português (Portugal)', 'Tiếng Việt', 'Español (Latinoamérica)', 'Ελληνικά', 'తెలుగు', 'Français (France)', 'Bahasa Melayu', 'Français (Canada)', 'Filipino', '日本語', 'Português (Brasil)', 'Nederlands', 'മലയാളം', 'Español (España)', 'हिन्दी', 'العربية', 'Polski', 'Čeština', 'Magyar', 'Türkçe', 'ไทย', 'Català', 'Română'], 'Subtitles': ['English [CC]', 'العربية', 'Català', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Euskara', 'Suomi', 'Filipino', 'Français (Canada)', 'Français (France)', 'Galego', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', 'ಕನ್ನಡ', '한국어', 'മലയാളം', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Directors': ['Vincenzo Natali', 'Alrick Riley'], 'Producers': ['Jonah Nolan', 'Lisa Joy', 'Athena Wickham'], 'Starring': ['Chloe Grace Moretz', 'Jack Reynor', 'Gary Carr']}\nReview Text: Nothing new here, just the same old stuff. Sims and time-travel etc etc. It started decently for the first 2 eps and then it fell apart. Way too much elitist snobbery and blah blah blah. Probably last 1 season, maybe 2.\nReview Title: Same old stuff\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2023/01/04\nAverage Rating: 2.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Kyle Newman'], 'Producers': ['Jason Moring', 'Michael Philip', 'Richard Alan Reid'], 'Starring': ['Paris Berelc', 'Taylor Zakhar Perez', 'Hari Nef'], 'Studio': ['STARZ']}\nReview Text: Teaching children to be confused. Sorry, not for me\nReview Title: Another wasted day\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2023/01/04\nAverage Rating: 3.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Currie'], 'Producers': ['Paul Currie', 'Jodi Matterson', 'Bruce Davey', 'Steve Hutensky'], 'Starring': ['Teresa Palmer', 'Sam Reid', 'Michiel Huisman'], 'Studio': ['Magnolia Pictures']}\nReview Text: Of all of the movies I've seen, this is one of them. Another Groundhog Day-esque movie. It was worth watching once. Acting was decent. Chemistry and such was also pretty good. The story however lacked a real punch, it was awkward and seemed slapped together quickly. A lot of little elements from other works.<br /> I see patterns too.\nReview Title: Meh\nRating: 3.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has shown a strong appreciation for engaging storylines and production quality in their purchases. They have rated several items highly, particularly enjoying imaginative plots and dynamic special effects. Users also indicated satisfaction with video quality and the excitement generated by the shows they purchased. Many reviews highlight specific attributes like strong character dynamics and well-executed suspense. The enjoyment of nostalgic experiences, notably with older series and films, is apparent and reflects a connection to memorable narratives.\n\nNEGATIVE SUMMARY:\nConversely, the user expressed dissatisfaction with certain products citing issues like uneven quality across episodes, lack of substance, and predictable storytelling. Several items were described as disappointing, with some critiques focusing on redundant themes and unsatisfactory endings. Specific reviews mention movies that felt like a \"waste of time\" or suffered from low production values. The user also indicated frustration with aspects like aspect ratios and pacing, contributing to an overall negative perception of these experiences.\n\nOVERALL SUMMARY:\nOverall, the user exhibits a varied shopping experience with a mix of fondness for well-crafted entertainment and frustration with mediocrity. There are standout favorites showcasing imaginative storytelling that garnered high satisfaction. However, there are also notable disappointments stemming from lackluster execution and repetitive themes, leading to a critical view on multiple purchases. This duality highlights a discerning consumer looking for both quality and creativity in their selections.",
  "target_interaction": {
    "rating": 1.0,
    "title": "Nothing more than paranoid delusions",
    "text": "Some call these cautionary tales. I call them divisive trash. To be sure there are issues that need dealing with, but until those with power and influence understand that their way isn't the way...it will be continued sadness, pain and heartbreak for many many people. As for ep 10, K.A.O. I can only say that Philbert seemed to be the one failing in most respects (though he was hardly a criminal or an evil man) . There wasn't enough information about the society of MexUsCan to say whether it was dystopian. To me it seemed almost like the writer(s) were trying to get us to sympathize with an \"other\"",
    "images": [],
    "asin": "B089VMBBKH",
    "parent_asin": "B089VMBBKH",
    "user_id": "AG5OIS47JWSGCXYGRGA5HBZPHKTQ",
    "timestamp": "2023-03-06 08:15:55.274000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 3.9,
    "rating_number": 1983,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/732b6c5eda5772c02848a9a7af22f17fbd482a007e9c22d3654d67bc3392d586._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/732b6c5eda5772c02848a9a7af22f17fbd482a007e9c22d3654d67bc3392d586._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/732b6c5eda5772c02848a9a7af22f17fbd482a007e9c22d3654d67bc3392d586._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/732b6c5eda5772c02848a9a7af22f17fbd482a007e9c22d3654d67bc3392d586._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/732b6c5eda5772c02848a9a7af22f17fbd482a007e9c22d3654d67bc3392d586._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/732b6c5eda5772c02848a9a7af22f17fbd482a007e9c22d3654d67bc3392d586._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "alcohol use",
        "smoking",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English",
        "English Dialogue Boost: High",
        "English Dialogue Boost: Low",
        "English [Audio Description]",
        "English Dialogue Boost: Medium",
        "Italiano",
        "日本語",
        "Português",
        "Deutsch",
        "Русский",
        "Español (España)",
        "Español (Latinoamérica)",
        "Polski",
        "Français"
      ],
      "Subtitles": [
        "English [CC]",
        "العربية",
        "বাংলা",
        "Dansk",
        "Deutsch",
        "Español (Latinoamérica)",
        "Español (España)",
        "Suomi",
        "Filipino",
        "Français",
        "हिन्दी",
        "Indonesia",
        "Italiano",
        "日本語",
        "한국어",
        "मराठी",
        "Bahasa Melayu",
        "Norsk Bokmål",
        "Nederlands",
        "Polski",
        "Português (Brasil)",
        "Português (Portugal)",
        "Русский",
        "Svenska",
        "தமிழ்",
        "తెలుగు",
        "ไทย",
        "Türkçe",
        "Tiếng Việt",
        "中文（简体）",
        "中文（繁體）"
      ],
      "Directors": [
        "Tom Harper",
        "Michael Dinner",
        "David Farr",
        "Jeffrey Reiner",
        "Marc Munden",
        "Dee Res",
        "Julian Jarrold",
        "Alan Taylor",
        "Francesca Gregorini",
        "Peter Horton"
      ],
      "Producers": [
        "Michael Dinner",
        "David Kanter",
        "Marigo Kehoe",
        "Lila Rawlings",
        "Matt Deross",
        "Bryan Cranston",
        "James Degus",
        "Ron Moore",
        "Maril Davis",
        "Isa Hackett",
        "Kalen Egan",
        "Katie Dimento"
      ],
      "Starring": [
        "Terrence Howard",
        "Bryan Cranston",
        "Anna Paquin"
      ],
      "Studio": [
        "Amazon Studios"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}