{
  "user_id": "AGO66O54S6LTNCFRQAVNMBO6H5MA",
  "summary": "=== Purchase Information ===\nProduct Title: Kung Fu Panda Two-Disc Blu-ray Boxed Set (Kung Fu Panda / Kung Fu Panda 2 / Secrets of the Masters)\nReview Date: 2014/10/17\nStore: Jack Black  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Get both', 'Kung Fu Panda', 'movies plus the all-new Po adventure', 'Kung Fu Panda: Secrets of the Masters', ', and so much more!', 'Amazon.com', 'Kung Fu Panda', 'What\\'s a panda to do when his dreams of kung-fu awesomeness awake to the cold reality of noodle-making? Clumsy, overweight Po (Jack Black) dreams of becoming a kung fu master like China\\'s revered \"furious five,\" but instead seems destined to follow in the footsteps of his father and grandfather in the restaurant business. When great leader Oogway has a vision that the imprisoned kung fu warrior Tai Lung (Ian McShane) will soon escape, he declares it time to choose China\\'s dragon warrior--one kung fu master deemed worthy of possessing the dragon\\'s scroll and its secret to limitless power. Po and all the townspeople rush to the Jade Palace atop the highest mountain to witness the contest between Tigress (Angelina Jolie), Monkey (Jackie Chan), Mantis (Seth Rogan), Crane (David Cross) and Viper (Lucy Liu), but Po is locked outside the palace. After a miracle of sorts, Po lands inside the palace gates, where he is chosen as the dragon warrior and placed under the tutelage of the decidedly non-plussed master Shifu (Dustin Hoffman). An unconventional student to say the least, hilarity reigns as Shifu tries desperately to make Po into some semblance of a kung fu warrior. Can Po possibly fulfill his destiny as dragon warrior, or was Oogway\\'s final decision a critical mistake? A film rich with hilarious moments, superior animation, and an important message about believing in oneself and the power that comes from within,', 'Kung Fu Panda', 'is great entertainment that will have the whole family laughing and begging for more. (Ages 3 and older)', '--Tami Horiuchi', 'Kung Fu Panda 2', 'Kung Fu Panda 2', \"is a sequel that definitely lives up to its predecessor, thanks to excellent animation and a great mix of action, comedy, and important life lessons. Dragon Warrior Po (Jack Black) has matured and mastered many new challenges since learning the art of kung fu and defeating the snow leopard Tai Lung, but he hasn't lost his penchant for steamed buns, nor has he achieved what his teacher Master Shifu (Dustin Hoffman) describes as true inner peace. Before he can settle into the arduous task of self-discovery, word arrives that a nearby town of musicians has been attacked and their leader Master Thundering Rhino (Victor Garber) killed by a newly invented weapon that breathes fire and spits out metal--a weapon that is a harbinger of the end of kung fu and the domination of all of China by Lord Shen (Gary Oldman). Po and the Furious Five (Angelina Jolie, Seth Rogen, Jackie Chan, David Cross, and Lucy Liu) set out to destroy the mysterious weapon and save kung fu, encountering the imprisoned and very dispirited kung fu legends Master Oxen (Dennis Haysbert) and Master Croc (Jean-Claude Van Damme) along the way, but the group quickly discovers that their task is far from simple. Even as Soothsayer (Michelle Yeoh) adamantly foretells Lord Shen's defeat at the hands of a warrior of black and white, Po struggles with the realization that he must come to terms with his adoption in order to let go of the past and become who he chooses to be. Only then can he achieve the inner peace that will empower him to triumph over his personal insecurities and Lord Shen.\", 'Kung Fu Panda 2', 'offers excellent animation and 3-D effects, nice brisk pacing, great voice talent, life lessons that ring true, and a healthy dose of comedy that includes everything from wisecracks to a dragon that eats unsuspecting villagers and then poops them out, and a radish trained in the art of kung fu. (Ages 3 and older)', '--Tami Horiuchi']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Music Videos & Concerts', 'Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Contributor': 'Jack Black', 'Runtime': '1 hour and 33 minutes', 'Studio': 'Universal Pictures Home Entertainment', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Media Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'December 13, 2011', 'Actors': 'Jack Black', 'Number of discs': '2'}\nReview Text: I got major points from the kids AND the wife on this purchase!  Great movie, gorgeous Blu-Ray quality.\nReview Title: A must-have for fans of the franchise!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Apocalypse Now (Apocalypse Now / Apocalypse Now Redux / Hearts of Darkness) (Three-Disc Full Disclosure Edition) [Blu-ray]\nReview Date: 2015/04/23\nStore: Martin Sheen  (Actor),     Marlon Brando  (Actor),     Francis Ford Coppola  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', \"Francis Ford Coppola's timeless classic comes to Blu-ray for the first time! This 3-Disc Full Disclosure Edition includes Apocalypse Now and Apocalypse Now Redux in stunning new transfers supervised by Francis Ford Coppola - and presented for the first time in their original 2.35:1 theatrical aspect ratios. Also included is the feature-length making-of documentary Hearts of Darkness, presented in a new 1080p HD transfer. Additional features include a 48-page collectible booklet with never-before-seen archives from the set, over 9 hours of bonus features, plus a storyboard gallery, image galleries, marketing archives and an original script excerpt from John Milius featuring hand-written notes from Coppola.\", 'Amazon.com', 'Apocalypse Now / Apocalypse Now: Redux', 'In the tradition of such obsessively driven directors as Erich von Stroheim and Werner Herzog, Francis Ford Coppola approached the production of', 'Apocalypse Now', 'as if it were his own epic mission into the heart of darkness. On location in the storm-ravaged Philippines, he quite literally went mad as the project threatened to devour him in a vortex of creative despair, but from this insanity came one of the greatest films ever made. It began as a John Milius screenplay, transposing Joseph Conrad\\'s classic story \"Heart of Darkness\" into the horrors of the Vietnam War, following a battle-weary Captain Willard (Martin Sheen) on a secret upriver mission to find and execute the renegade Colonel Kurtz (Marlon Brando), who has reverted to a state of murderous and mystical insanity. The journey is fraught with danger involving wartime action on epic and intimate scales. One measure of the film\\'s awesome visceral impact is the number of sequences, images, and lines of dialogue that have literally burned themselves into our cinematic consciousness, from the Wagnerian strike of helicopter gunships on a Vietnamese village to the brutal murder of stowaways on a peasant sampan and the unflinching fearlessness of the surfing warrior Lieutenant Colonel Kilgore (Robert Duvall), who speaks lovingly of \"the smell of napalm in the morning.\" Like Herzog\\'s Aguirre: The Wrath of God, this film is the product of genius cast into a pit of hell and emerging, phoenix-like, in triumph. Coppola\\'s obsession (effectively detailed in the riveting documentary', 'Hearts of Darkness', \", directed by Coppola's wife, Eleanor) informs every scene and every frame, and the result is a film for the ages. --\", 'Jeff Shannon', 'Hearts of Darkness', 'Hearts of Darkness', \"is an engrossing, unwavering look back at Francis Coppola's chaotic, catastrophe-plagued Vietnam production,\", 'Apocalypse Now', \". Filled with juicy gossip and a wonderful behind-the-scenes look at the stressful world of moviemaking, the documentary mixes on-location home movies shot in the Philippines by Eleanor Coppola, the director's wife, with revealing interviews with the cast and crew, shot 10 years later. Similar to Burden of Dreams, Les Blank's absorbing portrait of Werner Herzog's struggle to make Fitzcarraldo, the film chronicles Coppola's eventual decent into obsessive psychosis as everything that could go wrong does go wrong. Storms destroy sets, money evaporates, the Philippine government continually harasses the director, Coppola has romantic affairs, and he can't write the story's ending. Everything is captured on film. In the most disturbing scene, we watch Martin Sheen have a drunken nervous breakdown while his director goads him on (he eventually suffered a heart attack, but finished the film).  Other incredible footage is not visual, but aural as the film includes tapes Eleanor Coppola recorded without Francis's knowledge. In them, he truly sounds like a madman as he confesses his fears about making a bomb of a movie. But while Hearts of Darkness is an amazing, voyeuristic experience, its importance lies in the personal reflections offered by those involved. Sheen, Coppola, and Dennis Hopper speak frankly without embarrassment, offering us an essential piece of film history. --\", 'Dave McCoy']\nAverage Rating: 4.6\nProduct Details: {'Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more', 'Contributor': 'Francis Ford Coppola, Martin Sheen, Marlon Brando', 'Language': 'English', 'Runtime': '7 hours and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '031398126195', 'Director': 'Francis Ford Coppola', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '7 hours and 31 minutes', 'Release date': 'October 19, 2010', 'Actors': 'Martin Sheen, Marlon Brando', 'Subtitles': 'English, French, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '3'}\nReview Text: A must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the &#34;short&#34; version or the Redux with the restored plantation scene and some other ones as well.  The extras are an amazing insight into how the film was made and the included documentary Hearts of Darkness shows the toll the process took of the director.<br /><br />An amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nReview Title: Why would you not own this?!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blade Runner (30th Anniversary Collector's Edition) [Blu-ray]\nReview Date: 2015/04/23\nStore: Harrison Ford  (Actor),     Ridley Scott  (Director)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['Product Description', \"In a cyberpunk vision of the future, man has developed the technology to create replicants, human clones used to serve in the colonies outside Earth but with fixed lifespans. In Los Angeles, 2019, Deckard is a Blade Runner, a cop who specializes in terminating replicants. Originally in retirement, he is forced to re-enter the force when four replicants escape from an off-world colony to Earth. The #1 sci-fi film of all time is captured in this 3-disc Blu-ray/DVD and 30th Anniversary commemorative gift set. The set includes: the final cut on Blu-ray and DVD.The 30th Anniversary Collector's Edition box set features an all-new concept spinner car, action Lenticular and a 72-page art production book with never-before-seen Ridley sketches, poster art and photos from the set.\", 'Review', \"It is, in fact, an amazingly sophisticated, sumptuously visionary treatise on the consequences of attaining god-hood. --Rita Kempley, The Washington PostThe view of the future offered by Ridley Scott's muddled yet mesmerizing ''Blade Runner'' is as intricately detailed as anything a science-fiction film has yet envisioned. --The New York Times, Janet MaslinRidley Scott's 1982 masterpiece, back on the big screen in this definitive version, is an overwhelming experience --The Guardian, Mark Kermode\"]\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.8 x 5.7 x 7 inches; 8.8 Ounces', 'Item model number': '313554', 'Director': 'Ridley Scott', 'Media Format': \"Multiple Formats, Blu-ray, Box set, NTSC, Widescreen, Collector's Edition\", 'Run time': '1 hour and 57 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Harrison Ford', 'Studio': 'Warner Home Video', 'Number of discs': '3'}\nReview Text: A must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the original US version with the narration if you wish, the European version, the falsely named &#34;director's cut&#34; or Scott's &#34;Final Version.&#34;<br /><br />The extras are an amazing insight into how the film was restored and how some of the glaring problems were fixed (the scene where Zora is 'retired' and it is obviosuly a stunt woman, the horrible ADR inside the reptile seller's shop and the releasing of the dove at the end).  Otherwise the film was cleaned up and brightened to reveal all of the details in the amazing world Scott and his team created.  For those of us that grew up watching this on VHS it is nothing short of a revelation to see this gorgeous version.<br /><br />This is an amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nReview Title: Why would you not buy this?!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Back to the Future: 25th Anniversary Trilogy [Blu-ray]\nReview Date: 2015/05/01\nStore: Michael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Experience one of the most popular movie series of all time like never before with the Back to the Future 25th Anniversary Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, these timeless films feature all-new 25th Anniversary restorations for enhanced picture and sound plus hours of exciting bonus features.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Triva Track', 'U-Control: Triva Track', 'Deleted Scenes', 'Deleted Scenes', 'Tales from the Future: In the Beginning...', 'Tales from the Future: In the Beginning...', 'Tales from the Future: Time to Go', 'Tales from the Future: Time to Go', 'Tales from the Future: Keeping Time', 'Tales from the Future: Keeping Time', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Back to the Future Night', 'Back to the Future Night', 'Michael J. Fox Q&A', 'Michael J. Fox Q&A', 'Original Makeup Tests', 'Original Makeup Tests', 'Outtakes', 'Outtakes', 'Nuclear Test Site Ending Storyboard Sequence', 'Nuclear Test Site Ending Storyboard Sequence', 'Photo Galleries', 'Photo Galleries', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Join TEAM FOX', 'Join TEAM FOX', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 2 - Back to the Future Part II:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Trivia Track', 'U-Control: Trivia Track', 'Deleted Scene', 'Deleted Scene', 'Tales from the Future: Time Flies', 'Tales from the Future: Time Flies', 'The Physics of Back to the Future', 'The Physics of Back to the Future', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Outtakes', 'Outtakes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLeorean', 'Designing the DeLeorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects', 'Evolution of Visual Effects', 'Photo Galleries', 'Photo Galleries', 'Trailer', 'Trailer', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 3 - Back to the Future Part III:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control Trivia Track', 'U-Control Trivia Track', 'Deleted Scene', 'Deleted Scene', \"Tales from the Future: Third Time's the Charm\", \"Tales from the Future: Third Time's the Charm\", 'Tales from the Future: The Test of Time', 'Tales from the Future: The Test of Time', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', 'Outtakes', 'Outtakes', 'Designing Hill Valley', 'Designing Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Photo Galleries', 'Photo Galleries', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Trailer', 'Trailer', 'Back to the Future: The Ride', 'Back to the Future: The Ride', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent MovieScience Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent Movie  See more', 'Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harry Carey, Jr., Elisabeth Shue, Casey Siemaszko, Frank Marshall, Bill Varney, Neil Canton, Claudia Wells, Robert Rutledge, Bob Gale, Charles L. CampbellChristopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harr…  See more', 'Language': 'French (DTS 5.1), Spanish (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '5 hours and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.55 x 0.75 inches; 7.2 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 43 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nReview Text: Very good films (for a very satisfing weekend binge!) that look better than I remember the film print looking!  It is far above the VHS versions I watched in the 80's.  The extras are great as well, a solid buy.\nReview Title: Looks great, many extras\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Disney WOW: World of Wonder [Blu-ray]\nReview Date: 2015/07/03\nStore: n/a  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'The Disney WOW World of Wonder Disc is a definitive \"how to\" guide for in-home High Definition (HD) optimization of home entertainment systems featuring the help of classic Disney character GOOFY and including HD demonstration clips from popular Disney titles including Toy Story, Up, Bolt and Pirates of the Caribbean: At World\\'s End. The easy to follow on-screen guide is designed to help consumers get the best quality experience from their home theater systems by providing everyone from beginners and enthusiasts to experts and custom installers alike with valuable high quality calibration tools.', 'Review', \"Until now, do-it-yourself home theater enthusiasts only had two viable options when calibrating their HD-equipped systems: Digital Video Essentials HD Basics and Spears & Munsil High-Definition Benchmark, both of which suffer from a number of shortcomings and limitations (particularly for those trying to fine-tune an LCD, Plasma or LED display). Enter Disney, a somewhat surprising (and welcome) new player on the calibration stage. WOW: World of Wonder not only sets the bar for calibration suites available in high definition, it provides an as-yet-unrivaled home-video education on the nuances of properly calibrated audio and video gear, offers an extensive collection of smartly conceived tests and tools, and delivers it all via a helpful, user-friendly experience designed with a variety of users in mind. --Blu-ray ForumAll home theaters should have a disc like this. WOW is a tutorial disc that helps you to set up your HD system to its maximum potential. It helps you calibrate the sound and the picture, and does so with easy step-by-step guides. --Best Blu-ray Movies, Yahoo NewsKudos to Disney, Using a combination of the beginner and advanced calibration tools, I dialed in the Samsung TV to some accurate, eye-popping levels, Disney's WOW disc is great for installers and home theater enthusiasts. The disc produced some stunning results. --Robert Archer, CE Pro\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Blu-ray, Full Screen, NTSC, Widescreen', 'Language': 'English (DTS-HD High Res Audio)', 'Runtime': '4 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 6.4 Ounces', 'Media Format': 'Multiple Formats, Blu-ray, Full Screen, NTSC, Widescreen', 'Run time': '4 hours', 'Release date': 'November 2, 2010', 'Studio': 'Walt Disney Studio Home Entertainment', 'Number of discs': '2'}\nReview Text: I work in TV and film, and while I am not an engineer I do know my way around scopes and test patterns.  This is a very easy disc to use to get the most out of your TV (and even your sound system).  I highly recommend it even for beginners, they walk you thorugh all the settings and you can do a complete video adjustment in about 15 minutes.<br /><br />There is a separate set of tests for displays and projectors, I even took this to the University where I teach and calibrate the projector in the classroom, what a difference.  No more telling students to take my word for the way things look!\nReview Title: Easy and effective\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/01/04\nAverage Rating: 4.5\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Mark Osborne', 'John Stevenson'], 'Producers': ['Melissa Cobb', 'Jonathan Aibel', 'Glenn Berger'], 'Starring': ['Jack Black', 'Jackie Chan', 'Dustin Hoffman'], 'Studio': ['Paramount']}\nReview Text: Even though this was made many years ago it hold up very well.  The animation looks great even when compared to today's movies.  Great for the whole family!\nReview Title: A modern classic that holds up very well.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Smokey and the Bandit [Blu-ray]\nReview Date: 2016/04/28\nStore: Burt Reynolds  (Actor),     Jackie Gleason  (Actor),     Hal Needham  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Get ready to tear up the highway with the Bandit (Burt Reynolds) a fun-loving fast-talking trucker who takes on his craziest haul yet - delivering 400 cases of beer from Texarkana to Atlanta in just 28 hours. With Sheriff Buford T. Justice (Jackie Gleason) hot on his trail and eager to teach him some respect for the law the Bandit joins forces with good ol' boy Cledus (Jerry Reed) and runaway bride Carrie (Sally Field). Gear up for huge laughs pedal-to-the-metal action and some of the wildest car crashes ever\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'car chase movie, trucker movie, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure, Smokey & the Banditcar chase movie, trucker movie, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure, Smokey & the Bandit  See more', 'Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Contributor': 'Charles Shyer, Burt Reynolds, Pat McCormick, Walter Hannemann, Alan Mandel, James Lee Barrett, Mike Henry, Sally Field, Hal Needham, Angelo Ross, Paul Williams, Jackie Gleason, Jerry Reed, Mort EngelbergCharles Shyer, Burt Reynolds, Pat McCormick, Walter Hannemann, Alan Mandel, James Lee Barrett, Mike Henry, Sally Field, Hal Needham, Angelo Ross, Paul Williams, Jackie Gleason, Jerry Reed, Mort Engelberg  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), English (DTS-HD Master Audio 5.1), French (DTS-HD 2.0)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '25192139987', 'Director': 'Hal Needham', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Burt Reynolds, Jackie Gleason, Sally Field, Jerry Reed, Mike Henry', 'Subtitles': 'French, Spanish', 'Producers': 'Mort Engelberg', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'James Lee Barrett, Charles Shyer, Alan Mandel', 'Number of discs': '2'}\nReview Text: I hadn't seen this movie in over 25 years, but I stil enjoyed the heck out of it!  I recently bought an old Trans Am and had to make my wife watch this so she could understand why that car means so much to boys my age.  The movies looks great on BluRay and the extras are good too.\nReview Title: Holds up surprisingly well!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Zootopia (3D/BD/DVD/Digital HD) [3D Blu-ray]\nReview Date: 2016/08/20\nStore: Ginnifer Goodwin  (Actor),     Jason Bateman  (Actor),     Byron Howard  (Director),     Rich Moore  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From Walt Disney Animation Studios comes a comedy-adventure set in the modern mammal metropolis of ZOOTOPIA. Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case -- even if it means partnering with scam-artist fox Nick Wilde to solve the mystery. Bring home this hilarious adventure full of action and heart. It's big fun for all shapes and species!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Color, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copyColor, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copy  See more', 'Contributor': 'Jason Bateman, Jared Bush, Byron Howard, Idris Elba, Ginnifer Goodwin, Rich Moore', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '35369621', 'Director': 'Byron Howard, Rich Moore, Jared Bush', 'Media Format': 'Color, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copy', 'Run time': '1 hour and 48 minutes', 'Release date': 'June 7, 2016', 'Actors': 'Ginnifer Goodwin, Jason Bateman, Idris Elba', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Number of discs': '3'}\nReview Text: Cute characters, engaging story and humor, what's not to love?!<br />The 3D effects are also great, much better than in the movie theater.  There are lots of reviews online about whether or not to buy certain movies in 3D, almost everybody says this one is worth the upgrade.  My kids and I agree!\nReview Title: Great movie, impressive 3D\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The King of Kong: A Fistful of Quarters\nReview Date: 2017/03/25\nStore: Billy Mitchell  (Actor),     Steve Wiebe  (Actor),     Seth Gordon  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Product Description', 'King of Kong: A Fistful of Quarters (DVD)', 'In the cutthroat world of Donkey Kong, only one can rule! A middle-school science teacher and a hot sauce mogul vie for the Guinness World Record on the arcade classic, Donkey Kong. Steve and Billy engage in a cross-country duel to see who could set the high score and become the King of Kong! Along the way, both men learn valuable lessons about what it means to be a father, a husband, and a true champion - discovering that you don\\'t always need to win to be a winner. \"A hilarious and moving study of the obsessive competition between the all-time scoring leader on Donkey Kong, an odd Floridian, and a father of two who gets sucked into a world of mind-blowing passive-aggressiveness. \"Boston Globe\".', ']]>', 'Amazon.com', \"The stuff of gladiatorial battle is here: good versus evil, right versus wrong, nerd versus... super-nerd? At any rate, it's a more entertaining showdown than most fictional movies can muster.\", 'The King of Kong', 'is the saga of Steve Wiebe, a Redmond, Washington dweeb who sets a new record in the video game', 'Donkey Kong', ', only to see his accomplishment challenged by the grand poobahs of the gaming establishment. And if you don\\'t know how pernickety the grand poobahs of the gaming establishment can be, well, one of the pleasures of this movie is finding out about this collection of oddballs. It seems Wiebe has toppled a score that has stood since 1982, when eminent \"Gamer of the Century\" Billy Mitchell set it, and Mitchell isn\\'t too happy about being overthrown. A black-mulleted showboat, Mitchell provides the perfect counterpoint to Wiebe\\'s mild-mannered family man, and the smaller fish around him are no less colorful. This is one of those movies you watch in delighted disbelief, marveling that such people exist--and that they gladly allowed themselves to be filmed. Director Seth Gordon does an important thing in presenting this world of eccentrics: he doesn\\'t mock them, or provide editorial nudging; he simply lets them be. The result is an ingratiating classic.', '--Robert Horton']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Documentary', 'Format': 'AC-3, Dolby, Subtitled, Anamorphic', 'Contributor': 'Billy Mitchell, Steve Wiebe, Seth Gordon', 'Initial release date': '2008-01-29', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 0.32 Ounces', 'Item model number': '1000035229', 'Director': 'Seth Gordon', 'Media Format': 'AC-3, Dolby, Subtitled, Anamorphic', 'Run time': '1 hour and 19 minutes', 'Release date': 'January 29, 2008', 'Actors': 'Billy Mitchell, Steve Wiebe', 'Subtitles': 'English, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: I teach film production at a university and I bought this to show to my documentary filmmaking classes.  It is an excellent example of how a good doc can make you care about something that you never thought you'd care about.  I love seeing the young women in the class start out rolling their eyes but quickly get drawn into the story.  This doc is consitantly a class favorite.\nReview Title: Even if you don't like video games you should watch this!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ted 2 [Blu-ray]\nReview Date: 2017/03/25\nStore: Mark Wahlberg  (Actor),     Amanda Seyfried  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Comedy\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, DVD Movie, Blu-ray Movie, Comedy', 'Format': 'Blu-ray, Ultraviolet, Color, Widescreen, Ultraviolet, Digital_copy', 'Contributor': 'Mark Wahlberg, Morgan Freeman, Amanda Seyfried, Barry Ratcliffe, Jessica Barth, Seth MacFarlane', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), French Canadian (Dolby Digital 5.1), French Canadian (DTS 5.1), Spanish (DTS 5.1)', 'Runtime': '8 hours and 6 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 0.75 inches; 2.4 Ounces', 'Item model number': '35222385', 'Director': 'Seth MacFarlane', 'Media Format': 'Blu-ray, Ultraviolet, Color, Widescreen, Ultraviolet, Digital_copy', 'Run time': '8 hours and 6 minutes', 'Release date': 'December 15, 2015', 'Actors': 'Mark Wahlberg, Amanda Seyfried, Seth MacFarlane, Morgan Freeman, Jessica Barth', 'Subtitles': 'French, Spanish', 'Studio': 'Universal', 'Number of discs': '2'}\nReview Text: There is not a lot to say.  If you liked the first one then you will like this one.  If you didn't, or otherwise dislike Seth McFarlane's humor then keep moving.\nReview Title: I think you know what you are geting yourself into here\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mad Max: Fury Road (3D Blu-ray + Blu-ray)\nReview Date: 2017/06/27\nStore: Tom Hardy  (Actor),     Charlize Theron  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Award Winners in Movies & TV, Oscar Central, Oscar Nominees\nProduct Description: ['Mad Max: Fury Road (3D Blu-ray + Blu-ray)', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Subtitled, Ultraviolet, Ultraviolet, 3D', 'Contributor': 'Brendan McCarthy, Rosie Huntington-Whiteley, Iain Smith, Nico Lathouris, Zoë Kravitz, Abbey Lee, Bruce Berman, Nicholas Hoult, P.J. Voeten, Hugh Keays-Byrne, Nathan Jones, Doug Mitchell, George Miller, Riley Keough, Tom Hardy, Graham Burke, Courtney Eaton, Charlize TheronBrendan McCarthy, Rosie Huntington-Whiteley, Iain Smith, Nico Lathouris, Zoë Kravitz, Abbey Lee, Bruce Berman, Nicholas Hoult, P.J. Voeten, Hugh Keays-Byrne, Nathan Jones, Doug Mitchell, George Miller, Riley Keough, Tom Hardy, Graham Burke, Courtney Eaton, Charlize…  See more', 'Initial release date': '2015-09-01', 'Language': 'English (Dolby Digital 5.1), Thai (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Digital Copy Expiration Date': 'September 1, 2018', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Item model number': '35226144', 'Director': 'George Miller', 'Media Format': 'Subtitled, Ultraviolet, Ultraviolet, 3D', 'Run time': '2 hours', 'Release date': 'September 1, 2015', 'Actors': 'Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley', 'Subtitles': 'English, Portuguese, Spanish, Korean, Thai, French', 'Producers': 'Iain Smith, Doug Mitchell, Graham Burke, George Miller, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'George Miller, Brendan McCarthy, Nico Lathouris', 'Number of discs': '2'}\nReview Text: In the past I have avoided seeing a movie in 3D if it was not filmed in 3D (I am looking at you, Clash of the Titans.)  However it seems like the effects houses have gotten this figured out, both The Force Awakens and Mad Max Fury Road are excellent 3D titles and neither were shot in 3D.<br />I won't get into a movie review too much, but I thought Fury Road was a worth addition to the Mad Max story.  I was not wild about Tom Hardy's interpretation of Max (I really wish Mel Gibson hadn't gone nuts and could have done this film) but the new characters are engaging and the action is top notch.<br />Both the desolation of the open spaces and the closeness of the interior environments are improved by the 3D.  Apart from the absurd steering wheel that flies right at the screen the film is devoid of effects that draw attention to themselves.  In defense of the 3D version that steering wheel gag is just as distractingand annoying in 2D.<br />If you like the franchise you will like this movie.  If you like this movie you will enjoy the extra value of the 3D version.\nReview Title: The 3D is worth it!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jackie Chan's PROJECT A & PROJECT A PART II (Eureka Classics) Limited Edition Blu-ray\nReview Date: 2019/08/16\nStore: Jackie Chan  (Actor)    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"A pair of incredible action-adventure extravaganza's from the legendary\", 'Jackie Chan', ',', 'Project A', 'and', 'Project A Part II', 'make their long overdue debut on Blu-ray in the UK from brand new 2K restorations. Starring three of the greatest martial-arts action stars of all time (Jackie Chan, Sammo Hung and Yuen Biao), the', 'Project A', 'films blended unparalleled martial artistry, death defying stunts and physical comedy in a way that has yet to be matched.', 'Project A', 'Jackie plays Sergeant Dragon Ma, a turn-of-the-century coastguard, hot on the trail of a ruthless band of cut-throat pirates, intent on spreading a trail of blood and mayhem across the South China Seas.', 'Project A', 'features some of the most dangerous stunts of Jackie s career, including homages to Buster Keaton s', 'Steamboat Bill, Jr.', 'and Harold Lloyd s', 'Safety Last!', '.', 'Project A Part II', 'After the events of the first film, Dragon Ma is given a new assignment, to clean up crime and corruption in the roughest part of town. The pressure was on to top the first film in terms of sheer spectacle, but', 'Project A Part II', 'rises to the challenge and delivers one of the most stunt-packed, rip-roaring action-adventures of all time.', 'Presented from brand new 2K restorations and fully uncut, Eureka Classics is proud to present Jackie Chan s', 'Project A', 'and', 'Project A Part II', 'for the first time on Blu-ray in the UK in a special', 'Limited Edition Box Set (4000 copies)', 'packed with extra content.', 'SPECIAL FEATURES:', 'Special Limited Edition Box Set of 4000 copies', 'Special Limited Edition Box Set of 4000 copies', '1080p presentations of both films, sourced from brand new 2K restorations and making their UK debuts on Blu-ray', '1080p presentations of both films, sourced from brand new 2K restorations and making their UK debuts on Blu-ray', 'Original Cantonese audio tracks for both films (mono for Project A and stereo for Project A Part II)', 'Original Cantonese audio tracks for both films (mono for', 'Project A', 'and stereo for', 'Project A Part II', ')', 'Restored 5.1 Cantonese and English audio options', 'Restored 5.1 Cantonese and English audio options', 'Optional English subtitles', 'Optional English subtitles', 'A new video interview with Tony Rayns', 'A new video interview with Tony Rayns', 'Archival interview with Jackie Chan [30 mins]', 'Archival interview with Jackie Chan [30 mins]', 'Interview with actor Lee Hoi San [22 mins]', 'Interview with actor Lee Hoi San [22 mins]', 'Interview with actor Yuen Biao [18 mins]', 'Interview with actor Yuen Biao [18 mins]', 'Interview with actor Dick Wei [14 mins]', 'Interview with actor Dick Wei [14 mins]', 'Interview with actor Michael Chan Wai-Man [20 mins]', 'Interview with actor Michael Chan Wai-Man [20 mins]', 'Interview with composer Michael Lai [17 mins]', 'Interview with composer Michael Lai [17 mins]', 'Interview with writer and producer Edward Tang [30 mins]', 'Interview with writer and producer Edward Tang [30 mins]', 'Interview with stuntman Anthony Carpio [29 mins]', 'Interview with stuntman Anthony Carpio [29 mins]', 'Interview with stuntman Mars [15 mins]', 'Interview with stuntman Mars [15 mins]', 'Someone Will Know Me [13 mins] - an archival featurette which includes interviews with stuntmen Mars, Chris Lee Kin-Sang and Rocky Lai', 'Someone Will Know Me', '[13 mins] - an archival featurette which includes interviews with stuntmen Mars, Chris Lee Kin-Sang and Rocky Lai', 'Alternate outtakes for Project A from the Japanese version of the film', 'Alternate outtakes for', 'Project A', 'from the Japanese version of the film', 'Archival behind-the-scenes footage [24 mins]', 'Archival behind-the-scenes footage [24 mins]', 'Deleted Scenes', 'Deleted Scenes', 'PLUS: A wide selection of rare archival content!', 'PLUS:', 'A wide selection of rare archival content!', 'Box set exclusive Collectors booklets for each film, featuring new essays and archival content', 'Box set exclusive Collectors booklets for each film, featuring new essays and archival content']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'PAL', 'Contributor': 'Jackie Chan', 'Runtime': '3 hours and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.93 x 5.51 x 1.38 inches; 9.88 Ounces', 'Media Format': 'PAL', 'Run time': '3 hours and 31 minutes', 'Release date': 'October 29, 2018', 'Actors': 'Jackie Chan', 'Studio': 'Eureka Entertainment Ltd', 'Number of discs': '2'}\nReview Text: I never got a chance to watch the film because a crooked seller on Amazon did not disclose that this Blu-Ray is locked for region B players.<br />I hope this information will save somebody else the time, disappointment and cost of a purchase that will not work in the USA.\nReview Title: Region B only!! Will not work on a USA player!!\nRating: 3.0\n--------------------------------------------------",
  "reference": "Kung Fu Panda Two-Disc Blu-ray Boxed Set (Kung Fu Panda / Kung Fu Panda 2 / Secrets of the Masters)\nJack Black  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Get both', 'Kung Fu Panda', 'movies plus the all-new Po adventure', 'Kung Fu Panda: Secrets of the Masters', ', and so much more!', 'Amazon.com', 'Kung Fu Panda', 'What\\'s a panda to do when his dreams of kung-fu awesomeness awake to the cold reality of noodle-making? Clumsy, overweight Po (Jack Black) dreams of becoming a kung fu master like China\\'s revered \"furious five,\" but instead seems destined to follow in the footsteps of his father and grandfather in the restaurant business. When great leader Oogway has a vision that the imprisoned kung fu warrior Tai Lung (Ian McShane) will soon escape, he declares it time to choose China\\'s dragon warrior--one kung fu master deemed worthy of possessing the dragon\\'s scroll and its secret to limitless power. Po and all the townspeople rush to the Jade Palace atop the highest mountain to witness the contest between Tigress (Angelina Jolie), Monkey (Jackie Chan), Mantis (Seth Rogan), Crane (David Cross) and Viper (Lucy Liu), but Po is locked outside the palace. After a miracle of sorts, Po lands inside the palace gates, where he is chosen as the dragon warrior and placed under the tutelage of the decidedly non-plussed master Shifu (Dustin Hoffman). An unconventional student to say the least, hilarity reigns as Shifu tries desperately to make Po into some semblance of a kung fu warrior. Can Po possibly fulfill his destiny as dragon warrior, or was Oogway\\'s final decision a critical mistake? A film rich with hilarious moments, superior animation, and an important message about believing in oneself and the power that comes from within,', 'Kung Fu Panda', 'is great entertainment that will have the whole family laughing and begging for more. (Ages 3 and older)', '--Tami Horiuchi', 'Kung Fu Panda 2', 'Kung Fu Panda 2', \"is a sequel that definitely lives up to its predecessor, thanks to excellent animation and a great mix of action, comedy, and important life lessons. Dragon Warrior Po (Jack Black) has matured and mastered many new challenges since learning the art of kung fu and defeating the snow leopard Tai Lung, but he hasn't lost his penchant for steamed buns, nor has he achieved what his teacher Master Shifu (Dustin Hoffman) describes as true inner peace. Before he can settle into the arduous task of self-discovery, word arrives that a nearby town of musicians has been attacked and their leader Master Thundering Rhino (Victor Garber) killed by a newly invented weapon that breathes fire and spits out metal--a weapon that is a harbinger of the end of kung fu and the domination of all of China by Lord Shen (Gary Oldman). Po and the Furious Five (Angelina Jolie, Seth Rogen, Jackie Chan, David Cross, and Lucy Liu) set out to destroy the mysterious weapon and save kung fu, encountering the imprisoned and very dispirited kung fu legends Master Oxen (Dennis Haysbert) and Master Croc (Jean-Claude Van Damme) along the way, but the group quickly discovers that their task is far from simple. Even as Soothsayer (Michelle Yeoh) adamantly foretells Lord Shen's defeat at the hands of a warrior of black and white, Po struggles with the realization that he must come to terms with his adoption in order to let go of the past and become who he chooses to be. Only then can he achieve the inner peace that will empower him to triumph over his personal insecurities and Lord Shen.\", 'Kung Fu Panda 2', 'offers excellent animation and 3-D effects, nice brisk pacing, great voice talent, life lessons that ring true, and a healthy dose of comedy that includes everything from wisecracks to a dragon that eats unsuspecting villagers and then poops them out, and a radish trained in the art of kung fu. (Ages 3 and older)', '--Tami Horiuchi']\n{'Genre': 'Music Videos & Concerts', 'Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Contributor': 'Jack Black', 'Runtime': '1 hour and 33 minutes', 'Studio': 'Universal Pictures Home Entertainment', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Media Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'December 13, 2011', 'Actors': 'Jack Black', 'Number of discs': '2'}\nI got major points from the kids AND the wife on this purchase!  Great movie, gorgeous Blu-Ray quality.\nA must-have for fans of the franchise!\nApocalypse Now (Apocalypse Now / Apocalypse Now Redux / Hearts of Darkness) (Three-Disc Full Disclosure Edition) [Blu-ray]\nMartin Sheen  (Actor),     Marlon Brando  (Actor),     Francis Ford Coppola  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Francis Ford Coppola's timeless classic comes to Blu-ray for the first time! This 3-Disc Full Disclosure Edition includes Apocalypse Now and Apocalypse Now Redux in stunning new transfers supervised by Francis Ford Coppola - and presented for the first time in their original 2.35:1 theatrical aspect ratios. Also included is the feature-length making-of documentary Hearts of Darkness, presented in a new 1080p HD transfer. Additional features include a 48-page collectible booklet with never-before-seen archives from the set, over 9 hours of bonus features, plus a storyboard gallery, image galleries, marketing archives and an original script excerpt from John Milius featuring hand-written notes from Coppola.\", 'Amazon.com', 'Apocalypse Now / Apocalypse Now: Redux', 'In the tradition of such obsessively driven directors as Erich von Stroheim and Werner Herzog, Francis Ford Coppola approached the production of', 'Apocalypse Now', 'as if it were his own epic mission into the heart of darkness. On location in the storm-ravaged Philippines, he quite literally went mad as the project threatened to devour him in a vortex of creative despair, but from this insanity came one of the greatest films ever made. It began as a John Milius screenplay, transposing Joseph Conrad\\'s classic story \"Heart of Darkness\" into the horrors of the Vietnam War, following a battle-weary Captain Willard (Martin Sheen) on a secret upriver mission to find and execute the renegade Colonel Kurtz (Marlon Brando), who has reverted to a state of murderous and mystical insanity. The journey is fraught with danger involving wartime action on epic and intimate scales. One measure of the film\\'s awesome visceral impact is the number of sequences, images, and lines of dialogue that have literally burned themselves into our cinematic consciousness, from the Wagnerian strike of helicopter gunships on a Vietnamese village to the brutal murder of stowaways on a peasant sampan and the unflinching fearlessness of the surfing warrior Lieutenant Colonel Kilgore (Robert Duvall), who speaks lovingly of \"the smell of napalm in the morning.\" Like Herzog\\'s Aguirre: The Wrath of God, this film is the product of genius cast into a pit of hell and emerging, phoenix-like, in triumph. Coppola\\'s obsession (effectively detailed in the riveting documentary', 'Hearts of Darkness', \", directed by Coppola's wife, Eleanor) informs every scene and every frame, and the result is a film for the ages. --\", 'Jeff Shannon', 'Hearts of Darkness', 'Hearts of Darkness', \"is an engrossing, unwavering look back at Francis Coppola's chaotic, catastrophe-plagued Vietnam production,\", 'Apocalypse Now', \". Filled with juicy gossip and a wonderful behind-the-scenes look at the stressful world of moviemaking, the documentary mixes on-location home movies shot in the Philippines by Eleanor Coppola, the director's wife, with revealing interviews with the cast and crew, shot 10 years later. Similar to Burden of Dreams, Les Blank's absorbing portrait of Werner Herzog's struggle to make Fitzcarraldo, the film chronicles Coppola's eventual decent into obsessive psychosis as everything that could go wrong does go wrong. Storms destroy sets, money evaporates, the Philippine government continually harasses the director, Coppola has romantic affairs, and he can't write the story's ending. Everything is captured on film. In the most disturbing scene, we watch Martin Sheen have a drunken nervous breakdown while his director goads him on (he eventually suffered a heart attack, but finished the film).  Other incredible footage is not visual, but aural as the film includes tapes Eleanor Coppola recorded without Francis's knowledge. In them, he truly sounds like a madman as he confesses his fears about making a bomb of a movie. But while Hearts of Darkness is an amazing, voyeuristic experience, its importance lies in the personal reflections offered by those involved. Sheen, Coppola, and Dennis Hopper speak frankly without embarrassment, offering us an essential piece of film history. --\", 'Dave McCoy']\n{'Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more', 'Contributor': 'Francis Ford Coppola, Martin Sheen, Marlon Brando', 'Language': 'English', 'Runtime': '7 hours and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '031398126195', 'Director': 'Francis Ford Coppola', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '7 hours and 31 minutes', 'Release date': 'October 19, 2010', 'Actors': 'Martin Sheen, Marlon Brando', 'Subtitles': 'English, French, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '3'}\nA must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the &#34;short&#34; version or the Redux with the restored plantation scene and some other ones as well.  The extras are an amazing insight into how the film was made and the included documentary Hearts of Darkness shows the toll the process took of the director.<br /><br />An amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nWhy would you not own this?!\nBlade Runner (30th Anniversary Collector's Edition) [Blu-ray]\nHarrison Ford  (Actor),     Ridley Scott  (Director)    Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Product Description', \"In a cyberpunk vision of the future, man has developed the technology to create replicants, human clones used to serve in the colonies outside Earth but with fixed lifespans. In Los Angeles, 2019, Deckard is a Blade Runner, a cop who specializes in terminating replicants. Originally in retirement, he is forced to re-enter the force when four replicants escape from an off-world colony to Earth. The #1 sci-fi film of all time is captured in this 3-disc Blu-ray/DVD and 30th Anniversary commemorative gift set. The set includes: the final cut on Blu-ray and DVD.The 30th Anniversary Collector's Edition box set features an all-new concept spinner car, action Lenticular and a 72-page art production book with never-before-seen Ridley sketches, poster art and photos from the set.\", 'Review', \"It is, in fact, an amazingly sophisticated, sumptuously visionary treatise on the consequences of attaining god-hood. --Rita Kempley, The Washington PostThe view of the future offered by Ridley Scott's muddled yet mesmerizing ''Blade Runner'' is as intricately detailed as anything a science-fiction film has yet envisioned. --The New York Times, Janet MaslinRidley Scott's 1982 masterpiece, back on the big screen in this definitive version, is an overwhelming experience --The Guardian, Mark Kermode\"]\n{'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.8 x 5.7 x 7 inches; 8.8 Ounces', 'Item model number': '313554', 'Director': 'Ridley Scott', 'Media Format': \"Multiple Formats, Blu-ray, Box set, NTSC, Widescreen, Collector's Edition\", 'Run time': '1 hour and 57 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Harrison Ford', 'Studio': 'Warner Home Video', 'Number of discs': '3'}\nA must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the original US version with the narration if you wish, the European version, the falsely named &#34;director's cut&#34; or Scott's &#34;Final Version.&#34;<br /><br />The extras are an amazing insight into how the film was restored and how some of the glaring problems were fixed (the scene where Zora is 'retired' and it is obviosuly a stunt woman, the horrible ADR inside the reptile seller's shop and the releasing of the dove at the end).  Otherwise the film was cleaned up and brightened to reveal all of the details in the amazing world Scott and his team created.  For those of us that grew up watching this on VHS it is nothing short of a revelation to see this gorgeous version.<br /><br />This is an amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nWhy would you not buy this?!\nBack to the Future: 25th Anniversary Trilogy [Blu-ray]\nMichael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Experience one of the most popular movie series of all time like never before with the Back to the Future 25th Anniversary Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, these timeless films feature all-new 25th Anniversary restorations for enhanced picture and sound plus hours of exciting bonus features.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Triva Track', 'U-Control: Triva Track', 'Deleted Scenes', 'Deleted Scenes', 'Tales from the Future: In the Beginning...', 'Tales from the Future: In the Beginning...', 'Tales from the Future: Time to Go', 'Tales from the Future: Time to Go', 'Tales from the Future: Keeping Time', 'Tales from the Future: Keeping Time', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Back to the Future Night', 'Back to the Future Night', 'Michael J. Fox Q&A', 'Michael J. Fox Q&A', 'Original Makeup Tests', 'Original Makeup Tests', 'Outtakes', 'Outtakes', 'Nuclear Test Site Ending Storyboard Sequence', 'Nuclear Test Site Ending Storyboard Sequence', 'Photo Galleries', 'Photo Galleries', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Join TEAM FOX', 'Join TEAM FOX', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 2 - Back to the Future Part II:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Trivia Track', 'U-Control: Trivia Track', 'Deleted Scene', 'Deleted Scene', 'Tales from the Future: Time Flies', 'Tales from the Future: Time Flies', 'The Physics of Back to the Future', 'The Physics of Back to the Future', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Outtakes', 'Outtakes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLeorean', 'Designing the DeLeorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects', 'Evolution of Visual Effects', 'Photo Galleries', 'Photo Galleries', 'Trailer', 'Trailer', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 3 - Back to the Future Part III:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control Trivia Track', 'U-Control Trivia Track', 'Deleted Scene', 'Deleted Scene', \"Tales from the Future: Third Time's the Charm\", \"Tales from the Future: Third Time's the Charm\", 'Tales from the Future: The Test of Time', 'Tales from the Future: The Test of Time', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', 'Outtakes', 'Outtakes', 'Designing Hill Valley', 'Designing Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Photo Galleries', 'Photo Galleries', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Trailer', 'Trailer', 'Back to the Future: The Ride', 'Back to the Future: The Ride', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent MovieScience Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent Movie  See more', 'Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harry Carey, Jr., Elisabeth Shue, Casey Siemaszko, Frank Marshall, Bill Varney, Neil Canton, Claudia Wells, Robert Rutledge, Bob Gale, Charles L. CampbellChristopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harr…  See more', 'Language': 'French (DTS 5.1), Spanish (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '5 hours and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.55 x 0.75 inches; 7.2 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 43 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nVery good films (for a very satisfing weekend binge!) that look better than I remember the film print looking!  It is far above the VHS versions I watched in the 80's.  The extras are great as well, a solid buy.\nLooks great, many extras\nDisney WOW: World of Wonder [Blu-ray]\nn/a  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'The Disney WOW World of Wonder Disc is a definitive \"how to\" guide for in-home High Definition (HD) optimization of home entertainment systems featuring the help of classic Disney character GOOFY and including HD demonstration clips from popular Disney titles including Toy Story, Up, Bolt and Pirates of the Caribbean: At World\\'s End. The easy to follow on-screen guide is designed to help consumers get the best quality experience from their home theater systems by providing everyone from beginners and enthusiasts to experts and custom installers alike with valuable high quality calibration tools.', 'Review', \"Until now, do-it-yourself home theater enthusiasts only had two viable options when calibrating their HD-equipped systems: Digital Video Essentials HD Basics and Spears & Munsil High-Definition Benchmark, both of which suffer from a number of shortcomings and limitations (particularly for those trying to fine-tune an LCD, Plasma or LED display). Enter Disney, a somewhat surprising (and welcome) new player on the calibration stage. WOW: World of Wonder not only sets the bar for calibration suites available in high definition, it provides an as-yet-unrivaled home-video education on the nuances of properly calibrated audio and video gear, offers an extensive collection of smartly conceived tests and tools, and delivers it all via a helpful, user-friendly experience designed with a variety of users in mind. --Blu-ray ForumAll home theaters should have a disc like this. WOW is a tutorial disc that helps you to set up your HD system to its maximum potential. It helps you calibrate the sound and the picture, and does so with easy step-by-step guides. --Best Blu-ray Movies, Yahoo NewsKudos to Disney, Using a combination of the beginner and advanced calibration tools, I dialed in the Samsung TV to some accurate, eye-popping levels, Disney's WOW disc is great for installers and home theater enthusiasts. The disc produced some stunning results. --Robert Archer, CE Pro\"]\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Blu-ray, Full Screen, NTSC, Widescreen', 'Language': 'English (DTS-HD High Res Audio)', 'Runtime': '4 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 6.4 Ounces', 'Media Format': 'Multiple Formats, Blu-ray, Full Screen, NTSC, Widescreen', 'Run time': '4 hours', 'Release date': 'November 2, 2010', 'Studio': 'Walt Disney Studio Home Entertainment', 'Number of discs': '2'}\nI work in TV and film, and while I am not an engineer I do know my way around scopes and test patterns.  This is a very easy disc to use to get the most out of your TV (and even your sound system).  I highly recommend it even for beginners, they walk you thorugh all the settings and you can do a complete video adjustment in about 15 minutes.<br /><br />There is a separate set of tests for displays and projectors, I even took this to the University where I teach and calibrate the projector in the classroom, what a difference.  No more telling students to take my word for the way things look!\nEasy and effective\n{'Subtitles': ['None available'], 'Directors': ['Mark Osborne', 'John Stevenson'], 'Producers': ['Melissa Cobb', 'Jonathan Aibel', 'Glenn Berger'], 'Starring': ['Jack Black', 'Jackie Chan', 'Dustin Hoffman'], 'Studio': ['Paramount']}\nEven though this was made many years ago it hold up very well.  The animation looks great even when compared to today's movies.  Great for the whole family!\nA modern classic that holds up very well.\nSmokey and the Bandit [Blu-ray]\nBurt Reynolds  (Actor),     Jackie Gleason  (Actor),     Hal Needham  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Get ready to tear up the highway with the Bandit (Burt Reynolds) a fun-loving fast-talking trucker who takes on his craziest haul yet - delivering 400 cases of beer from Texarkana to Atlanta in just 28 hours. With Sheriff Buford T. Justice (Jackie Gleason) hot on his trail and eager to teach him some respect for the law the Bandit joins forces with good ol' boy Cledus (Jerry Reed) and runaway bride Carrie (Sally Field). Gear up for huge laughs pedal-to-the-metal action and some of the wildest car crashes ever\"]\n{'Genre': 'car chase movie, trucker movie, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure, Smokey & the Banditcar chase movie, trucker movie, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure, Smokey & the Bandit  See more', 'Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Contributor': 'Charles Shyer, Burt Reynolds, Pat McCormick, Walter Hannemann, Alan Mandel, James Lee Barrett, Mike Henry, Sally Field, Hal Needham, Angelo Ross, Paul Williams, Jackie Gleason, Jerry Reed, Mort EngelbergCharles Shyer, Burt Reynolds, Pat McCormick, Walter Hannemann, Alan Mandel, James Lee Barrett, Mike Henry, Sally Field, Hal Needham, Angelo Ross, Paul Williams, Jackie Gleason, Jerry Reed, Mort Engelberg  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), English (DTS-HD Master Audio 5.1), French (DTS-HD 2.0)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '25192139987', 'Director': 'Hal Needham', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Burt Reynolds, Jackie Gleason, Sally Field, Jerry Reed, Mike Henry', 'Subtitles': 'French, Spanish', 'Producers': 'Mort Engelberg', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'James Lee Barrett, Charles Shyer, Alan Mandel', 'Number of discs': '2'}\nI hadn't seen this movie in over 25 years, but I stil enjoyed the heck out of it!  I recently bought an old Trans Am and had to make my wife watch this so she could understand why that car means so much to boys my age.  The movies looks great on BluRay and the extras are good too.\nHolds up surprisingly well!\nZootopia (3D/BD/DVD/Digital HD) [3D Blu-ray]\nGinnifer Goodwin  (Actor),     Jason Bateman  (Actor),     Byron Howard  (Director),     Rich Moore  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From Walt Disney Animation Studios comes a comedy-adventure set in the modern mammal metropolis of ZOOTOPIA. Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case -- even if it means partnering with scam-artist fox Nick Wilde to solve the mystery. Bring home this hilarious adventure full of action and heart. It's big fun for all shapes and species!\"]\n{'Genre': 'Kids & Family', 'Format': 'Color, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copyColor, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copy  See more', 'Contributor': 'Jason Bateman, Jared Bush, Byron Howard, Idris Elba, Ginnifer Goodwin, Rich Moore', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '35369621', 'Director': 'Byron Howard, Rich Moore, Jared Bush', 'Media Format': 'Color, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copy', 'Run time': '1 hour and 48 minutes', 'Release date': 'June 7, 2016', 'Actors': 'Ginnifer Goodwin, Jason Bateman, Idris Elba', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Number of discs': '3'}\nCute characters, engaging story and humor, what's not to love?!<br />The 3D effects are also great, much better than in the movie theater.  There are lots of reviews online about whether or not to buy certain movies in 3D, almost everybody says this one is worth the upgrade.  My kids and I agree!\nGreat movie, impressive 3D\nThe King of Kong: A Fistful of Quarters\nBilly Mitchell  (Actor),     Steve Wiebe  (Actor),     Seth Gordon  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Product Description', 'King of Kong: A Fistful of Quarters (DVD)', 'In the cutthroat world of Donkey Kong, only one can rule! A middle-school science teacher and a hot sauce mogul vie for the Guinness World Record on the arcade classic, Donkey Kong. Steve and Billy engage in a cross-country duel to see who could set the high score and become the King of Kong! Along the way, both men learn valuable lessons about what it means to be a father, a husband, and a true champion - discovering that you don\\'t always need to win to be a winner. \"A hilarious and moving study of the obsessive competition between the all-time scoring leader on Donkey Kong, an odd Floridian, and a father of two who gets sucked into a world of mind-blowing passive-aggressiveness. \"Boston Globe\".', ']]>', 'Amazon.com', \"The stuff of gladiatorial battle is here: good versus evil, right versus wrong, nerd versus... super-nerd? At any rate, it's a more entertaining showdown than most fictional movies can muster.\", 'The King of Kong', 'is the saga of Steve Wiebe, a Redmond, Washington dweeb who sets a new record in the video game', 'Donkey Kong', ', only to see his accomplishment challenged by the grand poobahs of the gaming establishment. And if you don\\'t know how pernickety the grand poobahs of the gaming establishment can be, well, one of the pleasures of this movie is finding out about this collection of oddballs. It seems Wiebe has toppled a score that has stood since 1982, when eminent \"Gamer of the Century\" Billy Mitchell set it, and Mitchell isn\\'t too happy about being overthrown. A black-mulleted showboat, Mitchell provides the perfect counterpoint to Wiebe\\'s mild-mannered family man, and the smaller fish around him are no less colorful. This is one of those movies you watch in delighted disbelief, marveling that such people exist--and that they gladly allowed themselves to be filmed. Director Seth Gordon does an important thing in presenting this world of eccentrics: he doesn\\'t mock them, or provide editorial nudging; he simply lets them be. The result is an ingratiating classic.', '--Robert Horton']\n{'Genre': 'Documentary', 'Format': 'AC-3, Dolby, Subtitled, Anamorphic', 'Contributor': 'Billy Mitchell, Steve Wiebe, Seth Gordon', 'Initial release date': '2008-01-29', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 0.32 Ounces', 'Item model number': '1000035229', 'Director': 'Seth Gordon', 'Media Format': 'AC-3, Dolby, Subtitled, Anamorphic', 'Run time': '1 hour and 19 minutes', 'Release date': 'January 29, 2008', 'Actors': 'Billy Mitchell, Steve Wiebe', 'Subtitles': 'English, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nI teach film production at a university and I bought this to show to my documentary filmmaking classes.  It is an excellent example of how a good doc can make you care about something that you never thought you'd care about.  I love seeing the young women in the class start out rolling their eyes but quickly get drawn into the story.  This doc is consitantly a class favorite.\nEven if you don't like video games you should watch this!\nTed 2 [Blu-ray]\nMark Wahlberg  (Actor),     Amanda Seyfried  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Comedy\n{'Genre': 'Science Fiction & Fantasy, DVD Movie, Blu-ray Movie, Comedy', 'Format': 'Blu-ray, Ultraviolet, Color, Widescreen, Ultraviolet, Digital_copy', 'Contributor': 'Mark Wahlberg, Morgan Freeman, Amanda Seyfried, Barry Ratcliffe, Jessica Barth, Seth MacFarlane', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), French Canadian (Dolby Digital 5.1), French Canadian (DTS 5.1), Spanish (DTS 5.1)', 'Runtime': '8 hours and 6 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 0.75 inches; 2.4 Ounces', 'Item model number': '35222385', 'Director': 'Seth MacFarlane', 'Media Format': 'Blu-ray, Ultraviolet, Color, Widescreen, Ultraviolet, Digital_copy', 'Run time': '8 hours and 6 minutes', 'Release date': 'December 15, 2015', 'Actors': 'Mark Wahlberg, Amanda Seyfried, Seth MacFarlane, Morgan Freeman, Jessica Barth', 'Subtitles': 'French, Spanish', 'Studio': 'Universal', 'Number of discs': '2'}\nThere is not a lot to say.  If you liked the first one then you will like this one.  If you didn't, or otherwise dislike Seth McFarlane's humor then keep moving.\nI think you know what you are geting yourself into here\nMad Max: Fury Road (3D Blu-ray + Blu-ray)\nTom Hardy  (Actor),     Charlize Theron  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Oscar Nominees\n['Mad Max: Fury Road (3D Blu-ray + Blu-ray)', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Subtitled, Ultraviolet, Ultraviolet, 3D', 'Contributor': 'Brendan McCarthy, Rosie Huntington-Whiteley, Iain Smith, Nico Lathouris, Zoë Kravitz, Abbey Lee, Bruce Berman, Nicholas Hoult, P.J. Voeten, Hugh Keays-Byrne, Nathan Jones, Doug Mitchell, George Miller, Riley Keough, Tom Hardy, Graham Burke, Courtney Eaton, Charlize TheronBrendan McCarthy, Rosie Huntington-Whiteley, Iain Smith, Nico Lathouris, Zoë Kravitz, Abbey Lee, Bruce Berman, Nicholas Hoult, P.J. Voeten, Hugh Keays-Byrne, Nathan Jones, Doug Mitchell, George Miller, Riley Keough, Tom Hardy, Graham Burke, Courtney Eaton, Charlize…  See more', 'Initial release date': '2015-09-01', 'Language': 'English (Dolby Digital 5.1), Thai (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Digital Copy Expiration Date': 'September 1, 2018', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Item model number': '35226144', 'Director': 'George Miller', 'Media Format': 'Subtitled, Ultraviolet, Ultraviolet, 3D', 'Run time': '2 hours', 'Release date': 'September 1, 2015', 'Actors': 'Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley', 'Subtitles': 'English, Portuguese, Spanish, Korean, Thai, French', 'Producers': 'Iain Smith, Doug Mitchell, Graham Burke, George Miller, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'George Miller, Brendan McCarthy, Nico Lathouris', 'Number of discs': '2'}\nIn the past I have avoided seeing a movie in 3D if it was not filmed in 3D (I am looking at you, Clash of the Titans.)  However it seems like the effects houses have gotten this figured out, both The Force Awakens and Mad Max Fury Road are excellent 3D titles and neither were shot in 3D.<br />I won't get into a movie review too much, but I thought Fury Road was a worth addition to the Mad Max story.  I was not wild about Tom Hardy's interpretation of Max (I really wish Mel Gibson hadn't gone nuts and could have done this film) but the new characters are engaging and the action is top notch.<br />Both the desolation of the open spaces and the closeness of the interior environments are improved by the 3D.  Apart from the absurd steering wheel that flies right at the screen the film is devoid of effects that draw attention to themselves.  In defense of the 3D version that steering wheel gag is just as distractingand annoying in 2D.<br />If you like the franchise you will like this movie.  If you like this movie you will enjoy the extra value of the 3D version.\nThe 3D is worth it!\nJackie Chan's PROJECT A & PROJECT A PART II (Eureka Classics) Limited Edition Blu-ray\nJackie Chan  (Actor)    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"A pair of incredible action-adventure extravaganza's from the legendary\", 'Jackie Chan', ',', 'Project A', 'and', 'Project A Part II', 'make their long overdue debut on Blu-ray in the UK from brand new 2K restorations. Starring three of the greatest martial-arts action stars of all time (Jackie Chan, Sammo Hung and Yuen Biao), the', 'Project A', 'films blended unparalleled martial artistry, death defying stunts and physical comedy in a way that has yet to be matched.', 'Project A', 'Jackie plays Sergeant Dragon Ma, a turn-of-the-century coastguard, hot on the trail of a ruthless band of cut-throat pirates, intent on spreading a trail of blood and mayhem across the South China Seas.', 'Project A', 'features some of the most dangerous stunts of Jackie s career, including homages to Buster Keaton s', 'Steamboat Bill, Jr.', 'and Harold Lloyd s', 'Safety Last!', '.', 'Project A Part II', 'After the events of the first film, Dragon Ma is given a new assignment, to clean up crime and corruption in the roughest part of town. The pressure was on to top the first film in terms of sheer spectacle, but', 'Project A Part II', 'rises to the challenge and delivers one of the most stunt-packed, rip-roaring action-adventures of all time.', 'Presented from brand new 2K restorations and fully uncut, Eureka Classics is proud to present Jackie Chan s', 'Project A', 'and', 'Project A Part II', 'for the first time on Blu-ray in the UK in a special', 'Limited Edition Box Set (4000 copies)', 'packed with extra content.', 'SPECIAL FEATURES:', 'Special Limited Edition Box Set of 4000 copies', 'Special Limited Edition Box Set of 4000 copies', '1080p presentations of both films, sourced from brand new 2K restorations and making their UK debuts on Blu-ray', '1080p presentations of both films, sourced from brand new 2K restorations and making their UK debuts on Blu-ray', 'Original Cantonese audio tracks for both films (mono for Project A and stereo for Project A Part II)', 'Original Cantonese audio tracks for both films (mono for', 'Project A', 'and stereo for', 'Project A Part II', ')', 'Restored 5.1 Cantonese and English audio options', 'Restored 5.1 Cantonese and English audio options', 'Optional English subtitles', 'Optional English subtitles', 'A new video interview with Tony Rayns', 'A new video interview with Tony Rayns', 'Archival interview with Jackie Chan [30 mins]', 'Archival interview with Jackie Chan [30 mins]', 'Interview with actor Lee Hoi San [22 mins]', 'Interview with actor Lee Hoi San [22 mins]', 'Interview with actor Yuen Biao [18 mins]', 'Interview with actor Yuen Biao [18 mins]', 'Interview with actor Dick Wei [14 mins]', 'Interview with actor Dick Wei [14 mins]', 'Interview with actor Michael Chan Wai-Man [20 mins]', 'Interview with actor Michael Chan Wai-Man [20 mins]', 'Interview with composer Michael Lai [17 mins]', 'Interview with composer Michael Lai [17 mins]', 'Interview with writer and producer Edward Tang [30 mins]', 'Interview with writer and producer Edward Tang [30 mins]', 'Interview with stuntman Anthony Carpio [29 mins]', 'Interview with stuntman Anthony Carpio [29 mins]', 'Interview with stuntman Mars [15 mins]', 'Interview with stuntman Mars [15 mins]', 'Someone Will Know Me [13 mins] - an archival featurette which includes interviews with stuntmen Mars, Chris Lee Kin-Sang and Rocky Lai', 'Someone Will Know Me', '[13 mins] - an archival featurette which includes interviews with stuntmen Mars, Chris Lee Kin-Sang and Rocky Lai', 'Alternate outtakes for Project A from the Japanese version of the film', 'Alternate outtakes for', 'Project A', 'from the Japanese version of the film', 'Archival behind-the-scenes footage [24 mins]', 'Archival behind-the-scenes footage [24 mins]', 'Deleted Scenes', 'Deleted Scenes', 'PLUS: A wide selection of rare archival content!', 'PLUS:', 'A wide selection of rare archival content!', 'Box set exclusive Collectors booklets for each film, featuring new essays and archival content', 'Box set exclusive Collectors booklets for each film, featuring new essays and archival content']\n{'Genre': 'Action & Adventure', 'Format': 'PAL', 'Contributor': 'Jackie Chan', 'Runtime': '3 hours and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.93 x 5.51 x 1.38 inches; 9.88 Ounces', 'Media Format': 'PAL', 'Run time': '3 hours and 31 minutes', 'Release date': 'October 29, 2018', 'Actors': 'Jackie Chan', 'Studio': 'Eureka Entertainment Ltd', 'Number of discs': '2'}\nI never got a chance to watch the film because a crooked seller on Amazon did not disclose that this Blu-Ray is locked for region B players.<br />I hope this information will save somebody else the time, disappointment and cost of a purchase that will not work in the USA.\nRegion B only!! Will not work on a USA player!!",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Kung Fu Panda Two-Disc Blu-ray Boxed Set (Kung Fu Panda / Kung Fu Panda 2 / Secrets of the Masters)\nReview Date: 2014/10/17\nStore: Jack Black  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Get both', 'Kung Fu Panda', 'movies plus the all-new Po adventure', 'Kung Fu Panda: Secrets of the Masters', ', and so much more!', 'Amazon.com', 'Kung Fu Panda', 'What\\'s a panda to do when his dreams of kung-fu awesomeness awake to the cold reality of noodle-making? Clumsy, overweight Po (Jack Black) dreams of becoming a kung fu master like China\\'s revered \"furious five,\" but instead seems destined to follow in the footsteps of his father and grandfather in the restaurant business. When great leader Oogway has a vision that the imprisoned kung fu warrior Tai Lung (Ian McShane) will soon escape, he declares it time to choose China\\'s dragon warrior--one kung fu master deemed worthy of possessing the dragon\\'s scroll and its secret to limitless power. Po and all the townspeople rush to the Jade Palace atop the highest mountain to witness the contest between Tigress (Angelina Jolie), Monkey (Jackie Chan), Mantis (Seth Rogan), Crane (David Cross) and Viper (Lucy Liu), but Po is locked outside the palace. After a miracle of sorts, Po lands inside the palace gates, where he is chosen as the dragon warrior and placed under the tutelage of the decidedly non-plussed master Shifu (Dustin Hoffman). An unconventional student to say the least, hilarity reigns as Shifu tries desperately to make Po into some semblance of a kung fu warrior. Can Po possibly fulfill his destiny as dragon warrior, or was Oogway\\'s final decision a critical mistake? A film rich with hilarious moments, superior animation, and an important message about believing in oneself and the power that comes from within,', 'Kung Fu Panda', 'is great entertainment that will have the whole family laughing and begging for more. (Ages 3 and older)', '--Tami Horiuchi', 'Kung Fu Panda 2', 'Kung Fu Panda 2', \"is a sequel that definitely lives up to its predecessor, thanks to excellent animation and a great mix of action, comedy, and important life lessons. Dragon Warrior Po (Jack Black) has matured and mastered many new challenges since learning the art of kung fu and defeating the snow leopard Tai Lung, but he hasn't lost his penchant for steamed buns, nor has he achieved what his teacher Master Shifu (Dustin Hoffman) describes as true inner peace. Before he can settle into the arduous task of self-discovery, word arrives that a nearby town of musicians has been attacked and their leader Master Thundering Rhino (Victor Garber) killed by a newly invented weapon that breathes fire and spits out metal--a weapon that is a harbinger of the end of kung fu and the domination of all of China by Lord Shen (Gary Oldman). Po and the Furious Five (Angelina Jolie, Seth Rogen, Jackie Chan, David Cross, and Lucy Liu) set out to destroy the mysterious weapon and save kung fu, encountering the imprisoned and very dispirited kung fu legends Master Oxen (Dennis Haysbert) and Master Croc (Jean-Claude Van Damme) along the way, but the group quickly discovers that their task is far from simple. Even as Soothsayer (Michelle Yeoh) adamantly foretells Lord Shen's defeat at the hands of a warrior of black and white, Po struggles with the realization that he must come to terms with his adoption in order to let go of the past and become who he chooses to be. Only then can he achieve the inner peace that will empower him to triumph over his personal insecurities and Lord Shen.\", 'Kung Fu Panda 2', 'offers excellent animation and 3-D effects, nice brisk pacing, great voice talent, life lessons that ring true, and a healthy dose of comedy that includes everything from wisecracks to a dragon that eats unsuspecting villagers and then poops them out, and a radish trained in the art of kung fu. (Ages 3 and older)', '--Tami Horiuchi']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Music Videos & Concerts', 'Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Contributor': 'Jack Black', 'Runtime': '1 hour and 33 minutes', 'Studio': 'Universal Pictures Home Entertainment', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Media Format': 'Multiple Formats, Animated, Blu-ray, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'December 13, 2011', 'Actors': 'Jack Black', 'Number of discs': '2'}\nReview Text: I got major points from the kids AND the wife on this purchase!  Great movie, gorgeous Blu-Ray quality.\nReview Title: A must-have for fans of the franchise!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Apocalypse Now (Apocalypse Now / Apocalypse Now Redux / Hearts of Darkness) (Three-Disc Full Disclosure Edition) [Blu-ray]\nReview Date: 2015/04/23\nStore: Martin Sheen  (Actor),     Marlon Brando  (Actor),     Francis Ford Coppola  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', \"Francis Ford Coppola's timeless classic comes to Blu-ray for the first time! This 3-Disc Full Disclosure Edition includes Apocalypse Now and Apocalypse Now Redux in stunning new transfers supervised by Francis Ford Coppola - and presented for the first time in their original 2.35:1 theatrical aspect ratios. Also included is the feature-length making-of documentary Hearts of Darkness, presented in a new 1080p HD transfer. Additional features include a 48-page collectible booklet with never-before-seen archives from the set, over 9 hours of bonus features, plus a storyboard gallery, image galleries, marketing archives and an original script excerpt from John Milius featuring hand-written notes from Coppola.\", 'Amazon.com', 'Apocalypse Now / Apocalypse Now: Redux', 'In the tradition of such obsessively driven directors as Erich von Stroheim and Werner Herzog, Francis Ford Coppola approached the production of', 'Apocalypse Now', 'as if it were his own epic mission into the heart of darkness. On location in the storm-ravaged Philippines, he quite literally went mad as the project threatened to devour him in a vortex of creative despair, but from this insanity came one of the greatest films ever made. It began as a John Milius screenplay, transposing Joseph Conrad\\'s classic story \"Heart of Darkness\" into the horrors of the Vietnam War, following a battle-weary Captain Willard (Martin Sheen) on a secret upriver mission to find and execute the renegade Colonel Kurtz (Marlon Brando), who has reverted to a state of murderous and mystical insanity. The journey is fraught with danger involving wartime action on epic and intimate scales. One measure of the film\\'s awesome visceral impact is the number of sequences, images, and lines of dialogue that have literally burned themselves into our cinematic consciousness, from the Wagnerian strike of helicopter gunships on a Vietnamese village to the brutal murder of stowaways on a peasant sampan and the unflinching fearlessness of the surfing warrior Lieutenant Colonel Kilgore (Robert Duvall), who speaks lovingly of \"the smell of napalm in the morning.\" Like Herzog\\'s Aguirre: The Wrath of God, this film is the product of genius cast into a pit of hell and emerging, phoenix-like, in triumph. Coppola\\'s obsession (effectively detailed in the riveting documentary', 'Hearts of Darkness', \", directed by Coppola's wife, Eleanor) informs every scene and every frame, and the result is a film for the ages. --\", 'Jeff Shannon', 'Hearts of Darkness', 'Hearts of Darkness', \"is an engrossing, unwavering look back at Francis Coppola's chaotic, catastrophe-plagued Vietnam production,\", 'Apocalypse Now', \". Filled with juicy gossip and a wonderful behind-the-scenes look at the stressful world of moviemaking, the documentary mixes on-location home movies shot in the Philippines by Eleanor Coppola, the director's wife, with revealing interviews with the cast and crew, shot 10 years later. Similar to Burden of Dreams, Les Blank's absorbing portrait of Werner Herzog's struggle to make Fitzcarraldo, the film chronicles Coppola's eventual decent into obsessive psychosis as everything that could go wrong does go wrong. Storms destroy sets, money evaporates, the Philippine government continually harasses the director, Coppola has romantic affairs, and he can't write the story's ending. Everything is captured on film. In the most disturbing scene, we watch Martin Sheen have a drunken nervous breakdown while his director goads him on (he eventually suffered a heart attack, but finished the film).  Other incredible footage is not visual, but aural as the film includes tapes Eleanor Coppola recorded without Francis's knowledge. In them, he truly sounds like a madman as he confesses his fears about making a bomb of a movie. But while Hearts of Darkness is an amazing, voyeuristic experience, its importance lies in the personal reflections offered by those involved. Sheen, Coppola, and Dennis Hopper speak frankly without embarrassment, offering us an essential piece of film history. --\", 'Dave McCoy']\nAverage Rating: 4.6\nProduct Details: {'Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more', 'Contributor': 'Francis Ford Coppola, Martin Sheen, Marlon Brando', 'Language': 'English', 'Runtime': '7 hours and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.8 Ounces', 'Item model number': '031398126195', 'Director': 'Francis Ford Coppola', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Closed-captioned, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '7 hours and 31 minutes', 'Release date': 'October 19, 2010', 'Actors': 'Martin Sheen, Marlon Brando', 'Subtitles': 'English, French, Spanish', 'Studio': 'Lionsgate', 'Number of discs': '3'}\nReview Text: A must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the &#34;short&#34; version or the Redux with the restored plantation scene and some other ones as well.  The extras are an amazing insight into how the film was made and the included documentary Hearts of Darkness shows the toll the process took of the director.<br /><br />An amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nReview Title: Why would you not own this?!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blade Runner (30th Anniversary Collector's Edition) [Blu-ray]\nReview Date: 2015/04/23\nStore: Harrison Ford  (Actor),     Ridley Scott  (Director)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['Product Description', \"In a cyberpunk vision of the future, man has developed the technology to create replicants, human clones used to serve in the colonies outside Earth but with fixed lifespans. In Los Angeles, 2019, Deckard is a Blade Runner, a cop who specializes in terminating replicants. Originally in retirement, he is forced to re-enter the force when four replicants escape from an off-world colony to Earth. The #1 sci-fi film of all time is captured in this 3-disc Blu-ray/DVD and 30th Anniversary commemorative gift set. The set includes: the final cut on Blu-ray and DVD.The 30th Anniversary Collector's Edition box set features an all-new concept spinner car, action Lenticular and a 72-page art production book with never-before-seen Ridley sketches, poster art and photos from the set.\", 'Review', \"It is, in fact, an amazingly sophisticated, sumptuously visionary treatise on the consequences of attaining god-hood. --Rita Kempley, The Washington PostThe view of the future offered by Ridley Scott's muddled yet mesmerizing ''Blade Runner'' is as intricately detailed as anything a science-fiction film has yet envisioned. --The New York Times, Janet MaslinRidley Scott's 1982 masterpiece, back on the big screen in this definitive version, is an overwhelming experience --The Guardian, Mark Kermode\"]\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.8 x 5.7 x 7 inches; 8.8 Ounces', 'Item model number': '313554', 'Director': 'Ridley Scott', 'Media Format': \"Multiple Formats, Blu-ray, Box set, NTSC, Widescreen, Collector's Edition\", 'Run time': '1 hour and 57 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Harrison Ford', 'Studio': 'Warner Home Video', 'Number of discs': '3'}\nReview Text: A must have for fans of the film and for film lovers in general.  This has all of the versions so you can watch the original US version with the narration if you wish, the European version, the falsely named &#34;director's cut&#34; or Scott's &#34;Final Version.&#34;<br /><br />The extras are an amazing insight into how the film was restored and how some of the glaring problems were fixed (the scene where Zora is 'retired' and it is obviosuly a stunt woman, the horrible ADR inside the reptile seller's shop and the releasing of the dove at the end).  Otherwise the film was cleaned up and brightened to reveal all of the details in the amazing world Scott and his team created.  For those of us that grew up watching this on VHS it is nothing short of a revelation to see this gorgeous version.<br /><br />This is an amazing presentation of a classic film with a boatload of extras giving insight on how it came to be.  So valuable for any lover of film.\nReview Title: Why would you not buy this?!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Back to the Future: 25th Anniversary Trilogy [Blu-ray]\nReview Date: 2015/05/01\nStore: Michael J. Fox  (Actor),     Christopher Lloyd  (Actor),     Robert Zemeckis  (Director, Writer)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Experience one of the most popular movie series of all time like never before with the Back to the Future 25th Anniversary Trilogy! Join Marty McFly (Michael J. Fox), Doc Brown (Christopher Lloyd) and a time traveling DeLorean for the adventure of a lifetime as they travel to the past, present and future, setting off a time-shattering chain reaction that disrupts the space-time continuum! From filmmakers Steven Spielberg, Robert Zemeckis and Bob Gale, these timeless films feature all-new 25th Anniversary restorations for enhanced picture and sound plus hours of exciting bonus features.', 'Bonus Content:', 'Disc 1 - Back to the Future:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Triva Track', 'U-Control: Triva Track', 'Deleted Scenes', 'Deleted Scenes', 'Tales from the Future: In the Beginning...', 'Tales from the Future: In the Beginning...', 'Tales from the Future: Time to Go', 'Tales from the Future: Time to Go', 'Tales from the Future: Keeping Time', 'Tales from the Future: Keeping Time', 'The Making of Back to the Future', 'The Making of Back to the Future', 'Making the Trilogy: Chapter One', 'Making the Trilogy: Chapter One', 'Back to the Future Night', 'Back to the Future Night', 'Michael J. Fox Q&A', 'Michael J. Fox Q&A', 'Original Makeup Tests', 'Original Makeup Tests', 'Outtakes', 'Outtakes', 'Nuclear Test Site Ending Storyboard Sequence', 'Nuclear Test Site Ending Storyboard Sequence', 'Photo Galleries', 'Photo Galleries', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Huey Lewis and the News \"Power of Love\" Music Video', 'Theatrical Teaser Trailer', 'Theatrical Teaser Trailer', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Join TEAM FOX', 'Join TEAM FOX', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 2 - Back to the Future Part II:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control: Trivia Track', 'U-Control: Trivia Track', 'Deleted Scene', 'Deleted Scene', 'Tales from the Future: Time Flies', 'Tales from the Future: Time Flies', 'The Physics of Back to the Future', 'The Physics of Back to the Future', 'The Making of Back to the Future Part II', 'The Making of Back to the Future Part II', 'Making the Trilogy: Chapter Two', 'Making the Trilogy: Chapter Two', 'Outtakes', 'Outtakes', 'Production Design', 'Production Design', 'Storyboarding', 'Storyboarding', 'Designing the DeLeorean', 'Designing the DeLeorean', 'Designing Time Travel', 'Designing Time Travel', 'Hoverboard Test', 'Hoverboard Test', 'Evolution of Visual Effects', 'Evolution of Visual Effects', 'Photo Galleries', 'Photo Galleries', 'Trailer', 'Trailer', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Q&A with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'Feature Commentary with Producers Bob Gales and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', 'Disc 3 - Back to the Future Part III:', 'U-Control: Setups & Payoffs', 'U-Control: Setups & Payoffs', 'U-Control: Storyboard Comparison', 'U-Control: Storyboard Comparison', 'U-Control Trivia Track', 'U-Control Trivia Track', 'Deleted Scene', 'Deleted Scene', \"Tales from the Future: Third Time's the Charm\", \"Tales from the Future: Third Time's the Charm\", 'Tales from the Future: The Test of Time', 'Tales from the Future: The Test of Time', 'The Making of Back to the Future Part III', 'The Making of Back to the Future Part III', 'Making the Trilogy: Chapter Three', 'Making the Trilogy: Chapter Three', 'The Secrets of the Back to the Future Trilogy', 'The Secrets of the Back to the Future Trilogy', 'Outtakes', 'Outtakes', 'Designing Hill Valley', 'Designing Hill Valley', 'Designing the Campaign', 'Designing the Campaign', 'Photo Galleries', 'Photo Galleries', 'ZZ Top \"Doubleback\" Music Video', 'ZZ Top \"Doubleback\" Music Video', \"FAQ's About the Trilogy\", \"FAQ's About the Trilogy\", 'Trailer', 'Trailer', 'Back to the Future: The Ride', 'Back to the Future: The Ride', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Q&A Commentary with Director Robert Zemeckis and Producer Bob Gale', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'Feature Commentary with Producers Bob Gale and Neil Canton', 'My Scenes', 'My Scenes', 'BD-Live', 'BD-Live', 'pocket BLU App', 'pocket BLU App', 'D-BOX', 'D-BOX', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent MovieScience Fiction & Fantasy, Kids & Family, Back to the Future Part II, DVD Movie, Back to the Future, Digital Movie, Blu-ray Movie, Comedy, Back to the Future Part III, Buy Movie, Action & Adventure, Rent Movie  See more', 'Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Christopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harry Carey, Jr., Elisabeth Shue, Casey Siemaszko, Frank Marshall, Bill Varney, Neil Canton, Claudia Wells, Robert Rutledge, Bob Gale, Charles L. CampbellChristopher Lloyd, William B. Kaplan, Flea, Billy Zane, Steven Spielberg, Robert Zemeckis, Michael J. Fox, Lea Thompson, Elijah Wood, Robert Thirlwell, Kathleen Kennedy, Richard Dysart, B. Tennyson Sebastian II, Crispin Glover, Mary Steenburgen, Thomas F. Wilson, Harr…  See more', 'Language': 'French (DTS 5.1), Spanish (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '5 hours and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.55 x 0.75 inches; 7.2 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 43 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Michael J. Fox, Christopher Lloyd, Lea Thompson, Thomas F. Wilson, Crispin Glover', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Bob Gale, Neil Canton, Steven Spielberg, Kathleen Kennedy, Frank Marshall', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Robert Zemeckis, Bob Gale', 'Number of discs': '3'}\nReview Text: Very good films (for a very satisfing weekend binge!) that look better than I remember the film print looking!  It is far above the VHS versions I watched in the 80's.  The extras are great as well, a solid buy.\nReview Title: Looks great, many extras\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Disney WOW: World of Wonder [Blu-ray]\nReview Date: 2015/07/03\nStore: n/a  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'The Disney WOW World of Wonder Disc is a definitive \"how to\" guide for in-home High Definition (HD) optimization of home entertainment systems featuring the help of classic Disney character GOOFY and including HD demonstration clips from popular Disney titles including Toy Story, Up, Bolt and Pirates of the Caribbean: At World\\'s End. The easy to follow on-screen guide is designed to help consumers get the best quality experience from their home theater systems by providing everyone from beginners and enthusiasts to experts and custom installers alike with valuable high quality calibration tools.', 'Review', \"Until now, do-it-yourself home theater enthusiasts only had two viable options when calibrating their HD-equipped systems: Digital Video Essentials HD Basics and Spears & Munsil High-Definition Benchmark, both of which suffer from a number of shortcomings and limitations (particularly for those trying to fine-tune an LCD, Plasma or LED display). Enter Disney, a somewhat surprising (and welcome) new player on the calibration stage. WOW: World of Wonder not only sets the bar for calibration suites available in high definition, it provides an as-yet-unrivaled home-video education on the nuances of properly calibrated audio and video gear, offers an extensive collection of smartly conceived tests and tools, and delivers it all via a helpful, user-friendly experience designed with a variety of users in mind. --Blu-ray ForumAll home theaters should have a disc like this. WOW is a tutorial disc that helps you to set up your HD system to its maximum potential. It helps you calibrate the sound and the picture, and does so with easy step-by-step guides. --Best Blu-ray Movies, Yahoo NewsKudos to Disney, Using a combination of the beginner and advanced calibration tools, I dialed in the Samsung TV to some accurate, eye-popping levels, Disney's WOW disc is great for installers and home theater enthusiasts. The disc produced some stunning results. --Robert Archer, CE Pro\"]\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Blu-ray, Full Screen, NTSC, Widescreen', 'Language': 'English (DTS-HD High Res Audio)', 'Runtime': '4 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 6.4 Ounces', 'Media Format': 'Multiple Formats, Blu-ray, Full Screen, NTSC, Widescreen', 'Run time': '4 hours', 'Release date': 'November 2, 2010', 'Studio': 'Walt Disney Studio Home Entertainment', 'Number of discs': '2'}\nReview Text: I work in TV and film, and while I am not an engineer I do know my way around scopes and test patterns.  This is a very easy disc to use to get the most out of your TV (and even your sound system).  I highly recommend it even for beginners, they walk you thorugh all the settings and you can do a complete video adjustment in about 15 minutes.<br /><br />There is a separate set of tests for displays and projectors, I even took this to the University where I teach and calibrate the projector in the classroom, what a difference.  No more telling students to take my word for the way things look!\nReview Title: Easy and effective\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/01/04\nAverage Rating: 4.5\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Mark Osborne', 'John Stevenson'], 'Producers': ['Melissa Cobb', 'Jonathan Aibel', 'Glenn Berger'], 'Starring': ['Jack Black', 'Jackie Chan', 'Dustin Hoffman'], 'Studio': ['Paramount']}\nReview Text: Even though this was made many years ago it hold up very well.  The animation looks great even when compared to today's movies.  Great for the whole family!\nReview Title: A modern classic that holds up very well.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Smokey and the Bandit [Blu-ray]\nReview Date: 2016/04/28\nStore: Burt Reynolds  (Actor),     Jackie Gleason  (Actor),     Hal Needham  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Get ready to tear up the highway with the Bandit (Burt Reynolds) a fun-loving fast-talking trucker who takes on his craziest haul yet - delivering 400 cases of beer from Texarkana to Atlanta in just 28 hours. With Sheriff Buford T. Justice (Jackie Gleason) hot on his trail and eager to teach him some respect for the law the Bandit joins forces with good ol' boy Cledus (Jerry Reed) and runaway bride Carrie (Sally Field). Gear up for huge laughs pedal-to-the-metal action and some of the wildest car crashes ever\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'car chase movie, trucker movie, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure, Smokey & the Banditcar chase movie, trucker movie, DVD Movie, Blu-ray Movie, Comedy, Action & Adventure, Smokey & the Bandit  See more', 'Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Contributor': 'Charles Shyer, Burt Reynolds, Pat McCormick, Walter Hannemann, Alan Mandel, James Lee Barrett, Mike Henry, Sally Field, Hal Needham, Angelo Ross, Paul Williams, Jackie Gleason, Jerry Reed, Mort EngelbergCharles Shyer, Burt Reynolds, Pat McCormick, Walter Hannemann, Alan Mandel, James Lee Barrett, Mike Henry, Sally Field, Hal Needham, Angelo Ross, Paul Williams, Jackie Gleason, Jerry Reed, Mort Engelberg  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), English (DTS-HD Master Audio 5.1), French (DTS-HD 2.0)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '25192139987', 'Director': 'Hal Needham', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Burt Reynolds, Jackie Gleason, Sally Field, Jerry Reed, Mike Henry', 'Subtitles': 'French, Spanish', 'Producers': 'Mort Engelberg', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'James Lee Barrett, Charles Shyer, Alan Mandel', 'Number of discs': '2'}\nReview Text: I hadn't seen this movie in over 25 years, but I stil enjoyed the heck out of it!  I recently bought an old Trans Am and had to make my wife watch this so she could understand why that car means so much to boys my age.  The movies looks great on BluRay and the extras are good too.\nReview Title: Holds up surprisingly well!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Zootopia (3D/BD/DVD/Digital HD) [3D Blu-ray]\nReview Date: 2016/08/20\nStore: Ginnifer Goodwin  (Actor),     Jason Bateman  (Actor),     Byron Howard  (Director),     Rich Moore  (Director)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From Walt Disney Animation Studios comes a comedy-adventure set in the modern mammal metropolis of ZOOTOPIA. Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case -- even if it means partnering with scam-artist fox Nick Wilde to solve the mystery. Bring home this hilarious adventure full of action and heart. It's big fun for all shapes and species!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Color, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copyColor, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copy  See more', 'Contributor': 'Jason Bateman, Jared Bush, Byron Howard, Idris Elba, Ginnifer Goodwin, Rich Moore', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '35369621', 'Director': 'Byron Howard, Rich Moore, Jared Bush', 'Media Format': 'Color, Dolby, AC-3, Animated, NTSC, Subtitled, Dubbed, DTS Surround Sound, Widescreen, 3D, Digital_copy', 'Run time': '1 hour and 48 minutes', 'Release date': 'June 7, 2016', 'Actors': 'Ginnifer Goodwin, Jason Bateman, Idris Elba', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Number of discs': '3'}\nReview Text: Cute characters, engaging story and humor, what's not to love?!<br />The 3D effects are also great, much better than in the movie theater.  There are lots of reviews online about whether or not to buy certain movies in 3D, almost everybody says this one is worth the upgrade.  My kids and I agree!\nReview Title: Great movie, impressive 3D\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The King of Kong: A Fistful of Quarters\nReview Date: 2017/03/25\nStore: Billy Mitchell  (Actor),     Steve Wiebe  (Actor),     Seth Gordon  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases\nProduct Description: ['Product Description', 'King of Kong: A Fistful of Quarters (DVD)', 'In the cutthroat world of Donkey Kong, only one can rule! A middle-school science teacher and a hot sauce mogul vie for the Guinness World Record on the arcade classic, Donkey Kong. Steve and Billy engage in a cross-country duel to see who could set the high score and become the King of Kong! Along the way, both men learn valuable lessons about what it means to be a father, a husband, and a true champion - discovering that you don\\'t always need to win to be a winner. \"A hilarious and moving study of the obsessive competition between the all-time scoring leader on Donkey Kong, an odd Floridian, and a father of two who gets sucked into a world of mind-blowing passive-aggressiveness. \"Boston Globe\".', ']]>', 'Amazon.com', \"The stuff of gladiatorial battle is here: good versus evil, right versus wrong, nerd versus... super-nerd? At any rate, it's a more entertaining showdown than most fictional movies can muster.\", 'The King of Kong', 'is the saga of Steve Wiebe, a Redmond, Washington dweeb who sets a new record in the video game', 'Donkey Kong', ', only to see his accomplishment challenged by the grand poobahs of the gaming establishment. And if you don\\'t know how pernickety the grand poobahs of the gaming establishment can be, well, one of the pleasures of this movie is finding out about this collection of oddballs. It seems Wiebe has toppled a score that has stood since 1982, when eminent \"Gamer of the Century\" Billy Mitchell set it, and Mitchell isn\\'t too happy about being overthrown. A black-mulleted showboat, Mitchell provides the perfect counterpoint to Wiebe\\'s mild-mannered family man, and the smaller fish around him are no less colorful. This is one of those movies you watch in delighted disbelief, marveling that such people exist--and that they gladly allowed themselves to be filmed. Director Seth Gordon does an important thing in presenting this world of eccentrics: he doesn\\'t mock them, or provide editorial nudging; he simply lets them be. The result is an ingratiating classic.', '--Robert Horton']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Documentary', 'Format': 'AC-3, Dolby, Subtitled, Anamorphic', 'Contributor': 'Billy Mitchell, Steve Wiebe, Seth Gordon', 'Initial release date': '2008-01-29', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 0.32 Ounces', 'Item model number': '1000035229', 'Director': 'Seth Gordon', 'Media Format': 'AC-3, Dolby, Subtitled, Anamorphic', 'Run time': '1 hour and 19 minutes', 'Release date': 'January 29, 2008', 'Actors': 'Billy Mitchell, Steve Wiebe', 'Subtitles': 'English, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: I teach film production at a university and I bought this to show to my documentary filmmaking classes.  It is an excellent example of how a good doc can make you care about something that you never thought you'd care about.  I love seeing the young women in the class start out rolling their eyes but quickly get drawn into the story.  This doc is consitantly a class favorite.\nReview Title: Even if you don't like video games you should watch this!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ted 2 [Blu-ray]\nReview Date: 2017/03/25\nStore: Mark Wahlberg  (Actor),     Amanda Seyfried  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Comedy\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, DVD Movie, Blu-ray Movie, Comedy', 'Format': 'Blu-ray, Ultraviolet, Color, Widescreen, Ultraviolet, Digital_copy', 'Contributor': 'Mark Wahlberg, Morgan Freeman, Amanda Seyfried, Barry Ratcliffe, Jessica Barth, Seth MacFarlane', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), French Canadian (Dolby Digital 5.1), French Canadian (DTS 5.1), Spanish (DTS 5.1)', 'Runtime': '8 hours and 6 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.75 x 0.75 inches; 2.4 Ounces', 'Item model number': '35222385', 'Director': 'Seth MacFarlane', 'Media Format': 'Blu-ray, Ultraviolet, Color, Widescreen, Ultraviolet, Digital_copy', 'Run time': '8 hours and 6 minutes', 'Release date': 'December 15, 2015', 'Actors': 'Mark Wahlberg, Amanda Seyfried, Seth MacFarlane, Morgan Freeman, Jessica Barth', 'Subtitles': 'French, Spanish', 'Studio': 'Universal', 'Number of discs': '2'}\nReview Text: There is not a lot to say.  If you liked the first one then you will like this one.  If you didn't, or otherwise dislike Seth McFarlane's humor then keep moving.\nReview Title: I think you know what you are geting yourself into here\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mad Max: Fury Road (3D Blu-ray + Blu-ray)\nReview Date: 2017/06/27\nStore: Tom Hardy  (Actor),     Charlize Theron  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Award Winners in Movies & TV, Oscar Central, Oscar Nominees\nProduct Description: ['Mad Max: Fury Road (3D Blu-ray + Blu-ray)', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Subtitled, Ultraviolet, Ultraviolet, 3D', 'Contributor': 'Brendan McCarthy, Rosie Huntington-Whiteley, Iain Smith, Nico Lathouris, Zoë Kravitz, Abbey Lee, Bruce Berman, Nicholas Hoult, P.J. Voeten, Hugh Keays-Byrne, Nathan Jones, Doug Mitchell, George Miller, Riley Keough, Tom Hardy, Graham Burke, Courtney Eaton, Charlize TheronBrendan McCarthy, Rosie Huntington-Whiteley, Iain Smith, Nico Lathouris, Zoë Kravitz, Abbey Lee, Bruce Berman, Nicholas Hoult, P.J. Voeten, Hugh Keays-Byrne, Nathan Jones, Doug Mitchell, George Miller, Riley Keough, Tom Hardy, Graham Burke, Courtney Eaton, Charlize…  See more', 'Initial release date': '2015-09-01', 'Language': 'English (Dolby Digital 5.1), Thai (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Digital Copy Expiration Date': 'September 1, 2018', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Item model number': '35226144', 'Director': 'George Miller', 'Media Format': 'Subtitled, Ultraviolet, Ultraviolet, 3D', 'Run time': '2 hours', 'Release date': 'September 1, 2015', 'Actors': 'Tom Hardy, Charlize Theron, Nicholas Hoult, Hugh Keays-Byrne, Rosie Huntington-Whiteley', 'Subtitles': 'English, Portuguese, Spanish, Korean, Thai, French', 'Producers': 'Iain Smith, Doug Mitchell, Graham Burke, George Miller, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'George Miller, Brendan McCarthy, Nico Lathouris', 'Number of discs': '2'}\nReview Text: In the past I have avoided seeing a movie in 3D if it was not filmed in 3D (I am looking at you, Clash of the Titans.)  However it seems like the effects houses have gotten this figured out, both The Force Awakens and Mad Max Fury Road are excellent 3D titles and neither were shot in 3D.<br />I won't get into a movie review too much, but I thought Fury Road was a worth addition to the Mad Max story.  I was not wild about Tom Hardy's interpretation of Max (I really wish Mel Gibson hadn't gone nuts and could have done this film) but the new characters are engaging and the action is top notch.<br />Both the desolation of the open spaces and the closeness of the interior environments are improved by the 3D.  Apart from the absurd steering wheel that flies right at the screen the film is devoid of effects that draw attention to themselves.  In defense of the 3D version that steering wheel gag is just as distractingand annoying in 2D.<br />If you like the franchise you will like this movie.  If you like this movie you will enjoy the extra value of the 3D version.\nReview Title: The 3D is worth it!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jackie Chan's PROJECT A & PROJECT A PART II (Eureka Classics) Limited Edition Blu-ray\nReview Date: 2019/08/16\nStore: Jackie Chan  (Actor)    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"A pair of incredible action-adventure extravaganza's from the legendary\", 'Jackie Chan', ',', 'Project A', 'and', 'Project A Part II', 'make their long overdue debut on Blu-ray in the UK from brand new 2K restorations. Starring three of the greatest martial-arts action stars of all time (Jackie Chan, Sammo Hung and Yuen Biao), the', 'Project A', 'films blended unparalleled martial artistry, death defying stunts and physical comedy in a way that has yet to be matched.', 'Project A', 'Jackie plays Sergeant Dragon Ma, a turn-of-the-century coastguard, hot on the trail of a ruthless band of cut-throat pirates, intent on spreading a trail of blood and mayhem across the South China Seas.', 'Project A', 'features some of the most dangerous stunts of Jackie s career, including homages to Buster Keaton s', 'Steamboat Bill, Jr.', 'and Harold Lloyd s', 'Safety Last!', '.', 'Project A Part II', 'After the events of the first film, Dragon Ma is given a new assignment, to clean up crime and corruption in the roughest part of town. The pressure was on to top the first film in terms of sheer spectacle, but', 'Project A Part II', 'rises to the challenge and delivers one of the most stunt-packed, rip-roaring action-adventures of all time.', 'Presented from brand new 2K restorations and fully uncut, Eureka Classics is proud to present Jackie Chan s', 'Project A', 'and', 'Project A Part II', 'for the first time on Blu-ray in the UK in a special', 'Limited Edition Box Set (4000 copies)', 'packed with extra content.', 'SPECIAL FEATURES:', 'Special Limited Edition Box Set of 4000 copies', 'Special Limited Edition Box Set of 4000 copies', '1080p presentations of both films, sourced from brand new 2K restorations and making their UK debuts on Blu-ray', '1080p presentations of both films, sourced from brand new 2K restorations and making their UK debuts on Blu-ray', 'Original Cantonese audio tracks for both films (mono for Project A and stereo for Project A Part II)', 'Original Cantonese audio tracks for both films (mono for', 'Project A', 'and stereo for', 'Project A Part II', ')', 'Restored 5.1 Cantonese and English audio options', 'Restored 5.1 Cantonese and English audio options', 'Optional English subtitles', 'Optional English subtitles', 'A new video interview with Tony Rayns', 'A new video interview with Tony Rayns', 'Archival interview with Jackie Chan [30 mins]', 'Archival interview with Jackie Chan [30 mins]', 'Interview with actor Lee Hoi San [22 mins]', 'Interview with actor Lee Hoi San [22 mins]', 'Interview with actor Yuen Biao [18 mins]', 'Interview with actor Yuen Biao [18 mins]', 'Interview with actor Dick Wei [14 mins]', 'Interview with actor Dick Wei [14 mins]', 'Interview with actor Michael Chan Wai-Man [20 mins]', 'Interview with actor Michael Chan Wai-Man [20 mins]', 'Interview with composer Michael Lai [17 mins]', 'Interview with composer Michael Lai [17 mins]', 'Interview with writer and producer Edward Tang [30 mins]', 'Interview with writer and producer Edward Tang [30 mins]', 'Interview with stuntman Anthony Carpio [29 mins]', 'Interview with stuntman Anthony Carpio [29 mins]', 'Interview with stuntman Mars [15 mins]', 'Interview with stuntman Mars [15 mins]', 'Someone Will Know Me [13 mins] - an archival featurette which includes interviews with stuntmen Mars, Chris Lee Kin-Sang and Rocky Lai', 'Someone Will Know Me', '[13 mins] - an archival featurette which includes interviews with stuntmen Mars, Chris Lee Kin-Sang and Rocky Lai', 'Alternate outtakes for Project A from the Japanese version of the film', 'Alternate outtakes for', 'Project A', 'from the Japanese version of the film', 'Archival behind-the-scenes footage [24 mins]', 'Archival behind-the-scenes footage [24 mins]', 'Deleted Scenes', 'Deleted Scenes', 'PLUS: A wide selection of rare archival content!', 'PLUS:', 'A wide selection of rare archival content!', 'Box set exclusive Collectors booklets for each film, featuring new essays and archival content', 'Box set exclusive Collectors booklets for each film, featuring new essays and archival content']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'PAL', 'Contributor': 'Jackie Chan', 'Runtime': '3 hours and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.93 x 5.51 x 1.38 inches; 9.88 Ounces', 'Media Format': 'PAL', 'Run time': '3 hours and 31 minutes', 'Release date': 'October 29, 2018', 'Actors': 'Jackie Chan', 'Studio': 'Eureka Entertainment Ltd', 'Number of discs': '2'}\nReview Text: I never got a chance to watch the film because a crooked seller on Amazon did not disclose that this Blu-Ray is locked for region B players.<br />I hope this information will save somebody else the time, disappointment and cost of a purchase that will not work in the USA.\nReview Title: Region B only!! Will not work on a USA player!!\nRating: 3.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has had consistently positive experiences with their purchases, highlighting products that deliver family-friendly entertainment and exceptional quality. Movies in their collection are noted for excellent animation, engaging storytelling, and meaningful life lessons, which resonate with both kids and adults. The high-definition presentation has received praise for its stunning visuals and enriching additional content, providing insightful behind-the-scenes looks. The user appreciates the overall cinematic experience and the success in delighting family members, making these films must-haves for fans of the respective franchises.\n\nNEGATIVE SUMMARY:\nWhile the user's experiences are largely positive, a notable negative interaction involved a purchase that turned out to be region-locked, rendering it unplayable on their USA-based equipment. This instance caused frustration and disappointment, detracting from what was expected to be an enjoyable addition to their collection. In another interaction, generalized caution was expressed toward specific genres, indicating they might not align with personal taste, particularly regarding humor styles. \n\nOVERALL SUMMARY:\nOverall, the user exhibits a strong affinity for cinematic experiences that blend quality animation, humor, and thought-provoking narratives. Their purchases reflect a preference for family-friendly films that are visually impressive and laden with extra features. Despite a few negative experiences, particularly regarding region compatibility and specific genre preferences, the positive feedback overwhelmingly underscores satisfaction with storytelling and film quality. This balance between enjoyment and the occasional mishap demonstrates a thoughtful approach to collecting and engaging with movies.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Impressive restoration, oh yes.  But a classic? Not so fast ...!",
    "text": "Movies are subjective, and I can say that this one was not my cup o' joe. Criterion has done an amazing job with the restoration (as usual), it looks remarkable for how old it is.<br />I quite like old black and white movies (especially the romantic comedies) but this one did not hold my interest.  I got through it, and then listed it on eBay!",
    "images": [],
    "asin": "B00MRKX9PO",
    "parent_asin": "B00MRKX9PO",
    "user_id": "AGO66O54S6LTNCFRQAVNMBO6H5MA",
    "timestamp": "2020-07-07 05:30:33.390000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "It Happened One Night [Blu-ray]",
    "average_rating": 4.7,
    "rating_number": 2554,
    "features": [],
    "description": [
      "Opposites attract with magnetic force in this romantic road-trip delight from Frank Capra (IT'S a WONDERFUL LIFE), about a spoiled runaway socialite (THE PALM BEACH STORY's Claudette Colbert) and a roguish man-of-the-people reporter (GONE WITH THE WIND's Clark Gable) who is determined to get the scoop on her scandalous disappearance. The first film to accomplish the very rare feat of sweeping all five major Oscar categories (best picture, best actor, best actress, best director, and best screenplay), It Happened One Night is among the most gracefully constructed and edited films of the early sound era, packed with clever situations and gags that have entered the Hollywood comedy pantheon. Featuring two actors at the top of their game, sparking with a chemistry that has never been bettered, this is the birth of the screwball comedy."
    ],
    "price": 27.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51V4aYxq15L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51V4aYxq15L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81pRaPFzQ2L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51W7yppmdRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51W7yppmdRL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81mGMb7eLAL._SL1416_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51p88Y8ou4L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51p88Y8ou4L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/712-ixdL+pL._SL1422_.jpg"
      }
    ],
    "videos": [],
    "store": "Claudette Colbert  (Actor),     Clark Gable  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "Blu-ray",
      "Comedy"
    ],
    "details": {
      "Genre": "Comedy",
      "Format": "Blu-ray",
      "Contributor": "Claudette Colbert, Frank Capra, Clark Gable",
      "Language": "English",
      "Runtime": "1 hour and 45 minutes",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.88 Ounces",
      "Item model number": "CRRN2416BR",
      "Director": "Frank Capra",
      "Media Format": "Blu-ray",
      "Run time": "1 hour and 45 minutes",
      "Release date": "November 18, 2014",
      "Actors": "Claudette Colbert, Clark Gable",
      "Subtitles": "English",
      "Studio": "Criterion Collection (Direct)",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}