{
  "user_id": "AHCWUVPOC5QNSKMQB2NNGM4XK2UA",
  "summary": "=== Purchase Information ===\nProduct Title: Straight from the Heart [DVD]\nReview Date: 2009/12/21\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Made-for-TV Movies, All Made-for-TV Movies\nProduct Description: ['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'UN', 'Release Date:', '1-MAY-2007', 'Media Type:', 'DVD']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC, DVD', 'Contributor': 'Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Media Format': 'NTSC, DVD', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 1, 2007', 'Studio': 'Good Times Video'}\nReview Text: I hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br /><br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane and I wanted to be sure to order some clean-cut family type ones for visiting once I got there.<br /><br />I read all the reviews on this one and was not disappointed. As the others have said, the scenery, the actors, the warmth and beauty of it as well as the story made it all worthwhile.\nReview Title: Really enjoyed it and would recommend\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bucket List\nReview Date: 2009/12/21\nStore: Jack Nicholson  (Actor),     Morgan Freeman  (Actor),     Rob Reiner  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Bucket List, The (WS/FS/DVD)', \"Academy Award winners Jack Nicholson and Morgan Freeman star in this comedy drama, directed by Rob Reiner, a touching, no-holds-barred adventure that shows it's never too late to live life to its fullest--The Bucket List. One man was smart enough to go to college, but has worked his entire life as a mechanic; the other owns the hospital in which they are both patients. But these two men with little time left and even less to lose, discover that life can be deeply moving and definitely hilarious.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure/Crime, Comedy, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Contributor': 'Rowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob ReinerRowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob Reiner   See more', 'Language': 'Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0), French (Dolby Digital 4.0)', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 0.01 Ounces', 'Item model number': 'WARD024013D', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'June 10, 2008', 'Actors': 'Jack Nicholson, Morgan Freeman, Sean Hayes, Rob Morrow, Beverly Todd', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Jeffrey Stott, Craig Zadan, Travis Knox, Neil Meron, Alan Greisman', 'Studio': 'WarnerBrothers', 'Writers': 'Justin Zackham', 'Number of discs': '1'}\nReview Text: I hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane.<br /><br />Yes, it's sad, but so are lots of things in life but this is a different kind of sadness. It's a sadness that also comes with great joy because it reached its full cycle and you felt that fulfillment. You also felt its purpose, and the love.<br /><br />I think for some to comment that it was 'predictable' miss the point. Much in life is predictable. For me, I don't care that some things are predictable; or simplified, or maybe not even 'realistic'. I can get reality in the day to day. To watch a movie is to become involved deeply with so many levels of the movie and to glean from it whatever message you are receiving at that time.<br /><br />I enjoyed Morgan's wife in the movie and the relationship he had with her. Of course she is going to get mad at him; be frustrated, concerned and then absolutely shocked and bewildered when he announced his plans. But, she also showed great trust, and love and knew that whatever he was needing to do, it's what he needed to do and let it go. Let him go. I enjoyed those intimate scenes. People need to see great strength and trust between two people.<br /><br />I also found myself hanging on the edge of my seat when Morgan was at the bar and the beautiful lady came up and sat next to him. I found myself thinking that if MORGAN (the actor - not even the character!) 'gave in', then I would change how I felt about him (however irrational since it was his character, not him). I held my breath in anticipation...<br />Now, whether Morgan had any say so on the outcome of that scene or whether that was how the script was written anyway, it made a world of difference to me. And if Morgan did have a say so, well, all the more reason why I esteem him so highly.<br /><br />I thought it was a wonderful movie and am so glad I got to see it.\nReview Title: Two of my favorites together for an unforgettable movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gran Torino\nReview Date: 2009/12/21\nStore: Clint Eastwood  (Actor, Director),     Brian Haley  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"A disgruntled Korean War vet, Walt Kowalski (Eastwood), sets out to reform his neighbor, a young Hmong teenager, who tried to steal Kowalski's prized possession: his 1972 Gran Torino.\"]\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Clint Eastwood, Brian Haley, Christopher Carley, Geraldine Hughes', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nReview Text: I hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip.<br />When I went to Amazon's DVD page, Gran Torino was showing and of course, since I'm a huge Clint Eastwood fan, it was my choice.<br />I'm stunned as to what to say and I can't really add anything that other reviewers have not already said. BTW, I concur completely with Robert Crawford's absolutely beautiful review as that says it all so well.<br /><br />The unfolding of the layers to this crotchety, bitter man is what is so special and yet at the same time so sad that this is what his sons will never know, never experience is one that hit the 'closest to home' for me and much of the sadness that I did feel in this movie. The loss. The waste.<br /><br />I also want to comment on how much I enjoyed the actress who played Sue - the girl next door. She was a fabulous actress and you adored her instantly. Conversely, I had a bit more of a difficult time 'believing' the character of the boy until much more into the movie.<br /><br />Clint is still so very handsome - one scene where he puts on a nice jacket and has a close shave and no matter his age, he's still 'got it'.<br /><br />Yes, the old man thought long and hard and came up with the winning solution to a very real and very gruesome problem. And along with that, he buried the demons haunting his heart and mind for all those years.<br /><br />The movie is sad? Yes, but the saddest part of all is that it's a reality that is a part of so many peoples' lives all the time.\nReview Title: left me feeling utterly distraught\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: August Rush\nReview Date: 2009/12/27\nStore: Kirsten Sheridan  (Director),     Freddie Highmore  (Actor),     Keri Russell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: ['Product Description', 'August Rush (WS/FS/DVD)', 'Separated by events they could not control but bound by love and by music, three people search for what they lost and what will make their lives complete ... each other. Keri Russell (Waitress, \"Felicity\"), Johathan Rhys Meyers (\"The Tudors\") and Freddie Highmore (Charlie and the Chocolate Family, Finding Neverland) star with Robin Williams in this amazing, heartwarming tale of two very different musicians who fall in love only to be torn apart, both unaware that they have a child, a musical prodigy who is trying to find them as much as they are trying to find each other, a boy destined for greatness as the rising young star August Rush.', ']]>', 'Amazon.com', 'Music has long been considered a universal language with the power to bring people together, but can the simple act of playing music possibly unite a child with a mother and father who live in two different cities and don\\'t even know of the child\\'s existence? Having shared one extraordinary night, classical cellist Lyla Novacek (Keri Russell) and Irish singer and songwriter Louis Connelly (Jonathan Rhys Meyers) were a union meant to be that was torn apart by circumstances and a protective father (William Sadler). After eleven years, both Lyla and Louis have given up performing only to find that they are unhappy and searching for a sense of fulfillment that will ultimately lead both artists back to music and performing. Evan (Freddie Highmore) is an 11-year old orphan who\\'s grown up hearing music in everything around him and is convinced that his real parents want him and will find him with the help of music. Driven by his innate musical genius and a powerful compulsion to perform before the world, Evan runs away from the orphanage and is initially taken in by a street man known as Wizard (Robin Williams) who encourages his musical talent and renames him August Rush and, later, by a local priest who arranges for August to receive a Julliard education. August is a child prodigy who excels beyond even the wildest expectations and earns the opportunity of a lifetime--a chance to perform in front of an enormous audience in New York\\'s Central Park. The question is; can his performance possibly reach the audience August really craves? While elements of this film are completely unbelievable (take August\\'s instant prowess on the guitar or his immediate and sophisticated grasp of musical notation and musical theory), the message of the universality of music and the notion that \"the music is all around us, all you have to do is listen\" is both compelling and powerful.', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & AdventureMusicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & Adventure  See more', 'Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, WidescreenAC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen  See more', 'Contributor': \"Mykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louise Goodsill, Keri Russell, Robert Greenhut, Jania Simone Nash, Aaron Staton, Nick CastleMykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louis…  See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '76368', 'Director': 'Kirsten Sheridan', 'Media Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'March 11, 2008', 'Actors': 'Freddie Highmore, Keri Russell, Jonathan Rhys Meyers, Terrence Howard, Robin Williams', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Richard Barton Lewis, Robert Greenhut, Ralph Kamp, Louise Goodsill, Miky Lee', 'Studio': 'WarnerBrothers', 'Writers': 'Nick Castle, James V. Hart, Paul Castro', 'Number of discs': '1'}\nReview Text: in hopeful anticipation of what was to come.<br /><br />I absolutely loved this movie and in fact paused it so I could call my daughter 2,000 miles away to tell her she MUST see this movie!<br /><br />The movie was magical. And many refer to it as a Fairy Tale and yet for me, personally, I viewed it as something very real, and THAT is what made it magical.<br />For I have experienced, or known of, many things that many may find unbelievable, or coincidental, or magical and yet they were the Orchestration (pun intended) beyond our own thinking.<br /><br />And that magical wonder; that purposeful Orchestration is there all the time..all we have to do is listen.\nReview Title: My heart was pounding and I gripped my armchair much of the time\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Frontline: Sick Around the World\nReview Date: 2010/01/17\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, TV News Programming\nProduct Description: ['Four in five Americans say the healthcare system needs fundamental change. Can the U.S. learn anything from the rest of the world about how to run a healthcare system, or are these nations so culturally different that their solutions would not be acceptable? FRONTLINE correspondent T.R. Reid examines the healthcare systems of other advanced capitalist democracies to see what ideas might help the U.S. reform its broken healthcare system.']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5070863', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'June 10, 2008', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: and then ran to the computer to see if I could get it on Amazon so I could share with anyone who is interested. It's a 'must see', truly.<br /><br />Other systems around the world work. Ours doesn't. Nothing's perfect, but see this and you'll see that there is a better way when we can all see the 'bigger picture' and remove agendas and be on board with what really matters.<br />When you do what is right, everyone benefits.\nReview Title: A must see - saw on Public Television first\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/11/09\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'Bitsie Tulloch', 'Russell Hornsby'], 'Studio': ['NBC']}\nReview Text: This is a review for the entire Season 2 of Grimm. What began as just needing something to watch (and for free streaming) ended up as an absolute obsession.<br />In the beginning of Season 1, it took a few episodes before deciding if it was worth my time. Was David Giuntoli just another pretty face or did this show have any possibility?<br />First, let me tell you that as Season 1 wrapped up and I got wrapped up in Season 2, not only did the star, Nick, played by David Giuntoli prove to be a terrific actor - but the actors together do a superb job. I really like Hank, played by Russell Hornsby all the more once he was &#34;in the loop&#34; as to the real goings-on; and the development of the Captain's character was a nice turn of events. The character, Monroe, played by Silas W. Mitchell is the real maker of the show, because without him, it would be missing the element of humor and charm. And I love the addition of Rosalee! She's superb. The only character that's flawed is Juliette, who I found not only annoying, but her acting is sub-par and took away from the show. Everyone else made up for it though.<br />The writing, storyline, acting, makeup, special effects and scenery make this Season 2 of Grimm the best. I stayed up late last night to watch three in a row if that tells you anything!<br />(I do not recommend for children - let it be for adults only, in my opinion)\nReview Title: What started as just needing something (free) to watch grew into an obsession and one of my all-time faves!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/02/21\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kristi Jacobson', 'Lori Silverbush'], 'Producers': ['Julie Goldman', 'Ryan Harrington', 'Kristi Jacobson', 'Lori Silverbush'], 'Starring': ['Jeff Bridges', 'Tom Colicchio'], 'Studio': ['Magnolia Pictures']}\nReview Text: Completely missed the mark - didn't show the real problems nor the real solutions and threw in enough truth to grab your emotions while enough political bulls*t to be a complete turnoff.<br />I would love to have a one-on-one conversation with Jeff Bridges to show him the real problems and some real solutions. The Government is not the answer, nor should it be. I agree that the Government is certainly a part of the PROBLEM - no doubt.<br />Becoming more self reliant and sustainable and returning to more the 'natural' human is where the answer lies. Read Michael Bunker's book, &#34;Surviving Off Off-Grid&#34; for starters.<br />I myself have taught a 2 hr class on sprouting - for ULTIMATE NUTRITION for only pennies a day, which can be done in any living situation. Victoria Boutenko (see her books here on Amazon), as an individual, has traveled the world over, to some of the most 3rd world countries where  people truly ARE starving, and where they have no resources and showed them how to grow the most NUTRITIOUS foods on the planet for very little cost and effort and to provide enough for their village - not just to survive and get by, but to THRIVE in good health and to be enough for them ALL.<br /><br />This movie missed the mark. While I do recommend that people see it to understand some things - though NOT the things mentioned in the movie - but to basically see the MISCONCEPTIONS and how things are being skewed, I do recommend that people know just how many people in this country are facing these issues. I simply see the issues as being completely different than what is presented in this film\nReview Title: I would love to have a one-on-one conversation with Jeff Bridges to ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/06\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nReview Text: I'm loving this series and all the angles. I'm also glad to really like the lead actor, Titus Welliver, in this role. This is a great role for him. So often you see him play a character that you just hate, but not this time - I LOVE Bosch. What a great detective! The added interest of his past makes him all the more intriguing and this series has captured my full attention.<br />Great job!\nReview Title: So far, so fabulous!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Perfect Stranger/ Another Perfect Stranger: Director's Double Feature set\nReview Date: 2015/07/18\nStore: Pamela Brumley  (Actor),     Ruby Marie Lewis  (Actor),     Shane Sooter  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: [\"The perfect combination of the 2006 underground hit, 'The Perfect Stranger' and its 2007 sequel, 'Another Perfect Stranger', in one two-disc set. In 'The Perfect Stranger' a skeptical lawyer accepts a dinner invitation from a man claiming to be Jesus of Nazareth. The second disc, 'Another Perfect Stranger', tells the story of a nineteen year-old artist, on a journey to escape her parents' religious views, that befriends an unlikely travel companion who shares her disdain for religion. Both films are based on the bestselling 'Perfect Stranger' novels by David Gregory.\"]\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Shane Sooter, Jefferson Moore', 'Media Format': 'NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'February 9, 2009', 'Actors': 'Pamela Brumley, Ruby Marie Lewis, Stella Davis, Jefferson Moore', 'Studio': \"Kelly's Filmworks LTD\", 'Number of discs': '2'}\nReview Text: This is still my choice for sharing the message. I stumbled across this one time when I was laid up with a back injury and really loved it. Basically, it's very simplistic. As far as movies, sets, props, acting and all that goes, it would probably classify as very B or even C rated. But if you look past that, and pretend you were watching a play in a theatre, instead perhaps, and just simply listened to the message, you will soon see how masterfully BRILLIANT each of these films are!<br />I love how they present the questions and answers just as we all would wonder or ask; or have at some time or another. And it is great to have those questions - but the ANSWERS are what are so powerful.<br />If you have questions yourself; or maybe you know someone who does, this is really a helpful tool. These make great gifts again and again. Good to send your child off to college with; good to have family time with; great to donate to a Teen Group or your favorite church ministry. Look for their special pricing and grab them when on special.<br />I love this set. Problem is, I never end up keeping a set for myself - I always give them away. But, that's a good problem to have. :)\nReview Title: I stumbled across this one time when I was laid up with a back injury and really loved it. Basically\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/02/01\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium', 'Deutsch'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]', 'Deutsch'], 'Directors': ['Charles McDougall'], 'Producers': ['Shawn Ryan', 'Cris Cole'], 'Starring': ['Ben Chaplin', 'Michael Imperioli', 'Romany Malco']}\nReview Text: It's so difficult to write a review on a piece of artwork - be it a painting, a movie, a book, or an album. It is just too personal; too subjective; too changeable; and depends on your own perspective at the very time of your viewing it. I've even watched a movie at one time and felt one way and then a few years later, watched it again and got way more from it then.<br />Therefore, although I rated it five stars, and did really love it, I can't say that I think others are completely wrong to rate it only two stars as I understand that's how they felt about it as that's their own experience.<br />I, on the other hand, was so gripped, and felt the intensity of it so much that I watched three episodes the first night, and then three more the second night, and finished it two days later. I HAD to know what happened next!!<br />I thought the cast was an all star cast and each one did an excellent job of acting their character. Although this movie has definitely scared me from ever wanting to go to Belize, the scenery was incredible! It was so beautiful! I thought this film was outstanding in the story; the twists and turns of events; the acting; the cinematography and in how it remained intense enough  to the very end!<br />Just what is a person's real character and how does it present itself in the most dire of circumstances? What of loyaty, or honor? Only one truly was a shmuck and remained a shmuck, no matter what came his way, even after just praying for &#34;a second chance&#34;. I guess, then, even he remained true to his real character - once a shmuck, always a shmuck.<br />I don't know about you, but I have a few questions, but let's just say this..I think I would've left the duffle bag on the boat and not have had anything to do with it right from the start.<br />Yes, entertaining movie!\nReview Title: I loved it and watched three the first night!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/01\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Pieter Jan Brugge'], 'Starring': ['タイタス・ウェリバー', 'ジェイミー・へクター', 'エイミー・アキノ']}\nReview Text: I was pleasantly surprised to see a Season 2 and jumped right in and finished off the whole season in three days. I did enjoy it. I thought the writers did a good job; it had a lot of twists and turns; and was pretty exciting. AND I can't wait to see if there will be a Season 3.<br />The only thing I have to say, since I cannot select a 4.5 stars rating, is that there was something lacking. I can't put my finger on it, but there was an 'energy' that was missing. I also felt the acting was just slightly missing the mark in some of the characters and, as if, it didn't quite mesh well with other characters' acting - as if one was over the top, while the other a bit bland. I can't explain..<br />I enjoy Titus Welliver as an actor, and I do very much like this series, but, after a while, the way he walks, and stands seems to be as if he is either physically very uncomfortable (he walks and stands awkwardly); or he is not comfortable with himself and is self-conscious. On top of that, it was starting to annoy me that he often didn't look one in the eye when talking, but his head and eyes are darting all over the place.<br />Anyway, all that aside, I thought it was a great season and I really enjoyed it and can't wait for Season 3.\nReview Title: Watched the whole Season in 3 days\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Million Dollar Baby (DVD)\nReview Date: 2016/07/08\nStore: Clint Eastwood  (Actor, Director, Producer),     Hilary Swank  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['\"I DON\\'T TRAIN GIRLS\", trainer Frankie Dunn growls. But something\\'s different about the spirited boxing hopeful who shows up daily at Dunn\\'s gym. All she wants is a fighting chance. Clint Eastwood plays Dunn and directs, produces and composes music for this acclaimed, multi-award-winning tale of heart, hope and family. Hilary Swank plays resilient Maggie, determined not to abandon her one dream. And Morgan Freeman is Scrap, gym caretaker and counterpoint to Dunn\\'s crustiness. Grab your dreams and come out swinging.', 'DVD Features:', 'Documentaries', 'Featurette', 'Interviews']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000149835DVD', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 12 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Hilary Swank, Morgan Freeman, Jay Baruchel, Mike Colter', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Producers': 'Gary Lucchesi, Clint Eastwood, Robert Lorenz, Albert S. Ruddy, Tom Rosenberg', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'WarnerBrothers', 'Writers': 'Paul Haggis', 'Number of discs': '1'}\nReview Text: I don't know that I could rate a movie poorly just because I didn't like how it made me feel - as one reviewer did. How is that fair when you are are reviewing something as it would likely appeal to the masses? When you are rating story line, acting, directing, etc, etc.?<br />So, I will say this - I was stunned with the ending and didn't like how I felt. But since this movie wasn't about 'me' or how I would feel, I wanted to appreciate all aspects of the movie and mention them.<br />I thought the message was good; and clear; and ones we all can (or should) relate to - which is basically seeing that people are human; and that sometimes there is a real struggle just to find their way in life. There were so many messages to be found here that discovering them is also part of the individual's own message as to what they can glean from it. It can be not only learning who you are..but also who you aren't, as Maggie did the one moment she realized that her family was definitely not her family.<br />I didn't like the way the movie ended and wished it had ended differently..but there was no promise of that to begin with - no 'rose garden';<br /><br />Now for some critiquing: I felt like I had seen both Clint Eastwood and Morgan Freeman in those same types of character roles before that it seemed too redundant or 'deja vu'. I think the director wanted to leave some things up to the viewer's imagination, and yet, for me anyway, it left too many questions such as what happened between Clint Eastwood and his daughter and why did it pain him so much? What was the envelope he found on the floor and why was that significant? Also, I was confused as to how Clint Eastwood felt about Hillary (Maggie). There were times when I felt he loved her like a daughter, and then other times where I wondered if it were more? Or was that up to our own interpretation as well?<br />I thought the boxing scenes were awesome - and this from a person who despises boxing! They did an awesome job with all the boxing.<br /><br />This movie came with two DVD's and I watched the second one later. This really helped me understand the movie from behind the scenes, as well as clarify for me what the mysterious envelope was! I appreciated all the training Hillary did for her part; and how well she succeeded.<br />Others had a problem with the narration (done by Morgan Freeman). I actually loved it - but then who doesn't love his voice? Also, the very last sentence of the narrative tied the movie all together, so it was well worth it to have the narration, in my opinion.<br /><br />That we were left hanging, wondering what happened to Clint Eastwood, was supposed to be speculative. I don't know that I liked that. I wanted to at least have an idea. Nonetheless, I made up my own answer.<br />Maybe that's the whole idea..\nReview Title: .How to objectively review a movie?\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/11/17\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Mel Gibson'], 'Producers': ['Bill Mechanic', 'David Permut', 'Terry Benedict', 'Paul Currie', 'Bruce Davey', 'Brian Oliver'], 'Starring': ['Andrew Garfield', 'Richard Pyros', 'Jacob Warner']}\nReview Text: i rarely ever see a movie in the theater, but it just so happened, for the first time in many years, I had the opportunity to go and &quot;Hacksaw Ridge&quot; was the movie of choice. I knew very little about it, other than it came highly recommended. I was accompanied by two others, and they knew even less of the movie.<br />All three of us were absolutely blown away, and days later, we are still talking about it, and how much it touched, and impacted us. That is the sign of an excellent movie - when you are still so very much aware of what it meant to you several days later. When the scenes play in your mind over and over again, and you recapture their meaning. When new insights form and take on even deeper meaning and revelation.<br />AND THIS MOVIE WILL DO JUST THAT.<br />Mel Gibson is one very fine director. I still cannot get over how those war scenes were done - so realstically - as I've never seen before. Depicting the horror, the terror..the absolute fear.<br />I've read the other reviews here, and so far, many of them disappoint me. I don't care to hear anything about Mel Gibson's past. Irrelevant. He directed this film and he was magnificent in ways words cannot describe.<br />Every aspect of this film was done well; and the viewer experience takes you through the journey, culminating in absolute wonderment, inspiration, and awe.<br />It won't leave my mind for awhile, and won't leave my heart EVER.\nReview Title: other than it came highly recommended. I was accompanied by two others\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: In America\nReview Date: 2017/01/03\nStore: Paddy Considine  (Actor),     Samantha Morton  (Actor),     Jim Sheridan  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['From Academy Awad Nominee Jim Sheridan comes this deeply personal and poignant tale of a poor Irish family searching for a better life In America. Through the eyes of their spunky daughters, two anguished parents find hope and the ability to once again believe in love and magic\\x85even amidst the dangers of New York\\'s harrowing Hell\\'s Kitchen. With mesmerizing performances by Samantha Morton and Djimon Hounsou, In America is \"a classic\" (USA Today) you won\\'t ever forget.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Ciaran Cronin, Jason Salkey, Kirsten Sheridan, Jim Sheridan, Neal Jones, Samantha Morton, Emma Bolger, Juan Carlos Hernndez, Nye Heron, Naomi Sheridan, Djimon Hounsou, Sarah Bolger, Randall Carlton, Paddy Considine, Rene MillanCiaran Cronin, Jason Salkey, Kirsten Sheridan, Jim Sheridan, Neal Jones, Samantha Morton, Emma Bolger, Juan Carlos Hernndez, Nye Heron, Naomi Sheridan, Djimon Hounsou, Sarah Bolger, Randall Carlton, Paddy Considine, Rene Millan  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.52 Ounces', 'Director': 'Jim Sheridan', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 11, 2004', 'Actors': 'Paddy Considine, Samantha Morton, Djimon Hounsou, Sarah Bolger, Emma Bolger', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Jim Sheridan, Kirsten Sheridan, Naomi Sheridan', 'Number of discs': '1'}\nReview Text: A very nice surprise.<br />Picked a movie from off the shelf, without looking at it, and put in the DVD player to watch, and what I watched, I really enjoyed. After seeing it, I researched on the internet and learned that it is a semi-autobiographical movie; and I also learned that the daughters in the movie really ARE sissters - Irish actresses.<br />The story shows how the love and closeness of a family can get them through anything; and so can determination. I loved the wisdom of Christy, the eldest daughter, who was wise way beyond her years. I loved how the innocence of children broke through the walls and barriers of fear and pain in both the neighbor, and their father.<br />Good movie!\nReview Title: A very nice surprise. Picked a movie from off the shelf\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/03/15\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Daldry'], 'Producers': ['Scott Rudin', 'Robert Fox'], 'Starring': ['Meryl Streep', 'Julianne Moore', 'Nicole Kidman'], 'Studio': ['Paramount Pictures Corp.']}\nReview Text: Pulled it off the shelf and the jacket gave no description of what it was about, so figured with that cast, it was probably good. First, I didn't even recognize Nicole Kidman. Did she create a different nose; or did she later have a nose job? Anyway, irrelevant.<br />Not knowing what the movie was about whatsoever, it was hard to try and piece it together to figure it out. I kept waiting to understand their focal point - their message. Was it about depression? Was it about happiness? Was it about mental illness? Was it about homosexuality? One reviewer wrote that Richard had AIDS. Where in the movie did they indicate that?<br />Very depressing movie, and at the end, I wished I could have &#34;the hours&#34; back I spent watching it.\nReview Title: Depressing\nRating: 2.0\n--------------------------------------------------",
  "reference": "Straight from the Heart [DVD]\nRated:    Unrated    Format: DVD\nMovies & TV, Made-for-TV Movies, All Made-for-TV Movies\n['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'UN', 'Release Date:', '1-MAY-2007', 'Media Type:', 'DVD']\n{'Genre': 'Drama', 'Format': 'NTSC, DVD', 'Contributor': 'Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Media Format': 'NTSC, DVD', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 1, 2007', 'Studio': 'Good Times Video'}\nI hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br /><br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane and I wanted to be sure to order some clean-cut family type ones for visiting once I got there.<br /><br />I read all the reviews on this one and was not disappointed. As the others have said, the scenery, the actors, the warmth and beauty of it as well as the story made it all worthwhile.\nReally enjoyed it and would recommend\nThe Bucket List\nJack Nicholson  (Actor),     Morgan Freeman  (Actor),     Rob Reiner  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Bucket List, The (WS/FS/DVD)', \"Academy Award winners Jack Nicholson and Morgan Freeman star in this comedy drama, directed by Rob Reiner, a touching, no-holds-barred adventure that shows it's never too late to live life to its fullest--The Bucket List. One man was smart enough to go to college, but has worked his entire life as a mechanic; the other owns the hospital in which they are both patients. But these two men with little time left and even less to lose, discover that life can be deeply moving and definitely hilarious.\", ']]>']\n{'Genre': 'Action & Adventure/Crime, Comedy, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Contributor': 'Rowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob ReinerRowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob Reiner   See more', 'Language': 'Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0), French (Dolby Digital 4.0)', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 0.01 Ounces', 'Item model number': 'WARD024013D', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'June 10, 2008', 'Actors': 'Jack Nicholson, Morgan Freeman, Sean Hayes, Rob Morrow, Beverly Todd', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Jeffrey Stott, Craig Zadan, Travis Knox, Neil Meron, Alan Greisman', 'Studio': 'WarnerBrothers', 'Writers': 'Justin Zackham', 'Number of discs': '1'}\nI hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane.<br /><br />Yes, it's sad, but so are lots of things in life but this is a different kind of sadness. It's a sadness that also comes with great joy because it reached its full cycle and you felt that fulfillment. You also felt its purpose, and the love.<br /><br />I think for some to comment that it was 'predictable' miss the point. Much in life is predictable. For me, I don't care that some things are predictable; or simplified, or maybe not even 'realistic'. I can get reality in the day to day. To watch a movie is to become involved deeply with so many levels of the movie and to glean from it whatever message you are receiving at that time.<br /><br />I enjoyed Morgan's wife in the movie and the relationship he had with her. Of course she is going to get mad at him; be frustrated, concerned and then absolutely shocked and bewildered when he announced his plans. But, she also showed great trust, and love and knew that whatever he was needing to do, it's what he needed to do and let it go. Let him go. I enjoyed those intimate scenes. People need to see great strength and trust between two people.<br /><br />I also found myself hanging on the edge of my seat when Morgan was at the bar and the beautiful lady came up and sat next to him. I found myself thinking that if MORGAN (the actor - not even the character!) 'gave in', then I would change how I felt about him (however irrational since it was his character, not him). I held my breath in anticipation...<br />Now, whether Morgan had any say so on the outcome of that scene or whether that was how the script was written anyway, it made a world of difference to me. And if Morgan did have a say so, well, all the more reason why I esteem him so highly.<br /><br />I thought it was a wonderful movie and am so glad I got to see it.\nTwo of my favorites together for an unforgettable movie\nGran Torino\nClint Eastwood  (Actor, Director),     Brian Haley  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"A disgruntled Korean War vet, Walt Kowalski (Eastwood), sets out to reform his neighbor, a young Hmong teenager, who tried to steal Kowalski's prized possession: his 1972 Gran Torino.\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Clint Eastwood, Brian Haley, Christopher Carley, Geraldine Hughes', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nI hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip.<br />When I went to Amazon's DVD page, Gran Torino was showing and of course, since I'm a huge Clint Eastwood fan, it was my choice.<br />I'm stunned as to what to say and I can't really add anything that other reviewers have not already said. BTW, I concur completely with Robert Crawford's absolutely beautiful review as that says it all so well.<br /><br />The unfolding of the layers to this crotchety, bitter man is what is so special and yet at the same time so sad that this is what his sons will never know, never experience is one that hit the 'closest to home' for me and much of the sadness that I did feel in this movie. The loss. The waste.<br /><br />I also want to comment on how much I enjoyed the actress who played Sue - the girl next door. She was a fabulous actress and you adored her instantly. Conversely, I had a bit more of a difficult time 'believing' the character of the boy until much more into the movie.<br /><br />Clint is still so very handsome - one scene where he puts on a nice jacket and has a close shave and no matter his age, he's still 'got it'.<br /><br />Yes, the old man thought long and hard and came up with the winning solution to a very real and very gruesome problem. And along with that, he buried the demons haunting his heart and mind for all those years.<br /><br />The movie is sad? Yes, but the saddest part of all is that it's a reality that is a part of so many peoples' lives all the time.\nleft me feeling utterly distraught\nAugust Rush\nKirsten Sheridan  (Director),     Freddie Highmore  (Actor),     Keri Russell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', 'August Rush (WS/FS/DVD)', 'Separated by events they could not control but bound by love and by music, three people search for what they lost and what will make their lives complete ... each other. Keri Russell (Waitress, \"Felicity\"), Johathan Rhys Meyers (\"The Tudors\") and Freddie Highmore (Charlie and the Chocolate Family, Finding Neverland) star with Robin Williams in this amazing, heartwarming tale of two very different musicians who fall in love only to be torn apart, both unaware that they have a child, a musical prodigy who is trying to find them as much as they are trying to find each other, a boy destined for greatness as the rising young star August Rush.', ']]>', 'Amazon.com', 'Music has long been considered a universal language with the power to bring people together, but can the simple act of playing music possibly unite a child with a mother and father who live in two different cities and don\\'t even know of the child\\'s existence? Having shared one extraordinary night, classical cellist Lyla Novacek (Keri Russell) and Irish singer and songwriter Louis Connelly (Jonathan Rhys Meyers) were a union meant to be that was torn apart by circumstances and a protective father (William Sadler). After eleven years, both Lyla and Louis have given up performing only to find that they are unhappy and searching for a sense of fulfillment that will ultimately lead both artists back to music and performing. Evan (Freddie Highmore) is an 11-year old orphan who\\'s grown up hearing music in everything around him and is convinced that his real parents want him and will find him with the help of music. Driven by his innate musical genius and a powerful compulsion to perform before the world, Evan runs away from the orphanage and is initially taken in by a street man known as Wizard (Robin Williams) who encourages his musical talent and renames him August Rush and, later, by a local priest who arranges for August to receive a Julliard education. August is a child prodigy who excels beyond even the wildest expectations and earns the opportunity of a lifetime--a chance to perform in front of an enormous audience in New York\\'s Central Park. The question is; can his performance possibly reach the audience August really craves? While elements of this film are completely unbelievable (take August\\'s instant prowess on the guitar or his immediate and sophisticated grasp of musical notation and musical theory), the message of the universality of music and the notion that \"the music is all around us, all you have to do is listen\" is both compelling and powerful.', '--Tami Horiuchi']\n{'Genre': 'Musicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & AdventureMusicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & Adventure  See more', 'Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, WidescreenAC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen  See more', 'Contributor': \"Mykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louise Goodsill, Keri Russell, Robert Greenhut, Jania Simone Nash, Aaron Staton, Nick CastleMykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louis…  See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '76368', 'Director': 'Kirsten Sheridan', 'Media Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'March 11, 2008', 'Actors': 'Freddie Highmore, Keri Russell, Jonathan Rhys Meyers, Terrence Howard, Robin Williams', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Richard Barton Lewis, Robert Greenhut, Ralph Kamp, Louise Goodsill, Miky Lee', 'Studio': 'WarnerBrothers', 'Writers': 'Nick Castle, James V. Hart, Paul Castro', 'Number of discs': '1'}\nin hopeful anticipation of what was to come.<br /><br />I absolutely loved this movie and in fact paused it so I could call my daughter 2,000 miles away to tell her she MUST see this movie!<br /><br />The movie was magical. And many refer to it as a Fairy Tale and yet for me, personally, I viewed it as something very real, and THAT is what made it magical.<br />For I have experienced, or known of, many things that many may find unbelievable, or coincidental, or magical and yet they were the Orchestration (pun intended) beyond our own thinking.<br /><br />And that magical wonder; that purposeful Orchestration is there all the time..all we have to do is listen.\nMy heart was pounding and I gripped my armchair much of the time\nFrontline: Sick Around the World\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, TV News Programming\n['Four in five Americans say the healthcare system needs fundamental change. Can the U.S. learn anything from the rest of the world about how to run a healthcare system, or are these nations so culturally different that their solutions would not be acceptable? FRONTLINE correspondent T.R. Reid examines the healthcare systems of other advanced capitalist democracies to see what ideas might help the U.S. reform its broken healthcare system.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5070863', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'June 10, 2008', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nand then ran to the computer to see if I could get it on Amazon so I could share with anyone who is interested. It's a 'must see', truly.<br /><br />Other systems around the world work. Ours doesn't. Nothing's perfect, but see this and you'll see that there is a better way when we can all see the 'bigger picture' and remove agendas and be on board with what really matters.<br />When you do what is right, everyone benefits.\nA must see - saw on Public Television first\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'Bitsie Tulloch', 'Russell Hornsby'], 'Studio': ['NBC']}\nThis is a review for the entire Season 2 of Grimm. What began as just needing something to watch (and for free streaming) ended up as an absolute obsession.<br />In the beginning of Season 1, it took a few episodes before deciding if it was worth my time. Was David Giuntoli just another pretty face or did this show have any possibility?<br />First, let me tell you that as Season 1 wrapped up and I got wrapped up in Season 2, not only did the star, Nick, played by David Giuntoli prove to be a terrific actor - but the actors together do a superb job. I really like Hank, played by Russell Hornsby all the more once he was &#34;in the loop&#34; as to the real goings-on; and the development of the Captain's character was a nice turn of events. The character, Monroe, played by Silas W. Mitchell is the real maker of the show, because without him, it would be missing the element of humor and charm. And I love the addition of Rosalee! She's superb. The only character that's flawed is Juliette, who I found not only annoying, but her acting is sub-par and took away from the show. Everyone else made up for it though.<br />The writing, storyline, acting, makeup, special effects and scenery make this Season 2 of Grimm the best. I stayed up late last night to watch three in a row if that tells you anything!<br />(I do not recommend for children - let it be for adults only, in my opinion)\nWhat started as just needing something (free) to watch grew into an obsession and one of my all-time faves!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kristi Jacobson', 'Lori Silverbush'], 'Producers': ['Julie Goldman', 'Ryan Harrington', 'Kristi Jacobson', 'Lori Silverbush'], 'Starring': ['Jeff Bridges', 'Tom Colicchio'], 'Studio': ['Magnolia Pictures']}\nCompletely missed the mark - didn't show the real problems nor the real solutions and threw in enough truth to grab your emotions while enough political bulls*t to be a complete turnoff.<br />I would love to have a one-on-one conversation with Jeff Bridges to show him the real problems and some real solutions. The Government is not the answer, nor should it be. I agree that the Government is certainly a part of the PROBLEM - no doubt.<br />Becoming more self reliant and sustainable and returning to more the 'natural' human is where the answer lies. Read Michael Bunker's book, &#34;Surviving Off Off-Grid&#34; for starters.<br />I myself have taught a 2 hr class on sprouting - for ULTIMATE NUTRITION for only pennies a day, which can be done in any living situation. Victoria Boutenko (see her books here on Amazon), as an individual, has traveled the world over, to some of the most 3rd world countries where  people truly ARE starving, and where they have no resources and showed them how to grow the most NUTRITIOUS foods on the planet for very little cost and effort and to provide enough for their village - not just to survive and get by, but to THRIVE in good health and to be enough for them ALL.<br /><br />This movie missed the mark. While I do recommend that people see it to understand some things - though NOT the things mentioned in the movie - but to basically see the MISCONCEPTIONS and how things are being skewed, I do recommend that people know just how many people in this country are facing these issues. I simply see the issues as being completely different than what is presented in this film\nI would love to have a one-on-one conversation with Jeff Bridges to ...\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nI'm loving this series and all the angles. I'm also glad to really like the lead actor, Titus Welliver, in this role. This is a great role for him. So often you see him play a character that you just hate, but not this time - I LOVE Bosch. What a great detective! The added interest of his past makes him all the more intriguing and this series has captured my full attention.<br />Great job!\nSo far, so fabulous!\nThe Perfect Stranger/ Another Perfect Stranger: Director's Double Feature set\nPamela Brumley  (Actor),     Ruby Marie Lewis  (Actor),     Shane Sooter  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Independently Distributed, Drama\n[\"The perfect combination of the 2006 underground hit, 'The Perfect Stranger' and its 2007 sequel, 'Another Perfect Stranger', in one two-disc set. In 'The Perfect Stranger' a skeptical lawyer accepts a dinner invitation from a man claiming to be Jesus of Nazareth. The second disc, 'Another Perfect Stranger', tells the story of a nineteen year-old artist, on a journey to escape her parents' religious views, that befriends an unlikely travel companion who shares her disdain for religion. Both films are based on the bestselling 'Perfect Stranger' novels by David Gregory.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Shane Sooter, Jefferson Moore', 'Media Format': 'NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'February 9, 2009', 'Actors': 'Pamela Brumley, Ruby Marie Lewis, Stella Davis, Jefferson Moore', 'Studio': \"Kelly's Filmworks LTD\", 'Number of discs': '2'}\nThis is still my choice for sharing the message. I stumbled across this one time when I was laid up with a back injury and really loved it. Basically, it's very simplistic. As far as movies, sets, props, acting and all that goes, it would probably classify as very B or even C rated. But if you look past that, and pretend you were watching a play in a theatre, instead perhaps, and just simply listened to the message, you will soon see how masterfully BRILLIANT each of these films are!<br />I love how they present the questions and answers just as we all would wonder or ask; or have at some time or another. And it is great to have those questions - but the ANSWERS are what are so powerful.<br />If you have questions yourself; or maybe you know someone who does, this is really a helpful tool. These make great gifts again and again. Good to send your child off to college with; good to have family time with; great to donate to a Teen Group or your favorite church ministry. Look for their special pricing and grab them when on special.<br />I love this set. Problem is, I never end up keeping a set for myself - I always give them away. But, that's a good problem to have. :)\nI stumbled across this one time when I was laid up with a back injury and really loved it. Basically\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium', 'Deutsch'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]', 'Deutsch'], 'Directors': ['Charles McDougall'], 'Producers': ['Shawn Ryan', 'Cris Cole'], 'Starring': ['Ben Chaplin', 'Michael Imperioli', 'Romany Malco']}\nIt's so difficult to write a review on a piece of artwork - be it a painting, a movie, a book, or an album. It is just too personal; too subjective; too changeable; and depends on your own perspective at the very time of your viewing it. I've even watched a movie at one time and felt one way and then a few years later, watched it again and got way more from it then.<br />Therefore, although I rated it five stars, and did really love it, I can't say that I think others are completely wrong to rate it only two stars as I understand that's how they felt about it as that's their own experience.<br />I, on the other hand, was so gripped, and felt the intensity of it so much that I watched three episodes the first night, and then three more the second night, and finished it two days later. I HAD to know what happened next!!<br />I thought the cast was an all star cast and each one did an excellent job of acting their character. Although this movie has definitely scared me from ever wanting to go to Belize, the scenery was incredible! It was so beautiful! I thought this film was outstanding in the story; the twists and turns of events; the acting; the cinematography and in how it remained intense enough  to the very end!<br />Just what is a person's real character and how does it present itself in the most dire of circumstances? What of loyaty, or honor? Only one truly was a shmuck and remained a shmuck, no matter what came his way, even after just praying for &#34;a second chance&#34;. I guess, then, even he remained true to his real character - once a shmuck, always a shmuck.<br />I don't know about you, but I have a few questions, but let's just say this..I think I would've left the duffle bag on the boat and not have had anything to do with it right from the start.<br />Yes, entertaining movie!\nI loved it and watched three the first night!\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Pieter Jan Brugge'], 'Starring': ['タイタス・ウェリバー', 'ジェイミー・へクター', 'エイミー・アキノ']}\nI was pleasantly surprised to see a Season 2 and jumped right in and finished off the whole season in three days. I did enjoy it. I thought the writers did a good job; it had a lot of twists and turns; and was pretty exciting. AND I can't wait to see if there will be a Season 3.<br />The only thing I have to say, since I cannot select a 4.5 stars rating, is that there was something lacking. I can't put my finger on it, but there was an 'energy' that was missing. I also felt the acting was just slightly missing the mark in some of the characters and, as if, it didn't quite mesh well with other characters' acting - as if one was over the top, while the other a bit bland. I can't explain..<br />I enjoy Titus Welliver as an actor, and I do very much like this series, but, after a while, the way he walks, and stands seems to be as if he is either physically very uncomfortable (he walks and stands awkwardly); or he is not comfortable with himself and is self-conscious. On top of that, it was starting to annoy me that he often didn't look one in the eye when talking, but his head and eyes are darting all over the place.<br />Anyway, all that aside, I thought it was a great season and I really enjoyed it and can't wait for Season 3.\nWatched the whole Season in 3 days\nMillion Dollar Baby (DVD)\nClint Eastwood  (Actor, Director, Producer),     Hilary Swank  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['\"I DON\\'T TRAIN GIRLS\", trainer Frankie Dunn growls. But something\\'s different about the spirited boxing hopeful who shows up daily at Dunn\\'s gym. All she wants is a fighting chance. Clint Eastwood plays Dunn and directs, produces and composes music for this acclaimed, multi-award-winning tale of heart, hope and family. Hilary Swank plays resilient Maggie, determined not to abandon her one dream. And Morgan Freeman is Scrap, gym caretaker and counterpoint to Dunn\\'s crustiness. Grab your dreams and come out swinging.', 'DVD Features:', 'Documentaries', 'Featurette', 'Interviews']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000149835DVD', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 12 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Hilary Swank, Morgan Freeman, Jay Baruchel, Mike Colter', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Producers': 'Gary Lucchesi, Clint Eastwood, Robert Lorenz, Albert S. Ruddy, Tom Rosenberg', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'WarnerBrothers', 'Writers': 'Paul Haggis', 'Number of discs': '1'}\nI don't know that I could rate a movie poorly just because I didn't like how it made me feel - as one reviewer did. How is that fair when you are are reviewing something as it would likely appeal to the masses? When you are rating story line, acting, directing, etc, etc.?<br />So, I will say this - I was stunned with the ending and didn't like how I felt. But since this movie wasn't about 'me' or how I would feel, I wanted to appreciate all aspects of the movie and mention them.<br />I thought the message was good; and clear; and ones we all can (or should) relate to - which is basically seeing that people are human; and that sometimes there is a real struggle just to find their way in life. There were so many messages to be found here that discovering them is also part of the individual's own message as to what they can glean from it. It can be not only learning who you are..but also who you aren't, as Maggie did the one moment she realized that her family was definitely not her family.<br />I didn't like the way the movie ended and wished it had ended differently..but there was no promise of that to begin with - no 'rose garden';<br /><br />Now for some critiquing: I felt like I had seen both Clint Eastwood and Morgan Freeman in those same types of character roles before that it seemed too redundant or 'deja vu'. I think the director wanted to leave some things up to the viewer's imagination, and yet, for me anyway, it left too many questions such as what happened between Clint Eastwood and his daughter and why did it pain him so much? What was the envelope he found on the floor and why was that significant? Also, I was confused as to how Clint Eastwood felt about Hillary (Maggie). There were times when I felt he loved her like a daughter, and then other times where I wondered if it were more? Or was that up to our own interpretation as well?<br />I thought the boxing scenes were awesome - and this from a person who despises boxing! They did an awesome job with all the boxing.<br /><br />This movie came with two DVD's and I watched the second one later. This really helped me understand the movie from behind the scenes, as well as clarify for me what the mysterious envelope was! I appreciated all the training Hillary did for her part; and how well she succeeded.<br />Others had a problem with the narration (done by Morgan Freeman). I actually loved it - but then who doesn't love his voice? Also, the very last sentence of the narrative tied the movie all together, so it was well worth it to have the narration, in my opinion.<br /><br />That we were left hanging, wondering what happened to Clint Eastwood, was supposed to be speculative. I don't know that I liked that. I wanted to at least have an idea. Nonetheless, I made up my own answer.<br />Maybe that's the whole idea..\n.How to objectively review a movie?\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Mel Gibson'], 'Producers': ['Bill Mechanic', 'David Permut', 'Terry Benedict', 'Paul Currie', 'Bruce Davey', 'Brian Oliver'], 'Starring': ['Andrew Garfield', 'Richard Pyros', 'Jacob Warner']}\ni rarely ever see a movie in the theater, but it just so happened, for the first time in many years, I had the opportunity to go and &quot;Hacksaw Ridge&quot; was the movie of choice. I knew very little about it, other than it came highly recommended. I was accompanied by two others, and they knew even less of the movie.<br />All three of us were absolutely blown away, and days later, we are still talking about it, and how much it touched, and impacted us. That is the sign of an excellent movie - when you are still so very much aware of what it meant to you several days later. When the scenes play in your mind over and over again, and you recapture their meaning. When new insights form and take on even deeper meaning and revelation.<br />AND THIS MOVIE WILL DO JUST THAT.<br />Mel Gibson is one very fine director. I still cannot get over how those war scenes were done - so realstically - as I've never seen before. Depicting the horror, the terror..the absolute fear.<br />I've read the other reviews here, and so far, many of them disappoint me. I don't care to hear anything about Mel Gibson's past. Irrelevant. He directed this film and he was magnificent in ways words cannot describe.<br />Every aspect of this film was done well; and the viewer experience takes you through the journey, culminating in absolute wonderment, inspiration, and awe.<br />It won't leave my mind for awhile, and won't leave my heart EVER.\nother than it came highly recommended. I was accompanied by two others\nIn America\nPaddy Considine  (Actor),     Samantha Morton  (Actor),     Jim Sheridan  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['From Academy Awad Nominee Jim Sheridan comes this deeply personal and poignant tale of a poor Irish family searching for a better life In America. Through the eyes of their spunky daughters, two anguished parents find hope and the ability to once again believe in love and magic\\x85even amidst the dangers of New York\\'s harrowing Hell\\'s Kitchen. With mesmerizing performances by Samantha Morton and Djimon Hounsou, In America is \"a classic\" (USA Today) you won\\'t ever forget.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Ciaran Cronin, Jason Salkey, Kirsten Sheridan, Jim Sheridan, Neal Jones, Samantha Morton, Emma Bolger, Juan Carlos Hernndez, Nye Heron, Naomi Sheridan, Djimon Hounsou, Sarah Bolger, Randall Carlton, Paddy Considine, Rene MillanCiaran Cronin, Jason Salkey, Kirsten Sheridan, Jim Sheridan, Neal Jones, Samantha Morton, Emma Bolger, Juan Carlos Hernndez, Nye Heron, Naomi Sheridan, Djimon Hounsou, Sarah Bolger, Randall Carlton, Paddy Considine, Rene Millan  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.52 Ounces', 'Director': 'Jim Sheridan', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 11, 2004', 'Actors': 'Paddy Considine, Samantha Morton, Djimon Hounsou, Sarah Bolger, Emma Bolger', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Jim Sheridan, Kirsten Sheridan, Naomi Sheridan', 'Number of discs': '1'}\nA very nice surprise.<br />Picked a movie from off the shelf, without looking at it, and put in the DVD player to watch, and what I watched, I really enjoyed. After seeing it, I researched on the internet and learned that it is a semi-autobiographical movie; and I also learned that the daughters in the movie really ARE sissters - Irish actresses.<br />The story shows how the love and closeness of a family can get them through anything; and so can determination. I loved the wisdom of Christy, the eldest daughter, who was wise way beyond her years. I loved how the innocence of children broke through the walls and barriers of fear and pain in both the neighbor, and their father.<br />Good movie!\nA very nice surprise. Picked a movie from off the shelf\n{'Content advisory': ['Violence', 'substance use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Daldry'], 'Producers': ['Scott Rudin', 'Robert Fox'], 'Starring': ['Meryl Streep', 'Julianne Moore', 'Nicole Kidman'], 'Studio': ['Paramount Pictures Corp.']}\nPulled it off the shelf and the jacket gave no description of what it was about, so figured with that cast, it was probably good. First, I didn't even recognize Nicole Kidman. Did she create a different nose; or did she later have a nose job? Anyway, irrelevant.<br />Not knowing what the movie was about whatsoever, it was hard to try and piece it together to figure it out. I kept waiting to understand their focal point - their message. Was it about depression? Was it about happiness? Was it about mental illness? Was it about homosexuality? One reviewer wrote that Richard had AIDS. Where in the movie did they indicate that?<br />Very depressing movie, and at the end, I wished I could have &#34;the hours&#34; back I spent watching it.\nDepressing",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Straight from the Heart [DVD]\nReview Date: 2009/12/21\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Made-for-TV Movies, All Made-for-TV Movies\nProduct Description: ['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'UN', 'Release Date:', '1-MAY-2007', 'Media Type:', 'DVD']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC, DVD', 'Contributor': 'Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.Teri Polo, Andrew McCarthy, Patricia Kalember, Greg Evigan, Christine Tucci Directors: David S. Cass Sr.  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Media Format': 'NTSC, DVD', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 1, 2007', 'Studio': 'Good Times Video'}\nReview Text: I hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br /><br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane and I wanted to be sure to order some clean-cut family type ones for visiting once I got there.<br /><br />I read all the reviews on this one and was not disappointed. As the others have said, the scenery, the actors, the warmth and beauty of it as well as the story made it all worthwhile.\nReview Title: Really enjoyed it and would recommend\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bucket List\nReview Date: 2009/12/21\nStore: Jack Nicholson  (Actor),     Morgan Freeman  (Actor),     Rob Reiner  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Bucket List, The (WS/FS/DVD)', \"Academy Award winners Jack Nicholson and Morgan Freeman star in this comedy drama, directed by Rob Reiner, a touching, no-holds-barred adventure that shows it's never too late to live life to its fullest--The Bucket List. One man was smart enough to go to college, but has worked his entire life as a mechanic; the other owns the hospital in which they are both patients. But these two men with little time left and even less to lose, discover that life can be deeply moving and definitely hilarious.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure/Crime, Comedy, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Contributor': 'Rowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob ReinerRowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob Reiner   See more', 'Language': 'Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0), French (Dolby Digital 4.0)', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 0.01 Ounces', 'Item model number': 'WARD024013D', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'June 10, 2008', 'Actors': 'Jack Nicholson, Morgan Freeman, Sean Hayes, Rob Morrow, Beverly Todd', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Jeffrey Stott, Craig Zadan, Travis Knox, Neil Meron, Alan Greisman', 'Studio': 'WarnerBrothers', 'Writers': 'Justin Zackham', 'Number of discs': '1'}\nReview Text: I hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip as well as to have with me to view so I didn't want anything that would be offensive to anyone near me on the plane.<br /><br />Yes, it's sad, but so are lots of things in life but this is a different kind of sadness. It's a sadness that also comes with great joy because it reached its full cycle and you felt that fulfillment. You also felt its purpose, and the love.<br /><br />I think for some to comment that it was 'predictable' miss the point. Much in life is predictable. For me, I don't care that some things are predictable; or simplified, or maybe not even 'realistic'. I can get reality in the day to day. To watch a movie is to become involved deeply with so many levels of the movie and to glean from it whatever message you are receiving at that time.<br /><br />I enjoyed Morgan's wife in the movie and the relationship he had with her. Of course she is going to get mad at him; be frustrated, concerned and then absolutely shocked and bewildered when he announced his plans. But, she also showed great trust, and love and knew that whatever he was needing to do, it's what he needed to do and let it go. Let him go. I enjoyed those intimate scenes. People need to see great strength and trust between two people.<br /><br />I also found myself hanging on the edge of my seat when Morgan was at the bar and the beautiful lady came up and sat next to him. I found myself thinking that if MORGAN (the actor - not even the character!) 'gave in', then I would change how I felt about him (however irrational since it was his character, not him). I held my breath in anticipation...<br />Now, whether Morgan had any say so on the outcome of that scene or whether that was how the script was written anyway, it made a world of difference to me. And if Morgan did have a say so, well, all the more reason why I esteem him so highly.<br /><br />I thought it was a wonderful movie and am so glad I got to see it.\nReview Title: Two of my favorites together for an unforgettable movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gran Torino\nReview Date: 2009/12/21\nStore: Clint Eastwood  (Actor, Director),     Brian Haley  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"A disgruntled Korean War vet, Walt Kowalski (Eastwood), sets out to reform his neighbor, a young Hmong teenager, who tried to steal Kowalski's prized possession: his 1972 Gran Torino.\"]\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '1 hour and 56 minutes', 'Release date': 'June 9, 2009', 'Actors': 'Clint Eastwood, Brian Haley, Christopher Carley, Geraldine Hughes', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nReview Text: I hadn't seen in a movie in..drum roll please..six years. ANY movie.<br />As I bought myself a portable DVD player for Christmas for business use and for travel, I of course needed to get some movies!<br />AHHHH!!!!!!!! I had no idea what was even out there or what I would like to watch!<br />I had a plane trip coming up and wanted to get some for the trip.<br />When I went to Amazon's DVD page, Gran Torino was showing and of course, since I'm a huge Clint Eastwood fan, it was my choice.<br />I'm stunned as to what to say and I can't really add anything that other reviewers have not already said. BTW, I concur completely with Robert Crawford's absolutely beautiful review as that says it all so well.<br /><br />The unfolding of the layers to this crotchety, bitter man is what is so special and yet at the same time so sad that this is what his sons will never know, never experience is one that hit the 'closest to home' for me and much of the sadness that I did feel in this movie. The loss. The waste.<br /><br />I also want to comment on how much I enjoyed the actress who played Sue - the girl next door. She was a fabulous actress and you adored her instantly. Conversely, I had a bit more of a difficult time 'believing' the character of the boy until much more into the movie.<br /><br />Clint is still so very handsome - one scene where he puts on a nice jacket and has a close shave and no matter his age, he's still 'got it'.<br /><br />Yes, the old man thought long and hard and came up with the winning solution to a very real and very gruesome problem. And along with that, he buried the demons haunting his heart and mind for all those years.<br /><br />The movie is sad? Yes, but the saddest part of all is that it's a reality that is a part of so many peoples' lives all the time.\nReview Title: left me feeling utterly distraught\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: August Rush\nReview Date: 2009/12/27\nStore: Kirsten Sheridan  (Director),     Freddie Highmore  (Actor),     Keri Russell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: ['Product Description', 'August Rush (WS/FS/DVD)', 'Separated by events they could not control but bound by love and by music, three people search for what they lost and what will make their lives complete ... each other. Keri Russell (Waitress, \"Felicity\"), Johathan Rhys Meyers (\"The Tudors\") and Freddie Highmore (Charlie and the Chocolate Family, Finding Neverland) star with Robin Williams in this amazing, heartwarming tale of two very different musicians who fall in love only to be torn apart, both unaware that they have a child, a musical prodigy who is trying to find them as much as they are trying to find each other, a boy destined for greatness as the rising young star August Rush.', ']]>', 'Amazon.com', 'Music has long been considered a universal language with the power to bring people together, but can the simple act of playing music possibly unite a child with a mother and father who live in two different cities and don\\'t even know of the child\\'s existence? Having shared one extraordinary night, classical cellist Lyla Novacek (Keri Russell) and Irish singer and songwriter Louis Connelly (Jonathan Rhys Meyers) were a union meant to be that was torn apart by circumstances and a protective father (William Sadler). After eleven years, both Lyla and Louis have given up performing only to find that they are unhappy and searching for a sense of fulfillment that will ultimately lead both artists back to music and performing. Evan (Freddie Highmore) is an 11-year old orphan who\\'s grown up hearing music in everything around him and is convinced that his real parents want him and will find him with the help of music. Driven by his innate musical genius and a powerful compulsion to perform before the world, Evan runs away from the orphanage and is initially taken in by a street man known as Wizard (Robin Williams) who encourages his musical talent and renames him August Rush and, later, by a local priest who arranges for August to receive a Julliard education. August is a child prodigy who excels beyond even the wildest expectations and earns the opportunity of a lifetime--a chance to perform in front of an enormous audience in New York\\'s Central Park. The question is; can his performance possibly reach the audience August really craves? While elements of this film are completely unbelievable (take August\\'s instant prowess on the guitar or his immediate and sophisticated grasp of musical notation and musical theory), the message of the universality of music and the notion that \"the music is all around us, all you have to do is listen\" is both compelling and powerful.', '--Tami Horiuchi']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & AdventureMusicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Drama, Action & Adventure  See more', 'Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, WidescreenAC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen  See more', 'Contributor': \"Mykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louise Goodsill, Keri Russell, Robert Greenhut, Jania Simone Nash, Aaron Staton, Nick CastleMykelti Williamson, Alex O'Loughlin, Terrence Howard, Kirsten Sheridan, William Sadler, Lionel Wigram, Jonathan Rhys Meyers, Richard Barton Lewis, Marian Seldes, Leon Thomas III, Miky Lee, Paul Castro, Robin Williams, Ralph Kamp, James V. Hart, Freddie Highmore, Louis…  See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '76368', 'Director': 'Kirsten Sheridan', 'Media Format': 'AC-3, Closed-captioned, Multiple Formats, Color, Dubbed, Full Screen, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'March 11, 2008', 'Actors': 'Freddie Highmore, Keri Russell, Jonathan Rhys Meyers, Terrence Howard, Robin Williams', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Richard Barton Lewis, Robert Greenhut, Ralph Kamp, Louise Goodsill, Miky Lee', 'Studio': 'WarnerBrothers', 'Writers': 'Nick Castle, James V. Hart, Paul Castro', 'Number of discs': '1'}\nReview Text: in hopeful anticipation of what was to come.<br /><br />I absolutely loved this movie and in fact paused it so I could call my daughter 2,000 miles away to tell her she MUST see this movie!<br /><br />The movie was magical. And many refer to it as a Fairy Tale and yet for me, personally, I viewed it as something very real, and THAT is what made it magical.<br />For I have experienced, or known of, many things that many may find unbelievable, or coincidental, or magical and yet they were the Orchestration (pun intended) beyond our own thinking.<br /><br />And that magical wonder; that purposeful Orchestration is there all the time..all we have to do is listen.\nReview Title: My heart was pounding and I gripped my armchair much of the time\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Frontline: Sick Around the World\nReview Date: 2010/01/17\nStore: Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, TV News Programming\nProduct Description: ['Four in five Americans say the healthcare system needs fundamental change. Can the U.S. learn anything from the rest of the world about how to run a healthcare system, or are these nations so culturally different that their solutions would not be acceptable? FRONTLINE correspondent T.R. Reid examines the healthcare systems of other advanced capitalist democracies to see what ideas might help the U.S. reform its broken healthcare system.']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5070863', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour', 'Release date': 'June 10, 2008', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: and then ran to the computer to see if I could get it on Amazon so I could share with anyone who is interested. It's a 'must see', truly.<br /><br />Other systems around the world work. Ours doesn't. Nothing's perfect, but see this and you'll see that there is a better way when we can all see the 'bigger picture' and remove agendas and be on board with what really matters.<br />When you do what is right, everyone benefits.\nReview Title: A must see - saw on Public Television first\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/11/09\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'Bitsie Tulloch', 'Russell Hornsby'], 'Studio': ['NBC']}\nReview Text: This is a review for the entire Season 2 of Grimm. What began as just needing something to watch (and for free streaming) ended up as an absolute obsession.<br />In the beginning of Season 1, it took a few episodes before deciding if it was worth my time. Was David Giuntoli just another pretty face or did this show have any possibility?<br />First, let me tell you that as Season 1 wrapped up and I got wrapped up in Season 2, not only did the star, Nick, played by David Giuntoli prove to be a terrific actor - but the actors together do a superb job. I really like Hank, played by Russell Hornsby all the more once he was &#34;in the loop&#34; as to the real goings-on; and the development of the Captain's character was a nice turn of events. The character, Monroe, played by Silas W. Mitchell is the real maker of the show, because without him, it would be missing the element of humor and charm. And I love the addition of Rosalee! She's superb. The only character that's flawed is Juliette, who I found not only annoying, but her acting is sub-par and took away from the show. Everyone else made up for it though.<br />The writing, storyline, acting, makeup, special effects and scenery make this Season 2 of Grimm the best. I stayed up late last night to watch three in a row if that tells you anything!<br />(I do not recommend for children - let it be for adults only, in my opinion)\nReview Title: What started as just needing something (free) to watch grew into an obsession and one of my all-time faves!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/02/21\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kristi Jacobson', 'Lori Silverbush'], 'Producers': ['Julie Goldman', 'Ryan Harrington', 'Kristi Jacobson', 'Lori Silverbush'], 'Starring': ['Jeff Bridges', 'Tom Colicchio'], 'Studio': ['Magnolia Pictures']}\nReview Text: Completely missed the mark - didn't show the real problems nor the real solutions and threw in enough truth to grab your emotions while enough political bulls*t to be a complete turnoff.<br />I would love to have a one-on-one conversation with Jeff Bridges to show him the real problems and some real solutions. The Government is not the answer, nor should it be. I agree that the Government is certainly a part of the PROBLEM - no doubt.<br />Becoming more self reliant and sustainable and returning to more the 'natural' human is where the answer lies. Read Michael Bunker's book, &#34;Surviving Off Off-Grid&#34; for starters.<br />I myself have taught a 2 hr class on sprouting - for ULTIMATE NUTRITION for only pennies a day, which can be done in any living situation. Victoria Boutenko (see her books here on Amazon), as an individual, has traveled the world over, to some of the most 3rd world countries where  people truly ARE starving, and where they have no resources and showed them how to grow the most NUTRITIOUS foods on the planet for very little cost and effort and to provide enough for their village - not just to survive and get by, but to THRIVE in good health and to be enough for them ALL.<br /><br />This movie missed the mark. While I do recommend that people see it to understand some things - though NOT the things mentioned in the movie - but to basically see the MISCONCEPTIONS and how things are being skewed, I do recommend that people know just how many people in this country are facing these issues. I simply see the issues as being completely different than what is presented in this film\nReview Title: I would love to have a one-on-one conversation with Jeff Bridges to ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/06\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Mikkel Bondesen', 'Pieter Jan Brugge', 'Jan David Frouman'], 'Starring': ['Titus Welliver', 'Jamie Hector', 'Amy Aquino'], 'Studio': ['Amazon Studios']}\nReview Text: I'm loving this series and all the angles. I'm also glad to really like the lead actor, Titus Welliver, in this role. This is a great role for him. So often you see him play a character that you just hate, but not this time - I LOVE Bosch. What a great detective! The added interest of his past makes him all the more intriguing and this series has captured my full attention.<br />Great job!\nReview Title: So far, so fabulous!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Perfect Stranger/ Another Perfect Stranger: Director's Double Feature set\nReview Date: 2015/07/18\nStore: Pamela Brumley  (Actor),     Ruby Marie Lewis  (Actor),     Shane Sooter  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: [\"The perfect combination of the 2006 underground hit, 'The Perfect Stranger' and its 2007 sequel, 'Another Perfect Stranger', in one two-disc set. In 'The Perfect Stranger' a skeptical lawyer accepts a dinner invitation from a man claiming to be Jesus of Nazareth. The second disc, 'Another Perfect Stranger', tells the story of a nineteen year-old artist, on a journey to escape her parents' religious views, that befriends an unlikely travel companion who shares her disdain for religion. Both films are based on the bestselling 'Perfect Stranger' novels by David Gregory.\"]\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Shane Sooter, Jefferson Moore', 'Media Format': 'NTSC', 'Run time': '3 hours and 2 minutes', 'Release date': 'February 9, 2009', 'Actors': 'Pamela Brumley, Ruby Marie Lewis, Stella Davis, Jefferson Moore', 'Studio': \"Kelly's Filmworks LTD\", 'Number of discs': '2'}\nReview Text: This is still my choice for sharing the message. I stumbled across this one time when I was laid up with a back injury and really loved it. Basically, it's very simplistic. As far as movies, sets, props, acting and all that goes, it would probably classify as very B or even C rated. But if you look past that, and pretend you were watching a play in a theatre, instead perhaps, and just simply listened to the message, you will soon see how masterfully BRILLIANT each of these films are!<br />I love how they present the questions and answers just as we all would wonder or ask; or have at some time or another. And it is great to have those questions - but the ANSWERS are what are so powerful.<br />If you have questions yourself; or maybe you know someone who does, this is really a helpful tool. These make great gifts again and again. Good to send your child off to college with; good to have family time with; great to donate to a Teen Group or your favorite church ministry. Look for their special pricing and grab them when on special.<br />I love this set. Problem is, I never end up keeping a set for myself - I always give them away. But, that's a good problem to have. :)\nReview Title: I stumbled across this one time when I was laid up with a back injury and really loved it. Basically\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/02/01\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium', 'Deutsch'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]', 'Deutsch'], 'Directors': ['Charles McDougall'], 'Producers': ['Shawn Ryan', 'Cris Cole'], 'Starring': ['Ben Chaplin', 'Michael Imperioli', 'Romany Malco']}\nReview Text: It's so difficult to write a review on a piece of artwork - be it a painting, a movie, a book, or an album. It is just too personal; too subjective; too changeable; and depends on your own perspective at the very time of your viewing it. I've even watched a movie at one time and felt one way and then a few years later, watched it again and got way more from it then.<br />Therefore, although I rated it five stars, and did really love it, I can't say that I think others are completely wrong to rate it only two stars as I understand that's how they felt about it as that's their own experience.<br />I, on the other hand, was so gripped, and felt the intensity of it so much that I watched three episodes the first night, and then three more the second night, and finished it two days later. I HAD to know what happened next!!<br />I thought the cast was an all star cast and each one did an excellent job of acting their character. Although this movie has definitely scared me from ever wanting to go to Belize, the scenery was incredible! It was so beautiful! I thought this film was outstanding in the story; the twists and turns of events; the acting; the cinematography and in how it remained intense enough  to the very end!<br />Just what is a person's real character and how does it present itself in the most dire of circumstances? What of loyaty, or honor? Only one truly was a shmuck and remained a shmuck, no matter what came his way, even after just praying for &#34;a second chance&#34;. I guess, then, even he remained true to his real character - once a shmuck, always a shmuck.<br />I don't know about you, but I have a few questions, but let's just say this..I think I would've left the duffle bag on the boat and not have had anything to do with it right from the start.<br />Yes, entertaining movie!\nReview Title: I loved it and watched three the first night!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/01\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español', 'Deutsch'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español'], 'Directors': ['Alex Zakrzewski', 'Ernest R. Dickerson', 'Patrick Cady', 'Aaron Lipstadt', 'Kevin Dowling', 'Adam Davidson', 'Daisy von Scherler Mayer', 'Tim Hunter', 'Christine Moore', 'Zetna Fuentes'], 'Producers': ['Eric Overmyer', 'Michael Connelly', 'Henrik Bastin', 'Pieter Jan Brugge'], 'Starring': ['タイタス・ウェリバー', 'ジェイミー・へクター', 'エイミー・アキノ']}\nReview Text: I was pleasantly surprised to see a Season 2 and jumped right in and finished off the whole season in three days. I did enjoy it. I thought the writers did a good job; it had a lot of twists and turns; and was pretty exciting. AND I can't wait to see if there will be a Season 3.<br />The only thing I have to say, since I cannot select a 4.5 stars rating, is that there was something lacking. I can't put my finger on it, but there was an 'energy' that was missing. I also felt the acting was just slightly missing the mark in some of the characters and, as if, it didn't quite mesh well with other characters' acting - as if one was over the top, while the other a bit bland. I can't explain..<br />I enjoy Titus Welliver as an actor, and I do very much like this series, but, after a while, the way he walks, and stands seems to be as if he is either physically very uncomfortable (he walks and stands awkwardly); or he is not comfortable with himself and is self-conscious. On top of that, it was starting to annoy me that he often didn't look one in the eye when talking, but his head and eyes are darting all over the place.<br />Anyway, all that aside, I thought it was a great season and I really enjoyed it and can't wait for Season 3.\nReview Title: Watched the whole Season in 3 days\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Million Dollar Baby (DVD)\nReview Date: 2016/07/08\nStore: Clint Eastwood  (Actor, Director, Producer),     Hilary Swank  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['\"I DON\\'T TRAIN GIRLS\", trainer Frankie Dunn growls. But something\\'s different about the spirited boxing hopeful who shows up daily at Dunn\\'s gym. All she wants is a fighting chance. Clint Eastwood plays Dunn and directs, produces and composes music for this acclaimed, multi-award-winning tale of heart, hope and family. Hilary Swank plays resilient Maggie, determined not to abandon her one dream. And Morgan Freeman is Scrap, gym caretaker and counterpoint to Dunn\\'s crustiness. Grab your dreams and come out swinging.', 'DVD Features:', 'Documentaries', 'Featurette', 'Interviews']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000149835DVD', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 12 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Hilary Swank, Morgan Freeman, Jay Baruchel, Mike Colter', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Producers': 'Gary Lucchesi, Clint Eastwood, Robert Lorenz, Albert S. Ruddy, Tom Rosenberg', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'WarnerBrothers', 'Writers': 'Paul Haggis', 'Number of discs': '1'}\nReview Text: I don't know that I could rate a movie poorly just because I didn't like how it made me feel - as one reviewer did. How is that fair when you are are reviewing something as it would likely appeal to the masses? When you are rating story line, acting, directing, etc, etc.?<br />So, I will say this - I was stunned with the ending and didn't like how I felt. But since this movie wasn't about 'me' or how I would feel, I wanted to appreciate all aspects of the movie and mention them.<br />I thought the message was good; and clear; and ones we all can (or should) relate to - which is basically seeing that people are human; and that sometimes there is a real struggle just to find their way in life. There were so many messages to be found here that discovering them is also part of the individual's own message as to what they can glean from it. It can be not only learning who you are..but also who you aren't, as Maggie did the one moment she realized that her family was definitely not her family.<br />I didn't like the way the movie ended and wished it had ended differently..but there was no promise of that to begin with - no 'rose garden';<br /><br />Now for some critiquing: I felt like I had seen both Clint Eastwood and Morgan Freeman in those same types of character roles before that it seemed too redundant or 'deja vu'. I think the director wanted to leave some things up to the viewer's imagination, and yet, for me anyway, it left too many questions such as what happened between Clint Eastwood and his daughter and why did it pain him so much? What was the envelope he found on the floor and why was that significant? Also, I was confused as to how Clint Eastwood felt about Hillary (Maggie). There were times when I felt he loved her like a daughter, and then other times where I wondered if it were more? Or was that up to our own interpretation as well?<br />I thought the boxing scenes were awesome - and this from a person who despises boxing! They did an awesome job with all the boxing.<br /><br />This movie came with two DVD's and I watched the second one later. This really helped me understand the movie from behind the scenes, as well as clarify for me what the mysterious envelope was! I appreciated all the training Hillary did for her part; and how well she succeeded.<br />Others had a problem with the narration (done by Morgan Freeman). I actually loved it - but then who doesn't love his voice? Also, the very last sentence of the narrative tied the movie all together, so it was well worth it to have the narration, in my opinion.<br /><br />That we were left hanging, wondering what happened to Clint Eastwood, was supposed to be speculative. I don't know that I liked that. I wanted to at least have an idea. Nonetheless, I made up my own answer.<br />Maybe that's the whole idea..\nReview Title: .How to objectively review a movie?\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/11/17\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Mel Gibson'], 'Producers': ['Bill Mechanic', 'David Permut', 'Terry Benedict', 'Paul Currie', 'Bruce Davey', 'Brian Oliver'], 'Starring': ['Andrew Garfield', 'Richard Pyros', 'Jacob Warner']}\nReview Text: i rarely ever see a movie in the theater, but it just so happened, for the first time in many years, I had the opportunity to go and &quot;Hacksaw Ridge&quot; was the movie of choice. I knew very little about it, other than it came highly recommended. I was accompanied by two others, and they knew even less of the movie.<br />All three of us were absolutely blown away, and days later, we are still talking about it, and how much it touched, and impacted us. That is the sign of an excellent movie - when you are still so very much aware of what it meant to you several days later. When the scenes play in your mind over and over again, and you recapture their meaning. When new insights form and take on even deeper meaning and revelation.<br />AND THIS MOVIE WILL DO JUST THAT.<br />Mel Gibson is one very fine director. I still cannot get over how those war scenes were done - so realstically - as I've never seen before. Depicting the horror, the terror..the absolute fear.<br />I've read the other reviews here, and so far, many of them disappoint me. I don't care to hear anything about Mel Gibson's past. Irrelevant. He directed this film and he was magnificent in ways words cannot describe.<br />Every aspect of this film was done well; and the viewer experience takes you through the journey, culminating in absolute wonderment, inspiration, and awe.<br />It won't leave my mind for awhile, and won't leave my heart EVER.\nReview Title: other than it came highly recommended. I was accompanied by two others\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: In America\nReview Date: 2017/01/03\nStore: Paddy Considine  (Actor),     Samantha Morton  (Actor),     Jim Sheridan  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['From Academy Awad Nominee Jim Sheridan comes this deeply personal and poignant tale of a poor Irish family searching for a better life In America. Through the eyes of their spunky daughters, two anguished parents find hope and the ability to once again believe in love and magic\\x85even amidst the dangers of New York\\'s harrowing Hell\\'s Kitchen. With mesmerizing performances by Samantha Morton and Djimon Hounsou, In America is \"a classic\" (USA Today) you won\\'t ever forget.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Ciaran Cronin, Jason Salkey, Kirsten Sheridan, Jim Sheridan, Neal Jones, Samantha Morton, Emma Bolger, Juan Carlos Hernndez, Nye Heron, Naomi Sheridan, Djimon Hounsou, Sarah Bolger, Randall Carlton, Paddy Considine, Rene MillanCiaran Cronin, Jason Salkey, Kirsten Sheridan, Jim Sheridan, Neal Jones, Samantha Morton, Emma Bolger, Juan Carlos Hernndez, Nye Heron, Naomi Sheridan, Djimon Hounsou, Sarah Bolger, Randall Carlton, Paddy Considine, Rene Millan  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.52 Ounces', 'Director': 'Jim Sheridan', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 11, 2004', 'Actors': 'Paddy Considine, Samantha Morton, Djimon Hounsou, Sarah Bolger, Emma Bolger', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Searchlight', 'Writers': 'Jim Sheridan, Kirsten Sheridan, Naomi Sheridan', 'Number of discs': '1'}\nReview Text: A very nice surprise.<br />Picked a movie from off the shelf, without looking at it, and put in the DVD player to watch, and what I watched, I really enjoyed. After seeing it, I researched on the internet and learned that it is a semi-autobiographical movie; and I also learned that the daughters in the movie really ARE sissters - Irish actresses.<br />The story shows how the love and closeness of a family can get them through anything; and so can determination. I loved the wisdom of Christy, the eldest daughter, who was wise way beyond her years. I loved how the innocence of children broke through the walls and barriers of fear and pain in both the neighbor, and their father.<br />Good movie!\nReview Title: A very nice surprise. Picked a movie from off the shelf\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/03/15\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Daldry'], 'Producers': ['Scott Rudin', 'Robert Fox'], 'Starring': ['Meryl Streep', 'Julianne Moore', 'Nicole Kidman'], 'Studio': ['Paramount Pictures Corp.']}\nReview Text: Pulled it off the shelf and the jacket gave no description of what it was about, so figured with that cast, it was probably good. First, I didn't even recognize Nicole Kidman. Did she create a different nose; or did she later have a nose job? Anyway, irrelevant.<br />Not knowing what the movie was about whatsoever, it was hard to try and piece it together to figure it out. I kept waiting to understand their focal point - their message. Was it about depression? Was it about happiness? Was it about mental illness? Was it about homosexuality? One reviewer wrote that Richard had AIDS. Where in the movie did they indicate that?<br />Very depressing movie, and at the end, I wished I could have &#34;the hours&#34; back I spent watching it.\nReview Title: Depressing\nRating: 2.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user expressed immense enjoyment of their movie selections, emphasizing engaging storylines and powerful performances. They appreciated enlightening themes and the emotional depth experienced throughout various films. The warmth and beauty depicted in narratives resonated deeply, particularly highlighting actors’ relationships and their profound performances. The user noted that certain films were magical and transformative, instilling a sense of purpose and connection, particularly in moments that addressed love and family dynamics. Recommendations were made enthusiastically, showcasing a strong inclination towards uplifting and meaningful narratives that inspire reflection.\n\nNEGATIVE SUMMARY:\nThe user encountered several frustrations with particular films, labeling some as overly predictable or lacking depth. There were specific critiques about scripts that appeared unrealistic or failed to deliver compelling messages, leading to feelings of dissatisfaction. The endings of some movies were notably unsettling, leaving the user wishing for better resolutions. Moreover, a few characters were perceived as underdeveloped or annoying, detracting from the overall enjoyment. There was also disappointment regarding the political tones in a couple of documentaries that seemed to miss the mark in addressing real-life issues authentically.\n\nOVERALL SUMMARY:\nThe user's movie-watching experience reveals a deep appreciation for heartfelt narratives that inspire and evoke emotions, manifested through both positive highlights and frustrations. Many selections were well-received for their engaging storylines and relatable characters, prompting enthusiastic recommendations. In contrast, certain films fell short due to predictability and lack of resolution, generating mixed feelings. The user’s contrasting experiences suggest a desire for more authentic storytelling that resonates on emotional and societal levels, reflecting a nuanced perspective on the art of filmmaking.",
  "target_interaction": {
    "rating": 4.0,
    "title": "I just wanted a movie with an interesting story that would keep me entertained and on my toes that would satisfy, and this one d",
    "text": "I find it very difficult to give reviews on movies, books, and cookbooks. Movies can be all over the map and so relative, with so many variables (as with books), that it is sometimes just not truly 'fair' to give a review. A person can watch the same movie 20 times over their lifetime and glean many different things from the same exact movie depending on where they are at 'at the moment'.<br />I just wanted a movie with an interesting story that would keep me entertained and on my toes that would satisfy, and this one did it - for today. It might not have worked for me at any other time. Who lknows?<br />Funny, I'm not a fan of Ray Liotta, but I actually liked him in this. I think I was more focused on what a nightmare this was for him and truly empathizing for what he was going through in this ordeal than I was at poking holes in the story; or in some of my societal pet peeves and concerns. There are plenty of opportunities and occasions for me to 'air' those.<br />For me - today - it foot the bill.",
    "images": [],
    "asin": "B005J7PBSU",
    "parent_asin": "B005J7PBSU",
    "user_id": "AHCWUVPOC5QNSKMQB2NNGM4XK2UA",
    "timestamp": "2017-04-15 01:01:06",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 3.7,
    "rating_number": 832,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/83ce6e82fde46ee8dac011e7ac52f0780e98453ba110d6e4a98a601a9d222545._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/83ce6e82fde46ee8dac011e7ac52f0780e98453ba110d6e4a98a601a9d222545._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/83ce6e82fde46ee8dac011e7ac52f0780e98453ba110d6e4a98a601a9d222545._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/83ce6e82fde46ee8dac011e7ac52f0780e98453ba110d6e4a98a601a9d222545._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/83ce6e82fde46ee8dac011e7ac52f0780e98453ba110d6e4a98a601a9d222545._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/83ce6e82fde46ee8dac011e7ac52f0780e98453ba110d6e4a98a601a9d222545._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Nudity",
        "violence",
        "alcohol use",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English Dialogue Boost: High",
        "English",
        "English Dialogue Boost: Medium"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Rich Cowan"
      ],
      "Producers": [
        "Steve Anderson",
        "Rich Cowan",
        "J.D. McKee",
        "Sarah Ann Schultz",
        "Daniel Toll",
        "Taye Voye"
      ],
      "Starring": [
        "Ray Liotta",
        "Gisele Fraga",
        "Michael Rodrick"
      ],
      "Studio": [
        "Sony Pictures Home Entertainment"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}