{
  "user_id": "AHPCCNVDHVCOZVVA5JHJOFSWBO2A",
  "summary": "=== Purchase Information ===\nReview Date: 2014/06/15\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['A&E Television Networks']}\nReview Text: I like watching this series....Mr.Meltzer brings in his POV on the subject matter and actually has a couple of people working for him to make the effort of doing their own investigation on the matter in a Non linear and no sides perspective. He calls it as he sees it and he goes to far lengths and very thorough investigation to the people who are experts on the subject matter and none of those people who only had an opinion on the subject.\nReview Title: \"Decoded: One Man;s Honest Opinion\"\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Frontline\nReview Date: 2014/06/15\nCategories: Documentary, Talk Show and Variety, Special Interest\nProduct Description: ['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\nAverage Rating: 3.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nReview Text: I have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\nReview Title: \"I really Love this!\"\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NOVA\nReview Date: 2014/07/08\nCategories: Documentary, Special Interest\nProduct Description: ['Now in its 39th season, NOVA is the most-watched primetime science series on American television, reaching an average of five million viewers weekly.']\nAverage Rating: 4.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Kirk Wolfinger', 'Sarah Holt', 'Gary Glassman', 'Terri Randall', 'Liesl Clark', 'Daniel McCabe', 'Brian Kaufman', 'Doug Hamilton', \"Miles O'Brien\", 'Michael Barnes']}\nReview Text: This is great channel and NOVA would never disappoint you. I have been watching this program through KQED Channel 9 here in the Bay Area and it has never let me down yet program-wise. This channel has a lot of great stories pertaining to real people's lives and I highly recommend this program if you're into documentaries...\nReview Title: \"A great channel if love documentaries\"\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mountain Men\nReview Date: 2014/08/03\nCategories: Unscripted, Western, Special Interest\nProduct Description: [\"It's a race against winter for men who make their living off the land - hunting, fishing and trapping to put food on the table. For Mountain Men, survival is predicated on using ancient skills perfected over hundreds of years. HISTORY follows the lives of four American men and their families as<NL>they strive for the sustenance they need to make it through the harshest season.\"]\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Arabia', 'Mason Gertz', 'Randy Wimberg', 'Andrew Weed', 'Trevor Campbell'], 'Producers': ['Marc Pierce', 'Chris Richardson', 'Bridger Pierce', 'Dawn Fitzgerald', 'Lee Robinson']}\nReview Text: A series that shows real people learning to survive in the wilderness of Alaska and other remote parts of the world. entertaining and you can learn a few tricks if you're planning to live a life like them in the boonies.\nReview Title: Real Life survival\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/03\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Russell Morash', 'David B. Atwood', 'Russell Fortier', 'David Griffiths'], 'Producers': ['Russell Morash', 'Ruth Lockwood'], 'Starring': ['Julia Child'], 'Studio': ['PBS']}\nReview Text: Julia Child basically started all of these cooling show series and this series tell you why she's the pioneer of TV cooking. She made cooking on TV cool and when no one else is doing it. Now there's a TON of these shows which is not really entertaining but reality shows existing only for the ratings. ANY idiot with a frying pan on one hand and a spatula on the other can participate on any cooking show and call themselves chef. Any guy cooking tacos in a taco truck is a chef i suppose...\nReview Title: Julia Child\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/03\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryan Singer'], 'Producers': ['Gilbert Adler', 'Christopher McQuarrie', 'Bryan Singer', 'Ken Kamins', 'Chris Lee', 'John Ottman', 'Dwight C. Schar', 'Mark Shapiro', 'Daniel M. Snyder'], 'Starring': ['Tom Cruise', 'Kenneth Branagh', 'Bill Nighy'], 'Studio': ['MGM - Film']}\nReview Text: Great historical drama. You can only imagine if Lt.Colonel Clause Von Stauffenberg would have succeeded in killing Adolf Hitler if he placed the suit case bomb in the right place where Hitler was sitting in the wolfs lair THEN history could have been made very different and a lot of people could have lived longer and a lot less blood shed. Stauffenberg was a hero on all of this because he knew that Hitler was the beginning and the end of the coming world war when no one else has the sense of learning it and he died trying to prove it to the world. And in the end he was proven correct and if only he succeeded.... (sigh)\nReview Title: You need to watch this and learn from History\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/03\nAverage Rating: 4.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nReview Text: This dude's funny! XD\nReview Title: Watch  this if you needed a good laugh! XD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Neale'], 'Producers': ['Mark Neale', 'Susan Cooper', 'Paul Taublieb', 'Stacy Transou'], 'Starring': [\"Jorg' Lorenzo\", 'Ewan McGregor', 'Valentino Rossi'], 'Studio': ['Media X International', 'Inc.']}\nReview Text: This is what real motorcycle is all about and it doesn't get more real than this! This Documentary movie let's you in on what goes on inside the world of the fastest motorcycles man has ever built: These machines weighs a lit over 300 LBS. But has  an average horsepower of about 200 HP machines and these motorcycles goes to the speeds in excess of 210 MPH! It also let's you in on how does a person compete and on what he goes through to get himself ready for it...the passion the dramas the rivalries of his fellow riders goes elbow to elbow with him on every corners chicanes at more than a 100 MPH their motorcycles are so low on the ground that they're dragging their knees to gauge their angle of attack to feel it! Just about anyone could ride a motorcycle at some certain speeds but not an excess of 200 MPH! To me, this is plain nothing short of committing suicide and i TOO ride a motorcycle but not close as these guys! You may call it brave or just plain Insane or Crazy but these guys are for real and besides not everyone has the kind of talent that these guys possess. This is a MUST WATCH for guys and gals who are adrenaline junkies and wants to know on what goes on in the world of MotoGP racing and I highly recommend this to race fans of any kind as well....\nReview Title: Motorcycles hitting 210 MPH...you need to see this!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nigel Paterson', 'Jasper James'], 'Producers': ['BBC'], 'Starring': ['Kenneth Branagh', 'Stockard Channing', 'Larry Agenbroad']}\nReview Text: This documentary movie is about what happened in the last 200,00 years ago when the saber toothed tiger + other prehistoric beasts were still existing right after the great mass dinosaur mass extinction. It lets peek on what happened after the great meteor that wiped out everything and what kinds of mammals and other creatures started to come out of the wood works globally. I have other documentary movies about post extinction dinosaur stuff and they're quite better...this is OK but I had better\nReview Title: 200,00 year old prehistoric beast and why they went extinct...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Park'], 'Starring': ['Peter Sallis'], 'Studio': ['Aardman Animations']}\nReview Text: I had always loved this British clay-mation stop & go movie series! This series defines on what British comedy is about and I love their sense of humor! This series is also creative enough that it really doesn't matter if your'e old or young because you'll understand the plots and punchlines of this series. It's also very clean and NO elements of anything derogatory or any sexual innuendos knowing that the proper British has their hands on this and theme is very traditional British. You'll love Wallace on how mellow and typical British he is...all he really eats in this series is nothing but cheese and crackers (Really typical British!) and he washes it down with tea. Grommit is one of those very intelligent dogs that doesn't say much because everything that he wants to say, you can tell it by his facial expressions just like a pantomime or even a Mime himself. The series involves both of them their adventures & misadventures and Grommit is always saving Wallace butt because of his zany ideas. Wallace is one of those absent minded geniuses that needs guidance  I would recommend this to anyone who like clean comedy...\nReview Title: You're going to love watching this series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graham Townsley'], 'Starring': ['Lance Lewan'], 'Studio': ['PBS']}\nReview Text: A great documentary series about how we as human beings evolved from an ape like creature 5 million years ago and how we ended up being Homo Sapien or &#34;the thinking man&#34; and how we developed into  becoming the top predator on the face of this earth. It also shows how the scientist, paleontologist and human anthropologist came to understand on how and why we ended the way we are to day. they also figured out when and what place where everything started and where we're going as human beings and what we're evolving into. This is a very fascinating series if you like need to know scientific prof about things that includes us. I have been always fascinated about human evolution since I was a young kid. You need to see this series and I HIGHLY recommend this!\nReview Title: You'll figure out where we all came from if you watch this series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/27\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Joshua Seftel', 'Julia Cort', 'Terri Randall', 'Dean Irwin', 'Robe Imbriano', 'Carla Denly', 'Joseph McMaster', 'Sarah Holt', 'Dana Rae Warren', 'Peter Doyle']}\nReview Text: An amazing scientific documentary series. I love watching this NOVA  it. because of it's trustworthy of the hows and why scientific investigative point of view on topics concerning it. It covers pretty much everything and very understandable explanations....\nReview Title: One very good series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/10/10\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Collins', 'Lydia Tenaglia'], 'Producers': ['Dan Cohen'], 'Starring': ['Anthony Bourdain', 'Gordon Ramsay', 'Tony Shalhoub'], 'Studio': ['GoTraveler']}\nReview Text: If you wanna know on what a chef goes through when he's touring places and you're curious on what they really do then this series is for you. Tony Bourdain takes you to different places on where he goes, what the atmosphere + ambience + the vibe of the places and the people that he encounters with. A well produced series and I'll have to say that I have learned a lot from this series and if I ever have the chance to visit places on where Tony visited then I know exactly what I'll do. There are places that he likes and dislkes, and he tells you on WHY he does and also why he doesn't like it.Tony approahes each place that he viits in an open and honest opinion and at least you'll have an idea of what that place would be. I really liek to see plavces that's completely out of the way and Tony Bourdain + Rachel ray taught me a couple of few very valuable lessons and one of them is: When you go visit a place and you wanna eat great food but on the cheap? ASK A LOCAL RESIDENT and more likely than not they would recommend their favorite place to you. Now you're aeting like a local in a cheap but good place where it's also a favorite! I highly recommend this series.\nReview Title: If you love going places to visit then you'll need to see this series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/04\nAverage Rating: 3.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Neil LaBute'], 'Producers': ['Gordon Bijelonic', 'Reggie Carter', 'Tim Chonacas', 'Michael Corrente', 'Forrest Crisman', 'Daryl Freimark', 'Tim Harms', 'Corey Large', 'Trent Othick'], 'Starring': ['Stanley Tucci', 'Alice Eve']}\nReview Text: This moving is confusing....I don't know if the guy was just there to brutally rape the women or they're just playing a role. I don't get it...\nReview Title: A very confusing movie\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/04\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Doug Lefler'], 'Producers': ['Tarak Ben Ammar', 'Dino De Laurentiis'], 'Starring': ['Colin Firth', 'Ben Kingsley', 'Aishwarya Rai Bachchan'], 'Studio': ['Lionsgate']}\nReview Text: If you're into Ancient History then this movie is for you. I don' know if it's historically accurate and if the timeline is correct but the screenplay is good and the cast of characters is alright...\nReview Title: An OK movie from Ancient History\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shopkins Season 1 (12-Pack) (Styles Will Vary) (Discontinued by manufacturer)\nReview Date: 2015/01/07\nStore: Shopkins\nCategories: Prime Video, Prime Video, TV\nProduct Description: ['Shopkins are the super cute, fun, small characters that live in a BIG shopping world! Shop away with the Shopkins 12 Pack! Collect all of the super-cute Shopkins characters and you might be lucky to find some rare characters too.']\nAverage Rating: 4.6\nProduct Details: {'Product Dimensions': '7.87 x 1.73 x 10.24 inches', 'Item Weight': '3.52 ounces', 'Item model number': '56005', 'Manufacturer recommended age': '5 - 15 years', 'Best Sellers Rank': {'Toys & Games': 409870, \"Kids' Dress Up & Pretend Play\": 23481, 'TV': 116991}, 'Is Discontinued By Manufacturer': 'No', 'Manufacturer': 'Moose Toys'}\nReview Text: I bought this for my Grand niece as a Christmas gift for her and she loved it. Come sin very tiny pieces so you have to be carful because it pose as a choking hazard and not recommended for toddlers.\nReview Title: Little girls will love these!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/10/02\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vic Armstrong'], 'Producers': ['Ed Clydesdale', 'Michael Walker', 'Paul Lalonde'], 'Starring': ['Nicolas Cage', 'Lea Thompson', 'Chad Michael Murray'], 'Studio': ['Phase 4 Films']}\nReview Text: If you're an Evangelical Christian and highly believes in the Rapture then look no further for this movie is all about that. You may think that as an unbeliever that this movie is just pure fictional but I would carefully thread about this movie: &#34;If I believed it then it's not true, I'm still safe because I hoped for something that would come true...If I don't believed it but it came true then I'M SCREWED&#34;-To me , better be safe than sorry. parts of this movie is actually written in the Holy Scriptures that would happen somewhere along in the not too distant future, I just hope than I'm ready. If this is all true then you as an individual wouldn't wanna be here for it would be HELL MANIFESTED ON EARTH for the next 7 years and it would be a Total Open Hunting season for Christians! I would suggest watching this movie so it would give you an Idea on what's about to happen and what you should expect as a Believer in case you got left out here...\nReview Title: You should watch this as a Believer\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/10/05\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nReview Text: One good TV series! This film gives you an idea of how things MIGHT happen if your planet is being invaded by hostile aliens and what you should do to take your home planet back.It has been written and directed nicely by Hollywood directors and screenwriters and the cast are real professionals and some of them are Hollywood material. I highly recommend this TV Series.\nReview Title: You should watch this!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/10/05\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Michael Bay'], 'Producers': ['Michael Bay', 'Ian Bryce', 'Allegra Clegg', 'Tom DeSanto', 'Lorenzo di Bonaventura', 'Brian Goldner', 'Steven Spielberg', 'Mark Vahradian'], 'Starring': ['Shia LaBeouf', 'Megan Fox', 'Josh Duhamel'], 'Studio': ['Dreamworks']}\nReview Text: Good movie but it's as great as the other ones on this series that came before.  Good but not as exciting as the other ones and this one tells on what happens to Optimus Prime when he thought he's all alone on his fight for the Auto-bot's acceptance and clamoring for much needed respect.\nReview Title: It's good but not great as the other ones that came before this\nRating: 3.0\n--------------------------------------------------",
  "reference": "{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['A&E Television Networks']}\nI like watching this series....Mr.Meltzer brings in his POV on the subject matter and actually has a couple of people working for him to make the effort of doing their own investigation on the matter in a Non linear and no sides perspective. He calls it as he sees it and he goes to far lengths and very thorough investigation to the people who are experts on the subject matter and none of those people who only had an opinion on the subject.\n\"Decoded: One Man;s Honest Opinion\"\nFrontline\nDocumentary, Talk Show and Variety, Special Interest\n['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\n{'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nI have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\n\"I really Love this!\"\nNOVA\nDocumentary, Special Interest\n['Now in its 39th season, NOVA is the most-watched primetime science series on American television, reaching an average of five million viewers weekly.']\n{'Subtitles': ['None available'], 'Directors': ['Kirk Wolfinger', 'Sarah Holt', 'Gary Glassman', 'Terri Randall', 'Liesl Clark', 'Daniel McCabe', 'Brian Kaufman', 'Doug Hamilton', \"Miles O'Brien\", 'Michael Barnes']}\nThis is great channel and NOVA would never disappoint you. I have been watching this program through KQED Channel 9 here in the Bay Area and it has never let me down yet program-wise. This channel has a lot of great stories pertaining to real people's lives and I highly recommend this program if you're into documentaries...\n\"A great channel if love documentaries\"\nMountain Men\nUnscripted, Western, Special Interest\n[\"It's a race against winter for men who make their living off the land - hunting, fishing and trapping to put food on the table. For Mountain Men, survival is predicated on using ancient skills perfected over hundreds of years. HISTORY follows the lives of four American men and their families as<NL>they strive for the sustenance they need to make it through the harshest season.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Arabia', 'Mason Gertz', 'Randy Wimberg', 'Andrew Weed', 'Trevor Campbell'], 'Producers': ['Marc Pierce', 'Chris Richardson', 'Bridger Pierce', 'Dawn Fitzgerald', 'Lee Robinson']}\nA series that shows real people learning to survive in the wilderness of Alaska and other remote parts of the world. entertaining and you can learn a few tricks if you're planning to live a life like them in the boonies.\nReal Life survival\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Russell Morash', 'David B. Atwood', 'Russell Fortier', 'David Griffiths'], 'Producers': ['Russell Morash', 'Ruth Lockwood'], 'Starring': ['Julia Child'], 'Studio': ['PBS']}\nJulia Child basically started all of these cooling show series and this series tell you why she's the pioneer of TV cooking. She made cooking on TV cool and when no one else is doing it. Now there's a TON of these shows which is not really entertaining but reality shows existing only for the ratings. ANY idiot with a frying pan on one hand and a spatula on the other can participate on any cooking show and call themselves chef. Any guy cooking tacos in a taco truck is a chef i suppose...\nJulia Child\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryan Singer'], 'Producers': ['Gilbert Adler', 'Christopher McQuarrie', 'Bryan Singer', 'Ken Kamins', 'Chris Lee', 'John Ottman', 'Dwight C. Schar', 'Mark Shapiro', 'Daniel M. Snyder'], 'Starring': ['Tom Cruise', 'Kenneth Branagh', 'Bill Nighy'], 'Studio': ['MGM - Film']}\nGreat historical drama. You can only imagine if Lt.Colonel Clause Von Stauffenberg would have succeeded in killing Adolf Hitler if he placed the suit case bomb in the right place where Hitler was sitting in the wolfs lair THEN history could have been made very different and a lot of people could have lived longer and a lot less blood shed. Stauffenberg was a hero on all of this because he knew that Hitler was the beginning and the end of the coming world war when no one else has the sense of learning it and he died trying to prove it to the world. And in the end he was proven correct and if only he succeeded.... (sigh)\nYou need to watch this and learn from History\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nThis dude's funny! XD\nWatch  this if you needed a good laugh! XD\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Neale'], 'Producers': ['Mark Neale', 'Susan Cooper', 'Paul Taublieb', 'Stacy Transou'], 'Starring': [\"Jorg' Lorenzo\", 'Ewan McGregor', 'Valentino Rossi'], 'Studio': ['Media X International', 'Inc.']}\nThis is what real motorcycle is all about and it doesn't get more real than this! This Documentary movie let's you in on what goes on inside the world of the fastest motorcycles man has ever built: These machines weighs a lit over 300 LBS. But has  an average horsepower of about 200 HP machines and these motorcycles goes to the speeds in excess of 210 MPH! It also let's you in on how does a person compete and on what he goes through to get himself ready for it...the passion the dramas the rivalries of his fellow riders goes elbow to elbow with him on every corners chicanes at more than a 100 MPH their motorcycles are so low on the ground that they're dragging their knees to gauge their angle of attack to feel it! Just about anyone could ride a motorcycle at some certain speeds but not an excess of 200 MPH! To me, this is plain nothing short of committing suicide and i TOO ride a motorcycle but not close as these guys! You may call it brave or just plain Insane or Crazy but these guys are for real and besides not everyone has the kind of talent that these guys possess. This is a MUST WATCH for guys and gals who are adrenaline junkies and wants to know on what goes on in the world of MotoGP racing and I highly recommend this to race fans of any kind as well....\nMotorcycles hitting 210 MPH...you need to see this!\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nigel Paterson', 'Jasper James'], 'Producers': ['BBC'], 'Starring': ['Kenneth Branagh', 'Stockard Channing', 'Larry Agenbroad']}\nThis documentary movie is about what happened in the last 200,00 years ago when the saber toothed tiger + other prehistoric beasts were still existing right after the great mass dinosaur mass extinction. It lets peek on what happened after the great meteor that wiped out everything and what kinds of mammals and other creatures started to come out of the wood works globally. I have other documentary movies about post extinction dinosaur stuff and they're quite better...this is OK but I had better\n200,00 year old prehistoric beast and why they went extinct...\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Park'], 'Starring': ['Peter Sallis'], 'Studio': ['Aardman Animations']}\nI had always loved this British clay-mation stop & go movie series! This series defines on what British comedy is about and I love their sense of humor! This series is also creative enough that it really doesn't matter if your'e old or young because you'll understand the plots and punchlines of this series. It's also very clean and NO elements of anything derogatory or any sexual innuendos knowing that the proper British has their hands on this and theme is very traditional British. You'll love Wallace on how mellow and typical British he is...all he really eats in this series is nothing but cheese and crackers (Really typical British!) and he washes it down with tea. Grommit is one of those very intelligent dogs that doesn't say much because everything that he wants to say, you can tell it by his facial expressions just like a pantomime or even a Mime himself. The series involves both of them their adventures & misadventures and Grommit is always saving Wallace butt because of his zany ideas. Wallace is one of those absent minded geniuses that needs guidance  I would recommend this to anyone who like clean comedy...\nYou're going to love watching this series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graham Townsley'], 'Starring': ['Lance Lewan'], 'Studio': ['PBS']}\nA great documentary series about how we as human beings evolved from an ape like creature 5 million years ago and how we ended up being Homo Sapien or &#34;the thinking man&#34; and how we developed into  becoming the top predator on the face of this earth. It also shows how the scientist, paleontologist and human anthropologist came to understand on how and why we ended the way we are to day. they also figured out when and what place where everything started and where we're going as human beings and what we're evolving into. This is a very fascinating series if you like need to know scientific prof about things that includes us. I have been always fascinated about human evolution since I was a young kid. You need to see this series and I HIGHLY recommend this!\nYou'll figure out where we all came from if you watch this series!\n{'Subtitles': ['None available'], 'Directors': ['Joshua Seftel', 'Julia Cort', 'Terri Randall', 'Dean Irwin', 'Robe Imbriano', 'Carla Denly', 'Joseph McMaster', 'Sarah Holt', 'Dana Rae Warren', 'Peter Doyle']}\nAn amazing scientific documentary series. I love watching this NOVA  it. because of it's trustworthy of the hows and why scientific investigative point of view on topics concerning it. It covers pretty much everything and very understandable explanations....\nOne very good series\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Collins', 'Lydia Tenaglia'], 'Producers': ['Dan Cohen'], 'Starring': ['Anthony Bourdain', 'Gordon Ramsay', 'Tony Shalhoub'], 'Studio': ['GoTraveler']}\nIf you wanna know on what a chef goes through when he's touring places and you're curious on what they really do then this series is for you. Tony Bourdain takes you to different places on where he goes, what the atmosphere + ambience + the vibe of the places and the people that he encounters with. A well produced series and I'll have to say that I have learned a lot from this series and if I ever have the chance to visit places on where Tony visited then I know exactly what I'll do. There are places that he likes and dislkes, and he tells you on WHY he does and also why he doesn't like it.Tony approahes each place that he viits in an open and honest opinion and at least you'll have an idea of what that place would be. I really liek to see plavces that's completely out of the way and Tony Bourdain + Rachel ray taught me a couple of few very valuable lessons and one of them is: When you go visit a place and you wanna eat great food but on the cheap? ASK A LOCAL RESIDENT and more likely than not they would recommend their favorite place to you. Now you're aeting like a local in a cheap but good place where it's also a favorite! I highly recommend this series.\nIf you love going places to visit then you'll need to see this series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Neil LaBute'], 'Producers': ['Gordon Bijelonic', 'Reggie Carter', 'Tim Chonacas', 'Michael Corrente', 'Forrest Crisman', 'Daryl Freimark', 'Tim Harms', 'Corey Large', 'Trent Othick'], 'Starring': ['Stanley Tucci', 'Alice Eve']}\nThis moving is confusing....I don't know if the guy was just there to brutally rape the women or they're just playing a role. I don't get it...\nA very confusing movie\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Doug Lefler'], 'Producers': ['Tarak Ben Ammar', 'Dino De Laurentiis'], 'Starring': ['Colin Firth', 'Ben Kingsley', 'Aishwarya Rai Bachchan'], 'Studio': ['Lionsgate']}\nIf you're into Ancient History then this movie is for you. I don' know if it's historically accurate and if the timeline is correct but the screenplay is good and the cast of characters is alright...\nAn OK movie from Ancient History\nShopkins Season 1 (12-Pack) (Styles Will Vary) (Discontinued by manufacturer)\nShopkins\nPrime Video, Prime Video, TV\n['Shopkins are the super cute, fun, small characters that live in a BIG shopping world! Shop away with the Shopkins 12 Pack! Collect all of the super-cute Shopkins characters and you might be lucky to find some rare characters too.']\n{'Product Dimensions': '7.87 x 1.73 x 10.24 inches', 'Item Weight': '3.52 ounces', 'Item model number': '56005', 'Manufacturer recommended age': '5 - 15 years', 'Best Sellers Rank': {'Toys & Games': 409870, \"Kids' Dress Up & Pretend Play\": 23481, 'TV': 116991}, 'Is Discontinued By Manufacturer': 'No', 'Manufacturer': 'Moose Toys'}\nI bought this for my Grand niece as a Christmas gift for her and she loved it. Come sin very tiny pieces so you have to be carful because it pose as a choking hazard and not recommended for toddlers.\nLittle girls will love these!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vic Armstrong'], 'Producers': ['Ed Clydesdale', 'Michael Walker', 'Paul Lalonde'], 'Starring': ['Nicolas Cage', 'Lea Thompson', 'Chad Michael Murray'], 'Studio': ['Phase 4 Films']}\nIf you're an Evangelical Christian and highly believes in the Rapture then look no further for this movie is all about that. You may think that as an unbeliever that this movie is just pure fictional but I would carefully thread about this movie: &#34;If I believed it then it's not true, I'm still safe because I hoped for something that would come true...If I don't believed it but it came true then I'M SCREWED&#34;-To me , better be safe than sorry. parts of this movie is actually written in the Holy Scriptures that would happen somewhere along in the not too distant future, I just hope than I'm ready. If this is all true then you as an individual wouldn't wanna be here for it would be HELL MANIFESTED ON EARTH for the next 7 years and it would be a Total Open Hunting season for Christians! I would suggest watching this movie so it would give you an Idea on what's about to happen and what you should expect as a Believer in case you got left out here...\nYou should watch this as a Believer\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nOne good TV series! This film gives you an idea of how things MIGHT happen if your planet is being invaded by hostile aliens and what you should do to take your home planet back.It has been written and directed nicely by Hollywood directors and screenwriters and the cast are real professionals and some of them are Hollywood material. I highly recommend this TV Series.\nYou should watch this!\n{'Subtitles': ['None available'], 'Directors': ['Michael Bay'], 'Producers': ['Michael Bay', 'Ian Bryce', 'Allegra Clegg', 'Tom DeSanto', 'Lorenzo di Bonaventura', 'Brian Goldner', 'Steven Spielberg', 'Mark Vahradian'], 'Starring': ['Shia LaBeouf', 'Megan Fox', 'Josh Duhamel'], 'Studio': ['Dreamworks']}\nGood movie but it's as great as the other ones on this series that came before.  Good but not as exciting as the other ones and this one tells on what happens to Optimus Prime when he thought he's all alone on his fight for the Auto-bot's acceptance and clamoring for much needed respect.\nIt's good but not great as the other ones that came before this",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nReview Date: 2014/06/15\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['A&E Television Networks']}\nReview Text: I like watching this series....Mr.Meltzer brings in his POV on the subject matter and actually has a couple of people working for him to make the effort of doing their own investigation on the matter in a Non linear and no sides perspective. He calls it as he sees it and he goes to far lengths and very thorough investigation to the people who are experts on the subject matter and none of those people who only had an opinion on the subject.\nReview Title: \"Decoded: One Man;s Honest Opinion\"\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Frontline\nReview Date: 2014/06/15\nCategories: Documentary, Talk Show and Variety, Special Interest\nProduct Description: ['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\nAverage Rating: 3.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nReview Text: I have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\nReview Title: \"I really Love this!\"\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NOVA\nReview Date: 2014/07/08\nCategories: Documentary, Special Interest\nProduct Description: ['Now in its 39th season, NOVA is the most-watched primetime science series on American television, reaching an average of five million viewers weekly.']\nAverage Rating: 4.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Kirk Wolfinger', 'Sarah Holt', 'Gary Glassman', 'Terri Randall', 'Liesl Clark', 'Daniel McCabe', 'Brian Kaufman', 'Doug Hamilton', \"Miles O'Brien\", 'Michael Barnes']}\nReview Text: This is great channel and NOVA would never disappoint you. I have been watching this program through KQED Channel 9 here in the Bay Area and it has never let me down yet program-wise. This channel has a lot of great stories pertaining to real people's lives and I highly recommend this program if you're into documentaries...\nReview Title: \"A great channel if love documentaries\"\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mountain Men\nReview Date: 2014/08/03\nCategories: Unscripted, Western, Special Interest\nProduct Description: [\"It's a race against winter for men who make their living off the land - hunting, fishing and trapping to put food on the table. For Mountain Men, survival is predicated on using ancient skills perfected over hundreds of years. HISTORY follows the lives of four American men and their families as<NL>they strive for the sustenance they need to make it through the harshest season.\"]\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Arabia', 'Mason Gertz', 'Randy Wimberg', 'Andrew Weed', 'Trevor Campbell'], 'Producers': ['Marc Pierce', 'Chris Richardson', 'Bridger Pierce', 'Dawn Fitzgerald', 'Lee Robinson']}\nReview Text: A series that shows real people learning to survive in the wilderness of Alaska and other remote parts of the world. entertaining and you can learn a few tricks if you're planning to live a life like them in the boonies.\nReview Title: Real Life survival\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/03\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Russell Morash', 'David B. Atwood', 'Russell Fortier', 'David Griffiths'], 'Producers': ['Russell Morash', 'Ruth Lockwood'], 'Starring': ['Julia Child'], 'Studio': ['PBS']}\nReview Text: Julia Child basically started all of these cooling show series and this series tell you why she's the pioneer of TV cooking. She made cooking on TV cool and when no one else is doing it. Now there's a TON of these shows which is not really entertaining but reality shows existing only for the ratings. ANY idiot with a frying pan on one hand and a spatula on the other can participate on any cooking show and call themselves chef. Any guy cooking tacos in a taco truck is a chef i suppose...\nReview Title: Julia Child\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/03\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryan Singer'], 'Producers': ['Gilbert Adler', 'Christopher McQuarrie', 'Bryan Singer', 'Ken Kamins', 'Chris Lee', 'John Ottman', 'Dwight C. Schar', 'Mark Shapiro', 'Daniel M. Snyder'], 'Starring': ['Tom Cruise', 'Kenneth Branagh', 'Bill Nighy'], 'Studio': ['MGM - Film']}\nReview Text: Great historical drama. You can only imagine if Lt.Colonel Clause Von Stauffenberg would have succeeded in killing Adolf Hitler if he placed the suit case bomb in the right place where Hitler was sitting in the wolfs lair THEN history could have been made very different and a lot of people could have lived longer and a lot less blood shed. Stauffenberg was a hero on all of this because he knew that Hitler was the beginning and the end of the coming world war when no one else has the sense of learning it and he died trying to prove it to the world. And in the end he was proven correct and if only he succeeded.... (sigh)\nReview Title: You need to watch this and learn from History\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/03\nAverage Rating: 4.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nReview Text: This dude's funny! XD\nReview Title: Watch  this if you needed a good laugh! XD\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Neale'], 'Producers': ['Mark Neale', 'Susan Cooper', 'Paul Taublieb', 'Stacy Transou'], 'Starring': [\"Jorg' Lorenzo\", 'Ewan McGregor', 'Valentino Rossi'], 'Studio': ['Media X International', 'Inc.']}\nReview Text: This is what real motorcycle is all about and it doesn't get more real than this! This Documentary movie let's you in on what goes on inside the world of the fastest motorcycles man has ever built: These machines weighs a lit over 300 LBS. But has  an average horsepower of about 200 HP machines and these motorcycles goes to the speeds in excess of 210 MPH! It also let's you in on how does a person compete and on what he goes through to get himself ready for it...the passion the dramas the rivalries of his fellow riders goes elbow to elbow with him on every corners chicanes at more than a 100 MPH their motorcycles are so low on the ground that they're dragging their knees to gauge their angle of attack to feel it! Just about anyone could ride a motorcycle at some certain speeds but not an excess of 200 MPH! To me, this is plain nothing short of committing suicide and i TOO ride a motorcycle but not close as these guys! You may call it brave or just plain Insane or Crazy but these guys are for real and besides not everyone has the kind of talent that these guys possess. This is a MUST WATCH for guys and gals who are adrenaline junkies and wants to know on what goes on in the world of MotoGP racing and I highly recommend this to race fans of any kind as well....\nReview Title: Motorcycles hitting 210 MPH...you need to see this!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nigel Paterson', 'Jasper James'], 'Producers': ['BBC'], 'Starring': ['Kenneth Branagh', 'Stockard Channing', 'Larry Agenbroad']}\nReview Text: This documentary movie is about what happened in the last 200,00 years ago when the saber toothed tiger + other prehistoric beasts were still existing right after the great mass dinosaur mass extinction. It lets peek on what happened after the great meteor that wiped out everything and what kinds of mammals and other creatures started to come out of the wood works globally. I have other documentary movies about post extinction dinosaur stuff and they're quite better...this is OK but I had better\nReview Title: 200,00 year old prehistoric beast and why they went extinct...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Park'], 'Starring': ['Peter Sallis'], 'Studio': ['Aardman Animations']}\nReview Text: I had always loved this British clay-mation stop & go movie series! This series defines on what British comedy is about and I love their sense of humor! This series is also creative enough that it really doesn't matter if your'e old or young because you'll understand the plots and punchlines of this series. It's also very clean and NO elements of anything derogatory or any sexual innuendos knowing that the proper British has their hands on this and theme is very traditional British. You'll love Wallace on how mellow and typical British he is...all he really eats in this series is nothing but cheese and crackers (Really typical British!) and he washes it down with tea. Grommit is one of those very intelligent dogs that doesn't say much because everything that he wants to say, you can tell it by his facial expressions just like a pantomime or even a Mime himself. The series involves both of them their adventures & misadventures and Grommit is always saving Wallace butt because of his zany ideas. Wallace is one of those absent minded geniuses that needs guidance  I would recommend this to anyone who like clean comedy...\nReview Title: You're going to love watching this series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graham Townsley'], 'Starring': ['Lance Lewan'], 'Studio': ['PBS']}\nReview Text: A great documentary series about how we as human beings evolved from an ape like creature 5 million years ago and how we ended up being Homo Sapien or &#34;the thinking man&#34; and how we developed into  becoming the top predator on the face of this earth. It also shows how the scientist, paleontologist and human anthropologist came to understand on how and why we ended the way we are to day. they also figured out when and what place where everything started and where we're going as human beings and what we're evolving into. This is a very fascinating series if you like need to know scientific prof about things that includes us. I have been always fascinated about human evolution since I was a young kid. You need to see this series and I HIGHLY recommend this!\nReview Title: You'll figure out where we all came from if you watch this series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/08/27\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Joshua Seftel', 'Julia Cort', 'Terri Randall', 'Dean Irwin', 'Robe Imbriano', 'Carla Denly', 'Joseph McMaster', 'Sarah Holt', 'Dana Rae Warren', 'Peter Doyle']}\nReview Text: An amazing scientific documentary series. I love watching this NOVA  it. because of it's trustworthy of the hows and why scientific investigative point of view on topics concerning it. It covers pretty much everything and very understandable explanations....\nReview Title: One very good series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/10/10\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Collins', 'Lydia Tenaglia'], 'Producers': ['Dan Cohen'], 'Starring': ['Anthony Bourdain', 'Gordon Ramsay', 'Tony Shalhoub'], 'Studio': ['GoTraveler']}\nReview Text: If you wanna know on what a chef goes through when he's touring places and you're curious on what they really do then this series is for you. Tony Bourdain takes you to different places on where he goes, what the atmosphere + ambience + the vibe of the places and the people that he encounters with. A well produced series and I'll have to say that I have learned a lot from this series and if I ever have the chance to visit places on where Tony visited then I know exactly what I'll do. There are places that he likes and dislkes, and he tells you on WHY he does and also why he doesn't like it.Tony approahes each place that he viits in an open and honest opinion and at least you'll have an idea of what that place would be. I really liek to see plavces that's completely out of the way and Tony Bourdain + Rachel ray taught me a couple of few very valuable lessons and one of them is: When you go visit a place and you wanna eat great food but on the cheap? ASK A LOCAL RESIDENT and more likely than not they would recommend their favorite place to you. Now you're aeting like a local in a cheap but good place where it's also a favorite! I highly recommend this series.\nReview Title: If you love going places to visit then you'll need to see this series!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/04\nAverage Rating: 3.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Neil LaBute'], 'Producers': ['Gordon Bijelonic', 'Reggie Carter', 'Tim Chonacas', 'Michael Corrente', 'Forrest Crisman', 'Daryl Freimark', 'Tim Harms', 'Corey Large', 'Trent Othick'], 'Starring': ['Stanley Tucci', 'Alice Eve']}\nReview Text: This moving is confusing....I don't know if the guy was just there to brutally rape the women or they're just playing a role. I don't get it...\nReview Title: A very confusing movie\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/04\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Doug Lefler'], 'Producers': ['Tarak Ben Ammar', 'Dino De Laurentiis'], 'Starring': ['Colin Firth', 'Ben Kingsley', 'Aishwarya Rai Bachchan'], 'Studio': ['Lionsgate']}\nReview Text: If you're into Ancient History then this movie is for you. I don' know if it's historically accurate and if the timeline is correct but the screenplay is good and the cast of characters is alright...\nReview Title: An OK movie from Ancient History\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shopkins Season 1 (12-Pack) (Styles Will Vary) (Discontinued by manufacturer)\nReview Date: 2015/01/07\nStore: Shopkins\nCategories: Prime Video, Prime Video, TV\nProduct Description: ['Shopkins are the super cute, fun, small characters that live in a BIG shopping world! Shop away with the Shopkins 12 Pack! Collect all of the super-cute Shopkins characters and you might be lucky to find some rare characters too.']\nAverage Rating: 4.6\nProduct Details: {'Product Dimensions': '7.87 x 1.73 x 10.24 inches', 'Item Weight': '3.52 ounces', 'Item model number': '56005', 'Manufacturer recommended age': '5 - 15 years', 'Best Sellers Rank': {'Toys & Games': 409870, \"Kids' Dress Up & Pretend Play\": 23481, 'TV': 116991}, 'Is Discontinued By Manufacturer': 'No', 'Manufacturer': 'Moose Toys'}\nReview Text: I bought this for my Grand niece as a Christmas gift for her and she loved it. Come sin very tiny pieces so you have to be carful because it pose as a choking hazard and not recommended for toddlers.\nReview Title: Little girls will love these!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/10/02\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vic Armstrong'], 'Producers': ['Ed Clydesdale', 'Michael Walker', 'Paul Lalonde'], 'Starring': ['Nicolas Cage', 'Lea Thompson', 'Chad Michael Murray'], 'Studio': ['Phase 4 Films']}\nReview Text: If you're an Evangelical Christian and highly believes in the Rapture then look no further for this movie is all about that. You may think that as an unbeliever that this movie is just pure fictional but I would carefully thread about this movie: &#34;If I believed it then it's not true, I'm still safe because I hoped for something that would come true...If I don't believed it but it came true then I'M SCREWED&#34;-To me , better be safe than sorry. parts of this movie is actually written in the Holy Scriptures that would happen somewhere along in the not too distant future, I just hope than I'm ready. If this is all true then you as an individual wouldn't wanna be here for it would be HELL MANIFESTED ON EARTH for the next 7 years and it would be a Total Open Hunting season for Christians! I would suggest watching this movie so it would give you an Idea on what's about to happen and what you should expect as a Believer in case you got left out here...\nReview Title: You should watch this as a Believer\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/10/05\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nReview Text: One good TV series! This film gives you an idea of how things MIGHT happen if your planet is being invaded by hostile aliens and what you should do to take your home planet back.It has been written and directed nicely by Hollywood directors and screenwriters and the cast are real professionals and some of them are Hollywood material. I highly recommend this TV Series.\nReview Title: You should watch this!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/10/05\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Michael Bay'], 'Producers': ['Michael Bay', 'Ian Bryce', 'Allegra Clegg', 'Tom DeSanto', 'Lorenzo di Bonaventura', 'Brian Goldner', 'Steven Spielberg', 'Mark Vahradian'], 'Starring': ['Shia LaBeouf', 'Megan Fox', 'Josh Duhamel'], 'Studio': ['Dreamworks']}\nReview Text: Good movie but it's as great as the other ones on this series that came before.  Good but not as exciting as the other ones and this one tells on what happens to Optimus Prime when he thought he's all alone on his fight for the Auto-bot's acceptance and clamoring for much needed respect.\nReview Title: It's good but not great as the other ones that came before this\nRating: 3.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user expresses a strong appreciation for several documentary series, highlighting their thorough investigations and engaging storytelling. Many products rated highly feature authentic content that invites viewers into different perspectives and experiences. The user enjoys programs that provide honest discussions on complex issues and values the educational aspect of shows exploring history and science. Humor is also a highlight, with comedy series receiving top praise for their cleverness and universal appeal. The positive ratings reinforce a consistent enjoyment of quality production and insightful narratives across various genres.\n\nNEGATIVE SUMMARY:\nDespite many positive experiences, the user notes a few disappointments with certain products. Some offerings were met with criticism due to confusing plots that led to dissatisfaction, while others were perceived as falling short of expectations in terms of excitement or originality compared to prior installments. In particular, certain historical documentaries failed to meet the user’s anticipations, feeling that they lacked depth or clarity. Additionally, a children's product posed safety concerns due to its small parts, indicating a caution towards products for younger audiences.\n\nOVERALL SUMMARY:\nThe user's experiences reveal a deep appreciation for quality documentary series rich in educational content and storytelling, consistently rating many highly. This reflects a trend towards valuing authenticity and insight in viewing choices. However, alongside the positive feedback, there are notable negatives that center around confusing narratives in films and concerns about safety in children's products. Overall, the user’s experiences reflect a balance of enjoying impactful content while encountering some dissatisfaction and caution with specific titles.",
  "target_interaction": {
    "rating": 5.0,
    "title": "A Great Superhero Mini series!",
    "text": "Great super hero mini series. It tells about on how a scrawny teenager got unbelievable superhuman powers from a mere accident and how that teenager is using his new found superhuman abilities for the betterment of people. The thing is? There are also many more like this kid BUT those people are using it for selfish and criminal reasons and this kid is trying his very best to corral them and serve them justice. A MUST WATCH if you happen to like superhero stuff!",
    "images": [],
    "asin": "B014XDCNYA",
    "parent_asin": "B014XDCNYA",
    "user_id": "AHPCCNVDHVCOZVVA5JHJOFSWBO2A",
    "timestamp": "2017-10-22 06:57:47.147000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 3097,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fd93be04409d20983aff4c5df22e88234339730460b2c82d513d7f01d4c15e8e._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fd93be04409d20983aff4c5df22e88234339730460b2c82d513d7f01d4c15e8e._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fd93be04409d20983aff4c5df22e88234339730460b2c82d513d7f01d4c15e8e._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fd93be04409d20983aff4c5df22e88234339730460b2c82d513d7f01d4c15e8e._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fd93be04409d20983aff4c5df22e88234339730460b2c82d513d7f01d4c15e8e._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/fd93be04409d20983aff4c5df22e88234339730460b2c82d513d7f01d4c15e8e._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Producers": [
        "Not Specified"
      ],
      "Starring": [
        "Grant Gustin",
        "Candice Patton",
        "Danielle Panabaker"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}