{
  "user_id": "AHC4YDJ5WS3MDCNSKMJTOZRKZWPA",
  "summary": "=== Purchase Information ===\nProduct Title: Precious [DVD]\nReview Date: 2015/03/11\nStore: Gabourey Sidibe  (Actor),     Mo'Nique  (Actor),     Lee Daniels  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Set in Harlem in 1987, it is the story of Claireece “Precious” Jones, a sixteen-year-old African-American girl born into a life no one would want. She’s pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, a poisonously angry woman who abuses her emotionally and physically. School is a place of chaos, and Precious has reached the ninth grade with good marks and an awful secret: she can neither read nor write. Precious may sometimes be down, but she is never out. Beneath her impassive expression is a watchful, curious young woman with an inchoate but unshakeable sense that other possibilities exist for her. Threatened with expulsion, Precious is offered the chance to transfer to an alternative school, Each One/Teach One. Precious doesn’t know the meaning of “alternative,” but her instincts tell her this is the chance she has been waiting for. In the literacy workshop taught by the patient yet firm Ms. Rain, Precious begins a journey that', 'Amazon.com', 'Not every movie can survive the kind of hype--multiple awards at Sundance and other festivals, rapturous reviews, nominated for six Academy Awards and winner of two, for Best Supporting Actress and Best Screenplay--that greeted the release of', 'Precious: Based on the Novel \"Push\" by Sapphire', \", but this extraordinary piece of work is more than up to the task. What's particularly notable about the film's success and acclaim is that in the beginning, at least, it presents one of the grimmest scenarios imaginable. The scene is Harlem, New York, in 1987. Teenager Clarisse Precious Jones (played by newcomer Gabourey Sibide in an absolutely fearless performance) is dirt poor, morbidly obese, semiliterate, and pregnant for the second time--both courtesy of her own father (the first baby was born with Down syndrome). Her home life is several levels below Hell, as her bitter, vengeful welfare mother, Mary (Mo'Nique, in a role that has generated legitimate Oscar® buzz), abuses her both physically and otherwise (telling Precious she should have aborted her is only the worst of a relentless flood of insults and vitriol). Yet somehow, the young woman still has hopes and dreams (depicted in a series of delightful fantasy sequences). She enrolls in an alternative school, where a young teacher (Paula Patton) takes her under her wing and even into her home, and visits a social worker (an excellent Mariah Carey; fellow pop star Lenny Kravitz is also effective as a male nurse) who further helps bring Precious out of the darkness. Incredibly, Precious's circumstances deteriorate even more before showing the slightest sign of improvement, and a climactic confrontation with her mother is one of the more wrenching scenes in recent memory. But against all odds, director Lee Daniels, screenwriter Geoffrey Fletcher (working from Sapphire's novel), and especially the wondrously affecting Sibide have managed to make\", 'Precious', 'a film that will lift the viewer far higher up that one might ever have thought possible.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Lee Daniels, Mo'Nique, Gabourey Sidibe\", 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT27239DVD', 'Director': 'Lee Daniels', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'March 9, 2010', 'Actors': \"Gabourey Sidibe, Mo'Nique\", 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: A new perspective, thought-provoking!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Definitely, Maybe (Widescreen)\nReview Date: 2015/03/11\nStore: Ryan Reynolds  (Actor),     Kevin Kline  (Actor),     Adam Brooks  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', \"From the makers of Notting Hill and Love Actually comes the charming and irresistibly funny romantic comedy Definitely, Maybe. When Will (Ryan Reynolds) decides to tell his daughter (Abigail Breslin) the story of how he met her mother, he discovers that a second look at the past might also give him a second chance at the future. Co-starring Elizabeth Banks, Rachel Weisz and Isla Fisher, it's the heartwarming story that makes you realize it's definitely never too late to go back…and maybe find a happy ending.Bonus Content:\", 'Deleted Scenes', 'Deleted Scenes', 'Creating a Romance: Brought to You by Volkswagen', 'Creating a Romance: Brought to You by Volkswagen', 'The Changing Times of Definitely, Maybe', 'The Changing Times of Definitely, Maybe', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Amazon.com', 'A romantic comedy that begins with a discussion about sex education and ends with a bit of an unexpected twist,', 'Definitely, Maybe', 'focuses on an engaging father and his 10-year-old daughter. She is curious about the women her dad loved prior to marrying (and separating from) her mother. Instead of telling her, \"None of your business,\" he decides to tell her about them... Sort of. Will is played by Ryan Reynolds and his precocious daughter Maya is adroitly portrayed by Abigail Breslin (', 'Little Miss Sunshine', '). Will figures out a way to tell Maya about his most meaningful relationships in a PG manner that also is interactive for her (Or as she describes it, \"a love story mystery!\"). Changing a few of their characteristics and disguising their names, Will tells her about three exceptional women and Maya tries to deduce which one became her mom. Was it Emily (Elizabeth Banks), the wholesome Midwestern girl afraid of the big city; Summer (Rachel Weisz), the exotic journalist; or April (Isla Fisher), the rebel with a cause? Hearing about all these women, Maya asks, \"What\\'s the boy word for slut?\" Spanning 15 years, back to when Will was an idealistic young man with the hopes of one day becoming president of the United States, the film has a nice light touch and deals with father-daughter bonding issues in a unique, if not completely realistic manner. Reynolds is a genial but bland leading man, but the women--including young Breslin--more than hold their own in this fun film. --', 'Jae-Ha Kim', 'Get to Know the Girlfriends From', 'Definitely, Maybe', 'Elizabeth Banks (Emily)', 'Isla Fisher (April)', 'Rachel Weisz (Summer)', 'Beyond', 'Definitely, Maybe', 'on DVD', 'More From Ryan Reynolds', 'Father Daughter Essentials', 'More Romantic Comedies', 'Stills from', 'Definitely, Maybe', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Abigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth BanksAbigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth Banks  See more', 'Initial release date': '2008-06-24', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MHV61100526DVD', 'Director': 'Adam Brooks', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'June 24, 2008', 'Actors': 'Ryan Reynolds, Kevin Kline, Rachel Weisz, Elizabeth Banks, Isla Fisher', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: Just for fun...\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stand and Deliver\nReview Date: 2015/03/11\nStore: Ramon Menendez  (Director, Writer),     Edward James Olmos  (Actor),     Lou Diamond Phillips  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Edward James Olmos's Oscar-nominated performance energizes this true-life story of a Los Angeles high school teacher who drives his students on to excellence at calculus.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Documentary/Biography', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'Lou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia ParisLou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia Paris  See more', 'Language': 'English (Mono), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.92 Ounces', 'Item model number': '157968', 'Director': 'Ramon Menendez', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'June 8, 2010', 'Actors': 'Edward James Olmos, Lou Diamond Phillips, Rosana De Soto, Andy Garcia, Estelle Harris', 'Producers': 'Lindsay Law, Tom Musca', 'Studio': 'WarnerBrothers', 'Writers': 'Ramon Menendez, Tom Musca', 'Number of discs': '1'}\nReview Text: I showed it to my Educational students in college...excellent!\nReview Title: excellent!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Finding Vivian Maier\nReview Date: 2015/03/11\nStore: Vivian Maier  (Actor),     John Maloof  (Director),     Charlie Siskel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Who is Vivian Maier? Now considered one of the 20th century's greatest street photographers, Vivian Maier was a mysterious nanny who secretly took over 100,000 photographs that went unseen during her lifetime. Since buying her work by chance at auction, amateur historian John Maloof has crusaded to put this prolific photographer in the history books. Maier's strange and riveting life and art are revealed through never-before-seen photographs, films, and interviews with dozens who thought they knew her.\"]\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '28929892', 'Director': 'John Maloof, Charlie Siskel', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 29, 2014', 'Actors': 'Vivian Maier', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: So interesting!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: WILD\nReview Date: 2015/05/06\nStore: Reese Witherspoon  (Actor),     Laura Dern  (Actor),     Jean-Marc Vallee  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Academy Award Winner Reese Witherspoon stars in this inspirational true story from the director of Dallas Buyers Club and based on the best-selling book by Cheryl Strayed. After years of reckless behavior and being haunted by memories of her mother Bobbi (Academy Award Nominee Laura Dern), Cheryl (Witherspoon) makes a rash decision to embark on a challenging trek across the Pacific Crest Trail. With absolutely no experience, she sets out to hike more than a thousand miles all on her own - in what becomes a remarkable journey of self-discovery and redemption that strengthens and ultimately heals her.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffmann, Keene McRae, Mo McRae, Leigh Parker, Ted De Chatelet, Laura DernKevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffm…  See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2297160', 'Director': 'Jean-Marc Vallee', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'March 31, 2015', 'Actors': 'Reese Witherspoon, Laura Dern, Thomas Sadoski, Michiel Huisman, Gaby Hoffmann', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Nick Hornby', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Interesting film\nReview Title: Interesting\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 20 Feet from Stardom\nReview Date: 2015/05/06\nStore: Darlene Love  (Actor),     Merry Clayton  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\nProduct Description: ['Product Description', 'Wat zou popmuziek zijn zonder riffs, refreinen en harmonieën van achtergrondzangers en zangeressen? Hoewel deze muzikanten vrijwel altijd net buiten de spotlights blijven staan, zijn het juist hun stemmen die ontelbare nummers legendarisch hebben gemaakt. TWENTY FEET FROM STARDOM belicht het enigszins verborgen bestaan van de achtergrondzangeressen van wereldsterren als Bruce Springsteen, Stevie Wonder en Mick Jagger. Ze vertellen waarom ze gekozen hebben voor het leven in de schaduw van een wereldster en of de droom om ooit naar de voorgrond te treden ooit heeft bestaan.', 'Review', 'While the lead singers in rock, pop, and R&B are the ones who get the glory, knowledgeable music fans will tell you the backing vocalists often add the touches that make a performance truly memorable, and though many backup singers have the respect of their peers in the music business, they\\'re all but unknown to the average listener. Twenty Feet From Stardom pays homage to some of these unsung heroes, including Darlene Love (the un-credited lead voice on some of Phil Spector\\'s most memorable productions of the 1960s), Merry Clayton (who contributed a striking vocal cameo on the Rolling Stones\\' \"Gimme Shelter\", Lisa Fischer (who has appeared on albums by Sting, Tina Turner, and Aretha Franklin, as well as touring with the Rolling Stones), and the Waters Family (they sang with Michael Jackson on the album Thriller and lent their voices to the films The Lion King and Avatar).']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '28928250', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 14, 2014', 'Actors': 'Darlene Love, Merry Clayton, Lisa Fischer, Judith Hill', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great!\nReview Title: Great!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Capote\nReview Date: 2015/10/15\nStore: Philip Seymour Hoffman  (Actor),     Catherine Keener  (Actor),     Bennett Miller  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Biography\nProduct Description: ['In November, 1959, the shocking murder of a smalltown Kansas family captures the imagination of Truman Capote (Philip Seymour Hoffman), famed author of \"Breakfast at Tiffany\\'s.\" With his childhood friend Harper Lee (Catherine Keener), writer of the soon-to-be published \"To Kill a Mockingbird,\" Capote sets out to investigate, winning over the locals despite his flamboyant appearance and style. When he forms a bond with the killers and their execution date nears, the writing of \"In Cold Blood,\" a book that will change the course of American Literature, takes a drastic toll on Capote, changing him in ways he never imagined. Stellar performances from Hoffman and Keener, as well as Academy Award(r) winner Chris Cooper (Adaptation) are why critics are calling CAPOTE a \"must-see movie.\"']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'AC-3, Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Philip Seymour Hoffman, Evelyn Hart, Olie Alto, Michal Grajewski, Edgar Governo, James Durham, Norman Armour, Boyd Johnson, Will Woytowich, Andrew Farago, Nazariy Demkowicz, John B. Destry, Rob McLaughlin, Philip Lockwood, R.D. Reid, Manfred Maretzki, Marina Stephenson Kerr, John Maclaren, Don Malboeuf, Cory Cassidy, Craig Harrison (II), David Ferrall, Anne Baragar, Kwesi Ameyaw, Jason Love, Jon Ted Wynne, Warren Louis Wiltshire, David Wilson Barnes, Ken Krotowich, Craig Archibald, Bronwen Coleman, Mia Faircloth, Bess Meyer, Jerome Greencorn, Brad Badiuk, Michelle Harrison (II), Robert Huculak, Bruce Greenwood, C. Ernst Harth, Chris Cooper, John Warkentin, Jim Shepard, Frank Filbert, Marshall Bell, Michael J. Burg, Tiffany Lyndall-Knight, Kerr Hewitt, Kate Shindle, Avery Tiplady, Jeremy Dangerfield, Catherine Keener, Wayne Nicklas, Edward Sutton (II), Amy Ryan, Danielle Carriere, Harry Nelken, Bennett Miller, Araby Lockhart, Mark Pellegrino, Clifton Collins Jr., Bob Washington, Ainsley Balcewich, David Rakoff, Roy MacEachern, James Janssens, Christopher Read, John Brown (XXXIV), Chad Bruce, Bob Balaban, Miriam Smith, Ernesto Griffith, Jonathan Barrett, Adam KimmelPhilip Seymour Hoffman, Evelyn Hart, Olie Alto, Michal Grajewski, Edgar Governo, James Durham, Norman Armour, Boyd Johnson, Will Woytowich, Andrew Farago, Nazariy Demkowicz, John B. Destry, Rob McLaughlin, Philip Lockwood, R.D. Reid, Manfred Maretzki,…  See more', 'Language': 'English (Dolby Digital 5.1), French', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.32 Ounces', 'Item model number': '043396126480', 'Director': 'Bennett Miller', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 54 minutes', 'Release date': 'March 21, 2006', 'Actors': 'Philip Seymour Hoffman, Catherine Keener, Craig Archibald, Bronwen Coleman, Kate Shindle', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese, Thai, Korean', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Outstanding performance by Hoffman! You will not be disappointed...\nReview Title: Absolutely amazing performance and back story to In Cold Blood!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/02/16\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jocelyn Moorhouse'], 'Producers': ['Sue Maslin'], 'Starring': ['Kate Winslet', 'Liam Hemsworth', 'Judy Davis'], 'Studio': ['Amazon Studios']}\nReview Text: Clever - fab designs!\nReview Title: Clever\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/02/16\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Michael Kuhn', 'Tracey Seaward', 'Cameron McCracken', 'Christine Langan', 'Malcolm Ritchie'], 'Starring': ['Meryl Streep', 'Hugh Grant', 'Simon Helberg'], 'Studio': ['Paramount Pictures Corp.']}\nReview Text: Great cast! Interesting...\nReview Title: Great cast!\nRating: 5.0\n--------------------------------------------------",
  "reference": "Precious [DVD]\nGabourey Sidibe  (Actor),     Mo'Nique  (Actor),     Lee Daniels  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Set in Harlem in 1987, it is the story of Claireece “Precious” Jones, a sixteen-year-old African-American girl born into a life no one would want. She’s pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, a poisonously angry woman who abuses her emotionally and physically. School is a place of chaos, and Precious has reached the ninth grade with good marks and an awful secret: she can neither read nor write. Precious may sometimes be down, but she is never out. Beneath her impassive expression is a watchful, curious young woman with an inchoate but unshakeable sense that other possibilities exist for her. Threatened with expulsion, Precious is offered the chance to transfer to an alternative school, Each One/Teach One. Precious doesn’t know the meaning of “alternative,” but her instincts tell her this is the chance she has been waiting for. In the literacy workshop taught by the patient yet firm Ms. Rain, Precious begins a journey that', 'Amazon.com', 'Not every movie can survive the kind of hype--multiple awards at Sundance and other festivals, rapturous reviews, nominated for six Academy Awards and winner of two, for Best Supporting Actress and Best Screenplay--that greeted the release of', 'Precious: Based on the Novel \"Push\" by Sapphire', \", but this extraordinary piece of work is more than up to the task. What's particularly notable about the film's success and acclaim is that in the beginning, at least, it presents one of the grimmest scenarios imaginable. The scene is Harlem, New York, in 1987. Teenager Clarisse Precious Jones (played by newcomer Gabourey Sibide in an absolutely fearless performance) is dirt poor, morbidly obese, semiliterate, and pregnant for the second time--both courtesy of her own father (the first baby was born with Down syndrome). Her home life is several levels below Hell, as her bitter, vengeful welfare mother, Mary (Mo'Nique, in a role that has generated legitimate Oscar® buzz), abuses her both physically and otherwise (telling Precious she should have aborted her is only the worst of a relentless flood of insults and vitriol). Yet somehow, the young woman still has hopes and dreams (depicted in a series of delightful fantasy sequences). She enrolls in an alternative school, where a young teacher (Paula Patton) takes her under her wing and even into her home, and visits a social worker (an excellent Mariah Carey; fellow pop star Lenny Kravitz is also effective as a male nurse) who further helps bring Precious out of the darkness. Incredibly, Precious's circumstances deteriorate even more before showing the slightest sign of improvement, and a climactic confrontation with her mother is one of the more wrenching scenes in recent memory. But against all odds, director Lee Daniels, screenwriter Geoffrey Fletcher (working from Sapphire's novel), and especially the wondrously affecting Sibide have managed to make\", 'Precious', 'a film that will lift the viewer far higher up that one might ever have thought possible.', '--Sam Graham']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Lee Daniels, Mo'Nique, Gabourey Sidibe\", 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT27239DVD', 'Director': 'Lee Daniels', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'March 9, 2010', 'Actors': \"Gabourey Sidibe, Mo'Nique\", 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA new perspective, thought-provoking!\nFive Stars\nDefinitely, Maybe (Widescreen)\nRyan Reynolds  (Actor),     Kevin Kline  (Actor),     Adam Brooks  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', \"From the makers of Notting Hill and Love Actually comes the charming and irresistibly funny romantic comedy Definitely, Maybe. When Will (Ryan Reynolds) decides to tell his daughter (Abigail Breslin) the story of how he met her mother, he discovers that a second look at the past might also give him a second chance at the future. Co-starring Elizabeth Banks, Rachel Weisz and Isla Fisher, it's the heartwarming story that makes you realize it's definitely never too late to go back…and maybe find a happy ending.Bonus Content:\", 'Deleted Scenes', 'Deleted Scenes', 'Creating a Romance: Brought to You by Volkswagen', 'Creating a Romance: Brought to You by Volkswagen', 'The Changing Times of Definitely, Maybe', 'The Changing Times of Definitely, Maybe', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Amazon.com', 'A romantic comedy that begins with a discussion about sex education and ends with a bit of an unexpected twist,', 'Definitely, Maybe', 'focuses on an engaging father and his 10-year-old daughter. She is curious about the women her dad loved prior to marrying (and separating from) her mother. Instead of telling her, \"None of your business,\" he decides to tell her about them... Sort of. Will is played by Ryan Reynolds and his precocious daughter Maya is adroitly portrayed by Abigail Breslin (', 'Little Miss Sunshine', '). Will figures out a way to tell Maya about his most meaningful relationships in a PG manner that also is interactive for her (Or as she describes it, \"a love story mystery!\"). Changing a few of their characteristics and disguising their names, Will tells her about three exceptional women and Maya tries to deduce which one became her mom. Was it Emily (Elizabeth Banks), the wholesome Midwestern girl afraid of the big city; Summer (Rachel Weisz), the exotic journalist; or April (Isla Fisher), the rebel with a cause? Hearing about all these women, Maya asks, \"What\\'s the boy word for slut?\" Spanning 15 years, back to when Will was an idealistic young man with the hopes of one day becoming president of the United States, the film has a nice light touch and deals with father-daughter bonding issues in a unique, if not completely realistic manner. Reynolds is a genial but bland leading man, but the women--including young Breslin--more than hold their own in this fun film. --', 'Jae-Ha Kim', 'Get to Know the Girlfriends From', 'Definitely, Maybe', 'Elizabeth Banks (Emily)', 'Isla Fisher (April)', 'Rachel Weisz (Summer)', 'Beyond', 'Definitely, Maybe', 'on DVD', 'More From Ryan Reynolds', 'Father Daughter Essentials', 'More Romantic Comedies', 'Stills from', 'Definitely, Maybe', '(Click for larger image)']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Abigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth BanksAbigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth Banks  See more', 'Initial release date': '2008-06-24', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MHV61100526DVD', 'Director': 'Adam Brooks', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'June 24, 2008', 'Actors': 'Ryan Reynolds, Kevin Kline, Rachel Weisz, Elizabeth Banks, Isla Fisher', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nJust for fun...\nFive Stars\nStand and Deliver\nRamon Menendez  (Director, Writer),     Edward James Olmos  (Actor),     Lou Diamond Phillips  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Edward James Olmos's Oscar-nominated performance energizes this true-life story of a Los Angeles high school teacher who drives his students on to excellence at calculus.\"]\n{'Genre': 'Documentary/Biography', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'Lou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia ParisLou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia Paris  See more', 'Language': 'English (Mono), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.92 Ounces', 'Item model number': '157968', 'Director': 'Ramon Menendez', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'June 8, 2010', 'Actors': 'Edward James Olmos, Lou Diamond Phillips, Rosana De Soto, Andy Garcia, Estelle Harris', 'Producers': 'Lindsay Law, Tom Musca', 'Studio': 'WarnerBrothers', 'Writers': 'Ramon Menendez, Tom Musca', 'Number of discs': '1'}\nI showed it to my Educational students in college...excellent!\nexcellent!\nFinding Vivian Maier\nVivian Maier  (Actor),     John Maloof  (Director),     Charlie Siskel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Who is Vivian Maier? Now considered one of the 20th century's greatest street photographers, Vivian Maier was a mysterious nanny who secretly took over 100,000 photographs that went unseen during her lifetime. Since buying her work by chance at auction, amateur historian John Maloof has crusaded to put this prolific photographer in the history books. Maier's strange and riveting life and art are revealed through never-before-seen photographs, films, and interviews with dozens who thought they knew her.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '28929892', 'Director': 'John Maloof, Charlie Siskel', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 29, 2014', 'Actors': 'Vivian Maier', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSo interesting!\nFive Stars\nWILD\nReese Witherspoon  (Actor),     Laura Dern  (Actor),     Jean-Marc Vallee  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Academy Award Winner Reese Witherspoon stars in this inspirational true story from the director of Dallas Buyers Club and based on the best-selling book by Cheryl Strayed. After years of reckless behavior and being haunted by memories of her mother Bobbi (Academy Award Nominee Laura Dern), Cheryl (Witherspoon) makes a rash decision to embark on a challenging trek across the Pacific Crest Trail. With absolutely no experience, she sets out to hike more than a thousand miles all on her own - in what becomes a remarkable journey of self-discovery and redemption that strengthens and ultimately heals her.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffmann, Keene McRae, Mo McRae, Leigh Parker, Ted De Chatelet, Laura DernKevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffm…  See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2297160', 'Director': 'Jean-Marc Vallee', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'March 31, 2015', 'Actors': 'Reese Witherspoon, Laura Dern, Thomas Sadoski, Michiel Huisman, Gaby Hoffmann', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Nick Hornby', 'Country of Origin': 'USA', 'Number of discs': '1'}\nInteresting film\nInteresting\n20 Feet from Stardom\nDarlene Love  (Actor),     Merry Clayton  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', 'Wat zou popmuziek zijn zonder riffs, refreinen en harmonieën van achtergrondzangers en zangeressen? Hoewel deze muzikanten vrijwel altijd net buiten de spotlights blijven staan, zijn het juist hun stemmen die ontelbare nummers legendarisch hebben gemaakt. TWENTY FEET FROM STARDOM belicht het enigszins verborgen bestaan van de achtergrondzangeressen van wereldsterren als Bruce Springsteen, Stevie Wonder en Mick Jagger. Ze vertellen waarom ze gekozen hebben voor het leven in de schaduw van een wereldster en of de droom om ooit naar de voorgrond te treden ooit heeft bestaan.', 'Review', 'While the lead singers in rock, pop, and R&B are the ones who get the glory, knowledgeable music fans will tell you the backing vocalists often add the touches that make a performance truly memorable, and though many backup singers have the respect of their peers in the music business, they\\'re all but unknown to the average listener. Twenty Feet From Stardom pays homage to some of these unsung heroes, including Darlene Love (the un-credited lead voice on some of Phil Spector\\'s most memorable productions of the 1960s), Merry Clayton (who contributed a striking vocal cameo on the Rolling Stones\\' \"Gimme Shelter\", Lisa Fischer (who has appeared on albums by Sting, Tina Turner, and Aretha Franklin, as well as touring with the Rolling Stones), and the Waters Family (they sang with Michael Jackson on the album Thriller and lent their voices to the films The Lion King and Avatar).']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '28928250', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 14, 2014', 'Actors': 'Darlene Love, Merry Clayton, Lisa Fischer, Judith Hill', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat!\nGreat!\nCapote\nPhilip Seymour Hoffman  (Actor),     Catherine Keener  (Actor),     Bennett Miller  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Biography\n['In November, 1959, the shocking murder of a smalltown Kansas family captures the imagination of Truman Capote (Philip Seymour Hoffman), famed author of \"Breakfast at Tiffany\\'s.\" With his childhood friend Harper Lee (Catherine Keener), writer of the soon-to-be published \"To Kill a Mockingbird,\" Capote sets out to investigate, winning over the locals despite his flamboyant appearance and style. When he forms a bond with the killers and their execution date nears, the writing of \"In Cold Blood,\" a book that will change the course of American Literature, takes a drastic toll on Capote, changing him in ways he never imagined. Stellar performances from Hoffman and Keener, as well as Academy Award(r) winner Chris Cooper (Adaptation) are why critics are calling CAPOTE a \"must-see movie.\"']\n{'Genre': 'Kids & Family', 'Format': 'AC-3, Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Philip Seymour Hoffman, Evelyn Hart, Olie Alto, Michal Grajewski, Edgar Governo, James Durham, Norman Armour, Boyd Johnson, Will Woytowich, Andrew Farago, Nazariy Demkowicz, John B. Destry, Rob McLaughlin, Philip Lockwood, R.D. Reid, Manfred Maretzki, Marina Stephenson Kerr, John Maclaren, Don Malboeuf, Cory Cassidy, Craig Harrison (II), David Ferrall, Anne Baragar, Kwesi Ameyaw, Jason Love, Jon Ted Wynne, Warren Louis Wiltshire, David Wilson Barnes, Ken Krotowich, Craig Archibald, Bronwen Coleman, Mia Faircloth, Bess Meyer, Jerome Greencorn, Brad Badiuk, Michelle Harrison (II), Robert Huculak, Bruce Greenwood, C. Ernst Harth, Chris Cooper, John Warkentin, Jim Shepard, Frank Filbert, Marshall Bell, Michael J. Burg, Tiffany Lyndall-Knight, Kerr Hewitt, Kate Shindle, Avery Tiplady, Jeremy Dangerfield, Catherine Keener, Wayne Nicklas, Edward Sutton (II), Amy Ryan, Danielle Carriere, Harry Nelken, Bennett Miller, Araby Lockhart, Mark Pellegrino, Clifton Collins Jr., Bob Washington, Ainsley Balcewich, David Rakoff, Roy MacEachern, James Janssens, Christopher Read, John Brown (XXXIV), Chad Bruce, Bob Balaban, Miriam Smith, Ernesto Griffith, Jonathan Barrett, Adam KimmelPhilip Seymour Hoffman, Evelyn Hart, Olie Alto, Michal Grajewski, Edgar Governo, James Durham, Norman Armour, Boyd Johnson, Will Woytowich, Andrew Farago, Nazariy Demkowicz, John B. Destry, Rob McLaughlin, Philip Lockwood, R.D. Reid, Manfred Maretzki,…  See more', 'Language': 'English (Dolby Digital 5.1), French', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.32 Ounces', 'Item model number': '043396126480', 'Director': 'Bennett Miller', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 54 minutes', 'Release date': 'March 21, 2006', 'Actors': 'Philip Seymour Hoffman, Catherine Keener, Craig Archibald, Bronwen Coleman, Kate Shindle', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese, Thai, Korean', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nOutstanding performance by Hoffman! You will not be disappointed...\nAbsolutely amazing performance and back story to In Cold Blood!\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jocelyn Moorhouse'], 'Producers': ['Sue Maslin'], 'Starring': ['Kate Winslet', 'Liam Hemsworth', 'Judy Davis'], 'Studio': ['Amazon Studios']}\nClever - fab designs!\nClever\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Michael Kuhn', 'Tracey Seaward', 'Cameron McCracken', 'Christine Langan', 'Malcolm Ritchie'], 'Starring': ['Meryl Streep', 'Hugh Grant', 'Simon Helberg'], 'Studio': ['Paramount Pictures Corp.']}\nGreat cast! Interesting...\nGreat cast!",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Precious [DVD]\nReview Date: 2015/03/11\nStore: Gabourey Sidibe  (Actor),     Mo'Nique  (Actor),     Lee Daniels  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Set in Harlem in 1987, it is the story of Claireece “Precious” Jones, a sixteen-year-old African-American girl born into a life no one would want. She’s pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, a poisonously angry woman who abuses her emotionally and physically. School is a place of chaos, and Precious has reached the ninth grade with good marks and an awful secret: she can neither read nor write. Precious may sometimes be down, but she is never out. Beneath her impassive expression is a watchful, curious young woman with an inchoate but unshakeable sense that other possibilities exist for her. Threatened with expulsion, Precious is offered the chance to transfer to an alternative school, Each One/Teach One. Precious doesn’t know the meaning of “alternative,” but her instincts tell her this is the chance she has been waiting for. In the literacy workshop taught by the patient yet firm Ms. Rain, Precious begins a journey that', 'Amazon.com', 'Not every movie can survive the kind of hype--multiple awards at Sundance and other festivals, rapturous reviews, nominated for six Academy Awards and winner of two, for Best Supporting Actress and Best Screenplay--that greeted the release of', 'Precious: Based on the Novel \"Push\" by Sapphire', \", but this extraordinary piece of work is more than up to the task. What's particularly notable about the film's success and acclaim is that in the beginning, at least, it presents one of the grimmest scenarios imaginable. The scene is Harlem, New York, in 1987. Teenager Clarisse Precious Jones (played by newcomer Gabourey Sibide in an absolutely fearless performance) is dirt poor, morbidly obese, semiliterate, and pregnant for the second time--both courtesy of her own father (the first baby was born with Down syndrome). Her home life is several levels below Hell, as her bitter, vengeful welfare mother, Mary (Mo'Nique, in a role that has generated legitimate Oscar® buzz), abuses her both physically and otherwise (telling Precious she should have aborted her is only the worst of a relentless flood of insults and vitriol). Yet somehow, the young woman still has hopes and dreams (depicted in a series of delightful fantasy sequences). She enrolls in an alternative school, where a young teacher (Paula Patton) takes her under her wing and even into her home, and visits a social worker (an excellent Mariah Carey; fellow pop star Lenny Kravitz is also effective as a male nurse) who further helps bring Precious out of the darkness. Incredibly, Precious's circumstances deteriorate even more before showing the slightest sign of improvement, and a climactic confrontation with her mother is one of the more wrenching scenes in recent memory. But against all odds, director Lee Daniels, screenwriter Geoffrey Fletcher (working from Sapphire's novel), and especially the wondrously affecting Sibide have managed to make\", 'Precious', 'a film that will lift the viewer far higher up that one might ever have thought possible.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Lee Daniels, Mo'Nique, Gabourey Sidibe\", 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT27239DVD', 'Director': 'Lee Daniels', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'March 9, 2010', 'Actors': \"Gabourey Sidibe, Mo'Nique\", 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: A new perspective, thought-provoking!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Definitely, Maybe (Widescreen)\nReview Date: 2015/03/11\nStore: Ryan Reynolds  (Actor),     Kevin Kline  (Actor),     Adam Brooks  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', \"From the makers of Notting Hill and Love Actually comes the charming and irresistibly funny romantic comedy Definitely, Maybe. When Will (Ryan Reynolds) decides to tell his daughter (Abigail Breslin) the story of how he met her mother, he discovers that a second look at the past might also give him a second chance at the future. Co-starring Elizabeth Banks, Rachel Weisz and Isla Fisher, it's the heartwarming story that makes you realize it's definitely never too late to go back…and maybe find a happy ending.Bonus Content:\", 'Deleted Scenes', 'Deleted Scenes', 'Creating a Romance: Brought to You by Volkswagen', 'Creating a Romance: Brought to You by Volkswagen', 'The Changing Times of Definitely, Maybe', 'The Changing Times of Definitely, Maybe', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Amazon.com', 'A romantic comedy that begins with a discussion about sex education and ends with a bit of an unexpected twist,', 'Definitely, Maybe', 'focuses on an engaging father and his 10-year-old daughter. She is curious about the women her dad loved prior to marrying (and separating from) her mother. Instead of telling her, \"None of your business,\" he decides to tell her about them... Sort of. Will is played by Ryan Reynolds and his precocious daughter Maya is adroitly portrayed by Abigail Breslin (', 'Little Miss Sunshine', '). Will figures out a way to tell Maya about his most meaningful relationships in a PG manner that also is interactive for her (Or as she describes it, \"a love story mystery!\"). Changing a few of their characteristics and disguising their names, Will tells her about three exceptional women and Maya tries to deduce which one became her mom. Was it Emily (Elizabeth Banks), the wholesome Midwestern girl afraid of the big city; Summer (Rachel Weisz), the exotic journalist; or April (Isla Fisher), the rebel with a cause? Hearing about all these women, Maya asks, \"What\\'s the boy word for slut?\" Spanning 15 years, back to when Will was an idealistic young man with the hopes of one day becoming president of the United States, the film has a nice light touch and deals with father-daughter bonding issues in a unique, if not completely realistic manner. Reynolds is a genial but bland leading man, but the women--including young Breslin--more than hold their own in this fun film. --', 'Jae-Ha Kim', 'Get to Know the Girlfriends From', 'Definitely, Maybe', 'Elizabeth Banks (Emily)', 'Isla Fisher (April)', 'Rachel Weisz (Summer)', 'Beyond', 'Definitely, Maybe', 'on DVD', 'More From Ryan Reynolds', 'Father Daughter Essentials', 'More Romantic Comedies', 'Stills from', 'Definitely, Maybe', '(Click for larger image)']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Abigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth BanksAbigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth Banks  See more', 'Initial release date': '2008-06-24', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MHV61100526DVD', 'Director': 'Adam Brooks', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'June 24, 2008', 'Actors': 'Ryan Reynolds, Kevin Kline, Rachel Weisz, Elizabeth Banks, Isla Fisher', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: Just for fun...\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stand and Deliver\nReview Date: 2015/03/11\nStore: Ramon Menendez  (Director, Writer),     Edward James Olmos  (Actor),     Lou Diamond Phillips  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Edward James Olmos's Oscar-nominated performance energizes this true-life story of a Los Angeles high school teacher who drives his students on to excellence at calculus.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Documentary/Biography', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'Lou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia ParisLou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia Paris  See more', 'Language': 'English (Mono), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.92 Ounces', 'Item model number': '157968', 'Director': 'Ramon Menendez', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'June 8, 2010', 'Actors': 'Edward James Olmos, Lou Diamond Phillips, Rosana De Soto, Andy Garcia, Estelle Harris', 'Producers': 'Lindsay Law, Tom Musca', 'Studio': 'WarnerBrothers', 'Writers': 'Ramon Menendez, Tom Musca', 'Number of discs': '1'}\nReview Text: I showed it to my Educational students in college...excellent!\nReview Title: excellent!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Finding Vivian Maier\nReview Date: 2015/03/11\nStore: Vivian Maier  (Actor),     John Maloof  (Director),     Charlie Siskel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Who is Vivian Maier? Now considered one of the 20th century's greatest street photographers, Vivian Maier was a mysterious nanny who secretly took over 100,000 photographs that went unseen during her lifetime. Since buying her work by chance at auction, amateur historian John Maloof has crusaded to put this prolific photographer in the history books. Maier's strange and riveting life and art are revealed through never-before-seen photographs, films, and interviews with dozens who thought they knew her.\"]\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '28929892', 'Director': 'John Maloof, Charlie Siskel', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 29, 2014', 'Actors': 'Vivian Maier', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: So interesting!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: WILD\nReview Date: 2015/05/06\nStore: Reese Witherspoon  (Actor),     Laura Dern  (Actor),     Jean-Marc Vallee  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Academy Award Winner Reese Witherspoon stars in this inspirational true story from the director of Dallas Buyers Club and based on the best-selling book by Cheryl Strayed. After years of reckless behavior and being haunted by memories of her mother Bobbi (Academy Award Nominee Laura Dern), Cheryl (Witherspoon) makes a rash decision to embark on a challenging trek across the Pacific Crest Trail. With absolutely no experience, she sets out to hike more than a thousand miles all on her own - in what becomes a remarkable journey of self-discovery and redemption that strengthens and ultimately heals her.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Kevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffmann, Keene McRae, Mo McRae, Leigh Parker, Ted De Chatelet, Laura DernKevin Rankin, Nick Eversman, Thomas Sadoski, Cliff De Young, Brian Van Holt, Reese Witherspoon, W. Earl Brown, Jean-Marc Vallee, Kurt Conroyd, Jeffree Newman, Ray Mist, Michiel Huisman, Cathryn De Prume, Nick Hornby, Will Cuddy, Randy Schulman, Gaby Hoffm…  See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2297160', 'Director': 'Jean-Marc Vallee', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'March 31, 2015', 'Actors': 'Reese Witherspoon, Laura Dern, Thomas Sadoski, Michiel Huisman, Gaby Hoffmann', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Nick Hornby', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Interesting film\nReview Title: Interesting\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 20 Feet from Stardom\nReview Date: 2015/05/06\nStore: Darlene Love  (Actor),     Merry Clayton  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\nProduct Description: ['Product Description', 'Wat zou popmuziek zijn zonder riffs, refreinen en harmonieën van achtergrondzangers en zangeressen? Hoewel deze muzikanten vrijwel altijd net buiten de spotlights blijven staan, zijn het juist hun stemmen die ontelbare nummers legendarisch hebben gemaakt. TWENTY FEET FROM STARDOM belicht het enigszins verborgen bestaan van de achtergrondzangeressen van wereldsterren als Bruce Springsteen, Stevie Wonder en Mick Jagger. Ze vertellen waarom ze gekozen hebben voor het leven in de schaduw van een wereldster en of de droom om ooit naar de voorgrond te treden ooit heeft bestaan.', 'Review', 'While the lead singers in rock, pop, and R&B are the ones who get the glory, knowledgeable music fans will tell you the backing vocalists often add the touches that make a performance truly memorable, and though many backup singers have the respect of their peers in the music business, they\\'re all but unknown to the average listener. Twenty Feet From Stardom pays homage to some of these unsung heroes, including Darlene Love (the un-credited lead voice on some of Phil Spector\\'s most memorable productions of the 1960s), Merry Clayton (who contributed a striking vocal cameo on the Rolling Stones\\' \"Gimme Shelter\", Lisa Fischer (who has appeared on albums by Sting, Tina Turner, and Aretha Franklin, as well as touring with the Rolling Stones), and the Waters Family (they sang with Michael Jackson on the album Thriller and lent their voices to the films The Lion King and Avatar).']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '28928250', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'January 14, 2014', 'Actors': 'Darlene Love, Merry Clayton, Lisa Fischer, Judith Hill', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great!\nReview Title: Great!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Capote\nReview Date: 2015/10/15\nStore: Philip Seymour Hoffman  (Actor),     Catherine Keener  (Actor),     Bennett Miller  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Biography\nProduct Description: ['In November, 1959, the shocking murder of a smalltown Kansas family captures the imagination of Truman Capote (Philip Seymour Hoffman), famed author of \"Breakfast at Tiffany\\'s.\" With his childhood friend Harper Lee (Catherine Keener), writer of the soon-to-be published \"To Kill a Mockingbird,\" Capote sets out to investigate, winning over the locals despite his flamboyant appearance and style. When he forms a bond with the killers and their execution date nears, the writing of \"In Cold Blood,\" a book that will change the course of American Literature, takes a drastic toll on Capote, changing him in ways he never imagined. Stellar performances from Hoffman and Keener, as well as Academy Award(r) winner Chris Cooper (Adaptation) are why critics are calling CAPOTE a \"must-see movie.\"']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'AC-3, Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Philip Seymour Hoffman, Evelyn Hart, Olie Alto, Michal Grajewski, Edgar Governo, James Durham, Norman Armour, Boyd Johnson, Will Woytowich, Andrew Farago, Nazariy Demkowicz, John B. Destry, Rob McLaughlin, Philip Lockwood, R.D. Reid, Manfred Maretzki, Marina Stephenson Kerr, John Maclaren, Don Malboeuf, Cory Cassidy, Craig Harrison (II), David Ferrall, Anne Baragar, Kwesi Ameyaw, Jason Love, Jon Ted Wynne, Warren Louis Wiltshire, David Wilson Barnes, Ken Krotowich, Craig Archibald, Bronwen Coleman, Mia Faircloth, Bess Meyer, Jerome Greencorn, Brad Badiuk, Michelle Harrison (II), Robert Huculak, Bruce Greenwood, C. Ernst Harth, Chris Cooper, John Warkentin, Jim Shepard, Frank Filbert, Marshall Bell, Michael J. Burg, Tiffany Lyndall-Knight, Kerr Hewitt, Kate Shindle, Avery Tiplady, Jeremy Dangerfield, Catherine Keener, Wayne Nicklas, Edward Sutton (II), Amy Ryan, Danielle Carriere, Harry Nelken, Bennett Miller, Araby Lockhart, Mark Pellegrino, Clifton Collins Jr., Bob Washington, Ainsley Balcewich, David Rakoff, Roy MacEachern, James Janssens, Christopher Read, John Brown (XXXIV), Chad Bruce, Bob Balaban, Miriam Smith, Ernesto Griffith, Jonathan Barrett, Adam KimmelPhilip Seymour Hoffman, Evelyn Hart, Olie Alto, Michal Grajewski, Edgar Governo, James Durham, Norman Armour, Boyd Johnson, Will Woytowich, Andrew Farago, Nazariy Demkowicz, John B. Destry, Rob McLaughlin, Philip Lockwood, R.D. Reid, Manfred Maretzki,…  See more', 'Language': 'English (Dolby Digital 5.1), French', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.32 Ounces', 'Item model number': '043396126480', 'Director': 'Bennett Miller', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 54 minutes', 'Release date': 'March 21, 2006', 'Actors': 'Philip Seymour Hoffman, Catherine Keener, Craig Archibald, Bronwen Coleman, Kate Shindle', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese, Thai, Korean', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Outstanding performance by Hoffman! You will not be disappointed...\nReview Title: Absolutely amazing performance and back story to In Cold Blood!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/02/16\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jocelyn Moorhouse'], 'Producers': ['Sue Maslin'], 'Starring': ['Kate Winslet', 'Liam Hemsworth', 'Judy Davis'], 'Studio': ['Amazon Studios']}\nReview Text: Clever - fab designs!\nReview Title: Clever\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/02/16\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Frears'], 'Producers': ['Michael Kuhn', 'Tracey Seaward', 'Cameron McCracken', 'Christine Langan', 'Malcolm Ritchie'], 'Starring': ['Meryl Streep', 'Hugh Grant', 'Simon Helberg'], 'Studio': ['Paramount Pictures Corp.']}\nReview Text: Great cast! Interesting...\nReview Title: Great cast!\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:  \nThe user has expressed significant satisfaction with their purchase history, consistently highlighting the thought-provoking nature of the films. They appreciated the emotional depth and performances by the actors, particularly praising a standout performance that made a strong impression. The engaging storytelling and unique perspectives were also noted as major strengths, enriching their viewing experience. Additionally, the user enjoyed the lighter, fun tone of romantic comedies, showing a preference for content that combines humor with relatable themes.\n\nNEGATIVE SUMMARY:  \nWhile there are no explicit negative experiences detailed in the reviews, some subtle hints suggest that the user may have found certain films less compelling compared to others. For instance, the mention of a lead character being somewhat bland and relying on the strength of supporting roles indicates a desire for more dynamic central performances. The overall ratings, although high, reveal a potential room for improvement in some productions, suggesting the user may have had expectations that weren't fully met in a few instances.\n\nOVERALL SUMMARY:  \nThe user's purchase history reveals a strong preference for impactful narratives that blend emotional resonance with engaging storytelling. They are drawn to varied genres, from dramatic biopics to lighthearted comedies, indicating an appreciation for both depth and entertainment. While they have overwhelmingly positive experiences, there are slight undercurrents of disappointment regarding some character portrayals, hinting at a desire for more dynamic leading roles. Overall, the user enjoys films that provoke thought, showcase strong performances, and deliver an enjoyable viewing experience.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Excellent",
    "text": "Excellent",
    "images": [],
    "asin": "B07S6Q1TGL",
    "parent_asin": "B07S6Q1TGL",
    "user_id": "AHC4YDJ5WS3MDCNSKMJTOZRKZWPA",
    "timestamp": "2019-10-13 18:29:06.002000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.5,
    "rating_number": 38579,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/29b23bbbd0b120063f3a0194666035f765980b21f6d3655c932c454fe084fe26._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/29b23bbbd0b120063f3a0194666035f765980b21f6d3655c932c454fe084fe26._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/29b23bbbd0b120063f3a0194666035f765980b21f6d3655c932c454fe084fe26._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/29b23bbbd0b120063f3a0194666035f765980b21f6d3655c932c454fe084fe26._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/29b23bbbd0b120063f3a0194666035f765980b21f6d3655c932c454fe084fe26._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/29b23bbbd0b120063f3a0194666035f765980b21f6d3655c932c454fe084fe26._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "substance use",
        "alcohol use",
        "smoking",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English",
        "English [Audio Description]"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Dexter Fletcher"
      ],
      "Producers": [
        "Matthew Vaughn",
        "David Furnish",
        "Adam Bohling",
        "David Reid",
        "Elton John",
        "Claudia Vaughn",
        "Brian Oliver",
        "Steve Hamilton Shaw",
        "Michael Gracey"
      ],
      "Starring": [
        "Taron Egerton",
        "Jamie Bell",
        "Richard Madden"
      ],
      "Studio": [
        "Hit Movies"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}