{
  "user_id": "AG7IBD4EPP6H3YUNAKJ65VC4X7XA",
  "summary": "=== Purchase Information ===\nProduct Title: The Tree of Life (Three-Disc Blu-ray/DVD Combo + Digital Copy)\nReview Date: 2014/12/08\nStore: Brad Pitt  (Actor, Producer),     Sean Penn  (Actor),     Terrence Malick  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From Terrence Malick, the acclaimed director of such classic films as BADLANDS, DAYS OF HEAVEN and THE THIN RED LINE, THE TREE OF LIFE is the impressionistic story of a Midwestern family in the 1950's. The film follows the life journey of the eldest son, Jack, through the innocence of childhood to his disillusioned adult years as he tries to reconcile a complicated relationship with his father (Brad Pitt). Jack (played as an adult by Sean Penn) finds himself a lost soul in the modern world, seeking answers to the origins and meaning of life while questioning the existence of faith. Through Malick's signature imagery, we see how both brute nature and spiritual grace shape not only our lives as individuals and families, but all life.\"]\nAverage Rating: 4.1\nProduct Details: {'Format': 'Color, Blu-ray, Multiple Formats, Digital_copy', 'Contributor': 'Brad Pitt, Jessica Chastain, Hunter McCracken, William Pohlad, Sean Penn, Dede Gardner, Sarah Green, Fiona Shaw, Grant Hill, Terrence MalickBrad Pitt, Jessica Chastain, Hunter McCracken, William Pohlad, Sean Penn, Dede Gardner, Sarah Green, Fiona Shaw, Grant Hill, Terrence Malick  See more', 'Language': 'English', 'Runtime': '3 hours and 1 minute', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.7 inches; 4.8 Ounces', 'Item model number': '227493', 'Director': 'Terrence Malick', 'Media Format': 'Color, Blu-ray, Multiple Formats, Digital_copy', 'Run time': '3 hours and 1 minute', 'Release date': 'October 11, 2011', 'Actors': 'Brad Pitt, Sean Penn, Jessica Chastain, Hunter McCracken, Fiona Shaw', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Brad Pitt, Dede Gardner, Sarah Green, Grant Hill, William Pohlad', 'Studio': 'Fox Searchlight', 'Writers': 'Terrence Malick', 'Number of discs': '3'}\nReview Text: A beautiful and otherworldly film. Loved it.\nReview Title: A beautiful and otherworldly film. Loved it.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Red Turtle\nReview Date: 2017/08/29\nCategories: Animation, Drama, Sweet, Serious\nProduct Description: ['In this animated film without words, a castaway trapped on a tropical island must face a mysterious red turtle in order to escape – or embrace all that life has to offer.']\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Dudok De Wit'], 'Producers': ['Toshio Suzuki', 'Vincent Maraval', 'Pascal Caucheteux', 'Grégoire Sorlat'], 'Starring': ['Emmanuel Garijo', 'Tom Hudson']}\nReview Text: My family loves anime. We were looking forward to this film a great deal; my kids aged 12 and 14. The animation is gorgeous. The characters are interesting. But the story just seems a little lacking in poignancy or depth. There is a powerful moment when the boy mistreats a turtle, and then the turtle becomes a woman. My kids were disappointed that the boy didn't really seem to comprehend his own cruelty, or to learn from it. And so, there is something incomplete about the story. That dissatisfaction is maybe a reality of life, itself, but a fairy tale, as this film is, usually gives spiritual choices (selfishness or cruelty, for example, as in this case) a deeper examination.\nReview Title: Beautifully created with a somewhat unsatisfying storyline\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Only Yesterday\nReview Date: 2017/08/29\nStore: Daisy Ridley  (Actor),     Dev Patel  (Actor),     Jamie Simone  (Director),     Isao Takahata  (Director, Writer)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Having lived her whole life in the city, 27-year-old Taeko (Daisy Ridley, Star Wars: The Force Awakens) decides to visit her relatives in the countryside. As she travels, memories of her youth resurface and after meeting young farmer Toshio (Dev Patel, Slumdog Millionaire), she wonders if she's been true to the dreams of her childhood self. Deftly switching between past and present, Only Yesterday is a masterpiece of time and tone, rich with humor and stirring emotion, and beautifully animated by Studio Ghibli, one of the world's most revered animation studios. From Academy Award-nominated director Isao Takahata (The Tale of The Princess Kaguya) and General Producer Hayao Miyazaki (Spirited Away), this critically acclaimed film has never before been released in North America until now–in celebration of its 25th anniversary.Bonus Content:\", 'Feature Length Storyboards', 'Feature Length Storyboards', 'The Making of Only Yesterday', 'The Making of Only Yesterday', 'Behind the Scenes with the Voice Cast', 'Behind the Scenes with the Voice Cast', 'Interview with the English Dub Team', 'Interview with the English Dub Team', 'Foreign Trailers and TV Spots', 'Foreign Trailers and TV Spots', 'U.S. Trailer', 'U.S. Trailer']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 3.84 Ounces', 'Item model number': '35486012', 'Director': 'Jamie Simone, Isao Takahata', 'Media Format': 'Animated, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'July 5, 2016', 'Actors': 'Daisy Ridley, Dev Patel, Alison Fernandez', 'Subtitles': 'English, French', 'Producers': 'Geoffrey Wexler, Toshio Suzuki', 'Language': 'Japanese (DTS-HD Master Audio 2.0), English (DTS-HD Master Audio 2.0), Japanese (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'David Freedman, Isao Takahata', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: My 14 year old daughter enjoyed this. She's just beginning to get into less child-focused films, and this is a good bridge. She felt the story was a little bit &#34;pointless&#34; and &#34;boring&#34; when the main character's child life was continually examined. While the whole story is charming and the animation beautiful, I agree with my daughter somewhat about this.\nReview Title: Good story, sweetly executed\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Strictly Dumpling\nReview Date: 2018/03/01\nCategories: Comedy, Drama, Special Interest, Romance\nProduct Description: [\"Guide Mike Chen takes you on a tour of China's most delicious dishes in this series. From making the best scallion pancakes, to steaming up some delicious flower buns, to crafting delicious pork buns in simple steps, Chen's journey explores all things delicious in Chinese food culture - one dumpling at a time.\"]\nAverage Rating: 3.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Mike Chen'], 'Starring': ['Mike Chen']}\nReview Text: I've been making Chinese food for years. But Mike Chen's enthusiasm is contagious. I really enjoy watching his techniques and comments. He's not too fast or too slow.\nReview Title: Love this show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/22\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nReview Text: Wonderful as always\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/31\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ashley Gething', 'Matthew Hill', 'Tim Niel'], 'Producers': [\"Erin E. O'Flaherty\", 'Jane Root', 'Ewan Roxburgh', 'Billie Shepherd', 'Denys Blakeway', 'Melanie Fall', 'Michael Jackson'], 'Studio': ['PBS']}\nReview Text: Excellent PBS series with details not covered in other documentaries or even books I've been reading. Beautiful multicultural perspectives.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/06/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nReview Text: One of the best seasons ever!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/06/11\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]']}\nReview Text: Love this series!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/08/16\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nReview Text: Always a great series!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/08/16\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Hiromasa Yonebayashi'], 'Producers': ['Yoshiaki Nishimura', 'Geoffrey Wexler'], 'Starring': ['Ruby Barnhill', 'Kate Winslet', 'Jim Broadbent'], 'Studio': ['Gkids']}\nReview Text: Excellent!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kedi\nReview Date: 2018/10/02\nCategories: Documentary, Cerebral, Dreamlike, Peaceful\nProduct Description: [\"Hundreds of thousands of cats roam the metropolis of Istanbul freely. For thousands of years, they've wandered in and out of people's lives, becoming an essential part of the communities that make the city so rich. Claiming no owners, these animals live between two worlds, and they bring joy and purpose to those people they choose to adopt. Turkish language film with English subtitles.\"]\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['Türkçe'], 'Subtitles': ['English [CC]'], 'Directors': ['Ceyda Torun'], 'Producers': ['Charlie Wuppermann']}\nReview Text: Beautifully made!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/02/01\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Goldberg'], 'Producers': ['Andrew Goldberg', 'Jane C. Wagner'], 'Starring': ['Martha Teichner'], 'Studio': ['PBS']}\nReview Text: I loved this documentary. Now I am looking here on Amazon for a more in-depth expansion of these concepts and historical details, in a book.\nReview Title: Beautifully Choreographed and narrated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ella Brennan: Commanding the Table\nReview Date: 2019/05/02\nStore: Ella Brennan  (Actor),     Emeril Lagasse  (Actor),     Leslie Iwerks  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['Product Description', \"Oscar-nominated filmmaker Leslie Iwerks brings the Ella Brennan's remarkable story to the screen showing how she became a leading force in the contemporary restaurant business despite the challenges of being a woman in a male dominated field. With the success of New Orleans iconic establishment Commander's Palace, restaurateurs and chefs from around the world and all walks of life credit the important role Ella has played in building and enhancing American cooking and hospitality. With interviews with current and former chef including Emeril Lagasse, Danny Meyer, Tim and Nina Zagat, Daniel Boulud, Jeremiah Tower, and many more. Before the food business became show business, one woman led the way.\", 'Review', 'The story of a hard-charging, no-nonsense businesswoman who excelled in a male-dominated profession decades before gender imbalance in the restaurant industry became a hot issue. --The New York TimesA highly entertaining and well-made documentary. --Dwight Brown, Huffington Post']\nAverage Rating: 5.0\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Leslie Iwerks', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Ella Brennan, Emeril Lagasse, Patricia Clarkson, Paul Prudhomme, Jeremiah Tower', 'Dubbed': 'English', 'Studio': 'Passion River', 'Number of discs': '1'}\nReview Text: I have always known of but never visited New Orleans. This film alone made me decide to go.\nReview Title: Wonderfully told story\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Babies\nReview Date: 2019/10/28\nCategories: International, Documentary, Cerebral, Cheerful\nProduct Description: ['Everyone loves Babies... Experience joy and happiness at its purest in this life-affirming, universal celebration of the magic and innocence of babies.']\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Thomas Balmes'], 'Producers': ['Amandine Billot', 'Alain Chabat', 'Christine Rouxel'], 'Starring': ['Bayar', 'Bayar', 'Hattie']}\nReview Text: Pure beauty. Unexpected insights into parenting, and the universal in babies and human nature. Gorgeous scenery from each of the four regions filmed: Namibia, Mongola, Japan, and the USA. One of the best documentaries I haver ever seen. These are happy babies with happy families. I wish there were more documentaries with the gentle eye of these film-makers, offering insight to other cultures and ideals of family life. -- Specific scenes and ideas struck me that maybe did not strike others, given that the film has no narrator and is open. First, the USA and Japan is far more hygienic and \"clean\" compared to other cultures, and this maybe removes a baby from sensory experiences and depths other cultures offer: deeper engagement with nature and animals, insects and earth. Also, because there is no narration, I was struck by the quiet and the sounds that babies are exposed to in different regions: how the sounds of the adults speaking and natural sounds surround all infants. Thirdly but not conclusively, the personalities of these babies are gently brought to focus, so I felt close to the families and wanted more when the film was done.\nReview Title: Lovely! A treasure of a film!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/04/06\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alison Chernick'], 'Producers': ['Alison Chernick'], 'Starring': ['Itzhak Perlman', 'Toby Perlman', 'Alan Alda']}\nReview Text: One of the best documentaries I have seen in some time. As a visual artist myself, I enjoyed hearing Perlman's more conceptual experiences with the violin that translate well to other art forms. I particularly enjoyed the bits where he talked about what kind of teacher was best for him; I enjoyed when he talked with Alan Alda about how the decision of how to act out a piece of music comes from actually doing it, first; and I enjoyed when he talked about how music moves him emotionally. It was good to understand a bit about his emotional relationship to music. And I wish the documentary had come in many parts. Very well done! Thanks to the creators and producer of this documentary!\nReview Title: Beautifully put together!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/07/16\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nicolas Brown', 'Kristi Jacobson', 'Sally Aitken', 'Philippa Ross'], 'Producers': ['Beth Hoppe', 'Sallie Clement', 'Nicolas Brown', 'Kristi Jacobson', 'Sally Aitken', 'Philippa Ross'], 'Starring': ['Kathryn Walker']}\nReview Text: I agree with the reviewer who criticized the program and gave 2 stars, for not bringing in prepared participants. And this is one of the least well done historical reality series. But I do think historical reality shows are good, for bringing focus to a certain historical period. And this is the only period piece on the Mayflower landing. What struck me most is that there was a question of allowing a religious leader, an academic leader, and later with the cape magistrate, a venture capitalist or business management leader. Which type gets elected as leader by the people has something to do with the times and the values of those people, but also the personalities of those individual leaders. I found in this series and setting I had most respect for the business-style leadership skills. The question of being an atheist in those times is interesting as it is offered in this series. But I don't think it makes much sense to test modern religious freedom with laws and values of that era. It would be better for this series to bring a set of \"like minded\" invididuals together, as the Puritans would have been, and then follow the group as they learned to develop a community-minded approach to survival. Another problem is that while Puritans would have had incentive to pay back the colonial investors, there was no incentive for this group to work hard to pay back their debt. Some sort of incentive should have been built into the series in order to make the situation more \"real\". I think the program is insightful for understanding what makes group cohesion stronger, and what breaks down that sense of community. I was surprised and found it made sense, in this series, that the servants at times had more power than the freed people, when their ideas were more in line with the values of the community as a whole. But on the other hand, allowing men to participate in the law and management roles put women and servants very much in the back seat of power, no matter what their strengths or efforts. And it created a real divide that makes no sense to a modern viewer.\nReview Title: A great idea\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Tree of Life (Three-Disc Blu-ray/DVD Combo + Digital Copy)\nBrad Pitt  (Actor, Producer),     Sean Penn  (Actor),     Terrence Malick  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From Terrence Malick, the acclaimed director of such classic films as BADLANDS, DAYS OF HEAVEN and THE THIN RED LINE, THE TREE OF LIFE is the impressionistic story of a Midwestern family in the 1950's. The film follows the life journey of the eldest son, Jack, through the innocence of childhood to his disillusioned adult years as he tries to reconcile a complicated relationship with his father (Brad Pitt). Jack (played as an adult by Sean Penn) finds himself a lost soul in the modern world, seeking answers to the origins and meaning of life while questioning the existence of faith. Through Malick's signature imagery, we see how both brute nature and spiritual grace shape not only our lives as individuals and families, but all life.\"]\n{'Format': 'Color, Blu-ray, Multiple Formats, Digital_copy', 'Contributor': 'Brad Pitt, Jessica Chastain, Hunter McCracken, William Pohlad, Sean Penn, Dede Gardner, Sarah Green, Fiona Shaw, Grant Hill, Terrence MalickBrad Pitt, Jessica Chastain, Hunter McCracken, William Pohlad, Sean Penn, Dede Gardner, Sarah Green, Fiona Shaw, Grant Hill, Terrence Malick  See more', 'Language': 'English', 'Runtime': '3 hours and 1 minute', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.7 inches; 4.8 Ounces', 'Item model number': '227493', 'Director': 'Terrence Malick', 'Media Format': 'Color, Blu-ray, Multiple Formats, Digital_copy', 'Run time': '3 hours and 1 minute', 'Release date': 'October 11, 2011', 'Actors': 'Brad Pitt, Sean Penn, Jessica Chastain, Hunter McCracken, Fiona Shaw', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Brad Pitt, Dede Gardner, Sarah Green, Grant Hill, William Pohlad', 'Studio': 'Fox Searchlight', 'Writers': 'Terrence Malick', 'Number of discs': '3'}\nA beautiful and otherworldly film. Loved it.\nA beautiful and otherworldly film. Loved it.\nThe Red Turtle\nAnimation, Drama, Sweet, Serious\n['In this animated film without words, a castaway trapped on a tropical island must face a mysterious red turtle in order to escape – or embrace all that life has to offer.']\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Dudok De Wit'], 'Producers': ['Toshio Suzuki', 'Vincent Maraval', 'Pascal Caucheteux', 'Grégoire Sorlat'], 'Starring': ['Emmanuel Garijo', 'Tom Hudson']}\nMy family loves anime. We were looking forward to this film a great deal; my kids aged 12 and 14. The animation is gorgeous. The characters are interesting. But the story just seems a little lacking in poignancy or depth. There is a powerful moment when the boy mistreats a turtle, and then the turtle becomes a woman. My kids were disappointed that the boy didn't really seem to comprehend his own cruelty, or to learn from it. And so, there is something incomplete about the story. That dissatisfaction is maybe a reality of life, itself, but a fairy tale, as this film is, usually gives spiritual choices (selfishness or cruelty, for example, as in this case) a deeper examination.\nBeautifully created with a somewhat unsatisfying storyline\nOnly Yesterday\nDaisy Ridley  (Actor),     Dev Patel  (Actor),     Jamie Simone  (Director),     Isao Takahata  (Director, Writer)    &                   1                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Having lived her whole life in the city, 27-year-old Taeko (Daisy Ridley, Star Wars: The Force Awakens) decides to visit her relatives in the countryside. As she travels, memories of her youth resurface and after meeting young farmer Toshio (Dev Patel, Slumdog Millionaire), she wonders if she's been true to the dreams of her childhood self. Deftly switching between past and present, Only Yesterday is a masterpiece of time and tone, rich with humor and stirring emotion, and beautifully animated by Studio Ghibli, one of the world's most revered animation studios. From Academy Award-nominated director Isao Takahata (The Tale of The Princess Kaguya) and General Producer Hayao Miyazaki (Spirited Away), this critically acclaimed film has never before been released in North America until now–in celebration of its 25th anniversary.Bonus Content:\", 'Feature Length Storyboards', 'Feature Length Storyboards', 'The Making of Only Yesterday', 'The Making of Only Yesterday', 'Behind the Scenes with the Voice Cast', 'Behind the Scenes with the Voice Cast', 'Interview with the English Dub Team', 'Interview with the English Dub Team', 'Foreign Trailers and TV Spots', 'Foreign Trailers and TV Spots', 'U.S. Trailer', 'U.S. Trailer']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 3.84 Ounces', 'Item model number': '35486012', 'Director': 'Jamie Simone, Isao Takahata', 'Media Format': 'Animated, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'July 5, 2016', 'Actors': 'Daisy Ridley, Dev Patel, Alison Fernandez', 'Subtitles': 'English, French', 'Producers': 'Geoffrey Wexler, Toshio Suzuki', 'Language': 'Japanese (DTS-HD Master Audio 2.0), English (DTS-HD Master Audio 2.0), Japanese (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'David Freedman, Isao Takahata', 'Country of Origin': 'USA', 'Number of discs': '2'}\nMy 14 year old daughter enjoyed this. She's just beginning to get into less child-focused films, and this is a good bridge. She felt the story was a little bit &#34;pointless&#34; and &#34;boring&#34; when the main character's child life was continually examined. While the whole story is charming and the animation beautiful, I agree with my daughter somewhat about this.\nGood story, sweetly executed\nStrictly Dumpling\nComedy, Drama, Special Interest, Romance\n[\"Guide Mike Chen takes you on a tour of China's most delicious dishes in this series. From making the best scallion pancakes, to steaming up some delicious flower buns, to crafting delicious pork buns in simple steps, Chen's journey explores all things delicious in Chinese food culture - one dumpling at a time.\"]\n{'Subtitles': ['None available'], 'Directors': ['Mike Chen'], 'Starring': ['Mike Chen']}\nI've been making Chinese food for years. But Mike Chen's enthusiasm is contagious. I really enjoy watching his techniques and comments. He's not too fast or too slow.\nLove this show!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nWonderful as always\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ashley Gething', 'Matthew Hill', 'Tim Niel'], 'Producers': [\"Erin E. O'Flaherty\", 'Jane Root', 'Ewan Roxburgh', 'Billie Shepherd', 'Denys Blakeway', 'Melanie Fall', 'Michael Jackson'], 'Studio': ['PBS']}\nExcellent PBS series with details not covered in other documentaries or even books I've been reading. Beautiful multicultural perspectives.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nOne of the best seasons ever!!\nFive Stars\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]']}\nLove this series!\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nAlways a great series!\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Hiromasa Yonebayashi'], 'Producers': ['Yoshiaki Nishimura', 'Geoffrey Wexler'], 'Starring': ['Ruby Barnhill', 'Kate Winslet', 'Jim Broadbent'], 'Studio': ['Gkids']}\nExcellent!\nFive Stars\nKedi\nDocumentary, Cerebral, Dreamlike, Peaceful\n[\"Hundreds of thousands of cats roam the metropolis of Istanbul freely. For thousands of years, they've wandered in and out of people's lives, becoming an essential part of the communities that make the city so rich. Claiming no owners, these animals live between two worlds, and they bring joy and purpose to those people they choose to adopt. Turkish language film with English subtitles.\"]\n{'Audio languages': ['Türkçe'], 'Subtitles': ['English [CC]'], 'Directors': ['Ceyda Torun'], 'Producers': ['Charlie Wuppermann']}\nBeautifully made!!\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Goldberg'], 'Producers': ['Andrew Goldberg', 'Jane C. Wagner'], 'Starring': ['Martha Teichner'], 'Studio': ['PBS']}\nI loved this documentary. Now I am looking here on Amazon for a more in-depth expansion of these concepts and historical details, in a book.\nBeautifully Choreographed and narrated\nElla Brennan: Commanding the Table\nElla Brennan  (Actor),     Emeril Lagasse  (Actor),     Leslie Iwerks  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Product Description', \"Oscar-nominated filmmaker Leslie Iwerks brings the Ella Brennan's remarkable story to the screen showing how she became a leading force in the contemporary restaurant business despite the challenges of being a woman in a male dominated field. With the success of New Orleans iconic establishment Commander's Palace, restaurateurs and chefs from around the world and all walks of life credit the important role Ella has played in building and enhancing American cooking and hospitality. With interviews with current and former chef including Emeril Lagasse, Danny Meyer, Tim and Nina Zagat, Daniel Boulud, Jeremiah Tower, and many more. Before the food business became show business, one woman led the way.\", 'Review', 'The story of a hard-charging, no-nonsense businesswoman who excelled in a male-dominated profession decades before gender imbalance in the restaurant industry became a hot issue. --The New York TimesA highly entertaining and well-made documentary. --Dwight Brown, Huffington Post']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Leslie Iwerks', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Ella Brennan, Emeril Lagasse, Patricia Clarkson, Paul Prudhomme, Jeremiah Tower', 'Dubbed': 'English', 'Studio': 'Passion River', 'Number of discs': '1'}\nI have always known of but never visited New Orleans. This film alone made me decide to go.\nWonderfully told story\nBabies\nInternational, Documentary, Cerebral, Cheerful\n['Everyone loves Babies... Experience joy and happiness at its purest in this life-affirming, universal celebration of the magic and innocence of babies.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Thomas Balmes'], 'Producers': ['Amandine Billot', 'Alain Chabat', 'Christine Rouxel'], 'Starring': ['Bayar', 'Bayar', 'Hattie']}\nPure beauty. Unexpected insights into parenting, and the universal in babies and human nature. Gorgeous scenery from each of the four regions filmed: Namibia, Mongola, Japan, and the USA. One of the best documentaries I haver ever seen. These are happy babies with happy families. I wish there were more documentaries with the gentle eye of these film-makers, offering insight to other cultures and ideals of family life. -- Specific scenes and ideas struck me that maybe did not strike others, given that the film has no narrator and is open. First, the USA and Japan is far more hygienic and \"clean\" compared to other cultures, and this maybe removes a baby from sensory experiences and depths other cultures offer: deeper engagement with nature and animals, insects and earth. Also, because there is no narration, I was struck by the quiet and the sounds that babies are exposed to in different regions: how the sounds of the adults speaking and natural sounds surround all infants. Thirdly but not conclusively, the personalities of these babies are gently brought to focus, so I felt close to the families and wanted more when the film was done.\nLovely! A treasure of a film!\n{'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alison Chernick'], 'Producers': ['Alison Chernick'], 'Starring': ['Itzhak Perlman', 'Toby Perlman', 'Alan Alda']}\nOne of the best documentaries I have seen in some time. As a visual artist myself, I enjoyed hearing Perlman's more conceptual experiences with the violin that translate well to other art forms. I particularly enjoyed the bits where he talked about what kind of teacher was best for him; I enjoyed when he talked with Alan Alda about how the decision of how to act out a piece of music comes from actually doing it, first; and I enjoyed when he talked about how music moves him emotionally. It was good to understand a bit about his emotional relationship to music. And I wish the documentary had come in many parts. Very well done! Thanks to the creators and producer of this documentary!\nBeautifully put together!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nicolas Brown', 'Kristi Jacobson', 'Sally Aitken', 'Philippa Ross'], 'Producers': ['Beth Hoppe', 'Sallie Clement', 'Nicolas Brown', 'Kristi Jacobson', 'Sally Aitken', 'Philippa Ross'], 'Starring': ['Kathryn Walker']}\nI agree with the reviewer who criticized the program and gave 2 stars, for not bringing in prepared participants. And this is one of the least well done historical reality series. But I do think historical reality shows are good, for bringing focus to a certain historical period. And this is the only period piece on the Mayflower landing. What struck me most is that there was a question of allowing a religious leader, an academic leader, and later with the cape magistrate, a venture capitalist or business management leader. Which type gets elected as leader by the people has something to do with the times and the values of those people, but also the personalities of those individual leaders. I found in this series and setting I had most respect for the business-style leadership skills. The question of being an atheist in those times is interesting as it is offered in this series. But I don't think it makes much sense to test modern religious freedom with laws and values of that era. It would be better for this series to bring a set of \"like minded\" invididuals together, as the Puritans would have been, and then follow the group as they learned to develop a community-minded approach to survival. Another problem is that while Puritans would have had incentive to pay back the colonial investors, there was no incentive for this group to work hard to pay back their debt. Some sort of incentive should have been built into the series in order to make the situation more \"real\". I think the program is insightful for understanding what makes group cohesion stronger, and what breaks down that sense of community. I was surprised and found it made sense, in this series, that the servants at times had more power than the freed people, when their ideas were more in line with the values of the community as a whole. But on the other hand, allowing men to participate in the law and management roles put women and servants very much in the back seat of power, no matter what their strengths or efforts. And it created a real divide that makes no sense to a modern viewer.\nA great idea",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: The Tree of Life (Three-Disc Blu-ray/DVD Combo + Digital Copy)\nReview Date: 2014/12/08\nStore: Brad Pitt  (Actor, Producer),     Sean Penn  (Actor),     Terrence Malick  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"From Terrence Malick, the acclaimed director of such classic films as BADLANDS, DAYS OF HEAVEN and THE THIN RED LINE, THE TREE OF LIFE is the impressionistic story of a Midwestern family in the 1950's. The film follows the life journey of the eldest son, Jack, through the innocence of childhood to his disillusioned adult years as he tries to reconcile a complicated relationship with his father (Brad Pitt). Jack (played as an adult by Sean Penn) finds himself a lost soul in the modern world, seeking answers to the origins and meaning of life while questioning the existence of faith. Through Malick's signature imagery, we see how both brute nature and spiritual grace shape not only our lives as individuals and families, but all life.\"]\nAverage Rating: 4.1\nProduct Details: {'Format': 'Color, Blu-ray, Multiple Formats, Digital_copy', 'Contributor': 'Brad Pitt, Jessica Chastain, Hunter McCracken, William Pohlad, Sean Penn, Dede Gardner, Sarah Green, Fiona Shaw, Grant Hill, Terrence MalickBrad Pitt, Jessica Chastain, Hunter McCracken, William Pohlad, Sean Penn, Dede Gardner, Sarah Green, Fiona Shaw, Grant Hill, Terrence Malick  See more', 'Language': 'English', 'Runtime': '3 hours and 1 minute', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.7 inches; 4.8 Ounces', 'Item model number': '227493', 'Director': 'Terrence Malick', 'Media Format': 'Color, Blu-ray, Multiple Formats, Digital_copy', 'Run time': '3 hours and 1 minute', 'Release date': 'October 11, 2011', 'Actors': 'Brad Pitt, Sean Penn, Jessica Chastain, Hunter McCracken, Fiona Shaw', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Brad Pitt, Dede Gardner, Sarah Green, Grant Hill, William Pohlad', 'Studio': 'Fox Searchlight', 'Writers': 'Terrence Malick', 'Number of discs': '3'}\nReview Text: A beautiful and otherworldly film. Loved it.\nReview Title: A beautiful and otherworldly film. Loved it.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Red Turtle\nReview Date: 2017/08/29\nCategories: Animation, Drama, Sweet, Serious\nProduct Description: ['In this animated film without words, a castaway trapped on a tropical island must face a mysterious red turtle in order to escape – or embrace all that life has to offer.']\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Dudok De Wit'], 'Producers': ['Toshio Suzuki', 'Vincent Maraval', 'Pascal Caucheteux', 'Grégoire Sorlat'], 'Starring': ['Emmanuel Garijo', 'Tom Hudson']}\nReview Text: My family loves anime. We were looking forward to this film a great deal; my kids aged 12 and 14. The animation is gorgeous. The characters are interesting. But the story just seems a little lacking in poignancy or depth. There is a powerful moment when the boy mistreats a turtle, and then the turtle becomes a woman. My kids were disappointed that the boy didn't really seem to comprehend his own cruelty, or to learn from it. And so, there is something incomplete about the story. That dissatisfaction is maybe a reality of life, itself, but a fairy tale, as this film is, usually gives spiritual choices (selfishness or cruelty, for example, as in this case) a deeper examination.\nReview Title: Beautifully created with a somewhat unsatisfying storyline\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Only Yesterday\nReview Date: 2017/08/29\nStore: Daisy Ridley  (Actor),     Dev Patel  (Actor),     Jamie Simone  (Director),     Isao Takahata  (Director, Writer)    &                   1                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Having lived her whole life in the city, 27-year-old Taeko (Daisy Ridley, Star Wars: The Force Awakens) decides to visit her relatives in the countryside. As she travels, memories of her youth resurface and after meeting young farmer Toshio (Dev Patel, Slumdog Millionaire), she wonders if she's been true to the dreams of her childhood self. Deftly switching between past and present, Only Yesterday is a masterpiece of time and tone, rich with humor and stirring emotion, and beautifully animated by Studio Ghibli, one of the world's most revered animation studios. From Academy Award-nominated director Isao Takahata (The Tale of The Princess Kaguya) and General Producer Hayao Miyazaki (Spirited Away), this critically acclaimed film has never before been released in North America until now–in celebration of its 25th anniversary.Bonus Content:\", 'Feature Length Storyboards', 'Feature Length Storyboards', 'The Making of Only Yesterday', 'The Making of Only Yesterday', 'Behind the Scenes with the Voice Cast', 'Behind the Scenes with the Voice Cast', 'Interview with the English Dub Team', 'Interview with the English Dub Team', 'Foreign Trailers and TV Spots', 'Foreign Trailers and TV Spots', 'U.S. Trailer', 'U.S. Trailer']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.75 inches; 3.84 Ounces', 'Item model number': '35486012', 'Director': 'Jamie Simone, Isao Takahata', 'Media Format': 'Animated, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'July 5, 2016', 'Actors': 'Daisy Ridley, Dev Patel, Alison Fernandez', 'Subtitles': 'English, French', 'Producers': 'Geoffrey Wexler, Toshio Suzuki', 'Language': 'Japanese (DTS-HD Master Audio 2.0), English (DTS-HD Master Audio 2.0), Japanese (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'David Freedman, Isao Takahata', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: My 14 year old daughter enjoyed this. She's just beginning to get into less child-focused films, and this is a good bridge. She felt the story was a little bit &#34;pointless&#34; and &#34;boring&#34; when the main character's child life was continually examined. While the whole story is charming and the animation beautiful, I agree with my daughter somewhat about this.\nReview Title: Good story, sweetly executed\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Strictly Dumpling\nReview Date: 2018/03/01\nCategories: Comedy, Drama, Special Interest, Romance\nProduct Description: [\"Guide Mike Chen takes you on a tour of China's most delicious dishes in this series. From making the best scallion pancakes, to steaming up some delicious flower buns, to crafting delicious pork buns in simple steps, Chen's journey explores all things delicious in Chinese food culture - one dumpling at a time.\"]\nAverage Rating: 3.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Mike Chen'], 'Starring': ['Mike Chen']}\nReview Text: I've been making Chinese food for years. But Mike Chen's enthusiasm is contagious. I really enjoy watching his techniques and comments. He's not too fast or too slow.\nReview Title: Love this show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/22\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nReview Text: Wonderful as always\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/31\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ashley Gething', 'Matthew Hill', 'Tim Niel'], 'Producers': [\"Erin E. O'Flaherty\", 'Jane Root', 'Ewan Roxburgh', 'Billie Shepherd', 'Denys Blakeway', 'Melanie Fall', 'Michael Jackson'], 'Studio': ['PBS']}\nReview Text: Excellent PBS series with details not covered in other documentaries or even books I've been reading. Beautiful multicultural perspectives.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/06/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nReview Text: One of the best seasons ever!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/06/11\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]']}\nReview Text: Love this series!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/08/16\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike B. Anderson', 'Jim Reardon', 'Mark Kirkland', 'Steven Dean Moore', 'David Silverman', 'Bob Anderson', 'Matthew Nastuk', 'Mike Frank Polcino', 'Rob Oliver', 'Chris Clements'], 'Studio': ['20th Century Fox Television']}\nReview Text: Always a great series!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/08/16\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Hiromasa Yonebayashi'], 'Producers': ['Yoshiaki Nishimura', 'Geoffrey Wexler'], 'Starring': ['Ruby Barnhill', 'Kate Winslet', 'Jim Broadbent'], 'Studio': ['Gkids']}\nReview Text: Excellent!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kedi\nReview Date: 2018/10/02\nCategories: Documentary, Cerebral, Dreamlike, Peaceful\nProduct Description: [\"Hundreds of thousands of cats roam the metropolis of Istanbul freely. For thousands of years, they've wandered in and out of people's lives, becoming an essential part of the communities that make the city so rich. Claiming no owners, these animals live between two worlds, and they bring joy and purpose to those people they choose to adopt. Turkish language film with English subtitles.\"]\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['Türkçe'], 'Subtitles': ['English [CC]'], 'Directors': ['Ceyda Torun'], 'Producers': ['Charlie Wuppermann']}\nReview Text: Beautifully made!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2019/02/01\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Goldberg'], 'Producers': ['Andrew Goldberg', 'Jane C. Wagner'], 'Starring': ['Martha Teichner'], 'Studio': ['PBS']}\nReview Text: I loved this documentary. Now I am looking here on Amazon for a more in-depth expansion of these concepts and historical details, in a book.\nReview Title: Beautifully Choreographed and narrated\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ella Brennan: Commanding the Table\nReview Date: 2019/05/02\nStore: Ella Brennan  (Actor),     Emeril Lagasse  (Actor),     Leslie Iwerks  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: ['Product Description', \"Oscar-nominated filmmaker Leslie Iwerks brings the Ella Brennan's remarkable story to the screen showing how she became a leading force in the contemporary restaurant business despite the challenges of being a woman in a male dominated field. With the success of New Orleans iconic establishment Commander's Palace, restaurateurs and chefs from around the world and all walks of life credit the important role Ella has played in building and enhancing American cooking and hospitality. With interviews with current and former chef including Emeril Lagasse, Danny Meyer, Tim and Nina Zagat, Daniel Boulud, Jeremiah Tower, and many more. Before the food business became show business, one woman led the way.\", 'Review', 'The story of a hard-charging, no-nonsense businesswoman who excelled in a male-dominated profession decades before gender imbalance in the restaurant industry became a hot issue. --The New York TimesA highly entertaining and well-made documentary. --Dwight Brown, Huffington Post']\nAverage Rating: 5.0\nProduct Details: {'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Leslie Iwerks', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Ella Brennan, Emeril Lagasse, Patricia Clarkson, Paul Prudhomme, Jeremiah Tower', 'Dubbed': 'English', 'Studio': 'Passion River', 'Number of discs': '1'}\nReview Text: I have always known of but never visited New Orleans. This film alone made me decide to go.\nReview Title: Wonderfully told story\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Babies\nReview Date: 2019/10/28\nCategories: International, Documentary, Cerebral, Cheerful\nProduct Description: ['Everyone loves Babies... Experience joy and happiness at its purest in this life-affirming, universal celebration of the magic and innocence of babies.']\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Thomas Balmes'], 'Producers': ['Amandine Billot', 'Alain Chabat', 'Christine Rouxel'], 'Starring': ['Bayar', 'Bayar', 'Hattie']}\nReview Text: Pure beauty. Unexpected insights into parenting, and the universal in babies and human nature. Gorgeous scenery from each of the four regions filmed: Namibia, Mongola, Japan, and the USA. One of the best documentaries I haver ever seen. These are happy babies with happy families. I wish there were more documentaries with the gentle eye of these film-makers, offering insight to other cultures and ideals of family life. -- Specific scenes and ideas struck me that maybe did not strike others, given that the film has no narrator and is open. First, the USA and Japan is far more hygienic and \"clean\" compared to other cultures, and this maybe removes a baby from sensory experiences and depths other cultures offer: deeper engagement with nature and animals, insects and earth. Also, because there is no narration, I was struck by the quiet and the sounds that babies are exposed to in different regions: how the sounds of the adults speaking and natural sounds surround all infants. Thirdly but not conclusively, the personalities of these babies are gently brought to focus, so I felt close to the families and wanted more when the film was done.\nReview Title: Lovely! A treasure of a film!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/04/06\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alison Chernick'], 'Producers': ['Alison Chernick'], 'Starring': ['Itzhak Perlman', 'Toby Perlman', 'Alan Alda']}\nReview Text: One of the best documentaries I have seen in some time. As a visual artist myself, I enjoyed hearing Perlman's more conceptual experiences with the violin that translate well to other art forms. I particularly enjoyed the bits where he talked about what kind of teacher was best for him; I enjoyed when he talked with Alan Alda about how the decision of how to act out a piece of music comes from actually doing it, first; and I enjoyed when he talked about how music moves him emotionally. It was good to understand a bit about his emotional relationship to music. And I wish the documentary had come in many parts. Very well done! Thanks to the creators and producer of this documentary!\nReview Title: Beautifully put together!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/07/16\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nicolas Brown', 'Kristi Jacobson', 'Sally Aitken', 'Philippa Ross'], 'Producers': ['Beth Hoppe', 'Sallie Clement', 'Nicolas Brown', 'Kristi Jacobson', 'Sally Aitken', 'Philippa Ross'], 'Starring': ['Kathryn Walker']}\nReview Text: I agree with the reviewer who criticized the program and gave 2 stars, for not bringing in prepared participants. And this is one of the least well done historical reality series. But I do think historical reality shows are good, for bringing focus to a certain historical period. And this is the only period piece on the Mayflower landing. What struck me most is that there was a question of allowing a religious leader, an academic leader, and later with the cape magistrate, a venture capitalist or business management leader. Which type gets elected as leader by the people has something to do with the times and the values of those people, but also the personalities of those individual leaders. I found in this series and setting I had most respect for the business-style leadership skills. The question of being an atheist in those times is interesting as it is offered in this series. But I don't think it makes much sense to test modern religious freedom with laws and values of that era. It would be better for this series to bring a set of \"like minded\" invididuals together, as the Puritans would have been, and then follow the group as they learned to develop a community-minded approach to survival. Another problem is that while Puritans would have had incentive to pay back the colonial investors, there was no incentive for this group to work hard to pay back their debt. Some sort of incentive should have been built into the series in order to make the situation more \"real\". I think the program is insightful for understanding what makes group cohesion stronger, and what breaks down that sense of community. I was surprised and found it made sense, in this series, that the servants at times had more power than the freed people, when their ideas were more in line with the values of the community as a whole. But on the other hand, allowing men to participate in the law and management roles put women and servants very much in the back seat of power, no matter what their strengths or efforts. And it created a real divide that makes no sense to a modern viewer.\nReview Title: A great idea\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has enjoyed numerous positive experiences with purchased films and documentaries, frequently praising their aesthetic value and emotional depth. The love for beautiful animation, captivating storytelling, and well-executed direction shines through, especially regarding films that evoke profound feelings. The user appreciates documentaries that provide unique insights and perspectives, celebrating creativity in art and food. Enthusiasm for engaging content is also evident, as noted in the appreciation for charismatic hosts and well-crafted narratives that enhance viewing experiences.\n\nNEGATIVE SUMMARY:\nThere are several instances of dissatisfaction, particularly regarding storytelling that lacks depth or poignancy. The user has expressed disappointment in certain narratives feeling incomplete or trivial, especially in animated films aimed at family audiences. Critiques also emerged regarding the pacing and focus of certain documentaries, with comments on unpreparedness and the need for structured leadership dynamics falling short of expectations. Overall, this user’s experiences indicate a desire for richness in storytelling that matches their appreciation for visual and thematic allure.\n\nOVERALL SUMMARY:\nThis user exhibits a strong preference for beautifully crafted films and documentaries that delve into complex themes and artistic expression. While they have enjoyed many products, there are notable critiques surrounding narrative depth and pacing in several titles. Positive experiences with engaging content and visuals contrast with some disappointments in less impactful storytelling. Overall, the user values quality presentation and meaningful content while being discerning about narrative execution in their viewing choices.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Excellent, thought-provoking series, and great for family conversations",
    "text": "One of my all time favorite television series. It encourages the viewer to think about political situations in a less simplistic way. I am sure there are aspects that are not true to life, but the questions being asked in the show, and played out in episodes, are the kinds of issues that citizens around the world should be asking of governments. The show makes good effort not to be biased toward Democratic or Republican. And I think the effort toward neutrality like that, for a show like this, is a wonderful goal, even if not perfect.",
    "images": [],
    "asin": "B083N3DP5F",
    "parent_asin": "B083N3DP5F",
    "user_id": "AG7IBD4EPP6H3YUNAKJ65VC4X7XA",
    "timestamp": "2022-02-01 16:26:02.021000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Madam Secretary: The Final Season",
    "average_rating": 4.8,
    "rating_number": 960,
    "features": [],
    "description": [
      "When the U.S. Secretary of State is killed in a mysterious plane crash, former CIA analyst Dr. Elizabeth McCord (Tea Leoni) is recruited to replace him. But while McCord has an excellent understanding of the dangers the country faces in the modern world, nothing could have prepared her for the complexities of the American political machine. Tim Daly, Bebe Neuwirth, Zeljko Ivanek, Erich Bergen also star in this taut drama series.10 episodes on 3 discs. 7 1/4 hrs. Widescreen; Soundtracks: English Dolby Digital 5.1, Dolby Digital stereo Surround; Subtitles: English (SDH)."
    ],
    "price": null,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/415l8p4uSPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/415l8p4uSPL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/711lYPtecfL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Tim Daly  (Actor),     Kevin Rahm  (Actor)    Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "Paramount Home Entertainment"
    ],
    "details": {
      "Genre": "Drama/Television, Television",
      "Format": "Subtitled, NTSC",
      "Contributor": "Tea Leoni, Patina Miller, Tim Daly, Kevin Rahm, Zeljko Ivanek",
      "Language": "English",
      "Number Of Discs": "3",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 4 Ounces",
      "Media Format": "Subtitled, NTSC",
      "Run time": "7 hours and 12 minutes",
      "Release date": "April 7, 2020",
      "Actors": "Tim Daly, Kevin Rahm, Tea Leoni, Patina Miller, Zeljko Ivanek",
      "Studio": "Paramount Pictures Home Entertainment",
      "Number of discs": "3"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}