{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hair Extensions Tape in Human Hair Moresoo Real Hair Extensions Glue in Seamless Double Sided Tape 18inch Human Tape in Hair Extensions 20Pieces 50Grams Blonde Hair Extensions\nReview Date: 2021/09/09\nStore: Moresoo\nAverage Rating: 2.2\nProduct Details: {'Brand': 'Moresoo', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Normal', 'Material Feature': 'Natural', 'Package Dimensions': '7.4 x 4 x 1.5 inches; 11.22 Ounces'}\nReview Text: I'm really happy with these extensions, the hair is beautiful.  The color is fantastic and really matches mine.  Each weft has good thickness and this really feels like a full 50g.  It added a lot of fullness to my hair.  The tape is great, they've stayed in for many washes now.  I don't think I've had to replace any of them yet.  The hair has stayed healthy looking and feeling.  I will definitely order these again.  I recommend.\nReview Title: Gorgeous hair color & quality\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "HAIRCUBE Natural Looking Short Blonde Wigs Pixie Cut Dark Root Ombre Blonde Wigs with Bangs Wigs for Women\nHAIRCUBE\n{'Material': 'Memory Fiber', 'Hair Type': 'Pixie Cut', 'Style': 'Modern', 'Brand': 'HAIRCUBE', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 7.8 x 3.2 inches; 3.99 Ounces', 'Item model number': 'aswig61-wm3045'}\nI love this!  This is the best short wig I've come across. It looks so real, especially the coloring and the quality of the hair.  Straight from the box it was ready to go on and wear.  You can style it many different ways.  It has 3 clips inside and there is enough room to hide my long hair.  I absolutely recommend it.\nLove! So natural looking, easy to style, great color\nMagnetic Eyelashes with Eyeliner Kit - 8 Pairs Invisible Magnetic False Eyelashes and Black Eyeliner of 2 Tubes Sets, Auchois 3D Reusable Natural Look Fake Eyelashes, Faux Mink Lashes Pack\nAUCHOIS\n{'Brand': 'AUCHOIS', 'Material': 'Faux Mink', 'Item Dimensions LxWxH': '9.2 x 5.7 x 0.78 inches', 'Material Feature': 'Latex Free', 'Unit Count': '1.00 Count', 'Product Dimensions': '9.2 x 5.7 x 0.78 inches; 2.4 Ounces', 'Item model number': 'BME001'}\nThis is a nice set for all the options you get and most look really natural.  They're decent pairs for the price.  I just don't prefer this thin magnetic strip, I like having individual magnets on the lashes.  The thin strip is not as strong magnetically and you can't re-use these as often because it's difficult to keep the strip clean. The liner is basic like all the other kits have, I have found a different liner I really like that I use with all my lashes.  Personally I wouldn't order these again.\nNatural looking, thin magnetic strip\nHair Extensions Tape in Human Hair Moresoo Real Hair Extensions Glue in Seamless Double Sided Tape 18inch Human Tape in Hair Extensions 20Pieces 50Grams Blonde Hair Extensions\nMoresoo\n{'Brand': 'Moresoo', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Normal', 'Material Feature': 'Natural', 'Package Dimensions': '7.4 x 4 x 1.5 inches; 11.22 Ounces'}\nI'm really happy with these extensions, the hair is beautiful.  The color is fantastic and really matches mine.  Each weft has good thickness and this really feels like a full 50g.  It added a lot of fullness to my hair.  The tape is great, they've stayed in for many washes now.  I don't think I've had to replace any of them yet.  The hair has stayed healthy looking and feeling.  I will definitely order these again.  I recommend.\nGorgeous hair color & quality",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** Short wigs with a natural appearance and modern styling options; recently expanded interest to include hair extensions, indicating a desire for fuller hairstyles and seamless blending with natural hair.\n- **Quality Focus:** Continues to value realistic color and high overall quality in hair products, showing a keen eye for effective materials. The user has reaffirmed their appreciation for products that deliver both quality and aesthetic appeal.\n- **Ease of Use:** Maintains a preference for user-friendly, ready-to-wear products across both wigs and hair extensions, underscoring a consistent attraction to convenience in personal care.\n- **Styling Versatility:** Seeks versatility in styling options that align with their evolving interests in both hair and makeup products, favoring items that enable a range of looks.\n- **Positive Experiences:** Demonstrated high satisfaction with recent purchases, celebrating the quality and color match of hair extensions. However, there remains a noted importance of usability in product features, suggesting a balanced perspective.\n- **Recommendation Behavior:** Willing to recommend products that meet expectations, yet is increasingly cautious in their evaluations, implying a thoughtful approach to sharing experiences based on both past satisfaction and recent interactions.\n\nOverall, this user is committed to high-quality, natural-looking personal care products that offer ease of use and versatility while continuing to refine their standards for product performance and usability.",
  "metrics": {
    "rouge1_f": 0.26426426426426425,
    "rouge2_f": 0.030120481927710843,
    "rougeL_f": 0.11111111111111112,
    "meteor": 0.1192499771434301,
    "bleu1": 0.12439089018027188,
    "bleu2": 0.025706157142547634,
    "bleu3": 0.004449285258671092,
    "bleu4": 0.0018527247113724144,
    "bertscore_precision": 0.37159937620162964,
    "bertscore_recall": 0.4374748468399048,
    "bertscore_f1": 0.4018552899360657
  }
}