{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Magnetic Eyelashes with Eyeliner Kit - 8 Pairs Invisible Magnetic False Eyelashes and Black Eyeliner of 2 Tubes Sets, Auchois 3D Reusable Natural Look Fake Eyelashes, Faux Mink Lashes Pack\nReview Date: 2021/08/24\nStore: AUCHOIS\nAverage Rating: 3.7\nProduct Details: {'Brand': 'AUCHOIS', 'Material': 'Faux Mink', 'Item Dimensions LxWxH': '9.2 x 5.7 x 0.78 inches', 'Material Feature': 'Latex Free', 'Unit Count': '1.00 Count', 'Product Dimensions': '9.2 x 5.7 x 0.78 inches; 2.4 Ounces', 'Item model number': 'BME001'}\nReview Text: This is a nice set for all the options you get and most look really natural.  They're decent pairs for the price.  I just don't prefer this thin magnetic strip, I like having individual magnets on the lashes.  The thin strip is not as strong magnetically and you can't re-use these as often because it's difficult to keep the strip clean. The liner is basic like all the other kits have, I have found a different liner I really like that I use with all my lashes.  Personally I wouldn't order these again.\nReview Title: Natural looking, thin magnetic strip\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "HAIRCUBE Natural Looking Short Blonde Wigs Pixie Cut Dark Root Ombre Blonde Wigs with Bangs Wigs for Women\nHAIRCUBE\n{'Material': 'Memory Fiber', 'Hair Type': 'Pixie Cut', 'Style': 'Modern', 'Brand': 'HAIRCUBE', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 7.8 x 3.2 inches; 3.99 Ounces', 'Item model number': 'aswig61-wm3045'}\nI love this!  This is the best short wig I've come across. It looks so real, especially the coloring and the quality of the hair.  Straight from the box it was ready to go on and wear.  You can style it many different ways.  It has 3 clips inside and there is enough room to hide my long hair.  I absolutely recommend it.\nLove! So natural looking, easy to style, great color\nMagnetic Eyelashes with Eyeliner Kit - 8 Pairs Invisible Magnetic False Eyelashes and Black Eyeliner of 2 Tubes Sets, Auchois 3D Reusable Natural Look Fake Eyelashes, Faux Mink Lashes Pack\nAUCHOIS\n{'Brand': 'AUCHOIS', 'Material': 'Faux Mink', 'Item Dimensions LxWxH': '9.2 x 5.7 x 0.78 inches', 'Material Feature': 'Latex Free', 'Unit Count': '1.00 Count', 'Product Dimensions': '9.2 x 5.7 x 0.78 inches; 2.4 Ounces', 'Item model number': 'BME001'}\nThis is a nice set for all the options you get and most look really natural.  They're decent pairs for the price.  I just don't prefer this thin magnetic strip, I like having individual magnets on the lashes.  The thin strip is not as strong magnetically and you can't re-use these as often because it's difficult to keep the strip clean. The liner is basic like all the other kits have, I have found a different liner I really like that I use with all my lashes.  Personally I wouldn't order these again.\nNatural looking, thin magnetic strip",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** Short wigs with a natural appearance and modern styling options; recently explored magnetic false eyelashes, showing interest in enhancing overall aesthetics.\n- **Quality Focus:** Values realistic color and overall quality in hair products and is discerning in makeup, indicating a preference for high-quality materials yet exhibiting some flexibility based on product utility and price.\n- **Ease of Use:** Prefers user-friendly products that are ready to wear straight out of the box, demonstrating a consistent attraction to convenience in both wigs and beauty tools.\n- **Styling Versatility:** Appreciates versatility in styling options, which extends to both hair products and false eyelashes, indicating a trend towards products that facilitate various looks.\n- **Positive Experiences:** Enjoys products that deliver on their promises, reflected in a high satisfaction rate, although recently expressed a more critical viewpoint on a product's usability, highlighting the importance of specific features.\n- **Recommendation Behavior:** Likely to recommend products that meet or exceed expectations, although the recent interaction shows a more cautious approach, indicating a willingness to reevaluate based on experiences.\n\nOverall, this user continues to lean towards high-quality, natural-looking personal care products that provide ease of use, but is also becoming more discerning regarding specific product features and usability.",
  "metrics": {
    "rouge1_f": 0.23529411764705882,
    "rouge2_f": 0.03543307086614173,
    "rougeL_f": 0.11372549019607843,
    "meteor": 0.13229678123295144,
    "bleu1": 0.17217015069678546,
    "bleu2": 0.041234708090271584,
    "bleu3": 0.007497148294673431,
    "bleu4": 0.0031998372203054406,
    "bertscore_precision": 0.4000147581100464,
    "bertscore_recall": 0.44349485635757446,
    "bertscore_f1": 0.4206341803073883
  }
}