{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/03/06\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Kenneth Branagh'], 'Producers': ['Ridley Scott', 'Mark Gordon', 'Simon Kinberg', 'Kenneth Branagh', 'Judy Hofflund', 'Michael Schaefer'], 'Starring': ['Kenneth Branagh', 'Penélope Cruz', 'Johnny Depp'], 'Studio': ['Kinberg Genre;The Mark Gordon Company;Scott Free']}\nReview Text: Compared to the 1974 version, the actors and their dialogues seemed somewhat anemic.  The 1974 version had meatier depths of character for all the travelers.  The photography was beautiful.  I found it more comical than a drama, mostly because of Branagh's overly long mustache.  Hard to make Poirot believable.  He is usually a fine actor and is taken seriously as an actor.  What was he thinking?  It was a humorous distraction.\nReview Title: The photography was beautiful. I found it more comical than a drama\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "The Mystery of Edwin Drood\nDrama\n['Acclaimed screenwriter Gwyneth Hughes brings to life this unfinished tale of obsessive love and betrayal, the last story Charles Dickens would ever write before his death.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Diarmuid Lawrence'], 'Producers': ['BBC'], 'Starring': ['Matthew Rhys (\"Brothers & Sisters\")', 'Julia MacKenzie (\"Miss Marple\")']}\nGreat drama!  Don't miss this.\nWOW!  Great drama.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Vince Gilligan', 'Thomas Schnauz', 'Peter Gould', 'Michael Morris', 'Adam Bernstein', 'Michelle MacLaren', 'Colin Bucksey', 'John Shiban', 'Larysa Kondracki', 'Terry McDonough'], 'Producers': ['Melissa Bernstein', 'Mark Johnson', 'Vince Gilligan', 'Peter Gould'], 'Studio': ['American Movie Classics (AMC)']}\nLOVE this and so does my 85-year-old-mother.  Right now, she is ill and this series makes her laugh and take her mind off her pains.  I know the writers have already thought of this, but I can't wait for the episode when Howard OR Chuck needs James's help so we can see what kind of a person James really is.  Let him show up the other two jerks.  TWO THUMBS UP.  Thanks for not dragging a romance into what should be kept an interesting comedy.  Kim is lovely, but I hope that part stays platonic.  GOOD LUCK WITH SEASON 2.\nGives my ailing mother a reprieve from her illness.  We both LOVE JIMMY\n{'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vince Gilligan', 'Thomas Schnauz', 'Peter Gould', 'Michael Morris', 'Adam Bernstein', 'Michelle MacLaren', 'Colin Bucksey', 'John Shiban', 'Larysa Kondracki', 'Terry McDonough'], 'Producers': ['Thomas Schnauz', 'Melissa Bernstein', 'Mark Johnson', 'Vince Gilligan', 'Peter Gould'], 'Studio': ['American Movie Classics (AMC)']}\nThis is the ONLY THING WORTH WATCHING on TV and has been the only thing for both seasons.  Unfortunately, I now must wait for season 3.  I'll have to go through the next 10 months without it.  KEEP up the good work, Jonathan, Bob, and Rhee.  I also like the other characters, the acting is very good, but I don't like the kind of characters they represent.  Howard is a p---k.  So is Chuck.  Both are great actors.\nKEEP up the good work, Jonathan\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vince Gilligan', 'Thomas Schnauz', 'Peter Gould', 'Michael Morris', 'Adam Bernstein', 'Michelle MacLaren', 'Colin Bucksey', 'John Shiban', 'Larysa Kondracki', 'Terry McDonough'], 'Producers': ['Gennifer Hutchison', 'Thomas Schnauz', 'Melissa Bernstein', 'Mark Johnson', 'Vince Gilligan', 'Peter Gould']}\nAs everyone knows, this show is ADDICTIVE and once you watch it, there's no going back.  Even my 87-year-old mother watches it and tries to out-guess what is going to happen.  One question I would have:  Why didn't Kim hire Jimmy to be her paralegal?  In that role, he wouldn't be practicing.  But, it would destroy his attempt to get rid of his air time on TV.  GREAT JOB by all actors.  The writers are to be commended also.  We love those characters we are supposed to love and hate the ones we are supposed to (namely Hector, Chuck and Howard.)  But they still do a great job of acting.  In Episode 9, you almost (ALMOST) have to feel sorry for Chuck.  As brilliant an attorney as he is, he is turning into a truly pathetic creature, which is strange, now that he has licked his anti-electricity problem.\nWARNING !!!  ADDICTIVE !!!\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Kenneth Branagh'], 'Producers': ['Ridley Scott', 'Mark Gordon', 'Simon Kinberg', 'Kenneth Branagh', 'Judy Hofflund', 'Michael Schaefer'], 'Starring': ['Kenneth Branagh', 'Penélope Cruz', 'Johnny Depp'], 'Studio': ['Kinberg Genre;The Mark Gordon Company;Scott Free']}\nCompared to the 1974 version, the actors and their dialogues seemed somewhat anemic.  The 1974 version had meatier depths of character for all the travelers.  The photography was beautiful.  I found it more comical than a drama, mostly because of Branagh's overly long mustache.  Hard to make Poirot believable.  He is usually a fine actor and is taken seriously as an actor.  What was he thinking?  It was a humorous distraction.\nThe photography was beautiful. I found it more comical than a drama",
  "profile": "User Profile Summary:\n\n- **Content Preference**: The user exhibits a strong affinity for drama and adaptations of literary classics, showcasing a keen appreciation for intricately crafted comedies that blend humor with character depth. Their recent interactions emphasize a particular enjoyment of high-quality dramatic series known for addictive storytelling and complex characters.\n  \n- **Themes**: The user favors narratives that explore intricate emotional dynamics and complex relationships, often steering away from traditional romantic plots, further enhancing their interest in character-driven storytelling.\n\n- **Quality Focus**: Maintaining high production quality standards, the user prefers emotionally resonant content that offers personal fulfillment and is conducive to shared enjoyment with loved ones.\n\n- **Engagement Style**: They are enthusiastic and positive reviewers, demonstrating a strong emotional connection to their viewing experiences. They express thoughtful appreciation for the artistic efforts of creators and cast members.\n\n- **Viewer Demographics**: The user shows a preference for English-language productions with accessible subtitles, which significantly influences their content choices.\n\n- **Additional Interests**: They value critically acclaimed and award-winning works, reflecting a commitment to thoughtfully crafted narratives that resonate personally and communally.\n\n- **Recent Interaction Insight**: The latest review highlights the user's growing perception of certain dramas veering into the comedic, particularly when elements detract from the seriousness of characters, underscoring their nuanced expectations for narrative depth and authenticity in performances.",
  "metrics": {
    "rouge1_f": 0.17811158798283264,
    "rouge2_f": 0.0064516129032258064,
    "rougeL_f": 0.0815450643776824,
    "meteor": 0.05864107783270331,
    "bleu1": 0.01352879734976503,
    "bleu2": 0.003688834565580807,
    "bleu3": 0.0006117612464611366,
    "bleu4": 0.00024936169159701135,
    "bertscore_precision": 0.35374897718429565,
    "bertscore_recall": 0.44577521085739136,
    "bertscore_f1": 0.39446592330932617
  }
}