{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/07/05\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jim Sheridan'], 'Producers': ['Noel Pearson', 'Rob Quigley'], 'Starring': ['Rooney Mara', 'Vanessa Redgrave', 'Eric Bana'], 'Studio': ['Vertical Entertainment']}\nReview Text: Poignant, deep character development, played superbly by Redgrave (masterful performance) along with Rooney Mara (the young and long-suffering, misaligned woman who, through no fault of her own, was persecuted by not only the church, but the small-minds of her village.  As a result, she was made to waste her life in a madhouse, with the staff believing she had killed her baby.  After 50 years, the tale is finally revealed in a truth that could have given her a joyful life...but didn't until the very end.\nReview Title: Wonderful plot, portrayed by acting in which each character had a deeply developed character and personality.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Mystery of Edwin Drood\nDrama\n['Acclaimed screenwriter Gwyneth Hughes brings to life this unfinished tale of obsessive love and betrayal, the last story Charles Dickens would ever write before his death.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Diarmuid Lawrence'], 'Producers': ['BBC'], 'Starring': ['Matthew Rhys (\"Brothers & Sisters\")', 'Julia MacKenzie (\"Miss Marple\")']}\nGreat drama!  Don't miss this.\nWOW!  Great drama.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Vince Gilligan', 'Thomas Schnauz', 'Peter Gould', 'Michael Morris', 'Adam Bernstein', 'Michelle MacLaren', 'Colin Bucksey', 'John Shiban', 'Larysa Kondracki', 'Terry McDonough'], 'Producers': ['Melissa Bernstein', 'Mark Johnson', 'Vince Gilligan', 'Peter Gould'], 'Studio': ['American Movie Classics (AMC)']}\nLOVE this and so does my 85-year-old-mother.  Right now, she is ill and this series makes her laugh and take her mind off her pains.  I know the writers have already thought of this, but I can't wait for the episode when Howard OR Chuck needs James's help so we can see what kind of a person James really is.  Let him show up the other two jerks.  TWO THUMBS UP.  Thanks for not dragging a romance into what should be kept an interesting comedy.  Kim is lovely, but I hope that part stays platonic.  GOOD LUCK WITH SEASON 2.\nGives my ailing mother a reprieve from her illness.  We both LOVE JIMMY\n{'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vince Gilligan', 'Thomas Schnauz', 'Peter Gould', 'Michael Morris', 'Adam Bernstein', 'Michelle MacLaren', 'Colin Bucksey', 'John Shiban', 'Larysa Kondracki', 'Terry McDonough'], 'Producers': ['Thomas Schnauz', 'Melissa Bernstein', 'Mark Johnson', 'Vince Gilligan', 'Peter Gould'], 'Studio': ['American Movie Classics (AMC)']}\nThis is the ONLY THING WORTH WATCHING on TV and has been the only thing for both seasons.  Unfortunately, I now must wait for season 3.  I'll have to go through the next 10 months without it.  KEEP up the good work, Jonathan, Bob, and Rhee.  I also like the other characters, the acting is very good, but I don't like the kind of characters they represent.  Howard is a p---k.  So is Chuck.  Both are great actors.\nKEEP up the good work, Jonathan\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vince Gilligan', 'Thomas Schnauz', 'Peter Gould', 'Michael Morris', 'Adam Bernstein', 'Michelle MacLaren', 'Colin Bucksey', 'John Shiban', 'Larysa Kondracki', 'Terry McDonough'], 'Producers': ['Gennifer Hutchison', 'Thomas Schnauz', 'Melissa Bernstein', 'Mark Johnson', 'Vince Gilligan', 'Peter Gould']}\nAs everyone knows, this show is ADDICTIVE and once you watch it, there's no going back.  Even my 87-year-old mother watches it and tries to out-guess what is going to happen.  One question I would have:  Why didn't Kim hire Jimmy to be her paralegal?  In that role, he wouldn't be practicing.  But, it would destroy his attempt to get rid of his air time on TV.  GREAT JOB by all actors.  The writers are to be commended also.  We love those characters we are supposed to love and hate the ones we are supposed to (namely Hector, Chuck and Howard.)  But they still do a great job of acting.  In Episode 9, you almost (ALMOST) have to feel sorry for Chuck.  As brilliant an attorney as he is, he is turning into a truly pathetic creature, which is strange, now that he has licked his anti-electricity problem.\nWARNING !!!  ADDICTIVE !!!\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Kenneth Branagh'], 'Producers': ['Ridley Scott', 'Mark Gordon', 'Simon Kinberg', 'Kenneth Branagh', 'Judy Hofflund', 'Michael Schaefer'], 'Starring': ['Kenneth Branagh', 'Penélope Cruz', 'Johnny Depp'], 'Studio': ['Kinberg Genre;The Mark Gordon Company;Scott Free']}\nCompared to the 1974 version, the actors and their dialogues seemed somewhat anemic.  The 1974 version had meatier depths of character for all the travelers.  The photography was beautiful.  I found it more comical than a drama, mostly because of Branagh's overly long mustache.  Hard to make Poirot believable.  He is usually a fine actor and is taken seriously as an actor.  What was he thinking?  It was a humorous distraction.\nThe photography was beautiful. I found it more comical than a drama\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gus Van Sant', 'Ryan Murphy', 'Gwyneth Horder-Payton', 'Helen Hunt', 'Liza Johnson', 'Tim Minear'], 'Producers': ['Eric Kovtun', 'Tanase Popa', 'Dede Gardner', 'Jessica Lange'], 'Studio': ['FX']}\nThis was very entertaining, but in real life, I sincerely doubt Bette Davis ever considered Joan Crawford as a real rival.  Her many nominations by The Academy speak for itself.\nThis was very entertaining, but in real life, ...\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jim Sheridan'], 'Producers': ['Noel Pearson', 'Rob Quigley'], 'Starring': ['Rooney Mara', 'Vanessa Redgrave', 'Eric Bana'], 'Studio': ['Vertical Entertainment']}\nPoignant, deep character development, played superbly by Redgrave (masterful performance) along with Rooney Mara (the young and long-suffering, misaligned woman who, through no fault of her own, was persecuted by not only the church, but the small-minds of her village.  As a result, she was made to waste her life in a madhouse, with the staff believing she had killed her baby.  After 50 years, the tale is finally revealed in a truth that could have given her a joyful life...but didn't until the very end.\nWonderful plot, portrayed by acting in which each character had a deeply developed character and personality.",
  "profile": "User Profile Summary:\n\n- **Content Preference**: The user exhibits a robust affinity for drama and adaptations of literary classics, with a noted appreciation for intricately crafted narratives that blend humor with character depth. Recent interactions reinforce their enjoyment of high-quality dramatic series characterized by addictive storytelling and complex characters.\n\n- **Themes**: They favor narratives exploring intricate emotional dynamics and complex relationships, consistently avoiding traditional romantic plots in favor of character-driven storytelling. Their latest interaction highlights a keen interest in deep character development and emotional resonance.\n\n- **Quality Focus**: The user values high production quality and emotionally resonant content that fosters personal fulfillment and is ideal for shared viewing experiences. They maintain a critical lens on authenticity and narrative depth, particularly in historical contexts.\n\n- **Engagement Style**: Enthusiastic and thoughtful reviewers, they express a strong emotional connection to their viewing experiences, appreciating the artistic efforts of creators and actors alike.\n\n- **Viewer Demographics**: A preference for English-language productions with accessible subtitles continues to guide their content choices.\n\n- **Additional Interests**: They remain committed to critically acclaimed and award-winning works, reflecting a deep appreciation for thoughtfully crafted narratives.\n\n- **Recent Interaction Insight**: Their latest review emphasizes poignant storytelling and masterful performances, underlining their nuanced expectation for authenticity in character portrayals while recognizing the importance of emotional depth in narratives.",
  "metrics": {
    "rouge1_f": 0.14608695652173914,
    "rouge2_f": 0.008710801393728223,
    "rougeL_f": 0.06956521739130435,
    "meteor": 0.044876696295970665,
    "bleu1": 0.0036045579243957895,
    "bleu2": 0.0007788225562214389,
    "bleu3": 0.000294772200370291,
    "bleu4": 0.00010207429935900861,
    "bertscore_precision": 0.35302525758743286,
    "bertscore_recall": 0.445942759513855,
    "bertscore_f1": 0.3940809965133667
  }
}