{
  "interaction_number": 18,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sallcks Long Black Wavy Wigs for Women Long Curly Wavy Wig with Blonde Highlight Middle Part Cosplay Halloween Synthetic Hair Full Wig for Women (Black Blonde)\nReview Date: 2021/09/05\nStore: Sallcks\nAverage Rating: 3.4\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Brand': 'Sallcks', 'Package Dimensions': '10 x 6 x 1.05 inches; 9.91 Ounces'}\nReview Text: This wig is very nice. It fit on okay. The quality seemed fine. It was a good deal. It looked somewhat realistic… obviously not like one of the $500 ones, but it is fine. It was comfortable to wear. It was easy to put on. It was cute. It was fun to wear for everyday use or for a costume. I would recommend it.\nReview Title: Good wig\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Norelco 8894XL\nNorelco\n['Product Description', 'James Bond\\'s razor of choice, this rechargeable Norelco Spectra shaver features a sleek design with 3 individually floating heads adjustable to your skin type.The selector dial adjusts spring and pressure of floating heads with 9 settings for sensitive to normal skin. A 2-stage cutting action with lift and cut technology uses slots to cut long hairs and holes to shave stubble smooth, while the full-width pop-up trimmer handles the detail work. The integrated LED display shows shaving minutes remaining, plus cleaning and head replacement indicators. A 1-hour full-charge gives you 100 shaving minutes, while the 2-minute power-charge provides a 3-minute shave. When you\\'re done, simply rinse clean. Includes deluxe leather pouch, stand, recharging power cord, cleaning brush and travel pouch. Automatic worldwide voltage adjustment. No. 8894XL. Imported. 5-1/2L\".', 'Amazon.com', \"Licensed to shave closely and painlessly, this cord/cordless electric shaver is designated Norelco's James Bond model not only because it's high-tech but also because its heads can be adjusted to suit the sensitivity of 00-anyone's skin. The shaver has a comfort-control dial that varies the spring and pressure of the three floating heads through nine settings. Roger Moore might opt for a gentle setting, while Sean Connery surely would choose a firmer setting--and novices to grizzled veterans can please their faces as well. For this model, Norelco has also improved the lift and cut, below-skin shaving technology of its two-stage cutting system, which provides slots for longer hairs and holes for stubble while the floating heads are adjusting individually to facial contours. A full-width trimmer pops up for neat work on sideburns and mustaches.\", 'More tech-chic comes in the form of a polymer LED display that tells how many minutes of shaving time remain when the shaver is operating cordless on its lithium-ion battery. The LED display also warns when the heads need cleaning (all it takes is a rinsing under running water) or replacing (replacement heads available separately). An audible alarm sounds when the shaver requires recharging on its storage stand. A six-minute quick charge is good for a single shave, and a one-hour full charge provides 100 minutes of cordless shaving. The shaver fits the hand beautifully and goes on the road stylishly in its leather travel pouch, while automatically adjusting to worldwide voltage variances. It carries a 60-day, full-satisfaction, money-back guarantee and a two-year warranty against defects.', '--Fred Brack']\n{'Brand': 'Norelco', 'Power Source': 'Corded Electric', 'Included Components': 'Attachment, Charger', 'Item Weight': '1.25 Pounds', 'Head Type': 'Rotary', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '6.69 x 4.02 x 10.53 inches; 1.25 Pounds', 'Item model number': '8894XL', 'Manufacturer': 'Norelco'}\nI had a Norelco years ago, then I went through three Brauns (the micro-foil ones that a straight instead of having three circular blades like this one).  All my razors were expensive, they were all the best in the bunch.  This is the best by far.<br /><br />This razor shaves close, I have never felt my skin so smooth except when I used to use a blade.  It conforms to your skin, even my neck comes out smooth (about 4 minutes to completely shave smooth, or I'll usually shave for less than a minute and get a shave that lasts until I get home from work).  It has a timer that not only tells you exactly how many minutes of battery are left, but it also tells you how many minutes you shaved for (which comes in handy more than I thought it would).  The best feature is that you can pop the top up and rinse it in water!  My brauns cleaned with refil cartridges that were hard to find and expensive and a hassel; whereas my old Norelco cleaned with a brush and never got really clean.  This one cleans easily and quickly, and even beeps to tell you when to clean it!  Also, this razor doesn't give me razor burn like my Brauns did!!<br /><br />If you are a first time shaver, or an expierenced shaver looking for a better shave from an electric razor, this is the one for you!  I will never buy any other brand of razor again and I'll probably have this one for years to come...\nThe best razor ever!\nPARWIN Wet & Dry Flat Iron 1 1/4 Inch Hair Straightener for Women with Tourmaline Ceramic and PTC Heating, Professional Straightening Iron, Black\nNuonove\n{'Shape': 'Flat', 'Brand': 'Nuonove', 'Hair Type': 'Coarse, Color Treated, Fine, Normal, Damaged', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.86 x 3.82 x 1.93 inches; 1.23 Pounds', 'UPC': '605826620632', 'Manufacturer': 'Parwin'}\nThis did a good job with my hair. It worked as it was supposed to. It seemed like it was good quality. My hair came out looking nice after I used it. It also seemed durable. It was easy to hold and handle. I was pleased and would recommend it.\nNice flat iron\nBaby Girl Hair Clips Bows Flowers,Hair Accessories for toddler Kids Teens (Multicolored ASHXT8990 Flower)\nAsufegucd\n{'Brand': 'Asufegucd', 'Hair Type': 'All', 'Age Range (Description)': 'Kids', 'Unit Count': '1 Count', 'Pattern': 'Multicolored', 'Package Dimensions': '6.4 x 4 x 1 inches; 1.45 Ounces', 'UPC': '793740777638'}\nThese looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. They also helped keep her hair out of her face. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.\nPretty\n6 Pcs Pink Baby Girl Hair Bow Clips Set, Alligator Clip Hair Accessories with Gift Box, Back to School Dress\nAmacle\n{'Brand': 'Amacle', 'Hair Type': 'All', 'Age Range (Description)': 'Child', 'Unit Count': '6.00 Count', 'Number of Pieces': '6', 'Package Dimensions': '6 x 6 x 2 inches; 4.8 Ounces', 'UPC': '743811744526'}\nThese looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. They also helped keep her hair out of her face. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.\nGreat set\nAegenacess Wedding Hair Side Combs Silver Decorative Rhinestones Crystal Vintage Bridal Clips Accessories for Brides and Bridesmaids\nAegenacess\n{'Material': 'Silver', 'Brand': 'Aegenacess', 'Unit Count': '1.0 Ounce', 'Package Dimensions': '4.37 x 3.9 x 0.79 inches; 1.69 Ounces', 'UPC': '754909904326'}\nThis was a very pretty hair comb. The rhinestones looked very nice. It really sparkled. It would be good for a wedding or for another event. It was nicely packaged. It fit in well in my hair. It stayed okay. I like the vintage look. I think it really added to it. You can also wear it for other events than a wedding. It really can compliment the outfit. I thought it seemed durable. I thought the price was fair. I would recommend it.\nVery lovely\nKOMOREBI Snap Hair Clips 36Pcs with Hair Ties 50Pcs Beauty Candy Color Metal Hair Clips for Women girls Kids Toddlers\nKOMOREBI\n{'Brand': 'KOMOREBI', 'Hair Type': 'Chemically-treated-hair', 'Age Range (Description)': 'Child', 'Material': 'Metal', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.3 x 3.8 x 1.3 inches; 3.2 Ounces', 'UPC': '783214149214'}\nThese looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. They also helped keep her hair out of her face. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.\nPretty colors\nNail Files and Buffers, TsMADDTs Professional Manicure Tools Kit 8pcs Nail File Set, Sanding Buffer and 100 Grit File Double Surfaces 2 in 1 Nail Tools\nTsMADDTs\n{'Color': 'White', 'Brand': 'TsMADDTs', 'Grit Number': '100', 'Unit Count': '8 Count', 'Product Dimensions': '7.09 x 0.75 x 0.31 inches; 3.53 Ounces', 'Manufacturer': 'TsMADDTs'}\nThese nail files are very good. They were sturdy. They did a good job filing my nails. It is nice that you get so many of them. The colors are nice. It is a good value since it comes with so many. It lasts a really long time. I would recommend it.\nGood nail files\n10 PCS Rhinestone Hair Clips for Women and Ladies Shining Crystal Snap Clips Different Color Rhinestone Hair Pins Hair Barrettes for Party Wedding Daily Hair Decorative\nfani\n{'Brand': 'fani', 'Hair Type': 'All', 'Color': 'Gold', 'Age Range (Description)': 'Adult', 'Embellishment': 'Rhinestone', 'Package Dimensions': '6.1 x 4.1 x 0.4 inches; 4.8 Ounces'}\nThese looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. They also helped keep her hair out of her face. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.\nGreat set\nHeadbands Hair Bands Wraps for Women, Boho Floal Style Criss Cross for Sports Yoga Running Hiking Beauty Makeup Party Daily Decoration - 8 Pack\nFuhengli\n{'Material': 'Polyester, Cotton', 'Fabric Type': 'polyester', 'Brand': 'Fuhengli', 'Size': 'One Size', 'Item Form': 'Wrap', 'Product Dimensions': '9 x 3.5 x 0.7 inches; 8.01 Ounces', 'Item model number': 'Headbands - 8 Pack', 'Department': 'Womens', 'UPC': '704693076709'}\nThese looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.<br />They also helped keep her hair out of her face.\nNice set\nQIC 4D Silk Fiber Lash Mascara, Fiber Mascara, Waterproof Mascara, Natural Thick Thickening and Lengthening Mascara Lasting All Day\nJoruby\n{'Brand': 'Joruby', 'Unit Count': '1.00 Count', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '5.3 x 0.8 x 0.8 inches; 0.81 Ounces'}\nThis mascara was very nice.<br /><br />I was happy with the makeup. It did a good job of flattering me. It highlighted the good features.<br /><br />It went on well. It felt fine on. I didn’t have any reactions or problems or anything.<br /><br />It stayed on fairly well. It didn’t feel too heavy or anything. I was pleased with it.\nNice mascara\n100pcs Premium Quality Hair Clips, 20 Glossy Colors Snap Hair Clips, 2 Inch Hair Barrettes with Perfect Grip, Durable Colorful Hair Clips with Smooth Edges for Kids, Girls, Women\nFagaci\n{'Brand': 'Fagaci', 'Hair Type': 'All', 'Color': 'Assorted', 'Age Range (Description)': 'Adult', 'Material': 'Alloy Steel', 'Package Dimensions': '4.7 x 3.1 x 1 inches; 4.8 Ounces'}\nThese looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.<br />They also helped keep her hair out of her face.\nNice set\n8 Pcs Unicorn Butterfly Hair Clips Alligator Glitter Barrette Hair Clips For Little Girls (as pic)\nolyrjie\n{'Brand': 'olyrjie', 'Hair Type': 'All', 'Age Range (Description)': 'Child', 'Material': 'Plastic', 'Unit Count': '8.00 Count', 'Package Dimensions': '6.6 x 5 x 0.24 inches; 1.59 Ounces'}\nThese were so sparkly. I really loved these!!!!<br /><br />These looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.<br />They also helped keep her hair out of her face.\nLovely\nBaasha 4 Pcs Paddle Brush Set, Detangling Brush and Hair Comb Set, Thick Hair Brush Set for Men & Women, No More Tangle Hairbrush Comb Set, Hair Care Gift Set Hair Brush Comb Set\nBaasha\n{'Brand': 'Baasha', 'Shape': 'Rectangular', 'Handle Material': 'Rubber, Plastic', 'Product Benefits': 'Detangle', 'Unit Count': '1.00 Count', 'Package Dimensions': '10.2 x 3.43 x 2.01 inches; 7.34 Ounces'}\nThis came with a lot. It is good to use the different brushes/combs for different times.<br /><br />They did a good job with my hair. It worked as it was supposed to. It seemed like it was good quality. My hair came out looking nice after I used it. It also seemed durable. It was easy to hold and handle. I was pleased and would recommend it.\nNice set\nHair Scrunchies for women,Including 3 Pcs Long Silk Satin Hair Scarf & 3 Pcs Bunny Ear Scrunchies & 3 Pcs Elastic Hair Bands Scrunchy and 7Pcs Pearl Hair Clips,(16Pcs/9Colors)\nSuptikes\n{'Material': 'Pearl, Silk', 'Item Form': 'Scrunchie', 'Brand': 'Suptikes', 'Item Dimensions LxWxH': '5 x 5 x 0.7 inches', 'Hair Type': 'Curly', 'Product Dimensions': '5 x 5 x 0.7 inches; 7.2 Ounces', 'UPC': '760635003608'}\nThese looked very pretty in my daughter’s hair. They really stood out. They looked just like the picture. They went in and out easily. They stayed in fairly well. They were very pretty. She liked them a lot. They really made her look nice. They would also look nice for pictures. The quality was pretty decent. It is nice that it is a set and you get a bunch. I liked the variety. I was happy and would recommend it.<br />They also helped keep her hair out of her face.\nNice set\nFace and Body Paint Kit By Color Technik 24 Professional Oil Based Flash Colors, 2 Sets of 12 Color Palettes, 6 Paint Brushes 70 Stencils 2 Sponges Non-Toxic For Adults & Kids Halloween Painting Party\nColor Technik\n{'Brand': 'Color Technik', 'Package Information': 'Palette', 'Package Type': 'Palette', 'Skin Type': 'Sensitive', 'Package Dimensions': '9 x 5 x 1 inches; 8.78 Ounces', 'Item model number': 'CTFPS24'}\nThese are great for parties. It has a lot of colors. It is very nice to give a cute look. They went on well. It wasn't too difficult to apply. They looked good. The kids really enjoyed them. They would be good for a party or Halloween. They were lots of fun. I would recommend them.\nGreat for parties\n12 Sheets 3D Iridescent Butterfly Nail Art Stickers for Fingernail Toenail, Self-Adhesive Butterfly Nail Decals, Holographic Glittery Butterfly Nail Decorations for Women Girls\nRUUKON\n{'Surface Recommendation nail': '', '': 'Shape Irregular', 'Installation Type Self-Adhesive': '', 'Brand': 'RUUKON', 'Room Type': 'Anywhere', 'Theme': 'Butterflies,Butterfly', 'Number of Pieces': '12', 'Style': 'Floral', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insect', 'Unit Count': '12.00 Count', 'Package Dimensions': '5.19 x 3.22 x 0.27 inches; 0.81 Ounces', 'UPC': '704129514447'}\nI love butterflies. This was great for my nails. They were so sparkly. They looked so nice. They were a little tricky to put on, but with practice you will get better. They really were unique. The quality was good. You can give yourself a professional manicure at home for a fraction of the cost. I would recommend them.\nVery pretty\nDisney Frozen - Townley Girl Mega Nail Set with Nail Dryer Foldable Gift Set for Parties, Sleepovers and Makeovers\nTownley Girl\n{'Package Dimensions': '11.18 x 11.06 x 2.8 inches; 1.87 Pounds', 'Item model number': 'FZ2169GA', 'UPC': '719565451850'}\nThis is a very cute set. It comes with a lot. There were many different colors.  The girls really enjoyed it a lot.  Everything seemed to be good quality. The packaging looked nice. They love Disney princess, which are very popular. The quality was fine with everything.  I would recommend this.\nNice set\nSallcks Long Black Wavy Wigs for Women Long Curly Wavy Wig with Blonde Highlight Middle Part Cosplay Halloween Synthetic Hair Full Wig for Women (Black Blonde)\nSallcks\n{'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Brand': 'Sallcks', 'Package Dimensions': '10 x 6 x 1.05 inches; 9.91 Ounces'}\nThis wig is very nice. It fit on okay. The quality seemed fine. It was a good deal. It looked somewhat realistic… obviously not like one of the $500 ones, but it is fine. It was comfortable to wear. It was easy to put on. It was cute. It was fun to wear for everyday use or for a costume. I would recommend it.\nGood wig",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Good wig",
    "text": "This wig is very nice. It fit on okay. The quality seemed fine. It was a good deal. It looked somewhat realistic… obviously not like one of the $500 ones, but it is fine. It was comfortable to wear. It was easy to put on. It was cute. It was fun to wear for everyday use or for a costume. I would recommend it.",
    "images": [],
    "asin": "B095H936ZB",
    "parent_asin": "B095H936ZB",
    "user_id": "AGZZXSMMS4WRHHJRBUJZI4FZDHKQ",
    "timestamp": "2021-09-05 19:09:35.188000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Sallcks Long Black Wavy Wigs for Women Long Curly Wavy Wig with Blonde Highlight Middle Part Cosplay Halloween Synthetic Hair Full Wig for Women (Black Blonde)",
    "average_rating": 3.4,
    "rating_number": 4,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51IZwttQgTS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51IZwttQgTS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71Nrzrt97AS._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41uexeBBdcS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41uexeBBdcS.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/713GVVwBRXS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41156rAeCUS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41156rAeCUS.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71D39kf12LS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41lGTrZccrS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41lGTrZccrS.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/710DFsf-+-S._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41AwyCjwM3S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41AwyCjwM3S.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71IZoLcnBcS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41J+acm8DoS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41J+acm8DoS.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71j7KpZYVcS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Yget9xIZL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Yget9xIZL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/711POWSPf5L._SL1002_.jpg"
      }
    ],
    "videos": [],
    "store": "Sallcks",
    "categories": [],
    "details": {
      "Material": "Synthetic",
      "Hair Type": "Wavy, Curly",
      "Brand": "Sallcks",
      "Package Dimensions": "10 x 6 x 1.05 inches; 9.91 Ounces"
    },
    "bought_together": null
  }
}