{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Boar Bristle Hair Brush, Detangler Brush, Hairbrush for Long Short Thick Thin Curly Straight Wavy Dry Hair Adds Shine and Makes Hair Smooth, Best Paddle Hair Brush for Men Women Kids\nReview Date: 2020/09/09\nStore: LHIUEM\nAverage Rating: 4.5\nProduct Details: {'Brand': 'LHIUEM', 'Unit Count': '1.00 Count', 'Hair Type': 'All, Wavy, Dry, Curly, Straight', 'Material': 'Boar', 'Product Dimensions': '10.43 x 3.94 x 1.97 inches; 8.47 Ounces', 'UPC': '791523116681'}\nReview Text: I initially bought a soft bristle boar bristle brush and HATED it. I got this combination brush and I really, really like it. This gift set is great because it has a small travel brush as well as a cleaning tool and comb. I haven't used the comb but the travel brush came in really handy as I usually only with my regular comb and no brush because the brush takes up too much space. Having the smaller travel brush was nice and then the cleaning tool is awesome to clean hair out of both brushes. I would definitely recommend this set for anyone wanting a boar bristle brush.\nReview Title: Great gift pack!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "4D Silk Fiber Lash Mascara Black, Waterproof Natural Thick Fiber Mascara, Thick Thickening Lengthening, Dramatic Extension Voluminous Eyelashes Mascara, No Clumping, No Smudging Lasting All Day\nSIKEMAY\n{'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.1 inches; 2.4 Ounces', 'UPC': '764690676838', 'Manufacturer': 'SIKEMAY'}\nDoes a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. Very happy with this purchase.\nGreat mascara\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nDoes a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. I also really like the square shape of the bottle, it keeps it from rolling around on my counter when I set it down lol Very happy with this purchase.\nLong, thick lashes in an instant!\nBoar Bristle Hair Brush, Detangler Brush, Hairbrush for Long Short Thick Thin Curly Straight Wavy Dry Hair Adds Shine and Makes Hair Smooth, Best Paddle Hair Brush for Men Women Kids\nLHIUEM\n{'Brand': 'LHIUEM', 'Unit Count': '1.00 Count', 'Hair Type': 'All, Wavy, Dry, Curly, Straight', 'Material': 'Boar', 'Product Dimensions': '10.43 x 3.94 x 1.97 inches; 8.47 Ounces', 'UPC': '791523116681'}\nI initially bought a soft bristle boar bristle brush and HATED it. I got this combination brush and I really, really like it. This gift set is great because it has a small travel brush as well as a cleaning tool and comb. I haven't used the comb but the travel brush came in really handy as I usually only with my regular comb and no brush because the brush takes up too much space. Having the smaller travel brush was nice and then the cleaning tool is awesome to clean hair out of both brushes. I would definitely recommend this set for anyone wanting a boar bristle brush.\nGreat gift pack!",
  "profile": "**User Profile Summary:**\n\n- **Focus on Eye Products:** The user maintains a strong preference for eye cosmetics, particularly mascaras that amplify lash fullness and length.\n- **Performance Attributes:** Emphasizes products that successfully combine volume and length, demonstrating a consistent desire for effectiveness in makeup.\n- **Waterproof & Easy Removal:** Prefers waterproof options for lasting wear while valuing ease of removal with makeup wipes or removers, blending durability with convenience.\n- **Hypoallergenic Options:** Shows an ongoing preference for hypoallergenic products, reflecting care for skin sensitivity and a tendency towards gentle formulations.\n- **Positive Experience with Quality:** Regularly seeks high-quality items and enjoys products meeting performance expectations, as indicated by positive reviews and experiences. \n\nRecently, the user expanded their interest beyond eye cosmetics by purchasing a hairbrush that enhances hair care routines. This purchase reflects a desire for practicality and functionality in beauty tools, particularly with features that cater to various hair types and provide convenience for travel. Their satisfaction with the hairbrush's design indicates an inclination towards quality and effective solutions across different beauty categories. Overall, the user continues to gravitate towards innovative, effective beauty products that balance performance, convenience, and quality, particularly in eye makeup and hair care.",
  "metrics": {
    "rouge1_f": 0.2152886115444618,
    "rouge2_f": 0.021909233176838815,
    "rougeL_f": 0.1060842433697348,
    "meteor": 0.10223217251971604,
    "bleu1": 0.08318172742460406,
    "bleu2": 0.013520926984974214,
    "bleu3": 0.0027221070598342162,
    "bleu4": 0.0012226249410550313,
    "bertscore_precision": 0.3653084635734558,
    "bertscore_recall": 0.4245338439941406,
    "bertscore_f1": 0.3927006721496582
  }
}