{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: We're No Angels (1955)\nReview Date: 2012/10/11\nCategories: Comedy, Romance, Cheerful, Gentle\nProduct Description: [\"In Christmas, three prisoners - Joseph, Albert and Jules - escape from the Devil's Island to a small coastal town in France. They decide to rob a store to get some money and clothes and travel by ship to another place\"]\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Curtiz'], 'Producers': ['Pat Duggan'], 'Starring': ['Humphrey Bogart', 'Aldo Ray', 'Peter Ustinov']}\nReview Text: One of the best Christmas movies to ever come out of Hollywood! The cast is superb, the humor and wit is intensely understated. This  is a timeless movie!\nReview Title: YAY!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Man Who Shot Liberty Valance\nJames Stewart  (Actor),     John Wayne  (Actor),     John Ford  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, John Wayne Store, All Titles\n['A TENDERFOOT LAWYER AND A POWERFUL RANCHER ARE RIVALS IN LOVETWHO STAND TOGETHER AGAINST A RUTHLESS KILLER WHO WILL STOP AT NOTHING TO GET WHAT HE WANTS.']\n{'Format': 'Multiple Formats, Anamorphic, Black & White, Closed-captioned, Dolby, Subtitled, Widescreen, NTSCMultiple Formats, Anamorphic, Black & White, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC  See more', 'Contributor': \"Edmond O'Brien, James Warner Bellah, Andy Devine, Vera Miles, Lee Marvin, Willis Bouchey, John Qualen, John Carradine, John Wayne, Willis Goldbeck, Ken Murray, Jeanette Nolan, Carleton Young, Dorothy M. Johnson, John Ford, James StewartEdmond O'Brien, James Warner Bellah, Andy Devine, Vera Miles, Lee Marvin, Willis Bouchey, John Qualen, John Carradine, John Wayne, Willis Goldbeck, Ken Murray, Jeanette Nolan, Carleton Young, Dorothy M. Johnson, John Ford, James Stewart  See more\", 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.4 x 5.4 x 0.6 inches; 2.4 Ounces', 'Director': 'John Ford', 'Media Format': 'Multiple Formats, Anamorphic, Black & White, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 3 minutes', 'Release date': 'June 5, 2001', 'Actors': \"James Stewart, John Wayne, Vera Miles, Lee Marvin, Edmond O'Brien\", 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Dorothy M. Johnson, James Warner Bellah, Willis Goldbeck', 'Number of discs': '1'}\nGreat movie, fun characters, great message (Right wins out with courage).<br /><br />Lee Marvin almost stole the movie!<br /><br />If you love the Duke - add it to your collection.<br /><br />(Personally, I don't care if the Duke read the Hollywood phone book out loud - it would still be a GREAT movie.)\nDon't over-think it\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Todd Graff'], 'Producers': ['Michael Nathanson', 'Joseph Farrell', 'Catherine Paura', 'Broderick Johnson', 'Andrew A. Kosove', 'Timothy M. Bourne', 'Queen Latifah', 'Shakim Compere'], 'Starring': ['Queen Latifah', 'Dolly Parton', 'Keke Palmer'], 'Studio': ['WARNER BROS.']}\nThe movie had a great premise. I thought it would be on the lines of \"Sister Act\". A clean comedy with joyful music. It was until someone had to interject profanity into the movie for some strange reason. THEN we had choir members sleeping with each other - yeah - that was funny and so very Christian like. It was so sad to see beautiful voices wasted. And Dolly - what were you thinking??<br /><br /> So - turned it off (after we paid to rent it) and read a book.....\nCould have been great = Slams Christian values\nSeven Days in Utopia\nRobert Duvall  (Actor),     Lucas Black  (Actor),     Matt Russell  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Independently Distributed, Drama\n[\"SEVEN DAYS IN UTOPIA follows the story of Luke Chisolm (Lucas Black), a talented young golfer set on making the pro tour. When his first big shot turns out to be a very public disaster, Luke escapes the pressures of the game and finds himself unexpectedly stranded in Utopia, Texas, home to eccentric rancher Johnny Crawford (Robert Duvall). But Johnny's more than meets the eye, and his profound ways of looking at life force Luke to question not only his past choices, but his direction for the future.\"]\n{'Genre': 'Drama, Sports', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Lucas Black, Matt Russell, Robert Duvall, Deborah Ann Woll, Jerry Ferrara, Madison Burge, Melissa Leo, KJ ChoiLucas Black, Matt Russell, Robert Duvall, Deborah Ann Woll, Jerry Ferrara, Madison Burge, Melissa Leo, KJ Choi  See more', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.5 x 5.5 x 7.7 inches; 3.2 Ounces', 'Item model number': 'ARCE82451DVD', 'Director': 'Matt Russell', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'November 29, 2011', 'Actors': 'Robert Duvall, Lucas Black, Melissa Leo, Deborah Ann Woll, Madison Burge', 'Studio': 'Arc Entertainment', 'Number of discs': '1'}\nAbsolutely stunning in its simplicity and truth. A MUST SEE for Fathers, coaches, professionals in all walks of life. Give this as a gift to someone you love!\nAwesome\nWe're No Angels (1955)\nComedy, Romance, Cheerful, Gentle\n[\"In Christmas, three prisoners - Joseph, Albert and Jules - escape from the Devil's Island to a small coastal town in France. They decide to rob a store to get some money and clothes and travel by ship to another place\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Curtiz'], 'Producers': ['Pat Duggan'], 'Starring': ['Humphrey Bogart', 'Aldo Ray', 'Peter Ustinov']}\nOne of the best Christmas movies to ever come out of Hollywood! The cast is superb, the humor and wit is intensely understated. This  is a timeless movie!\nYAY!",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user maintains a strong affinity for classic Western films featuring iconic actors and directors like John Wayne and John Ford, while also expressing a newfound appreciation for comedic films with musical elements that align with traditional values.\n\n- **Viewing Preferences:** Continues to favor films with strong narratives that emphasize moral themes such as courage and justice. The user is sensitive to contemporary content that may conflict with their Christian values.\n\n- **Rating Behavior:** Consistently rates films highly (often 5.0), reflecting a discerning approach. Their recent review highlights a preference for films that combine humor with traditional storytelling, reinforcing their critical stance on content and morality.\n\n- **Content Engagement:** Enjoys entertainment but becomes frustrated if themes detract from a film's potential. Character-driven narratives must meet appropriate standards for the user to fully enjoy them.\n\n- **Collection Mindset:** Demonstrates a desire to build a collection of significant works, particularly those featuring beloved actors, showcasing a collector mentality towards classic films.\n\n- **Open-mindedness:** While generally light-hearted about cinema, the user’s latest interaction reveals a growing appreciation for films that blend humor and traditional storylines, reinforcing their criteria focused on moral themes and integrity in viewing experiences.\n\nOverall, the user is increasingly drawn to films that embody classic storytelling while maintaining a discerning eye towards contemporary interpretations of moral themes.\n",
  "metrics": {
    "rouge1_f": 0.1346153846153846,
    "rouge2_f": 0.009633911368015415,
    "rougeL_f": 0.07307692307692308,
    "meteor": 0.04947979260863029,
    "bleu1": 0.0091681523238626,
    "bleu2": 0.0027851034529241298,
    "bleu3": 0.0009372363324468509,
    "bleu4": 0.00030601510211727175,
    "bertscore_precision": 0.34760743379592896,
    "bertscore_recall": 0.42676836252212524,
    "bertscore_f1": 0.38314175605773926
  }
}