{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/04/30\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Lewis Teague'], 'Producers': ['Michael Douglas'], 'Starring': ['Michael Douglas', 'Kathleen Turner', 'Danny DeVito'], 'Studio': ['20th Century Fox']}\nReview Text: Great movie , lot's of laughs. A little off color language but not terrible.\nReview Title: Grab your popcorn and enjoy.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Columbo: The Complete Series\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Editor's Picks\n['Legendary Peter Falk is a four-time Primetime Emmy Award-winner for his iconic role as the beloved, trenchcoat-wearing Police Lieutenant Columbo. Columbo is the landmark series that inspired a genre. And now, for the first time ever, all 69 episodes from its seven seasons and all 24 television movies are together in this 34-disc anthology. Every criminal, every innocent victim (and some not-so-innocent ones), and every wily deduction are here in one definitive collection. Seemingly befuddled but always brilliant, the cigar-chomping detective will have you following the clues and asking \"just one more thing\" until the last case is cracked.   Note: This set contains 34 discs which are contained in 8 cases.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Pounds', 'Media Format': 'Color, Full Screen, Widescreen, NTSC', 'Run time': '99 hours and 52 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Peter Falk', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), Unknown (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal', 'Number of discs': '34'}\nThis will be our Winter entertainment and really looking forward to it. Missed out on Gold Box deal but caught it on sale later and great savings. Loved the &#34;Due South&#34; boxed set.\nNot viewed yet.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Simon'], 'Starring': ['Barry Gibb', 'Robin Gibb', 'Maurice Gibb', 'Matt Bonelli'], 'Studio': ['Eagle Rock Entertainment']}\nLoved it..\nGreat Concert in Vegas\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Lewis Teague'], 'Producers': ['Michael Douglas'], 'Starring': ['Michael Douglas', 'Kathleen Turner', 'Danny DeVito'], 'Studio': ['20th Century Fox']}\nGreat movie , lot's of laughs. A little off color language but not terrible.\nGrab your popcorn and enjoy.",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user has a strong affinity for classic television and entertainment, particularly iconic series with engaging narratives. Their appreciation for live music events and performances continues to grow, indicating an expanding taste in entertainment beyond scripted content. The user maintains a preference for detective genres and character-driven stories, while also enjoying comedic films with notable actors.\n\n- **Buying Behavior:** They actively seek deals and discounts, showcasing a value-driven purchasing approach. The user is interested in bundled collections for comprehensive viewing experiences, while now also exploring concert films and music-related content alongside comedic and dramatic movies.\n\n- **Content Consumption:** The user has a clear inclination for binge-watching seasonal entertainment and actively integrates long-form content into their viewing habits. The recent purchase reflects a willingness to engage with broader genres, including comedy while envisioning new seasonal enjoyment.\n\n- **Rating Pattern:** The user consistently holds high standards for quality, as seen in their near-perfect ratings across various purchases. They express satisfaction in their reviews, setting a positive tone in anticipation of enjoyment.\n\n- **Engagement with Media:** Continuing to explore collections offering holistic experiences, the user embraces both episodic narratives and varied entertainment genres, indicating a well-rounded and evolving approach to media consumption that balances classic and contemporary forms. \n\nThis profile highlights the user’s dedication to classic media while they expand their interests to include both comedic films and live performances, all within their established value-driven framework.",
  "metrics": {
    "rouge1_f": 0.19791666666666669,
    "rouge2_f": 0.006968641114982578,
    "rougeL_f": 0.09027777777777778,
    "meteor": 0.09684504792332269,
    "bleu1": 0.09592966952017334,
    "bleu2": 0.021137940065114186,
    "bleu3": 0.004113616603649129,
    "bleu4": 0.0018162658866859452,
    "bertscore_precision": 0.36377692222595215,
    "bertscore_recall": 0.4196804165840149,
    "bertscore_f1": 0.3897341787815094
  }
}