{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/04/24\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Simon'], 'Starring': ['Barry Gibb', 'Robin Gibb', 'Maurice Gibb', 'Matt Bonelli'], 'Studio': ['Eagle Rock Entertainment']}\nReview Text: Loved it..\nReview Title: Great Concert in Vegas\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Columbo: The Complete Series\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Editor's Picks\n['Legendary Peter Falk is a four-time Primetime Emmy Award-winner for his iconic role as the beloved, trenchcoat-wearing Police Lieutenant Columbo. Columbo is the landmark series that inspired a genre. And now, for the first time ever, all 69 episodes from its seven seasons and all 24 television movies are together in this 34-disc anthology. Every criminal, every innocent victim (and some not-so-innocent ones), and every wily deduction are here in one definitive collection. Seemingly befuddled but always brilliant, the cigar-chomping detective will have you following the clues and asking \"just one more thing\" until the last case is cracked.   Note: This set contains 34 discs which are contained in 8 cases.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Pounds', 'Media Format': 'Color, Full Screen, Widescreen, NTSC', 'Run time': '99 hours and 52 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Peter Falk', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), Unknown (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal', 'Number of discs': '34'}\nThis will be our Winter entertainment and really looking forward to it. Missed out on Gold Box deal but caught it on sale later and great savings. Loved the &#34;Due South&#34; boxed set.\nNot viewed yet.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Simon'], 'Starring': ['Barry Gibb', 'Robin Gibb', 'Maurice Gibb', 'Matt Bonelli'], 'Studio': ['Eagle Rock Entertainment']}\nLoved it..\nGreat Concert in Vegas",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user maintains a strong focus on classic television and entertainment, particularly appreciating iconic series with compelling narratives. There is a newfound appreciation for live music events and performances, highlighting a broader interest in entertainment beyond scripted content. The user continues to favor detective genres and character-driven stories, with notable actors still being a key component.\n\n- **Buying Behavior:** The user is keen on seeking deals and discounts, reflecting a value-driven purchasing approach. They show a distinct preference for bundled collections that provide complete viewing experiences, while also now showing interest in concert films and music-related content.\n\n- **Content Consumption:** There is a clear inclination towards binge-watching seasonal entertainment, with planned viewing experiences for long-form content. The recent purchase indicates a potential for integrating live performances into their seasonal enjoyment.\n\n- **Rating Pattern:** Consistently high standards for quality are evident, as demonstrated by the near-perfect ratings for various purchases. The user expresses satisfaction through their reviews, anticipating enjoyment from their selections.\n\n- **Engagement with Media:** The user continues to explore shows and performances through collections that offer comprehensive experiences, embracing both episodic narratives and related musical content, indicating a well-rounded approach to entertainment consumption. \n\nThis profile underscores the user’s appreciation for classic media while also expanding into live performance experiences, maintaining their value-driven and comprehensive viewing habits.",
  "metrics": {
    "rouge1_f": 0.21653543307086612,
    "rouge2_f": 0.007905138339920948,
    "rougeL_f": 0.09055118110236221,
    "meteor": 0.1119496855345912,
    "bleu1": 0.13329550966782366,
    "bleu2": 0.017239635867171418,
    "bleu3": 0.004051597754824489,
    "bleu4": 0.0019659497699194297,
    "bertscore_precision": 0.3668508529663086,
    "bertscore_recall": 0.41395121812820435,
    "bertscore_f1": 0.3889804184436798
  }
}