{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/05/08\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Pearce'], 'Producers': ['Michael Manheim', 'David Picker'], 'Starring': ['Steve Martin', 'Debra Winger', 'Lolita Davidovich'], 'Studio': ['Paramount Pictures Corp.']}\nReview Text: Loved it.  Kinda sad but the premise of the movie goes on in real world..\nReview Title: Excellent movie.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Columbo: The Complete Series\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Editor's Picks\n['Legendary Peter Falk is a four-time Primetime Emmy Award-winner for his iconic role as the beloved, trenchcoat-wearing Police Lieutenant Columbo. Columbo is the landmark series that inspired a genre. And now, for the first time ever, all 69 episodes from its seven seasons and all 24 television movies are together in this 34-disc anthology. Every criminal, every innocent victim (and some not-so-innocent ones), and every wily deduction are here in one definitive collection. Seemingly befuddled but always brilliant, the cigar-chomping detective will have you following the clues and asking \"just one more thing\" until the last case is cracked.   Note: This set contains 34 discs which are contained in 8 cases.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Pounds', 'Media Format': 'Color, Full Screen, Widescreen, NTSC', 'Run time': '99 hours and 52 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Peter Falk', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), Unknown (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal', 'Number of discs': '34'}\nThis will be our Winter entertainment and really looking forward to it. Missed out on Gold Box deal but caught it on sale later and great savings. Loved the &#34;Due South&#34; boxed set.\nNot viewed yet.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Simon'], 'Starring': ['Barry Gibb', 'Robin Gibb', 'Maurice Gibb', 'Matt Bonelli'], 'Studio': ['Eagle Rock Entertainment']}\nLoved it..\nGreat Concert in Vegas\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Lewis Teague'], 'Producers': ['Michael Douglas'], 'Starring': ['Michael Douglas', 'Kathleen Turner', 'Danny DeVito'], 'Studio': ['20th Century Fox']}\nGreat movie , lot's of laughs. A little off color language but not terrible.\nGrab your popcorn and enjoy.\n{'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Pearce'], 'Producers': ['Michael Manheim', 'David Picker'], 'Starring': ['Steve Martin', 'Debra Winger', 'Lolita Davidovich'], 'Studio': ['Paramount Pictures Corp.']}\nLoved it.  Kinda sad but the premise of the movie goes on in real world..\nExcellent movie.",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user has a strong affinity for classic television and iconic series with engaging narratives. Their appreciation for live music events and performances continues to evolve, expanding their entertainment tastes beyond scripted content. They maintain a preference for detective genres and character-driven stories while enjoying comedic films featuring notable actors.\n\n- **Buying Behavior:** The user actively seeks deals and discounts, showcasing a value-driven approach to purchasing. They are interested in bundled collections for comprehensive viewing experiences and are increasingly exploring concert films and music-related content, alongside comedic and dramatic movies. Their recent purchase reflects a deeper engagement with nuanced narratives that resonate with real-world themes.\n\n- **Content Consumption:** The user enjoys binge-watching seasonal entertainment and integrating long-form content into their viewing habits. They continue to embrace diverse genres, including comedy, while expressing a strong connection to the emotional undertones of the stories.\n\n- **Rating Pattern:** The user consistently holds high standards for quality, as seen in their near-perfect ratings. They express satisfaction in their reviews, often highlighting the emotional impact and realism in narratives.\n\n- **Engagement with Media:** The user enjoys collections offering holistic experiences and demonstrates a balanced approach to media consumption that merges classic and contemporary forms, showcasing their evolving interests in both comedy and live performances. \n\nThis profile reflects the user's ongoing dedication to classic media while embracing broader genres and themes that capture their attention and emotional engagement.",
  "metrics": {
    "rouge1_f": 0.18880000000000002,
    "rouge2_f": 0.012841091492776884,
    "rougeL_f": 0.0832,
    "meteor": 0.07579543561552557,
    "bleu1": 0.06556673075153889,
    "bleu2": 0.01170263199566306,
    "bleu3": 0.0024302195513438256,
    "bleu4": 0.0011084262055006816,
    "bertscore_precision": 0.35294750332832336,
    "bertscore_recall": 0.42477792501449585,
    "bertscore_f1": 0.3855455815792084
  }
}