{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/06/18\nAverage Rating: 3.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---']}\nReview Text: Was refreshing to see a lot of the legends from years ago when Country was Country. Quit a venue it was filmed in.\nReview Title: Good music..\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Columbo: The Complete Series\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Editor's Picks\n['Legendary Peter Falk is a four-time Primetime Emmy Award-winner for his iconic role as the beloved, trenchcoat-wearing Police Lieutenant Columbo. Columbo is the landmark series that inspired a genre. And now, for the first time ever, all 69 episodes from its seven seasons and all 24 television movies are together in this 34-disc anthology. Every criminal, every innocent victim (and some not-so-innocent ones), and every wily deduction are here in one definitive collection. Seemingly befuddled but always brilliant, the cigar-chomping detective will have you following the clues and asking \"just one more thing\" until the last case is cracked.   Note: This set contains 34 discs which are contained in 8 cases.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Pounds', 'Media Format': 'Color, Full Screen, Widescreen, NTSC', 'Run time': '99 hours and 52 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Peter Falk', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), Unknown (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal', 'Number of discs': '34'}\nThis will be our Winter entertainment and really looking forward to it. Missed out on Gold Box deal but caught it on sale later and great savings. Loved the &#34;Due South&#34; boxed set.\nNot viewed yet.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Simon'], 'Starring': ['Barry Gibb', 'Robin Gibb', 'Maurice Gibb', 'Matt Bonelli'], 'Studio': ['Eagle Rock Entertainment']}\nLoved it..\nGreat Concert in Vegas\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Lewis Teague'], 'Producers': ['Michael Douglas'], 'Starring': ['Michael Douglas', 'Kathleen Turner', 'Danny DeVito'], 'Studio': ['20th Century Fox']}\nGreat movie , lot's of laughs. A little off color language but not terrible.\nGrab your popcorn and enjoy.\n{'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Pearce'], 'Producers': ['Michael Manheim', 'David Picker'], 'Starring': ['Steve Martin', 'Debra Winger', 'Lolita Davidovich'], 'Studio': ['Paramount Pictures Corp.']}\nLoved it.  Kinda sad but the premise of the movie goes on in real world..\nExcellent movie.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Theodore Melfi'], 'Producers': ['Theodore Melfi', 'Peter Chernin', 'Jenno Topping', 'Fred Roos'], 'Starring': ['Bill Murray', 'Melissa McCarthy', 'Naomi Watts']}\nTerrible, should be R at least. Sex and language disgusting. How could it be PG 13?  Turned it off.\nTerrible\n{'Subtitles': ['None available'], 'Directors': ['---']}\nWas refreshing to see a lot of the legends from years ago when Country was Country. Quit a venue it was filmed in.\nGood music..",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user maintains a strong affinity for classic television and iconic series with engaging narratives while their interest in live music events and performances continues to expand. They favor detective genres and character-driven stories but also gravitate towards comedic films featuring notable actors. Recently, they have shown an appreciation for nostalgia in music, particularly classic country.\n\n- **Buying Behavior:** The user actively seeks deals and discounts, showcasing a value-driven purchasing approach. They are increasingly focused on acquiring bundled collections for comprehensive viewing experiences. Their recent purchase emphasizes a blend of music-related content, reaffirming their preference for quality experiences while also showcasing a critical approach to content suitability.\n\n- **Content Consumption:** The user enjoys binge-watching seasonal entertainment and integrating long-form content into their viewing habits, with a keen interest in diverse genres. They express a strong emotional connection to narratives but maintain a growing intolerance for content perceived as inappropriate or offensive.\n\n- **Rating Pattern:** The user consistently holds high standards for quality, previously giving near-perfect ratings. Their recent ratings reflect a careful evaluation of content quality, particularly concerning appropriateness, indicated by their moderate recent rating.\n\n- **Engagement with Media:** They appreciate collections that provide holistic experiences, blending classic and contemporary genres. The latest interaction highlights their enjoyment of nostalgia in music alongside a commitment to content that aligns with their values and preferences.",
  "metrics": {
    "rouge1_f": 0.17118402282453637,
    "rouge2_f": 0.005722460658082976,
    "rougeL_f": 0.07988587731811699,
    "meteor": 0.06298064173959161,
    "bleu1": 0.03618928202272903,
    "bleu2": 0.0044291691808488135,
    "bleu3": 0.0010219383859749844,
    "bleu4": 0.00049132470908422,
    "bertscore_precision": 0.33946382999420166,
    "bertscore_recall": 0.4123813509941101,
    "bertscore_f1": 0.3723866641521454
  }
}