{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: FRESHME Facial Sheet Masks - Hydrating Face Mask Allantoin Sodium Hyaluronate Aloe Vera and Punica Granatum Fruit Extract Moisturizing Plant Facial Mask, Combo 6 Pack\nReview Date: 2020/09/15\nStore: FRESHME\nAverage Rating: 4.5\nProduct Details: {'Brand': 'FRESHME', 'Item Form': 'Sheet', 'Scent': 'Aloe Vera', 'Skin Type': 'Sensitive', 'Special Feature': 'Not Tested On Animals', 'Product Dimensions': '5.51 x 3.94 x 0.91 inches; 6.38 Ounces'}\nReview Text: I like these facial sheet mask. I used it for the first time last night before bed, it was easy to put it on my face. The essence absorbed into my skin quite fast, it didn't leave my face feeling dry at all. My face felt so smooth in the morning. However, instructions on the back of the packet didn't tell you how long you have to leave the mask on your face, I guess at least 15 minutes?\nReview Title: Facial sheet masks\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "JOYYUM 1000W 2-in-1 Hot Air Spin Brush Styler Auto-rotating Negative Ionic Hair Curler Dryer Brush, 1 1/2 Inch and 2 Inch Brush Attachments, Lavander Fog\nJOYYUM\n{'Brand': 'JOYYUM', 'Material': 'Titanium', 'Power Source': 'Corded Electric', 'Special Feature': 'Comb, Portable, Massage, Hot', 'Recommended Uses For Product': 'Curling', 'Package Dimensions': '16.3 x 5.4 x 3.2 inches; 1.85 Pounds', 'UPC': '787414814279', 'Manufacturer': 'JOYYUM'}\nDo not like it. It barely spun or you have to use it with a very very small section of hair. Well, it's easy to use but I guess it's great for people with short hair.\nNot for me\nGIOVANNI Hemp Hydrating Hair Shine Spray, 4.3 oz. - Hemp Seed Oil, Aloe Vera, Frankincense Helps Stimulate Moisturize & Revitalize Damaged Hair, No Parabens, Color Safe, Lauryl & Laureth Sulfate Free\nGIOVANNI\n['GIOVANNI Hemp Hydrating Hair Shine Spray creates gloss that rocks, with a smooth surface that talks. This Mist will seal in any hairstyle, bridging the gap between natural and salon quality. GIOVANNI was the first full-range, salon-inspired hair-care brand in natural product stores, and today is the #1 selling Hair Care* lines in the United States Natural Products Industry. But before there was a brand, there was a pioneer. Arthur Guidotti had a vision and a love for all things hair. He began developing his passion as a hairstylist in Hollywood and Beverly Hills. By the 1960s, Arthur was maturing his talents and decided to open his own salon, called On Sunset. The salon was a bustling site, on the famous Sunset Strip, and a hit with many Hollywood celebrities, including Lucille Ball. Since 1979 the GIOVANNI Rule of Balance has been our commitment to make each product as pure and as natural as possible without sacrificing exceptional product performance. GIOVANNI is committed to creating only the highest-performance formulations, wrapped in aesthetically beautiful packaging and marketed with extraordinary visuals and graphics.*According to SPINs.']\n{'Product Benefits': 'Frizz Control, Shine', 'Hair Type': 'All', 'Scent': 'Frankincense', 'Liquid Volume': '5.6 Fluid Ounces', 'Item Form': 'Spray', 'Product Dimensions': '2 x 2 x 4.75 inches; 5.6 Ounces', 'Item model number': '18640', 'UPC': '716237186409', 'Manufacturer': 'AmazonUs/GIOR7', 'Country of Origin': 'USA'}\nI like this hair conditioner. It smells ok. After first use, my hair was very soft and smooth. It is so easy to rinse off too.\nParabens and Sulfate Free hair conditioner\nFRESHME Facial Sheet Masks - Hydrating Face Mask Allantoin Sodium Hyaluronate Aloe Vera and Punica Granatum Fruit Extract Moisturizing Plant Facial Mask, Combo 6 Pack\nFRESHME\n{'Brand': 'FRESHME', 'Item Form': 'Sheet', 'Scent': 'Aloe Vera', 'Skin Type': 'Sensitive', 'Special Feature': 'Not Tested On Animals', 'Product Dimensions': '5.51 x 3.94 x 0.91 inches; 6.38 Ounces'}\nI like these facial sheet mask. I used it for the first time last night before bed, it was easy to put it on my face. The essence absorbed into my skin quite fast, it didn't leave my face feeling dry at all. My face felt so smooth in the morning. However, instructions on the back of the packet didn't tell you how long you have to leave the mask on your face, I guess at least 15 minutes?\nFacial sheet masks",
  "profile": "**User Profile Summary:**\n\n- **Product Type Preference:** Continues to show a strong interest in hair styling tools and care products that enhance shine and manageability, while also exploring facial care products like hydrating sheet masks. Values multi-functional capabilities across different beauty categories.\n\n- **Performance Concern:** Motivated by effectiveness and natural ingredients in both hair and skin care. Favors products that are paraben and sulfate-free, with frustration stemming from those that fail to deliver on their claims regarding ease of use and performance across various types.\n\n- **Usage Experience:** Appreciates user-friendly products that enhance health and well-being, indicating a broadening interest in versatile solutions for hair and skin care. Recently expressed satisfaction with a product that provided notable softness and smoothness, and also found a facial mask easy to use, leaving her skin feeling smooth and hydrated.\n\n- **Overall Satisfaction:** Maintains a critical yet positive perspective towards her purchases. Her discerning nature drives a consistent search for high-quality results across products. Positive experiences with effective products support her inclination to rate them favorably.\n\n- **Rating Trend:** Evaluates products with a balanced viewpoint, weighing pros and cons. The recent purchase and favorable ratings suggest a continued trend towards seeking high-performance formulations that address a variety of beauty care needs, encompassing both hair and skin.",
  "metrics": {
    "rouge1_f": 0.23576158940397354,
    "rouge2_f": 0.03187250996015936,
    "rougeL_f": 0.09536423841059603,
    "meteor": 0.09433303378305137,
    "bleu1": 0.06647881452256872,
    "bleu2": 0.022202342787678915,
    "bleu3": 0.0071591918718653755,
    "bleu4": 0.0022883278536509053,
    "bertscore_precision": 0.36449873447418213,
    "bertscore_recall": 0.4492896497249603,
    "bertscore_f1": 0.40247687697410583
  }
}