{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/05/02\nAverage Rating: 4.9\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'Andy Goddard', 'Jeremy Webb', 'David Evans'], 'Producers': ['Liz Trubridge', 'Gareth Neame', 'Julian Fellowes', 'Rebecca Eaton'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nReview Text: Someone from work told us about this series and we got hooked. We love Downton Abbey and can hardly wait for Season 4.\nReview Title: Love this Series\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Martha Stewart Wedding Collection - Martha's Wedding Ideas\nMartha Stewart  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Martha showcases some of her wedding favorites to inspire brides as they begin to plan their special day. Discover how to create some of the world's most beautiful floral bouquets and centerpieces. Learn the essentials for finding the perfect bridal gown, and find everything you need to organize a successful wedding reception. From elegant cakes to personalized invitations and thank-you notes, this is an introduction to planning a wedding that every soon-to-be bride should have.\"]\n{'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Contributor': 'Martha Stewart', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '3 hours and 7 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Subtitled, NTSC', 'Run time': '3 hours and 7 minutes', 'Release date': 'February 14, 2006', 'Actors': 'Martha Stewart', 'Subtitles': 'French, Spanish', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nI really liked this DVD although I would not have expected any less from Martha Stewart. It showed how easily you could really make your own flowers.\nMartha Stewart Wedding Collection\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Paul W.S. Anderson'], 'Producers': ['Paul W.S. Anderson', 'Jeremy Bolt', 'Robert Kulzer'], 'Starring': ['Matthew Macfadyen', 'Milla Jovovich', 'Helen George']}\nI really enjoyed this movie. It was action-packed and fun. If I would've known it was this good, I would've seen it at the movies first.\nThe Three Musketeers\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Levant'], 'Producers': ['Chris Columbus', 'Mark Radcliffe', 'Michael Barnathan'], 'Starring': ['Arnold Schwarzenegger', 'Sinbad', 'Phil Hartman'], 'Studio': ['20TH CENTURY FOX']}\nThis movie is funny and it was agreat family movie. It showed what is truly important which is spending time with your family.\nGreat Family Movie!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Andrews', 'Brenda Chapman'], 'Producers': ['Katherine Sarafian'], 'Starring': ['Kelly Macdonald', 'Billy Connolly', 'Emma Thompson'], 'Studio': ['Pixar']}\nThis movie is not only entertaining but it also showed something very important. It showed how important it is to listen to our kids and how pride can sometimes hurt our relationships or misguide us into thinking we're always right as parents. My husband and I both truly enjoyed this movie.\nGreat Movie!\nWedding Dance\nDanceCrazy.com  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', 'Wedding Dance', '. Wedding Dancing Lessons for everyone. DanceCrazy Presents:', 'The Wedding Dance Deluxe System for Beginners', '. (Note: There is also a', '5 DVD', 'Mastery System on Amazon. You are looking at the 2 DVD Deluxe Version).', 'Learn to dance at your wedding. Waltz, Swing, Rumba, and Foxtrot On Two Comprehensive DVDs. No Experience Necessary! DanceCrazy presents the perfect instructional guide to your first wedding dance, and your first dance as husband and wife. With complete preparation for each dance (Waltz, Foxtrot, Swing, and Rumba), we also include an enormous amount of extra material to cover every aspect of your dance.', 'Every question you have will be answered with our in-depth discussion and overview of key concepts and practices that pertain to dancing at your wedding. We take you step by step through each dance, break everything down for you, dance it with you together to real music, and finally give you additional tips for success! We even put together some great patterns for you to take with you onto the dance floor!', \"DanceCrazy's Wedding DVDs are for even the absolute beginner! Never danced before in your life? No coordination? Afraid to dance in front of everyone at your wedding? That's exactly what we're here for. These are the ultimate dance classes, and like taking personal one on one dance lessons.\", 'Grab this Wedding Dance DVD Deluxe Set!', 'Review', 'With this video, yes you can. Very easy to follow with instructions that are visually reinforced. Even a guy with two left feet, like me, can learn to be the dance king. I taught my wife a few simple steps and we became the hit of the wedding party as we foxtrotted and waltzed all over the floor. Comments I got were, \"Where did you learn to dance like that?\" and \"I didn\\'t know you could dance like that!\". One hint, though: Get this video early - don\\'t wait until the week before your wedding like I did. You need at least a month of practice for all of the steps to become easy. If you apply yourself just a half hour each night, you can really get the basics down pat. Enjoy. Make Fred and Ginger envious. --Bernd VanderSchuur, Verified PurchaseThis DVD provided several hours of laughter while my daughter and her fiancé, my daughter and I, and my wife and I learned some basic steps and prepared to dance at the daughter\\'s wedding last May. Certainly none of us rivaled Fred and Ginger, but just the confidence of knowing _something_ about dance made all the difference in the world. DEFINITELY buy this if you\\'ve got an event coming up, and you want to do more that just sway back and forth on the dance floor. --D. Grudzina, Amazon']\n{'Genre': 'Jazz, Music Video & Concerts', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'DanceCrazy.com', 'Language': 'English', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 5.61 Ounces', 'Director': 'DanceCrazy.com', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '4 hours', 'Release date': 'October 14, 2008', 'Actors': 'DanceCrazy.com', 'Studio': 'CD Baby', 'Number of discs': '2'}\nThe couple was very good and taught a lot of dance moves so when it comes to that, you really get your money's worth. I thought they talked a little much but that's just my opinion, some people might like that.\nGood Instructional CD\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'Bitsie Tulloch', 'Russell Hornsby']}\nWe love science fiction so this was perfect for us. We watched it non-stop and can hardly wait for next season!\nGrimm Season 1\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Roger Michell'], 'Producers': ['Fiona Finlay'], 'Starring': ['Fiona Shaw', 'Amanda Root', 'Ciaran Hinds']}\nI was having a hard time reading the book. The movie was really captured the book and I really liked the story thus the reason it's a classic.\nGood Classic\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard'], 'Studio': ['FX Cable Channel']}\nWe loved the first season and can hardly wait to see all of them. It has everything you want out of a &#34;cop&#34; show. A smart, handsome, main character; a little romance for us ladies, and the action for the guys. Both my husband and I thoroughly enjoyed it.\nLove it\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español (España)', 'Español (Latinoamérica)', 'Português', 'Français'], 'Subtitles': ['English [CC]', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Português', 'ไทย'], 'Directors': ['Kim Jee-woon'], 'Producers': ['Lorenzo di Bonaventura'], 'Starring': ['Arnold Schwarzenegger', 'Forest Whitaker', 'Johnny Knoxville'], 'Studio': ['Action and Adventure']}\nI think this movie was OK. My husband and I like Arnold Schwarzenegger so we wanted to watch it. It was so OK that I barely remember it anymore.\nOK Movie\nJustified\nSuspense, Western, Drama, Action\n[\"Deputy US Marshal Raylan Givens (Timothy Olyphant) will start to pick at the thread of a cold case over 30 years in the making, unraveling a riddle that echoes all the way back to his boyhood and his criminal father's bad dealings. Meanwhile, Boyd Crowder (Walton Goggins) finds his grip on Harlan loosening due to a Pentecostal preacher with a penchant for theatrics and a knack for manipulation...\"]\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nJustified is always good. One of my husband's favorite shows. We watch a season as soon as it comes out from beginning to end. I would recommend it to anyone.\nGreat Season\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul A. Kaufman'], 'Producers': ['Paul A. Kaufman', 'Orly Adelson', 'Christian Bruyère', 'Jean-François Doray', 'Jonathan Eskenas', 'Ronald Gilbert', 'P. Jayakumar', 'Karine Martin', 'Louis-Simon Menard', 'Steven Stabler'], 'Starring': ['Poppy Montgomery', 'Emily Holmes', 'Antonio Cupo', 'Janet Kidder'], 'Studio': ['Lifetime']}\nI really enjoyed this movie. It's nice to know how Ms. Rowling rose from the bottom to the top. It goes to show you that talent and skill could be hidden anywhere or where you least expect it. It also shows that even if you come from a &#34;good&#34; family that you can still hit rock bottom (well, almost, in her case). I liked how it showed that you can be courageous and also how you need to never give up on your dreams. I know I'm talking about the story/person and not the movie. Regarding the movie itself, I liked the movie a lot. It was an eye-opening to me. I had no idea who JK Rowling was, I only knew how much I loved every single book and how it was hard to let go at the end of the last one.\nInteresting and Enlightening\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'Andy Goddard', 'Jeremy Webb', 'David Evans'], 'Producers': ['Liz Trubridge', 'Gareth Neame', 'Julian Fellowes', 'Rebecca Eaton'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nSomeone from work told us about this series and we got hooked. We love Downton Abbey and can hardly wait for Season 4.\nLove this Series",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user continues to be passionate about wedding planning and DIY projects, particularly in floral arrangements and event organization. They cherish storytelling that highlights family narratives and personal values, with a growing interest in science fiction and suspenseful tales, as well as high-quality dramas.\n\n- **Content Preference:** The user recently expressed their appreciation for biographical dramas and series that feature inspirational stories of personal growth. They have a strong affinity for emotionally resonant, family-friendly films, and engaging narratives, reflecting an increased interest in well-crafted series that keep them hooked.\n\n- **Influences:** They draw insights from reputable experts in lifestyle, event planning, and storytelling, seeking content that aligns with their values and interests.\n\n- **Feedback Trends:** Their history of positive media ratings remains consistent, with an average rating around 4.0, though they have shown a willingness to provide lower ratings for less satisfying content. Their latest review indicates a preference for stories that are both engaging and enlightening.\n\n- **Format Preference:** The user enjoys visual and instructional formats that support their DIY endeavors, alongside a diverse range of storytelling styles that captivate their interest.\n\n- **Emotional Engagement:** They prioritize content that combines practical skills with emotional depth, focusing on themes such as perseverance, courage, and family connections in their narratives.\n\nOverall, the user maintains a strong focus on high-quality, expert-led content in weddings, DIY projects, and inspiring stories about personal and family journeys.",
  "metrics": {
    "rouge1_f": 0.12172191984166254,
    "rouge2_f": 0.0079247152055473,
    "rougeL_f": 0.051459673428995545,
    "meteor": 0.035077114987683,
    "bleu1": 0.00014031203605185445,
    "bleu2": 3.928349916955647e-05,
    "bleu3": 5.542814257887452e-06,
    "bleu4": 2.083785069719176e-06,
    "bertscore_precision": 0.35376036167144775,
    "bertscore_recall": 0.4815140962600708,
    "bertscore_f1": 0.4078673720359802
  }
}