{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/07/25\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Bowers'], 'Producers': ['Nina Jacobson', 'Jeff Kinney', 'Simon Reeves', 'Jeremiah Samuels', 'Brad Simpson', 'Bryan Unkeless'], 'Starring': ['Zachary Gordon', 'Zachary Gordon', 'Robert Capron'], 'Studio': ['Fox']}\nReview Text: Absolutely hilarious and in a good, none-nasty/swearing way.  The situations are those we can all relate too and are very funny.  I love all the Diary of a Wimpy Kid movies and my kids have read all the books.  If you're looking for non-animal talking movies (I get so tired of those movies where animals talk to each other with human voices) for your kids and that are not scary or has cussing/sex/negative teenage angst (kids snobbing each other and acting ugly), then you should be quite happy with this movie and all the others.\nReview Title: Diary of a Wimpy Kid 3: Dog Days\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Eric Clapton: Crossroads Guitar Festival [DVD]\nEric Clapton  (Actor),     J.J. Cale  (Actor),     Ron de Moraes  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'In June 2004, some of the greatest living guitar players and their bands gathered at the Cotton Bowl in Dallas, Texas, for a three-day festival to benefit the Crossroads Centre in Antigua. It was the ultimate concert for any music lover, featuring one legend after the other: Eric Clapton, BB King, Buddy Guy, Eric Johnson, James Taylor, Jimmie Vaughan, Joe Walsh, John Mayer, Robert Cray, Robert Randolph, Santana, ZZ Top, and many more. This 2-DVD set beautifully documents the event and contains over 4 hours of content. Planned extras include in-depth artist interviews, a mini-documentary, photo gallery, alternate angle, and more. Royalties from the DVD sales will benefit the Crossroads Center.', 'Amazon.com', \"Although it could have been twice as long, this double-DVD set effectively captures over three hours of highlights from one of the most comprehensive and diverse collection of guitarists ever assembled for a single event. Recorded over three days in June of 2004 to benefit Eric Clapton's Crossroads Center in Antigua (as do the sales of this set), the show is not surprisingly heavy on the rootsy blues and country that comprise Clapton's primary inspirations. But it also includes folk (James Taylor), gospel (Robert Randolph & the Family Band), fret-shredding rockers (Steve Vai who delivers a dazzling performance), jazz (John McLaughlin), and, most interestingly, Indian classical music (a stunning piece from Vishwa Mohan Bhatt).\", 'Most compelling are the rare and sometimes unusual collaborations. Joe Walsh and Taylor clown around on \"Steamroller Blues,\" and Booker T. & the M.G.\\'s back both Joe Walsh on a rollicking \"Rocky Mountain Way\" and Los Lobos\\' David Hidalgo tearing into a sizzling \"The Neighborhood.\" Clapton and J.J. Cale share the stage as do Clapton and Carlos Santana, and a show-stopping blues summit with Robert Cray, Jimmie Vaughan, Hubert Sumlin, B.B. King, Buddy Guy, and Clapton is a treat for all involved.', \"There are some shortcomings. The event isn't presented in chronological order--different stages, days, and backing bands are shuffled with Clapton's own set scattered throughout--ZZ Top's closing is a bit anticlimactic, and there are many omissions due to time constraints. But every act rises to the occasion, and this expertly recorded and shot DVD gives the viewer a front-row seat to a once-in-a-lifetime experience.\", '--Hal Horowitz']\n{'Genre': 'Dance & Electronic', 'Format': 'Color, Dolby, DVD, Import, NTSC', 'Contributor': 'J.J. Cale, B.B. King, Pat Metheny, James Taylor (XVII), Jeff Beck, Rocky Frisco, ZZ Top, Ron de Moraes, Eric Clapton, Carlos SantanaJ.J. Cale, B.B. King, Pat Metheny, James Taylor (XVII), Jeff Beck, Rocky Frisco, ZZ Top, Ron de Moraes, Eric Clapton, Carlos Santana  See more', 'Language': 'English, Unqualified (DTS ES 6.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.56 x 5.39 x 0.59 inches; 4.52 Ounces', 'Director': 'Ron de Moraes', 'Media Format': 'Color, Dolby, DVD, Import, NTSC', 'Run time': '3 hours and 30 minutes', 'Release date': 'November 9, 2004', 'Actors': 'Eric Clapton, J.J. Cale, B.B. King, James Taylor (XVII), Rocky Frisco', 'Dubbed': 'English', 'Subtitles': 'German, English, Italian, Spanish, French', 'Studio': 'Warner', 'Number of discs': '2'}\nNice video and plenty long.  It was a great concert, and the quality of the recording is supremo, especially if you play it through a HD upconverting player and watch it on a HDTV. Absolutely brilliant video and sound!!!<br /><br />The only thing that is keeping me from giving it 5 stars is simply prejudice - I am a classical guitarist and there was not a single classical player in the entire concert.  There was a sitar player who played on forever - please stop already!!! AND that's NOT a guitar! It's a SITAR! Not even a hint of a classical guitarist.  But, nonetheless, it's very entertaining, and the concert was for a very good cause - help for drug/alcohol abuse.\nEric Clapton - CrossRoads\nWizard Of Oz: The Lost Original L. Frank Baum Versions\nHal Roach  (Actor),     Oliver Hardy and more  (Actor),     various  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n{'Format': 'Dolby, NTSC, Silent, Surround Sound', 'Contributor': 'various, Hal Roach, Oliver Hardy and more', 'Language': 'English', 'Runtime': '3 hours and 47 minutes'}\nThis movie is like those old silent movies perhaps you have seen bits and pieces of while watching documentaries of famous movie actors and actresses of the early 1900's.  Black and white of course, and very busy and somewhat harsh on the eyeballs. I think since \"moving pictures\" were such a novel idea back then, that the actors were told to wave their arms A LOT, and run-around frantically while frequently falling down. There is a lot of commotion constantly going on.<br /><br />It's very interesting in that you can see where the idea originated for the later movie, \"The Wizard of Oz\", of which we are familiar with. The old version (this movie) does not have very much in common, story-wise with the later movie, but still it's fun to watch and see how far we have come in the cinematic arts. The prototypes for the scarecrow, lion, and tin man are there though one of the main and most busy character, \"patchwork girl\" is not. My 7 year old loved this movie, but I swear I sometimes think she's my grandmother reincarnated who grew up watching these types of movies. She loves watching all the old movies and cartoons while I get tired of them rather quickly. (Although my daughter is adopted, she has a lot of the same mannerisms my grandmother did!) So, don't buy this movie thinking your kid is going to like it because they won't - but it's great for historical background of silent movies, and it's the precursor to the \"Wizard of Oz\" with Judy Garland.<br /><br />Although this is a silent movie, I finally had to mute it because of the constant organ music - it kept playing these harsh chords over and over and over and over with little change in musical content. It was maddening to listen to it over a long period of time. It didn't change no matter what was going on in the story - frantic scene after frantic scene it was the same honking organ music.  But music is not needed and it's easy to watch without any sound at all.  The story was not exactly fluid, but you could sort of keep up with it by not missing the few opportunities to read a little bit of dialogue and find out what was happening. Sometimes things would change very suddenly without any previous story build-up so you just have to accept it and go along with the flow. The area where the movie was filmed was scraggy, weedy and dry with no though given to making the landscape more visually pleasant. Some costumes were no more than boxes (the \"Woozy\"!) but other costumes were much more elaborate.  I like that they just filmed where they were with the environment just like it was. The props were high-school quality at best, but I liked it anyway.<br /><br />I think this movie would be a great study for someone earning a college degree in film. It has a lot to offer in many areas, especially when seeing how the special effects were done. And this movie did have some very interesting special effects! Honestly, I love the innocence of it all - it was a pleasure to have this glimpse of the past and I'm very glad I bought it, but I probably won't watch it again for a while.\nA Great Old Classic\nThe Wizard of Oz (Import - English - All Regions)\nMorgan, Frank  (Actor),     Bolger, Ray  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Kids & Family, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Garland, Judy, Morgan, Frank, Bolger, Ray', 'Language': 'English', 'Runtime': '1 hour and 42 minutes'}\nThe box is covered in Korean characters, but don't let that scare you from buying this DVD.  It's the original \"Wizard of Oz\" movie that we grew up with!  Even Judy Garland's name got goofed up as \"Jody Garland\" but still, the DVD is clear, crisp, beautiful and sounds wonderful.  And it's a lot cheaper than the the \"Wizard of Oz\" alternative DVD's.  You only get one DVD - just the movie, no extras or games or behind the scenes information.  But I didn't want any of that.  I just wanted the movie.<br /><br />When you pop this movie into your DVD player go first to \"Set-up\" and under Subtitles click on \"none\".  The movie is in English since it's the original and there is absolutely nothing about it I can find to complain about.  I loved it!  Though it took a few days longer for it to arrive than I expected, it was well-packaged and the plastic case is as good as any other DVD case.\nThis is a Great DVD!\nOn the Beach\nGregory Peck  (Actor),     Ava Gardner  (Actor),     Stanley Kramer  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction\n['The war is over. Nobody won. Only the inhabitants of Australia and the men of the US submarine Sawfish have escaped the nuclear destruction and radiation. Captain Dwight Towers (Gregory Peck) takes the Sawfish on a mission to see if an approaching radiation cloud has weakened, but returns with grim news: the cloud is lethal. With the days and hours dwindling, each person confronts the grim situation in his or her own way. One (Fred Astaire) realizes a lifetime Grand Prix ambition,another (Ava Gardner) reaches out for a chance at love. The final chapter of human history is coming to a close... From acclaimed director Stanley Kramer (The Defiant Ones, Inheritthe Wind) and screenwriter John Paxton comes this spectacular movie landmarka film masterpiece with a message that will resonate as long as the world has the power to self-destruct at its own fingertips.']\n{'Format': 'Letterboxed, Black & White, NTSC', 'Contributor': 'Fred Astaire, Donna Anderson, John Tate, John Meillon, Ava Gardner, Guy Doleman, Lola Brooks, Richard Meikle, Stanley Kramer, Harp McGuire, Ken Wayne, John Paxton, Gregory Peck, Anthony Perkins, Nevil ShuteFred Astaire, Donna Anderson, John Tate, John Meillon, Ava Gardner, Guy Doleman, Lola Brooks, Richard Meikle, Stanley Kramer, Harp McGuire, Ken Wayne, John Paxton, Gregory Peck, Anthony Perkins, Nevil Shute  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 14 minutes', 'Studio': 'MGM (Video & DVD)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Director': 'Stanley Kramer', 'Media Format': 'Letterboxed, Black & White, NTSC', 'Run time': '2 hours and 14 minutes', 'Release date': 'February 29, 2000', 'Actors': 'Gregory Peck, Ava Gardner, Fred Astaire, Anthony Perkins, Donna Anderson', 'Writers': 'John Paxton, Nevil Shute', 'Number of discs': '1'}\nI've been wanting to see this movie for a long time and since Netflix nor Amazon streaming have it I finally bought my own copy of it.  the black and white quality is very good and so is the sound.  I have no complaints about the DVD.  The movie story is very good and I like the time period, however, it makes females to be rather needy and less than intelligent which I suppose was par for the course back in the 40's and 50's movie genre.  And my God!!!  They could of left out half of the kissing scenes!!!  It just got to be old and worn out after a while.  But that aside, the accuracy of a deadly radiation cloud covering the earth and finally arriving in Australia was very realistic and seemed they checked their facts.  That was what I bought the movie for - the radiation.<br /><br />And price has gone up dramatically on this DVD.  I know I would never pay more than 10 dollars for it.  I just went and checked.  I paid $8.96 for this DVD.\nOn The Beach (movie)\n{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Stone III'], 'Producers': ['Wendy Finerman', 'Timothy M. Bourne', 'Jody Gerson'], 'Starring': ['Orlando Jones', 'Zoe Saldana', 'Nick Cannon'], 'Studio': ['20TH CENTURY FOX']}\nThe movie itself is absolutely terrific.  Every potential marching band percussionist should watch it.  However, the Amazon streaming was horrible and at many points during the movie for long durations of time, you couldn't even tell what was going on visually.  The sound never wavered, but much of the time we were looking at a pixilated or blurry screen.  That was very irritating.\nAwesome Movie - Horrible Streaming\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Waters'], 'Producers': ['Rachel Talalay'], 'Starring': ['Divine', 'Ricki Lake', 'Sonny Bono'], 'Studio': ['WARNER BROS.']}\nThis was a very enjoyable movie and one that the kids can watch.  \"Divine\" (may he rest in peace), did a divine job of playing the mother.  This I believe, is the only movie in which he did not play the lead character, but instead Ricki Lake did.  And, as I understand it, he was not happy about being second, and it actually irritated him, but during filming he grew very fond of Ricki Lake and even asked her to share a pie with him.  It showed his wonderful ability for character acting and I loved watching him! Lots of great music and dancing and the story, set back in the early 1960's was silly, which is just the way I like it!  And fat girls can dance even better than their skinny counter-parts.  It streamed well from Amazon Prime.\nHairspray\n{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)'], 'Directors': ['Peter Hedges'], 'Producers': ['James Whitaker', 'Scott Sanders'], 'Starring': ['Jennifer Garner', 'Joel Edgerton', 'Ron Livingston'], 'Studio': ['Walt Disney Pictures']}\nMy kids liked it more than me.  The acting was kind of stilted though the child actors did a MUCH better job than the adult actors.  Also, the story was very formulaic - same o same o.  The parents were stupid and irritating while Timothy was much more mature than them. The scenery and settings were quite beautiful, however they didn't make up for the weak story line.\nThe Odd Life of Timothy Green\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Baumgartner'], 'Producers': ['David Rimawi', 'Paul Bales', 'David Latt'], 'Starring': ['Grace Van Dien', 'Jhey Castles', 'Lane Townsend'], 'Studio': ['The Asylum']}\nI don't know how they managed to make a movie so bad, so unrealistic and so unbelievably stupid.  I was actually WANTING every character in it to DIE.  I could make a list a mile long of the incredible ignorance of the writers, producers and whoever else was involved in this less than a D rating movie but I really don't want to remind myself of them lest I start screaming at the TV again.<br /><br />I wasted $3.99 and I really would have rather just used the money as toilet paper - literally - to wipe my ass with it.  At least I would have gotten a much better value.  Amazon Digital - you really have NO business charging people to watch this p.o.s. movie and I want my money back!!!!!\nAbsolutely the STUPIDEST Movie I Think I've Ever Seen\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alan J. Pakula'], 'Producers': ['Bruce Gilbert'], 'Starring': ['Jane Fonda', 'Kris Kristofferson', 'Hume Cronyn'], 'Studio': ['WARNER BROS.']}\nThis was a very interesting movie and I have heard and read that this movie was advanced notice (by TPTB) of what will happen when Saudi Arabia dumps all of it's U.S. Treasury Bills.  It will collapse our economy in a cataclysmic way.  And guess what?  The Saudis having been dumping treasuries by the boat loads recently.  As far as the cinematics - I LOVE the 70's stuff.  I grew up in the 70's and it was a trip back in time looking at all the office business machines, cars and clothing. I thought the acting was pretty good too.\nRollover (1981)\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Patrick McGoohan', 'Don Chaffey', 'Pat Jackson', 'David Tomblin', 'Robert Asher', 'Peter Graham Scott'], 'Producers': ['Patrick McGoohan', 'David Tomblin'], 'Studio': ['Granada']}\nPatrick McGoohan was waaaaaay ahead of his time by being so very aware of governmental/societal problems in how the government is constantly trying to control our every action and thought, as well as monitor our every activity.  &#34;The Prisoner&#34; was based on the government wanting &#34;information&#34; as to why he suddenly resigned from service.  He held also held a lot of knowledge that the government was scared he would share with it's enemies.<br /><br />This is an awesome series, and unfortunately it only ran for one season.  It starts off very understandably but progresses throughout the episodes to an almost crazy/hectic final episode.  I remember watching this show as a young kid, and am so happy that I was able to buy the entire series from Amazon.  My 15 year old daughter loves to watch it with me and we discuss the characters and their roles, and why Number 6 refuses to give up his quest to get off the island.  Absolutely wonderfully deep for those who like to think, yet still apparently light for those who just like the cute town and people.\nThe Prisoner Season 1\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Bowers'], 'Producers': ['Nina Jacobson', 'Jeff Kinney', 'Simon Reeves', 'Jeremiah Samuels', 'Brad Simpson', 'Bryan Unkeless'], 'Starring': ['Zachary Gordon', 'Zachary Gordon', 'Robert Capron'], 'Studio': ['Fox']}\nAbsolutely hilarious and in a good, none-nasty/swearing way.  The situations are those we can all relate too and are very funny.  I love all the Diary of a Wimpy Kid movies and my kids have read all the books.  If you're looking for non-animal talking movies (I get so tired of those movies where animals talk to each other with human voices) for your kids and that are not scary or has cussing/sex/negative teenage angst (kids snobbing each other and acting ugly), then you should be quite happy with this movie and all the others.\nDiary of a Wimpy Kid 3: Dog Days",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Diary of a Wimpy Kid 3: Dog Days",
    "text": "Absolutely hilarious and in a good, none-nasty/swearing way.  The situations are those we can all relate too and are very funny.  I love all the Diary of a Wimpy Kid movies and my kids have read all the books.  If you're looking for non-animal talking movies (I get so tired of those movies where animals talk to each other with human voices) for your kids and that are not scary or has cussing/sex/negative teenage angst (kids snobbing each other and acting ugly), then you should be quite happy with this movie and all the others.",
    "images": [],
    "asin": "B00APVBMJ2",
    "parent_asin": "B00APVBMJ2",
    "user_id": "AEYVPPWR4CIKWX4BGYKCBCDL2CZQ",
    "timestamp": "2017-07-25 13:39:21.980000",
    "helpful_vote": 5,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 7245,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/65eb88580ad8b77188bcf22232f097e77ec1850e1b51dc1180aa5a4b8acad13b._RI_TTW_SX360_FMwebp_.png",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/65eb88580ad8b77188bcf22232f097e77ec1850e1b51dc1180aa5a4b8acad13b._RI_TTW_SX480_FMwebp_.png",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/65eb88580ad8b77188bcf22232f097e77ec1850e1b51dc1180aa5a4b8acad13b._RI_TTW_SX720_FMwebp_.png",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/65eb88580ad8b77188bcf22232f097e77ec1850e1b51dc1180aa5a4b8acad13b._RI_TTW_SX1080_FMwebp_.png",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/65eb88580ad8b77188bcf22232f097e77ec1850e1b51dc1180aa5a4b8acad13b._RI_TTW_SX1440_FMwebp_.png",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/65eb88580ad8b77188bcf22232f097e77ec1850e1b51dc1180aa5a4b8acad13b._RI_TTW_SX1920_FMwebp_.png",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "David Bowers"
      ],
      "Producers": [
        "Nina Jacobson",
        "Jeff Kinney",
        "Simon Reeves",
        "Jeremiah Samuels",
        "Brad Simpson",
        "Bryan Unkeless"
      ],
      "Starring": [
        "Zachary Gordon",
        "Zachary Gordon",
        "Robert Capron"
      ],
      "Studio": [
        "Fox"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}