{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/01/11\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Starring': ['Gabriel Chavarria', 'Jessica Garza', 'Amanda Warren'], 'Studio': ['USA']}\nReview Text: Just okay\nReview Title: Eh\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Marvel Studios Cinematic Collection Phase 1\nRobert Downey Jr.  (Actor, Host),     Jeff Bridges  (Actor, Host),     Joe Johnston  (Director, Host),     Jon Favreau  (Director)    &                   1                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Iron Man:', 'Deleted and Extended Scenes (HD)', 'Incredible Hulk:', 'Alternate Opening, The Making of Incredible, Becoming the Hulk, Becoming the Abomination, Anatomy of a Hulk-Out, From Comic Book to Screen, Deleted Scenes, Feature Commentary With Director Louis Leterrier and Tim Roth', 'Iron Man 2:', 'S.H.I.E.L.D. Data Vault: An In-Depth Look at the Marvel Cinematic Universe HD, Commentary by Director Jon Favreau, And More!', 'Thor:', 'Commentary by Director Kenneth Branagh, Road to The Avengers HD, Marvel One-Shot: The Consultant HD, 11 Deleted Scenes HD, 7 Featurettes HD, And More', 'Captain America:', 'Outfitting A Hero HD, The Assembly Begins HD, And More!', 'Avengers Assemble:', 'Deleted Scenes, Gag Reel, Marvel One-shot: Item 47, A Visual Journey', 'BONUS DISC', '‘Phase 1 archives’ bonus disc, including Phil Coulson’s introductions to each film, the famous ‘and Then Shawarma After’ featurette, deleted scenes, animatics and more from each film.', 'Iron Man - Agent Coulson Intro: Iron Man, Iron Man - Deleted Scenes - Champions, Iron Man - Animatics, Iron Man - Pre-viz, The Incredible Hulk - Agent Coulson Intro: The Incredible Hulk, The Incredible Hulk - Pre-viz, Iron Man 2 - Agent Coulson Intro - Iron Man 2, Iron Man 2 - Deleted Scenes, Iron Man 2 - Animatics, Iron Man 2 - Pre-viz, Thor - Agent Coulson Intro - Thor, Thor - Deleted Scenes, Thor - Animatics, Captain America: The First Avenger - Agent Coulson Intro - Captain America: The First Avenger, Captain America: The First Avenger - Animatics, Avengers Assemble... - Agent Coulson Intro -Avengers Assemble, Avengers Assemble - And Then Shawarma After, Avengers Assemble - Deleted Scenes, Avengers Assemble - Animatics, Avengers Assemble - Pre-viz.']\n{'Aspect Ratio': 'Unknown', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.61 x 6.97 x 4.88 inches; 1.17 Pounds', 'Item model number': 'BUH0287401', 'Director': 'Joe Johnston, Jon Favreau, Joss Whedon, Kenneth Branagh, Louis Leterrier', 'Media Format': 'Import', 'Run time': '11 hours and 53 minutes', 'Release date': 'November 20, 2017', 'Actors': 'Robert Downey Jr., Jeff Bridges, Liv Tyler, Tim Roth, William Hurt', 'Subtitles': 'Greek, Dutch, Italian, Finnish, Polish, Hungarian, Norwegian, Portuguese, Swedish, Korean, French, Spanish, German', 'Producers': \"Marvel Studios Collector's Edition Box Set - Phase 1 - 7-Disc Boxset ( Iron Man / The Incredible Hul, Marvel Studios Collector's Edition Box Set - Phase 1 - 7-Disc Boxset, Iron Man / The Incredible Hulk / Iron Man 2 / Thor / Captain America: The First Avenger / The Avenge\", 'Language': 'Italian (Dolby Digital 2.0), English (Dolby Digital 2.0), Unknown (Dolby Surround)', 'Studio': \"Disney Int'L\", 'Number of discs': '1'}\nExcellent set for Marvel fans.\nFive Stars\nMarvel Studios Cinematic Collection Phase 2\nRobert Downey Jr.  (Actor, Host),     Guy Pearce  (Actor, Host),     Alan Taylor  (Director, Host),     Anthony Russo  (Director)    &                   1                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Iron Man 3:', 'Marvel One-Shot: Agent Carter, Iron Man 3 Unmasked, Deconstructing The Scene: Attack on Air Force One, Deleted & Extended Scenes, Gag Reel, Exclusive Behind The Scenes Look - Thor: The Dark World, Commentary By Shane Black and Drew Pearce', 'Thor The Dark World:', \"Marvel One Shot: All Hail The King, Featurette - A Brother's Journey: Thor & Loki, Exclusive Look - Captain America: The Winter Soldier, Featurette - Scoring Thor: The Dark World With Brian Tyler, Deleted & Extended Scenes, Gag Reel, Audio Commentary, Extended Celebration Scene, Jane Learns About The Aether, Loki: The First Avenger, Thor and Frigga Discuss Loki, Dark Elves Prepare For Battle\", 'Captain America:', \"Commentary by Joe and Anthony Russo, & Christopher Markus and Stephen McFeely, Gag Reel, Deleted Scenes: In Pursuit of Captain America, Hill and Sitwell Talk Loyalty, Nick Fury's Circle, Widow Reveals Her Past, Featurettes: On the Front Line: Inside Look at Captain America's Battlegrounds, On Set with Anthony Mackie: Cut the Check!, Steve Roger's Notebook\", 'Guardians Of The Galaxy:', \"Featurettes: Guide to the galaxy with James Gunn, The Intergalactic visual effects for Guardians of Galaxy, Exclusive look at Marvel's Avengers: Age of Ultron, Gag reel, Deleted & extended scenes: Fake laugh, The Kyln will have to do, No, I'm the stupid one, Sisterly love, Dancing guard, Audio commentary with director James Gunn\", 'Avengers Age Of Ultron:', 'From The Inside Out - Making Of The Avengers: Age Of Ultron, The Infinite Six, Global Adventure, Deleted & Extended Scenes, Gag Reel, Audio Commentary With Director Joss Whedon', 'Ant-Man:', \"Featurettes - Making Of An Ant-Sized Heist: A How To Guide, Featurettes - Let's Go To The Macroverse, Featurettes - WHIH News Front, Deleted & Extended Scenes - Audio Commentary By Peyton Reed And Paul Rudd, Gag Reel\", 'BLU-RAY BONUS DISC:', 'Deleted & Extended Scenes, Marvel One-Shot films and Commentary, From Here to Infinity: Phases 2 and 3 of the M.C.U., Tag Scenes: A Making-Of, Screen Test with Chris Pratt and Dave Bautista.', \"Bonus Features: From Here To Infinity: Phases 2 & 3 Of The M.C.U., Bonus Features: Phase 2 Tag Scenes: A Making-Of, Bonus Features: Gag Reel, Marvel One-Shots: The Consultant [Thor], Marvel One-Shots: The Consultant With Audio Commentary By Clark Gregg [Thor], Marvel One-Shots: A Funny Thing Happened On The Way To Thor's Hammer [CA: The First Avenger], Marvel One-Shots: A Funny Thing Happened On The Way To Thor's Hammer With Audio Commentary By Clark Gregg [CA: The First Avenger], Marvel One-Shots: Item 47 [The Avengers], Marvel One-Shots: Item 47 With Audio Commentary By Louis D'Esposito, Max Hernandez, Titus Welliver And Jesse Bradford [The Avengers], Marvel One-Shots: Agent Carter [Iron Man 3], Marvel One-Shots: Agent Carter With Audio Commentary By Louis D'Esposito And Hayley Atwell [Iron Man 3], Marvel One-Shots: All Hail The King [Thor: TDW], Marvel One-Shots: All Hail The King With Audio Commentary By Drew Pearce And Ben Kingsley [Thor: TDW], Iron Man 3: Deleted Scenes, Iron Man 3: Preproduction Creative, Thor: The Dark World: Deleted Scenes, Thor: The Dark World: Preproduction Creative, Captain America: The Winter Solider: Deleted Scene, Captain America: The Winter Solider: Deleted Scene With Audio Commentary By Anthony Russo, Joe Russo, Christopher Markus, Stephen McFeely, Captain America: The Winter Soldier - Preproduction Creative, Guardians Of The Galaxy: Deleted Scenes, Guardians Of The Galaxy: Preproduction Creative, Avengers: Age Of Ultron: Deleted Scenes, Avengers: Age Of Ultron: Preproduction Creative: Hulk vs. Hulkbuster, Ant-Man: Deleted Scenes, Ant-Man: Preproduction Creative.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Import', 'Contributor': \"Anthony Russo, Iron Man Three / Thor: The Dark World / Captain America: The Winter Soldier / Guardians of the Galax, Alan Taylor, Guy Pearce, Peyton Reed, Stellan Skarsgard, James Gunn, Marvel Studios Collector's Edition Box Set - Phase 2 - 7-Disc Boxset ( Iron Man Three / Thor: The Da, Glenn Close, Anthony Hopkins, Christopher Eccleston, Robert Redford, Shane Black, Joss Whedon, Robert Downey Jr., Ben Kingsley, Joe Russo, Benicio Del Toro, Jenny Agutter, Marvel Studios Collector's Edition Box Set - Phase 2 - 7-Disc BoxsetAnthony Russo, Iron Man Three / Thor: The Dark World / Captain America: The Winter Soldier / Guardians of the Galax, Alan Taylor, Guy Pearce, Peyton Reed, Stellan Skarsgard, James Gunn, Marvel Studios Collector's Edition Box Set - Phase 2 - 7-Disc Boxset ( Iron M…  See more\", 'Language': 'Italian (Dolby Digital 2.0), English (Dolby Digital 2.0), Unknown (Dolby Surround)', 'Runtime': '753 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.17 x 5.67 x 2.01 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': 'BUH0287501', 'Director': 'Alan Taylor, Anthony Russo, James Gunn, Joe Russo, Joss Whedon', 'Media Format': 'Import', 'Run time': '753 minutes', 'Release date': 'May 3, 2019', 'Actors': 'Robert Downey Jr., Guy Pearce, Ben Kingsley, Anthony Hopkins, Christopher Eccleston', 'Dubbed': 'German', 'Subtitles': 'Dutch, Estonian, French, Greek, Bulgarian, Russian, Finnish, Portuguese, Lithuanian, Spanish, Icelandic, Norwegian, Latvian, Danish, German, Swedish, Turkish', 'Producers': \"Marvel Studios Collector's Edition Box Set - Phase 2 - 7-Disc Boxset ( Iron Man Three / Thor: The Da, Marvel Studios Collector's Edition Box Set - Phase 2 - 7-Disc Boxset, Iron Man Three / Thor: The Dark World / Captain America: The Winter Soldier / Guardians of the Galax\", 'Studio': \"Disney Int'L\", 'Number of discs': '1'}\nGreat set for Marvel fans.\nFive Stars\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Antonio Negret'], 'Producers': ['Michael Brandt', 'Derek Haas', 'Pierre Morel', 'Gregoire Melin', 'Christopher Tuffin', 'Morgan Emmery', 'Jean', 'Charles Levy', 'Renee Tab', 'Marie Wintenberger'], 'Starring': ['Ana de Armas', 'Scott Eastwood', 'Freddie Thorp'], 'Studio': ['PARAMOUNT PICTURES']}\nExtra mediocre. Not even a fun popcorn flick. Skip it.\nNot even a fun popcorn flick\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Colin Trevorrow'], 'Producers': ['Sidney Kimmel', 'Carla Hacken', 'Jenette Kahn', 'Adam Richman'], 'Starring': ['Naomi Watts', 'Jaeden Lieberher', 'Jacob Tremblay'], 'Studio': ['Focus Features']}\nDifferent movie than expected. Less of a thriller, more of a drama, but good movie nonetheless.\nbut good movie nonetheless\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Peckover'], 'Producers': ['Sidonie Abbene', 'Brion Hambel', 'Paul Jensen', 'Brett Thornquest'], 'Starring': ['Olivia DeJonge', 'Levi Miller', 'Ed Oxenbould'], 'Studio': ['AMC Plus Horror']}\nGets a little rapey.\nTwo Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dale Launer'], 'Producers': ['Dale Launer', 'Jeffrey Downer', 'Thomas M. Hammel'], 'Starring': ['Tate Donovan', 'Sandra Bullock', 'Dale Midkiff'], 'Studio': ['Fox']}\nInteresting premise. The writer and director need an editor. It's way too long for the story being told.\nTwo Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Drake Doremus'], 'Producers': ['Drake Doremus', 'Ben York Jones', 'Michael Schaefer', 'Michael Pruss', 'Robert George', 'John Finemore', 'Ridley Scott', 'James Hoppe', 'Mason Novick', 'Shea Kammer', 'Elizabeth Grave'], 'Starring': ['Nicholas Hoult', 'Laia Costa', 'Matthew Gray Gubler']}\nIt's okay, but the story is very odd.\nTwo Stars\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Starring': ['Gabriel Chavarria', 'Jessica Garza', 'Amanda Warren'], 'Studio': ['USA']}\nJust okay\nEh",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: Strongly passionate about movies and TV, particularly in the superhero and action genres, with a notable focus on the Marvel Cinematic Universe and an appreciation for dramatic storytelling that explores darker themes.\n- **Preferences**: Enjoys collecting comprehensive Blu-ray editions with extensive bonus content, while recently demonstrating a willingness to explore unconventional films, albeit with a critical eye on narrative execution and thematic depth.\n- **Favorites**: Continues to favor the Marvel Cinematic Universe for its interconnected storytelling and iconic characters, while being receptive to well-crafted dramas that handle serious subjects thoughtfully.\n- **Engagement Style**: Detail-oriented consumer who values content and filmmaking processes. Recently exhibited more discerning evaluations, emphasizing narrative conciseness and thematic sensitivity, as demonstrated by an average rating of 3.0 on a recent product.\n- **Rating Behavior**: Historically lean towards high ratings, but recent interactions show a shift towards more critical assessments, particularly regarding pacing, narrative structure, and thematic significance.\n- **Overall Sentiment**: While maintaining enthusiasm for products that enhance viewing experiences, the user shows an increasingly critical stance towards offerings lacking in quality or thematic depth. This reflects a balanced approach to fandom culture alongside a nuanced understanding of cinematic quality in viewing choices. \n\nThe user embodies a dedicated film enthusiast, with evolving tastes that prioritize intricate narratives and thoughtful execution in their viewing selections.",
  "metrics": {
    "rouge1_f": 0.08399787347155768,
    "rouge2_f": 0.00532197977647685,
    "rougeL_f": 0.03934077618288145,
    "meteor": 0.02523775359653469,
    "bleu1": 6.701753597556799e-05,
    "bleu2": 1.9154373611815567e-05,
    "bleu3": 8.320066185157976e-06,
    "bleu4": 4.615208941240533e-06,
    "bertscore_precision": 0.34914350509643555,
    "bertscore_recall": 0.43872377276420593,
    "bertscore_f1": 0.38884100317955017
  }
}