{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/12/08\nAverage Rating: 3.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Kyle Saylors'], 'Producers': ['Kenny Saylors', 'Norman Pardo'], 'Starring': ['O.J. Simpson', 'Norman Pardo', 'Wendy Williams']}\nReview Text: I actually found this interesting and perspective as to the dealings and sealing of evidence that has never been turned over or opened by Garcetti.  - interesting investigation sealings - interesting relationships exposed.  It was a perspective from a man that was inside and these facts never came up in the media reports.  The man doing life, Danny Wacsz I think was his name and his letter.  The relationships between Nicole and Kris Kardashian-Jenner and the friendship between Kardashian and OJ.  Very informative details bravely told.  What does it all mean, not much.  But it was worth watching, I fell asleep during it as it was sort of repeating itself and somewhat disconnecting so that a few details could be made long enough to drag into a movie length.  I don't think Kardashian should have been able to use his legal license to prevent questions due to the length of his license being inactive and his close relationship with OJ and the fact that he had been accused of hiring a hitman for OJ to kill Nicole.  Also the information that Kris had a long running open marriage with sexual relationships with OJ - has this even been proven?  But it did explain why people keep saying Khloe is OJ's child. I had not heard this before that there was cross overs in the pairs, I guess they call it \"swinging\"; but during the time that type as is today, very popular among couples so it's not unbelievable, it is just information that probably unless you were in the room, can't be verified.  Given that young Rob Kardashian has texted about his ability to take down others, and has been sued for threats founded or unfounded??? through various groups it does raise brows to question the dynamics of this family's history.  Whatever the case, Nicole and Ron are deceased and I hope they are at peace in their souls and whomever was responsible has to live with it forever.  Drugs were involved, that was made clear and dangerous criminal types and anger, rage and jealousy.  Never a winning recipe.\nReview Title: Interesting details never before told\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joseph Gordon-Levitt'], 'Producers': ['Ram Bergman'], 'Starring': ['Joseph Gordon-Levitt', 'Scarlett Johansson', 'Julianne Moore'], 'Studio': ['RELATIVITY MEDIA']}\nstupid\nOne Star\n{'Subtitles': ['None available'], 'Directors': ['William Wyler'], 'Producers': ['Samuel Goldwyn'], 'Starring': ['Merle Oberan', 'Laurence Olivier', 'David Niven'], 'Studio': ['MGM']}\nlove it\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Shekhar Kapur'], 'Producers': ['Alison Owen', 'Eric Fellner', 'Tim Bevan'], 'Starring': ['Eric Cantona', 'Cate Blanchett', 'Geoffrey Rush'], 'Studio': ['UNIVERSAL PAY TELEVISION']}\nbest movie every!\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Castle'], 'Producers': ['Marty Katz'], 'Starring': ['Ellen DeGeneres', 'Bill Pullman', 'Joan Cusack'], 'Studio': ['Touchstone Pictures']}\ngreat movie to have on stand by\nFive Stars\nI, Tonya\nComedy, Sports, Compelling, Downbeat\n['Tonya Harding catapults to stardom at the U.S. Figure Skating Championships. But when her ex-husband intervenes to eliminate a rival, one of the most sensational scandals in sports history transpires.']\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Craig Gillespie'], 'Producers': ['Bryan Unkeless', 'Steven Rogers', 'Margot Robbie', 'Tom Ackerley'], 'Starring': ['Margot Robbie', 'Sebastian Stan', 'Allison Janney']}\nthe soundtrack is unbelievable and the acting is hysterical, many built in jokes within this sad drama.  definitely a must watch.\nmany built in jokes within this sad drama. definitely a must watch\nGifted\nDrama, Inspiring, Passionate, Touching\n['In this wonderfully moving film, a single man (Chris Evans) strives to give his child prodigy niece (Mckenna Grace) a normal life, despite interference from the girl’s grandmother.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Marc Webb'], 'Producers': ['Molly Allen', 'Glen Basner', 'Ben Browning', 'Andy Cohen', 'T.K. Knowles', 'Karen Lunder', \"John O'Grady\", 'Chuck Ryant'], 'Starring': ['Mckenna Grace', 'Chris Evans', 'Lindsay Duncan']}\ngreat family movie\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['George Cukor'], 'Producers': ['Lawrence Weingarten'], 'Starring': ['Spencer Tracy', 'Katharine Hepburn', 'Judy Holliday'], 'Studio': ['WARNER BROS.']}\ngreat oldie but goodie about a lawyer and his wife.\nFive Stars\nMom\nDrama, Comedy, Romance\n[\"From hitmaker Chuck Lorre comes his next big comedy – an irreverent and outrageous take on true family love – and dysfunction. Newly sober single mom Christy struggles to raise two children in a world full of temptations and pitfalls. Testing her sobriety is her formerly estranged mother, now back in Christy's life and eager to share passive-aggressive insights into her daughter's many mistakes.\"]\n{'Audio languages': ['English', 'Deutsch'], 'Subtitles': ['English [CC]'], 'Producers': ['Gemma Baker'], 'Starring': ['Anna Faris', 'Anna Faris', 'Allison Janney']}\nawful\nOne Star\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Patrick Jann', 'Robert Ben Garant', 'Thomas Lennon', 'Christian Hoffman', 'David Lincoln', 'James Alan Hensz', 'Brad Abrams'], 'Producers': ['Michael Patrick Jann', 'Robert Ben Garant', 'Thomas Lennon', 'Kerri Kenney', 'Danny DeVito', 'Peter Principato'], 'Starring': ['Thomas Lennon', 'Robert Ben Garant', 'Kerri Kenney-Silver'], 'Studio': ['CBS']}\nalways funny to watch when you have things going on.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Barry Levinson'], 'Producers': ['Amy Herman', 'Barry Levinson', 'Jason Sosnoff', 'Tom Fontana', 'Edward R. Pressman'], 'Starring': ['Al Pacino', 'Riley Keough', 'Larry Mitchell'], 'Studio': ['HBO']}\nnot what i expected, only focused on joe's confusion and sense of or lack of understanding on what sodomy was?  like - r u kidding me?  but either way - al pacino impressed as usual and carried it off well.\nlike - r u kidding me\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English (US) [CC]', 'English [CC]'], 'Directors': ['Silver Screen Pictures'], 'Producers': ['Kyle A. Clark', 'Laurence P. Duke', 'Joshua D. Maurer', 'Judith Verno', 'Alixandre Witlin', 'Lina Wong'], 'Studio': ['Lifetime']}\nEh\nEh\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Patrick King', 'Michael Lehmann', 'John Riggi', 'Clark Mathis', 'Greg Mottola', 'David Steinberg'], 'Producers': ['Michael Patrick King', 'John Riggi', 'Dan Bucatinsky', 'Lisa Kudrow', 'Amy Harris', 'Eric M. Cyphers'], 'Starring': ['Lisa Kudrow'], 'Studio': ['HBO']}\nLisa did a great job with her series of being a reality star looking for a comeback.  First season was better, but if you like Lisa Kudrow, you will like this series.\nThe Comeback is one of my favorite series\n{'Subtitles': ['None available'], 'Directors': ['Kyle Saylors'], 'Producers': ['Kenny Saylors', 'Norman Pardo'], 'Starring': ['O.J. Simpson', 'Norman Pardo', 'Wendy Williams']}\nI actually found this interesting and perspective as to the dealings and sealing of evidence that has never been turned over or opened by Garcetti.  - interesting investigation sealings - interesting relationships exposed.  It was a perspective from a man that was inside and these facts never came up in the media reports.  The man doing life, Danny Wacsz I think was his name and his letter.  The relationships between Nicole and Kris Kardashian-Jenner and the friendship between Kardashian and OJ.  Very informative details bravely told.  What does it all mean, not much.  But it was worth watching, I fell asleep during it as it was sort of repeating itself and somewhat disconnecting so that a few details could be made long enough to drag into a movie length.  I don't think Kardashian should have been able to use his legal license to prevent questions due to the length of his license being inactive and his close relationship with OJ and the fact that he had been accused of hiring a hitman for OJ to kill Nicole.  Also the information that Kris had a long running open marriage with sexual relationships with OJ - has this even been proven?  But it did explain why people keep saying Khloe is OJ's child. I had not heard this before that there was cross overs in the pairs, I guess they call it \"swinging\"; but during the time that type as is today, very popular among couples so it's not unbelievable, it is just information that probably unless you were in the room, can't be verified.  Given that young Rob Kardashian has texted about his ability to take down others, and has been sued for threats founded or unfounded??? through various groups it does raise brows to question the dynamics of this family's history.  Whatever the case, Nicole and Ron are deceased and I hope they are at peace in their souls and whomever was responsible has to live with it forever.  Drugs were involved, that was made clear and dangerous criminal types and anger, rage and jealousy.  Never a winning recipe.\nInteresting details never before told",
  "profile": "User Profile Summary:\n\n- **Rating Trends**: The user continues to demonstrate a discerning taste in media, recently giving a high rating to a documentary due to its intriguing exploration of lesser-known details surrounding high-profile events. Their critical eye remains focused on the balance between quality storytelling and thematic depth.\n\n- **Content Preferences**: Their ongoing inclination toward complex narratives and adult themes is evident, with a preference for authentic portrayals of personal and social issues. The user appreciates narratives that provide unique insights and foster discussions about controversial topics.\n\n- **Language and Accessibility**: The user consistently prefers English audio, underscoring their commitment to clarity and accessibility, though they remain flexible regarding subtitle preferences when none are available.\n\n- **Creative Involvement**: They maintain an interest in skilled filmmakers and notable figures, expressing curiosity about the intricate dynamics of relationships within narratives, whether classic or modern.\n\n- **Emotional Reaction**: The user exhibits a strong emotional connection to media, increasingly scrutinizing content that feels superficial or inauthentic. Their appreciation for diverse and thought-provoking themes persists, emphasizing the need for depth.\n\n- **Customization Preferences**: They continue to seek engaging content that marries entertainment with profound thematic exploration, maintaining a critical stance towards both narrative execution and humor, particularly when addressing complex social issues.\n\nOverall, the user values emotionally resonant media that champions depth and authenticity, while remaining open to exploring provocative themes.",
  "metrics": {
    "rouge1_f": 0.1262357414448669,
    "rouge2_f": 0.006092916984006093,
    "rougeL_f": 0.060836501901140684,
    "meteor": 0.039189127738401726,
    "bleu1": 0.0013491832806711555,
    "bleu2": 0.00029635768746781577,
    "bleu3": 4.859531636023451e-05,
    "bleu4": 1.969585229719165e-05,
    "bertscore_precision": 0.33650457859039307,
    "bertscore_recall": 0.4303046464920044,
    "bertscore_f1": 0.3776675760746002
  }
}