{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/10/23\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['---'], 'Producers': ['Peter Lhotka', 'Sheri Singer', 'Georgene Smith'], 'Studio': ['Disney Channel']}\nReview Text: The first one is  better\nReview Title: Cheesy af\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Atoning Yoga Releasing Control\nSarah Sutton  (Actor, Artist)    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n['A total of 90 minutes in length, Atoning Yoga DVDs are designed to fit your busy schedule and give you a still, calming, meditative experience with God. Offering 15 min, 30 min, and 45 min sessions, every class is inspired by a verse, opens and closes in prayer, and includes an on-going prayer that you can actively apply to your life. The Releasing Control series will walk you through how to let go of your anxiety and control issues so you can find the peace that passes all understanding through freedom in a personal relationship with Christ.', \"When sold by Amazon.com, this product will be manufactured on demand using DVD-R recordable media. Amazon.com's standard return policy will apply.\"]\n{'Genre': 'Exercise & Fitness', 'Format': 'NTSC', 'Contributor': 'Stephen Henderson, Sarah Sutton', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'November 27, 2013', 'Actors': 'Sarah Sutton', 'Producers': 'Stephen Henderson', 'Number of discs': '1'}\nIf you do yoga at all, this is very boring. You are seated the whole time and it is extremely slow paced. They music is nice and the prayer is nice. This could be nice if you were looking for a bed time routine\nthis is very boring. You are seated the whole time and it ...\nIndependence Day\nWill Smith  (Actor),     Bill Pullman  (Actor),     Roland Emmerich  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"One of the biggest box office hits of all time, Independence Day delivers the ultimate encounter when mysterious and powerful aliens launch an all out invasion against the human race. The spectacle begins when massive spaceships appear in Earth's skies. But wonder turns to terror as the ships blast destructive beams of fire down on cities all over the planet. Now the world's only hope lies with a determined band of survivors, uniting for one last strike against the invaders -- before it's the end of mankind.\"]\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Judd Hirsch, Harvey Fierstein, Bill Pullman, Adam Baldwin, Mary McDonnell, Vivica A. Fox, Randy Quaid, James Rebhorn, Jeff Goldblum, Dean Devlin, Will Smith, Robert Loggia, Roland Emmerich, Margaret ColinJudd Hirsch, Harvey Fierstein, Bill Pullman, Adam Baldwin, Mary McDonnell, Vivica A. Fox, Randy Quaid, James Rebhorn, Jeff Goldblum, Dean Devlin, Will Smith, Robert Loggia, Roland Emmerich, Margaret Colin  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 25 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '2200', 'Director': 'Roland Emmerich', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 25 minutes', 'Release date': 'February 11, 2003', 'Actors': 'Will Smith, Bill Pullman, Jeff Goldblum, Mary McDonnell, Judd Hirsch', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Writers': 'Dean Devlin, Roland Emmerich', 'Number of discs': '1'}\nFavorite movie!!\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['---'], 'Producers': ['Peter Lhotka', 'Sheri Singer', 'Georgene Smith'], 'Studio': ['Disney Channel']}\nThe first one is  better\nCheesy af",
  "profile": "**Updated User Profile Summary:**\n\n- **Interest in Meditation and Spirituality:** The user prioritizes mindfulness and spiritual elements in their pursuits, demonstrating a commitment to personal growth and emotional well-being.\n\n- **Focus on Stress Relief:** They actively seek out methods to alleviate anxiety and manage control issues, reinforcing their dedication to emotional healing.\n\n- **Exercise Preferences:** Slow-paced and calming exercise routines, particularly yoga, align with their relaxation goals. However, their critical feedback on a prior yoga DVD indicates a desire for more dynamic or varied content in mindful practices.\n\n- **Content Engagement:** The user enjoys diverse genres, including dynamic and action-packed narratives, as evidenced by their mixed engagement with various media formats. Their recent review indicates a preference for high-quality content but with a discerning eye regarding execution, particularly in entertainment.\n\n- **Format Preference:** They show a clear inclination towards physical media, underscored by their purchases of DVDs, favoring tangible experiences.\n\n- **Critical Evaluation:** The user possesses a discerning taste and articulates constructive criticism. Their recent review reflects a mixed sentiment towards some content, signaling that they value quality and innovation in their entertainment choices.\n\nOverall, this user maintains a balanced approach to leisure activities, blending relaxation and mindfulness with engaging and varied entertainment, while consistently seeking excellence in both realms.",
  "metrics": {
    "rouge1_f": 0.18461538461538463,
    "rouge2_f": 0.015424164524421592,
    "rougeL_f": 0.07692307692307693,
    "meteor": 0.06872590004594573,
    "bleu1": 0.03673839606259996,
    "bleu2": 0.007937974598578874,
    "bleu3": 0.0013945284847448841,
    "bleu4": 0.0005850508817223652,
    "bertscore_precision": 0.3404587507247925,
    "bertscore_recall": 0.44800955057144165,
    "bertscore_f1": 0.386898934841156
  }
}