{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Deep Wave Lace Closure 4x4 Three Part/Middle Part/ Free Part 100% Unprocessed Virgin Brazilian Deep Curly Human Hair Lace Closure (20 inch., Lace Closure)\nReview Date: 2020/11/09\nStore: msjoli\nAverage Rating: 2.8\nProduct Details: {'Brand': 'msjoli', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.57 x 6.46 x 0.75 inches; 1.73 Ounces'}\nReview Text: If you just want a cheap closure for the low then go for it.. but this lace is not it. The hair was shedding like crazy...\nReview Title: Don’t buy save your money\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Grace Plus Hair 613 Blonde Straight Human Hair Lace Front Wigs 150% Density 13x4 Brazilian Straight Human Hair Wigs for Women Pre Plucked With Baby Hair (30 inch, 613 Blonde wig)\nGRACE PLUS\n{}\nIt sheds tremendously!!! And the wig is not 150 density ... I have a recent blonde 150 density wig and it’s full as hell (Another vendor and website) !! And yes I’m getting my $294 back. If you get a wig from them just make sure it’s 18 inches and shorter. The longer the worse. And it tangles\nBuy at your own risk\nStraight Ponytail Extension Human Hair 120g Wrap Around Ponytail Natural Color 100% Remy Human Hair Magic Paste Long Ponytail Clip in Hair Extensions Straight Ponytail (14, 4x4)\nlianlian\n{'Brand': 'Lianlian', 'Material': 'Human Hair', 'Extension Length': '8 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Clip-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9 x 6.14 x 0.63 inches; 0.81 Ounces', 'Item model number': '6STWlacecloFP20', 'UPC': '723740518450'}\nCan you say the worst lace closure ever!!! I purchased this piece a month ago (9/29/2020) yesterday (10/24/2020) I decided to install my closure since I was going to take fall pictures. Anyways, I was only going to wear my closure for only one day. When I finally took it out today to wash it started shedding like crazy !!! Just to remind you guys I only used flexi rods no heat whatsoever!!!! The length I bought was 20 inches but it seem more 14-16 inches. Don’t buy save them coins!!!\nDon't buy this lace closure\nDeep Wave Lace Closure 4x4 Three Part/Middle Part/ Free Part 100% Unprocessed Virgin Brazilian Deep Curly Human Hair Lace Closure (20 inch., Lace Closure)\nmsjoli\n{'Brand': 'msjoli', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.57 x 6.46 x 0.75 inches; 1.73 Ounces'}\nIf you just want a cheap closure for the low then go for it.. but this lace is not it. The hair was shedding like crazy...\nDon’t buy save your money",
  "profile": "**User Summary:**\n\n- **Hair Product Preferences:** The user maintains a strong affinity for high-density wigs and has consistently expressed dissatisfaction with density claims in their purchases. They critique shedding and tangling issues, particularly in longer hairstyles, leading to a preference for shorter wigs.\n\n- **Quality Concerns:** Quality is paramount for this user, who routinely reviews products critically when they fail to meet advertised standards. They are unafraid to seek refunds for unsatisfactory items, showcasing a commitment to quality assurance.\n\n- **Color Preference:** The user favors blonde hair, specifically targeting shades that have previously provided positive results.\n\n- **Review Behavior:** Actively engages in leaving detailed reviews, advising others against potential pitfalls and highlighting specific product inefficiencies.\n\n- **Customer Service Expectations:** Expects responsive customer service and equitable return policies, supported by past experiences that involved seeking refunds.\n\n- **Recent Interaction:** Recently reported significant dissatisfaction with a purchase due to excessive shedding and poor quality, strongly cautioning others against similar products. This further reinforces the user’s commitment to transparency and quality, driving their future purchasing decisions.\n\nOverall, this user emphasizes quality, density, and actual performance in hair products. Their preferences are shaped by past experiences, leading them to make informed choices while sharing valuable insights with the community.",
  "metrics": {
    "rouge1_f": 0.1981981981981982,
    "rouge2_f": 0.010849909584086801,
    "rougeL_f": 0.07567567567567568,
    "meteor": 0.10397830018083182,
    "bleu1": 0.11875607588624555,
    "bleu2": 0.014645417345515218,
    "bleu3": 0.003387903558458115,
    "bleu4": 0.0016310141433865872,
    "bertscore_precision": 0.3530699610710144,
    "bertscore_recall": 0.4033963680267334,
    "bertscore_f1": 0.3765591084957123
  }
}