{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lizourey Hair Brazilian Virgin Hair Straight Hair One Bundle 18inch 100% Unprocessed Virgin Human Hair Extension Weave Weft Natural Black Color (100+/-5g)/bundle Can be Dyed and Bleached\nReview Date: 2020/11/09\nStore: Lizourey\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Lizourey', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.03 x 6.65 x 1.81 inches; 4.06 Ounces', 'UPC': '823717531441'}\nReview Text: The hair was very thin!!! I know longer bundles supposed to be thin but this thin was not it!!!\nReview Title: Very thin\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Grace Plus Hair 613 Blonde Straight Human Hair Lace Front Wigs 150% Density 13x4 Brazilian Straight Human Hair Wigs for Women Pre Plucked With Baby Hair (30 inch, 613 Blonde wig)\nGRACE PLUS\n{}\nIt sheds tremendously!!! And the wig is not 150 density ... I have a recent blonde 150 density wig and it’s full as hell (Another vendor and website) !! And yes I’m getting my $294 back. If you get a wig from them just make sure it’s 18 inches and shorter. The longer the worse. And it tangles\nBuy at your own risk\nStraight Ponytail Extension Human Hair 120g Wrap Around Ponytail Natural Color 100% Remy Human Hair Magic Paste Long Ponytail Clip in Hair Extensions Straight Ponytail (14, 4x4)\nlianlian\n{'Brand': 'Lianlian', 'Material': 'Human Hair', 'Extension Length': '8 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Clip-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9 x 6.14 x 0.63 inches; 0.81 Ounces', 'Item model number': '6STWlacecloFP20', 'UPC': '723740518450'}\nCan you say the worst lace closure ever!!! I purchased this piece a month ago (9/29/2020) yesterday (10/24/2020) I decided to install my closure since I was going to take fall pictures. Anyways, I was only going to wear my closure for only one day. When I finally took it out today to wash it started shedding like crazy !!! Just to remind you guys I only used flexi rods no heat whatsoever!!!! The length I bought was 20 inches but it seem more 14-16 inches. Don’t buy save them coins!!!\nDon't buy this lace closure\nDeep Wave Lace Closure 4x4 Three Part/Middle Part/ Free Part 100% Unprocessed Virgin Brazilian Deep Curly Human Hair Lace Closure (20 inch., Lace Closure)\nmsjoli\n{'Brand': 'msjoli', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.57 x 6.46 x 0.75 inches; 1.73 Ounces'}\nIf you just want a cheap closure for the low then go for it.. but this lace is not it. The hair was shedding like crazy...\nDon’t buy save your money\nLizourey Hair Brazilian Virgin Hair Straight Hair One Bundle 18inch 100% Unprocessed Virgin Human Hair Extension Weave Weft Natural Black Color (100+/-5g)/bundle Can be Dyed and Bleached\nLizourey\n{'Brand': 'Lizourey', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.03 x 6.65 x 1.81 inches; 4.06 Ounces', 'UPC': '823717531441'}\nThe hair was very thin!!! I know longer bundles supposed to be thin but this thin was not it!!!\nVery thin",
  "profile": "**User Summary:**\n\n- **Hair Product Preferences:** The user continues to favor high-density wigs but has expanded their product interests to include weaves, expressing ongoing dissatisfaction with density claims. They actively critique shedding and tangling, particularly in longer hairstyles, reinforcing their preference for shorter options.\n\n- **Quality Concerns:** Quality remains a critical factor for this user, who meticulously reviews products and is not hesitant to demand refunds for items that do not meet expectations. Their latest experience with a weave highlighted concerns over thinness, further shaping their purchasing criteria.\n\n- **Color Preference:** While primarily favoring blonde shades, the user has recently explored natural black options, indicating a willingness to experiment when quality is assured.\n\n- **Review Behavior:** They consistently provide detailed reviews, warning others about potential product shortcomings and emphasizing the importance of true product performance versus marketing claims.\n\n- **Customer Service Expectations:** The user expects prompt customer service and fair return policies, rooted in their experiences with refund requests.\n\n- **Recent Interaction:** Their most recent purchase led to significant dissatisfaction due to the product being thinner than expected, influencing their negative review and solidifying their focus on quality and density in future purchases. This interaction illustrates their commitment to transparency, advising the community against inferior options.\n\nOverall, the user prioritizes quality, density, and performance in hair products, making informed choices informed by past experiences and sharing valuable insights with others.",
  "metrics": {
    "rouge1_f": 0.18373493975903613,
    "rouge2_f": 0.01510574018126888,
    "rougeL_f": 0.0783132530120482,
    "meteor": 0.09253244069015099,
    "bleu1": 0.08449500380147437,
    "bleu2": 0.010264236521598812,
    "bleu3": 0.002362256085431985,
    "bleu4": 0.0011342395505405064,
    "bertscore_precision": 0.3425666391849518,
    "bertscore_recall": 0.3992706537246704,
    "bertscore_f1": 0.36875149607658386
  }
}