{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Straight Ponytail Extension Human Hair 120g Wrap Around Ponytail Natural Color 100% Remy Human Hair Magic Paste Long Ponytail Clip in Hair Extensions Straight Ponytail (14, 4x4)\nReview Date: 2020/10/25\nStore: lianlian\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Lianlian', 'Material': 'Human Hair', 'Extension Length': '8 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Clip-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9 x 6.14 x 0.63 inches; 0.81 Ounces', 'Item model number': '6STWlacecloFP20', 'UPC': '723740518450'}\nReview Text: Can you say the worst lace closure ever!!! I purchased this piece a month ago (9/29/2020) yesterday (10/24/2020) I decided to install my closure since I was going to take fall pictures. Anyways, I was only going to wear my closure for only one day. When I finally took it out today to wash it started shedding like crazy !!! Just to remind you guys I only used flexi rods no heat whatsoever!!!! The length I bought was 20 inches but it seem more 14-16 inches. Don’t buy save them coins!!!\nReview Title: Don't buy this lace closure\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Grace Plus Hair 613 Blonde Straight Human Hair Lace Front Wigs 150% Density 13x4 Brazilian Straight Human Hair Wigs for Women Pre Plucked With Baby Hair (30 inch, 613 Blonde wig)\nGRACE PLUS\n{}\nIt sheds tremendously!!! And the wig is not 150 density ... I have a recent blonde 150 density wig and it’s full as hell (Another vendor and website) !! And yes I’m getting my $294 back. If you get a wig from them just make sure it’s 18 inches and shorter. The longer the worse. And it tangles\nBuy at your own risk\nStraight Ponytail Extension Human Hair 120g Wrap Around Ponytail Natural Color 100% Remy Human Hair Magic Paste Long Ponytail Clip in Hair Extensions Straight Ponytail (14, 4x4)\nlianlian\n{'Brand': 'Lianlian', 'Material': 'Human Hair', 'Extension Length': '8 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Clip-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9 x 6.14 x 0.63 inches; 0.81 Ounces', 'Item model number': '6STWlacecloFP20', 'UPC': '723740518450'}\nCan you say the worst lace closure ever!!! I purchased this piece a month ago (9/29/2020) yesterday (10/24/2020) I decided to install my closure since I was going to take fall pictures. Anyways, I was only going to wear my closure for only one day. When I finally took it out today to wash it started shedding like crazy !!! Just to remind you guys I only used flexi rods no heat whatsoever!!!! The length I bought was 20 inches but it seem more 14-16 inches. Don’t buy save them coins!!!\nDon't buy this lace closure",
  "profile": "**User Summary:**\n\n- **Hair Product Preferences:** Maintains a strong preference for high-density wigs, but has consistently expressed dissatisfaction with claims regarding density in purchased products. The user particularly critiques shedding and tangling issues in longer hairstyles, leading to a clear inclination for shorter wigs.\n\n- **Quality Concerns:** Places a high premium on product quality, often reviewing items critically when there is a mismatch between advertised and actual performance. The user demonstrates a willingness to seek refunds for unsatisfactory purchases, highlighting a firm stance on quality assurance.\n\n- **Color Preference:** Shows a preference for blonde hair, specifically seeking shades that align with previous positive experiences.\n\n- **Review Behavior:** Actively engages in leaving detailed reviews to share experiences and caution others against potential pitfalls, often addressing specific product shortcomings.\n\n- **Customer Service Expectations:** Expects responsive customer service and fair return policies, illustrated by prior experiences of seeking refunds for disappointing products.\n\n- **Recent Interaction:** The user has reported significant dissatisfaction with a recent purchase, indicating issues with shedding and incorrect length, advising others against similar purchases. This reinforces the user's commitment to transparency and quality, further shaping their expectations and future purchasing decisions.\n\nOverall, this user prioritizes quality, density, and tangible performance in hair products, preferring informed choices based on past experiences and actively sharing those insights with the community.",
  "metrics": {
    "rouge1_f": 0.2079002079002079,
    "rouge2_f": 0.016701461377870565,
    "rougeL_f": 0.08316008316008316,
    "meteor": 0.11823825007389889,
    "bleu1": 0.15547114571204704,
    "bleu2": 0.029700650790147144,
    "bleu3": 0.006309354334430313,
    "bleu4": 0.0029106399871921596,
    "bertscore_precision": 0.3738802671432495,
    "bertscore_recall": 0.4000694155693054,
    "bertscore_f1": 0.3865317404270172
  }
}