{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Star Trek: The Next Generation - Season 6 [Blu-ray]\nReview Date: 2015/05/12\nStore: Patrick Stewart  (Actor),     Jonathan Frakes  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Science Fiction\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Box set, Blu-ray, Multiple Formats, Dubbed, NTSC, Full Screen, Subtitled', 'Contributor': 'Jonathan Frakes, Patrick Stewart, Brent Spiner', 'Language': 'English', 'Number Of Discs': '6'}\nReview Text: t's incredible to see these in HD for the first time.  I have the entire series and going through it in HD was like watching it all again for the first time.  The quality is incredible.  I definitely recommend these and watching the whole series again on Blu Ray!\nReview Title: I have the entire series and going through it in HD was like watching it all again for the first time\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'substance use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Klein', 'Phil Churchward', 'Nigel Simpkiss', 'Richard Heeley', 'James Bryce', 'Andrew Fettis', 'Owen Trevor', 'Mark McQueen', 'Jon Richards', 'Konrad Begg'], 'Producers': ['Andy Wilman'], 'Starring': ['Jeremy Clarkson', 'Richard Hammond', 'James May'], 'Studio': ['BBC America']}\nI really enjoy this program.  As always, the quality and speed from Amazon is awesome.  If you're a top gear fan, this is a must see!  This particular episode was hilarious.\nGreat program\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Scanlon'], 'Producers': ['Kori Rae'], 'Starring': ['Billy Crystal', 'John Goodman', 'Steve Buscemi'], 'Studio': ['Pixar']}\nIt was good, not as good as the first Monsters Inc., movie, but good.  The movie is entirely placed when the monsters were in school.  The quality is awesome and it's worth watching, but be prepared for an understated plot.  I would like to have seen more ties to their work after school and getting hired.  This flew by in about a 30 second window in this movie.\nNot as good as the first one...\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Matthew Vaughn'], 'Producers': ['Stephen Marks', 'Peter Morton', 'David Womark', 'Matthew Vaughn', 'Lorenzo Di Bonaventura', 'Michael Dreyer', 'Neil Gaiman'], 'Starring': ['Claire Danes', 'Charlie Cox', 'Sienna Miller']}\nI enjoyed the setting and plot of this movie.  Of course, in the end, we knew the hero would make it.  There were some other surprising plot twists that I hadn't expected.  It was an enjoyable find.<br /><br />If you like movies that contain magic, witches, and some humor, you will probably enjoy this movie.\nSurprisingly good find....\nStar Trek: The Next Generation: Season 3 [Blu-ray]\nMichael Dorn  (Actor),     Gates McFadden  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Season Three of STAR TREK: THE NEXT GENERATION took televised science fiction storytelling to new heights. Now, on high definition Blu-ray, the seminal season of this beloved series is more spectacular and compelling to watch than ever.']\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Multiple Formats, Blu-ray, Box set, Full Screen, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Whoopi Goldberg, Jonathan Frakes, LeVar Burton, Marina Sirtis, Patrick Stewart, Michael Dorn, Brent Spiner, Gates McFadden, Wil WheatonWhoopi Goldberg, Jonathan Frakes, LeVar Burton, Marina Sirtis, Patrick Stewart, Michael Dorn, Brent Spiner, Gates McFadden, Wil Wheaton   See more', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '10655409545', 'Media Format': 'Multiple Formats, Blu-ray, Box set, Full Screen, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '19 hours and 41 minutes', 'Release date': 'July 19, 2016', 'Actors': 'Michael Dorn, Gates McFadden, Brent Spiner, Whoopi Goldberg, Jonathan Frakes', 'Dubbed': 'Japanese, Italian, German, French', 'Subtitles': 'Swedish, French, Japanese, Italian, German, Danish, Norwegian, Dutch, Spanish', 'Studio': 'Paramount', 'Number of discs': '6'}\nIt's incredible to see these in HD for the first time.  I have the entire series and going through it in HD was like watching it all again for the first time.  The quality is incredible.  I definitely recommend these and watching the whole series again on Blu Ray!\nI have the entire series and going through it in HD was like watching it all again for the first time\nStar Trek: The Next Generation - Season 6 [Blu-ray]\nPatrick Stewart  (Actor),     Jonathan Frakes  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Science Fiction\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Box set, Blu-ray, Multiple Formats, Dubbed, NTSC, Full Screen, Subtitled', 'Contributor': 'Jonathan Frakes, Patrick Stewart, Brent Spiner', 'Language': 'English', 'Number Of Discs': '6'}\nt's incredible to see these in HD for the first time.  I have the entire series and going through it in HD was like watching it all again for the first time.  The quality is incredible.  I definitely recommend these and watching the whole series again on Blu Ray!\nI have the entire series and going through it in HD was like watching it all again for the first time",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user remains a strong enthusiast for humorous and engaging programming, particularly animated content and films with imaginative storytelling. Their ongoing appreciation for high-definition re-releases continues to highlight their focus on quality visuals.\n\n- **Genre Inclination:** They have a sustained interest in adventure, fantasy, and science fiction genres, favoring captivating narratives enriched with humor, reflecting a diverse thematic palette.\n\n- **Quality Appreciation:** Their recent purchase and rating reinforce their expectation for well-produced content, particularly praising the enhanced visual quality of beloved series viewed in high definition.\n\n- **Rating Trend:** The user maintains an impressive average rating of 4.8, indicative of their preference for content that balances humor with intriguing fantasy elements and effective storytelling, evoking nostalgia and wonder.\n\n- **Language and Accessibility:** They continue to prefer English-language media with subtitle options and demonstrate a focus on content that promotes diverse language accessibility.\n\n- **Content Advisory Awareness:** The user remains attentive to content advisory labels, emphasizing a responsible approach to media consumption regarding elements like violence and language.\n\nOverall, this user appreciates high-quality, entertaining shows and films that combine humor with thematic elements of adventure and fantasy while valuing superior production standards and impressive viewing experiences. They are likely to revisit and recommend series that resonate with these qualities.",
  "metrics": {
    "rouge1_f": 0.1938325991189427,
    "rouge2_f": 0.015452538631346576,
    "rougeL_f": 0.07709251101321586,
    "meteor": 0.05424720585068278,
    "bleu1": 0.016230963872575162,
    "bleu2": 0.004198599247824585,
    "bleu3": 0.0006841949636334769,
    "bleu4": 0.00027645438369489685,
    "bertscore_precision": 0.36283260583877563,
    "bertscore_recall": 0.4560817778110504,
    "bertscore_f1": 0.40414807200431824
  }
}