{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Meet the Robinsons\nReview Date: 2015/12/01\nStore: Daniel Hansen  (Actor),     Jordan Fry  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Have the \"time\" of your life with Disney\\'s fun-filled comedy MEET THE ROBINSONS, a thrilling adventure that takes you to a whole new world full of imagination and surprises. It\\'s \"a masterpiece,\" raves John Anderson of \"Newsday.\" Join a brilliant young inventor named Lewis as he sets off on a time-traveling journey to find the family he never knew. In the fantastical world of 2037, hip-hoppin\\' frogs and dogs that wear glasses are as common as talking dinosaurs. In an amazing twist, Lewis discovers that the fate of the future rests in his hands, but he can\\'t save it alone -- he\\'ll need every bit of help he can get from the wonderfully wacky Robinson family, who help him learn to keep moving forward and never stop believing in himself. Blast off with MEET THE ROBINSONS -- complete with never-before-seen bonus features, including an all-new game, deleted scenes and much more. It\\'s an exciting trip your whole family will enjoy!']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Animation', 'Format': 'Multiple Formats, Widescreen, Animated, Dolby, Dubbed, NTSC, Digital Sound', 'Contributor': 'Matthew Josten, Daniel Hansen, Stephen J. Anderson, Jordan Fry', 'Language': 'English (Dolby Digital 5.1), French, Unqualified, Spanish', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '5270200', 'Director': 'Stephen J. Anderson', 'Media Format': 'Multiple Formats, Widescreen, Animated, Dolby, Dubbed, NTSC, Digital Sound', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Daniel Hansen, Jordan Fry, Matthew Josten, Stephen J. Anderson', 'Dubbed': 'French, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Number of discs': '1'}\nReview Text: great movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Big Hero 6\nRyan Potter  (Actor),     Scott Adsit  (Actor),     Chris Williams  (Director),     Don Hall  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"With all the heart and humor audiences expect from Walt Disney Animation Studios, BIG HERO 6 is an action-packed comedy adventure that introduces Baymax, a lovable, personal companion robot, who forms a special bond with robotics prodigy Hiro Hamada. When a devastating turn of events catapults them into the midst of a dangerous plot unfolding in the streets of San Fransokyo, Hiro turns to Baymax and his diverse group of friends -- adrenaline junky Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred -- who transform into a band of unlikely heroes. Bring home Disney's BIG HERO 6, featuring comic-book-style action and hilarious, unforgettable characters -- it's fun for the whole family!\"]\n{'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '2O-RH6X-83O8', 'Director': 'Chris Williams, Don Hall', 'Media Format': 'Dolby, Multiple Formats, Widescreen, NTSC, Dubbed, Subtitled', 'Run time': '1 hour and 42 minutes', 'Release date': 'February 24, 2015', 'Actors': 'Ryan Potter, Scott Adsit, Jamie Chung, Jr. Damon Wayans, Genesis Rodriguez', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WALT DISNEY ANIMATION', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat movie!\nFive Stars\nMonty Python and the Holy Grail (Special Edition)\nGraham Chapman  (Actor),     John Cleese  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"The Monty Python team are at it again in their second movie. This time we follow King Arthur and his knights in their search for the Holy Grail. This isn't your average medieval knights and horses story - for a start, due to a shortage in the kingdom, all the horses have been replaced by servants clopping coconuts together!\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Graham Chapman, Terry Gilliam, Michael Palin, Eric Idle, Terry Jones, Michael White, Michael White Productions; National Film Trustee Company Limited; Python (Monty) Pictures Limited, John Cleese, Mark ForstaterGraham Chapman, Terry Gilliam, Michael Palin, Eric Idle, Terry Jones, Michael White, Michael White Productions; National Film Trustee Company Limited; Python (Monty) Pictures Limited, John Cleese, Mark Forstater  See more', 'Language': 'English (Dolby Digital 5.1), Japanese (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '43396052765', 'Director': 'Terry Jones, Terry Gilliam', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 23, 2001', 'Actors': 'Graham Chapman, John Cleese, Eric Idle, Terry Gilliam, Terry Jones', 'Dubbed': 'Portuguese, French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Mark Forstater, Michael White', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nbest movie ever\nFive Stars\nSwiss Family Robinson (Vault Disney Collection)\nJohn Mills  (Actor),     Dorothy McGuire  (Actor),     Ken Annakin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['One of Disney\\'s biggest and most fondly remembered hits, the spectacular screen version of the literary classic SWISS FAMILY ROBINSON is full of breathtaking South Seas scenery, hundreds of exotic animals, and treacherous pirates. This heroic tale chronicles the courageous exploits of the Robinson family after they are shipwrecked on a deserted island. Using teamwork and ingenuity, they skillfully overcome the obstacles of nature and transform their new home into a \"civilized\" community. But the ultimate challenge lies ahead when a band of cutthroat pirates threaten to destroy the Robinson\\'s Makeshift paradise. Capture the thrills, romance, and fun of this unforgettable Disney film!|The film was based on the book by Johann Wyss, written to preserve the tales he and his sons made up while imagining themselves in Robinson Crusoe\\'s predicament. Not originally intended for publication, the narrative was later edited and illustrated by Wyss\\' descendants.|Filmed on the Caribbean island of Tobago, the motion picture\\'s lavish preproduction planning and on-location shooting (22 weeks) resulted in a budget that exceeded $4 million, but the extraordinary box office returns, subsequent popular reissues, and release on home video in 1982 has made it one of Disney\\'s top-grossing films.|There was one problem with the filming location of Tobago: it had no animals. Tropical birds, gulls, ostriches, snakes, tigers, zebras, baby elephants, and monkeys were all flown to the island, along with 14 animal trainers.|One afternoon the flamingos Disney \"hired\" for the film took off from Tobago and headed south to British Guiana. Fortunately, they returned the next day at feeding time.']\n{'Genre': 'ACTION, Action/Adventure, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Sessue Hayakawa, Dorothy McGuire, Tommy Kirk, Kevin Corcoran, Janet Munro, Ken Annakin, John Mills, James MacArthurSessue Hayakawa, Dorothy McGuire, Tommy Kirk, Kevin Corcoran, Janet Munro, Ken Annakin, John Mills, James MacArthur   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 2.0)', 'Runtime': '2 hours and 6 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 3.04 Ounces', 'Audio Description': 'English, Spanish', 'Item model number': '786936143836', 'Director': 'Ken Annakin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '2 hours and 6 minutes', 'Release date': 'May 7, 2002', 'Actors': 'John Mills, Dorothy McGuire, James MacArthur, Janet Munro, Sessue Hayakawa', 'Subtitles': 'English', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat movie!\nFive Stars\nTim Hawkins-Greatest Hits & Greatest Bits\nTim Hawkins  (Actor),     Rockshow Comedy  (Director)    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Greatest Hits & Greatest Bits contains 25 awesome musical hits (20 live performance and 5 music videos) and 43 fan-favorite stand up bits that span 10 years of Tim's career. Get a behind the scenes look at Tim's past projects with his exclusive interviews. Plus, we included 35 minutes of rare archived concert footage from Tim Hawkins LIVE! (2002) available exclusively on this project.\"]\n{'Genre': 'Musicals, Performing Arts', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Tim Hawkins, Rockshow Comedy', 'Runtime': '2 hours and 30 minutes', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '5.3 x 0.5 x 7.5 inches; 4 Ounces', 'Director': 'Rockshow Comedy', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'December 2, 2013', 'Actors': 'Tim Hawkins', 'Studio': 'Crown', 'Number of discs': '2'}\n100% funny! Our Favorite Tim Hawkins DVD!  We have watched this SO many times and laugh every time!\nyou will watch it over and over again!\nThe Muppets\nAmy Adams  (Actor),     Jason Segel  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Muppet domination continues with a hilarious new movie from Walt Disney Studios. Jason Segel, Academy Award(R) nominee Amy Adams (Best Performance By An Actress In a Supporting Role,', 'Junebug, Doubt, The Fighter', ') and Academy Award winner Chris Cooper (Best Performance By An Actor In A Supporting Role,', 'Adaptation', \") join everyone's favorite Muppets and an all-star celebrity cast in a comic adventure for the whole family. While on vacation in Los Angeles, Walter, the world's biggest Muppet fan, his brother Gary, and friend Mary uncover the diabolical plot of a greedy oil millionaire to destroy the Muppet Theater. Now, the Muppet-loving trio must reunite Kermit, Miss Piggy, Fozzie Bear and their friends to stage the greatest Muppet telethon ever and save their beloved theater. The gang is back together again in a must-own movie full of irresistible music and family fun. Bring home the biggest Muppet adventure ever on Disney Blu-ray(TM) and DVD!\", 'Amazon.com', \"Movies attempting to retrieve cherished nuggets of pop culture often stumble, either by appealing solely to the die-hard minutia enthusiasts or clunking up the batter with unnecessary additions to the base material. (Enough with the human love triangles, get to the giant robots fighting.) Thankfully, this revival of Jim Henson's beloved characters gets the formula delightfully right, providing a googly-eyed nostalgia trip for adults while also retaining the original's sense of bright (and mildly subversive) wonder. All that's missing is a cameo from Shields and Yarnell, really. Kicking off with a boffo musical number, the story follows Walter (voice of Peter Linz), a small-town boy with a uniquely personal affection for the long-retired Muppets. (OK, he's made of felt.) Teaming up with his brother (Jason Segel, who also co-scripted) and the local schoolteacher (Amy Adams), they attempt to get Kermit, Fozzie, and the gang back together in order to save their studio from an evil oil baron (Chris Cooper, going all in). Director James Bobin (\", 'Flight of the Conchords', \") does a marvelous job of updating and honoring his material, weaving sly references to days gone by (the contents of Kermit's rolodex are a particular delight) into the mix of songs, celebrity cameos, and barn-broad puns that gave the original show its bubbly kick. (Fans of Animal and the Chickens will not go home disappointed.) Even the moments that don't quite work land with a cornball brio that feels wholly of a piece with Henson's universe. The result is a true family movie that still brings on the blissful, uncomplicated grins days after viewing. No matter what Statler and/or Waldorf might say, the show goes on.\", '--Andrew Wright', 'Related Products', 'Versions of', 'The Muppets', 'on Blu-ray and DVD']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Amy Adams, James Bobin, Jason Segel', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '257134', 'Director': 'James Bobin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'March 20, 2012', 'Actors': 'Amy Adams, Jason Segel', 'Dubbed': 'French, Spanish', 'Subtitles': 'French', 'Studio': 'Walt Disney Studios', 'Number of discs': '1'}\ngreat movie!\nFive Stars\nMeet the Robinsons\nDaniel Hansen  (Actor),     Jordan Fry  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Have the \"time\" of your life with Disney\\'s fun-filled comedy MEET THE ROBINSONS, a thrilling adventure that takes you to a whole new world full of imagination and surprises. It\\'s \"a masterpiece,\" raves John Anderson of \"Newsday.\" Join a brilliant young inventor named Lewis as he sets off on a time-traveling journey to find the family he never knew. In the fantastical world of 2037, hip-hoppin\\' frogs and dogs that wear glasses are as common as talking dinosaurs. In an amazing twist, Lewis discovers that the fate of the future rests in his hands, but he can\\'t save it alone -- he\\'ll need every bit of help he can get from the wonderfully wacky Robinson family, who help him learn to keep moving forward and never stop believing in himself. Blast off with MEET THE ROBINSONS -- complete with never-before-seen bonus features, including an all-new game, deleted scenes and much more. It\\'s an exciting trip your whole family will enjoy!']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Widescreen, Animated, Dolby, Dubbed, NTSC, Digital Sound', 'Contributor': 'Matthew Josten, Daniel Hansen, Stephen J. Anderson, Jordan Fry', 'Language': 'English (Dolby Digital 5.1), French, Unqualified, Spanish', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '5270200', 'Director': 'Stephen J. Anderson', 'Media Format': 'Multiple Formats, Widescreen, Animated, Dolby, Dubbed, NTSC, Digital Sound', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Daniel Hansen, Jordan Fry, Matthew Josten, Stephen J. Anderson', 'Dubbed': 'French, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Number of discs': '1'}\ngreat movie\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference:** The user maintains a strong affinity for family-friendly and animated films, particularly those that combine humor with whimsical storytelling. Their recent interactions reaffirm a preference for movies that evoke nostalgia and feature lively narratives.\n\n- **Entertainment Type:** Enjoys lighthearted and imaginative tales that blend humor with heartfelt themes. There is a particular interest in fantastical adventures that promote creativity, teamwork, and character growth.\n\n- **Audience Focus:** Prioritizes wholesome, age-appropriate content ideal for family viewing. They continue to show a clear preference for animated features and classic comedies, celebrating positivity and humor that transcends generations.\n\n- **Engagement Style:** Approaches media interactions with a positive and enthusiastic attitude, often leaving concise but affirming reviews. The user expresses their enjoyment directly, highlighting the humor and joy found in the films they choose.\n\n- **Rating Behavior:** Consistently awards high ratings, frequently giving five stars to films that showcase quality storytelling, engaging characters, and excellent comedic performances within family entertainment genres.\n\nOverall, the user cherishes films that offer a delightful blend of humor and meaningful moments, seeking engaging narratives that promise joyful experiences for themselves and their families. Their recent engagement reinforces these preferences and behaviors.",
  "metrics": {
    "rouge1_f": 0.09276116168183789,
    "rouge2_f": 0.009544468546637744,
    "rougeL_f": 0.043346337234503686,
    "meteor": 0.02767427512711556,
    "bleu1": 6.759045428000143e-06,
    "bleu2": 2.2690053845911776e-06,
    "bleu3": 3.2956031227239326e-07,
    "bleu4": 1.2572496166115349e-07,
    "bertscore_precision": 0.343313992023468,
    "bertscore_recall": 0.4977239966392517,
    "bertscore_f1": 0.40634456276893616
  }
}