{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fiddler on the Roof (Special Edition) [DVD]\nReview Date: 2018/05/08\nStore: Topol  (Actor),     Norma Crane  (Actor),     Norman Jewison  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: ['Product Description', '\"An outstanding accomplishment in every category\" (Boxoffice), this lavishly produced and critically acclaimed screen adaptation of the international stage sensation tells the life-affirming story of Tevye (Topol), a poor milkman whose love, pride and faith help him face the oppression of turn-of-the century czarist Russia. Nominated* for eight Academy AwardsÂ(r), including Best Picture and Best Director, and featuring such classic songs as \"If I Were A Rich Man,\" \"Matchmaker\" and \"Sunrise, Sunset,\" Fiddler on the Roof is a universal story of hope, love and acceptancea \"stunning, joyful and jubilant\" (New York Daily News) musical masterpiece.', 'Set Contains:', 'The extra features (contained on side 2 of the disc) on', 'Fiddler on the Roof', 'are definitely worthy of this incredible musical. The commentary by Norman Jewison and Chaim Topol (billed here as Topol) is informative and brings a new depth to the film (although obviously recorded separately, and thus intermittently redundant). The documentary \"Norman Jewison, Filmmaker\" delves somewhat into the career of Jewison, but the focus is on following the production of', 'Fiddler', 'and the many difficulties encountered. Be prepared for a sharp contrast when you watch Jewison\\'s modern-day recollections; these were filmed almost 30 years later. Other highlights on this disc are the full color version of \"Tevye\\'s Dream\" (which can be viewed in side-by-side comparison with the one in the film); Jewison reading the stories of Sholom Aleichem over beautifully drawn pictures; historical context for the film (which might be useful to new viewers to watch first); a song deleted from the film (shown over movie stills); and much more.', '--Jenny Brown']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Romance', 'Format': 'Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, DVD, Widescreen, NTSC', 'Contributor': 'Topol, Candy Bonstein, Rosalind Harris, Molly Picon, Norman Jewison, Paul Mann, Neva Small, Ray Lovelock, Elaine Edwards, Norma Crane, Sholom Aleichem, Michele Marsh, Joseph Stein, Paul Michael Glaser, Leonard FreyTopol, Candy Bonstein, Rosalind Harris, Molly Picon, Norman Jewison, Paul Mann, Neva Small, Ray Lovelock, Elaine Edwards, Norma Crane, Sholom Aleichem, Michele Marsh, Joseph Stein, Paul Michael Glaser, Leonard Frey  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Norman Jewison', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, DVD, Widescreen, NTSC', 'Run time': '3 hours and 1 minute', 'Release date': 'October 2, 2001', 'Actors': 'Topol, Norma Crane, Leonard Frey, Molly Picon, Paul Mann', 'Subtitles': 'English, Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Joseph Stein, Sholom Aleichem', 'Number of discs': '1'}\nReview Text: This is a fantastic musical!  If you haven't watched it, it's a MUST see!  It invites you to experience Jewish tradition in a time surrounded by political & social turmoil.  It is a brilliant combination of history and perfectly timed humor.  (&#34;If I were a rich man...&#34;, &#34; on the other hand...&#34;, &#34;Matchmaker, Matchmaker&#34;, &#34;As the good book says...&#34;)<br /><br />You will be captivated by a poor, Jewish milkman named Tevye as he navigates life with 5 daughters, and wrestles to reconcile the tension between tradition and change.\nReview Title: A brilliant combination of history and perfectly timed humor\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Big Hero 6\nRyan Potter  (Actor),     Scott Adsit  (Actor),     Chris Williams  (Director),     Don Hall  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"With all the heart and humor audiences expect from Walt Disney Animation Studios, BIG HERO 6 is an action-packed comedy adventure that introduces Baymax, a lovable, personal companion robot, who forms a special bond with robotics prodigy Hiro Hamada. When a devastating turn of events catapults them into the midst of a dangerous plot unfolding in the streets of San Fransokyo, Hiro turns to Baymax and his diverse group of friends -- adrenaline junky Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred -- who transform into a band of unlikely heroes. Bring home Disney's BIG HERO 6, featuring comic-book-style action and hilarious, unforgettable characters -- it's fun for the whole family!\"]\n{'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '2O-RH6X-83O8', 'Director': 'Chris Williams, Don Hall', 'Media Format': 'Dolby, Multiple Formats, Widescreen, NTSC, Dubbed, Subtitled', 'Run time': '1 hour and 42 minutes', 'Release date': 'February 24, 2015', 'Actors': 'Ryan Potter, Scott Adsit, Jamie Chung, Jr. Damon Wayans, Genesis Rodriguez', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WALT DISNEY ANIMATION', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat movie!\nFive Stars\nMonty Python and the Holy Grail (Special Edition)\nGraham Chapman  (Actor),     John Cleese  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"The Monty Python team are at it again in their second movie. This time we follow King Arthur and his knights in their search for the Holy Grail. This isn't your average medieval knights and horses story - for a start, due to a shortage in the kingdom, all the horses have been replaced by servants clopping coconuts together!\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Graham Chapman, Terry Gilliam, Michael Palin, Eric Idle, Terry Jones, Michael White, Michael White Productions; National Film Trustee Company Limited; Python (Monty) Pictures Limited, John Cleese, Mark ForstaterGraham Chapman, Terry Gilliam, Michael Palin, Eric Idle, Terry Jones, Michael White, Michael White Productions; National Film Trustee Company Limited; Python (Monty) Pictures Limited, John Cleese, Mark Forstater  See more', 'Language': 'English (Dolby Digital 5.1), Japanese (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '43396052765', 'Director': 'Terry Jones, Terry Gilliam', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 23, 2001', 'Actors': 'Graham Chapman, John Cleese, Eric Idle, Terry Gilliam, Terry Jones', 'Dubbed': 'Portuguese, French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Mark Forstater, Michael White', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nbest movie ever\nFive Stars\nSwiss Family Robinson (Vault Disney Collection)\nJohn Mills  (Actor),     Dorothy McGuire  (Actor),     Ken Annakin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['One of Disney\\'s biggest and most fondly remembered hits, the spectacular screen version of the literary classic SWISS FAMILY ROBINSON is full of breathtaking South Seas scenery, hundreds of exotic animals, and treacherous pirates. This heroic tale chronicles the courageous exploits of the Robinson family after they are shipwrecked on a deserted island. Using teamwork and ingenuity, they skillfully overcome the obstacles of nature and transform their new home into a \"civilized\" community. But the ultimate challenge lies ahead when a band of cutthroat pirates threaten to destroy the Robinson\\'s Makeshift paradise. Capture the thrills, romance, and fun of this unforgettable Disney film!|The film was based on the book by Johann Wyss, written to preserve the tales he and his sons made up while imagining themselves in Robinson Crusoe\\'s predicament. Not originally intended for publication, the narrative was later edited and illustrated by Wyss\\' descendants.|Filmed on the Caribbean island of Tobago, the motion picture\\'s lavish preproduction planning and on-location shooting (22 weeks) resulted in a budget that exceeded $4 million, but the extraordinary box office returns, subsequent popular reissues, and release on home video in 1982 has made it one of Disney\\'s top-grossing films.|There was one problem with the filming location of Tobago: it had no animals. Tropical birds, gulls, ostriches, snakes, tigers, zebras, baby elephants, and monkeys were all flown to the island, along with 14 animal trainers.|One afternoon the flamingos Disney \"hired\" for the film took off from Tobago and headed south to British Guiana. Fortunately, they returned the next day at feeding time.']\n{'Genre': 'ACTION, Action/Adventure, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Sessue Hayakawa, Dorothy McGuire, Tommy Kirk, Kevin Corcoran, Janet Munro, Ken Annakin, John Mills, James MacArthurSessue Hayakawa, Dorothy McGuire, Tommy Kirk, Kevin Corcoran, Janet Munro, Ken Annakin, John Mills, James MacArthur   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 2.0)', 'Runtime': '2 hours and 6 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 3.04 Ounces', 'Audio Description': 'English, Spanish', 'Item model number': '786936143836', 'Director': 'Ken Annakin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '2 hours and 6 minutes', 'Release date': 'May 7, 2002', 'Actors': 'John Mills, Dorothy McGuire, James MacArthur, Janet Munro, Sessue Hayakawa', 'Subtitles': 'English', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat movie!\nFive Stars\nTim Hawkins-Greatest Hits & Greatest Bits\nTim Hawkins  (Actor),     Rockshow Comedy  (Director)    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Greatest Hits & Greatest Bits contains 25 awesome musical hits (20 live performance and 5 music videos) and 43 fan-favorite stand up bits that span 10 years of Tim's career. Get a behind the scenes look at Tim's past projects with his exclusive interviews. Plus, we included 35 minutes of rare archived concert footage from Tim Hawkins LIVE! (2002) available exclusively on this project.\"]\n{'Genre': 'Musicals, Performing Arts', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Tim Hawkins, Rockshow Comedy', 'Runtime': '2 hours and 30 minutes', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '5.3 x 0.5 x 7.5 inches; 4 Ounces', 'Director': 'Rockshow Comedy', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'December 2, 2013', 'Actors': 'Tim Hawkins', 'Studio': 'Crown', 'Number of discs': '2'}\n100% funny! Our Favorite Tim Hawkins DVD!  We have watched this SO many times and laugh every time!\nyou will watch it over and over again!\nThe Muppets\nAmy Adams  (Actor),     Jason Segel  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Muppet domination continues with a hilarious new movie from Walt Disney Studios. Jason Segel, Academy Award(R) nominee Amy Adams (Best Performance By An Actress In a Supporting Role,', 'Junebug, Doubt, The Fighter', ') and Academy Award winner Chris Cooper (Best Performance By An Actor In A Supporting Role,', 'Adaptation', \") join everyone's favorite Muppets and an all-star celebrity cast in a comic adventure for the whole family. While on vacation in Los Angeles, Walter, the world's biggest Muppet fan, his brother Gary, and friend Mary uncover the diabolical plot of a greedy oil millionaire to destroy the Muppet Theater. Now, the Muppet-loving trio must reunite Kermit, Miss Piggy, Fozzie Bear and their friends to stage the greatest Muppet telethon ever and save their beloved theater. The gang is back together again in a must-own movie full of irresistible music and family fun. Bring home the biggest Muppet adventure ever on Disney Blu-ray(TM) and DVD!\", 'Amazon.com', \"Movies attempting to retrieve cherished nuggets of pop culture often stumble, either by appealing solely to the die-hard minutia enthusiasts or clunking up the batter with unnecessary additions to the base material. (Enough with the human love triangles, get to the giant robots fighting.) Thankfully, this revival of Jim Henson's beloved characters gets the formula delightfully right, providing a googly-eyed nostalgia trip for adults while also retaining the original's sense of bright (and mildly subversive) wonder. All that's missing is a cameo from Shields and Yarnell, really. Kicking off with a boffo musical number, the story follows Walter (voice of Peter Linz), a small-town boy with a uniquely personal affection for the long-retired Muppets. (OK, he's made of felt.) Teaming up with his brother (Jason Segel, who also co-scripted) and the local schoolteacher (Amy Adams), they attempt to get Kermit, Fozzie, and the gang back together in order to save their studio from an evil oil baron (Chris Cooper, going all in). Director James Bobin (\", 'Flight of the Conchords', \") does a marvelous job of updating and honoring his material, weaving sly references to days gone by (the contents of Kermit's rolodex are a particular delight) into the mix of songs, celebrity cameos, and barn-broad puns that gave the original show its bubbly kick. (Fans of Animal and the Chickens will not go home disappointed.) Even the moments that don't quite work land with a cornball brio that feels wholly of a piece with Henson's universe. The result is a true family movie that still brings on the blissful, uncomplicated grins days after viewing. No matter what Statler and/or Waldorf might say, the show goes on.\", '--Andrew Wright', 'Related Products', 'Versions of', 'The Muppets', 'on Blu-ray and DVD']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Amy Adams, James Bobin, Jason Segel', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '257134', 'Director': 'James Bobin', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'March 20, 2012', 'Actors': 'Amy Adams, Jason Segel', 'Dubbed': 'French, Spanish', 'Subtitles': 'French', 'Studio': 'Walt Disney Studios', 'Number of discs': '1'}\ngreat movie!\nFive Stars\nMeet the Robinsons\nDaniel Hansen  (Actor),     Jordan Fry  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Have the \"time\" of your life with Disney\\'s fun-filled comedy MEET THE ROBINSONS, a thrilling adventure that takes you to a whole new world full of imagination and surprises. It\\'s \"a masterpiece,\" raves John Anderson of \"Newsday.\" Join a brilliant young inventor named Lewis as he sets off on a time-traveling journey to find the family he never knew. In the fantastical world of 2037, hip-hoppin\\' frogs and dogs that wear glasses are as common as talking dinosaurs. In an amazing twist, Lewis discovers that the fate of the future rests in his hands, but he can\\'t save it alone -- he\\'ll need every bit of help he can get from the wonderfully wacky Robinson family, who help him learn to keep moving forward and never stop believing in himself. Blast off with MEET THE ROBINSONS -- complete with never-before-seen bonus features, including an all-new game, deleted scenes and much more. It\\'s an exciting trip your whole family will enjoy!']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Widescreen, Animated, Dolby, Dubbed, NTSC, Digital Sound', 'Contributor': 'Matthew Josten, Daniel Hansen, Stephen J. Anderson, Jordan Fry', 'Language': 'English (Dolby Digital 5.1), French, Unqualified, Spanish', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '5270200', 'Director': 'Stephen J. Anderson', 'Media Format': 'Multiple Formats, Widescreen, Animated, Dolby, Dubbed, NTSC, Digital Sound', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Daniel Hansen, Jordan Fry, Matthew Josten, Stephen J. Anderson', 'Dubbed': 'French, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Number of discs': '1'}\ngreat movie\nFive Stars\nEpic\nColin Farrell  (Actor),     Josh Hutcherson  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"From the creators of ICE AGE comes the years funniest, most exhilarating animated adventure! Transported to a magical world, a teenager (Amanda Seyfried) is recruited by a nature spirit, Queen Tara (Beyonci Knowles), to help the Leafmen save their existence and ours from evil warriors. The whole family will love this fast-paced thrill-ride, with it's astonishing animation and an all-star voice cast that includes Colin Farrell, Oscar Winner Christoph Waltz and Steven Tyler!\", 'Amazon.com', 'Ronin Ronin is the chisel-faced, battle-hardened leader of the Leafmen, the elite corps of warriors sworn to protect all life in the forest. He lives by the creed: “many leaves, one tree” and wouldn’t think twice about putting his own life on the line for someone he cares about. When the forest and his beloved Queen come under siege, Ronin rallies the Leafmen into action with his bravery and wry humor.', 'Bomba A quirky, absent-minded professor, Bomba has grown out of touch with his now teenage daughter, MK. He lives in the middle of the forest, in a rundown house, where he surrounds himself with bizarre homemade gadgets. His life has been dedicated to – some would say obsessed with – studying –a civilization of tiny people he’s never seen. But when MK disappears, Bomba must put his own dreams under the microscope, and find what he’s really always been looking for.', \"Nod Rakish and handsome, Nod is all about bucking the rules and flying solo. But his brazen individualism doesn't square with the Leafmen’s ideals of teamwork and unity, so he quits the squad. After a teenage girl enters his world – and when the stakes are high – Nod discovers what it takes to be a true hero.\", 'Mary Katherine (MK) Mary Katherine (she prefers “MK”) is a smart, spirited and headstrong 17-year-old who finds herself on the journey of a lifetime. After returning to her childhood home to connect with her estranged father, MK loses patience with his endless stories of the “tiny people” who live in the woods. But when she is magically transported into the Leafmen’s world, she gains a new perspective. To find her way home, MK must do more than believe in this world; she’ll have to help save it.', 'Mub & Grub Low on the evolutionary food chain, but high in self-esteem, Mub, a self-characterized “ladies’ man,” and Grub, a wannabe Leafman, are the caretakers of the royal pod that will bloom into the future Queen or King of the forest. Though this slug-and-snail comedy duo is spineless, literally, they show real backbone by joining the quest to save their world.', 'Nim Galuu At first glance, Nim Galuu is the consummate party animal. But don’t let this larger than life caterpillar fool you – his wisdom and practical know-how make him a key behind-the-scenes player in the epic battle to save the forest.', 'Queen Tara Beautiful, agile and strong, Tara isn’t just the Leafmen’s Queen; she’s the life force of the forest, which she presides over with respect, compassion and humor. When Tara finds herself in danger, her unique connection with nature gives her powerful allies. And when all hope seems lost, she summons help from the most surprising of places.', 'Bufo A tough-guy toad, Bufo is a wheeler and dealer who plays all the angles: he profits no matter which side wins or loses.', 'Mandrake Gifted, or cursed, with the ability to bring destruction to anything he touches, Mandrake and his Boggan minions are the arch-nemeses of the Leafmen. Mandrake is tired of hiding in the shadows, and with his son by his side, he plans the ultimate revenge – to claim the forest he believes should have always been his.', \"Epic is a computer-animated adventure fantasy filled with gorgeous scenery, nice animated effects, plenty of action, and a somewhat familiar plot about the existence of a society of tiny people. Mary Katherine (Amanda Seyfried), or M.K. as she likes to be called, has recently come to live with her dad Bomba (Jason Sudeikis) in a ramshackle house in the middle of nowhere. Obsessed with proving the existence of a society of tiny guardians of the forest called Leafmen, who are responsible for maintaining balance by keeping the Boggans from spreading blight throughout the forest, M.K.'s dad has little time for a daughter or the realities of everyday life. A chance event lands M.K. right in the middle of the Leafmen's society, where she quickly develops a whole new appreciation for her father's eccentricities. She finds herself charged by the Leafmen's queen (Beyoncé Knowles) with a difficult task that will mean the difference between preservation and destruction for the forest. M.K. joins forces with an assortment of unlikely heroes, including slug and snail duo Mub and Grub (Aziz Ansari and Chris O'Dowd), overzealous Leafmen commander General Ronin (Colin Farrell), and Nod (Josh Hutcherson), a soldier with a bad habit of questioning authority. Their perilous journey introduces M.K. to a strange new breed of enemy and a whole new way of thinking. Loosely based on William Joyce's book The Leaf Men and the Brave Good Bugs, the film shares its premise--a society of tiny people tries to thrive without drawing the attention of the larger humans--with films like the Tinker Bell movies and The Secret World of Arrietty. What's unique about Epic is that it's just as much action film as fantasy. (Ages 7 and older) --\", 'Tami Horiuchi']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '320957', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, Animated, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 42 minutes', 'Release date': 'August 20, 2013', 'Actors': 'Colin Farrell, Josh Hutcherson, Amanda Seyfried, Aziz Ansari, Beyoncé Knowles', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngood movie!\nFour Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zack Snyder'], 'Producers': ['Zareh Nalbandian'], 'Starring': ['Helen Mirren', 'Geoffrey Rush', 'Jim Sturgess'], 'Studio': ['WARNER BROS.']}\ngood movie\nFour Stars\nOliver (With CD Premium) Giftset [DVD]\nRon Moody  (Actor),     Shani Wallis  (Actor),     Carol Reed  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Experience the high-spirited adventures of Oliver Twist in this Oscar®-winning musical adaptation of Charles Dickens\\' classic tale! Young Oliver (Mark Lester) is an orphan who escapes the cheerless life of the workhouse and takes to the streets of 19th-Century London. He\\'s immediately taken in by a band of street urchins, headed by the lovable villain, Fagin (Ron Moody), his fiendish henchman, Bill Sikes (Oliver Reed), and his loyal apprentice, The Artful Dodger (Jack Wild). Through his education in the fine points of pick-pocketing, Oliver makes away with an unexpected treasure... a home and a family of his own. Set to a heartfelt score that includes such favorites as \"Consider Yourself,\" \"Where Is Love?\" and \"As Long As He Needs Me,\" OLIVER! leads us on a journey in search of love, belonging and honor among thieves. Winner of six Academy Awards® (1968), including Best Picture and Best Score, OLIVER! will steal your heart!']\n{'Genre': 'Musical, Award Winning', 'Format': 'AC-3, Color, Dolby, Dubbed, DVD, Subtitled, Widescreen, NTSC, Classical, Soundtrack', 'Contributor': 'Shani Wallis, Ron Moody, Carol Reed, Hugh Griffith, Oliver Reed, Romulus Films, Ltd.; Warwick Film Productions, Limited, Harry Secombe, Mark Lester, John Woolf, Donald Albery, Jack WildShani Wallis, Ron Moody, Carol Reed, Hugh Griffith, Oliver Reed, Romulus Films, Ltd.; Warwick Film Productions, Limited, Harry Secombe, Mark Lester, John Woolf, Donald Albery, Jack Wild  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 33 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 10.75 x 0.5 inches; 7.2 Ounces', 'Director': 'Carol Reed', 'Media Format': 'AC-3, Color, Dolby, Dubbed, DVD, Subtitled, Widescreen, NTSC, Classical, Soundtrack', 'Run time': '2 hours and 33 minutes', 'Release date': 'September 27, 2005', 'Actors': 'Ron Moody, Shani Wallis, Oliver Reed, Harry Secombe, Mark Lester', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Donald Albery, John Woolf', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nit's a classic\nFour Stars\nRagamuffin\nMichael Koch  (Actor),     David Leo Shultz  (Actor),     David Leo Schultz  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Independently Distributed, Drama\n['Product Description', \"'Ragamuffin' is based on the life of Rich Mullins, a musical prodigy who rose to Christian music fame and fortune only to walk away and live on a Navajo reservation. An artistic genius, raised on a tree farm in Indiana by a callous father, Rich wrestled all of his life with the brokenness and crippling insecurity born of his childhood. A lover of Jesus and a rebel in the church, Rich refused to let his struggles with his own darkness tear him away from a God he was determined to love. As he struggled with success in Nashville and depression in Wichita, Rich desired most of all to live a life of honest and reckless faith amidst a culture of religion and conformity.\", 'Review', 'Faith-Based Seal --The Dove Foundation']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'David Leo Schultz', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'July 8, 2014', 'Actors': 'Michael Koch, David Leo Shultz, Wolfgang Bodison', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nexcellent\nFive Stars\nThat's The Worst\nTim Hawkins  (Actor),     Crown Entertainment  (Director)    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"This is the WORST. 90 minutes of terrible! From comedy legend Tim Hawkins comes an all new live concert performance featuring new stand-up comedy as well as the brilliant musical comedy his fans love and demand. That's the Worst features a full length concert from Tim, and includes a performance from John Crist, the opening act from the night of filming.\", 'This is the first all new release from Tim Hawkins since the 2012 release of', 'Push Pull Point Pow', \", and is sure to be a best seller. (NOTE: 2013's\", '\"Greatest Hits & Greatest Bits\"', 'was a Best of compilations project featuring mostly material that had been previously available.)', 'Chapter Menu', \"1. Intro 2. Least Favorite Things 3. Total Eye Candy 4. I Keep Getting Dumber 5. Slug Bug 6. Megachurch Parking Lot 7. Fun Funeral 8. Fall Festival 9. Bees 10. The Gift of No 11. Class Comedian 12. The Creepy Move 13. Losing Our Minds 14. Junk Drawer 15. Muffintop 16. Snowflake 17. Atheist Kids' Songs 18. Yga Pants 2.0 19. Cool Guitar Thing 20. Buffet for President 21. Christian Cuss Words 22. Rockstars Have It Easy 23. That's the Worst 24. God's Not a Buzzkill 25. Buffet Man 26. Credits\", 'Bonus Stuff:', \"Opening Comic John Crist Deleted Scenes and Bloopers Tim's Name in Lights\"]\n{'Genre': 'Musicals, Romance, Music Videos & Concerts, Comedy, Performing Arts', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Tim Hawkins, Crown Entertainment', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.3 x 0.6 x 7.5 inches; 2.72 Ounces', 'Director': 'Crown Entertainment', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'December 2, 2014', 'Actors': 'Tim Hawkins', 'Studio': 'Crown', 'Number of discs': '1'}\nHilarious!!\nFive Stars\nFiddler on the Roof (Special Edition) [DVD]\nTopol  (Actor),     Norma Crane  (Actor),     Norman Jewison  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', '\"An outstanding accomplishment in every category\" (Boxoffice), this lavishly produced and critically acclaimed screen adaptation of the international stage sensation tells the life-affirming story of Tevye (Topol), a poor milkman whose love, pride and faith help him face the oppression of turn-of-the century czarist Russia. Nominated* for eight Academy AwardsÂ(r), including Best Picture and Best Director, and featuring such classic songs as \"If I Were A Rich Man,\" \"Matchmaker\" and \"Sunrise, Sunset,\" Fiddler on the Roof is a universal story of hope, love and acceptancea \"stunning, joyful and jubilant\" (New York Daily News) musical masterpiece.', 'Set Contains:', 'The extra features (contained on side 2 of the disc) on', 'Fiddler on the Roof', 'are definitely worthy of this incredible musical. The commentary by Norman Jewison and Chaim Topol (billed here as Topol) is informative and brings a new depth to the film (although obviously recorded separately, and thus intermittently redundant). The documentary \"Norman Jewison, Filmmaker\" delves somewhat into the career of Jewison, but the focus is on following the production of', 'Fiddler', 'and the many difficulties encountered. Be prepared for a sharp contrast when you watch Jewison\\'s modern-day recollections; these were filmed almost 30 years later. Other highlights on this disc are the full color version of \"Tevye\\'s Dream\" (which can be viewed in side-by-side comparison with the one in the film); Jewison reading the stories of Sholom Aleichem over beautifully drawn pictures; historical context for the film (which might be useful to new viewers to watch first); a song deleted from the film (shown over movie stills); and much more.', '--Jenny Brown']\n{'Genre': 'Romance', 'Format': 'Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, DVD, Widescreen, NTSC', 'Contributor': 'Topol, Candy Bonstein, Rosalind Harris, Molly Picon, Norman Jewison, Paul Mann, Neva Small, Ray Lovelock, Elaine Edwards, Norma Crane, Sholom Aleichem, Michele Marsh, Joseph Stein, Paul Michael Glaser, Leonard FreyTopol, Candy Bonstein, Rosalind Harris, Molly Picon, Norman Jewison, Paul Mann, Neva Small, Ray Lovelock, Elaine Edwards, Norma Crane, Sholom Aleichem, Michele Marsh, Joseph Stein, Paul Michael Glaser, Leonard Frey  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Norman Jewison', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, DVD, Widescreen, NTSC', 'Run time': '3 hours and 1 minute', 'Release date': 'October 2, 2001', 'Actors': 'Topol, Norma Crane, Leonard Frey, Molly Picon, Paul Mann', 'Subtitles': 'English, Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Joseph Stein, Sholom Aleichem', 'Number of discs': '1'}\nThis is a fantastic musical!  If you haven't watched it, it's a MUST see!  It invites you to experience Jewish tradition in a time surrounded by political & social turmoil.  It is a brilliant combination of history and perfectly timed humor.  (&#34;If I were a rich man...&#34;, &#34; on the other hand...&#34;, &#34;Matchmaker, Matchmaker&#34;, &#34;As the good book says...&#34;)<br /><br />You will be captivated by a poor, Jewish milkman named Tevye as he navigates life with 5 daughters, and wrestles to reconcile the tension between tradition and change.\nA brilliant combination of history and perfectly timed humor",
  "actual_interaction": {
    "rating": 5.0,
    "title": "A brilliant combination of history and perfectly timed humor",
    "text": "This is a fantastic musical!  If you haven't watched it, it's a MUST see!  It invites you to experience Jewish tradition in a time surrounded by political & social turmoil.  It is a brilliant combination of history and perfectly timed humor.  (&#34;If I were a rich man...&#34;, &#34; on the other hand...&#34;, &#34;Matchmaker, Matchmaker&#34;, &#34;As the good book says...&#34;)<br /><br />You will be captivated by a poor, Jewish milkman named Tevye as he navigates life with 5 daughters, and wrestles to reconcile the tension between tradition and change.",
    "images": [],
    "asin": "B00005N7YZ",
    "parent_asin": "B00005N7YZ",
    "user_id": "AHL2C3QMOOGRJC7OGYIDVGTYGWAA",
    "timestamp": "2018-05-08 16:01:50.487000",
    "helpful_vote": 2,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Fiddler on the Roof (Special Edition) [DVD]",
    "average_rating": 4.8,
    "rating_number": 8813,
    "features": [],
    "description": [
      "Product Description",
      "\"An outstanding accomplishment in every category\" (Boxoffice), this lavishly produced and critically acclaimed screen adaptation of the international stage sensation tells the life-affirming story of Tevye (Topol), a poor milkman whose love, pride and faith help him face the oppression of turn-of-the century czarist Russia. Nominated* for eight Academy AwardsÂ(r), including Best Picture and Best Director, and featuring such classic songs as \"If I Were A Rich Man,\" \"Matchmaker\" and \"Sunrise, Sunset,\" Fiddler on the Roof is a universal story of hope, love and acceptancea \"stunning, joyful and jubilant\" (New York Daily News) musical masterpiece.",
      "Set Contains:",
      "The extra features (contained on side 2 of the disc) on",
      "Fiddler on the Roof",
      "are definitely worthy of this incredible musical. The commentary by Norman Jewison and Chaim Topol (billed here as Topol) is informative and brings a new depth to the film (although obviously recorded separately, and thus intermittently redundant). The documentary \"Norman Jewison, Filmmaker\" delves somewhat into the career of Jewison, but the focus is on following the production of",
      "Fiddler",
      "and the many difficulties encountered. Be prepared for a sharp contrast when you watch Jewison's modern-day recollections; these were filmed almost 30 years later. Other highlights on this disc are the full color version of \"Tevye's Dream\" (which can be viewed in side-by-side comparison with the one in the film); Jewison reading the stories of Sholom Aleichem over beautifully drawn pictures; historical context for the film (which might be useful to new viewers to watch first); a song deleted from the film (shown over movie stills); and much more.",
      "--Jenny Brown"
    ],
    "price": 14.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/414NH25HBQL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/414NH25HBQL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Topol  (Actor),     Norma Crane  (Actor),     Norman Jewison  (Director)    &                   0                  more   Rated:    G    Format: DVD",
    "categories": [
      "Movies & TV",
      "Musicals & Performing Arts",
      "Musicals"
    ],
    "details": {
      "Genre": "Romance",
      "Format": "Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, DVD, Widescreen, NTSC",
      "Contributor": "Topol, Candy Bonstein, Rosalind Harris, Molly Picon, Norman Jewison, Paul Mann, Neva Small, Ray Lovelock, Elaine Edwards, Norma Crane, Sholom Aleichem, Michele Marsh, Joseph Stein, Paul Michael Glaser, Leonard FreyTopol, Candy Bonstein, Rosalind Harris, Molly Picon, Norman Jewison, Paul Mann, Neva Small, Ray Lovelock, Elaine Edwards, Norma Crane, Sholom Aleichem, Michele Marsh, Joseph Stein, Paul Michael Glaser, Leonard Frey  See more",
      "Language": "English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)",
      "Runtime": "3 hours and 1 minute",
      "Aspect Ratio": "2.35:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "G (General Audience)",
      "Product Dimensions": "7.75 x 5.5 x 0.5 inches; 3.2 Ounces",
      "Director": "Norman Jewison",
      "Media Format": "Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, DVD, Widescreen, NTSC",
      "Run time": "3 hours and 1 minute",
      "Release date": "October 2, 2001",
      "Actors": "Topol, Norma Crane, Leonard Frey, Molly Picon, Paul Mann",
      "Subtitles": "English, Spanish, French",
      "Studio": "MGM (Video & DVD)",
      "Writers": "Joseph Stein, Sholom Aleichem",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}