{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Poldark 2\nReview Date: 2015/10/16\nStore: Rated:    Unrated    Format: VHS Tape\nCategories: Movies & TV, Art House & International, By Country, United Kingdom\nAverage Rating: 3.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Package Dimensions': '7.9 x 6.7 x 4.3 inches; 2.8 Pounds', 'Release date': 'September 4, 2001', 'Date First Available': 'January 31, 2007', 'Actors': 'Poldark 2', 'Studio': '20th Century Fox'}\nReview Text: Loved this series.  Thanks for offering the set for Poldark series 1 and 2.  Really enjoy watching the older version.  Videos were in great shape!\nReview Title: Poldark 2 Videos\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Travel Yugoslavia:Adriatic Coast [VHS]\nRated:    NR    Format: VHS Tape\nMovies & TV, Movies\n{'Format': 'Color, NTSC', 'Contributor': 'Travel Series', 'Runtime': '30 minutes', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Run time': '30 minutes', 'Release date': 'September 13, 1991', 'Date First Available': 'September 29, 2006', 'Actors': 'Travel Series', 'Studio': 'Victory Multimedia C', 'Country of Origin': 'USA'}\nThis is an older film made prior to the end of the war in '95.<br />However, the scenery is beautiful.  Shows most of the larger cities on the Adriatic Coastline in what is now Croatia, with a few southern cities as well.<br />Good, basic information.  Does not really show the magnificent beauty of the Adriatic Sea.<br />I do enjoy it and brings back the wonderful memories I have from my visit there in 2000.<br />Thank you for offering this video for sale. I hope you offer more on Croatia in the future.\nAdriatic Coast\nDog of Flanders VHS\nDavid Ladd  (Actor),     Donald Crisp  (Actor),     James B. Clark  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Kids & Family\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'James B. Clark', 'Run time': '1 hour and 36 minutes', 'Release date': 'February 24, 1998', 'Date First Available': 'February 9, 2007', 'Actors': 'David Ladd, Donald Crisp, Theodore Bikel, Max Croiset, Monique Ahrens', 'Studio': 'Paramount', 'Producers': 'Robert B. Radnitz', 'Writers': 'Ouida, Ted Sherdeman'}\nI love the Dog of Flanders.  I saw the movie of the same title made several years ago.  Then at my library I found this older edition and was so pleased when I found it still in print and available ....  The older edition is different abit from the newer version; however I love both stories.<br />It is a classic of the highest standards.  The original book has a sad ending and I am glad the movies are more joyful!<br />Excellent movies for children to see, especially any children with artistic talent!  Enjoy!\nDog of Flanders older version\nResurrection [VHS]\nEllen Burstyn  (Actor),     Sam Shepard  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    PG    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['Amazon.com', 'Released at a time when psychic auras, near-death experiences, and Kirlian photography were all the rage among early New Age proponents,', 'Resurrection', \"achieves a spiritual depth rarely found in Hollywood movies. In one of her finest performances, Ellen Burstyn stars as Edna McCauley, a transplanted farm girl who develops healing powers following an accident that left her widowed and paralyzed. Returning to her Kansas homeland, she attracts awe and controversy, performing healings while deflecting any pretense of religion. That's a risky position in the Bible belt, and even Edna's new beau Cal (Sam Shepard) responds with zealous incredulity, fearing what he can't understand while others embrace Edna with unquestioning faith. Through it all, Edna remains calmly resolute as the conduit of an extraordinary gift.\", 'Sensitively written by Lewis John Carlino (', 'The Great Santini', '),', 'Resurrection', \"tenuously mixes spiritual significance with John Ford's homespun tradition, but for the most part it works: Burstyn superbly conveys Edna's heartfelt determination, and both she and stage veteran Eva LeGallienne (in a rare and final film performance, as Edna's grandma) deservedly earned Oscar nominations. The movie dares to suggest that miracles reside within everyone, and that pure grace will manifest itself in unexpected ways. To that end, Richard Farnsworth is warm and wise in a brief but perfect role; Burstyn's final scene with Roberts Blossom (as her disapproving father) is a heartbreaker; and the film ends with an act of compassion that brings the story full circle as an affirmation of life's greatest mysteries.\", '--Jeff Shannon']\n{'Format': 'Color, NTSC, HiFi Sound', 'Contributor': \"Ellen Burstyn, Tom Taylor (II), Daniel Petrie, Jeffrey DeMunn, Claudette Harrell, Carlin Glynn, Madeleine Sherwood, Tommy Splittgerber, Clifford David, Ralph Roberts, Sylvia Walden, David Calkins, Jessie Lee Fulton, Edith Mills (II), Don Michaelson, Penelope Allen, Lane Smith, Carol Williard, Edward Pflaum, Sally Bondi, James N. Harrell, William D. Wittliff, John Tillinger, Trazana Beverley, Harvey Christiansen, A.G. Mills, William Ellis Smith, Dan'l Terry, Richard Hamilton, Sam Shepard, Lois Smith, Bernard Behrens, Douglas G. Jacobson, Vernon Weddle, David Haney, Joshua Dean Stewart, Lou Fant, Jennifer McAllister, Ruth N. Straw, Pamela Payton-Wright, Robert W. Johnson, Richard Farnsworth, Therese East, Eva Mokry, Shane Sinutko, Eva Le Gallienne, George Sperdakos, James Blendick, Brett Lamar Turner, Ebbe Roe Smith, Roberts BlossomEllen Burstyn, Tom Taylor (II), Daniel Petrie, Jeffrey DeMunn, Claudette Harrell, Carlin Glynn, Madeleine Sherwood, Tommy Splittgerber, Clifford David, Ralph Roberts, Sylvia Walden, David Calkins, Jessie Lee Fulton, Edith Mills (II), Don Michaelson, Penelope Allen, Lane Smit…   See more\", 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Daniel Petrie', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 18, 2000', 'Date First Available': 'January 27, 2007', 'Actors': 'Ellen Burstyn, Sam Shepard, Richard Farnsworth, Roberts Blossom, Clifford David', 'Studio': 'Universal Studios Home Entertainment'}\nI love this movie.  It is a sleeper.  Ellen Burstyn is always in a thought provoking movie.  I was glad to be able to find a copy to buy from Amazon and have it in my collection.<br />It is a great love story....\nReview of Resurrection\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Reiner'], 'Producers': ['Rob Reiner', 'Lori McCreary', 'Salli Newman', 'Nicolas Chartier', 'Alan Greisman', 'David Valdes'], 'Starring': ['Morgan Freeman', 'Virginia Madsen'], 'Studio': ['Magnolia Pictures']}\nLoved it.  Wonderful story good for the entire family!  Just love all Morgan's movies! He always has a moral to tell !\nRefreshing story line\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susan Tully', 'Patrick Lau', 'Alan Grint', 'John Greening', 'Charlie Palmer', 'Moira Armstrong', 'Marc Jobst', 'David Tucker', 'Julian Holmes', 'Paul Marcus'], 'Producers': ['Grainne Marmion', 'Sue Hogg'], 'Starring': ['Brendan Coyle', 'Claudia Blakley', 'Dawn French'], 'Studio': ['BBC America']}\nLove it! Good wholesome family show!  Good for the entire family.<br />I would greatly recommend!  Good life lessons.  Try it out. Love the Prime TV shows.\nSeason One\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Sean Penn'], 'Producers': ['David Heyman'], 'Starring': ['Vera Farmiga', 'David Thewlis', 'Rupert Friend'], 'Studio': ['Miramax']}\nStory of Nazism but in a different way.  Enjoyed the building of relationships.  I did not guess the outcome...Very heart wrenching.  Historically educational.\nReview of Movie Boy in The Striped Pajamas\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Israel Horovitz'], 'Producers': ['Rachael Horovitz', 'Gary Foster', 'Nitsa Benchetrit', 'David C. Barrot'], 'Starring': ['Kevin Kline', 'Kristin Scott Thomas', 'Maggie Smith']}\nActing was very good.  Excellent stars.  Enjoyed.\nReview for My Old Lady\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Stratton'], 'Producers': ['Mickey Liddell', 'Pete Shilaimon', 'William Horberg'], 'Starring': ['Elizabeth Olsen', 'Oscar Isaac', 'Tom Felton'], 'Studio': ['Roadside Attractions']}\nActing was excellent !  Interesting convoluted storyline. Rather sad.\nReview for \"In Secret\"\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James E. Duff'], 'Producers': ['James E. Duff', 'Julia Morrison'], 'Starring': ['Andrew Pastides', 'Mahira Kakkar', 'Brian Sloan']}\nTheory and method of movie was good, but felt like audience is left hanging.  Like what is the point<br />except an exercise in film making. Enjoyed the actors.\nReview for Hank and Asha\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Unavailable'], 'Producers': ['0'], 'Starring': ['Alan Titchmarsh', 'Robert Hardy'], 'Studio': ['Total Content']}\nExcellent history of England's gardens.  Great ideas with names of interesting plant material.  Visual display is elegant as various large homes are displaying magnificent gardens.\nGreat Documentary on English Gardens\nPoldark 1\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Art House & International, By Country, United Kingdom, Drama\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.9 x 6.9 x 4.2 inches; 3.35 Pounds', 'Release date': 'September 11, 1997', 'Date First Available': 'January 31, 2007', 'Actors': 'Poldark', 'Studio': '20th Century Fox'}\nSo far I have only watched the first episode, but it is working well...once I figured out tracking on my ancient Panasonic DVD/VHS Combo player!<br />Thanks for supplying this old version of the Masterpiece Theatre's Presentation on PBS.\nPolark First Time Around!\n{'Subtitles': ['None available'], 'Directors': ['Christopher Menaul', 'David Moore'], 'Producers': ['Andy Harries'], 'Starring': ['Damian Lewis', 'Gina McKee', 'Ioan Gruffudd'], 'Studio': ['Acorn Media']}\nExcellent.\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['A.J. Edwards'], 'Producers': ['Terrence Malick', 'Nicolas Gonda', 'Jake DeVito', 'Charley Beil', 'Jason Krigsfeld', 'Joseph Krigsfeld', 'Antoine Douaihy', 'Claudia Kowalski', 'Kevin Kowalski', 'Michael Kowalski', 'Stefan Sonnenfeld', 'Elizabeth Lodge', 'Brent Glass', 'Emily Hohmann'], 'Starring': ['Jason Clarke', 'Diane Kruger', 'Brit Marling']}\nI could not get a grasp on it...I wanted to see Lincoln's childhood bio but was disappointed.  Maybe it is just the B & W format.\nBetter Angels review\nPoldark 2\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Art House & International, By Country, United Kingdom\n{'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Package Dimensions': '7.9 x 6.7 x 4.3 inches; 2.8 Pounds', 'Release date': 'September 4, 2001', 'Date First Available': 'January 31, 2007', 'Actors': 'Poldark 2', 'Studio': '20th Century Fox'}\nLoved this series.  Thanks for offering the set for Poldark series 1 and 2.  Really enjoy watching the older version.  Videos were in great shape!\nPoldark 2 Videos",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user maintains a strong passion for travel-related media and historical themes, with a continued preference for classic films that evoke emotional connections and showcase celebrated performances. They gravitate towards narratives imparting moral lessons and express particular admiration for well-produced series, especially those from the past.\n\n- **Preferences:** Nostalgia remains a pivotal influence in their media choices, prioritizing family-friendly content with uplifting messages intertwined with complex themes. Their discerning taste for narrative clarity and engagement is evident in their heightened expectations for storytelling quality.\n\n- **Content Focus:** The user enjoys travel documentaries and classic dramas rich in emotional depth, particularly those exploring interpersonal relationships in historical contexts. They favor sophisticated characters and ethical dilemmas, prioritizing meaningful storytelling.\n\n- **Emotional Connection:** Personal narratives linked to travel and film resonate deeply, and they value significant artistic works. Their pragmatic approach balances complexity with a focus on substantial content, as reflected in their recent high ratings.\n\n- **Recent Interaction:** Their latest positive rating for a classic historical series aligns with their longstanding appreciation for engaging narratives, demonstrating that they still celebrate quality storytelling from earlier eras, despite recent shifts towards demanding higher narrative coherence.\n\n- **Rating Behavior:** The user generally rates content positively, but recent low ratings and high expectations indicate a growing specificity in their standards for narrative coherence and engagement within historical narratives.\n\nOverall, the profile underscores a deep appreciation for thoughtful, emotionally rich narratives, with recent interactions reflecting a blend of nostalgia and a continued pursuit of quality storytelling.",
  "metrics": {
    "rouge1_f": 0.10698689956331878,
    "rouge2_f": 0.003278688524590164,
    "rougeL_f": 0.04475982532751092,
    "meteor": 0.029138036009393752,
    "bleu1": 0.00030291998644915724,
    "bleu2": 8.799336981538256e-05,
    "bleu3": 2.8046135953319856e-05,
    "bleu4": 8.91113716735744e-06,
    "bertscore_precision": 0.3442608416080475,
    "bertscore_recall": 0.4646625518798828,
    "bertscore_f1": 0.3955013155937195
  }
}