{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/02/26\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susan Tully', 'Patrick Lau', 'Alan Grint', 'John Greening', 'Charlie Palmer', 'Moira Armstrong', 'Marc Jobst', 'David Tucker', 'Julian Holmes', 'Paul Marcus'], 'Producers': ['Grainne Marmion', 'Sue Hogg'], 'Starring': ['Brendan Coyle', 'Claudia Blakley', 'Dawn French'], 'Studio': ['BBC America']}\nReview Text: Love it! Good wholesome family show!  Good for the entire family.<br />I would greatly recommend!  Good life lessons.  Try it out. Love the Prime TV shows.\nReview Title: Season One\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Travel Yugoslavia:Adriatic Coast [VHS]\nRated:    NR    Format: VHS Tape\nMovies & TV, Movies\n{'Format': 'Color, NTSC', 'Contributor': 'Travel Series', 'Runtime': '30 minutes', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Run time': '30 minutes', 'Release date': 'September 13, 1991', 'Date First Available': 'September 29, 2006', 'Actors': 'Travel Series', 'Studio': 'Victory Multimedia C', 'Country of Origin': 'USA'}\nThis is an older film made prior to the end of the war in '95.<br />However, the scenery is beautiful.  Shows most of the larger cities on the Adriatic Coastline in what is now Croatia, with a few southern cities as well.<br />Good, basic information.  Does not really show the magnificent beauty of the Adriatic Sea.<br />I do enjoy it and brings back the wonderful memories I have from my visit there in 2000.<br />Thank you for offering this video for sale. I hope you offer more on Croatia in the future.\nAdriatic Coast\nDog of Flanders VHS\nDavid Ladd  (Actor),     Donald Crisp  (Actor),     James B. Clark  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Kids & Family\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'James B. Clark', 'Run time': '1 hour and 36 minutes', 'Release date': 'February 24, 1998', 'Date First Available': 'February 9, 2007', 'Actors': 'David Ladd, Donald Crisp, Theodore Bikel, Max Croiset, Monique Ahrens', 'Studio': 'Paramount', 'Producers': 'Robert B. Radnitz', 'Writers': 'Ouida, Ted Sherdeman'}\nI love the Dog of Flanders.  I saw the movie of the same title made several years ago.  Then at my library I found this older edition and was so pleased when I found it still in print and available ....  The older edition is different abit from the newer version; however I love both stories.<br />It is a classic of the highest standards.  The original book has a sad ending and I am glad the movies are more joyful!<br />Excellent movies for children to see, especially any children with artistic talent!  Enjoy!\nDog of Flanders older version\nResurrection [VHS]\nEllen Burstyn  (Actor),     Sam Shepard  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    PG    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['Amazon.com', 'Released at a time when psychic auras, near-death experiences, and Kirlian photography were all the rage among early New Age proponents,', 'Resurrection', \"achieves a spiritual depth rarely found in Hollywood movies. In one of her finest performances, Ellen Burstyn stars as Edna McCauley, a transplanted farm girl who develops healing powers following an accident that left her widowed and paralyzed. Returning to her Kansas homeland, she attracts awe and controversy, performing healings while deflecting any pretense of religion. That's a risky position in the Bible belt, and even Edna's new beau Cal (Sam Shepard) responds with zealous incredulity, fearing what he can't understand while others embrace Edna with unquestioning faith. Through it all, Edna remains calmly resolute as the conduit of an extraordinary gift.\", 'Sensitively written by Lewis John Carlino (', 'The Great Santini', '),', 'Resurrection', \"tenuously mixes spiritual significance with John Ford's homespun tradition, but for the most part it works: Burstyn superbly conveys Edna's heartfelt determination, and both she and stage veteran Eva LeGallienne (in a rare and final film performance, as Edna's grandma) deservedly earned Oscar nominations. The movie dares to suggest that miracles reside within everyone, and that pure grace will manifest itself in unexpected ways. To that end, Richard Farnsworth is warm and wise in a brief but perfect role; Burstyn's final scene with Roberts Blossom (as her disapproving father) is a heartbreaker; and the film ends with an act of compassion that brings the story full circle as an affirmation of life's greatest mysteries.\", '--Jeff Shannon']\n{'Format': 'Color, NTSC, HiFi Sound', 'Contributor': \"Ellen Burstyn, Tom Taylor (II), Daniel Petrie, Jeffrey DeMunn, Claudette Harrell, Carlin Glynn, Madeleine Sherwood, Tommy Splittgerber, Clifford David, Ralph Roberts, Sylvia Walden, David Calkins, Jessie Lee Fulton, Edith Mills (II), Don Michaelson, Penelope Allen, Lane Smith, Carol Williard, Edward Pflaum, Sally Bondi, James N. Harrell, William D. Wittliff, John Tillinger, Trazana Beverley, Harvey Christiansen, A.G. Mills, William Ellis Smith, Dan'l Terry, Richard Hamilton, Sam Shepard, Lois Smith, Bernard Behrens, Douglas G. Jacobson, Vernon Weddle, David Haney, Joshua Dean Stewart, Lou Fant, Jennifer McAllister, Ruth N. Straw, Pamela Payton-Wright, Robert W. Johnson, Richard Farnsworth, Therese East, Eva Mokry, Shane Sinutko, Eva Le Gallienne, George Sperdakos, James Blendick, Brett Lamar Turner, Ebbe Roe Smith, Roberts BlossomEllen Burstyn, Tom Taylor (II), Daniel Petrie, Jeffrey DeMunn, Claudette Harrell, Carlin Glynn, Madeleine Sherwood, Tommy Splittgerber, Clifford David, Ralph Roberts, Sylvia Walden, David Calkins, Jessie Lee Fulton, Edith Mills (II), Don Michaelson, Penelope Allen, Lane Smit…   See more\", 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Daniel Petrie', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 18, 2000', 'Date First Available': 'January 27, 2007', 'Actors': 'Ellen Burstyn, Sam Shepard, Richard Farnsworth, Roberts Blossom, Clifford David', 'Studio': 'Universal Studios Home Entertainment'}\nI love this movie.  It is a sleeper.  Ellen Burstyn is always in a thought provoking movie.  I was glad to be able to find a copy to buy from Amazon and have it in my collection.<br />It is a great love story....\nReview of Resurrection\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Reiner'], 'Producers': ['Rob Reiner', 'Lori McCreary', 'Salli Newman', 'Nicolas Chartier', 'Alan Greisman', 'David Valdes'], 'Starring': ['Morgan Freeman', 'Virginia Madsen'], 'Studio': ['Magnolia Pictures']}\nLoved it.  Wonderful story good for the entire family!  Just love all Morgan's movies! He always has a moral to tell !\nRefreshing story line\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susan Tully', 'Patrick Lau', 'Alan Grint', 'John Greening', 'Charlie Palmer', 'Moira Armstrong', 'Marc Jobst', 'David Tucker', 'Julian Holmes', 'Paul Marcus'], 'Producers': ['Grainne Marmion', 'Sue Hogg'], 'Starring': ['Brendan Coyle', 'Claudia Blakley', 'Dawn French'], 'Studio': ['BBC America']}\nLove it! Good wholesome family show!  Good for the entire family.<br />I would greatly recommend!  Good life lessons.  Try it out. Love the Prime TV shows.\nSeason One",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user continues to exhibit a strong passion for travel-related media with a focus on historical and scenic themes, alongside classic films that evoke emotional connections. Recently, they have shown a particular affinity for narratives that include moral lessons, often featuring notable actors like Morgan Freeman, and have a growing interest in thought-provoking stories with spiritual elements.\n\n- **Preferences:** The user maintains a preference for VHS format, valuing the nostalgic aspect of vintage media. Their tastes lean towards family-friendly content that emphasizes uplifting messages and life lessons.\n\n- **Content Focus:** They enjoy travel documentaries and films highlighting geographical locations, especially coastal areas, as well as classic dramas that delve into emotional depth and moral storytelling. Their recent interaction reflects a strong appreciation for wholesome family shows that convey good life lessons.\n\n- **Emotional Connection:** The user cherishes personal stories tied to travel and film, favoring narratives characterized by artistic appreciation and emotional richness.\n\n- **Desire for More Content:** They continue to seek diverse materials that explore specific regions and are particularly interested in older films with compelling emotional or spiritual narratives.\n\n- **Rating Behavior:** The user tends to assign high ratings, showcasing their positive outlook towards content that resonates personally, particularly those that harmoniously blend compelling storytelling with emotional depth and ethical insights.\n\nOverall, the user’s profile highlights a refined appreciation for nostalgic, travel-themed narratives that provide moral insights and emotional resonance.",
  "metrics": {
    "rouge1_f": 0.1497659906396256,
    "rouge2_f": 0.015625,
    "rougeL_f": 0.06396255850234009,
    "meteor": 0.048603993006372664,
    "bleu1": 0.00514088099765399,
    "bleu2": 0.001537200396412807,
    "bleu3": 0.0004947325998492252,
    "bleu4": 0.00015796439936117946,
    "bertscore_precision": 0.3431050777435303,
    "bertscore_recall": 0.45613154768943787,
    "bertscore_f1": 0.3916263282299042
  }
}