{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/02/20\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zoltan Korda'], 'Producers': ['Alexander Korda'], 'Starring': ['John Clements', 'Ralph Richardson', 'C. Aubrey Smith'], 'Studio': ['The Criterion Collection']}\nReview Text: This is a great story of courage.  We will not always be understood by others.  It is most important that we understand ourselves.  In doing so, we will be better able to understand and love others.\nReview Title: One of my favorite movies\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brett Ratner'], 'Producers': ['Tony Ludwig', 'Zvi Howard Rosenman', 'Marc Abraham'], 'Starring': ['Nicolas Cage', 'Téa Leoni', 'Makenzie Vega'], 'Studio': ['UNIVERSAL PAY TELEVISION']}\nA funny, enjoyable film about what is truly of value in this life:  family, with all of its ups and downs.\nOne of my favorite movies\nWilly Wonka & the Chocolate Factory\nGene Wilder  (Actor),     Jack Albertson  (Actor),     Mel Stuart  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Willy Wonka and the Chocolate Factory 40th Anniversary Edition (DVD)', 'Celebrate the 40th Anniversary of a musical fantasy for the young, and the young at heart. The mysterious candy maker extraordinaire Willy Wonka (Gene Wilder) hides a Golden Ticket inside five of his famous candy bars. The kids who find them are invited on a grand tour of the wondrous, wacky Wonka factory, and a chance for an even grander prize -- if they can resist temptation. The delightful musical score includes the hit song \"The Candyman.\" From Roald Dahl\\'s classic novel, produced by David Wolper (\"Roots,\" \"The Thorn Birds\") and nominated for an Academy Award.', ']]>']\n{'Genre': 'Musicals & Performing Arts/Musicals, Science Fiction & Fantasy, Kids & Family, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Contributor': 'Peter Ostrum, Mel Stuart, Paris Themmen, Roald Dahl, Roy Kinnear, Jack Albertson, David L. Wolper, Dodo Denney, Denise Nickerson, Leonard Stone, Stan Margulies, Julie Dawn Cole, Leslie Bricusse, Anthony Newley, Gene WilderPeter Ostrum, Mel Stuart, Paris Themmen, Roald Dahl, Roy Kinnear, Jack Albertson, David L. Wolper, Dodo Denney, Denise Nickerson, Leonard Stone, Stan Margulies, Julie Dawn Cole, Leslie Bricusse, Anthony Newley, Gene Wilder  See more', 'Language': 'English, Spanish, French', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.08 Ounces', 'Item model number': '1000183517', 'Director': 'Mel Stuart', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 18, 2011', 'Actors': 'Gene Wilder, Jack Albertson, Peter Ostrum, Roy Kinnear, Denise Nickerson', 'Subtitles': 'French, English, Spanish', 'Producers': 'Stan Margulies, David L. Wolper', 'Studio': 'WarnerBrothers', 'Writers': 'Roald Dahl, Leslie Bricusse, Anthony Newley', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI like both versions of Willy Wonka because they each offer something a little different.  Both have basically the same great story.  Being a chocoholic myself, who wouldn't want to own a candy factory?\nOne of my favorite movies\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zoltan Korda'], 'Producers': ['Alexander Korda'], 'Starring': ['John Clements', 'Ralph Richardson', 'C. Aubrey Smith'], 'Studio': ['The Criterion Collection']}\nThis is a great story of courage.  We will not always be understood by others.  It is most important that we understand ourselves.  In doing so, we will be better able to understand and love others.\nOne of my favorite movies",
  "profile": "**User Summary:**\n\n- **Content Preference:** The user enjoys films that explore family values, blending humor with the complexities of familial relationships. They appreciate stories that offer varied perspectives on relationships, both positive and negative. They have a particular fondness for musical fantasy films that evoke nostalgia and whimsy, reinforcing their affinity for content suitable for both children and adults.\n- **Humor Appreciation:** Prefers comedic elements in films, seeking light-hearted narratives that entertain while provoking thought.\n- **Rating Behavior:** The user maintains a favorable outlook on their movie choices, with an average rating of 4.8. Recently, they rated a film 5.0, indicating a high level of enjoyment, reflecting their consistent positive rating pattern.\n- **Content Sensitivity:** Comfortable with mature themes, engaging with content that includes nudity, violence, and foul language, suggesting an affinity for complex, adult-oriented narratives.\n- **Language & Accessibility:** Values films available in English and appreciates accessibility features such as audio descriptions and closed captions.\n- **Director & Actor Affinity:** Exhibits loyalty to specific directors and actors, showing a consistent interest in their works over time. This loyalty extends to various genres, including musicals and family-oriented narratives, often appreciating adaptations of classic literature.\n\nThe user’s recent interactions further emphasize their appreciation for narratives that inspire courage and self-understanding, contributing to their overall enjoyment of emotionally impactful and imaginative storytelling.",
  "metrics": {
    "rouge1_f": 0.21944444444444444,
    "rouge2_f": 0.013927576601671309,
    "rougeL_f": 0.09722222222222222,
    "meteor": 0.07609811656305904,
    "bleu1": 0.049177030082364834,
    "bleu2": 0.010385664716906946,
    "bleu3": 0.0018105711783325724,
    "bleu4": 0.0007566422478857492,
    "bertscore_precision": 0.34218746423721313,
    "bertscore_recall": 0.42497310042381287,
    "bertscore_f1": 0.3791135251522064
  }
}