{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/09/12\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English [CC]', 'Español (Latinoamérica)', 'Español (Latinoamérica) [CC]'], 'Directors': ['Kevin Reynolds'], 'Producers': ['Roger Birnbaum', 'Gary Barber', 'Jonathan Glickman'], 'Starring': ['Jim Caviezel', 'Guy Pearce', 'Richard Harris'], 'Studio': ['Buena Vista Pay Television']}\nReview Text: One of my family's favs!  Great flick.\nReview Title: Awesome movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Alcohol use'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Harold Cronk'], 'Producers': ['Michael Scott', 'Russell Wolfe', 'David A.R. White', 'Anna Zielinski', 'Elizabeth Travis'], 'Starring': ['Kevin Sorbo', 'Shane Harper', 'David A.R. White'], 'Studio': ['Lionsgate']}\nLoved it!  I am a movie lover of all types of movies and I loved this.  I have watched lots of Christian movies but this one may be there very best.  I learned a lot and I was surprised as the movie went on.  Some Christian movies don't have big budgets and some have totally expected endings but this one was different.  The acting was great and I was very impressed with Kevin Sorbo's performance.  I can't wait to watch it again to see what I missed the first time.  I would definitely recommend!\nAwesome movie!  Can't wait to watch again.\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Neil Burger'], 'Producers': ['Douglas Wick', 'Lucy Fisher', 'Pouya Shahbazian'], 'Starring': ['Shailene Woodley', 'Theo James', 'Ashley Judd'], 'Studio': ['Lionsgate']}\nI Love It!!  My whole family really enjoyed it and we think we liked it even better than the Hunger Games movies. Also, it was nice to have such a great movie that didn't have anything I wanted to keep my 12 year-old from seeing.\nLiked it more than we thought!\n{'Subtitles': ['None available'], 'Directors': ['Chris Carter'], 'Producers': ['Chris Carter', 'Marc Rosen', 'Gabe Rotter'], 'Starring': ['Aldis Hodge', 'Andrew Howard', 'Arielle Kebbel']}\nI enjoyed the first part of the show but the amount of F Bombs was ridiculous!  Even some of the toughest R rated movies I have seen had less bad language.  I really thought it was a joke at first.  Once we got to the end, I thought it was just plan evil.  Lots of reviews give spoilers about this so I am not giving too much away but the creature at the end just looks evil.  I won't watch again.\nNot a great show and the language was ridiculous!\n{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English [CC]', 'Español (Latinoamérica)', 'Español (Latinoamérica) [CC]'], 'Directors': ['Kevin Reynolds'], 'Producers': ['Roger Birnbaum', 'Gary Barber', 'Jonathan Glickman'], 'Starring': ['Jim Caviezel', 'Guy Pearce', 'Richard Harris'], 'Studio': ['Buena Vista Pay Television']}\nOne of my family's favs!  Great flick.\nAwesome movie",
  "profile": "The user is a passionate movie enthusiast with a strong affinity for Christian films that showcase quality and depth. They prioritize compelling storytelling, impressive performances from established actors, and seek originality, often expressing dissatisfaction with clichés and predictable endings typical of lower-budget productions. Their recent enjoyment of a family-friendly film that exceeded expectations reflects their commitment to content suitable for younger viewers.\n\nThe user appreciates accessible features like audio descriptions and multilingual captions, emphasizing inclusivity in their viewing experience. They have clear boundaries regarding language, demonstrated by their disappointment with a recent show due to excessive profanity, leading to a very low rating. This indicates a preference for relatively clean content.\n\nOverall, the user maintains a positive attitude toward films that offer meaningful experiences, often engaging deeply enough to watch them multiple times for comprehensive understanding. Their enjoyment of a recent favorite highlights their excitement for recommending impactful films to others, while they remain open to exploring genres beyond Christian films, consistently focusing on storytelling quality and engaging content. Their taste aligns with films that foster personal growth and reflection, reinforcing their desire for cinematic experiences that resonate deeply with viewers.",
  "metrics": {
    "rouge1_f": 0.1904761904761905,
    "rouge2_f": 0.006825938566552901,
    "rougeL_f": 0.07482993197278912,
    "meteor": 0.07439215349669948,
    "bleu1": 0.037129960029668146,
    "bleu2": 0.007033589957405259,
    "bleu3": 0.0014905352075321443,
    "bleu4": 0.0006869823398985853,
    "bertscore_precision": 0.3230668604373932,
    "bertscore_recall": 0.41829198598861694,
    "bertscore_f1": 0.3645637333393097
  }
}