{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/08/10\nAverage Rating: 3.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Chris Carter'], 'Producers': ['Chris Carter', 'Marc Rosen', 'Gabe Rotter'], 'Starring': ['Aldis Hodge', 'Andrew Howard', 'Arielle Kebbel']}\nReview Text: I enjoyed the first part of the show but the amount of F Bombs was ridiculous!  Even some of the toughest R rated movies I have seen had less bad language.  I really thought it was a joke at first.  Once we got to the end, I thought it was just plan evil.  Lots of reviews give spoilers about this so I am not giving too much away but the creature at the end just looks evil.  I won't watch again.\nReview Title: Not a great show and the language was ridiculous!\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Alcohol use'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Harold Cronk'], 'Producers': ['Michael Scott', 'Russell Wolfe', 'David A.R. White', 'Anna Zielinski', 'Elizabeth Travis'], 'Starring': ['Kevin Sorbo', 'Shane Harper', 'David A.R. White'], 'Studio': ['Lionsgate']}\nLoved it!  I am a movie lover of all types of movies and I loved this.  I have watched lots of Christian movies but this one may be there very best.  I learned a lot and I was surprised as the movie went on.  Some Christian movies don't have big budgets and some have totally expected endings but this one was different.  The acting was great and I was very impressed with Kevin Sorbo's performance.  I can't wait to watch it again to see what I missed the first time.  I would definitely recommend!\nAwesome movie!  Can't wait to watch again.\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Neil Burger'], 'Producers': ['Douglas Wick', 'Lucy Fisher', 'Pouya Shahbazian'], 'Starring': ['Shailene Woodley', 'Theo James', 'Ashley Judd'], 'Studio': ['Lionsgate']}\nI Love It!!  My whole family really enjoyed it and we think we liked it even better than the Hunger Games movies. Also, it was nice to have such a great movie that didn't have anything I wanted to keep my 12 year-old from seeing.\nLiked it more than we thought!\n{'Subtitles': ['None available'], 'Directors': ['Chris Carter'], 'Producers': ['Chris Carter', 'Marc Rosen', 'Gabe Rotter'], 'Starring': ['Aldis Hodge', 'Andrew Howard', 'Arielle Kebbel']}\nI enjoyed the first part of the show but the amount of F Bombs was ridiculous!  Even some of the toughest R rated movies I have seen had less bad language.  I really thought it was a joke at first.  Once we got to the end, I thought it was just plan evil.  Lots of reviews give spoilers about this so I am not giving too much away but the creature at the end just looks evil.  I won't watch again.\nNot a great show and the language was ridiculous!",
  "profile": "The user is a passionate movie enthusiast with a strong affinity for Christian films that showcase quality and depth. They value compelling storytelling and impressive performances from established actors, expressing dissatisfaction with clichés and predictable endings often found in lower-budget productions. Their appreciation for originality indicates a desire for films that provide new insights or teachings, fostering personal growth and reflection.\n\nRecently, the user enjoyed a family-friendly film that exceeded their expectations, highlighting their priority for content suitable for younger viewers. They also appreciate accessible features like audio descriptions and multilingual captions, emphasizing their commitment to inclusivity. \n\nHowever, the user has shown disappointment with a recent show due to excessive profanity, which they found distracting and inappropriate, leading to a very low rating. This suggests they have clear boundaries regarding the language used in films and shows, reinforcing their preference for relatively clean content. \n\nOverall, the user exhibits a positive attitude toward films that offer meaningful experiences, often engaging deeply enough to watch them multiple times for comprehensive understanding. They take pleasure in recommending impactful films to others, reflecting their desire to share quality cinematic experiences while remaining open to exploring genres beyond Christian films, always maintaining a focus on storytelling quality and engaging content.",
  "metrics": {
    "rouge1_f": 0.20689655172413793,
    "rouge2_f": 0.010928961748633878,
    "rougeL_f": 0.09074410163339383,
    "meteor": 0.09098512117742938,
    "bleu1": 0.07212526358756909,
    "bleu2": 0.013308684031354913,
    "bleu3": 0.002795436661240828,
    "bleu4": 0.0012825979826955076,
    "bertscore_precision": 0.3493154048919678,
    "bertscore_recall": 0.4351019263267517,
    "bertscore_f1": 0.3875177204608917
  }
}