{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Vegan Glow Quinoa Protein Shampoo Bar | EWG Verified | Vegetable proteins from Quinoa & Soybeans\nReview Date: 2021/09/01\nStore: The Vegan Glow\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '2.91 x 2.91 x 1.34 inches; 3.53 Ounces'}\nReview Text: This shampoo bar is different from others that I’ve used - in a good way. It’s very dense and seems almost like a clay puck when you first get it, unused. This makes me feel like it will last a long time which is really nice.<br /><br />The shampoo lathers well and has a nice but subtle smell. My hair definitely feels clean as well. Overall no complaints and I feel like it’ll last a while!\nReview Title: Unique texture\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Eyelash Curler With Refill Pad Lash Curlers Tool ULG Travel Eye Lashes Clip Professional Stainless Steel Curled Cosmetic Makeup Accessory Rose Gold\nULG\n{'Brand': 'ULG', 'Item Dimensions LxWxH': '2.6 x 5.1 x 1.7 inches', 'Operation Mode': 'Manual'}\nNice! Works as expected and comes with a whole lot of refills which is nice. Not that you need to replace them all that often.\nUseful\nUV Light for Nails,LKE Curing Lamp for Gel Nail Polish 54W UV Led Light Gel Nail Starter Kit Nail Dryer Accessories\nLKE\n{'Brand': 'LKE', 'Light Source Type': 'LED', 'Number of Light Sources': '2', 'Wattage': '54 watts', 'Control Method': 'App', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.45 x 8.7 x 5.08 inches; 2 Pounds', 'Batteries': '1 Lithium Ion batteries required.'}\nThis is the first UV/LED gel nail polish lamp I've ever tried, but it's been amazing so far! It seems pretty standard, it has options for timing from 10 seconds to 120. The best thing about it is that you can set the setting, and it will remember the setting and turn on when you put your hand in via motion sensors! That's super convenient when you have one or both hands covered in wet polish! It plugs into the wall and has a cord that I've found to definitely be long enough, and it's great that you don't have to rely on batteries for it. 5 stars!\nWorks great!\n&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\nYRMJK\n{'Brand': 'YRMJK', 'Age Range (Description)': 'Adult', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 3.1 x 2.7 inches; 13.76 Ounces', 'UPC': '738426030676', 'Manufacturer': 'MUTTUS'}\nThis set has everything you need for an electric toothbrush. In total it includes 6 brush heads (in the photo, one was still in the box), a charger, a case to hold the toothbrush and two brush heads for traveling, and the toothbrush itself with 5 distinct modes. Really you can think of it as having 15 modes because each mode can be on high, medium, or low intensity. The instruction manual describes each of the modes - they vary in rhythm and power. I used one of the weaker settings as the manual suggested because this is my first time using an electric toothbrush, which was the perfect amount of power for me! Have to mention that when this touches your lips by accident it tickles like I have never been tickled before, but I think that is to be expected from any electric toothbrush and just takes some getting used to. Overall, 5 stars - the color is also super cute, and you can't beat the very sturdy travel case! Just wish it had a compartment for the charger. Also impressed with its ability to hold a charge!\nGreat toothbrush set!\nThe Beachwaver Co. Dual Voltage, S1, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\n[[VIDEOID:3158725939fb8ccdffa1fd3ca1707063]] This is so cool. At first when I opened it, I thought the tiny little clamp looked really weird for a curler. The box is also huge when you get it and the whole curler is pretty long - definitely not for easy storage. When I used it though, the results turned out GREAT. Basically you work it by clamping the very end of a streak of hair, then pressing one of the arrow buttons to tell the barrel which direction to rotate. It rotates, picking up your hair as it goes. After a few seconds, just let go of the clamp and you have a curl! Brush it through and you'll get the results in the photo. There really wasn't any kind of kink in the end of my hair either as sometimes happens with clamps (as long as you don't rotate the barrel the wrong way from how you clamped it). One nice thing is that there’s a “home” button for when you rotate the barrel too far from where your thumb is to unclamp the strand - you can see it in the video where it kind of rotates back real quick to line up the clamp release with my thumb. All in all it was really quick, less than 15 minutes to figure the thing out and curl my full head of hair!\nI love this curler!!\nEye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nMourvibe\n{'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nThese are nice and cool and soothing on your under eyes. I don’t have particularly bad dark circles or anything so can’t speak to that, but these are very refreshing and make your skin feel soft and moisturized after you take them off. There are a bunch in this package even though it’s a small container. Plus it comes with a spoon to remove them from the container so you don’t contaminate the rest with your fingers. The kind of gel covering the little masks is clear, and there is a ton of it in the container so that even if you take some time to use up the last few masks, they won’t dry out.\nGreat feeling\nJade Roller Microneedle Derma Roller 3 in 1 for Face Massager Tools Set, Beautlinks Real Natural Rose Quartz for Anti Aging Relaxing Eye Puffiness Wrinkles for Face Eyes Neck Body\nBeautlinks\n{'Package Dimensions': '6.85 x 6.3 x 1.73 inches; 10.41 Ounces', 'UPC': '741376342409', 'Manufacturer': 'Beautlinks'}\nThis comes in such a cute box, perfect for a gift. The three items are 1. a pink jade roller with one smaller side and one larger side, 2. a roll-on bottle with rose quartz pieces in it (but no liquid), and 3. a micro needle roller. The latter is kind of scary as I’ve never experienced microneedling before, but eventually I think I’ll work my way up to it, maybe start on my arms or something to try it out.<br /><br />The jade roller is nice but unfortunately the second I took it out of the box it was in two pieces, with the larger roller detached from the main handle. They say on their page though that if you let them know it was broken, they’ll send a replacement which seems very nice. For the time being I just kind of jammed the handle back into it and it seems fine for now.<br /><br />The roller bottle with the quartz pieces in it is a little odd, I don’t fully understand the purpose or why it’s better than a regular bottle of serum, but it’s a cool way of applying any serum you want to put in the bottle.\nGreat gift set!\nC'est Moi Vanilla Vibes Sugar Balm Body Scrub | Invigorating & Hydrating Exfoliant, Clinically Tested Non-Toxic Ingredients feat. Organic Shea Butter, Coconut Oil & Avocado Oil, EWG Verified, 6 oz\nC'est Moi\n{'Brand': \"C'est Moi\", 'Item Form': 'Balm', 'Skin Type': 'Sensitive', 'Product Benefits': 'Hydrating', 'Active Ingredients': 'Sugar', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.5 x 3.5 x 2 inches; 6 Ounces', 'Item model number': 'PR-COM-RT-X994317', 'UPC': '039897302607'}\nFirst off, I love that this puts an emphasis on natural and non-controversial ingredients. I have started looking for that in all my products now.<br /><br />However, I think this misses the mark. It’s quite thick and definitely exfoliating, but it left a weird residue on my skin? I put it on at the beginning of my shower and just rinsed like I would any normal body wash - but my skin almost feels waxy now. Overall I would not order this again because of that residue feeling. Also, there is not a strong smell, which may be appealing to some but not to others.\nNot the best\nThe Vegan Glow Quinoa Protein Shampoo Bar | EWG Verified | Vegetable proteins from Quinoa & Soybeans\nThe Vegan Glow\n{'Package Dimensions': '2.91 x 2.91 x 1.34 inches; 3.53 Ounces'}\nThis shampoo bar is different from others that I’ve used - in a good way. It’s very dense and seems almost like a clay puck when you first get it, unused. This makes me feel like it will last a long time which is really nice.<br /><br />The shampoo lathers well and has a nice but subtle smell. My hair definitely feels clean as well. Overall no complaints and I feel like it’ll last a while!\nUnique texture",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Unique texture",
    "text": "This shampoo bar is different from others that I’ve used - in a good way. It’s very dense and seems almost like a clay puck when you first get it, unused. This makes me feel like it will last a long time which is really nice.<br /><br />The shampoo lathers well and has a nice but subtle smell. My hair definitely feels clean as well. Overall no complaints and I feel like it’ll last a while!",
    "images": [],
    "asin": "B093JGCRWX",
    "parent_asin": "B093JGCRWX",
    "user_id": "AFZKLDI7Y66JA5RLIXMAUG7LAQZQ",
    "timestamp": "2021-09-01 23:51:51.310000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "The Vegan Glow Quinoa Protein Shampoo Bar | EWG Verified | Vegetable proteins from Quinoa & Soybeans",
    "average_rating": 3.5,
    "rating_number": 12,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/21poMOymE-S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/21poMOymE-S.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61vI7pADRAS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/116xrLdyJ3S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/116xrLdyJ3S.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/51bX2WSdAES._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "The Vegan Glow",
    "categories": [],
    "details": {
      "Package Dimensions": "2.91 x 2.91 x 1.34 inches; 3.53 Ounces"
    },
    "bought_together": null
  }
}