{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/07/20\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vision Video'], 'Producers': ['Bain Boehlke'], 'Starring': ['Martin Doblmeier', 'Klaus Maria Brandauer', 'Adele Schmidt'], 'Studio': ['CreateSpace']}\nReview Text: Very informative, especially concerning the duality of the church of that day; German and Confessing. I see a rift forming today. I also took special note of how the persecution began.\nReview Title: A Lesson For Us All\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Steve Oedekerk'], 'Producers': ['Steve Oedekerk', 'Mark Beam', 'Nicholisa Contis', 'Andrew Egiziano', 'Paul Marshal', 'Julia Pistor', 'Aaron Parry'], 'Starring': ['Kevin James', 'Courteney Cox', 'Sam Elliott'], 'Studio': ['Paramount Pictures']}\nThis movie is barely fit for adults, much less children. Adult themes dressed in children's clothing. So glad I previewed this before I let the kids watch! Trash.\nCartoons Aren't Always For Kids\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael McGowan'], 'Producers': ['Michael McGowan', 'Jody Colero', 'Avi Federgreen', 'Tamara Deverell'], 'Starring': ['James Cromwell', 'Genevieve Bujold', 'Campbell Scott'], 'Studio': ['SAMUEL GOLDWYN FILMS LLC.']}\nI was torn between a four and five star rating. I considered 4 due to some unnecessary elements and length. But, I still have to give it a five. I really appreciated the portrayal of lifelong love, commitment, and the character development in this film. It seemed a bit long...but maybe that is because these filmmakers stayed true to the reality of these lives, instead of giving into the overly-dramatic, cheap, Hollywood-ism that is so prevalent in film today. Overall...well done. My husband and I truly enjoyed it.\nHad To Lean To The Five\n{'Subtitles': ['None available'], 'Directors': ['Steven Suderman'], 'Producers': ['Steven Suderman'], 'Studio': ['FilmBuff']}\nThis is not a &#34;How to&#34; per se. It is more about the heart and soul, and struggles, of farming. Though we felt the film was a bit slow in some places, it is insightful and we enjoyed it very much. I particularly enjoyed watching the &#34;animal mommy,&#34; as I've dubbed her. She is really amazing. Thank you to everyone who had a part in the making of this film. Well done.\nA Beautiful Education\nThe Mystery of the Shemitah Unlocked: The 3,000-Year-Old Mystery That Holds the Secret of America's Future, the World's Future, and Your Future!\nFormat: DVD\nMovies & TV, Featured Categories, DVD, Faith & Spirituality\n['Based on the', 'New York Times', 'Best Seller', 'The Mystery of the Shemitah', 'From the author that brought you', 'NEW YORK TIMES', 'best sellers', 'The Book of Mysteries', ',', 'The Harbinger', ', and', 'The Paradigm', 'with over 3 MILLION copies sold', 'IS IT POSSIBLE THERE EXISTS A 3,000-YEAR-OLD MYSTERY THAT…', 'Is determining America’s future, the world’s future—and your future?Has determined the rise and fall of the economy and the collapse of Wall Street?Has pinpointed the greatest stock market crashes in history down to their exact dates?Foretells the rise and fall of nations and what may be the coming fall of America?Warns of a coming calamity and how to prepare for it?\\xa0 This riveting documentary DVD based on Jonathan Cahn’s', 'New York Times', 'bestsellingbook', 'The Mystery of the Shemitah', 'reveals the seven-year mystery that isessential to understand the past, the present, and the future, and holds the missingkey to end-time prophecy.\\xa0 PLUS - Over fifty minutes of bonus features that go deeper into the mystery, whatlies ahead, and how you can be ready.', 'The Mystery of the Shemitah Unlocked', 'will amaze, stun, forewarn,and prepare you for what lies ahead…and it may just change your life.']\n{'Genre': 'Documentary/Religion', 'Format': 'NTSC', 'Contributor': 'Cahn, Jonathan', 'Runtime': '55 minutes', 'Subtitle': \"The 3,000-Year-Old Mystery That Holds the Secret of America's Future, the World's Future, and Your Future!The 3,000-Year-Old Mystery That Holds the Secret of America's Future, the World's Future, and Your Future!   See more\", 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 3.2 Ounces', 'Item model number': '072270', 'Media Format': 'NTSC', 'Run time': '55 minutes', 'Release date': 'March 31, 2015', 'Studio': 'Frontline', 'Number of discs': '1'}\nI'm going to give this a 4 for those who just won't read the book. It is worth your while to get. But, if you've seen the programs, interviews, and read the books, there is not really any new information here. I bought it because I thought he was going to give some in depth advice on preparing (as the description suggests) after perhaps interviewing some professionals and alluding to what he is doing himself. But, while the spiritual preparation part was wise (and hopefully obvious)...there was little else beyond that. My only question is...how can you accurately, and with certainty, count Shemitah's if you cannot be sure when the Jubilee (50th) year is? It's not an accusation, it's just an observation. However, as history shows, there have been significant collapses during the periods noted by Cahn...so worthwhile knowledge, either way.\nIf You Just Won't Read...\nAll For Liberty\nDrama, Military and War\n[\"It is 1775. Henry Felder, a Swiss-German colonist, lives with his family in the British colony of South Carolina. After many years of struggling with corrupt British rulers, Felder is urged by the new patriot governor to write Articles of Separation from the English King. Felder's old Indian fighting comrade forms a Tory militia to assist the Crown as the fight heats up.\"]\n{'Subtitles': ['None available'], 'Directors': ['Chris Weatherhead'], 'Producers': ['Clarence Felder', 'Ron Mangravite', 'Chris Weatherhead'], 'Starring': ['Clarence Felder', 'Michael Easler', 'Chris Weatherhead']}\nEnjoyable and educational. Good movie.\nWell Done\n{'Content advisory': ['Smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['John Korty', 'Arthur Hiller'], 'Producers': ['David Golden', 'Howard G. Minsky'], 'Starring': ['Ali MacGraw', \"Ryan O'Neal\", 'John Marley'], 'Studio': ['Paramount Pictures']}\nWhat can one say? It's a classic for a reason. We enjoyed it for the most part.\nClassic\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vision Video'], 'Producers': ['Bain Boehlke'], 'Starring': ['Martin Doblmeier', 'Klaus Maria Brandauer', 'Adele Schmidt'], 'Studio': ['CreateSpace']}\nVery informative, especially concerning the duality of the church of that day; German and Confessing. I see a rift forming today. I also took special note of how the persecution began.\nA Lesson For Us All",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** Maintains a strong emphasis on family-friendly media suitable for children, continuing to disapprove of adult themes. Recently engaged with heartwarming films and educational narratives showcasing human relationships and moral lessons, with a growing appreciation for classic films that are widely acclaimed.\n\n- **Viewing Behavior:** Actively pre-screens materials for children, prioritizing character development and meaningful storytelling. Exhibits a preference for slower-paced narratives that provide insights into life, relationships, and community values.\n\n- **Rating Trends:** Generally critical and selective in rating media, recently awarding a high rating to a classic documentary that suggests a potential willingness to embrace quality content, even those that may touch upon more complex themes.\n\n- **Language and Accessibility Needs:** Prefers English audio with closed captions to create an inclusive environment for family viewing.\n\n- **Interest in Family Dynamics:** Focused on entertaining younger audiences with realistic narratives that convey positive values, now increasingly engaged in films and documentaries that communicate essential life lessons.\n\n- **Recent Engagement with Non-Fiction:** Continues to explore non-fiction themes, particularly those concerning spirituality and societal issues, promoting thoughtful discussions within the family.\n\n- **Diverse Interests:** Expanding appreciation for historical narratives, reflecting a balanced blend of educational and entertaining content that aligns with core values, particularly relating to lessons from the past and their relevance today.",
  "metrics": {
    "rouge1_f": 0.1483924154987634,
    "rouge2_f": 0.013212221304706851,
    "rougeL_f": 0.0741962077493817,
    "meteor": 0.050496817677501034,
    "bleu1": 0.005057892551505512,
    "bleu2": 0.0013209297163253718,
    "bleu3": 0.00020511877293152337,
    "bleu4": 8.090231168781016e-05,
    "bertscore_precision": 0.36076033115386963,
    "bertscore_recall": 0.46268218755722046,
    "bertscore_f1": 0.40541356801986694
  }
}