{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Juziviee Brown Wigs for Women, 13'' Short Brown Bob Wig with Bangs, Natural Looking Soft Synthetic Hair Wig, Cute Wigs for Party Cosplay Halloween AD016BR1\nReview Date: 2020/12/31\nStore: Juziviee\nAverage Rating: 3.8\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Straight', 'Special Feature': 'Heat Resistant', 'Brand': 'Juziviee', 'Package Dimensions': '11.02 x 7.48 x 1.73 inches; 6.7 Ounces', 'UPC': '824381921644'}\nReview Text: A nice affordable option for cosplayers that need a very blunt style wig and don’t want to style something themselves. To me some spots on the back could be a little more wefted/thicker but it never shows the wig cap so it’s not too thin. Wig cap is a good fit/size with good stretch making it comfortable to wear\nReview Title: A good fit\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "165G Jumbo Braiding Hair Blonde Synthetic Jumbo Braids 3 Packs\nUHair\n{'Package Dimensions': '13.94 x 6.69 x 3.74 inches; 1.19 Pounds'}\nI wanted to make my own Rapunzel wig but cwas dissatisfied with the cost from Arda you only get 1 for $10 plus shipping and I needed 3 of them. I got these 3 for half the cost I originally bought from Arda. I kept the Arda ones until these came in just to check quality and they’re literally the exact same thing. So I sent the Arda ones back. I think the wig came out beautifully and you can’t even tell this was 3 separate braids at one point. Definitely would buy again! I followed a tutorial I found on google to make the wig, then added my own touches by including the lights!\nPerfect base for Rapunzel Braids!\nCute Cartoon Makeup Brushes Set - 8pcs Fairy Makeup Brushes with Soft Pink Fiber and Metallic Handle for Eyebrow, Eyeshadow, Foundation, Blending and Lips, Great Gift for Sister Girlfriend (Style B)\nrongji jewelry\n{'Brand': 'rongji jewelry', 'Recommended Uses For Product': 'Face Makeup', 'Color': 'Pink', 'Material': 'Synthetic', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '8', 'Age Range (Description)': 'Adult,Teen', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '8.2 x 3.8 x 1.3 inches; 5.75 Ounces', 'UPC': '745695122377'}\nVERY sturdy brushes. I was completely thrown at how sturdy/heavy these brushes are. I was totally expecting cheap light plastic handles that would break easily but that isn’t the case at all. The bristle portion of them is nice to because they’re not to thick or thin, easy to clean, and don’t shed off. Super cute Designs, I know who bts is but I’m not like a super fan or own any of their music to be honest but they definitely have quality merch as proven by these brushes. I don’t really care for the bag they came in, it’s nice enough but feels cheap in comparison to the brushes themselves. I just have them in my makeup bag instead.\nVery good quality\nForfeels Long Straight Black Wig Synthetic Wigs for Women Natural Middle Part Lace Wig Heat Resistant Fiber Natural Looking Wig (30inch, Black Color)\nforfeels\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Forfeels', 'Package Dimensions': '9.33 x 6.34 x 2.36 inches; 10.58 Ounces', 'UPC': '791262892525'}\nNot a lace front wig. I wouldn’t even consider it a partial lace front. The only place it had lace was right at the part. It’s not a horrible or even bad wig. But it’s not a lace front. The fibers were soft but did shed. It’s comfortable enough to wear, but a little tight if you already have a lot of hair going under it. Can’t recommend it to any cosplayers out there looking at this for a costume, I think styling it may be hard with the way it’s wefted and fact it’s not actually a lace front if that’s what you’re looking for.\nNot actually a lace front wig\nCortex International Black Series Duo Platinum 1.25-Inch & 0.5 Inch Travel Size Gemstone Infused Ceramic Plates Duet Flat Iron (Rose Wood)\nCortex\n{'Shape': 'Round', 'Brand': 'Cortex', 'Hair Type': 'Dry, Curly, Straight', 'Material': 'Wood,Ceramic', 'Power Source': 'Corded Electric', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.19 x 4.13 x 3.98 inches; 2.2 Pounds', 'Item model number': 'CTX-DUO-125RW', 'UPC': '819804020950', 'Manufacturer': 'International'}\nThe color is great, the actual product not so much and not worth the price. You could easily buy a better one at big lots for less then half the cost. The full size definitely did not get as hot as it should have and didn’t retain the heat. It wouldn’t straighten my hair. The mini got to temp but would take you forever to do your whole head. It was not as wide as described, the mini is more like a bangs straightener then a mini straightener which is fine for baby hairs and of course bangs. Over all a disappointment given I like the color so much. I’ll be tossing the full size but keeping the mini.\nDoesn’t get to or hold temp\nLeuxe Facial Cleansing Brush, IPX6 Waterproof Rotating Face Brush for Deep Cleansing, 3 Modes and Smart Timer\nleuxe\n{'Brand': 'leuxe', 'Power Source': 'electric', 'Product Benefits': 'Softening,Pores,Cleansing', 'Skin Type': 'All', 'Operation Mode': 'Automatic', 'Package Dimensions': '6.2 x 4 x 2.7 inches; 11.99 Ounces', 'UPC': '631517347748', 'Manufacturer': 'leuxe'}\nSuper easy to hold and use, came in great packaging, and works really well! My only complaint would be that it adds yet another recharging product to my life and I wish it came with a docking system so I could always be charging it rather then a cube/cord combo I have to remember to plug in. I don’t use it every day, every other but it works well with my daily routine when I do.\nIt works!\n24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nAILIWEI\n{'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nNice color and length, with some styling I think this could look very natural. It sheds a bit so I recommend a good brushing with a wig brush. Overall a very good quality wig for the price. Standard wig cap so on larger heads may feel tight.\nNice and natural\nJuziviee Brown Wigs for Women, 13'' Short Brown Bob Wig with Bangs, Natural Looking Soft Synthetic Hair Wig, Cute Wigs for Party Cosplay Halloween AD016BR1\nJuziviee\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Straight', 'Special Feature': 'Heat Resistant', 'Brand': 'Juziviee', 'Package Dimensions': '11.02 x 7.48 x 1.73 inches; 6.7 Ounces', 'UPC': '824381921644'}\nA nice affordable option for cosplayers that need a very blunt style wig and don’t want to style something themselves. To me some spots on the back could be a little more wefted/thicker but it never shows the wig cap so it’s not too thin. Wig cap is a good fit/size with good stretch making it comfortable to wear\nA good fit",
  "profile": "The user remains enthusiastic about crafting, custom hairstyling, and makeup, with a particular emphasis on wig-making. They prioritize budget-friendly, high-quality products and appreciate transparency regarding product features, especially in hairstyling tools. Their latest purchase reflects a focus on practicality and aesthetics, showcasing a discerning taste in beauty accessories while maintaining expectations for consistent performance and ease of maintenance.\n\nTheir engagement with wigs highlights a preference for options that require minimal styling, indicating a desire for convenience in their beauty routine. The user values comfort in fit, as illustrated by their positive experiences with wig caps and their inclination toward thicker wefts for enhanced durability. They continue to seek high-quality makeup brushes and delve into instructional content and product reviews to inform their buying decisions, demonstrating a tendency to replace unsatisfactory items with better alternatives.\n\nThis careful selection process extends to their skincare choices, as evidenced by their acquisition of a facial cleansing device praised for effectiveness but noted for charging convenience. Overall, the user prioritizes visually appealing, durable products that facilitate personal expression in beauty and crafting, consistently aligning with their expectations for quality and affordability across purchases. Their recent interactions reinforce their commitment to enhancing their beauty routine through thoughtfully chosen tools that marry functionality with aesthetic appeal.",
  "metrics": {
    "rouge1_f": 0.1407804131599082,
    "rouge2_f": 0.009195402298850575,
    "rougeL_f": 0.06273909716908951,
    "meteor": 0.04936737826409575,
    "bleu1": 0.0025294450028647227,
    "bleu2": 0.0007109209780628601,
    "bleu3": 0.00011315787862689773,
    "bleu4": 4.519513517624602e-05,
    "bertscore_precision": 0.3337398171424866,
    "bertscore_recall": 0.45924198627471924,
    "bertscore_f1": 0.38655954599380493
  }
}