{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Got2b Glued Spray Wax with 2-in-1 Dual Nozzle, 8 oz\nReview Date: 2021/05/25\nStore: Got2B\nProduct Description: ['The first dual-finish spray wax has officially hit the shelves! The got2b glued Spray Wax provides two looks with one product. So whether you want flexible texture or structured hold, this product has you covered! Best of all, this lightweight formula doesn’t leave your hair feeling sticky or crunchy. Create your own look and style. Turn to position 1 for flexible texture, turn to position 2 for structured hold. Be whoever you want 2b with got2b glued Spray Wax!']\nAverage Rating: 4.2\nProduct Details: {'Product Benefits': 'Firm Hold', 'Hair Type': 'All', 'Scent': 'Unscented', 'Liquid Volume': '8 Fluid Ounces', 'Item Form': 'Wax', 'Product Dimensions': '2 x 2 x 8.38 inches; 9.87 Ounces', 'Item model number': '31307', 'UPC': '017000313078', 'Manufacturer': 'AmazonUs/DIAW7', 'Country of Origin': 'USA'}\nReview Text: Great for styling your hair even better if you’re a cosplayer trying to style a spikey or unusual style wig. I use it to help set my curly wigs and keep them from becoming a hot mess. It’s very easy to use as it’s just a spray but you should set it with a hair dryer for best results. The scent is eh.\nReview Title: Great for cosplay\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "165G Jumbo Braiding Hair Blonde Synthetic Jumbo Braids 3 Packs\nUHair\n{'Package Dimensions': '13.94 x 6.69 x 3.74 inches; 1.19 Pounds'}\nI wanted to make my own Rapunzel wig but cwas dissatisfied with the cost from Arda you only get 1 for $10 plus shipping and I needed 3 of them. I got these 3 for half the cost I originally bought from Arda. I kept the Arda ones until these came in just to check quality and they’re literally the exact same thing. So I sent the Arda ones back. I think the wig came out beautifully and you can’t even tell this was 3 separate braids at one point. Definitely would buy again! I followed a tutorial I found on google to make the wig, then added my own touches by including the lights!\nPerfect base for Rapunzel Braids!\nCute Cartoon Makeup Brushes Set - 8pcs Fairy Makeup Brushes with Soft Pink Fiber and Metallic Handle for Eyebrow, Eyeshadow, Foundation, Blending and Lips, Great Gift for Sister Girlfriend (Style B)\nrongji jewelry\n{'Brand': 'rongji jewelry', 'Recommended Uses For Product': 'Face Makeup', 'Color': 'Pink', 'Material': 'Synthetic', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '8', 'Age Range (Description)': 'Adult,Teen', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '8.2 x 3.8 x 1.3 inches; 5.75 Ounces', 'UPC': '745695122377'}\nVERY sturdy brushes. I was completely thrown at how sturdy/heavy these brushes are. I was totally expecting cheap light plastic handles that would break easily but that isn’t the case at all. The bristle portion of them is nice to because they’re not to thick or thin, easy to clean, and don’t shed off. Super cute Designs, I know who bts is but I’m not like a super fan or own any of their music to be honest but they definitely have quality merch as proven by these brushes. I don’t really care for the bag they came in, it’s nice enough but feels cheap in comparison to the brushes themselves. I just have them in my makeup bag instead.\nVery good quality\nForfeels Long Straight Black Wig Synthetic Wigs for Women Natural Middle Part Lace Wig Heat Resistant Fiber Natural Looking Wig (30inch, Black Color)\nforfeels\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Forfeels', 'Package Dimensions': '9.33 x 6.34 x 2.36 inches; 10.58 Ounces', 'UPC': '791262892525'}\nNot a lace front wig. I wouldn’t even consider it a partial lace front. The only place it had lace was right at the part. It’s not a horrible or even bad wig. But it’s not a lace front. The fibers were soft but did shed. It’s comfortable enough to wear, but a little tight if you already have a lot of hair going under it. Can’t recommend it to any cosplayers out there looking at this for a costume, I think styling it may be hard with the way it’s wefted and fact it’s not actually a lace front if that’s what you’re looking for.\nNot actually a lace front wig\nCortex International Black Series Duo Platinum 1.25-Inch & 0.5 Inch Travel Size Gemstone Infused Ceramic Plates Duet Flat Iron (Rose Wood)\nCortex\n{'Shape': 'Round', 'Brand': 'Cortex', 'Hair Type': 'Dry, Curly, Straight', 'Material': 'Wood,Ceramic', 'Power Source': 'Corded Electric', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.19 x 4.13 x 3.98 inches; 2.2 Pounds', 'Item model number': 'CTX-DUO-125RW', 'UPC': '819804020950', 'Manufacturer': 'International'}\nThe color is great, the actual product not so much and not worth the price. You could easily buy a better one at big lots for less then half the cost. The full size definitely did not get as hot as it should have and didn’t retain the heat. It wouldn’t straighten my hair. The mini got to temp but would take you forever to do your whole head. It was not as wide as described, the mini is more like a bangs straightener then a mini straightener which is fine for baby hairs and of course bangs. Over all a disappointment given I like the color so much. I’ll be tossing the full size but keeping the mini.\nDoesn’t get to or hold temp\nLeuxe Facial Cleansing Brush, IPX6 Waterproof Rotating Face Brush for Deep Cleansing, 3 Modes and Smart Timer\nleuxe\n{'Brand': 'leuxe', 'Power Source': 'electric', 'Product Benefits': 'Softening,Pores,Cleansing', 'Skin Type': 'All', 'Operation Mode': 'Automatic', 'Package Dimensions': '6.2 x 4 x 2.7 inches; 11.99 Ounces', 'UPC': '631517347748', 'Manufacturer': 'leuxe'}\nSuper easy to hold and use, came in great packaging, and works really well! My only complaint would be that it adds yet another recharging product to my life and I wish it came with a docking system so I could always be charging it rather then a cube/cord combo I have to remember to plug in. I don’t use it every day, every other but it works well with my daily routine when I do.\nIt works!\n24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nAILIWEI\n{'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nNice color and length, with some styling I think this could look very natural. It sheds a bit so I recommend a good brushing with a wig brush. Overall a very good quality wig for the price. Standard wig cap so on larger heads may feel tight.\nNice and natural\nJuziviee Brown Wigs for Women, 13'' Short Brown Bob Wig with Bangs, Natural Looking Soft Synthetic Hair Wig, Cute Wigs for Party Cosplay Halloween AD016BR1\nJuziviee\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Straight', 'Special Feature': 'Heat Resistant', 'Brand': 'Juziviee', 'Package Dimensions': '11.02 x 7.48 x 1.73 inches; 6.7 Ounces', 'UPC': '824381921644'}\nA nice affordable option for cosplayers that need a very blunt style wig and don’t want to style something themselves. To me some spots on the back could be a little more wefted/thicker but it never shows the wig cap so it’s not too thin. Wig cap is a good fit/size with good stretch making it comfortable to wear\nA good fit\nSHINYSHOW 14'' Women's Party Wig Short Wavy Wig with Bangs Synthetic Cosplay Wig Average Size (Fresh Blue)\nSHINYSHOW\n{'Hair Type': 'Wavy', 'Brand': 'SHINYSHOW', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.98 x 8.46 x 2.09 inches; 8.47 Ounces'}\nCute but a little on the thin side, I wish it had been just a bit longer in length. For the price it’s not a bad budget friendly cosplay option. I used it for a casual catbug cosplay for a zoom event. The wig cap in my opinion felt a bit small and gave me a headache after 2 hours. It’s not super thick but wasn’t so thin you saw the cap either.\nCute\nAltaba Long Wavy Wigs Ombre gray Wig Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult', 'Material Feature': 'Heat Resistant', 'UPC': '788436507620'}\nThis ombré style is more like bad roots for days in need of a dye job immediately. I feel like mine was almost all dark with the ends being light. I can’t recommend it because you don’t really get what’s pictured. It’s ok otherwise, almost on the verge of being a Halloween level wig. It’s not as thick as you’d like it to be but not thin enough you’re seeing the wig cap. The wig cap is the standard size so it’s not to small or tight but mine sat weird and tried to bubble a bit on my head. It had to be left on a wig head inside out for days to correct it. I feel like you could easily find this in another brand but better.\nKind of cheap looking\n28 inch Long Blonde 613 Wig Long Body Wavy Synthetic Wig Natural Looking Hair Replacement Wigs Blonde 613 Glueless Heat Resistant Fiber Wig\nALIABSION\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Special Feature': 'Glueless', 'Brand': 'ALIABSION', 'Age Range (Description)': 'Adult', 'Item model number': 'SW-Wigs-613#', 'UPC': '779303844085'}\nOther then it not having bangs I thought this wig was rather nice. Perfect for Victorian era vampire costumes for sure with the cut and wave along with the color. Overall I’m very pleased with it. It’s got good thickness and the wig cap was comfortable to wear.\nVictorian Vampires\nJGMI Wig 613 Lace Front Wig Human Hair 13x4 Blonde Wig Straight Wave Brazilian Virgin Human Hair Pre Plucked with Baby Hair 150 Density 18 Inch\nJGMI\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Brand': 'JGMI', 'Age Range (Description)': 'Adult'}\nDefinitely not as long as it’s pictured to be. I would say at most it’s shoulder length. I’m also not sure if it’s actually human hair? It looks more natural then my other wigs but it doesn’t feel much different than synthetic. Way over priced for what you’re getting if it’s not real human hair and the style it is is not great. I’m honestly not even sure where to begin working this into a natural looking style because it seems it can only be worn as is. The color is very nice though.\nNot sure about this one\nGot2b Glued Spray Wax with 2-in-1 Dual Nozzle, 8 oz\nGot2B\n['The first dual-finish spray wax has officially hit the shelves! The got2b glued Spray Wax provides two looks with one product. So whether you want flexible texture or structured hold, this product has you covered! Best of all, this lightweight formula doesn’t leave your hair feeling sticky or crunchy. Create your own look and style. Turn to position 1 for flexible texture, turn to position 2 for structured hold. Be whoever you want 2b with got2b glued Spray Wax!']\n{'Product Benefits': 'Firm Hold', 'Hair Type': 'All', 'Scent': 'Unscented', 'Liquid Volume': '8 Fluid Ounces', 'Item Form': 'Wax', 'Product Dimensions': '2 x 2 x 8.38 inches; 9.87 Ounces', 'Item model number': '31307', 'UPC': '017000313078', 'Manufacturer': 'AmazonUs/DIAW7', 'Country of Origin': 'USA'}\nGreat for styling your hair even better if you’re a cosplayer trying to style a spikey or unusual style wig. I use it to help set my curly wigs and keep them from becoming a hot mess. It’s very easy to use as it’s just a spray but you should set it with a hair dryer for best results. The scent is eh.\nGreat for cosplay",
  "profile": "The user continues to exhibit a strong passion for crafting and beauty, particularly in custom hairstyling and wig-making. Their recent purchase reflects a keen interest in versatile styling products that aid in achieving specific looks, particularly for cosplay purposes. They value convenience and ease of use, highlighting their preference for products that simplify the styling process without compromising on outcomes.\n\nDespite previous concerns regarding wig authenticity and quality, this interaction illustrates a willingness to explore new products that align with their creative endeavors. They demonstrate a critical approach to evaluating product effectiveness, focusing on practicality and results rather than merely aesthetics. The user remains invested in achieving optimal styling for their wigs, emphasizing precision and durability in their choices.\n\nMoreover, their ongoing appreciation for detailed reviews showcases a commitment to informed decision-making and a desire for reliability in the products they select. While they maintain a critical eye towards pricing and value in terms of quality, this latest engagement underlines their adaptability and ongoing exploration of solutions that facilitate their unique beauty expressions, especially in cosplay contexts. Ultimately, the user balances their aesthetic standards with practical functionality, reflecting a nuanced approach to beauty that prioritizes both creativity and quality.",
  "metrics": {
    "rouge1_f": 0.08516886930983847,
    "rouge2_f": 0.0029397354238118564,
    "rougeL_f": 0.05188448360254527,
    "meteor": 0.028407756961074327,
    "bleu1": 2.6742439364378978e-05,
    "bleu2": 6.736101971654105e-06,
    "bleu3": 1.0883277438775718e-06,
    "bleu4": 4.379622919615335e-07,
    "bertscore_precision": 0.3159993290901184,
    "bertscore_recall": 0.4561387002468109,
    "bertscore_f1": 0.37335172295570374
  }
}