{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/11/22\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English'], 'Directors': ['Zack Snyder'], 'Producers': ['Deborah Snyder'], 'Starring': ['Ben Affleck', 'Amy Adams', 'Gal Gadot'], 'Studio': ['WARNER HOME VIDEO']}\nReview Text: Justice League<br /><br />First Thoughts:<br /><br />If you want to be entertained and better yet know something about DC Comics, you will have a fun time watching Justice League.<br /><br />Story & Plot:<br /><br /> Batman and Wonder Woman are trying to put a team together to fight a battle with an invader coming to take over the Earth.  A good third of the film involves Batman recruiting these players and though somewhat spoiled by the trailers of late, makes for an interesting start to the film.<br /><br /> I really wish they gave more info on the characters they’re picking up for those who know nada about comics.<br /><br /> Aquaman, never got the respect he deserved in the comics.  He’s brunette rather than the blonde guy we knew, but Jason Moma (“Stargate”) makes a bad ass Aquaman.  Teasers included showing Atlantis and a cameo of Mera.  We even get to see her flex her muscle with her water powers.<br /><br /> Almost nothing on Atlantis, why it’s important, who Mera is, etc.  I can see an uneducated audience would puzzle on that.<br /><br /> Cyborg, an unknown in a lot of circles, who is part machine, part man.  We see some relationship with his father who saved his life, conflicting emotion – Am I a freak or a hero?  How will I fit in?  Cyborg struggles with this which I thought was a great plot line but then it was not followed up!  Could have spent more time on this.<br /><br /> Ben Affleck’s Batman delivers and his acting and his hot Batmobile and tricks you never tire of him.<br /><br /> Wonder Woman is her usual personable self, a woman who doesn’t put up with the bad guys, and knows Amazon fighting skills and bouncing bullets off her bracelets that’s cool to watch.<br /><br /> The Flash is the most enjoyable character.  He is the viewpoint of the audience, enamored to work with such powerful people, and though he “doesn’t have friends” fits in well with the group.  He represents the hero worshipped kid we all would experience if we were in his shoes.<br /><br /> The way they brought Superman back (that’s not a spoiler, that’s a given) differed greatly from the comics – I guess I was expecting something more spiritual or going to the Fortress in the North to do it.<br /><br />Final Thoughts:<br /><br /> Yes there are fights, explosions and CGI.  But there is also a decent plot that carries through well.<br /><br /> Not perfect.  Why use Steppenwolf?  But the mid and end credit scenes portend a much better future for Justice League II.<br /><br /> Remember, Star Trek the Movie was dull but the second one was awesome.  Let’s hope history repeats itself!<br /><br /> Recommended.\nReview Title: Epic Team-Up of the Anticipated Release of DC's Newest Movie!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joss Whedon'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr.', 'Chris Hemsworth', 'Mark Ruffalo'], 'Studio': ['Marvel']}\nThe Avengers: Age of Ultron<br /><br />First Impressions:  Full of action, pathos and humor, not canon but I didn’t care.<br /><br />Storyline:<br /><br />Basically Tony Stark comes up with a perfect machine capable of protecting the Earth.  Or so he hopes.  By sarcastically saying “peace in our time” (alluding to the same phrase spoken by Chamberlain as he signed a non-aggression treaty with Hitler in 1938 – we know how that went down!) Ultron clicks on it and finds that Man, full of the lust of war and greed, decides he will bring that kind of peace, too – the quiet of a graveyard!<br /><br />Special effects:  Great stuff with Jarvis and Ultron.  Even the colors contrasted well!  The banter scripted was at times annoying as Jarvis slowly (too slowly to save himself) realizes Ultron, coming online faster than anyone realized, begins assimilating Jarvis!  Yikes!<br /><br />Evil large supply of robots built by Ultron, flying through the sky.  Only one instance of an exploding fireball.  Always must include one fireball in these kinds of films.<br /><br />Pathos:  The beautiful sadness of Bruce Banner and Black Widow (yikes, what would Kirby say?) was a bit maudlin and sad.  Your girlfriend would probably like this part.  It was “OK.”<br /><br />Revenge:  The whole film was based to a greater or lesser degree on revenge.  Is revenge a good enough motivation for killing?  Only Scarlet Witch and Quicksilver can answer that.<br /><br />Take Over the World:  There’s always an element like that.  Love how the origin of the Vision has changed to a Stark/Ultron hybrid who has none of Stark’s smart-aleck jokes, nor Ultron’s death wish.  Vision was the most under-rated character of this film as he brings the team together.<br /><br />Credit Scene:  In this film, the credit scene is in the middle of the credits, not the end.<br /><br />Final Words:<br /><br />Whedon did a great job putting this together.  He gave just enough to the fan boys to make us wanting more; he appealed to a general audience that does not read comic books (Muggles); and he didn’t overdo it on the special effects.<br /><br />Pro: Dream sequences and Easter eggs.  See the Roy Thomas Band in Cap’s dream?<br />Con: Tony Stark’s bad jokes; Hawkeye’s scenes slowed the film considerably.<br />Great: Stan Lee Cameo!  Iron-man’s Hulk-buster!<br />Not so Great: No Pepper Potts!  Wait until the year 2018 for an Infinity Gauntlet!<br /><br />Recommended from this DC fan!\nWhedon Does the Avengers Proud!  Review from a DC Fan!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Don Medford'], 'Producers': ['Mort Abrahams'], 'Starring': ['Leslie Nielson', 'Virginia Vincent', 'Robert Middleton']}\nLeslie Nielson was a character actor in the '50s, not anything like his comedy films of later decades.  He's a bit over the top in this anthology of stories, predating Twilight Zone and not nearly as good.<br /><br />He plays a guy who has just committed a murder and wants out.  A devilish man offers him a way out by going back in time and reliving 7 years.  We never see the 7 years relived, just the last scene where he commits the same murder, saying almost the same words.  Fails for me since the TV episode says basically 'don't ask what you wish for' and 'Fate is unchanging' and a bit of a downer.\nFair Attempt at Horror\nBatman v Superman: Dawn of Justice, Ultimate Edition\nZack Snyder  (Director),     Ben Affleck  (Actor),     Henry Cavill  (Actor)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Batman v Superman: Dawn of Justice (Ultimate Edition Blu-ray + Theatrical Blu-ray)', 'The extended cut of “Batman v Superman: Dawn of Justice” includes 30 more minutes of story and action not seen in theaters! Also includes the Theatrical Version of the film plus over 2 hours of bonus content. From director Zack Snyder comes “Batman v Superman: Dawn of Justice,” starring Ben Affleck as Batman/Bruce Wayne and Henry Cavill as Superman/Clark Kent in the characters’ first big-screen pairing. Fearing the actions of a god-like Super Hero left unchecked, Gotham City’s own formidable, forceful vigilante takes on Metropolis’s most revered, modern-day savior, while the world wrestles with what sort of hero it really needs. And with Batman and Superman at war with one another, a new threat quickly arises, putting mankind in greater danger than it’s ever known before.', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC, Blu-ray, Subtitled', 'Contributor': 'Charles Roven, Amy Adams, Ray Fisher, Henry Cavill, Diane Lane, Jeremy Irons, Callan Mulvey, Wesley Coller, David S. Goyer, Geoff Johns, Jason Momoa, Scoot McNairy, Jesse Eisenberg, Chris Terrio, Tao Okamoto, Deborah Snyder, Zack Snyder, Laurence Fishburne, Ben Affleck, Gal Gadot, Holly HunterCharles Roven, Amy Adams, Ray Fisher, Henry Cavill, Diane Lane, Jeremy Irons, Callan Mulvey, Wesley Coller, David S. Goyer, Geoff Johns, Jason Momoa, Scoot McNairy, Jesse Eisenberg, Chris Terrio, Tao Okamoto, Deborah Snyder, Zack Snyder, Laurence Fishburne, Ben Affleck,…   See more', 'Initial release date': '2016-07-19', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Digital Copy Expiration Date': 'December 31, 2019', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 4.16 Ounces', 'Item model number': 'batman-v-superman-dawn-of-justice', 'Director': 'Zack Snyder', 'Media Format': 'NTSC, Blu-ray, Subtitled', 'Run time': '3 hours and 2 minutes', 'Release date': 'July 19, 2016', 'Actors': 'Ben Affleck, Henry Cavill, Amy Adams, Jesse Eisenberg, Diane Lane', 'Subtitles': 'Spanish, English, French, Portuguese, Thai', 'Producers': 'Charles Roven, Wesley Coller, Deborah Snyder, Geoff Johns, David S. Goyer', 'Studio': 'Studio Distribution Services', 'Writers': 'Chris Terrio, David S. Goyer', 'Number of discs': '3'}\nFirst Impressions:<br /><br />Definitely a boy/man film.  Angst, excitement, personal conflict, personal conviction, the specific material recognized by any DC fan (Death of Superman, Dark Knight Returns), and a psychotic Lex Luthor who is nearly on par with the Joker!<br /><br />Story and Plot:<br /><br />The beginning of the show with Batman’s origin was really well done, the criminal (Joe Chill?) ruthless; Dad steps in front of his wife and child ready to do whatever it takes to protect them; Bruce running away and falling into a pit – a pit of bats!  Holy Flashback!<br /><br />Batman’s brooding is further enhanced by Lex Luthor, a rich brat who is also a scientific genius, who plays Superman and Batman against each other, via their “secret” identities to get them both riled up to where they want to kill each other. And let’s not forget the pawns in the chessgame – Lois Lane and Superman’s mother, Martha Kent.<br /><br />The whole terrorist theme was well-played, and a beautiful yet explosive car chase showing us what the Batmobile is capable of.<br /><br />Alfred, played by another, more sarcastic character than in earlier Batman films, really knew his stuff and as well confided in Batman and steered him when the Bats was losing his fight with the Belfrey, if you know what I mean.<br /><br />And Superman, conflicted.  Is he worshiped as a god, or is he an alien menace, or just a man who wants to do what is right.  The conversation with his Dad (Kevin Costner especially poignant acting) and the calming base of his mother, Martha (played with conviction by actress Diane Lane) come together in a mix of emotion, love, and heartache.  Quite nice!<br /><br />Final Thoughts:<br /><br />A movie worth watching.  The flashbacks Batman was experiencing while playing back Luthor’s drive were a bit confusing, but overall Affleck’s Batman was characterized in a way that would make writer Frank Miller proud.  The conflicted version of Superman was more real and down to earth a portrayal.  And the excitement &amp; power of Gadot as Wonder Woman made me want a solo film of her so much more.<br /><br />Well done to Zach Snyder, cast and crew!<br /><br />CAST<br />Henry Cavill ... Clark Kent / Kal-El / Superman<br />Amy Adams ... Lois Lane<br />Diane Lane ... Martha Kent<br />Laurence Fishburne ... Perry White<br />Ben Affleck ... Bruce Wayne / Batman<br />Gal Gadot ... Diana Prince / Wonder Woman<br />Jesse Eisenberg ... Lex Luther<br />Holly Hunter ... U.S. Senator<br />Callan Mulvey<br />Tao Okamoto ... Mercy Graves<br />Jeremy Irons ... Alfred<br />Scoot McNairy<br />Ray Fisher ... Victor Stone / Cyborg<br />Jason Momoa ... Aquaman\nMust Watch!\nCOLDITZ: Escape of the Birdmen - A Timeless Media Group Exclusive!\nRichard Basehart  (Actor),     Chuck Connors  (Actor),     n/a  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['*Based on a true WWII story, this made-for-television thriller was NBC Movie of the week in 1971 *Stars Chuck Connors, Doug McClure, Richard Basehart & Rene Auberjonois.']\n{'Genre': 'Military & War/World War II, Military & War/Drama', 'Format': 'Full Screen, NTSC, Color, Multiple Formats, Dolby', 'Contributor': 'n/a, Tom Skerritt, Chuck Connors, Max Baer Jr., Rene Auberjonois, Richard Basehart', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '17542256', 'Media Format': 'Full Screen, NTSC, Color, Multiple Formats, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'July 26, 2011', 'Actors': 'Richard Basehart, Chuck Connors, Max Baer Jr., Tom Skerritt, Rene Auberjonois', 'Studio': 'Shout! Factory / Timeless Media', 'Number of discs': '1'}\nThis made for TV movie was pretty good for network television.<br /><br />Based on true events, the Escape of the Birdmen was in some ways a watered down Hogan’s Heroes where the commandant (Basehart) and the major (Doug McClure) have a mutual understanding and this is not played often enough.  I really liked their cat & mouse conversations.<br /><br />Doug’s character has to get this scientist across the border and back to the UK for research that will create a weapon that will “end the war”, implying the USA’s Manhattan Project and atomic research.<br /><br />Old favorite character actors such as Rene (whom I remember from Star Trek:Deep Space Nine) and Max (from Beverly Hillbillies) with a very odd moustache, and finally Chuck Connors (one of the best Western actors on television at that time).<br /><br />Final Thoughts:<br /><br />Was not as exciting as I remember.  The theme song is played pretty much throughout the film.  Would have been nice to have some musical variety of soundtrack.  Richard Basehart (of Voyage to the Bottom of the Sea) makes a convincing Nazi (and he also played in a film called ‘Hitler’).<br /><br />Overall a good entry into network TV.<br /><br />The DVD has no extras, just the movie.\nGlider to Freedom\nSideways (Widescreen Edition)\nPaul Giamatti  (Actor),     Thomas Haden Church  (Actor),     Alexander Payne  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', \"A divorced school teacher, and failed author, joins up with his buddy who is about to get married and head to wine country for a week of male bonding and wine tasting. What starts out as a whimsical trip to mark the coming milestone in his friend's life quickly dissolves into philosophical discussions and poignant debate. By the end of the week, neither man is convinced that they are on the right track.\", 'Amazon.com', 'With', 'Sideways', ', Paul Giamatti (', 'American Splendor', ',', 'Storytelling', ') has become an unlikely but engaging romantic lead. Struggling novelist and wine connoisseur Miles (Giamatti) takes his best friend Jack (Thomas Haden Church,', 'Wings', \") on a wine-tasting tour of California vineyards for a kind of extended bachelor party. Almost immediately, Jack's insatiable need to sow some wild oats before his marriage leads them in into double-dates with a rambunctious wine pourer (Sandra Oh,\", 'Under the Tuscan Sun', ') and a recently divorce waitress (Virginia Madsen,', 'The Hot Spot', \")--and Miles discovers a little hope that he hasn't let himself feel in a long time.\", 'Sideways', 'is a modest but finely tuned film; with gentle compassion, it explores the failures, struggles, and lowered expectations of mid-life. Giamatti makes regret and self-loathing sympathetic, almost sweet. From the director of', 'Election', 'and', 'About Schmidt', '.', '--Bret Fetzer', 'On the DVD', 'Stars Paul Giamatti and Thomas Haden Church have an absolute blast on their commentary track, gleefully ripping themselves, fawning over \"La Madsen,\" and recalling \"that bad fake wine we had to drink a lot of.\" Director Alexander Payne dismisses the seven deleted scenes (about 17 minutes total) as \"meager offerings,\" and it\\'s true that there are no gems. But even better than the scenes themselves might be Payne\\'s text introductions, which offer insight into his editing process. Each scene is surrounded by brief bits from the finished film to provide context, which should be done more often. The 6-minute making-of featurette is better than most because it spends less time on self-promotion and plot summary.', '--David Horiuchi', 'Stills from', 'Sideways', '(Click for larger image)']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Peter Dennis, Stephanie Faracy, Joe Marinelli, Sandra Oh, Chris Burroughs, Shaun Duke, Robert Covarrubias, Paul Giamatti, Missy Doty, Lee Brooks, Alysia Reiner, Jessica Hecht, Toni Howard, M.C. Gainey, Virginia Madsen, Rev. Fr. Khoren Babouchian, Patrick Gallagher, Alexander Payne, Shake Tukhmanyan, Thomas Haden Church, Marylouise BurkePeter Dennis, Stephanie Faracy, Joe Marinelli, Sandra Oh, Chris Burroughs, Shaun Duke, Robert Covarrubias, Paul Giamatti, Missy Doty, Lee Brooks, Alysia Reiner, Jessica Hecht, Toni Howard, M.C. Gainey, Virginia Madsen, Rev. Fr. Khoren Babouchian, Patrick Gallagher, Alexan…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 6 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'FXSE2227579DVD', 'Director': 'Alexander Payne', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 6 minutes', 'Release date': 'April 5, 2005', 'Actors': 'Paul Giamatti, Thomas Haden Church, Virginia Madsen, Sandra Oh, Marylouise Burke', 'Dubbed': 'French, Spanish, English', 'Subtitles': 'English, Spanish, French', 'Studio': 'Fox Searchlight', 'Number of discs': '1'}\nUpdate:<br /><br />Sorry that some didn't like my review, but frankly it was a bad movie.  It's only my opinion.<br /><br />About a wine connoisseur who goes on a weekend wine trip with his friend Jack.  Except Jack is getting married and wants to cheat on his fiance.  Jack gets into all sorts of trouble when doing this and pulls Miles into the fray as well.<br /><br />Miles is an insecure wine lover who takes anti depressants and gets drunk whenever he thinks about his two year old divorce, especially when he finds out his ex is getting married.  His friend Jack is a pig who gets girls into bed with him with disasterous results!<br /><br />Overall, good cinematography and you learn a lot about the wine industry, but the unneeded sex images and the clearly immoral Jack make for a tough watch.  The ending is sweet though, so worth one watch.\nShould Be Called Wino & Pig\nStar Trek Beyond (BD/DVD/Digital HD Combo)\nChris Pine  (Actor),     Zachary Quinto  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['\"Star Trek Beyond,\" the highly anticipated next installment in the globally popular Star Trek franchise, created by Gene Roddenberry and reintroduced by J.J. Abrams in 2009, returns with director Justin Lin (“The Fast and the Furious” franchise) at the helm of this epic voyage of the U.S.S. Enterprise and her intrepid crew. In “Beyond,\" the Enterprise crew explores the furthest reaches of uncharted space, where they encounter a mysterious new enemy who puts them and everything the Federation stands for to the test.']\n{'Genre': 'Action/Adventure, Sci-Fi', 'Format': 'Digital, Blu-ray, DVD', 'Contributor': 'Anton Yelchin, John Cho, Karl Urban, Zoë Saldana, Idris Elba, Chris Pine, Simon Pegg, Zachary Quinto, Sofia BoutellaAnton Yelchin, John Cho, Karl Urban, Zoë Saldana, Idris Elba, Chris Pine, Simon Pegg, Zachary Quinto, Sofia Boutella   See more', 'Language': 'English', 'Runtime': '2 hours and 2 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '43381879', 'Media Format': 'Digital, Blu-ray, DVD', 'Run time': '2 hours and 2 minutes', 'Release date': 'November 1, 2016', 'Actors': 'Chris Pine, Zachary Quinto, Simon Pegg, Zoë Saldana, John Cho', 'Dubbed': 'French, Portuguese, Spanish', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '2'}\nStar Trek Beyond<br /><br />First Thoughts:<br /><br />Loved the opening scenes with the Enterprise getting some docking time at the newest Starbase that fits one million people!<br /><br />Special effects were great without being overwhelming.  Director Justin Li (Fast & Furious 6) kept the lens flares to minimum.<br /><br />Chris Pine is growing into his Kirk role.  He really got the Shatner vibe down and adds his own flair to it.<br /><br />As I have enjoyed in Trek over the last four decades, the character-driven characters, the relationship between Spock & Kirk as they come to grips with not only the possibility of their breaking up and taking other opportunities but also to do the standard save-the-universe story with some original twists.<br /><br />Details:<br /><br />Love the details.  What would the 25th century use as phones?  Would they consider our current hard rock music “classical”?  Right down to the make-up, the costumes, the occasional cars & trains, all makes for a world as real as Roddenberry could have envisioned.<br /><br />It’s a story of revenge, of greed, and of sacrificing others so that you may achieve immortality.  Or so it seems.<br /><br />Action:<br /><br />The movie is a bit too fast paced, and gets to the action pretty quick with just a bit of backstory and set-up.  It got a bit too fast for me, so I had to rewind and make sure I didn’t miss anything.  Illusion weaponry and clever dealings with the bad guy makes this a tough world for Kirk!<br /><br />Final thoughts:<br /><br />Tributes to Leonard Nimoy and Anton Yelchin (played Chekov, and recently died in a freak home accident) were touching without being maudlin.  And yes, this film is much better than the other two.  Looking forward to more!<br /><br />DVD:  The DVD, not blu-ray, was devoid of features, just your basic set up of chapters, episodes and future feature film trailers.  If you want a better experience, might be worth it to get the blu-ray set!\nNimoy Would Have Loved This Film -- He's In It!\n{'Audio languages': ['English', 'Español (Latinoamérica)'], 'Subtitles': ['English', 'English [CC]', 'Español (Latinoamérica)', 'Español (Latinoamérica) [CC]'], 'Directors': ['Gareth Edwards'], 'Producers': ['Kathleen Kennedy', 'Allison Shearmur', 'Simon Emanuel'], 'Starring': ['Felicity Jones', 'Diego Luna', 'Ben Mendelsohn'], 'Studio': ['Lucasfilm']}\nFirst Thoughts:<br /><br />I already knew a bit of the plot, but it is great to see new characters and new adventures that wrap up the what and the why of how someone &#34;gets&#34; to be a Rebel, why you'd want to and how sometimes it's a one-way journey!<br /><br />The story is a positive one:  a girl who loses her family at an early age discovers her father is an Imperial Engineer in the construction of the dreaded Death Star.  These events happen while Luke is still hanging out on Tatooine making his moisture farm work.  Who whodathought?<br /><br />We get some cameos of R2D2 and C3PO and even an unwinnable Rebel battle against the Empire on an Imperial-owned planet, to get the plans (as mentioned in A New Hope).  The graphic violence and characters we'd begun to know all pretty much make the final sacrifice to get the plans to the Princess to make Luke possible.<br /><br />Overall, an excellent entry in the Star Wars mythos.  Highly recommended!\nPutting the 'War' Back In Star Wars!  (*minor spoilers*)\n{'Content advisory': ['Foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Theodore Melfi'], 'Producers': ['Donna Gigliotti', 'Peter Chernin', 'Jenno Topping', 'Pharrell Williams', 'Theodore Melfi'], 'Starring': ['Taraji P. Henson', 'Janelle Monae', 'Kevin Costner'], 'Studio': ['20th Century Fox']}\nHidden Figures<br /><br />First Thoughts:  Love the title of this film, such a play on words.  “Hidden”, unknown.  “Figures”, as the women in the film are experts in math and numbers.  And “figures” as in notable persons.<br /><br />Story:<br /><br /> The film covers several themes which I found fascinating.  I’ve always loved NASA’s early space program and even what they’re accomplishing now, regardless of government cut-backs they still make something happen:  flyby of Saturn, discoveries on Pluto, and landing on the Moon often which no nation has yet accomplished.<br /><br /> But the historic backdrop is blurred by the underlying racial prejudice of those times, in the South, in the state of Virginia.<br /><br /> Separate sections in the library for whites and “coloreds”.  Separate bathrooms, waterfountains, busses, etc. etc.  This was in the 1960s as Dr. King was calling for equal rights among all races.<br /><br /> The characters in our play are confronting these sitauations daily and it’s fascinating watching them counteract each, as their counterparts tell them that “that’s the way it is!”<br /><br /> The film is based on actual occurrences.<br /><br /> The acting was superb.  The personal sidenotes, such as the proposal of a man to one of the ladies was cute and you’re pretty cold-hearted if you shed no tear!<br /><br />Final Thoughts:  If you want to see why the USA’s space program, after many failures, finally beat the Russians and achieved winning the Space Race, and how a prejudiced South was not enough to dissuade three amazing Black women in overcoming these obstacles, pick this up!<br /><br />DVD has great features and is a must-watch.<br /><br />Highly Recommended.\nExcellent Film, Insightful Message\nWonder Woman [Blu-ray]\nPatty Jenkins  (Director),     Gal Gadot  (Actor),     Chris Pine  (Actor)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Wonder Woman', 'Before she was Wonder Woman, she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when an American pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside man in a war to end all wars, Diana will discover her full powers…and her true destiny.']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, NTSC', 'Contributor': 'Charles Roven, Richard Suckle, Ewen Bremner, Jon Berg, Connie Nielsen, Robin Wright, Wesley Coller, Patty Jenkins, Geoff Johns, Elena Anaya, Allan Heinberg, Jason Fuchs, Stephen Jones, Danny Huston, David Thewlis, Chris Pine, Deborah Snyder, Zack Snyder, Rebecca Steel Roven, Saïd Taghmaoui, Gal GadotCharles Roven, Richard Suckle, Ewen Bremner, Jon Berg, Connie Nielsen, Robin Wright, Wesley Coller, Patty Jenkins, Geoff Johns, Elena Anaya, Allan Heinberg, Jason Fuchs, Stephen Jones, Danny Huston, David Thewlis, Chris Pine, Deborah Snyder, Zack Snyder, Re…  See more', 'Initial release date': '2017-09-19', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'B0714QRG4Z', 'Director': 'Patty Jenkins', 'Media Format': 'Blu-ray, NTSC', 'Run time': '141 minutes', 'Release date': 'September 19, 2017', 'Actors': 'Gal Gadot, Chris Pine, Robin Wright, Danny Huston, David Thewlis', 'Producers': 'Charles Roven, Stephen Jones, Geoff Johns, Deborah Snyder, Jon Berg', 'Studio': 'Studio Distribution Services', 'Writers': 'Allan Heinberg, Zack Snyder, Jason Fuchs', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWonder Woman<br /><br />First thoughts:  The Wonder Woman film had enough info from the comics to keep comic fans glued to the silver screen and those who never heard of her a new look at the DC Universe.<br /><br />Plot & Story:<br /><br />I liked that this film began in World War I rather than II.  I guess we’re tiring of the Nazi character in WWII films and yet still wanted to have German evil genius at work.<br /><br />Themyscra – an island for women only – but their island is invaded by a man – following by a platoon of Germans!  The Amazons are true to the task with arrows buring air and finding targets.<br /><br />Diana goes out into the world of men with some funny results.  English fashion bears scrutiny of the goddess princess and her commentary on the way women (and secretaries) are treated give some much-needed comedy to avoid the dark, darkness of the last DC films.<br /><br />Who Ares the god of War is was a shock and I liked the misdirection.  The film was not predicable.  Loved that.<br /><br />World War I was known for its dangerous gasses that were released during those battles.  My grandfather fought at the front and so I know something of this.  Dr. Poison, a woman with a mission – there is more to her than the film leads on and I would have liked to see more of this character.<br /><br />Final Thoughts:  DC did a great job with pushing out this origin story.  Let’s hope they can top this with the Justice League film coming soon.<br /><br />Recommended!\nGal Gadot and Chris Pine Blew Me Away!\n{'Content advisory': ['Violence', 'alcohol use', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English'], 'Directors': ['Zack Snyder'], 'Producers': ['Deborah Snyder'], 'Starring': ['Ben Affleck', 'Amy Adams', 'Gal Gadot'], 'Studio': ['WARNER HOME VIDEO']}\nJustice League<br /><br />First Thoughts:<br /><br />If you want to be entertained and better yet know something about DC Comics, you will have a fun time watching Justice League.<br /><br />Story & Plot:<br /><br /> Batman and Wonder Woman are trying to put a team together to fight a battle with an invader coming to take over the Earth.  A good third of the film involves Batman recruiting these players and though somewhat spoiled by the trailers of late, makes for an interesting start to the film.<br /><br /> I really wish they gave more info on the characters they’re picking up for those who know nada about comics.<br /><br /> Aquaman, never got the respect he deserved in the comics.  He’s brunette rather than the blonde guy we knew, but Jason Moma (“Stargate”) makes a bad ass Aquaman.  Teasers included showing Atlantis and a cameo of Mera.  We even get to see her flex her muscle with her water powers.<br /><br /> Almost nothing on Atlantis, why it’s important, who Mera is, etc.  I can see an uneducated audience would puzzle on that.<br /><br /> Cyborg, an unknown in a lot of circles, who is part machine, part man.  We see some relationship with his father who saved his life, conflicting emotion – Am I a freak or a hero?  How will I fit in?  Cyborg struggles with this which I thought was a great plot line but then it was not followed up!  Could have spent more time on this.<br /><br /> Ben Affleck’s Batman delivers and his acting and his hot Batmobile and tricks you never tire of him.<br /><br /> Wonder Woman is her usual personable self, a woman who doesn’t put up with the bad guys, and knows Amazon fighting skills and bouncing bullets off her bracelets that’s cool to watch.<br /><br /> The Flash is the most enjoyable character.  He is the viewpoint of the audience, enamored to work with such powerful people, and though he “doesn’t have friends” fits in well with the group.  He represents the hero worshipped kid we all would experience if we were in his shoes.<br /><br /> The way they brought Superman back (that’s not a spoiler, that’s a given) differed greatly from the comics – I guess I was expecting something more spiritual or going to the Fortress in the North to do it.<br /><br />Final Thoughts:<br /><br /> Yes there are fights, explosions and CGI.  But there is also a decent plot that carries through well.<br /><br /> Not perfect.  Why use Steppenwolf?  But the mid and end credit scenes portend a much better future for Justice League II.<br /><br /> Remember, Star Trek the Movie was dull but the second one was awesome.  Let’s hope history repeats itself!<br /><br /> Recommended.\nEpic Team-Up of the Anticipated Release of DC's Newest Movie!",
  "profile": "**User Summary Update:**\n\n- **Genres:** Action, Science Fiction, Superhero, Horror, Military & War, Comedy, Biography\n- **Themes:** Humor, Pathos, Revenge, Team Dynamics, Fate, Historical Context, Racism, Perseverance\n- **Content Preferences:** The user continues to seek narratives with rich character development and emotional depth, now emphasizing a keen interest in superhero cinema that combines action with substantial storytelling. Their fascination with historical narratives addressing societal issues remains strong, particularly those focusing on race and gender.\n- **Style:** Strong preference for action interwoven with narrative depth and humor, especially critiquing weak character dynamics often found in superhero and military films.\n- **Character Preference:** Enjoys multifaceted characters, particularly those grappling with identity and societal prejudices, reflecting their internal conflicts and personal development.\n- **Interactions:** Engages with films that blend action sequences, psychological tension, and impactful character arcs while addressing social issues, such as the complexity of human relationships in superhero contexts.\n- **Cinematic Elements:** Values coherent storytelling and emotional resonance, focusing on personal and cultural challenges within both contemporary and superhero films.\n- **Directorial Influence:** Recognizes the importance of strong direction and scriptwriting in resonating with historical struggles.\n- **Viewing Experience:** Enjoys emotionally engaging films with well-rounded characters, appreciating humor and insightful commentary on societal norms, particularly in the context of teamwork and individual growth. \n\nThis updated profile reflects the user's recent engagement with character-driven narratives in the superhero genre alongside their established preferences.",
  "metrics": {
    "rouge1_f": 0.047311827956989246,
    "rouge2_f": 0.004302757676510854,
    "rougeL_f": 0.026979472140762465,
    "meteor": 0.014339967538095463,
    "bleu1": 2.528221530689957e-10,
    "bleu2": 8.622357517997574e-11,
    "bleu3": 3.799018716936846e-11,
    "bleu4": 1.7845411819685896e-11,
    "bertscore_precision": 0.38114139437675476,
    "bertscore_recall": 0.5430922508239746,
    "bertscore_f1": 0.44792771339416504
  }
}