{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Graydon Skincare - All Natural Face Glow Cream (1 fl oz / 30 ml)\nReview Date: 2016/04/13\nStore: Graydon Skincare\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Graydon Skincare', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '5.6 x 1.8 x 1.7 inches; 4 Ounces', 'UPC': '632709437322'}\nReview Text: This is a unique product. It provides some nice, light moisture and a nice shimmery glow that isn't overwhelming. It has natural sun protection, which I love since I live in Florida.\nReview Title: It provides some nice, light moisture and a nice shimmery glow that ...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Mukti Organics - Organic Rosehip Eye Gel\nBergoti\n{'Package Dimensions': '6.5 x 1.7 x 1.6 inches; 0.35 Ounces', 'UPC': '632709438824', 'Manufacturer': 'Bergoti'}\nSo far, so good. I've been using this for a week and I appear to have less puffiness and darkness. I like the smell...and the feel of it. I use it just at night.\nso good. I've been using this for a week and ...\nMukti Organics - Organic Balancing Foaming Cleanser\nMUKTI\n{'Item Form': 'Gel', 'Skin Type': 'Oily', 'Brand': 'MUKTI', 'Scent': 'Flame Tree', 'Material Feature': 'Organic', 'Package Dimensions': '7.9 x 2.8 x 2.7 inches; 15.2 Ounces', 'UPC': '632709438893'}\nVery nice! It's nice to have a cleanser with foaming action that cleans well but doesn't dehydrate. Smells great.\nFive Stars\nSkin Owl - Organic Eye+ (Nourishing + Youth Stimulating Eye Concentrate)\nS K I N OWL\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.5 x 2.5 x 1.6 inches; 3.2 Ounces', 'Item model number': 'SG_B012P4KUIU_US', 'UPC': '632709435410'}\nVery nice and CLEAN product, which is very important to me. At first I thought it would be a very light gel, but I was actually surprised at the richness of it. Even though it is rich, it doesn't feel heavy or goopy on the face. The smell is pleasant and very light. Cucumbers?\nRich but still light\nAHNESTI - Organic Utiliti Intuitive Hair Styling Gel\nAhnesti\n{'Scent': 'Aloe', 'Item Form': 'Gel', 'Brand': 'Ahnesti', 'Number of Items': '1', 'Unit Count': '6.0 Ounce', 'Package Dimensions': '6.5 x 2 x 2 inches; 0.35 Ounces'}\nThis was very nice for a natural gel. It worked well on my thick, dry, curly hair.\nFour Stars\nGraydon Skincare - All Natural Face Glow Cream (1 fl oz / 30 ml)\nGraydon Skincare\n{'Brand': 'Graydon Skincare', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '5.6 x 1.8 x 1.7 inches; 4 Ounces', 'UPC': '632709437322'}\nThis is a unique product. It provides some nice, light moisture and a nice shimmery glow that isn't overwhelming. It has natural sun protection, which I love since I live in Florida.\nIt provides some nice, light moisture and a nice shimmery glow that ...",
  "profile": "**User Summary:**\n\n- **Product Preference:** Displays a strong preference for organic and natural skincare products and is now expanding interest to effective hair styling solutions.\n- **Focus Areas:** Concentrates on addressing puffiness and dark circles around the eyes while integrating cleansing products suitable for oily skin. Recently added an interest in hair products catering to thick, dry, curly hair and enhancing the complexion with moisturizers that provide glow.\n- **Usage Patterns:** Follows a consistent nightly skincare routine combined with a growing focus on hair care, ensuring that cleansing methods remain a priority.\n- **Scent Appeal:** Enjoys pleasant, aromatic, and natural scents, with a newfound appreciation for botanical elements in both skincare and hair care products.\n- **Product Satisfaction:** Holds high standards for product efficacy, expressing positive experiences with items that deliver both sensory satisfaction and effective results for skin and hair.\n- **Review Trend:** Generally provides favorable feedback, particularly emphasizing products that offer immediate enjoyment alongside long-term benefits, now reflected in recent experiences with illuminating moisturizers.\n- **Brand Affinity:** Favors brands that prioritize organic and natural ingredients, solidifying a commitment to holistic beauty solutions for both skin and hair.\n\nOverall, the user exemplifies a dedicated approach to natural skincare and hair care, valuing product efficacy, sensory experiences, and continuous refinement of their routines for comprehensive beauty solutions.",
  "metrics": {
    "rouge1_f": 0.23050847457627122,
    "rouge2_f": 0.020408163265306124,
    "rougeL_f": 0.09152542372881356,
    "meteor": 0.10869565217391305,
    "bleu1": 0.12016230876417257,
    "bleu2": 0.035387647188994904,
    "bleu3": 0.019560800174098433,
    "bleu4": 0.013545986952225282,
    "bertscore_precision": 0.3639256954193115,
    "bertscore_recall": 0.4302625060081482,
    "bertscore_f1": 0.3943236172199249
  }
}