{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: AHNESTI - Organic Utiliti Intuitive Hair Styling Gel\nReview Date: 2016/02/01\nStore: Ahnesti\nAverage Rating: 4.1\nProduct Details: {'Scent': 'Aloe', 'Item Form': 'Gel', 'Brand': 'Ahnesti', 'Number of Items': '1', 'Unit Count': '6.0 Ounce', 'Package Dimensions': '6.5 x 2 x 2 inches; 0.35 Ounces'}\nReview Text: This was very nice for a natural gel. It worked well on my thick, dry, curly hair.\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Mukti Organics - Organic Rosehip Eye Gel\nBergoti\n{'Package Dimensions': '6.5 x 1.7 x 1.6 inches; 0.35 Ounces', 'UPC': '632709438824', 'Manufacturer': 'Bergoti'}\nSo far, so good. I've been using this for a week and I appear to have less puffiness and darkness. I like the smell...and the feel of it. I use it just at night.\nso good. I've been using this for a week and ...\nMukti Organics - Organic Balancing Foaming Cleanser\nMUKTI\n{'Item Form': 'Gel', 'Skin Type': 'Oily', 'Brand': 'MUKTI', 'Scent': 'Flame Tree', 'Material Feature': 'Organic', 'Package Dimensions': '7.9 x 2.8 x 2.7 inches; 15.2 Ounces', 'UPC': '632709438893'}\nVery nice! It's nice to have a cleanser with foaming action that cleans well but doesn't dehydrate. Smells great.\nFive Stars\nSkin Owl - Organic Eye+ (Nourishing + Youth Stimulating Eye Concentrate)\nS K I N OWL\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.5 x 2.5 x 1.6 inches; 3.2 Ounces', 'Item model number': 'SG_B012P4KUIU_US', 'UPC': '632709435410'}\nVery nice and CLEAN product, which is very important to me. At first I thought it would be a very light gel, but I was actually surprised at the richness of it. Even though it is rich, it doesn't feel heavy or goopy on the face. The smell is pleasant and very light. Cucumbers?\nRich but still light\nAHNESTI - Organic Utiliti Intuitive Hair Styling Gel\nAhnesti\n{'Scent': 'Aloe', 'Item Form': 'Gel', 'Brand': 'Ahnesti', 'Number of Items': '1', 'Unit Count': '6.0 Ounce', 'Package Dimensions': '6.5 x 2 x 2 inches; 0.35 Ounces'}\nThis was very nice for a natural gel. It worked well on my thick, dry, curly hair.\nFour Stars",
  "profile": "**User Summary:**\n\n- **Product Preference:** Maintains a strong inclination towards organic and natural skincare products, now expanding interest to include effective hair styling solutions.\n- **Focus Areas:** Continues to target puffiness and dark circles around the eyes while integrating cleansing products suitable for oily skin. Recently, has also shown interest in hair products that cater to thick, dry, curly hair.\n- **Usage Patterns:** Adopts a consistent, nightly skincare routine paired with a growing interest in hair care. Regular application of effective cleansing methods remains a priority.\n- **Scent Appeal:** Prefers pleasant, aromatic, and natural scents; enjoys a variety of subtle fragrance nuances, now including botanical elements found in hair products.\n- **Product Satisfaction:** Holds high standards for efficacy; recent experiences indicate a positive reception of products that deliver both sensory satisfaction and effective results, whether in skincare or hair care.\n- **Review Trend:** Generally provides positive feedback, with particular appreciation for products that combine immediate enjoyment with long-term effectiveness, now reflected in recent hair product interactions as well.\n- **Brand Affinity:** Favors brands that emphasize organic and natural ingredients, reinforcing a commitment to holistic skincare and hair care solutions.\n\nOverall, the user exemplifies a dedicated approach to both natural skincare and hair care, valuing product efficacy and sensory experiences while continually refining their routines to include comprehensive solutions for skin and hair.",
  "metrics": {
    "rouge1_f": 0.18687872763419483,
    "rouge2_f": 0.023952095808383235,
    "rougeL_f": 0.09145129224652089,
    "meteor": 0.12515370051615388,
    "bleu1": 0.1730196829505636,
    "bleu2": 0.054042269534326864,
    "bleu3": 0.03281523692835737,
    "bleu4": 0.02420467840712983,
    "bertscore_precision": 0.3815533518791199,
    "bertscore_recall": 0.43574947118759155,
    "bertscore_f1": 0.406854510307312
  }
}