{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Cucumber Eye Gel Card Sample Set of 6 Travel Size\nReview Date: 2017/07/22\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5 x 3.6 x 0.4 inches; 2.4 Ounces'}\nReview Text: This is the only product I have been disappointed in from Eminence.  I had a weird smell, like it's gone bad.  Everything else I've received, literally like 15 orders, has been amazing though.\nReview Title: Weird smell\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Heritage Store Rosewater & Glycerin Hydrating Facial Splash for Dry Combination Skin Care, Rose Water with Vegetable Glycerine for Dewy, Radiant Skin, Made Without Dyes or Alcohol, Vegan, 4oz\nHERITAGE STORE\n{'Brand': 'HERITAGE STORE', 'Item Form': 'Oil', 'Item Volume': '118 Milliliters', 'Scent': 'Rose', 'Special Feature': 'Vegan', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.75 x 1.75 x 5.25 inches; 4.16 Ounces', 'Item model number': '9013708', 'UPC': '076970443710 885810085979 885260190940 785923662909', 'Manufacturer': 'Heritage Store'}\nUsed to make setting spray. It's great.\nSmells great\nAnti Aging Moisturizer - The Best Moisturizer for Anti Wrinkle & Skin Tightening Night Cream. Tempt by Cazbe Skin Care Products Rejuvenate your youthful glow\nATOPAL\n{'Package Dimensions': '5.7 x 3 x 0.3 inches; 0.8 Ounces'}\nThis product leaves the skin soft enough and feels nice but my concern is more about ingredients. I like to see my skin care's first ingredients be more like the heavy hitters like glycolic or lactic or even natural like aloe so I was disappointed regarding this one's contents.  First is water and second is witch hazel. Which I likr, but three and four are glycerol stearate and peg-100 stearate. Peg 100 is a mixed bag of reviews and some even question the safety of it regarding get use in skin care.  It's disappointing because it leaves my skin feeling amazing but I do like more natural ingredients for the first couple ingredients than this product has.\nNot so sure.\nThe Regenerator Anti Cellulite Cream with 12% Liposomal Vitamin C, 4 fl oz (120 ml)\n{'Package Dimensions': '9.1 x 3.3 x 1.6 inches; 4 Ounces'}\nToo soon to tell long-term results but seems to absorb easily.  The smell is pretty difficult for me though.  This is a natural product so I understand to a certain point but I know I won't wear this lotion if I'm leaving the house so I most likely won't use it.\nIve smelled better...\nAnti Aging Eye Wrinkle Cream for Women & Men with Hyaluronic Acid Matrixyl 3000 Complex to Moisturize Your Skin Day And Night – 1.8 Fl. Oz\nCARDEA LUXE\n[\"How annoying is it when you wake up in the morning or come home from a hard day's work and look in the mirror and all you can see are dark circles or puffy bags under your eyes? Have you tried other eye creams and still found yourself wondering why you look older than your age? Would you like a simple, effective and affordable way to eliminate fine lines, puffiness and under eye circles? Why look your age when you don't have to? Cardea LuxeTM is a luxurious, highly emollient-enriched organic, anti-oxidant and cellular rejuvenating eye cream therapy that's ideal for both men and women of all ages. You'll be very pleased with the fast-acting, long-lasting benefits to your fragile and vulnerable eye area. Our eye cream has a light consistency that instantly absorbs into the skin without leaving a heavy, sticky or greasy feeling, allowing you to immediately apply your makeup. Our advanced eye therapy has combined age-defying peptides, botanicals, pure plant oils, organic vitamins and minerals, skin boosting and rebuilding Matrixyl 3000 and an ocean-based Retinol, which is a key ingredient for radiant-looking eyes that belay your age. Gradual improvements noticeable after a short time Used twice daily, morning and evening for healing Great for men and women of all ages and skin tones Rehydrates the skin and regenerates new skin cells Protects, tightens and firms delicate eye areas Bonus: Cream can be used on face & neck areas as well Oil and gluten free with a refreshing cucumber scent No parabens, alcohol, sulfates or harsh chemicals Once you've experienced Cardea Luxe's Radiance Eye Cream you'll no longer have to worry about under eye bags, dark circles or wrinkles again - we guarantee it. CLICK the Add to Cart button now to order Radiance Eye Therapy and beautifully frame your gorgeous eyes.\"]\n{'Brand': 'CARDEA LUXE', 'Item Form': 'Cream', 'Active Ingredients': 'Peptides, Vitamin_c, Hyaluronic_acid', 'Unit Count': '1.8 Ounce', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.1 x 2.7 x 2.6 inches; 1.76 Ounces', 'Item model number': 'Radiance3000', 'UPC': '691965999593', 'Manufacturer': 'Cardea Luxe'}\nThis eye cream is decently thick and consistency. It has some good ingredients. I like using it on my entire face as I do with most eye creams. I creams tend to be a little more gentle and I have sensitive skin so this is good for that. I like the container. It's one of those that you push down on the top and the product squirts out from underneath the top. If that makes sense anyway. This is along the caliber of something you'd see at a higher-end store.\nGood ingredients and a solid product\nAnti-Aging Peptide MegaMUD - Enhanced with Matrixyl, Argireline, Hyaluronic, Argan Oil, and Green Tea Extract\nVIA Cosmedics\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.6 x 2.52 x 2.13 inches; 4.94 Ounces', 'Item model number': 'AAMUD10', 'UPC': '748252100450'}\nI really enjoyed this mud mask. It has awesome anti-aging ingredients but still leaves the skin feeling detoxified. When it dries, it doesn't feel like it is sucking all the moisture out of your face but I do like to wash the product off my face before it completely dries. I do have dry skin & Soul already tried to not let clay mask sit on my skin for too long. Really great product.\nGreat ingredients\n12 Colors Professional Powder Makeup Palette with Mirror, Shimmer Matte Eyeshadow ,Everyday Natural Look , By Beauty Bon\nBeauty Bon\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.2 x 4.6 x 0.7 inches; 7.04 Ounces', 'Item model number': '12 Colors makeup Palette', 'UPC': '018227299824'}\nThis really is a very decent palette. The mattes blend very well. The shimmers don't have a lot of pop but the warm and neutral mattes more than make up for that. I was very impressed.\nGreat warm and neutral mattes\nEminence Facial Recovery Oil Card Sample Set of 6 Travel Size\n['Toning and hydrating oil created with precious herbs and nourishing oils to soothe and renew sensitive and aging skin. This is a luxurious facial oil suitable for all skin types.']\n{'Item Form': 'Oil', 'Number of Items': '6', 'Skin Type': 'All', 'Age Range (Description)': 'Adult', 'Special Feature': 'Travel Size', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.7 x 3.8 x 0.4 inches; 1.6 Ounces'}\nI use this facial oil every single night and since I began using it, each morning I have woken up with my skin still feeling moisturized. That is the first time in years that has happened. The fact that I can get almost a half an ounce of oil, which last really long time, for such an affordable price is amazing. When you look how much an ounce of this product costs to buy a full size you will realize that buying the sample size is much more affordable. I have already purchased a few sample sizes and place them in old oil jars so I can use them out of a pump instead of out of the foil. It is a little more work but it is totally worth it\nOne of the few products that has made it into the top lineup of skin care products for me\nCucumber Eye Gel Card Sample Set of 6 Travel Size\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5 x 3.6 x 0.4 inches; 2.4 Ounces'}\nThis is the only product I have been disappointed in from Eminence.  I had a weird smell, like it's gone bad.  Everything else I've received, literally like 15 orders, has been amazing though.\nWeird smell",
  "actual_interaction": {
    "rating": 3.0,
    "title": "Weird smell",
    "text": "This is the only product I have been disappointed in from Eminence.  I had a weird smell, like it's gone bad.  Everything else I've received, literally like 15 orders, has been amazing though.",
    "images": [],
    "asin": "B01KBJXJLQ",
    "parent_asin": "B01KBJXJLQ",
    "user_id": "AEKVQLLSQUCHJP2RHUJQEJRYWHLA",
    "timestamp": "2017-07-22 17:53:32.012000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "All Beauty",
    "title_meta": "Cucumber Eye Gel Card Sample Set of 6 Travel Size",
    "average_rating": 4.6,
    "rating_number": 12,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51TylNV3YFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51TylNV3YFL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81yyyJAo73L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51f5CI-NDcL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51f5CI-NDcL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81bPJLCuPaL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": null,
    "categories": [],
    "details": {
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "5 x 3.6 x 0.4 inches; 2.4 Ounces"
    },
    "bought_together": null
  }
}