{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: A Little Bit of Heaven\nReview Date: 2015/08/13\nStore: Kate Hudson  (Actor),     Gael Garcia Bernal  (Actor),     Nicole Kassell  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Marley Corbett (Kate Hudson) is young, beautiful, and wildly funny, but she s afraid of opening herself up to true love and commitment. Though she uses her humor to prevent matters from getting serious, a life-changing visit to her doctor (Gael Garcia Bernal) sends both of them on an eye-opening adventure of mutual discovery, leading to revelations neither thought possible. Also stars Peter Dinklage, Whoopi Goldberg, Kathy Bates and Rosemarie DeWitt.']\nAverage Rating: 4.4\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC, Widescreen, Anamorphic', 'Contributor': 'Whoopi Goldberg, Kate Hudson, Gael Garcia Bernal, Rosemarie DeWitt, Peter Dinklage, Nicole Kassell, Lucy Punch, Kathy BatesWhoopi Goldberg, Kate Hudson, Gael Garcia Bernal, Rosemarie DeWitt, Peter Dinklage, Nicole Kassell, Lucy Punch, Kathy Bates  See more', 'Language': 'English', 'Runtime': '1 hour and 46 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Director': 'Nicole Kassell', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Anamorphic', 'Run time': '1 hour and 46 minutes', 'Release date': 'June 12, 2012', 'Actors': 'Kate Hudson, Gael Garcia Bernal, Peter Dinklage, Whoopi Goldberg, Kathy Bates', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nReview Text: Enjoyed the movie. Sad.\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Samurai Trilogy (The Criterion Collection) [Blu-ray]\nToshiro Mifune  (Actor),     Hiroshi Inagaki  (Director)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The Samurai Trilogy, directed by Hiroshi Inagaki (The Rickshaw Man) and starring the inimitable Toshiro Mifune (Seven Samurai), was one of Japan’s most successful exports of the 1950s, a rousing, emotionally gripping tale of combat and self-discovery. Based on a novel that’s often called Japan’s Gone with the Wind, this sweeping saga fictionalizes the life of the legendary seventeenth-century swordsman (and writer and artist) Musashi Miyamoto, following him on his path from unruly youth to enlightened warrior. With these three films—1954’s Oscar-winning Musashi Miyamoto, 1955’s Duel at Ichijoji Temple, and 1956’s Duel at Ganryu Island—Inagaki created a passionate epic that’s equal parts tender love story and bloody action.']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Hiroshi Inagaki, Toshiro Mifune', 'Language': 'Japanese', 'Runtime': '5 hours', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'Relay time: 300min; 2 Videos', 'Director': 'Hiroshi Inagaki', 'Media Format': 'Blu-ray', 'Run time': '5 hours', 'Release date': 'June 26, 2012', 'Actors': 'Toshiro Mifune', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '2'}\nEnjoyed the 3 discs. Prompt delivery. Thank you.\nFive Stars\nThe Changeling\nGeorge C. Scott  (Actor),     Trish Van Devere  (Actor),     Peter Medak  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"George C. Scott becomes the unwilling instrument of a ghost's revenge in this supernatural thriller.\"]\n{'Genre': 'Horror, Drama, Suspense', 'Format': 'Multiple Formats, Anamorphic, Color, NTSC, Subtitled', 'Contributor': 'Madeleine Thornton-Sherwood, Melvyn Douglas, William Gray, Jean Marsh, Russell Hunter, Roberta Maxwell, Mario Kassar, George C. Scott, Diana Maddox, Joel B. Michaels, Andrew Vajna, Garth H. Drabinsky, Trish Van Devere, Peter Medak, Barry Morse, John ColicosMadeleine Thornton-Sherwood, Melvyn Douglas, William Gray, Jean Marsh, Russell Hunter, Roberta Maxwell, Mario Kassar, George C. Scott, Diana Maddox, Joel B. Michaels, Andrew Vajna, Garth H. Drabinsky, Trish Van Devere, Peter Medak, Barry Morse, John Colicos  See more', 'Initial release date': '2005-09-06', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.4 Ounces', 'Item model number': '90630', 'Director': 'Peter Medak', 'Media Format': 'Multiple Formats, Anamorphic, Color, NTSC, Subtitled', 'Run time': '1 hour and 47 minutes', 'Release date': 'September 6, 2005', 'Actors': 'George C. Scott, Trish Van Devere, Melvyn Douglas, John Colicos, Jean Marsh', 'Subtitles': 'English, Spanish, French', 'Producers': 'Mario Kassar, Andrew Vajna, Joel B. Michaels, Garth H. Drabinsky', 'Studio': 'HBO Studios', 'Writers': 'William Gray, Diana Maddox, Russell Hunter', 'Number of discs': '1'}\nBetter than I remembered it. Very good.\nFive Stars\nMama [DVD]\nJessica Chastain  (Actor),     Nikolaj Coster-Waldau  (Actor),     Andy Muschietti  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Product Description', \"Guillermo del Toro, the Academy Award®-nominated writer of Pan's Labyrinth, presents this supernatural thriller that tells the haunting tale of two little girls who disappeared into the woods the day that their parents were killed. When the young sisters are found alive in a decrepit cabin, their uncle (Nikolaj Coster-Waldau, Game of Thrones) and his girlfriend (Oscar® nominee Jessica Chastain, Zero Dark Thirty) take them in. As they try to introduce the children to a normal life, Annabel (Chastain) begins to wonder if the traumatized girls are the only guests they have welcomed into their home.\", 'Bonus Content:', 'Feature Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'Feature Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'Original Short with Introduction by Guillermo del Toro', 'Original Short with Introduction by Guillermo del Toro', 'Deleted Scenes with Optional Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'Deleted Scenes with Optional Commentary with Director/Co-Writer Andy Muschietti and Producer/Co-Writer Barbara Muschietti', 'The Birth of Mama', 'The Birth of Mama', ']]>', 'Amazon.com', \"When he's not making gargantuan movies about giant robots and/or comic book hell-beasts, Guillermo del Toro as a producer has fostered a movement toward dreamy, fairy-tale horror (\", 'The Orphanage', ',', \"Don't Be Afraid of the Dark\", '), where primally Grimm scenarios reach some unusually bittersweet resolutions.', 'Mama', \", del Toro's 2013 production, continues this winning storybook streak, driven by a fiercely against-type performance by Jessica Chastain and an impressive number of uneasy frights. (How many times can a little girl ferally scuttling around the edges of the frame be scary? Quite a few, actually.) Beginning with a literal Once Upon a Time, director-cowriter Andrés Muschietti's film concerns a pair of young girls left stranded in a creepy cabin in the woods after a family tragedy. When they are miraculously found intact five years later, they credit their survival to a mysterious mother figure. As their reluctant new riot girl guardian (Chastain) soon discovers, this protective entity has a murderous case of separation anxiety. Muschietti's project (devised with his sister Barbara) had its genesis as a widely YouTubed three-minute short film, and the elongation seams do occasionally show, particularly in the third act, when characters begin appearing for the express purpose of being munched. Still, even if it doesn't all hang together,\", 'Mama', \"has no shortage of champion scary moments, expertly designed for maximum freak-out. (An early scene involving a supernatural game of tug of war hits just the right mark between nervous laughter and serious goose bump territory.) After seeing what lurks under Chastain's bed, don't be surprised if you cultivate some serious dust bunnies of your own.\", '--Andrew Wright']\n{'Genre': 'Horror, Mystery & Suspense/Thrillers, Mystery & Suspense', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Andy Muschietti, Daniel Kash, Jane Moffat, Guillermo del Toro, Jessica Chastain, Megan Charpentier, Javier Botet, Neil Cross, Nikolaj Coster-Waldau, J. Miles Dale, Isabelle Nelisse, Barbara MuschiettiAndy Muschietti, Daniel Kash, Jane Moffat, Guillermo del Toro, Jessica Chastain, Megan Charpentier, Javier Botet, Neil Cross, Nikolaj Coster-Waldau, J. Miles Dale, Isabelle Nelisse, Barbara Muschietti   See more', 'Initial release date': '2013-05-07', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '26353999', 'Director': 'Andy Muschietti', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 7, 2013', 'Actors': 'Jessica Chastain, Nikolaj Coster-Waldau, Megan Charpentier, Isabelle Nelisse, Daniel Kash', 'Subtitles': 'Spanish, French', 'Producers': 'J. Miles Dale, Barbara Muschietti, Guillermo del Toro', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Neil Cross, Andy Muschietti, Barbara Muschietti', 'Number of discs': '1'}\nVery good and scary!!\nFive Stars\nA Little Bit of Heaven\nKate Hudson  (Actor),     Gael Garcia Bernal  (Actor),     Nicole Kassell  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Marley Corbett (Kate Hudson) is young, beautiful, and wildly funny, but she s afraid of opening herself up to true love and commitment. Though she uses her humor to prevent matters from getting serious, a life-changing visit to her doctor (Gael Garcia Bernal) sends both of them on an eye-opening adventure of mutual discovery, leading to revelations neither thought possible. Also stars Peter Dinklage, Whoopi Goldberg, Kathy Bates and Rosemarie DeWitt.']\n{'Format': 'Multiple Formats, Color, NTSC, Widescreen, Anamorphic', 'Contributor': 'Whoopi Goldberg, Kate Hudson, Gael Garcia Bernal, Rosemarie DeWitt, Peter Dinklage, Nicole Kassell, Lucy Punch, Kathy BatesWhoopi Goldberg, Kate Hudson, Gael Garcia Bernal, Rosemarie DeWitt, Peter Dinklage, Nicole Kassell, Lucy Punch, Kathy Bates  See more', 'Language': 'English', 'Runtime': '1 hour and 46 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Director': 'Nicole Kassell', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Anamorphic', 'Run time': '1 hour and 46 minutes', 'Release date': 'June 12, 2012', 'Actors': 'Kate Hudson, Gael Garcia Bernal, Peter Dinklage, Whoopi Goldberg, Kathy Bates', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nEnjoyed the movie. Sad.\nFour Stars",
  "profile": "**User Profile Summary:**\n\nThe user has a strong appreciation for classic and historically significant cinema, particularly in genres that meld elements of drama and horror. Their recent acquisition of a comedy-drama highlights a developing interest in films that combine emotional depth with humor, reflecting a flexible taste in storytelling. They continue to favor narratives that present complex character experiences, often engaging with themes of self-discovery and personal growth.\n\nWhile the user maintains a commitment to high-quality formats, such as DVD with extensive bonus features and subtitles, their latest film choice indicates they are open to various genres, including comedies that evoke genuine emotional responses. Their consistent rating of products at 5.0 shows satisfaction not only with the films but also emphasizes their preference for reliable service and prompt delivery.\n\nThe evolving taste reinforces their established pattern of seeking works that resonate emotionally, balancing gripping narrative arcs with significant storytelling. Their appreciation for diverse film experiences suggests a desire for cinema that challenges, entertains, and showcases impressive artistry. Overall, the user leans towards narratives that amalgamate humor, emotional depth, and an engaging storyline, allowing for a richer viewing experience while maintaining their foundational interest in more thrilling and suspenseful themes.",
  "metrics": {
    "rouge1_f": 0.1232876712328767,
    "rouge2_f": 0.00997506234413965,
    "rougeL_f": 0.049813200498132,
    "meteor": 0.03444440958334236,
    "bleu1": 0.00014290440872070072,
    "bleu2": 5.090280298550165e-05,
    "bleu3": 1.5784385924925382e-05,
    "bleu4": 4.948330055341724e-06,
    "bertscore_precision": 0.3169870376586914,
    "bertscore_recall": 0.47402432560920715,
    "bertscore_f1": 0.37991762161254883
  }
}