{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: KellyRoom 5D Faux Mink Lashes Handmade Luxurious Dramatic Thick Fake Eyelashes,14 Pairs (2 Styles)\nReview Date: 2020/07/08\nStore: KellyRoom\nAverage Rating: 3.9\nProduct Details: {'Brand': 'KellyRoom', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 6.6 x 1.2 inches; 3.21 Ounces', 'UPC': '824382149559'}\nReview Text: doesn't feel overly fake but def not real. They're very dramatic so if you're looking for something a bit more natural look somewhere else. I like them. I like the way they look. I like that there is so many of them.\nReview Title: perfect for yourself or a gift\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Segbeauty empty bottle 290\nTruuMe\n{'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nWorks great. It's perfect for adding a little life back into my hair or revitalizing a hairstyle from the day before. I like that it doesn't just drench my hair in fluids. It lightly coats it allowing me better control of how much water, or other liquid, I want on my hair.\nA great find\nEye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nMourvibe\n{'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nI'm not sure if how I applied it is what made it not work or if the product just doesn't work at all.  There was no directions on how to use the product which is the reason for the 1 star it might have been more but I could not get over the fact that it did not come with instructions.  No instructions on the jar, no instructions in the mailing envelope at all.  How are you supposed to know who to apply, when to apply or how to take it off.  I did try and it didn't work but that could because I put it on wrong because again there was NO instructions included with this product.\nDid not work on my puff eyes\n4 Pairs False Eyelashes Reusable Face Eyelashes Fit for All Eyes Free Eyelash Tweezers, Natural Thick Hand-Made 3D Faux Mink Eyelashes for a Beautiful Makeup Look (Natural)\nesonstyle\n{'Brand': 'Esonstyle', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.2 x 3.7 x 0.5 inches; 0.63 Ounces'}\nThese were perfect for a night out. Looked very natural and easy to put on. I like that so many come in there they all look similar. Very natural. They feel soft. Really made my eyes pop. Was easy for me to install as a beginner\nWould buy again\nNewcally Eyelashes 25MM Long False Lashes Faux Mink Dramatic Messy Lashes 5 Pairs\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 3.9 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372077'}\nVery light weight but I didn't like the look. I didn't like the feel. When you touch them they feel like plastic. Can get better quality at the hair store. They look super fair. Very uncomfortable. Would not purchase.\nDo not recommend\nKellyRoom 5D Faux Mink Lashes Handmade Luxurious Dramatic Thick Fake Eyelashes,14 Pairs (2 Styles)\nKellyRoom\n{'Brand': 'KellyRoom', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 6.6 x 1.2 inches; 3.21 Ounces', 'UPC': '824382149559'}\ndoesn't feel overly fake but def not real. They're very dramatic so if you're looking for something a bit more natural look somewhere else. I like them. I like the way they look. I like that there is so many of them.\nperfect for yourself or a gift",
  "profile": "**User Profile Summary**\n\n- **Hair and Eye Care Enthusiast:** Strongly interested in products that enhance both hair and eye aesthetics, emphasizing hair health alongside an expanding focus on eye makeup.\n- **Control in Application:** Prefers products that allow for precise application, selecting lightweight options that do not overwhelm, fostering an appreciation for user-friendly experiences.\n- **Practical Utility:** Values functionality and practicality in personal care products, seeking effective solutions that serve specific purposes. Recent eye makeup purchases reflect a desire for more natural looks balanced with dramatic flair.\n- **Quality Conscious:** Engages with reputable brands while maintaining a high average rating for purchases, emphasizing a commitment to effective products that meet quality expectations and provide clear usage instructions.\n- **Critical Review Tendencies:** Generally optimistic but critical when product usability or comfort falls short, as evidenced by recent experiences with false eyelashes. Focuses on quality and wearability, aiming for beginner-friendly options.\n- **Expanding Interests:** The exploration of false eyelashes highlights a preference for dramatic styles that still appear elegant, indicating a nuanced approach to beauty products that considers aesthetic appeal without sacrificing comfort.\n\nOverall, the user values effectiveness, control, and quality in grooming and beauty routines while seeking products that meet their specific preferences, ensuring a satisfying experience through informed exploration.",
  "metrics": {
    "rouge1_f": 0.17335058214747737,
    "rouge2_f": 0.010376134889753566,
    "rougeL_f": 0.08020698576972833,
    "meteor": 0.08057659502577015,
    "bleu1": 0.048116435349357715,
    "bleu2": 0.008034637445438367,
    "bleu3": 0.0016320447066802929,
    "bleu4": 0.0007362581760611554,
    "bertscore_precision": 0.3460767865180969,
    "bertscore_recall": 0.419235497713089,
    "bertscore_f1": 0.3791593909263611
  }
}