{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Newcally Eyelashes 25MM Long False Lashes Faux Mink Dramatic Messy Lashes 5 Pairs\nReview Date: 2020/04/27\nStore: Newcally\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 3.9 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372077'}\nReview Text: Very light weight but I didn't like the look. I didn't like the feel. When you touch them they feel like plastic. Can get better quality at the hair store. They look super fair. Very uncomfortable. Would not purchase.\nReview Title: Do not recommend\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Segbeauty empty bottle 290\nTruuMe\n{'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nWorks great. It's perfect for adding a little life back into my hair or revitalizing a hairstyle from the day before. I like that it doesn't just drench my hair in fluids. It lightly coats it allowing me better control of how much water, or other liquid, I want on my hair.\nA great find\nEye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nMourvibe\n{'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nI'm not sure if how I applied it is what made it not work or if the product just doesn't work at all.  There was no directions on how to use the product which is the reason for the 1 star it might have been more but I could not get over the fact that it did not come with instructions.  No instructions on the jar, no instructions in the mailing envelope at all.  How are you supposed to know who to apply, when to apply or how to take it off.  I did try and it didn't work but that could because I put it on wrong because again there was NO instructions included with this product.\nDid not work on my puff eyes\n4 Pairs False Eyelashes Reusable Face Eyelashes Fit for All Eyes Free Eyelash Tweezers, Natural Thick Hand-Made 3D Faux Mink Eyelashes for a Beautiful Makeup Look (Natural)\nesonstyle\n{'Brand': 'Esonstyle', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.2 x 3.7 x 0.5 inches; 0.63 Ounces'}\nThese were perfect for a night out. Looked very natural and easy to put on. I like that so many come in there they all look similar. Very natural. They feel soft. Really made my eyes pop. Was easy for me to install as a beginner\nWould buy again\nNewcally Eyelashes 25MM Long False Lashes Faux Mink Dramatic Messy Lashes 5 Pairs\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 3.9 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372077'}\nVery light weight but I didn't like the look. I didn't like the feel. When you touch them they feel like plastic. Can get better quality at the hair store. They look super fair. Very uncomfortable. Would not purchase.\nDo not recommend",
  "profile": "**User Profile Summary**\n\n- **Hair Care Enthusiast:** Continues to exhibit a strong interest in products that enhance hairstyles, prioritizing hair health and maintenance.\n- **Control in Application:** Prefers products that allow for precise control, favoring lightweight options that do not overwhelm. \n- **Practical Utility:** Values functionality and practicality in personal care products, indicating a preference for effective solutions that serve specific purposes. \n- **Quality Conscious:** Engages with quality brands and maintains a high average rating for purchases, reflecting a commitment to effective products. Recent experiences emphasize the significance of clear usage instructions and quality expectations.\n- **Critical Review Tendencies:** Generally optimistic but willing to provide constructive criticism, particularly regarding product usability and quality. Recent purchases have highlighted discontent with material feel and overall comfort, leading to lower satisfaction ratings.\n- **Expanding Interests:** While initially exploring eye makeup, particularly false eyelashes for a natural look, recent feedback indicates disappointment with certain products. The user has clearly articulated preferences for comfort and quality, reflecting a desire for beginner-friendly options that deliver both aesthetics and wearability.\n\nOverall, the user values effectiveness, control, and quality in grooming and personal care routines, underscoring the necessity for clear instructions and quality assurance in ensuring a satisfying experience. This thoughtful approach continues to shape their exploration of beauty products.",
  "metrics": {
    "rouge1_f": 0.1863905325443787,
    "rouge2_f": 0.011869436201780416,
    "rougeL_f": 0.08875739644970415,
    "meteor": 0.09756653156125303,
    "bleu1": 0.08378158450288103,
    "bleu2": 0.009757497570639396,
    "bleu3": 0.0022144926400082194,
    "bleu4": 0.0010559613415392893,
    "bertscore_precision": 0.36122047901153564,
    "bertscore_recall": 0.4247490167617798,
    "bertscore_f1": 0.39041730761528015
  }
}