{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ombre Blonde Wavy Lace Front Synthetic Wig Long Curly Wigs for Women, 3 Tone Dark Root to 27# Blonde to 613# Heat Resistant Fiber L Side Parting Wig(16inches, Ombre Brown Blonde)…\nReview Date: 2021/01/30\nStore: JUVEN BELLA\nAverage Rating: 3.4\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'JUVEN BELLA', 'Package Dimensions': '12.28 x 11.22 x 3.15 inches; 7.05 Ounces', 'UPC': '718774650023'}\nReview Text: Sheds, bo curls and thin. Have to re curl differently will show after curls are in.\nReview Title: I give it a 3\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "eNilecor Short Hair Wigs Pixie Cut Light Blonde Natrual Curly Wigs for Women with Side Bangs Trendy Synthetic Wig with Wigs Cap (7.8\" Blonde)\neNilecor\n{'Item Dimensions LxWxH': '8.3 x 4 x 1.6 inches', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'eNilecor', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.3 x 4 x 1.6 inches; 8.64 Ounces', 'UPC': '711508239747', 'Manufacturer': 'eNilecor'}\nA hot mess. That's all I can say about that. Too short to do anything to it.\nDON'T\nCOSYCODE Blonde Bob Wig with Bangs 12 inches Short Synthetic Wigs for Daily Wear Halloween Party\n{'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.7 x 6.8 x 2.5 inches; 8.01 Ounces', 'UPC': '682228998477'}\nLook ok. Color is not of the picture. Very dull. If the wind blow all my black hair underneath is shown. If flipped behind ear all my hair will be exposed\nNo smiles over here\nYIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nYIROO\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nI received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\n😊\nSINGLE BEST Ombre Color 1b27 Short Pixie Cut Wigs T Lace Frontal Wigs Side Part Short Bob wigs for Black Woman Brazilian Virgin Human Hair Haircuts Natural Hairline\nSINGLE BEST\n{'Package Dimensions': '12 x 7.5 x 3.5 inches; 3.67 Ounces'}\nNothing like the picture.  Too short. Cut totally wrong. Very disappointed\nWish I didn't buy\nOmbre Blonde Wavy Lace Front Synthetic Wig Long Curly Wigs for Women, 3 Tone Dark Root to 27# Blonde to 613# Heat Resistant Fiber L Side Parting Wig(16inches, Ombre Brown Blonde)…\nJUVEN BELLA\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'JUVEN BELLA', 'Package Dimensions': '12.28 x 11.22 x 3.15 inches; 7.05 Ounces', 'UPC': '718774650023'}\nSheds, bo curls and thin. Have to re curl differently will show after curls are in.\nI give it a 3",
  "profile": "**Updated User Profile Summary**\n\n- **Hair Accessories**: The user continues to express a strong interest in wigs, particularly modern styles such as curly looks. However, their ongoing concerns about product representation, especially regarding length and cut accuracy, have intensified, as highlighted in their latest feedback.\n\n- **Style Preference**: Their preference for trendy and contemporary wig styles remains, though recent dissatisfaction with purchases not aligning with advertised features has become more pronounced.\n\n- **Quality Expectations**: The user's high standards for quality and realism are evident, demonstrated by their recent review expressing disappointment due to shedding, inadequate curl retention, and overall thinness. They increasingly seek accurate representations and are becoming less tolerant of discrepancies.\n\n- **Feedback Tendencies**: They have adopted a more critical and frustrated stance in their reviews, focusing more on negative experiences rather than balanced feedback. This shift is evident in their most recent low rating of a product, reflecting their growing dissatisfaction.\n\n- **Product Selection**: The user generally favors synthetic wigs for convenience, but recent interactions indicate a stronger concern over misrepresentation and product performance, leading to frustration with their purchasing decisions.\n\n- **Interaction History**: The user remains engaged and communicative, but their recent critical feedback suggests an evolving frustration with product portrayals, prompting a reevaluation of their choices. \n\nOverall, they remain focused on stylish hair solutions while grappling with increasing frustration regarding quality and misrepresentation in their wig purchases.",
  "metrics": {
    "rouge1_f": 0.1672025723472669,
    "rouge2_f": 0.006451612903225806,
    "rougeL_f": 0.07073954983922828,
    "meteor": 0.09100179930884375,
    "bleu1": 0.08821708499179311,
    "bleu2": 0.011603356548885654,
    "bleu3": 0.002742156766274418,
    "bleu4": 0.00133420215884251,
    "bertscore_precision": 0.34460413455963135,
    "bertscore_recall": 0.3879009485244751,
    "bertscore_f1": 0.36497294902801514
  }
}