{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ombre Dark Blonde Curly Lace Front Synthetic Wig for Women, 18 inch Kinky Afro Curly Middle Part Wigs Half Hand Tied Hairline Natural Color (18 inch, Ombre Blonde)\nReview Date: 2021/01/30\nStore: Nil\nAverage Rating: 3.5\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Coily', 'Style': 'African', 'Brand': 'Nil', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11 x 6.5 x 4 inches; 11.99 Ounces'}\nReview Text: Nothing like the pic. Thin and tangled.\nReview Title: Thumbs down\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "eNilecor Short Hair Wigs Pixie Cut Light Blonde Natrual Curly Wigs for Women with Side Bangs Trendy Synthetic Wig with Wigs Cap (7.8\" Blonde)\neNilecor\n{'Item Dimensions LxWxH': '8.3 x 4 x 1.6 inches', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'eNilecor', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.3 x 4 x 1.6 inches; 8.64 Ounces', 'UPC': '711508239747', 'Manufacturer': 'eNilecor'}\nA hot mess. That's all I can say about that. Too short to do anything to it.\nDON'T\nCOSYCODE Blonde Bob Wig with Bangs 12 inches Short Synthetic Wigs for Daily Wear Halloween Party\n{'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.7 x 6.8 x 2.5 inches; 8.01 Ounces', 'UPC': '682228998477'}\nLook ok. Color is not of the picture. Very dull. If the wind blow all my black hair underneath is shown. If flipped behind ear all my hair will be exposed\nNo smiles over here\nYIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nYIROO\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nI received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\n😊\nSINGLE BEST Ombre Color 1b27 Short Pixie Cut Wigs T Lace Frontal Wigs Side Part Short Bob wigs for Black Woman Brazilian Virgin Human Hair Haircuts Natural Hairline\nSINGLE BEST\n{'Package Dimensions': '12 x 7.5 x 3.5 inches; 3.67 Ounces'}\nNothing like the picture.  Too short. Cut totally wrong. Very disappointed\nWish I didn't buy\nOmbre Blonde Wavy Lace Front Synthetic Wig Long Curly Wigs for Women, 3 Tone Dark Root to 27# Blonde to 613# Heat Resistant Fiber L Side Parting Wig(16inches, Ombre Brown Blonde)…\nJUVEN BELLA\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'JUVEN BELLA', 'Package Dimensions': '12.28 x 11.22 x 3.15 inches; 7.05 Ounces', 'UPC': '718774650023'}\nSheds, bo curls and thin. Have to re curl differently will show after curls are in.\nI give it a 3\nOmbre Dark Blonde Curly Lace Front Synthetic Wig for Women, 18 inch Kinky Afro Curly Middle Part Wigs Half Hand Tied Hairline Natural Color (18 inch, Ombre Blonde)\nNil\n{'Material': 'Synthetic', 'Hair Type': 'Coily', 'Style': 'African', 'Brand': 'Nil', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11 x 6.5 x 4 inches; 11.99 Ounces'}\nNothing like the pic. Thin and tangled.\nThumbs down",
  "profile": "**Updated User Profile Summary**\n\n- **Hair Accessories**: The user's interest in wigs, especially modern styles like curly looks, remains strong. However, their concerns about product representation, particularly regarding length and cut accuracy, are heightened following their recent experience.\n\n- **Style Preference**: They continue to favor trendy wig styles, but recent purchases have led to significant dissatisfaction, particularly with products not aligning with advertised features.\n\n- **Quality Expectations**: The user has established high standards for quality and realism, as reflected in their latest review expressing disappointment due to issues such as shedding, inadequate curl retention, and overall thinness. Their intolerance for discrepancies is increasing.\n\n- **Feedback Tendencies**: They have adopted a more critical and frustrated approach in their reviews, with a noticeable focus on negative experiences. This recent interaction, which resulted in a low rating, underscores their growing dissatisfaction with product portrayals and performance.\n\n- **Product Selection**: While the user generally prefers synthetic wigs for convenience, they are now increasingly frustrated with misrepresentation in product performance, indicating a shift in their purchasing mindset.\n\n- **Interaction History**: Despite remaining engaged and communicative, their recent critical feedback highlights an evolving frustration with the alignment between product expectations and reality, leading them to reconsider their choices in wig purchasing.\n\nOverall, the user continues to seek stylish hair solutions, grappling with escalating frustrations related to quality and misrepresentation in their recent wig purchases.",
  "metrics": {
    "rouge1_f": 0.15835777126099707,
    "rouge2_f": 0.00588235294117647,
    "rougeL_f": 0.08211143695014662,
    "meteor": 0.08293838862559241,
    "bleu1": 0.07140746710927107,
    "bleu2": 0.008872211402690478,
    "bleu3": 0.0020572779093962564,
    "bleu4": 0.0009915132955868433,
    "bertscore_precision": 0.3361048102378845,
    "bertscore_recall": 0.38902246952056885,
    "bertscore_f1": 0.3606327474117279
  }
}