{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: YIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nReview Date: 2020/08/05\nStore: YIROO\nAverage Rating: 3.8\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nReview Text: I received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\nReview Title: 😊\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "eNilecor Short Hair Wigs Pixie Cut Light Blonde Natrual Curly Wigs for Women with Side Bangs Trendy Synthetic Wig with Wigs Cap (7.8\" Blonde)\neNilecor\n{'Item Dimensions LxWxH': '8.3 x 4 x 1.6 inches', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'eNilecor', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.3 x 4 x 1.6 inches; 8.64 Ounces', 'UPC': '711508239747', 'Manufacturer': 'eNilecor'}\nA hot mess. That's all I can say about that. Too short to do anything to it.\nDON'T\nCOSYCODE Blonde Bob Wig with Bangs 12 inches Short Synthetic Wigs for Daily Wear Halloween Party\n{'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.7 x 6.8 x 2.5 inches; 8.01 Ounces', 'UPC': '682228998477'}\nLook ok. Color is not of the picture. Very dull. If the wind blow all my black hair underneath is shown. If flipped behind ear all my hair will be exposed\nNo smiles over here\nYIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nYIROO\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nI received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\n😊",
  "profile": "**User Profile Summary**\n\n- **Hair Accessories**: User continues to show keen interest in wigs, particularly modern styles like curly looks. Despite some positive feedback, they still encounter issues with product representation, specifically curl volume and fullness.\n  \n- **Style Preference**: Prefers trendy, contemporary styles, such as ombre and curly wigs, aligning with their desire for fashionable hair solutions. Recent interactions indicate an appreciation for wigs that draw compliments, despite some dissatisfaction with how accurately products reflect advertised features.\n  \n- **Quality Expectations**: Upholds high standards for product quality, as evidenced by their balanced feedback. The user seeks accurate representations in terms of both appearance and performance, valuing realism in their purchases, yet remains relatively forgiving if the overall experience is positive.\n  \n- **Feedback Tendencies**: Maintains a critical yet constructive approach in reviews. While they express disappointment with certain attributes, such as fullness and curl style, they also acknowledge positive aspects, reflecting a nuanced view of product performance.\n  \n- **Product Selection**: Still favors synthetic wigs for their convenience but has experienced mixed outcomes regarding the function and aesthetic appeal of recent choices. \n\n- **Interaction History**: The user remains engaged and communicative, providing feedback that reflects their ongoing investment in quality and satisfactory performance in hair accessories.\n\nOverall, the user is focused on trendy hair solutions, balancing quality with aesthetic satisfaction while remaining actively critical of products that fall short of expectations.",
  "metrics": {
    "rouge1_f": 0.21052631578947367,
    "rouge2_f": 0.01691331923890063,
    "rougeL_f": 0.09263157894736843,
    "meteor": 0.13436637846844973,
    "bleu1": 0.1573307626062741,
    "bleu2": 0.006720243051722208,
    "bleu3": 0.0023518644550241936,
    "bleu4": 0.0013925311162243177,
    "bertscore_precision": 0.37558645009994507,
    "bertscore_recall": 0.3990183472633362,
    "bertscore_f1": 0.38694798946380615
  }
}