{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: AISI QUEENS Short Curly Wig Black Wavy Bob Wigs for Women Synthetic Middle Part Shoudler Length Heat Resistant Wig for Daily Party Use 14 Inch\nReview Date: 2022/02/17\nStore: AISI QUEENS\nAverage Rating: 3.8\nProduct Details: {'Hair Type': 'Wig,Curly Wig', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.02 x 1.77 inches; 8.47 Ounces'}\nReview Text: Looks nothing like the picture. I guess you get what you pay for, but then again I've bought units less than that in stores that were more wearable than this unit. Very displeased\nReview Title: Don't waste your money\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "eNilecor Short Hair Wigs Pixie Cut Light Blonde Natrual Curly Wigs for Women with Side Bangs Trendy Synthetic Wig with Wigs Cap (7.8\" Blonde)\neNilecor\n{'Item Dimensions LxWxH': '8.3 x 4 x 1.6 inches', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'eNilecor', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.3 x 4 x 1.6 inches; 8.64 Ounces', 'UPC': '711508239747', 'Manufacturer': 'eNilecor'}\nA hot mess. That's all I can say about that. Too short to do anything to it.\nDON'T\nCOSYCODE Blonde Bob Wig with Bangs 12 inches Short Synthetic Wigs for Daily Wear Halloween Party\n{'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.7 x 6.8 x 2.5 inches; 8.01 Ounces', 'UPC': '682228998477'}\nLook ok. Color is not of the picture. Very dull. If the wind blow all my black hair underneath is shown. If flipped behind ear all my hair will be exposed\nNo smiles over here\nYIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nYIROO\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nI received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\n😊\nSINGLE BEST Ombre Color 1b27 Short Pixie Cut Wigs T Lace Frontal Wigs Side Part Short Bob wigs for Black Woman Brazilian Virgin Human Hair Haircuts Natural Hairline\nSINGLE BEST\n{'Package Dimensions': '12 x 7.5 x 3.5 inches; 3.67 Ounces'}\nNothing like the picture.  Too short. Cut totally wrong. Very disappointed\nWish I didn't buy\nOmbre Blonde Wavy Lace Front Synthetic Wig Long Curly Wigs for Women, 3 Tone Dark Root to 27# Blonde to 613# Heat Resistant Fiber L Side Parting Wig(16inches, Ombre Brown Blonde)…\nJUVEN BELLA\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'JUVEN BELLA', 'Package Dimensions': '12.28 x 11.22 x 3.15 inches; 7.05 Ounces', 'UPC': '718774650023'}\nSheds, bo curls and thin. Have to re curl differently will show after curls are in.\nI give it a 3\nOmbre Dark Blonde Curly Lace Front Synthetic Wig for Women, 18 inch Kinky Afro Curly Middle Part Wigs Half Hand Tied Hairline Natural Color (18 inch, Ombre Blonde)\nNil\n{'Material': 'Synthetic', 'Hair Type': 'Coily', 'Style': 'African', 'Brand': 'Nil', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11 x 6.5 x 4 inches; 11.99 Ounces'}\nNothing like the pic. Thin and tangled.\nThumbs down\nWomens Short Blonde Wig Synthetic Ombre Blonde Bob Wig with Bangs Natural Straight Hair Wig for Party Daily Wear\nWiwige\n{'UPC': '793869635826'}\nLots of compliments on the style and color.  My only negative tone is you can see the track of the unit a little in the front.\nNice unit\nAISI QUEENS Short Curly Wig Black Wavy Bob Wigs for Women Synthetic Middle Part Shoudler Length Heat Resistant Wig for Daily Party Use 14 Inch\nAISI QUEENS\n{'Hair Type': 'Wig,Curly Wig', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.02 x 1.77 inches; 8.47 Ounces'}\nLooks nothing like the picture. I guess you get what you pay for, but then again I've bought units less than that in stores that were more wearable than this unit. Very displeased\nDon't waste your money",
  "profile": "**Updated User Profile Summary**\n\n- **Hair Accessories**: The user's enthusiasm for wigs, especially modern, curly styles, remains strong, but concerns about product representation—particularly regarding how they look compared to photos—have intensified.\n\n- **Style Preference**: They continue to favor trendy wig styles, but their latest purchase reflected dissatisfaction due to discrepancies between the advertised image and the actual product. This further highlights their critical viewpoint on product presentation.\n\n- **Quality Expectations**: The user insists on high standards for realism and quality. Even though they acknowledge appealing styles, disenchantment with their experiences has impacted their evaluations, shifting their perspective towards caution in future purchases.\n\n- **Feedback Tendencies**: Their reviews have increasingly adopted a critical tone, focusing on negatives while still recognizing positives in certain products. Their recent feedback indicates frustration with specific offerings, emphasizing a struggle with balancing style appeal against quality authenticity.\n\n- **Product Selection**: While synthetic wigs remain their primary choice for convenience, their purchasing decisions are becoming more selective, driven by growing concerns about both quality and the accuracy of product representations.\n\n- **Interaction History**: The user remains actively engaged in providing feedback, blending frustrations about product discrepancies with an appreciation for aesthetics. Their evolving perspective reflects a nuanced approach to wig purchasing, navigating the tension between style dissatisfaction and quality concerns.\n\nOverall, the user seeks fashionable hair solutions while becoming increasingly aware of quality issues and product representation.",
  "metrics": {
    "rouge1_f": 0.1486810551558753,
    "rouge2_f": 0.009615384615384616,
    "rougeL_f": 0.07673860911270983,
    "meteor": 0.060240963855421686,
    "bleu1": 0.04117353157290813,
    "bleu2": 0.006922357435928637,
    "bleu3": 0.0014091517807258787,
    "bleu4": 0.0006363371789447305,
    "bertscore_precision": 0.34282198548316956,
    "bertscore_recall": 0.4098471999168396,
    "bertscore_f1": 0.37335026264190674
  }
}