{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Womens Short Blonde Wig Synthetic Ombre Blonde Bob Wig with Bangs Natural Straight Hair Wig for Party Daily Wear\nReview Date: 2021/10/06\nStore: Wiwige\nAverage Rating: 4.0\nProduct Details: {'UPC': '793869635826'}\nReview Text: Lots of compliments on the style and color.  My only negative tone is you can see the track of the unit a little in the front.\nReview Title: Nice unit\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "eNilecor Short Hair Wigs Pixie Cut Light Blonde Natrual Curly Wigs for Women with Side Bangs Trendy Synthetic Wig with Wigs Cap (7.8\" Blonde)\neNilecor\n{'Item Dimensions LxWxH': '8.3 x 4 x 1.6 inches', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'eNilecor', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.3 x 4 x 1.6 inches; 8.64 Ounces', 'UPC': '711508239747', 'Manufacturer': 'eNilecor'}\nA hot mess. That's all I can say about that. Too short to do anything to it.\nDON'T\nCOSYCODE Blonde Bob Wig with Bangs 12 inches Short Synthetic Wigs for Daily Wear Halloween Party\n{'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.7 x 6.8 x 2.5 inches; 8.01 Ounces', 'UPC': '682228998477'}\nLook ok. Color is not of the picture. Very dull. If the wind blow all my black hair underneath is shown. If flipped behind ear all my hair will be exposed\nNo smiles over here\nYIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nYIROO\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nI received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\n😊\nSINGLE BEST Ombre Color 1b27 Short Pixie Cut Wigs T Lace Frontal Wigs Side Part Short Bob wigs for Black Woman Brazilian Virgin Human Hair Haircuts Natural Hairline\nSINGLE BEST\n{'Package Dimensions': '12 x 7.5 x 3.5 inches; 3.67 Ounces'}\nNothing like the picture.  Too short. Cut totally wrong. Very disappointed\nWish I didn't buy\nOmbre Blonde Wavy Lace Front Synthetic Wig Long Curly Wigs for Women, 3 Tone Dark Root to 27# Blonde to 613# Heat Resistant Fiber L Side Parting Wig(16inches, Ombre Brown Blonde)…\nJUVEN BELLA\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'JUVEN BELLA', 'Package Dimensions': '12.28 x 11.22 x 3.15 inches; 7.05 Ounces', 'UPC': '718774650023'}\nSheds, bo curls and thin. Have to re curl differently will show after curls are in.\nI give it a 3\nOmbre Dark Blonde Curly Lace Front Synthetic Wig for Women, 18 inch Kinky Afro Curly Middle Part Wigs Half Hand Tied Hairline Natural Color (18 inch, Ombre Blonde)\nNil\n{'Material': 'Synthetic', 'Hair Type': 'Coily', 'Style': 'African', 'Brand': 'Nil', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11 x 6.5 x 4 inches; 11.99 Ounces'}\nNothing like the pic. Thin and tangled.\nThumbs down\nWomens Short Blonde Wig Synthetic Ombre Blonde Bob Wig with Bangs Natural Straight Hair Wig for Party Daily Wear\nWiwige\n{'UPC': '793869635826'}\nLots of compliments on the style and color.  My only negative tone is you can see the track of the unit a little in the front.\nNice unit",
  "profile": "**Updated User Profile Summary**\n\n- **Hair Accessories**: The user's enthusiasm for wigs, particularly modern styles like curly looks, remains strong, but concerns about product representation—especially regarding length and cut—continue to grow. \n\n- **Style Preference**: They still favor trendy wig styles, as evidenced by their recent purchase, which received compliments for its style and color. However, minor issues, such as visibility of tracks, reflect their ongoing scrutiny of product details.\n\n- **Quality Expectations**: The user maintains high standards for realism and quality. Although recent experiences have led to dissatisfaction, their recent positive feedback indicates a more nuanced approach, noting both style appeal and some imperfections.\n\n- **Feedback Tendencies**: Their reviews have shifted towards a more critical tone, emphasizing negative experiences, yet they acknowledge positives in certain products. This duality suggests a careful evaluation of their options in light of previous disappointments.\n\n- **Product Selection**: While they primarily prefer synthetic wigs for convenience, the user is increasingly discerning about quality and representation, shifting their purchasing mindset based on recent interactions.\n\n- **Interaction History**: The user remains engaged and communicative, balancing their frustrations about product discrepancies with an appreciation for aesthetics. Their evolving feedback reveals a complexity in their wig purchasing process, as they navigate between style satisfaction and quality concerns.\n\nOverall, the user seeks stylish hair solutions while grappling with a growing awareness of quality and representation issues in their wig purchases.",
  "metrics": {
    "rouge1_f": 0.17391304347826086,
    "rouge2_f": 0.010899182561307902,
    "rougeL_f": 0.0923913043478261,
    "meteor": 0.07707879165369043,
    "bleu1": 0.06536694529500886,
    "bleu2": 0.015433496295873012,
    "bleu3": 0.007579716954159874,
    "bleu4": 0.004470576905297283,
    "bertscore_precision": 0.3325789272785187,
    "bertscore_recall": 0.38952910900115967,
    "bertscore_f1": 0.358808308839798
  }
}