{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 4 oz - Bargz Perfume - Oxygen Body Oil For Women Scented Fragrance\nReview Date: 2022/11/09\nStore: Bargz\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Bargz', 'Item Form': 'Oil', 'Item Volume': '4 Fluid Ounces', 'Material Type Free': 'Alcohol Free', 'Age Range (Description)': 'Adult', 'UPC': '781772914176'}\nReview Text: Smells ok, just a bit watery, and smaller than expected\nReview Title: Better to buy from someone personally\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "eNilecor Short Hair Wigs Pixie Cut Light Blonde Natrual Curly Wigs for Women with Side Bangs Trendy Synthetic Wig with Wigs Cap (7.8\" Blonde)\neNilecor\n{'Item Dimensions LxWxH': '8.3 x 4 x 1.6 inches', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'eNilecor', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.3 x 4 x 1.6 inches; 8.64 Ounces', 'UPC': '711508239747', 'Manufacturer': 'eNilecor'}\nA hot mess. That's all I can say about that. Too short to do anything to it.\nDON'T\nCOSYCODE Blonde Bob Wig with Bangs 12 inches Short Synthetic Wigs for Daily Wear Halloween Party\n{'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.7 x 6.8 x 2.5 inches; 8.01 Ounces', 'UPC': '682228998477'}\nLook ok. Color is not of the picture. Very dull. If the wind blow all my black hair underneath is shown. If flipped behind ear all my hair will be exposed\nNo smiles over here\nYIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nYIROO\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nI received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\n😊\nSINGLE BEST Ombre Color 1b27 Short Pixie Cut Wigs T Lace Frontal Wigs Side Part Short Bob wigs for Black Woman Brazilian Virgin Human Hair Haircuts Natural Hairline\nSINGLE BEST\n{'Package Dimensions': '12 x 7.5 x 3.5 inches; 3.67 Ounces'}\nNothing like the picture.  Too short. Cut totally wrong. Very disappointed\nWish I didn't buy\nOmbre Blonde Wavy Lace Front Synthetic Wig Long Curly Wigs for Women, 3 Tone Dark Root to 27# Blonde to 613# Heat Resistant Fiber L Side Parting Wig(16inches, Ombre Brown Blonde)…\nJUVEN BELLA\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'JUVEN BELLA', 'Package Dimensions': '12.28 x 11.22 x 3.15 inches; 7.05 Ounces', 'UPC': '718774650023'}\nSheds, bo curls and thin. Have to re curl differently will show after curls are in.\nI give it a 3\nOmbre Dark Blonde Curly Lace Front Synthetic Wig for Women, 18 inch Kinky Afro Curly Middle Part Wigs Half Hand Tied Hairline Natural Color (18 inch, Ombre Blonde)\nNil\n{'Material': 'Synthetic', 'Hair Type': 'Coily', 'Style': 'African', 'Brand': 'Nil', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11 x 6.5 x 4 inches; 11.99 Ounces'}\nNothing like the pic. Thin and tangled.\nThumbs down\nWomens Short Blonde Wig Synthetic Ombre Blonde Bob Wig with Bangs Natural Straight Hair Wig for Party Daily Wear\nWiwige\n{'UPC': '793869635826'}\nLots of compliments on the style and color.  My only negative tone is you can see the track of the unit a little in the front.\nNice unit\nAISI QUEENS Short Curly Wig Black Wavy Bob Wigs for Women Synthetic Middle Part Shoudler Length Heat Resistant Wig for Daily Party Use 14 Inch\nAISI QUEENS\n{'Hair Type': 'Wig,Curly Wig', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.02 x 1.77 inches; 8.47 Ounces'}\nLooks nothing like the picture. I guess you get what you pay for, but then again I've bought units less than that in stores that were more wearable than this unit. Very displeased\nDon't waste your money\n4 oz - Bargz Perfume - Oxygen Body Oil For Women Scented Fragrance\nBargz\n{'Brand': 'Bargz', 'Item Form': 'Oil', 'Item Volume': '4 Fluid Ounces', 'Material Type Free': 'Alcohol Free', 'Age Range (Description)': 'Adult', 'UPC': '781772914176'}\nSmells ok, just a bit watery, and smaller than expected\nBetter to buy from someone personally",
  "profile": "**Updated User Profile Summary**\n\n- **Hair Accessories**: The user maintains a strong enthusiasm for wigs, particularly modern, curly styles, while growing increasingly concerned about product representation—especially how they compare to advertised images.\n\n- **Style Preference**: Their continued favor for trendy wig styles is tempered by dissatisfaction arising from recent purchases that did not align with expectations based on images, prompting a more critical evaluation of product presentation.\n\n- **Quality Expectations**: High standards for realism and quality remain paramount. Although they acknowledge that appealing styles exist, disenchantment with prior experiences has led them to adopt a cautious approach to future purchases.\n\n- **Feedback Tendencies**: The user's reviews are turning more critical, highlighting negatives while occasionally recognizing positives. Their recent feedback has showcased frustration with specific offerings, emphasizing a struggle to reconcile style appeal with actual quality.\n\n- **Product Selection**: While primarily choosing synthetic wigs for convenience, their selections are becoming more deliberate, driven by heightened concerns about quality and accurate product representation. \n\n- **New Interests**: The user has expanded their interests beyond wigs to scented oils, indicating a desire for beauty products that enhance personal appeal. Recent interactions show a balance between aesthetics and functional quality, although they still express disappointments regarding expectations.\n\nOverall, the user seeks fashionable hair solutions while becoming increasingly discerning about quality and product authenticity across various beauty categories.",
  "metrics": {
    "rouge1_f": 0.1464530892448513,
    "rouge2_f": 0.009174311926605505,
    "rougeL_f": 0.07093821510297482,
    "meteor": 0.059243138677306253,
    "bleu1": 0.029090565653131097,
    "bleu2": 0.0034345166131893815,
    "bleu3": 0.0007829940266381645,
    "bleu4": 0.00037419461590036055,
    "bertscore_precision": 0.3439904451370239,
    "bertscore_recall": 0.41590261459350586,
    "bertscore_f1": 0.3765438497066498
  }
}