{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: SINGLE BEST Ombre Color 1b27 Short Pixie Cut Wigs T Lace Frontal Wigs Side Part Short Bob wigs for Black Woman Brazilian Virgin Human Hair Haircuts Natural Hairline\nReview Date: 2021/01/30\nStore: SINGLE BEST\nAverage Rating: 2.4\nProduct Details: {'Package Dimensions': '12 x 7.5 x 3.5 inches; 3.67 Ounces'}\nReview Text: Nothing like the picture.  Too short. Cut totally wrong. Very disappointed\nReview Title: Wish I didn't buy\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "eNilecor Short Hair Wigs Pixie Cut Light Blonde Natrual Curly Wigs for Women with Side Bangs Trendy Synthetic Wig with Wigs Cap (7.8\" Blonde)\neNilecor\n{'Item Dimensions LxWxH': '8.3 x 4 x 1.6 inches', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'eNilecor', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '8.3 x 4 x 1.6 inches; 8.64 Ounces', 'UPC': '711508239747', 'Manufacturer': 'eNilecor'}\nA hot mess. That's all I can say about that. Too short to do anything to it.\nDON'T\nCOSYCODE Blonde Bob Wig with Bangs 12 inches Short Synthetic Wigs for Daily Wear Halloween Party\n{'Hair Type': 'Curly', 'Style': 'Modern', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.7 x 6.8 x 2.5 inches; 8.01 Ounces', 'UPC': '682228998477'}\nLook ok. Color is not of the picture. Very dull. If the wind blow all my black hair underneath is shown. If flipped behind ear all my hair will be exposed\nNo smiles over here\nYIROO Ombre Blonde Loose Curly Lace Front Synthetic Wigs for Women 20 inches With Natural Hairline 2 Tones 4/27 Color Deep L Part Hair Glueless High Density Wig (20 inches, OT4/27)\nYIROO\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'YIROO', 'Package Dimensions': '10.4 x 6.9 x 3.2 inches; 11.22 Ounces'}\nI received alot of compliments.  It was a bit too full for me and the curls was not loose like the picture.  Over all I'm happy.\n😊\nSINGLE BEST Ombre Color 1b27 Short Pixie Cut Wigs T Lace Frontal Wigs Side Part Short Bob wigs for Black Woman Brazilian Virgin Human Hair Haircuts Natural Hairline\nSINGLE BEST\n{'Package Dimensions': '12 x 7.5 x 3.5 inches; 3.67 Ounces'}\nNothing like the picture.  Too short. Cut totally wrong. Very disappointed\nWish I didn't buy",
  "profile": "**Updated User Profile Summary**\n\n- **Hair Accessories**: The user maintains a strong interest in wigs, leaning towards modern styles like curly looks. However, recent feedback reveals ongoing concerns with product representation, particularly in terms of length and cut accuracy.\n\n- **Style Preference**: Their preference for trendy, contemporary wig styles continues, though dissatisfaction with specific purchases has been noted, particularly with products not aligning with advertised features.\n\n- **Quality Expectations**: The user has high standards for quality and realism, as seen in their latest review expressing significant disappointment with a recent purchase. They seek accurate representations of products and are less forgiving when these expectations are not met.\n\n- **Feedback Tendencies**: They adopt a critical yet constructive review approach, now showing a stronger inclination towards voicing frustration over negative experiences rather than balanced feedback, as evidenced by a recent low rating and discontent with their purchase.\n\n- **Product Selection**: While the user still favors synthetic wigs for convenience, the recent interaction reflects a deepening concern over misrepresentation and product performance, which has led to dissatisfaction with recent choices.\n\n- **Interaction History**: Continues to be engaged and communicative, but recent interactions suggest a shift towards a heightened critical stance in their feedback, indicating a growing frustration with the accuracy of product portrayals.\n\nOverall, the user is focused on trendy hair solutions while increasingly frustrated with quality discrepancies, prompting a reevaluation of their purchasing decisions.",
  "metrics": {
    "rouge1_f": 0.16728624535315983,
    "rouge2_f": 0.007462686567164179,
    "rougeL_f": 0.07434944237918216,
    "meteor": 0.09942168149834223,
    "bleu1": 0.12582130847264833,
    "bleu2": 0.016995068920262524,
    "bleu3": 0.004052107509141546,
    "bleu4": 0.001980330251450695,
    "bertscore_precision": 0.3553798496723175,
    "bertscore_recall": 0.3904053568840027,
    "bertscore_f1": 0.3720701038837433
  }
}