{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/12/01\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Luke Cormican', 'Peter Rida Michail', 'James Krenzke', 'Ken McIntyre', 'Dave Stone', \"Scott O'Brien\", 'Noel Belknap', 'Bryan Newton', 'Careen Ingle', 'Jeff Mednikow'], 'Producers': ['Michael Jelenic', 'Aaron Horvath'], 'Starring': ['Scott Menville', 'Hynden Walch', 'Khary Payton']}\nReview Text: good\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Toy Story 3\nTom Hanks  (Actor),     Tim Allen  (Actor),     Lee Unkrich  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'The creative minds behind Disney•Pixar\\'s groundbreaking animated blockbusters invites you back inside the Toys\\' delightful world for a heartwarming and hilarious Hi-Definition movie experience you\\'ll never forget. All the original voice talent returns (including Tom Hanks and Tim Allen) plus new talent including Michael Keaton as Ken and Ned Beatty as Lots-O\\'-Huggin\\' Bear. It\\'s \"the biggest, best, most exciting Toy Story of them all,\" raves Access Hollywood.', 'As Andy gets ready to leave for college, Woody, Buzz, Jessie and the rest of the gang wonder if this is the end of the line. But, when a mix up lands them in the Sunnyside Day Care Center where they meet 14 new toys, they soon discover that a wild new adventure is just beginning! Take an amazing journey with some of the most beloved characters in movie history and discover what being a friend is truly all about.', '\"It\\'s everything a movie should be: hilarious, touching, exciting and clever,\" says USA Today. Buzzing with hours of exclusive bonus features, including an interactive trivia game and the Pixar short film Day and Night, Toy Story 3 goes to infinity and beyond on Blu-ray Hi-Def!', 'Meet the Characters', 'Woody', 'Woody is a cowboy sheriff with a pull-string that, when pulled proclaims Woody\\'s signature catchphrases from the 1950s TV show \"Woody\\'s Roundup.\" He\\'s always been Andy\\'s favorite toy. Even though his owner is now grown, the loyal sheriff Woody maintains a steadfast belief that Andy still cares about his toys. As the toys venture into their unknown future, Woody remains the voice of reason. As their dependable leader, he ensures that no toy gets left behind.', 'Buzz Lightyear', \"Buzz Lightyear is a heroic space ranger action figure, complete with laser beam, karate-chop action and pop-out wings. Buzz is a boy's dream toy who becomes a quick favorite of young Andy, and the closest of buddies with Woody. While Buzz's sole mission used to be defeating the evil Emperor Zurg, what he now cares about most is keeping his toy family together. Buzz's new mission is sidetracked along the way, however, when his journey brings out surprising aspects of his personality even he didn't know existed.\", 'Jessie', \"Jessie is an exuberant, rough-and-tumble cowgirl doll who's always up for a daring adventure to help critters in need. With Andy's imminent departure hanging over the toys, Jessie is afraid of being abandoned by her owner once again. She takes charge, insisting that the toys take control of their own destinies. But is it a decision they'll later regret!\", 'Rex', 'Rex may look like the most fearsome dinosaur in the toy box, but this tyrannosaurus is one of the most lovable toys of the bunch. Despite his endless worrying and insecurities about his small roar, Rex always comes through for his pals.', 'Hamm', \"A pink piggybank with a penchant for one-liners. He's still a know-it-all, or at least that's what he'd like everyone to believe.\", 'Mr. Potato Head', 'Mr. Potato Head is a wisecracking, hot-headed spud, complete with angry eyes. He\\'s the eternal pessimist with a tough plastic exterior, but his total devotion to his little \"sweet potato,\" Mrs. Potato Head, reveals a softer side..', 'Mrs. Potato Head', 'Mrs. Potato Head is Mr. Potato Head\\'s biggest fan. She adores her brave spud and is always willing to lend him a hand. Or an eye. While Mr. Potato Head\\'s \"sweet potato\" lives up to her pet name, she also shares her husband\\'s hair-trigger temper.', 'Bullseye', 'Bullseye is Woody\\'s trusty toy steed from the \"Woody\\'s Roundup\" gang. Bullseye can ride like the wind and leap across giant canyons in a single bound, especially when Woody is in the saddle.', 'Big Baby', 'Your little one with love this lifelike baby doll with his soft, cuddly fabric body and vinyl arms, legs, and face. With dazzling blue eyes that open and close, this realistic baby encourages nurturing play. Eighteen inches tall, he comes dressed in an adorable yellow onesie with matching bonnet, and has his own magical bottle of milk that disappears while he drinks! A perfect first doll for your special child. Machine washable on gentle cycle. Flame Retardant.', 'Chatter Telephone', \"Ring-ring! The Fisher-Price Chatter Telephone is a classic pull toy that has been inspiring giggles for many generations, while building motor skills and balance. Preschoolers can't resist the friendly face with eyes that move up and down when they pull the toy along, and the bright colors and pleasing sounds keep them happy and engaged. Chatter Telephone is ideal for the little hands in your life.\", 'Mr. Pricklepants', 'Frolic your afternoons away on woodland adventures with Mr. Pricklepants! This charming lederhosen-wearing hedgehog is from the Waldfreunde collection of premium imported plush toys. He may look prickly, but the plump and fuzzy Mr. Pricklepants is made strictly for cuddling! Hand wash and air dry. Restore fluffiness with fingers. Made in Germany.', 'Dolly', 'Dolly is a soft and sweet dress-up rag doll, and is the perfect gift for any young child! Her floppy body and sunny smile will make her an irresistible new member of your family. Dolly has purple hair, googly eyes and gently blushing cheeks. She comes with a pretty blue dress, but templates are included to create and sew your own outfits. Machine washable on gentle cycle.', 'Stretch', 'Stretch is a fun-loving under-the-sea octopus friend that shines in glittery purple. Kids can count her eight rubbery legs and dozens of sticky suckers that are sure to stand up to rough-and-tumble play and extreme stretching. Toss her high on the wall and watch her climb her way down! Clean in mild soap solution to remove dust and lint.', 'Twitch', 'Meet Twitch, the insectaloid warrior, where MAN + INSECT = AWESOME! This sturdy action figure stands over five inches tall, with more than 15 points of articulation, including ferocious chomping mandibles. Use his powerful wings and impenetrable exoskeleton to evade capture! Twitch is meticulously detailed and includes his signature magical battle staff and removable chest armor. For children ages 4 and up. Other insectaloid figures sold separately.', 'Trixie', \"Trixie is a perfect playmate for prehistoric playtime! Visit the era when dinosaurs ruled the Earth! Made of rigid, durable plastic and in friendly shades of blue and purple. Trixie features an expressive mouth and movable legs. This gentle Triceratops will feed any child's imagination. Also available: Tyrannosaurus Rex, Stegosaurus and Velociraptor.\", \"Lots-o'-Huggin' Bear\", \"Lots-o'-Huggin' Bear is a jumbo, extra-soft teddy bear with a pink and white plush body and a velvety purple nose. This lovable bear stands fuzzy heads and shoulders above other teddy bears because he smells like sweet strawberries! With a smile that will light up your child's face and a belly just asking to be hugged. Lots-o'-Huggin' Bear is sure to become a bedtime necessity. Stain-resistant. Spot clean plush surface with a damp cloth.\", 'Ken', \"Grab your binoculars and join Ken on a safari! A swinging bachelor who's always on the lookout for fun, Ken sports the perfect outfit for his eco-adventure: light blue shorts and a leopard-print shirt with short sleeves sure to keep him cool in the hot sun. And after his exciting expedition, Ken will be ready to hit the dance floor in style. His accessories include matching scarf, sensible loafers, and a fashion-forward gold belt. Dozens of additional Ken outfits sold separately.\", 'Meet the voices behind your favorite characters:', \"(From left to right) Tom Hanks as Woody, Tim Allen as Buzz, and Joan Cusack as Jesse  \\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 (From left to right) Ned Beatty as Lots-O', Don Rickles as Mr. Potato Head, and Michael Keaton as Ken\", 'Amazon.com', 'What made the original', 'Toy Story', 'so great, besides its significant achievement as the first-ever feature-length computer animated film, was its ability to instantly transport viewers into a magical world where it seemed completely plausible that toys were living, thinking beings who sprang to life the minute they were alone and wanted nothing more than to be loved and played with by their children.', 'Toy Story 3', \"absolutely succeeds in the very same thing--adults and children alike, whether they've seen the original film or not, find themselves immediately immersed in a world in which Woody (Tom Hanks), Buzz Lightyear (Tim Allen), Jessie (Joan Cusack), Mr. and Mrs. Potato Head (Don Rickles and Estelle Harris), Ham (John Ratzenberger), Rex (Wallace Shawn), the aliens, and the rest of Andy's toys remain completely devoted to Andy (John Morris) even as he's getting ready to pack up and leave for college. Woody scoffs at the other toys' worries that they'll end up in the garbage, assuring them that they've earned a spot of honor in the attic, but when the toys are mistakenly donated to Sunnyside Daycare, Woody is the only toy whose devotion to Andy outweighs the promise of getting played with each and every day. Woody sets off toward home alone while the other toys settle in for some daycare fun, but things don't turn out quite as expected at the daycare thanks to the scheming, strawberry-scented old-timer bear Lots-o'-Huggin' (Ned Beatty). Eventually, Woody rejoins his friends and they all attempt a daring escape from the daycare, which could destroy them all. The pacing of the film is impeccable at this point, although the sense of peril may prove almost too intense for a few young viewers. Pixar's 3-D computer animation is top-notch as always and the voice talent in this film is tremendous, but in the end, it's Pixar's uncanny ability to combine drama, action, and humor in a way that irresistibly draws viewers into the world of the film that makes\", 'Toy Story 3', 'such great family entertainment. (Ages 7 and older)', '--Tami Horiuchi', 'Review', 'Bonus Features', 'Day & Night Theatrical Short Three Studio Stories Plus Much More --Walt Disney Studios Home Entertainment', 'See more']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Tom Hanks, Joan Cusack, Estelle Harris, Ned Beatty, Michael Keaton, Don Rickles, John Ratzenberger, Tim Allen, Lee Unkrich, Wallace ShawnTom Hanks, Joan Cusack, Estelle Harris, Ned Beatty, Michael Keaton, Don Rickles, John Ratzenberger, Tim Allen, Lee Unkrich, Wallace Shawn  See more', 'Language': 'Unqualified, English (Dolby Digital 5.1 EX)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.56 x 5.14 x 7.65 inches; 2.4 Ounces', 'Item model number': '786936805604', 'Director': 'Lee Unkrich', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'November 2, 2010', 'Actors': 'Tom Hanks, Tim Allen, Joan Cusack, Ned Beatty, Don Rickles', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Studio': 'Disney*Pixar', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy 3 yr old grandson watches this over and over and has all of the figures. Best of the 3 Toy Story movies.\nSuch fun to watch over and over for 3 yr old\n{'Subtitles': ['None available'], 'Directors': ['Brian Henson'], 'Studio': ['The Jim Henson Company']}\ndelightful cartoon for young children.  Very well animated for adults to enjoy also. Good educational lesson for kids. Lively entertainment.\nSid the Science Kid\nNorthern Exposure: Season 1 [DVD]\nRob Morrow  (Actor),     Janine Turner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{'Genre': 'Drama, Comedy', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'John Corbett, Rob Morrow, Janine Turner', 'Initial release date': '2012-03-27', 'Language': 'English'}\nMy husband was thrilled to have this DVD of his ever favorite TV show.  He didn't know it was available. This made him so happy!\nNorthern Exposure\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Raja Gosnell'], 'Producers': ['Charles Roven', 'Richard Suckle'], 'Starring': ['Freddie Prinze', 'Jr.', 'Sarah Michelle Gellar', 'Matthew Lillard'], 'Studio': ['WARNER BROS.']}\n4 yr old grandson loved this. And I've gotten in the habit of watching with him!  Well written movie. Watch it.\nGood teenage movie\nNorthern Exposure: The Complete Series\nRob Morrow  (Actor),     Janine Turner  (Actor)    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['All six seasons of Northern Exposure, the groundbreaking Primetime Emmy Award- and Golden Globe-winning hit series, is available in this Amazon-exclusive bundle set! Join Dr. Joel Fleischman (Primetime Emmy Award nominee Rob Morrow), Maggie (Primetime Emmy Award nominee Janine Turner), Chris (Primetime Emmy Award nominee John Corbett) and the rest of the quirky and beloved residents of Cicely, Alaska, as they show how life in a small, arctic town can bring big laughs and heartwarming adventures. Watch all 110 episodes back-to-back and uninterrupted of this 20-disc bundle that’s loaded with bonus features!']\n{'Format': 'NTSC', 'Contributor': 'John Corbett, Rob Morrow, Janine Turner', 'Publication Date': 'September 6, 2013', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.23 x 6.34 x 3.82 inches; 2.47 Pounds', 'Item model number': '11331', 'Media Format': 'NTSC', 'Release date': 'September 6, 2013', 'Actors': 'Rob Morrow, Janine Turner, John Corbett', 'Studio': 'Universal Studios Home Entertainment'}\nMy husband is so happy with this.  It has always been his favorite show so he enjoys watching the series again.\nNorthern Exposure Series\nDespicable Me 2\nSteve Carell  (Actor),     Kristen Wiig  (Actor),     Chris Renaud  (Director),     Pierre Coffin  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', 'Gru, his adorable girls, and the mischievous Minions are back with a cast of unforgettable new characters in the blockbuster sequel to the worldwide phenomenon. Just as Gru has given up being super-bad to be a super-dad, the Anti-Villain League recruits him to track down a new criminal mastermind and save the world. Partnered with secret agent Lucy Wilde, Gru, along with the wildly unpredictable Minions, must figure out how to keep his cover while also keeping up with his duties as a father. Assemble the Minions for laugh-out-loud comedy in \"one of the funniest, most enjoyable movies ever!\" (MovieGuide).', 'There are multiple versions of this movie cover and each shipment is random. Customers are not guaranteed to receive a specific cover or to receive different covers with multiple purchases.', 'Amazon.com', \"Sticky doesn't begin to describe Gru's new life: the ex-supervillain has given up his villainous ways and he and Dr. Nefario (Russell Brand) have settled into the legitimate business of making jellies and jams with the help of his army of minions. Parenting is no less sticky, and the fact that Gru will go to any length to ensure the happiness of his adopted girls Agnes, Edith, and Margo is evident by the elaborate birthday party he's throwing for Agnes that includes a live unicorn and a princess named Gruzinkerbell. Anti-Villain League operative Lucy Wild (Kristen Wiig) kidnaps Gru after the party, using an arsenal of spy gadgetry that would make James Bond jealous, and the agency solicits his help in apprehending a criminal who's made an entire secret lab disappear from the Arctic Circle and stolen a dangerous transmutation formula. The lure of excitement tempts Gru, and he and Lucy set up an undercover operation in a bakery in Paradise Mall, the minions start cranking out cupcakes, and Gru and Lucy begin investigating their fellow business owners. Meanwhile, Agnes pines for a mother, Margo finds her first boyfriend, Dr. Nefario takes a more exciting job, a slew of minions go missing, and Gru staunchly refuses to enter the dating scene. Little does Gru know that his whole life is about to change once again. The minions and their antics are quite funny in this second film, and, for the 10-and-under crowd, they completely steal the show. For the older crowd, the film does a decent job of further developing Gru's character and provides lots of comedic material in the exaggeration of the many challenges of parenthood as well as through the wacky exploits of the minions. (Ages 6 and older)\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family, Animation, Comedy', 'Format': 'Animated, Color, NTSC, Widescreen', 'Contributor': 'Elsie Kate Fisher, Steve Carell, Nasim Pedrad, Christopher Meledandri, Pierre Coffin, Ken Jeong, Ken Daurio, Dana Gaier, Cinco Paul, Chris Renaud, Gregory Perler, Janet Healy, Benjamin Bratt, Miranda Cosgrove, Moises Arias, Kristen Wiig, Russell Brand, Steve CooganElsie Kate Fisher, Steve Carell, Nasim Pedrad, Christopher Meledandri, Pierre Coffin, Ken Jeong, Ken Daurio, Dana Gaier, Cinco Paul, Chris Renaud, Gregory Perler, Janet Healy, Benjamin Bratt, Miranda Cosgrove, Moises Arias, Kristen Wiig, Russell Brand, Steve Coogan  See more', 'Initial release date': '2013-12-10', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': 'D61120669D', 'Director': 'Chris Renaud, Pierre Coffin', 'Media Format': 'Animated, Color, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'December 10, 2013', 'Actors': 'Steve Carell, Kristen Wiig, Benjamin Bratt, Ken Jeong, Miranda Cosgrove', 'Subtitles': 'Spanish, French', 'Producers': 'Christopher Meledandri, Janet Healy', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Cinco Paul, Ken Daurio', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe love this movie.  Our 4 yr old has watched it several times and we have watched it with him and loved every second.  Great job on the #2.\nBetter than the First one\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrea Ambandos'], 'Starring': ['Jillian Michaels'], 'Studio': ['Lionsgate']}\nJillian shows moves for both beginners and higher and is easy to follow.  Easy for beginners. Easy for us older people\nBest Yoga workout ever\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Kris Greengrove', 'Susan Holden', 'Steve Oakes', 'David Starr', 'Richard Winkler', 'Soo Kim', 'Jennifer Twomey', 'Marcy Pritchard', 'Amy Steinberg', 'Max Goodman']}\nmy 5 yr old really enjoys this series.  nice for kids with nothing bad to worry about. Just pleasant tv.\nGood show for kids\nDESPICABLE ME MINION MAD DVD\nMiranda Cosgrove  (Actor),     Dana Gaier  (Actor),     Kyle Balda  (Director),     Samuel Tourneux  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"3 New Mini-Movies starring the minions created exclusively for DVD! Orientation Day: It's new minion Orientation Day! See what happens when Gru's newest workers start their training.Home Makeover: While Gru's away, Margo, Edith, and Agnes recruit the minions to make their home family-friendly.Banana: A lunchtime argument over a tasty treat turns into a minion free-for-all!\", 'Bonus Content:', 'Super Silly Fun Land', 'Super Silly Fun Land', ']]>']\n{'Genre': 'Kids & Family, Animation, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Animated', 'Contributor': 'Elsie Fisher, Rob Huebel, Kyle Balda, Chris Meledandri, Brett Hoffman, Pierre Coffin, Ken Daurio, Dana Gaier, Cinco Paul, Janet Healy, Samuel Tourneux, Miranda Cosgrove, John CohenElsie Fisher, Rob Huebel, Kyle Balda, Chris Meledandri, Brett Hoffman, Pierre Coffin, Ken Daurio, Dana Gaier, Cinco Paul, Janet Healy, Samuel Tourneux, Miranda Cosgrove, John Cohen   See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': 'Unknown', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '25366020', 'Director': 'Kyle Balda, Samuel Tourneux', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Animated', 'Run time': '12 minutes', 'Release date': 'January 7, 2014', 'Actors': 'Miranda Cosgrove, Dana Gaier, Elsie Fisher, Pierre Coffin, Rob Huebel', 'Subtitles': 'Spanish, French', 'Producers': 'Chris Meledandri, Janet Healy, John Cohen', 'Studio': 'Studio Distribution Services', 'Writers': 'Brett Hoffman, Cinco Paul, Ken Daurio, Pierre Coffin', 'Number of discs': '1'}\nMy 5 yr old son plays with this every day.  His reflexes are faster than mine.  I tried to play it, but too slow!  He gets a lot more points than I do. Great game!!!\nMinion Game\nUp (Single-Disc Edition)\nEdward Asner  (Actor),     Jordan Nagai  (Actor),     Pete Docter  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'Walt Disney Pictures and Pixar Animation Studios take moviegoers up, up and away on one of the funniest adventures of all time with their latest comedy-fantasy.', 'Up', 'follows the uplifting tale of 78-year-old balloon salesman Carl Fredricksen, who finally fulfills his lifelong dream of a great adventure when he ties thousands of balloons to his house and flies away to the wilds of South America. But he discovers all too late that his biggest nightmare has stowed away on the trip an overly optimistic 8-year-old Wilderness Explorer named Russell. Their journey to a lost world, where they encounter some strange, exotic and surprising characters, is filled with hilarity, emotion and wildly imaginative adventure.', 'Amazon.com', 'At a time when too many animated films consist of anthropomorphized animals cracking sitcom one-liners and flatulence jokes, the warmth, originality, humor, and unflagging imagination of', 'Up', \"feel as welcome as rain in a desert. Carl Fredericksen (voice by Ed Asner) ranks among the most unlikely heroes in recent animation history. A 78- year-old curmudgeon, he enjoyed his modest life as a balloon seller because he shared it with his adventurous wife Ellie (Ellie Docter). But she died, leaving him with memories and the awareness that they never made their dream journey to Paradise Falls in South America. When well-meaning officials consign Carl to Shady Oaks Retirement Home, he rigs thousands of helium balloons to his house and floats to South America. The journey's scarcely begun when he discovers a stowaway: Russell (Jordan Nagai), a chubby, maladroit Wilderness Explorer Scout who's out to earn his Elderly Assistance Badge. In the tropical jungle, Carl and Russell find more than they bargained for: Charles Muntz (Christopher Plummer), a crazed explorer whose newsreels once inspired Carl and Ellie; Kevin, an exotic bird with a weakness for chocolate; and Dug (Bob Peterson), an endearingly dim golden retriever fitted with a voice box. More importantly, the travelers discover they need each other: Russell needs a (grand)father figure; Carl needs someone to enliven his life without Ellie. Together, they learn that sharing ice-cream cones and counting the passing cars can be more meaningful than feats of daring-do and distant horizons. Pete Docter (\", 'Monsters, Inc', \". ) and Bob Peterson direct the film with consummate skill and taste, allowing the poignant moments to unfold without dialogue to Michael Giacchnio's vibrant score. Building on their work in\", 'The Incredibles', 'and', 'Ratatouille', \", the Pixar crew offers nuanced animation of the stylized characters. Even by Pixar's elevated standards,\", 'Up', 'is an exceptional film that will appeal of audiences of all ages. Rated PG for some peril and action. --', 'Charles Solomon', 'Stills from', 'Up', '(Click for larger image)']\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Color, AC-3, Dolby, Animated, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Delroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Edward Asner, Thomas McCarthy, Mickie McGowan, Jerome Ranft, Christopher Plummer, John Ratzenberger, Danny Mann, Bob Peterson, David Kaye, Jeremy LearyDelroy Lindo, Elie Docter, Pete Docter, Jordan Nagai, Edward Asner, Thomas McCarthy, Mickie McGowan, Jerome Ranft, Christopher Plummer, John Ratzenberger, Danny Mann, Bob Peterson, David Kaye, Jeremy Leary  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': 'WD10041200DVD', 'Director': 'Bob Peterson, Pete Docter', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, Animated, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Edward Asner, Jordan Nagai, John Ratzenberger, Christopher Plummer, Bob Peterson', 'Dubbed': 'Spanish, French', 'Subtitles': 'French, Spanish', 'Studio': 'Disney Pixar', 'Writers': 'Bob Peterson, Pete Docter, Thomas McCarthy', 'Number of discs': '1'}\nWe love this movie. Have watched it several times\nMovie UP\nE.T. The Extra-Terrestrial\nHenry Thomas  (Actor),     Drew Barrymore  (Actor),     Steven Spielberg  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Relive the adventure and magic in one of the most beloved motion pictures of all-time, E.T. The Extra-Terrestrial, from Academy Award-winning director Steven Spielberg. Captivating audiences of all ages, this timeless story follows the unforgettable journey of a lost alien and the 10-year-old boy he befriends. Join Elliot (Henry Thomas), Gertie (Drew Barrymore) and Michael (Robert MacNaughton) as they come together to help E.T. find his way back home. Now digitally remastered with enhanced picture and sound for its 30th Anniversary, E.T. The Extra-Terrestrial is \"one of the great American films\" (Leonard Maltin) that forever belongs in the hearts and minds of audiences everywhere.Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Steven Spielberg & E.T.', 'Steven Spielberg & E.T.', 'A Look Back', 'A Look Back', 'The E.T. Reunion', 'The E.T. Reunion']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.4 x 0.55 inches; 3.2 Ounces', 'Item model number': '25674455', 'Director': 'Steven Spielberg', 'Media Format': 'AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Henry Thomas, Drew Barrymore, Dee Wallace, Robert MacNaughton, Peter Coyote', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Steven Spielberg, Kathleen Kennedy', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Melissa Mathison', 'Number of discs': '1'}\nAfter riding the ET ride in Orlando, we loved seeing the movie - again for me, first time for my 5 yr old son.  The ride had 4 bicycles in a row instead of the usual car which made it even more fun.  So seeing the movie, my son understood why we got to ride the bikes.  Real fun!\nE.T. the great movie\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'David Evans', 'Philip John', 'Andy Goddard', 'Catherine Morshead', 'Minkie Spiro', 'Brian Kelly', 'Michael Engler', 'Ben Bolt', 'Ashley Pearce'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nCould watch this all day long.\nBest series ever\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Tim Burton'], 'Producers': ['Peter Guber', 'Tim Burton', 'Benjamin Melniker', 'Denise Di Novi', 'Jon Peters', 'Michael E. Uslan'], 'Starring': ['Michael Keaton', 'Michelle Pfeiffer', 'Christopher Walken'], 'Studio': ['WARNER BROS.']}\nEnjoyable!\nBatman movie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Luke Cormican', 'Peter Rida Michail', 'James Krenzke', 'Ken McIntyre', 'Dave Stone', \"Scott O'Brien\", 'Noel Belknap', 'Bryan Newton', 'Careen Ingle', 'Jeff Mednikow'], 'Producers': ['Michael Jelenic', 'Aaron Horvath'], 'Starring': ['Scott Menville', 'Hynden Walch', 'Khary Payton']}\ngood\nFive Stars",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Five Stars",
    "text": "good",
    "images": [],
    "asin": "B00KVSALR8",
    "parent_asin": "B00KVSALR8",
    "user_id": "AFYX5DXWJ5STZHJMEDIEPMOCQLPA",
    "timestamp": "2015-12-01 22:49:33",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.6,
    "rating_number": 302,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cfbe749431493e8c7f5043042244e3964aef91e4be06435c8ffad57aac40bec4._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cfbe749431493e8c7f5043042244e3964aef91e4be06435c8ffad57aac40bec4._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cfbe749431493e8c7f5043042244e3964aef91e4be06435c8ffad57aac40bec4._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cfbe749431493e8c7f5043042244e3964aef91e4be06435c8ffad57aac40bec4._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cfbe749431493e8c7f5043042244e3964aef91e4be06435c8ffad57aac40bec4._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/cfbe749431493e8c7f5043042244e3964aef91e4be06435c8ffad57aac40bec4._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Luke Cormican",
        "Peter Rida Michail",
        "James Krenzke",
        "Ken McIntyre",
        "Dave Stone",
        "Scott O'Brien",
        "Noel Belknap",
        "Bryan Newton",
        "Careen Ingle",
        "Jeff Mednikow"
      ],
      "Producers": [
        "Michael Jelenic",
        "Aaron Horvath"
      ],
      "Starring": [
        "Scott Menville",
        "Hynden Walch",
        "Khary Payton"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}