{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2012/12/26\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Brian Henson'], 'Studio': ['The Jim Henson Company']}\nReview Text: delightful cartoon for young children.  Very well animated for adults to enjoy also. Good educational lesson for kids. Lively entertainment.\nReview Title: Sid the Science Kid\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Toy Story 3\nTom Hanks  (Actor),     Tim Allen  (Actor),     Lee Unkrich  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'The creative minds behind Disney•Pixar\\'s groundbreaking animated blockbusters invites you back inside the Toys\\' delightful world for a heartwarming and hilarious Hi-Definition movie experience you\\'ll never forget. All the original voice talent returns (including Tom Hanks and Tim Allen) plus new talent including Michael Keaton as Ken and Ned Beatty as Lots-O\\'-Huggin\\' Bear. It\\'s \"the biggest, best, most exciting Toy Story of them all,\" raves Access Hollywood.', 'As Andy gets ready to leave for college, Woody, Buzz, Jessie and the rest of the gang wonder if this is the end of the line. But, when a mix up lands them in the Sunnyside Day Care Center where they meet 14 new toys, they soon discover that a wild new adventure is just beginning! Take an amazing journey with some of the most beloved characters in movie history and discover what being a friend is truly all about.', '\"It\\'s everything a movie should be: hilarious, touching, exciting and clever,\" says USA Today. Buzzing with hours of exclusive bonus features, including an interactive trivia game and the Pixar short film Day and Night, Toy Story 3 goes to infinity and beyond on Blu-ray Hi-Def!', 'Meet the Characters', 'Woody', 'Woody is a cowboy sheriff with a pull-string that, when pulled proclaims Woody\\'s signature catchphrases from the 1950s TV show \"Woody\\'s Roundup.\" He\\'s always been Andy\\'s favorite toy. Even though his owner is now grown, the loyal sheriff Woody maintains a steadfast belief that Andy still cares about his toys. As the toys venture into their unknown future, Woody remains the voice of reason. As their dependable leader, he ensures that no toy gets left behind.', 'Buzz Lightyear', \"Buzz Lightyear is a heroic space ranger action figure, complete with laser beam, karate-chop action and pop-out wings. Buzz is a boy's dream toy who becomes a quick favorite of young Andy, and the closest of buddies with Woody. While Buzz's sole mission used to be defeating the evil Emperor Zurg, what he now cares about most is keeping his toy family together. Buzz's new mission is sidetracked along the way, however, when his journey brings out surprising aspects of his personality even he didn't know existed.\", 'Jessie', \"Jessie is an exuberant, rough-and-tumble cowgirl doll who's always up for a daring adventure to help critters in need. With Andy's imminent departure hanging over the toys, Jessie is afraid of being abandoned by her owner once again. She takes charge, insisting that the toys take control of their own destinies. But is it a decision they'll later regret!\", 'Rex', 'Rex may look like the most fearsome dinosaur in the toy box, but this tyrannosaurus is one of the most lovable toys of the bunch. Despite his endless worrying and insecurities about his small roar, Rex always comes through for his pals.', 'Hamm', \"A pink piggybank with a penchant for one-liners. He's still a know-it-all, or at least that's what he'd like everyone to believe.\", 'Mr. Potato Head', 'Mr. Potato Head is a wisecracking, hot-headed spud, complete with angry eyes. He\\'s the eternal pessimist with a tough plastic exterior, but his total devotion to his little \"sweet potato,\" Mrs. Potato Head, reveals a softer side..', 'Mrs. Potato Head', 'Mrs. Potato Head is Mr. Potato Head\\'s biggest fan. She adores her brave spud and is always willing to lend him a hand. Or an eye. While Mr. Potato Head\\'s \"sweet potato\" lives up to her pet name, she also shares her husband\\'s hair-trigger temper.', 'Bullseye', 'Bullseye is Woody\\'s trusty toy steed from the \"Woody\\'s Roundup\" gang. Bullseye can ride like the wind and leap across giant canyons in a single bound, especially when Woody is in the saddle.', 'Big Baby', 'Your little one with love this lifelike baby doll with his soft, cuddly fabric body and vinyl arms, legs, and face. With dazzling blue eyes that open and close, this realistic baby encourages nurturing play. Eighteen inches tall, he comes dressed in an adorable yellow onesie with matching bonnet, and has his own magical bottle of milk that disappears while he drinks! A perfect first doll for your special child. Machine washable on gentle cycle. Flame Retardant.', 'Chatter Telephone', \"Ring-ring! The Fisher-Price Chatter Telephone is a classic pull toy that has been inspiring giggles for many generations, while building motor skills and balance. Preschoolers can't resist the friendly face with eyes that move up and down when they pull the toy along, and the bright colors and pleasing sounds keep them happy and engaged. Chatter Telephone is ideal for the little hands in your life.\", 'Mr. Pricklepants', 'Frolic your afternoons away on woodland adventures with Mr. Pricklepants! This charming lederhosen-wearing hedgehog is from the Waldfreunde collection of premium imported plush toys. He may look prickly, but the plump and fuzzy Mr. Pricklepants is made strictly for cuddling! Hand wash and air dry. Restore fluffiness with fingers. Made in Germany.', 'Dolly', 'Dolly is a soft and sweet dress-up rag doll, and is the perfect gift for any young child! Her floppy body and sunny smile will make her an irresistible new member of your family. Dolly has purple hair, googly eyes and gently blushing cheeks. She comes with a pretty blue dress, but templates are included to create and sew your own outfits. Machine washable on gentle cycle.', 'Stretch', 'Stretch is a fun-loving under-the-sea octopus friend that shines in glittery purple. Kids can count her eight rubbery legs and dozens of sticky suckers that are sure to stand up to rough-and-tumble play and extreme stretching. Toss her high on the wall and watch her climb her way down! Clean in mild soap solution to remove dust and lint.', 'Twitch', 'Meet Twitch, the insectaloid warrior, where MAN + INSECT = AWESOME! This sturdy action figure stands over five inches tall, with more than 15 points of articulation, including ferocious chomping mandibles. Use his powerful wings and impenetrable exoskeleton to evade capture! Twitch is meticulously detailed and includes his signature magical battle staff and removable chest armor. For children ages 4 and up. Other insectaloid figures sold separately.', 'Trixie', \"Trixie is a perfect playmate for prehistoric playtime! Visit the era when dinosaurs ruled the Earth! Made of rigid, durable plastic and in friendly shades of blue and purple. Trixie features an expressive mouth and movable legs. This gentle Triceratops will feed any child's imagination. Also available: Tyrannosaurus Rex, Stegosaurus and Velociraptor.\", \"Lots-o'-Huggin' Bear\", \"Lots-o'-Huggin' Bear is a jumbo, extra-soft teddy bear with a pink and white plush body and a velvety purple nose. This lovable bear stands fuzzy heads and shoulders above other teddy bears because he smells like sweet strawberries! With a smile that will light up your child's face and a belly just asking to be hugged. Lots-o'-Huggin' Bear is sure to become a bedtime necessity. Stain-resistant. Spot clean plush surface with a damp cloth.\", 'Ken', \"Grab your binoculars and join Ken on a safari! A swinging bachelor who's always on the lookout for fun, Ken sports the perfect outfit for his eco-adventure: light blue shorts and a leopard-print shirt with short sleeves sure to keep him cool in the hot sun. And after his exciting expedition, Ken will be ready to hit the dance floor in style. His accessories include matching scarf, sensible loafers, and a fashion-forward gold belt. Dozens of additional Ken outfits sold separately.\", 'Meet the voices behind your favorite characters:', \"(From left to right) Tom Hanks as Woody, Tim Allen as Buzz, and Joan Cusack as Jesse  \\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 (From left to right) Ned Beatty as Lots-O', Don Rickles as Mr. Potato Head, and Michael Keaton as Ken\", 'Amazon.com', 'What made the original', 'Toy Story', 'so great, besides its significant achievement as the first-ever feature-length computer animated film, was its ability to instantly transport viewers into a magical world where it seemed completely plausible that toys were living, thinking beings who sprang to life the minute they were alone and wanted nothing more than to be loved and played with by their children.', 'Toy Story 3', \"absolutely succeeds in the very same thing--adults and children alike, whether they've seen the original film or not, find themselves immediately immersed in a world in which Woody (Tom Hanks), Buzz Lightyear (Tim Allen), Jessie (Joan Cusack), Mr. and Mrs. Potato Head (Don Rickles and Estelle Harris), Ham (John Ratzenberger), Rex (Wallace Shawn), the aliens, and the rest of Andy's toys remain completely devoted to Andy (John Morris) even as he's getting ready to pack up and leave for college. Woody scoffs at the other toys' worries that they'll end up in the garbage, assuring them that they've earned a spot of honor in the attic, but when the toys are mistakenly donated to Sunnyside Daycare, Woody is the only toy whose devotion to Andy outweighs the promise of getting played with each and every day. Woody sets off toward home alone while the other toys settle in for some daycare fun, but things don't turn out quite as expected at the daycare thanks to the scheming, strawberry-scented old-timer bear Lots-o'-Huggin' (Ned Beatty). Eventually, Woody rejoins his friends and they all attempt a daring escape from the daycare, which could destroy them all. The pacing of the film is impeccable at this point, although the sense of peril may prove almost too intense for a few young viewers. Pixar's 3-D computer animation is top-notch as always and the voice talent in this film is tremendous, but in the end, it's Pixar's uncanny ability to combine drama, action, and humor in a way that irresistibly draws viewers into the world of the film that makes\", 'Toy Story 3', 'such great family entertainment. (Ages 7 and older)', '--Tami Horiuchi', 'Review', 'Bonus Features', 'Day & Night Theatrical Short Three Studio Stories Plus Much More --Walt Disney Studios Home Entertainment', 'See more']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Tom Hanks, Joan Cusack, Estelle Harris, Ned Beatty, Michael Keaton, Don Rickles, John Ratzenberger, Tim Allen, Lee Unkrich, Wallace ShawnTom Hanks, Joan Cusack, Estelle Harris, Ned Beatty, Michael Keaton, Don Rickles, John Ratzenberger, Tim Allen, Lee Unkrich, Wallace Shawn  See more', 'Language': 'Unqualified, English (Dolby Digital 5.1 EX)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.56 x 5.14 x 7.65 inches; 2.4 Ounces', 'Item model number': '786936805604', 'Director': 'Lee Unkrich', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'November 2, 2010', 'Actors': 'Tom Hanks, Tim Allen, Joan Cusack, Ned Beatty, Don Rickles', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Studio': 'Disney*Pixar', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy 3 yr old grandson watches this over and over and has all of the figures. Best of the 3 Toy Story movies.\nSuch fun to watch over and over for 3 yr old\n{'Subtitles': ['None available'], 'Directors': ['Brian Henson'], 'Studio': ['The Jim Henson Company']}\ndelightful cartoon for young children.  Very well animated for adults to enjoy also. Good educational lesson for kids. Lively entertainment.\nSid the Science Kid",
  "profile": "**User Profile Summary:**\n\n- **Film Preferences**: Enthusiastic about animated family films, particularly those from Disney, Pixar, and other family-friendly studios. Displays a strong appreciation for content that is both entertaining and educational, emphasizing heartwarming narratives suitable for young audiences.\n\n- **Audience Focus**: Likely a grandparent or caregiver, as evidenced by interactions mentioning a young grandson. Values films that captivate children's attention and offer engaging, repeat viewing experiences that foster familial connections.\n\n- **Character Affinity**: Shows a fondness for nostalgic and iconic characters, reflecting an emotional resonance with beloved figures that enrich family viewing moments.\n\n- **Fun Factor**: Prioritizes entertainment that is lively and interactive, highlighting a desire for quality content that encourages imaginative play and enhances children's learning experiences.\n\n- **Engagement with Product**: Reviews indicate a focus on films that provide both enjoyment and educational value, suggesting a commitment to selecting content that nurtures young viewers’ growth and creativity.\n\n- **Rating Tendencies**: Tends to give high ratings to films that offer positive experiences in family entertainment contexts, showcasing a preference for universally enjoyable films that provide joyful experiences for children and adults alike.\n\nOverall, this user appreciates animated films that create delightful and enriching experiences for children, while also valuing engaging content that reflects their own fond memories with classic characters.",
  "metrics": {
    "rouge1_f": 0.10828025477707005,
    "rouge2_f": 0.00819672131147541,
    "rougeL_f": 0.051865332120109194,
    "meteor": 0.035139222489102395,
    "bleu1": 0.00013383790771592796,
    "bleu2": 3.4057991416072145e-05,
    "bleu3": 5.015044938962155e-06,
    "bleu4": 1.9262320773243697e-06,
    "bertscore_precision": 0.35905057191848755,
    "bertscore_recall": 0.5044302344322205,
    "bertscore_f1": 0.41950201988220215
  }
}