{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Birds of America\nReview Date: 2011/03/15\nStore: Matthew Perry  (Actor),     Hilary Swank  (Actor),     Craig Lucas  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Independently Distributed, Comedy\nProduct Description: [\"Morrie's (Matthew Perry) life is unraveling. As his family's antics infuriate his boss and neighbor, Morrie's dreams of success are quickly destroyed. Morrie gets a wake-up call and he comes to realize that the people who really care for him will stand by his side no matter what.\"]\nAverage Rating: 3.7\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, AC-3, Dolby', 'Contributor': 'Ben Foster, Matthew Perry, Lauren Graham, Craig Lucas, Ginnifer Goodwin, Zoe Kravitz, Hilary Swank', 'Language': 'English', 'Runtime': '1 hour and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': '687797125897', 'Director': 'Craig Lucas', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, AC-3, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'October 21, 2008', 'Actors': 'Matthew Perry, Hilary Swank, Lauren Graham, Ben Foster, Ginnifer Goodwin', 'Subtitles': 'Spanish', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nReview Text: This is one of the best movies I've seen this year. Surprisingly so, because it is habitually rated just average on the various sites like Amazon and IMDB. People don't seem to understand the very deep and beautiful psychology of this movie, which ultimately culminates in discovering what and where a person's real freedom is. Not in a political way, but in a liberating, \"life's journey\" kind of way. This movie is beautifully written, which is a tricky matter when dealing with this level of intellectualism. It stops short of being preachy or over-written. It is perfect! The casting is excellent too. Each character has great depth (or shallowness) that is magnificently represented by the actors chosen for each role. The pacing is also very well done, as is the score and the camera work. All in all, when it was over, I was ready to start watching it all over again. I really actually wish the whole story would have stretched much longer. It was sheer delight.<br /><br />A movie about recognizing the chains that bind you and the love that frees you.\nReview Title: My New Favorite Movie this Year!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "My House In Umbria (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'My House In Umbria (DVD)', 'A train, traveling gently through the rolling hills of the Italian countryside, explodes. In one carriage, there are four survivors: \"The General,\" an elderly English gentleman, Werner, a young German, aimee, an orphaned eight-year old girl, and emily Delahunty, an English novelist who invites them to her home to recuperate. Thrown together by misfortune, they find themselves attempting to rework the torn fabric of their lives, while a concerned police inspector attempts to piece together the events that brought them there. When aimee\\'s straightlaced American uncle arrives to take her away, it shakes an already delicate household to the core. Will the magic of emily\\'s house in Umbria bring happiness to all? or will happiness prove as elusive as the answers to the quesitons that bind them together?', ']]>', 'Amazon.com', 'Falling neatly into the', 'Enchanted April', 'and', 'Under the Tuscan Sun', 'category, the made-for-HBO', 'My House in Umbria', \"boasts lovely Italian vistas and comforting Englishness. But it begins with a note of violence: on a train rolling through the sunny countryside, a terrorist bomb detonates, killing a handful of passengers. The strangers that survive recuperate at the villa of an eccentric but kindly romance novelist, also a survivor of the blast. She's played by Maggie Smith, who bustles through the role with a pleasing mix of gin and daffodils. Chris Cooper is an uptight American who comes to the villa to pick up his orphaned niece and bristles at the bohemian atmosphere. Director Richard Loncraine maintains the melancholy mood amidst the sun-dappled gardens of Umbria, but Smith really holds the film together with her authority and slightly tipsy humor.\", '--Robert Horton']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Various', 'Initial release date': '2005-04-12', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 4.0), Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'HBO92032DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'April 12, 2005', 'Actors': 'Various', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'HBO Studios', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have to give this movie a very mixed review. On the one hand, the storyline, the script, the score and the acting are fairly reliably horrendous throughout. The storyline is weak, choppy, and drags on miserably. The characters are not very likable (to put it mildly...), and even the most gifted ones (Maggie Smith, Timothy Spall, Chris Cooper and Giancarlo Giannini) are effectively dragged down and their abilities trampled by the leaden script and the absolute lack of talent of some of the other actors. In particular, Bernard Furmann turns in a devastatingly feeble performance that makes you wonder if he's ever darkened the doorstep of an acting school.<br /><br />However, on the other hand, the Italian scenery, that wonderful house, with its beautiful garden and setting, and the cinematography are beyond amazingly gorgeous - all of them. As such, I have now seen this movie at least half a dozen times in the past few months, trying to ignore the fallow storyline and the lame acting, and am quite determined to retire in that region of Italy and, preferably, in that very house.<br /><br />Take from that what you will....\nVery (!) mixed feelings about this movie...\nBirds of America\nMatthew Perry  (Actor),     Hilary Swank  (Actor),     Craig Lucas  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Independently Distributed, Comedy\n[\"Morrie's (Matthew Perry) life is unraveling. As his family's antics infuriate his boss and neighbor, Morrie's dreams of success are quickly destroyed. Morrie gets a wake-up call and he comes to realize that the people who really care for him will stand by his side no matter what.\"]\n{'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, AC-3, Dolby', 'Contributor': 'Ben Foster, Matthew Perry, Lauren Graham, Craig Lucas, Ginnifer Goodwin, Zoe Kravitz, Hilary Swank', 'Language': 'English', 'Runtime': '1 hour and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': '687797125897', 'Director': 'Craig Lucas', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, AC-3, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'October 21, 2008', 'Actors': 'Matthew Perry, Hilary Swank, Lauren Graham, Ben Foster, Ginnifer Goodwin', 'Subtitles': 'Spanish', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nThis is one of the best movies I've seen this year. Surprisingly so, because it is habitually rated just average on the various sites like Amazon and IMDB. People don't seem to understand the very deep and beautiful psychology of this movie, which ultimately culminates in discovering what and where a person's real freedom is. Not in a political way, but in a liberating, \"life's journey\" kind of way. This movie is beautifully written, which is a tricky matter when dealing with this level of intellectualism. It stops short of being preachy or over-written. It is perfect! The casting is excellent too. Each character has great depth (or shallowness) that is magnificently represented by the actors chosen for each role. The pacing is also very well done, as is the score and the camera work. All in all, when it was over, I was ready to start watching it all over again. I really actually wish the whole story would have stretched much longer. It was sheer delight.<br /><br />A movie about recognizing the chains that bind you and the love that frees you.\nMy New Favorite Movie this Year!",
  "profile": "**User Profile Summary:**\n\nThis user exhibits a clear inclination towards dramatic films that feature rich visual aesthetics, particularly those set in picturesque locations such as Italy. They appreciate the beauty of cinematography and scenic settings over the strength of the storyline and character development. Notably, they have shown a recent preference for films that explore deeper psychological themes and emotional journeys, as evidenced by their enthusiastic response to a film they found unexpectedly profound, skillfully written, and beautifully cast. \n\nKey preferences include:\n- **Genres:** Drama with an appreciation for character-driven narratives, psychological themes, and comedy.\n- **Settings:** Enchanted, picturesque locations, particularly Italy, but also enjoy varied settings that enhance the narrative.\n- **Aesthetic Appreciation:** Highly values cinematography, scenery, production quality, and careful character representation.\n- **Viewing Habits:** Open to watching films multiple times, often driven by a combination of visual and emotional resonance, regardless of initial mixed reviews.\n\nOverall, this user prioritizes the visual and emotional atmosphere of films, demonstrating a preference for experiential viewing experiences that resonate deeply, whether through rich visuals or thoughtful storytelling.",
  "metrics": {
    "rouge1_f": 0.13265306122448978,
    "rouge2_f": 0.010221465076660989,
    "rougeL_f": 0.05952380952380952,
    "meteor": 0.047607712449416806,
    "bleu1": 0.0026939342669960275,
    "bleu2": 0.0009235786931763578,
    "bleu3": 0.00013510697999583277,
    "bleu4": 5.173223089684297e-05,
    "bertscore_precision": 0.3584124445915222,
    "bertscore_recall": 0.47621697187423706,
    "bertscore_f1": 0.4090009033679962
  }
}