{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/12/31\nAverage Rating: 3.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Jay Willis'], 'Producers': ['Jay Kogen', 'Katherine Botts', 'Geralyn Flood'], 'Starring': ['Nicole Sullivan', 'Juliette Angelo', 'Beth Littleford'], 'Studio': ['United States Motion Picture Company']}\nReview Text: 95% of the movie was a boring story line of a teenage romance. The only funny part was the stand-in parents. Don't waste your money. Wait for the snippets on Youtube.\nReview Title: Boring Teen Girl movie.\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Squanto: A Warrior's Tale\nDrama, Adventure, Thrilling, Ambitious\n['Squanto, a young warrior abducted from his homeland and enslaved, must battle impossible hazards on a desperate journey home. Driven by a passion to be free, he risks everything to escape his captors.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Xavier Koller'], 'Producers': ['Kathryn F. Galan'], 'Starring': ['Adam Beach', 'Eric Schweig', 'Michael Gambon']}\nA historically inaccurate piece of trash.  Whoever was the consultant/scriptwriter of this film, is an ignoramus of history.  After watching this film in agony on Thanksgiving eve,  I wanted to fall on my spear.\nWorst Thanksgiving movie ever!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Ford'], 'Producers': ['Sol M. Wurtzel'], 'Starring': ['Will Rogers', 'Anita Louise', 'Tom Brown'], 'Studio': ['Reel Enterprises']}\nLoved the twist of the plot.\nExcellent Movie Depicting a Long Gone Era!\nApocalypto [Import allemand]\nFormat: DVD\nMovies & TV, Movies\n{'Aspect Ratio': '1.85:1', 'Package Dimensions': '7.56 x 5.31 x 0.59 inches; 2.93 Ounces', 'Subtitles': 'German', 'Country of Origin': 'France'}\nI had a hard time finding this film with English subtitles. So I bought this DVD with German subtitles and added English subtitles using VLC.\nGood price and fast delivery\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Jay Willis'], 'Producers': ['Jay Kogen', 'Katherine Botts', 'Geralyn Flood'], 'Starring': ['Nicole Sullivan', 'Juliette Angelo', 'Beth Littleford'], 'Studio': ['United States Motion Picture Company']}\n95% of the movie was a boring story line of a teenage romance. The only funny part was the stand-in parents. Don't waste your money. Wait for the snippets on Youtube.\nBoring Teen Girl movie.",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests in Film Genres:** The user continues to favor drama and adventure films, particularly those with intricate plots. Their recent interaction has introduced a critical perspective on teenage romance films, indicating a more discerning approach to the types of narratives they find engaging.\n\n- **Value for Historical Accuracy:** While historically accurate portrayals are still significant, the user remains flexible. They enjoy films set in historical contexts but are increasingly critical of narratives that lack depth or originality, even if they are not strictly factual.\n\n- **Critical Reviewing Style:** The user maintains a discerning approach, providing thoughtful feedback on films. Their latest review highlights a strong negative reaction to a film that didn’t meet their standards, notably critiquing its boring storyline and lack of engagement, which may suggest a heightened expectation for captivating narratives in all genres.\n\n- **Emotional Engagement:** Their commitment to emotional depth persists, although their recent review reveals a willingness to criticize films that fail to connect emotionally, especially in genres that may traditionally appeal to younger viewers.\n\n- **Expectations for Quality:** The user has set high standards for quality and is becoming more selective, indicating a potential narrowing of genres they are willing to explore. This evolution emphasizes the importance of compelling storytelling and character development, regardless of the film's target audience.\n\n**Overall Trends:** The user prioritizes emotional engagement and narrative complexity, becoming increasingly discerning about the quality of films, particularly in genres that may not align with their established preferences.",
  "metrics": {
    "rouge1_f": 0.20662768031189085,
    "rouge2_f": 0.007827788649706457,
    "rougeL_f": 0.09746588693957114,
    "meteor": 0.10909034278744051,
    "bleu1": 0.14894084166406668,
    "bleu2": 0.0252163015136699,
    "bleu3": 0.005144736933578447,
    "bleu4": 0.0023257185141594317,
    "bertscore_precision": 0.3775865435600281,
    "bertscore_recall": 0.4126893877983093,
    "bertscore_f1": 0.394358366727829
  }
}