{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/07/13\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Eyre', 'Sanford Bookstaver'], 'Producers': ['Jason Ballantyne', 'Vince Calandra', 'Kathleen DeRose', 'J. Kathleen Gibson', 'Anne Hillerman', 'George R.R. Martin', 'Zahn McClarnon', 'Robert Redford'], 'Starring': ['Zahn McClarnon', 'Kiowa Gordon', 'Jessica Matten']}\nReview Text: Finally,  a western who-done-it that is on par with Longmire.\nReview Title: Finally\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Squanto: A Warrior's Tale\nDrama, Adventure, Thrilling, Ambitious\n['Squanto, a young warrior abducted from his homeland and enslaved, must battle impossible hazards on a desperate journey home. Driven by a passion to be free, he risks everything to escape his captors.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Xavier Koller'], 'Producers': ['Kathryn F. Galan'], 'Starring': ['Adam Beach', 'Eric Schweig', 'Michael Gambon']}\nA historically inaccurate piece of trash.  Whoever was the consultant/scriptwriter of this film, is an ignoramus of history.  After watching this film in agony on Thanksgiving eve,  I wanted to fall on my spear.\nWorst Thanksgiving movie ever!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Ford'], 'Producers': ['Sol M. Wurtzel'], 'Starring': ['Will Rogers', 'Anita Louise', 'Tom Brown'], 'Studio': ['Reel Enterprises']}\nLoved the twist of the plot.\nExcellent Movie Depicting a Long Gone Era!\nApocalypto [Import allemand]\nFormat: DVD\nMovies & TV, Movies\n{'Aspect Ratio': '1.85:1', 'Package Dimensions': '7.56 x 5.31 x 0.59 inches; 2.93 Ounces', 'Subtitles': 'German', 'Country of Origin': 'France'}\nI had a hard time finding this film with English subtitles. So I bought this DVD with German subtitles and added English subtitles using VLC.\nGood price and fast delivery\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Jay Willis'], 'Producers': ['Jay Kogen', 'Katherine Botts', 'Geralyn Flood'], 'Starring': ['Nicole Sullivan', 'Juliette Angelo', 'Beth Littleford'], 'Studio': ['United States Motion Picture Company']}\n95% of the movie was a boring story line of a teenage romance. The only funny part was the stand-in parents. Don't waste your money. Wait for the snippets on Youtube.\nBoring Teen Girl movie.\n{'Audio languages': ['English'], 'Subtitles': ['English'], 'Studio': ['BritBox']}\nIt is fitting for 2020, a horrible year.\nA pandemic comedy.....not\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Colin Bucksey', 'Neil Burger', 'Adam Bernstein', 'John Dahl', 'Matthew McLoota', 'Anna Boden', 'Ryan Fleck', 'Daniel Attias', 'Karyn Kusama', 'James Foley'], 'Starring': ['Paul Giamatti', 'Damian Lewis', 'Maggie Siff']}\nSeasons 1-4 engaged the viewer by twists in the plot. However,  season 5 is boring as h*ll and the characters are pretentious. Wendy and Taylor can go bye bye.\nHorrible season\nCreated Equal: Clarence Thomas In His Own Words\nClarence Thomas  (Actor),     Joe Biden  (Actor),     Michael Pack  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Although Clarence Thomas remains a controversial figure, few know him beyond his contentious U.S. Supreme Court confirmation battle. But behind the headlines, Thomas life is a classic American tale: born poor in the segregated South, only to become one of the most influential justices in the highest court of the land. Created Equal tells Thomas life story truly and fully, without cover-ups or distortions.']\n{'Genre': 'Special Interests', 'Format': 'Dolby, NTSC, Widescreen', 'Contributor': 'Joe Biden, Michael Pack, Ginni Thomas, Clarence Thomas, Anita Hill', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Michael Pack', 'Media Format': 'Dolby, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'February 2, 2021', 'Actors': 'Clarence Thomas, Joe Biden, Anita Hill, Ginni Thomas', 'Studio': 'Breaking Glass', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis documentary can be purchased at Vudu.\nAvoid Amazon's Censorship and Book Banning\nDjango Unchained\nJamie Foxx  (Actor),     Christoph Waltz  (Actor),     Quentin Tarantino  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product Description', 'Set in the South two years before the Civil War, DJANGO UNCHAINED stars Academy Award ®-winner Jamie Foxx as Django, a slave whose brutal history with his former owners lands him face-to-face with a German-born bounty hunter Dr. King Schultz (Academy Award®-winner Christolph Waltz). Schultz is on the trail of the murderous Brittle brothers, and only Django can lead him to his bounty. The unorthodox Schultz acquires Django with a promise to free him upon the capture of the Brittles – dead or alive. Success leads Schultz to free Django, though the two men choose not to go their separate ways. Instead, Schultz seeks out the South’s most wanted criminals with Django by his side. Honing vital hunting skills, Django remains focused on one goal: finding and rescuing Broomhilda (Kerry Washington), the wife he lost to the slave trade long ago. Django and Schultz’s search ultimately leads them to Calvin Candie (Academy Award®-nominee Leonardo DiCaprio), the proprietor of “Candyland,” an infamous plantation. Exploring the compound under false pretenses, Django and Schultz rouse the suspicion of Stephen (Academy Award®-nominee Samuel L. Jackson), Candie’s trusted house slave. Their moves are marked, and a treacherous organization closes in on them. If Django and Schultz are to escape with Broomhilda, they must choose between independence and solidarity, between sacrifice and survival…', 'Amazon.com', \"From the moment Jamie Foxx throws off a filthy, tattered blanket to reveal a richly muscled back crisscrossed with long scars, it's obvious that\", 'Django Unchained', \"will be both true to its exploitation roots but also clear-eyed about the misery that's being exploited. Django (Foxx), a slave set free in the years before the Civil War, joins with a German dentist-turned-bounty hunter (the marvelous Christoph Waltz,\", 'Inglourious Basterds', \"), who has promised to help Django rescue his wife (Kerry Washington), who's still enslaved to a gleeful and grandiose plantation owner (Leonardo DiCaprio, plainly relishing the opportunity to play an out-and-out villain). What follows is a wild and woolly ride, crammed with all the pleasures one expects from a revenge fantasy written and directed by Quentin Tarantino. Plot-wise, some things happen a little too easily (for example, Django instantly becomes a master gunslinger), but the moral perspective is not glib. For all its lurid violence and jazzy dialogue, this is a still-rare movie that paints slavery for what it was: a brutal, dehumanizing practice that allowed a privileged few to profit from the suffering of many, a practice guaranteed by the gun and the whip. Think of it as the antidote to\", 'Gone with the Wind', '. Tarantino is more heartfelt in', 'Django Unchained', 'than in any of his previous movies--without sacrificing any of the pell-mell action, tension, and delicious language that made', 'Reservoir Dogs', ',', 'Kill Bill', ', and', 'Pulp Fiction', 'so very enjoyable.', '--Bret Fetzer']\n{'Genre': 'Western', 'Format': 'NTSC', 'Contributor': 'Jamie Foxx, Pilar Savone, Stacey Sher, Don Johnson, Kerry Washington, Franco Nero, Walton Goggins, James Remar, Leonardo DiCaprio, Michael Parks, Brown 26 Productions, LLC, Dennis Christopher, Reginald Hudlin, Christoph Waltz, Quentin Tarantino, Samuel JacksonJamie Foxx, Pilar Savone, Stacey Sher, Don Johnson, Kerry Washington, Franco Nero, Walton Goggins, James Remar, Leonardo DiCaprio, Michael Parks, Brown 26 Productions, LLC, Dennis Christopher, Reginald Hudlin, Christoph Waltz, Quentin Tarantino, Samuel Jackson  See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Runtime': '2 hours and 46 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '13132597256', 'Director': 'Quentin Tarantino', 'Media Format': 'NTSC', 'Run time': '2 hours and 46 minutes', 'Release date': 'April 16, 2013', 'Actors': 'Jamie Foxx, Christoph Waltz, Leonardo DiCaprio, Kerry Washington, Samuel Jackson', 'Subtitles': 'English, Spanish', 'Producers': 'Reginald Hudlin, Pilar Savone, Stacey Sher', 'Studio': 'Lionsgate', 'Number of discs': '2'}\nGarbage\nGarbage\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Akiva Schaffer'], 'Producers': ['Blondel Aidoo', 'Dan Levine', 'Monica Levinson', 'Shawn Levy', 'Tom McNulty', 'Billy Rosenberg'], 'Starring': ['Ben Stiller', 'Vince Vaughn', 'Jonah Hill']}\nA lot of the humor was warped.\nPerverse and moronic\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Eyre', 'Sanford Bookstaver'], 'Producers': ['Jason Ballantyne', 'Vince Calandra', 'Kathleen DeRose', 'J. Kathleen Gibson', 'Anne Hillerman', 'George R.R. Martin', 'Zahn McClarnon', 'Robert Redford'], 'Starring': ['Zahn McClarnon', 'Kiowa Gordon', 'Jessica Matten']}\nFinally,  a western who-done-it that is on par with Longmire.\nFinally",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests in Film Genres:** The user maintains a strong appreciation for drama and adventure films, particularly those with intricate plots. They recently expressed enthusiasm for a well-crafted Western mystery, suggesting an openness to genre blending when executed thoughtfully.\n\n- **Value for Historical Accuracy:** They continue to prioritize historically accurate narratives and have sharpened their critique of formulaic storytelling, underscoring their desire for uniqueness and authenticity in content.\n\n- **Critical Reviewing Style:** The user exhibits a discerning taste, providing pointed feedback when narratives fail to engage. They uphold high expectations for character development and storytelling quality.\n\n- **Emotional Engagement:** Their commitment to emotional depth remains paramount, with sustained dissatisfaction for content that lacks resonance, even in lighter genres.\n\n- **Expectations for Quality:** The user's intolerance for perceived mediocrity has intensified, emphasizing their expectation for exceptional quality across all media. Their recent engagements highlight a focus on narratives that merge depth with captivating storytelling.\n\n- **Interest in Documentaries:** They continue to appreciate impactful narratives, especially in documentaries that explore historical and controversial themes.\n\n- **Critique of Humor:** The user remains critical of specific comedic styles, preferring narratives that align with their taste for emotional and thematic depth.\n\n**Overall Trends:** The user increasingly values emotional resonance and narrative complexity, demanding higher storytelling standards while remaining open to new interpretations within familiar genres, reinforcing their focus on depth and engagement over conventional entertainment.",
  "metrics": {
    "rouge1_f": 0.09771573604060914,
    "rouge2_f": 0.0,
    "rougeL_f": 0.05076142131979695,
    "meteor": 0.03248624574272989,
    "bleu1": 0.0007808598097396684,
    "bleu2": 8.385590840244877e-05,
    "bleu3": 1.8521192576069584e-05,
    "bleu4": 8.71162361895553e-06,
    "bertscore_precision": 0.3481963872909546,
    "bertscore_recall": 0.4512064754962921,
    "bertscore_f1": 0.39306458830833435
  }
}