{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/06/27\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Renaud'], 'Producers': ['Chris Meledandri', 'Janet Healy'], 'Starring': ['Danny DeVito', 'Ed Helms', 'Zac Efron'], 'Studio': ['Universal Pictures']}\nReview Text: Kids loved it!\nReview Title: Favorite Dr. Seuss movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Country Strong\nGwyneth Paltrow  (Actor),     Tim McGraw  (Actor),     Shana Feste  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Soon after a rising young singer-songwriter (Garrett Hedlund) gets involved with a fallen, emotionally unstable country star (Gwyneth Paltrow), the pair embark on a career resurrection tour helmed by her husband/manager (Tim McGraw) and featuring a beauty queen-turned-singer (Leighton Meester). Between concerts, romantic entanglements and old demons threaten to derail them all.', 'Amazon.com', 'A Nashville superstar faces a crossroads in her life in the sweet, sentimental', 'Country Strong', \". While in rehab, Gwyneth Paltrow's six-time Grammy Award winner Kelly Canter has a fling with an admiring orderly, Beau (\", 'Tron: Legacy', \"'s Garrett Hedlund). An aspiring singer/songwriter, Beau tells Kelly's manager and husband, James (Tim McGraw, Hedlund's\", 'Friday Night Lights', 'father), that he\\'s her \"sponsor.\" Anxious to revitalize her career, James checks Kelly out early to send her back on tour. He may love his wife, but he doesn\\'t know when to stop pushing. When he hears Beau\\'s duet with former beauty queen Chiles (', 'Gossip Girl', \"'s Leighton Meester), he adds them to the bill. En route from Tennessee to Texas, Beau discovers that Chiles is more talented and intelligent than he thought, but he remains devoted to his mentor, even though he knows they have no future. When Kelly starts drinking again, Beau gravitates towards his more stable tour mate. Writer-director Shana Feste (\", 'The Greatest', \") doesn't argue that love and work can't coexist, but rather that love and fame are incompatible. They certainly present a challenge, but it's a shaky thesis on which to build a film, especially when McGraw and Faith Hill, one of Paltrow's musical inspirations, serve as the exception that proves the rule. Consequently, the scenario falls apart by the final act, since someone has to suffer to illustrate Feste's point. Until then, the cast rises to the occasion, particularly Meester, who brings a breezy charm to an overly pessimistic premise.\", '--Kathleen C. Fennessy']\n{'Genre': 'Music, Drama, Romance', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Tim McGraw, Shana Feste, Gwyneth Paltrow', 'Language': 'English', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'CTR37446DVD', 'Director': 'Shana Feste', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'April 12, 2011', 'Actors': 'Gwyneth Paltrow, Tim McGraw', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Studio': 'Sony', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie!\nAdd to your collection\nMiss Bala [DVD]\nGina Rodriguez  (Actor),     Ismael Córdova  (Actor),     Catherine Hardwicke  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Gloria (Gina Rodriguez) drives to Tijuana, Mexico, to visit her best friend who is competing in the local “Miss Baja” beauty pageant. During a night out, her friend is abducted and Gloria finds herself a pawn in a dangerous game being played by the CIA, the DEA, and a charismatic yet ruthless cartel kingpin. Finding a power she never knew she had, Gloria plays one organization against the other as she seeks to rescue her friend. Surviving will require all of her cunning, inventiveness and strength. This edge-of-your-seat action thriller is being hailed as a “kick-ass origin story for a new kind of action hero” (Peter Debruge, Variety).']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'DVD, NTSC', 'Contributor': 'Kevin Misher, Ricardo Abarca, Catherine Hardwicke, Pablo Cruz, Ismael Córdova, Aislinn Derbez, Matt Lauria, Anthony Mackie, Damián Alcázar, Cristina Rodlo, Gina Rodriguez, Canana Films; Sony Pictures Entertainment (SPE)Kevin Misher, Ricardo Abarca, Catherine Hardwicke, Pablo Cruz, Ismael Córdova, Aislinn Derbez, Matt Lauria, Anthony Mackie, Damián Alcázar, Cristina Rodlo, Gina Rodriguez, Canana Films; Sony Pictures Entertainment (SPE)  See more', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Digital Copy Expiration Date': 'December 31, 2020', 'Aspect Ratio': '2.40:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.5 Ounces', 'Audio Description': 'English', 'Item model number': 'D54136D', 'Director': 'Catherine Hardwicke', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'April 30, 2019', 'Actors': 'Gina Rodriguez, Ismael Córdova, Aislinn Derbez, Matt Lauria, Damián Alcázar', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'Thai, Mandarin Chinese, Korean, English, Portuguese, French, Spanish', 'Producers': 'Pablo Cruz, Kevin Misher', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nLove this movie!\nGreat movie!!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Martin'], 'Producers': ['Robert Vince'], 'Starring': ['Kevin Zegers', 'Gregory Harrison', 'Cynthia Stevenson'], 'Studio': ['Walt Disney Pictures']}\nKids loved it!\nCute movie!\n{'Content advisory': ['Violence', 'frightening scenes', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Renaud'], 'Producers': ['Chris Meledandri', 'Janet Healy'], 'Starring': ['Danny DeVito', 'Ed Helms', 'Zac Efron'], 'Studio': ['Universal Pictures']}\nKids loved it!\nFavorite Dr. Seuss movie",
  "profile": "**User Profile Summary:**\n\n- **Genre Preference:** The user continues to enjoy a blend of Music, Drama, and Romance genres while increasingly leaning towards family-friendly films. Their recent purchase aligns with this trend, emphasizing an affinity for narratives suitable for all ages, while still remaining open to action thrillers that include emotional depth.\n\n- **Tone:** They are particularly drawn to stories that explore emotional complexity, including themes of career struggles, romantic relationships, and light-hearted family dynamics, showcasing an eagerness to engage with diverse storytelling.\n\n- **Review Behavior:** The user consistently offers positive feedback, often highlighting their appreciation for quality storytelling and character development across genres. Their high ratings reflect satisfaction with engaging, family-oriented narratives that resonate powerfully with viewers.\n\n- **Medium Engagement:** They maintain a preference for DVD formats, reinforcing a fondness for physical media. They have shown a strong interest in family movies, indicating an ongoing expansion in this area.\n\n- **Target Audience Awareness:** The user favors established actors and directors, demonstrating a preference for high production value. Recent selections suggest an enjoyment of performances appealing to both children and adults.\n\n- **Content Evaluation:** They continue to value strong character arcs and emotionally compelling storytelling. Their feedback indicates a desire for films that effectively blend action, emotional stakes, and family-friendly elements, highlighting a commitment to dynamic character journeys suitable for a wide audience.\n\nOverall, this user exhibits a growing passion for emotionally rich, character-driven films that cater to family viewing while still cherishing romance, drama, and action themes.",
  "metrics": {
    "rouge1_f": 0.15248226950354613,
    "rouge2_f": 0.007104795737122558,
    "rougeL_f": 0.06028368794326241,
    "meteor": 0.055028249440640616,
    "bleu1": 0.011000584641859287,
    "bleu2": 0.002768981424861444,
    "bleu3": 0.0009631623275608044,
    "bleu4": 0.0003196955904003583,
    "bertscore_precision": 0.3583998680114746,
    "bertscore_recall": 0.45733344554901123,
    "bertscore_f1": 0.40186724066734314
  }
}