{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/06/01\nAverage Rating: 4.5\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Chris Sadler', 'Rich Webber', 'Dave Osmand'], 'Producers': ['Julie Lockhart'], 'Starring': ['John Sparkes', 'Justin Fletcher', 'Richard Webber'], 'Studio': ['Lionsgate']}\nReview Text: I love Shaun the Sheep but this is just a compliation of a few episodes that are available for free.  It appears there might be some snippets that aren't in the original episodes but not worth $7!  I couldn't figure out how to cancel this after we purchased this and realized it was the same stuff.  My daughter loves Shaun the Sheep so we have seen the free episodes on Amazon 1000x!  Don't pay for this!\nReview Title: Stream the free episodes, don't buy this!\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ralph Hemecker', 'Ron Underwood', 'Dean White', 'Romeo Tirone', 'Steve Pearlman', 'Gwyneth Horder-Payton', 'Billy Gierhart', 'David Solomon', 'Milan Cheylov', 'Alrick Riley'], 'Studio': ['ABC']}\nI had accidentally deleted this episode from my dvr and the rest of the series kept recording, but I couldn't watch it until I had watched this one.  We couldn't find it anywhere for free and finally bought it on Amazon.  It was fast and good quality.\nYou need this episode to keep going in the series\nThe Hobbit: An Unexpected Journey (Blu-ray)\nIan McKellen  (Actor),     Martin Freeman  (Actor),     Peter Jackson  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['The adventure follows the journey of title character Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf the Grey, Bilbo finds himself joining a company of thirteen dwarves led by the legendary warrior, Thorin Oakenshield. Their journey will take them into the Wild; through treacherous lands swarming with Goblins and Orcs, deadly Wargs and Sorcerers. Although their goal lies to the East and the wastelands of the Lonely Mountain, first they must escape the goblin tunnels, where Bilbo meets the creature that will change his life forever Gollum. Here, alone with Gollum, on the shores of an underground lake, the unassuming Bilbo Baggins not only discovers depths of ingenuity and courage that surprise even him, he also gains possession of Gollum\\'s \"precious\" ring that holds unexpected and useful qualities A simple, gold ring that is tied to the fate of all Middle-earth in ways Bilbo cannot begin to know. ©2013 Warner Bros. Entertainment Inc. THE HOBBIT: AN UNEXPECTED JOURNEY and THE HOBBIT, names of the characters, items, events and places therein are trademarks of The Saul Zaentz Company d/b/a Middle-earth Enterprises under license to New Line Productions, Inc. All rights reserved.']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Blu-ray, Blu-ray, NTSC, Subtitled, Widescreen', 'Contributor': 'Elijah Wood, Ken Stott, Christopher Lee, Hugo Weaving, Andy Serkis, Peter Jackson, Martin Freeman, James Nesbitt, Cate Blanchett, Richard Armitage, Ian McKellen, Ian HolmElijah Wood, Ken Stott, Christopher Lee, Hugo Weaving, Andy Serkis, Peter Jackson, Martin Freeman, James Nesbitt, Cate Blanchett, Richard Armitage, Ian McKellen, Ian Holm   See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.53 Ounces', 'Item model number': 'NEWL1000296468BR', 'Director': 'Peter Jackson', 'Media Format': 'Blu-ray, Blu-ray, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 49 minutes', 'Release date': 'March 19, 2013', 'Actors': 'Ian McKellen, Martin Freeman, Richard Armitage, James Nesbitt, Ken Stott', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nI am biased because I am a recovering LOTR addict.  This was litter and funnier than LOTR.  I loved the dwarves!  I am pretty sure I have a secret dwarf crush on Fili and Kili (I don't actually know how to spell their names).  Bilbo and Smegel were both amusing.  I've already watched this twice!\nIt's A-mazing\nScooby-Doo, Where Are You!: Complete Series\nDon Messick  (Actor),     Casey Kasem  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Characters & Series, Scooby Doo\n[\"Limited edition set contains all 41 episodes of the 3 season television series. Hanna- Barbera series featuring Scooby Doo, a dog who joins Velma, Daphne, Freddie, and Shaggy on many quests to solve mysterious. Each mystery is new and unusual and involves the group stopping someone from wreaking certain havoc on the world. Scooby-Doo was a large, loveable but cowardly Great Dane who hung around four California high school students (Fred, Velma, Daphne and Shaggy). The four teen-agers were in constant search of mysteries and adventures, driving around in a bright green van known as the Mystery Machine. Many of the group's adventures involved villians who took on supernatural disguises (ghosts and monsters); the villians' activities usually involved blackmail, theft, fraud and other forms of corruption. At the first hint of trouble, Scooby-Doo (and usually, Shaggy as well) running for cover; they usually found themselves in even deeper trouble. It usually took the promise of a Scooby snack to get Scooby (and Shaggy) to come out of hiding. The mysteries were always solved by the end of each show.\"]\n{'Genre': 'Kids & Family, Animation, Comedy, Mystery & Suspense', 'Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Contributor': 'Casey Kasem, Joe Ruby, Don Messick, Larz Bourne, Joseph Barbera, Bill Lutz, Frank Welker, Ken Spears, William Hanna, Nicole Jaffe, Tom DagenaisCasey Kasem, Joe Ruby, Don Messick, Larz Bourne, Joseph Barbera, Bill Lutz, Frank Welker, Ken Spears, William Hanna, Nicole Jaffe, Tom Dagenais  See more', 'Language': 'English', 'Number Of Discs': '8', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.22 Pounds', 'Item model number': '9934437', 'Director': 'Joseph Barbera, William Hanna', 'Media Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Run time': '15 hours and 2 minutes', 'Release date': 'November 13, 2012', 'Actors': 'Don Messick, Casey Kasem, Frank Welker, Nicole Jaffe', 'Producers': 'Joseph Barbera, William Hanna', 'Studio': 'WarnerBrothers', 'Writers': 'Bill Lutz, Joe Ruby, Ken Spears, Larz Bourne, Tom Dagenais', 'Number of discs': '8'}\nIt comes in this nice cardboard box seen in the picture.  I love Scooby-doo and am looking forward to watching these over the years.  I am not enough of an expert to be able to tell you if everything is present, etc.\nI had to have this...\nLooney Tunes Golden Collection Vol. 1-6 (6-Pack)\nVarious  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Propelled by the creative genius of Tex Avery, Chuck Jones, and Friz Freleng, Warner Brothers\\' \"Looney Tunes\" introduced the world to some of the greatest cartoon characters to ever grace the animated cel: Bugs Bunny, Daffy Duck, Porky Pig, Elmer Fudd, Yosemite Sam, Foghorn Leghorn, Speedy Gonzalez, Pepe LePew, Wile E. Coyote, Road Runner, Tweety, Sylvester, Marvin the Martian, Tasmanian Devil, and many more. This release includes the first six volumes in the \"Looney Tunes Golden Collection\". A Greeting from Chuck Jones, Audio Commentary, Behind-the-Tunes Featurettes, Documentaries, Photo and Art Galleries, Some Shorts Presented in Black & White. \"Lost\" Cartoons and the History of the Looney Tunes, Music and Music-and-Effects-Only Tracks on Select Shorts, Great Salutes to Filmmaking Legends Including: \"Chuck Jones: Extremes and In-Betweens, A Life in Animation\", \"Drawn to Life: The Art of Robert McKimson\", \"Unsung Maestros: A Directors\\' Tribute\", \"The Bugs Bunny Show\": Commercials Gallery, Bridging Sequences And Audio Recording Sessions, 3 Looney Tunes TV Specials Starring Bugs Bunny, Bonus Rareties from the Vaults, Including Private SNAFU and Mr. Hook Shorts, Theatrical Feature \"Bugs Bunny Superstar\", \"Profile Friz On Film\", \"The Bugs Bunny Show: Bridging Sequences and Audio Recording Sessions\", \"Chuck Amuck\", \"What\\'s Up, Doc? A Salute To Bugs Bunny\", \"Bugs Bunny\\'s Looney Tunes All-Star 50th Anniversary TV Special\", Brand-New Cartoon \"Daffy Duck For President\", \"Profile Mel Blanc: The Man of a Thousand Voices\".']\n{'Genre': 'Animation, Anime & Manga', 'Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '24', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.7 Pounds', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Run time': '40 hours', 'Release date': 'December 27, 2011', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '24'}\nI have already started watching these.  I don't know enough about this series to say whether all the good things are there or not.  I do notice an abundance of Bugs Bunny and much fewer of the characters like Foghorn Leghorn and Yosemite Sam.\nAwesome Collection\nFrozen (Feature) [Blu-ray]\nKristen Bell  (Actor),     Idina Menzel  (Actor),     Chris Buck, Jennifer Lee  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Award Winners in Movies & TV, Golden Globe Central, Golden Globe Winners\n['Product Description', \"Fearless optimist Anna teams up with Kristoff in an epic journey, encountering Everest-like conditions, and a hilarious snowman named Olaf in a race to find Anna's sister Elsa, whose icy powers have trapped the kingdom in eternal winter.\", 'Amazon.com', 'A sweet, magical film filled with great music, likable characters, and striking effects,', 'Frozen', 'is a fairy tale about overcoming obstacles and the power of true love. Princesses Anna and Elsa are sisters and the closest friends until one day Elsa discovers that she can no longer control her power to create ice and snow. Terrified for the safety of her sister and everyone around her, Elsa isolates herself and vows to never feel any sort of passionate emotion again in hopes of suppressing her powers. But when Elsa comes of age and is set to be crowned queen, she must open the gates of the palace and let in the public, not to mention her sister Anna. Things go horribly wrong and Anna pursues her sister into the mountains in an attempt to save Elsa and reverse the deep freeze that Elsa has inadvertently released on the kingdom of Arendelle. Along the way, Anna joins forces with Kristoff (Jonathan Groff), an ice seller with a strangely close relationship with his reindeer Sven, and Olaf (Josh Gad), a goofy snowman whom she suddenly remembers from early childhood. In the end, Anna and Elsa discover that only by embracing their deepest feelings do they have a chance of saving themselves and the kingdom. Inspired by \"The Snow Queen\" story by Hans Christian Andersen, the film has plenty of quirky, lovable characters along with a nice blend of corny humor, serious sentiment, suspense, and peril. Kristen Bell and Idina Menzel deliver rousing performances of great music that includes original songs by Kristen Anderson-Lopez and Robert Lopez and an original score by Christophe Beck, and the visual effects are simply stunning.', 'Frozen', 'definitely succeeds in captivating audiences young, old, and every age in between.', '--Tami Horiuchi']\n{'Genre': 'Animation', 'Format': 'AC-3, Color, DTS Surround Sound, Animated, NTSC, Blu-ray, DVD-ROM, Widescreen, Digital_copy', 'Contributor': 'Kristen Bell, Josh Gad, Jonathan Groff, Idina Menzel, Chris Buck, Jennifer Lee', 'Language': 'English (DTS-HD High Res Audio), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 6.7 inches; 2.4 Ounces', 'Item model number': '291393', 'Director': 'Chris Buck, Jennifer Lee', 'Media Format': 'AC-3, Color, DTS Surround Sound, Animated, NTSC, Blu-ray, DVD-ROM, Widescreen, Digital_copy', 'Run time': '1 hour and 42 minutes', 'Release date': 'March 18, 2014', 'Actors': 'Kristen Bell, Idina Menzel, Jonathan Groff, Josh Gad', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios Home Entertainment', 'Number of discs': '2'}\nObviously the movie is awesome!  Love the music, it is more old school Disney!  The &#34;Let it Go&#34; song grows on you!  The first time is just &#34;meh&#34; then you just keep coming back to hear more.\nwonderful\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Starzak', 'Christopher Sadler', 'Jay Grace', 'Lee Wilton', 'Seamus Malone', 'Jean-Philippe Vine', 'Richard Webber', 'Will Becher', 'Mike Mort', 'Dave Osmand'], 'Starring': ['John Sparkes', 'Justin Fletcher', 'Kate Harbour'], 'Studio': ['Aardman Animations']}\nMy two year old likes this plus its funny enough for mom and dad.\nFive Stars\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Starzak', 'Christopher Sadler', 'Jay Grace', 'Lee Wilton', 'Seamus Malone', 'Jean-Philippe Vine', 'Richard Webber', 'Will Becher', 'Mike Mort', 'Dave Osmand'], 'Studio': ['Aardman Animations']}\nThis is the best little cartoon.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard Starzak', 'Christopher Sadler', 'Jay Grace', 'Lee Wilton', 'Seamus Malone', 'Jean-Philippe Vine', 'Richard Webber', 'Will Becher', 'Mike Mort', 'Dave Osmand'], 'Studio': ['Aardman Animations']}\nShaun the sheep is the best.  I love these two episodes!  Very cute and fitting with the antics of the sheep and other animals.\nLove it.\n{'Subtitles': ['None available'], 'Directors': ['Chris Sadler', 'Rich Webber', 'Dave Osmand'], 'Producers': ['Julie Lockhart'], 'Starring': ['John Sparkes', 'Justin Fletcher', 'Richard Webber'], 'Studio': ['Lionsgate']}\nI love Shaun the Sheep but this is just a compliation of a few episodes that are available for free.  It appears there might be some snippets that aren't in the original episodes but not worth $7!  I couldn't figure out how to cancel this after we purchased this and realized it was the same stuff.  My daughter loves Shaun the Sheep so we have seen the free episodes on Amazon 1000x!  Don't pay for this!\nStream the free episodes, don't buy this!",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Consumption**: The user continues to favor serialized narratives and classic adaptations, with a strong appreciation for quality animated content from respected studios. Recent interactions highlight their inclination towards family-friendly stories that effectively merge humor with engaging character dynamics.\n\n- **Viewing Languages**: Primarily consumes content in English, utilizing audio and subtitle options, and is open to dubbed alternatives when necessary.\n\n- **Purchase Behavior**: The user remains committed to premium physical formats but has expressed dissatisfaction with recent purchases that did not meet their expectations. This reflects a growing sensitivity to the value and originality of content, leading to a more discerning approach when evaluating animated series.\n\n- **Quality Expectations**: They maintain high standards for production quality, particularly in the animated and family-oriented genres, prioritizing enjoyable viewing experiences rich in humor and adventure.\n\n- **Emotional Engagement**: A deep emotional connection to characters is essential, enhancing enjoyment of narratives that feature nostalgic musical elements and heartwarming story arcs.\n\n- **Platform Preferences**: While they favor online platforms for convenience, the user also values curated physical collections that emphasize high animation quality and captivating storytelling.\n\nThis updated profile emphasizes the user’s ongoing enthusiasm for premium animated storytelling, alongside a newfound vigilance regarding content value, particularly in family-oriented genres, while maintaining a fondness for charming characters and joy-filled narratives.",
  "metrics": {
    "rouge1_f": 0.08717310087173101,
    "rouge2_f": 0.0058163689239717495,
    "rougeL_f": 0.044001660440016604,
    "meteor": 0.024810427368347484,
    "bleu1": 1.1032107879612633e-05,
    "bleu2": 4.114812259533486e-06,
    "bleu3": 5.711259566950286e-07,
    "bleu4": 2.1297067836374163e-07,
    "bertscore_precision": 0.3421333432197571,
    "bertscore_recall": 0.4670674204826355,
    "bertscore_f1": 0.39495596289634705
  }
}