{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/03/24\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['RZA'], 'Producers': ['Marc Abraham', 'Eric Newman', 'Eli Roth'], 'Starring': ['Russell Crowe', 'Cung Le', 'Lucy Liu'], 'Studio': ['Universal Pictures']}\nReview Text: Fantastic!! Thought I purchased the DVD but love the movie. Can view this movie over and over again. It's a keeper.\nReview Title: Karate Movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stretch, Turn-out, & Extension\nFormat: DVD\nMovies & TV, Musicals & Performing Arts, Ballet & Dance\n['In this new video, Finis Jhung has created 17 exercises especially designed to show you how to stretch safely and correctly so that you will strengthen and improve your turnout and extension. Finis shows and explains each exercise step-by-step, and then it is demonstrated by Isabella Boylston of The American Ballet Theater. The floor exercises are done both sitting up as well as lying down, which allows you to stretch without stress or strain on your muscles and joints. Each barre exercise includes detailed instructions and demonstrations on how to bring your floor stretches to a standing position while displaying your maximum turnout and extension with balance and control. Teaching in New York City since 1972, Finis Jhung has enabled thousands of dancers to become their personal best. As you will see, the secrets to success can be yours. FLOOR EXERCISES 1. Half split stretch 2. Full split stretch 3. Plié stretch with feet apart 4. Plié stretch with feet together 5. Développé to the front: on your side 6. Développé to the front: on your back 7. Développé to the side: on your back 8. Arabesque roll-ups BARRE EXERCISES 9. Strengthen your turn-out in plié 10. Rond de jambe à terre, en l’air, grand rond de jambe 11. Battement, fondu, développé to the front & side 12. Développé, battement fondu to the front & side 13. Arabesque stretch, penchée 14. Grand battement to the front, tombé, stretch 15. Grand battement to the back, stretch 16. Grand battement to the side 17. Adagio with grand rond de jambe']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.9 Ounces', 'Media Format': 'NTSC, DVD, Color', 'Run time': '1 hour and 30 minutes', 'Producers': 'Finis Jhung', 'Studio': 'Ballet Dynamics, Inc.', 'Number of discs': '1'}\nThis is the best stretch video ever!! Using this video will get me back in shape in no time. Not even painful.\nBallet Essentials\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['RZA'], 'Producers': ['Marc Abraham', 'Eric Newman', 'Eli Roth'], 'Starring': ['Russell Crowe', 'Cung Le', 'Lucy Liu'], 'Studio': ['Universal Pictures']}\nFantastic!! Thought I purchased the DVD but love the movie. Can view this movie over and over again. It's a keeper.\nKarate Movie",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest**: Dance and Ballet, with an expanding interest in action and martial arts-themed films.\n- **Content Preference**: Strong preference for instructional and educational videos aimed at improving dance techniques, alongside a newfound enjoyment for engaging cinematic experiences.\n- **Key Themes**:\n  - Stretching and flexibility exercises.\n  - Safe and correct technique for enhanced performance in dance.\n  - Focus on strength and turnout improvement.\n  - Step-by-step demonstrations and detailed instructions.\n  - Appreciation for storytelling and character development in films.\n- **User Sentiment**: Positive experiences with instructional content; enjoys films that offer repeat viewing enjoyment and quality entertainment.\n- **Engagement Style**: Motivated learner focused on personal development in dance while also exploring films that captivate and entertain. Values well-structured, professional guidance in both dance and cinematic experiences.\n- **Past Interaction Rating**: Consistently high ratings indicate a strong satisfaction with the quality and effectiveness of both instructional content and film experiences.\n\nOverall, the user maintains a strong commitment to enhancing their dance skills and exploring enjoyable cinematic storytelling, valuing comprehensive materials that facilitate personal growth and entertainment.",
  "metrics": {
    "rouge1_f": 0.18150087260034906,
    "rouge2_f": 0.017513134851138354,
    "rougeL_f": 0.09424083769633508,
    "meteor": 0.08515006978252358,
    "bleu1": 0.07127038994394996,
    "bleu2": 0.012726117537031727,
    "bleu3": 0.0026439037918451684,
    "bleu4": 0.0012064120471363736,
    "bertscore_precision": 0.3670324683189392,
    "bertscore_recall": 0.4512982964515686,
    "bertscore_f1": 0.4048268496990204
  }
}