{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tyler Perry's I Don't Want to Do Wrong - The Play\nReview Date: 2013/08/16\nStore: Kislyck \"Kissy\" Halsey  (Actor),     Alexis Jones  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Palmer Williams Jr.. and Patrice Lovely anchor a powerhouse cast portraying an American family facing the challenge of having a loved-one in the armed forces and many of the hilarious and outrageous obstacles that come with it.', 'Amazon.com', 'Tyler Perry is one of the most prolific writers in American film--and for the American stage.', \"I Don't Want to Do Wrong\", \"is one of Perry's musical plays, with the signature uplifting Tyler Perry message, delivered in a heartfelt way by very talented actors. There's no Madea in\", \"I Don't Want to Do Wrong\", \", but the hilarious Patrice Lovely takes the place of the matriarch who keeps things on track, with sass and attitude. The story is a simple one, centering on what happens when a marriage is strained by distance. A young woman, Yolanda (Alexis Jones), is tempted by an extramarital affair when her husband is deployed to Iraq. She moves in with her wacky parents, Reverend Wallace (Palmer Williams Jr.) and Hattie (Lovely)--who seem to be deeply in love after many years of marriage--but are they? The story is simple, the ending uplifting, and the journey one of smiles and crude laughter, and just a little heart-tugging. If you're a Tyler Perry fan, and you don't want to do wrong, you can't go wrong by watching\", \"I Don't Want to Do Wrong\", '. --', 'A.T. Hurley']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Black Comedy', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Contributor': 'Tony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne WeinertTony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne Weinert  See more', 'Language': 'English', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '33044', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Kislyck \"Kissy\" Halsey, Alexis Jones, Andre Pitre, Tony Hightower, Palmer Williams, Jr.', 'Subtitles': 'Spanish, English', 'Producers': 'Suzanne Weinert, Tanner Beard, Tyler Perry, Jay Michaelson', 'Studio': 'Lionsgate Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nReview Title: Tyler Perry Fan\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stretch, Turn-out, & Extension\nFormat: DVD\nMovies & TV, Musicals & Performing Arts, Ballet & Dance\n['In this new video, Finis Jhung has created 17 exercises especially designed to show you how to stretch safely and correctly so that you will strengthen and improve your turnout and extension. Finis shows and explains each exercise step-by-step, and then it is demonstrated by Isabella Boylston of The American Ballet Theater. The floor exercises are done both sitting up as well as lying down, which allows you to stretch without stress or strain on your muscles and joints. Each barre exercise includes detailed instructions and demonstrations on how to bring your floor stretches to a standing position while displaying your maximum turnout and extension with balance and control. Teaching in New York City since 1972, Finis Jhung has enabled thousands of dancers to become their personal best. As you will see, the secrets to success can be yours. FLOOR EXERCISES 1. Half split stretch 2. Full split stretch 3. Plié stretch with feet apart 4. Plié stretch with feet together 5. Développé to the front: on your side 6. Développé to the front: on your back 7. Développé to the side: on your back 8. Arabesque roll-ups BARRE EXERCISES 9. Strengthen your turn-out in plié 10. Rond de jambe à terre, en l’air, grand rond de jambe 11. Battement, fondu, développé to the front & side 12. Développé, battement fondu to the front & side 13. Arabesque stretch, penchée 14. Grand battement to the front, tombé, stretch 15. Grand battement to the back, stretch 16. Grand battement to the side 17. Adagio with grand rond de jambe']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.9 Ounces', 'Media Format': 'NTSC, DVD, Color', 'Run time': '1 hour and 30 minutes', 'Producers': 'Finis Jhung', 'Studio': 'Ballet Dynamics, Inc.', 'Number of discs': '1'}\nThis is the best stretch video ever!! Using this video will get me back in shape in no time. Not even painful.\nBallet Essentials\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['RZA'], 'Producers': ['Marc Abraham', 'Eric Newman', 'Eli Roth'], 'Starring': ['Russell Crowe', 'Cung Le', 'Lucy Liu'], 'Studio': ['Universal Pictures']}\nFantastic!! Thought I purchased the DVD but love the movie. Can view this movie over and over again. It's a keeper.\nKarate Movie\nTyler Perry's Aunt Bam's Place (The Play)\nCassi Davis  (Actor),     Jeffrey Lewis  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', \"One weekend, Aunt Bam's nephew-in-law Stewart is granted a court-ordered visitation with his children. Although his new, much-younger wife Mona is a bundle of nerves, Stewart seizes the opportunity to reconnect with his children, whom he loves dearly. Then their mother, his ex-wife Gloria, shows up drunk. It will take Madea's partner-in-crime, Bam, to tame this situation and set a few things straight.\", 'Amazon.com', 'Her silver bouffant towering a foot above her head, Aunt Bam (Cassi Davis,', 'House of Payne', \") solves her family's problems with a sharp tongue and tough love. Stewart (Maurice Lauchner), divorced and remarried to a much younger wife, Mona (Taral Hicks), must fight to have access to his children (Paris Bennett and Jeffery Lewis). But he doesn't know just how angry his ex-wife Gloria (Melonie Daniels) is, and the lengths to which she'll go to turn his son against him. Can Aunt Bam save this family? Well, really, there's not much doubt, but\", \"Aunt Bam's Place\", \"glides along smoothly with snappy comedy, heartfelt Christian sentiment, and gospel songs (every character gets his or her own showstopping number). The play was filmed in front of a live audience at an Atlanta theater, giving it the look of a standard sitcom. Its greatest strength--besides Aunt Bam's crowd-pleasing wisecracks--is that it extends compassion to every character. Gloria, demonized though she is, has her own song wailing out her personal pain.\", \"Aunt Bam's Place\", 'is straight-ahead Tyler Perry (creator of Madea, director of', 'Diary of a Mad Black Woman', 'and', 'I Can Do Bad All by Myself', \"). Anyone who doesn't already like his work, where lives and souls are saved by song, prayer, and sass, will not be converted here. But anyone who appreciates this hard-working auteur's movies and TV shows will enjoy this play.\", '--Bret Fetzer']\n{'Genre': 'Romantic Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Melonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris BennettMelonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris Bennett   See more', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT32422DVD', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'June 12, 2012', 'Actors': 'Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Taral Hicks, Melonie Daniels', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Producers': 'Eric Fellner, Mark E. Swinton, Tyler Perry, Nira Park, Tim Bevan', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nTyler Perry Fan\nTyler Perry's I Don't Want to Do Wrong - The Play\nKislyck \"Kissy\" Halsey  (Actor),     Alexis Jones  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'Palmer Williams Jr.. and Patrice Lovely anchor a powerhouse cast portraying an American family facing the challenge of having a loved-one in the armed forces and many of the hilarious and outrageous obstacles that come with it.', 'Amazon.com', 'Tyler Perry is one of the most prolific writers in American film--and for the American stage.', \"I Don't Want to Do Wrong\", \"is one of Perry's musical plays, with the signature uplifting Tyler Perry message, delivered in a heartfelt way by very talented actors. There's no Madea in\", \"I Don't Want to Do Wrong\", \", but the hilarious Patrice Lovely takes the place of the matriarch who keeps things on track, with sass and attitude. The story is a simple one, centering on what happens when a marriage is strained by distance. A young woman, Yolanda (Alexis Jones), is tempted by an extramarital affair when her husband is deployed to Iraq. She moves in with her wacky parents, Reverend Wallace (Palmer Williams Jr.) and Hattie (Lovely)--who seem to be deeply in love after many years of marriage--but are they? The story is simple, the ending uplifting, and the journey one of smiles and crude laughter, and just a little heart-tugging. If you're a Tyler Perry fan, and you don't want to do wrong, you can't go wrong by watching\", \"I Don't Want to Do Wrong\", '. --', 'A.T. Hurley']\n{'Genre': 'Black Comedy', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Contributor': 'Tony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne WeinertTony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne Weinert  See more', 'Language': 'English', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '33044', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Kislyck \"Kissy\" Halsey, Alexis Jones, Andre Pitre, Tony Hightower, Palmer Williams, Jr.', 'Subtitles': 'Spanish, English', 'Producers': 'Suzanne Weinert, Tanner Beard, Tyler Perry, Jay Michaelson', 'Studio': 'Lionsgate Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nTyler Perry Fan",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest**: Dance and Ballet, with a strong enthusiasm for action, martial arts-themed films, and theatrical performances that blend comedy with emotional storytelling.\n- **Content Preference**: Focus on instructional videos for dance techniques, including improvement in flexibility, strength, and safe performance practices. The user appreciates engaging films and plays that explore character development and emotional depth, showcasing a balance between entertaining narratives and educational content.\n- **Key Themes**: \n  - Techniques for stretching and flexibility.\n  - Safe and correct dance performance.\n  - Step-by-step demonstrations and detailed instructional content.\n  - Narratives with complex characters and heartfelt stories, especially those that offer a blend of humor and emotional resonance.\n- **User Sentiment**: Generally positive experiences with instructional content; enjoys cinematic and theatrical works that provide repeat viewing value, especially those that reflect unique storytelling styles by notable creators.\n- **Engagement Style**: An enthusiastic learner committed to personal growth in dance and cinema, the user values well-structured guidance in both pursuits. Recent engagement with humorous, relationship-centered theatrical works indicates a deep appreciation for the uplifting messages in such narratives.\n- **Past Interaction Rating**: High satisfaction ratings reflect the user's enjoyment of quality entertainment and educational experiences across diverse formats. \n\nOverall, the user demonstrates a blend of dedication to dance enhancement while actively exploring meaningful and entertaining narratives in film and theater.",
  "metrics": {
    "rouge1_f": 0.11771771771771772,
    "rouge2_f": 0.00841852074564041,
    "rougeL_f": 0.05525525525525526,
    "meteor": 0.0371737270004279,
    "bleu1": 0.0006877358704084416,
    "bleu2": 0.000205661802860454,
    "bleu3": 3.072554197811384e-05,
    "bleu4": 1.1886690808427354e-05,
    "bertscore_precision": 0.358476847410202,
    "bertscore_recall": 0.4893871247768402,
    "bertscore_f1": 0.4138256907463074
  }
}