{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Bridges of Madison County\nReview Date: 2016/12/10\nStore: Meryl Streep  (Actor),     Jim Haynie  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['World-traveling National Geographic photographer Robert Kincaid and Iowa housewife Francesca Johnson aren’t looking to turn their lives upside down. Each is at a point in life where expectations are behind them. Yet four days after they meet, they don’t want to lose the love they’ve found. Academy Award winners* Meryl Streep and Clint Eastwood (earning her 10th Oscar nomination for her work here) and Clint Eastwood (who also produces and directs) bring blazing starpower and powerful conviction to the lovers chronicled in Robert James Waller’s rhapsodic bestseller.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Robert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim HaynieRobert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim Haynie  See more', 'Initial release date': '2010-06-01', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.28 x 7.56 x 0.67 inches; 2.12 Ounces', 'Item model number': '120193', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 15 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Meryl Streep, Jim Haynie, Annie Corley, Victor Slezak', 'Producers': 'Clint Eastwood, Kathleen Kennedy', 'Studio': 'Studio Distribution Services', 'Writers': 'Richard LaGravenese', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My old VHS copy no longer works. It was time to own our favorite movie!\nReview Title: Favorite movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Brotherhood\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Mystery & Thrillers\n['vhs']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Release date': 'September 30, 1992', 'Date First Available': 'October 26, 2006', 'Actors': 'Douglas, Cord, Papas', 'Studio': 'Paramount'}\nWe caught this movie on TV and just had to have it! The theme, family, New York, loyalty and the Mob were familiar to us as New Yorkers. Kirk Douglas was incredible!\nGreat movie, a classic\nThe Sopranos: Season 3\nJames Gandolfini  (Actor),     Edie Falco  (Actor),     Tim Van Patten, Allen Coulter  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Sopranos, The: The Complete Third Season (DVD)', \"In Season Three of HBO's hit series, the federal wiretap begins as Livia dies and Meadow goes to college. But Tony faces challenges from some tough newcomers, such as hothead Ralph Cifaretto, New York crime boss Johnny Sack and a sexy car saleswoman.\", ']]>', 'Amazon.com', '\"So,\" Tony Soprano asks analyst Dr. Melfi in the wake of not-so-dearly-departed Livia\\'s death, \"we\\'re probably done here, right?\" Sorry, Tone, not by a long shot. Unresolved mother issues are the least of the Family man\\'s troubles in the brutal and controversial third season of', 'The Sopranos', '. Ranked by', 'TV Guide', 'among the top five greatest series ever,', 'The Sopranos', 'justified its eleven-month hiatus with some of its best, and most hotly debated, episodes that continue the saga of the New Jersey mob boss juggling the pressures of his often intersecting personal and professional lives. The third season garnered 22 Emmy nominations, earning Lead Actor and Actress honors for James Gandolfini and Edie Falco for their now-signature roles as Tony and his increasingly conflicted wife, Carmela.', 'The Sopranos', 'continued to upend convention and defy audience expectations with a deliberately paced, calm-before-the-storm season opener that revolves around the FBI\\'s attempts to bug the Soprano household, and a season finale that (for some) frustratingly leaves several plot lines unresolved. The second episode, \"Proshai, Livushka,\" confronts the death of the venerable Nancy Marchand, who capped her career with perhaps her greatest role as malignant matriarch Livia. A jarring scene between Tony and Livia that uses pre-existing footage is a distraction, but Carmela\\'s unsparing smackdown of Livia at the wake redeems the episode. \"Employee of the Month,\" in which Dr. Melfi is raped and considers whether to exact revenge by telling Tony of her attack, earned Emmys for its writers, and is perhaps Emmy nominee Lorraine Bracco\\'s finest hour. The darkly comic \"Pine Barrens\"--another memorable episode, directed by Steve Buscemi--strands Paulie (Tony Sirico) and Christopher (Michael Imperioli) in the forest with a runaway corpse. Other story arcs concern the rise of the seriously unstable Ralph Cifaretto (Joe Pantoliano) and Tony\\'s affair with \"full-blown loop-de-loo\" Gloria (Emmy nominee Annabella Sciorra). Plus, there is Tony\\'s estrangement from daughter Meadow (Jamie Lynn Sigler), his wayward delinquent son Anthony, Jr. (Robert Iler), Carmela\\'s crisis of conscience, bad seed Jackie Jr., and the FBI--which, as the season ends, assigns an undercover agent to befriend an unwitting figure in the Soprano family\\'s orbit. Stay tuned for season four.', '--Donald Liebenson']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Box set, NTSC, Closed-captioned, Color', 'Contributor': 'Edie Falco, Tim Van Patten, Allen Coulter, Dominic Chianese, Michael Imperioli, Steve van Zandt, Tony Sirico, James GandolfiniEdie Falco, Tim Van Patten, Allen Coulter, Dominic Chianese, Michael Imperioli, Steve van Zandt, Tony Sirico, James Gandolfini   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '1.26 x 5.71 x 7.57 inches; 14.24 Ounces', 'Item model number': '026359923425', 'Director': 'Tim Van Patten, Allen Coulter', 'Media Format': 'Multiple Formats, Anamorphic, Box set, NTSC, Closed-captioned, Color', 'Run time': '12 hours and 15 minutes', 'Release date': 'August 27, 2007', 'Actors': 'James Gandolfini, Edie Falco, Dominic Chianese, Michael Imperioli, Tony Sirico', 'Dubbed': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '4'}\nColection complete! Great for a cold winter night, pizza, red wine and a fireplace. Let the Soprano marathon begin! Thanks!\nSopranos 3\nThe Sopranos: Season 4\nJames Gandolfini  (Actor),     Edie Falco  (Actor),     Dominic Chianese  (Director),     Tim Van Patten, Allen Coulter  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Product Description', 'Sopranos, The: The Complete Fourth Season (DVD)', \"It's tough times in Jersey for Tony Soprano. The sluggish economy hasn't been good for the family business...and the ducks aren't coming back anytime soon. HBO presents Season Four of this hit drama series that follows the life and times of the New Jersey mob boss. In addition to taking a hit from the downturn in the economy--which has had an adverse impact on his supposedly recession-proof businesses--Tony finds himself dealing with a wife who is constantly on his case and increasingly unhappy with their marriage; the absence of trusted capo Paulie (he's in jail) and ascension of nephew Christopher as acting family capo; the impending RICO trial of his Uncle Junior; the continued irritations caused by his sister Janice; and the ongoing growing pains of his daughter Meadow and son Anthony Jr. James Gandolfini heads up the superb ensemble cast.\", ']]>', 'Amazon.com', 'Carmela to Tony: \"Everything comes to an end.\" True enough, Mrs. Sope, but on', 'The Sopranos', ', the end comes sooner for some than others. Though for some the widely debated fourth season contained too much yakking instead of whacking, and an emphasis on domestic family over business Family, what critic James Agee once said of the Marx Brothers applies to', 'The Sopranos', ': \"The worst thing they might ever make would be better worth seeing than most other things I can think of.\" And in most respects,', 'The Sopranos', 'remains television\\'s gold standard. The fourth season garnered 13 Emmy nominations, and subsequent best actor and actress wins for James Gandolfini and Edie Falco as Tony and Carmela, whose estrangement provides the season with its most powerful drama, as well as a win for Joe Pantoliano\\'s psychopath Ralph. The season finale, \"Whitecaps,\" was a long-time-coming episode, in which Carmela at last stands up to \"toxic\" Tony, and \"Whoever Did This\" was the season\\'s--and one of the series\\'--most shocking episodes.', 'Other narrative threads include Christopher\\'s (Emmy nominee Michael Imperioli) descent into heroin addiction, Uncle Junior\\'s (Dominic Chianese) trial, an unrequited and potentially fatal attraction between Carmela and Tony\\'s driver Furio, and a rude joke about Johnny Sack\\'s wife that has potentially fatal implications. Other indelible moments include Christopher\\'s girlfriend Adriana\\'s projectile reaction to discovering that her new best friend is an undercover FBI agent in the episode \"No Show,\" Janice giving Ralph a shove out of their relationship in \"Christopher,\" and the classic \"Quasimodo/Nostradamus\" exchange in the season-opener, which garnered HBO\\'s highest ratings to date. Freed from the understandably high expectations for the fourth season, heightened by the 16-month hiatus, these episodes can be better appreciated on their own considerable merits. They are pivotal chapters in television\\'s most novel saga.', '--Donald Liebenson']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Anamorphic, Box set, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Anamorphic, Box set, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Edie Falco, Tim Van Patten, Allen Coulter, Dominic Chianese, Michael Imperioli, Steve van Zandt, Tony Sirico, James GandolfiniEdie Falco, Tim Van Patten, Allen Coulter, Dominic Chianese, Michael Imperioli, Steve van Zandt, Tony Sirico, James Gandolfini  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 11.2 Ounces', 'Item model number': '99081', 'Director': 'Dominic Chianese, Tim Van Patten, Allen Coulter', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Box set, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '13 hours and 20 minutes', 'Release date': 'February 12, 2008', 'Actors': 'James Gandolfini, Edie Falco, Michael Imperioli, Tony Sirico, Steve van Zandt', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'HBO Studios', 'Number of discs': '4'}\nMy collection is now  complete! Pasta please! After football season it will be a welcome change in TV viewing. Thanks!\nSorpanos 4\nBattleship\nAlexander Skarsgård  (Actor),     Liam Neeson  (Actor),     Peter Berg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', 'The battle for Earth begins at sea in this epic action-adventure starring Taylor Kitsch, Rihanna, Alexander Skarsgård, Brooklyn Decker and Liam Neeson. An international naval coalition becomes the world\\'s last hope for survival as they engage a hostile alien force of unimaginable strength. Ripping across sea, sky and land, Battleship is \"a big bold blast\" (MSN Movies), packed with spectacular visual effects and explosive action.', 'Bonus Content:', 'Preparing for Battle', 'Preparing for Battle', 'All Hands on Deck: The Cast', 'All Hands on Deck: The Cast', 'Engage in Battle', 'Engage in Battle', ']]>', 'Amazon.com', 'Following the success of', 'Transformers', 'and', 'G.I. Joe', \", Hasbro brings another of its beloved properties to the big screen, with explosive and cheerfully improbable results. The situation: Aliens splash down outside Hawaii, surrounding the islands with an impenetrable force field and wreaking havoc on the captive population. While the world outside watches helplessly, a skeleton crew of naval officers and civilians (led by Taylor Kitsch's cocky washout and Rihanna's weapons expert) must figure out a way to save the planet while being seriously outgunned. Director Peter Berg, whose previous films\", 'The Rundown', 'and', 'Hancock', 'displayed a playful tweaking of genre conventions, keeps things surprisingly high and tight here, depicting military tactics and the chain of command with an honest respect, including casting actual combat veterans in pivotal supporting roles. While such a reverent approach is certainly admirable, it coexists uneasily with the inherent goofiness of the premise, particularly during the climactic scene where the heroes sit down in front of a grid and, yes, fire a missile at B7. (Note: Nobody actually gets to say \"You sunk my battleship,\" but Liam Neeson, in an extended cameo as an admiral, sure looks like he wants to.) However, while the narrative might be missing a few pieces, Berg\\'s film undeniably delivers the action-movie goods, staging a number of all-out combat scenes with verve and ingenuity. (Special kudos to whoever designed the main weapon of the aliens, a razor-toothed sphere of gears that chews up the scenery with a tangible sense of delight.) Audiences looking for coherence may need to keep on looking, but', 'Battleship', 'definitely sports the maximum number of bangs for the summer-movie buck. Bring on', 'Kerplunk: The Motion Picture', '.', '--Andrew Wright']\n{'Genre': 'Fantasy, Military & War, Science Fiction', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Dolby', 'Contributor': 'Alexander Skarsgård, Peter Berg, Liam Neeson', 'Initial release date': '2012-08-28', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.26 Ounces', 'Item model number': '61116602', 'Director': 'Peter Berg', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Dolby', 'Run time': '2 hours and 12 minutes', 'Release date': 'August 28, 2012', 'Actors': 'Alexander Skarsgård, Liam Neeson', 'Subtitles': 'English, French, Spanish', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy husband will watch it at least once a week. Great graphics. The retired sailors at the end make us proud to be Americans.wow\nfavorite movie\nThe Sopranos: Season 6, Part 1\nGandolfini, James  (Actor),     Attias, Daniel  (Director),     Bender, Jack  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Product Description', \"Business is good. A rival is behind bars. A marital crisis has been resolved. A rat has been exterminated. So what does Tony Soprano have to be worried about? Everything. It's time to turn up the heat for the first half of Season Six of 'The Sopranos!' This Emmy(R)-winning drama series takes a darkly humorous look at a New Jersey crime boss (James Gandolfini) whose numerous problems continue to send him to his psychiatrist (Lorraine Bracco) for therapy. In Season 6A, several crises threaten Tony and his crew: for starters, rival boss Johnny 'Sack' Sacramoni is in prison, and the always-tense relations between the New Jersey and New York families are strained through the unpredictable behavior of Sack's surrogates. Then there are the inevitable power struggles that ensue when certain family members are eliminated, by natural and other causes.\", ']]>', 'Amazon.com', 'The Sopranos, Season 6, Part 1', 'is the most contentious release yet in the acclaimed series\\' history. While many fans think it jumped the shark at the exact moment Vito said \"I love you, Johnny Cakes\" , this season also contains some of the series finest moments and plumbs new depths of character, while continuing to add to the body count. Things get started with a bang, literally, that unexpectedly sends Tony (James Gandolfini) to the hospital and into a coma where he experiences an alternate reality while in limbo. At one point he awakes and asks \"Who am I? Where am I going?\" encapsulating this season\\'s central theme in a moment of desperation wrapped in a fever dream. But it\\'s not all existentialism. With Tony and Uncle Junior both of the picture, the capos in the Soprano crew try to take advantage of the situation and begin jockeying for position while a reluctant Silvio (Steve Van Zandt), acting in Tony\\x92s place, struggles to keep everyone in check. Things aren\\x92t going much better for Tony\\x92s family, as A.J. (Robert Iler) confesses to Carmela (Edie Falco) that he flunked out of school, and while at Tony\\x92s bedside, swears revenge for his injury. The stress of the situation finally gets to Carmela, who takes up Dr. Melfi\\x92s (Lorraine Bracco) offer to help and finds herself in the strange position of confiding in her husband\\x92s therapist, revealing for once that she feels some guilt over making the kids complicit in how Tony makes his living\\x97plus there\\x92s the issue of whether she really loves him. Christopher (Michael Imperioli) continues to provide much of the comic relief for the series, culminating in one of this season\\x92s best episodes when he flies out to L.A. in a bumbling attempt to get Ben Kingsley to sign on for his fledgling movie (', 'Saw', 'meets', 'The Godfather', '), and ends up mugging Lauren Bacall for her goodie basket at an awards ceremony. Sowing further discord in the ranks, Vito (Joseph Gannoscoli) finally gets outed as homosexual, and is forced to flee for his life up to New Hampshire where he meets \"Johnny Cakes.\" Finally, even with New York boss Johnny \"Sack\" Sacramoni (Vince Curatola) in prison, Phil Leotardo (Frank Vincent) makes plays against Tony and eventually sets in motion a hit against someone on Tony\\x92s crew, and now a larger war with Johnny Sack\\'s crew seems to be looming.', 'Series creator David Chase seems to be saying with this season that character is destiny. If so, then Season Six, Part 1 is taking the necessary time to flesh out who these people really are, and is leaving the destiny part up for Part 2. The fact that the series\\x92 writers have been able to maintain such a strong show with so many interweaving storylines for so long is a feat not to be taken lightly. That said, this season of', 'The Sopranos', \"does deserve some of the criticism it's received: the Vito storyline would have been better served by resolving it in fewer episodes, and the season ending is the most unsatisfying one yet, leaving many fans wanting more. But the bottom line is that this season deserves more praise than criticism, proving that even at its weakest,\", 'The Sopranos', 'is still the strongest show on TV.', '--Daniel Vancini']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Widescreen, Color, Dolby, Closed-captioned, Dubbed, NTSC', 'Contributor': 'Senna, Lorraine, Patterson (III), Tom, Gomez, Nick, Taylor, Alan, Penn (II), Matthew, Bogdanovich, Peter, Figgis, Mike, Bender, Jack, Coulter, Allen, Van Patten, Timothy, Attias, Daniel, Chase (II), David, Hayman, James, García, Rodrigo, Gandolfini, James, Tamahori, Lee, Buscemi, Steve, Bruestle, Martin, Bronchtein, Henry, Patterson (III), John, Wolk, AndySenna, Lorraine, Patterson (III), Tom, Gomez, Nick, Taylor, Alan, Penn (II), Matthew, Bogdanovich, Peter, Figgis, Mike, Bender, Jack, Coulter, Allen, Van Patten, Timothy, Attias, Daniel, Chase (II), David, Hayman, James, García, Rodrigo, Gandolfini, James, Tamahori, Lee,…  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.6 x 5.7 x 1.3 inches; 4.8 Ounces', 'Item model number': '2221354', 'Director': 'Attias, Daniel, Bender, Jack, Bogdanovich, Peter, Bronchtein, Henry, Bruestle, Martin', 'Media Format': 'Multiple Formats, Widescreen, Color, Dolby, Closed-captioned, Dubbed, NTSC', 'Run time': '12 hours', 'Release date': 'February 12, 2008', 'Actors': 'Gandolfini, James', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'HBO Studios', 'Number of discs': '4'}\nWe are fans of the HBO series the Sopranos and had to have the entire Series 1-6. We had most of them on VHS but wanted DVD's.\nWe can enjoy it all!\nThe Four Feathers\nHeath Ledger  (Actor),     Wes Bentley  (Actor),     Shekhar Kapur  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n[\"SET IN LATE-19TH-CENTURY ENGLAND, A SOLDIER RESIGNS FROM HISDUTIES ON THE EVE OF A BATTLE WITH SUDAN. HIS FIANCEE AND THREE FRIENDS SEND HIM THE TITULAR FEATHERS, WHICH REPRESENTS A COWARDICE.WHAT HIS LOVED ONES DIDN'T KNOW IS THE SOLDIER HADCHANGED HIS MIND AND TRAVELED NORTH TO HELP HIS REGIMENT.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Shekhar Kapur', 'Media Format': 'Closed-captioned, Color, DVD, NTSC', 'Run time': '2 hours and 11 minutes', 'Release date': 'February 18, 2003', 'Actors': 'Heath Ledger, Wes Bentley, Kate Hudson, Mohamed Bouich, Campbell Brown', 'Studio': 'Paramount', 'Writers': 'A.E.W. Mason, Hossein Amini, Michael Schiffer', 'Number of discs': '1'}\nWe saw the movie on TV and decided it was a keeper! Now we can watch it anytime we want!\nLove the Movie!\nLooking for an Echo\nArmand Assante  (Actor),     Diane Venora  (Actor),     Martin Davidson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['LOOKING FOR AN ECHO']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'David Margulies, Armand Assante, Paz de la Huerta, Anthony John Denison, Monica Trombetta, Edoardo Ballerini, Johnny Williams, Martin Davidson, Christy Carlson Romano, Robert Held, Tom Mason, Diane Venora, David Vadim, Ilana Levine, Jeffrey GoldenbergDavid Margulies, Armand Assante, Paz de la Huerta, Anthony John Denison, Monica Trombetta, Edoardo Ballerini, Johnny Williams, Martin Davidson, Christy Carlson Romano, Robert Held, Tom Mason, Diane Venora, David Vadim, Ilana Levine, Jeffrey Goldenberg  See more', 'Language': 'English', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.88 Ounces', 'Director': 'Martin Davidson', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 37 minutes', 'Release date': 'May 6, 2003', 'Actors': 'Armand Assante, Diane Venora, Tom Mason, Anthony John Denison, Johnny Williams', 'Subtitles': 'English', 'Studio': 'Screen Media', 'Writers': 'Jeffrey Goldenberg, Martin Davidson, Robert Held', 'Number of discs': '1'}\nSaw themovie on TV. Love Armand Assante. I know the neighborhood very well. The music and happy ending was perfect!\nWhat a story!\nThe Quiet Man (60th Anniversary Special Edition)\nJohn Wayne  (Actor),     Maureen O'Hara  (Actor),     John Ford  (Director, Producer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n[\"Sean Thornton (John Wayne) in an American boxer who swears off fighting after he accidentally kills an opponent in the ring. Returning to the Irish town of his youth, he purchases the home of his birth and finds happiness when he falls in love with the fiery Mary Kate (Maureen O'Hara). But her insistence that Sean conduct his courtship in a proper Irish manner with matchmaker Barry Fitzgerald along for the ride as chaperone is but one obstacle to their future happiness: The other is her brother (Victor McLaglen), who spitefully refuses to give his consent to their marriage, or to honor the tradition of paying a dowry to the husband. Sean could care less about dowries, he would've punched out the bullying McLaglen long ago if he hadn't sworn off fighting. But when Mary Kate accuses him of being a coward and walks out on him, Sean is finally ready to take matters into his own hands, the resulting fistfight erupts into the longest brawl ever filmed, followed by one of the most memorable reconciliations in movie history! THE QUIET MAN won a total of two Academy Awards including Best Director (Ford) and Best Cinematography and received five more nomination including Best Picture, Best Screenplay and Best Supporting Actor (McLaglen).\"]\n{'Genre': 'Drama, Comedy', 'Format': 'NTSC, Multiple Formats, Color, Full Screen', 'Contributor': \"John Wayne, Barry Fitzgerald, Ward Bond, Frank S. Nugent, Merian C. Cooper, Victor McLaglen, John Ford, Maureen O'HaraJohn Wayne, Barry Fitzgerald, Ward Bond, Frank S. Nugent, Merian C. Cooper, Victor McLaglen, John Ford, Maureen O'Hara  See more\", 'Language': 'English', 'Runtime': '2 hours and 9 minutes', 'Aspect Ratio': '1.37:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.5 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '483', 'Director': 'John Ford', 'Media Format': 'NTSC, Multiple Formats, Color, Full Screen', 'Run time': '2 hours and 9 minutes', 'Release date': 'January 22, 2013', 'Actors': \"John Wayne, Maureen O'Hara, Barry Fitzgerald, Victor McLaglen, Ward Bond\", 'Producers': 'Merian C. Cooper, John Ford', 'Studio': 'Olive', 'Writers': 'Frank S. Nugent', 'Number of discs': '1'}\nSent this as a gift to our very Irish friend who had never seen it! He and his wife enjoyed it. The movie is a treasure.\nHe and his wife enjoyed it. The movie is a treasure\nStar Trek IV: The Voyage Home\nWilliam Shatner  (Actor),     Leonard Nimoy  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Space Adventure\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Dolby, Multiple Formats, Subtitled, AC-3, Dubbed, Widescreen, Color, Original recording remastered, NTSCDolby, Multiple Formats, Subtitled, AC-3, Dubbed, Widescreen, Color, Original recording remastered, NTSC   See more', 'Contributor': 'Walter Koenig, William Shatner, James Doohan, Leonard Nimoy, Donald Peterman, DeForest Kelley, Nichelle Nichols, Leonard RosenmanWalter Koenig, William Shatner, James Doohan, Leonard Nimoy, Donald Peterman, DeForest Kelley, Nichelle Nichols, Leonard Rosenman   See more', 'Language': 'English', 'Number Of Discs': '1'}\nNow my collection is complete!\nTrek lover!\nThe Scarlet and the Black\nGregory Peck  (Actor),     Christopher Plummer  (Actor),     Jerry London  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"Defying a Nazi colonel, Vatican Monsignor Hugh O'Flaherty hides thousands of escaped POWs in occupied Rome.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'David Butler, J.P. Gallagher, Kenneth Colley, Jerry London, T.P. McKenna, Michael Byrne, Christopher Plummer, Raf Vallone, Olga Karlatos, Barbara Bouchet, Angelo Infanti, John Gielgud, Julian Holloway, Walter Gotell, Gregory PeckDavid Butler, J.P. Gallagher, Kenneth Colley, Jerry London, T.P. McKenna, Michael Byrne, Christopher Plummer, Raf Vallone, Olga Karlatos, Barbara Bouchet, Angelo Infanti, John Gielgud, Julian Holloway, Walter Gotell, Gregory Peck  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.6 x 7.5 inches; 0.32 Ounces', 'Item model number': '012236139522', 'Director': 'Jerry London', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '2 hours and 23 minutes', 'Release date': 'April 22, 2003', 'Actors': 'Gregory Peck, Christopher Plummer, John Gielgud, Raf Vallone, Kenneth Colley', 'Studio': 'Lions Gate', 'Writers': 'David Butler, J.P. Gallagher', 'Number of discs': '1'}\nWhat a fantastic movie!\nFive Stars\nLove Affair\nWarren Beatty  (Actor),     Annette Bening  (Actor),     Glenn Gordon Caron  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Academy Award and Golden Globe-winner Warren Beatty (\"Down to Earth,\" \"Bulworth\") and real-life wife and Academy Award-nominee and Golden Globe-winner Annette Bening (\"Being Julia,\" \"American Beauty\") star in this remake of the classic love story \"An Affair to Remember.\" Four-time Academy Award and Emmy-winner and Golden Globe-nominee Katharine Hepburn (\"On Golden Pond,\" \"Guess Who\\'s Coming to Dinner\") returns to the silver screen, joined by Emmy-winner and Golden Globe-nominee Garry Shandling (\"Doctor Doolittle,\" TV\\'s \"The Larry Sanders Show\"), Kate Capshaw (\"The Love Letter,\" \"Just Cause\") and Golden Globe-nominee Pierce Brosnan (\"The Matador,\" various James Bond features). Co-written by Beatty and Academy Award and Golden Globe-winner Robert Towne (\"Mission Impossible\" 1 and 2). Gene Siskel says this movie \"stands on the chemistry of Beatty and Bening... they have it in real life, and on the screen they have it too.\"']\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Warren Beatty, Annette Bening, Katharine Hepburn, Pierce Brosnan, Kate Capshaw, Glenn Gordon Caron, Garry Shandling, Chloe WebbWarren Beatty, Annette Bening, Katharine Hepburn, Pierce Brosnan, Kate Capshaw, Glenn Gordon Caron, Garry Shandling, Chloe Webb  See more', 'Language': 'English', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '301427', 'Director': 'Glenn Gordon Caron', 'Media Format': 'NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 14, 2012', 'Actors': 'Warren Beatty, Annette Bening, Katharine Hepburn, Garry Shandling, Chloe Webb', 'Dubbed': 'French', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy favorite!\nFive Stars\nRose Marie\nJeanette MacDonald  (Actor),     Nelson Eddy  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Resounding with such songs as \"Rose-Marie, I Love You,\" \"Song of the Mounties\" and the beloved \"Indian Love Call,\" Rose-Marie immortalized Hollywood\\'s greatest singing team. This 1936 screen version of the Rudolf Friml-Herbert Stothart Broadway hit is set in the breathtaking wilderness of the Canadian Rockies. Marie de Flor (MacDonald), a glamorous Canadian prima donna, is renowned for her beauty, exquisite voice and fierce temperament. When news arrives that her brother Jack (Jimmy Stewart in one of his earliest screen roles) has been wounded in a prison escape, Marie realizes she must go to him despite the danger. Lured into the wilderness, she encounters Sgt. Bruce (Eddy), who is hunting the fugitive. Sgt. Bruce is soon hot on Marie\\'s trail as well! The New York Times called Rose-Marie a \"blithely melodious film rich in scenic beauty.\" And after all these years, this rugged romance is as wonderful as ever.']\n{'Genre': 'Musicals & Performing Arts/Musicals/General', 'Format': 'NTSC', 'Contributor': 'Jeanette MacDonald, Nelson Eddy', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '292002', 'Media Format': 'NTSC', 'Run time': '1 hour and 51 minutes', 'Release date': 'July 10, 2012', 'Actors': 'Jeanette MacDonald, Nelson Eddy', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy husband loves these old movies. He wanted this one for his collection!\nOldies but Goodies\nThe Rookie (Full Screen Edition)\nDennis Quaid  (Actor),     Rachel Griffiths  (Actor),     John Lee Hancock  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{'Genre': 'Drama, ACTION, LIVE', 'Format': 'Color, NTSC, Multiple Formats, Closed-captioned, Dolby, Full Screen, Subtitled', 'Contributor': 'David Blackwell, Chad Lindberg, Jay Hernandez, Daniel Tucker Kamin, Mike Rich, Rachel Griffiths, Russell Richardson, Beth Grant, Dennis Quaid, Brian Cox, John Lee Hancock, Angus T. Jones, Rick Gonzalez, Angelo Spizzirri, Raynor Scheine, Blue Deckert, Royce D. ApplegateDavid Blackwell, Chad Lindberg, Jay Hernandez, Daniel Tucker Kamin, Mike Rich, Rachel Griffiths, Russell Richardson, Beth Grant, Dennis Quaid, Brian Cox, John Lee Hancock, Angus T. Jones, Rick Gonzalez, Angelo Spizzirri, Raynor Scheine, Blue Deckert, Royce D. Applegate   See more', 'Language': 'English', 'Runtime': '2 hours and 8 minutes'}\nA movie that gives you hope and lifts your spirits!\nPursue your dreams\nSteel Magnolias (Special Edition)\nSally Field  (Actor),     Dolly Parton  (Actor),     Herbert Ross  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Steel Magnolias (Special Edition).', 'Set Contains:', 'The exclusive documentary is essentially a tribute to the memory of Susan Harling--the diabetic sister of', 'Steel Magnolias', 'playwright-screenwriter Robert Harling--whose death inspired both play and film. Robert Harling\\'s comments are warm and welcome, but several primary cast members are absent from the documentary. The \"deleted scenes\" are not scenes at all, but rather fragments of scenes removed for length and pacing. And while it\\'s nice to hear Georges Delerue\\'s isolated music score, director Herbert Ross\\'s sparse commentary track is a guaranteed cure for insomnia.', '--Jeff Shannon']\n{'Genre': 'Drama, Romance', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, NTSC, Special Edition, Color, Subtitled, Widescreen', 'Contributor': 'Ray Stark, Herbert Ross, Sally Field, Rastar Prods., Inc.; Steel Magnolias Prods., Inc. (a subsidiary of TriStar Pictures, Inc.); TriStar, Julia Roberts, Shirley MacLaine, Daryl Hannah, Olympia Dukakis, Dolly PartonRay Stark, Herbert Ross, Sally Field, Rastar Prods., Inc.; Steel Magnolias Prods., Inc. (a subsidiary of TriStar Pictures, Inc.); TriStar, Julia Roberts, Shirley MacLaine, Daryl Hannah, Olympia Dukakis, Dolly Parton   See more', 'Language': 'Portuguese (Dolby Digital 2.0), English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 2.0)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.34 x 7.51 inches; 2.4 Ounces', 'Item model number': '70247', 'Director': 'Herbert Ross', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, NTSC, Special Edition, Color, Subtitled, Widescreen', 'Run time': '1 hour and 58 minutes', 'Release date': 'July 25, 2000', 'Actors': 'Sally Field, Dolly Parton, Shirley MacLaine, Julia Roberts, Olympia Dukakis', 'Dubbed': 'Portuguese, Spanish', 'Subtitles': 'English, Spanish, Portuguese, Chinese, Thai, Georgian', 'Producers': 'Ray Stark', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFantastic story about love, friendships, acceptance and how to deal with tragedy. One of my all time favorites!\nStrong women!\nThe Bridges of Madison County\nMeryl Streep  (Actor),     Jim Haynie  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['World-traveling National Geographic photographer Robert Kincaid and Iowa housewife Francesca Johnson aren’t looking to turn their lives upside down. Each is at a point in life where expectations are behind them. Yet four days after they meet, they don’t want to lose the love they’ve found. Academy Award winners* Meryl Streep and Clint Eastwood (earning her 10th Oscar nomination for her work here) and Clint Eastwood (who also produces and directs) bring blazing starpower and powerful conviction to the lovers chronicled in Robert James Waller’s rhapsodic bestseller.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Robert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim HaynieRobert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim Haynie  See more', 'Initial release date': '2010-06-01', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.28 x 7.56 x 0.67 inches; 2.12 Ounces', 'Item model number': '120193', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 15 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Meryl Streep, Jim Haynie, Annie Corley, Victor Slezak', 'Producers': 'Clint Eastwood, Kathleen Kennedy', 'Studio': 'Studio Distribution Services', 'Writers': 'Richard LaGravenese', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy old VHS copy no longer works. It was time to own our favorite movie!\nFavorite movie",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Favorite movie",
    "text": "My old VHS copy no longer works. It was time to own our favorite movie!",
    "images": [],
    "asin": "B003ASLJK4",
    "parent_asin": "B003ASLJK4",
    "user_id": "AFE3T6FOPZWNCR6TAQZRTUKWEWKA",
    "timestamp": "2016-12-10 12:44:35",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The Bridges of Madison County",
    "average_rating": 4.8,
    "rating_number": 8990,
    "features": [],
    "description": [
      "World-traveling National Geographic photographer Robert Kincaid and Iowa housewife Francesca Johnson aren’t looking to turn their lives upside down. Each is at a point in life where expectations are behind them. Yet four days after they meet, they don’t want to lose the love they’ve found. Academy Award winners* Meryl Streep and Clint Eastwood (earning her 10th Oscar nomination for her work here) and Clint Eastwood (who also produces and directs) bring blazing starpower and powerful conviction to the lovers chronicled in Robert James Waller’s rhapsodic bestseller."
    ],
    "price": 6.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/516xw-di3OL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/516xw-di3OL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91ql7e7J9IL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61Tg747I1iL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61Tg747I1iL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/91JLM9lYduL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Meryl Streep  (Actor),     Jim Haynie  (Actor)    Rated:    PG-13    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Drama"
    ],
    "details": {
      "Genre": "Drama",
      "Format": "Multiple Formats, Color, NTSC, Widescreen",
      "Contributor": "Robert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim HaynieRobert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim Haynie  See more",
      "Initial release date": "2010-06-01",
      "Language": "Unqualified",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "5.28 x 7.56 x 0.67 inches; 2.12 Ounces",
      "Item model number": "120193",
      "Director": "Clint Eastwood",
      "Media Format": "Multiple Formats, Color, NTSC, Widescreen",
      "Run time": "2 hours and 15 minutes",
      "Release date": "June 1, 2010",
      "Actors": "Clint Eastwood, Meryl Streep, Jim Haynie, Annie Corley, Victor Slezak",
      "Producers": "Clint Eastwood, Kathleen Kennedy",
      "Studio": "Studio Distribution Services",
      "Writers": "Richard LaGravenese",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}