{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MERISIHAIR Short Bob Wig with Bangs,Straight Black Bob Wigs for Women,Natural Short Synthetic Bob Wig 11inch(Black)\nReview Date: 2021/08/22\nStore: MERISIHAIR\nAverage Rating: 3.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'MERISIHAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.54 x 8.23 x 2.17 inches; 8.15 Ounces', 'UPC': '780744482828'}\nReview Text: I was surprised by the quality of this wig.  I have had some good and some bad synthetic wigs.  This unit is well made and looks good enough to wear for daily use. The hair is soft and bouncy.  It does not have that extra shine fake wig look, which is a bonus.  I haven't experienced any shedding with this wig, even after a few wears and washings this unit is still in excellent condition.  The fit is comfortable and can be adjusted.  This wig is also secure enough to wear without glue.  Overall this wig works as a costume wig as well as a regular-wear wig. I would recommend this unit.\nReview Title: Good quality synthetic wig\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "HANNE None Lace Long Natural Wave Ombre Brown to Blonde Synthetic Wigs for Black Women High Density Heat Resistant Middle Part Wavy Synthetic Hair Party/Cosplay Party/Halloween Wigs (4/30/27 Wavy)\nHANNE\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Heat Resistant', 'Brand': 'HANNE', 'Package Dimensions': '10.19 x 8.66 x 3.26 inches; 11.53 Ounces'}\nReally cute wig. It is a big long and heavy for my liking. I definitely wouldn’t be comfortable wearing this wig everyday. It is fun for trying a different look or dressing up for Halloween or a party. It is a very full wig, and doesn’t shed much. It holds the waves through several wears. The color is natural and beautiful. It does fit well, and it doesn’t come off easily.\nGreat wig for a natural look, but a bit heavy\nStraight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nThis is one of my favorite wigs. It is more natural looking and feeling. It is not heavy or too full. This wig has a nice length and color. It is shiny, but not baby doll hair shiny. If worn correctly (with a little help from YouTube) you can achieve a very real and natural look wearing this wig. I was very impressed with this wig. It fits nicely and can be adjusted to fit your head. It is pretty secure without any extra items needed.\nGood quality wig\nAISI QUEENS Short Curly Wig Black Wavy Bob Wigs for Women Synthetic Middle Part Shoudler Length Heat Resistant Wig for Daily Party Use 14 Inch\nAISI QUEENS\n{'Hair Type': 'Wig,Curly Wig', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.02 x 1.77 inches; 8.47 Ounces'}\nThis wig is great. It isn’t heavy and is easy to put on. It is synthetic, so if you’re looking for something more realistic, you’ll have to make some adjustments to it. I wore it for fun, and not as something for going out. Wigs are new to me, so I kind of just wear them as is for now. I like that this wig was a nice length, and natural color and style right out the pack. Overall, this is a pretty good wig. It doesn’t shed, and would be good for like Halloween, parties, or just to have fun and try something new.\nBeautiful wig. Nice and lightweight.\nLong Straight Highlights Wigs for Women Synthetic Blonde Highlights Hair Wigs Natural Looking Middle Part Ombre Brown Heat Resistant Fiber Daily Cosplay Party\nBEAUTY FLAG\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'BEAUTY FLAG', 'Package Dimensions': '12.32 x 8.15 x 2.64 inches; 10.58 Ounces'}\nI really didn’t like this wig. It has a thick piece in the front that makes it look obvious you’re wearing a wig. Plus there was just too much hair in the face area. It would take some work to make this wig wearable for me.\nThe hair is way to full in the face\nLong Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nHNYBEE\n{'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nI like the look and feel of this wig. It is a little more full than I prefer, but it’s not a problem. The style and color are just as pictured. I like that this wig is soft too. The only issue I have is with the tangling. It tangles way too easily and badly. If you get this wig, it will need to be on a stand to avoid the tangles.\nOverall, this is a nice synthetic wig\nNOBLE Wigs for White Women Purple Lace Wigs for Black Women 27 Inch Long Curly Wavy Colored Wigs Middle Part Heat Resistant Synthetic Ombre Purple Wavy Wigs for Daily Party Cosplay Use\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.78 x 7.76 x 2.44 inches; 14.07 Ounces'}\nI like this wig, because it is great to wear as a costume wig. The quality is much better than the ones in the party stores. The hair isn’t too rough or too smooth. It doesn’t have that shiny wig look. It’s beautifully colored and styled. It’s really easy to install as is. It wasn’t too heavy. Most long wigs tend to be really heavy, and uncomfortable to wear for hours on end. This wig wasn’t uncomfortable at all. It tangles a little, but if you’re rarely wearing it, that won’t be a problem. Overall, I would recommend this wig.\nCute, fun, party wig\nM-BOX Long Curly Wavy Wigs 30 Inch Burgundy Synthetic Wigs For Women Body Wave Wig Middle Part Natural Looking Heat Resistant Full Wig for Cosplay Party Daily Use (#Bug)\nM-BOX\n{'Package Dimensions': '10.55 x 7.68 x 2.28 inches; 10.86 Ounces', 'UPC': '762917899299'}\nThis wig is gorgeous!  I love the reddish color.  I have only worn it as a costume wig and not a regular everyday wig.  It is really long and voluminous.  The hair is soft and it doesn't tangle easily.  I was surprised since most of the longer synthetic wigs tend to tangle very easily.  I was also surprised that it isn't a heavy wig.  The longer, fuller wigs tend to be heavy, and that makes it hard for me to wear them for long periods of time.  Overall, this unit is very beautiful and stylish, and I would recommend it.\nVery beautiful and stylish\nMERISIHAIR Short Bob Wig with Bangs,Straight Black Bob Wigs for Women,Natural Short Synthetic Bob Wig 11inch(Black)\nMERISIHAIR\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'MERISIHAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.54 x 8.23 x 2.17 inches; 8.15 Ounces', 'UPC': '780744482828'}\nI was surprised by the quality of this wig.  I have had some good and some bad synthetic wigs.  This unit is well made and looks good enough to wear for daily use. The hair is soft and bouncy.  It does not have that extra shine fake wig look, which is a bonus.  I haven't experienced any shedding with this wig, even after a few wears and washings this unit is still in excellent condition.  The fit is comfortable and can be adjusted.  This wig is also secure enough to wear without glue.  Overall this wig works as a costume wig as well as a regular-wear wig. I would recommend this unit.\nGood quality synthetic wig",
  "profile": "**User Profile Summary:**\n\n- **Hair Accessories:** The user enjoys synthetic wigs, emphasizing unique styles like short bobs and curly options. They seek versatility and creativity, prioritizing natural appearances while being sensitive to excessive fullness.\n\n- **Style Preference:** Wavy hairstyles and realistic colors, particularly ombre effects, remain central to their taste. The user has a discerning eye for quality, appreciating soft, well-crafted wigs that mimic natural hair look.\n\n- **Usage Context:** Primarily for special occasions like parties and cosplay, the user is increasingly exploring fun, casual styles. Comfort and wearability are now emphasized alongside aesthetics.\n\n- **Comfort Considerations:** Lightweight wigs are favored for extended wear. Their recent experiences have led to heightened satisfaction with styles that avoid excessive fullness while still looking appealing.\n\n- **Durability and Maintenance:** They value wigs that retain their style with minimal shedding. A commitment to quality and a natural appearance is still essential.\n\n- **Fit and Security:** The user prefers wigs with adjustable features for a secure fit. They continue to look for comfort solutions that don't compromise on fullness.\n\n- **Overall Sentiment:** The user enjoys the creative aspect of wigs and remains open to new styles. A recent positive experience with a quality synthetic wig has reinforced their focus on comfort, wearability, and realism, suitable for both casual and regular use.",
  "metrics": {
    "rouge1_f": 0.16748768472906403,
    "rouge2_f": 0.021141649048625793,
    "rougeL_f": 0.0844475721323012,
    "meteor": 0.06225919277178752,
    "bleu1": 0.0057649208755931125,
    "bleu2": 0.0019483914146632372,
    "bleu3": 0.0005637811835160702,
    "bleu4": 0.00017069319946366596,
    "bertscore_precision": 0.38964614272117615,
    "bertscore_recall": 0.5006506443023682,
    "bertscore_f1": 0.43822821974754333
  }
}