{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Long Straight Highlights Wigs for Women Synthetic Blonde Highlights Hair Wigs Natural Looking Middle Part Ombre Brown Heat Resistant Fiber Daily Cosplay Party\nReview Date: 2021/04/13\nStore: BEAUTY FLAG\nAverage Rating: 3.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'BEAUTY FLAG', 'Package Dimensions': '12.32 x 8.15 x 2.64 inches; 10.58 Ounces'}\nReview Text: I really didn’t like this wig. It has a thick piece in the front that makes it look obvious you’re wearing a wig. Plus there was just too much hair in the face area. It would take some work to make this wig wearable for me.\nReview Title: The hair is way to full in the face\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "HANNE None Lace Long Natural Wave Ombre Brown to Blonde Synthetic Wigs for Black Women High Density Heat Resistant Middle Part Wavy Synthetic Hair Party/Cosplay Party/Halloween Wigs (4/30/27 Wavy)\nHANNE\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Heat Resistant', 'Brand': 'HANNE', 'Package Dimensions': '10.19 x 8.66 x 3.26 inches; 11.53 Ounces'}\nReally cute wig. It is a big long and heavy for my liking. I definitely wouldn’t be comfortable wearing this wig everyday. It is fun for trying a different look or dressing up for Halloween or a party. It is a very full wig, and doesn’t shed much. It holds the waves through several wears. The color is natural and beautiful. It does fit well, and it doesn’t come off easily.\nGreat wig for a natural look, but a bit heavy\nStraight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nThis is one of my favorite wigs. It is more natural looking and feeling. It is not heavy or too full. This wig has a nice length and color. It is shiny, but not baby doll hair shiny. If worn correctly (with a little help from YouTube) you can achieve a very real and natural look wearing this wig. I was very impressed with this wig. It fits nicely and can be adjusted to fit your head. It is pretty secure without any extra items needed.\nGood quality wig\nAISI QUEENS Short Curly Wig Black Wavy Bob Wigs for Women Synthetic Middle Part Shoudler Length Heat Resistant Wig for Daily Party Use 14 Inch\nAISI QUEENS\n{'Hair Type': 'Wig,Curly Wig', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.02 x 1.77 inches; 8.47 Ounces'}\nThis wig is great. It isn’t heavy and is easy to put on. It is synthetic, so if you’re looking for something more realistic, you’ll have to make some adjustments to it. I wore it for fun, and not as something for going out. Wigs are new to me, so I kind of just wear them as is for now. I like that this wig was a nice length, and natural color and style right out the pack. Overall, this is a pretty good wig. It doesn’t shed, and would be good for like Halloween, parties, or just to have fun and try something new.\nBeautiful wig. Nice and lightweight.\nLong Straight Highlights Wigs for Women Synthetic Blonde Highlights Hair Wigs Natural Looking Middle Part Ombre Brown Heat Resistant Fiber Daily Cosplay Party\nBEAUTY FLAG\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'BEAUTY FLAG', 'Package Dimensions': '12.32 x 8.15 x 2.64 inches; 10.58 Ounces'}\nI really didn’t like this wig. It has a thick piece in the front that makes it look obvious you’re wearing a wig. Plus there was just too much hair in the face area. It would take some work to make this wig wearable for me.\nThe hair is way to full in the face",
  "profile": "**User Profile Summary:**\n\n- **Hair Accessories:** Prefers wigs, specifically synthetic options for versatility and style experimentation. Recently, there has been an inclination towards unique styles like short curly wigs, alongside an interest in longer straight styles with highlights, although recent experiences indicate some dissatisfaction when a wig appears overly full and unnatural.\n- **Style Preference:** Enjoys wavy hairstyles and natural-looking colors, consistently appreciating ombre effects. Despite exploration of modern styles, the user is discerning about wig aesthetics and seeks realism in appearance.\n- **Usage Context:** Likely uses wigs for special occasions such as parties, cosplay, or Halloween. Recently expanded interest in casual options for fun and experimentation, though has encountered some challenges with wearability and comfort in new purchases.\n- **Comfort Considerations:** Values lightweight wigs that are easy to wear for extended periods. Previous purchases have met comfort standards; however, issues with excessive fullness have emerged, indicating a need for further assessment of style suitability.\n- **Durability and Maintenance:** Values wigs that maintain their style and structure over time, with minimal shedding reported in favorable experiences. Current concerns highlight the importance of a natural look alongside quality.\n- **Fit and Security:** Appreciates wigs that fit well and include adjustable features for a secure fit. Recent feedback underscores the importance of a balanced fullness for comfort.\n- **Overall Sentiment:** Enjoys the fashion aspect of wigs, prioritizing aesthetic appeal while remaining open to new styles, though increasingly cautious about achieving a natural look and comfort in wearability.",
  "metrics": {
    "rouge1_f": 0.27417380660954715,
    "rouge2_f": 0.049079754601226995,
    "rougeL_f": 0.10771113831089353,
    "meteor": 0.11829088035256817,
    "bleu1": 0.0980448993280378,
    "bleu2": 0.03200156945483672,
    "bleu3": 0.009634392944522938,
    "bleu4": 0.0029750931482985577,
    "bertscore_precision": 0.39108484983444214,
    "bertscore_recall": 0.4647452235221863,
    "bertscore_f1": 0.4247450828552246
  }
}