{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Human Hair Half Wig Headband: 16″Remy Natural Body Wave Hairband Wigs for Black Women - 100% Real Hair 10A Glueless Brazilian Virgin 150% Density Wavy Wig with Hairband Attached\nReview Date: 2022/02/17\nStore: Ladoux\nAverage Rating: 3.1\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'Ladoux', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.49 x 6.14 x 2.52 inches; 12.63 Ounces', 'Item model number': 'Human Hair Headband Wig 16A'}\nReview Text: I ordered this wig because I love headband wigs. These are the easiest wigs for me to wear. This wig is soft and looks and feels natural. I wear these with a scarf instead of the headbands. It looks much cuter with a silk or satin scarf. I like that it comes with a few headbands, but they just aren't my style. This unit is easy to install, wash, and style. It doesn't shed much in the beginning, but after combing and brushing, over time it will shed. It is pretty dense so it won't affect how the wig looks. It is great for daily wear too. I would recommend this wig for anyone who loves a quick install.\nReview Title: Beautiful and easy to wear\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "HANNE None Lace Long Natural Wave Ombre Brown to Blonde Synthetic Wigs for Black Women High Density Heat Resistant Middle Part Wavy Synthetic Hair Party/Cosplay Party/Halloween Wigs (4/30/27 Wavy)\nHANNE\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Heat Resistant', 'Brand': 'HANNE', 'Package Dimensions': '10.19 x 8.66 x 3.26 inches; 11.53 Ounces'}\nReally cute wig. It is a big long and heavy for my liking. I definitely wouldn’t be comfortable wearing this wig everyday. It is fun for trying a different look or dressing up for Halloween or a party. It is a very full wig, and doesn’t shed much. It holds the waves through several wears. The color is natural and beautiful. It does fit well, and it doesn’t come off easily.\nGreat wig for a natural look, but a bit heavy\nStraight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nThis is one of my favorite wigs. It is more natural looking and feeling. It is not heavy or too full. This wig has a nice length and color. It is shiny, but not baby doll hair shiny. If worn correctly (with a little help from YouTube) you can achieve a very real and natural look wearing this wig. I was very impressed with this wig. It fits nicely and can be adjusted to fit your head. It is pretty secure without any extra items needed.\nGood quality wig\nAISI QUEENS Short Curly Wig Black Wavy Bob Wigs for Women Synthetic Middle Part Shoudler Length Heat Resistant Wig for Daily Party Use 14 Inch\nAISI QUEENS\n{'Hair Type': 'Wig,Curly Wig', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.02 x 1.77 inches; 8.47 Ounces'}\nThis wig is great. It isn’t heavy and is easy to put on. It is synthetic, so if you’re looking for something more realistic, you’ll have to make some adjustments to it. I wore it for fun, and not as something for going out. Wigs are new to me, so I kind of just wear them as is for now. I like that this wig was a nice length, and natural color and style right out the pack. Overall, this is a pretty good wig. It doesn’t shed, and would be good for like Halloween, parties, or just to have fun and try something new.\nBeautiful wig. Nice and lightweight.\nLong Straight Highlights Wigs for Women Synthetic Blonde Highlights Hair Wigs Natural Looking Middle Part Ombre Brown Heat Resistant Fiber Daily Cosplay Party\nBEAUTY FLAG\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'BEAUTY FLAG', 'Package Dimensions': '12.32 x 8.15 x 2.64 inches; 10.58 Ounces'}\nI really didn’t like this wig. It has a thick piece in the front that makes it look obvious you’re wearing a wig. Plus there was just too much hair in the face area. It would take some work to make this wig wearable for me.\nThe hair is way to full in the face\nLong Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nHNYBEE\n{'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nI like the look and feel of this wig. It is a little more full than I prefer, but it’s not a problem. The style and color are just as pictured. I like that this wig is soft too. The only issue I have is with the tangling. It tangles way too easily and badly. If you get this wig, it will need to be on a stand to avoid the tangles.\nOverall, this is a nice synthetic wig\nNOBLE Wigs for White Women Purple Lace Wigs for Black Women 27 Inch Long Curly Wavy Colored Wigs Middle Part Heat Resistant Synthetic Ombre Purple Wavy Wigs for Daily Party Cosplay Use\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.78 x 7.76 x 2.44 inches; 14.07 Ounces'}\nI like this wig, because it is great to wear as a costume wig. The quality is much better than the ones in the party stores. The hair isn’t too rough or too smooth. It doesn’t have that shiny wig look. It’s beautifully colored and styled. It’s really easy to install as is. It wasn’t too heavy. Most long wigs tend to be really heavy, and uncomfortable to wear for hours on end. This wig wasn’t uncomfortable at all. It tangles a little, but if you’re rarely wearing it, that won’t be a problem. Overall, I would recommend this wig.\nCute, fun, party wig\nM-BOX Long Curly Wavy Wigs 30 Inch Burgundy Synthetic Wigs For Women Body Wave Wig Middle Part Natural Looking Heat Resistant Full Wig for Cosplay Party Daily Use (#Bug)\nM-BOX\n{'Package Dimensions': '10.55 x 7.68 x 2.28 inches; 10.86 Ounces', 'UPC': '762917899299'}\nThis wig is gorgeous!  I love the reddish color.  I have only worn it as a costume wig and not a regular everyday wig.  It is really long and voluminous.  The hair is soft and it doesn't tangle easily.  I was surprised since most of the longer synthetic wigs tend to tangle very easily.  I was also surprised that it isn't a heavy wig.  The longer, fuller wigs tend to be heavy, and that makes it hard for me to wear them for long periods of time.  Overall, this unit is very beautiful and stylish, and I would recommend it.\nVery beautiful and stylish\nMERISIHAIR Short Bob Wig with Bangs,Straight Black Bob Wigs for Women,Natural Short Synthetic Bob Wig 11inch(Black)\nMERISIHAIR\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'MERISIHAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.54 x 8.23 x 2.17 inches; 8.15 Ounces', 'UPC': '780744482828'}\nI was surprised by the quality of this wig.  I have had some good and some bad synthetic wigs.  This unit is well made and looks good enough to wear for daily use. The hair is soft and bouncy.  It does not have that extra shine fake wig look, which is a bonus.  I haven't experienced any shedding with this wig, even after a few wears and washings this unit is still in excellent condition.  The fit is comfortable and can be adjusted.  This wig is also secure enough to wear without glue.  Overall this wig works as a costume wig as well as a regular-wear wig. I would recommend this unit.\nGood quality synthetic wig\nApeasex Water Wave Headband Wigs for Black Women Short Wet And Wavy Bob Wig Human Hair None Lace Front Wigs 150% Density Natural Color 10 Inch (10 Inch, Water Wave) (10 Inch, Water Wave)\nApeasex\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Apeasex', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.07 x 8.74 x 3.46 inches; 8.01 Ounces', 'UPC': '679872943700'}\nThis unit is one of my favorites.  It is the perfect style and length for me. Since I don't want to cut my hair and also don't want to apply heat to it daily, this unit gives me the look I love.  It is easy to install since it is a headband wig. I don't need any glue or anything since it has a band on it to keep it secure. The combs on the cap also help to keep it secure.  I find this unit to be easy to maintain also. I love how soft and bouncy the hair is. I have had so many people think this was actually my hair and was surprised to find out it is a wig. That is a plus and means this unit is definitely of good quality. I highly recommend this unit for beginners as well as professional wig wearers. It's always nice to have a good headband wig. They are quick and easy to install.\nBeautiful, quick and easy to install\n18 Pack Hair Ties,Spiral elastics, Multi Color Hair Scrunchies, No Crease Spiral Hair Elastics,Hair ties for women\nGomayee\n{'Color': 'Multicolor/Assorted', 'Material': 'Silk, Plastic, Rubber', 'Brand': 'Gomayee', 'Item Dimensions LxWxH': '2 x 2 x 1 inches', 'Hair Type': 'Curly', 'Product Dimensions': '2 x 2 x 1 inches; 2.4 Ounces', 'UPC': '719986067913'}\nI had been seeing people with these hair ties for awhile now, and decided to try them for myself. They are really stretchy and can hold a lot of hair, even thick hair. I find I don’t have many strands of hair in this hair tie when I take it out. It is really comfortable too. I don’t have to have it so tight that it hurts and it still stays in place. The colors are nice too. I would recommend these hair ties.\nNon damaging hair tie\nHuman Hair Half Wig Headband: 16″Remy Natural Body Wave Hairband Wigs for Black Women - 100% Real Hair 10A Glueless Brazilian Virgin 150% Density Wavy Wig with Hairband Attached\nLadoux\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'Ladoux', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.49 x 6.14 x 2.52 inches; 12.63 Ounces', 'Item model number': 'Human Hair Headband Wig 16A'}\nI ordered this wig because I love headband wigs. These are the easiest wigs for me to wear. This wig is soft and looks and feels natural. I wear these with a scarf instead of the headbands. It looks much cuter with a silk or satin scarf. I like that it comes with a few headbands, but they just aren't my style. This unit is easy to install, wash, and style. It doesn't shed much in the beginning, but after combing and brushing, over time it will shed. It is pretty dense so it won't affect how the wig looks. It is great for daily wear too. I would recommend this wig for anyone who loves a quick install.\nBeautiful and easy to wear",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Beautiful and easy to wear",
    "text": "I ordered this wig because I love headband wigs. These are the easiest wigs for me to wear. This wig is soft and looks and feels natural. I wear these with a scarf instead of the headbands. It looks much cuter with a silk or satin scarf. I like that it comes with a few headbands, but they just aren't my style. This unit is easy to install, wash, and style. It doesn't shed much in the beginning, but after combing and brushing, over time it will shed. It is pretty dense so it won't affect how the wig looks. It is great for daily wear too. I would recommend this wig for anyone who loves a quick install.",
    "images": [],
    "asin": "B09H2PWXZ3",
    "parent_asin": "B09H2PWXZ3",
    "user_id": "AFLGJMNYVAAQKGCL7IBP3YSK7Z2Q",
    "timestamp": "2022-02-17 15:45:21.911000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Human Hair Half Wig Headband: 16″Remy Natural Body Wave Hairband Wigs for Black Women - 100% Real Hair 10A Glueless Brazilian Virgin 150% Density Wavy Wig with Hairband Attached",
    "average_rating": 3.1,
    "rating_number": 4,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51UpeReJ0pL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51UpeReJ0pL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/814f1KEQ9PL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5132EfRJxTL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/5132EfRJxTL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71wP2-H0wkL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/513bfuNZgFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/513bfuNZgFL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71Lr8xOXhdL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51T0EEYgvcL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51T0EEYgvcL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/612n-ipjt6L._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41J7MA190VL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41J7MA190VL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61+kgfeO13L._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Qlu4mV2-L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Qlu4mV2-L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81ueMagw-6L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51xCWm7SZ5L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51xCWm7SZ5L.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/81jD9CzePoL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51-tvDPGh9L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-tvDPGh9L.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/811ZkFjC6hL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Human Hair Headband Wig for Black Women",
        "url": "https://www.amazon.com/vdp/0fb21ab982464d54af8909e41ec50920?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Ladoux",
    "categories": [],
    "details": {
      "Material": "Human Hair",
      "Hair Type": "Wavy",
      "Brand": "Ladoux",
      "Age Range (Description)": "Adult",
      "Package Dimensions": "9.49 x 6.14 x 2.52 inches; 12.63 Ounces",
      "Item model number": "Human Hair Headband Wig 16A"
    },
    "bought_together": null
  }
}