{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nReview Date: 2020/02/22\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nReview Text: This is one of my favorite wigs. It is more natural looking and feeling. It is not heavy or too full. This wig has a nice length and color. It is shiny, but not baby doll hair shiny. If worn correctly (with a little help from YouTube) you can achieve a very real and natural look wearing this wig. I was very impressed with this wig. It fits nicely and can be adjusted to fit your head. It is pretty secure without any extra items needed.\nReview Title: Good quality wig\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "HANNE None Lace Long Natural Wave Ombre Brown to Blonde Synthetic Wigs for Black Women High Density Heat Resistant Middle Part Wavy Synthetic Hair Party/Cosplay Party/Halloween Wigs (4/30/27 Wavy)\nHANNE\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Heat Resistant', 'Brand': 'HANNE', 'Package Dimensions': '10.19 x 8.66 x 3.26 inches; 11.53 Ounces'}\nReally cute wig. It is a big long and heavy for my liking. I definitely wouldn’t be comfortable wearing this wig everyday. It is fun for trying a different look or dressing up for Halloween or a party. It is a very full wig, and doesn’t shed much. It holds the waves through several wears. The color is natural and beautiful. It does fit well, and it doesn’t come off easily.\nGreat wig for a natural look, but a bit heavy\nStraight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nThis is one of my favorite wigs. It is more natural looking and feeling. It is not heavy or too full. This wig has a nice length and color. It is shiny, but not baby doll hair shiny. If worn correctly (with a little help from YouTube) you can achieve a very real and natural look wearing this wig. I was very impressed with this wig. It fits nicely and can be adjusted to fit your head. It is pretty secure without any extra items needed.\nGood quality wig",
  "profile": "**User Profile Summary:**\n\n- **Hair Accessories:** Prefers wigs, specifically synthetic options for versatility and style experimentation, recently favoring a unique straight burgundy lace front wig.\n- **Style Preference:** Enjoys wavy hairstyles and natural-looking colors, with a penchant for ombre effects; has appreciated straight styles in modern coloration for a natural look.\n- **Usage Context:** Likely uses wigs for special occasions such as parties, cosplay, or Halloween rather than daily wear, with recent purchases enhancing this trend.\n- **Comfort Considerations:** Prefers lightweight wigs; values those that are not heavy or too full, ensuring comfort for longer wear.\n- **Durability and Maintenance:** Values wigs that maintain their style and integrity over time, with minimal shedding, and recently found a wig that stays securely in place without additional items.\n- **Fit and Security:** Appreciates wigs that fit well and can be adjusted for a secure fit; recent experiences indicate satisfaction with fit and adjustability.\n- **Overall Sentiment:** Enjoys the fashion aspect of wigs and the ability to achieve a natural appearance while emphasizing comfort and practicality, indicating a balanced approach to style, usability, and quality.\n\nThe user’s latest interaction reflects a positive experience with a modern wig that combines aesthetic quality with comfort and practicality, reinforcing their established preferences for versatile, stylish hair options.",
  "metrics": {
    "rouge1_f": 0.3552894211576847,
    "rouge2_f": 0.09218436873747494,
    "rougeL_f": 0.15169660678642716,
    "meteor": 0.19815643161122048,
    "bleu1": 0.24729337505431495,
    "bleu2": 0.10592000233849036,
    "bleu3": 0.0594711609909501,
    "bleu4": 0.03877976913625359,
    "bertscore_precision": 0.4437594711780548,
    "bertscore_recall": 0.4823596477508545,
    "bertscore_f1": 0.4622551500797272
  }
}