{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Long Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nReview Date: 2021/04/13\nStore: HNYBEE\nAverage Rating: 2.9\nProduct Details: {'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nReview Text: I like the look and feel of this wig. It is a little more full than I prefer, but it’s not a problem. The style and color are just as pictured. I like that this wig is soft too. The only issue I have is with the tangling. It tangles way too easily and badly. If you get this wig, it will need to be on a stand to avoid the tangles.\nReview Title: Overall, this is a nice synthetic wig\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "HANNE None Lace Long Natural Wave Ombre Brown to Blonde Synthetic Wigs for Black Women High Density Heat Resistant Middle Part Wavy Synthetic Hair Party/Cosplay Party/Halloween Wigs (4/30/27 Wavy)\nHANNE\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Heat Resistant', 'Brand': 'HANNE', 'Package Dimensions': '10.19 x 8.66 x 3.26 inches; 11.53 Ounces'}\nReally cute wig. It is a big long and heavy for my liking. I definitely wouldn’t be comfortable wearing this wig everyday. It is fun for trying a different look or dressing up for Halloween or a party. It is a very full wig, and doesn’t shed much. It holds the waves through several wears. The color is natural and beautiful. It does fit well, and it doesn’t come off easily.\nGreat wig for a natural look, but a bit heavy\nStraight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nThis is one of my favorite wigs. It is more natural looking and feeling. It is not heavy or too full. This wig has a nice length and color. It is shiny, but not baby doll hair shiny. If worn correctly (with a little help from YouTube) you can achieve a very real and natural look wearing this wig. I was very impressed with this wig. It fits nicely and can be adjusted to fit your head. It is pretty secure without any extra items needed.\nGood quality wig\nAISI QUEENS Short Curly Wig Black Wavy Bob Wigs for Women Synthetic Middle Part Shoudler Length Heat Resistant Wig for Daily Party Use 14 Inch\nAISI QUEENS\n{'Hair Type': 'Wig,Curly Wig', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.5 x 9.02 x 1.77 inches; 8.47 Ounces'}\nThis wig is great. It isn’t heavy and is easy to put on. It is synthetic, so if you’re looking for something more realistic, you’ll have to make some adjustments to it. I wore it for fun, and not as something for going out. Wigs are new to me, so I kind of just wear them as is for now. I like that this wig was a nice length, and natural color and style right out the pack. Overall, this is a pretty good wig. It doesn’t shed, and would be good for like Halloween, parties, or just to have fun and try something new.\nBeautiful wig. Nice and lightweight.\nLong Straight Highlights Wigs for Women Synthetic Blonde Highlights Hair Wigs Natural Looking Middle Part Ombre Brown Heat Resistant Fiber Daily Cosplay Party\nBEAUTY FLAG\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'BEAUTY FLAG', 'Package Dimensions': '12.32 x 8.15 x 2.64 inches; 10.58 Ounces'}\nI really didn’t like this wig. It has a thick piece in the front that makes it look obvious you’re wearing a wig. Plus there was just too much hair in the face area. It would take some work to make this wig wearable for me.\nThe hair is way to full in the face\nLong Black Wavy Wig with Bangs for Women Synthetic Wigs Natural Looking Realistic Wigs Hair for Daily Party Cosplay Use\nHNYBEE\n{'Item Dimensions LxWxH': '24 x 6.3 x 1.57 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'HNYBEE', 'Age Range (Description)': 'Adult', 'Product Dimensions': '24 x 6.3 x 1.57 inches; 14.32 Ounces', 'UPC': '723509998806'}\nI like the look and feel of this wig. It is a little more full than I prefer, but it’s not a problem. The style and color are just as pictured. I like that this wig is soft too. The only issue I have is with the tangling. It tangles way too easily and badly. If you get this wig, it will need to be on a stand to avoid the tangles.\nOverall, this is a nice synthetic wig",
  "profile": "**User Profile Summary:**\n\n- **Hair Accessories:** The user prefers synthetic wigs for their versatility and style experimentation. They have shown interest in unique styles, such as short curly wigs and longer straight options with highlights. However, they remain sensitive to fullness, expressing dissatisfaction with wigs that appear overly voluminous and unnatural.\n\n- **Style Preference:** The user enjoys wavy hairstyles and natural-looking colors, particularly favoring ombre effects. They are discerning regarding wig aesthetics and prioritize achieving a realistic look.\n\n- **Usage Context:** Wigs are primarily used for special occasions like parties, cosplay, or Halloween, with a growing interest in casual styles for fun and experimentation. Recent purchases have highlighted challenges with wearability and comfort.\n\n- **Comfort Considerations:** The user values lightweight wigs that are easy to wear for extended periods. While previous purchases typically met comfort standards, concerns have emerged regarding excessive fullness affecting comfort.\n\n- **Durability and Maintenance:** The user appreciates wigs that maintain their style over time with minimal shedding. They emphasize the importance of achieving a natural look alongside quality.\n\n- **Fit and Security:** The user seeks well-fitting wigs with adjustable features for a secure fit. Recent feedback indicates a continuing quest for balance in fullness to enhance comfort.\n\n- **Overall Sentiment:** The user enjoys the fashion aspect of wigs and remains open to new styles but is increasingly cautious about comfort and achieving a natural appearance, focusing on realistic aesthetics.",
  "metrics": {
    "rouge1_f": 0.2521186440677966,
    "rouge2_f": 0.042462845010615716,
    "rougeL_f": 0.1059322033898305,
    "meteor": 0.09733772937970966,
    "bleu1": 0.049230857928588195,
    "bleu2": 0.016214418768105986,
    "bleu3": 0.004896516160585154,
    "bleu4": 0.001514432855923812,
    "bertscore_precision": 0.40141162276268005,
    "bertscore_recall": 0.4993363320827484,
    "bertscore_f1": 0.44505104422569275
  }
}