{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Smooth Lavender Sugar Scrub\nReview Date: 2017/10/20\nStore: Lime and Lotus Organics\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Lime and Lotus Organics', 'Skin Type': 'Oily', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Information': 'Jar', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.75 x 2.75 x 1.75 inches; 3.2 Ounces', 'UPC': '712038258284'}\nReview Text: I'll admit when I first received this scrub I was disappointed.  It was a small container, and I thought it would be gone within a week.  It has been three weeks, and I barely made a dent!  The scent is lovely, the scrub is luxurious, and most importantly... it works!  My skin is smooth and blemish-free.  That is quite the achievement!\nReview Title: A surprise\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hippie Honey Scrub Exfoliant Facial Cleanser by Hippie Skin\nHippie Skin\n['A gentle, invigorating cleanser that sloughs away dead skin, fights bacteria, and leaves skin soft and vibrant. Formulated with essential oils that support aging skin, this cleanser is a must have for a natural daily routine! SCENT: Lavender and honey, yum! INGREDIENT SUPERSTARS: Raw Honey - antioxidant, antibacterial and antiinflammatory properties support reduced scarring and promote skin regeneration. The natural sugar crystallization and glycolic acid contained in raw honey gently sloughs away dead skin cells, promoting cleaner, healthier skin. Lavender Essential Oil: Promotes skin healing, reduces redness and promotes blood circulation, which provides more oxygen and nutrients to the skin. Carrot Seed Essential Oil: Promotes skin health through antiseptic properties. Tightens pores and skin to combat sagging skin and fine lines. DIRECTIONS: Massage onto face with upward circular motions and rinse well with warm water. Recommended for all skin types.']\n{'Brand': 'Hippie Skin', 'Item Form': 'Gel', 'Skin Type': 'Oily, Dry, Normal', 'Material Feature': 'Natural', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.36 x 2.36 x 2.68 inches; 0.64 Ounces', 'UPC': '865233000117', 'Manufacturer': 'Hippie Skin'}\nThe scrub has a creamy texture and smell strongly of honey.  It applies easily to the skin, and rinses off without effort.  My skin feels soft after use, and it has helped with my break-outs\nIt applies easily to the skin\nArgan Oil Shampoo and Conditioner Set - Sulfate Free All Natural Hair Repair Treatment, Clarifying Volumizing & Moisturizing, Color Safe, Gentle for Curly & Color Treated Hair Gift Set (2x 8oz)\nPremium Nature\n{'Product Benefits': 'Moisturizing', 'Item Form': 'Liquid', 'Brand': 'Premium Nature', 'Hair Type': 'Curly,Damaged,All,Straight,Color Treated', 'Special Ingredients': 'Vitamin-e,Jojoba-oil,Almond-oil,Peach,Argan-oil,Camellia-oil'}\nI have been using this shampoo and conditioner set only briefly. Nevertheless, it smells pleasant, it didn't leave my hair tangled, or oily. It left my hair with a lot of body, and very soft. Of course, time will tell as to how my hair hold up in the long run. For the time being however… I am very  pleased.\nSo far I am very satisfied.\nSmooth Lavender Sugar Scrub\nLime and Lotus Organics\n{'Brand': 'Lime and Lotus Organics', 'Skin Type': 'Oily', 'Material Feature': 'Certified Organic', 'Number of Items': '1', 'Package Information': 'Jar', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.75 x 2.75 x 1.75 inches; 3.2 Ounces', 'UPC': '712038258284'}\nI'll admit when I first received this scrub I was disappointed.  It was a small container, and I thought it would be gone within a week.  It has been three weeks, and I barely made a dent!  The scent is lovely, the scrub is luxurious, and most importantly... it works!  My skin is smooth and blemish-free.  That is quite the achievement!\nA surprise",
  "profile": "**User Profile Summary:**\n\n- **Product Preferences:** Prefers natural skincare products with gentle and effective formulations. Recently tried a sugar scrub, indicating an open-minded approach to exploring new product types that maintain quality and effectiveness across various skin conditions, particularly oily skin.\n\n- **Scent Preferences:** Enjoys calming and pleasant scents, with a specific affinity for lavender. The appreciation for pleasant aromas aligns with recent experiences where scent significantly influenced product satisfaction.\n\n- **Skin and Hair Types:** Interested in versatile products suitable for different skin types, with a focus on achieving smoothness and clarity in skin texture.\n\n- **Texture Preferences:** Favors creamy textures in skincare products, but has demonstrated an enthusiasm for scrubs that offer a luxurious and effective experience. Their latest interaction suggests enjoyment of products that provide a tactile, enjoyable application.\n\n- **Usage Focus:** Looks for products that effectively cleanse and enhance the skin's texture, emphasizing outcomes like smoothness and blemish-free skin, reflecting a desire for functional and transformative skincare.\n\n- **Review Tendencies:** Provides constructive feedback that highlights effectiveness, sensory experiences, and value for money. Recently demonstrated keen observance of product longevity and practical usage in their reviews.\n\n- **Natural Ingredients:** Maintains a strong preference for natural and organic formulations, reinforcing a focus on holistic, effective, and sensory-friendly solutions in skincare.\n\nOverall, the user showcases a commitment to effective, high-quality, and sensorial skincare experiences, while remaining aware of product performance and longevity.",
  "metrics": {
    "rouge1_f": 0.23863636363636365,
    "rouge2_f": 0.031339031339031334,
    "rougeL_f": 0.11363636363636365,
    "meteor": 0.10700551747199465,
    "bleu1": 0.11585219379811439,
    "bleu2": 0.03774019664251027,
    "bleu3": 0.005425689995923495,
    "bleu4": 0.002058936257171248,
    "bertscore_precision": 0.4090469479560852,
    "bertscore_recall": 0.48724234104156494,
    "bertscore_f1": 0.4447336494922638
  }
}