{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/09/17\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Anatole Litvak'], 'Producers': ['Anatole Litvak'], 'Starring': ['Edward G. Robinson', 'Claire Trevor', 'Humphrey Bogart'], 'Studio': ['WARNER BROS.']}\nReview Text: My favorite Edward g Robinson movie ever. Very entertaining.\nReview Title: Great old movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kenneth Fink', 'J. Miller Tobin', 'Bobby Roth', 'Matt Earl Beesley', 'John Terlesky', 'Sanford Bookstaver', 'Colin Bucksey', 'Matt Shakman', 'John Scott', 'Randy Zisk'], 'Starring': ['Madeleine Stowe', 'Emily VanCamp', 'Gabriel Mann'], 'Studio': ['ABC']}\nThe show is very entertaining. The plot gets a bit hard to follow at times and it feels like a &#34;soap opera&#34; more than a series.\nEntertaining\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John T. Kretchmer', 'Rob Spera', 'Joanna Kerns', 'Chris Peppe', 'Kevin Dowling', 'James Bruce', 'Allison Liddi-Brown', 'Carl Lawrence Ludwig', 'John Terlesky', 'Glenn Kershaw'], 'Studio': ['Lifetime']}\nI really like all the action and drama in this series. It is somewhat believable. I wish they would hurry up with season 8.\nPretty Cool Show\nCedar Cove\nDrama, Romance\n[\"Judge Olivia Lockhart finds herself in the middle of her small seaside town's drama, relationships and excitement. As Olivia reaches new milestones in her relationship with Jack, she remains a reliable best friend to Grace and a supportive mom to Justine, proving this judge continues to capture the spirit of the small town in her big heart.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Hallmark'], 'Producers': ['Hallmark'], 'Starring': ['Andie MacDowell', 'Dylan Neal', 'Teryl Rothery']}\nAwesome show! Clean and family friendly.\nBest Show Ever\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kenneth Fink', 'J. Miller Tobin', 'Bobby Roth', 'Matt Earl Beesley', 'John Terlesky', 'Sanford Bookstaver', 'Colin Bucksey', 'Matt Shakman', 'John Scott', 'Randy Zisk'], 'Starring': ['Madeleine Stowe', 'Emily VanCamp', 'Gabriel Mann'], 'Studio': ['ABC']}\nI like this a lot, however, they should have ended this with the closing of season three. So far, season 4 has been a flop.\nI like this a lot\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Lee Toland Krieger'], 'Producers': ['Sidney Kimmel', 'Tom Rosenberg', 'Gary Lucchesi'], 'Starring': ['Blake Lively', 'Michiel Huisman'], 'Studio': ['Lionsgate']}\nSlow, boring and predictable. No point to the movie whatsoever.\nboring and predictable\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]']}\nThis is a great series. This season is a bit predictable, though. I hope there is a fifth season so they can wrap this story up!\nGreat Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dmytryk', 'Edward'], 'Producers': ['Stanley Kramer'], 'Starring': ['Humphrey Bogart', 'Jose Ferrer', 'Van Johnson'], 'Studio': ['Classics']}\nThis is an awesome movie. All the great old time actors. Bogart did an amazing job in this roll.\nAwesome\nTCM Greatest Classic Gangsters: Edward G. Robinson\nEdward G. Robinson  (Actor),     Humphrey Bogart  (Actor),     William Keighley  (Director),     Michael Curtiz  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['TCM Greatest Classic Films: Gangsters - Edward G. Robinson (4FE)', 'THE LITTLE GIANT (1933), BULLETS OR BALLOTS (1936) , KID GALAHAD (1937), LARCENY INC. (1942) THE LITTLE GIANT (1933) Windy City bootlegger Robinson sets out for a new life when Prohibition kicks in. In posh, polo-playing Santa Barbara, he seeks class and atmosphere. But swindlers, gold diggers and great fun are what we get from this not-so-little pre-Code comedy gem. INCLUDES: Warner Night at the Movies 1933 with Newsreel, Musical Short Use Your Imagination, Cartoon The Dish Ran Away with the Spoon and Theatrical Trailers Commentary by Historians Daniel Bubbeo and John McCarty BULLETS OR BALLOTS (1936) “They rule by fear of their guns and must be stopped by the power of your ballots.” They are Bugs Fenner (Humphrey Bogart) and other mobsters whose illicit rackets will be smashed by undercover cop Johnny Blake (Edward G. Robinson). INCLUDES: Warner Night at the Movies 1936 with Newsreel, Musical Short George Hall and His Orchestra, Cartoon I’m a Big Shot Now and Theatrical Trailers Featurette Gangsters: The Immigrant’s Hero Commentary by Historian Dana Polan How I Play Golf by Bobby Jones No. 10: Trouble Shots Breakdowns of 1936: Studio Blooper Reel Radio Show Adaptation KID GALAHAD (1937) Robinson and Bogart play rival fight promoters and Bette Davis is the moll who has eyes for brawling bellhop Wayne Morris in this “best of ’30s boxing movies” (David Shipman, The Story of Cinema). INCLUDES: Warner Night at the Movies 1940 with Newsreel, Comedy Short Postal Union, Your True Adventure Series Short Alibi Mark, Cartoons Egghead Rides Again, I Wanna Be a Sailor and Porky’s Super Service and Theatrical Trailers Commentary by Historians Art Simon and Robert Sklar LARCENY INC. (1942) Robinson turns his mobster persona on its head and laughs spill from the pockets in a delicious tale of ex-jailbirds who run a luggage shop as a front while tunnelng into the bank next door. Broderick Crawford, Jane Wyman and Anthony Quinn co-star. INCLUDES: Warner Night at the Movies 1942 with Newsreel, Patriotic Short Winning Your Wings, Cartoons Porky’s Pastry Pirates and The Wabbit Who Came to Supper and Theatrical Trailers Commentary by Historians Haden Guest and Dana Polan ALL INCLUDE: Subtitles: English & Français, Plus Español on Bullets or Ballots (Main Feature. Bonus Material/Trailer May Not Be Subtitled).', ']]>']\n{'Genre': 'Musicals, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Edward G. Robinson, Bette Davis, Humphrey Bogart, William Keighley, Jane Wyman, Michael Curtiz', 'Language': 'English', 'Runtime': '5 hours and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'TCMV1000175334DVD', 'Director': 'William Keighley, Michael Curtiz', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '5 hours and 53 minutes', 'Release date': 'March 13, 2012', 'Actors': 'Edward G. Robinson, Humphrey Bogart, Bette Davis, Jane Wyman', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nI thought these were movies, but they were only reviews. I might be wrong, or perhaps I got a dud, but I didn’t get any actual movies to come up, only movie reviews.\nJust reviews\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Anatole Litvak'], 'Producers': ['Anatole Litvak'], 'Starring': ['Edward G. Robinson', 'Claire Trevor', 'Humphrey Bogart'], 'Studio': ['WARNER BROS.']}\nMy favorite Edward g Robinson movie ever. Very entertaining.\nGreat old movie",
  "profile": "**User Summary:**\n\nThe user continues to value engaging narratives in television shows and films that blend action, drama, and romance, maintaining high expectations for coherence and originality. Their preference for character-driven plots, particularly rich relationship dynamics, aligns with a growing affinity for classic cinema, further emphasized by recent experiences that reflect a heightened scrutiny of older films.\n\nRecent interactions showcase the user's admiration for classic films, exemplified by a favorable review of a notable title featuring well-known actors, highlighting their appreciation for timeless storytelling. Despite this enthusiasm, the user remains critical, as indicated by a low rating given to a previous product that failed to meet their narrative quality standards.\n\nWhile the user's preference for English-language content and reliance on closed captioning for improved comprehension continues, their ratings reflect an unwavering commitment to excellence. With an overall average of 4.8, their reviews consistently highlight a sophisticated approach to evaluating entertainment.\n\nIn summary, the user seeks well-crafted series and films infused with strong romantic and dramatic elements, demonstrating an evolving critique that highlights both original narratives and outstanding performances. Their discerning taste indicates a dynamic engagement with both contemporary and classic offerings, ever-receptive to the artistry of storytelling.",
  "metrics": {
    "rouge1_f": 0.13409648405560098,
    "rouge2_f": 0.004914004914004914,
    "rougeL_f": 0.06377759607522486,
    "meteor": 0.03594682582745524,
    "bleu1": 0.0008350444230777971,
    "bleu2": 0.0001815468933948109,
    "bleu3": 3.196714705625307e-05,
    "bleu4": 1.3429042010285483e-05,
    "bertscore_precision": 0.3111276626586914,
    "bertscore_recall": 0.433321475982666,
    "bertscore_f1": 0.362196147441864
  }
}