{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Skinmed Glow Cell BB Cream to Control Sebum with Natural Ingredients 50 ml - 1.7 Ounce\nReview Date: 2021/02/02\nStore: Ph. Drop\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Ph. Drop', 'Item Form': 'Cream', 'Unit Count': '1.7 Ounce', 'Number of Items': '1', 'Skin Type': 'Acne prone,oily,sensitive,all skin types', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.81 x 1.26 x 6.3 inches; 1.7 Ounces', 'UPC': '880128810633'}\nReview Text: I have a medium tan skin tone and this did not work for me at all. It's waaaay too light. Definitely meant for fair to light medium skin tones. This stuff is pretty pigmented so I wouldn't try it if you think it might be too light. It probably will be. Goes on pretty opaque and pigmented, it's almost a light/medium weight foundation. It does go in silky smooth and has a nice finish. I also like the pump and packaging. A bit of a scent to it, but it's not too bad. Wish they made this in more shades!\nReview Title: Meant for lighter skin tones!\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Remy Human Hair Pieces Front Clip in Hair #1B Natural Black Fringe Hair Extensions with Hair Temples\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9 x 1 x 1 inches; 0.48 Ounces', 'UPC': '615517482166'}\nI think this might work for people with smaller heads or smaller faces but I felt it wasn’t wider enough or thick enough to look good on me. The hair was very soft and real looking though!\nNot very much hair\nJPNK 10PCS Makeup tool set, Blender Sponges& Air cushion puff&Sponge Holder for Blending Liquid, Cream or Flawless Powder Cosmetics\nJPNK\n{'Brand': 'JPNK', 'Skin Type': 'All', 'Recommended Uses For Product': 'Foundation,Concealer,Blender', 'Package Dimensions': '8.5 x 5.4 x 2.3 inches; 5.61 Ounces'}\nYou never know what you're gonna get with some of these beauty sponges, but this is definitely one of the good sets.<br /><br />The sponges are actually soft and don't absorb as much product as other sponges. I recently tried another brand that looked exactly the same but they were so hard and rubbery. These are soooo much softer in comparison. I don't feel like I'm softly punching my face like I do with the others😂<br /><br />Very easy to clean, after use and have no weird smell or anything. I haven't used the puffs or brush yet but I'm going to attempt to use the puffs for powder or maybe even jelly products. The brush would probably work well for concealer or eyeshadow primer. It has soft bristles and a solid handle.<br /><br />Overall I think this is an awesome quality set for a great price!!\nHigher quality beauty sponges than other brands!\nSAMYANG ABOUTME Red Recipe Super Cleansing Balm 3.04 oz. (90ml) - Soft Melting Milk Texture Makeup Cleansing Balm, Mineral Contained Nourishing & Soothing Cleansing, Rose Scented\nSamyang\n{'Package Dimensions': '3.66 x 3.39 x 2.36 inches; 5.57 Ounces'}\nI tried this a few times and couldn't help but feeling like it left residue on my face. I end up using my normal face wash afterwards to feel properly cleansed.<br /><br />To be fair I don't wear much face makeup so perhaps this might work better for someone that wears foundation. I did try to remove my eye makeup with this balm and it was too greasy/thick and also stung my eyes, whereas my micellar water won't do that.<br /><br />The scent is a nice clean rose scent and I like the packaging, but I don't think I'll continue to use this. Seems like more work than is necessary and kinda makes me feel like it will clog my pores in the long run...\nFeels like it creates an extra step...\n[moonshot] Cream Paint Lightfit Air 3g - Blackpink Lisa Makeup Kpop Kbeauty Cosmetics, Airy Velvet Texture Matte Lip Makeup, Long Lasting Natrual Daily Lip Color (501 Almond Rose)\nMoonshot\n{'Brand': 'Moonshot', 'Skin Type': 'All', 'Item Form': 'Cream', 'Finish Type': 'Cream', 'Product Benefits': 'Long Lasting,Brightening,Makeup'}\nA pretty MLBB velvety lip color.  The formula isn't nearly as drying as typical matte liquid lips. More of a velvety mousse like texture.<br /><br />I have medium tan skin and I'd say this is a nude pink shade on me so it may be a bit light for deeper skin tones.<br /><br />I discovered you can also use this as a cheek color as well! I dab a bit on the back of my hand and apply it from there. It's pretty pigmented on the cheeks so starting with less is better.\nCan also be used as cream blush!:)\nHair Scrunchies for women,Including 3 Pcs Long Silk Satin Hair Scarf & 3 Pcs Bunny Ear Scrunchies & 3 Pcs Elastic Hair Bands Scrunchy and 7Pcs Pearl Hair Clips,(16Pcs/9Colors)\nSuptikes\n{'Material': 'Pearl, Silk', 'Item Form': 'Scrunchie', 'Brand': 'Suptikes', 'Item Dimensions LxWxH': '5 x 5 x 0.7 inches', 'Hair Type': 'Curly', 'Product Dimensions': '5 x 5 x 0.7 inches; 7.2 Ounces', 'UPC': '760635003608'}\nThese scrunchies look great in person, especially the plain scrunchies, theyre a beautiful silk like material that has some shine to it. The plain ones also have a heavy duty elastic in them. I have super thick long hair and these do a great job of keeping my hair in a bun.<br /><br />Ive definitely overpaid for scrunchies at urban outfitters when these are just as nice if not nicer for sooo much cheaper. They're great!:)<br /><br />The little barettes are just okay, I find they pull my hair but the scrunchies are totally worth it.\nSuper cute plus great deal!!\nBioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly, Top Japanese Makeup Remover, Gentle Skin Cleanser, Mild Floral Fragrance, Non-Greasy, 7.8 Ounce\nBioré\n['Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly is a non-greasy makeup remover that removes dirt and impurities from deep below the surface of your skin. This top Japanese makeup remover glides on gently and leaves no sticky residue. Formulated with conditioning beauty essence, this jelly leaves skin feeling moisturized and free of makeup. Satisfaction Guaranteed. Limitations may apply.']\n{'Product Dimensions': '1.56 x 2.5 x 7.25 inches; 10.08 Ounces', 'Item model number': '28077_obs', 'UPC': '019100264557', 'Manufacturer': 'Kao USA Inc.'}\nWas interested in what this was going to feel like but I guess \"jelly\" really is the closest consistency to describe this.<br /><br />It more viscous than water and has a bit of \"bounce\" to it but doesn't feel oily or greasy. I apply it straight on my face, rub it in a bit, then add a bit of water to my hands, lather, then rub again. Then rinse k<br /><br />I have combo skin with drier cheeks and this doesn't leave my skin feeling stripped or dry. Still feels moisturized.<br /><br />This product smells of roses pretty strongly but I actually love the way it smells so I don't mind at all.<br /><br />Wouldn't really recommend for eye makeup though, I did find it to sting a bit so I'm just gonna stick to micellar for my eye makeup.<br /><br />Hope this review helps!:)\nMelts away makeup, smells great\nQueendom Unlashed Mascara | Volumizing and Lengthening | Boosts Lash Length | Vegan, Cruelty Free, Paraben Free\nQueendom\n{'Package Dimensions': '5.28 x 0.94 x 0.63 inches; 0.85 Ounces'}\nI have pretty long and decently full eyelashes so this mascara worked well for me as a daily mascara.<br /><br />Cute packaging, nice slim shape with cute design.<br /><br />I didn't find it to be too volumizing, but it does a good job at defining and lengthening.<br /><br />Formula was not very wet from first opening so this may dry out faster than others if not used up.<br /><br />My main issue with this mascara is the hard plastic applicator. It has longer and shorter hard bristles along the sides. I'm by no means a beginner with mascara, but for some reason I've poked my eye with this mascara applicator a couple of times already. The bristles just seem really hard and sharp!<br /><br />This could just be me having a problem for whatever reason, but thought I'd mention.<br /><br />Hope this review is helpful!\nDecent mascara but VERY hard pokey applicator!\nCuckoo Eyelashes 100% handmade 3D Faux Mink Lashes 4 Pairs/set … (Cuckoo 309)\nCuckoo\n{'Brand': 'Cuckoo', 'Material': 'Silk, Faux Mink', 'Item Dimensions LxWxH': '5.91 x 4.33 x 0.39 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.91 x 4.33 x 0.39 inches; 1.87 Ounces', 'Item model number': 'Cuckoo 309', 'UPC': '733430907945'}\n(307) These lases are a little more dense so they definitely give the look of wearing false lashes, in kind of a more dated kind of way. I feel like the more spread out and whispy lashes are a lot more trendy these days. Band is quite thick also. Besides the band, the lashes themselves are pretty good quality and don't have a plastic sheen to them which is great. Price and quality is comparable to drugstore.<br /><br />(309) Also have a thicker band but are much more Whispy and have that fluffy instagram lash to them. Very pretty! I like these a lot better than the 307's. I'd give these a 5 and a 307 a 3 so since they're the same brand, I will average the review to a 4.<br /><br />Hope this review is helpful!\nDense, thicker band\nColor Me Cosmetics Gel Manicure Kit with LED Lamp - DIY Gel Nail Starter Set with Prep, Base and Top Coat, 2 Gel Polish Colors & Nail Tools - Beginner Nail Kit with Everything You Need Made in USA*\nColor Me Cosmetics\n{'Material': 'Acrylic', 'Brand': 'Color Me Cosmetics', 'Included Components': 'Top Coat, Nail File', 'Finish Type': 'Glossy', 'Item Form': 'Gel', 'Package Dimensions': '8.6 x 7.6 x 2.7 inches; 1.4 Pounds'}\nThe polishes in this set work wonderfully and the packaging is very nice and would make an excellent gift! Unfortunately I bumped the lamp off my table and it fell about 3 feet and stopped working...I didn't think it was much of a fall so I was pretty surprised it didn't turn on anymore.<br /><br />The lamp was compact and easy to use, fit one hand at a time. Fortunately I have another lamp but pretty bummed this one broke so easily.:/\nGreat little set but unfortunately the light broke very easily:(\ninvisibobble Sprunchie Spiral Hair Ring - True Black - Scrunchie Stylish Bracelet, Strong Elastic Grip Coil Accessories for Women - Gentle for Girls Teens and Thick Hair\ninvisibobble\n{'Item Form': 'Scrunchie', 'Brand': 'invisibobble', 'Hair Type': 'Straight', 'Item Weight': '2 Grams', 'Number of Pieces': '1', 'Package Dimensions': '2.83 x 2.8 x 0.87 inches; 0.07 Ounces', 'Item model number': 'IB-SP-HP10001'}\nI've tried the regular ones and love those. These don't stretch quite as well and feel a bit tighter when I wrap it around. I think they're alright but I prefer the normal ones much more.\nPrefer the regular ones\nSkinmed Glow Cell BB Cream to Control Sebum with Natural Ingredients 50 ml - 1.7 Ounce\nPh. Drop\n{'Brand': 'Ph. Drop', 'Item Form': 'Cream', 'Unit Count': '1.7 Ounce', 'Number of Items': '1', 'Skin Type': 'Acne prone,oily,sensitive,all skin types', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.81 x 1.26 x 6.3 inches; 1.7 Ounces', 'UPC': '880128810633'}\nI have a medium tan skin tone and this did not work for me at all. It's waaaay too light. Definitely meant for fair to light medium skin tones. This stuff is pretty pigmented so I wouldn't try it if you think it might be too light. It probably will be. Goes on pretty opaque and pigmented, it's almost a light/medium weight foundation. It does go in silky smooth and has a nice finish. I also like the pump and packaging. A bit of a scent to it, but it's not too bad. Wish they made this in more shades!\nMeant for lighter skin tones!",
  "profile": "**User Summary:**\n\n- **Hair Preferences:** Prefers natural-looking, high-quality hair extensions made from human hair.\n- **Installation Method:** Favors clip-in extensions for ease of use.\n- **Fit:** Requires products accommodating larger head sizes and providing adequate volume.\n- **Quality Sensitivity:** Values softness and realism but requires sufficient density for a satisfactory appearance. Recently noted disappointment with a beauty tool that broke easily, indicating sensitivity to product durability.\n- **Rating Approach:** Maintains a balanced perspective towards products, appreciating positives while offering constructive criticism and distinguishing between different product styles within the same brand.\n- **Overall Satisfaction:** Experiences mixed feelings; satisfied with products meeting expectations but dissatisfied with poor fit or performance.\n- **Makeup Preferences:** Enjoys versatile cosmetics, particularly multi-use products. Recently indicated challenges with a BB cream that did not match medium tan skin tones, expressing a need for more inclusive shade ranges.\n- **Satisfaction with Beauty Tools:** Enthusiastic about discovering dependable beauty products at reasonable prices, emphasizing durability and comfort. Prefers user-friendly designs to avoid discomfort from applicators.\n- **Cleansing Product Preferences:** Critical approach to cleansing products; prefers effective formulations that simplify skincare routines, wary of irritation and residue.\n- **Accessory Preferences:** Enjoys stylish and functional hair accessories, particularly high-quality scrunchies that cater to thick hair without discomfort. Recently expressed a preference for traditional scrunchies over newer styles due to fit issues.\n- **Lash Preferences:** Explored false eyelashes, favoring lighter, wispy styles while critiquing thicker bands, reflecting an adaptation to current trends.\n\nThe user prioritizes realistic appearances in hair extensions, multifunctional makeup products, comfort and durability in beauty tools, effective cleansing solutions, stylish yet practical hair accessories, and increasingly fashionable lash options.",
  "metrics": {
    "rouge1_f": 0.12465627864344637,
    "rouge2_f": 0.015596330275229357,
    "rougeL_f": 0.05774518790100826,
    "meteor": 0.046088656329398105,
    "bleu1": 0.0013470880655120693,
    "bleu2": 0.0003482940853319036,
    "bleu3": 0.00012987863664547938,
    "bleu4": 3.752973922176644e-05,
    "bertscore_precision": 0.4108150601387024,
    "bertscore_recall": 0.5150107145309448,
    "bertscore_f1": 0.4570496082305908
  }
}