{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hair Scrunchies for women,Including 3 Pcs Long Silk Satin Hair Scarf & 3 Pcs Bunny Ear Scrunchies & 3 Pcs Elastic Hair Bands Scrunchy and 7Pcs Pearl Hair Clips,(16Pcs/9Colors)\nReview Date: 2020/04/10\nStore: Suptikes\nAverage Rating: 4.4\nProduct Details: {'Material': 'Pearl, Silk', 'Item Form': 'Scrunchie', 'Brand': 'Suptikes', 'Item Dimensions LxWxH': '5 x 5 x 0.7 inches', 'Hair Type': 'Curly', 'Product Dimensions': '5 x 5 x 0.7 inches; 7.2 Ounces', 'UPC': '760635003608'}\nReview Text: These scrunchies look great in person, especially the plain scrunchies, theyre a beautiful silk like material that has some shine to it. The plain ones also have a heavy duty elastic in them. I have super thick long hair and these do a great job of keeping my hair in a bun.<br /><br />Ive definitely overpaid for scrunchies at urban outfitters when these are just as nice if not nicer for sooo much cheaper. They're great!:)<br /><br />The little barettes are just okay, I find they pull my hair but the scrunchies are totally worth it.\nReview Title: Super cute plus great deal!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Remy Human Hair Pieces Front Clip in Hair #1B Natural Black Fringe Hair Extensions with Hair Temples\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9 x 1 x 1 inches; 0.48 Ounces', 'UPC': '615517482166'}\nI think this might work for people with smaller heads or smaller faces but I felt it wasn’t wider enough or thick enough to look good on me. The hair was very soft and real looking though!\nNot very much hair\nJPNK 10PCS Makeup tool set, Blender Sponges& Air cushion puff&Sponge Holder for Blending Liquid, Cream or Flawless Powder Cosmetics\nJPNK\n{'Brand': 'JPNK', 'Skin Type': 'All', 'Recommended Uses For Product': 'Foundation,Concealer,Blender', 'Package Dimensions': '8.5 x 5.4 x 2.3 inches; 5.61 Ounces'}\nYou never know what you're gonna get with some of these beauty sponges, but this is definitely one of the good sets.<br /><br />The sponges are actually soft and don't absorb as much product as other sponges. I recently tried another brand that looked exactly the same but they were so hard and rubbery. These are soooo much softer in comparison. I don't feel like I'm softly punching my face like I do with the others😂<br /><br />Very easy to clean, after use and have no weird smell or anything. I haven't used the puffs or brush yet but I'm going to attempt to use the puffs for powder or maybe even jelly products. The brush would probably work well for concealer or eyeshadow primer. It has soft bristles and a solid handle.<br /><br />Overall I think this is an awesome quality set for a great price!!\nHigher quality beauty sponges than other brands!\nSAMYANG ABOUTME Red Recipe Super Cleansing Balm 3.04 oz. (90ml) - Soft Melting Milk Texture Makeup Cleansing Balm, Mineral Contained Nourishing & Soothing Cleansing, Rose Scented\nSamyang\n{'Package Dimensions': '3.66 x 3.39 x 2.36 inches; 5.57 Ounces'}\nI tried this a few times and couldn't help but feeling like it left residue on my face. I end up using my normal face wash afterwards to feel properly cleansed.<br /><br />To be fair I don't wear much face makeup so perhaps this might work better for someone that wears foundation. I did try to remove my eye makeup with this balm and it was too greasy/thick and also stung my eyes, whereas my micellar water won't do that.<br /><br />The scent is a nice clean rose scent and I like the packaging, but I don't think I'll continue to use this. Seems like more work than is necessary and kinda makes me feel like it will clog my pores in the long run...\nFeels like it creates an extra step...\n[moonshot] Cream Paint Lightfit Air 3g - Blackpink Lisa Makeup Kpop Kbeauty Cosmetics, Airy Velvet Texture Matte Lip Makeup, Long Lasting Natrual Daily Lip Color (501 Almond Rose)\nMoonshot\n{'Brand': 'Moonshot', 'Skin Type': 'All', 'Item Form': 'Cream', 'Finish Type': 'Cream', 'Product Benefits': 'Long Lasting,Brightening,Makeup'}\nA pretty MLBB velvety lip color.  The formula isn't nearly as drying as typical matte liquid lips. More of a velvety mousse like texture.<br /><br />I have medium tan skin and I'd say this is a nude pink shade on me so it may be a bit light for deeper skin tones.<br /><br />I discovered you can also use this as a cheek color as well! I dab a bit on the back of my hand and apply it from there. It's pretty pigmented on the cheeks so starting with less is better.\nCan also be used as cream blush!:)\nHair Scrunchies for women,Including 3 Pcs Long Silk Satin Hair Scarf & 3 Pcs Bunny Ear Scrunchies & 3 Pcs Elastic Hair Bands Scrunchy and 7Pcs Pearl Hair Clips,(16Pcs/9Colors)\nSuptikes\n{'Material': 'Pearl, Silk', 'Item Form': 'Scrunchie', 'Brand': 'Suptikes', 'Item Dimensions LxWxH': '5 x 5 x 0.7 inches', 'Hair Type': 'Curly', 'Product Dimensions': '5 x 5 x 0.7 inches; 7.2 Ounces', 'UPC': '760635003608'}\nThese scrunchies look great in person, especially the plain scrunchies, theyre a beautiful silk like material that has some shine to it. The plain ones also have a heavy duty elastic in them. I have super thick long hair and these do a great job of keeping my hair in a bun.<br /><br />Ive definitely overpaid for scrunchies at urban outfitters when these are just as nice if not nicer for sooo much cheaper. They're great!:)<br /><br />The little barettes are just okay, I find they pull my hair but the scrunchies are totally worth it.\nSuper cute plus great deal!!",
  "profile": "**User Summary:**\n\n- **Hair Preferences:** Prefers natural-looking, high-quality hair extensions made from human hair.\n- **Installation Method:** Favors clip-in extensions for ease of use.\n- **Fit:** Has specific needs regarding size and thickness; prefers products that accommodate larger head sizes and provide adequate volume.\n- **Quality Sensitivity:** Values softness and realism in hair products but requires sufficient density for a satisfactory appearance.\n- **Rating Approach:** Exhibits a balanced view towards products, appreciating positives while providing critical feedback about shortcomings.\n- **Overall Satisfaction:** Experiences mixed feelings; has encountered products that meet some expectations but expresses dissatisfaction when products don’t fit well.\n- **Makeup Preferences:** Recently demonstrated a keen interest in versatile cosmetics, particularly enjoying products that offer multiple uses, such as for both lips and cheeks. Values soft, effective application tools and emphasizes the importance of comfort, usability, and ease of cleaning.\n- **Satisfaction with Beauty Tools:** Displays enthusiasm for discovering high-quality beauty products, recently finding value in reliable performance and reasonable pricing.\n- **Cleansing Product Preferences:** Shows a critical approach towards cleansing products, expressing dissatisfaction when a product feels inefficient or leaves residue. Prefers formulations that effectively remove makeup without irritation, indicating a desire for simplicity and efficacy in skincare routines.\n- **Accessory Preferences:** Recently enjoyed purchasing hair accessories, particularly appreciating those that combine functionality with style, such as high-quality scrunchies that work well for thick hair without causing discomfort.\n\nThe user continues to prioritize realistic appearances in hair extensions, multifunctional makeup products, comfort in beauty tools, effective cleansing solutions, and stylish yet practical hair accessories.",
  "metrics": {
    "rouge1_f": 0.20912547528517111,
    "rouge2_f": 0.02095238095238095,
    "rougeL_f": 0.09695817490494296,
    "meteor": 0.08556346548850272,
    "bleu1": 0.04970066867672958,
    "bleu2": 0.010076262661931576,
    "bleu3": 0.0034650637766572745,
    "bleu4": 0.0011434970289091397,
    "bertscore_precision": 0.4102383255958557,
    "bertscore_recall": 0.49612584710121155,
    "bertscore_f1": 0.4491126835346222
  }
}