{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Beard Oil - Tea Tree Scent - Huge Man-Sized 4 oz Bottle - 100% Natural - Softens Your Beard and Stops Itching - Scent Women Love - Best Beard Oil And Conditioner For Men\nReview Date: 2016/05/27\nStore: BEARDSMEN SPIRIT\nAverage Rating: 3.7\nProduct Details: {'Scent': 'Tea Tree', 'Liquid Volume': '4 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'BEARDSMEN SPIRIT', 'Number of Items': '2', 'Package Dimensions': '4.7 x 2 x 2 inches; 8 Ounces', 'UPC': '646437251228'}\nReview Text: Ladies: beard oil is your friend!  If you have hard to manage, dry, brittle hair, this can works WONDERS.  I have very fine, wavy, frizzy hair AND I live in Florida, so the odds are always against my hair.  After realizing that the ingredients in beard oils are the same as the ingredients in many hair products (like tea tree oil, jojoba oil, grape seed oil, etc), and hearing from other women about the benefits of using it in your hair, I wanted to give this a try.  The tea tree oil and peppermint oil are absolutely wonderful for dry, itchy scalps, and just a little bit of this stuff goes a long way.  I put a dime-sized amount of the beard oil in my palms and distributed it evenly throughout my hair, from roots to tips, and massaged it into my scalp as well.  This oil is thicker than most oil treatments that are advertised for hair, so again, a little dab goes far!  I like that, though, because it really feels like it's coating and absorbing into my thirsty hair.  As my hair dried, the waves were well-defined and NOT FRIZZY, hallelujah!<br /><br />Another secret for guys and gals:  this type of beard oil containing tea tree oil can also be used in more uh, private areas.  Why not keep hair in your nether regions just as soft as conditioned as hair in the upper regions?  The tea tree oil is very soothing on razor burn as well.  Basically, this beard oil is very versatile in its uses, and I'm loving it.  Thumbs up, would recommend!<br /><br />I received this product at a discount in exchange for my honest, unbiased opinion. I will not rate items highly if they don't deserve the rating, and I write these lengthy reviews to help out fellow shoppers, since I always read reviews on products before buying. If this review has been helpful to you, please feel free to let me know by giving me a helpful vote; this helps me know which products I'm really doing a good job helping folks with :)\nReview Title: Ladies: This can tame your hair!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Beard Oil - Tea Tree Scent - Huge Man-Sized 4 oz Bottle - 100% Natural - Softens Your Beard and Stops Itching - Scent Women Love - Best Beard Oil And Conditioner For Men\nBEARDSMEN SPIRIT\n{'Scent': 'Tea Tree', 'Liquid Volume': '4 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'BEARDSMEN SPIRIT', 'Number of Items': '2', 'Package Dimensions': '4.7 x 2 x 2 inches; 8 Ounces', 'UPC': '646437251228'}\nLadies: beard oil is your friend!  If you have hard to manage, dry, brittle hair, this can works WONDERS.  I have very fine, wavy, frizzy hair AND I live in Florida, so the odds are always against my hair.  After realizing that the ingredients in beard oils are the same as the ingredients in many hair products (like tea tree oil, jojoba oil, grape seed oil, etc), and hearing from other women about the benefits of using it in your hair, I wanted to give this a try.  The tea tree oil and peppermint oil are absolutely wonderful for dry, itchy scalps, and just a little bit of this stuff goes a long way.  I put a dime-sized amount of the beard oil in my palms and distributed it evenly throughout my hair, from roots to tips, and massaged it into my scalp as well.  This oil is thicker than most oil treatments that are advertised for hair, so again, a little dab goes far!  I like that, though, because it really feels like it's coating and absorbing into my thirsty hair.  As my hair dried, the waves were well-defined and NOT FRIZZY, hallelujah!<br /><br />Another secret for guys and gals:  this type of beard oil containing tea tree oil can also be used in more uh, private areas.  Why not keep hair in your nether regions just as soft as conditioned as hair in the upper regions?  The tea tree oil is very soothing on razor burn as well.  Basically, this beard oil is very versatile in its uses, and I'm loving it.  Thumbs up, would recommend!<br /><br />I received this product at a discount in exchange for my honest, unbiased opinion. I will not rate items highly if they don't deserve the rating, and I write these lengthy reviews to help out fellow shoppers, since I always read reviews on products before buying. If this review has been helpful to you, please feel free to let me know by giving me a helpful vote; this helps me know which products I'm really doing a good job helping folks with :)\nLadies: This can tame your hair!",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Enthusiast:** The user demonstrates a strong interest in effective hair care products, particularly those that hydrate and manage difficult hair types, including fine, wavy, and frizzy hair.\n\n- **Preference for Natural Ingredients:** Indicates a preference for products that contain natural components, such as tea tree oil, jojoba oil, and grape seed oil, which are known for their benefits in hair and scalp health.\n\n- **Versatility:** Appreciates multifunctional products that can serve various purposes beyond their primary use, such as using beard oils for hair and skin care in intimate areas.\n\n- **Detail-Oriented Reviewer:** Values transparency and shares comprehensive reviews to assist others in making informed purchasing decisions, reinforcing a community-focused shopping approach.\n\n- **Positive Engagement:** Actively engages with the review process, showcasing a willingness to provide helpful feedback while expecting high quality in products they endorse.\n\nOverall, the user appears to prioritize quality, versatility, and the use of beneficial natural ingredients in their personal care routine, while also actively contributing to the community by sharing detailed product experiences.",
  "metrics": {
    "rouge1_f": 0.28093645484949836,
    "rouge2_f": 0.04697986577181208,
    "rougeL_f": 0.13712374581939799,
    "meteor": 0.13227563759529454,
    "bleu1": 0.1231462409728274,
    "bleu2": 0.05722165816892372,
    "bleu3": 0.03246580241420066,
    "bleu4": 0.022121987872321006,
    "bertscore_precision": 0.3998408317565918,
    "bertscore_recall": 0.46593302488327026,
    "bertscore_f1": 0.4303642213344574
  }
}