{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Anti Aging Neck and Face Firming and Tightening Cream - 2 oz. With Hyaluronic Acid, Coenzyme (CoQ10), Licorice, Vitamin C, Glycolic. For sagging skin and wrinkles\nReview Date: 2016/05/29\nAverage Rating: 3.1\nProduct Details: {'Item Form': 'Cream', 'Unit Count': '2.0 Fl Oz', 'Number of Items': '1', 'Item Volume': '2 Fluid Ounces', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 3 x 2.5 inches; 2.4 Ounces', 'UPC': '703510551986'}\nReview Text: I'm 30 years old and have been trying to do a lot of preventative skin care (especially since I live in Florida and get quite a bit of sun on my skin on a regular basis).  One reason I was drawn to this particular neck firming cream was the royal jelly ingredient.  I'm new to learning about the benefits of royal jelly, so for those who haven't hear of it before, royal jelly is a substance secreted by honeybee workers and fed by them to larvae that are being raised as possible queen bees.  When used externally, royal jelly increases the skin's moisture and collagen production, which slows the process of getting wrinkles.  There are tons of other beneficial oils in this cream, all of which can be found on the ingredients list on the product page.<br /><br />This neck firming cream is very thick, but absorbs quickly into the skin, and does not leave an oily residue.  After washing my face and neck area, I put a dime-sized amount of the cream in my palms and then applied it to my neck, distributing it evenly with circular motions.  This cream has a very light and pleasant, almost gingery scent.  The reason I am rating this 4 stars instead of 5 si the fact that I did get a few blemishes on my neck after using the cream.  I am not sure if this was a result of an ingredient, or my skin just getting used to a new product.  I have been suing this for 5 days now.  My neck did feel very nourished and moisturized after using this, so I will continue to apply this cream unless more blemishes appear.<br /><br />I received this product at a discount in exchange for my honest, unbiased opinion. I will not rate items highly if they don't deserve the rating, and I write these lengthy reviews to help out fellow shoppers, since I always read reviews on products before buying. If this review has been helpful to you, please feel free to let me know by giving me a helpful vote; this helps me know which products I'm really doing a good job helping folks with :)\nReview Title: Very nourishing, contains royal jelly\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Beard Oil - Tea Tree Scent - Huge Man-Sized 4 oz Bottle - 100% Natural - Softens Your Beard and Stops Itching - Scent Women Love - Best Beard Oil And Conditioner For Men\nBEARDSMEN SPIRIT\n{'Scent': 'Tea Tree', 'Liquid Volume': '4 Fluid Ounces', 'Item Form': 'Oil', 'Brand': 'BEARDSMEN SPIRIT', 'Number of Items': '2', 'Package Dimensions': '4.7 x 2 x 2 inches; 8 Ounces', 'UPC': '646437251228'}\nLadies: beard oil is your friend!  If you have hard to manage, dry, brittle hair, this can works WONDERS.  I have very fine, wavy, frizzy hair AND I live in Florida, so the odds are always against my hair.  After realizing that the ingredients in beard oils are the same as the ingredients in many hair products (like tea tree oil, jojoba oil, grape seed oil, etc), and hearing from other women about the benefits of using it in your hair, I wanted to give this a try.  The tea tree oil and peppermint oil are absolutely wonderful for dry, itchy scalps, and just a little bit of this stuff goes a long way.  I put a dime-sized amount of the beard oil in my palms and distributed it evenly throughout my hair, from roots to tips, and massaged it into my scalp as well.  This oil is thicker than most oil treatments that are advertised for hair, so again, a little dab goes far!  I like that, though, because it really feels like it's coating and absorbing into my thirsty hair.  As my hair dried, the waves were well-defined and NOT FRIZZY, hallelujah!<br /><br />Another secret for guys and gals:  this type of beard oil containing tea tree oil can also be used in more uh, private areas.  Why not keep hair in your nether regions just as soft as conditioned as hair in the upper regions?  The tea tree oil is very soothing on razor burn as well.  Basically, this beard oil is very versatile in its uses, and I'm loving it.  Thumbs up, would recommend!<br /><br />I received this product at a discount in exchange for my honest, unbiased opinion. I will not rate items highly if they don't deserve the rating, and I write these lengthy reviews to help out fellow shoppers, since I always read reviews on products before buying. If this review has been helpful to you, please feel free to let me know by giving me a helpful vote; this helps me know which products I'm really doing a good job helping folks with :)\nLadies: This can tame your hair!\nAnti Aging Neck and Face Firming and Tightening Cream - 2 oz. With Hyaluronic Acid, Coenzyme (CoQ10), Licorice, Vitamin C, Glycolic. For sagging skin and wrinkles\n{'Item Form': 'Cream', 'Unit Count': '2.0 Fl Oz', 'Number of Items': '1', 'Item Volume': '2 Fluid Ounces', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 3 x 2.5 inches; 2.4 Ounces', 'UPC': '703510551986'}\nI'm 30 years old and have been trying to do a lot of preventative skin care (especially since I live in Florida and get quite a bit of sun on my skin on a regular basis).  One reason I was drawn to this particular neck firming cream was the royal jelly ingredient.  I'm new to learning about the benefits of royal jelly, so for those who haven't hear of it before, royal jelly is a substance secreted by honeybee workers and fed by them to larvae that are being raised as possible queen bees.  When used externally, royal jelly increases the skin's moisture and collagen production, which slows the process of getting wrinkles.  There are tons of other beneficial oils in this cream, all of which can be found on the ingredients list on the product page.<br /><br />This neck firming cream is very thick, but absorbs quickly into the skin, and does not leave an oily residue.  After washing my face and neck area, I put a dime-sized amount of the cream in my palms and then applied it to my neck, distributing it evenly with circular motions.  This cream has a very light and pleasant, almost gingery scent.  The reason I am rating this 4 stars instead of 5 si the fact that I did get a few blemishes on my neck after using the cream.  I am not sure if this was a result of an ingredient, or my skin just getting used to a new product.  I have been suing this for 5 days now.  My neck did feel very nourished and moisturized after using this, so I will continue to apply this cream unless more blemishes appear.<br /><br />I received this product at a discount in exchange for my honest, unbiased opinion. I will not rate items highly if they don't deserve the rating, and I write these lengthy reviews to help out fellow shoppers, since I always read reviews on products before buying. If this review has been helpful to you, please feel free to let me know by giving me a helpful vote; this helps me know which products I'm really doing a good job helping folks with :)\nVery nourishing, contains royal jelly",
  "profile": "**User Profile Summary:**\n\n- **Hair and Skin Care Enthusiast:** The user displays a keen interest in effective hair care products, especially those aimed at hydrating and managing challenging hair types such as fine, wavy, and frizzy hair, while also expanding their focus to include skin care, specifically targeting anti-aging solutions.\n\n- **Preference for Natural Ingredients:** Consistently values products with natural components, including tea tree oil, jojoba oil, and grape seed oil for hair, as well as royal jelly and other beneficial oils for skin health.\n\n- **Versatility and Multifunctionality:** Appreciates products that serve multiple purposes, as demonstrated by their interest in items suitable for both hair and skin, indicating a holistic approach to personal care.\n\n- **Detail-Oriented Reviewer:** Shares comprehensive and insightful reviews to assist others in making informed choices, displaying a community-focused ethos and commitment to transparency.\n\n- **Critical yet Constructive Feedback:** Engages actively in the review process, offering honest assessments of products. The user holds high expectations for quality, as seen in their balanced reviews that highlight both positives and potential drawbacks.\n\nOverall, the user emphasizes the importance of quality and natural ingredients in both hair and skin care routines, while maintaining an active role in the community through thoughtful product reviews and feedback.",
  "metrics": {
    "rouge1_f": 0.19702602230483274,
    "rouge2_f": 0.03910614525139665,
    "rougeL_f": 0.10408921933085502,
    "meteor": 0.08457537041138154,
    "bleu1": 0.02234254159050548,
    "bleu2": 0.010389148251354775,
    "bleu3": 0.005717926698468155,
    "bleu4": 0.0035705382849691475,
    "bertscore_precision": 0.38799983263015747,
    "bertscore_recall": 0.49443572759628296,
    "bertscore_f1": 0.43479883670806885
  }
}