{
  "interaction_number": 18,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Training Head Hairdressing Head Rainbow Synthetic Fiber Hair 24inch Mannequin Cosmetology Manikin Dolls Head for Hairdresser Styling Practicing with Free Clamp + DIY Hair Styling Braid Set\nReview Date: 2021/05/28\nStore: SENSAIRUITE\nAverage Rating: 4.0\nProduct Details: {'Brand': 'SENSAIRUITE', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '11.26 x 6.93 x 6.5 inches; 1.83 Pounds'}\nReview Text: Who wouldn't want to play in magical rainbow hair? This would be a great fun learning tool for young people to practice hair. The hair was great quality. There wasn't much shedding. It came with two hair clips and a bag of colorful plastic bands. This was a fun product to use.\nReview Title: Great\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nJPNK\n{'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nThese combs are very pretty, but they are not practical for hair combing. These combs were very sharp and ruff against my hair. It didn't feel good at all and I won't be using them again.\nNot Great\nUgrace Hair 13x4 Body Wave Human Hair Wigs 150% Density Brazilian Body Wave Lace Front Wigs Pre Plucked Natural Hairline Glueless With Baby Hair Body Wigs For Women (22 inch)\nUgrace Hair\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Ugrace Hair', 'Package Dimensions': '12.4 x 10.35 x 4.06 inches; 10.58 Ounces', 'UPC': '765756990660'}\nIt has a nice size lace area, so you can change the part in the hair. With a little mousse, you can make cute cornrow braids as well. It looks very natural and realistic.\nNice\nLihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nThis hair has a nice texture. They are easy to install. The twists are nice and tight. It came with a crochet tool.\nNice\nOmbre Color 1B Burgundy Spring Twist Crochet Braiding Hair Crochet Braid Crochet Hair Afro Kinky Curl Color Crochet Synthetic Hair 4 Pack(8inch #1bbug)\nJulyQueen\n{'Brand': 'JulyQueen', 'Material': 'Synthetic', 'Extension Length': '8 Inches', 'Hair Type': 'Kinky', 'Installation Type': 'Clip-In', 'Package Dimensions': '11.1 x 8.1 x 3.1 inches; 1.2 Pounds', 'UPC': '681413989238'}\nThis hair is nice, silky, and bouncy twists. These are very good quality. The hair is soft and light. Very pretty.\nGreat\nCurly lace front human hair wigs lace front 21\", 4x4 curly human hair wigs for black women curly wigs human hair lace front kinky curly wig 21\"\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Extension Length': '21 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.9 x 4 inches; 1.25 Pounds'}\nThis hair is wonderful. The texture is very nice. It is soft and easy to manage. It braids beautifully and easily into hair. It looks very realistic. Great quality.\nExcellent\n6 Packs Bomb Twist Crochet Braiding Hair Extensions 18 Inches Spring Bomb Twist Crochet Hair Pre-looped Crochet Braids Long Pre-twisted Passion Twist Synthetic Hair Braids for Women (1B#)\nLOSMOEER\n{'Brand': 'LOSMOEER', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In'}\nNice texture. Easy to install. Beautiful hair overall.\nPretty\nClip in Human Hair Extensions Dark Brown Solid Color 20inch Silky Straight Remy Clip in Extensions Brown Human Hair Full Head 100G 7Pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Thick, Straight', 'Installation Type': 'Clip-In', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '750153936397'}\nThe hair is soft and silky. It blends in well to your natural hair. Easy to install and style.\nNice\nallez outdoor | Biodegradable Cleansing Cloths | Natural Plant-Based Face and Body Wipes | PH Balanced | Cactus Bloom and Chaparral Scent | 20ct Individually Wrapped Towelettes\nAllez\n{'Brand': 'Allez', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Material Feature': 'Biodegradable Warning', 'Unit Count': '20.00 Count', 'Number of Items': '1', 'Package Dimensions': '6.2 x 5.4 x 4.2 inches; 13.62 Ounces', 'Item model number': 'ABWPS001', 'UPC': '860000823210', 'Manufacturer': 'Allez Outdoor, LLC'}\nThese wipes are really large. The fabric is strong and soft. It has a nice clean scent and cleans well when you are in a pinch. They are individually wrapped for easy portability and convenience.\nGreat\nThe Henna Guys Hair Finishing Stick, Frizz Control Hair products, Broken Baby Hair Gel - Hair Wax Stick for Flyaway Hair - Faster & Quickest Solution for Neat Hair Styles (1 Pack)\nThe Henna Guys\n{'Package Information': 'Box', 'Brand': 'The Henna Guys', 'Item Form': 'Gel', 'Hair Type': 'Damaged', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 1.14 x 1.02 inches; 1.34 Ounces'}\nThe texture of this product is basically watered down hair gel. It probably works better for people with straight hair and not course curly hair types. My hair didn't feel hard or crunchy when it dried.\nOK\nHair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nMilantia\n{'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nThis tiny iron gets hot! I was surprised. It is really convenient and compact. It straightened my hair quickly and easily. I love how small it is. I can take it anywhere. It's cute and it works well.\nHot\n[the SAEM] Derma Plan Cleansing Bubble Pad 15pcs - One Step Gentle Makeup Cleansing Wipes Produce Fine & Dense Bubbles, Hypoallergenic Formula, Pore Clean, Mild Exfoliation\nTHESAEM\n{'Brand': 'THESAEM', 'Skin Type': 'Sensitive', 'Unit Count': '15.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.9 x 3.9 x 1.8 inches; 3.21 Ounces'}\nThese are ok for a quick wash when you are in a hurry traveling or something, but it seems too small and inadequate for regular use. It broke apart while I was using it. I felt like I was better off just using a regular wash cloth and soap.\nUnecessary\nCOSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nCOSYMAY\n{'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nThe wig I received is exactly as pictured. It only needed a bit of flat ironing and mousse to flatten and smooth out the hair. The density of the hair makes the wig look realistic. It doesn't look like one of those super thick, fake looking cosplay wigs.\nBetter than expected\nGel UV Nail Lamp, AsperX 150W LED Nail Dryer Gel Nail Polish Light Curing Lamp Kit Smart Auto-sensing with 10/30/60/99s Timer\nAsperX\n{'Brand': 'AsperX', 'Material': 'Gel', 'Item Dimensions LxWxH': '8.9 x 8.03 x 4.33 inches', 'Product Dimensions': '8.9\"D x 8.03\"W x 4.33\"H'}\nIt dried my nails much faster than my previous lamp. Since the wattage is much higher, I did notice my skin get a little tanner, so I covered my hand with a towel.\nDries nails fast\nMagnetic Eyeliner and Eyelashes Kit Self Adhesive Eyeliner Pen - 3D Natural Look Eyelash Without Magnet - Reusable Eye Lash with Waterproof Liner, Black, Applicator(5 Sets Lashes + 1 Pen Liners)\nLampelc\n{'Brand': 'Lampelc', 'Material': 'Mink Fur', 'Material Feature': 'Natural', 'Item Form': 'Individual', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.14 x 5.59 x 0.59 inches; 11.29 Ounces'}\nI liked the varied styles from natural to dramatic. The lashes stuck quite nicely with the mascara. Very easy to apply and remove.\nNice\nBeauhair Lace Front Wigs Human Hair Pre Plucked Brazilian Deep Wave 13x4 Lace Frontal Wig with Baby Hair 9A Natural Hair Wigs for Black Women(16, Deep Wigs)\nBeauhair\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Beauhair', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.61 x 6.18 x 2.52 inches; 8.78 Ounces'}\nWas I given the wrong product? This wig looks awful. The lace is terrible and highly visible because for some reason they sewed two different types of lace together at the front of the wig. This is the worst wig I have ever seen. It is completely unwearable. The hair quality is good and I will be taking this wig apart to save the hair. This wig was constructed wrong and is overpriced. I do not recommend this product.\nWorst Wig Ever\nJohn Frieda Detox and Repair Shampoo and Conditioner Set with Nourishing Avocado Oil and Green Tea, 8.45 Fl Oz (Pack of 2)\nJohn Frieda\n['John Frieda Detox and Repair Shampoo and Conditioner set removes product build up and revitalizes dry and stressed hair. Detox and Repair moisturizes and cleanses damaged hair and leaves hair visibly healthy and repaired. With antioxidant rich green tea and nourishing avocado oil. Your hair is exposed to many daily challenges that could make it look stressed and lifeless. Styling, product build up, and environmental influences can strain hair and can reduce the effect of caring ingredients. With antioxidant rich green tea and nourishing avocado oil, John Frieda Detox and Repair removes product build up and revitalizes hair immediately. The result: Repaired and healthy looking hair with silky shine. Satisfaction Guaranteed. Limitations may apply.']\n{'Product Benefits': 'Detoxifying', 'Brand': 'John Frieda', 'Hair Type': 'All, Dry', 'Number of Items': '2', 'Unit Count': '16.9 Fl Oz', 'Product Dimensions': '3 x 3.8 x 9.06 inches; 8.45 Ounces', 'UPC': '717226276545'}\nI was surprised that this set left my hair nice and soft. It cleansed my hair hair very well and got rid of any residue. The smell is also nice. The shampoo and conditioner was a great combo and left my hair feeling clean and soft.\nGreat\nKeratin Secrets Do It Yourself Home Keratin System\nKeratin Secrets\n{'Package Dimensions': '8.27 x 4.21 x 3.9 inches; 2.87 Pounds'}\nI tried this on thick curly 3c hair. The results were quite decent. You first wash your hair with the pre-treatment shampoo to clarify the hair and remove dirt and oils. At this point, make sure to detangle the hair well and section it into smaller parts so that you can apply the keratin treatment. The hair should be 80% towel dried. You then comb in the keratin treatment to each section of hair. I recommend wearing gloves. Allow it time to process and then blow dry and finish with a flat iron. The hair came out quite silky and smooth, but it began to revert into fluffiness as the day went on. Adding a bit of hair oil helped to restrain the humidity. For an at home kit, it is decent, but it is not as strong as salon treatments.\nOK\nTraining Head Hairdressing Head Rainbow Synthetic Fiber Hair 24inch Mannequin Cosmetology Manikin Dolls Head for Hairdresser Styling Practicing with Free Clamp + DIY Hair Styling Braid Set\nSENSAIRUITE\n{'Brand': 'SENSAIRUITE', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '11.26 x 6.93 x 6.5 inches; 1.83 Pounds'}\nWho wouldn't want to play in magical rainbow hair? This would be a great fun learning tool for young people to practice hair. The hair was great quality. There wasn't much shedding. It came with two hair clips and a bag of colorful plastic bands. This was a fun product to use.\nGreat",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to prioritize practicality and aesthetics in personal care products, with an emphasis on innovative solutions that encourage creative expression.\n\n- **Recent Acquisition and Experience:** The user has recently purchased a training head for hairstyling practice, reflecting a commitment to exploring new techniques and enhancing their grooming skills. Their expectation for quality remains high, especially following previous disappointments.\n\n- **Hair Type Focus:** While still dedicated to caring for wavy textures, the user is increasingly engaged with straight hair, as indicated by their recent training head purchase, which expands their versatility in hair care.\n\n- **Nail Care Interest:** The user's engagement with nail care remains strong, supported by recent acquisitions of grooming tools that prioritize efficiency and skin safety.\n\n- **New Hair Care Addition:** Their interest in achieving sleek and smooth results is evident, as they have integrated a home keratin treatment and emphasize effective cleansing and preparation.\n\n- **Rating Behavior:** The user demonstrates a discerning approach to product reviews, assessing quality, performance, and aesthetic appeal, which informs their evaluations.\n\n- **Overall Trend:** A commitment to stylish, effective, and sustainable solutions across hair, nail, and eye care persists. Their ongoing pursuit of quality products aligns with a preference for versatile grooming experiences and thoughtful assessments of performance, now enhanced by a focus on practical tools for skill development in hairstyling.",
  "metrics": {
    "rouge1_f": 0.09672830725462303,
    "rouge2_f": 0.009492168960607499,
    "rougeL_f": 0.051209103840682786,
    "meteor": 0.0360438530972698,
    "bleu1": 0.00025943499035641397,
    "bleu2": 6.738099272826841e-05,
    "bleu3": 2.1519735614000125e-05,
    "bleu4": 6.844754669735258e-06,
    "bertscore_precision": 0.3650127649307251,
    "bertscore_recall": 0.48579952120780945,
    "bertscore_f1": 0.41683229804039
  }
}