{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Clip in Human Hair Extensions Dark Brown Solid Color 20inch Silky Straight Remy Clip in Extensions Brown Human Hair Full Head 100G 7Pcs\nReview Date: 2020/03/14\nStore: YoungSee\nAverage Rating: 2.8\nProduct Details: {'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Thick, Straight', 'Installation Type': 'Clip-In', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '750153936397'}\nReview Text: The hair is soft and silky. It blends in well to your natural hair. Easy to install and style.\nReview Title: Nice\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nJPNK\n{'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nThese combs are very pretty, but they are not practical for hair combing. These combs were very sharp and ruff against my hair. It didn't feel good at all and I won't be using them again.\nNot Great\nUgrace Hair 13x4 Body Wave Human Hair Wigs 150% Density Brazilian Body Wave Lace Front Wigs Pre Plucked Natural Hairline Glueless With Baby Hair Body Wigs For Women (22 inch)\nUgrace Hair\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Ugrace Hair', 'Package Dimensions': '12.4 x 10.35 x 4.06 inches; 10.58 Ounces', 'UPC': '765756990660'}\nIt has a nice size lace area, so you can change the part in the hair. With a little mousse, you can make cute cornrow braids as well. It looks very natural and realistic.\nNice\nLihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nThis hair has a nice texture. They are easy to install. The twists are nice and tight. It came with a crochet tool.\nNice\nOmbre Color 1B Burgundy Spring Twist Crochet Braiding Hair Crochet Braid Crochet Hair Afro Kinky Curl Color Crochet Synthetic Hair 4 Pack(8inch #1bbug)\nJulyQueen\n{'Brand': 'JulyQueen', 'Material': 'Synthetic', 'Extension Length': '8 Inches', 'Hair Type': 'Kinky', 'Installation Type': 'Clip-In', 'Package Dimensions': '11.1 x 8.1 x 3.1 inches; 1.2 Pounds', 'UPC': '681413989238'}\nThis hair is nice, silky, and bouncy twists. These are very good quality. The hair is soft and light. Very pretty.\nGreat\nCurly lace front human hair wigs lace front 21\", 4x4 curly human hair wigs for black women curly wigs human hair lace front kinky curly wig 21\"\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Extension Length': '21 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.9 x 4 inches; 1.25 Pounds'}\nThis hair is wonderful. The texture is very nice. It is soft and easy to manage. It braids beautifully and easily into hair. It looks very realistic. Great quality.\nExcellent\n6 Packs Bomb Twist Crochet Braiding Hair Extensions 18 Inches Spring Bomb Twist Crochet Hair Pre-looped Crochet Braids Long Pre-twisted Passion Twist Synthetic Hair Braids for Women (1B#)\nLOSMOEER\n{'Brand': 'LOSMOEER', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In'}\nNice texture. Easy to install. Beautiful hair overall.\nPretty\nClip in Human Hair Extensions Dark Brown Solid Color 20inch Silky Straight Remy Clip in Extensions Brown Human Hair Full Head 100G 7Pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Thick, Straight', 'Installation Type': 'Clip-In', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '750153936397'}\nThe hair is soft and silky. It blends in well to your natural hair. Easy to install and style.\nNice",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user emphasizes a blend of practicality and aesthetic appeal in hair care accessories, with a sustained interest in innovative and versatile styling products that promote creative expression.\n\n- **Recent Acquisition and Experience:** The user's latest purchase of clip-in extensions highlights their ongoing quest for high-quality products. They appreciated the softness, ease of installation, and compatibility with their natural hair, further reinforcing their preference for effective and visually appealing solutions.\n\n- **Hair Type Focus:** While the user remains committed to wavy textures, they are increasingly exploring products suitable for thick, straight styles, demonstrating flexibility and an eagerness to diversify their hairstyling repertoire.\n\n- **Rating Behavior:** Consistently rating products based on satisfaction, the user’s latest experience showcases their discerning taste and a continued focus on quality hair care solutions.\n\n- **Overall Trend:** The user seeks a balance between design and functionality, aspiring for hair care products that are both effective and visually attractive. Their recent experiences reflect a dedication to enjoyable grooming tools that enhance hairstyling creativity while maintaining practicality.\n\nIn summary, this user is committed to stylish, effective hair care solutions, expanding their hairstyling possibilities with a focus on quality, versatility, and individual expression.",
  "metrics": {
    "rouge1_f": 0.1769436997319035,
    "rouge2_f": 0.02956989247311828,
    "rougeL_f": 0.08847184986595175,
    "meteor": 0.06554983491198679,
    "bleu1": 0.04067648671524013,
    "bleu2": 0.01176529184745537,
    "bleu3": 0.0019900967888764436,
    "bleu4": 0.0008192911147679446,
    "bertscore_precision": 0.3432379364967346,
    "bertscore_recall": 0.4328354597091675,
    "bertscore_f1": 0.38286468386650085
  }
}