{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 6 Packs Bomb Twist Crochet Braiding Hair Extensions 18 Inches Spring Bomb Twist Crochet Hair Pre-looped Crochet Braids Long Pre-twisted Passion Twist Synthetic Hair Braids for Women (1B#)\nReview Date: 2020/03/14\nStore: LOSMOEER\nAverage Rating: 4.2\nProduct Details: {'Brand': 'LOSMOEER', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In'}\nReview Text: Nice texture. Easy to install. Beautiful hair overall.\nReview Title: Pretty\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nJPNK\n{'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nThese combs are very pretty, but they are not practical for hair combing. These combs were very sharp and ruff against my hair. It didn't feel good at all and I won't be using them again.\nNot Great\nUgrace Hair 13x4 Body Wave Human Hair Wigs 150% Density Brazilian Body Wave Lace Front Wigs Pre Plucked Natural Hairline Glueless With Baby Hair Body Wigs For Women (22 inch)\nUgrace Hair\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Ugrace Hair', 'Package Dimensions': '12.4 x 10.35 x 4.06 inches; 10.58 Ounces', 'UPC': '765756990660'}\nIt has a nice size lace area, so you can change the part in the hair. With a little mousse, you can make cute cornrow braids as well. It looks very natural and realistic.\nNice\nLihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nThis hair has a nice texture. They are easy to install. The twists are nice and tight. It came with a crochet tool.\nNice\nOmbre Color 1B Burgundy Spring Twist Crochet Braiding Hair Crochet Braid Crochet Hair Afro Kinky Curl Color Crochet Synthetic Hair 4 Pack(8inch #1bbug)\nJulyQueen\n{'Brand': 'JulyQueen', 'Material': 'Synthetic', 'Extension Length': '8 Inches', 'Hair Type': 'Kinky', 'Installation Type': 'Clip-In', 'Package Dimensions': '11.1 x 8.1 x 3.1 inches; 1.2 Pounds', 'UPC': '681413989238'}\nThis hair is nice, silky, and bouncy twists. These are very good quality. The hair is soft and light. Very pretty.\nGreat\nCurly lace front human hair wigs lace front 21\", 4x4 curly human hair wigs for black women curly wigs human hair lace front kinky curly wig 21\"\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Extension Length': '21 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.9 x 4 inches; 1.25 Pounds'}\nThis hair is wonderful. The texture is very nice. It is soft and easy to manage. It braids beautifully and easily into hair. It looks very realistic. Great quality.\nExcellent\n6 Packs Bomb Twist Crochet Braiding Hair Extensions 18 Inches Spring Bomb Twist Crochet Hair Pre-looped Crochet Braids Long Pre-twisted Passion Twist Synthetic Hair Braids for Women (1B#)\nLOSMOEER\n{'Brand': 'LOSMOEER', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In'}\nNice texture. Easy to install. Beautiful hair overall.\nPretty",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to prioritize hair care accessories that blend practicality with aesthetic appeal. Their interest in innovative and versatile styling products that foster creativity remains strong, evidenced by their recent acquisitions.\n\n- **Recent Acquisition and Experience:** The user has expanded their collection with new crochet braiding hair extensions, which they rated highly for texture and ease of installation. This reinforces their enthusiasm for diverse hairstyling options and highlights their appreciation for quality products.\n\n- **Hair Type Focus:** The user remains dedicated to wavy textures while actively incorporating products suitable for curly styles, illustrating their commitment to exploring various hairstyling methods that accommodate different hair types.\n\n- **Rating Behavior:** The user consistently rates products based on satisfaction and quality. Their latest purchase reflects their discerning taste and dedication to high-quality hair care solutions.\n\n- **Overall Trend:** Balancing design and functionality, the user actively seeks hair care products that are visually appealing and effective. Their recent experiences demonstrate an ongoing dedication to enjoyable grooming tools that enhance their hairstyling experience, showcasing a desire for creative expression while ensuring practicality.\n\nIn summary, this user is committed to stylish and effective hair care solutions, enabling a wide array of hairstyling possibilities with a focus on quality and creativity.",
  "metrics": {
    "rouge1_f": 0.17276720351390923,
    "rouge2_f": 0.017621145374449337,
    "rougeL_f": 0.09077598828696926,
    "meteor": 0.06851894514342521,
    "bleu1": 0.05418671584356784,
    "bleu2": 0.009597494456140429,
    "bleu3": 0.0019882229332533635,
    "bleu4": 0.000905820140643018,
    "bertscore_precision": 0.3497159779071808,
    "bertscore_recall": 0.43292123079299927,
    "bertscore_f1": 0.38689565658569336
  }
}