{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Curly lace front human hair wigs lace front 21\", 4x4 curly human hair wigs for black women curly wigs human hair lace front kinky curly wig 21\"\nReview Date: 2020/03/12\nStore: Kapelli Hair\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Kapelli Hair', 'Extension Length': '21 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.9 x 4 inches; 1.25 Pounds'}\nReview Text: This hair is wonderful. The texture is very nice. It is soft and easy to manage. It braids beautifully and easily into hair. It looks very realistic. Great quality.\nReview Title: Excellent\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nJPNK\n{'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nThese combs are very pretty, but they are not practical for hair combing. These combs were very sharp and ruff against my hair. It didn't feel good at all and I won't be using them again.\nNot Great\nUgrace Hair 13x4 Body Wave Human Hair Wigs 150% Density Brazilian Body Wave Lace Front Wigs Pre Plucked Natural Hairline Glueless With Baby Hair Body Wigs For Women (22 inch)\nUgrace Hair\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Ugrace Hair', 'Package Dimensions': '12.4 x 10.35 x 4.06 inches; 10.58 Ounces', 'UPC': '765756990660'}\nIt has a nice size lace area, so you can change the part in the hair. With a little mousse, you can make cute cornrow braids as well. It looks very natural and realistic.\nNice\nLihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nThis hair has a nice texture. They are easy to install. The twists are nice and tight. It came with a crochet tool.\nNice\nOmbre Color 1B Burgundy Spring Twist Crochet Braiding Hair Crochet Braid Crochet Hair Afro Kinky Curl Color Crochet Synthetic Hair 4 Pack(8inch #1bbug)\nJulyQueen\n{'Brand': 'JulyQueen', 'Material': 'Synthetic', 'Extension Length': '8 Inches', 'Hair Type': 'Kinky', 'Installation Type': 'Clip-In', 'Package Dimensions': '11.1 x 8.1 x 3.1 inches; 1.2 Pounds', 'UPC': '681413989238'}\nThis hair is nice, silky, and bouncy twists. These are very good quality. The hair is soft and light. Very pretty.\nGreat\nCurly lace front human hair wigs lace front 21\", 4x4 curly human hair wigs for black women curly wigs human hair lace front kinky curly wig 21\"\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Extension Length': '21 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.9 x 4 inches; 1.25 Pounds'}\nThis hair is wonderful. The texture is very nice. It is soft and easy to manage. It braids beautifully and easily into hair. It looks very realistic. Great quality.\nExcellent",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to prioritize hair care accessories that blend practicality with aesthetic appeal, showing a robust interest in innovative and versatile styling products that foster creativity.\n\n- **Recent Acquisition and Experience:** The user recently purchased a curly lace front wig, which they rated extremely high, commending its softness, realistic appearance, and manageability. This indicates their enthusiasm for exploring diverse hairstyling options.\n\n- **Hair Type Focus:** The user is dedicated to wavy textures while also incorporating products suitable for kinky and curly styles, highlighting their commitment to experimenting with various hairstyling methods that accommodate a range of hair types.\n\n- **Rating Behavior:** The user consistently rates products based on satisfaction and quality, reinforcing their discerning taste. Their latest acquisition further emphasizes their preference for high-quality items.\n\n- **Overall Trend:** Balancing design and functionality, the user actively seeks hair care products that are visually appealing and effective. Their recent experiences reflect a continued dedication to finding enjoyable grooming tools that enhance their hairstyling experience, exemplifying their desire for an equilibrium between creative expression and practicality.\n\nThis profile reflects a user committed to stylish, effective hair care solutions that enable creative expression through a diverse array of hairstyling possibilities.",
  "metrics": {
    "rouge1_f": 0.17447495961227788,
    "rouge2_f": 0.01620745542949757,
    "rougeL_f": 0.0840064620355412,
    "meteor": 0.07680305151823737,
    "bleu1": 0.07393238557436696,
    "bleu2": 0.012895486764555472,
    "bleu3": 0.0026578941912394657,
    "bleu4": 0.001207872490362958,
    "bertscore_precision": 0.3609875440597534,
    "bertscore_recall": 0.4274072051048279,
    "bertscore_f1": 0.3913995623588562
  }
}