{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: allez outdoor | Biodegradable Cleansing Cloths | Natural Plant-Based Face and Body Wipes | PH Balanced | Cactus Bloom and Chaparral Scent | 20ct Individually Wrapped Towelettes\nReview Date: 2020/06/27\nStore: Allez\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Allez', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Material Feature': 'Biodegradable Warning', 'Unit Count': '20.00 Count', 'Number of Items': '1', 'Package Dimensions': '6.2 x 5.4 x 4.2 inches; 13.62 Ounces', 'Item model number': 'ABWPS001', 'UPC': '860000823210', 'Manufacturer': 'Allez Outdoor, LLC'}\nReview Text: These wipes are really large. The fabric is strong and soft. It has a nice clean scent and cleans well when you are in a pinch. They are individually wrapped for easy portability and convenience.\nReview Title: Great\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nJPNK\n{'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nThese combs are very pretty, but they are not practical for hair combing. These combs were very sharp and ruff against my hair. It didn't feel good at all and I won't be using them again.\nNot Great\nUgrace Hair 13x4 Body Wave Human Hair Wigs 150% Density Brazilian Body Wave Lace Front Wigs Pre Plucked Natural Hairline Glueless With Baby Hair Body Wigs For Women (22 inch)\nUgrace Hair\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Ugrace Hair', 'Package Dimensions': '12.4 x 10.35 x 4.06 inches; 10.58 Ounces', 'UPC': '765756990660'}\nIt has a nice size lace area, so you can change the part in the hair. With a little mousse, you can make cute cornrow braids as well. It looks very natural and realistic.\nNice\nLihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nThis hair has a nice texture. They are easy to install. The twists are nice and tight. It came with a crochet tool.\nNice\nOmbre Color 1B Burgundy Spring Twist Crochet Braiding Hair Crochet Braid Crochet Hair Afro Kinky Curl Color Crochet Synthetic Hair 4 Pack(8inch #1bbug)\nJulyQueen\n{'Brand': 'JulyQueen', 'Material': 'Synthetic', 'Extension Length': '8 Inches', 'Hair Type': 'Kinky', 'Installation Type': 'Clip-In', 'Package Dimensions': '11.1 x 8.1 x 3.1 inches; 1.2 Pounds', 'UPC': '681413989238'}\nThis hair is nice, silky, and bouncy twists. These are very good quality. The hair is soft and light. Very pretty.\nGreat\nCurly lace front human hair wigs lace front 21\", 4x4 curly human hair wigs for black women curly wigs human hair lace front kinky curly wig 21\"\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Extension Length': '21 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.9 x 4 inches; 1.25 Pounds'}\nThis hair is wonderful. The texture is very nice. It is soft and easy to manage. It braids beautifully and easily into hair. It looks very realistic. Great quality.\nExcellent\n6 Packs Bomb Twist Crochet Braiding Hair Extensions 18 Inches Spring Bomb Twist Crochet Hair Pre-looped Crochet Braids Long Pre-twisted Passion Twist Synthetic Hair Braids for Women (1B#)\nLOSMOEER\n{'Brand': 'LOSMOEER', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In'}\nNice texture. Easy to install. Beautiful hair overall.\nPretty\nClip in Human Hair Extensions Dark Brown Solid Color 20inch Silky Straight Remy Clip in Extensions Brown Human Hair Full Head 100G 7Pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Thick, Straight', 'Installation Type': 'Clip-In', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '750153936397'}\nThe hair is soft and silky. It blends in well to your natural hair. Easy to install and style.\nNice\nallez outdoor | Biodegradable Cleansing Cloths | Natural Plant-Based Face and Body Wipes | PH Balanced | Cactus Bloom and Chaparral Scent | 20ct Individually Wrapped Towelettes\nAllez\n{'Brand': 'Allez', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Material Feature': 'Biodegradable Warning', 'Unit Count': '20.00 Count', 'Number of Items': '1', 'Package Dimensions': '6.2 x 5.4 x 4.2 inches; 13.62 Ounces', 'Item model number': 'ABWPS001', 'UPC': '860000823210', 'Manufacturer': 'Allez Outdoor, LLC'}\nThese wipes are really large. The fabric is strong and soft. It has a nice clean scent and cleans well when you are in a pinch. They are individually wrapped for easy portability and convenience.\nGreat",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user seeks a blend of practical and aesthetic appeal across various personal care categories, reflecting an ongoing interest in innovative and versatile products that support creative expression.\n\n- **Recent Acquisition and Experience:** The user recently praised biodegradable cleansing cloths for their quality and convenience, appreciating their large size, strong yet soft fabric, and pleasant scent. This highlights a commitment to sustainable options and functionality in personal care.\n\n- **Hair Type Focus:** While maintaining a focus on wavy textures, the user is increasingly exploring products suitable for thick, straight styles, showcasing flexibility and an eagerness to diversify their styling repertoire.\n\n- **Rating Behavior:** The user consistently rates products on satisfaction, demonstrating a discerning taste and focused commitment to quality solutions. Their latest interaction reflects appreciation for effective and convenient items, reinforcing their meticulous evaluation process.\n\n- **Overall Trend:** The user seeks products that effectively combine design and functionality, enhancing personal grooming routines while maintaining an environmentally friendly focus. Their recent experiences underscore a dedication to enjoyable and practical tools that foster creativity in both hair care and broader personal care routines.\n\nIn summary, this user is committed to stylish, effective, and sustainable personal care solutions, expanding their repertoire with a focus on quality, versatility, and individual expression.",
  "metrics": {
    "rouge1_f": 0.16744186046511628,
    "rouge2_f": 0.013986013986013988,
    "rougeL_f": 0.07209302325581396,
    "meteor": 0.06424673765852876,
    "bleu1": 0.029928698390140295,
    "bleu2": 0.005633103581527189,
    "bleu3": 0.0010402437910072308,
    "bleu4": 0.0004474414729748106,
    "bertscore_precision": 0.35793623328208923,
    "bertscore_recall": 0.4647764563560486,
    "bertscore_f1": 0.40441903471946716
  }
}