{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Gel UV Nail Lamp, AsperX 150W LED Nail Dryer Gel Nail Polish Light Curing Lamp Kit Smart Auto-sensing with 10/30/60/99s Timer\nReview Date: 2020/10/08\nStore: AsperX\nAverage Rating: 4.3\nProduct Details: {'Brand': 'AsperX', 'Material': 'Gel', 'Item Dimensions LxWxH': '8.9 x 8.03 x 4.33 inches', 'Product Dimensions': '8.9\"D x 8.03\"W x 4.33\"H'}\nReview Text: It dried my nails much faster than my previous lamp. Since the wattage is much higher, I did notice my skin get a little tanner, so I covered my hand with a towel.\nReview Title: Dries nails fast\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "JPNK 4PCS Anti-Static Detangling Fine & Wide Tooth Shower Comb Set\nJPNK\n{'Material': 'Plastic', 'Brand': 'JPNK', 'Hair Type': 'Wavy,Straight', 'Unit Count': '1.00 Count', 'Package Dimensions': '12 x 3.1 x 0.7 inches; 5.61 Ounces'}\nThese combs are very pretty, but they are not practical for hair combing. These combs were very sharp and ruff against my hair. It didn't feel good at all and I won't be using them again.\nNot Great\nUgrace Hair 13x4 Body Wave Human Hair Wigs 150% Density Brazilian Body Wave Lace Front Wigs Pre Plucked Natural Hairline Glueless With Baby Hair Body Wigs For Women (22 inch)\nUgrace Hair\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'Ugrace Hair', 'Package Dimensions': '12.4 x 10.35 x 4.06 inches; 10.58 Ounces', 'UPC': '765756990660'}\nIt has a nice size lace area, so you can change the part in the hair. With a little mousse, you can make cute cornrow braids as well. It looks very natural and realistic.\nNice\nLihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nThis hair has a nice texture. They are easy to install. The twists are nice and tight. It came with a crochet tool.\nNice\nOmbre Color 1B Burgundy Spring Twist Crochet Braiding Hair Crochet Braid Crochet Hair Afro Kinky Curl Color Crochet Synthetic Hair 4 Pack(8inch #1bbug)\nJulyQueen\n{'Brand': 'JulyQueen', 'Material': 'Synthetic', 'Extension Length': '8 Inches', 'Hair Type': 'Kinky', 'Installation Type': 'Clip-In', 'Package Dimensions': '11.1 x 8.1 x 3.1 inches; 1.2 Pounds', 'UPC': '681413989238'}\nThis hair is nice, silky, and bouncy twists. These are very good quality. The hair is soft and light. Very pretty.\nGreat\nCurly lace front human hair wigs lace front 21\", 4x4 curly human hair wigs for black women curly wigs human hair lace front kinky curly wig 21\"\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Extension Length': '21 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.9 x 4 inches; 1.25 Pounds'}\nThis hair is wonderful. The texture is very nice. It is soft and easy to manage. It braids beautifully and easily into hair. It looks very realistic. Great quality.\nExcellent\n6 Packs Bomb Twist Crochet Braiding Hair Extensions 18 Inches Spring Bomb Twist Crochet Hair Pre-looped Crochet Braids Long Pre-twisted Passion Twist Synthetic Hair Braids for Women (1B#)\nLOSMOEER\n{'Brand': 'LOSMOEER', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In'}\nNice texture. Easy to install. Beautiful hair overall.\nPretty\nClip in Human Hair Extensions Dark Brown Solid Color 20inch Silky Straight Remy Clip in Extensions Brown Human Hair Full Head 100G 7Pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Thick, Straight', 'Installation Type': 'Clip-In', 'Product Dimensions': '20 x 1 x 1 inches; 4.23 Ounces', 'UPC': '750153936397'}\nThe hair is soft and silky. It blends in well to your natural hair. Easy to install and style.\nNice\nallez outdoor | Biodegradable Cleansing Cloths | Natural Plant-Based Face and Body Wipes | PH Balanced | Cactus Bloom and Chaparral Scent | 20ct Individually Wrapped Towelettes\nAllez\n{'Brand': 'Allez', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Material Feature': 'Biodegradable Warning', 'Unit Count': '20.00 Count', 'Number of Items': '1', 'Package Dimensions': '6.2 x 5.4 x 4.2 inches; 13.62 Ounces', 'Item model number': 'ABWPS001', 'UPC': '860000823210', 'Manufacturer': 'Allez Outdoor, LLC'}\nThese wipes are really large. The fabric is strong and soft. It has a nice clean scent and cleans well when you are in a pinch. They are individually wrapped for easy portability and convenience.\nGreat\nThe Henna Guys Hair Finishing Stick, Frizz Control Hair products, Broken Baby Hair Gel - Hair Wax Stick for Flyaway Hair - Faster & Quickest Solution for Neat Hair Styles (1 Pack)\nThe Henna Guys\n{'Package Information': 'Box', 'Brand': 'The Henna Guys', 'Item Form': 'Gel', 'Hair Type': 'Damaged', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 1.14 x 1.02 inches; 1.34 Ounces'}\nThe texture of this product is basically watered down hair gel. It probably works better for people with straight hair and not course curly hair types. My hair didn't feel hard or crunchy when it dried.\nOK\nHair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nMilantia\n{'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nThis tiny iron gets hot! I was surprised. It is really convenient and compact. It straightened my hair quickly and easily. I love how small it is. I can take it anywhere. It's cute and it works well.\nHot\n[the SAEM] Derma Plan Cleansing Bubble Pad 15pcs - One Step Gentle Makeup Cleansing Wipes Produce Fine & Dense Bubbles, Hypoallergenic Formula, Pore Clean, Mild Exfoliation\nTHESAEM\n{'Brand': 'THESAEM', 'Skin Type': 'Sensitive', 'Unit Count': '15.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.9 x 3.9 x 1.8 inches; 3.21 Ounces'}\nThese are ok for a quick wash when you are in a hurry traveling or something, but it seems too small and inadequate for regular use. It broke apart while I was using it. I felt like I was better off just using a regular wash cloth and soap.\nUnecessary\nCOSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nCOSYMAY\n{'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nThe wig I received is exactly as pictured. It only needed a bit of flat ironing and mousse to flatten and smooth out the hair. The density of the hair makes the wig look realistic. It doesn't look like one of those super thick, fake looking cosplay wigs.\nBetter than expected\nGel UV Nail Lamp, AsperX 150W LED Nail Dryer Gel Nail Polish Light Curing Lamp Kit Smart Auto-sensing with 10/30/60/99s Timer\nAsperX\n{'Brand': 'AsperX', 'Material': 'Gel', 'Item Dimensions LxWxH': '8.9 x 8.03 x 4.33 inches', 'Product Dimensions': '8.9\"D x 8.03\"W x 4.33\"H'}\nIt dried my nails much faster than my previous lamp. Since the wattage is much higher, I did notice my skin get a little tanner, so I covered my hand with a towel.\nDries nails fast",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to prioritize a blend of practicality and aesthetic appeal in personal care products, particularly embracing innovative solutions that facilitate creative expression.\n\n- **Recent Acquisition and Experience:** Having recently purchased a versatile hair solution, the user expressed high satisfaction due to its realistic quality and ease of styling. This reflects their ongoing interest in products that enhance their grooming routine through effective and stylish options.\n\n- **Hair Type Focus:** The user remains dedicated to wavy textures while actively exploring straight hair products, showcasing their commitment to diversifying styling options and adapting to various looks.\n\n- **Nail Care Interest:** The user has expanded their focus to nail care, recently acquiring a high-wattage nail lamp that significantly improved drying times. Their experience suggests a preference for efficient tools that enhance their nail care routine, although they express some caution regarding skin exposure.\n\n- **Rating Behavior:** The user maintains a discerning approach to reviews, valuing quality and practical benefits. Their thoughtful evaluations indicate a strong appreciation for products that seamlessly combine functionality with aesthetic appeal.\n\n- **Overall Trend:** The user prioritizes stylish, effective, and sustainable personal care solutions across hair and nail care, actively seeking reliable products while continuously exploring new avenues for individual expression. Their recent interactions further reinforce their dedication to quality and versatile grooming experiences.",
  "metrics": {
    "rouge1_f": 0.10966810966810965,
    "rouge2_f": 0.008670520231213874,
    "rougeL_f": 0.05339105339105339,
    "meteor": 0.03699350020744019,
    "bleu1": 0.0028345585646379476,
    "bleu2": 0.0006196669026061055,
    "bleu3": 0.0001092830534422448,
    "bleu4": 4.593504840255076e-05,
    "bertscore_precision": 0.35361218452453613,
    "bertscore_recall": 0.4660668671131134,
    "bertscore_f1": 0.4021255075931549
  }
}