{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lauat Herbal Hair Shampoo - 8.45 fl oz bottle of Lawat + Gugo + Virgin Coconut Oil Shampoo\nReview Date: 2021/06/03\nProduct Description: ['The product line comes from the combination of three indigenous plant extracts: Lawat (Litsea glutinosa)Gugo (Entada phaseoloides), and Virgin Coconut Oil or VCO (Cocos nuciferas)  Sold in the market for 30 years, Lauat has reached the US, Germany, Italy and the Middle East since the break of the decade.', 'NOW AVAILABLE IN AMAZON', ', Lauat has never been more accessible.']\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Liquid', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Special Feature': 'Natural ingredients', 'Liquid Volume': '8.45 Fluid Ounces', 'Product Dimensions': '2.76 x 1.38 x 6.97 inches; 8.45 Ounces', 'Item model number': '0V-H94U-IVEB'}\nReview Text: I looooove this soooo much its great to keep my hair strong...i bought 3 and plan to buy more!!!!\nReview Title: I love this lauat shampoo!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Temotei 2 in 1 Delicate Shampoo 13.5Oz\nTimotei\n{'Package Dimensions': '8.27 x 2.36 x 1.34 inches; 13.5 Ounces'}\nI love this 2 in 1 of timotei..soft hair now!!!!\nlove this timotei\nBaby Bench Cologne - Gummy Bear (200ml)\nThinkpichaidai\n['Bench Baby Cologne (Gummy Bear scent) 200mL']\n{'Brand': 'Thinkpichaidai', 'Item Form': 'Liquid', 'Item Volume': '200 Milliliters', 'Scent': 'Apple', 'Special Feature': 'Hypoallergenic', 'Product Dimensions': '2.95 x 1.57 x 6.5 inches; 7.94 Ounces', 'UPC': '885839645680', 'Manufacturer': 'Suyen Corporation'}\ndoesnt even smell like gummy bear, has a strong alcohol scent of floral again!!! i had to toss it,..i wont rebuy this scent is junk!!!!!!\ndoesnt even smell like gummy bear\nDial Triple Refined Bar Soap, Fresh Cut Blossoms, 8 oz Lot of 4\n{'Item Form': 'Bar', 'Age Range (Description)': 'Adult', 'Unit Count': '32.0 Fl Oz', 'Item Package Quantity': '1', 'Recommended Uses For Product': 'Body', 'Package Dimensions': '4.9 x 4.4 x 3 inches; 2.15 Pounds'}\nI love this bar fresh cut blossom dial soap bar its the best of the best i have tried,..no dryness to my skin at all...its hard to find in any stores and the only stores that got it is at kaneohe Safeway, only had 1 bar left!!! No other stores has this, i dont understand stores, why do they sell something that DOESNT work!!?? and something that does work and works great, they dont sell it or they discontinue that awesome product!!??? owners, corporate and managements all are stupid!!!!!!\nI love this dial fresh cut blossom soap\nColor Care Moisture Shampoo by eSalon - Getting Rich\neSalon\n{'Brand': 'eSalon', 'Item Form': 'Liquid', 'Hair Type': 'Color Treated,Chemically Treated', 'Age Range (Description)': 'Adult', 'Recommended Uses For Product': 'Softens,All Hair Types,Color-treated', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.2 x 2.1 x 2 inches; 10.41 Ounces'}\nlove how gentle this moisture esalon shampoo and how easy to dispense the conditioner of moisture of esalon, my hair felt clean, and soft with no dryness towards my color treated hair, after blow drying my hair, it looked shinier and healthier, i bought this set of moisture care shampoo & the conditioner (2) from Esalon online, i definitely will rebuy...i love how beautiful my hair looks!!!\ni love this Esalon moisture care shampoo and also the moisture care conditioner\nAuthentic Thai AR Vitamin E Cream 200 g\nAR VITAMIN E\n['Authentic Thai AR Vitamin E Cream 200 g, High Quality']\n{'Brand': 'AR VITAMIN E', 'Item Form': 'Cream', 'Active Ingredients': 'Vitamin e', 'Unit Count': '7 Ounce', 'Number of Items': '1', 'Package Dimensions': '4 x 4 x 4 inches; 7.05 Ounces', 'Item model number': 'body', 'UPC': '683332826939'}\nI love love this face and body cream, this is my first and only face and body cream i have tried and scent is like johnsons baby lotion scent, the cream is heavy , but you will NOT feel sticky and No oily afterfeel, (i promise!!), i use this on my face and entire body with no stickiness, i dearly love this cream and rebuy it again, my skin feels super soft!!!!\nI LOVE LOVE THIS \"AR\" CREAM MADE IN THAILAND\nLauat Herbal Hair Shampoo - 8.45 fl oz bottle of Lawat + Gugo + Virgin Coconut Oil Shampoo\n['The product line comes from the combination of three indigenous plant extracts: Lawat (Litsea glutinosa)Gugo (Entada phaseoloides), and Virgin Coconut Oil or VCO (Cocos nuciferas)  Sold in the market for 30 years, Lauat has reached the US, Germany, Italy and the Middle East since the break of the decade.', 'NOW AVAILABLE IN AMAZON', ', Lauat has never been more accessible.']\n{'Item Form': 'Liquid', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Special Feature': 'Natural ingredients', 'Liquid Volume': '8.45 Fluid Ounces', 'Product Dimensions': '2.76 x 1.38 x 6.97 inches; 8.45 Ounces', 'Item model number': '0V-H94U-IVEB'}\nI looooove this soooo much its great to keep my hair strong...i bought 3 and plan to buy more!!!!\nI love this lauat shampoo!!",
  "profile": "**Updated User Summary:**\n\n- **Preferred Product Type:** The user's interest has broadened to include natural hair care products, as demonstrated by their enthusiastic review of a herbal shampoo. They continue to appreciate rich creams for skin care, 2-in-1 hair care solutions, and bar soaps, reflecting a desire to explore diverse personal care options.\n\n- **Quality Focus:** Their dedication to high-quality formulations persists, aligning with their satisfaction from using effective products that provide excellent results without unpleasant textures. The positive experience with the herbal shampoo further reinforces their preference for natural and effective ingredients.\n\n- **Emotional Response:** The user maintains a positive outlook, highlighting their love for effective products, particularly in hair care. Their enthusiasm for the herbal shampoo showcases a readiness to embrace high-performing, natural solutions while still expressing frustration with product availability.\n\n- **Brand Loyalty:** The individual shows a strong loyalty to trusted brands while remaining open to established products that align with their quality standards. Their willingness to purchase multiple units of a new product indicates confidence in its effectiveness.\n\n- **Review Engagement:** Active engagement in sharing personal experiences remains a key feature of their profile. The user provides high praise for products that meet their expectations and maintains a critical stance toward those that do not, reinforcing their commitment to integrity in reviews.\n\n- **Overall Trend:** A focus on effectiveness, natural ingredients, quality, and convenience shapes their purchasing decisions across both hair and skin care categories, guided by previous experiences and satisfaction.",
  "metrics": {
    "rouge1_f": 0.19213973799126638,
    "rouge2_f": 0.015317286652078774,
    "rougeL_f": 0.08078602620087337,
    "meteor": 0.06469920544835414,
    "bleu1": 0.03257457256337963,
    "bleu2": 0.006279281768760952,
    "bleu3": 0.0011686656705984662,
    "bleu4": 0.0005045908441833077,
    "bertscore_precision": 0.35126155614852905,
    "bertscore_recall": 0.4158989489078522,
    "bertscore_f1": 0.3808572292327881
  }
}