{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Color Care Moisture Shampoo by eSalon - Getting Rich\nReview Date: 2018/12/31\nStore: eSalon\nAverage Rating: 3.4\nProduct Details: {'Brand': 'eSalon', 'Item Form': 'Liquid', 'Hair Type': 'Color Treated,Chemically Treated', 'Age Range (Description)': 'Adult', 'Recommended Uses For Product': 'Softens,All Hair Types,Color-treated', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.2 x 2.1 x 2 inches; 10.41 Ounces'}\nReview Text: love how gentle this moisture esalon shampoo and how easy to dispense the conditioner of moisture of esalon, my hair felt clean, and soft with no dryness towards my color treated hair, after blow drying my hair, it looked shinier and healthier, i bought this set of moisture care shampoo & the conditioner (2) from Esalon online, i definitely will rebuy...i love how beautiful my hair looks!!!\nReview Title: i love this Esalon moisture care shampoo and also the moisture care conditioner\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Temotei 2 in 1 Delicate Shampoo 13.5Oz\nTimotei\n{'Package Dimensions': '8.27 x 2.36 x 1.34 inches; 13.5 Ounces'}\nI love this 2 in 1 of timotei..soft hair now!!!!\nlove this timotei\nBaby Bench Cologne - Gummy Bear (200ml)\nThinkpichaidai\n['Bench Baby Cologne (Gummy Bear scent) 200mL']\n{'Brand': 'Thinkpichaidai', 'Item Form': 'Liquid', 'Item Volume': '200 Milliliters', 'Scent': 'Apple', 'Special Feature': 'Hypoallergenic', 'Product Dimensions': '2.95 x 1.57 x 6.5 inches; 7.94 Ounces', 'UPC': '885839645680', 'Manufacturer': 'Suyen Corporation'}\ndoesnt even smell like gummy bear, has a strong alcohol scent of floral again!!! i had to toss it,..i wont rebuy this scent is junk!!!!!!\ndoesnt even smell like gummy bear\nDial Triple Refined Bar Soap, Fresh Cut Blossoms, 8 oz Lot of 4\n{'Item Form': 'Bar', 'Age Range (Description)': 'Adult', 'Unit Count': '32.0 Fl Oz', 'Item Package Quantity': '1', 'Recommended Uses For Product': 'Body', 'Package Dimensions': '4.9 x 4.4 x 3 inches; 2.15 Pounds'}\nI love this bar fresh cut blossom dial soap bar its the best of the best i have tried,..no dryness to my skin at all...its hard to find in any stores and the only stores that got it is at kaneohe Safeway, only had 1 bar left!!! No other stores has this, i dont understand stores, why do they sell something that DOESNT work!!?? and something that does work and works great, they dont sell it or they discontinue that awesome product!!??? owners, corporate and managements all are stupid!!!!!!\nI love this dial fresh cut blossom soap\nColor Care Moisture Shampoo by eSalon - Getting Rich\neSalon\n{'Brand': 'eSalon', 'Item Form': 'Liquid', 'Hair Type': 'Color Treated,Chemically Treated', 'Age Range (Description)': 'Adult', 'Recommended Uses For Product': 'Softens,All Hair Types,Color-treated', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.2 x 2.1 x 2 inches; 10.41 Ounces'}\nlove how gentle this moisture esalon shampoo and how easy to dispense the conditioner of moisture of esalon, my hair felt clean, and soft with no dryness towards my color treated hair, after blow drying my hair, it looked shinier and healthier, i bought this set of moisture care shampoo & the conditioner (2) from Esalon online, i definitely will rebuy...i love how beautiful my hair looks!!!\ni love this Esalon moisture care shampoo and also the moisture care conditioner",
  "profile": "**Updated User Summary:**\n\n- **Preferred Product Type:** The user continues to favor 2 in 1 hair care solutions and has shown a positive engagement with bar soaps, demonstrating an openness to exploring various personal care categories. Their recent purchase reinforces a strong preference for specialized hair care products, particularly for color-treated hair.\n\n- **Quality Focus:** The emphasis on high-quality products persists, as evidenced by the user’s satisfaction with newer finds that emphasize gentle and effective formulas for color treatment. Their positive experience with a moisture care set highlights their ongoing commitment to effectiveness without sacrificing hair health.\n\n- **Emotional Response:** The user maintains a generally positive outlook but is frustrated by inconsistent product availability. Their recent review reflects a high level of scrutiny, where they actively evaluate the effectiveness and quality of products.\n\n- **Brand Loyalty:** Loyalty to trusted brands continues, but they remain critical of unfamiliar ones following past disappointments. The recent purchase underlines a preference for reliable and effective products that deliver on promises.\n\n- **Review Engagement:** The user enthusiastically shares experiences, providing praise for effective products while voicing frustration for those that fall short. This trend emphasizes their dedication to honest evaluations across different categories.\n\n- **Overall Trend:** A clear focus on effectiveness and convenience is apparent, along with a critical assessment of product availability and brand reliability influenced by previous experiences. This ongoing evaluation process guides their purchasing decisions.",
  "metrics": {
    "rouge1_f": 0.208,
    "rouge2_f": 0.022471910112359553,
    "rougeL_f": 0.0896,
    "meteor": 0.08162172482020111,
    "bleu1": 0.08605341139670329,
    "bleu2": 0.02189550267114721,
    "bleu3": 0.008750524050068919,
    "bleu4": 0.0031135267405620107,
    "bertscore_precision": 0.34454619884490967,
    "bertscore_recall": 0.3809666037559509,
    "bertscore_f1": 0.36184224486351013
  }
}