{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hearts Afire - The Complete Series\nReview Date: 2016/08/02\nStore: John Ritter  (Actor),     Markie Post  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: ['Hearts Afire - The Complete Series 7-Disc DVD']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Contributor': 'Markie Post, John Ritter, Billy Bob Thornton', 'Language': 'English', 'Number Of Discs': '7', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8 Ounces', 'Item model number': '52888', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Run time': '21 hours and 44 minutes', 'Release date': 'January 8, 2013', 'Actors': 'John Ritter, Markie Post, Billy Bob Thornton', 'Studio': 'Mill Creek Ent', 'Number of discs': '7'}\nReview Text: I have just started watching this series on DVD for the first time.  So far, I like it.  However, the quality of the video is not what it should be.  Yes, this is an older series, but I have DVD's of much older series that look far superior.  I don't think any effort was taken to improve the picture quality by Mill Creek Entertainment.  For that reason I have deducted the one star.\nReview Title: Good, except for picture quality....\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Don't Go Near The Water (Remastered)\nCharles Walters  (Director),     Glenn Ford  (Actor),     Gia Scala  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"They also serve who only sit and type! Hollywood brought audiences to atten-hut! in the 1950s and '60s with a string of military comedies like Mr. Roberts, Operation Petticoat, Ensign Pulver, No Time for Sergeants and this splash into the typing pool of dry-land sailors -- a Navy publicity team in the World War II Pacific. Glenn Ford, who appeared in a fistful of the era's service comedies, stars as a lieutenant with a knack for PR activities like placating big shots, calming romantic waters, deflating puffed-up journalists and puffing a profane-mouthed gob into the public's idea of the perfect enlisted man. Also in the large, shipshape cast: Anne Francis, Keenan Wynn and Mickey Shaughnessy.\"]\n{'Genre': 'Comedy', 'Format': 'NTSC, Original recording remastered', 'Contributor': 'Glenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ TamblynGlenn Ford, Eva Gabor, Anne Francis, Charles Walters, Gia Scala, Earl Holliman, Keenan Wynn, Jeff Richards, Fred Clark, Russ Tamblyn   See more', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.12 Ounces', 'Director': 'Charles Walters', 'Media Format': 'NTSC, Original recording remastered', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 1, 2011', 'Actors': 'Glenn Ford, Gia Scala, Earl Holliman, Anne Francis, Keenan Wynn', 'Studio': 'MGM', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis has always been one of my favorite movies. I was so happy to see it finally release on DVD.  However, Warner Brothers could have done a much better job on the DVD.  It is shown in a 2.35:1 widescreen format.  I believe that Amazon said 1.78:1, which is incorrect.  The case says remastered, but I found the quality of the picture way below what it should be.  The picture is grainy and the sound is only so-so.  For the price, I was expecting better.  There are NO SUBTITLES.  You would think if it was \"remastered\" they could at least add that feature.  Having said all this, the movie is still a hoot.  Glad to add it to my dvd collection.  They just don't make them this entertaining anymore.\nWB could have done better!\nWKRP in Cincinnati: The Complete Series [DVD]\nHoward Hesseman  (Actor),     Frank Bonner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', \"Pairing an impeccable ensemble cast with hilarious wit and popular tunes, WKRP in Cincinnati celebrated four amazing seasons, making it the quintessential situation comedy for any music lover! Join everyone's favorite radio DJs—the rockin' Dr. Johnny Fever (Howard Hesseman) and the soulful Venus Flytrap (Tim Reid)—as they weave through the inner-office antics of the crazy WKRP staff including the station's steady program director Andy (Gary Sandy), indecisive manager Carlson (Gordon Jump), smarmy advertising executive Herb (Frank Bonner), quirky news man Les Nessman (Richard Sanders), shy ingénue Bailey (Jan Smithers) and, of course, the station's lovely receptionist, Jennifer (Loni Anderson). So sit back and enjoy the sound of uproarious laughter as you watch all 90 episodes of this iconic series!\", 'Bonus Content:', 'Disc 13:', 'WKRP in Cincinnati: A Paley Center Reunion', 'WKRP in Cincinnati: A Paley Center Reunion', '\"Do My Eyes Say Yes?\" Featurette', '\"Do My Eyes Say Yes?\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', '\"A \\'Fish Story\\' Story\" Featurette', 'A Conversation with Gary Sandy', 'A Conversation with Gary Sandy', ']]>', 'Review', 'Shout! Factory has done yeoman’s work in trying to correct this with', 'WKRP in Cincinnati: The Complete Series', '...The image quality, considering this series was originally shot on video tape, is almost uniformly outstanding. And, once again, Andy is overseeing a station playing the likes of Bruce Springsteen, the Rolling Stones, AC/DC, the Grateful Dead, Tom Petty, Elvis Costello, the Cars, Wings and the Police, instead of a series of featureless Muzak tracks.  Nick DeRiso -Nick DeRisosomethingelsereviews.com']\n{'Genre': 'Comedy/Television, Television', 'Format': 'DVD', 'Contributor': 'Richard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim ReidRichard Sanders, Loni Anderson, Frank Bonner, Howard Hesseman, Gordon Jump, Hugh Wilson, Gary Sandy, Jan Smithers, Tim Reid  See more', 'Language': 'English', 'Number Of Discs': '12', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.45 Pounds', 'Item model number': 'generic', 'Media Format': 'DVD', 'Run time': '37 hours and 30 minutes', 'Release date': 'April 17, 2018', 'Actors': 'Howard Hesseman, Frank Bonner, Gary Sandy, Tim Reid, Richard Sanders', 'Subtitles': 'Afrikaans', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '12'}\nThis was a great series for sure and the music is important to me.  However, I also want a great picture.  Too many of the Shout Factory TV series releases video and sound quality have been poor.  I just watched a video teaser on the Shout website and if this is the same quality as the actual release, we are all in for a real treat.  This looks so much better than the original TV broadcasts.  Can't wait to see this.....\nMusic important, but so is picture quality\nBig Bang Theory: Season 8\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley CuocoMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley Cuoco   See more', 'Initial release date': '2015-09-15', 'Language': 'English'}\nWhat can I say?  This is my favorite show.  Picture quality is excellent.  Nice not to have to look at station logos, pop-ups and commercials as when originally aired.  Looking forward to buying season 9.\nMy favorite show!\nThe Middle: Season 4\nPatricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['The Middle: The Complete Fourth Season', 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher and Atticus Shaffer star as the middle class, middle of the country (i.e. Orson, Indiana) Heck family in this warm and witty comedy about raising a family and lowering your expectations. While Frankie continues to struggle selling cars at the only remaining car dealer in town, an unexpected turn of events might force her to reevaluate her career path. Axl’s slothlike days are numbered, now that Mike’s made it his mission to ensure that his oldest son somehow earns a sports scholarship and goes to college next year. Meanwhile, Sue’s not only navigating high school, but wants to navigate Indiana roads – by getting her driver’s license. It’s no wonder that youngest son Brick keeps his nose in a book!', ']]>']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Contributor': 'Patricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn HelinePatricia Heaton, Charlie McDermott, Eden Sher, Eileen Heisler, Neil Flynn, Atticus Shaffer, DeAnn Heline   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '883929373925', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen, Full Screen', 'Run time': '8 hours and 32 minutes', 'Release date': 'February 25, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie McDermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'Spanish, French, English', 'Producers': 'DeAnn Heline, Eileen Heisler', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nEither you like this show, or you hate it.  I like it a lot.  Laugh out loud several time every episode.  Video and audio quality is excellent.\nFunny, Funny, Funny\nThe Middle: The Complete Fifth Season\nPatricia Heaton  (Actor),     Neil Flynn  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['The quirky misadventures of one of the Heartland’s most hilarious families continue as the middle returns for a fifth fitful season… and family dynamics have never been funnier. As the middle-aged, middle-class, middle of the country mom, Frankie Heck (Patricia Heaton) tackles the mundane chaos of everyday life, her kids – recent high school graduate Axl (Charlie McDermott), sophomore Sue (Eden Sher) and the quirky middle-schooler Brick (Atticus Shaffer) – are continually manufacturing drama, while her laconic husband, Mike (Neal Flynn) offers support from the sidelines (re. the living room couch). Juggling her new job as a dental assistant with school projects, teenage theatrics and a husband in emotional low gear, Frankie struggles to use her wry wit and sense of humor to get her family through each day intact. But through all the madness, the Hecks muddle through…and together they’re keeping the middle on the map.']\n{'Genre': 'Comedy/Television', 'Format': 'NTSC', 'Contributor': 'Patricia Heaton, Eden Sher, Neil Flynn, Atticus Shaffer, Charlie Mcdermott', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '1000532061', 'Media Format': 'NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 9, 2014', 'Actors': 'Patricia Heaton, Neil Flynn, Charlie Mcdermott, Eden Sher, Atticus Shaffer', 'Subtitles': 'English', 'Studio': 'Warner Archive Collection', 'Number of discs': '3'}\nSuper funny show.  Every season actually gets better in my opinion.  Audio and video quality is very good.\nStill funny....\nHearts Afire - The Complete Series\nJohn Ritter  (Actor),     Markie Post  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Hearts Afire - The Complete Series 7-Disc DVD']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Contributor': 'Markie Post, John Ritter, Billy Bob Thornton', 'Language': 'English', 'Number Of Discs': '7', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 8 Ounces', 'Item model number': '52888', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Run time': '21 hours and 44 minutes', 'Release date': 'January 8, 2013', 'Actors': 'John Ritter, Markie Post, Billy Bob Thornton', 'Studio': 'Mill Creek Ent', 'Number of discs': '7'}\nI have just started watching this series on DVD for the first time.  So far, I like it.  However, the quality of the video is not what it should be.  Yes, this is an older series, but I have DVD's of much older series that look far superior.  I don't think any effort was taken to improve the picture quality by Mill Creek Entertainment.  For that reason I have deducted the one star.\nGood, except for picture quality....",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interest:** Classic Comedy Films and Television, alongside a growing affinity for contemporary sitcoms that focus on family dynamics and relatable humor.\n- **Content Preference:** Enjoys a blend of military-themed comedies from the mid-20th century as well as modern family-oriented sitcoms, reflecting a broad appreciation for comedic narratives across generations.\n- **Format:** Prefers DVDs, especially remastered versions, indicating a strong commitment to quality presentation and nostalgia despite occasional disappointments in video quality.\n- **Quality Expectations:** Holds high standards for both picture and sound quality; recent feedback reveals frustrations with subpar video quality in newer releases, demonstrating a consistent emphasis on technical excellence.\n- **Purchase Behavior:** Actively collects favorite classic films and TV series while engaging with modern content, suggesting a nostalgic approach that is subtly shifting towards an appreciation for contemporary narratives.\n- **Review Tendencies:** Offers balanced and insightful reviews that note both strengths and shortcomings, revealing a discerning yet appreciative stance towards content.\n- **Engagement with Content:** Shows eagerness to discuss and review both classic and modern comedic works, with recent attention on humor quality in family-centric narratives, reinforcing their passion for evaluating diverse media.\n\nOverall, the user remains a dedicated film and television enthusiast, valuing historical significance, entertainment quality, and technical excellence, while navigating the evolving landscape of comedy through both classic and modern lenses.",
  "metrics": {
    "rouge1_f": 0.09834469328140215,
    "rouge2_f": 0.00682261208576998,
    "rougeL_f": 0.04965920155793573,
    "meteor": 0.02946180339433172,
    "bleu1": 9.921703493418157e-05,
    "bleu2": 3.114847833620618e-05,
    "bleu3": 9.530158103908209e-06,
    "bleu4": 2.9669899310927032e-06,
    "bertscore_precision": 0.3560706079006195,
    "bertscore_recall": 0.4857409596443176,
    "bertscore_f1": 0.4109187722206116
  }
}