{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sayonara (1957) (Import NTSC All Regions).\nReview Date: 2014/03/24\nStore: Marlon Brando  (Actor),     Patricia Owens  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nAverage Rating: 4.6\nProduct Details: {'Genre': 'drama', 'Format': 'Dolby, NTSC, Color, Import, Full Screen', 'Contributor': 'Patricia Owens, Marlon Brando', 'Language': 'English', 'Runtime': '2 hours and 27 minutes'}\nReview Text: This is a timeless tale of racism during the 1950's, and two pairs of lovers who dare to defy the norm. The scenery is beautiful and the characters engaging. It's one of my most favorite movies.<br /><br />My only complaint is, I wish it were the director's cut that I first saw. I think the cutting down of movies to secure shorter run times in manufacturing has ruined more than one excellent effort with heavy handed and insensitive cutting. I don't buy a lot of DVD's just because of the butchering that goes on with the original stories; they really don't do a very good job of it. I wish the DVD manufacturers would stop that for the sake of aesthetics.\nReview Title: Sayonara\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Practical Magic Snap Case\nSandra Bullock  (Actor),     Nicole Kidman  (Actor),     Griffin Dunne  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"If a broom falls, company is due. When a circle rings the moon, trouble looms, Should you misplace your broom, sorry; a hand vac can't be used in an exorcism rite. Fun and excitement abound in the Owens family of wily witches. One problem, though: the men the Owens women fall in love with are doomed to an untimely death. Sandra Bullock and Nicole Kidman bring a sparkling screen magic to Practical Magic, adapted from Alice Hoffman's bestseller and directed by Griffin Dunne (Addicted to Love). They play Sally and Gillian Owens, sisters hexed by a centuries -old curse...and coping with a witches brew of events involving a possible love match (Aidan Quinn) for one, a zombie (Goran Visnjic) for the other and a need to resume the age-old witchcraft taught by two doting Owens aunts (Stockard Channing and Dianne Wiest). Sit for a spell and enjoy.\", 'Amazon.com', 'Actor Griffin Dunne improves a bit on his first film as a director,', 'Addicted to Love', \", with this drama-comedy about a family of witches. Nicole Kidman and Sandra Bullock play spell-casting sisters of different temperaments: the former is a high-living, free-spirited sort, while Bullock's character is a homebody who can't get around a family curse that kills the men in their lives. A widowed single mom, Bullock gets into a jam with an abusive Bulgarian (Goran Visnjic) and is helped out by her sibling, but the result brings a good-looking, warm, inquisitive cop (Aidan Quinn) into their lives. The film has a variety of tonal changes--cute, scary, glum--that Dunne can't always effectively juggle. But the female-centric, celebratory nature of the film (the fantasies, the sharing, the witchy bonds) is infectious, and supporting roles by Dianne Wiest and Stockard Channing as Kidman and Bullock's magical aunts are a lot of fun.\", '--Tom Keogh']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Griffin Dunne', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'February 16, 1999', 'Actors': 'Sandra Bullock, Nicole Kidman, Stockard Channing, Dianne Wiest, Goran Visnjic', 'Subtitles': 'English, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Warner Home Video', 'Writers': 'Adam Brooks, Akiva Goldsman, Alice Hoffman, Robin Swicord', 'Number of discs': '1'}\nIf you are looking for a romance wrapped in a little mystery and magic then Practical Magic is for you.<br />Sandra Bullock, Nicole Kiiddman, Dianne Weist, and Stockard Channing deliver a fast moving whirlwind of magical happenings while Aidan Quinn tries to figure out what happened to a diabolical character from Arizona as the roses go crazy in the garden. In the end, a generational curse is lifted, a case is solved, and love rains witches from an ancestral rooftop on Halloween. If you are looking for some lighthearted fun with your homemade popcorn, this is a great choice!\nPractical Magic lots of fun!\nThe Black Shield of Falworth\nRudolph Mate  (Director),     Tony Curtis  (Actor),     Janet Leigh  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['In The Black Shield of Falworth, Tony Curtis woos his real-life bride Janet Leigh, while defending the British throne in a swashbucking tale filled with joust, jests and medieval heroics. The time is England in the reign of King Henry IV. Miles (Curtis) is a headstrong, handsome peasant determined to learn the name of his slain father and discover his true heritage. His fiery ambition and swift sword lead him to the majestic MacWorth Castle. There he must vie for both knighthood as well as the hand of the fair Lady Anne (Leigh), but her love is claimed by the evil, conniving Sir Walter Blount. All the while the English throne is being challenged to the death - from sinister forces within. With its remarkable supporting cast and stunning set design, this is truly an epic tale of which legends are made!']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Contributor': \"Torin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert MarshallTorin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert Marshall  See more\", 'Language': 'English', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'USMD5208DVD', 'Director': 'Rudolph Mate', 'Media Format': 'NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'January 11, 2010', 'Actors': 'Tony Curtis, Janet Leigh, David Farrar, Barbara Rush, Herbert Marshall', 'Producers': 'Robert Arthur, Melville Tucker', 'Studio': 'Universal Pictures', 'Writers': 'Oscar Brodney', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI got this in the mail today and was delightfully surprised: The digital mix is great, the colors luminous and lush and the story doesn't sag in the middle! What fun! (I've read some negative things about this production but I would counsel to ignore them.) Technically you can enjoy this without it breaking down into window pane pixels or slowing to a stop towards the end and it's great entertainment. You can completely forget the bills and what Congress is doing and suspend reality for the length of this film and enjoy it with the kids! It's got it all: Romance, knights in shining armor, horses, a cause at stake, a family secret, beautiful ladies in courtly clothes, and villians abound. When I want to be taken away I'll be reaching for this flight of fancy instead of the Calgon!!!\nDelightful\nThe Pilot's Wife\nChristine Lahti  (Actor),     Campbell Scott  (Actor),     Robert Markowitz  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Kathryn Lyons' perfect life takes a jolting nosedive after news of a fatal mid-air explosion aboard Flight 274, piloted by her husband. The tension ratchets up a notch when the black box is recovered-revealing shocking rumors that the crash was possibly caused by her husband! Could her husband have secretly been a terrorist? Was her entire life with him a lie? 89 minutes 2001 Original Language: English.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Richard Donat, Anita Shreve, Christine Berardo, Robert Markowitz, Kirsty Mitchell, John Heard, Bruce McAllister, Alison Pill, Christine Lahti, Nigel Bennett, Christopher Shore, Campbell Scott, Joseph Rutten, Rick Burchill, David ChristoffelRichard Donat, Anita Shreve, Christine Berardo, Robert Markowitz, Kirsty Mitchell, John Heard, Bruce McAllister, Alison Pill, Christine Lahti, Nigel Bennett, Christopher Shore, Campbell Scott, Joseph Rutten, Rick Burchill, David Christoffel  See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2244656', 'Director': 'Robert Markowitz', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 29 minutes', 'Release date': 'May 6, 2003', 'Actors': 'Christine Lahti, Campbell Scott, Alison Pill, Kirsty Mitchell, John Heard', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Writers': 'Anita Shreve, Christine Berardo', 'Number of discs': '1'}\nThis movie chronicles the gradual awakening of an airline pilot's wife to the fact that there have been more people in her marriage than she ever could believe possible. It's a tale of shocking betrayal and heartbreak that will keep you absorbed until the end when all the answers float to the surface.\nThe Pilot's Wife\nSayonara (1957) (Import NTSC All Regions).\nMarlon Brando  (Actor),     Patricia Owens  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n{'Genre': 'drama', 'Format': 'Dolby, NTSC, Color, Import, Full Screen', 'Contributor': 'Patricia Owens, Marlon Brando', 'Language': 'English', 'Runtime': '2 hours and 27 minutes'}\nThis is a timeless tale of racism during the 1950's, and two pairs of lovers who dare to defy the norm. The scenery is beautiful and the characters engaging. It's one of my most favorite movies.<br /><br />My only complaint is, I wish it were the director's cut that I first saw. I think the cutting down of movies to secure shorter run times in manufacturing has ruined more than one excellent effort with heavy handed and insensitive cutting. I don't buy a lot of DVD's just because of the butchering that goes on with the original stories; they really don't do a very good job of it. I wish the DVD manufacturers would stop that for the sake of aesthetics.\nSayonara",
  "profile": "The user maintains a strong affinity for lighthearted and whimsical entertainment, particularly within the fantasy and romance genres, favoring films that blend magic, humor, and familial bonds. They enjoy narratives that evoke joy and escapism, with a preference for stories featuring strong female leads, ensemble casts, and captivating characters. Recent interactions show an expanding openness to action-adventure films that incorporate romantic elements, along with engaging plots, while still valuing a whimsical or uplifting tone. \n\nTheir latest review highlights a growing interest in narratives exploring themes of racism, love, and personal growth, reflecting an appreciation for more dramatic storytelling that remains thought-provoking and engaged. This suggests that the user is not only drawn to lighthearted narratives but also to those that delve into deeper social issues and emotional depth. They gravitate towards stories filled with romance, knights, and familial intrigue, seeking entertaining content that captivates emotionally while offering a delightful escape from reality. Overall, the user is likely to continue exploring diverse narratives that blend adventure, romance, and fantastical elements, searching for engaging tales that balance whimsy with meaningful exploration.",
  "metrics": {
    "rouge1_f": 0.10788381742738588,
    "rouge2_f": 0.009495548961424332,
    "rougeL_f": 0.058091286307053944,
    "meteor": 0.034961273666092946,
    "bleu1": 6.0422279256628264e-05,
    "bleu2": 2.3011085245034664e-05,
    "bleu3": 3.2175042684657588e-06,
    "bleu4": 1.204609583807341e-06,
    "bertscore_precision": 0.3309203088283539,
    "bertscore_recall": 0.478110134601593,
    "bertscore_f1": 0.3911258578300476
  }
}