{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Black Shield of Falworth\nReview Date: 2011/04/07\nStore: Rudolph Mate  (Director),     Tony Curtis  (Actor),     Janet Leigh  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['In The Black Shield of Falworth, Tony Curtis woos his real-life bride Janet Leigh, while defending the British throne in a swashbucking tale filled with joust, jests and medieval heroics. The time is England in the reign of King Henry IV. Miles (Curtis) is a headstrong, handsome peasant determined to learn the name of his slain father and discover his true heritage. His fiery ambition and swift sword lead him to the majestic MacWorth Castle. There he must vie for both knighthood as well as the hand of the fair Lady Anne (Leigh), but her love is claimed by the evil, conniving Sir Walter Blount. All the while the English throne is being challenged to the death - from sinister forces within. With its remarkable supporting cast and stunning set design, this is truly an epic tale of which legends are made!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Contributor': \"Torin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert MarshallTorin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert Marshall  See more\", 'Language': 'English', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'USMD5208DVD', 'Director': 'Rudolph Mate', 'Media Format': 'NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'January 11, 2010', 'Actors': 'Tony Curtis, Janet Leigh, David Farrar, Barbara Rush, Herbert Marshall', 'Producers': 'Robert Arthur, Melville Tucker', 'Studio': 'Universal Pictures', 'Writers': 'Oscar Brodney', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I got this in the mail today and was delightfully surprised: The digital mix is great, the colors luminous and lush and the story doesn't sag in the middle! What fun! (I've read some negative things about this production but I would counsel to ignore them.) Technically you can enjoy this without it breaking down into window pane pixels or slowing to a stop towards the end and it's great entertainment. You can completely forget the bills and what Congress is doing and suspend reality for the length of this film and enjoy it with the kids! It's got it all: Romance, knights in shining armor, horses, a cause at stake, a family secret, beautiful ladies in courtly clothes, and villians abound. When I want to be taken away I'll be reaching for this flight of fancy instead of the Calgon!!!\nReview Title: Delightful\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Practical Magic Snap Case\nSandra Bullock  (Actor),     Nicole Kidman  (Actor),     Griffin Dunne  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"If a broom falls, company is due. When a circle rings the moon, trouble looms, Should you misplace your broom, sorry; a hand vac can't be used in an exorcism rite. Fun and excitement abound in the Owens family of wily witches. One problem, though: the men the Owens women fall in love with are doomed to an untimely death. Sandra Bullock and Nicole Kidman bring a sparkling screen magic to Practical Magic, adapted from Alice Hoffman's bestseller and directed by Griffin Dunne (Addicted to Love). They play Sally and Gillian Owens, sisters hexed by a centuries -old curse...and coping with a witches brew of events involving a possible love match (Aidan Quinn) for one, a zombie (Goran Visnjic) for the other and a need to resume the age-old witchcraft taught by two doting Owens aunts (Stockard Channing and Dianne Wiest). Sit for a spell and enjoy.\", 'Amazon.com', 'Actor Griffin Dunne improves a bit on his first film as a director,', 'Addicted to Love', \", with this drama-comedy about a family of witches. Nicole Kidman and Sandra Bullock play spell-casting sisters of different temperaments: the former is a high-living, free-spirited sort, while Bullock's character is a homebody who can't get around a family curse that kills the men in their lives. A widowed single mom, Bullock gets into a jam with an abusive Bulgarian (Goran Visnjic) and is helped out by her sibling, but the result brings a good-looking, warm, inquisitive cop (Aidan Quinn) into their lives. The film has a variety of tonal changes--cute, scary, glum--that Dunne can't always effectively juggle. But the female-centric, celebratory nature of the film (the fantasies, the sharing, the witchy bonds) is infectious, and supporting roles by Dianne Wiest and Stockard Channing as Kidman and Bullock's magical aunts are a lot of fun.\", '--Tom Keogh']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Griffin Dunne', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'February 16, 1999', 'Actors': 'Sandra Bullock, Nicole Kidman, Stockard Channing, Dianne Wiest, Goran Visnjic', 'Subtitles': 'English, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Warner Home Video', 'Writers': 'Adam Brooks, Akiva Goldsman, Alice Hoffman, Robin Swicord', 'Number of discs': '1'}\nIf you are looking for a romance wrapped in a little mystery and magic then Practical Magic is for you.<br />Sandra Bullock, Nicole Kiiddman, Dianne Weist, and Stockard Channing deliver a fast moving whirlwind of magical happenings while Aidan Quinn tries to figure out what happened to a diabolical character from Arizona as the roses go crazy in the garden. In the end, a generational curse is lifted, a case is solved, and love rains witches from an ancestral rooftop on Halloween. If you are looking for some lighthearted fun with your homemade popcorn, this is a great choice!\nPractical Magic lots of fun!\nThe Black Shield of Falworth\nRudolph Mate  (Director),     Tony Curtis  (Actor),     Janet Leigh  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['In The Black Shield of Falworth, Tony Curtis woos his real-life bride Janet Leigh, while defending the British throne in a swashbucking tale filled with joust, jests and medieval heroics. The time is England in the reign of King Henry IV. Miles (Curtis) is a headstrong, handsome peasant determined to learn the name of his slain father and discover his true heritage. His fiery ambition and swift sword lead him to the majestic MacWorth Castle. There he must vie for both knighthood as well as the hand of the fair Lady Anne (Leigh), but her love is claimed by the evil, conniving Sir Walter Blount. All the while the English throne is being challenged to the death - from sinister forces within. With its remarkable supporting cast and stunning set design, this is truly an epic tale of which legends are made!']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Contributor': \"Torin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert MarshallTorin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert Marshall  See more\", 'Language': 'English', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'USMD5208DVD', 'Director': 'Rudolph Mate', 'Media Format': 'NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'January 11, 2010', 'Actors': 'Tony Curtis, Janet Leigh, David Farrar, Barbara Rush, Herbert Marshall', 'Producers': 'Robert Arthur, Melville Tucker', 'Studio': 'Universal Pictures', 'Writers': 'Oscar Brodney', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI got this in the mail today and was delightfully surprised: The digital mix is great, the colors luminous and lush and the story doesn't sag in the middle! What fun! (I've read some negative things about this production but I would counsel to ignore them.) Technically you can enjoy this without it breaking down into window pane pixels or slowing to a stop towards the end and it's great entertainment. You can completely forget the bills and what Congress is doing and suspend reality for the length of this film and enjoy it with the kids! It's got it all: Romance, knights in shining armor, horses, a cause at stake, a family secret, beautiful ladies in courtly clothes, and villians abound. When I want to be taken away I'll be reaching for this flight of fancy instead of the Calgon!!!\nDelightful",
  "profile": "The user continues to demonstrate a strong affinity for lighthearted and whimsical entertainment, particularly within the fantasy and romance genres. They enjoy films that blend elements of magic, humor, and familial bonds, often favoring lighthearted narratives that evoke feelings of joy and escapism. Their positive engagement with films featuring strong female leads remains a key trend, as the user appreciates ensemble casts and stories with captivating characters.\n\nThe recent review highlights an enjoyment of action-adventure films that still contain romantic elements and engaging plots, suggesting that the user is open to a broader range of genres, provided they maintain a whimsical or uplifting tone. The user's preference for stories filled with romance, knights, and familial intrigue, coupled with their passion for feel-good narratives, reinforces a desire for entertainment that balances humor and emotional depth. \n\nOverall, the user gravitates towards engaging narratives that allow for a delightful escape from reality, making them likely to continue seeking out content that features adventure, romance, and fantastical elements in the future.",
  "metrics": {
    "rouge1_f": 0.1433389544688027,
    "rouge2_f": 0.016891891891891893,
    "rougeL_f": 0.07251264755480608,
    "meteor": 0.04662339578471291,
    "bleu1": 0.000960077686074254,
    "bleu2": 0.00037869571113242537,
    "bleu3": 5.492153754466554e-05,
    "bleu4": 2.0943583987080955e-05,
    "bertscore_precision": 0.3250332474708557,
    "bertscore_recall": 0.45848122239112854,
    "bertscore_f1": 0.38039281964302063
  }
}