{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Midsomer Murders, Series 1 (Reissue)\nReview Date: 2016/06/14\nStore: John Nettles  (Actor),     Jane Wymark  (Actor),     Baz Taylor  (Director),     Jeremy Silberston  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Mystery & Thrillers\nProduct Description: ['Now in original U.K. broadcast order  “Superbly acted and filmed” —', 'British Heritage', 'magazine  Welcome to England’s most murderous county. . .  The English village mystery gets a contemporary spin in this hit British television series that has earned a worldwide following. Bucolic settings harbor macabre crimes and eccentric characters that are no match for nice-guy detective Tom Barnaby (John Nettles,', 'Bergerac', ') and his eager assistant, Sergeant Troy (Daniel Casey,', 'The Wingless Bird', '). “Delightful in a murderously charming way” (Leonard Maltin’s', 'Movie Crazy', '). Guest stars include Emily Mortimer, Jonathan Firth, Elizabeth Spriggs, Anna Massey, Joanna David, Bernard Hepton, Julian Glover, and Nicholas Le Prevost.  THE MYSTERIES (original U.K. broadcast order)', 'The Killings at Badger’s Drift', '—An elderly woman’s death draws Barnaby into a case that reveals the sordid side of a quaint village.', 'Written in Blood', '—Investigating the brutal murder of a writer, Barnaby discovers that the victim had led a fictitious life.', 'Death of a Hollow Man', '—Barnaby and his family take part in an amateur theatrical production that provides an abundance of real-life drama.', 'Faithful Unto Death', '—When the wife of a wealthy local businessman disappears, Barnaby finds a complex web of financial and romantic entanglements.', 'Death in Disguise', '—Barnaby investigates a string of deaths at a local New Age commune.  Now with SDH subtitles  Mysteries previously released in Set 5']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television/British Television, Television/Crime', 'Format': 'Color, NTSC, Subtitled', 'Contributor': 'Daniel Casey, Jane Wymark, Fiona Dolman, Tamzin Malleson, Laura Howard, Kirsty Dillon, John Nettles, Baz Taylor, Jason Hughes, Jeremy Silberston, Neil Dudgeon, Barry Jackson, John Hopkins, Anthony FarrellyDaniel Casey, Jane Wymark, Fiona Dolman, Tamzin Malleson, Laura Howard, Kirsty Dillon, John Nettles, Baz Taylor, Jason Hughes, Jeremy Silberston, Neil Dudgeon, Barry Jackson, John Hopkins, Anthony Farrelly  See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '26920686', 'Director': 'Baz Taylor, Jeremy Silberston', 'Media Format': 'Color, NTSC, Subtitled', 'Run time': '8 hours and 20 minutes', 'Release date': 'July 30, 2013', 'Actors': 'John Nettles, Jane Wymark, Barry Jackson, Jason Hughes, Laura Howard', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: This is a wonderful series and I have watched every offering made into America. Midsomer is a quaint English town and DCI Barnaby is at the ready to solve the bumper crop of murders in such a tiny place as Badger's Drift. I always looked forward to the next installment and it is wonderful to have recordings to be able to revisit the scene(s) of the crime(s).<br /><br />After years of watching, John Nettles retired and they introduced his &#34;brother&#34; as the new DCI. I thought they did an excellent job in casting and the new DCI was able to make a seamless transition into the next generation of mysteries, but people don't like change and I haven't seen much of the newer series, which is a disappointment because I thought the whole things was very well done.\nReview Title: Very Well Done\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Practical Magic Snap Case\nSandra Bullock  (Actor),     Nicole Kidman  (Actor),     Griffin Dunne  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"If a broom falls, company is due. When a circle rings the moon, trouble looms, Should you misplace your broom, sorry; a hand vac can't be used in an exorcism rite. Fun and excitement abound in the Owens family of wily witches. One problem, though: the men the Owens women fall in love with are doomed to an untimely death. Sandra Bullock and Nicole Kidman bring a sparkling screen magic to Practical Magic, adapted from Alice Hoffman's bestseller and directed by Griffin Dunne (Addicted to Love). They play Sally and Gillian Owens, sisters hexed by a centuries -old curse...and coping with a witches brew of events involving a possible love match (Aidan Quinn) for one, a zombie (Goran Visnjic) for the other and a need to resume the age-old witchcraft taught by two doting Owens aunts (Stockard Channing and Dianne Wiest). Sit for a spell and enjoy.\", 'Amazon.com', 'Actor Griffin Dunne improves a bit on his first film as a director,', 'Addicted to Love', \", with this drama-comedy about a family of witches. Nicole Kidman and Sandra Bullock play spell-casting sisters of different temperaments: the former is a high-living, free-spirited sort, while Bullock's character is a homebody who can't get around a family curse that kills the men in their lives. A widowed single mom, Bullock gets into a jam with an abusive Bulgarian (Goran Visnjic) and is helped out by her sibling, but the result brings a good-looking, warm, inquisitive cop (Aidan Quinn) into their lives. The film has a variety of tonal changes--cute, scary, glum--that Dunne can't always effectively juggle. But the female-centric, celebratory nature of the film (the fantasies, the sharing, the witchy bonds) is infectious, and supporting roles by Dianne Wiest and Stockard Channing as Kidman and Bullock's magical aunts are a lot of fun.\", '--Tom Keogh']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Griffin Dunne', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'February 16, 1999', 'Actors': 'Sandra Bullock, Nicole Kidman, Stockard Channing, Dianne Wiest, Goran Visnjic', 'Subtitles': 'English, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Warner Home Video', 'Writers': 'Adam Brooks, Akiva Goldsman, Alice Hoffman, Robin Swicord', 'Number of discs': '1'}\nIf you are looking for a romance wrapped in a little mystery and magic then Practical Magic is for you.<br />Sandra Bullock, Nicole Kiiddman, Dianne Weist, and Stockard Channing deliver a fast moving whirlwind of magical happenings while Aidan Quinn tries to figure out what happened to a diabolical character from Arizona as the roses go crazy in the garden. In the end, a generational curse is lifted, a case is solved, and love rains witches from an ancestral rooftop on Halloween. If you are looking for some lighthearted fun with your homemade popcorn, this is a great choice!\nPractical Magic lots of fun!\nThe Black Shield of Falworth\nRudolph Mate  (Director),     Tony Curtis  (Actor),     Janet Leigh  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['In The Black Shield of Falworth, Tony Curtis woos his real-life bride Janet Leigh, while defending the British throne in a swashbucking tale filled with joust, jests and medieval heroics. The time is England in the reign of King Henry IV. Miles (Curtis) is a headstrong, handsome peasant determined to learn the name of his slain father and discover his true heritage. His fiery ambition and swift sword lead him to the majestic MacWorth Castle. There he must vie for both knighthood as well as the hand of the fair Lady Anne (Leigh), but her love is claimed by the evil, conniving Sir Walter Blount. All the while the English throne is being challenged to the death - from sinister forces within. With its remarkable supporting cast and stunning set design, this is truly an epic tale of which legends are made!']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Contributor': \"Torin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert MarshallTorin Thatcher, Oscar Brodney, Tony Curtis, Dan O'Herlihy, Barbara Rush, Robert Arthur, David Farrar, Patrick O'Neal, Melville Tucker, Janet Leigh, Rudolph Mate, Herbert Marshall  See more\", 'Language': 'English', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'USMD5208DVD', 'Director': 'Rudolph Mate', 'Media Format': 'NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'January 11, 2010', 'Actors': 'Tony Curtis, Janet Leigh, David Farrar, Barbara Rush, Herbert Marshall', 'Producers': 'Robert Arthur, Melville Tucker', 'Studio': 'Universal Pictures', 'Writers': 'Oscar Brodney', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI got this in the mail today and was delightfully surprised: The digital mix is great, the colors luminous and lush and the story doesn't sag in the middle! What fun! (I've read some negative things about this production but I would counsel to ignore them.) Technically you can enjoy this without it breaking down into window pane pixels or slowing to a stop towards the end and it's great entertainment. You can completely forget the bills and what Congress is doing and suspend reality for the length of this film and enjoy it with the kids! It's got it all: Romance, knights in shining armor, horses, a cause at stake, a family secret, beautiful ladies in courtly clothes, and villians abound. When I want to be taken away I'll be reaching for this flight of fancy instead of the Calgon!!!\nDelightful\nThe Pilot's Wife\nChristine Lahti  (Actor),     Campbell Scott  (Actor),     Robert Markowitz  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Kathryn Lyons' perfect life takes a jolting nosedive after news of a fatal mid-air explosion aboard Flight 274, piloted by her husband. The tension ratchets up a notch when the black box is recovered-revealing shocking rumors that the crash was possibly caused by her husband! Could her husband have secretly been a terrorist? Was her entire life with him a lie? 89 minutes 2001 Original Language: English.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Richard Donat, Anita Shreve, Christine Berardo, Robert Markowitz, Kirsty Mitchell, John Heard, Bruce McAllister, Alison Pill, Christine Lahti, Nigel Bennett, Christopher Shore, Campbell Scott, Joseph Rutten, Rick Burchill, David ChristoffelRichard Donat, Anita Shreve, Christine Berardo, Robert Markowitz, Kirsty Mitchell, John Heard, Bruce McAllister, Alison Pill, Christine Lahti, Nigel Bennett, Christopher Shore, Campbell Scott, Joseph Rutten, Rick Burchill, David Christoffel  See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.88 Ounces', 'Item model number': '2244656', 'Director': 'Robert Markowitz', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 29 minutes', 'Release date': 'May 6, 2003', 'Actors': 'Christine Lahti, Campbell Scott, Alison Pill, Kirsty Mitchell, John Heard', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Writers': 'Anita Shreve, Christine Berardo', 'Number of discs': '1'}\nThis movie chronicles the gradual awakening of an airline pilot's wife to the fact that there have been more people in her marriage than she ever could believe possible. It's a tale of shocking betrayal and heartbreak that will keep you absorbed until the end when all the answers float to the surface.\nThe Pilot's Wife\nSayonara (1957) (Import NTSC All Regions).\nMarlon Brando  (Actor),     Patricia Owens  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n{'Genre': 'drama', 'Format': 'Dolby, NTSC, Color, Import, Full Screen', 'Contributor': 'Patricia Owens, Marlon Brando', 'Language': 'English', 'Runtime': '2 hours and 27 minutes'}\nThis is a timeless tale of racism during the 1950's, and two pairs of lovers who dare to defy the norm. The scenery is beautiful and the characters engaging. It's one of my most favorite movies.<br /><br />My only complaint is, I wish it were the director's cut that I first saw. I think the cutting down of movies to secure shorter run times in manufacturing has ruined more than one excellent effort with heavy handed and insensitive cutting. I don't buy a lot of DVD's just because of the butchering that goes on with the original stories; they really don't do a very good job of it. I wish the DVD manufacturers would stop that for the sake of aesthetics.\nSayonara\nSherlock Holmes: The Complete Series\nRonald Howard  (Actor),     Howard Marion-Crawford  (Actor),     Steve Previn  (Director),     Sheldon Reynolds  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['This 39-episode series was the FIRST American television show of Sherlock Holmes adventures – and the only one for almost 60 years until 2012’s Elementary. The program aired in syndication from 1954-55 and was based on mostly original stories written directly for television. It stars Ronald Howard – the son of screen legend Leslie Howard (of Scarlet Pimpernel and Gone with the Wind fame) – as Holmes and Howard Marion Crawford as Watson. Howard portrays a younger, more laid-back version of Sherlock Holmes based on the character in A Study in Scarlet and in line with Producer Sheldon Reynold’s vision. His rapport with Howard Marion-Crawford’s Dr. Watson is also more cooperative and less needling than most portrayals. It is a Holmes for a kinder, gentler age and a pleasure to watch.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Black & White, Dolby, Full Screen, NTSC', 'Contributor': 'Steve Previn, Archie Duncan, Jack Gage, Ronald Howard, Howard Marion-Crawford, Sheldon Reynolds', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.82 Ounces', 'Item model number': 'unknown', 'Director': 'Steve Previn, Sheldon Reynolds, Jack Gage', 'Media Format': 'Multiple Formats, Black & White, Dolby, NTSC, Full Screen', 'Run time': '19 hours and 30 minutes', 'Release date': 'July 1, 2014', 'Actors': 'Ronald Howard, Howard Marion-Crawford, Archie Duncan', 'Studio': 'Madacy Home Video', 'Number of discs': '2'}\nThis collection include additional stories not found elsewhere. It is done in B & W and gives the feeling of being in London at that time. Ronald Howard and Howard Marion-Crawford are delightful in their respective roles and there are enough episodes to get your fill. If you like period pieces, these half-hour mini-series installments are just the ticket.\nIf you like period pieces\nFather Dowling Mysteries: The Complete Series\nFormat: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Father Dowling My Com']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Box set, Color, Multiple Formats, Full Screen, NTSC', 'Contributor': 'FATHER DOWLING MYSTERIES: THE COMPLETE SERIES PACK', 'Language': 'English', 'Number Of Discs': '10', 'Product Dimensions': '1.7 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '54091952', 'Media Format': 'Box set, Color, Multiple Formats, Full Screen, NTSC', 'Release date': 'March 12, 2013', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '10'}\nThis is a wonderful series that emphasizes camaraderie, team work, fellowship, mysteries (without resorting to seamy sex) and a good time. I encourage you to get all three seasons; you won't be sorry. Tom Bosley and his ace team of actors won't disappoint.\nThis is a wonderful series that emphasizes camaraderie\nMiss Fisher's Murder Mysteries, Series 3\nEssie Davis  (Actor),     Nathan Page  (Actor),     Tony Tilse  (Director),     Peter Andrikidis  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Mystery & Thrillers\n['Essie Davis (The Babadook, The Slap) returns as Miss Phryne Fisher, a “lady detective” from Melbourne with a fabulous sense of fun and a flair for solving crimes. In a country reemerging from the shadow of World War I, Phryne takes life in her stride—and murder, too. Detective Inspector Jack Robinson (Nathan Page, The Secret Life of Us) works alongside her, although she often outraces him to the crime scene. Despite Jack’s efforts to keep matters on a professional level, their playful partnership is growing more and more personal. In Series 3, Phryne and Jack’s developing relationship is matched by the on-again, off-again romance of Phryne’s assistant, “Dot” Williams (Ashleigh Cummings, Tomorrow, When the War Began), and Jack’s constable, Hugh Collins (Hugo Johnstone-Burt, San Andreas). But with the unexpected arrival of her father in Australia, Phryne recalls troubling incidents from her past—and contends with ominous affairs in the present.']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Nathan Page, Peter Andrikidis, Essie Davis, Ashleigh Cummings, Daina Reid, Mat King, Tony Tilse, Miriam Margolyes, Hugo Johnstone-BurtNathan Page, Peter Andrikidis, Essie Davis, Ashleigh Cummings, Daina Reid, Mat King, Tony Tilse, Miriam Margolyes, Hugo Johnstone-Burt   See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.04 Ounces', 'Item model number': '35220864', 'Director': 'Tony Tilse, Peter Andrikidis, Mat King, Daina Reid', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Run time': '7 hours and 28 minutes', 'Release date': 'October 27, 2015', 'Actors': 'Essie Davis, Nathan Page, Hugo Johnstone-Burt, Ashleigh Cummings, Miriam Margolyes', 'Studio': 'Acorn', 'Number of discs': '3'}\nEssie Davis sparkles like diamonds in the Miss Fisher Mystery series! The first two seasonss are whimsical, fun, and upbeat. In this third season, Miss Fisher begins to mellow into a full on cozy detective and the tone is a little more serious and the plots a little more complex. The core cast is just fantastic and I certainly hope this series will take flight and a place alongside Poirot and Miss Marple in the classics of cozy mystery. Nathan Page plays detective Jack Robinson who, on his own, is the chief police detective for the district. However, his most endearing quality is how he entertains Miss Fisher's efforts and together they solve the mysteries. This series is funny (Jack and Hugh Collins in the police car late at night watching the legs of Miss Fisher disappear through an upstairs window,) and engrossing. The stories are well written and superbly acted. We love this series and hope to collect many more DVD's!\nEssie Davis sparkles like diamonds in the Miss Fisher Mystery series\nBelly Dance For Beginners\nLeila  (Actor),     Michael Wohl  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Belly dance', \"is fun, exciting, sensual and suitable for all body types and fitness levels. With this centuries old art form you' ll improve muscle tone, increase flexibility and range of motion while achieving better posture and a new sense of confidence and self-expression.  Taught by world-renowned Egyptian belly dancer, Leila of Egypt, Belly Dance for Beginnersis divided into three sections:\", 'Section I', ', the fundamentals of belly dance - posture, arm movements, hip movements, undulations and shimmies.  In', 'Section II', \"you'll incorporate movement with the Egyptian walk, moving circles and moving shimmies.  In\", 'Section III', \"you'll follow Leila as she performs sensual, energizing or relaxing belly dance routines.\", 'Belly Dance for Beginners Highlights:', '- Easy-to-follow instruction, suitable for all body types and fitness levels  - Original music and instruction from', \"one of Egypt's, and the world's, most popular belly dance star and instructor  - Sessions ranging from 10 to 30 minutes  - Improve your fitness and increase confidence while mastering the fundamentals of Egyptian style belly dance  - Learn several full dance routines Includes a full-length performance by Leila incorporating the moves learned on the DVD.\"]\n{'Genre': 'exercise_&_fitness_-_dance_fitness', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Leila, Michael Wohl', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.44 x 5.35 x 0.55 inches; 0.32 Ounces', 'Item model number': 'unknown', 'Director': 'Michael Wohl', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '4 hours', 'Release date': 'March 31, 2009', 'Actors': 'Leila', 'Studio': 'Body Wisdom', 'Number of discs': '1'}\nThis is a really good primer for belly dance. I own several other DVDs on this subject and they are good but this is really good. I highly recommend this DVD if you are new to the dance and are looking for a comprehensive introduction that will teach you all of the basics and build your confidence while having fun and getting a little light exercise all at the same time. I would call this DVD &#34;very user friendly&#34;.\nThis is a really good primer for belly dance\nMidsomer Murders, Series 1 (Reissue)\nJohn Nettles  (Actor),     Jane Wymark  (Actor),     Baz Taylor  (Director),     Jeremy Silberston  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Mystery & Thrillers\n['Now in original U.K. broadcast order  “Superbly acted and filmed” —', 'British Heritage', 'magazine  Welcome to England’s most murderous county. . .  The English village mystery gets a contemporary spin in this hit British television series that has earned a worldwide following. Bucolic settings harbor macabre crimes and eccentric characters that are no match for nice-guy detective Tom Barnaby (John Nettles,', 'Bergerac', ') and his eager assistant, Sergeant Troy (Daniel Casey,', 'The Wingless Bird', '). “Delightful in a murderously charming way” (Leonard Maltin’s', 'Movie Crazy', '). Guest stars include Emily Mortimer, Jonathan Firth, Elizabeth Spriggs, Anna Massey, Joanna David, Bernard Hepton, Julian Glover, and Nicholas Le Prevost.  THE MYSTERIES (original U.K. broadcast order)', 'The Killings at Badger’s Drift', '—An elderly woman’s death draws Barnaby into a case that reveals the sordid side of a quaint village.', 'Written in Blood', '—Investigating the brutal murder of a writer, Barnaby discovers that the victim had led a fictitious life.', 'Death of a Hollow Man', '—Barnaby and his family take part in an amateur theatrical production that provides an abundance of real-life drama.', 'Faithful Unto Death', '—When the wife of a wealthy local businessman disappears, Barnaby finds a complex web of financial and romantic entanglements.', 'Death in Disguise', '—Barnaby investigates a string of deaths at a local New Age commune.  Now with SDH subtitles  Mysteries previously released in Set 5']\n{'Genre': 'Television/British Television, Television/Crime', 'Format': 'Color, NTSC, Subtitled', 'Contributor': 'Daniel Casey, Jane Wymark, Fiona Dolman, Tamzin Malleson, Laura Howard, Kirsty Dillon, John Nettles, Baz Taylor, Jason Hughes, Jeremy Silberston, Neil Dudgeon, Barry Jackson, John Hopkins, Anthony FarrellyDaniel Casey, Jane Wymark, Fiona Dolman, Tamzin Malleson, Laura Howard, Kirsty Dillon, John Nettles, Baz Taylor, Jason Hughes, Jeremy Silberston, Neil Dudgeon, Barry Jackson, John Hopkins, Anthony Farrelly  See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '26920686', 'Director': 'Baz Taylor, Jeremy Silberston', 'Media Format': 'Color, NTSC, Subtitled', 'Run time': '8 hours and 20 minutes', 'Release date': 'July 30, 2013', 'Actors': 'John Nettles, Jane Wymark, Barry Jackson, Jason Hughes, Laura Howard', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Country of Origin': 'USA', 'Number of discs': '3'}\nThis is a wonderful series and I have watched every offering made into America. Midsomer is a quaint English town and DCI Barnaby is at the ready to solve the bumper crop of murders in such a tiny place as Badger's Drift. I always looked forward to the next installment and it is wonderful to have recordings to be able to revisit the scene(s) of the crime(s).<br /><br />After years of watching, John Nettles retired and they introduced his &#34;brother&#34; as the new DCI. I thought they did an excellent job in casting and the new DCI was able to make a seamless transition into the next generation of mysteries, but people don't like change and I haven't seen much of the newer series, which is a disappointment because I thought the whole things was very well done.\nVery Well Done",
  "profile": "The user maintains a strong preference for lighthearted and whimsical entertainment, particularly in fantasy and romance genres that blend magic, humor, and strong familial bonds, often featuring robust female leads and ensemble casts. Recently, their interests have diversified to include mystery narratives that incorporate romance and camaraderie, all while evoking nostalgia and historical contexts. \n\nTheir evolving taste has expanded to encompass action-adventure and cozy mystery narratives that highlight teamwork, personal growth, and emotional depth while retaining a lighthearted tone. This suggests a desire for engaging plotlines that explore character relationships and integrate humor with more intricate themes, including social issues.\n\nIn light of their recent activities, including their fondness for classic British murder mysteries, the user has shown a clear affinity for stories that blend charming settings with intricate plots and delightful characters. Additionally, they've expressed interest in wellness and fitness through beginner-level dance, signifying their appreciation for experiences that combine joyful escapism with self-expression and personal growth.\n\nOverall, the user is likely to continue seeking narratives that resonate on multiple levels, merging whimsical and adventurous elements with thoughtful exploration, while actively engaging in activities that promote well-being and creativity, showcasing a holistic approach to entertainment and personal development.",
  "metrics": {
    "rouge1_f": 0.07032115171650054,
    "rouge2_f": 0.003878116343490304,
    "rougeL_f": 0.03654485049833887,
    "meteor": 0.01837758876610984,
    "bleu1": 1.2091734959069635e-09,
    "bleu2": 3.769988082314411e-10,
    "bleu3": 5.1905571544997085e-11,
    "bleu4": 1.928151492202138e-11,
    "bertscore_precision": 0.3284212052822113,
    "bertscore_recall": 0.5230802893638611,
    "bertscore_f1": 0.4035005569458008
  }
}