{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 7,500mg Hemp Roll-On Hormonal Harmony Therapeutic Essential Oil Blend Supports Hormonal Balance C02 Extraction Exclusively on Amazon (1 Pack)\nReview Date: 2020/01/30\nStore: Greenive\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Greenive', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Unit Count': '1.00 Count', 'Material Feature': 'Organic'}\nReview Text: The fragrance gets high rating - not over the top, not hippy earthy, just the right balance between a light but pleasing fragrance which doesn't overwhelm. I also like the glass roller - no plastic infused into the product and sized right to tuck into a purse, desk drawer or glove compartment. Unfortunately this does next to nothing for me as far as benefit goes. I've tried it a few times and while it provides a nice base for the spouse to massage my temples, zero other benefit was noted after any of the uses.\nReview Title: Great smell - super easy to use but....\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "LaClaire Acne Wash with Salicylic Acid & Tea Tree Oil - Face Cleanser for Acne-Prone Skin (50 ml/1.65 oz)\nLaClaire\n{'Item Form': 'Oil, Foam', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Brand': 'LaClaire', 'Scent': 'Tea Tree', 'Material Feature': 'Antibacterial', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 2.75 x 1.63 inches; 9.14 Ounces', 'UPC': '891040000705', 'Manufacturer': 'LaClaire'}\nThis has terrific ingredients but personally I found it harsh and irritating; not the best option for older adults prone to the sporadic flair-up of acne. Fragrance, consistency and overall ingredient list are fine but the irritation lingers long after use.\nNot the best for mature acne prone skin\nLaClaire Skin Revitalization Clarifying Formula - Exfoliating Face Wash - Anti Wrinkle Face Wash – 1.9 % Salicylic Acid Exfoliating Cleanser - Smooth, Young & Radiant Skin – For Daily Use - 50mL / 1.7 oz, Made in the USA\nLaClaire\n['Formulated for blemish control in acne-prone skin, this extra strength foaming cleanser combines the natural antibacterial, tea tree oil, with the synergistic exfoliating power of two Alpha Hydroxy Acids, Glycolic Acid and Lactic Acid, as well as Beta Hydroxy Acid, Salicylic Acid, to decrease clogged pores, clear up stubborn body acne and problematic facial acne.']\n{'Item Form': 'Foam', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Brand': 'LaClaire', 'Scent': 'Tea Tree', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 2.75 x 1.63 inches; 10.41 Ounces', 'UPC': '891040000712', 'Manufacturer': 'LaClaire'}\nTypically I like this brand and I like the ingredient list in the product line up but the overall quality isn't quite effective enough. Not sure if it's due to age or strength but better used as a wash versus full treatment.\nNice ingredients but not strong enough\nBololo Baby Hair Clippers - Quiet Kids Hair Trimmer, Cordless & Waterproof Chargeable, Children with Autism, ABS Ceramic Blade, Haircut Kit for Kids Infants Men and Women,Green,\nMOM&HOME\n{'Recommended Uses For Product': 'Trimming', 'Color': 'White', 'Hair Type': 'All', 'Brand': 'MOM&HOME', 'Power Source': 'Battery Powered', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.38 x 3.66 x 2.32 inches; 8.47 Ounces', 'Batteries': '1 Lithium Ion batteries required. (included)', 'UPC': '691608094128', 'Manufacturer': 'Mom&Home'}\nVery gentle - which is good - but the usb charger is plain annoying. I'm unlikely to continue using this due to the charger. Very quiet, very gentle and very annoying to recharge. Also, despite the fact this is to be used on children, the person doing the trim is probably an adult so why make this so small? It's hard to handle.\nGentle but don't like the charger\nNatural Jade Roller Massager & Rose Quartz Facial Roller 2pcs Gift Set\nTGS Gems\n{}\nThis is a pretty little set - soothing, cool and all natural stone. Makes a great gift idea when combined with essential oils or just save for self when you want a little pampering.\nPretty\n2 in 1 Hair Straightener and Curler Travel Curling Flat Iron Wand Crimper, Dual Voltage 110V-240V Ceramic Tourmaline 1 1/4 inch Portable\nMadenia\n{'Brand': 'Madenia', 'Material': 'Ceramic', 'Size': '14 Inch (Pack of 1)', 'Item Weight': '0.9 Pounds', 'Power Source': 'Corded Electric', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '15.7 x 3.3 x 2.4 inches; 14.4 Ounces', 'UPC': '781573208030'}\nThis gets and A for travel. It's portable, versatile and comes with dual voltage but isn't the easiest to use. It would not be my first choice at home or when having other options but for stuffing in the luggage and hoping it doesn't get lost during transit to the destination, it's just fine.\nGood for travel\n&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&\nYRMJK\n{'Brand': 'YRMJK', 'Age Range (Description)': 'Adult', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Soft', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.1 x 3.1 x 2.7 inches; 13.76 Ounces', 'UPC': '738426030676', 'Manufacturer': 'MUTTUS'}\nI'll admit it, what initially attracted me to this is the pink...it's pretty! It also just happens to be a decent toothbrush. It comes with ample extras but can be packed away in a small space making it perfect for travel! Overall there isn't anything super fancy about this one - it works fine, looks great!\nGets extra points for pretty!\nPARWIN Infrared Flat Iron 1 1/4 Inch Digital Hair Straightener Iron with Ceramic Tourmaline Plate Temperature Control Hair Iron Christmas Gift Black\nPARWIN\n{'Brand': 'PARWIN', 'Hair Type': 'Coarse, Wavy, Frizzy, Curly, Thick, Thin', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '232.2 Degrees Celsius', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.94 x 3.82 x 1.93 inches; 1.3 Pounds', 'UPC': '605826620649', 'Manufacturer': 'Parwin'}\nNothing fancy here - it works fine and performs as expected but there was nothing to get excited about either. Zero problems but if you hide the brand name, no real benefit above lesser models either. This essentially boils down to the price since performance is pretty much standard on this one.\nPretty basic but good\nWet Dry Body Bath Foot Brush - 2 Pack With Massage Nodes & Long Handle - Removes Dead Skin And Toxins - Improve Your Circulation - Natural Bristle Back Scrubber for Exfoliating Skin & Foot Scrub Leg\nKitchen Krush\n{'Material': 'Nylon', 'Brand': 'Kitchen Krush', 'Power Source': 'hand_powered', 'Product Benefits': 'Softening,Massage,Relaxation,Smoothening,Clean,Exfoliating,Relaxing,Cleanse,Blood Circulation', 'Skin Type': 'Sensitive', 'Package Dimensions': '13.94 x 4.88 x 1.57 inches; 11.22 Ounces', 'UPC': '744790296037', 'Manufacturer': 'Kitchen Krush'}\nGreat design with sustainable bamboo \"wood\" that can be used on a stick as a back brush or on the hand for a body brush. Bristles are just the right balance between soft yet firm, nice feel and overall solid set. I like this better than the normal fixed long arm version.\nNice hand or back brush\nFuller Brush Styling Professional Hairbrush - Everyday Hair Styling Tool - Combination Boar and Nylon Bristles Gently Brush Hair while Styling Smoothing and Removing Tangles Dirt Flakes and Oil\nFuller Brush\n{'Brand': 'Fuller Brush', 'Shape': 'Rectangular', 'Handle Material': 'Plastic', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.98 x 2.6 x 1.81 inches; 1.59 Ounces', 'UPC': '083701005291'}\nThose who grew up with vintage hair brush types will appreciate the quality as it reminds me of old fashioned brushes...nothing fancy but all wood handles, good natural bristles and no plastic. I can't believe how difficult these are to find but was glad to run across this one. The bristles are firm - not soft - making this a good choice for those with thicker hair. Easy to use, responsive and nice quality.\nSolid feel - nice overall\n7,500mg Hemp Roll-On Hormonal Harmony Therapeutic Essential Oil Blend Supports Hormonal Balance C02 Extraction Exclusively on Amazon (1 Pack)\nGreenive\n{'Brand': 'Greenive', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Unit Count': '1.00 Count', 'Material Feature': 'Organic'}\nThe fragrance gets high rating - not over the top, not hippy earthy, just the right balance between a light but pleasing fragrance which doesn't overwhelm. I also like the glass roller - no plastic infused into the product and sized right to tuck into a purse, desk drawer or glove compartment. Unfortunately this does next to nothing for me as far as benefit goes. I've tried it a few times and while it provides a nice base for the spouse to massage my temples, zero other benefit was noted after any of the uses.\nGreat smell - super easy to use but....",
  "profile": "**Updated User Profile Summary:**\n\n- **Skin Concerns:** The user maintains a focus on managing acne while addressing mature skin needs, seeking harmony between aging and breakout issues.\n\n- **Product Preferences:** They prefer gentle yet effective formulations with sought-after ingredients like salicylic acid and tea tree oil. The user appreciates quality, functional grooming tools with a classic design, recently showing interest in therapeutic blends with light fragrances.\n\n- **Sensitivity Awareness:** They are conscious of potential ingredient sensitivities, advocating for gentle skincare options to prevent irritation.\n\n- **Fragrance Sensitivity:** The user favors unscented or mildly scented products, enjoying fragrances like tea tree oil. They value balanced scents that are not overwhelming.\n\n- **Overall Rating Expectation:** They maintain high standards for product performance in reviews but are flexible with expectations based on perceived value.\n\n- **Grooming Preferences:** The user seeks easy-to-use grooming products that promote relaxation and feature timeless designs. They appreciate practicality in grooming solutions, aligning with their minimalistic aesthetic.\n\n- **Travel Considerations:** They prioritize travel-friendly grooming options, favoring portable products that suit their on-the-go lifestyle.\n\n- **Recent Insights:** They recently purchased an essential oil blend praised for its pleasing scent and functional packaging, though it did not meet their expectations for performance. This highlights their continued appreciation for effective, aesthetically pleasing products that also provide a sensory experience.\n\nThe user exemplifies a discerning approach to skincare and grooming, valuing skin health, comfort, practicality, and timeless designs in their selections.",
  "metrics": {
    "rouge1_f": 0.16219839142091155,
    "rouge2_f": 0.0174496644295302,
    "rougeL_f": 0.06702412868632707,
    "meteor": 0.05442913231075077,
    "bleu1": 0.004197116132177384,
    "bleu2": 0.0007675280218623511,
    "bleu3": 0.000274742665980036,
    "bleu4": 9.251161856360634e-05,
    "bertscore_precision": 0.37857455015182495,
    "bertscore_recall": 0.4876810908317566,
    "bertscore_f1": 0.4262567162513733
  }
}