{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Rated Green - Hibiscus Moisturizing Scalp Pack - Tube - 6.76 fl. oz. Cold Brewed Organic Hibiscus with Natural Honey - Softening Hair Mask for Women & Men\nReview Date: 2021/10/14\nStore: RATED GREEN\nAverage Rating: 4.5\nProduct Details: {'Brand': 'RATED GREEN', 'Item Form': 'Cream', 'Material Feature': 'Organic, Natural', 'Hair Type': 'Fine', 'Product Benefits': 'Moisturizing', 'Product Dimensions': '19.69 x 19.69 x 11.02 inches; 7.8 Ounces', 'Item model number': 'RGNOP2'}\nReview Text: Used this for a few treatments, what I notice, my scalp is softer and  my hair has some more moisture and a little more volume and looks healthier, Didn't notice a difference with flakes or dandruff( but I really only have issues with this in the colder months) .  I like that its all natural, less chemicals the better for my hair.\nReview Title: does moisturize\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Rated Green - Hibiscus Moisturizing Scalp Pack - Tube - 6.76 fl. oz. Cold Brewed Organic Hibiscus with Natural Honey - Softening Hair Mask for Women & Men\nRATED GREEN\n{'Brand': 'RATED GREEN', 'Item Form': 'Cream', 'Material Feature': 'Organic, Natural', 'Hair Type': 'Fine', 'Product Benefits': 'Moisturizing', 'Product Dimensions': '19.69 x 19.69 x 11.02 inches; 7.8 Ounces', 'Item model number': 'RGNOP2'}\nUsed my regular shampoo, then followed up with this hair mask. Left it on for 5 mins and brushed it through my hair with a comb in the shower. The smell is amazing( if you like bananas, which I do ) After washing I let my hair air dry and my hair is so smooth and soft. I also have a nice shine to my hair. I notice with this product a little goes a long way so one bottle can last a while. Never used a hair mask before and I really like the life it gave my hair back.  I will continue to use this 1-2 times a week.\nAmazing soft smooth hair after use\nUtrue 2PCS Rhinestone Headbands（random color）\nUtrue\n{'Age Range (Description)': 'Adult', 'Material': 'Plastic', 'Fabric Type': 'plastic', 'Number of Items': '2', 'Brand': 'Utrue', 'Product Dimensions': '2 x 2 x 0.5 inches; 8.36 Ounces', 'UPC': '787365720155'}\nI have to say these are really nice headbands and very well made. The stones sparkle. Now this could just be preference, I don't like how bulky they are and how much they pop up on my head. Thats why I gave them 4 stars. They are comfortable and you can wear all day without getting a headache!\nReally well made.. buttt\nRated Green - Hibiscus Moisturizing Scalp Pack - Tube - 6.76 fl. oz. Cold Brewed Organic Hibiscus with Natural Honey - Softening Hair Mask for Women & Men\nRATED GREEN\n{'Brand': 'RATED GREEN', 'Item Form': 'Cream', 'Material Feature': 'Organic, Natural', 'Hair Type': 'Fine', 'Product Benefits': 'Moisturizing', 'Product Dimensions': '19.69 x 19.69 x 11.02 inches; 7.8 Ounces', 'Item model number': 'RGNOP2'}\nUsed this for a few treatments, what I notice, my scalp is softer and  my hair has some more moisture and a little more volume and looks healthier, Didn't notice a difference with flakes or dandruff( but I really only have issues with this in the colder months) .  I like that its all natural, less chemicals the better for my hair.\ndoes moisturize",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Continues to favor hair care products, particularly moisturizing treatments, and demonstrates ongoing interest in fashion accessories like headbands.\n- **Ingredients:** Strong preference for organic and natural formulations in hair care, reflecting a health-conscious lifestyle. Recent purchase reinforces the commitment to products with minimal chemicals.\n- **Perfume Sensitivity:** Enjoys pleasant scents, especially fruity aromas, and values aesthetic elements such as sparkle in accessories.\n- **Hair Type Focus:** Focuses on products suitable for fine hair, seeking enhancements in softness, moisture, and overall hair health while prioritizing comfort in headwear.\n- **Usage Pattern:** Maintains a routine usage pattern for hair care products, incorporating a new moisturizing treatment into a regular regimen and considering accessory usage as complementary.\n- **Application Method:** Prefers simple and effective application processes for hair care products and values comfort in accessories for all-day wear.\n- **Value for Money:** Appreciates cost-effectiveness and product longevity, emphasizing that a little product goes a long way, while also valuing quality in fashion accessories.\n- **Feedback Behavior:** Actively provides feedback based on satisfaction, giving high ratings for effective products and sharing observations on performance, particularly related to moisture and overall effectiveness.\n\nOverall, the user displays a clear trend toward effective, high-quality hair care solutions and aesthetically appealing accessories that prioritize natural ingredients, comfort, and practical value.",
  "metrics": {
    "rouge1_f": 0.250814332247557,
    "rouge2_f": 0.029411764705882353,
    "rougeL_f": 0.12052117263843647,
    "meteor": 0.13028913387417793,
    "bleu1": 0.15958925277266833,
    "bleu2": 0.03858430942168677,
    "bleu3": 0.01668557312360404,
    "bleu4": 0.009234778345004729,
    "bertscore_precision": 0.3850734233856201,
    "bertscore_recall": 0.44550544023513794,
    "bertscore_f1": 0.41309094429016113
  }
}