{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Utrue 2PCS Rhinestone Headbands（random color）\nReview Date: 2021/09/28\nStore: Utrue\nAverage Rating: 4.6\nProduct Details: {'Age Range (Description)': 'Adult', 'Material': 'Plastic', 'Fabric Type': 'plastic', 'Number of Items': '2', 'Brand': 'Utrue', 'Product Dimensions': '2 x 2 x 0.5 inches; 8.36 Ounces', 'UPC': '787365720155'}\nReview Text: I have to say these are really nice headbands and very well made. The stones sparkle. Now this could just be preference, I don't like how bulky they are and how much they pop up on my head. Thats why I gave them 4 stars. They are comfortable and you can wear all day without getting a headache!\nReview Title: Really well made.. buttt\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Rated Green - Hibiscus Moisturizing Scalp Pack - Tube - 6.76 fl. oz. Cold Brewed Organic Hibiscus with Natural Honey - Softening Hair Mask for Women & Men\nRATED GREEN\n{'Brand': 'RATED GREEN', 'Item Form': 'Cream', 'Material Feature': 'Organic, Natural', 'Hair Type': 'Fine', 'Product Benefits': 'Moisturizing', 'Product Dimensions': '19.69 x 19.69 x 11.02 inches; 7.8 Ounces', 'Item model number': 'RGNOP2'}\nUsed my regular shampoo, then followed up with this hair mask. Left it on for 5 mins and brushed it through my hair with a comb in the shower. The smell is amazing( if you like bananas, which I do ) After washing I let my hair air dry and my hair is so smooth and soft. I also have a nice shine to my hair. I notice with this product a little goes a long way so one bottle can last a while. Never used a hair mask before and I really like the life it gave my hair back.  I will continue to use this 1-2 times a week.\nAmazing soft smooth hair after use\nUtrue 2PCS Rhinestone Headbands（random color）\nUtrue\n{'Age Range (Description)': 'Adult', 'Material': 'Plastic', 'Fabric Type': 'plastic', 'Number of Items': '2', 'Brand': 'Utrue', 'Product Dimensions': '2 x 2 x 0.5 inches; 8.36 Ounces', 'UPC': '787365720155'}\nI have to say these are really nice headbands and very well made. The stones sparkle. Now this could just be preference, I don't like how bulky they are and how much they pop up on my head. Thats why I gave them 4 stars. They are comfortable and you can wear all day without getting a headache!\nReally well made.. buttt",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Continues to favor hair care products, especially moisturizing treatments, but has also shown interest in fashion accessories like headbands.\n- **Ingredients:** Maintains a strong preference for organic and natural formulations in hair care, reflecting a health-conscious approach.\n- **Perfume Sensitivity:** Enjoys pleasant scents, particularly fruity aromas such as banana, in hair care products. The user's taste extends to aesthetics, appreciating sparkle in accessories.\n- **Hair Type Focus:** Focuses on products suited for fine hair, seeking softness and shine while also considering headwear comfort.\n- **Usage Pattern:** Exhibits a routine usage pattern for hair care products, planning incorporation into a weekly regimen, now also potentially factoring in accessory usage.\n- **Application Method:** Prefers simple application processes for hair products and values comfortable, all-day wear for accessories.\n- **Value for Money:** Appreciates cost-effectiveness and longevity in hair care products, highlighting that a little product goes a long way. The user also values quality in fashion accessory purchases.\n- **Feedback Behavior:** Willing to share feedback based on satisfaction, providing high ratings for effective products while occasionally noting preferences that may detract from the overall experience.\n\nOverall, the user displays a clear trend toward effective, high-quality hair care solutions and fashion accessories that reflect both natural ingredients and aesthetic appeal, combined with a practical and value-oriented approach.",
  "metrics": {
    "rouge1_f": 0.27991886409736305,
    "rouge2_f": 0.03258655804480652,
    "rougeL_f": 0.1338742393509128,
    "meteor": 0.1612054936035322,
    "bleu1": 0.24925772332387694,
    "bleu2": 0.06925074395075073,
    "bleu3": 0.02979616839493331,
    "bleu4": 0.016449293446423312,
    "bertscore_precision": 0.4119893014431,
    "bertscore_recall": 0.4510810375213623,
    "bertscore_f1": 0.43064984679222107
  }
}