{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: [Abib] Creme coating mask Tone-up solution 17g (5pcs)\nReview Date: 2020/08/29\nStore: Abib\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Abib', 'Scent': 'Unscented', 'Number of Items': '5', 'Package Dimensions': '8.7 x 6.2 x 0.8 inches; 8.01 Ounces'}\nReview Text: This mask is way too thick and heavy for my taste.<br />I love korean masks and have been using goodal, dr jart, mediheal, dewycell, huxley, SNP, neogen, dermal and many more brands and this was the worst!<br />It's way too thick cream and doesn't absorb at all.<br />After you take the mask off, your face is completely covered with WHITE cream.<br />I had to wipe off everything!<br />I really don't uderstand this mask.<br />Too bad as I love abib Yuja essence and was hoping this would be good but no.<br />Packaging is simple and good though but that's all to me.\nReview Title: I did not like this mask\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Hand Crafted Ceramic Aromatherapy Essential Oil Diffuser,100ml Fragrant Room Sprays Ultrasonic Aroma Mist Atomizer BPA-Free, Waterless Auto Shut-Off and 7 Color Night Lights for Office Home Study Yoga\nBRNBW\n{'Brand': 'BRNBW', 'Material': 'Ceramic', 'Special Feature': 'Multiple Light Setting, Automatic Shut Off', 'Power Source': 'Corded Electric', 'Capacity': '100 Milliliters', 'Product Dimensions': '3.6 x 3.6 x 6.3 inches; 1.12 Pounds', 'UPC': '665059186312'}\nI have a similar diffuser but the cover is plastic, this one is ceramic and it feels and looks so much nicer!<br />I have another diffuser in bed room and love it so much,  wanted to get another one for kitchen.<br /><br />Ultrasonic aroma diffuser is so much better than candle and  room spray in my opinion.<br />I don't like candle makes fuse and burning smell afterward.<br />Room spray is overpowering smell at first and  doesn't last too long.<br />On the other hand, diffuser doesn't make fuse,burning smell and smells evenly from begging to end.<br />This is 100ml size and you think it's small and for only bed room but we live in 2600+ sqft , oepn floor house and when I use this in kitchen, I can still smell in my living room! (I think our ceiling fan help as well.)<br />This is really great addition for bedroom, living room or entryway!<br />Lighting is therapeutic at night too!<br />Totally recommend!!\nLove it\nBANILA CO Hi Bye Soothing Spot Treatment, 7 Natural Ingredients, Dermatologist-tested, Acne, Daily protection,30ml\nBANILA CO\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.09 x 1.34 x 1.3 inches; 3.63 Ounces'}\nIt did actually make my pimple a bit smaller next day but what I didn't like was exp date.<br />All Korean skin care have 2.5 years expiration date from manufacture date. It is Korean law to print exp date or manufacture date on skin care products and makeup products.(Makeup products have 3 years instead of 2.5 years.)<br />Product I receive is April 2021 exp date, that is only 10 month away and that means this was manufactured on Dec 2018, that sound pretty old as it is June 2020 right now....<br />Yes it is not expired but I have been using many korean skin care brands and almost always I get the products that have at least 2 years or longer exp date.<br />This is not something you use every day like toner and I only have 10 month to use and there's no way that I can use whole bottle by April.<br />I think it's good product but hopefully you'd get longer exp date product than mine so you wouldn't waste your money!\nWish I received longer exp date....\nWeChip 666\nWeChip\n{'Package Dimensions': '7.91 x 3.23 x 2.32 inches; 10.23 Ounces', 'UPC': '726972070413'}\nThis is my new beauty gadget!!!<br />This is amazing!<br />I knew how great and work the ultrasonic cleaner is because my husband got me a ultrasonic jewelry cleaner years ago and I’ve been loving it ever since.<br />It really amazes you to see how it can clean your jewelries without any soap and I even use for my glasses.<br />So when I start to seeing skin scrubber on SNS, I had no doubt that it would work.<br />And it really did!!! It is amazing!<br />It makes my skin so clean and soft with just water!! You don’t need to use peeling mask/pads or mud mask to clean your pores!<br />This is really great beauty gadget and it’s super reasonable!!!!!\nMy new beauty gadget!!\n[Abib] Creme coating mask Tone-up solution 17g (5pcs)\nAbib\n{'Brand': 'Abib', 'Scent': 'Unscented', 'Number of Items': '5', 'Package Dimensions': '8.7 x 6.2 x 0.8 inches; 8.01 Ounces'}\nThis mask is way too thick and heavy for my taste.<br />I love korean masks and have been using goodal, dr jart, mediheal, dewycell, huxley, SNP, neogen, dermal and many more brands and this was the worst!<br />It's way too thick cream and doesn't absorb at all.<br />After you take the mask off, your face is completely covered with WHITE cream.<br />I had to wipe off everything!<br />I really don't uderstand this mask.<br />Too bad as I love abib Yuja essence and was hoping this would be good but no.<br />Packaging is simple and good though but that's all to me.\nI did not like this mask",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** The user maintains a strong inclination towards ceramic materials over plastic, emphasizing aesthetics and quality in home decor. This preference includes beauty gadgets that combine functional design with innovative technology.\n  \n- **Aromatherapy Enthusiast:** They favor ultrasonic aroma diffusers over traditional candles and room sprays, prioritizing subtle scents and cleanliness.\n\n- **Functional Design:** Features such as automatic shut-off and versatility are essential to them, particularly for their expansive living area (over 2600 sqft).\n\n- **Therapeutic Elements:** The user highly values the wellness benefits of aromatherapy and lighting, creating a relaxing home environment. \n\n- **Skincare Awareness:** Their engagement with skincare reflects a focus on effective tools that enhance skin health while avoiding harsh chemicals. Although they explore various brands, they can be critical of product performance, particularly when expectations are not met.\n\n- **Critical Engagement:** Recent purchases signify a discerning attitude, as demonstrated by a negative experience with a skincare product perceived as too thick and ineffective. This indicates an ongoing commitment to quality and functionality in their skincare routine.\n\n- **Positive Engagement:** Consistently seeks products that merge functionality, aesthetic appeal, and quality, contributing to a harmonious and effective home atmosphere centered on self-care and wellness.\n\nThis profile showcases a user dedicated to cultivating a comfortable, visually pleasing environment while maintaining high standards in skincare and home products.",
  "metrics": {
    "rouge1_f": 0.16112789526686808,
    "rouge2_f": 0.026236125126135216,
    "rougeL_f": 0.08257804632426988,
    "meteor": 0.06422894858185765,
    "bleu1": 0.026872357613167207,
    "bleu2": 0.007069396748981689,
    "bleu3": 0.0024957417308917014,
    "bleu4": 0.0008346247506238742,
    "bertscore_precision": 0.36951351165771484,
    "bertscore_recall": 0.4499123692512512,
    "bertscore_f1": 0.4057687222957611
  }
}