{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: EASYDEW Starter Moist Whip Foam 5.07 fl oz - Non-Drying, Gentle & Purifying Foaming Cleanser with Ceramide I Exfoliating Daily Face Wash that Removes Dirts and Makeup\nReview Date: 2021/01/02\nStore: EASYDEW\nAverage Rating: 4.6\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'All, Oily to combination skin, Normal to dry skin, Sensitive to acne-prone skin', 'Brand': 'EASYDEW', 'Scent': 'Light floral', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '2.28 x 1.81 x 7.01 inches; 6.74 Ounces', 'Manufacturer': 'Cosmax'}\nReview Text: I've been using Easydew products for a while and every products works on my skin really well!<br />Their pricing is reasonable but yet effective!<br />This cleanser is generous size and last for a while.<br />I have sensitive skin but it didn't cause any irritation or redness so that's good.<br />I just started using it so I'll update the review in a month or so!\nReview Title: Love Easydew\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hand Crafted Ceramic Aromatherapy Essential Oil Diffuser,100ml Fragrant Room Sprays Ultrasonic Aroma Mist Atomizer BPA-Free, Waterless Auto Shut-Off and 7 Color Night Lights for Office Home Study Yoga\nBRNBW\n{'Brand': 'BRNBW', 'Material': 'Ceramic', 'Special Feature': 'Multiple Light Setting, Automatic Shut Off', 'Power Source': 'Corded Electric', 'Capacity': '100 Milliliters', 'Product Dimensions': '3.6 x 3.6 x 6.3 inches; 1.12 Pounds', 'UPC': '665059186312'}\nI have a similar diffuser but the cover is plastic, this one is ceramic and it feels and looks so much nicer!<br />I have another diffuser in bed room and love it so much,  wanted to get another one for kitchen.<br /><br />Ultrasonic aroma diffuser is so much better than candle and  room spray in my opinion.<br />I don't like candle makes fuse and burning smell afterward.<br />Room spray is overpowering smell at first and  doesn't last too long.<br />On the other hand, diffuser doesn't make fuse,burning smell and smells evenly from begging to end.<br />This is 100ml size and you think it's small and for only bed room but we live in 2600+ sqft , oepn floor house and when I use this in kitchen, I can still smell in my living room! (I think our ceiling fan help as well.)<br />This is really great addition for bedroom, living room or entryway!<br />Lighting is therapeutic at night too!<br />Totally recommend!!\nLove it\nBANILA CO Hi Bye Soothing Spot Treatment, 7 Natural Ingredients, Dermatologist-tested, Acne, Daily protection,30ml\nBANILA CO\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.09 x 1.34 x 1.3 inches; 3.63 Ounces'}\nIt did actually make my pimple a bit smaller next day but what I didn't like was exp date.<br />All Korean skin care have 2.5 years expiration date from manufacture date. It is Korean law to print exp date or manufacture date on skin care products and makeup products.(Makeup products have 3 years instead of 2.5 years.)<br />Product I receive is April 2021 exp date, that is only 10 month away and that means this was manufactured on Dec 2018, that sound pretty old as it is June 2020 right now....<br />Yes it is not expired but I have been using many korean skin care brands and almost always I get the products that have at least 2 years or longer exp date.<br />This is not something you use every day like toner and I only have 10 month to use and there's no way that I can use whole bottle by April.<br />I think it's good product but hopefully you'd get longer exp date product than mine so you wouldn't waste your money!\nWish I received longer exp date....\nWeChip 666\nWeChip\n{'Package Dimensions': '7.91 x 3.23 x 2.32 inches; 10.23 Ounces', 'UPC': '726972070413'}\nThis is my new beauty gadget!!!<br />This is amazing!<br />I knew how great and work the ultrasonic cleaner is because my husband got me a ultrasonic jewelry cleaner years ago and I’ve been loving it ever since.<br />It really amazes you to see how it can clean your jewelries without any soap and I even use for my glasses.<br />So when I start to seeing skin scrubber on SNS, I had no doubt that it would work.<br />And it really did!!! It is amazing!<br />It makes my skin so clean and soft with just water!! You don’t need to use peeling mask/pads or mud mask to clean your pores!<br />This is really great beauty gadget and it’s super reasonable!!!!!\nMy new beauty gadget!!\n[Abib] Creme coating mask Tone-up solution 17g (5pcs)\nAbib\n{'Brand': 'Abib', 'Scent': 'Unscented', 'Number of Items': '5', 'Package Dimensions': '8.7 x 6.2 x 0.8 inches; 8.01 Ounces'}\nThis mask is way too thick and heavy for my taste.<br />I love korean masks and have been using goodal, dr jart, mediheal, dewycell, huxley, SNP, neogen, dermal and many more brands and this was the worst!<br />It's way too thick cream and doesn't absorb at all.<br />After you take the mask off, your face is completely covered with WHITE cream.<br />I had to wipe off everything!<br />I really don't uderstand this mask.<br />Too bad as I love abib Yuja essence and was hoping this would be good but no.<br />Packaging is simple and good though but that's all to me.\nI did not like this mask\nDr.Althea Multi-Action Infusion Serum - 56 Packets of Light weight Gel Serum\nDr.Althea\n{'Skin Type': 'All', 'Brand': 'Dr.Althea', 'Item Form': 'Gel', 'Material Feature': 'Natural', 'Recommended Uses For Product': 'Protein,Calluses,Anti-aging', 'Package Dimensions': '6.8 x 5.7 x 1.3 inches; 5.61 Ounces'}\nI love these are individually packaged so every time you open, it's fresh and very hygienic.<br />One packet have generous amount of serum in it and you can use not only for your face but also your neck<br />and hand. or you can use one packet in the morning and at night, I'd say one packet is for 2 times use instead of once.<br />It's gel watery feeling serum and not oily or sticky at all which I love.<br />It makes my skin very hydrate, calm and it doesn't bother even if you wear makeup afterwards.<br />Overall, I really love this serum and recommend!\nHygienic packet\nEASYDEW Starter Moist Whip Foam 5.07 fl oz - Non-Drying, Gentle & Purifying Foaming Cleanser with Ceramide I Exfoliating Daily Face Wash that Removes Dirts and Makeup\nEASYDEW\n{'Item Form': 'Cream', 'Skin Type': 'All, Oily to combination skin, Normal to dry skin, Sensitive to acne-prone skin', 'Brand': 'EASYDEW', 'Scent': 'Light floral', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '2.28 x 1.81 x 7.01 inches; 6.74 Ounces', 'Manufacturer': 'Cosmax'}\nI've been using Easydew products for a while and every products works on my skin really well!<br />Their pricing is reasonable but yet effective!<br />This cleanser is generous size and last for a while.<br />I have sensitive skin but it didn't cause any irritation or redness so that's good.<br />I just started using it so I'll update the review in a month or so!\nLove Easydew",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** The user maintains a strong preference for ceramic materials over plastic, emphasizing aesthetics and quality in home decor and beauty gadgets that combine innovative design with functionality.\n\n- **Aromatherapy Enthusiast:** They prefer ultrasonic aroma diffusers for subtle scents and cleanliness, steering clear of traditional candles and room sprays.\n\n- **Functional Design:** Key features like automatic shut-off and versatility are essential, especially given their large living area (over 2600 sqft).\n\n- **Therapeutic Elements:** They appreciate the wellness benefits of aromatherapy and lighting, aiming for a relaxing home environment.\n\n- **Skincare Commitment:** The user is dedicated to effective skincare tools that enhance skin health without harsh chemicals. Their latest acquisition showcases their positive engagement with gentle and purifying products that suit various skin types, reinforcing their ongoing commitment to quality.\n\n- **Critical Engagement:** With discerning skincare choices shaped by past negative experiences, the user seeks products that meet high expectations in performance and safety.\n\n- **Positive Engagement:** They actively pursue skincare and home products that blend functionality, aesthetic appeal, and quality, contributing to a harmonious self-care and wellness atmosphere.\n\nThis profile highlights a user committed to creating a comfortable, visually appealing environment while upholding rigorous standards in both skincare and home enhancements.",
  "metrics": {
    "rouge1_f": 0.1351981351981352,
    "rouge2_f": 0.020233463035019456,
    "rougeL_f": 0.06993006993006994,
    "meteor": 0.05014844845498945,
    "bleu1": 0.005275180623119812,
    "bleu2": 0.0011141941858133274,
    "bleu3": 0.00019426474666502176,
    "bleu4": 8.119345776008451e-05,
    "bertscore_precision": 0.36198341846466064,
    "bertscore_recall": 0.45863303542137146,
    "bertscore_f1": 0.40461665391921997
  }
}