{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NOVA\nReview Date: 2014/07/08\nCategories: Documentary, Special Interest\nProduct Description: ['Now in its 39th season, NOVA is the most-watched primetime science series on American television, reaching an average of five million viewers weekly.']\nAverage Rating: 4.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Kirk Wolfinger', 'Sarah Holt', 'Gary Glassman', 'Terri Randall', 'Liesl Clark', 'Daniel McCabe', 'Brian Kaufman', 'Doug Hamilton', \"Miles O'Brien\", 'Michael Barnes']}\nReview Text: This is great channel and NOVA would never disappoint you. I have been watching this program through KQED Channel 9 here in the Bay Area and it has never let me down yet program-wise. This channel has a lot of great stories pertaining to real people's lives and I highly recommend this program if you're into documentaries...\nReview Title: \"A great channel if love documentaries\"\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['A&E Television Networks']}\nI like watching this series....Mr.Meltzer brings in his POV on the subject matter and actually has a couple of people working for him to make the effort of doing their own investigation on the matter in a Non linear and no sides perspective. He calls it as he sees it and he goes to far lengths and very thorough investigation to the people who are experts on the subject matter and none of those people who only had an opinion on the subject.\n\"Decoded: One Man;s Honest Opinion\"\nFrontline\nDocumentary, Talk Show and Variety, Special Interest\n['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\n{'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nI have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\n\"I really Love this!\"\nNOVA\nDocumentary, Special Interest\n['Now in its 39th season, NOVA is the most-watched primetime science series on American television, reaching an average of five million viewers weekly.']\n{'Subtitles': ['None available'], 'Directors': ['Kirk Wolfinger', 'Sarah Holt', 'Gary Glassman', 'Terri Randall', 'Liesl Clark', 'Daniel McCabe', 'Brian Kaufman', 'Doug Hamilton', \"Miles O'Brien\", 'Michael Barnes']}\nThis is great channel and NOVA would never disappoint you. I have been watching this program through KQED Channel 9 here in the Bay Area and it has never let me down yet program-wise. This channel has a lot of great stories pertaining to real people's lives and I highly recommend this program if you're into documentaries...\n\"A great channel if love documentaries\"",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** Shows a strong affinity for engaging narratives, particularly in documentary formats that feature thorough investigations and expert insights. The user appreciates programs that explore real people's lives and tackle complex societal issues with depth and authenticity.\n\n- **Rating Trends:** Maintains a generally positive rating average of 4.6, with a recent inclination to rate content highly, as evidenced by a 5.0 rating for a documentary series that resonated personally. Consistently seeks and rewards high-quality storytelling.\n\n- **Communication Style:** Values transparency and authenticity in information presentation, particularly in discussions surrounding controversial topics. Enjoys well-researched content that encourages thoughtful discourse.\n\n- **Language & Accessibility:** Prefers English audio and subtitles, but has expressed some frustration with the absence of subtitles in recent purchases, highlighting a desire for accessible viewing experiences.\n\n- **Content Advisory:** Tolerant of mature themes and realistic depictions, demonstrating an appreciation for unfiltered storytelling and authenticity.\n\n- **Engagement with Creators:** Positively engages with creators committed to expertise and credibility, emphasizing the need for thorough research in documentary formats.\n\nOverall, the user seeks thought-provoking entertainment that combines insightful commentary with expert knowledge, demonstrating a clear commitment to documentaries that inspire reflection and informed discussions.",
  "metrics": {
    "rouge1_f": 0.2179930795847751,
    "rouge2_f": 0.024305555555555552,
    "rougeL_f": 0.10380622837370243,
    "meteor": 0.10642929908708762,
    "bleu1": 0.09426750856909301,
    "bleu2": 0.025065585123583346,
    "bleu3": 0.013612643668057341,
    "bleu4": 0.00907372064486705,
    "bertscore_precision": 0.3652908205986023,
    "bertscore_recall": 0.43874502182006836,
    "bertscore_f1": 0.39866265654563904
  }
}