{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nigel Paterson', 'Jasper James'], 'Producers': ['BBC'], 'Starring': ['Kenneth Branagh', 'Stockard Channing', 'Larry Agenbroad']}\nReview Text: This documentary movie is about what happened in the last 200,00 years ago when the saber toothed tiger + other prehistoric beasts were still existing right after the great mass dinosaur mass extinction. It lets peek on what happened after the great meteor that wiped out everything and what kinds of mammals and other creatures started to come out of the wood works globally. I have other documentary movies about post extinction dinosaur stuff and they're quite better...this is OK but I had better\nReview Title: 200,00 year old prehistoric beast and why they went extinct...\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['A&E Television Networks']}\nI like watching this series....Mr.Meltzer brings in his POV on the subject matter and actually has a couple of people working for him to make the effort of doing their own investigation on the matter in a Non linear and no sides perspective. He calls it as he sees it and he goes to far lengths and very thorough investigation to the people who are experts on the subject matter and none of those people who only had an opinion on the subject.\n\"Decoded: One Man;s Honest Opinion\"\nFrontline\nDocumentary, Talk Show and Variety, Special Interest\n['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\n{'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nI have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\n\"I really Love this!\"\nNOVA\nDocumentary, Special Interest\n['Now in its 39th season, NOVA is the most-watched primetime science series on American television, reaching an average of five million viewers weekly.']\n{'Subtitles': ['None available'], 'Directors': ['Kirk Wolfinger', 'Sarah Holt', 'Gary Glassman', 'Terri Randall', 'Liesl Clark', 'Daniel McCabe', 'Brian Kaufman', 'Doug Hamilton', \"Miles O'Brien\", 'Michael Barnes']}\nThis is great channel and NOVA would never disappoint you. I have been watching this program through KQED Channel 9 here in the Bay Area and it has never let me down yet program-wise. This channel has a lot of great stories pertaining to real people's lives and I highly recommend this program if you're into documentaries...\n\"A great channel if love documentaries\"\nMountain Men\nUnscripted, Western, Special Interest\n[\"It's a race against winter for men who make their living off the land - hunting, fishing and trapping to put food on the table. For Mountain Men, survival is predicated on using ancient skills perfected over hundreds of years. HISTORY follows the lives of four American men and their families as<NL>they strive for the sustenance they need to make it through the harshest season.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Arabia', 'Mason Gertz', 'Randy Wimberg', 'Andrew Weed', 'Trevor Campbell'], 'Producers': ['Marc Pierce', 'Chris Richardson', 'Bridger Pierce', 'Dawn Fitzgerald', 'Lee Robinson']}\nA series that shows real people learning to survive in the wilderness of Alaska and other remote parts of the world. entertaining and you can learn a few tricks if you're planning to live a life like them in the boonies.\nReal Life survival\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Russell Morash', 'David B. Atwood', 'Russell Fortier', 'David Griffiths'], 'Producers': ['Russell Morash', 'Ruth Lockwood'], 'Starring': ['Julia Child'], 'Studio': ['PBS']}\nJulia Child basically started all of these cooling show series and this series tell you why she's the pioneer of TV cooking. She made cooking on TV cool and when no one else is doing it. Now there's a TON of these shows which is not really entertaining but reality shows existing only for the ratings. ANY idiot with a frying pan on one hand and a spatula on the other can participate on any cooking show and call themselves chef. Any guy cooking tacos in a taco truck is a chef i suppose...\nJulia Child\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryan Singer'], 'Producers': ['Gilbert Adler', 'Christopher McQuarrie', 'Bryan Singer', 'Ken Kamins', 'Chris Lee', 'John Ottman', 'Dwight C. Schar', 'Mark Shapiro', 'Daniel M. Snyder'], 'Starring': ['Tom Cruise', 'Kenneth Branagh', 'Bill Nighy'], 'Studio': ['MGM - Film']}\nGreat historical drama. You can only imagine if Lt.Colonel Clause Von Stauffenberg would have succeeded in killing Adolf Hitler if he placed the suit case bomb in the right place where Hitler was sitting in the wolfs lair THEN history could have been made very different and a lot of people could have lived longer and a lot less blood shed. Stauffenberg was a hero on all of this because he knew that Hitler was the beginning and the end of the coming world war when no one else has the sense of learning it and he died trying to prove it to the world. And in the end he was proven correct and if only he succeeded.... (sigh)\nYou need to watch this and learn from History\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nThis dude's funny! XD\nWatch  this if you needed a good laugh! XD\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Neale'], 'Producers': ['Mark Neale', 'Susan Cooper', 'Paul Taublieb', 'Stacy Transou'], 'Starring': [\"Jorg' Lorenzo\", 'Ewan McGregor', 'Valentino Rossi'], 'Studio': ['Media X International', 'Inc.']}\nThis is what real motorcycle is all about and it doesn't get more real than this! This Documentary movie let's you in on what goes on inside the world of the fastest motorcycles man has ever built: These machines weighs a lit over 300 LBS. But has  an average horsepower of about 200 HP machines and these motorcycles goes to the speeds in excess of 210 MPH! It also let's you in on how does a person compete and on what he goes through to get himself ready for it...the passion the dramas the rivalries of his fellow riders goes elbow to elbow with him on every corners chicanes at more than a 100 MPH their motorcycles are so low on the ground that they're dragging their knees to gauge their angle of attack to feel it! Just about anyone could ride a motorcycle at some certain speeds but not an excess of 200 MPH! To me, this is plain nothing short of committing suicide and i TOO ride a motorcycle but not close as these guys! You may call it brave or just plain Insane or Crazy but these guys are for real and besides not everyone has the kind of talent that these guys possess. This is a MUST WATCH for guys and gals who are adrenaline junkies and wants to know on what goes on in the world of MotoGP racing and I highly recommend this to race fans of any kind as well....\nMotorcycles hitting 210 MPH...you need to see this!\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nigel Paterson', 'Jasper James'], 'Producers': ['BBC'], 'Starring': ['Kenneth Branagh', 'Stockard Channing', 'Larry Agenbroad']}\nThis documentary movie is about what happened in the last 200,00 years ago when the saber toothed tiger + other prehistoric beasts were still existing right after the great mass dinosaur mass extinction. It lets peek on what happened after the great meteor that wiped out everything and what kinds of mammals and other creatures started to come out of the wood works globally. I have other documentary movies about post extinction dinosaur stuff and they're quite better...this is OK but I had better\n200,00 year old prehistoric beast and why they went extinct...",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to favor engaging narratives, particularly in documentary formats that explore real lives and societal issues. However, their recent interaction indicates a growing desire for post-extinction content, albeit with a more critical lens, as they compare various documentaries in this niche.\n\n- **Rating Trends:** The user’s rating average remains high at 4.7, although a recent 3.0 rating suggests a discerning shift in their taste, emphasizing a higher standard for documentary quality and depth. This reflects a carefully calibrated appreciation for content that aligns with their interests.\n\n- **Communication Style:** The user values transparency and authenticity, demanding well-researched material that fosters thoughtful discussions. They show continued enthusiasm for high-stakes and thought-provoking environments while allowing for a critical perspective.\n\n- **Language & Accessibility:** Preferences for English audio and subtitles remain unchanged, along with frustrations regarding insufficient subtitle offerings, reinforcing their commitment to accessible viewing experiences.\n\n- **Content Advisory:** The user appreciates mature themes and realistic storytelling, displaying tolerance for unfiltered narratives that delve into both extreme sports and historical explorations.\n\n- **Engagement with Creators:** They seek creators who exhibit expertise and thorough research, gravitating towards credible storytelling that blends entertainment with deep insights and critical analysis.\n\nOverall, the user seeks intellectually stimulating content that balances educational value with thrilling themes, affirming their diverse interests and evolving standards in documentary storytelling.",
  "metrics": {
    "rouge1_f": 0.11732973701955494,
    "rouge2_f": 0.0054017555705604325,
    "rougeL_f": 0.0633850303438975,
    "meteor": 0.04056795131845842,
    "bleu1": 0.002261674742253945,
    "bleu2": 0.00046246882141617375,
    "bleu3": 7.976033263578843e-05,
    "bleu4": 3.3152847451614956e-05,
    "bertscore_precision": 0.34779471158981323,
    "bertscore_recall": 0.44893506169319153,
    "bertscore_f1": 0.3919452726840973
  }
}