{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Frontline\nReview Date: 2014/06/15\nCategories: Documentary, Talk Show and Variety, Special Interest\nProduct Description: ['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\nAverage Rating: 3.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nReview Text: I have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\nReview Title: \"I really Love this!\"\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['A&E Television Networks']}\nI like watching this series....Mr.Meltzer brings in his POV on the subject matter and actually has a couple of people working for him to make the effort of doing their own investigation on the matter in a Non linear and no sides perspective. He calls it as he sees it and he goes to far lengths and very thorough investigation to the people who are experts on the subject matter and none of those people who only had an opinion on the subject.\n\"Decoded: One Man;s Honest Opinion\"\nFrontline\nDocumentary, Talk Show and Variety, Special Interest\n['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\n{'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nI have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\n\"I really Love this!\"",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** Prefers engaging narratives with depth, particularly those featuring thorough investigations and expert insights. Shows a strong interest in documentaries that offer honest explorations of controversial subjects and raise challenging questions.\n\n- **Rating Trends:** Generally positive, with an average rating of 4.6, although recent interactions indicate a willingness to rate content highly when it resonates personally, as shown by a recent 5.0 rating for a documentary series.\n\n- **Communication Style:** Enjoys content that presents information transparently and values authenticity in opinions, particularly when discussing complex issues.\n\n- **Language & Accessibility:** Favors content that includes English audio and subtitles, indicating a preference for accessible viewing experiences, although recent interaction noted a lack of subtitles in a purchase.\n\n- **Content Advisory:** Tolerant of mature themes, accepting of foul language and realistic depictions, which suggests an appreciation for unfiltered storytelling.\n\n- **Engagement with Creators:** Responds positively to creators committed to well-researched content, emphasizing the importance of expertise and credibility, particularly in documentary formats.\n\nOverall, this user seeks thought-provoking and well-crafted entertainment that combines insightful commentary and expert knowledge, with a preference for mature, authentic representations that tackle complex societal issues. Their recent interactions further underline a commitment to documentaries that provoke thoughtful discourse.",
  "metrics": {
    "rouge1_f": 0.26609442060085836,
    "rouge2_f": 0.021551724137931036,
    "rougeL_f": 0.10300429184549356,
    "meteor": 0.14072903269687376,
    "bleu1": 0.17787030546909338,
    "bleu2": 0.021300100839272727,
    "bleu3": 0.004879342721053198,
    "bleu4": 0.0023375878733079476,
    "bertscore_precision": 0.3891230821609497,
    "bertscore_recall": 0.43959206342697144,
    "bertscore_f1": 0.4128207862377167
  }
}