{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/08/11\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graham Townsley'], 'Starring': ['Lance Lewan'], 'Studio': ['PBS']}\nReview Text: A great documentary series about how we as human beings evolved from an ape like creature 5 million years ago and how we ended up being Homo Sapien or &#34;the thinking man&#34; and how we developed into  becoming the top predator on the face of this earth. It also shows how the scientist, paleontologist and human anthropologist came to understand on how and why we ended the way we are to day. they also figured out when and what place where everything started and where we're going as human beings and what we're evolving into. This is a very fascinating series if you like need to know scientific prof about things that includes us. I have been always fascinated about human evolution since I was a young kid. You need to see this series and I HIGHLY recommend this!\nReview Title: You'll figure out where we all came from if you watch this series!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['A&E Television Networks']}\nI like watching this series....Mr.Meltzer brings in his POV on the subject matter and actually has a couple of people working for him to make the effort of doing their own investigation on the matter in a Non linear and no sides perspective. He calls it as he sees it and he goes to far lengths and very thorough investigation to the people who are experts on the subject matter and none of those people who only had an opinion on the subject.\n\"Decoded: One Man;s Honest Opinion\"\nFrontline\nDocumentary, Talk Show and Variety, Special Interest\n['Hailed upon its television broadcast debut as \"the last best hope for broadcast documentaries,\" Frontline\\'s stature over more than 28 years is reaffirmed each week through incisive documentaries covering the scope and complexity of the human experience.']\n{'Subtitles': ['None available'], 'Directors': ['Michael Kirk', 'Ofra Bikel', 'Marcela Gaviria', 'Rick Young', 'Neil Docherty', 'William Cran', 'Jon Palfreman', 'Martin Smith', 'Thomas Jennings', 'Daniel Edge']}\nI have been a fan of PBS as long as I can even remember. This how tells you an honest look about controversial subject matters that important to you and they also asks the tough questions of the hows and the whys. I have been a follower of this show. UYou should try watching it sometime and you'll be hooked!\n\"I really Love this!\"\nNOVA\nDocumentary, Special Interest\n['Now in its 39th season, NOVA is the most-watched primetime science series on American television, reaching an average of five million viewers weekly.']\n{'Subtitles': ['None available'], 'Directors': ['Kirk Wolfinger', 'Sarah Holt', 'Gary Glassman', 'Terri Randall', 'Liesl Clark', 'Daniel McCabe', 'Brian Kaufman', 'Doug Hamilton', \"Miles O'Brien\", 'Michael Barnes']}\nThis is great channel and NOVA would never disappoint you. I have been watching this program through KQED Channel 9 here in the Bay Area and it has never let me down yet program-wise. This channel has a lot of great stories pertaining to real people's lives and I highly recommend this program if you're into documentaries...\n\"A great channel if love documentaries\"\nMountain Men\nUnscripted, Western, Special Interest\n[\"It's a race against winter for men who make their living off the land - hunting, fishing and trapping to put food on the table. For Mountain Men, survival is predicated on using ancient skills perfected over hundreds of years. HISTORY follows the lives of four American men and their families as<NL>they strive for the sustenance they need to make it through the harshest season.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Arabia', 'Mason Gertz', 'Randy Wimberg', 'Andrew Weed', 'Trevor Campbell'], 'Producers': ['Marc Pierce', 'Chris Richardson', 'Bridger Pierce', 'Dawn Fitzgerald', 'Lee Robinson']}\nA series that shows real people learning to survive in the wilderness of Alaska and other remote parts of the world. entertaining and you can learn a few tricks if you're planning to live a life like them in the boonies.\nReal Life survival\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Russell Morash', 'David B. Atwood', 'Russell Fortier', 'David Griffiths'], 'Producers': ['Russell Morash', 'Ruth Lockwood'], 'Starring': ['Julia Child'], 'Studio': ['PBS']}\nJulia Child basically started all of these cooling show series and this series tell you why she's the pioneer of TV cooking. She made cooking on TV cool and when no one else is doing it. Now there's a TON of these shows which is not really entertaining but reality shows existing only for the ratings. ANY idiot with a frying pan on one hand and a spatula on the other can participate on any cooking show and call themselves chef. Any guy cooking tacos in a taco truck is a chef i suppose...\nJulia Child\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryan Singer'], 'Producers': ['Gilbert Adler', 'Christopher McQuarrie', 'Bryan Singer', 'Ken Kamins', 'Chris Lee', 'John Ottman', 'Dwight C. Schar', 'Mark Shapiro', 'Daniel M. Snyder'], 'Starring': ['Tom Cruise', 'Kenneth Branagh', 'Bill Nighy'], 'Studio': ['MGM - Film']}\nGreat historical drama. You can only imagine if Lt.Colonel Clause Von Stauffenberg would have succeeded in killing Adolf Hitler if he placed the suit case bomb in the right place where Hitler was sitting in the wolfs lair THEN history could have been made very different and a lot of people could have lived longer and a lot less blood shed. Stauffenberg was a hero on all of this because he knew that Hitler was the beginning and the end of the coming world war when no one else has the sense of learning it and he died trying to prove it to the world. And in the end he was proven correct and if only he succeeded.... (sigh)\nYou need to watch this and learn from History\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nThis dude's funny! XD\nWatch  this if you needed a good laugh! XD\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Neale'], 'Producers': ['Mark Neale', 'Susan Cooper', 'Paul Taublieb', 'Stacy Transou'], 'Starring': [\"Jorg' Lorenzo\", 'Ewan McGregor', 'Valentino Rossi'], 'Studio': ['Media X International', 'Inc.']}\nThis is what real motorcycle is all about and it doesn't get more real than this! This Documentary movie let's you in on what goes on inside the world of the fastest motorcycles man has ever built: These machines weighs a lit over 300 LBS. But has  an average horsepower of about 200 HP machines and these motorcycles goes to the speeds in excess of 210 MPH! It also let's you in on how does a person compete and on what he goes through to get himself ready for it...the passion the dramas the rivalries of his fellow riders goes elbow to elbow with him on every corners chicanes at more than a 100 MPH their motorcycles are so low on the ground that they're dragging their knees to gauge their angle of attack to feel it! Just about anyone could ride a motorcycle at some certain speeds but not an excess of 200 MPH! To me, this is plain nothing short of committing suicide and i TOO ride a motorcycle but not close as these guys! You may call it brave or just plain Insane or Crazy but these guys are for real and besides not everyone has the kind of talent that these guys possess. This is a MUST WATCH for guys and gals who are adrenaline junkies and wants to know on what goes on in the world of MotoGP racing and I highly recommend this to race fans of any kind as well....\nMotorcycles hitting 210 MPH...you need to see this!\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nigel Paterson', 'Jasper James'], 'Producers': ['BBC'], 'Starring': ['Kenneth Branagh', 'Stockard Channing', 'Larry Agenbroad']}\nThis documentary movie is about what happened in the last 200,00 years ago when the saber toothed tiger + other prehistoric beasts were still existing right after the great mass dinosaur mass extinction. It lets peek on what happened after the great meteor that wiped out everything and what kinds of mammals and other creatures started to come out of the wood works globally. I have other documentary movies about post extinction dinosaur stuff and they're quite better...this is OK but I had better\n200,00 year old prehistoric beast and why they went extinct...\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Nick Park'], 'Starring': ['Peter Sallis'], 'Studio': ['Aardman Animations']}\nI had always loved this British clay-mation stop & go movie series! This series defines on what British comedy is about and I love their sense of humor! This series is also creative enough that it really doesn't matter if your'e old or young because you'll understand the plots and punchlines of this series. It's also very clean and NO elements of anything derogatory or any sexual innuendos knowing that the proper British has their hands on this and theme is very traditional British. You'll love Wallace on how mellow and typical British he is...all he really eats in this series is nothing but cheese and crackers (Really typical British!) and he washes it down with tea. Grommit is one of those very intelligent dogs that doesn't say much because everything that he wants to say, you can tell it by his facial expressions just like a pantomime or even a Mime himself. The series involves both of them their adventures & misadventures and Grommit is always saving Wallace butt because of his zany ideas. Wallace is one of those absent minded geniuses that needs guidance  I would recommend this to anyone who like clean comedy...\nYou're going to love watching this series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graham Townsley'], 'Starring': ['Lance Lewan'], 'Studio': ['PBS']}\nA great documentary series about how we as human beings evolved from an ape like creature 5 million years ago and how we ended up being Homo Sapien or &#34;the thinking man&#34; and how we developed into  becoming the top predator on the face of this earth. It also shows how the scientist, paleontologist and human anthropologist came to understand on how and why we ended the way we are to day. they also figured out when and what place where everything started and where we're going as human beings and what we're evolving into. This is a very fascinating series if you like need to know scientific prof about things that includes us. I have been always fascinated about human evolution since I was a young kid. You need to see this series and I HIGHLY recommend this!\nYou'll figure out where we all came from if you watch this series!",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to have a strong preference for engaging narratives, particularly in documentary formats that delve into human evolution and societal issues. Their recent appreciation for light-hearted, clean comedy suggests a growing versatility in their viewing habits, balancing serious themes with humor.\n\n- **Rating Trends:** The user's average rating is now 4.7, supported by a recent 5.0 rating for a documentary series on human evolution. This reflects their high standards and openness to diverse storytelling, including educational content that reinforces their fascination with scientific exploration.\n\n- **Communication Style:** They favor transparency and authenticity, demanding well-researched material that prompts thoughtful discussions. Their engagement with both comedic and documentary content indicates an interest in narratives that offer entertainment alongside deeper insights.\n\n- **Language & Accessibility:** Preference for English audio and subtitles remains unchanged, with continued frustrations over limited subtitle offerings, emphasizing their commitment to accessible content.\n\n- **Content Advisory:** The user enjoys realistic storytelling with mature themes while now embracing clean humor. Their long-standing fascination with human evolution highlights their appreciation for scientifically grounded narratives.\n\n- **Engagement with Creators:** They seek credible creators with expertise, gravitating towards content that merges entertainment with intellectual engagement.\n\nOverall, the user seeks intellectually stimulating content that balances educational value with enjoyable and entertaining themes, reinforcing their evolving interests in storytelling.",
  "metrics": {
    "rouge1_f": 0.10191082802547771,
    "rouge2_f": 0.006376195536663125,
    "rougeL_f": 0.04883227176220808,
    "meteor": 0.0345772376580845,
    "bleu1": 0.0003227443438558853,
    "bleu2": 7.340652898150394e-05,
    "bleu3": 1.2177454242500707e-05,
    "bleu4": 4.964307465140525e-06,
    "bertscore_precision": 0.3516771197319031,
    "bertscore_recall": 0.4716061055660248,
    "bertscore_f1": 0.40290650725364685
  }
}