{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Moliere\nReview Date: 2015/06/18\nStore: Romain Duris  (Actor),     Fabrice Luchini  (Actor),     Laurent Tirard  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Bubbling with wit, stellar performances and lavish cinematography, MOLIÈRE stars multi-Cesar(r)-nominated French actor Romain Duris as Molière, a down-and-out actor-cum-playwright up to his ears in debt. When the wealthy Jourdain (Cesar(r)-winner Fabrice Luchini) offers to cover that debt (so that Molière's theatrical talents might help Jourdain win the heart of a certain widowed marquise), hilarity ensues. Disguised as a priest, Molière becomes a guest in Jourdain's palace on the pretext of teaching Jourdain the craft of the stage, which annoys his wife, Elmire. But, soon after, the confrontation between Elmire and Molière turns seductive. Too busy to notice, Jourdain enlists the aid of a well connected and scheming acquaintance, to help him pursue the young widow. Romantic yearning, human foibles and laughs galore all characterize MOLIÈRE, a delightful film that slyly captures your heart.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Contributor': 'Wild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain DurisWild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain Duris  See more', 'Language': 'Unqualified, French (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'CTR21465DVD', 'Director': 'Laurent Tirard', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'January 22, 2008', 'Actors': 'Romain Duris, Fabrice Luchini, Laura Morante, Edouard Baer, Ludivine Sagnier', 'Subtitles': 'English, Spanish', 'Producers': 'Marc Missonnier, Olivier Delbosc', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: best movie since Shakespeare in Love but with a more authentic feel and better performances. Also my mother loves it and what Mom loves must be perfect. If you have a Mother (who loves Moliere) than you will know why this is the second copy of the film I bought since I fear - er I mean Mom wants to borrow mine all the time....\nReview Title: Awesome Movie for Moms.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Hit Movies']}\nWhen my Blu-Ray Disc from netflix wouldn't play I turned to streaming and grabbed this movie. The stream ran without any real buffering and I was happy with bitrate, picture and sound.<br />The movie itself, is enjoyable with good plot points and action<br />There are several plot holes and continuity errors- pretty standard for action movies and Tom Cruise's performance is not as good as it could be.<br />The script is tight but does not grab your emotions very firmly. The supporting cast is really what makes up for any lack you feel in the tug of the plot or main character.<br />Overall I enjoyed it. Not enough to want to own it or even watch it again unless it was on TV and the choice came down to it and Duck Dynasty.\nBetter than I expected\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Constantine Makris', 'Matt Earl Beesley', 'Jamie Babbit', 'Ed Bianchi', 'Stephen Hopkins'], 'Producers': ['Bob DeLaurentis', \"Peter O'Fallon\", 'Noah Hawley'], 'Studio': ['ABC Network']}\nI had my doubts, but I loved the cast pretty much from the get go. The show has smart dialogue and crazy &#34;night court&#34; plot twists. The surprise of the show is while you are looking for humor and actionb you are getting emotion from the acting and situations. It's not melodrama as much as you start to care for the characters even the ones who have despicable pasts. I would highly recommend this show if you like The Glades, or The Finder\nthis is a fresh show filled with smart humor\nInkheart (+ BD-Live) [Blu-ray]\nBrendan Fraser  (Actor),     Paul Bettany  (Actor),     Iain Softley  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Inkheart (Blu-ray)', 'When Mo Folchart reads a story, the characters leap off the page. Literally. And that’s a problem. Mo must somehow use his special powers to send the interlopers back to their world…and save ours. If ever a task was easier read than done, this is it. Mo and his daughter Meggie, aided by friends real and fictional, plunge into a thrilling quest that pits them against diabolical villains, fantastic beasts and dangers at every turn. Brendan Fraser (The Mummy films, Journey to the Center of the Earth) leads a splendid cast (including Academy Award winners* Helen Mirren and Jim Broadbent) in an all-fun, all-family film of Cornelia Funke’s bestseller. Follow Mo and Meggie into adventure more exciting than any ever read. Because it’s adventure they’re going to live!', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Contributor': 'Rafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna GuilloryRafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna Guillory  See more', 'Language': 'German (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '6.7 x 5.3 x 0.5 inches; 3.2 Ounces', 'Director': 'Iain Softley', 'Media Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Run time': '1 hour and 46 minutes', 'Release date': 'June 23, 2009', 'Actors': 'Brendan Fraser, Paul Bettany, Helen Mirren, Jim Broadbent, Andy Serkis', 'Dubbed': 'English, German', 'Subtitles': 'English, Spanish, German', 'Studio': 'New Line Home Entertainment', 'Number of discs': '1'}\nI watched this movie with some trepidation since Brandon Frazier has not had good reviews in a long time. What I got was a good cohesive story with enough mystery that if it had been a book I would have continued turning the pages until I learned all of its secrets. There were some scenes that just went to fast and I felt like there could have been more there. The Blu-ray has lots of features that make this worth owning, the menus are exquisite and painstakingly down, superb work.\nA real surprise\nMoliere\nRomain Duris  (Actor),     Fabrice Luchini  (Actor),     Laurent Tirard  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Bubbling with wit, stellar performances and lavish cinematography, MOLIÈRE stars multi-Cesar(r)-nominated French actor Romain Duris as Molière, a down-and-out actor-cum-playwright up to his ears in debt. When the wealthy Jourdain (Cesar(r)-winner Fabrice Luchini) offers to cover that debt (so that Molière's theatrical talents might help Jourdain win the heart of a certain widowed marquise), hilarity ensues. Disguised as a priest, Molière becomes a guest in Jourdain's palace on the pretext of teaching Jourdain the craft of the stage, which annoys his wife, Elmire. But, soon after, the confrontation between Elmire and Molière turns seductive. Too busy to notice, Jourdain enlists the aid of a well connected and scheming acquaintance, to help him pursue the young widow. Romantic yearning, human foibles and laughs galore all characterize MOLIÈRE, a delightful film that slyly captures your heart.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Contributor': 'Wild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain DurisWild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain Duris  See more', 'Language': 'Unqualified, French (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'CTR21465DVD', 'Director': 'Laurent Tirard', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'January 22, 2008', 'Actors': 'Romain Duris, Fabrice Luchini, Laura Morante, Edouard Baer, Ludivine Sagnier', 'Subtitles': 'English, Spanish', 'Producers': 'Marc Missonnier, Olivier Delbosc', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nbest movie since Shakespeare in Love but with a more authentic feel and better performances. Also my mother loves it and what Mom loves must be perfect. If you have a Mother (who loves Moliere) than you will know why this is the second copy of the film I bought since I fear - er I mean Mom wants to borrow mine all the time....\nAwesome Movie for Moms.",
  "profile": "**User Profile Summary:**\n\n- **Media Consumption Preference:** Enjoys streaming movies and shows, particularly in the action genre, with a growing appreciation for films that blend humor with emotional depth and feature compelling character-driven narratives. Recent interactions reveal an affinity for comedies that possess a unique charm and authenticity.\n\n- **Content Sensitivity:** The user favors mature themes, including moderate violence and mild language, maintaining a preference for sophisticated viewing experiences. They are open to complex plot developments and appreciate emotional situations even within lighthearted contexts.\n\n- **Performance Evaluation:** Values strong performances from both lead and supporting actors, with a notable emphasis on well-crafted dialogue and character arcs. Recent reviews indicate a tendency to recognize and celebrate stellar acting and emotional resonance.\n\n- **Engagement Level:** While selective about physical ownership, the user expresses a preference for content with substantial replay value. Their enjoyment of films that families can appreciate, particularly those that resonate with shared experiences, has become more evident.\n\n- **Overall Satisfaction:** Maintains a positive experience with media consumption, placing high importance on production quality and narrative coherence. Their evolving interests suggest a readiness to explore diverse genres, particularly those combining humor with deeper themes.\n\n**Trend Indicators:** \n- An increasing inclination towards comedies that resonate with personal connections, alongside a sustained focus on narrative complexity and character development in various formats.",
  "metrics": {
    "rouge1_f": 0.15214180206794684,
    "rouge2_f": 0.008875739644970414,
    "rougeL_f": 0.06351550960118169,
    "meteor": 0.04587779514714878,
    "bleu1": 0.003059026926962192,
    "bleu2": 0.000743265855905347,
    "bleu3": 0.0001186149753384576,
    "bleu4": 4.7427772255947e-05,
    "bertscore_precision": 0.3458501100540161,
    "bertscore_recall": 0.4729785621166229,
    "bertscore_f1": 0.3995455503463745
  }
}