{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/12/18\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['John Dahl'], 'Starring': ['Hugh Dancy', 'Mads Mikkelsen', 'Caroline Dhavernas'], 'Studio': ['Lionsgate']}\nReview Text: Hannibal is the Best!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Inception (Blu-ray)\nLeonardo DiCaprio  (Actor),     Ken Watanabe  (Actor),     Christopher Nolan  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Acclaimed filmmaker Christopher Nolan directs an international cast in this sci-fi actioner that travels around the globe and into the world of dreams. Dom Cobb (Leonardo DiCaprio) is the best there is at extraction: stealing valuable secrets inside the subconscious during the mind’s vulnerable dream state. His skill has made him a coveted player in industrial espionage but also has made him a fugitive and cost him dearly. Now he may get a second chance if he can do the impossible: inception, planting an idea rather than stealing one. If they succeed, Cobb and his team could pull off the perfect crime. But no planning or expertise can prepare them for a dangerous enemy that seems to predict their every move. An enemy only Cobb could have seen coming.', 'Review', \"In terms of sheer originality, ambition and achievement, Inception is the movie of the summer, the movie of the year and the movie of our dreams --Pete Hammond, Boxoffice MagazineAs engrossing and logic-resistant as the state of dreaming it seeks to replicate, Christopher Nolan's audacious new creation demands further study to fully absorb the multiple, simultaneous stories Nolan finagles into one narrative experience. --Lisa Schwarzbaum, Entertainment WeeklyThis is a deeply felt work of art in the form of a big, brassy movie-movie. --Shawn Levy, Portland Oregonian\"]\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, Widescreen, Subtitled, DTS Surround Sound', 'Contributor': 'Marion Cotillard, Christopher Nolan, Leonardo DiCaprio, Michael Caine, Ken Watanabe, Joseph Gordon-Levitt, Ellen Page, Tom Hardy, Cillian Murphy, Tom BerengerMarion Cotillard, Christopher Nolan, Leonardo DiCaprio, Michael Caine, Ken Watanabe, Joseph Gordon-Levitt, Ellen Page, Tom Hardy, Cillian Murphy, Tom Berenger  See more', 'Language': 'French (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), Unqualified (DTS-HD Master Audio 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 28 minutes', 'Digital Copy Expiration Date': 'November 20, 2014', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.5 inches; 5.6 Ounces', 'Director': 'Christopher Nolan', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Widescreen, Subtitled, Blu-ray, DTS Surround Sound', 'Run time': '2 hours and 28 minutes', 'Release date': 'December 7, 2010', 'Actors': 'Leonardo DiCaprio, Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Ellen Page', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nGREAT MOVIE!\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['John Dahl'], 'Starring': ['Hugh Dancy', 'Mads Mikkelsen', 'Caroline Dhavernas'], 'Studio': ['Lionsgate']}\nHannibal is the Best!\nFive Stars",
  "profile": "**User Profile Summary:**\n\n- **Content Interest:** Strong preference for highly acclaimed films, particularly in the Science Fiction & Fantasy and Action & Adventure genres, with a growing interest in psychological thrillers.\n- **Director & Actor Favoritism:** Shows notable appreciation for works by Christopher Nolan and films featuring Leonardo DiCaprio. Recent engagement with films directed by John Dahl suggests an expanding taste in diverse narratives and styles.\n- **Review Engagement:** Engages deeply with movies, emphasizing creativity and storytelling, and expresses enthusiasm for original and ambitious cinematic experiences. The user actively participates by providing reviews that highlight their views, including praising engaging plotlines and artistic execution.\n- **Rating Behavior:** Tends to provide high ratings, consistently reflecting a strong appreciation for quality filmmaking and storytelling. The recent interaction included a maximum rating, underscoring their enthusiasm for captivating content.\n- **Media Format Preference:** Prefers Blu-ray format, indicating an interest in high-quality video and audio experiences.\n\nOverall, this user's profile reflects a passion for intellectually stimulating and artistically crafted films, favoring established directors and actors, while also showing an openness to exploring new narratives in related genres.",
  "metrics": {
    "rouge1_f": 0.21020092735703247,
    "rouge2_f": 0.027906976744186046,
    "rougeL_f": 0.080370942812983,
    "meteor": 0.07642512474760767,
    "bleu1": 0.04556864426837074,
    "bleu2": 0.014239110088886755,
    "bleu3": 0.006373202941731726,
    "bleu4": 0.002018406959957253,
    "bertscore_precision": 0.35455554723739624,
    "bertscore_recall": 0.43707597255706787,
    "bertscore_f1": 0.39151474833488464
  }
}