{
  "interaction_number": 16,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Magic Pill\nReview Date: 2018/05/15\nCategories: Documentary\nProduct Description: ['What if most of our modern diseases are really just symptoms of the same problem? The Magic Pill follows doctors, patients, scientists, chefs, farmers and journalists from around the globe who are combating illness through a paradigm shift in eating. And this simple change - embracing fat as our main fuel - is showing profound promise in improving the health of people, animals and the planet.']\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Nudity', 'violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Tate'], 'Producers': ['Pete Evans', 'Rob Tate', 'Colin Gara'], 'Starring': ['Pete Evans', 'Rob Tate', 'Nora Gedgaudas']}\nReview Text: Along with many, many, many people, we faithfully followed the AHA guideline diet, and low fat in everything.<br />What a bamboozle!<br /><br />What we ended up with was extra weight, and after YEARS of cutting out good foods to replace with low fat junk, we ended up with Type 2 diabetes as well. My husband was given medication to help his levels, and I was told I should try dietary first, and if it didn't change, then I'd be put on medication. (My dr tried to put me on insulin for Type 2, which I refused - there wasn't even a trial dietary change period before he wanted to do this. Nope!)<br /><br />So, both my husband and I did our research and chose to try a low carbohydrate high fat diet (LCHF).<br />What a change!<br /><br />We have both improved our bloodwork, not taking any diabetes medication and have lost weight.<br />My husband feels better than he has in years.<br /><br />The facts are that the AHA diet CREATES customers, not health.<br /><br />This documentary helps to explain what is going on in our bodies and why we NEED good fats in our diet. Our brains use fats to work every day (the low fat nonsense could explain why so much &#34;stoopit&#34; abounds these days!), and how we have been starving ourselves. This shows how we really do not need grains in our diet at all. Doctors encourage a bad diet (via the AHA) then prescribe pills to \"help\" when the AHA diet makes you feel even worse.<br /><br />While The film is a little slow at times, the information is a must-see for anyone dealing with blood glucose issues or metabolic syndrome.<br /><br />I also HIGHLY recommend viewing That Sugar Film [[ASIN:B010I4O6ZW That Sugar Film]], which FINALLY explains  clearly what our doctors have never been able to explain (how to lower triglycerides without medication, WHY triglycerides get high to begin with, and for myself, how I went from being hypoglycemic  for decades to suddenly flipping to the other side of that coin, Type 2 diabetic).  Since changing to LCHF diet, I have lost over 60 lbs without once counting a calorie.<br />But I DO read every label!<br /><br />It is past time to educate ourselves about HOW our bodies truly use what we eat, and most importantly, to READ THE LABELS on our foods.<br />It is amazing the pure garbage and massive amount of chemicals that the FDA allows food manufacturers to put into our foods.  Amazing, and disgusting. But the pharmaceutical industry is highly profitable, so they don't mind making more customers!<br /> :-(<br /><br />Please watch this one and &#34;That Sugar Film&#34;. If you struggle with your weight (excess), high blood sugar or been told you have metabolic syndrome, these two films will change your life. Literally.\nReview Title: You owe it to yourself to watch this if you take medication for diabetes or high cholesterol\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Standard Deviants School - Basic Math, Program 7 - Fraction Basics (Classroom Edition)\nStandard Deviants School  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n['The Standard Deviants set the groundwork for learning fractions. They cover fraction terms, common factors, and reducing fractions. Everything you need to start working with fractions!']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '7 minutes', 'Release date': 'July 15, 2004', 'Actors': 'Standard Deviants School', 'Studio': 'Cerebellum Corp', 'Number of discs': '1'}\nWell, I had heard that the Standard Deviants items had changed a lot after being purchased by<br />a new company.  This is apparently very true!<br /><br />NEVER, NEVER, NEVER pay the full price for one of these DVD's. By that, I mean if you pay over $10<br />total, you'll feel a little ripped off.<br /><br />Apparently, what the new owners have done is take their basic instruction and break it down into<br />infinitesimal sections in order to sell more DVD's.  If you think this will give your child a good<br />overview of fractions, you will be disappointed.<br /><br />The DVD itself was fine.  Mine had little lines across the bottom, but I suspect that might have been<br />because this was for a regular screen and I have a widescreen, but not sure.<br /><br />What is un-be-freakin-lievable is that this DVD is only SEVEN MINUTES long!  Yup - infomercials are longer.<br />What this DOES do is introduce the CONCEPT of fractions. It explains what a fraction is, what numerators<br />and denominators are, how to get a common denominator (but that isn't explained well, IMHO. As an adult, it was<br />easy, but if a kid was watching this, I am not so sure they would really get it). It also explained equivalent<br />fractions (as in, why 1/3, 2/6 and 4/12 are all basically the same fraction of 1/3). It shows via pie charts<br />which might help a child visualize hat they are talking about with a fraction.<br /><br />But, that is where the instruction ends. Abruptly.<br />It does not show how to multiply fractions, which was the \"fraction basic\" info that I was hoping for<br />when I purchased this DVD.<br /><br />All in all, this was disappointing. I'd bought 3 SD Math Basic DVD's, and really wasn't looking at the length.<br />NONE of the newer DVD's run very long, and are apparently broken into so many sub-sets of information that you'll<br />end up having to buy a lot of their DVD's (and they hope spending a lot of money) to get all the basic information.<br />This shows a real greedy side to the company, in my opinion. Just make a DVD about fractions, period.<br />Don't make me buy 2 or 3 of the DVD's to get good fraction information for a child who is having a rough<br />time with the fraction concept.<br /><br />This is better than nothing, but that's all. You could make your own pie charts at home just as effectively,<br />or use cookies laid out in a clock format, etc, something that kids can relate to. The only benefit to this short<br />DVD is that the kid can watch it any time s/he wants to without your being involved.<br />Don't pay full price for these, because it definitely isn't worth it.\nGreat for what it is...\nValentine's Day\nBradley Cooper  (Actor),     Jennifer Garner  (Actor),     Garry Marshall  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The starriest cast you may ever see sparkles in a hilarious and heartwarming romcom from the director of Pretty Woman and The Princess Diaries. Stories crisscross, collide and boomerang in this look at a day in the life of love. There\\'s a proposal. Flowers that didn\\'t get sent. A big fat secret that\\'s finally told. The \"I\\'ll show up and surprise him\" that ended up surprising her. Fights, kisses, wrong turns, right moves and more. Whether new to or through with love, you\\'ll fall in love with this 19-star, funny-side-up celebration of romance.', 'Amazon.com', \"For those in love with love--and even for those who think they're jaded and over it--\", \"Valentine's Day\", \"and its superb cast are the uplifting elixir that's called for. Director Garry Marshall must have called in every favor he had in Hollywood to line up this amazing cast. Much as Robert Altman does in his best films, Marshall follows intertwining and intersecting couples around Los Angeles as they hook up, break up, and act up as Valentine's Day--with all its intense expectations--looms. Bradley Cooper plays one half of a couple struggling to get back on track. Julia Roberts plays an army officer en route from Iraq (!) to visit a lover halfway around the world. Jennifer Garner is appealing as the girlfriend of a cad (Patrick Dempsey), who managed to overlook telling her he was married; will Garner's character go all\", 'Fatal Attraction', \"? Standouts include the always-charming Anne Hathaway, whose character supplements her income with a freelance gig that, shall we say, involves using multiple accents over the phone--much to the consternation of her beau, played by Topher Grace. Shirley MacLaine and Hector Elizondo play a long-married couple whose strong marriage may be rocked by an old and very inconvenient truth. And young stars Emma Roberts, Taylor Lautner, and Taylor Swift sparkle enough to draw in younger viewers. And if love doesn't always go as planned for these couples (and singles), it's Marshall's deftness as a director that keeps the scenes moving along crisply to the next lovers, or victims. Marshall seems to be aiming to achieve for Valentine's Day what Richard Curtis did for Christmas in\", 'Love Actually', '--and if he falls a little short, it\\'s not due to any lack of star power or onscreen dazzle. \"Love is the only shocking act left on the planet!\" exclaims Ashton Kutcher\\'s character. If so, viewers of', \"Valentine's Day\", 'can expect to be shocked--into a warm romance with this, yes, valentine to love. --', 'A.T. Hurley']\n{'Genre': 'Drama/Love & Romance, Comedy', 'Format': 'Color, Multiple Formats, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Taylor Swift, Jamie Foxx, Jessica Alba, Taylor Lautner, Julia Roberts, Anne Hathaway, Garry Marshall, Jessica Biel, Jennifer Garner, Bradley Cooper, Kathy BatesTaylor Swift, Jamie Foxx, Jessica Alba, Taylor Lautner, Julia Roberts, Anne Hathaway, Garry Marshall, Jessica Biel, Jennifer Garner, Bradley Cooper, Kathy Bates  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 5 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.25 x 5.75 x 0.25 inches; 2.4 Ounces', 'Item model number': 'NEWL1000117450DVD', 'Director': 'Garry Marshall', 'Media Format': 'Color, Multiple Formats, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'May 18, 2010', 'Actors': 'Bradley Cooper, Jennifer Garner, Taylor Swift, Jamie Foxx, Jessica Alba', 'Dubbed': 'French, Portuguese, Spanish', 'Studio': 'New Line Cinema', 'Number of discs': '1'}\nOkay, I HAD to see this movie.<br />Valentine's Day is my favorite holiday.<br />I love romantic comedies.<br />Then all the cast - geez, so many stars!<br /><br />But, the movie was a little boring, to be honest.<br />I liked it, and yes, I'd watch it again, but it doesn't have any<br />of the staying power (Ie - want to watch repeatedly) of movies like<br />\"Sleepless in Seattle\".  They could have done SO much more with the stories.<br />I would have loved to have the movie be longer and more interesting.<br /><br />If you can get it really cheaply, or collect movies with a certain star<br />in them, then go ahead.  Otherwise, wait for a sidewalk sale or penny sale!<br />Shame on the director for doing so little with so much!\nFor so many stars, it's a little slow\nHarry and the Hendersons\nDon Ameche  (Actor),     Orene Anderson  (Actor),     William Dear  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD\n['John Lithgow takes adventure to new heights in this big-laughs, big-hearted, big-footed comedy for the whole family! A chance car accident introduces the Hendersons to the real-life Bigfoot, who is anything but a ferocious monster and quickly becomes a true friend to the family. They\\'re soon in a race against the clock to return \"Harry\" to his natural environment before the authorities capture him. The fur will fly in this feel-good romp—an Oscar winner for Best Makeup—the whole family will enjoy again and again!Bonus Content:', 'Feature Commentary with Director William Dear', 'Feature Commentary with Director William Dear', 'Deleted Scenes', 'Deleted Scenes', 'Harry...Finding the Missing Link', 'Harry...Finding the Missing Link', 'Making of the Harry and the Hendersons', 'Making of the Harry and the Hendersons', 'Newswrap', 'Newswrap', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Harry & the Hendersons, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Blu-ray Movie, Comedy, Kids & Family/10-12 YearsHarry & the Hendersons, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Blu-ray Movie, Comedy, Kids & Family/10-12 Years   See more', 'Format': 'AC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special EditionAC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special Edition   See more', 'Contributor': 'Richard Arnold, Jacqueline Moscou, Lainie Kazan, Melinda Dillon, Kevin Peter Hall, Laura Kenny, David Suchet, Sean Morgan, John Lithgow, David Richards, William Dear, Margaret Langrick, M. Emmet Walsh, Peggy Platt, Don Ameche, Bill Ontiverous, Joshua Rudoy, Orene Anderson, David MacIntyre, Nick FlynnRichard Arnold, Jacqueline Moscou, Lainie Kazan, Melinda Dillon, Kevin Peter Hall, Laura Kenny, David Suchet, Sean Morgan, John Lithgow, David Richards, William Dear, Margaret Langrick, M. Emmet Walsh, Peggy Platt, Don Ameche, Bill Ontiverous, Joshua Rudoy, Oren…   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '25195003506', 'Director': 'William Dear', 'Media Format': 'AC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special Edition', 'Run time': '1 hour and 51 minutes', 'Release date': 'April 24, 2007', 'Actors': 'Don Ameche, Orene Anderson, Richard Arnold, Melinda Dillon, Nick Flynn', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat's not to love here?<br /><br />This is a funny movie about an average guy encountering Bigfoot.<br />Totally plausible, right?<br />I got this for my daughter, because she loves Bigfoot.<br /><br />It is full of laugh-out-loud moments, and belongs in everyone's comedy movie collection!\nDefinitely a good comedy movie\nOffice Space - Special Edition with Flair (Widescreen Edition)\nRon Livingston  (Actor),     Jennifer Aniston  (Actor),     Mike Judge  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Fully Loaded DVDs, Special Editions\n['Product Description', 'Unable to endure another mind-numbing day at Initech Corporation, cubicle slave Peter Gibbons gets fired up and decides to get fired. Direction: Mike Judge, Actors: Jennifer Aniston, John C. McGinley, Richard Riehle, Ron Livingston. Special Features: Out of the Office - An Office Space Retrospective with Mike Judge; Deleted Scenes. Widescreen, 1.85:1, 5.1 Surround, Language: English / Sub. English, Spanish Year: 1999 Runtime: 90 minutes.', 'Amazon.com', 'Stills from', 'Office Space', '(Click for larger image)']\n{'Genre': 'Comedy', 'Format': 'Dolby, Closed-captioned, Multiple Formats, Color, Special Edition, Dubbed, Subtitled, NTSC, WidescreenDolby, Closed-captioned, Multiple Formats, Color, Special Edition, Dubbed, Subtitled, NTSC, Widescreen  See more', 'Contributor': 'John C. McGinley, Ron Livingston, Mike Judge, Richard Riehle, Stephen Root, David Herman, Jennifer Aniston, Diedrich Bader, Gary Cole, Paul Willson, Alexandra Wentworth, Ajay Naidu, Joe BaysJohn C. McGinley, Ron Livingston, Mike Judge, Richard Riehle, Stephen Root, David Herman, Jennifer Aniston, Diedrich Bader, Gary Cole, Paul Willson, Alexandra Wentworth, Ajay Naidu, Joe Bays  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.08 Ounces', 'Item model number': 'MFR024543160892#VG', 'Director': 'Mike Judge', 'Media Format': 'Dolby, Closed-captioned, Multiple Formats, Color, Special Edition, Dubbed, Subtitled, NTSC, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'November 1, 2005', 'Actors': 'Ron Livingston, Jennifer Aniston, David Herman, Ajay Naidu, Diedrich Bader', 'Dubbed': 'English, French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Studios', 'Writers': 'Mike Judge', 'Country of Origin': 'USA', 'Number of discs': '1'}\nVery cute movie.  Of course, I find it even more entertaining, since we were living in Houston during the whole Enron/Arthur Andersen debacle. If you've ever worked in a cube farm situation for a faceless corporation, then you'll truly relate to and enjoy this movie.<br /><br />I had already seen it many, many times. We bought it because my daughter needed to see it for a class assignment, and no one had it playing.<br />I was surprised to see who was actually playing Milton!  I'll leave that for you to find out.<br /><br />Overall, funny movie, not too raunchy, and a fun way to spend a couple hours trying to not think about your own job.\nDefinitely worth watching. Completely relatable for all cube farm workers\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Pamela Fryman', 'Rob Greenberg', 'Michael J. Shea', 'Neil Patrick Harris'], 'Producers': ['Pamela Fryman', 'Carter Bays', 'Craig Thomas', 'Suzy Mamann-Greenberg', 'Stewart Halpern-Fingerhut', 'Chris Harris', 'Stephen Lloyd'], 'Starring': ['Josh Radnor', 'Jason Segel', 'Cobie Smulders'], 'Studio': ['CBS']}\nWhat's not to love?<br />THis was our first dip into the Amazon Prime video, and I loved being able to see all the episodes for no additional charges.\nIf you love the series, you'll love the Prime viewing too!\nHow I Met Your Mother: Season 5\nJason Segel  (Actor),     Neil Patrick Harris  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', '<!-- /* Font Definitions */ @font-face {font-family:\"Cambria Math\"; panose-1:2 4 5 3 5 4 6 3 2 4; mso-font-alt:\"Calisto MT\"; mso-font-charset:0; mso-generic-font-family:roman; mso-font-pitch:variable; mso-font-signature:-1610611985 1107304683 0 0 159 0;} @font-face {font-family:Calibri; panose-1:2 15 5 2 2 2 4 3 2 4; mso-font-alt:\"Arial Rounded MT Bold\"; mso-font-charset:0; mso-generic-font-family:swiss; mso-font-pitch:variable; mso-font-signature:-1610611985 1073750139 0 0 159 0;} /* Style Definitions */ p.MsoNormal, li.MsoNormal, div.MsoNormal {mso-style-unhide:no; mso-style-qformat:yes; mso-style-parent:\"\"; margin:0in; margin-bottom:.0001pt; mso-pagination:widow-orphan; font-size:12.0pt; font-family:\"Times New Roman\",\"serif\"; mso-fareast-font-family:Calibri; mso-fareast-theme-font:minor-latin;} .MsoChpDefault {mso-style-type:export-only; mso-default-props:yes; font-size:10.0pt; mso-ansi-font-size:10.0pt; mso-bidi-font-size:10.0pt;} @page Section1 {size:8.5in 11.0in; margin:1.0in 1.0in 1.0in 1.0in; mso-header-margin:.5in; mso-footer-margin:.5in; mso-paper-source:0;} div.Section1 {page:Section1;} -->', 'Suit up for the hilarious Season Five of', 'How I Met Your Mother,', 'the outrageous, Emmy-nominated hit starring Neil Patrick Harris, Jason Segel and Alyson Hannigan! \\xa0The show’s funniest season to date is loaded with hook-ups, break-ups, and the return of Slapsgiving— not to mention the hottest guest stars imaginable, including Jennifer Lopez, Carrie Underwood, and Rachel Bilson. \\xa0On the dating front, Barney and Robin take their relationship to the next level—before calling it off—and Ted meets the roommate of his future wife in this uproarious, modern-day love story told in reverse.', 'Amazon.com', 'How I Met Your Mother', 'excels in tossed-off bits of genius, from a saccharine book-on-tape read by Kenny Rogers to \"But, uhm\" to bagpipes to harmonizing with Will Shortz and Peter Bogdanovich. These little gems of comic absurdity perfectly complement the sitcom\\'s other great strength, which is clever, twisty storytelling--plots that fold back into themselves, unfold in flashbacks, or cross-reference previous episodes. This narrative inventiveness is hardly surprising, given that the premise of the entire series is that it\\'s being told by the future central character, Ted Mosby, to his two children, gradually revealing how he came to marry their mother.', 'By the fifth season, this premise is growing a little bit threadbare (particularly after some of the red herrings of the past two seasons), yet the show continues to hold abundant pleasures. The cast--Josh Radnor, Cobie Smulders, Alyson Hannigan, Jason Segel, and Neil Patrick Harris--have an effortless lock on their characters, allowing them to pull off some perilously goofy bits that, in less confident hands, could have foundered (a musical homage to wearing suits, for example). The writing is crisp and driven; this half-hour sitcom crams in more plot turns than your average hour-long drama. The fifth season is not good to start with--the humor is much, much stronger if you\\'ve grown to love these characters over the previous four seasons--but for everyone who\\'s been following Ted, Robin, Marshall, Lily, and Barney, it\\'s essential viewing. Some surprising moments of melancholy are completely earned and stand out from the typical sitcom overreaching for \"significance\"; these moments are successfully rooted in the characters, who become more real every season… yes, even Barney.', '--Bret Fetzer']\n{'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Contributor': 'Cobie Smulders, Josh Radnor, Neil Patrick Harris, Alyson Hannigan, Jason Segel', 'Language': 'English (Dolby Digital 5.1), French (Dolby Surround), Spanish (Dolby Surround), Unqualified', 'Runtime': '9 hours and 18 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.81 Ounces', 'Item model number': '7759426', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled, AC-3, Widescreen', 'Run time': '9 hours and 18 minutes', 'Release date': 'September 21, 2010', 'Actors': 'Jason Segel, Neil Patrick Harris, Josh Radnor, Alyson Hannigan, Cobie Smulders', 'Subtitles': 'French, Spanish, English', 'Studio': '20th Century Fox', 'Number of discs': '3'}\nLove it!  I have three seasons left to collect, but I'll get there.<br /><br />Thank you for quick shipment and discs are in good condition.<br />This is one of my favorite seasons as well - the episodes are interesting and fun.<br />Definitely on the must-have list for HIMYM fans.\nGreat season - must have for fans!\nElf (DVD)\nJon Favreau  (Director),     Leon Redbone  (Actor),     Will Ferrell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', \"This hilarious Christmas film tells the tale of a young orphan child who mistakenly crawls into Santa's bag of gifts on Christmas Eve and is transported back to the North Pole and raised as an elf. Years later Buddy learns he is not really an elf and goes on a journey to New York City to find his true identity.\", 'DVD Features:', 'Audio Commentary:', '2 commentaries with Will Ferrell & Director', 'DVD ROM Features', 'Deleted Scenes', 'Featurette:', 'Film school for kids Tag along with Will Ferrell How they made the North Pole Kids on Christmas and more!', 'Amazon.com', 'Elf', 'is genuinely good. Not just', 'Saturday Night Live', '-movie good, when the movie has some funny bits but is basically an insult to humanity;', 'Elf', 'is a smartly written, skillfully directed, and deftly acted story of a human being adopted by Christmas elves who returns to the human world to find his father. And because the writing, directing, and acting are all genuinely good,', 'Elf', 'is also genuinely funny. Will Ferrell, as Buddy the adopted elf, is hysterically sincere. James Caan, as his rediscovered father, executes his surly dumbfoundedness with perfect aplomb. Zooey Deschanel, as a department store worker with whom Buddy falls in love, is adorably sardonic. Director Jon Favreau (', 'Swingers', \") shepherds the movie through all the obligatory Christmas cliches and focuses on material that's sometimes subtle and consistently surprising. Frankly,\", 'Elf', 'feels miraculous. Also featuring Mary Steenburgen, Bob Newhart, Peter Dinklage, and Ed Asner as Santa Claus.', '--Bret Fetzer']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': 'NEWL7168DVD', 'Director': 'Jon Favreau', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 24, 2006', 'Actors': 'Leon Redbone, Will Ferrell, James Caan, Ray Harryhausen, Zooey Deschanel', 'Dubbed': 'Spanish', 'Subtitles': 'English, Korean, French, Thai, Portuguese, Spanish, Indonesian', 'Producers': 'Jon Berg, Toby Emmerich, Kent Alterman, Todd Komarnicki, Cale Boyter', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Studio': 'WarnerBrothers', 'Writers': 'David Berenbaum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhile I am not a huge Will Ferrel fan, I do love this movie.<br />It is a lot of fun to watch.  No one seems to run it until super late in the holiday season, so we finally bought it.<br /><br />I'd never heard of &#34;Infinifilm&#34; before, so wasn't sure what to expect.<br />Basically, after you watch the movie in regular mode first, you can watch it afterwards in &#34;Infinifilm&#34; mode.<br />There are popup links on the bottom of the screen which can be clicked on, which take you into more detail about certain aspects of the movie itself. We've been trying out a few of them, and they are fun for movie buffs or anyone interested in the behind-the-scenes information.<br /><br />The only thing that didn't make much sense about it was that we bought a brand new DVD, but the Infinifilm part refers to something being on &#34;Disc 2&#34;.  There was only ONE disc in the package. So, not sure what the scoop is on that one.<br /><br />I believe this is a fun addition to everyone's holiday viewing movie collection.  Good old fashioned holiday fun.<br />No worries about those who do not like the religious aspect - there is nothing mentioned in here on that one.<br />And the nice part about owning the movie is that you get to see the entire thing, instead of whatever scenes the tv stations have decided to show you. We have seen this movie several times on tv over the last few years, but with the DVD, we've seen quite a few smaller scenes that were never included in the tv versions.  (And one of my favorite parts that we've used at our house is the big cola belch, followed by &#34;did you hear that?&#34;  Haha!<br /><br />Fun for the family, nothing dirty, no visible nudity, just holiday entertainment.\nTwo thumbs up for a really fun holiday movie\nThat Sugar Film\nInternational, Documentary, Cerebral, Contemplative\n['Damon Gameau embarks on an experiment to document the effects of a high sugar diet on a healthy body.']\n{'Content advisory': ['Violence', 'alcohol use', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Samuel Goldwyn Films'], 'Producers': ['Samuel Goldwyn Films'], 'Starring': ['Damon Gameau']}\nIt doesn't take a rocket scientist to know that the better you can eat, the better you will feel.<br />Of course, broccoli is better for you than donuts, but ... donuts!<br />But sometimes, we need to know WHY, instead of just being told to put something down.<br /><br />I know a lot about nutrition and a lot about body processes. I am hypothyroid, and basically have had to learn everything I could medically to try to help myself, because doctors seem to blow off questions about thyroid function. I'm overweight, and have been told some of the most unbelievable whopper stories from doctors you would ever believe. I had one actually tell me that I just had &#34;elbow disease&#34;, saying my elbow bent to my mouth too often. Um, no.  My tiny mother in law could eat more food than I could hold in two days and still stay tiny. There were obviously other factors in play here, but no one ever had any real answers - just the standard &#34;eat better&#34; and &#34;exercise more&#34;.<br /><br />I also went on a low fat diet for about six months, and gained steadily the entire time, despite eating sparse plates of food, things like yogurt and grapes for lunches, etc. My dr blamed me, saying I HAD to be eating more than that. I wasn't! But heaven forbid we look deeper than the surface! And when I told him that I didn't feel good when I ate fruit, I was told that was complete nonsense, and that I was making things up just to go off my &#34;diet&#34;. To this day, fruit gives me a sugar rush that is very unpleasant!  I also don't like pies or cakes, but that's just me - I never liked them. But wave a cookie under my nose, and you have my attention!<br /><br />I also made changes myself simply because there was zero logic behind some of the &#34;medical breakthroughs&#34;, like not eating eggs and making an enemy out of butter. I just could not see how butter, made from all natural ingredients from a cow, could possibly be worse than the chemical cocktails whipped up, dyed yellow and sold as butter flavored margarine!  No freaking way. So, we ignored the medical release hype and ate real butter, eggs, meat (*gasp*), and did away with all low fat or diet drinks. Common sense tells you that if they remove the fat from a food, SOMETHING has to replace it so it doesn't fall apart or taste like cardboard. They DO replace the fat - with sugar!<br /><br />This movie goes WAY below the surface, and gives you a real experience with the world of sugar. We've long known that too much sugar could be bad for you. But other than cavities, WHY avoid it when it tastes so good? (And yes - I know many don't think it tastes good - you are missing the point, so please spare the arguments about bad tasting sweet stuff.)<br /><br />Damon walks us through the rapid and shocking changes our bodies experience when we give it the everyday diet of typical foods off the grocery store shelves. He doesn't eat candy, donuts or cake. He goes on a month long experience of eating what we normally put in our shopping carts under the guise of &#34;healthy&#34; food. Things like fruit juices, yogurts, health bars, chicken with teriyaki sauce, etc etc.<br /><br />Now, I am very aware that many foods load it with sugar to make the chemicals palatable. We became serious label readers after my husband took a year of culinary classes at an area college. That's when we started to realize the lab experiments being sold as food that loaded our grocery shelves.<br /><br />I was STUNNED by the amount of sugars hidden in our everyday foods on the shelf!  Reading labels changed the way we shopped, but we still were not feeling our best. Despite no longer buying some things like (dare I mention brands?) Hamburger Helper or Yoplait yogurt, which has so much sugar, you might as well have ice cream, we felt sluggish most of the time. We cooked more at home, choosing to control more of what we put into our bodies.<br /><br />But we still didn't feel our best. There HAD to be more to this, and while I had been trying to do some of my own research as to WHY my body acted like I was the enemy, and preferred to pack on weight instead of releasing it.<br /><br />Enter this movie.<br />Damon - THANK YOU!!<br /><br />Seeing what is taking place in our livers was a real eye-opener. Yes, we hear about diabetes (either type), triglycerides, cholesterol, etc etc, but the medical community often wants to give you a pill to control the symptoms, instead of explaining what is truly happening and helping you to fix it. After all, medication is highly profitable!<br /><br />I learned a LOT from this movie.  I have watched it twice, and will watch it several more times to get the information ingrained in my brain.<br />Damon is every personable and likeable, and the movie is well done - no yawn-worthy droning documentary-style fact recitation. He interacts with the viewers at every step in a very creative manner.<br /><br />I cannot recommend this film highly enough. I am making everyone in our house watch it at LEAST once, if not more.<br /><br />Our bodies are so adaptable to changes, and it was both a wow factor and encouraging how quickly things went downhill in his health, but also how quickly things went back to normal after returning to the sugar free foods he previously enjoyed.  Now, I don't have Damon's metabolism and mobility, but there are certainly things that I can incorporate into my daily life to begin the reversal of what could truly be called sugar poisoning with being too far off!<br /><br />Again - thank you Damon.<br />You did us all a great service!\nA MUST VIEW if you cycle through tired and energized, or experience lethargy that won't leave\nThe Perfect Holiday\nMorris Chestnut  (Actor),     Gabrielle Union  (Actor),     Lance Rivera  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Laughter, love and a just a hint of magic make for THE PERFECT HOLIDAY a fun-filled comedy romance starring Morris Chestnut, Gabrielle Union, Charlie Murphy, Katt Williams, Faizon Love, Terrence Howard and Queen Latifah. All Nancy Taylor (Union) wants for Christmas is to meet a nice man. So when her little girl shares Mommy's wish with smitten shopping mall Santa, Benjamin Armstrong (Chestnut), He does his best to make her dream come true in this delightful holiday treat the entire family will enjoy!\"]\n{'Genre': 'Family, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Rachel TRUE, Modi, Terrence Howard, Pedro Kim, Khail Bryant, Sandra Denton, Lance Rivera, Mike Elliott, Christopher Burns, David Anzuelo, Frank Bonsangue, Evelyn Taucher, Queen Latifah, Dylan Hartigan, Lisa Datz, John Bryant, Marvin Peart, Ira Hawkins, Victoria Pannell, Shakim Compere, Jeremy Gumbs, Charlie Murphy, Susan Barrett, Capital Arts Entertainment; Destination Films, Conor Carroll, Mary Narango, Maria Ford, Faizon Love, Malik Hammond, Brian Gilbert, Joseph Genier, Gabrielle Union, Paul Woodburn, Katt Williams, Reymond Wittman, Morris Chestnut, Rachel true, Amber Williams, Leifur B. Dagfinnsson, Jill Jones, Didi GruenwaldRachel TRUE, Modi, Terrence Howard, Pedro Kim, Khail Bryant, Sandra Denton, Lance Rivera, Mike Elliott, Christopher Burns, David Anzuelo, Frank Bonsangue, Evelyn Taucher, Queen Latifah, Dylan Hartigan, Lisa Datz, John Bryant, Marvin Peart, Ira Hawkins, Victoria Pannell,…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 0.71 Ounces', 'Item model number': '43396253568', 'Director': 'Lance Rivera', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 11, 2008', 'Actors': 'Morris Chestnut, Gabrielle Union, Faizon Love, Terrence Howard, Queen Latifah', 'Subtitles': 'English, French, Spanish', 'Producers': 'Marvin Peart, Mike Elliott, Queen Latifah, Shakim Compere, Leifur B. Dagfinnsson', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of my daughter's favorite movies.<br />She had already bought a copy before, but for some reason, it always hung at one spot. We tried to clean it, tried<br />to do the toothpaste thing, etc etc, but nothing fixed it.<br /><br />So, this was our second copy of those movie. It is one of those feel-good-happy-outcome holiday movies that you want to watch all year long.<br />It made me a Morris Chestnut fan as well.  You'll want to punch out the ex-spouse (played by Eddie Murphy's brother), but if you can get past the truly annoying performance by him (I hope it was good acting and he isn't like that in real life!  HAR!), the rest of the movie is a lot of fun.\nGood family movie for year round viewing, not just at Christmas\n{'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Grace'], 'Producers': ['John Woolley', 'Paul Kewley'], 'Starring': ['John Sparkes', 'Sean Connolly', 'Kate Harbour'], 'Studio': ['Amazon Studios']}\nThis is really a fun show.  This llama one is no exception.<br />I loved how he did the llamas as well.<br />Very clever, lots of fun, and family-friendly too!\nExcellent.  Family friendly fun.\nPitch Perfect 2\nComedy, Arts, Entertainment, and Culture, Charming, Feel-good\n[\"After a scandal threatens to derails their last year at Barden, the three-time defending champs worry that they've lost their harmony for good. With one chance left at redeeming their legacy, they must face off against the toughest competition on the planet: German supergroup Das Sound Machine and fight for their right to win at the World Championships of A Cappella.\"]\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Elizabeth Banks'], 'Producers': ['Elizabeth Banks', 'Max Handelman'], 'Starring': ['Anna Kendrick', 'Rebel Wilson', 'Anna Camp']}\nWe loved PP1, so much so we have probably watched it 30 times or more. (Yeah, not obsessive at all.)<br />This was just not as good as the first.  Somehow, people think Rebel Wilson is hilarious. We don't. There's too much of her,<br />not enough of the other girls. It felt very out of balance, much like some editor who had seen the parts for the 300th time decided certain parts of the story could easily be cut out. However, it left gaps in the storyline where we would have liked to have seen more, and way too much of things that were not necessary. (How did Boomer end up in the old man's a capella group that he used to make fun of?).<br /><br />Overall, worth watching once, but we won't be buying this one like we did the first PP.  Nowhere near the quality of the first one.\nThey couldn't quite make it to the level of PP1.  Sad.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Anne Fletcher', 'David Feeney', 'John Quaintance'], 'Producers': ['Dana Fox', 'Bruna Papandrea', 'Reese Witherspoon'], 'Starring': ['Richard T. Jones', 'Robert Kazinsky', 'John Carroll Lynch'], 'Studio': ['MGM']}\nIt looked funnier in the previews.  Lots of standard stuff here.  Reese Witherspoon seemed to channel Holly Hunter from &#34;Raising Arizona&#34;, right down to the accent.  It was cute enough to watch if it's free, but don't waste your money on this one.  Zzzzzzzzzzz\nMeh is the best I can give this one.\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Renaud'], 'Producers': ['Chris Meledandri', 'Janet Healy'], 'Starring': ['Louis C.K', 'Eric Stonestreet', 'Kevin Hart'], 'Studio': ['Universal Pictures']}\nWell, lots and lots of build-up on this movie for sure.  The previews looked adorable.<br />Glad we rented it first - the previews were almost all of the movie!<br /><br />Cute animation, cute characters, lazy script.  They could have done so much more with these characters.<br />As it is, this isn't one of those movies your family needs to own unless you have little ones (think elementary school), who will likely enjoy it a lot.<br />The jokes are mostly tired or cliché.  So basically, they invented new characters and spent their time and effort on animation, instead of a clever or funny storyline. I actually found myself dozing a couple times.  It was a yawn-fest for the most part.<br /><br />Since there will be others reading this who don't want to know the entire movie, I won't post spoilers. Wait - not much of any spoilers to provide!<br />If you've seen the various ads, like the cat kicking the food dish, the dog kicking a vase and papers off the table, and the bunny chewing a key, you've seen most of the funny parts of the movie. The only really good part of the movie is how two of the dogs who started out resenting each other learned to get along and like each other.<br /><br />So, unless you have little ones in your house, there's no real point in owning this one first. But that's my opinion and review. If you just like watching animated critters, you might want to own it. But take my advice and rent it first, then decide. Zero regrets on the rental, because it saved us an additional $14 to own the movie!<br />Seriously, the writers were lazy lazy lazy on this movie that could have been so much more!\n*yawwwwwnnnnnn*  WAKE UP!  The movie is still playing!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'Freema Agyeman', 'John Barrowman'], 'Studio': ['BBC America']}\nGreat season... what's not to love about the 10th Doctor and his beautiful and brilliant companion Martha?<br />Fun story lines, plenty of action, and David Tennant provides just the right amount of humor.<br />I plan to own this season so I can watch them whenever I want.\nCan't go wrong for Doctor Who fans\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Producers': ['Steven Moffat', 'Brian Minchin', 'Peter Bennet', 'Nikki Wilson'], 'Starring': ['Peter Capaldi', 'Pearl Mackie', 'Matt Lucas']}\nOkay.  I am a HUGE Doctor Who fan.<br />I came in on Doctor #10 and worked my way backwards while continuing to watch the current ones.<br /><br />This season is the WORST I've ever seen.<br />Nothing creative and new. No exciting monsters.  The closest it comes is the &#34;puddle girl&#34;.<br /><br />I watch SciFi for entertainment and Doctor Who has never failed to provide that, until this season.<br />It seems like the writers are on vacation, so the social media people wrote the series. Tiresome to have<br />the current agendas and &#34;hot topics&#34; shoved in my face every episode. Not what I tune in for. Much like I don't<br />want to hear any actor/actress telling me how to vote, I don't like Doctor Who trying to push an agenda on<br />me via &#34;Bill&#34;.  Perhaps if the writing had been really good, it would not have been as annoying. But when the<br />character's only focus is her sexual preference, hard pass.<br /><br />The only show this season that reminded me of the older Doctor Who's was the 11th episode.<br />Made me really want to tune in for #12, the season finale.<br />I won't put in any spoilers here for those who have not yet seen it. But I WILL say that there were<br />so many commercials this time, even my husband, a non-Whovian, asked what the heck the deal was<br />on this episode!  Too little story I guess.<br /><br />Overall, will be very glad to see Bill disappear. She brought nothing to the table really. Lots of looking<br />dumbfounded and staring, and plenty of comments about her sexual prefs, like anyone cares. I don't<br />recall any other character being so obsessed with their own selves!  Spare the agendas please!<br /><br />Hoping this year's Christmas episode is good. Crossing my fingers.<br />But if they have this season's writers, well, better buy a lottery ticket instead.\nWhat a lousy season!  Too many agendas, not enough storyline.\nThe Magic Pill\nDocumentary\n['What if most of our modern diseases are really just symptoms of the same problem? The Magic Pill follows doctors, patients, scientists, chefs, farmers and journalists from around the globe who are combating illness through a paradigm shift in eating. And this simple change - embracing fat as our main fuel - is showing profound promise in improving the health of people, animals and the planet.']\n{'Content advisory': ['Nudity', 'violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Tate'], 'Producers': ['Pete Evans', 'Rob Tate', 'Colin Gara'], 'Starring': ['Pete Evans', 'Rob Tate', 'Nora Gedgaudas']}\nAlong with many, many, many people, we faithfully followed the AHA guideline diet, and low fat in everything.<br />What a bamboozle!<br /><br />What we ended up with was extra weight, and after YEARS of cutting out good foods to replace with low fat junk, we ended up with Type 2 diabetes as well. My husband was given medication to help his levels, and I was told I should try dietary first, and if it didn't change, then I'd be put on medication. (My dr tried to put me on insulin for Type 2, which I refused - there wasn't even a trial dietary change period before he wanted to do this. Nope!)<br /><br />So, both my husband and I did our research and chose to try a low carbohydrate high fat diet (LCHF).<br />What a change!<br /><br />We have both improved our bloodwork, not taking any diabetes medication and have lost weight.<br />My husband feels better than he has in years.<br /><br />The facts are that the AHA diet CREATES customers, not health.<br /><br />This documentary helps to explain what is going on in our bodies and why we NEED good fats in our diet. Our brains use fats to work every day (the low fat nonsense could explain why so much &#34;stoopit&#34; abounds these days!), and how we have been starving ourselves. This shows how we really do not need grains in our diet at all. Doctors encourage a bad diet (via the AHA) then prescribe pills to \"help\" when the AHA diet makes you feel even worse.<br /><br />While The film is a little slow at times, the information is a must-see for anyone dealing with blood glucose issues or metabolic syndrome.<br /><br />I also HIGHLY recommend viewing That Sugar Film [[ASIN:B010I4O6ZW That Sugar Film]], which FINALLY explains  clearly what our doctors have never been able to explain (how to lower triglycerides without medication, WHY triglycerides get high to begin with, and for myself, how I went from being hypoglycemic  for decades to suddenly flipping to the other side of that coin, Type 2 diabetic).  Since changing to LCHF diet, I have lost over 60 lbs without once counting a calorie.<br />But I DO read every label!<br /><br />It is past time to educate ourselves about HOW our bodies truly use what we eat, and most importantly, to READ THE LABELS on our foods.<br />It is amazing the pure garbage and massive amount of chemicals that the FDA allows food manufacturers to put into our foods.  Amazing, and disgusting. But the pharmaceutical industry is highly profitable, so they don't mind making more customers!<br /> :-(<br /><br />Please watch this one and &#34;That Sugar Film&#34;. If you struggle with your weight (excess), high blood sugar or been told you have metabolic syndrome, these two films will change your life. Literally.\nYou owe it to yourself to watch this if you take medication for diabetes or high cholesterol",
  "profile": "**User Summary:**\n\n- **Educational Focus:** The user values comprehensive educational resources that clarify concepts for children struggling with subjects like fractions. They favor innovative tools that enhance learning experiences and depth in educational materials.\n\n- **Value-Conscious:** Price sensitivity is a priority, with a preference for subscription or bundled access to content, avoiding full-priced items due to concerns over commercial exploitation in education and entertainment.\n\n- **Expectation Management:** They consistently seek thorough explanations and high-quality content, expressing disappointment with superficial products and upholding high standards for educational resources.\n\n- **Skeptical of Edutainment:** They maintain a critical view of fragmented educational content, advocating for holistic, engaging materials that provide complete learning experiences.\n\n- **Health Awareness:** Driven by a strong inclination towards understanding nutrition and health, the user actively seeks media that challenges conventional dietary wisdom. They have successfully adopted dietary changes to improve their health, reflecting a discerning approach to information on nutrition.\n\n- **Entertainment Preferences:** While they enjoy clever, family-friendly shows with relatable narratives, they are critical of lazy scripts and clichés. Their recent discontent with a series highlights their desire for creativity and original storytelling, emphasizing depth and substantive writing over social agendas.\n\n- **Recent Insights:** Their latest detailed review praises a documentary for its informative content on health diets, reinforcing their commitment to evidence-based approaches and thorough explanations.",
  "metrics": {
    "rouge1_f": 0.03734439834024896,
    "rouge2_f": 0.004150453955901427,
    "rougeL_f": 0.020228215767634856,
    "meteor": 0.010221900421653392,
    "bleu1": 1.0689842135143639e-16,
    "bleu2": 3.260796903641767e-17,
    "bleu3": 9.118394126849654e-18,
    "bleu4": 2.7139817415698938e-18,
    "bertscore_precision": 0.3386537432670593,
    "bertscore_recall": 0.513870894908905,
    "bertscore_f1": 0.4082563519477844
  }
}