{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Harry and the Hendersons\nReview Date: 2014/07/14\nStore: Don Ameche  (Actor),     Orene Anderson  (Actor),     William Dear  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['John Lithgow takes adventure to new heights in this big-laughs, big-hearted, big-footed comedy for the whole family! A chance car accident introduces the Hendersons to the real-life Bigfoot, who is anything but a ferocious monster and quickly becomes a true friend to the family. They\\'re soon in a race against the clock to return \"Harry\" to his natural environment before the authorities capture him. The fur will fly in this feel-good romp—an Oscar winner for Best Makeup—the whole family will enjoy again and again!Bonus Content:', 'Feature Commentary with Director William Dear', 'Feature Commentary with Director William Dear', 'Deleted Scenes', 'Deleted Scenes', 'Harry...Finding the Missing Link', 'Harry...Finding the Missing Link', 'Making of the Harry and the Hendersons', 'Making of the Harry and the Hendersons', 'Newswrap', 'Newswrap', 'Theatrical Trailer', 'Theatrical Trailer']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Harry & the Hendersons, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Blu-ray Movie, Comedy, Kids & Family/10-12 YearsHarry & the Hendersons, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Blu-ray Movie, Comedy, Kids & Family/10-12 Years   See more', 'Format': 'AC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special EditionAC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special Edition   See more', 'Contributor': 'Richard Arnold, Jacqueline Moscou, Lainie Kazan, Melinda Dillon, Kevin Peter Hall, Laura Kenny, David Suchet, Sean Morgan, John Lithgow, David Richards, William Dear, Margaret Langrick, M. Emmet Walsh, Peggy Platt, Don Ameche, Bill Ontiverous, Joshua Rudoy, Orene Anderson, David MacIntyre, Nick FlynnRichard Arnold, Jacqueline Moscou, Lainie Kazan, Melinda Dillon, Kevin Peter Hall, Laura Kenny, David Suchet, Sean Morgan, John Lithgow, David Richards, William Dear, Margaret Langrick, M. Emmet Walsh, Peggy Platt, Don Ameche, Bill Ontiverous, Joshua Rudoy, Oren…   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '25195003506', 'Director': 'William Dear', 'Media Format': 'AC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special Edition', 'Run time': '1 hour and 51 minutes', 'Release date': 'April 24, 2007', 'Actors': 'Don Ameche, Orene Anderson, Richard Arnold, Melinda Dillon, Nick Flynn', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: What's not to love here?<br /><br />This is a funny movie about an average guy encountering Bigfoot.<br />Totally plausible, right?<br />I got this for my daughter, because she loves Bigfoot.<br /><br />It is full of laugh-out-loud moments, and belongs in everyone's comedy movie collection!\nReview Title: Definitely a good comedy movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Standard Deviants School - Basic Math, Program 7 - Fraction Basics (Classroom Edition)\nStandard Deviants School  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n['The Standard Deviants set the groundwork for learning fractions. They cover fraction terms, common factors, and reducing fractions. Everything you need to start working with fractions!']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Media Format': 'NTSC, Multiple Formats, Color', 'Run time': '7 minutes', 'Release date': 'July 15, 2004', 'Actors': 'Standard Deviants School', 'Studio': 'Cerebellum Corp', 'Number of discs': '1'}\nWell, I had heard that the Standard Deviants items had changed a lot after being purchased by<br />a new company.  This is apparently very true!<br /><br />NEVER, NEVER, NEVER pay the full price for one of these DVD's. By that, I mean if you pay over $10<br />total, you'll feel a little ripped off.<br /><br />Apparently, what the new owners have done is take their basic instruction and break it down into<br />infinitesimal sections in order to sell more DVD's.  If you think this will give your child a good<br />overview of fractions, you will be disappointed.<br /><br />The DVD itself was fine.  Mine had little lines across the bottom, but I suspect that might have been<br />because this was for a regular screen and I have a widescreen, but not sure.<br /><br />What is un-be-freakin-lievable is that this DVD is only SEVEN MINUTES long!  Yup - infomercials are longer.<br />What this DOES do is introduce the CONCEPT of fractions. It explains what a fraction is, what numerators<br />and denominators are, how to get a common denominator (but that isn't explained well, IMHO. As an adult, it was<br />easy, but if a kid was watching this, I am not so sure they would really get it). It also explained equivalent<br />fractions (as in, why 1/3, 2/6 and 4/12 are all basically the same fraction of 1/3). It shows via pie charts<br />which might help a child visualize hat they are talking about with a fraction.<br /><br />But, that is where the instruction ends. Abruptly.<br />It does not show how to multiply fractions, which was the \"fraction basic\" info that I was hoping for<br />when I purchased this DVD.<br /><br />All in all, this was disappointing. I'd bought 3 SD Math Basic DVD's, and really wasn't looking at the length.<br />NONE of the newer DVD's run very long, and are apparently broken into so many sub-sets of information that you'll<br />end up having to buy a lot of their DVD's (and they hope spending a lot of money) to get all the basic information.<br />This shows a real greedy side to the company, in my opinion. Just make a DVD about fractions, period.<br />Don't make me buy 2 or 3 of the DVD's to get good fraction information for a child who is having a rough<br />time with the fraction concept.<br /><br />This is better than nothing, but that's all. You could make your own pie charts at home just as effectively,<br />or use cookies laid out in a clock format, etc, something that kids can relate to. The only benefit to this short<br />DVD is that the kid can watch it any time s/he wants to without your being involved.<br />Don't pay full price for these, because it definitely isn't worth it.\nGreat for what it is...\nValentine's Day\nBradley Cooper  (Actor),     Jennifer Garner  (Actor),     Garry Marshall  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The starriest cast you may ever see sparkles in a hilarious and heartwarming romcom from the director of Pretty Woman and The Princess Diaries. Stories crisscross, collide and boomerang in this look at a day in the life of love. There\\'s a proposal. Flowers that didn\\'t get sent. A big fat secret that\\'s finally told. The \"I\\'ll show up and surprise him\" that ended up surprising her. Fights, kisses, wrong turns, right moves and more. Whether new to or through with love, you\\'ll fall in love with this 19-star, funny-side-up celebration of romance.', 'Amazon.com', \"For those in love with love--and even for those who think they're jaded and over it--\", \"Valentine's Day\", \"and its superb cast are the uplifting elixir that's called for. Director Garry Marshall must have called in every favor he had in Hollywood to line up this amazing cast. Much as Robert Altman does in his best films, Marshall follows intertwining and intersecting couples around Los Angeles as they hook up, break up, and act up as Valentine's Day--with all its intense expectations--looms. Bradley Cooper plays one half of a couple struggling to get back on track. Julia Roberts plays an army officer en route from Iraq (!) to visit a lover halfway around the world. Jennifer Garner is appealing as the girlfriend of a cad (Patrick Dempsey), who managed to overlook telling her he was married; will Garner's character go all\", 'Fatal Attraction', \"? Standouts include the always-charming Anne Hathaway, whose character supplements her income with a freelance gig that, shall we say, involves using multiple accents over the phone--much to the consternation of her beau, played by Topher Grace. Shirley MacLaine and Hector Elizondo play a long-married couple whose strong marriage may be rocked by an old and very inconvenient truth. And young stars Emma Roberts, Taylor Lautner, and Taylor Swift sparkle enough to draw in younger viewers. And if love doesn't always go as planned for these couples (and singles), it's Marshall's deftness as a director that keeps the scenes moving along crisply to the next lovers, or victims. Marshall seems to be aiming to achieve for Valentine's Day what Richard Curtis did for Christmas in\", 'Love Actually', '--and if he falls a little short, it\\'s not due to any lack of star power or onscreen dazzle. \"Love is the only shocking act left on the planet!\" exclaims Ashton Kutcher\\'s character. If so, viewers of', \"Valentine's Day\", 'can expect to be shocked--into a warm romance with this, yes, valentine to love. --', 'A.T. Hurley']\n{'Genre': 'Drama/Love & Romance, Comedy', 'Format': 'Color, Multiple Formats, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Taylor Swift, Jamie Foxx, Jessica Alba, Taylor Lautner, Julia Roberts, Anne Hathaway, Garry Marshall, Jessica Biel, Jennifer Garner, Bradley Cooper, Kathy BatesTaylor Swift, Jamie Foxx, Jessica Alba, Taylor Lautner, Julia Roberts, Anne Hathaway, Garry Marshall, Jessica Biel, Jennifer Garner, Bradley Cooper, Kathy Bates  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 5 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.25 x 5.75 x 0.25 inches; 2.4 Ounces', 'Item model number': 'NEWL1000117450DVD', 'Director': 'Garry Marshall', 'Media Format': 'Color, Multiple Formats, AC-3, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'May 18, 2010', 'Actors': 'Bradley Cooper, Jennifer Garner, Taylor Swift, Jamie Foxx, Jessica Alba', 'Dubbed': 'French, Portuguese, Spanish', 'Studio': 'New Line Cinema', 'Number of discs': '1'}\nOkay, I HAD to see this movie.<br />Valentine's Day is my favorite holiday.<br />I love romantic comedies.<br />Then all the cast - geez, so many stars!<br /><br />But, the movie was a little boring, to be honest.<br />I liked it, and yes, I'd watch it again, but it doesn't have any<br />of the staying power (Ie - want to watch repeatedly) of movies like<br />\"Sleepless in Seattle\".  They could have done SO much more with the stories.<br />I would have loved to have the movie be longer and more interesting.<br /><br />If you can get it really cheaply, or collect movies with a certain star<br />in them, then go ahead.  Otherwise, wait for a sidewalk sale or penny sale!<br />Shame on the director for doing so little with so much!\nFor so many stars, it's a little slow\nHarry and the Hendersons\nDon Ameche  (Actor),     Orene Anderson  (Actor),     William Dear  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD\n['John Lithgow takes adventure to new heights in this big-laughs, big-hearted, big-footed comedy for the whole family! A chance car accident introduces the Hendersons to the real-life Bigfoot, who is anything but a ferocious monster and quickly becomes a true friend to the family. They\\'re soon in a race against the clock to return \"Harry\" to his natural environment before the authorities capture him. The fur will fly in this feel-good romp—an Oscar winner for Best Makeup—the whole family will enjoy again and again!Bonus Content:', 'Feature Commentary with Director William Dear', 'Feature Commentary with Director William Dear', 'Deleted Scenes', 'Deleted Scenes', 'Harry...Finding the Missing Link', 'Harry...Finding the Missing Link', 'Making of the Harry and the Hendersons', 'Making of the Harry and the Hendersons', 'Newswrap', 'Newswrap', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Harry & the Hendersons, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Blu-ray Movie, Comedy, Kids & Family/10-12 YearsHarry & the Hendersons, Kids & Family/7-9 Years, Kids & Family, DVD Movie, Blu-ray Movie, Comedy, Kids & Family/10-12 Years   See more', 'Format': 'AC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special EditionAC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special Edition   See more', 'Contributor': 'Richard Arnold, Jacqueline Moscou, Lainie Kazan, Melinda Dillon, Kevin Peter Hall, Laura Kenny, David Suchet, Sean Morgan, John Lithgow, David Richards, William Dear, Margaret Langrick, M. Emmet Walsh, Peggy Platt, Don Ameche, Bill Ontiverous, Joshua Rudoy, Orene Anderson, David MacIntyre, Nick FlynnRichard Arnold, Jacqueline Moscou, Lainie Kazan, Melinda Dillon, Kevin Peter Hall, Laura Kenny, David Suchet, Sean Morgan, John Lithgow, David Richards, William Dear, Margaret Langrick, M. Emmet Walsh, Peggy Platt, Don Ameche, Bill Ontiverous, Joshua Rudoy, Oren…   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '25195003506', 'Director': 'William Dear', 'Media Format': 'AC-3, Multiple Formats, Color, Dolby, NTSC, Original recording remastered, Widescreen, Subtitled, Special Edition', 'Run time': '1 hour and 51 minutes', 'Release date': 'April 24, 2007', 'Actors': 'Don Ameche, Orene Anderson, Richard Arnold, Melinda Dillon, Nick Flynn', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat's not to love here?<br /><br />This is a funny movie about an average guy encountering Bigfoot.<br />Totally plausible, right?<br />I got this for my daughter, because she loves Bigfoot.<br /><br />It is full of laugh-out-loud moments, and belongs in everyone's comedy movie collection!\nDefinitely a good comedy movie",
  "profile": "**User Summary:**\n\n- **Educational Focus:** The user appreciates educational materials, particularly for teaching concepts like fractions in a clear and engaging manner.\n- **Value-Conscious:** They prioritize value, showing skepticism towards full-priced items and criticizing perceived commercial exploitation in product offerings.\n- **Expectation Management:** The user expects comprehensive coverage of topics and expresses disappointment when products fall short, especially for children struggling with subjects.\n- **Skeptical of Edutainment:** They critique the trend of breaking educational content into smaller, costly segments, favoring consolidated, thorough explanations over fragmented materials.\n- **Practical Learning Tools:** The user values innovative, hands-on methods for teaching complex concepts, seeking effective learning approaches beyond traditional resources.\n- **Mixed Reviews on Quality:** While acknowledging content quality, they critique brevity and depth, indicating a fair yet critical evaluation of educational products.\n- **Entertainment Preferences:** The user enjoys romantic comedies and comedies aimed at family audiences, preferring films that offer humor and relatable stories. They seek deeper, more engaging narratives and remain cautious about spending full price on entertainment, highlighting a consistent value-centric approach.\n\nRecently, they highlighted their enjoyment of entertaining films with memorable comedic elements, especially those that resonate with family themes, thus embracing both educational and enjoyable content in their life.",
  "metrics": {
    "rouge1_f": 0.08389585342333657,
    "rouge2_f": 0.003861003861003861,
    "rougeL_f": 0.04339440694310511,
    "meteor": 0.02975473077738386,
    "bleu1": 6.235532364607509e-05,
    "bleu2": 1.243256469477594e-05,
    "bleu3": 2.126426829070056e-06,
    "bleu4": 8.802526584433423e-07,
    "bertscore_precision": 0.3428536057472229,
    "bertscore_recall": 0.4718945026397705,
    "bertscore_f1": 0.397155225276947
  }
}