{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: reBROW - Best Eyebrow Thickener - Eyebrow Enhancing Serum & Conditioner For Longer, Thicker & Fuller Brows. Made in Los Angeles, CA With Advanced Peptide Molecule Technology.\nReview Date: 2016/01/03\nStore: reBROW\nAverage Rating: 3.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.1 x 0.8 x 0.8 inches; 0.8 Ounces', 'UPC': '794168070448 636045986988'}\nReview Text: My mother's eye brows are thinning and this thickener  was a magic!! She has naturally thin eyebrows and hasn't gotten into the whole eyebrow makeup trends, but she always wanted fuller brows for a while. She put this on her brows at night after cleansing and she could tell the difference after day 3. She has been using it for about two weeks now and her brows are fuller than ever!It looks like it will last a while, also. It's worth it for brows, unsure about lashes because she has naturally full, long lashes.I was provided this product at a reduced price to complete and post a factual review without compensation. Positive reviews are earned only through positive product attributes and performance.\nReview Title: Nicer eye brows\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Anti Aging Skin Care Serum for Men & Women From Uptown Cosmeceuticals Offers Spin Trap® Intelligent Antioxidant, Advanced Scientific Formula Promotes Younger Looking Face, 30mL\nUptown Cosmeceuticals\n{'Product Benefits': 'Anti-Aging', 'Scent': 'Aloe', 'Brand': 'Uptown Cosmeceuticals', 'Material Feature': 'Antioxidant', 'Unit Count': '1.0144 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.6 x 1.7 x 1.7 inches; 0.8 Ounces', 'UPC': '685987989205'}\nSince I received this serum with a great discount I shared this skin care product with my friend , so she could provide her opinion.<br />She used it for several day and that's what she found out:<br />1. Nice, presentable packaging and good design.<br />2. Very pleasant scent (citrus and spring flowers kind) very fresh<br />3. Hypoallergenic (she has EXTREMELY sensitive skin)<br />4. Her husband tried it and stated that is helped him with pores<br />  I could add to that that the package arrived very fast and even the full price with the discount is acceptable compare to other serums from the mall.\nQuality product for good price\nInstaNatural Cellulite Cream - With Caffeine & Retinol - Body Firming Solution & Tightening Lotion for Thigh Area, Buttocks & More - No Wrap Needed - Anti Cellulite Control Treatment - 4 OZ\nInstaNatural\n['Reduce Cellulite and Tighten Your Skin With our Retinol & Caffeine Firming Cream As time progresses, both men and women will experience puckering and dimpling of cellulite in the following areas: - Thighs - Stomachs - Hips - Arms - Chest Our Cellulite Cream is packed with antioxidants and moisturizing ingredients to help improve skin tone and texture: - Specialized REGU-SLIM formula that tones, tightens, and improves the skin - Moisturizes and hydrates skin - Contains Retinol, Caffeine, Jojoba Oil and Vitamin E for supreme nourishment With InstaNatural, rest assured you will receive the best customer care and highest-quality Cellulite Cream around. - Premium blend of natural ingredients - 4 oz jar gives you more value for less expense - Made in the USA - Cruelty-Free']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.2 x 3 x 3.2 inches; 6.4 Ounces', 'UPC': '616913954721 852661007238', 'Manufacturer': 'SETAF'}\nTo help this cream to work on my abdomen  I also purchased detox tea and a waist trainer. I drink my tea, which helps me to get rid of bloating, I apply my Cellulite Cream, let it absorb, then I Put on my t-shirt and put my waist trainer on top. The waist trainer helps to keep my abdomen warm and triggers the ingredients in a cream (caffeine, retinol, Vitamin C  as well as many other ingredients) to star working better. That is my personal suggestion and you can apply it for yourself. I also apply it on my neck 2x day as well.<br />I received this cream with a discount for trying, testing and reviewing\nVitamin C as well as many other ingredients) to star working better. That is my personal suggestion and you can ...\nPure Hyaluronic Acid Serum with Vitamin C for Face - Organic Anti Aging & Anti-Wrinkle Skin Treatment - Penetrates Deeply & Activates Collagen Production for a Younger, Firmer & Brighter Complexion\nDerma-nu Miracle Skin Remedies\n{'Skin Type': 'All', 'Product Benefits': 'Anti-Aging', 'Use for': 'Face', 'Scent': 'Aloe', 'Brand': 'Derma-nu Miracle Skin Remedies', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1 x 1 x 4 inches; 1.25 Ounces', 'UPC': '787421301854'}\nHyaluronic acid is awesome for your skin. If you don't believe me, then literally look it up. WebMD will state that it helps with joint disorders, eye surgeries, and healing wounds/burns and more.<br /><br />The big statement here really is that it's very effective for any sort of regenerative properties. The serum is a very good moisturizer, and don't let the word &#34;acid&#34; turn you off of it. It's actually found in high quantities in the skin of a baby, which everyone knows is incredibly soft.<br /><br />This product, applied to your face, will protect it from UV damage, improve elasticity, make your face feel softer, and properly moisturize it.<br /><br />I have ben using products by Derma- nu for a while and this is my second buy of this serum. Do proper research before you buy products that you're going to put on your face to be seen everyday. I did, and I found this reliable product. The greatest thing is that it works with almost every skin type be it oily, dry, or combination. This is terrific because my skin is very, very combination and while parts of my face are dry, some are a little more oily. This balanced everything out very nicely , that's why I am getting the second bottle of the same one.<br />As they stated  that &#34;This Formula Has Been Infused with Vitamin C + Vitamin E + Green Tea Extract For Their Superior Anti Aging Benefits&#34;. I used to make my own masks with vitamin E, green tea and many other ingredients but it just takes too much time to mix it yourself. I alternate this serum with Derma-nu other serum to balance it. My skin is visibly better now.<br /><br />If you're on the fence, just buy it anyway. It's not expensive for what it does, and if you don't like it just get your money back with the 100% guarantee. You probably won't just like it...you'll love it. I was given an opportunity to obtain this product to test and review.\nSecond bottle of this serum\nEyelash Growth Serum for Long Eyelashes From Uptown Cosmeceuticals Contains Stem Cell & Myristoyl Pentapeptide-17, Dermatologist Lab Tested Lash & Eyebrow Growth Formula, 4 Months Supply, 3.5ml\nUptown Cosmeceuticals\n{'Color': 'Multicolor', 'Brand': 'Uptown Cosmeceuticals', 'Skin Type': 'All', 'Package Type': 'Box', 'Unit Count': '1.00 Count', 'Package Dimensions': '5 x 3 x 0.7 inches; 0.35 Ounces', 'UPC': '685987989168', 'Manufacturer': 'RightChoiceMarket'}\nI already wrote a nice review about the product and the great customer service I received from Uptown. Be careful with the thin applicator because it might be runny and don't pock yourself in the eye! My Eye lushes got thicker but not longer yet. Takes time\nTakes time to be precise with your eylashes\nRetinol 2.5% Cream From Majestic Pure for Face and Eye Area Will Nourish Your Skin, Potent Anti Aging Formula Reduces Wrinkles, Stretch Marks & Redness, 50ml\nMAJESTIC PURE\n{'Brand': 'MAJESTIC PURE', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Use for': 'Face', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.3 x 2.9 x 2.4 inches; 5.6 Ounces', 'UPC': '784190666689 684758988935'}\nI got this product for my friend and that's what she wrote to me after trying it:<br />&#34;I've been using this for over 2 weeks now. My skin is soft, supple & hydrated, also appears plumper with fine lines much softer. My skin has a glow about it. I am also using a serum underneath this daily. Highly recommend Majestic Pure products & am using a number of them. Does not leave skin dry.&#34; She is in her 60th. I also suggested her to use sunscreen: after applying retinol your skin is more sensitive to sun. I received this cream discounted during promo period to test and review.\nMajestic is magical\nMererke_Pretty Nurtured Argan Oil (1.7oz)\nMererke_Pretty\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6 x 1.4 x 1.3 inches; 4 Ounces', 'UPC': '646437034531'}\nMy middle daughter has thicker hair, so I use this product on her. After she washes her hair she applies this serum. Her hair have 3 colors in them naturally, darker brown, lighter brown and red. When she applies this oil her classmates thought that she dyed her hair! It just bring so much shine and compliment her hair. After seeing that effect I applied it on my fine hair. I have highlights. It brings the different color in my hair as well. My co-workers thought that I just visited a hairdresser. So, I would suggest it for anyone. I do not use conditioner when I use the product. I received this serum discounted during promo period to test and review.\nThis serum compliments your hair color\nEye Diamond Smooth and Firm Eye Cream: 100% All-Natural Anti-Aging Eye Serum – Get Rid of Wrinkles – Eye Cream for Dark Circles and Puffiness, Crows Feet and Fine Lines – 100% Guarantee\n{'Skin Type': 'All', 'Product Benefits': 'Anti-Aging', 'Use for': 'Face', 'Scent': 'Aloe', 'Item Form': 'Cream', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.4 x 1.1 x 1.1 inches; 0.35 Ounces', 'UPC': '700461602026'}\nI love this product. I just turned 42 and started noticing some more changes in my skin texture and pore size. I've had this product for about 2 weeks and noticed a positive change in the appearance of my skin around my eyes within a week. I didn't experience any burning or stinging. I use two times/day.  My skin is sensitive and I find that some products don't work the same for me as others. However, this product to works great for me. I love it! My skin looks like it did five years ago. I am going to stick with this brand for a while. I purchased it discounted to test and review\nDiamond in the rough\nreBROW - Best Eyebrow Thickener - Eyebrow Enhancing Serum & Conditioner For Longer, Thicker & Fuller Brows. Made in Los Angeles, CA With Advanced Peptide Molecule Technology.\nreBROW\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.1 x 0.8 x 0.8 inches; 0.8 Ounces', 'UPC': '794168070448 636045986988'}\nMy mother's eye brows are thinning and this thickener  was a magic!! She has naturally thin eyebrows and hasn't gotten into the whole eyebrow makeup trends, but she always wanted fuller brows for a while. She put this on her brows at night after cleansing and she could tell the difference after day 3. She has been using it for about two weeks now and her brows are fuller than ever!It looks like it will last a while, also. It's worth it for brows, unsure about lashes because she has naturally full, long lashes.I was provided this product at a reduced price to complete and post a factual review without compensation. Positive reviews are earned only through positive product attributes and performance.\nNicer eye brows",
  "profile": "**User Profile Summary:**\n\n- **Skin Care Focus:** Strong emphasis on anti-aging and firming products for both men and women, alongside a growing interest in eyebrow enhancement solutions and holistic approaches to skin health.\n- **Recent Product Experience:** Recently purchased a brow thickener that significantly improved the thickness of a family member's eyebrows, reinforcing a commitment to effective enhancement treatments.\n- **Ingredients Preference:** Values beneficial ingredients like hyaluronic acid, antioxidants, and growth-promoting elements, maintaining a focus on potent formulas that enhance skin, hair, and brow health.\n- **Sensitivity Awareness:** Demonstrates high sensitivity awareness, successfully using products without irritation and prioritizing hypoallergenic properties.\n- **Aesthetic Sensibility:** Appreciates well-designed packaging and visually appealing products, enhancing the overall user experience across skincare and hair care.\n- **Fragrance Preference:** Prefers fresh and natural scents, contributing to a pleasant routine with beauty products.\n- **Social Influence:** Actively shares product experiences with friends and values collaborative input on beauty decisions.\n- **Value-Conscious Shopping:** Attracted to effective yet affordable options, often purchasing products at a discount to explore new solutions.\n- **Speed of Delivery:** Values quick shipping, indicating a preference for efficiency and timely access to skincare and hair care products.\n- **Holistic Approach:** Integrates various treatments into a broader wellness strategy, emphasizing a commitment to overall beauty and health, including brow care as a part of this philosophy.",
  "metrics": {
    "rouge1_f": 0.12800819252432155,
    "rouge2_f": 0.023577652485904665,
    "rougeL_f": 0.06349206349206349,
    "meteor": 0.04448144959539358,
    "bleu1": 0.000867999624366066,
    "bleu2": 0.0002919859583848266,
    "bleu3": 0.00010385778216704456,
    "bleu4": 5.212953069110405e-05,
    "bertscore_precision": 0.38598573207855225,
    "bertscore_recall": 0.5121734738349915,
    "bertscore_f1": 0.44021517038345337
  }
}