{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Folora 4pcs Premium 1 Inch Wide Solid Color Floral Plaid Headband Set for Women Girls, Blue-2\nReview Date: 2020/09/22\nStore: Folora\nAverage Rating: 4.0\nProduct Details: {'Material': 'Plastic', 'Brand': 'Folora', 'Unit Count': '4.00 Count', 'Product Dimensions': '4.72 x 0.98 x 5.51 inches; 2.26 Ounces', 'Item model number': 'FLR-HB-4pcs Blue-2'}\nReview Text: I like how these 4 all have different patterns yet the color unified them well. I have the blue set and it's quite pretty. The wider style of headband supposed to be more comfortable, but it seems still tight enough to hurt your head a bit after hours of weather. It does have inner layer to make it smoother and easier on your head when you wear it. I assume after a couple of times using/wearing, it should be easier and gets more comfortable.\nReview Title: Sturdy headband, colorful design for the sets\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nMOSTORY\n{'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nThis is a warm color eyebrow pencil, it glides out smoothly and very easy to apply. It feels more red than the picture of product, for someone with darker eyebrows like me might need to blend in with another dark color to make it natural. I like the weight of this pencil, it feels nice to grab in palm when using. The fine tip works well to fill in the blank and the powder adds natural final touch.\nSmooth eyebrow pencil with rich color\nSAMYANG ABOUTME Red Recipe Super Cleansing Balm 3.04 oz. (90ml) - Soft Melting Milk Texture Makeup Cleansing Balm, Mineral Contained Nourishing & Soothing Cleansing, Rose Scented\nSamyang\n{'Package Dimensions': '3.66 x 3.39 x 2.36 inches; 5.57 Ounces'}\nComes with a small spatula to scoop the product out and apply on the skin. Cleanses make-up well, just simply rub it on the spot and wash it off with water. The rosy fragrance is very pleasant and relaxing. Tested out with black eye-shadow and dark lipbalm and it took them right off with just a small amount applied to the skin.\nRose-like scent and cleanse like a magic\nFolora 4pcs Premium 1 Inch Wide Solid Color Floral Plaid Headband Set for Women Girls, Blue-2\nFolora\n{'Material': 'Plastic', 'Brand': 'Folora', 'Unit Count': '4.00 Count', 'Product Dimensions': '4.72 x 0.98 x 5.51 inches; 2.26 Ounces', 'Item model number': 'FLR-HB-4pcs Blue-2'}\nI like how these 4 all have different patterns yet the color unified them well. I have the blue set and it's quite pretty. The wider style of headband supposed to be more comfortable, but it seems still tight enough to hurt your head a bit after hours of weather. It does have inner layer to make it smoother and easier on your head when you wear it. I assume after a couple of times using/wearing, it should be easier and gets more comfortable.\nSturdy headband, colorful design for the sets",
  "profile": "**User Preferences Summary:**\n\n- **Product Type:** Strongly favors makeup products and has developed a new interest in makeup removers, emphasizing a desire for effective cleansing solutions. Recently expanded interest to include accessories like headbands, suggesting an appreciation for functional and stylish complementary products.\n- **Color Preference:** Prefers warm tones while seeking versatility for darker hair. Recent purchases reflect an enjoyment of colorful designs that maintain aesthetic appeal.\n- **Application Experience:** Values ease of use and smooth application across cosmetics, cleansing products, and accessories, indicating a preference for user-friendly formulations that enhance overall experience.\n- **Performance Features:** Maintains a robust preference for waterproof and long-lasting makeup. The interest in makeup removers highlights a focus on effective cleansing capabilities, paralleling the need for durability in accessories.\n- **Sensory Experience:** Enjoys products with pleasant sensory attributes, including relaxing fragrances and comfortable wear, showcasing an interest in overall usage experiences.\n- **Detail Orientation:** Focused on fine details in both application and cleansing processes, ensuring thoroughness with minimal effort, now extending to comfort and fit in accessories.\n- **Review Behavior:** Demonstrates a practical approach to product evaluation, rating based on effectiveness, utility, comfort, and sensory experience rather than brand loyalty. This thoughtful evaluation mirrors a comprehensive approach across all products, including accessories.\n\nOverall, the user exhibits a refined and holistic approach to beauty and personal care, seeking quality, functionality, comfort, and aesthetic pleasure in all products.",
  "metrics": {
    "rouge1_f": 0.23624595469255666,
    "rouge2_f": 0.00974025974025974,
    "rougeL_f": 0.11003236245954694,
    "meteor": 0.14007562992860997,
    "bleu1": 0.18746987947257235,
    "bleu2": 0.01916521635862221,
    "bleu3": 0.004164101283295214,
    "bleu4": 0.0019426133700801154,
    "bertscore_precision": 0.39918166399002075,
    "bertscore_recall": 0.44854018092155457,
    "bertscore_f1": 0.42242398858070374
  }
}