{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Finding Vivian Maier\nReview Date: 2015/03/11\nStore: Vivian Maier  (Actor),     John Maloof  (Director),     Charlie Siskel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Who is Vivian Maier? Now considered one of the 20th century's greatest street photographers, Vivian Maier was a mysterious nanny who secretly took over 100,000 photographs that went unseen during her lifetime. Since buying her work by chance at auction, amateur historian John Maloof has crusaded to put this prolific photographer in the history books. Maier's strange and riveting life and art are revealed through never-before-seen photographs, films, and interviews with dozens who thought they knew her.\"]\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '28929892', 'Director': 'John Maloof, Charlie Siskel', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 29, 2014', 'Actors': 'Vivian Maier', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: So interesting!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Precious [DVD]\nGabourey Sidibe  (Actor),     Mo'Nique  (Actor),     Lee Daniels  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Set in Harlem in 1987, it is the story of Claireece “Precious” Jones, a sixteen-year-old African-American girl born into a life no one would want. She’s pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, a poisonously angry woman who abuses her emotionally and physically. School is a place of chaos, and Precious has reached the ninth grade with good marks and an awful secret: she can neither read nor write. Precious may sometimes be down, but she is never out. Beneath her impassive expression is a watchful, curious young woman with an inchoate but unshakeable sense that other possibilities exist for her. Threatened with expulsion, Precious is offered the chance to transfer to an alternative school, Each One/Teach One. Precious doesn’t know the meaning of “alternative,” but her instincts tell her this is the chance she has been waiting for. In the literacy workshop taught by the patient yet firm Ms. Rain, Precious begins a journey that', 'Amazon.com', 'Not every movie can survive the kind of hype--multiple awards at Sundance and other festivals, rapturous reviews, nominated for six Academy Awards and winner of two, for Best Supporting Actress and Best Screenplay--that greeted the release of', 'Precious: Based on the Novel \"Push\" by Sapphire', \", but this extraordinary piece of work is more than up to the task. What's particularly notable about the film's success and acclaim is that in the beginning, at least, it presents one of the grimmest scenarios imaginable. The scene is Harlem, New York, in 1987. Teenager Clarisse Precious Jones (played by newcomer Gabourey Sibide in an absolutely fearless performance) is dirt poor, morbidly obese, semiliterate, and pregnant for the second time--both courtesy of her own father (the first baby was born with Down syndrome). Her home life is several levels below Hell, as her bitter, vengeful welfare mother, Mary (Mo'Nique, in a role that has generated legitimate Oscar® buzz), abuses her both physically and otherwise (telling Precious she should have aborted her is only the worst of a relentless flood of insults and vitriol). Yet somehow, the young woman still has hopes and dreams (depicted in a series of delightful fantasy sequences). She enrolls in an alternative school, where a young teacher (Paula Patton) takes her under her wing and even into her home, and visits a social worker (an excellent Mariah Carey; fellow pop star Lenny Kravitz is also effective as a male nurse) who further helps bring Precious out of the darkness. Incredibly, Precious's circumstances deteriorate even more before showing the slightest sign of improvement, and a climactic confrontation with her mother is one of the more wrenching scenes in recent memory. But against all odds, director Lee Daniels, screenwriter Geoffrey Fletcher (working from Sapphire's novel), and especially the wondrously affecting Sibide have managed to make\", 'Precious', 'a film that will lift the viewer far higher up that one might ever have thought possible.', '--Sam Graham']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Lee Daniels, Mo'Nique, Gabourey Sidibe\", 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT27239DVD', 'Director': 'Lee Daniels', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'March 9, 2010', 'Actors': \"Gabourey Sidibe, Mo'Nique\", 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA new perspective, thought-provoking!\nFive Stars\nDefinitely, Maybe (Widescreen)\nRyan Reynolds  (Actor),     Kevin Kline  (Actor),     Adam Brooks  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', \"From the makers of Notting Hill and Love Actually comes the charming and irresistibly funny romantic comedy Definitely, Maybe. When Will (Ryan Reynolds) decides to tell his daughter (Abigail Breslin) the story of how he met her mother, he discovers that a second look at the past might also give him a second chance at the future. Co-starring Elizabeth Banks, Rachel Weisz and Isla Fisher, it's the heartwarming story that makes you realize it's definitely never too late to go back…and maybe find a happy ending.Bonus Content:\", 'Deleted Scenes', 'Deleted Scenes', 'Creating a Romance: Brought to You by Volkswagen', 'Creating a Romance: Brought to You by Volkswagen', 'The Changing Times of Definitely, Maybe', 'The Changing Times of Definitely, Maybe', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Feature Commentary with Director Adam Brooks and Star Ryan Reynolds', 'Amazon.com', 'A romantic comedy that begins with a discussion about sex education and ends with a bit of an unexpected twist,', 'Definitely, Maybe', 'focuses on an engaging father and his 10-year-old daughter. She is curious about the women her dad loved prior to marrying (and separating from) her mother. Instead of telling her, \"None of your business,\" he decides to tell her about them... Sort of. Will is played by Ryan Reynolds and his precocious daughter Maya is adroitly portrayed by Abigail Breslin (', 'Little Miss Sunshine', '). Will figures out a way to tell Maya about his most meaningful relationships in a PG manner that also is interactive for her (Or as she describes it, \"a love story mystery!\"). Changing a few of their characteristics and disguising their names, Will tells her about three exceptional women and Maya tries to deduce which one became her mom. Was it Emily (Elizabeth Banks), the wholesome Midwestern girl afraid of the big city; Summer (Rachel Weisz), the exotic journalist; or April (Isla Fisher), the rebel with a cause? Hearing about all these women, Maya asks, \"What\\'s the boy word for slut?\" Spanning 15 years, back to when Will was an idealistic young man with the hopes of one day becoming president of the United States, the film has a nice light touch and deals with father-daughter bonding issues in a unique, if not completely realistic manner. Reynolds is a genial but bland leading man, but the women--including young Breslin--more than hold their own in this fun film. --', 'Jae-Ha Kim', 'Get to Know the Girlfriends From', 'Definitely, Maybe', 'Elizabeth Banks (Emily)', 'Isla Fisher (April)', 'Rachel Weisz (Summer)', 'Beyond', 'Definitely, Maybe', 'on DVD', 'More From Ryan Reynolds', 'Father Daughter Essentials', 'More Romantic Comedies', 'Stills from', 'Definitely, Maybe', '(Click for larger image)']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Abigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth BanksAbigail Breslin, Rachel Weisz, Ryan Reynolds, Adam Ferrara, Florian Ballhaus, Derek Luke, Adam Brooks, Clint Mansell, Annie Parisse, Isla Fisher, Kevin Kline, Elizabeth Banks  See more', 'Initial release date': '2008-06-24', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MHV61100526DVD', 'Director': 'Adam Brooks', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'June 24, 2008', 'Actors': 'Ryan Reynolds, Kevin Kline, Rachel Weisz, Elizabeth Banks, Isla Fisher', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nJust for fun...\nFive Stars\nStand and Deliver\nRamon Menendez  (Director, Writer),     Edward James Olmos  (Actor),     Lou Diamond Phillips  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Edward James Olmos's Oscar-nominated performance energizes this true-life story of a Los Angeles high school teacher who drives his students on to excellence at calculus.\"]\n{'Genre': 'Documentary/Biography', 'Format': 'Multiple Formats, Full Screen, NTSC', 'Contributor': 'Lou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia ParisLou Diamond Phillips, Edward James Olmos, Estelle Harris, Andy Garcia, Tom Musca, Mark Phelan, Lindsay Law, Rosana De Soto, Mark Eliot, Ramon Menendez, Virginia Paris  See more', 'Language': 'English (Mono), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.92 Ounces', 'Item model number': '157968', 'Director': 'Ramon Menendez', 'Media Format': 'Multiple Formats, Full Screen, NTSC', 'Run time': '1 hour and 43 minutes', 'Release date': 'June 8, 2010', 'Actors': 'Edward James Olmos, Lou Diamond Phillips, Rosana De Soto, Andy Garcia, Estelle Harris', 'Producers': 'Lindsay Law, Tom Musca', 'Studio': 'WarnerBrothers', 'Writers': 'Ramon Menendez, Tom Musca', 'Number of discs': '1'}\nI showed it to my Educational students in college...excellent!\nexcellent!\nFinding Vivian Maier\nVivian Maier  (Actor),     John Maloof  (Director),     Charlie Siskel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Who is Vivian Maier? Now considered one of the 20th century's greatest street photographers, Vivian Maier was a mysterious nanny who secretly took over 100,000 photographs that went unseen during her lifetime. Since buying her work by chance at auction, amateur historian John Maloof has crusaded to put this prolific photographer in the history books. Maier's strange and riveting life and art are revealed through never-before-seen photographs, films, and interviews with dozens who thought they knew her.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '28929892', 'Director': 'John Maloof, Charlie Siskel', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 29, 2014', 'Actors': 'Vivian Maier', 'Studio': 'IFC Independent Film', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSo interesting!\nFive Stars",
  "profile": "The user demonstrates a robust affinity for impactful and thought-provoking films, particularly those that explore complex social themes and highlight resilience in adversity, featuring diverse characters and underrepresented groups. Their high ratings reflect a strong appreciation for compelling narratives, emotional depth, and remarkable performances.\n\nRecently, the user has shown a broader openness to lighter genres, engaging with a romantic comedy that explores family dynamics and personal growth while maintaining their focus on emotional engagement and meaningful reflections on relationships. This indicates a willingness to embrace narratives that blend humor with heartfelt themes.\n\nTheir recent interaction with a documentary centered on a renowned street photographer emphasizes their ongoing interest in stories that reveal transformative personal journeys and artistic expression. The 5.0 rating given underscores their consistent valuing of well-crafted narratives across various genres.\n\nOverall, the user's profile illustrates a love for thought-provoking storytelling that stimulates critical reflection and dialogue, whether through serious dramas or lighter fare. Their engagement with diverse perspectives reflects a commitment to exploring different experiences, highlighting an evolving appreciation for narratives that resonate personally and emotionally.",
  "metrics": {
    "rouge1_f": 0.09436997319034852,
    "rouge2_f": 0.00966183574879227,
    "rougeL_f": 0.05361930294906166,
    "meteor": 0.028093195401042634,
    "bleu1": 6.719464750299204e-06,
    "bleu2": 2.2971861245067864e-06,
    "bleu3": 7.468401307729743e-07,
    "bleu4": 2.3977532179687326e-07,
    "bertscore_precision": 0.3097614049911499,
    "bertscore_recall": 0.46395811438560486,
    "bertscore_f1": 0.3714946210384369
  }
}