{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Talk of the Town\nReview Date: 2017/11/02\nStore: Cary Grant  (Actor),     Jean Arthur  (Actor),     George Stevens  (Director, Producer)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"When a charming fugitive, a beautiful teacher, and a stuffy lawyer are forced to become roommates, their unconventional relationship is suddenly THE TALK OF THE TOWN in this madcap romantic comedy. When accused arsonist Leopold Dilg (Cary Grant) escapes jail, he hides out in the home of friend Nora(Jean Arthur). Posing as a gardener, Dilg teams up with Nora to convince her summer tenant, SupremeCourt candidate Michael Lightcap (Ronald Colman, Lost Horizon) that Dilg was framed. The zaniness never stops as the three of them dodge the cops, try to snag the real crooks and discover along the way that both men have fallen for Nora. But who has captured Nora's heart? Find out with THE TALK OF THE TOWN, a sparkling gem from Hollywood's Golden Age of Comedy, nominated for seven Academy Awards(r)including Best Picture.\", 'Amazon.com', \"The screwball comedy was the definitive genre of the Depression, but as America edged toward war in the early '40s, it suffered some strange and wonderful mutations--none stranger than\", 'The Talk of the Town', \", directed by George Stevens from a script by novelist Irwin Shaw and frequent Capra collaborator (and future blacklist victim) Sidney Buchman. Cary Grant, awkwardly cast, is a small-town political agitator who is framed for the burning of a local factory; he takes refuge in the attic of a country cottage that landlady Jean Arthur is preparing to rent out to a celebrated law professor (silver-tongued Ronald Colman, perhaps the only actor in Hollywood who could make Grant look like a proletarian). Stevens, suspended between his light '30s style (\", 'Swing Time', ') and his heavy postwar manner (', 'A Place in the Sun', \"), struggles to balance a charming, surprisingly suspenseful romantic triangle with the heavy, debating-society tone of the screenplay, which pits Grant, the representative of a compassionate, emotional sense of justice, against the cool, abstract application of the law advocated by Colman. Caught between these two highly verbal characters, Jean Arthur doesn't have much to do but be adorable and provide the occasional quizzical reaction shot--two things she does with exquisite skill. Stevens and Arthur teamed up again one year later for another strange-bedfellows farce, the marvelous\", 'The More the Merrier', \"; in 1953 Arthur made her final film appearance in Stevens's\", 'Shane', '.', '--Dave Kehr']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Black & White, Full Screen, NTSC, Subtitled', 'Contributor': 'Ronald Colman, Columbia Pictures Corporation, George Stevens, Cary Grant, Jean Arthur, Glenda Farrell, Edgar Buchanan, Charles DingleRonald Colman, Columbia Pictures Corporation, George Stevens, Cary Grant, Jean Arthur, Glenda Farrell, Edgar Buchanan, Charles Dingle  See more', 'Language': 'English, Unqualified', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 4 Ounces', 'Item model number': '2226600', 'Director': 'George Stevens', 'Media Format': 'Multiple Formats, Black & White, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 57 minutes', 'Release date': 'February 25, 2003', 'Actors': 'Cary Grant, Jean Arthur, Ronald Colman, Edgar Buchanan, Glenda Farrell', 'Subtitles': 'English, French, Japanese, Georgian', 'Producers': 'George Stevens', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I enjoyed this movie when I rented it that I ended up purchasing the DVD.  A good movie for any film buff to add to their collection.  Cary Grant in a fun yet interesting movie.  What can I say...it had me at Cary Grant!  And Ronald Coleman is great in his role.\nReview Title: Definitely a must have for Cary Grant fans\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "One Special Night / Christmas Clause / Chrirtmas in Clouds\nRated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Romantic\n['Includes the films One Special Night, The Christmas Clause and Christmas In The Clouds.']\n{'Genre': 'Kids & Family', 'Format': 'DVD', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 4 Ounces', 'Item model number': 'GDTV58556DVD', 'Media Format': 'DVD', 'Release date': 'August 14, 2012', 'Studio': 'Gaiam Americas'}\nI got this as it had &#34;one special night&#34; on it.  I remembered it from tv a while back.  Still good as when first seen.  How nice to get two additional movies.  A great value for 3 for the price of one!\nOne truly special bargain\nThe Ghost and Mrs. Muir\nGene Tierney  (Actor),     Rex Harrison  (Actor),     Joseph L. Mankiewicz  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Dubbed, Full Screen, NTSC, Subtitled, Black & White, Closed-captioned', 'Contributor': 'Victoria Horne, Gene Tierney, Philip Dunne, Helen Freeman, George Sanders, Isobel Elsom, Edna Best, Stuart Holmes, Rex Harrison, Vanessa Brown, Robert Coote, Natalie Wood, Anna Lee, Joseph L. Mankiewicz, R.A. DickVictoria Horne, Gene Tierney, Philip Dunne, Helen Freeman, George Sanders, Isobel Elsom, Edna Best, Stuart Holmes, Rex Harrison, Vanessa Brown, Robert Coote, Natalie Wood, Anna Lee, Joseph L. Mankiewicz, R.A. Dick   See more', 'Language': 'English, French', 'Runtime': '1 hour and 44 minutes'}\nGreat quality for a film of this vintage.  It satisfies that hopeless romantic in me.  An enjoyable film for all ages.\nA ghost tale well worth watching!\nConnie And Carla\nNia Vardalos  (Actor),     Toni Collette  (Actor),     Michael Lembeck  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['From the writer and star of My Big Fat Greek Wedding comes Connie and Carla, the hilarious new comedy the Chicago Sun-Times calls \"a total delight!\" Best friends Connie and Carla have always dreamed of fame and fortune, but their careers in show business are going nowhere fast. After witnessing a crime, they are forced to go on the run and keep their true identities secret. The dazzling duo stumble on an ingenious way to let their many talents shine. Now with a little luck–and lots of beauty products–they\\'re going straight to the top, with plenty of side-splitting twists and turns along the way! Connie and Carla is an irresistible comedy-adventure filled with fun and loaded with laughter!Bonus Content:', 'Deleted Scenes', 'Deleted Scenes', 'Bonus Musical Scenes', 'Bonus Musical Scenes', 'Outtakes', 'Outtakes', 'The Making of Connie and Carla', 'The Making of Connie and Carla', 'Dressing in Drag', 'Dressing in Drag', 'Debbie Reynolds', 'Debbie Reynolds']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Michael Lembeck', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, DTS Surround Sound, Dubbed, DVD, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 17, 2004', 'Actors': 'Nia Vardalos, Toni Collette, David Duchovny, Debbie Reynolds', 'Dubbed': 'French', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), English (DTS 5.1), Unqualified', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '1'}\nHilarious film and decent casting make for a delightful romp.  Good viewing quality as well.\nFunny, funny, funny film!\nA Christmas Carol\nAlastair Sim  (Actor),     Hermione Baddely  (Actor),     Brian Desmond Hurst  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Alastair Sim\\'s tour-de-force performance as the ultimate miser, Ebenezer Scrooge, has almost single-handedly made this beloved version of Charles Dickens\\' story into one of the best-loved Christmas films of all time. Some of Britain\\'s best filmmakers united behind Sim, who was joined by a delightful cast of accomplished and acclaimed English actors; creating what many today believe to be the best and most faithful production of Dickens\\' immortal tale. Cranky and curmudgeonly Scrooge learns the error of his unkind ways and is taught the true meaning of the holidays when he is visited by the ghost of his late business partner and the spirits of Christmas past, present and future. Special Features: Commentaries by Marcus Hearn and George Cole; Introduction by Leonard Maltin; \"Dead to Begin With: The Darker Side of A Classic\"- Explores the movies bleaker themes and how they rivaled London of the 1950\\'s - features film historian and culturalist Sir Christopher Frayling; \"Scrooge by Another Name: Distributing \\'A Christmas Carol\\'\" - Details the American release of this British holiday classic as told by distributor Richard Gordon; \"The Human Blarney Stone: Life and Times of Brian Desmond Hurst\"; \"The Alastair Sim Version: Too Good To Be Shown Only At Christmastime - video narrative by Fred Guida, author of \\'A Christmas Carol and It\\'s Adaptations\\'; and A collection of early silent versions of Dickens on film.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '25752733', 'Director': 'Brian Desmond Hurst', 'Media Format': 'Multiple Formats, AC-3, Dolby, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Alastair Sim, Hermione Baddely, Kathleen Harrison, Mervyn Johns, George Cole', 'Subtitles': 'English, Spanish', 'Studio': 'Vci Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWonderful quality for a dated film.  This Christmas Carol film is not to be missed.  It is one of, if not the best of Christmas Carol movies made.\nA classic for the whole family!!!!\nSix Days, Seven Nights\nHarrison Ford  (Actor),     Anne Heche  (Actor),     Ivan Reitman  (Director),     Michael Chapman  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"Big-screen favorite Harrison Ford stars in this nonstop adventure hit about a dream vacation that turns into a hilarious tropical nightmare! A gruff, rough-hewn cargo pilot living in the islands, Quinn Harris (Ford) hates tourists ... though he's not above making a fast buck from a sharp-tongued New Yorker, Robin Monroe (sexy Anne Heche -- VOLCANO, WAG THE DOG), when she's desperate for a quick flight to Tahiti! But this already uneasy relationship suddenly takes a nosedive when his weather-beaten old plane is forced down in a storm! Now, stranded together on a deserted isle, Quinn and Robin quickly discover all the perils of paradise. As this mismatched pair find themselves facing danger at every turn, you're sure to find their misfortunes fueling one of Hollywood's most entertaining action-comedy hits in years!\", 'Amazon.com', 'The African Queen', 'meets', 'Swept Away', 'in this sometimes labored romantic comedy by director Ivan Reitman. Fortunately, he cast an old pro in Harrison Ford, as Quinn Harris, a South Seas charter pilot who must ferry New York fashion editor Robin Monroe (Anne Heche) from one island to another--a hop that falls flat when they fly into a mammoth storm that causes them to crash on a deserted island. The pair resent and resist each other, until they are forced to team up to escape from the island--and some modern pirates who want their heads. If that part of the story is unconvincing, you can always focus on the smoldering comic chemistry between Heche, who displays strong comic instincts, and the ever-reliable Ford. The script is just an excuse for these two flinty characters to strike increasingly romantic sparks off each other, which is always enjoyable to watch.', '--Marshall Fine']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'MFR717951000866#VG', 'Director': 'Ivan Reitman, Michael Chapman', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 42 minutes', 'Release date': 'December 8, 1998', 'Actors': 'Harrison Ford, Anne Heche, David Schwimmer, Jacqueline Obradors, Temuera Morrison', 'Dubbed': 'French', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Michael Browning', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGood quality in viewing playback.  Also a good value for the money.\nFun movie at a good cost.\nMusic and Lyrics\nHugh Grant  (Actor),     Drew Barrymore  (Actor),     Marc Lawrence  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Music and Lyrics (DVD) (WS)', \"Hugh Grant and Drew Barrymore star as washed-up '80s pop star with a chance for a comeback and his quirky plant lady with a knack for lyrics. Alex Fletcher has been reduced to working the nostalgia circuit at county fairs & amusement parks. The charismatic & talented musician gets a chance at a comeback when reigning pop diva Cora Corman (Haley Bennett) invites him to write & record a duet with her, but there's a problem--Alex hasn't written a song in years; he's never written lyrics and he has to come up with a hit in a matter of days. Enter Sophie Fisher, Alex's beguilingly plant lady, whose flair for words strikes a chord with the struggling songwriter. On the rebound from a bad relationship with the newly famous novelist Sloan Cates, Sophie is reluctant to collaborate with anyone, especially commitment-phobe Alex. Now, Alex and Sophie will have to face their fears--& the music--to find the love & success they both deserve.\", ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.2 Ounces', 'Item model number': 'MFR085391112822#VG', 'Director': 'Marc Lawrence', 'Media Format': 'Multiple Formats, Anamorphic, Subtitled, NTSC, Widescreen, Color', 'Run time': '1 hour and 44 minutes', 'Release date': 'January 8, 2008', 'Actors': 'Hugh Grant, Drew Barrymore, Brad Garrett, Kristen Johnston, Campbell Scott', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'Martin Shafer, Nancy Juvonen, Hal Gaba, Liz Glotzer, Bruce Berman', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Studio': 'WarnerBrothers', 'Writers': 'Marc Lawrence', 'Number of discs': '1'}\nThe disc doesn't work.  I get an alert that it can't be played.  Very disappointing!  But it will cost more to return than trash it so I will have to trash it.  Will NOT order from this place again.\nNot a playable disk\nThe Lady Vanishes [DVD]\nMargaret Lockwood  (Actor),     Michael Redgrave  (Actor),     Alfred Hitchcock  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['When a seemingly innocuous old woman disappears while on board a train, an acquaintance sets out to find her. What follows is a series of ingenious twists and turns finally steaming toward a suspenseful denouement.', 'Includes the trailer for Hitchcock\\x92s film \"Shadow Of A Doubt\".', 'Menus: English \\x95 Spanish \\x95 Chinese \\x95 Japanese Subtitles: Spanish \\x95 Chinese \\x95 Japanese', 'B&W/94 min.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Alfred Hitchcock', 'Media Format': 'DVD, Black & White, Special Edition, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'July 24, 1999', 'Actors': 'Margaret Lockwood, Michael Redgrave, Paul Lukas, Dame May Whitty, Cecil Parker', 'Subtitles': 'Spanish, Japanese, Chinese', 'Language': 'English (Dolby Digital 1.0)', 'Studio': 'Delta', 'Writers': 'Ethel Lina White, Frank Launder, Sidney Gilliat', 'Number of discs': '1'}\nGreat movie with fairly decent quality despite its age.  For old movie fans and Hitchcock fans alike.\nGreat addition to my Hitchcock collection\n5 Film Collection: Sandra Bullock (DVD)\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['5 Film Collection: Sandra Bullock (DVD)', ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, NTSC, Subtitled, Box set', 'Contributor': 'Various', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Subtitled, Box set', 'Release date': 'October 20, 2015', 'Actors': 'Various', 'Subtitles': 'Spanish, French', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nGood quality discs and a good value.\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English', 'English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['David Semel', 'Daniel Percival', 'Ken Olin', 'Michael Rymer', 'Bryan Spicer', 'Nelson Mccormick', 'Brad Anderson', 'Karyn Kusama', 'Michael Slovis'], 'Producers': ['Ridley Scott', 'David W. Zucker', 'Frank Spotnitz', 'Isa Dick Hackett', 'Christopher Tricarico', 'Stewart Mackinnon', 'Chrtistian Baute', 'Jace Richdale', 'Richard Heus', 'Dan Percival', 'Jordan Sheehan', 'Kalen Egan', 'Erin Smith'], 'Starring': ['Alexa Davalos', 'Rupert Evans', 'Luke Kleintank'], 'Studio': ['Amazon Studios']}\nYes, this is a work of fiction but it is an all to poingnent reminder of what could have been or may yet become reality.  It is strongly cast and I've actually rewatched season one as I awaited season two.  If you have overlooked this gem of a thought piece before don't miss it now.  It's a binge watch must!!!\nImpressive and even disconcerting in the time we currently live\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Dan Percival', 'Colin Bucksey', 'Dan Sackheim', 'David Petrarca', 'John Fawcett', 'Paul Holahan', 'Karyn Kusama', 'Alex Zakrzewski', 'Chris Long'], 'Producers': ['Ridley Scott', 'David W. Zucker', 'Frank Spotnitz', 'Isa Dick Hackett', 'Christopher Tricarico', 'Stewart Mackinnon', 'Chrtistian Baute', 'Jace Richdale', 'Richard Heus', 'Dan Percival', 'Jordan Sheehan', 'Kalen Egan', 'Erin Smith'], 'Starring': ['Dan Percival', 'Colin Bucksey', 'Dan Sackheim'], 'Studio': ['Amazon Studios']}\nThis season is even better than last.  It holds your interest and is well acted.  It keeps one mentally engaged with shifts between reality or imaginations of characters.\nA season to binge watch\nLove Affair - 1939\nComedy, Drama, Heartwarming, Passionate\n['Aboard ship on route to America French playboy Michael (Charles Boyer) meets Terry (Irene Dunne), as the voyage progresses they become friends and develop feelings for each other. On arrival in New York they agree to meet again in six months at the Empire State Building to see if Michael has become a more dependable man.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Moving Picture Archive'], 'Producers': ['Leo McCarey'], 'Starring': ['Charles Boyer', 'Irene Dunne']}\nI saw this movie recently and really enjoyed it.  I hadn't known or seen this movie before.  Thanks Amazon Prime.  If you love old movies you should see this one.  It is well acted and in some scenes much better than the Cary Grant remake.  Don't misunderstand, the Cary Grant version is a good movie and a tear jerker too.  Have your Kleenex ready!  Enjoy!\nThe original \"Affair to Remember\"\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['George Pollock'], 'Producers': ['George H. Brown'], 'Starring': ['Margaret Rutherford', 'Arthur Kennedy', 'Muriel Pavlow'], 'Studio': ['WARNER BROS.']}\nI love old movies and I like Margaret Rutherford so this movie was a good choice.  If you like the Miss Marple series you'll enjoy this classic.  My quarrel with this purchase was it's only a 24 hour rental while other films are 48 hour rentals.  Also, why are so many of the movies on prime rental only?  Being a prime member should come with some movie benefits.  Yet most classics with big name actors are for rent or purchase only.\nGood classic film for mystery lovers\n{'Content advisory': ['Alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['George Cukor'], 'Producers': ['Pandro S. Berman'], 'Starring': ['Katharine Hepburn', 'Cary Grant', 'Brian Aherne'], 'Studio': ['WARNER BROS.']}\nWhile I love most Katherine Hepburn movies this isn't one I'd put on that list.  It's comic but far fetched.  It's mostly for Katherine Hepburn fans who &#34;must&#34; see all her films.  I wouldn't rent this again.\nNot Hepburns best\n{'Content advisory': ['Foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Theodore Melfi'], 'Producers': ['Donna Gigliotti', 'Peter Chernin', 'Jenno Topping', 'Pharrell Williams', 'Theodore Melfi'], 'Starring': ['Taraji P. Henson', 'Janelle Monae', 'Kevin Costner'], 'Studio': ['20th Century Fox']}\nThis is a very good movie.  It reveals a lot of things that are not usually discussed with NASA and our space program.  Very strong acting from all 3 actresses.  I would rent this film again.\nA must watch for movie night\nBeauty and the Beast\nPaige O'Hara  (Actor),     Robby Benson  (Actor),     Gary Trousdale  (Director),     Kirk Wise  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"Join brave, independent Belle on the adventure of a lifetime as she sets out to rescue her father---and discovers the enchanted castle of a mysterious beast. Enjoy this timeless tale overflowing with unforgettable characters and music you'll never forget, universally acclaimed as one of Walt Disney Animation Studios' finest features.|It took more than 600 animators, artists, and technicians three and a half years to complete the project.|BEAUTY is the first animated Disney feature scripted by a woman, Linda Woolverton.|The film marked the first time each animator was credited on screen specifically for the character he or she brought to life.|Disney's animation department won a Scientific and Technical Academy Award for the design and development of the Computer Animated Production System used to make the film.|The style of illustration was inspired by French painters Fragonard and Boucher.\"]\n{'Genre': 'Animation', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': \"Paige O'Hara, Hal Smith, Linda Woolverton, Gary Trousdale, Mary Kay Bergman, Rex Everhart, Jesse Corti, Jo Anne Worley, Alvin Epstein, Tony Jay, Angela Lansbury, Kimmy Robertson, Kath Soucie, Jerry Orbach, Robby Benson, Richard White, David Ogden Stiers, Alec Murphy, Brian Cummings, Kirk Wise, Bradley Michael PiercePaige O'Hara, Hal Smith, Linda Woolverton, Gary Trousdale, Mary Kay Bergman, Rex Everhart, Jesse Corti, Jo Anne Worley, Alvin Epstein, Tony Jay, Angela Lansbury, Kimmy Robertson, Kath Soucie, Jerry Orbach, Robby Benson, Richard White, David Ogden Stiers, Alec Murphy,…   See more\", 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Gary Trousdale, Kirk Wise', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 28, 2017', 'Actors': \"Paige O'Hara, Robby Benson, Richard White, Jerry Orbach, David Ogden Stiers\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Writers': 'Linda Woolverton', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAny true Disney fan has to have this movie.  The quality is very good.  It still pulls the heart strings with warmth, melody and simplicity.\nDisney at more of its best!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['James Ponsoldt'], 'Producers': ['James Ponsoldt', 'Stefanie Azpiazu', 'Anthony Bregman', 'Peter Cron', 'Sophia Dilley', 'Jose Fortanel', 'Gary Goetzman', 'Evan Hayes', 'Russell Levine', 'Federica Sainte-Rose'], 'Starring': ['Emma Watson', 'Tom Hanks', 'Glenne Headly'], 'Studio': ['EuropaCorp Films USA', 'Inc.']}\nIt's fairly decent for a pseudo futuristic technology movie.  Despite two decent lead actors I feel it's like 2 hours I won't get back.  It's a dud despite all its hype.\nA movie you can miss\nThe Talk of the Town\nCary Grant  (Actor),     Jean Arthur  (Actor),     George Stevens  (Director, Producer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"When a charming fugitive, a beautiful teacher, and a stuffy lawyer are forced to become roommates, their unconventional relationship is suddenly THE TALK OF THE TOWN in this madcap romantic comedy. When accused arsonist Leopold Dilg (Cary Grant) escapes jail, he hides out in the home of friend Nora(Jean Arthur). Posing as a gardener, Dilg teams up with Nora to convince her summer tenant, SupremeCourt candidate Michael Lightcap (Ronald Colman, Lost Horizon) that Dilg was framed. The zaniness never stops as the three of them dodge the cops, try to snag the real crooks and discover along the way that both men have fallen for Nora. But who has captured Nora's heart? Find out with THE TALK OF THE TOWN, a sparkling gem from Hollywood's Golden Age of Comedy, nominated for seven Academy Awards(r)including Best Picture.\", 'Amazon.com', \"The screwball comedy was the definitive genre of the Depression, but as America edged toward war in the early '40s, it suffered some strange and wonderful mutations--none stranger than\", 'The Talk of the Town', \", directed by George Stevens from a script by novelist Irwin Shaw and frequent Capra collaborator (and future blacklist victim) Sidney Buchman. Cary Grant, awkwardly cast, is a small-town political agitator who is framed for the burning of a local factory; he takes refuge in the attic of a country cottage that landlady Jean Arthur is preparing to rent out to a celebrated law professor (silver-tongued Ronald Colman, perhaps the only actor in Hollywood who could make Grant look like a proletarian). Stevens, suspended between his light '30s style (\", 'Swing Time', ') and his heavy postwar manner (', 'A Place in the Sun', \"), struggles to balance a charming, surprisingly suspenseful romantic triangle with the heavy, debating-society tone of the screenplay, which pits Grant, the representative of a compassionate, emotional sense of justice, against the cool, abstract application of the law advocated by Colman. Caught between these two highly verbal characters, Jean Arthur doesn't have much to do but be adorable and provide the occasional quizzical reaction shot--two things she does with exquisite skill. Stevens and Arthur teamed up again one year later for another strange-bedfellows farce, the marvelous\", 'The More the Merrier', \"; in 1953 Arthur made her final film appearance in Stevens's\", 'Shane', '.', '--Dave Kehr']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Black & White, Full Screen, NTSC, Subtitled', 'Contributor': 'Ronald Colman, Columbia Pictures Corporation, George Stevens, Cary Grant, Jean Arthur, Glenda Farrell, Edgar Buchanan, Charles DingleRonald Colman, Columbia Pictures Corporation, George Stevens, Cary Grant, Jean Arthur, Glenda Farrell, Edgar Buchanan, Charles Dingle  See more', 'Language': 'English, Unqualified', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 4 Ounces', 'Item model number': '2226600', 'Director': 'George Stevens', 'Media Format': 'Multiple Formats, Black & White, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 57 minutes', 'Release date': 'February 25, 2003', 'Actors': 'Cary Grant, Jean Arthur, Ronald Colman, Edgar Buchanan, Glenda Farrell', 'Subtitles': 'English, French, Japanese, Georgian', 'Producers': 'George Stevens', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI enjoyed this movie when I rented it that I ended up purchasing the DVD.  A good movie for any film buff to add to their collection.  Cary Grant in a fun yet interesting movie.  What can I say...it had me at Cary Grant!  And Ronald Coleman is great in his role.\nDefinitely a must have for Cary Grant fans",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interests:** Movies, especially family-centric and holiday-themed films, alongside classic cinema from revered filmmakers. Recent interactions indicate a particular appreciation for screwball comedies.\n- **Genre Preference:** Enjoys romantic comedies, family-friendly films, classic dramas, light-hearted ghost stories, and has developed a liking for intricate narratives and character dynamics. The user remains selective and critical towards popular genres.\n- **Format Preference:** Strong preference for physical media, particularly DVDs, valuing nostalgia and the quality of classic films. The user expresses frustration with digital rental limitations and seeks high-quality items that enhance enjoyment.\n- **Value-Conscious:** Seeks emotionally resonant films and good deals, influenced by past experiences with product quality. Recent purchases reflect a commitment to acquiring notable titles for their collection.\n- **Nostalgia Factor:** Vintage classics that stir personal memories increase viewing enjoyment, indicating a deep connection to film history.\n- **Positive Engagement:** Actively rates films and series, showing a consistent appreciation for storytelling and performances, particularly in classic comedies and the works of Cary Grant and Ronald Colman.\n- **Commitment to Quality:** Expresses high expectations for films and has articulated appreciation for Disney, valuing emotional depth and artistic quality, while also being disappointed by films that fall short despite acclaim.\n\nOverall, the user is dedicated to discovering emotionally and intellectually rewarding content, often reflecting a discerning and critical engagement with cinema.",
  "metrics": {
    "rouge1_f": 0.06747891283973759,
    "rouge2_f": 0.007969995311767463,
    "rougeL_f": 0.032333645735707586,
    "meteor": 0.01796118080580203,
    "bleu1": 9.033729769589023e-10,
    "bleu2": 2.947078084868244e-10,
    "bleu3": 8.427340314032873e-11,
    "bleu4": 2.536391653036296e-11,
    "bertscore_precision": 0.3541044592857361,
    "bertscore_recall": 0.515090823173523,
    "bertscore_f1": 0.41968926787376404
  }
}