{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NCIS: Season 10\nReview Date: 2016/08/18\nStore: Valerie Cruz  (Actor),     Colin Hanks  (Actor),     Tony Wharmby  (Director),     Dennis Smith  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Boxed Sets\nProduct Description: [\"NCIS (Naval Criminal Investigative Service) is more than just an action drama. With liberal doses of humor, it's a show that focuses on the sometimes complex and always amusing dynamics of a team of special agents forced to work together in high-stress situations. From murder and espionage to terrorism and stolen submarines, these special agents travel the globe to investigate all crimes with Navy or Marine Corps ties.\"]\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Action & Adventure/Television, Television', 'Format': 'Box set, Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen', 'Contributor': \"Matt Craven, Mark Harmon, David Bellisario, Greg Germann, Pauley Perrette, Mark Rolston, Tony Wharmby, Cote de Pablo, Arvin Brown, Richard Schiff, Leslie Libman, Alex Kingston, Kelli Barrett, René Auberjonois, Billy Dee Williams, Robert Wagner, Brian Dietzen, Avery C. Drewe, Diane Neal, Michael Weatherly, Brad Beyer, Sean Murray, Mario Van Peebles, Steve Valentine, Rocky Carroll, David McCallum, Dennis Smith, Oded Fehr, Rick Worthy, Tom Wright, Valerie Cruz, Jeffrey Vlaming, Mark Schilz, Ralph Waite, Colin Hanks, James Whitmore, Jr., Terence O'Hara, Jamey Sheridan, Michael NouriMatt Craven, Mark Harmon, David Bellisario, Greg Germann, Pauley Perrette, Mark Rolston, Tony Wharmby, Cote de Pablo, Arvin Brown, Richard Schiff, Leslie Libman, Alex Kingston, Kelli Barrett, René Auberjonois, Billy Dee Williams, Robert Wagner, Brian Dietzen, Avery C. Drew…   See more\", 'Language': 'English', 'Runtime': '17 hours and 8 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.24 Ounces', 'Item model number': '504980985', 'Director': 'Michael Weatherly, Tony Wharmby, Dennis Smith, James Whitmore, Jr., Tom Wright', 'Media Format': 'Box set, Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen', 'Run time': '17 hours and 8 minutes', 'Release date': 'August 20, 2013', 'Actors': 'Valerie Cruz, Colin Hanks, Oded Fehr, Jamey Sheridan, Robert Wagner', 'Subtitles': 'Portuguese, Spanish, English', 'Producers': 'Jeffrey Vlaming, David Bellisario, Avery C. Drewe, Mark Schilz', 'Studio': 'Paramount', 'Number of discs': '6'}\nReview Text: What's not to love? If you love NCIS, you will love this!\nReview Title: What's Not To Love?\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "New Skills for Blind Dogs\nLevin, Caroline D.  (Actor)    Format: DVD\nMovies & TV, Independently Distributed, Kids & Family\n['Product Description', 'Long-awaited, finally available \\x97 A training film for blind-dog owners!', 'Training any dog is hard work. Training a blind dog can be extra challenging. So, when author Caroline Levin was approached by dog owners requesting help, we caught those sessions on film.', 'Whether you have a large, active dog, like Bubba, losing his vision slowly - or a small, shy dog like Leo, completely blind from detached retinas - this film can help you. Levin guides each dog and owner through the skills discussed in Chapter 8 of \"Living With Blind Dogs\". Additional footage includes demonstrations with more advanced dogs. Levin also discusses training theory, equipment, and dog-training issues specific to SARD dogs (confusion, lethargy, depression). CONTENTS:', 'INTRODUCTION', 'TRAINING THEORY', 'EQUIPMENT', 'CHOOSING VERBAL COMMANDS', 'NEW SKILLS The Go Slowly or Easy The Stop or Wait The Come When Called Managing Steps and Stairs Teaching the Dog to Use a Ramp Walking a Blind Dog on Leash The Forward The Pipe-Leash or Stick-leash Directional Cues \\x97 And the Small Dog \\x97 And the Large Dog Other Basic Skills Sit stay Down stay', 'TRAINING PUPPIES', 'TRAINING DOGS BOTH BLIND AND DEAF', 'CLOSING THOUGHTS', 'Review', '...nothing helps as much as seeing actual examples. This video offers gentle, reward-based, practical examples of training these dogs. --', 'The Oregonian, February 2005', 'a special work and I\\x92m impressed with it \\x85a MUST as a companion to the book \"Living With Blind Dogs\". --', 'Mrs. Dee Dee Rose, AKC Obedience judge and SARD-dog owner']\n{'Format': 'Color, Full Screen, NTSC, Digital Sound', 'Contributor': 'Levin, Caroline D.', 'Runtime': '48 minutes', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'Color, Full Screen, NTSC, Digital Sound', 'Run time': '48 minutes', 'Release date': 'April 5, 2004', 'Actors': 'Levin, Caroline D.', 'Studio': 'Lantern Publications Studios', 'Number of discs': '1'}\nBeing the 'seeing eye person' for my own dog, Wiggles, who is an eight-year-Young Blue Heeler / cattle dog, as we deal with hereditary 'late onset' PRA (progressive retinal atrophy), I was hoping to see more familiar things that I've done to make life better/safer for Wiggles, such as padding corners at places where he has/would bump due to getting slightly 'off-center,' as well as making entrances to my home easier to 'find by nose' with scents and textures like cedar bark mulch, which has its own unique aroma.<br /><br />Suggestions like making the yard more friendly for blind eyes -- in my case, that meant no more holly hedge, rose or hydrangea bushes or astilbe, and substituting equally lovely and great-fragranced old-fashioned lilac bushes for hedge, and keeping them trimmed so no sharp branches are at his eye level, and other friendly flowers like daylilies, Asiatic and Oriental lilies, which provide not only friendly foliage, but also great 'seeing eye smells' by which to guide Wiggles' nose. I've also installed 'pool noodles,' strung together with cotton clothsline cord and held at just the right height for Wiggles' shoulder by 'plant stakes' (may be procured at most 'big box' stores like KMart, WalMart, and also gardening stores, generally green-coated metal), through which the long string of pool noodles is 'threaded,' and located around the home and/or flower bed's perimeter. During the growing months, daylily foliage covers the pool noodles, but it is amazing how appreciative your blind pet will be of your efforts to help him/her maneuver safely in your yard!<br /><br />Also, the video did not cover the very real dangers of water, holes, etc., that your blind friend cannot see. This includes indoor dangers like sunken tubs and the many objects that become hazards to one no longer able to see them.<br /><br />The video did stress the importance of not moving furniture, and very patiently (sometimes almost too patiently, for suggestions were repeated several times) made sure the viewer was shown the few techniques more than once.<br /><br />A good start to this topic, but it is hoped there will be more to come, as this is a very important subject to those who are blessed with these special friends and companions and to be their 'seeing eye people.'<br /><br />We want to do our best to make their lives happy, and this is not difficult for the devoted pet owner.<br /><br />Music played softly can be soothing, but the voices of two or more people can be confusing to the blind one. At times of frustration and confusion, the calming support and 'I'm here for you and love you very much' message is vital to keeping your special friend secure and content with his/her new chapter in life.<br /><br />Please, love your blind dog as he/she would love you if you lost one of your senses: it's far from the end, but a new and blessed beginning to have such a role as seeing eye person. We are both just fine with our lives now and still enjoy playtime, walks, and normal life.<br /><br />Don't let this minor hurdle stop you from loving and living a wonderful life with your blind pet. You'll come to learn the blessings of a profoundly special relationship -- you won't be sorry!\nNot bad\nTammy and The Bachelor [VHS]\nDebbie Reynolds  (Actor),     Walter Brennan  (Actor),     Joseph Pevney  (Director)    &                   0                  more   Rated:    NR    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Comedy\n['Tammy and The Bachelor']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Joseph Pevney', 'Run time': '1 hour and 29 minutes', 'Release date': 'January 20, 1993', 'Date First Available': 'December 14, 2006', 'Actors': 'Debbie Reynolds, Walter Brennan, Leslie Nielsen, Mala Powers, Sidney Blackmer', 'Studio': 'Universal Studios Home Entertainment', 'Producers': 'Ross Hunter', 'Writers': 'Cid Ricketts Sumner, Oscar Brodney'}\nThis is my all-time favorite movie and one that I've enjoyed on a regular basis for years. It's just wonderful; cannot recommend too highly!\nWhat's not to love?\nPrancer\nVarious  (Actor, Director)    Rated:    G    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Classics Kids Love\n['Product Description', 'Prancer (RPKG/DVD)', \"Family entertainment. A 9-year-old girl's belief in the magic of miracles brings the joy of Christmas to her family and hometown when she finds a wounded reindeer whom she secretly nurses back to health.\", ']]>', 'Amazon.com', \"A reindeer doesn't have to fly to be magical to someone, and\", 'Prancer', \"succeeds, in its unassuming and plainspoken way, to prove that point. This 1989 family film stars Rebecca Harrell as 9-year-old Jessica, a motherless schoolgirl raised (and largely ignored) by her bereaved and embittered father (Sam Elliot), an apple farmer. While Jessica's dad struggles to keep food on the family table, the little heroine worries over the fate of a wounded reindeer she meets and wistfully identifies as a member of Santa's sled crew. The story may sound overly precious, but the film is grittier and more realistic than that. Far more concerned with wobbly family relationships than gilded escapism,\", 'Prancer', 'is a rare family film that can entertain without invoking fluffy enchantment. Followed 12 years later by a sequel,', 'Prancer Returns', '.', '--Tom Keogh']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, NTSC, Anamorphic, Color, Dolby, DTS Surround Sound, Subtitled, Widescreen, Closed-captionedMultiple Formats, NTSC, Anamorphic, Color, Dolby, DTS Surround Sound, Subtitled, Widescreen, Closed-captioned   See more', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '1002377', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Color, Dolby, DTS Surround Sound, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 2, 2001', 'Actors': 'Various', 'Dubbed': 'French', 'Subtitles': 'Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nI had this movie in VHS format and replaced it with DVD. Without giving away the storyline, let me just say that this movie, about ideals, Christmas, the loss of a mother & a wife, tough economic times, and a special small town, are all reasons to add this gem to your movie collection. View it with the kids with no fear, but prepare for a bit of a rollercoaster of emotion, and a renewed faith in the innate good of people, and the power of faith!\nOne of my favorite movies!\nChristy - The Complete Series\nTyne Daly  (Actor),     Randall Batinkoff  (Actor),     Alexander Singer  (Director),     Joel Rosenzweig  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', 'Based on the bestseller by Catherine Marshall, Christy tells the story of an idealistic nineteen year old (Kellie Martin) who leaves the comforts of her city home to teach school in the impoverished Appalachian community of Cutter Gap, Tennessee in 1912. Strength, determination, and faith guide young Christy Huddleston through unforeseen difficulties, help her to gain understanding of the proud mountain people, and win her mentorship, friendship, and the love of two men.', 'Amazon.com', 'Determination, faith, and optimism are powerful forces that enable individuals to positively affect the lives of themselves and others.', 'Christy', ', a captivating 1994 television series based on the book by Catherine Marshall and reminiscent of the', 'Anne of Green Gables', 'and', 'Little House on the Prairie', \"series, is the story of an idealistic 19-year-old woman named Christy Huddleston (Kellie Martin) who sets out for the wilderness of the Smoky Mountains of Tennessee in 1912 on a mission to educate the children of the remote community of Cutter Gap. A well-to-do girl raised in the city, Christy is shocked and completely unprepared for the extreme poverty, ignorance, and superstitious tendencies of Cutter Gap's people, but resolves to persevere in her commitment to better the lives of her young students. Each day brings a fresh lesson for the children and a new struggle that inspires Christy to draw upon and re-examine her own faith while striving to disprove local superstitions and replace long-held animosities and prejudices with virtues like forgiveness and respect. Christy is surrounded by a handful of allies in Cutter Gap that include fellow missionary Miss Alice Henderson (Tyne Daly), whom she idolizes for her strength, resolve, and mentorship; Fairlight Spencer (Tess Harper), a local woman who offers Christy the rare gift of friendship; mission preacher Reverend David Grantland (Randall Batinkoff), a hard worker who immediately becomes smitten with Christy; and local Doctor Neil MacNeill (Stewart Finlay-McLennan) whose gruff manner and atheistic beliefs both confuse and excite Christy. Eventually, Christy finds she's fallen in love with both Reverend Grantland and Doctor MacNeill and embarks on a very personal journey toward maturity while simultaneously succeeding in her quest to educate the children of Cutter Gap and affect significant positive change throughout the entire community. (Ages 9 and older)\", '--Tami Horiuchi']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.42 x 0.72 x 7.68 inches; 8.64 Ounces', 'Director': 'Alexander Singer, Joel Rosenzweig, Michael Ray Rhodes', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '15 hours and 7 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Tyne Daly, Randall Batinkoff, Kellie Martin, Tess Harper, Stewart Finlay-McLennan', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified, French (Dolby Surround), Spanish (Dolby Digital 2.0 Mono)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nI so enjoy movies/television series that are moral & tell a real story in a way that invites the entire family to come sit together & learn about life during a time when parts of America were still isolated.\nThere's nothing like a classic!\nPaulie\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Paulie (DVD)', ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, NTSC, Color', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 1, 2013', 'Actors': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nI am not a big fan of movies (or television) due to the rarity of finding a decent movie with content that interests me. I first bought this as a VHS movie a dozen or so years ago, and viewed it a half-dozen times before the VHS player &#34;went south.&#34; I confess to having missed being able to watch &#34;Paulie&#34; again, so the DVD version will be very nice to have! To me, this is a love story interwoven with the longer life span of a bird (compared with that of a beloved companion dog), and its interweaving of several issues (from the lab testing of animals to the differences in depth and scruples of people, to children with speech challenges) is unparalleled, in my viewing experience. It's not a long movie, but it left me sitting in a state of serenity as the closing credits rolled. The good guys, gals & birds DO win!\nEverything needed for a perfect movie for all, plus a love story\nHigher Ground\nJohn Denver  (Actor),     Paul Batten  (Actor),     Robert Day  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Set against the awesome backdrop of the Alaskan wilderness, a disillusioned FBI agent decides to retire and join his buddy running an air frieght business. When his friend is murdered and unjustly branded a bootlegger, the former agent sets out to clear his friend's name.\", 'Amazon.com', 'Singer-songwriter John Denver sought to reboot his career and carve out a new role for himself as an action hero with', 'Higher Ground', \". This TV movie, clearly intended as a pilot for a possible series, stars Denver as former FBI agent Jim Clayton, who goes to Alaska when the incompetence of his superiors at the bureau becomes unbearable. In the vast wilderness, he teams up with an old friend named Rick, who has an air freight business. But Rick soon turns up dead and it's up to Jim to clear his friend's name of bootlegging charges and bring peace to Rick's wife and son. Along the way, of course, there's an occasion for Denver to pull out his guitar and exercise his soaring tenor. The plot and overall quality is standard television fare of the 1980s: The bad guys are obviously bad, a young boy needs to regain his faith in humanity, and solving the case doesn't involve detective work so much as looking earnest and getting into awkwardly choreographed fist fights. Still, Denver's sincere and likable personality comes through and fans will enjoy his performance. Also starring John Rhys-Davies (\", 'Raiders of the Lost Ark', ', the', 'Lord of the Rings', 'trilogy) and Richard Masur (', 'Risky Business', ').', '--Bret Fetzer']\n{'Genre': 'TV Action, Action, TV', 'Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Subtitled', 'Contributor': 'Richard Leiterman, Paul Batten, Gordon Tootoosis, John Rhys-Davies, Robert Day, Meg Wittner, Martin Kove, Matthew Walker, Garry Davey, Richard Masur, Lee Holdridge, Gary Chalk, John Denver, David G. BlangstedRichard Leiterman, Paul Batten, Gordon Tootoosis, John Rhys-Davies, Robert Day, Meg Wittner, Martin Kove, Matthew Walker, Garry Davey, Richard Masur, Lee Holdridge, Gary Chalk, John Denver, David G. Blangsted  See more', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 3.2 Ounces', 'Item model number': '5068391', 'Director': 'Robert Day', 'Media Format': 'Multiple Formats, Color, Dubbed, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 36 minutes', 'Release date': 'January 27, 2009', 'Actors': 'John Denver, Paul Batten, Gary Chalk, Garry Davey, John Rhys-Davies', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI loved this movie, a &#34;pilot film&#34; for a television series starring John Denver. The TV series didn't happen, but we still have this movie to show us how much John loved planes, flying, and rural places of great beauty. The plot is so-so, but that's all right, because it's another view of John Denver that many haven't seen.\nJohn Denver Acting At Something He Loved!\nNCIS: Season 12\nMichael Weatherly  (Actor),     David McCallum  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{}\nI love this series, each and every season!\nWhat's Not To Love!\nNewhart: The Complete Fifth Season\nBob Newhart  (Actor),     Dick Martin  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Welcome back to the Stratford Inn! Comedy legend Bob Newhart returns as harried innkeeper Dick Loudon for a fifth season of the quirky, hilarious, anything-but-buttoned-down sitcom classic Newhart. Dick and his lovely, forever sweater-clad wife Joanna (Mary Frann) are joined as always by their off-kilter crew of friends and colleagues: hilarious handyman George (Tom Poston), yuppie-in-training Michael (Peter Scolari), spoiled and sassy Stephanie (Julia Duffy) and that wacky woodsman Larry (William Sanderson), not to mention his brother Darryl (Tony Papenfuss).. and his other brother Darryl (John Voldstad.) And if you think this band of New England nutjobs are something, wait until you see some of the guests at the Stratford! All 24 fifth season episodes of this Emmy(R)-nominated favorite are sure to keep you laughing from the moment you check in.']\n{'Genre': 'Comedy/Television', 'Format': 'NTSC', 'Contributor': 'Dick Martin, Bob Newhart', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Item model number': '35374991', 'Director': 'Dick Martin', 'Media Format': 'NTSC', 'Run time': '9 hours and 20 minutes', 'Release date': 'May 10, 2016', 'Actors': 'Bob Newhart', 'Studio': 'Shout Factory', 'Number of discs': '3'}\nDuring the years when Newhart was on television (1982-1990), I was truck driving and seldom watched any TV programs. While the first couple of seasons of Newhart had a couple of characters that were forgettable (just my opinion), when Peter Scolari joined the program, it really took off and flew very well! Larry, Darol and Darrell were just priceless, and the shows were each examples of stellar writing and acting. I'm delighted to see this show become available on DVD!\nWonderful Program!\nAwakenings\nRobert De Niro  (Actor),     Robin Williams  (Actor),     Penny Marshall  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['By opening one man\\'s eyes to the world... he opened his own. Robert De Niro (in an Oscar-nominated performance) and Robin Williams star in this powerful, true story of a maverick doctor and the patients whose lives he changes. Williams plays Dr. Malcolm Sayer, a shy research physician who uses an experimental drug to \"awaken\" the catatonic victims of a rare disease. De Niro co-stars as Leonard, the first patient to receive the controversial treatment. His awakening, filled with awe and enthusiasm, proves a rebirth for Sayer too, as the exuberant patient reveals life\\'s simple but unutterably sweet pleasures to the introverted doctor. Encouraged by Leonard\\'s stunning recovery, Sayer administers the drug to the other patients. The story of their friendship during this emotional journey is a testament to both the tenderness of the human heart and the strength of the human soul.']\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'Dolby, Full Screen, NTSC', 'Contributor': 'Robert De Niro, Penelope Ann Miller, Penny Marshall, Julie Kavner, Robin Williams, John Heard', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'IMG6819DVD', 'Director': 'Penny Marshall', 'Media Format': 'Dolby, Full Screen, NTSC', 'Run time': '2 hours and 1 minute', 'Release date': 'December 7, 2010', 'Actors': 'Robert De Niro, Robin Williams, Julie Kavner, John Heard, Penelope Ann Miller', 'Studio': 'Image Entertainment', 'Number of discs': '1'}\nIn my opinion, this is Robert De Niro's and Robin Williams' finest work. The subject matter is difficult and heartrending, but so well worth your time if you want a peek at the history of how mental hospitals were sometimes/often used a &#34;dumping grounds&#34; for little-known illnesses and conditions.\nTheir Finest Movie IMHO\nThe Canteen Spirit\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Documentary\n['The Canteen Spirit', 'chronicles the story of the World War II North Platte Canteen, which made history when residents of 125 communities from across the state greeted millions of soldiers, over a nearly five-year period, as their trains made a ten-minute stop at the North Platte depot. Canteen workers provided sandwiches, cakes, cookies, hard-boiled eggs, doughnuts, beverages, cigarettes, magazines and more, never once running out of provisions in its years of operation.']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC, DVD', 'Run time': '1 hour', 'Release date': 'February 7, 2006', 'Language': 'Unqualified', 'Studio': 'PBS', 'Number of discs': '1'}\nYou will love this if you want a look at how vitally important this volunteer effort was for the troop trains passing through North Platte, Nebraska, during World War II. My father was one of those troops, and he never forgot his ten-minute taste of caring food & coffee. He cherished this one-time experience; I thank God for all those wonderful folks that made it possible for him and so many others to receive a personal welcome at a time when the whole country was pretty shook up. Rural and small-town families made sure these soldiers had a real, home cooked and home baked meal. I hope you will enjoy this film greatly!\nI Loved It!\nNCIS: The Best of Abby\nPauley Perrette  (Actor),     Mark Harmon  (Actor)    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Everybody loves Abby! This special DVD set collects the 12 favorite Abby Sciuto episodes as chosen by her fans... with exclusive intros by Pauley Perrette herself!']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'DVD', 'Actors': 'Pauley Perrette, Mark Harmon'}\nThis gal is such an integral part of the TV series NCIS that it's hard to imagine it being a success without her. Truly a terrific bonus to the acting skills of Mark Harmon, David McCallum, etc., this DVD focuses on the episodes that feature Abby!\nLove Abby? Get this DVD!\nNCIS: Season 10\nValerie Cruz  (Actor),     Colin Hanks  (Actor),     Tony Wharmby  (Director),     Dennis Smith  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n[\"NCIS (Naval Criminal Investigative Service) is more than just an action drama. With liberal doses of humor, it's a show that focuses on the sometimes complex and always amusing dynamics of a team of special agents forced to work together in high-stress situations. From murder and espionage to terrorism and stolen submarines, these special agents travel the globe to investigate all crimes with Navy or Marine Corps ties.\"]\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Box set, Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen', 'Contributor': \"Matt Craven, Mark Harmon, David Bellisario, Greg Germann, Pauley Perrette, Mark Rolston, Tony Wharmby, Cote de Pablo, Arvin Brown, Richard Schiff, Leslie Libman, Alex Kingston, Kelli Barrett, René Auberjonois, Billy Dee Williams, Robert Wagner, Brian Dietzen, Avery C. Drewe, Diane Neal, Michael Weatherly, Brad Beyer, Sean Murray, Mario Van Peebles, Steve Valentine, Rocky Carroll, David McCallum, Dennis Smith, Oded Fehr, Rick Worthy, Tom Wright, Valerie Cruz, Jeffrey Vlaming, Mark Schilz, Ralph Waite, Colin Hanks, James Whitmore, Jr., Terence O'Hara, Jamey Sheridan, Michael NouriMatt Craven, Mark Harmon, David Bellisario, Greg Germann, Pauley Perrette, Mark Rolston, Tony Wharmby, Cote de Pablo, Arvin Brown, Richard Schiff, Leslie Libman, Alex Kingston, Kelli Barrett, René Auberjonois, Billy Dee Williams, Robert Wagner, Brian Dietzen, Avery C. Drew…   See more\", 'Language': 'English', 'Runtime': '17 hours and 8 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.24 Ounces', 'Item model number': '504980985', 'Director': 'Michael Weatherly, Tony Wharmby, Dennis Smith, James Whitmore, Jr., Tom Wright', 'Media Format': 'Box set, Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen', 'Run time': '17 hours and 8 minutes', 'Release date': 'August 20, 2013', 'Actors': 'Valerie Cruz, Colin Hanks, Oded Fehr, Jamey Sheridan, Robert Wagner', 'Subtitles': 'Portuguese, Spanish, English', 'Producers': 'Jeffrey Vlaming, David Bellisario, Avery C. Drewe, Mark Schilz', 'Studio': 'Paramount', 'Number of discs': '6'}\nWhat's not to love? If you love NCIS, you will love this!\nWhat's Not To Love?",
  "profile": "The user continues to showcase a nurturing commitment to enhancing their blind dog's quality of life through thoughtful training and adaptations, reflecting their role as a devoted pet owner. Their proactive approach to education and personal growth underscores a deep dedication to their pet's needs and their own development. Recently, they have engaged with emotionally charged narratives and heartfelt dramas, expressing a strong appreciation for stories centered on resilience, love, and social issues.\n\nAdditionally, their interest in historical narratives and community themes highlights a connection to storytelling that resonates with personal experiences and family heritage. Their expanding entertainment interests now include character-driven series that blend action with humor, indicating a fondness for strong character development and engaging plots.\n\nRecently, the user expressed enthusiasm for a popular investigative drama known for its complex dynamics and humor. This choice underscores their preference for entertaining narratives that balance action with character interactions. Overall, their multifaceted engagement with various genres enriches their life, fostering personal growth while nurturing a profound bond with their pet. Their dedication to compassionate pet care, eagerness for knowledge, and enjoyment of impactful storytelling illustrate their commitment to enhancing both their own life and that of their cherished dog.",
  "metrics": {
    "rouge1_f": 0.05580762250453721,
    "rouge2_f": 0.005901044030866999,
    "rougeL_f": 0.031306715063520875,
    "meteor": 0.015753377125258556,
    "bleu1": 9.517055450201055e-12,
    "bleu2": 3.663863516552797e-12,
    "bleu3": 4.727706918018421e-13,
    "bleu4": 1.7002031499852236e-13,
    "bertscore_precision": 0.3168911337852478,
    "bertscore_recall": 0.5210443735122681,
    "bertscore_f1": 0.3940979838371277
  }
}