{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/02/06\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Michel', 'Susie Ryan'], 'Producers': ['Brian M. Jones', 'Michal Pietrzyk', 'Kelly Lambson', 'Brandon Swanson', 'Schuyler Finn', 'D.L. Stern', 'Abby Lautt', 'Charissa Sander']}\nReview Text: This show is as riveting as COPS. Since they keep taking COPS off, this show has kept me entertained just as well.\nReview Title: Reality TV\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Feds\nDan Goldbery  (Director),     Ken Marshall  (Actor),     Fred Dalton Thompson  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Ex-Marine Ellie and shy bookworm Janis are fledgling female Feds who\\'d make Eliot Ness proud. More importantly, they\\'ll make you laugh. Starring as these plucky FBI recruits are gangbuster comediennes Rebecca de Mornay (Risky Business, Wedding Crashers) and Mary Gross (Saturday Night Live, A Mighty Wind). \"Brawny\" Ellie and \"brainy\" Janis go together like ham and eggs, and their lives will be hilariously scrambled during their hilarious, hectic training. Janis must learn physicality and intimidation techniques, while Ellie needs a guiding hand to help get through the intricacies of constitutional law. So in true buddy fashion, they\\'ll help each other prepare for the academy\\'s final exam: a \"simulated crime exercise\" that chauvinistic lunkheads think will separate the men from the girls.']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'NTSC, Widescreen', 'Contributor': 'Fred Dalton Thompson, Larry Cedar, Mary Gross, Rebecca De Mornay, Dan Goldbery, Ken Marshall', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Dan Goldbery', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 23 minutes', 'Release date': 'July 7, 2010', 'Actors': 'Ken Marshall, Fred Dalton Thompson, Rebecca De Mornay, Mary Gross, Larry Cedar', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis has always been one of my favoriet movies and was glad to get it at such a reasonable price.\nGreat Movie\nGood Neighbors: The Complete Series 1-3 (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'Good Neighbors: The Complete Series 1-3 (DVD)', \"On Tom Good's fortieth birthday, he decides to escape the rat race for a life of self-sufficiency with his wife, Barbara. Soon they're plowing a field in their suburban yard and tending a goat and pigs, much to the dismay of their upwardly mobile neighbors and friends the Leadbetters. This series, known as\", 'The Good Life', 'in the UK, enjoyed such popularity the queen requested a viewing, and as recently as this year it was listed as one of the top ten British sitcoms of all time.', ']]>', 'Amazon.com', 'Originally telecast in the 1970s,', 'Good Neighbors', 'is the wonderful 1970s Britcom about an upper-middle-class couple who relinquish consumerism and turn their cozy suburban London home into a self-sufficient farm. Tom (Richard Briers) and Barbara (Felicity Kendal) Good trade in one version of the good life for an impoverished other--an old tractor instead of a car, a goat instead of a purebred pup--to the continuing consternation of their best friends and executive-salaried neighbors, Jerry (Paul Eddington) and Margot (Penelope Keith) Ledbetter. Among the episodes contained in the first three series are \"Pig\\'s Lib,\" in which Margot covertly seeks help from the local residents\\' association to stop Tom\\'s plans for keeping pigs; \"Just My Bill,\" in which Tom and Barbara face the rare problem of a harvest surplus that has to go somewhere; \"Mutiny,\" in which poor Jerry is caught in a crossfire of obligations to both his boss and bossy Margot; \"Going to Pot,\" in which the Goods come close to abandoning their self-sufficiency ethic when Tom proves a profitable craftsman at the potter\\'s wheel; \"The Happy Event,\" in which the birth of new livestock is wonderful news for the Goods but a sore point with the Ledbetters; and \"The Last Posh Frock,\" featuring Barbara at the end of her rope when her last nice dress gets torn. As always, the series\\' concept ultimately takes a back seat to the lovely chemistry among four outstanding actors, and story lines that wisely emphasize relationships. Fans of British television would do well to look into', 'Good Neighbors', '.', '--Tom Keogh']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC', 'Contributor': 'Various', 'Language': 'English, Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1 inches; 4 Ounces', 'Item model number': '2262105', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC', 'Run time': '10 hours and 40 minutes', 'Release date': 'June 13, 2006', 'Actors': 'Various', 'Studio': 'BBC Home Entertainment', 'Number of discs': '4'}\nThis series is timeless - always funny. I had it on VHS and was glad to be able to purchase it on DVD at such a reasonable price.\nGreat British Comedy\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Michel', 'Susie Ryan'], 'Producers': ['Brian M. Jones', 'Michal Pietrzyk', 'Kelly Lambson', 'Brandon Swanson', 'Schuyler Finn', 'D.L. Stern', 'Abby Lautt', 'Charissa Sander']}\nThis show is as riveting as COPS. Since they keep taking COPS off, this show has kept me entertained just as well.\nReality TV",
  "profile": "**Updated User Profile Summary:**\n\n- **Movie and TV Preferences:** The user enjoys comedies, especially those that blend action and adventure elements. They favor character-driven stories featuring strong female leads and buddy dynamics, along with classic British comedies that highlight relational humor. They have also shown an interest in reality TV, appreciating shows that provide entertainment similar to classic formats they enjoy.\n\n- **Viewing Format:** The user prefers physical media, particularly DVDs, which reflects a nostalgic preference for traditional viewing experiences and a desire for ownership of their films. They value the DVD format for timeless series and maintain this preference across their entertainment choices.\n\n- **Rating Style:** The user consistently rates films and series highly, often awarding scores of 4.7 and above, indicating a positive attitude towards content that resonates with them. They recently reviewed a reality show with a perfect rating of 5.0, showing enthusiasm for engaging entertainment.\n\n- **Community Engagement:** The user has expressed satisfaction with their purchases, especially when they find products at reasonable prices, underscoring their commitment to cost-effectiveness.\n\n- **Long-term Interest:** The user demonstrates a tendency to favor familiar and beloved content, revisiting timeless series rather than solely seeking out new releases, which highlights their consistent taste over time.\n\nOverall, the user prioritizes light-hearted, action-comedy films and classic series with strong character dynamics, while valuing affordability and ownership in their media acquisitions.",
  "metrics": {
    "rouge1_f": 0.2050326188257223,
    "rouge2_f": 0.011204481792717087,
    "rougeL_f": 0.08201304753028892,
    "meteor": 0.06770642524841446,
    "bleu1": 0.01440877781271144,
    "bleu2": 0.0036748166966724173,
    "bleu3": 0.0005661375258604856,
    "bleu4": 0.00022240960073671712,
    "bertscore_precision": 0.3584572672843933,
    "bertscore_recall": 0.47216659784317017,
    "bertscore_f1": 0.40752872824668884
  }
}