{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Kinghard Makeup Folding Collapsible Air Drying Cosmetic Brush Organizing Tree Rack Holder\nReview Date: 2017/03/18\nStore: Kinghard®\nAverage Rating: 3.3\nProduct Details: {'Brand': 'Kinghard®', 'Skin Type': 'All', 'Item Form': 'Wand', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Is Discontinued By Manufacturer': 'No', 'UPC': '654437380497'}\nReview Text: This was the best thing I could have purchased to help dry my makeup brushes , it's sturdy and holds a lot of brushes.\nReview Title: Brush Drying Rack\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "GranNaturals Boar Bristle Smoothing Hair Brush for Women and Men - Medium/Soft Bristles - Natural Wooden Large Flat Square Paddle Hairbrush for Fine, Thin, Straight, Long, or Short Hair\nGranNaturals\n{'Brand': 'GranNaturals', 'Color': 'Brown, Black', 'Shape': 'Square', 'Handle Material': 'Wood', 'Product Benefits': 'Smoothing', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10 x 3.43 x 1.57 inches; 4.23 Ounces', 'Item model number': '753807366748000', 'UPC': '753807366748 794168026971', 'Manufacturer': 'Gran Goods'}\nThis is a really good brush it doesn't just look expensive it performs like the high end brushes , I love everything about it ,I wouldn't change a thing . It's perfect, everyone can use it in your family it 's for all different hair types .\nBEST BRUSH\nNew Fashion Women Jewelry Charm Mesh Round Ball Knot Silver Earring Gift\nHittime\n['Features:Brand new and high quality. This is a beautiful and amazing earring.It is very elegant in its design.Special design and unique structure, a popular item.This exquisite earring lends your outfit a unique sheen of elegance.Size: 1cm x 0.8cm - 0.39inch x 0.31inch.Package Included:1 x Women Jewelry Charm Mesh Round Ball Knot EarringNO Retail Box. Packed Safely in Bubble Bag.']\n{'UPC': '701466017730', 'Manufacturer': 'Hittime'}\nI love my earrings , my ears sit flat to me head so I needed something that would stick out and these definitely did the trick ,I liked them so much I had to order another pair for my daughter.\nLooks expensive\n2Pcs Lady Purple Fishbone Shaped 2 Way Folding Hair Brush Pocket Straight Comb\nuxcell\n{'Brand': 'uxcell', 'Hair Type': 'All', 'Number of Items': '2', 'Unit Count': '1.00 Count', 'Item model number': 'a12103000ux0447', 'UPC': '700836526728'}\nMy daughter loves this brush to shingle her natural hair , but she wishes it wasn't so hard.\nWorks\nAnself 6Pcs Sectioning Clips Clamps Hairdressing Salon Hair Grip Crocodile DIY Accessories Hairpins Plastic\nConstructan\n['Features:  Better design than duck clips, which can hold hairs smoothly.  It is possible to hold any amount of hair.  This sectioning clip is perfect for hair salon Hairdresser and so on.  Contours and curves to the shape and make client comfortable.  Suitable for Salon and home use, especially for hair styling, hair straight and hair curling..   Specifications:  Material: Plastic  Color: Purple  Quantity: 6Pcs  Length: Approx. 11.5cm / 4.5in  Package size: Approx.10 * 11 * 3.5cm / 3.9 * 4.3 * 1.4in  Total weight: 67g / 2.4oz   Note:  May have Slight shade variation between the actual product and pictures due to illumination, photographic angle and configuration of monitor. We will try our best to send the product with the illustrated color as possible.   Package List:  6 * Alligator Hair Clips']\n{'Hair Type': 'Straight', 'Color': 'Purple', 'Material': 'Plastic', 'Unit Count': '6.0 Count', 'Number of Pieces': '6', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.14 x 5.59 x 1.1 inches; 0.35 Ounces', 'Item model number': 'H13459-F', 'UPC': '795622485495 709872183186 709872195899 709127198842', 'Manufacturer': 'Constructan'}\nPretty nice , they hold my hair into place with a sturdy grip and I love the color.\nPink\nJojoba Oil - Golden - 8 oz, Safety sealed container, Soap making, lotion, creams, massage oil, bath, beauty, lip balm\nTraverse Bay Soap Company\n['Jojoba Oil - Golden - 8oz- Jojoba Oil is a light oil and is great for people with sensitive skin. It works well as a skin moisturizer as well as a hair conditioner. Jojoba Oil helps to relieve dry and cracked skin, as well as reducing dandruff. We share our commitment with our producers/manufacturers to source only the highest quality ingredients, using fair-trade farming practices as well as organically grown crops. Water and oil resistant labelling, so you will always know what’s in your bottle. All of our oils are sold by weight not volume. All are weighed on digital scales, by hand. Oils vary widely in density. So oil levels in bottles vary depending on oil. Most soap and personal care product recipes are measured by weight not volume. MPORTANT:\\xa0All Traverse Bay Bath And Body products are for external use only unless otherwise indicated. This information is not intended to diagnose, treat, cure, or prevent any disease, and it should not be used by anyone who is pregnant or under the care of a medical practitioner. Essential Oils must be properly diluted before use in order to avoid any damages to property or adverse physical effects (including injury or bodily harm)']\n{'Brand': 'Traverse Bay Soap Company', 'Item Form': 'Oil', 'Active Ingredients': 'Jojoba', 'Unit Count': '8.0 Ounce', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Item Weight': '8 Ounces', 'UPC': '689860001756', 'Manufacturer': 'Traverse Bay Bath and Body'}\nThis is some good stuff , it's light weight with a light smell , I just wish it came in a 8 oz bottle instead of a jug for easier poring,  I do love it and will definitely repurchase.\nSome Good Jojoba Oil\nTrue by Made Beautiful Hydrating Hair Butter 12oz\nMade Beautiful\n['True by Made Beautiful Hydrating Hair Butter (12oz) defines hair while providing intense moisture and controlling frizz. This nourishing styling butter features a unique blend of honey and mango to provide ultimate moisture as well as shea butter and coconut that penetrates hair to nourish from cuticle to root. True Hydrating Hair Butter is a must have for twisting, Bantu knots, braiding or simply defining your curl pattern. True Hydrating Hair Butter is sulfate-free and paraben-free.']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.6 x 3.6 x 2.7 inches; 12 Ounces', 'Item model number': '8.52788E+11', 'UPC': '852788006503', 'Manufacturer': 'MADE BEAUTIFUL'}\nI bought this with other products from the same line and I love the other products but I felt like this hair butter dried my hair out a little , but it does smell amazing.\nHair Butter\nKinghard Makeup Folding Collapsible Air Drying Cosmetic Brush Organizing Tree Rack Holder\nKinghard®\n{'Brand': 'Kinghard®', 'Skin Type': 'All', 'Item Form': 'Wand', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Is Discontinued By Manufacturer': 'No', 'UPC': '654437380497'}\nThis was the best thing I could have purchased to help dry my makeup brushes , it's sturdy and holds a lot of brushes.\nBrush Drying Rack",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Affinity:** The user maintains a strong preference for high-quality personal grooming tools and elegant accessories. Their recent interaction indicates an interest in functional items that enhance the overall grooming routine while contributing to better organization.\n\n- **Performance Orientation:** While they emphasize effectiveness, their latest purchase reflects a growing appreciation for products that facilitate practical routines, indicating openness to exploring items that improve their overall experience, particularly in the realm of beauty care.\n\n- **Inclusivity:** The user continues to seek versatile, family-friendly products, demonstrating a commitment to usability for a variety of personal care needs within their household.\n\n- **Satisfaction Rating:** Satisfaction remains high, bolstered by positive experiences with impactful products. However, their critical lens on certain formulations is evident, showcasing a discerning mindset toward quality.\n\n- **User Experience:** Aesthetic appeal remains crucial, as the user values the combination of functionality and design elegance. Their pursuit of well-crafted products is ongoing, with a readiness to incorporate new accessories that enhance both performance and organization in personal care routines.\n\nOverall, the user's profile illustrates an evolving journey characterized by a balance of practicality and beauty, showcasing a keen interest in both effectiveness and meticulous organization within their grooming practices.",
  "metrics": {
    "rouge1_f": 0.13658536585365855,
    "rouge2_f": 0.004885993485342019,
    "rougeL_f": 0.07154471544715447,
    "meteor": 0.05242893421807159,
    "bleu1": 0.005776329501970108,
    "bleu2": 0.0013006863893325004,
    "bleu3": 0.000215076951260733,
    "bleu4": 8.754563653082649e-05,
    "bertscore_precision": 0.3470086455345154,
    "bertscore_recall": 0.46866655349731445,
    "bertscore_f1": 0.398764967918396
  }
}