{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Glam Seamless Single Sided Tape for Hair Extension, Replacement Tape for Tape in Hair Extensions - 48 Tape Tabs\nReview Date: 2018/02/26\nAverage Rating: 3.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4 x 2.5 x 0.3 inches; 0.64 Ounces'}\nReview Text: They work well, a much needed thing for fine hair and tape in extensions. The key is to use the tape in extension that has tape already, and rather than sandwiching too tape in extensions together (too heavy for fine hair) you use the single sided tape for the other side. I watched many videos on how to do this and I did it myself and they feel fine. There aren't very many pieces in this package for the price, however. It's a bit expensive for only 48 pieces. I nearly used all of them for one application.<br />Update:  After a full month of having the extensions in. Over-all a good experience but will not order these tapes again.<br />I am changing my rating in follow up.  Impossible to remove without damaging hair. The glue warmed and leaked out the sides over time and caught my hair in the leaked glue. This shortened the length of time I could wear the extensions. I tried to use this one sided tape and it is very shiny, you can see the glimmer of the tape. Not shine free.  I would not use this on fine hair.\nReview Title: Shiny finish, not invisible.Glare under lights is visible with fine hair.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Glam Seamless Single Sided Tape for Hair Extension, Replacement Tape for Tape in Hair Extensions - 48 Tape Tabs\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4 x 2.5 x 0.3 inches; 0.64 Ounces'}\nThey work well, a much needed thing for fine hair and tape in extensions. The key is to use the tape in extension that has tape already, and rather than sandwiching too tape in extensions together (too heavy for fine hair) you use the single sided tape for the other side. I watched many videos on how to do this and I did it myself and they feel fine. There aren't very many pieces in this package for the price, however. It's a bit expensive for only 48 pieces. I nearly used all of them for one application.<br />Update:  After a full month of having the extensions in. Over-all a good experience but will not order these tapes again.<br />I am changing my rating in follow up.  Impossible to remove without damaging hair. The glue warmed and leaked out the sides over time and caught my hair in the leaked glue. This shortened the length of time I could wear the extensions. I tried to use this one sided tape and it is very shiny, you can see the glimmer of the tape. Not shine free.  I would not use this on fine hair.\nShiny finish, not invisible.Glare under lights is visible with fine hair.",
  "profile": "**User Profile Summary:**\n\n- **Hair Care**: The user has a strong interest in hair extensions, particularly tape-in varieties, indicating a priority on enhancing hair volume and length.\n- **Hair Type Consideration**: The user appears to have fine hair, necessitating careful selection of products to avoid damage or excessive weight.\n- **Product Application Insights**: Demonstrates a DIY approach with a preference for instructional resources (videos) to apply products effectively.\n- **Value Sensitivity**: The user expresses concern over product pricing, indicating a desire for cost-effective solutions that offer good value relative to performance.\n- **Performance Expectations**: Initially satisfied with product functionality, but later experiences led to disappointment, particularly regarding removal ease and the impact on hair integrity.\n- **Aesthetic Preferences**: The user is mindful of product appearance, noting that a shiny finish is undesirable, especially under lighting conditions.\n\nOverall, this user seeks effective hair enhancement solutions that are compatible with fine hair, values practicality and usability, and is sensitive to product appearance and price.",
  "metrics": {
    "rouge1_f": 0.29629629629629634,
    "rouge2_f": 0.039702233250620354,
    "rougeL_f": 0.17777777777777776,
    "meteor": 0.17082304073756713,
    "bleu1": 0.24138431636086144,
    "bleu2": 0.05742656792130188,
    "bleu3": 0.022450838499789322,
    "bleu4": 0.007903120241264418,
    "bertscore_precision": 0.42608022689819336,
    "bertscore_recall": 0.4454464316368103,
    "bertscore_f1": 0.43554815649986267
  }
}