{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hair Extensions Clip in Human Hair 7 pcs 120g Clip in Hair Extensions for Women Ombre Hair Extensions Human Hair 16 inch(#16/22)\nReview Date: 2021/04/12\nStore: PLADIO\nAverage Rating: 4.3\nProduct Details: {'Brand': 'PLADIO', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '7.83 x 4.84 x 1.57 inches; 7.83 Ounces'}\nReview Text: I've been using extensions since 2006, due to health issues causing extreme hair thinning.  I used to get the fused extensions at the salon, 1500 dollars back in the day. They broke off from the weight of the extensions because my hair was so fine and thin. The fused glob of hair was just too much and so many fell out. I started buying the clip in hair, taking the clips off and using them as weft hair. I use salon pro white glue, much like eyelash glue but used for weft hair.  It is a wonderful solution and I still alternate between tape in hair and the clip in wefts. I also buy closures and custom color, to make my own toppers. What a job! But, I'm happy with the results. I have more control over the color and style, and I feel 'normal'.<br /><br />This hair is a medium to coarse texture, thick, and has a really nice body wave. The  is soft and smooth and doesn't feel damaged.  It will blend with fine hair. You can use a straightening iron, just be sure that you can control the temperature. Once you burn this hair, it will stink and it will be ruined. However, if you control the temperature and use care, the hair looks great straight and shiny. You can also curl the hair. I have used felted hot rollers, and those work really well. They are safer, and not as damaging, and the curls last so long.<br /><br />These 16\" extensions are very nice. Although the ad isn't quite accurate. The color is a darker caramel blond, and a reddish brown. This is not piano keys, but close. The wefts are not in the ombre style, they are bold and varied high lights. If you look at the ad images, the photos showing the people aren't shown with this product in their hair. The wefts laying on a surface showing the color differences between the offered colors is the most accurate.  I've offered some images that show the color more accurately.  You can custom color most of the wefted hair, but adding color is easier. Typically the hair has so much red in it that it is impossible to cover or remove, and the dye can be hard to remove. You can add a longer root to eliminate the chunky roots.  My hair is so fine, the sewn edge can be obvious, so have a good match to my natural blonde ash tone roots helps. Any coloring will add to the damage and potentially shorten the life of the hair, but for me it makes me happier to have an exact match to what I want, and I am hard to match for color.<br /><br />The weight of the hair is shown in a photo in ounces. In grams, we get a little over 104 grams, far less than the advertised 120grams, and I would complain about this and have, just not for this brand.  That being said, the fullness and the weight is still good, and the wefts seem to feel average when compared to what I usually order. If you order the longer options, the hair will be thinner, as most hair is sold by weight. 120 would be better, of course. This weight is significantly lower than 120grams.<br /><br />Shedding.  Over the last 7 years or so, shedding has become a real problem. It never used to be this bad. There is a weft glue that is meant to slow or prevent shedding and I always use it. It makes the weft more stiff, but if you use the weft the way I use them, you need to do something to protect your weft hair.  You can find it online. If you are using this hair for special occasions and clipping  to thick strong hair and are simply making your hair more full, wild and glamorous, then you may not need to worry about shedding. I did finger comb this hair once out of the packaging, and there was significant shedding. Again, I say, this is a common issue now, and unique to this particular brand. I have no idea what changed but the wefts should not shed this much, but they all do this with most brands.  I have to say that if the wefts didn't shed so much, they would last for a couple of years or longer.  Also, keep in mind I use the wefts differently, so clipping, as intended, may offer longer life and far less shedding.<br /><br />The length is 16\" and the hair hangs nicely, with a gentle, natural taper.  There is a very nice body wave. It's not a blunt edge finish, which is nice.<br /><br />The clips are the same type that I see on most clip in kits. They are small, and hold nicely even on fine hair.<br /><br />Over all, I think this is a great value and will require the extra effort to keep them looking great over a year or more.  To keep human hair looking good and tangle free, I use the sleep and shine shampoo and conditioner. It keeps the hair fresher and mat free longer.  There are a lot  of youtube videos that can help you with application and care, and give you tips and tricks.<br /><br />4 stars.\nReview Title: Pretty nice quality hair for the price.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Glam Seamless Single Sided Tape for Hair Extension, Replacement Tape for Tape in Hair Extensions - 48 Tape Tabs\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4 x 2.5 x 0.3 inches; 0.64 Ounces'}\nThey work well, a much needed thing for fine hair and tape in extensions. The key is to use the tape in extension that has tape already, and rather than sandwiching too tape in extensions together (too heavy for fine hair) you use the single sided tape for the other side. I watched many videos on how to do this and I did it myself and they feel fine. There aren't very many pieces in this package for the price, however. It's a bit expensive for only 48 pieces. I nearly used all of them for one application.<br />Update:  After a full month of having the extensions in. Over-all a good experience but will not order these tapes again.<br />I am changing my rating in follow up.  Impossible to remove without damaging hair. The glue warmed and leaked out the sides over time and caught my hair in the leaked glue. This shortened the length of time I could wear the extensions. I tried to use this one sided tape and it is very shiny, you can see the glimmer of the tape. Not shine free.  I would not use this on fine hair.\nShiny finish, not invisible.Glare under lights is visible with fine hair.\nLDR by Baysyx - Restorative Glow Hydro Boost Moisturizer | Nourishing Hydration Cream with Collagen Stimulation | Fortified with Hyaluronic Acid | Made in The USA from Natural Ingredients (1.7 Oz)\nLDR\n{'Brand': 'LDR', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '6.3 x 1.2 x 1.1 inches; 1.7 Ounces', 'UPC': '725835779579', 'Manufacturer': 'LDR'}\nThe fragrance is nice and light, subtle like a soft lemon dessert. The bottle seems oversized for the amount of product inside, and as I popped the top up the bottom slipped up and the cap fell off the inner bottle. Photo is provided so you can see what I mean, it's not a deal breaker but for the vanity it will bother people. It's a glamorous container and product, so I'm sure this flaw isn't intended. I offer a photo of one pump of product in my palm. It spreads over the skin nicely and absorbs well. One pump is nearly enough for the entire face, I also have used the lotion on my elbows, backs of my hands, neck and decolletage.  So far the lotion is reacting well with my skin and I like it. The container is attractive and it does fit the hand well and feels comfortable to hold.  The product is gentle and feels good on the skin. I'll check back with results and feedback after one bottle.\nSmells great, light lemony fragrance, silky texture.\nALLÉGRESSE 24 KARAT SKINCARE Gold Refining Facial Serum - Anti Aging & Anti Wrinkle Serum for Plumper, Firmer and Smoother Skin – Formulated With Progeline, Superox-C, 1 oz\nALLÉGRESSE 24 KARAT SKINCARE\n{'Skin Type': 'Sensitive', 'Product Benefits': '24 Karat Gold. Blends in a delightful mixture of essential oils, active ingredients, and plant extracts.24 Karat Gold. Blends in a delightful mixture of essential oils, active ingredients, and plant extracts.  See more', 'Scent': 'Cucumber', 'Brand': 'ALLÉGRESSE 24 KARAT SKINCARE', 'Item Form': 'Serum', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.6 x 2.6 x 5.5 inches; 1 Ounces', 'Item model number': 'I0107554', 'UPC': '850004645093', 'Manufacturer': 'ALLÉGRESSE 24 KARAT SKINCARE'}\nUsually a serum is immediately effective at deep hydration, fine line and dryness management even if temporary. Usually the under eye area darkness, under eye wrinkles, puffiness, and crows feet are treated and diminished within minutes of first application and improves the look of make up in those areas as well. Perhaps over time the texture of the skin improves with continued use but can backslide if product use is discontinued.<br /><br /> I have not seen much improvement, immediate or over the few days with use twice daily while using this product, unfortunately. Also, I'm not sure when we are supposed to use this product. Perhaps over night? The reason why I mention this is that the product doesn't absorb into the skin cleanly, but rather is tacky to the touch and feels heavy. I didn't notice any fragrance, but I make candles and am probably nose blind at the moment. The product feels like a watery jelly, because it is mostly water and aloe gel.  It does have gold flecks in it and they seem to break up and disappear when on the skin, massaged. I haven't seen any help for fine lines or skin texture. This is a photo taken right now. Un-retouched The left side of the photo is the 24k serum side, after three days and after recent application. The right side is immediate results of another product I use applied within a half hour of the photo. It works so fast, even I couldn't believe the photo. The lines on the other side are pretty bad actually, which means I've back slid over the last few days and have more trouble. I've been using the 24K serum on half of my face, the right side of my face only. As to the right side of the photo and left side of my face, I'm not pulling on it or doing anything to make the skin look better, less wrinkled or tighter, I just put the serum on and wrote for a bit and then took the photo to complete this review. The right side serum is from a farmer's market made by a local person, Julia's. This roll on was only 15 dollars and I've been using it for under eye area on days when I wear makeup,  for a few months.  I felt I should offer a photo, although not a great photo and it's not flattering at all. I'll continue to try it, but at my age I need all the help I can get and don't want to backslide.\nNot too convinced about claims after use for a few days.\nLovrio 20\" 20 Pcs 50g Tape in Human Hair Balayage Ash Brown/Light Chestnut Brown Fading to Dirty Blonde and Platinum Blonde B8-18-60 Silky Straight Hair\nLOVRIO\n{'Brand': 'LOVRIO', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '10.28 x 4.13 x 1.93 inches; 6.38 Ounces', 'UPC': '633085357044'}\nThese are 20\" extensions, and I usually order 14\" or 16\". 20\" is on the long side and I will be trimming the length for my taste and toning the hair as well. When I order next I'll be ordering the shorter hair.  The weight of the hair for 20 pieces, is 50grams, so for each longer strand you have a finer tape in weft. With the shorter lengths you get a little more fullness in other words but typically the good brands still make sure they are clear about the weight of the hair you get in grams. My hair is so fine that one bundle of 20 nearly is enough, but I buy 2 sets and end up using 4 rows of about 6 extensions each then complete the look with a topper because my crown is so thin the extensions and scalp shows. I'll be toning these extensions but this is how they look as they came, with no color correction. B 8-18-60. Which is usually the color I order, but this is better. This color matches my hair better than the brand I have been using.<br /><br />I do a single weft application using a single sided tape to finish the back side of the weft and seal the tape. You must seal the backside of the tape or the weft will fall out, or make a mess of your hair. Many people need 4 or more sets to do a full head of hair. Some people with thicker and stronger hair will use two full wefts back to back and will not need the single sided tape. There are you tube videos about DIY application of tape in extensions. There are many steps and I'm skipping most of it. It's not that hard and you'll enjoy the convenience and savings by doing this yourself. Your biggest challenge is finding good hair and good tapes. This time used Glam single sided tapes and that worked great. expensive but good and you get 36 in the package. I use walker double sided tapes, they come in packages of 120 and have worked for me but they are stiff. This brand has tapes, and I'll be checking out their tapes soon.  I will have to update to let you know how they last and how easy or difficult they are to remove. Typically my tape in hair lasts about 6 weeks and then due to growth there is a need to take them out and put them back in again, moving them up closer to the scalp. 6 to 8 weeks is typically when you go to the salon to get cut and root touch ups too. This isn't really about hold or the extensions coming out, although some may come out. This is about limiting damage to the hair and just keeping the connection point closer to the scalp. They feel good, the hair quality seems great. There is far less red in this hair than typical of the dark blonds or ash blond roots.  This color combination is good. The description says silky straight but I prefer some body wave, and as you can see when you wet this hair there is a little natural wave that comes out. That's perfect. I've offered plenty of photos. The kit that the hair came with is nice too. Some double sided tapes to refresh your weft after you clean them in 6 weeks or so.  To remove the wefts I typically just stick my finger nail between the two layers of tape and put a drop or two with a dropper of alcohol 91 percent will work but 99 is better. This usually works to safely loosen the glue bond and remove the hair. I tried the oil based removers and it just complicates things. The best removers are mostly alcohol. I'll update this review in 6 to 8 weeks. For now, I'd recommend these extension for the hair and weft quality and accuracy of color and weight.  Good value. 5 starts. I hope they keep this up.\nExcellent tape in hair extensions\n20 PCS Zoostliss Nail Polish Remover Clips\nZoostliss\n{'Brand': 'Zoostliss', 'Number of Items': '20', 'Unit Count': '20 Count', 'Package Dimensions': '6.6 x 5.1 x 1.8 inches; 3.99 Ounces'}\nGreat value and exactly as expected and as advertised. Comfortable.  Two sets for just under 5 dollars including shipping at the time of this review. I'm using these clips to remove gel nail polish on my fingernails and toenails. They work well so far. I'll update with longevity and durability.  cotton pads are sold separately. 5 stars.\nGreat!\nJARGOD 1pcs 100% Kolinsky Sable Acrylic Nails Round Nail Art Brush (size 2)\nJARGOD\n{'Brand': 'JARGOD', 'Handle Material': 'Acrylic', 'Head Material': 'Kolinsky', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.78 x 0.5 x 0.5 inches; 0.81 Ounces'}\nI ordered a size 2, and received a size 8.  The brush is very nice, but huge for my purpose.  Very nice brush quality though.\nGreat brush but the wrong size.\nRed Carpet Manicure Starter Kits\n{'Color': 'RCM Essentials Starter Kit', 'Material': 'Acrylic', 'Brand': 'RC Red Carpet Manicure', 'Finish Type': 'Glossy', 'Item Form': 'Gel', 'Is Discontinued By Manufacturer': 'No', 'UPC': '817248203854', 'Manufacturer': 'RC Red Carpet Manicure/ Zupishi'}\nThis product is exactly as advertised and shown in the images. This mini system does not come with color, so be prepared.  The packaging is attractive, and the products came very well packaged and arrived safely in perfect condition.  This gel nail polish kit has  a little different texture than some of the kits available these days. This system has a complete nail prep and foundation product line-up much like the really great gel nails from 20 years ago. I'm hoping the long term quality of the nail growth and health with this product line,  is as good as the old products as well. As well all know, products can help your nails or destroy them, and this product line, the formulas remind me of the better products that were once available and were very expensive to buy.<br /><br />The thing people may not be used to is the last step of using the finishing wipe to remove the sticky layer once the manicure is complete. Some top coats are completely set and free of any tackiness right after the curing process. These products cure quickly with some heat, and 60 seconds seemed to be plenty of time. After the top coat and final removal of the tackiness, the nails are perfect. This kit doesn't come with color, so I experimented with a milky white and some blue ink, using the wood tools included in the kit to move and swirl the pigment around. It's a fun, creative way to change  up polish. I think stencils could be fun, and I do have mica powders, some bling pieces, to play with as well. I like these products, and the box came with a nice catalogue of other products available.<br /><br />This product is easy to use, I've experienced no irritation of my cuticles or nail bed, no itching or discomfort at all. The light is really cute, tiny and it works. Just one easy button and it turns off automatically in a minute. I pressed twice to get 2 minutes but found that 1 minute was enough, which is great. The result of this product is thin, but strong, offering flexibility of the nail as well, and no cracking. I'll update with wear and removal.  Very reasonable and competitive value.  5 stars.\nThis is a great product line.\nUntangled Fine Tooth Pin Tail Parting Comb - For Difficult Styling and Hair Extensions\nUntangled\n{'Material': 'Stainless Steel', 'Brand': 'Untangled', 'Hair Type': 'Fine, Thin', 'Unit Count': '1.00 Count'}\nThis is a great comb. The material is strong but flexible. It has a nice feel and texture. It's not too fine or wide in the tooth spacing. The metal tail is slightly smoothed and rounded for safety when coming in contact with your delicate scalp. Some combs can be too pointy and can be painful.  I use various products to boost the illusion of thick, healthy hair. I use color, highlights, tape in wefts and glue in hair, as well as toppers and sometimes wigs. All of these helpful products are impossible without a great 'Pin Tail' comb to help you with perfect sectioning and parts.  5 stars. I will update with longevity as needed, but right now I am quite happy with this comb.\nMust have for extensions and precision color.\nHair Extensions Clip in Human Hair 7 pcs 120g Clip in Hair Extensions for Women Ombre Hair Extensions Human Hair 16 inch(#16/22)\nPLADIO\n{'Brand': 'PLADIO', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '7.83 x 4.84 x 1.57 inches; 7.83 Ounces'}\nI've been using extensions since 2006, due to health issues causing extreme hair thinning.  I used to get the fused extensions at the salon, 1500 dollars back in the day. They broke off from the weight of the extensions because my hair was so fine and thin. The fused glob of hair was just too much and so many fell out. I started buying the clip in hair, taking the clips off and using them as weft hair. I use salon pro white glue, much like eyelash glue but used for weft hair.  It is a wonderful solution and I still alternate between tape in hair and the clip in wefts. I also buy closures and custom color, to make my own toppers. What a job! But, I'm happy with the results. I have more control over the color and style, and I feel 'normal'.<br /><br />This hair is a medium to coarse texture, thick, and has a really nice body wave. The  is soft and smooth and doesn't feel damaged.  It will blend with fine hair. You can use a straightening iron, just be sure that you can control the temperature. Once you burn this hair, it will stink and it will be ruined. However, if you control the temperature and use care, the hair looks great straight and shiny. You can also curl the hair. I have used felted hot rollers, and those work really well. They are safer, and not as damaging, and the curls last so long.<br /><br />These 16\" extensions are very nice. Although the ad isn't quite accurate. The color is a darker caramel blond, and a reddish brown. This is not piano keys, but close. The wefts are not in the ombre style, they are bold and varied high lights. If you look at the ad images, the photos showing the people aren't shown with this product in their hair. The wefts laying on a surface showing the color differences between the offered colors is the most accurate.  I've offered some images that show the color more accurately.  You can custom color most of the wefted hair, but adding color is easier. Typically the hair has so much red in it that it is impossible to cover or remove, and the dye can be hard to remove. You can add a longer root to eliminate the chunky roots.  My hair is so fine, the sewn edge can be obvious, so have a good match to my natural blonde ash tone roots helps. Any coloring will add to the damage and potentially shorten the life of the hair, but for me it makes me happier to have an exact match to what I want, and I am hard to match for color.<br /><br />The weight of the hair is shown in a photo in ounces. In grams, we get a little over 104 grams, far less than the advertised 120grams, and I would complain about this and have, just not for this brand.  That being said, the fullness and the weight is still good, and the wefts seem to feel average when compared to what I usually order. If you order the longer options, the hair will be thinner, as most hair is sold by weight. 120 would be better, of course. This weight is significantly lower than 120grams.<br /><br />Shedding.  Over the last 7 years or so, shedding has become a real problem. It never used to be this bad. There is a weft glue that is meant to slow or prevent shedding and I always use it. It makes the weft more stiff, but if you use the weft the way I use them, you need to do something to protect your weft hair.  You can find it online. If you are using this hair for special occasions and clipping  to thick strong hair and are simply making your hair more full, wild and glamorous, then you may not need to worry about shedding. I did finger comb this hair once out of the packaging, and there was significant shedding. Again, I say, this is a common issue now, and unique to this particular brand. I have no idea what changed but the wefts should not shed this much, but they all do this with most brands.  I have to say that if the wefts didn't shed so much, they would last for a couple of years or longer.  Also, keep in mind I use the wefts differently, so clipping, as intended, may offer longer life and far less shedding.<br /><br />The length is 16\" and the hair hangs nicely, with a gentle, natural taper.  There is a very nice body wave. It's not a blunt edge finish, which is nice.<br /><br />The clips are the same type that I see on most clip in kits. They are small, and hold nicely even on fine hair.<br /><br />Over all, I think this is a great value and will require the extra effort to keep them looking great over a year or more.  To keep human hair looking good and tangle free, I use the sleep and shine shampoo and conditioner. It keeps the hair fresher and mat free longer.  There are a lot  of youtube videos that can help you with application and care, and give you tips and tricks.<br /><br />4 stars.\nPretty nice quality hair for the price.",
  "profile": "**User Profile Summary:**\n\n- **Hair Care**: The user demonstrates a robust interest in various hair extension options, including clip-ins and tape-ins, focusing on achieving volume and length with color accuracy. Their experience with multiple application methods, such as using glue for wefted hair, showcases their commitment to DIY techniques and control over styling. They prioritize quality in extensions, keen on achieving a natural look while addressing their hair thinning concerns.\n\n- **Skin Care**: Their skincare routine continues to emphasize anti-aging serums formulated for sensitive skin, seeking products that are effective without compromising their skin's integrity.\n\n- **Nail Care**: They engage with nail care and creativity, as evidenced by their purchases of high-quality tools and starter kits, indicating a trend towards self-expression and experimentation.\n\n- **Product Application Insights**: A strong preference for DIY applications is consistent across beauty categories, with the user valuing instructional content for effective product use.\n\n- **Value Sensitivity**: The user maintains a price-sensitive approach, favoring cost-effective yet high-quality beauty solutions.\n\n- **Performance Expectations**: They expect efficient functionality across products, with a particular emphasis on minimizing damage and achieving lasting results.\n\n- **Aesthetic Preferences**: Light, non-tacky textures and natural finishes remain important, with a clear aversion to unsightly appearances.\n\nOverall, the user seeks practical, effective, and aesthetically pleasing beauty solutions, with an emphasis on precision and personal customization in their hair and beauty routine.",
  "metrics": {
    "rouge1_f": 0.07203389830508475,
    "rouge2_f": 0.013248542660307366,
    "rougeL_f": 0.038135593220338986,
    "meteor": 0.02395051980523753,
    "bleu1": 8.516825022877648e-07,
    "bleu2": 3.650564966153468e-07,
    "bleu3": 1.3415239355728936e-07,
    "bleu4": 3.4778412143790064e-08,
    "bertscore_precision": 0.392569899559021,
    "bertscore_recall": 0.5234473347663879,
    "bertscore_f1": 0.44865894317626953
  }
}