{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nReview Date: 2020/09/13\nStore: Vedory\nProduct Description: ['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nReview Text: This one was a dud for me. Although the bracket did stay in place it made me look like an anteater. It only would work with certain masks. The plastic was hard, but looks like it would be easy to clean. I used a couple times, but have just gone back to not wearing anything.\nReview Title: Skip this face mask bracket\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "lorelo 4 Pieces Nail Dotting Pen, Dual-ended Nail Dotting Pen Liner Brush Nail Art Point Drill Drawing Tools Set Nail Art DIY Decoration Tool\nlorelo\n{'Package Dimensions': '7.3 x 4.2 x 0.6 inches; 1.59 Ounces', 'UPC': '619156572950'}\nGreat quality product. Looks just like the picture.\nNice quality product\nDisposable Shower Cap, Elastic Bath Cap,Waterproof Hair Head Cover Shower Cap For Home Use,Hotel and Beauty Salon,Pack of 120 （Blue)\nKarlunKoy\n{'Brand': 'KarlunKoy', 'Material': 'Ethylene Vinyl Acetate (EVA)', 'Pattern': 'Solid', 'Number of Items': '120', 'Inner Material': 'EVA', 'Package Dimensions': '8.14 x 7.2 x 3.34 inches; 4.8 Ounces', 'UPC': '714573871218'}\nI was super excited to receive this bag, unfortunately they are not big enough to hold my long hair. Nice material and color.\nNot for long hair.\n3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nVedory\n['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\n{'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nThis one was a dud for me. Although the bracket did stay in place it made me look like an anteater. It only would work with certain masks. The plastic was hard, but looks like it would be easy to clean. I used a couple times, but have just gone back to not wearing anything.\nSkip this face mask bracket",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** The user continues to exhibit a strong interest in beauty and self-care products, now integrating essentials for both hair care and face mask accessories, alongside nail art tools. \n- **Quality Preference:** They maintain an unwavering emphasis on high-quality and dependable products, as highlighted by the recent dissatisfaction with a purchase where the product's appearance did not correlate with functionality, underscoring their critical evaluation of new items.\n- **Visual Appeal:** The user prioritizes aesthetic consistency and visual expectations in products, demonstrating preferences for materials and colors that enhance their overall experience.\n- **DIY Enthusiasm:** Their enthusiasm for DIY projects has broadened to include not just nail art but also home beauty essentials and multifunctional accessories, aligning with a lifestyle that values creativity and personalization.\n- **Rating Behavior:** The user typically provides high ratings to products that meet or exceed their expectations. However, recent behavior indicates a more discerning approach, as they are willing to express disappointment when products fail to align with their needs, even when certain aspects remain favorable.\n\nOverall, the user is a creative individual focused on beauty projects, seeking high-quality tools and essentials that ensure a satisfying DIY experience while maintaining a critical eye toward functionality and design.",
  "metrics": {
    "rouge1_f": 0.20284697508896796,
    "rouge2_f": 0.025,
    "rougeL_f": 0.0889679715302491,
    "meteor": 0.1335084233830031,
    "bleu1": 0.13307098551850433,
    "bleu2": 0.02237788765328395,
    "bleu3": 0.004556413715948413,
    "bleu4": 0.0020580384296553186,
    "bertscore_precision": 0.3644821047782898,
    "bertscore_recall": 0.419478178024292,
    "bertscore_f1": 0.39005112648010254
  }
}