{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Wiwoseo Faux Mink Lashes False Eyelashes Dramatic 20MM Long Wispy Cat Eyes Look Lashes 20 Pairs Mixed 2 Styles Fake Eye Lashes Wholesale Pack\nReview Date: 2020/10/13\nStore: wiwoseo\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Wiwoseo', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '9 x 7.6 x 0.7 inches; 1.59 Ounces', 'Item model number': 'F1507-5'}\nReview Text: Great dramatic lashes.  For me I had to cut to fit my eye, but it was was easy.  They stayed on all night when I went out and they feel very soft. I got several uses out of one pair, which is always nice.  Big package so no need to clean just throw out once you are done and grab a new pair.\nReview Title: pretty dramatic lashes for going out!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "lorelo 4 Pieces Nail Dotting Pen, Dual-ended Nail Dotting Pen Liner Brush Nail Art Point Drill Drawing Tools Set Nail Art DIY Decoration Tool\nlorelo\n{'Package Dimensions': '7.3 x 4.2 x 0.6 inches; 1.59 Ounces', 'UPC': '619156572950'}\nGreat quality product. Looks just like the picture.\nNice quality product\nDisposable Shower Cap, Elastic Bath Cap,Waterproof Hair Head Cover Shower Cap For Home Use,Hotel and Beauty Salon,Pack of 120 （Blue)\nKarlunKoy\n{'Brand': 'KarlunKoy', 'Material': 'Ethylene Vinyl Acetate (EVA)', 'Pattern': 'Solid', 'Number of Items': '120', 'Inner Material': 'EVA', 'Package Dimensions': '8.14 x 7.2 x 3.34 inches; 4.8 Ounces', 'UPC': '714573871218'}\nI was super excited to receive this bag, unfortunately they are not big enough to hold my long hair. Nice material and color.\nNot for long hair.\n3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nVedory\n['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\n{'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nThis one was a dud for me. Although the bracket did stay in place it made me look like an anteater. It only would work with certain masks. The plastic was hard, but looks like it would be easy to clean. I used a couple times, but have just gone back to not wearing anything.\nSkip this face mask bracket\nNail Files 16 Pcs, Double Sided Emery Board Manicure Tools for Filing Natural Gel and Acrylic Nails for Home and Salon Use\nKeiby Citom\n{'Material': 'Acrylic', 'Brand': 'Keiby Citom', 'Grit Number': '100', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.8 x 5.08 x 0.59 inches; 5.29 Ounces', 'UPC': '742025065137', 'Manufacturer': 'YHIT'}\nThick nail files. Very high end quality. Got plenty for the price. Work as expected, even better.\nGreat quality nail file\nHemp Lotion for Dry Skin - Soothing Rose Flower & Aloe Hydrate Your Complexion - Non-Greasy, Vegan, 7Oz, 250Mg Hemp, Fragrance & Paraben Free - Guayaquil By La La Leaf\nLA LA LEAF\n{'Brand': 'LA LA LEAF', 'Item Form': 'Lotion', 'Unit Count': '7.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Package Dimensions': '8.19 x 2.28 x 2.17 inches; 8.78 Ounces', 'UPC': '860002750125'}\nAmazing lotion, probably one of the best I have used.  My skin stays glowing after forever. There is no scent which is nice. Pretty packaging.\nAmazing lotion\n1513 by LA LA LEAF - All Natural Facial Cream, 750mg Quick Absorbing Hemp Moisturizer with Rosehip, Carrot Seed and Provitamin B5 - Smooths Wrinkles for Firm Glowing Skin - Paraben-free, Cruelty-free, Vegan\nLA LA LEAF\n{'Brand': 'LA LA LEAF', 'Item Form': 'Cream', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Package Dimensions': '7.1 x 3.2 x 2 inches; 2.4 Ounces'}\nThis cream will leave your skin glowing! I have always had an issue with oily skin and this cream made it oily x 10.  My skin did not feel softer, just oily.  There is no scent which i appreciate.  The black and white packaging is pretty.\nBe prepared for oily skin!\nWiwoseo Faux Mink Lashes False Eyelashes Dramatic 20MM Long Wispy Cat Eyes Look Lashes 20 Pairs Mixed 2 Styles Fake Eye Lashes Wholesale Pack\nwiwoseo\n{'Brand': 'Wiwoseo', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '9 x 7.6 x 0.7 inches; 1.59 Ounces', 'Item model number': 'F1507-5'}\nGreat dramatic lashes.  For me I had to cut to fit my eye, but it was was easy.  They stayed on all night when I went out and they feel very soft. I got several uses out of one pair, which is always nice.  Big package so no need to clean just throw out once you are done and grab a new pair.\npretty dramatic lashes for going out!",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** The user is increasingly interested in beauty and self-care products, specifically focusing on skincare lotions to combat dryness and enhance visual appeal. They have expanded their interest to include accessories like false eyelashes that contribute to their beauty routine.\n\n- **Quality Preference:** Their commitment to high-quality products continues to strengthen, fueled by positive experiences. They prioritize functionality, seeking products that elevate their beauty regimen without sacrificing performance.\n\n- **Visual Appeal:** The user values aesthetically pleasing items, extending their preference for minimalistic and stylish packaging to both skincare and makeup accessories, ensuring a cohesive beauty routine.\n\n- **DIY Enthusiasm:** Their enthusiasm for DIY projects is evident, with a growing desire for personalization and creativity in beauty-related endeavors, particularly in crafting unique looks with makeup.\n\n- **Rating Behavior:** The user has developed a more discerning approach to product evaluations, giving high ratings only to those that meet their rigorous standards. Recent feedback indicates a desire for functional benefits, including durability and comfort in products like false eyelashes, while they remain critical of excess oiliness in skincare.\n\nIn summary, this user is a creatively inclined individual prioritizing high-quality beauty solutions that merge functionality with visual aesthetics, with a critical eye towards product effectiveness and value.",
  "metrics": {
    "rouge1_f": 0.13849287169042768,
    "rouge2_f": 0.004081632653061225,
    "rougeL_f": 0.06109979633401221,
    "meteor": 0.06314847910172625,
    "bleu1": 0.018984848841876453,
    "bleu2": 0.002027694856344386,
    "bleu3": 0.00044712378273291706,
    "bleu4": 0.00021016577912372244,
    "bertscore_precision": 0.35366788506507874,
    "bertscore_recall": 0.45006704330444336,
    "bertscore_f1": 0.3960864841938019
  }
}