{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lnlofen 2Pcs Hollow Woven Headband with Clips, Fashion Braided Headbands Double Layer Twist Plait Headband Hair Tools, Double Bangs Hairstyle Hairpin for Women Girls (Brown & Black)\nReview Date: 2020/11/30\nStore: Lnlofen\nAverage Rating: 3.5\nProduct Details: {'Age Range (Description)': 'Adult', 'Material': 'Resin', 'Number of Items': '1', 'Brand': 'Lnlofen', 'Size': '2 Count (Pack of 1)', 'Package Dimensions': '11.69 x 7.83 x 0.59 inches; 1.34 Ounces', 'UPC': '768894803793'}\nReview Text: I haven't worn a headband in years. These are soft and easy to wear, they dont hurt your head. Cute, unique design.\nReview Title: Fun unique design\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "lorelo 4 Pieces Nail Dotting Pen, Dual-ended Nail Dotting Pen Liner Brush Nail Art Point Drill Drawing Tools Set Nail Art DIY Decoration Tool\nlorelo\n{'Package Dimensions': '7.3 x 4.2 x 0.6 inches; 1.59 Ounces', 'UPC': '619156572950'}\nGreat quality product. Looks just like the picture.\nNice quality product\nDisposable Shower Cap, Elastic Bath Cap,Waterproof Hair Head Cover Shower Cap For Home Use,Hotel and Beauty Salon,Pack of 120 （Blue)\nKarlunKoy\n{'Brand': 'KarlunKoy', 'Material': 'Ethylene Vinyl Acetate (EVA)', 'Pattern': 'Solid', 'Number of Items': '120', 'Inner Material': 'EVA', 'Package Dimensions': '8.14 x 7.2 x 3.34 inches; 4.8 Ounces', 'UPC': '714573871218'}\nI was super excited to receive this bag, unfortunately they are not big enough to hold my long hair. Nice material and color.\nNot for long hair.\n3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nVedory\n['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\n{'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nThis one was a dud for me. Although the bracket did stay in place it made me look like an anteater. It only would work with certain masks. The plastic was hard, but looks like it would be easy to clean. I used a couple times, but have just gone back to not wearing anything.\nSkip this face mask bracket\nNail Files 16 Pcs, Double Sided Emery Board Manicure Tools for Filing Natural Gel and Acrylic Nails for Home and Salon Use\nKeiby Citom\n{'Material': 'Acrylic', 'Brand': 'Keiby Citom', 'Grit Number': '100', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.8 x 5.08 x 0.59 inches; 5.29 Ounces', 'UPC': '742025065137', 'Manufacturer': 'YHIT'}\nThick nail files. Very high end quality. Got plenty for the price. Work as expected, even better.\nGreat quality nail file\nHemp Lotion for Dry Skin - Soothing Rose Flower & Aloe Hydrate Your Complexion - Non-Greasy, Vegan, 7Oz, 250Mg Hemp, Fragrance & Paraben Free - Guayaquil By La La Leaf\nLA LA LEAF\n{'Brand': 'LA LA LEAF', 'Item Form': 'Lotion', 'Unit Count': '7.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Package Dimensions': '8.19 x 2.28 x 2.17 inches; 8.78 Ounces', 'UPC': '860002750125'}\nAmazing lotion, probably one of the best I have used.  My skin stays glowing after forever. There is no scent which is nice. Pretty packaging.\nAmazing lotion\n1513 by LA LA LEAF - All Natural Facial Cream, 750mg Quick Absorbing Hemp Moisturizer with Rosehip, Carrot Seed and Provitamin B5 - Smooths Wrinkles for Firm Glowing Skin - Paraben-free, Cruelty-free, Vegan\nLA LA LEAF\n{'Brand': 'LA LA LEAF', 'Item Form': 'Cream', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Package Dimensions': '7.1 x 3.2 x 2 inches; 2.4 Ounces'}\nThis cream will leave your skin glowing! I have always had an issue with oily skin and this cream made it oily x 10.  My skin did not feel softer, just oily.  There is no scent which i appreciate.  The black and white packaging is pretty.\nBe prepared for oily skin!\nWiwoseo Faux Mink Lashes False Eyelashes Dramatic 20MM Long Wispy Cat Eyes Look Lashes 20 Pairs Mixed 2 Styles Fake Eye Lashes Wholesale Pack\nwiwoseo\n{'Brand': 'Wiwoseo', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '9 x 7.6 x 0.7 inches; 1.59 Ounces', 'Item model number': 'F1507-5'}\nGreat dramatic lashes.  For me I had to cut to fit my eye, but it was was easy.  They stayed on all night when I went out and they feel very soft. I got several uses out of one pair, which is always nice.  Big package so no need to clean just throw out once you are done and grab a new pair.\npretty dramatic lashes for going out!\nLnlofen 2Pcs Hollow Woven Headband with Clips, Fashion Braided Headbands Double Layer Twist Plait Headband Hair Tools, Double Bangs Hairstyle Hairpin for Women Girls (Brown & Black)\nLnlofen\n{'Age Range (Description)': 'Adult', 'Material': 'Resin', 'Number of Items': '1', 'Brand': 'Lnlofen', 'Size': '2 Count (Pack of 1)', 'Package Dimensions': '11.69 x 7.83 x 0.59 inches; 1.34 Ounces', 'UPC': '768894803793'}\nI haven't worn a headband in years. These are soft and easy to wear, they dont hurt your head. Cute, unique design.\nFun unique design",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** The user continues to show a strong interest in beauty and self-care products, particularly in skincare lotions for combating dryness and enhancing visual appeal. They are also exploring accessories, such as fashionable headbands, to complement their beauty routine.\n\n- **Quality Preference:** Their commitment to high-quality products remains robust, driven by positive experiences that emphasize functionality and aesthetic appeal. The user favors items that enhance their beauty regimen without compromising performance.\n\n- **Visual Appeal:** Aesthetic considerations are essential to the user, who appreciates minimalistic and stylish packaging across both skincare and makeup accessories, fostering a cohesive beauty routine.\n\n- **DIY Enthusiasm:** The user demonstrates a keen interest in DIY projects, particularly in creating personalized beauty looks. This reflects a growing desire for creativity and uniqueness in their beauty endeavors.\n\n- **Rating Behavior:** The user has adopted a discerning approach to product evaluations, granting higher ratings only to those that align with their rigorous standards. Their recent feedback underscores a preference for functional benefits, such as comfort and durability in accessories, alongside a critical stance towards excess oiliness in skincare products.\n\nIn summary, this user is a creatively inclined individual who prioritizes high-quality, visually appealing beauty solutions that blend functionality with an aesthetic flair, while maintaining a critical perspective on product effectiveness and value.",
  "metrics": {
    "rouge1_f": 0.11502782931354359,
    "rouge2_f": 0.005576208178438662,
    "rougeL_f": 0.057513914656771796,
    "meteor": 0.055640098915731406,
    "bleu1": 0.012945923355264101,
    "bleu2": 0.001989474482086228,
    "bleu3": 0.0003930658654978805,
    "bleu4": 0.00017487659169998282,
    "bertscore_precision": 0.3502294421195984,
    "bertscore_recall": 0.4454317092895508,
    "bertscore_f1": 0.39213499426841736
  }
}