{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NIRA Skincare Laser & Serum Bundle - Includes Anti-Aging Laser & Hyaluronic Acid Serum - Reduces Appearance of Fine Lines & Wrinkles - FDA Cleared\nReview Date: 2021/12/13\nStore: Nira\nAverage Rating: 3.8\nProduct Details: {'Skin Type': 'Dry', 'Product Benefits': 'Hydration', 'Use for': 'Face', 'Scent': 'Aloe', 'Brand': 'Nira'}\nReview Text: So far, I have no real complaints about this NIRA Skincare Laser & Hyaluronic Acid Serum Bundle. I’m still at the point where I’m not sure if I can say it truly works because I need to use it for a longer period of time, but I’ll discuss various aspects about the product that will hopefully help with your decision-making.<br /><br />-Came well-packaged in a small, but sturdy cardboard box. Everything arrived intact. I have continued to use this box for storage of the product.<br />-Comes with the handheld laser device, charger with base to plug into an outlet, and manual<br />-No complaints about the battery life so far<br />-Simple to use: there are two buttons: The power button that turns the device on. Then you can press it to cycle through the various levels of intensity 1-5 which are clearly shown using green light bars. You can then hold the power button down to turn the device off again. The top button can be pressed to activate the laser after you have chosen the level of intensity you want.<br />-The laser only works if positioned correctly over an area of skin. It will give a single negative sounding beep if not positioned correctly, and a positive sounding double beep if it is positioned correctly as the laser works. You wait to move the device to the next area after you hear that second beep indicating that it is finished with that laser sequence<br />-The device has a white, plastic outer shell. It is lightweight while still feeling sturdy and durable. I would still be very careful not to drop this as I’m not sure how it could handle a fall<br />-I would recommend experimenting on the lower intensity settings. The undereye area is pretty sensitive. I feel I have a pretty high pain tolerance, but my eyes often still tear up after using per instructions on the highest settings of 4 and 5. For whatever reason, my left eye is much more sensitive to this.<br />-I don’t want to say it is truly painful, but I suppose the best way to describe the sensation is almost similar to if you were being stung by a rubber band that you pulled back and let hit your skin if that makes sense. It isn’t comfortable, but you do get more used to this and can work your way up to a higher level of intensity. You will probably also feel some warmth on the skin after using.<br />-I know this is marketed for under the eyes, but I have also been using on my forehead and by my smile lines.<br /><br />***The instruction manual is pretty clear and straightforward. You definitely need to read this before getting started. Here is some information that you can find within the manual:<br /><br />-They say all skin tones and anyone over the age of 12 can use NIRA to reduce the appearance of wrinkles around the eyes<br />-You need to clean and dry your face just prior to using NIRA<br />-It can be using morning or night and up to twice daily. They recommend waiting 1 minute before retreating each area and not to treat more than twice within a 1-hour period.<br />-Do not treat the same spot twice in a row, even if the pulse is rejected and you get the low pitched, negative sounding beep<br />-The instructions clearly show you the recommended way to treat the undereye area and the treatment pattern to use<br />-They recommend using the highest power level where you feel warmth without pain<br />-You should use a facial moisturizer after each treatment and a daily sunscreen with at least SPF 30 is recommended. This bundle includes the hyaluronic acid serum which can also be used.<br />-Device should be kept clean and free of dust, especially the glass lens which can be cleaned with a cotton swab. Surfaces can be cleaned with 70% alcohol solution between each use.<br />-They say some potential side effects include: skin warmth, redness, and stinging. Less frequent side effects include dryness, roughness, tanned appearance to skin, swelling, flaking, itching, crusting, bruising, pimple-like rash, irritated skin, blistering, scarring, infection, and skin color changes where your skin may become darker or lighter. I have only experienced the temporary warmth and stinging during use- no redness or anything else.<br />-The company also cautions those who have skin conditions or are undergoing professional cosmetic treatments such as injectable toxins like Botox or fillers- saying to check with your doctor or clinician prior to using NIRA.<br />-Only use on intact skin<br />-Don’t use if pregnant or nursing or undergoing fertility treatments<br />-Do not use if you have a history of skin cancer, any other cancer, or pre-malignant moles<br />-Do not treat if you have tanned skin which is apparently at increased risk of adverse effects with light-based devices<br /><br />Overall, I’m happy with how the product functions and the ease of use. I will continue using and will update if I have any further comments or concerns. I haven’t noticed any real results yet, but I also haven’t been using it that long. One question that comes to mind is this: What is the lifespan of this device? Months? Years? Or does it give out after firing the laser a certain number of times? I could have missed it in the manual, but that is something I’m still not sure of. For the current price of $329, that is something I think people may want to know. I haven’t had any issues with the serum that comes in this package, but it seems pretty simple and basic.\nReview Title: Pretty Simple To Use, Stings A Little, No Issues So Far, Awaiting Potential Results\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Panama Jack Sunscreen Lip Balm - SPF 45, Tropical & Mango 6 Pack Plus, Broad Spectrum UVA-UVB Sunscreen Protection, Prevents & Soothes Dry, Chapped Lips\nPanama Jack\n{'Scent': 'Mango', 'Product Benefits': 'Soothing', 'Item Weight': '4.25 Grams', 'Number of Items': '6', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 4.72 x 1.34 inches; 0.15 Ounces'}\nThis Panama Jack Sunscreen Lip Balm - SPF 45 is a good product. The pack includes 6 tropical flavors and 1 Mango. I feel silly thinking about how I’m pretty sure I have never used lip balm with sunscreen in it before.<br /><br />These smell great, are very moisturizing, and glide on nicely. There is no bad taste at all, though I couldn’t particularly taste a flavor. I think it is a great formula- no complaints.<br /><br />The chap sticks are standard size with the usual twist up and cap. They are a little pricey, but you are getting what seems to be a high quality product. I hope my review was helpful in some way, and if so, I would love to know-thanks!\nWonderful Smell- Super Moisturizing\nWIOR Peacock Headband for Women, Fashion Peacock Hair Clip, 3 Pcs Peacock Feathers Hair Clip Peacock Flapper Headband with Pearls & Diamonds Hair Accessory for Girls Ladies Wedding Party Festival Prom\nWIOR\n{'Age Range (Description)': 'Adult', 'Material': 'Pearl', 'Recommended Uses For Product': 'Party,Wedding', 'Brand': 'WIOR', 'Size': 'Free Size', 'Package Dimensions': '7 x 5 x 0.3 inches; 0.63 Ounces'}\nI ordered these WIOR peacock hair pieces for my 5 year old who loves hair accessories. Overall, they are very cute and seem pretty well made.<br /><br />You get a small peacock hair clip, a large peacock hair clip, a thin headband, and then another large peacock piece that you insert the headband into.<br /><br />My opinion is that the smallest hair clip is the most seriously wearable. It is actually very cute especially with the long thinner wispy feathers coming off it. The larger ones are fun, but a bit much in my opinion. Another thing I don’t like about the larger ones is that they are very thick and stiff with the added black backing. I would have preferred the black backing to not be as large and for the entire piece to look more flexible and airy. That is just my opinion though. My daughter likes these just the same.<br /><br />They aren’t absolutely perfect. There are a few areas mostly near the little gems where you can see some excess glue- not extremely noticeable.<br /><br />Anyway, if you like the way these look and are okay with the large ones being stiff, then I would recommend these. They aren’t the best quality out there, but they are good.<br /><br />I’ll be sure to update this review if any issues arise with regular use. I hope my review was helpful in some way, and if so, I would love to know- thanks!\nCute, Fun Pieces, Pretty Good Quality\nBodyguard Moisturizing Immunity Soap 6pk | 7 Essential Oils Clinically Evaluated to Boost Immunity and Protect | Moisturizes with Sweet Almond Oil | Healthy PH for Skin Microbiome\nSpa-Da\n{'Item Form': 'Oil', 'Skin Type': 'Dry', 'Brand': 'Spa-Da', 'Scent': 'Cinnamon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8 x 3.3 x 2 inches; 7.2 Ounces', 'UPC': '860003618998'}\nThis Spa-Da Immunity Support Soap is one of the more interesting soaps I have tried. You get a pack of 6 small shield shaped soaps in a resealable plastic bag. The soaps are about 2.75 inches in length.<br /><br />The scent is strong when you open the bag and especially in the shower. Some of the oils and ingredients included are cloves, cinnamon, oregano, peppermint, parsley, eucalyptus, and rosemary. If you don’t like the smell of cloves, then do not order this because that is the most predominant smell in my opinion. I like it though- it has a nice spicy kick.<br /><br />The soap definitely feels different than I expected. It doesn’t feel really smooth like many soaps. When dry, they were slightly powdery when I ran my finger across. They are slightly gritty feeling which I noticed more once the soap became wet in the shower. This could be nice if you like a slight scrubby feeling. I typically rub it onto my mesh bath sponge or silicone sponge so I don’t really care about the grittiness either way. I found that it lathers and suds up very well with both my mesh and silicone sponges.<br /><br />I just started using, so I’m not sure how many showers I’ll be able to get out of each bar. Honestly, I thought they might disintegrate and get used up fast simply based on how powdery they felt when dry. I don’t think it will last as long as some other soaps, but I was still surprised that I could somewhat see the outline of where the shallow cross was imprinted on the soap even after my first shower-and I did intentionally scrub my sponges all over that side pretty vigorously. I took a picture of what the soap looked like after one shower compared to unused bars.<br /><br />Anyway, my skin feels very clean, perhaps even a little moisturized after using and I haven’t experienced any irritation to my sensitive skin (I have eczema).<br /><br />I like that this soap is natural and free from harmful chemicals. I also love that it is made in the USA-Ohio specifically, which is where I am from.<br /><br />I’ll be sure to update my review if any issues arise like if I find that the bars do in fact get used far too quickly. I hope my review was helpful in some way, and if so, I would love to know- thanks!!!\nInteresting Gritty Texture And Strong Clove Scent\nCONBOLA Make Up Organizer 5 in 1 Dresser Organizer,Portable for Lipstick and Jewlry ,Makeup Organizer and Temporary Makeup Brush Holder,Multi-purpose for Girl Women.36.6cm18cm.(Blue)\nCONBOLA\n{'Material': 'Silicone', 'Special Feature': 'Portable', 'Color': 'Blue', 'Brand': 'CONBOLA', 'Mounting Type': 'Tabletop Mount', 'Unit Count': '1 Count', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '15.08 x 7.44 x 1.5 inches; 1.65 Pounds', 'UPC': '750226660013'}\nThis CONBOLA Make Up Organizer is pretty handy for organizing small makeup items. I ordered the white and grey, and it looks quite nice. I would say it looks just like the pictures.<br /><br />The grey is a sturdy and durable plastic. The white inserts are a nice, thick, and flexible silicone. It will separate into 7 different pieces which is convenient and also makes everything easy to clean. You can use it all together or individual pieces separately.<br /><br />The mirror is fine and you insert into place and remove by pulling back out. I do think they missed an opportunity to have this on a detachable hinge or something.<br /><br />I think my favorite part of this product is the silicone insert that you can insert various makeup pencils, brushes, etc in standing up. Most of my brushes don’t fit as well into the bigger sized slots, but it still works.<br /><br />This is cute overall, but I think the biggest improvement that could be made to this other than a hinged mirror would be to make this deeper. As you can see in my picture, there is a standard sized setting powder sitting in the main compartment. It fits there, but not if you wanted to put the mirror/lid down to cover it.<br /><br />Basically this is a cute open storage. Most off the products I have pictured would not fit in this for any type of closed storage. I think the company could make this design into and awesome display/storage case that fully closes with a handle for traveling or something- but it would have to be much deeper.<br /><br />I don’t think this is something I would want to take traveling, because I would have to take everything out and put in a bag or something before also packing this up and that defeats the purpose of it for traveling in my opinion. Some people may like to have this to display and openly store all their items when traveling though, but it just wouldn’t be my first choice since you can’t pack everything inside it when it is time to go.<br /><br />Anyway, this is still a nice little product if you think the size and function will suit your needs. I hope my review was helpful in some way, and if so, I would love to know- thanks!\nNice Little Open Storage- Not What I Would Choose For Traveling\nAlteya Organics Sunscreen Rose Face Cream Spf 30, 50 ML\nAlteya Organics\n{'Scent': 'Rose', 'Sun Protection Factor': '30 Sun Protection Factor (SPF)', 'Item Weight': '0.05 Kilograms', 'Number of Items': '1', 'Unit Count': '1.69 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.36 x 2.36 x 3.94 inches; 1.76 Ounces', 'Item model number': 'SG_B06ZYWVSZY_US', 'Manufacturer': 'Alteya Organics'}\nI really enjoy using the Alteya Organics rose water, so I was very excited to try this rose face organic sunscreen SPF 30. This sunscreen is very unique to me in that it isn’t white, it isn’t simply beige tinted, but looks dusty rose/beige tinted.<br /><br />So there are definitely some things about this product that I kind of dislike/ am on the fence about, but ultimately, The end result is surprisingly awesome.<br /><br />What I don’t like-<br />I usually start with what I like, but I noticed all the things I didn’t like very quickly, so I’ll start with that.<br /><br />-The pump dispenser. I don’t know what is going on with this thing, but I opened the box and tried pumping a couple times- nothing came out. I thought nothing of it since it usually takes multiple or many pumps initially to get any product into the pump..... but it never came. I started shaking the bottle and then pumping..... nothing. I almost gave up, but then violently started pumping it by hammering the top with my hand-tiny little bits started to splash out. After some more hammering, it seems to start coming out normally with a simple press. The product it pretty thick, so that could have been a factor I suppose? Now it is easier for it to come out, but still stops occasionally. When I press, the product usually comes out at the very end of a full pump.<br />-Not incredibly easy to spread and rub in properly. It isn’t terrible and I wasn’t too surprised since it is fairly thick and it is sunscreen, but it did require some effort to work it into my skin.<br />-It feels somewhat grainy/gritty when I’m trying to rub it into my skin. I’m not sure why or if it is just the product I received. I can’t feel any granules on my face after application, but it was definitely there initially which I thought was odd.<br />-I had a sensation of wanting to wash my hands afterwards. I could definitely feel it lingering on my fingers.<br /><br />After all that, I felt a little disappointed... but you know what? I really like the end result and the way it makes me look.<br /><br />What I like-<br /><br />-Really subtle natural scent- almost like the smell of clay with a hint of rose. I like it. I do see in the ingredients that there is also lavender oil.<br />-The tinted color... it is like a dusty rose beige. I really like it. I have somewhat tannish olive skin and something about this color is making my skin look good. It is almost like I’m wearing light makeup. Somehow my skin looks brighter and glowy after application.<br />-Doesn’t feel so heavy as I’m wearing. I’ll admit- the product is thick, feels somewhat grainy with application, and is not the easiest to rub in, but it feels light sitting on my face. Yes, even after washing hands, I can feel it is there when I run my fingers across my face, but it feels soft. There is a little bit of friction like it doesn’t feel completely silky smooth, but I’m not bothered by it.<br />-Doesn’t leave a white cast. I suppose this isn’t surprising since it isn’t white to begin with.... but I love that. Does it leaves cast? Kind of, but in a good way. Like I said, I feel like it leaves a very slight color that evens out my skin, almost like light makeup.<br /><br />I really wanted to leave a 3 star rating because the pump is annoying and frustrating, the grittiness is strange, and it isn’t the easiest to rub in, but darn I like how my skin looks afterwards!!! It doesn’t make any sense to me. It almost feels like it would leave my skin feeling and looking greasy/oily, but it doesn’t- my skin looks nice and somewhat dewy.<br /><br />If the company finds a way to make the pump dispenser work properly and possibly make it feel easier to apply then this would without a doubt be a 5 star product! I also wish the bottle was larger than 50ml, especially considering the hassle of the pump.<br /><br />Anyway, I hope my review was helpful in some way, and if so. I would love to know!! Thanks!!\nHonestly Strange And Frustrating, But The End Result Is Great\nBeeTheLight Pure Castile Soap - 12 small Bars - Choose from Peppermint, Orange Citrus, Lavender, or Unscented - Made from 100% Fair Trade and Organic oils - Vegan - 6 two-packs (30 oz)\nthe Light\n{'Item Form': 'Bar,Creamy', 'Brand': 'the Light', 'Scent': 'Unscented,Peppermint,Lavender', 'Material Feature': 'Organic, Vegan', 'Age Range (Description)': 'Adult', 'Product Dimensions': '0.79 x 1.18 x 1.97 inches; 2.23 Pounds', 'UPC': '737488057348'}\nI love these BeeTheLight Pure Castile Soaps. I ordered the assorted variety, so I received 4 Unscented, 4 Lavendar, and 4 Peppermint.<br /><br />-Received 12 bars total, nicely packaged in 6 sets of two<br />-At 2.5oz each, they are smaller than most other bars I have tried, but not excessively<br />-All off white in color<br />-100% fair trade and organic made from sustainably produced oils- only sustainably grown palm oil<br />-Completely biodegradable including the packaging<br />-No detergents or artificial ingredients<br />-Hand poured in small batches here in the USA<br />-Gentle yet effective<br />-Did not dry out or irritate mine or my daughter’s sensitive eczema prone skin<br />-Lathers very nicely using either my hand or my mesh sponge<br />-Only left a slight “squeaky clean” feel which I don’t care for, but it wasn’t excessive at all so I’m completely fine with it<br /><br />Overall, I’m very impressed with these soap bars. I love the simple, minimalistic and natural looking packaging. So far, I have only tried the unscented which I love, but I’m sure the others feel and work just the same. The only difference is the addition or lavender or peppermint oils- and they smell amazing in the packaging, So I know I’ll love using them.<br /><br />I’ll be sure to update my review if any issues arise with regular use, but as of now, I would definitely recommend these to others. It seems like a nice small company that makes a great product and deserves support.<br /><br />I hope my review was helpful in some way, and if so, I would love to know- thanks!\nGreat Variety Pack, Simple, Gentle, Effective, Great Lather\nBABOR Power Serum Ampoules - Hyaluronic Acid | Moisturizing Smoothing and Plumping | 8D Hyaluronic Acid and Tripeptide Intensely Hydrate All Skin's Layers | 7 Days to Hydrated Skin\n{'Skin Type': 'All', 'Product Benefits': 'Hydration', 'Scent': 'Aloe', 'Brand': 'Babor', 'Item Form': 'Serum', 'Package Dimensions': '5.94 x 3.43 x 0.91 inches; 2.08 Ounces'}\nThese Doctor Babor Hyaluronic Acid Serum Power Serum Ampoules seem pretty good. I definitely like this better than their collagen concentrate ampoules, but there are things that could have been changed to make me like this product a lot more.<br /><br />-Received 7 glass ampoules with 2ml of product inside each one<br />-Well presented in a nice looking silver display box<br />-You have to snap the glass ampoules open. They do provide a plastic cylindrical piece to aid in doing so. I’m a nurse, so I’m used to breaking open these kinds of ampoules without any issue. I can imagine that some people would not like this though<br />-Watery serum that glides across skin easily<br />-Honestly, a little seems to cover a large area of skin. 2ml may not seem like a lot, but a single ampoule seems like way more than would be needed for one application. I have split one into 3-4 uses to be honest<br />-I’m assuming the company intends for one whole ampoule to be used as one application because each one is labeled as day 1-7, and they provide no way to seal an ampoule back after using which I found to be rather frustrating<br />-Absorbs rapidly and doesn’t feel sticky or tacky after drying like the collagen concentrate did<br />-Their collagen concentrate ampoules also had a heavy fragrance, so I was SO relieved to find that there is no added fragrance with these<br />-Made in Germany<br /><br />So does it really help with plumping, smoothing, and reducing wrinkles? I don’t know. I definitely like the way my skin looks and feels right after application, but I haven’t noticed anything drastic.<br />As I previously stated, the 2ml of serum feels like A LOT to me if you try to put it all on your face at once. Unfortunately, this company also does not provide a way to seal an individual ampoule back for future use since they apparently intend for one ampoule to be an entire application. I remember I tried a set by the ISDIN brand with glass ampoules just like these. In the kit, the company included a top to slide over the opened glass ampoule with a cap to seal for future use. This was awesome and so convenient. I was disappointed to find out that this company did not include anything like that (I took a picture of that top and cap on one of these ampoules so you can see).<br /><br />Anyway, it is possible that this product may provide good results when used long term, but I just don’t really like this being intended for use over 7 days only. If they included a top with cap to seal each individual ampoule so that the product could be used over a longer period of time, I would like it much more. I would definitely prefer a serum in a larger bottle with dropper lid.<br /><br />Anyway, I hope my review was helpful in some way, and if so, I would love to know – thanks! I’ll be sure to update if I have any other comments to add.\nNo Fragrance, Moisturizing, Not The Greatest Value-Improvements Could Be Made\nNIRA Skincare Laser & Serum Bundle - Includes Anti-Aging Laser & Hyaluronic Acid Serum - Reduces Appearance of Fine Lines & Wrinkles - FDA Cleared\nNira\n{'Skin Type': 'Dry', 'Product Benefits': 'Hydration', 'Use for': 'Face', 'Scent': 'Aloe', 'Brand': 'Nira'}\nSo far, I have no real complaints about this NIRA Skincare Laser & Hyaluronic Acid Serum Bundle. I’m still at the point where I’m not sure if I can say it truly works because I need to use it for a longer period of time, but I’ll discuss various aspects about the product that will hopefully help with your decision-making.<br /><br />-Came well-packaged in a small, but sturdy cardboard box. Everything arrived intact. I have continued to use this box for storage of the product.<br />-Comes with the handheld laser device, charger with base to plug into an outlet, and manual<br />-No complaints about the battery life so far<br />-Simple to use: there are two buttons: The power button that turns the device on. Then you can press it to cycle through the various levels of intensity 1-5 which are clearly shown using green light bars. You can then hold the power button down to turn the device off again. The top button can be pressed to activate the laser after you have chosen the level of intensity you want.<br />-The laser only works if positioned correctly over an area of skin. It will give a single negative sounding beep if not positioned correctly, and a positive sounding double beep if it is positioned correctly as the laser works. You wait to move the device to the next area after you hear that second beep indicating that it is finished with that laser sequence<br />-The device has a white, plastic outer shell. It is lightweight while still feeling sturdy and durable. I would still be very careful not to drop this as I’m not sure how it could handle a fall<br />-I would recommend experimenting on the lower intensity settings. The undereye area is pretty sensitive. I feel I have a pretty high pain tolerance, but my eyes often still tear up after using per instructions on the highest settings of 4 and 5. For whatever reason, my left eye is much more sensitive to this.<br />-I don’t want to say it is truly painful, but I suppose the best way to describe the sensation is almost similar to if you were being stung by a rubber band that you pulled back and let hit your skin if that makes sense. It isn’t comfortable, but you do get more used to this and can work your way up to a higher level of intensity. You will probably also feel some warmth on the skin after using.<br />-I know this is marketed for under the eyes, but I have also been using on my forehead and by my smile lines.<br /><br />***The instruction manual is pretty clear and straightforward. You definitely need to read this before getting started. Here is some information that you can find within the manual:<br /><br />-They say all skin tones and anyone over the age of 12 can use NIRA to reduce the appearance of wrinkles around the eyes<br />-You need to clean and dry your face just prior to using NIRA<br />-It can be using morning or night and up to twice daily. They recommend waiting 1 minute before retreating each area and not to treat more than twice within a 1-hour period.<br />-Do not treat the same spot twice in a row, even if the pulse is rejected and you get the low pitched, negative sounding beep<br />-The instructions clearly show you the recommended way to treat the undereye area and the treatment pattern to use<br />-They recommend using the highest power level where you feel warmth without pain<br />-You should use a facial moisturizer after each treatment and a daily sunscreen with at least SPF 30 is recommended. This bundle includes the hyaluronic acid serum which can also be used.<br />-Device should be kept clean and free of dust, especially the glass lens which can be cleaned with a cotton swab. Surfaces can be cleaned with 70% alcohol solution between each use.<br />-They say some potential side effects include: skin warmth, redness, and stinging. Less frequent side effects include dryness, roughness, tanned appearance to skin, swelling, flaking, itching, crusting, bruising, pimple-like rash, irritated skin, blistering, scarring, infection, and skin color changes where your skin may become darker or lighter. I have only experienced the temporary warmth and stinging during use- no redness or anything else.<br />-The company also cautions those who have skin conditions or are undergoing professional cosmetic treatments such as injectable toxins like Botox or fillers- saying to check with your doctor or clinician prior to using NIRA.<br />-Only use on intact skin<br />-Don’t use if pregnant or nursing or undergoing fertility treatments<br />-Do not use if you have a history of skin cancer, any other cancer, or pre-malignant moles<br />-Do not treat if you have tanned skin which is apparently at increased risk of adverse effects with light-based devices<br /><br />Overall, I’m happy with how the product functions and the ease of use. I will continue using and will update if I have any further comments or concerns. I haven’t noticed any real results yet, but I also haven’t been using it that long. One question that comes to mind is this: What is the lifespan of this device? Months? Years? Or does it give out after firing the laser a certain number of times? I could have missed it in the manual, but that is something I’m still not sure of. For the current price of $329, that is something I think people may want to know. I haven’t had any issues with the serum that comes in this package, but it seems pretty simple and basic.\nPretty Simple To Use, Stings A Little, No Issues So Far, Awaiting Potential Results",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Pretty Simple To Use, Stings A Little, No Issues So Far, Awaiting Potential Results",
    "text": "So far, I have no real complaints about this NIRA Skincare Laser & Hyaluronic Acid Serum Bundle. I’m still at the point where I’m not sure if I can say it truly works because I need to use it for a longer period of time, but I’ll discuss various aspects about the product that will hopefully help with your decision-making.<br /><br />-Came well-packaged in a small, but sturdy cardboard box. Everything arrived intact. I have continued to use this box for storage of the product.<br />-Comes with the handheld laser device, charger with base to plug into an outlet, and manual<br />-No complaints about the battery life so far<br />-Simple to use: there are two buttons: The power button that turns the device on. Then you can press it to cycle through the various levels of intensity 1-5 which are clearly shown using green light bars. You can then hold the power button down to turn the device off again. The top button can be pressed to activate the laser after you have chosen the level of intensity you want.<br />-The laser only works if positioned correctly over an area of skin. It will give a single negative sounding beep if not positioned correctly, and a positive sounding double beep if it is positioned correctly as the laser works. You wait to move the device to the next area after you hear that second beep indicating that it is finished with that laser sequence<br />-The device has a white, plastic outer shell. It is lightweight while still feeling sturdy and durable. I would still be very careful not to drop this as I’m not sure how it could handle a fall<br />-I would recommend experimenting on the lower intensity settings. The undereye area is pretty sensitive. I feel I have a pretty high pain tolerance, but my eyes often still tear up after using per instructions on the highest settings of 4 and 5. For whatever reason, my left eye is much more sensitive to this.<br />-I don’t want to say it is truly painful, but I suppose the best way to describe the sensation is almost similar to if you were being stung by a rubber band that you pulled back and let hit your skin if that makes sense. It isn’t comfortable, but you do get more used to this and can work your way up to a higher level of intensity. You will probably also feel some warmth on the skin after using.<br />-I know this is marketed for under the eyes, but I have also been using on my forehead and by my smile lines.<br /><br />***The instruction manual is pretty clear and straightforward. You definitely need to read this before getting started. Here is some information that you can find within the manual:<br /><br />-They say all skin tones and anyone over the age of 12 can use NIRA to reduce the appearance of wrinkles around the eyes<br />-You need to clean and dry your face just prior to using NIRA<br />-It can be using morning or night and up to twice daily. They recommend waiting 1 minute before retreating each area and not to treat more than twice within a 1-hour period.<br />-Do not treat the same spot twice in a row, even if the pulse is rejected and you get the low pitched, negative sounding beep<br />-The instructions clearly show you the recommended way to treat the undereye area and the treatment pattern to use<br />-They recommend using the highest power level where you feel warmth without pain<br />-You should use a facial moisturizer after each treatment and a daily sunscreen with at least SPF 30 is recommended. This bundle includes the hyaluronic acid serum which can also be used.<br />-Device should be kept clean and free of dust, especially the glass lens which can be cleaned with a cotton swab. Surfaces can be cleaned with 70% alcohol solution between each use.<br />-They say some potential side effects include: skin warmth, redness, and stinging. Less frequent side effects include dryness, roughness, tanned appearance to skin, swelling, flaking, itching, crusting, bruising, pimple-like rash, irritated skin, blistering, scarring, infection, and skin color changes where your skin may become darker or lighter. I have only experienced the temporary warmth and stinging during use- no redness or anything else.<br />-The company also cautions those who have skin conditions or are undergoing professional cosmetic treatments such as injectable toxins like Botox or fillers- saying to check with your doctor or clinician prior to using NIRA.<br />-Only use on intact skin<br />-Don’t use if pregnant or nursing or undergoing fertility treatments<br />-Do not use if you have a history of skin cancer, any other cancer, or pre-malignant moles<br />-Do not treat if you have tanned skin which is apparently at increased risk of adverse effects with light-based devices<br /><br />Overall, I’m happy with how the product functions and the ease of use. I will continue using and will update if I have any further comments or concerns. I haven’t noticed any real results yet, but I also haven’t been using it that long. One question that comes to mind is this: What is the lifespan of this device? Months? Years? Or does it give out after firing the laser a certain number of times? I could have missed it in the manual, but that is something I’m still not sure of. For the current price of $329, that is something I think people may want to know. I haven’t had any issues with the serum that comes in this package, but it seems pretty simple and basic.",
    "images": [],
    "asin": "B08P2DZB4X",
    "parent_asin": "B08P2DZB4X",
    "user_id": "AEZG2W4TRMMNFFAWS2BPQE676K4Q",
    "timestamp": "2021-12-13 11:54:31.514000",
    "helpful_vote": 2,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "NIRA Skincare Laser & Serum Bundle - Includes Anti-Aging Laser & Hyaluronic Acid Serum - Reduces Appearance of Fine Lines & Wrinkles - FDA Cleared",
    "average_rating": 3.8,
    "rating_number": 109,
    "features": [
      "POWERFUL ANTI-AGING DUO - This powerful anti-aging duo includes our Skincare Laser & Hyaluronic Acid Serum Bundle. Reduce fine lines & wrinkles, stimulate natural collagen production & hydrate skin for glowing, radiant results.",
      "AT-HOME LASER TREATMENT - The NIRA Anti-Aging Laser is the first & only painless at-home laser for wrinkle reduction. Our non-fractional, patented technology is FDA cleared to reduce fine lines for visible results in just 2 minutes a day.",
      "HYALURONIC ACID SERUM - Our Hyaluronic Acid Serum contains four all-natural ingredients to lock in moisture, diminish the appearance of fine lines & wrinkles, and drive antioxidant activity, resulting in skin that appears softer, smoother & firmer.",
      "SAME GREAT RESULTS - The treatment is simple, fast & effective—and can be used in the comfort of your own home. NIRA’s technology is the same used by professional dermatologists— but at a fraction of the price & without irritation.",
      "HOW TO USE - Wash & dry face completely. Use NIRA Anti-Aging Skincare Laser for 2 minutes to stimulate collagen & reduce wrinkles. Finish with NIRA Hyaluronic Acid Serum for dramatic, faster & longer-lasting results."
    ],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31OE9icA9xL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31OE9icA9xL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51naovR4R0L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51rsUPvgc3L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51rsUPvgc3L.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/81mQcZsSdxL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/415SnCd4dEL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/415SnCd4dEL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71MEksn0XWL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/413bpyFXRCL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/413bpyFXRCL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71bxROqXddL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41iV2YFe-xL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41iV2YFe-xL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71Rj3m0elTL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51QZJkWrgyL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51QZJkWrgyL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71GzghCV3QL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Nira",
    "categories": [],
    "details": {
      "Skin Type": "Dry",
      "Product Benefits": "Hydration",
      "Use for": "Face",
      "Scent": "Aloe",
      "Brand": "Nira"
    },
    "bought_together": null
  }
}