{
  "interaction_number": 20,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tombstone [Blu-ray]\nReview Date: 2020/02/16\nStore: Kurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['Product Description', 'Kurt Russell (MIRACLE, DEATH PROOF) and Val Kilmer (DEJA VU, THE MISSING) will blow you away in this explosive, action-packed adventure! And now, the legendary battle for justice in TOMBSTONE hits home on Blu-ray(TM) for the first time ever. Russell is U.S. Marshal Wyatt Earp; Kilmer is the outrageous Doc Holliday. Together, they team up to lay down the law in a notorious showdown with ruthless outlaws at the O.K. Corral. With an all-star cast that also includes Sam Elliott, Bill Paxton, Dana Delany, Jason Priestley, Michael Biehn and Hollywood icon Charlton Heston, this Wild West epic will transport you back in time and land you smack dab in the center of the crossfire. So strap on your six shooters as you experience the remarkable picture and theater-quality sound of TOMBSTONE in Blu-ray(TM) High Definition.', 'Amazon.com', \"This Western has become a modest cult favorite since its release in 1993, when the film was met with mixed reviews but the performances of Kurt Russell (as Wyatt Earp) and especially Val Kilmer, for his memorably eccentric performance as the dying gunslinger Doc Holliday, garnered high praise. The movie opens with Wyatt Earp trying to put his violent past behind him, living happily in Tombstone with his brothers and the woman (Dana Delany) who puts his soul at ease. But a murderous gang called the Cowboys has burst on the scene, and Earp can't keep his gun belt off any longer. The plot sounds routine, and in many ways it is, but Western buffs won't mind a bit thanks to a fine cast and some well-handled action on the part of Rambo director George P. Cosmatos, who has yet to make a better film than this. --\", 'Jeff Shannon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'RUSSELL, CORRAL, O.K., HOLIDAY, DOC, EARP, WYATT, Action/Adventure, KURT', 'Format': 'Color, AC-3, NTSC, Blu-ray, Widescreen, Dubbed, DTS Surround Sound, Subtitled, Dolby', 'Contributor': 'Robert Burke, Charlton Heston, Bob Misiorowski, Billy Zane, Stephen Lang, Kevin Jarre, Bill Paxton, George P. Cosmatos, James Jacks, Michael Biehn, Sean Daniel, Dana Delany, Powers Booth, Kurt Russell, Joanna Pacula, Sam Elliott, Jon Tenney, Michael Rooker, Jason Priestley, Val KilmerRobert Burke, Charlton Heston, Bob Misiorowski, Billy Zane, Stephen Lang, Kevin Jarre, Bill Paxton, George P. Cosmatos, James Jacks, Michael Biehn, Sean Daniel, Dana Delany, Powers Booth, Kurt Russell, Joanna Pacula, Sam Elliott, Jon Tenney, Michael Rooker, Jason Priestle…   See more', 'Language': 'English (DTS-HD High Res Audio), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 1.6 Ounces', 'Item model number': '7019836', 'Director': 'George P. Cosmatos', 'Media Format': 'Color, AC-3, NTSC, Blu-ray, Widescreen, Dubbed, DTS Surround Sound, Subtitled, Dolby', 'Run time': '2 hours and 10 minutes', 'Release date': 'April 27, 2010', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Charlton Heston', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'James Jacks, Sean Daniel, Bob Misiorowski', 'Studio': 'HOLLYWOOD PICTURES', 'Writers': 'Kevin Jarre', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great film!\nReview Title: Great modern western\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Firefox / Heartbreak Ridge (Two-Movie Collection) [Blu-ray]\nClint Eastwood  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"Star/director Clint Eastwood wields weaponry, commands troops and triggers soaring suspense and adventure in two popular action hits. The Cold War heats up when war-haunted pilot Eastwood slips inside the Soviet Union to steal the mind-controlled high-tech fighter called Firefox. And he's a semper fi lifer who whips raw Marine recruits into shape and leads them into the invasion of Grenada in Heartbreak Ridge. A science-fiction spectacular and a character-driven study of a warrior at a peacetime crossroads: it's a dynamite double feature from one of cinema's most beloved stars and acclaimed filmmakers.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Contributor': 'Clint Eastwood', 'Initial release date': '2011-06-07', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': 'WHV1000184974BR', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Widescreen', 'Run time': '3 hours and 56 minutes', 'Release date': 'June 7, 2011', 'Actors': 'Clint Eastwood', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nClint Eastwood plays tough like no other in both FIREFOX and HEARTBREAK RIDGE. Nice deal on 2 movies in one package.\nLove Eastwood!\nAlien Anthology (Alien / Aliens / Alien 3 / Alien: Resurrection) [Blu-ray]\nSigourney Weaver  (Actor),     Tom Skerritt  (Actor),     Ridley Scott  (Director),     David Fincher  (Director)    &                   1                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Product Description', 'Brace yourself for a whole new breed of Blu ray: Four powerful films...eight thrilling versions...in dazzling, terrifying, high def clarity with the purest digital sound on the planet. Two bonus dics and over 65 hours of archival and never before seen content, including the totally immersive MU TH UR mode feature, makes this definitive', 'Alien', 'collection!', 'Amazon.com', 'Review of', 'Alien', 'A landmark of science fiction and horror, Alien arrived in 1979 between Star Wars and The Empire Strikes Back as a stylishly malevolent alternative to George Lucas\\'s space fantasy. Partially inspired by 1958\\'s It! The Terror from Beyond Space, this instant classic set a tone of its own, offering richly detailed sets, ominous atmosphere, relentless suspense, and a flawless ensemble cast as the crew of the space freighter Nostromo, who fall prey to a vicious creature (designed by Swiss artist H.R. Giger) that had gestated inside one of the ill-fated crew members. In a star-making role, Sigourney Weaver excels as sole survivor Ripley, becoming the screen\\'s most popular heroine in a lucrative movie franchise. To measure the film\\'s success, one need only recall the many images that have been burned into our collective psyche, including the \"facehugger,\" the \"chestburster,\" and Ripley\\'s climactic encounter with the full-grown monster. Impeccably directed by Ridley Scott, Alien is one of the cinema\\'s most unforgettable nightmares.', '--Jeff Shannon', 'Review of', 'Aliens', 'Aliens is one of the few cases of a sequel that far surpassed the original. Sigourney Weaver returns as Ripley, who awakens on Earth only to discover that she has been hibernating in space so long that everyone she knows is dead. Then she is talked into traveling (along with a squad of Marines) to a planet under assault by the same aliens that nearly killed her. Once she gets there, she finds a lost little girl who triggers her maternal instincts--and she discovers that the company has once again double-crossed her, in hopes of capturing one of the aliens to study as a military weapon. Directed and written by James Cameron, this is one of the most intensely exciting (not to mention intensely frightening) action films ever, with a large ensemble cast that includes Bill Paxton, Lance Henriksen, Paul Reiser, and Michael Biehn. Weaver defined the action woman in this film and walked away with an Oscar nomination for her trouble.', '--Marshall Fine', 'Review of', 'Alien 3', 'The least successful film in this series was directed by stylemaster (and content-underachiever) David Fincher. Ripley, the only survivor of her past mission, awakens on a prison planet in the far corners of the solar system. As she tries to recover, she realizes that not only has an alien gotten loose on the planet, the alien has implanted one of its own within her. As she battles the prison authorities (and is aided by the prisoners) in trying to kill the alien, she must also cope with a distinctly shortened lifespan that awaits her. But the striking imagery makes for muddled action and the script confuses it further. The ending looks startling but it takes a long time--and a not particularly satisfying journey--to get there.', '--Marshall Fine', 'Review of', 'Alien Resurrection', \"Perhaps these films are like the Star Trek movies: The even-numbered episodes are the best ones. Certainly this film (directed by French stylist Jean-Pierre Jeunet) is an improvement over Alien 3, with a script that breathes exciting new life into the franchise. This chapter is set even further in the future, where scientists on a space colony have cloned both the alien and Ripley (Sigourney Weaver), who died in Alien 3; in doing so, however, they've mixed alien DNA with Ripley's human chromosomes, which gives Ripley surprising power (and a bad attitude). A band of smugglers comes aboard only to discover the new race of aliens--and when the multi-mouthed melonheads get loose, no place is safe. But, on the plus side, they have Ripley as a guide to help them get out. Winona Ryder is on hand as the smugglers' most unlikely crew member (with a secret of her own), but this one is Sigourney's all the way.\", '--Marshall Fine']\n{'Genre': 'Horror/Things That Go Bump/Monsters, Science Fiction & Fantasy', 'Format': 'Multiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen   See more', 'Contributor': 'Tom Skerritt, David Fincher, Ridley Scott, John Hurt, James Cameron, Winona Ryder, Sigourney Weaver, Jean-Pierre Jeunet, Lance HenriksenTom Skerritt, David Fincher, Ridley Scott, John Hurt, James Cameron, Winona Ryder, Sigourney Weaver, Jean-Pierre Jeunet, Lance Henriksen   See more', 'Language': 'German (DTS 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD)', 'Runtime': '7 hours and 57 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '1 x 5.6 x 6.9 inches; 14.4 Ounces', 'Item model number': 'Alien Ant', 'Director': 'Ridley Scott, David Fincher, James Cameron, Jean-Pierre Jeunet', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '7 hours and 57 minutes', 'Release date': 'October 26, 2010', 'Actors': 'Sigourney Weaver, Tom Skerritt, John Hurt, Lance Henriksen, Winona Ryder', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, German, Portuguese, Spanish', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '6'}\nGreat blue-ray uplift. When you compare to DVD- there is no fuzzy zones. The grey/blue and army greens are sharper. As for the films- scary as they were when they were first released.\nAlien- enough said\nNational Lampoon's Christmas Vacation [Blu-ray]\nChevy Chase  (Actor),     Beverly D'Angelo  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n[\"National Lampoon's Christmas Vacation (BD)\", 'Newly Remastered on Blu-ray! This holiday season, Clark Griswold [CHEVY CHASE] vows his clan will enjoy “the most fun-filled family Christmas ever.” Before you can sing “Fa-la-la-la-lah,” he decks the halls with howls of folly in the perennial favorite National Lampoon’s Christmas Vacation. Seeing is believing. There are 25,000 lights on the roof. An exploding turkey on the dining room table. A SWAT team taking siege outside. A festive supporting cast [including BEVERLY D’ANGELO, RANDY QUAID, JULIA LOUIS-DREYFUS, JULIETTE LEWIS, WILLIAM HICKEY and more]. And a John Hughes script full of wit, heart and sheer goofiness. Yule love it!', ']]>']\n{'Genre': 'Comedy', 'Format': 'Blu-ray, Closed-captioned, Color, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': \"Juliette Lewis, Beverly D'Angelo, Angelo Badalamenti, Thomas E. Ackerman, Randy Quaid, William Hickey, Julia Louis-Dreyfus, Tony Epper, Johnny Galecki, E.G. Marshall, Miriam Flynn, Diane Ladd, Ellen Hamilton Latzen, Mae Questel, Sam McMurray, Alexander Folk, Keith MacKechnie, Chevy Chase, Nicholas Guest, Cody Burger, Natalia Nogulich, John RandolphJuliette Lewis, Beverly D'Angelo, Angelo Badalamenti, Thomas E. Ackerman, Randy Quaid, William Hickey, Julia Louis-Dreyfus, Tony Epper, Johnny Galecki, E.G. Marshall, Miriam Flynn, Diane Ladd, Ellen Hamilton Latzen, Mae Questel, Sam McMurray, Alexander Folk, Keith Ma…  See more\", 'Initial release date': '2006-12-05', 'Language': 'English (Dolby Digital 4.0), French (Dolby Digital 1.0)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '980075605', 'Media Format': 'Blu-ray, Closed-captioned, Color, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'December 5, 2006', 'Actors': \"Chevy Chase, Beverly D'Angelo, Cody Burger, Tony Epper, Miriam Flynn\", 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Warner Home Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe perfect dysfunctional Christmas holiday movie. Wonderful lines, reactions, characters and story. Fun times are at home. It is more of a tradition than A Christmas Carol or Rudolph, the Red-Nosed Reindeer ever was. Gut-wrenching humor. Chevy Chase plays the perfect Griswold sap and Randy Quaid as the adorable dufus, Cousin Eddie.\nChevy rules...\nThe Godfather Collection (The Coppola Restoration) [Blu-ray]\nFrancis Ford Coppola  (Director),     Al Pacino  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Francis Ford Coppola's Masterpiece features Marlon Brando in his Oscar-winning role as the patriarch of the Corleone family. Director Coppola paints a chilling portrait of the Sicilian clan's rise and near fall from power in America, masterfully balancing the story between the Corleone's family life and the ugly crime business in which they are engaged. Based on Mario Puzo's best-selling novel and featuring career-making performances by Al Pacino, James Caan and Robert Duvall, this searing and brilliant film garnered ten Academy Award nominations, and won three including Best Picture of 1972.\", 'Amazon.com', \"People used to say this was Frank Sinatra's world, and the rest of us just lived in it. After watching the multiple special features in the box set\", 'The Godfather - Coppola Restoration', \", one might conclude it's actually time for a cultural and historical revision: This is the Corleone family's world. The rest of us better tread lightly. Actually, the point of the half-dozen or so features crammed onto a disc accompanying the beautifully restored\", 'The Godfather', ', The Godfather II and', 'The Godfather III', ', is that', 'The Godfather', 'movies have penetrated popular culture in such a deep and meaningful way that they are second-nature to everything. David Chase, creator of and writer on', 'The Sopranos', ', for example, describes in the featurette \"Godfather World\" that his hit HBO series was intended to be the story of the first generation of mobsters actually influenced by Francis Ford Coppola\\'s hit trilogy. Joe Mantegna calls the three films \"the Italian', 'Star Wars', '.\" (Mantegna co-stars in', 'The Godfather III', '.) Alec Baldwin says no matter what one is doing, one is compelled to stop and watch the films if they\\'re on television. Richard Belzer calls the films \"a religion.\" And so on. A number of people similarly testify in \"Godfather World\" to the importance and ubiquitousness of', 'The Godfather', 'and its sequels in American life. There\\'s no point in arguing, so its best to move on to the other featurettes, including \"The Masterpiece That Almost Wasn\\'t,\" reviewing in detail much of what has been said about Paramount\\'s mistreatment of Coppola, about casting fights (Steve McQueen as Michael?), about the studio\\'s assumption they were getting a quick-and-dirty B-movie, and about producer Robert Evans\\' determination to keep his choice of director and unlikely actors under his wing. Fresh information within the special features, however, begins with \"… When the Shooting Stopped,\" a fine study of post-production on', 'The Godfather', ', with several surprising and fascinating facts. Among emerging details is an explanation of why Michael Corleone\\'s scream toward the end of The Godfather III is silenced out. (Hint: it was meant to be the inverse of a sound effect in the first movie.) \"Emulsional Rescue: Revealing', 'The Godfather', '\" talks about the painstaking work of restoring the first two films, beginning with a phone call from Coppola to Steven Spielberg (after the latter\\'s DreamWorks studio became part of the Viacom family) asking if he\\'d request money from Paramount for restoration work. \"', 'The Godfather', 'On the Red Carpet is a negligible series of fawning statements about the movie from hot young actors, while \"Four Short Films\" are brief and enjoyable takes on different aspects of', \"The Godfather's\", 'impact on modern living.', '--Tom Keogh', 'Stills from', 'The Godfather - The Coppola Restoration Giftset', '(Click for larger image)']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.72 x 5.5 x 6.86 inches; 7.84 Ounces', 'Item model number': 'BSP 2032', 'Director': 'Francis Ford Coppola', 'Media Format': 'Blu-ray, Closed-captioned, Color, Widescreen', 'Run time': '9 hours and 9 minutes', 'Release date': 'September 23, 2008', 'Actors': 'Al Pacino', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Portuguese, Spanish, English', 'Language': 'English (Dolby Digital 5.1), English (Mono)', 'Studio': 'Paramount Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nWatching the Godfather films, one right after the other, is an awesome experience. Coppola's story unflolds as brilliantly as he created it. A film that will stand the test of time- even after the Mayan calendar expires this week.\nBest film collection ever....\nHanna [Blu-ray]\nSaoirse Ronan  (Actor),     Eric Bana  (Actor),     Joe Wright  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Raised by her father (Eric Bana), an ex-CIA agent, in the wilds of Finland, Hanna's upbringing and training have been one and the same, all geared to making her the perfect assassin. The turning point in her adolescence is a sharp one. Sent into the world by her father on a mission, Hanna journeys stealthily across Europe, eluding agents dispatched after her by a ruthless intelligence operative with secrets of her own (Cate Blanchett). As she nears her ultimate target, Hanna faces startling revelations about her existence.\", 'Amazon.com', 'Hanna', 'has the plot of a Hollywood action blockbuster but the style of a European art movie--and this unholy hybrid is fascinating to watch. Hanna (Saoirse Ronan,', 'The Lovely Bones', ') has been raised by her father (Eric Bana,', 'Munich', \"), an ex-covert agent, for one purpose: to murder the American agent, Marissa Wiegler (Cate Blanchett), who murdered Hanna's mother. Hanna thinks she succeeds and escapes, but she's actually being followed by Wiegler, who will go to any lengths to exterminate the girl.\", 'Hanna', 'could have been little more than a tween reboot of', 'La Femme Nikita', ', but in the hands of director Joe Wright (', 'Atonement', ',', 'Pride & Prejudice', \") the movie spends as much time on Hanna's budding relationship with a girl on holiday in Morocco as it does on Hanna's capacity to kill. Even the action scenes have atypical rhythms (and one violent sequence occurs in a long, sustained shot that will make film geeks squeal with glee).\", 'Hanna', \"is visually sumptuous, emotionally delicate, and completely unlike any other action flick you'll see. The ending goes flat as disappointingly banal plot mechanics take hold, but up until then,\", 'Hanna', 'combines genuine thrills, unexpected complexity of character, and an unusual electronica soundtrack into an enthralling film.', '--Bret Fetzer']\n{'Genre': 'Drama, Suspense, Arthouse', 'Format': 'Blu-ray, AC-3, Multiple Formats, Dubbed, Color, DTS Surround Sound, Dolby, NTSC, Widescreen, SubtitledBlu-ray, AC-3, Multiple Formats, Dubbed, Color, DTS Surround Sound, Dolby, NTSC, Widescreen, Subtitled  See more', 'Contributor': 'Eric Bana, Tom Hollander, Saoirse Ronan, Olivia Williams, Joe Wright, Cate Blanchett, Jason Flemyng', 'Initial release date': '2011-09-06', 'Language': 'English (DTS-HD Master Audio 5.1), French (DTS 5.1), Spanish (DTS 5.1)', 'Digital Copy Expiration Date': 'April 30, 2015', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'Relay time: 111min', 'Director': 'Joe Wright', 'Media Format': 'Blu-ray, AC-3, Multiple Formats, Dubbed, Color, DTS Surround Sound, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 51 minutes', 'Release date': 'September 6, 2011', 'Actors': 'Saoirse Ronan, Eric Bana, Cate Blanchett, Tom Hollander, Olivia Williams', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nGreat &#34;coming of age&#34; for a female assassin who is being chased by the people who &#34;created her.&#34; Ronan does a nice job.\nGreat \"coming of age\" for a female assassin who is ...\nLost in Space - Season 3, Vol. 1\nJune Lockhart  (Actor),     Mark Goddard  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n[\"Irwin Allen's LOST IN SPACE is classic sci-fi adventure at its best. Take the journey to this inspiring, intergalactic space odyssey with America's favorite space family in the 60's TV classic - LOST IN SPACE!\", 'Continue your collection with the first volume of LOST IN SPACE SEASON 3 on DVD today! Watch for LOST IN SPACE SEASON 3 VOLUME 2 coming in June 2005.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 11.2 Ounces', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, NTSC, Subtitled, Dubbed', 'Run time': '12 hours and 15 minutes', 'Release date': 'March 1, 2005', 'Actors': 'June Lockhart, Mark Goddard, Marta Kristen, Bill Mumy, Angela Cartwright', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Language': 'Spanish (Dolby Digital 1.0), English (Dolby Digital 1.0), French (Dolby Digital 1.0), Unqualified', 'Studio': '20th Century Fox', 'Writers': 'Irwin Allen', 'Number of discs': '4'}\nWhat can I say? Completed the series. Warning, Will Robinson- WARNING!\nFive Stars\nMarch of the Wooden Soldiers [Blu-ray]\nStan Laurel  (Actor),     Oliver Hardy  (Actor),     Gus Meins  (Director),     Charley Rogers  (Director)    &                   1                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Imagine an enchanted fantasy world of timeless characters and magical moments where nothing goes right for toy makers, Stannie Dum and Ollie Dee. Based on the original Babes in Toyland, this movie is a dazzling spectacle of 6-foot wooden soldiers, Mother Goose characters and the beloved team of Laurel and Hardy. This holiday classic is perfect for the Christmas season. In color and expertly restored, this film will surely become a part of your family holiday tradition.']\n{'Genre': 'Comedy/Classic Comedies', 'Format': 'Blu-ray', 'Contributor': 'Oliver Hardy, Gus Meins, Stan Laurel, Charley Rogers', 'Language': 'English', 'Runtime': '1 hour and 17 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': 'Relay time: 500min', 'Director': 'Gus Meins, Charley Rogers', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 17 minutes', 'Release date': 'September 14, 2010', 'Actors': 'Stan Laurel, Oliver Hardy', 'Studio': 'Legend Films', 'Number of discs': '1'}\nNice blu-ray but the story seems ragged as a vehicle for Laurel & Hardy.\nThree Stars\nThe Sandlot [Blu-ray]\nTom Guiry  (Actor),     Mike Vitar  (Actor),     David M. Evans  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Kids & Family\n['The best baseball player in the neighborhood helps a new kid with his clumsy ball-handling.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Dubbed, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Dubbed, Widescreen   See more', 'Contributor': 'Patrick Renna, David M. Evans, Chauncey Leopardi, Marty York, Tom Guiry, Mike Vitar', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'FOX2282779BR', 'Director': 'David M. Evans', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, NTSC, Subtitled, DTS Surround Sound, Dubbed, Widescreen', 'Release date': 'March 26, 2013', 'Actors': 'Tom Guiry, Mike Vitar, Patrick Renna, Chauncey Leopardi, Marty York', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nFun movie- a &#34;coming of age&#34; for a group of sandlot baseball friends. My sons both loved this movie. Great Family-Faire.\nFun movie- a \"coming of age\" for a group of ...\nThe Grand Budapest Hotel [Blu-ray]\nRalph Fiennes  (Actor),     F. Murray Abraham  (Actor),     Wes Anderson  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Oscar Nominees\n['THE GRAND BUDAPEST HOTEL recounts the adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. The story involves the theft and recovery of a priceless Renaissance painting and the battle for an enormous family fortune all against the back drop of a suddenly and dramatically changing Continent.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Blu-ray, Dolby, Subtitled, Widescreen', 'Contributor': 'Saoire Ronan, Wes Anderson, Mathieu Amalric, Owen Wilson, F. Murray Abraham, Scott Rudin, Tom Wilkinson, Tony Revolori, Jeff Goldblum, Willem Dafoe, Tilda Swinton, Harvey Keitel, Adrien Brody, Jude Law, Edward Norton, Jason Schwartzman, Ralph Fiennes, Léa Seydoux, Bill MurraySaoire Ronan, Wes Anderson, Mathieu Amalric, Owen Wilson, F. Murray Abraham, Scott Rudin, Tom Wilkinson, Tony Revolori, Jeff Goldblum, Willem Dafoe, Tilda Swinton, Harvey Keitel, Adrien Brody, Jude Law, Edward Norton, Jason Schwartzman, Ralph Fiennes, Léa Se…  See more', 'Language': 'English, French, Spanish', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '940478', 'Director': 'Wes Anderson', 'Media Format': 'Multiple Formats, Blu-ray, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 17, 2014', 'Actors': 'Ralph Fiennes, F. Murray Abraham, Mathieu Amalric, Adrien Brody, Willem Dafoe', 'Subtitles': 'English, French, Spanish', 'Producers': 'Wes Anderson, Scott Rudin', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Wes Anderson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nQuirky film with an intelligence under neath.  Enjoyable and funny.\nEnjoyable and funny.\nBoardwalk Empire: Season 3 (Blu-ray)\nVarious  (Actor, Director)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['One of HBO’s signature shows, this one-hour drama chronicles the life and times of Enoch “Nucky” Thompson (Golden Globe winner Steve Buscemi), Atlantic City’s undisputed czar at a time when Prohibition proved to be a major catalyst in the rise of organized crime in America. Picking up 16 months after Season 2 ended, Season 3 begins on New Year’s Eve 1922-23. The Roaring ‘20s are about to start; though the economy is booming, alcohol has become scarce, competition is fierce, and gangster violence is heating up. Amidst this backdrop, Nucky, whose marriage to Margaret (Kelly Macdonald) has become a sham after she signed away his highway windfall to the church, faces new competition in the person of Gyp Rosetti (new cast member Bobby Cannavale), who builds a new strategic bulkhead between New York and Atlantic City in an effort to siphon off Nucky’s alcohol business. The conflict brings out the best and worst in Nucky, who proves his brutal mettle in a series of violent encounters – including a climatic facedown with Gyp in the Season 3 finale. New and familiar faces also undergo compelling metamorphoses as the 12 new episodes of Boardwalk Empire unfold.']\n{'Genre': 'Drama/Television, Drama', 'Format': 'Multiple Formats, Blu-ray, AC-3, Box set, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Contributor': 'Various', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Number Of Discs': '7', 'Digital Copy Expiration Date': 'August 31, 2015', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 15.2 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Box set, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '12 hours and 13 minutes', 'Release date': 'August 20, 2013', 'Actors': 'Various', 'Subtitles': 'Spanish, French, English', 'Studio': 'HBO Studios', 'Number of discs': '7'}\nBest made for TV event to date. Every actor, costume, direction, set, lighting, editing, writing is brilliant.\nExcellence.\nSnowpiercer [Blu-ray]\nChris Evans  (Actor),     Tilda Swinton  (Actor),     Bong Joon Ho  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The film is set in the future (AD 2031) where, after a failed experiment to stop global warming, an Ice Age kills off all life on the planet except for the inhabitants of the Snowpiercer, a train that travels around the globe and is powered by a sacred perpetual-motion engine. Its inhabitants are divided by class; the lower-class passengers in one of the last cars stage an uprising, moving car by car up to the front of the train, where the oppressive rich and powerful ride.']\n{'Genre': 'Action/Adventure', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Bong Joon Ho, Jamie Bell, Tilda Swinton, John Hurt, Octavia Spencer, Chris Evans, Ed Harris', 'Language': 'English', 'Runtime': '2 hours and 6 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.3 x 6.7 inches; 4 Ounces', 'Item model number': 'ANCH62263BR', 'Director': 'Bong Joon Ho', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '2 hours and 6 minutes', 'Release date': 'October 21, 2014', 'Actors': 'Chris Evans, Tilda Swinton, Jamie Bell, Ed Harris, Octavia Spencer', 'Studio': 'ANCHOR BAY', 'Number of discs': '2'}\nInteresting film. Not sure if I like it or not. Seemed to have one direction and not much depth. Still, I sat thru it and had no real problems with it - it was just there. Nothing to write home about but not bad.\nNot sure if I like it or not\n{'Subtitles': ['None available'], 'Directors': ['Mark Osborne', 'John Stevenson'], 'Producers': ['Melissa Cobb', 'Jonathan Aibel', 'Glenn Berger'], 'Starring': ['Jack Black', 'Jackie Chan', 'Dustin Hoffman'], 'Studio': ['Paramount']}\nCute. My sons love this.\nMy sons love this.\nStar Wars: The Force Awakens\nHarrison Ford  (Actor),     Mark Hamill  (Actor),     J.J. Abrams  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Product Description', \"Visionary director J.J. Abrams brings to life the motion picture event of a generation. As Kylo Ren and the sinister First Order rise from the ashes of the Empire, Luke Skywalker is missing when the galaxy needs him most. It's up to Rey, a desert scavenger, and Finn, a defecting stormtrooper, to join forces with Han Solo and Chewbacca in a desperate search for the one hope of restoring peace to the galaxy.\", 'Additional Features', 'How to redeem your digital code:  1. Find Code on Insert  2. Enter Code   3. Select Provider   4. Enjoy Movie!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'J.J. Abrams', 'Media Format': 'Blu-ray, Digital_copy, DVD+Blu-ray', 'Run time': '2 hours and 16 minutes', 'Release date': 'April 5, 2016', 'Actors': 'Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley', 'Subtitles': 'French, Spanish, English', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Studio': 'Walt Disney Studios', 'Writers': 'Screenplay by Lawrence Kasdan & J.J. Abrams and Mi', 'Number of discs': '3'}\nThanks!\nFive Stars\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Atom Egoyan'], 'Producers': ['Robert Lantos', 'Ari Lantos'], 'Starring': ['Christopher Plummer', 'Martin Landau', 'Henry Czerny'], 'Studio': ['A24']}\nGood film. Pace is slow but done intentionally to create the mood of dementia patient dealing with the past. Theme revolves around the Holocaust and Auschwitz prison camp. The acting is intense- bravo to: Christopher Plummer, Martin Landau and Jurgen Prochnow. It is a film you will probably watch once for &#34;entertainment&#34; purposes, although if you are a buff- watch a few more times just to focus on the acting. Subtle and filled with character passion. Great ending. It's worth it if holocaust stories are interesting to you.\nPowerful acting done by Plummer, Landau and Prochnow.\nJoy [Blu-ray]\nRobert De Niro  (Actor),     Edgar Ramirez  (Actor),     David O. Russell  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"JOY is the wild story of a family across four generations centered on the girl who becomes the woman who founds a business dynasty and becomes a matriarch in her own right. Betrayal, treachery, the loss of innocence and the scars of love, pave the road in this intense emotional and human comedy about becoming a true boss of family and enterprise facing a world of unforgiving commerce. Allies become adversaries and adversaries become allies, both inside and outside the family, as Joy's inner life and fierce imagination carry her through the storm she faces. Jennifer Lawrence stars, with Robert de Niro, Bradley Cooper, Edgar Ramirez, Isabella Rossellini, Diane Ladd, and Virginia Madsen. Like David O. Russell's previous films, Joy defies genre to tell a story of family, loyalty, and love.\"]\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'AC-3, NTSC, Subtitled, Dubbed, Widescreen, DTS Surround Sound', 'Contributor': 'Robert De Niro, Edgar Ramirez, David O. Russell, Bradly Cooper', 'Language': 'English', 'Runtime': '2 hours and 4 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.65 Ounces', 'Item model number': '2310944', 'Director': 'David O. Russell', 'Media Format': 'AC-3, NTSC, Subtitled, Dubbed, Widescreen, DTS Surround Sound', 'Run time': '2 hours and 4 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Robert De Niro, Edgar Ramirez, Bradly Cooper', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat performance by Jennifer Lawrence.\nFive Stars\nBatman Complete Series (Repackage/Blu-ray)\nVarious  (Actor, Director)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n[\"Batman Complete Series (Repackage/Blu-ray): TV's iconic Dynamic Duo has been captured, along with a legion of abominable archenemies in a POW-erful numbered limited-edition collection. Featuring ALL 120 original broadcast episodes, ever popular guest stars like Julie Newmar and Cesar Romero, The Adam West Scrapbook, complete episode guide — and exploding with over 3 hours of all new extras — you can bring home all the crime fighting action that won generations of fans!\"]\n{'Genre': 'Television, Action & Adventure', 'Format': 'Blu-ray, Box set, Color, NTSC, Full Screen', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '13', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '2.7 x 5.6 x 7.6 inches; 1.27 Pounds', 'Item model number': 'Relay time: 19min; 7 Videos', 'Director': 'Various', 'Media Format': 'Blu-ray, Box set, Color, NTSC, Full Screen', 'Run time': '50 hours and 19 minutes', 'Release date': 'December 16, 2014', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '13'}\nFinally in blu-ray!\nFive Stars\nSeven Psychopaths [Blu-ray]\nColin Farrell  (Actor),     Woody Harrelson  (Actor),     Martin McDonagh  (Director, Producer, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"A struggling screenwriter inadvertently becomes entangled in the Los Angeles criminal underworld after his oddball friends kidnap a gangster's beloved Shih Tzu.\"]\n{'Genre': 'Comedy', 'Format': 'Blu-ray', 'Contributor': 'Colin Farrell, Christopher Walken, Tom Waits, Olga Kurylenko, Harry Dean Stanton, Woody Harrelson, Sam Rockwell, Betsy Danbury, Sarah Harvey, Peter Czernin, Linda Bright Clay, Abbie Cornish, Helena Mattsson, James Hébert, Tessa Ross, Graham Broadbent, Michael Pitt, Martin McDonagh, Michael StuhlbargColin Farrell, Christopher Walken, Tom Waits, Olga Kurylenko, Harry Dean Stanton, Woody Harrelson, Sam Rockwell, Betsy Danbury, Sarah Harvey, Peter Czernin, Linda Bright Clay, Abbie Cornish, Helena Mattsson, James Hébert, Tessa Ross, Graham Broadbent, Michael Pi…  See more', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': '41313', 'Director': 'Martin McDonagh', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 50 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Colin Farrell, Woody Harrelson, Sam Rockwell, Christopher Walken, Tom Waits', 'Subtitles': 'English, Spanish', 'Producers': 'Martin McDonagh, Betsy Danbury, Graham Broadbent, Peter Czernin, Sarah Harvey', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'Martin McDonagh', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFun times! Wacky.\nFun Times!\nThe Pink Panther Collection\nPeter Sellers  (Actor),     Blake Edwards  (Director)    Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Get ready for non-stop laughs as the great Peter Sellers plays his most beloved character, Inspector Jacques Clouseau, in these six films from writer/director Blake Edwards! THE PINK PANTHER A SHOT IN THE DARK THE RETURN OF THE PINK PANTHER THE PINK PANTHER STRIKES AGAIN REVENGE OF THE PINK PANTHER TRAIL OF THE PINK PANTHER']\n{'Genre': 'Comedy/Classic Comedies, Mystery & Suspense', 'Format': 'Box set, NTSC, Widescreen', 'Contributor': 'Peter Sellers, Blake Edwards', 'Language': 'English', 'Runtime': '10 hours and 30 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.05 Ounces', 'Director': 'Blake Edwards', 'Media Format': 'Box set, NTSC, Widescreen', 'Run time': '10 hours and 30 minutes', 'Release date': 'June 27, 2017', 'Actors': 'Peter Sellers', 'Studio': 'Shout Factory', 'Number of discs': '6'}\nSellers is a hoot. Fun times. I laughed so hard, I beumped my head!\nBeump your head!\nSleepers (BD) [Blu-ray]\nBrad Pitt  (Actor),     Robert Deniro  (Actor),     Barry Levinson  (Director, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Sleepers (BD)', ']]>']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, Blu-ray, Dolby, AC-3, NTSC, Widescreen, DTS Surround Sound', 'Contributor': 'Brad Renfro, Brad Pitt, Dustin Hoffman, Lorenzo Carcaterra, Barry Levinson, Billy Crudup, Kevin Bacon, Robert DeniroBrad Renfro, Brad Pitt, Dustin Hoffman, Lorenzo Carcaterra, Barry Levinson, Billy Crudup, Kevin Bacon, Robert Deniro  See more', 'Initial release date': '2011-08-02', 'Language': 'English', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Item model number': '1000187159', 'Director': 'Barry Levinson', 'Media Format': 'Multiple Formats, Blu-ray, Dolby, AC-3, NTSC, Widescreen, DTS Surround Sound', 'Run time': '2 hours and 27 minutes', 'Release date': 'August 2, 2011', 'Actors': 'Brad Pitt, Robert Deniro, Billy Crudup, Brad Renfro, Kevin Bacon', 'Studio': 'Studio Distribution Services', 'Writers': 'Barry Levinson, Lorenzo Carcaterra', 'Number of discs': '1'}\nAmazing movie. Bronx Drama. Deep. Disturbing. Honest performances. DeNiro at his best\nDon’t miss this powerful Bronx drama!\nTombstone [Blu-ray]\nKurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', 'Kurt Russell (MIRACLE, DEATH PROOF) and Val Kilmer (DEJA VU, THE MISSING) will blow you away in this explosive, action-packed adventure! And now, the legendary battle for justice in TOMBSTONE hits home on Blu-ray(TM) for the first time ever. Russell is U.S. Marshal Wyatt Earp; Kilmer is the outrageous Doc Holliday. Together, they team up to lay down the law in a notorious showdown with ruthless outlaws at the O.K. Corral. With an all-star cast that also includes Sam Elliott, Bill Paxton, Dana Delany, Jason Priestley, Michael Biehn and Hollywood icon Charlton Heston, this Wild West epic will transport you back in time and land you smack dab in the center of the crossfire. So strap on your six shooters as you experience the remarkable picture and theater-quality sound of TOMBSTONE in Blu-ray(TM) High Definition.', 'Amazon.com', \"This Western has become a modest cult favorite since its release in 1993, when the film was met with mixed reviews but the performances of Kurt Russell (as Wyatt Earp) and especially Val Kilmer, for his memorably eccentric performance as the dying gunslinger Doc Holliday, garnered high praise. The movie opens with Wyatt Earp trying to put his violent past behind him, living happily in Tombstone with his brothers and the woman (Dana Delany) who puts his soul at ease. But a murderous gang called the Cowboys has burst on the scene, and Earp can't keep his gun belt off any longer. The plot sounds routine, and in many ways it is, but Western buffs won't mind a bit thanks to a fine cast and some well-handled action on the part of Rambo director George P. Cosmatos, who has yet to make a better film than this. --\", 'Jeff Shannon']\n{'Genre': 'RUSSELL, CORRAL, O.K., HOLIDAY, DOC, EARP, WYATT, Action/Adventure, KURT', 'Format': 'Color, AC-3, NTSC, Blu-ray, Widescreen, Dubbed, DTS Surround Sound, Subtitled, Dolby', 'Contributor': 'Robert Burke, Charlton Heston, Bob Misiorowski, Billy Zane, Stephen Lang, Kevin Jarre, Bill Paxton, George P. Cosmatos, James Jacks, Michael Biehn, Sean Daniel, Dana Delany, Powers Booth, Kurt Russell, Joanna Pacula, Sam Elliott, Jon Tenney, Michael Rooker, Jason Priestley, Val KilmerRobert Burke, Charlton Heston, Bob Misiorowski, Billy Zane, Stephen Lang, Kevin Jarre, Bill Paxton, George P. Cosmatos, James Jacks, Michael Biehn, Sean Daniel, Dana Delany, Powers Booth, Kurt Russell, Joanna Pacula, Sam Elliott, Jon Tenney, Michael Rooker, Jason Priestle…   See more', 'Language': 'English (DTS-HD High Res Audio), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 1.6 Ounces', 'Item model number': '7019836', 'Director': 'George P. Cosmatos', 'Media Format': 'Color, AC-3, NTSC, Blu-ray, Widescreen, Dubbed, DTS Surround Sound, Subtitled, Dolby', 'Run time': '2 hours and 10 minutes', 'Release date': 'April 27, 2010', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Charlton Heston', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'James Jacks, Sean Daniel, Bob Misiorowski', 'Studio': 'HOLLYWOOD PICTURES', 'Writers': 'Kevin Jarre', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat film!\nGreat modern western",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Great modern western",
    "text": "Great film!",
    "images": [],
    "asin": "B0036EH40Q",
    "parent_asin": "B0036EH40Q",
    "user_id": "AEJYSBLZXMZDV5MQTEVVDPNO3E3Q",
    "timestamp": "2020-02-16 14:12:40.239000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Tombstone [Blu-ray]",
    "average_rating": 4.8,
    "rating_number": 50971,
    "features": [],
    "description": [
      "Product Description",
      "Kurt Russell (MIRACLE, DEATH PROOF) and Val Kilmer (DEJA VU, THE MISSING) will blow you away in this explosive, action-packed adventure! And now, the legendary battle for justice in TOMBSTONE hits home on Blu-ray(TM) for the first time ever. Russell is U.S. Marshal Wyatt Earp; Kilmer is the outrageous Doc Holliday. Together, they team up to lay down the law in a notorious showdown with ruthless outlaws at the O.K. Corral. With an all-star cast that also includes Sam Elliott, Bill Paxton, Dana Delany, Jason Priestley, Michael Biehn and Hollywood icon Charlton Heston, this Wild West epic will transport you back in time and land you smack dab in the center of the crossfire. So strap on your six shooters as you experience the remarkable picture and theater-quality sound of TOMBSTONE in Blu-ray(TM) High Definition.",
      "Amazon.com",
      "This Western has become a modest cult favorite since its release in 1993, when the film was met with mixed reviews but the performances of Kurt Russell (as Wyatt Earp) and especially Val Kilmer, for his memorably eccentric performance as the dying gunslinger Doc Holliday, garnered high praise. The movie opens with Wyatt Earp trying to put his violent past behind him, living happily in Tombstone with his brothers and the woman (Dana Delany) who puts his soul at ease. But a murderous gang called the Cowboys has burst on the scene, and Earp can't keep his gun belt off any longer. The plot sounds routine, and in many ways it is, but Western buffs won't mind a bit thanks to a fine cast and some well-handled action on the part of Rambo director George P. Cosmatos, who has yet to make a better film than this. --",
      "Jeff Shannon"
    ],
    "price": 5.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/511FxppM0WL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/511FxppM0WL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Kurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "Blu-ray",
      "Action & Adventure"
    ],
    "details": {
      "Genre": "RUSSELL, CORRAL, O.K., HOLIDAY, DOC, EARP, WYATT, Action/Adventure, KURT",
      "Format": "Color, AC-3, NTSC, Blu-ray, Widescreen, Dubbed, DTS Surround Sound, Subtitled, Dolby",
      "Contributor": "Robert Burke, Charlton Heston, Bob Misiorowski, Billy Zane, Stephen Lang, Kevin Jarre, Bill Paxton, George P. Cosmatos, James Jacks, Michael Biehn, Sean Daniel, Dana Delany, Powers Booth, Kurt Russell, Joanna Pacula, Sam Elliott, Jon Tenney, Michael Rooker, Jason Priestley, Val KilmerRobert Burke, Charlton Heston, Bob Misiorowski, Billy Zane, Stephen Lang, Kevin Jarre, Bill Paxton, George P. Cosmatos, James Jacks, Michael Biehn, Sean Daniel, Dana Delany, Powers Booth, Kurt Russell, Joanna Pacula, Sam Elliott, Jon Tenney, Michael Rooker, Jason Priestle…   See more",
      "Language": "English (DTS-HD High Res Audio), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0)",
      "Runtime": "2 hours and 10 minutes",
      "Aspect Ratio": "2.35:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "0.5 x 5.3 x 6.7 inches; 1.6 Ounces",
      "Item model number": "7019836",
      "Director": "George P. Cosmatos",
      "Media Format": "Color, AC-3, NTSC, Blu-ray, Widescreen, Dubbed, DTS Surround Sound, Subtitled, Dolby",
      "Run time": "2 hours and 10 minutes",
      "Release date": "April 27, 2010",
      "Actors": "Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Charlton Heston",
      "Dubbed": "French, Spanish",
      "Subtitles": "English, French, Spanish",
      "Producers": "James Jacks, Sean Daniel, Bob Misiorowski",
      "Studio": "HOLLYWOOD PICTURES",
      "Writers": "Kevin Jarre",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}