{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Butterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nReview Date: 2020/10/24\nStore: B bangcool\nAverage Rating: 4.6\nProduct Details: {'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nReview Text: Overall these stickers are very cute, and they stick on the nail easily. I feel like some of the stickers are very blurry, and it's hard to see what exactly the details are, which is a bit disappointing. The sticker sets also come from different brands, and they have a few different wrappers for each sticker.\nReview Title: Very cute, some stickers are \"blurry\"\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Magic Wand Makeup Brushes Set - 5pcs Wizard Wand Makeup Brushes Foundation Blending Blush Eyeshadow Face Lip Powder Brush Beauty Tools (New-Bronze)\nrongji jewelry\n{'Brand': 'rongji jewelry', 'Recommended Uses For Product': 'For Eyeshadow, Lip, For Blush, For Setting Powder, For Foundation, Eyebrow', 'Color': 'New-Bronze', 'Material': 'Synthetic', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '5', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '7.72 x 3.03 x 1.14 inches; 5.29 Ounces', 'Item model number': 'makeup brushes', 'UPC': '793610791245', 'Manufacturer': 'YUNXIAN'}\nWOW! I was so surprised when I took these out of the package. They are very sturdy and look amazing. I wasn't expecting them to be as heavy as they were, but they really are pieces of art. There were a few loose hairs, but once those fell out (as most brushes do), they worked great. The carrying case they came with was also very cute. These are perfect for any Harry Potter fan. I am still so happy with how great these are.\nQuality!\nMaya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nMAYA MARI\n{'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nI love the pump that this shampoo comes with. It's great to easily add the product to your hand while showering. This is also a nice big size for the price.<br /><br />The shampoo is a bit watery, but it does lather very nicely and my hair feels smooth and silky after using it. I feel like I can use this everyday without drying out my hair. The shampoo smells really nice and I love the scent - it's not too strong. I had to use maybe two pumps to fully cover my hair while showering.\nLove the pump\nButterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nB bangcool\n{'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nOverall these stickers are very cute, and they stick on the nail easily. I feel like some of the stickers are very blurry, and it's hard to see what exactly the details are, which is a bit disappointing. The sticker sets also come from different brands, and they have a few different wrappers for each sticker.\nVery cute, some stickers are \"blurry\"",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** Strong inclination toward makeup tools and artistic designs, alongside an expanding interest in nail art. The user appreciates products that resonate with pop culture, particularly fantasy themes.\n- **Product Appreciation:** Values high-quality, functional, and visually appealing items across beauty categories, including an interest in convenient packaging features for hair care and nail art products.\n- **Quality Expectation:** Seeks craftsmanship in beauty and personal care items, with a preference for durable tools and effective formulations that suit specific needs. Recent interest in nail art reflects a desire for detailed and unique designs.\n- **Age Range:** Adult consumer focused on mature beauty, grooming, and nail art tools encompassing a variety of applications.\n- **Overall Sentiment:** Maintains a positive review history, expressing enthusiasm for product quality. Recent feedback indicates a keen eye for detail, with an acknowledgment of both attractive design and functional use, along with minor disappointments regarding clarity in product details.\n- **Details Awareness:** Strong attention to product functionality, ease of use, and aesthetic appeal. The user has noted the need for better clarity and quality consistency in decorative products.\n- **Material Preference:** Open to synthetic and diverse materials, demonstrating flexibility across beauty, hair care, and nail art products.\n\nThis profile illustrates a blend of aesthetic appreciation, practical expectations, and a growing interest in detailed and unique beauty accessories.",
  "metrics": {
    "rouge1_f": 0.20689655172413796,
    "rouge2_f": 0.008645533141210375,
    "rougeL_f": 0.09195402298850575,
    "meteor": 0.09489633173843699,
    "bleu1": 0.08309789798507956,
    "bleu2": 0.023748144760880215,
    "bleu3": 0.003799896902786021,
    "bleu4": 0.0015213016711732301,
    "bertscore_precision": 0.36879169940948486,
    "bertscore_recall": 0.4304938316345215,
    "bertscore_f1": 0.3972611427307129
  }
}