{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Maya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nReview Date: 2020/09/10\nStore: MAYA MARI\nAverage Rating: 4.3\nProduct Details: {'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nReview Text: I love the pump that this shampoo comes with. It's great to easily add the product to your hand while showering. This is also a nice big size for the price.<br /><br />The shampoo is a bit watery, but it does lather very nicely and my hair feels smooth and silky after using it. I feel like I can use this everyday without drying out my hair. The shampoo smells really nice and I love the scent - it's not too strong. I had to use maybe two pumps to fully cover my hair while showering.\nReview Title: Love the pump\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Magic Wand Makeup Brushes Set - 5pcs Wizard Wand Makeup Brushes Foundation Blending Blush Eyeshadow Face Lip Powder Brush Beauty Tools (New-Bronze)\nrongji jewelry\n{'Brand': 'rongji jewelry', 'Recommended Uses For Product': 'For Eyeshadow, Lip, For Blush, For Setting Powder, For Foundation, Eyebrow', 'Color': 'New-Bronze', 'Material': 'Synthetic', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '5', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '7.72 x 3.03 x 1.14 inches; 5.29 Ounces', 'Item model number': 'makeup brushes', 'UPC': '793610791245', 'Manufacturer': 'YUNXIAN'}\nWOW! I was so surprised when I took these out of the package. They are very sturdy and look amazing. I wasn't expecting them to be as heavy as they were, but they really are pieces of art. There were a few loose hairs, but once those fell out (as most brushes do), they worked great. The carrying case they came with was also very cute. These are perfect for any Harry Potter fan. I am still so happy with how great these are.\nQuality!\nMaya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nMAYA MARI\n{'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nI love the pump that this shampoo comes with. It's great to easily add the product to your hand while showering. This is also a nice big size for the price.<br /><br />The shampoo is a bit watery, but it does lather very nicely and my hair feels smooth and silky after using it. I feel like I can use this everyday without drying out my hair. The shampoo smells really nice and I love the scent - it's not too strong. I had to use maybe two pumps to fully cover my hair while showering.\nLove the pump",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** Strong inclination toward makeup tools, particularly those with unique and artistic designs, alongside a newfound interest in quality hair care products. Appreciates items that resonate with pop culture themes, specifically fantasy elements (e.g., Harry Potter).\n- **Product Appreciation:** Values high-quality products that are both functional and aesthetically pleasing. Interest has expanded to include hair care products that emphasize usability, such as convenient packaging features.\n- **Quality Expectation:** Seeks quality craftsmanship in beauty and personal care items, showcasing a preference for durable and visually appealing tools that enhance user experience. This extends to hair care, with an appreciation for effective formulations that cater to specific hair types.\n- **Age Range:** Adult consumer, indicating interest in mature beauty and grooming tools that cater to a variety of applications, including makeup and hair care.\n- **Overall Sentiment:** Positive review history, characterized by expressions of surprise and delight regarding product quality, indicating an enthusiastic and satisfied user when expectations are met.\n- **Details Awareness:** Strong attention to detail regarding product functionality (e.g., ease of use) and packaging convenience, alongside appreciation for effective scent profiles.\n- **Material Preference:** Open to synthetic materials in beauty tools, showing a flexible approach to product types across both makeup and hair care categories.\n\nThis profile reflects a blend of aesthetic appreciation and practical expectations in beauty and personal care products.",
  "metrics": {
    "rouge1_f": 0.23783783783783788,
    "rouge2_f": 0.014466546112115734,
    "rougeL_f": 0.10450450450450449,
    "meteor": 0.11984231044339584,
    "bleu1": 0.15181375719086015,
    "bleu2": 0.024196214637130797,
    "bleu3": 0.004838466719931854,
    "bleu4": 0.0021654983176783065,
    "bertscore_precision": 0.38628461956977844,
    "bertscore_recall": 0.43030694127082825,
    "bertscore_f1": 0.4071091413497925
  }
}