{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Film Noir Double Feature: Please Murder Me / A Life At Stake\nReview Date: 2014/12/18\nStore: Peter Godfrey  (Director),     Paul Guilfoyle  (Director),     Lamont Johnson  (Actor),     Raymond Burr  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Please Murder Me', '(B&W, 1956):', '\"In 55 minutes I will be dead... murdered.\" Attorney Craig Carlson, sitting in the shadows of his dark office, solemnly dictates this stunning announcement into a tape recorder. Carlson has fallen in love with Myra, the wife of his best friend, Joe Leeds. Joe is found dead and Myra is arrested for murder. Carlson defends her at the trial. Things are not always as they seem and there are no happy endings for the doomed participants of this tragic triangle. One year before his Perry Mason show, Raymond Burr plays a similar role in this dark, low-budget film noir. A young Angela Lansbury plays the femme fatale, and Dick Foran, veteran of B Westerns and Universal horror movies plays the murder victim Joe Leeds.', 'A Life at Stake', '(B&W, 1954):', \"An architect embroiled in an adulterous affair suspects that he is marked for murder. Building designer Edward Shaw has been making time with Doris, his business partner's wife. After being pressured by the couple to take out a hefty life insurance policy, he narrowly escapes death in a strange, nearly fatal accident. Doris's own sister, Madge, divulges that Doris' first husband had died under mysterious circumstances, and Shaw even tells the police of his suspicions. Torn between his fear of death and his lust for Doris, Shaw nonetheless agrees to meet his lover in a mountaintop cabin. When her cuckolded husband finally appears at the door, hard-drinking Doris brings a gun into the picture, and death arrives shortly thereafter.\"]\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'ALVI5218DVD', 'Director': 'Peter Godfrey, Paul Guilfoyle', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 20, 2022', 'Actors': 'Lamont Johnson, Raymond Burr, Angela Lansbury', 'Studio': 'Alpha Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: purchased this movie, I am a big fan of Raymond Burr and Angela Lansbury,<br />really enjoy murder mystery and who done it film noir.\nReview Title: Film noir double feature\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Murder, She Wrote: Season 2\nAngela Lansbury  (Actor),     Tom Bosley  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Emmy Award nominee Angela Lansbury is back on the case in all 22 episodes of the critically acclaimed series, Murder, She Wrote Season Two. Rejoin Jessica Fletcher, everyone\\'s favorite mystery writer, back in Cabot Cove, where she pens her whodunit books and keeps finding that her life is imitating her art. Teamed with some of the biggest guest stars on television, including Jerry Orbach, Adrienne Barbeau, Dick Van Patten and Carol Lawrence, Jessica continues her quest to find the truth in even the murkiest circumstances. Catch the complete second season of Murder, She Wrote, the classic mystery series that \"…remains well worth revisiting two decades later\" (Josef Adalian, Daily Variety).']\n{'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie, Mystery & Suspense', 'Format': 'Box set, Color, Dolby, Full Screen', 'Contributor': 'William Windom, Tom Bosley, Angela Lansbury', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.72 x 6.02 x 1.89 inches; 8.8 Ounces', 'Media Format': 'Box set, Color, Dolby, Full Screen', 'Run time': '35 hours and 28 minutes', 'Release date': 'December 6, 2005', 'Actors': 'Angela Lansbury, Tom Bosley, William Windom', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '3'}\nenjoy watching crime stopper with mrs. fletcher<br />she's exciting to watch<br />anyone whose interest is in solving crimes will like it<br />as much as I do.\nmurder she wrote\nPerry Mason: Season 1, Vol. 1\nRaymond Burr  (Actor),     Barbara Hale  (Actor),     Robert Ellis Miller  (Director),     Ted Post  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Mystery & Thrillers\n['Product Description', 'Perry Mason is an attorney who specializes in defending seemingly indefensible cases. With the aid of his secretary Della Street and investigator Paul Drake, he often finds that by digging deeply into the facts, startling facts can be revealed. Often relying on his outstanding courtroom skills, he often tricks or traps people into unwittingly admitting their guilt. Steps to access the closed-captioning is as follows: 1. Press SETTINGS on your remote. 2. Using the left/right arrow buttons, scroll to Quick Settings. 3. Using the up/down arrow buttons, scroll to Closed Captioning. 4. Press SELECT on your remote. 5. Using the up/down arrow buttons, scroll to highlight On, On with Mute or Off. 6. Press SELECT on your remote.', 'Amazon.com', 'There was a time when the defense attorney was a heroic everyman, not the butt of bad jokes; think Atticus Finch in', 'To Kill a Mockingbird', \", and, of course, Raymond Burr's incomparable Perry Mason. The first season of\", 'Perry Mason', ', which launched in 1957 on CBS, shows just how dramatic a \"law and order\" show could be. Shot in lush black and white, on film, the episodes have been lovingly restored (including lost minutes hacked from reruns to accommodate commercials). The story arcs and atmosphere feel more like film noir (Perry Mason + Philip Marlowe = separated at birth?) than early TV. The cast was stellar, including Burr\\'s Emmy-winning Perry Mason, the indefatigable lawyer who takes tough cases no one else will touch. Burr\\'s chemistry crackles from episode 1 with his costars, including Barbara Hale as secretary Della, William Hopper as private detective Paul Drake, and William Talman as Hamilton Burger, the well-meaning but overmatched district attorney. While it\\'s true that the last-minute witness-stand confessions strain some credulity, the case-cracking, character development, and dialogue set a high bar for the legal shows that followed. \"The Case of the Negligent Nymph,\" for instance, involves a comely young woman--and murder suspect--fished out of the Pacific; Mason deadpans to Drake, \"Call off the search, Paul; we\\'ve landed our mermaid.\" The shows unfold at a leisurely pace, and yet don\\'t rely on the overly expositive dialogue that, say,', 'Law & Order', \"does; the viewer learns a lot about each case simply as it happens. The set contains the first 19 episodes of the first season and will hook you, even if you're not a procedural buff.\", '--A.T. Hurley']\n{'Genre': 'Television, Television/Crime', 'Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Contributor': 'Gerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert KayGerald Mayer, John Peyser, Roger Kay, James Goldstone, Ted Post, Francis D. Lyon, Robert Ellis Miller, Raymond Burr, Barbara Hale, Don Weis, Jerry Hopper, William Talman, Jack Arnold, William Hopper, John English, Richard Whorf, Gilbert Kay   See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.91 x 5.44 x 7.8 inches; 9.59 Ounces', 'Item model number': '097368878143', 'Director': 'Robert Ellis Miller, Ted Post, James Goldstone, Jack Arnold, Don Weis', 'Media Format': 'Closed-captioned, NTSC, Full Screen, Black & White, Multiple Formats, Box set', 'Run time': '1 hour', 'Release date': 'July 11, 2006', 'Actors': 'Raymond Burr, Barbara Hale, William Talman, William Hopper', 'Studio': 'Paramount/CBS', 'Number of discs': '5'}\nI am a any time fan of perry mason<br />murder,mystery, intrigue, excitement,keeps me guessing<br />all through the courtroom drama fascinated with the<br />actors that play the rolls.<br />Enjoyable!\nperry mason, season 1,vol l\nLoves Music, Loves to Dance (Mary Higgins Clark Mystery Collection)\nPatsy Kensit  (Actor),     Cynthia Preston  (Actor),     Mario Azzopardi  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"A talk show producer faces her own guilt when she discovers that her best friend was murdered after answering an online personal ad. Against the wishes of detective D'Salva, she begins a treacherous dating game, drawing the killer's sights to her.\"]\n{'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Michael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah JohnsonMichael Rhoades, Peter Mohan, Mario Azzopardi, Robert Morelli, Patsy Kensit, Dean McDermott, Justin Louis, Allan Royal, Yannick Bisson, Cynthia Preston, Frank Pellegrino, Lawrence Bayne, Mary Higgins Clark, Eugene Clark, Taborah Johnson   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 35 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4.8 Ounces', 'Director': 'Mario Azzopardi', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Patsy Kensit, Cynthia Preston, Dean McDermott, Frank Pellegrino, Yannick Bisson', 'Studio': 'Lions Gate', 'Writers': 'Mary Higgins Clark, Peter Mohan', 'Number of discs': '1'}\nhad the chance to watch this movies before purchasing, had fun<br />and excitement trying to figure who committed the crimes.<br />Had to purchase , still enjoying .<br />If you enjoy watching and solving crime of<br />the who done it, you will have fun with his movie.\nmary higgins clark's loves music loves to dance\n7 Men from Now (Widescreen Special Collector's Edition)\nJohn Phillips  (Actor),     Chuck Roberson  (Actor),     Budd Boetticher  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Westerns', 'Format': \"Multiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, Color, Dolby, Collector's Edition, NTSC, Special Edition, Subtitled, Widescreen   See more\", 'Contributor': 'Randolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail RussellRandolph Scott, Fred Graham, Walter Reed, John Larch, Lee Marvin, John Beradino, John Phillips, Chuck Roberson, Pamela Duncan, Budd Boetticher, Steve Mitchell, Stuart Whitman, Don \"Red\" Barry, Gail Russell   See more', 'Language': 'English', 'Runtime': '1 hour and 18 minutes'}\nif you love western from the 1940-50's era, as I do<br />you will have fun watching hours of back in the day<br />cowboys in the old west, bringing law and order<br />to the western frontier!\n7 men from now\nThe Blue Gardenia\nAnne Baxter  (Actor),     Richard Conte  (Actor),     Fritz Lang  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['A drunken woman hits her blind date with a poker, then reads about his death in the paper. Directed by Fritz Lang.']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': \"Jeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann SothernJeff Donnell, Ray Walker, Nat 'King' Cole, Vera Caspary, George Reeves, Raymond Burr, Richard Erdman, Ruth Storey, Charles Hoffman, Anne Baxter, Fay Baker, Richard Conte, Fritz Lang, Robert Bice, Ann Sothern   See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'ID9042AQDVD', 'Director': 'Fritz Lang', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 11, 2000', 'Actors': 'Anne Baxter, Richard Conte, Ann Sothern, Raymond Burr, Jeff Donnell', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Charles Hoffman, Vera Caspary', 'Number of discs': '1'}\nHad previously viewed this movie, really enjoyed the<br />action and suspense.<br />Had fun watching, if you love solving puzzles, try it!\nSUSPENSE MOVIEGOER!\nAmerican President, The (DVD)\nMichael Douglas  (Actor),     Annette Bening  (Actor),     Rob Reiner  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox. The blockbuster romantic comedy about a modern president and the beautiful environmental lobbyist who wins his heart. 1995/color/115 min/PG-13/widescreen.NOTE:Widescreen version Presented in a \"Letterbox\" widescreen format preserving the \"scope\" aspect ratio of its original theatrical exhibition.Enhance For widescreen TV\\'s.']\n{'Genre': 'Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Contributor': 'Annette Bening, Martin Sheen, Michael J. Fox, Rob Reiner, Michael Douglas', 'Language': 'Unqualified', 'Runtime': '1 hour and 54 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 0.01 Ounces', 'Item model number': '4314658', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Michael Douglas, Annette Bening, Martin Sheen, Michael J. Fox', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nHad to purchase now its on dvd, love this movie,<br />only had it on VHS.\nMovie Anytime for Enjoyment\nFilm Noir Double Feature: Please Murder Me / A Life At Stake\nPeter Godfrey  (Director),     Paul Guilfoyle  (Director),     Lamont Johnson  (Actor),     Raymond Burr  (Actor)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Please Murder Me', '(B&W, 1956):', '\"In 55 minutes I will be dead... murdered.\" Attorney Craig Carlson, sitting in the shadows of his dark office, solemnly dictates this stunning announcement into a tape recorder. Carlson has fallen in love with Myra, the wife of his best friend, Joe Leeds. Joe is found dead and Myra is arrested for murder. Carlson defends her at the trial. Things are not always as they seem and there are no happy endings for the doomed participants of this tragic triangle. One year before his Perry Mason show, Raymond Burr plays a similar role in this dark, low-budget film noir. A young Angela Lansbury plays the femme fatale, and Dick Foran, veteran of B Westerns and Universal horror movies plays the murder victim Joe Leeds.', 'A Life at Stake', '(B&W, 1954):', \"An architect embroiled in an adulterous affair suspects that he is marked for murder. Building designer Edward Shaw has been making time with Doris, his business partner's wife. After being pressured by the couple to take out a hefty life insurance policy, he narrowly escapes death in a strange, nearly fatal accident. Doris's own sister, Madge, divulges that Doris' first husband had died under mysterious circumstances, and Shaw even tells the police of his suspicions. Torn between his fear of death and his lust for Doris, Shaw nonetheless agrees to meet his lover in a mountaintop cabin. When her cuckolded husband finally appears at the door, hard-drinking Doris brings a gun into the picture, and death arrives shortly thereafter.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'ALVI5218DVD', 'Director': 'Peter Godfrey, Paul Guilfoyle', 'Media Format': 'Multiple Formats, NTSC, Black & White', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 20, 2022', 'Actors': 'Lamont Johnson, Raymond Burr, Angela Lansbury', 'Studio': 'Alpha Video', 'Country of Origin': 'USA', 'Number of discs': '1'}\npurchased this movie, I am a big fan of Raymond Burr and Angela Lansbury,<br />really enjoy murder mystery and who done it film noir.\nFilm noir double feature",
  "profile": "The user maintains a strong affinity for the mystery genre, particularly classic television series that blend courtroom drama with crime-solving elements. Their passion for character-driven narratives featuring prominent actors in legal and detective roles reflects an appreciation for intricate plotlines and immersive storytelling characteristic of \"whodunit\" scenarios. Recently, they have broadened their horizons by exploring classic Westerns, demonstrating a growing interest in vintage narratives.\n\nThe user's commitment to physical media is evident through their pursuit of collectible DVD box sets, emphasizing a love for timeless cinematic experiences with compelling characters and thought-provoking narratives across various genres. A recent purchase indicates their openness to diverse storytelling, adding a romantic comedy to their collection while still favoring engaging plots.\n\nIn their latest interaction, the user acquired a film noir double feature, showcasing their enduring love for murder mysteries and classic crime films. Their enthusiasm for notable actors like Raymond Burr and Angela Lansbury further illustrates their preference for rich character development and suspenseful storytelling. Overall, the user’s evolving interests continue to align with their established appreciation for high-quality films that encompass drama, emotional depth, and complex narratives, reinforcing their focus on intellectually stimulating themes across genres.",
  "metrics": {
    "rouge1_f": 0.0849673202614379,
    "rouge2_f": 0.014717906786590353,
    "rougeL_f": 0.04248366013071895,
    "meteor": 0.02568736178719904,
    "bleu1": 3.4374165641276075e-07,
    "bleu2": 1.4473271598715025e-07,
    "bleu3": 6.580759970506344e-08,
    "bleu4": 3.735743449306661e-08,
    "bertscore_precision": 0.3168565630912781,
    "bertscore_recall": 0.49887800216674805,
    "bertscore_f1": 0.38755932450294495
  }
}