{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Diane Bobby Pins, Black, 2\", 300 Count\nReview Date: 2017/12/29\nStore: Diane\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Diane', 'Hair Type': 'All', 'Color': 'Black', 'Age Range (Description)': 'Adult', 'Material': 'Rubber', 'Package Dimensions': '4.45 x 4.41 x 1.65 inches; 7.05 Ounces', 'Item model number': 'D452', 'UPC': '824703004529'}\nReview Text: They are bobby pins....what can I say.  I use the. Every day to pin my hair up under a wig.\nReview Title: They are bobby pins\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Vaultz Locking Makeup Artist Case, Black White Stripe (VZ03755)\nVaultz\n['At Vaultz, \"If it\\'s Important to You, Lock It Up.\" The Vaultz Makeup Artist Case allows you to lock your personal and private items up in style. This durable and chic box is ideal for carrying makeup and other cosmetics on the go. The reliable key lock provides security, and the sturdy construction features steel corners, aluminum reinforcement, and a convenient handle for easy carrying. This makeup case features a built-in 14 brush holder in lid, a removable, divided, upper tray for simple access to lower compartment and 5 adjustable dividers to customize the space. This is a makeup case that you are sure to love. Black White Stripe.']\n{'Product Dimensions': '9.75 x 9.13 x 15.38 inches; 2.8 Pounds', 'Item model number': 'VZ03755', 'UPC': '826030037553', 'Manufacturer': 'Ideastream Consumer Products, LLC'}\nPlenty of room and does not weigh alot empty.\nplenty of room\nLashtoniic Eyelash & Eyebrow Growth Serum - Grows Longer, Fuller, Thicker Lashes & Brows in 30 Days - 100% Natural Lash Enhancer Conditioner Treatment, No Irritation\nQBEXJ\n{'Brand': 'QBEXJ', 'Skin Type': 'All', 'Package Type': 'Box', 'Specialty': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 0.59 x 0.59 inches; 0.63 Ounces', 'UPC': '734010214415'}\nIt seems to work.  I have been using this for about 3 weeks and notice longer lashes and thicker eyebrows.  I use it twice a day.  UPDATE:  I am on my second tube and I hope they do not stop making this stuff.  I have tried other serums but they burned my eyes.  This ones does not burn unless I actually drop it into my eye.  It has improved the length and health of my lashes and I seem to have more lashes when I curl them.  I am happy with this product and do not feel the need to purchase anything more expensive or that might work faster.\nNotice a difference after about 3 weeks.\nEyebrow Makeup Gel, Eyebrow Tint Gel, Eyebrow Dye Cream, 2Pcs Natural Color Eyebrow Gel, Waterproof Long Lasting Eyebrow Dye Gel for Eyebrow Makeup\nCidBestOfficial\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.84 x 2.32 x 0.75 inches; 1.62 Ounces'}\nWorks really well on my greying brows.  Would rather purchase in singles, but this is not bad.  The dark is really dark.  Lots of pigment.  I would repurchase\nCovers grey brow hairs\nFrcolor Wig Grip Wig Comfort Scarf Head Hair Band Adjustable Fastern (Beige)\nFRCOLOR\n{'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Velvet', 'Number of Items': '1', 'Item Weight': '0.04 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '21.3 x 2.01 x 0.08 inches; 0.64 Ounces', 'Item model number': 'SG_B071YW1P7X_US', 'UPC': '191579152105'}\nI wear a wig every day and do not want to be without this\nWorks really well\nDiane Bobby Pins, Black, 2\", 300 Count\nDiane\n{'Brand': 'Diane', 'Hair Type': 'All', 'Color': 'Black', 'Age Range (Description)': 'Adult', 'Material': 'Rubber', 'Package Dimensions': '4.45 x 4.41 x 1.65 inches; 7.05 Ounces', 'Item model number': 'D452', 'UPC': '824703004529'}\nThey are bobby pins....what can I say.  I use the. Every day to pin my hair up under a wig.\nThey are bobby pins",
  "profile": "The user maintains a clear preference for high-quality beauty products that deliver effective results, particularly in cosmetics and makeup application. Their commitment to functionality and comfort is evident, as showcased by their recent positive experience with a practical beauty accessory. This reflects a lifestyle centered on versatility and an investment in durable solutions that enhance their aesthetic.\n\nThe user demonstrates a thoughtful approach to beauty, favoring products that are convenient yet high-performing, which highlights their desire for reliability over gimmicky options. Their enthusiasm for diverse beauty accessories, coupled with consistent high ratings for effective products, underscores their focus on quality and seamless integration into an active lifestyle. \n\nThe latest purchase of functional hair accessories further illustrates their prioritization of practicality in their beauty regimen. This multifaceted approach emphasizes their aim to cultivate a coordinated beauty experience that combines style, functionality, and comfort. Overall, the user navigates their beauty journey with intention, actively seeking well-designed solutions that cater to their specific needs while ensuring a polished and efficient outcome.",
  "metrics": {
    "rouge1_f": 0.15384615384615383,
    "rouge2_f": 0.0,
    "rougeL_f": 0.0811188811188811,
    "meteor": 0.0582698341550874,
    "bleu1": 0.01917859693803307,
    "bleu2": 0.005375049338834869,
    "bleu3": 0.0009565308097024945,
    "bleu4": 0.00040406282928904456,
    "bertscore_precision": 0.30619683861732483,
    "bertscore_recall": 0.471859335899353,
    "bertscore_f1": 0.37139180302619934
  }
}