{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Eyebrow Makeup Gel, Eyebrow Tint Gel, Eyebrow Dye Cream, 2Pcs Natural Color Eyebrow Gel, Waterproof Long Lasting Eyebrow Dye Gel for Eyebrow Makeup\nReview Date: 2017/10/23\nStore: CidBestOfficial\nAverage Rating: 3.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.84 x 2.32 x 0.75 inches; 1.62 Ounces'}\nReview Text: Works really well on my greying brows.  Would rather purchase in singles, but this is not bad.  The dark is really dark.  Lots of pigment.  I would repurchase\nReview Title: Covers grey brow hairs\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Vaultz Locking Makeup Artist Case, Black White Stripe (VZ03755)\nVaultz\n['At Vaultz, \"If it\\'s Important to You, Lock It Up.\" The Vaultz Makeup Artist Case allows you to lock your personal and private items up in style. This durable and chic box is ideal for carrying makeup and other cosmetics on the go. The reliable key lock provides security, and the sturdy construction features steel corners, aluminum reinforcement, and a convenient handle for easy carrying. This makeup case features a built-in 14 brush holder in lid, a removable, divided, upper tray for simple access to lower compartment and 5 adjustable dividers to customize the space. This is a makeup case that you are sure to love. Black White Stripe.']\n{'Product Dimensions': '9.75 x 9.13 x 15.38 inches; 2.8 Pounds', 'Item model number': 'VZ03755', 'UPC': '826030037553', 'Manufacturer': 'Ideastream Consumer Products, LLC'}\nPlenty of room and does not weigh alot empty.\nplenty of room\nLashtoniic Eyelash & Eyebrow Growth Serum - Grows Longer, Fuller, Thicker Lashes & Brows in 30 Days - 100% Natural Lash Enhancer Conditioner Treatment, No Irritation\nQBEXJ\n{'Brand': 'QBEXJ', 'Skin Type': 'All', 'Package Type': 'Box', 'Specialty': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 0.59 x 0.59 inches; 0.63 Ounces', 'UPC': '734010214415'}\nIt seems to work.  I have been using this for about 3 weeks and notice longer lashes and thicker eyebrows.  I use it twice a day.  UPDATE:  I am on my second tube and I hope they do not stop making this stuff.  I have tried other serums but they burned my eyes.  This ones does not burn unless I actually drop it into my eye.  It has improved the length and health of my lashes and I seem to have more lashes when I curl them.  I am happy with this product and do not feel the need to purchase anything more expensive or that might work faster.\nNotice a difference after about 3 weeks.\nEyebrow Makeup Gel, Eyebrow Tint Gel, Eyebrow Dye Cream, 2Pcs Natural Color Eyebrow Gel, Waterproof Long Lasting Eyebrow Dye Gel for Eyebrow Makeup\nCidBestOfficial\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.84 x 2.32 x 0.75 inches; 1.62 Ounces'}\nWorks really well on my greying brows.  Would rather purchase in singles, but this is not bad.  The dark is really dark.  Lots of pigment.  I would repurchase\nCovers grey brow hairs",
  "profile": "The user maintains a discerning preference for effective and stylish beauty products, particularly in cosmetics and makeup application. Their recent experience with an eyebrow gel demonstrates a commitment to quality solutions that deliver visible results, such as covering greying brow hairs. While the user appreciates the product's pigmentation and effectiveness, they express a desire for more purchase flexibility, indicating a thoughtful approach to their beauty selections and a consideration for convenience.\n\nTheir consistent focus on durable and secure beauty solutions suggests a lifestyle that values functionality alongside aesthetics, likely influenced by professional makeup artistry or a deep passion for beauty. The user's satisfaction with their recent purchase, reflected in a strong rating, underscores their expectation for performance and reliability in their beauty routine. \n\nAdditionally, their emphasis on products that show tangible improvements over time highlights a preference for tried-and-true options over potentially flashy alternatives. Overall, the user's preferences reveal a balanced approach to beauty care, seeking versatile, effective, and well-designed products that enhance their makeup experience while prioritizing comfort and usability. This aligns with their ongoing investment in high-quality, functional beauty solutions that seamlessly integrate into their active lifestyle.",
  "metrics": {
    "rouge1_f": 0.22704507512520872,
    "rouge2_f": 0.020100502512562814,
    "rougeL_f": 0.09015025041736226,
    "meteor": 0.10017669773396186,
    "bleu1": 0.0890346713017069,
    "bleu2": 0.025412114079435527,
    "bleu3": 0.004280574502283358,
    "bleu4": 0.0017589297008170808,
    "bertscore_precision": 0.3410947322845459,
    "bertscore_recall": 0.4620811343193054,
    "bertscore_f1": 0.39247554540634155
  }
}