{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Frcolor Wig Grip Wig Comfort Scarf Head Hair Band Adjustable Fastern (Beige)\nReview Date: 2017/12/28\nStore: FRCOLOR\nAverage Rating: 3.3\nProduct Details: {'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Velvet', 'Number of Items': '1', 'Item Weight': '0.04 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '21.3 x 2.01 x 0.08 inches; 0.64 Ounces', 'Item model number': 'SG_B071YW1P7X_US', 'UPC': '191579152105'}\nReview Text: I wear a wig every day and do not want to be without this\nReview Title: Works really well\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Vaultz Locking Makeup Artist Case, Black White Stripe (VZ03755)\nVaultz\n['At Vaultz, \"If it\\'s Important to You, Lock It Up.\" The Vaultz Makeup Artist Case allows you to lock your personal and private items up in style. This durable and chic box is ideal for carrying makeup and other cosmetics on the go. The reliable key lock provides security, and the sturdy construction features steel corners, aluminum reinforcement, and a convenient handle for easy carrying. This makeup case features a built-in 14 brush holder in lid, a removable, divided, upper tray for simple access to lower compartment and 5 adjustable dividers to customize the space. This is a makeup case that you are sure to love. Black White Stripe.']\n{'Product Dimensions': '9.75 x 9.13 x 15.38 inches; 2.8 Pounds', 'Item model number': 'VZ03755', 'UPC': '826030037553', 'Manufacturer': 'Ideastream Consumer Products, LLC'}\nPlenty of room and does not weigh alot empty.\nplenty of room\nLashtoniic Eyelash & Eyebrow Growth Serum - Grows Longer, Fuller, Thicker Lashes & Brows in 30 Days - 100% Natural Lash Enhancer Conditioner Treatment, No Irritation\nQBEXJ\n{'Brand': 'QBEXJ', 'Skin Type': 'All', 'Package Type': 'Box', 'Specialty': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 0.59 x 0.59 inches; 0.63 Ounces', 'UPC': '734010214415'}\nIt seems to work.  I have been using this for about 3 weeks and notice longer lashes and thicker eyebrows.  I use it twice a day.  UPDATE:  I am on my second tube and I hope they do not stop making this stuff.  I have tried other serums but they burned my eyes.  This ones does not burn unless I actually drop it into my eye.  It has improved the length and health of my lashes and I seem to have more lashes when I curl them.  I am happy with this product and do not feel the need to purchase anything more expensive or that might work faster.\nNotice a difference after about 3 weeks.\nEyebrow Makeup Gel, Eyebrow Tint Gel, Eyebrow Dye Cream, 2Pcs Natural Color Eyebrow Gel, Waterproof Long Lasting Eyebrow Dye Gel for Eyebrow Makeup\nCidBestOfficial\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.84 x 2.32 x 0.75 inches; 1.62 Ounces'}\nWorks really well on my greying brows.  Would rather purchase in singles, but this is not bad.  The dark is really dark.  Lots of pigment.  I would repurchase\nCovers grey brow hairs\nFrcolor Wig Grip Wig Comfort Scarf Head Hair Band Adjustable Fastern (Beige)\nFRCOLOR\n{'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Velvet', 'Number of Items': '1', 'Item Weight': '0.04 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '21.3 x 2.01 x 0.08 inches; 0.64 Ounces', 'Item model number': 'SG_B071YW1P7X_US', 'UPC': '191579152105'}\nI wear a wig every day and do not want to be without this\nWorks really well",
  "profile": "The user showcases a discerning preference for effective and stylish beauty products, particularly in cosmetics and makeup application, with a strong emphasis on quality solutions that yield visible results. Their recent positive experience with a wig grip accessory reflects their commitment to functionality and comfort in their beauty routine. This choice indicates a lifestyle that values versatility and practicality, aligning with their ongoing investment in durable beauty solutions that enhance their overall aesthetic experience.\n\nTheir enthusiasm for products that enhance appearance while remaining user-friendly demonstrates a thoughtful approach to beauty selections, highlighting a desire for convenience alongside performance. The balanced focus on reliable and effective items reveals a tendency to prioritize tried-and-true options, steering clear of gimmicky alternatives. \n\nAdditionally, the user’s diverse interests in beauty accessories, alongside their high ratings for effective products, suggest a penchant for quality and a desire for seamless integration into an active lifestyle. This multifaceted approach to beauty care underlines the user's aim to create a cohesive beauty experience that is both stylish and functional, investing in solutions that demonstrate tangible improvements over time. Overall, the user navigates their beauty journey with intention, seeking out well-designed products that cater to their specific needs while ensuring a polished and comfortable outcome.",
  "metrics": {
    "rouge1_f": 0.19158200290275765,
    "rouge2_f": 0.008733624454148471,
    "rougeL_f": 0.09869375907111755,
    "meteor": 0.07710968636284873,
    "bleu1": 0.056363892572797995,
    "bleu2": 0.014990479171452254,
    "bleu3": 0.0026206297473935053,
    "bleu4": 0.0010969437727230784,
    "bertscore_precision": 0.329548716545105,
    "bertscore_recall": 0.4576212167739868,
    "bertscore_f1": 0.38316628336906433
  }
}