{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Short Straight Silvery Grey Wigs Heat Resistant Synthetic Natural Ombre Bob Cosplay Hair Wig for Women Shoulder Length\nReview Date: 2018/01/02\nAverage Rating: 3.5\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Special Feature': 'Heat Resistant', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 6.69 x 2.01 inches; 9.59 Ounces'}\nReview Text: Nice wig or the price, better after I added some rooting in a darker color.\nReview Title: Nice for the price\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Vaultz Locking Makeup Artist Case, Black White Stripe (VZ03755)\nVaultz\n['At Vaultz, \"If it\\'s Important to You, Lock It Up.\" The Vaultz Makeup Artist Case allows you to lock your personal and private items up in style. This durable and chic box is ideal for carrying makeup and other cosmetics on the go. The reliable key lock provides security, and the sturdy construction features steel corners, aluminum reinforcement, and a convenient handle for easy carrying. This makeup case features a built-in 14 brush holder in lid, a removable, divided, upper tray for simple access to lower compartment and 5 adjustable dividers to customize the space. This is a makeup case that you are sure to love. Black White Stripe.']\n{'Product Dimensions': '9.75 x 9.13 x 15.38 inches; 2.8 Pounds', 'Item model number': 'VZ03755', 'UPC': '826030037553', 'Manufacturer': 'Ideastream Consumer Products, LLC'}\nPlenty of room and does not weigh alot empty.\nplenty of room\nLashtoniic Eyelash & Eyebrow Growth Serum - Grows Longer, Fuller, Thicker Lashes & Brows in 30 Days - 100% Natural Lash Enhancer Conditioner Treatment, No Irritation\nQBEXJ\n{'Brand': 'QBEXJ', 'Skin Type': 'All', 'Package Type': 'Box', 'Specialty': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.41 x 0.59 x 0.59 inches; 0.63 Ounces', 'UPC': '734010214415'}\nIt seems to work.  I have been using this for about 3 weeks and notice longer lashes and thicker eyebrows.  I use it twice a day.  UPDATE:  I am on my second tube and I hope they do not stop making this stuff.  I have tried other serums but they burned my eyes.  This ones does not burn unless I actually drop it into my eye.  It has improved the length and health of my lashes and I seem to have more lashes when I curl them.  I am happy with this product and do not feel the need to purchase anything more expensive or that might work faster.\nNotice a difference after about 3 weeks.\nEyebrow Makeup Gel, Eyebrow Tint Gel, Eyebrow Dye Cream, 2Pcs Natural Color Eyebrow Gel, Waterproof Long Lasting Eyebrow Dye Gel for Eyebrow Makeup\nCidBestOfficial\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.84 x 2.32 x 0.75 inches; 1.62 Ounces'}\nWorks really well on my greying brows.  Would rather purchase in singles, but this is not bad.  The dark is really dark.  Lots of pigment.  I would repurchase\nCovers grey brow hairs\nFrcolor Wig Grip Wig Comfort Scarf Head Hair Band Adjustable Fastern (Beige)\nFRCOLOR\n{'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Velvet', 'Number of Items': '1', 'Item Weight': '0.04 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '21.3 x 2.01 x 0.08 inches; 0.64 Ounces', 'Item model number': 'SG_B071YW1P7X_US', 'UPC': '191579152105'}\nI wear a wig every day and do not want to be without this\nWorks really well\nDiane Bobby Pins, Black, 2\", 300 Count\nDiane\n{'Brand': 'Diane', 'Hair Type': 'All', 'Color': 'Black', 'Age Range (Description)': 'Adult', 'Material': 'Rubber', 'Package Dimensions': '4.45 x 4.41 x 1.65 inches; 7.05 Ounces', 'Item model number': 'D452', 'UPC': '824703004529'}\nThey are bobby pins....what can I say.  I use the. Every day to pin my hair up under a wig.\nThey are bobby pins\nShort Straight Silvery Grey Wigs Heat Resistant Synthetic Natural Ombre Bob Cosplay Hair Wig for Women Shoulder Length\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Special Feature': 'Heat Resistant', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 6.69 x 2.01 inches; 9.59 Ounces'}\nNice wig or the price, better after I added some rooting in a darker color.\nNice for the price",
  "profile": "The user continues to prioritize high-quality beauty products, particularly in cosmetics and makeup application, while showcasing a growing interest in versatile hair accessories and wigs. Their recent purchase of a synthetic wig, while rated moderately, indicates their willingness to explore options that enhance their aesthetic without compromising on practicality. The user's thoughtful approach is evident, as they actively seek products that are not only functional but also stylish, reflecting an intention to cultivate a cohesive beauty experience.\n\nTheir focus remains on reliable solutions that seamlessly integrate into an active lifestyle, further supported by their enthusiasm for high-performing beauty accessories. The user’s feedback on the wig highlights a desire for customization, as they appreciate the value in enhancing products to meet specific needs.\n\nOverall, this multifaceted approach underscores their commitment to selecting well-designed beauty solutions that balance style with functionality. As they navigate their beauty journey, the user remains dedicated to cultivating an efficient and polished aesthetic, continually investing in versatile and durable products that align with their preferences for convenience and quality.",
  "metrics": {
    "rouge1_f": 0.17215189873417722,
    "rouge2_f": 0.0025380710659898475,
    "rougeL_f": 0.08354430379746836,
    "meteor": 0.060225016545334215,
    "bleu1": 0.014634609543958104,
    "bleu2": 0.0029950464284861397,
    "bleu3": 0.0005690187375712424,
    "bleu4": 0.0002483464828023206,
    "bertscore_precision": 0.30761343240737915,
    "bertscore_recall": 0.4735860824584961,
    "bertscore_f1": 0.3729685842990875
  }
}