{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Unny Club Black Square Lipstick (Libidream) | matte lipstick\nReview Date: 2020/09/07\nStore: UNNY CLUB\nAverage Rating: 4.2\nProduct Details: {'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Product Dimensions': '3.94 x 188.98 x 35.43 inches; 1.13 Ounces'}\nReview Text: I like the color or this, but that’s pretty much it. It didn’t come out matte and the color came out way brighter than expected since it was on the darker side (I chose M02). Like most lipsticks, I expected it to transfer and it did, a lot. It practically came all the way off after minor eating. Maybe the color and matte would actually come out on a lighter or fair-skinned person.\nReview Title: Eh.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "5 Pack Travel Paper Soaps, Hand Washing Soap Paper Sheets, Portable And Replaceable Pocket Hand Soap For Travel, Outdoor, Camping Hiking, 1.2m/47inch Length Each, 5 Color/Scents\nVEAFX\n{'Item Form': 'Bar', 'Skin Type': 'All', 'Brand': 'VEAFX', 'Scent': 'Lavender, Tea Tree, Rose, Lemon, Lily', 'Material Feature': 'Biodegradable Warning', 'Package Dimensions': '4.8 x 3.7 x 0.6 inches; 1.59 Ounces', 'UPC': '782912939165'}\nThey’re pocket sized and fit in my palm. So convenient for those public restroom trips that have run out of soap, just pop this out and you’re good to go. Be careful with taking it out though, I thought it came out in sheets but it’s more like foil paper where you cut the size you want. A small sheet should be good enough. It also has a subtle scent to it but it smells good. This is a must have product.\nSo convenient\n8inch Short Afro Puff Synthetic Hair Bun Chignon Hairpiece For Women Drawstring Ponytail Kinky Curly Updo Clip Hair Extensions(1BT-30#)\nBURHAIR\n{'Material': 'synthetic', 'Hair Type': 'Curly, Coily', 'Brand': 'BURHAIR', 'Age Range (Description)': 'Adult', 'UPC': '782947259672'}\nI don’t know if it’s because of the way it was sewn, but no matter what I do, I can’t get this to look right. The base of it always sticks out straight no matter how I situate it. Maybe it’s just me? I gave 3 stars because the hair is soft and the color is ok. I wish there was more black in it though instead of just color.\nNot a fan.\nRAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nRAREKIND\n{'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nI like how the matte of this (I got maple road) came out on me. I only put a single layer and the color came out great. The color became darker once a couple minutes passed. There is easy transference of this and you’ll definitely need a touch up after eating and drinking. Liked the way it smoothed on and how I barely felt it on.\nLovely color\nUnny Club Black Square Lipstick (Libidream) | matte lipstick\nUNNY CLUB\n{'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Product Dimensions': '3.94 x 188.98 x 35.43 inches; 1.13 Ounces'}\nI like the color or this, but that’s pretty much it. It didn’t come out matte and the color came out way brighter than expected since it was on the darker side (I chose M02). Like most lipsticks, I expected it to transfer and it did, a lot. It practically came all the way off after minor eating. Maybe the color and matte would actually come out on a lighter or fair-skinned person.\nEh.",
  "profile": "The user profile highlights a practical and eco-conscious individual valuing convenience and functionality, especially in portable products suitable for outdoor and travel scenarios. Their focus remains on effectiveness and reliability, with a preference for quality performance that meets essential needs seamlessly. \n\nPleasant, subtle fragrances enhance their overall experience, aligning with their appreciation for sensory enjoyment that isn't overwhelming. Their commitment to sustainability is evident in their consideration of biodegradable materials, complementing their conscientious consumer behavior.\n\nRecent interactions demonstrate a discerning attitude towards product quality. While they have expressed dissatisfaction with certain cosmetics that failed to meet their aesthetic and functional expectations, they have also reported positive experiences with products yielding pleasing color outcomes and comfort, despite needing frequent touch-ups. This balance underscores their high standards for visual appeal and functionality.\n\nThe latest interaction reveals a mixed experience with a new cosmetic product, where the user appreciated the color but found the matte finish lacking and the color brightness unexpectedly intense. Their feedback suggests that skin tone influences their product performance expectations, indicating a thoughtful approach to selecting items that align with their preferences.\n\nOverall, the user continues to seek products that reflect their values of convenience, effectiveness, sensory enjoyment, and eco-consciousness, coupled with a keen eye for quality that significantly affects their overall satisfaction.",
  "metrics": {
    "rouge1_f": 0.20084865629420082,
    "rouge2_f": 0.011347517730496455,
    "rougeL_f": 0.09900990099009901,
    "meteor": 0.09049612984286823,
    "bleu1": 0.06183553252363789,
    "bleu2": 0.017644458821709574,
    "bleu3": 0.006401634509015517,
    "bleu4": 0.0021706571207050804,
    "bertscore_precision": 0.3371533751487732,
    "bertscore_recall": 0.4123607873916626,
    "bertscore_f1": 0.37098386883735657
  }
}