{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nReview Date: 2021/07/28\nStore: COSYMAY\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nReview Text: Lightweight, most likely due to the relatively thin nature, and soft feeling. The bangs are a little too long for me though, they practically covered my eyes. But other than that, it’s a pretty nice wig.\nReview Title: Soft\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "5 Pack Travel Paper Soaps, Hand Washing Soap Paper Sheets, Portable And Replaceable Pocket Hand Soap For Travel, Outdoor, Camping Hiking, 1.2m/47inch Length Each, 5 Color/Scents\nVEAFX\n{'Item Form': 'Bar', 'Skin Type': 'All', 'Brand': 'VEAFX', 'Scent': 'Lavender, Tea Tree, Rose, Lemon, Lily', 'Material Feature': 'Biodegradable Warning', 'Package Dimensions': '4.8 x 3.7 x 0.6 inches; 1.59 Ounces', 'UPC': '782912939165'}\nThey’re pocket sized and fit in my palm. So convenient for those public restroom trips that have run out of soap, just pop this out and you’re good to go. Be careful with taking it out though, I thought it came out in sheets but it’s more like foil paper where you cut the size you want. A small sheet should be good enough. It also has a subtle scent to it but it smells good. This is a must have product.\nSo convenient\n8inch Short Afro Puff Synthetic Hair Bun Chignon Hairpiece For Women Drawstring Ponytail Kinky Curly Updo Clip Hair Extensions(1BT-30#)\nBURHAIR\n{'Material': 'synthetic', 'Hair Type': 'Curly, Coily', 'Brand': 'BURHAIR', 'Age Range (Description)': 'Adult', 'UPC': '782947259672'}\nI don’t know if it’s because of the way it was sewn, but no matter what I do, I can’t get this to look right. The base of it always sticks out straight no matter how I situate it. Maybe it’s just me? I gave 3 stars because the hair is soft and the color is ok. I wish there was more black in it though instead of just color.\nNot a fan.\nRAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nRAREKIND\n{'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nI like how the matte of this (I got maple road) came out on me. I only put a single layer and the color came out great. The color became darker once a couple minutes passed. There is easy transference of this and you’ll definitely need a touch up after eating and drinking. Liked the way it smoothed on and how I barely felt it on.\nLovely color\nUnny Club Black Square Lipstick (Libidream) | matte lipstick\nUNNY CLUB\n{'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Product Dimensions': '3.94 x 188.98 x 35.43 inches; 1.13 Ounces'}\nI like the color or this, but that’s pretty much it. It didn’t come out matte and the color came out way brighter than expected since it was on the darker side (I chose M02). Like most lipsticks, I expected it to transfer and it did, a lot. It practically came all the way off after minor eating. Maybe the color and matte would actually come out on a lighter or fair-skinned person.\nEh.\nNATWAG Reusable Update Makeup Remover Cloths for Sensitive Skin - Microfiber Face Cloth Makeup Remover | Washable Round Makeup Remover Pads | Natural Facial Towels (2 Pads,2 Cloth) (Purple)\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'Sensitive,All Skin Types', 'Material Feature': 'Reusable', 'Unit Count': '4.00 Count', 'Number of Items': '2', 'Package Dimensions': '12.75 x 9.88 x 0.59 inches; 2.08 Ounces', 'UPC': '745103569978'}\nThis thing is amazing and the material so soft against my skin. It was able to get off my super stay lipstick that I usually need lipstick remover for. I use the small ones for my lips and eyes and the big one (it’s actually a really big cloth) I use for my face.\nSo soft\nGel Nail Polish Set - TOEDO Fall Winter Nail Gel 6 Colors Tan Brown Colors Soak Off LED Nail Lamp Gel Polish Kit for Home DIY Manicure Nail Designs\nTOEDO\n{'Brand': 'TOEDO', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Matte,Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '1.56 FL Oz', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.1 x 3.31 x 3.23 inches; 9.14 Ounces'}\nThe fall colors are nice. It days you just need 60 secs but when I did that the first time, they immediately peeled off on their own. So now I use 2 min for every coat and at least 5 min for the top coat and then they don’t peel. It’s a nice set just wish the colors would show on the outside of the bottle but it’s fine.\nNice set\nCOSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nCOSYMAY\n{'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nLightweight, most likely due to the relatively thin nature, and soft feeling. The bangs are a little too long for me though, they practically covered my eyes. But other than that, it’s a pretty nice wig.\nSoft",
  "profile": "The user profile reflects a practical, eco-conscious individual seeking convenience and functionality in portable products, particularly for outdoor and travel scenarios. Their commitment to quality performance and reliability drives them toward essential products, while their appreciation for subtle fragrances enhances their sensory experience without being overwhelming. Their dedication to sustainability is evident in their choice of biodegradable materials.\n\nRecent interactions showcase a discerning attitude towards product quality, revealing satisfaction and dissatisfaction with cosmetics based on color outcomes and comfort. The user prefers balanced finishes that complement their skin tone, emphasizing their ongoing pursuit of quality and effectiveness. They have positively received reusable makeup remover cloths, noting their exceptional softness and effectiveness, aligning with their values.\n\nThe latest interaction highlights the user's interest in self-care and at-home beauty solutions. They found a wig lightweight and soft but noted issues with the length of the bangs, demonstrating their critical eye for detail and performance. This experience further underlines their preference for practical, sustainable choices that enhance daily routines. Overall, the user prioritizes products embodying convenience, effectiveness, sensory enjoyment, and eco-consciousness, maintaining high standards for quality that directly impact their overall satisfaction.",
  "metrics": {
    "rouge1_f": 0.15221579961464354,
    "rouge2_f": 0.013513513513513513,
    "rougeL_f": 0.07707129094412331,
    "meteor": 0.05436951316839585,
    "bleu1": 0.006080154742508281,
    "bleu2": 0.0016902854037750225,
    "bleu3": 0.00028223184067075916,
    "bleu4": 0.00011546286860109456,
    "bertscore_precision": 0.3250846862792969,
    "bertscore_recall": 0.4397743344306946,
    "bertscore_f1": 0.37383073568344116
  }
}