{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Scarecrow & Mrs. King: Season 4\nReview Date: 2013/01/24\nStore: Kate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nReview Text: I'm so glad that one of my all-time favorite shows is now complete in my DVD library. Scarecrow and Mrs. King was one of the most fun shows I've ever seen and I'm looking forward to reliving Season 4 with Lee and Amanda. The characters were awesome and there just isn't too much on TV anymore quite like this classic show. And yes, I can still Amanda-ramble with the best of them!\nReview Title: A long time in coming but now I have the whole series!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Diagnosis Murder - Season 4\nFormat: DVD\nMovies & TV, First to Know, Television\n{'Media Format': 'NTSC', 'Studio': 'Paramount'}\nI agree with the other person whose review is going on a year old! Please Amazon, if you have any clout with Paramount TV, get them to release the rest of the Diagnosis Murder series. I couldn't find how to sign up to be notified of any new DM DVDs so I thought I'd just write this review in the hopes that someone at Amazon will see it and realize we DM fans just want the rest of our show on DVD. Pretty much everything else I like is already making good progress on DVDs such as House, Bones, and some of the newer ones. Please light a fire under the powers that be so that the rest of DM can be released soon! Season 4 is awesome, I remember from watching it first time around and from my tapes that I have to rely on if I want anything past season 3.\nDiagnosis Starved Here!\nThe Hardy Boys: Season 3\nShaun Cassidy  (Actor),     Parker Stevenson  (Actor),     Joseph Pevney  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', 'Follow the clues to adventure as the Hardy Boys: The Final Season comes to DVD for the first time! Inspired by the hugely popular books teen sensations Shaun Cassidy and Parker Stevenson star as brave super-sleuths who continue to solve spooky mysteries.', 'Amazon.com', \"When the first of many Hardy Boys books was published in 1927, nobody could have imagined this version of the amateur crime-fighting duo: feathered hair, bell-bottoms, the action set to a disco beat. But that's what you get in\", 'The Hardy Boys: Season Three', ', a vintage \\'70s experience. (The show had begun with the Hardys rotating with episodes featuring Nancy Drew, but she was quietly erased for this final season.) Shaun Cassidy and Parker Stevenson play Joe and Frank Hardy, whose adventures in crime fighting take a new twist when they\\'re recruited to join their dad as US secret agents. There\\'s a lot of globetrotting involved, although stock-footage establishing shots of London, Greece, Hawaii, etc., take the place of actual location shooting. The two-part opening episode sees Joe go after the killers of his fiancée, a trauma that is mostly forgotten by episode three. The stories are serviceable, but frankly the season is most notable for its cascade of incredible \\'70s style and its wild gimmicks: government-trained killer sharks at a secret California beach? Bring it on! Stevenson and Cassidy (who enjoyed/endured a phase of teenybopper stardom at this time) boast the kind of hair that belongs in a Smithsonian exhibit on what was notable about the 1970s, and if you remember the soft-rock band Bread, be advised that group leader David Gates and the band are featured in another two-part episode that features lots of Bread songs and also Cold War defection espionage (\"Bread isn\\'t the only thing on the menu tonight,\" Stevenson notes at a suspense-filled concert). The season lasted only 10 episodes, and given the shoddy production values and the mostly subpar writing, that is no surprise. Future blockbuster screenwriter Steven E. de Souza worked on the series, and the guest cast is the usual collection of \\'70s regulars: Nehemiah Persoff, Edd \"Kookie\" Byrnes, June Lockhart, Dana Andrews, Dane Clark, etc. Don\\'t go for quality, but if you have a weakness for Smiley Face camp, this does the job.', '--Robert Horton']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Contributor': 'Parker Stevenson, Joseph Pevney, Shaun Cassidy', 'Language': 'English', 'Number Of Discs': '3', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Joseph Pevney', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Run time': '8 hours and 30 minutes', 'Release date': 'February 12, 2013', 'Actors': 'Shaun Cassidy, Parker Stevenson', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '3'}\nAlthough the 3rd season may not be everyone's favorite season since it means that the series was drawing to a close, I was still happy to see it finally released on DVD.\nLong awaited 3rd season\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Barrett', 'Ralph Hemecker', 'Robert Harmon', 'Alex Zakrzewski', 'John Behring', 'Alex Chapple', 'Jackeline Tejada', 'Eric Laneuville', 'Michael Pressman', 'Douglas Aarniokoski'], 'Studio': ['CBS']}\nCBS can definitely keep this show coming. It's one of the best new shows they've had in a long time which is evident by their current high ratings, highest for a show on Friday nights in quite sometime from what I read. Tom Selleck is awesome as Frank and everyone else is great too, just like a family. The family dinner is always my favorite scene. I will continue to buy these seasons as they come out. Long live Blue Bloods!\nBlue Bloods is one of the best newer shows out there, high ratings too!\nDallas: Season 1\nLarry Hagman  (Actor),     Josh Henderson  (Actor),     Michael M. Robin  (Director),     Steve Robin  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Dallas (2012): The Complete First Season (DVD)', 'The Ewing family is back in the all-new Dallas — based upon one of the most popular television dramas ever. Secrets, schemes and betrayals abound within the Texas oil dynasty as the iconic elder Ewings — original series stars Larry Hagman, Patrick Duffy and Linda Gray — are joined by the next generation, who give lies and ambition new meaning. In the new series, John Ross (Josh Henderson), JR and Sue Ellen Ewing’s son, is determined to drill for oil on Ewing land. Christopher (Jesse Metcalfe), Bobby’s adopted son, hopes to take the family business away from oil and toward alternative energy sources, with his fiancée (Julie Gonzalo). Complicating matters is the presence of Elena Ramos (Jordana Brewster), John Ross’s girlfriend and Christopher’s ex-fiancée. With an increasingly volatile feud brewing, the stage is set for JR to return to his nefarious ways and rekindle his own long-standing rivalry with younger brother, Bobby.', ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Josh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda GrayJosh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda Gray  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '26229142', 'Director': 'Michael M. Robin, Steve Robin', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Run time': '7 hours and 20 minutes', 'Release date': 'January 8, 2013', 'Actors': 'Larry Hagman, Josh Henderson, Jesse Metcalf, Jordana Brewster, Julie Gonzalo', 'Subtitles': 'Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '3'}\nI absolutely LOVED the first season of the new Dallas and as of this review, the 2nd season is coming up next week. The only sad thing is that Larry Hagman will only be a part of about 6 episodes of season 2--at least I now have Season 1 and all the deliciously typical J.R Ewing scenes that went with it. I think a Dallas DVD marathon is in order at my house just to get ready for the Season 2 premiere. Thanks again TNT for releasing this and to Amazon for the nice affordable price! I have Prime but I think this came even quicker than usual.\nAwesome and kudos to TNT for releasing this!\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nI'm so glad that one of my all-time favorite shows is now complete in my DVD library. Scarecrow and Mrs. King was one of the most fun shows I've ever seen and I'm looking forward to reliving Season 4 with Lee and Amanda. The characters were awesome and there just isn't too much on TV anymore quite like this classic show. And yes, I can still Amanda-ramble with the best of them!\nA long time in coming but now I have the whole series!",
  "profile": "**User Summary:**\n\n- **Media Preference:** The user maintains a strong affinity for classic television series, particularly in the crime and mystery genres. They continue to express enthusiasm for both older and newer series, particularly those with strong ratings and nostalgic elements. Recent interactions highlight a specific passion for completing collections of classic shows.\n  \n- **Format Preference:** The user remains a proponent of physical media, with a clear preference for DVDs, emphasizing the importance of preserving media history through tangible formats.\n\n- **Engagement Level:** Actively engaged, the user provides detailed product reviews reflecting their satisfaction with purchases. They engage with retailers about desired titles, emphasizing their commitment to quality television experiences.\n\n- **Community Involvement:** The user is involved in discussions about classic and contemporary series, indicating a desire to connect with other fans and influence media releases.\n\n- **Nostalgia Factor:** They appreciate content that evokes personal memories, cherishing shows from earlier decades while also welcoming newer offerings that resonate with audiences.\n\n- **Request for Action:** Proactively advocates for more releases of beloved series, showing dedication to fan interests.\n\n- **Review Engagement:** The latest review indicates joy in revisiting favorite classic series, highlighting a connection with characters and a desire to share those experiences through future viewing marathons, reaffirming their nostalgic connection to media. \n\nOverall, the user exemplifies a passionate commitment to television that spans across decades.",
  "metrics": {
    "rouge1_f": 0.10710987996306556,
    "rouge2_f": 0.005545286506469501,
    "rougeL_f": 0.05355493998153278,
    "meteor": 0.03397054479469975,
    "bleu1": 0.00013660460025845204,
    "bleu2": 3.518624550898733e-05,
    "bleu3": 5.201765326393362e-06,
    "bleu4": 2.0017966684822936e-06,
    "bertscore_precision": 0.35193610191345215,
    "bertscore_recall": 0.48673292994499207,
    "bertscore_f1": 0.4085017442703247
  }
}