{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Blue Bloods: Season 3\nReview Date: 2014/08/04\nStore: Donnie Wahlberg  (Actor),     Bridget Moynahan  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['BLUE BLOODS is a drama about a multi-generational family of cops dedicated to New York City law enforcement.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Len Cariou, Will Estes, Jennifer Esposito, Amy Carlson, Tom Selleck, Bridget Moynahan, Donnie Wahlberg, Sami GayleLen Cariou, Will Estes, Jennifer Esposito, Amy Carlson, Tom Selleck, Bridget Moynahan, Donnie Wahlberg, Sami Gayle  See more', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.5 x 7.6 inches; 6.14 Ounces', 'Item model number': '26921771', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 13 minutes', 'Release date': 'July 19, 2016', 'Actors': 'Donnie Wahlberg, Bridget Moynahan, Will Estes, Len Cariou, Tom Selleck', 'Subtitles': 'English', 'Studio': 'Paramount', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: Love love love this show! The cast is excellent, the storylines are always awesome and compelling. I've been getting the DVDs as the seasons end so now I need season 4. And to think I wasn't all that crazy about this series when it first started. I started watching because of Tom Selleck but really, now I'm in awe of the entire cast!\nReview Title: Gotta love this great show!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Diagnosis Murder - Season 4\nFormat: DVD\nMovies & TV, First to Know, Television\n{'Media Format': 'NTSC', 'Studio': 'Paramount'}\nI agree with the other person whose review is going on a year old! Please Amazon, if you have any clout with Paramount TV, get them to release the rest of the Diagnosis Murder series. I couldn't find how to sign up to be notified of any new DM DVDs so I thought I'd just write this review in the hopes that someone at Amazon will see it and realize we DM fans just want the rest of our show on DVD. Pretty much everything else I like is already making good progress on DVDs such as House, Bones, and some of the newer ones. Please light a fire under the powers that be so that the rest of DM can be released soon! Season 4 is awesome, I remember from watching it first time around and from my tapes that I have to rely on if I want anything past season 3.\nDiagnosis Starved Here!\nThe Hardy Boys: Season 3\nShaun Cassidy  (Actor),     Parker Stevenson  (Actor),     Joseph Pevney  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', 'Follow the clues to adventure as the Hardy Boys: The Final Season comes to DVD for the first time! Inspired by the hugely popular books teen sensations Shaun Cassidy and Parker Stevenson star as brave super-sleuths who continue to solve spooky mysteries.', 'Amazon.com', \"When the first of many Hardy Boys books was published in 1927, nobody could have imagined this version of the amateur crime-fighting duo: feathered hair, bell-bottoms, the action set to a disco beat. But that's what you get in\", 'The Hardy Boys: Season Three', ', a vintage \\'70s experience. (The show had begun with the Hardys rotating with episodes featuring Nancy Drew, but she was quietly erased for this final season.) Shaun Cassidy and Parker Stevenson play Joe and Frank Hardy, whose adventures in crime fighting take a new twist when they\\'re recruited to join their dad as US secret agents. There\\'s a lot of globetrotting involved, although stock-footage establishing shots of London, Greece, Hawaii, etc., take the place of actual location shooting. The two-part opening episode sees Joe go after the killers of his fiancée, a trauma that is mostly forgotten by episode three. The stories are serviceable, but frankly the season is most notable for its cascade of incredible \\'70s style and its wild gimmicks: government-trained killer sharks at a secret California beach? Bring it on! Stevenson and Cassidy (who enjoyed/endured a phase of teenybopper stardom at this time) boast the kind of hair that belongs in a Smithsonian exhibit on what was notable about the 1970s, and if you remember the soft-rock band Bread, be advised that group leader David Gates and the band are featured in another two-part episode that features lots of Bread songs and also Cold War defection espionage (\"Bread isn\\'t the only thing on the menu tonight,\" Stevenson notes at a suspense-filled concert). The season lasted only 10 episodes, and given the shoddy production values and the mostly subpar writing, that is no surprise. Future blockbuster screenwriter Steven E. de Souza worked on the series, and the guest cast is the usual collection of \\'70s regulars: Nehemiah Persoff, Edd \"Kookie\" Byrnes, June Lockhart, Dana Andrews, Dane Clark, etc. Don\\'t go for quality, but if you have a weakness for Smiley Face camp, this does the job.', '--Robert Horton']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Contributor': 'Parker Stevenson, Joseph Pevney, Shaun Cassidy', 'Language': 'English', 'Number Of Discs': '3', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Joseph Pevney', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Run time': '8 hours and 30 minutes', 'Release date': 'February 12, 2013', 'Actors': 'Shaun Cassidy, Parker Stevenson', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '3'}\nAlthough the 3rd season may not be everyone's favorite season since it means that the series was drawing to a close, I was still happy to see it finally released on DVD.\nLong awaited 3rd season\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Barrett', 'Ralph Hemecker', 'Robert Harmon', 'Alex Zakrzewski', 'John Behring', 'Alex Chapple', 'Jackeline Tejada', 'Eric Laneuville', 'Michael Pressman', 'Douglas Aarniokoski'], 'Studio': ['CBS']}\nCBS can definitely keep this show coming. It's one of the best new shows they've had in a long time which is evident by their current high ratings, highest for a show on Friday nights in quite sometime from what I read. Tom Selleck is awesome as Frank and everyone else is great too, just like a family. The family dinner is always my favorite scene. I will continue to buy these seasons as they come out. Long live Blue Bloods!\nBlue Bloods is one of the best newer shows out there, high ratings too!\nDallas: Season 1\nLarry Hagman  (Actor),     Josh Henderson  (Actor),     Michael M. Robin  (Director),     Steve Robin  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Dallas (2012): The Complete First Season (DVD)', 'The Ewing family is back in the all-new Dallas — based upon one of the most popular television dramas ever. Secrets, schemes and betrayals abound within the Texas oil dynasty as the iconic elder Ewings — original series stars Larry Hagman, Patrick Duffy and Linda Gray — are joined by the next generation, who give lies and ambition new meaning. In the new series, John Ross (Josh Henderson), JR and Sue Ellen Ewing’s son, is determined to drill for oil on Ewing land. Christopher (Jesse Metcalfe), Bobby’s adopted son, hopes to take the family business away from oil and toward alternative energy sources, with his fiancée (Julie Gonzalo). Complicating matters is the presence of Elena Ramos (Jordana Brewster), John Ross’s girlfriend and Christopher’s ex-fiancée. With an increasingly volatile feud brewing, the stage is set for JR to return to his nefarious ways and rekindle his own long-standing rivalry with younger brother, Bobby.', ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Josh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda GrayJosh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda Gray  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '26229142', 'Director': 'Michael M. Robin, Steve Robin', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Run time': '7 hours and 20 minutes', 'Release date': 'January 8, 2013', 'Actors': 'Larry Hagman, Josh Henderson, Jesse Metcalf, Jordana Brewster, Julie Gonzalo', 'Subtitles': 'Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '3'}\nI absolutely LOVED the first season of the new Dallas and as of this review, the 2nd season is coming up next week. The only sad thing is that Larry Hagman will only be a part of about 6 episodes of season 2--at least I now have Season 1 and all the deliciously typical J.R Ewing scenes that went with it. I think a Dallas DVD marathon is in order at my house just to get ready for the Season 2 premiere. Thanks again TNT for releasing this and to Amazon for the nice affordable price! I have Prime but I think this came even quicker than usual.\nAwesome and kudos to TNT for releasing this!\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nI'm so glad that one of my all-time favorite shows is now complete in my DVD library. Scarecrow and Mrs. King was one of the most fun shows I've ever seen and I'm looking forward to reliving Season 4 with Lee and Amanda. The characters were awesome and there just isn't too much on TV anymore quite like this classic show. And yes, I can still Amanda-ramble with the best of them!\nA long time in coming but now I have the whole series!\nWalker, Texas Ranger: The Complete Series\nNorris, Chuck  (Actor),     Gilyard, Clarence  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Action superstar Chuck Norris battles bad guys, lowlifes, and evil criminal masterminds in all eight thrill-packed, butt-kicking seasons of Walker, Texas Ranger! A modern-day peace officer with a Wild West sense of resolve, Ranger Cordell Walker (Norris) is ably assisted by fellow Ranger James Trivette (Clarence Gilyard), Assistant District Attorney Alexandra Cahill (Sheree J. Wilson), and retired ex-partner CD Parker (Noble Willingham). This tough-minded team attempts to maintain law and order in a tumultuous world. But when the going gets tough...the tough guys get their lights punched out! From drug lords and rogue assassins to escaped cons and troubled teens, join Walker, Texas Ranger for 198 episodes of pulse-pounding, fist-flying action as Walker settles the score with his own personal brand of frontier justice!']\n{'Format': 'Box set, Color, Full Screen, NTSC, Multiple Formats', 'Contributor': 'Willingham, Noble, Gilyard, Clarence, Norris, Chuck', 'Language': 'Unqualified', 'Number Of Discs': '51', 'Publication Date': 'March 9, 2010', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 6.1 Pounds', 'Media Format': 'Box set, Color, Full Screen, NTSC, Multiple Formats', 'Release date': 'March 9, 2010', 'Actors': 'Norris, Chuck, Gilyard, Clarence, Willingham, Noble', 'Studio': 'Paramount', 'Number of discs': '51'}\nI was happy to add this set to my DVD collection. Chuck Norris in Walker Texas Ranger was one of my family's favorite shows when it was first on TV. My dad and I loved watching it in re-runs through the years and now that he's no longer with us, I still feel like he's there whenever I watch Walker kicking some butt. I find myself saying the same stuff Dad used to when the fight scene is going on, &#34;Get him! Kick him! C'mon Walker, don't let him hit you!&#34; You get the idea. Happily the fact that Dad watched this show got my daughter interested in it. She loved watching it at college and now we can enjoy it together. I love Amazon's Gold Box specials!\nSo glad this series was available as the full set\nNCIS: Season 10\nValerie Cruz  (Actor),     Colin Hanks  (Actor),     Tony Wharmby  (Director),     Dennis Smith  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n[\"NCIS (Naval Criminal Investigative Service) is more than just an action drama. With liberal doses of humor, it's a show that focuses on the sometimes complex and always amusing dynamics of a team of special agents forced to work together in high-stress situations. From murder and espionage to terrorism and stolen submarines, these special agents travel the globe to investigate all crimes with Navy or Marine Corps ties.\"]\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Box set, Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen', 'Contributor': \"Matt Craven, Mark Harmon, David Bellisario, Greg Germann, Pauley Perrette, Mark Rolston, Tony Wharmby, Cote de Pablo, Arvin Brown, Richard Schiff, Leslie Libman, Alex Kingston, Kelli Barrett, René Auberjonois, Billy Dee Williams, Robert Wagner, Brian Dietzen, Avery C. Drewe, Diane Neal, Michael Weatherly, Brad Beyer, Sean Murray, Mario Van Peebles, Steve Valentine, Rocky Carroll, David McCallum, Dennis Smith, Oded Fehr, Rick Worthy, Tom Wright, Valerie Cruz, Jeffrey Vlaming, Mark Schilz, Ralph Waite, Colin Hanks, James Whitmore, Jr., Terence O'Hara, Jamey Sheridan, Michael NouriMatt Craven, Mark Harmon, David Bellisario, Greg Germann, Pauley Perrette, Mark Rolston, Tony Wharmby, Cote de Pablo, Arvin Brown, Richard Schiff, Leslie Libman, Alex Kingston, Kelli Barrett, René Auberjonois, Billy Dee Williams, Robert Wagner, Brian Dietzen, Avery C. Drew…   See more\", 'Language': 'English', 'Runtime': '17 hours and 8 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.24 Ounces', 'Item model number': '504980985', 'Director': 'Michael Weatherly, Tony Wharmby, Dennis Smith, James Whitmore, Jr., Tom Wright', 'Media Format': 'Box set, Color, Dolby, Multiple Formats, NTSC, Subtitled, Widescreen', 'Run time': '17 hours and 8 minutes', 'Release date': 'August 20, 2013', 'Actors': 'Valerie Cruz, Colin Hanks, Oded Fehr, Jamey Sheridan, Robert Wagner', 'Subtitles': 'Portuguese, Spanish, English', 'Producers': 'Jeffrey Vlaming, David Bellisario, Avery C. Drewe, Mark Schilz', 'Studio': 'Paramount', 'Number of discs': '6'}\nThis 10th season of NCIS is one of the best yet, imho. Other shows have fizzled out of their 10th season but we already have an 11th season promised and they are going stronger than ever. I love how the relationships and back stories of the characters have developed, with more one on one with some of them (ie Jimmy and Ducky as in a recent episode and the episode of how Abby became interested in forensics) I cannot wait for this to come out on DVD. I hope they give us LOTS of DVD extras as a 10th season celebration! Here's to the 11th....and beyond!\nSo many other shows just wind down in their 10th seasons, but NCIS is as hot as ever!\nYours, Mine & Ours\nComedy, Romance, Cheerful, Feel-good\n[\"When Frank Beardsley (Dennis Quaid), a widower of 8 children runs into his high school sweetheart, Helen North (Rene Russo), it's as if thirty years never passed!\"]\n{'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Raja Gosnell'], 'Producers': ['Ira Shuman', 'Robert Simonds', 'Richard Suckle', 'Tracey Trench', 'Kim Zubick'], 'Starring': ['Dennis Quaid', 'Rene Russo', 'Sean Faris']}\nI absolutely love this movie! Sure, it's kinda unrealistic but it's a feel-good, happy mood movie. I saw the old version a long time ago and love how this one was updated for this century but still kept the same names of the main characters and basic storyline. Very good purchase and totally worth it!\nAwesome retelling of a classic!\nDallas: Season 6\nLarry Hagman  (Actor),     Victoria Principal  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'Dallas: The Complete Sixth Season (DVD)', 'Power, wealth, sex ... and glorious extravagance. They all find a home in the sprawling saga of the Ewing clan in Dallas. Revel in the saga that held the world in thrall for more than a decade: Led by the man everyone loves to hate, J.R. Ewing (Larry Hagman), there is no limit to what members of this family will do in the pursuit of power, wealth and revenge in a feud that started 40 years ago over an empire in oil and the love of a woman.', ']]>', 'Amazon.com', 'Dallas: The Complete Sixth Season', \"begins with a bang: Miss Ellie (Barbara Bel Geddes), Bobby (Patrick Ewing) and Lucy (Charlene Tilton) vote to remove J.R. Ewing (Larry Hagman) as president of Ewing oil. Big stuff, but J.R. soon lands a job running competitor Harwood Oil. Meanwhile, in this classic primetime soap, J.R. and brother Bobby find themselves on opposite ends of a titanic clash set in motion by patriarch Jock Ewing\\x92s will once the latter is declared legally dead. And now that he is officially deceased, Jock's widow, Miss Ellie, becomes interested in a social life again. This results in some discomfort for J.R., who wants his mom to be mom, despite having almost blackmailed her in the first place to release the will. Ludicrous as it all might sound,\", 'Dallas', 'is always nothing less than absorbing, and the changes and surprises that come with the territory--the ever-shifting alliances, the come-from-behind victories, the constant scheming to tear down family and friends--are fascinating.', 'In', 'Dallas: The Compete Fifth Season', \", J.R. won back his estranged wife, Sue Ellen (Linda Gray). Yet she seems to be having second thoughts about life as a Ewing, prompting J.R. to take another crack at convincing her to stay with him--while doing his bidding in unscrupulous business maneuvers, of course. Sue Ellen and sister-in-law Pamela (Victoria Principal) become unexpectedly close, and even more unexpected is Pamela's request to husband Bobby that he drop the fraternal competition with J.R. to run Ewing Oil for good. Abortions, tensions, and a chance for longtime, obsessive enemy of the Ewings Cliff Barnes (Ken Kercheval), so recently comatose, to get even with his nemesis are all on the menu. As usual, watching\", 'Dallas', 'is like witnessing a car crash and being too mesmerized to leave.', '--Tom Keogh']\n{'Genre': 'Drama', 'Format': 'Box set, Multiple Formats, Subtitled, Full Screen, Color, Closed-captioned, NTSC', 'Contributor': 'Howard Keel, Victoria Principal, Larry Hagman, Patrick Duffy, Linda Gray', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '23 hours', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '8 x 5.75 x 1 inches; 9.6 Ounces', 'Media Format': 'Box set, Multiple Formats, Subtitled, Full Screen, Color, Closed-captioned, NTSC', 'Run time': '23 hours', 'Release date': 'July 31, 2007', 'Actors': 'Larry Hagman, Victoria Principal, Patrick Duffy, Linda Gray, Howard Keel', 'Subtitles': 'Portuguese', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nThis is starting out to be a great season, as with all the Dallas seasons. Season 5 didn't have quite the cliffhanger we'd grown used to in the previous seasons but it was enough to want to buy Season 6. Now we just have to pace ourselves so we don't have to buy Season 7 right away--it's typically one of the pricier seasons. Love JR, Bobby and all the Ewing clan! Dallas will live on forever in our hearts and DVD players.\nAwesome season, currently watching it\nRodgers & Hammerstein's Cinderella\nWhitney Houston  (Actor),     Brandy Norwood  (Actor),     Robert Iscove  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['A prince, a pumpkin, a glass slipper ... history\\'s most enduring fairy tale returns with a thoroughly modern twist! Beautifully produced and featuring an all-star cast, RODGERS & HAMMERSTEIN\\'S CINDERELLA shimmers to life in the most spectacular production ever of the classic musical -- including three additional Rodgers & Hammerstein songs exclusive to this special Disney presentation! Pop sensation Brandy (TV\\'s MOESHA) stars as the beautiful Cinderella, who suffers the torment of her wicked stepmother (Bernadette Peters) and spoiled stepsisters. Cinderella dreams of the impossible -- going to the ball and dancing with the prince. Her impossible dream is realized when her fairy godmother (Whitney Houston) teaches her that with positive thinking and belief in yourself, \"impossible things happen every day!\" Also starring Jason Alexander (TV\\'s SEINFELD) and Whoopi Goldberg (SISTER ACT), Disney\\'s sparkling new version of RODGERS & HAMMERSTEIN\\'S CINDERELLA promises to be an instant classic. Now you can relive the magic anytime you wish!']\n{'Genre': 'ACTION, Musical, LIVE', 'Format': 'Multiple Formats, Color, Closed-captioned, Dolby, NTSC, Live, Full Screen', 'Contributor': 'Whoopi Goldberg, Veanne Cox, Michael Haynes, Robert Iscove, Whitney Houston, Jason Alexander, Robert L. Freedman, Brandy Norwood, Victor Garber, Paolo Montalban, Bernadette Peters, Natalie DesselleWhoopi Goldberg, Veanne Cox, Michael Haynes, Robert Iscove, Whitney Houston, Jason Alexander, Robert L. Freedman, Brandy Norwood, Victor Garber, Paolo Montalban, Bernadette Peters, Natalie Desselle   See more', 'Language': 'Unqualified (Dolby Digital 5.1), English (Dolby Digital 2.0)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.57 x 5.38 x 7.52 inches; 2.72 Ounces', 'Item model number': '10285', 'Director': 'Robert Iscove', 'Media Format': 'Multiple Formats, Color, Closed-captioned, Dolby, NTSC, Live, Full Screen', 'Run time': '1 hour and 28 minutes', 'Release date': 'November 14, 2000', 'Actors': 'Whitney Houston, Brandy Norwood, Whoopi Goldberg, Jason Alexander, Bernadette Peters', 'Studio': 'ABC STUDIOS', 'Writers': 'Robert L. Freedman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nBrandy makes the most beautiful Cinderella and Whitney Houston really rocks as the fairy god mom. I loved the Lesley Anne Warren Rodgers & Hammerstein but I love this one too. It's contemporary and a little more fresh. I will always have a special place in my heart for the 1965 version since that's the one I grew up with but this one is a new favorite as well.\nBeautiful Brandy Brings Home Cinderella\nMagnum P.I.: Season 1\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"Get ready to enjoy each adventurous episode from Season One of one of the greatest television series of all time. Hang out in Hawaii for an action-packed thrill-ride with Higgins (John Hillerman), T.C. (Roger E. Mosley), Rick (Larry Manetti), and of course, the charismatic Magnum P.I. (Tom Selleck). This dynamic gift set includes a bonus disc with additional episodes featuring special guest stars Sharon Stone, Morgan Fairchild and fellow P.I.s Simon & Simon and much more. It's a must-own for every Magnum P.I. fan!\", ']]>', 'Amazon.com', 'A ratings hit for eight seasons on CBS, the action-mystery series', 'Magnum, P.I.', 'makes its DVD boxed set debut in an impressive five-disc package that offers not only the entire first season, but some rarely seen episodes. Positioned in the old', 'Hawaii Five-O', 'time slot (Thursdays at 9) in December of 1980,', 'Magnum', \"quickly became a hit, thanks to the combination of smart and witty scripting, gorgeous locations, and the considerable charm of lead Tom Selleck as former Naval Intelligence officer Thomas Magnum, who gives up his position to become a private investigator on Oahu with the help of fellow Vietnam vets T.C. (Roger E. Mosley) and Rick (Larry Manetti). Magnum also provided security for the lavish estate of wealthy (and never-seen) mystery writer Robin Masters, which gave him access to the author's expensive vehicles (including a prized Ferrari), much to the disapproval of Masters's manservant Higgins (Jonathan Hillerman).\", 'A rare series that skillfully blended action, humor, drama, and suspense,', 'Magnum, P.I.', '\\'s first season gets the boxed set treatment its fans have been hoping for, with all 18 first-season episodes (including the two-part pilot, \"Don\\'t Eat the Snow in Hawaii\") included on four discs. The fifth disc contains four rarely shown bonus episodes, including season 3\\'s \"Ki\\'ls Don\\'t Lie,\" which featured a crossover plot with', 'Simon and Simon', ', as well as its conclusion (\"Emeralds Are Not a Girl\\'s Best Friend\"), which kicked off', 'S&S', \"'s second season; the latter episode has never been aired as part of\", 'Magnum', \"'s syndicated package, which is another reason for fans to pick up and enjoy this long-awaited set.\", '--Paul Gaita']\n{'Genre': 'Drama, DVD Movie, Magnum P.I.: The Complete 1st Season, Magnum PI: Season 1, Magnum PI: Season One, Magnum P.I.: Season 1, Blu-ray Movie, Magnum PI: The Complete First Season, Magnum PI: The Complete 1st Season, Action & Adventure, Mystery & Suspense, Magnum P.I.: The Complete First SeasonDrama, DVD Movie, Magnum P.I.: The Complete 1st Season, Magnum PI: Season 1, Magnum PI: Season One, Magnum P.I.: Season 1, Blu-ray Movie, Magnum PI: The Complete First Season, Magnum PI: The Complete 1st Season, Action & Adventure, Mystery & Suspense…  See more', 'Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '5.59 x 7.52 x 1.38 inches; 11.5 Ounces', 'Item model number': '2220160', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Full Screen', 'Run time': '32 hours and 54 minutes', 'Release date': 'April 12, 2005', 'Actors': 'Various', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '4'}\nI decided after watching a couple seasons of Blue Bloods to return my original love of Tom Selleck in his role as Magnum PI. My daughter in her 20s even loves the original Magnum. I hope to add more seasons as I can.\nWho Doesn't Love Magnum? (ok Higgins Doesn't Count lol)\nDuck Dynasty: I'm Dreaming of a Redneck Christmas [DVD]\nHobbes, David  (Director),     Gurney, Deirdre  (Director),     Robertson, Jase  (Actor),     Robertson, Kay  (Actor)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n[\"In DUCK DYNASTY: I'M DREAMING OF a REDNECK CHRISTMAS from A&E, Louisiana's bearded, camouflaged millionaires gather to celebrate as only they can. Christmas fanatic Miss Kay is in her element and goes over the top decorating the house, then spends hours preparing a mouthwatering meal of pirducken (chicken, duck and turkey inside a pig) and sweet potato pie. Some of the men don their holiday sweaters, some participate from the couch, while Phil trims the tree with a chainsaw. Willie plays Santa Claus at the local church only to have Uncle Si crash the party dressed as an elf, sending the kids running. But when the Christmas lights are finally up and dinners on the table, every ones happy, happy, happy.\"]\n{'Genre': 'Reality', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Hobbes, David, Robertson, Missy, Robertson, Jase, Robertson, Willie, Robertson, Phil, Gurney, Deirdre, Robertson, Kay, Roberston, Phil, Robertson, KorieHobbes, David, Robertson, Missy, Robertson, Jase, Robertson, Willie, Robertson, Phil, Gurney, Deirdre, Robertson, Kay, Roberston, Phil, Robertson, Korie  See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.15 Ounces', 'Audio Description': 'English', 'Item model number': '12708X', 'Director': 'Hobbes, David, Gurney, Deirdre', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '43 minutes', 'Release date': 'November 5, 2013', 'Actors': 'Robertson, Jase, Robertson, Kay, Roberston, Phil, Robertson, Willie, Robertson, Korie', 'Dubbed': 'English', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nOur family absolutely loves the Robertsons! Their Christmas is just perfect--traditional, funny, red-neckified of course. It wouldn't be the same without crazy Si giving all those weird gifts to the kids now would it? Kind of fun to have their Christmas episode on its own DVD--this is actually their last year's Christmas episode so if you were expecting something completely different, don't. It's handy though to have and keep with your Christmas DVDs. I hope they do this with the 2013 Christmas special too!\nChristmas Will Never Be the Same Again Thanks To Si--Love You Si!\nVegas: The DVD Edition\nDennis Quaid  (Actor),     Carrie-Anne Moss  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['VEGAS, a drama inspired by a real-life sheriff and his battle with a powerful mobster for control of Las Vegas in the 1960s.']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Michael  Chiklis, Taylor  Handley, Carrie-Anne Moss, Dennis Quaid, Jason O'Mara, Sarah Jones\", 'Language': 'English', 'Number Of Discs': '5', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': '27492524', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '15 hours and 2 minutes', 'Release date': 'July 29, 2014', 'Actors': \"Dennis Quaid, Carrie-Anne Moss, Taylor  Handley, Jason O'Mara, Michael  Chiklis\", 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '5'}\nExcellent series and too short-lived as far as my husband and daughter are concerned. I got this for them and they do actually watch them over and over. Maybe CBS will bring it back sometime for a half season. I never watched much of it but it looked like a good series.\nExcellent series and too short-lived as far as my husband ...\nBlue Bloods: Season 3\nDonnie Wahlberg  (Actor),     Bridget Moynahan  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['BLUE BLOODS is a drama about a multi-generational family of cops dedicated to New York City law enforcement.']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Len Cariou, Will Estes, Jennifer Esposito, Amy Carlson, Tom Selleck, Bridget Moynahan, Donnie Wahlberg, Sami GayleLen Cariou, Will Estes, Jennifer Esposito, Amy Carlson, Tom Selleck, Bridget Moynahan, Donnie Wahlberg, Sami Gayle  See more', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.5 x 7.6 inches; 6.14 Ounces', 'Item model number': '26921771', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 13 minutes', 'Release date': 'July 19, 2016', 'Actors': 'Donnie Wahlberg, Bridget Moynahan, Will Estes, Len Cariou, Tom Selleck', 'Subtitles': 'English', 'Studio': 'Paramount', 'Country of Origin': 'USA', 'Number of discs': '6'}\nLove love love this show! The cast is excellent, the storylines are always awesome and compelling. I've been getting the DVDs as the seasons end so now I need season 4. And to think I wasn't all that crazy about this series when it first started. I started watching because of Tom Selleck but really, now I'm in awe of the entire cast!\nGotta love this great show!",
  "profile": "**User Summary:**\n\n- **Media Preference:** The user enthusiastically embraces classic television series and feel-good movies, with a strong appreciation for character-driven narratives. Their recent purchase underscores a continued desire for engaging stories that foster family bonding and collective enjoyment.\n\n- **Format Preference:** DVDs remain the user's preferred format, highlighting their dedication to collecting tangible media. They actively search for special editions and box sets, particularly those featuring compelling dramas.\n\n- **Engagement Level:** The user is highly active in the media community, sharing thoughtful reviews that reflect the emotional connections formed around their favorite series. Their latest review emphasizes their evolving appreciation for a show, showcasing their enthusiasm for engaging with the cast and storylines.\n\n- **Nostalgia Factor:** The user values media that evokes nostalgia, favoring series that resonate across generations and promote family interactions, particularly during special occasions.\n\n- **Advocacy for Releases:** They continue to advocate for physical releases of beloved series, underscoring their belief in traditional viewing experiences.\n\n- **Review Engagement:** Their latest review illustrates their enjoyment of sharing series with family members and their eagerness for new content, reinforcing their commitment to enhancing shared viewing experiences.\n\nOverall, the user exemplifies a heartfelt dedication to enriching their media collection with a blend of nostalgia, engaging storytelling, and a passion for sharing experiences with the community.",
  "metrics": {
    "rouge1_f": 0.04510218463706836,
    "rouge2_f": 0.0066972153683468455,
    "rougeL_f": 0.026074700493305143,
    "meteor": 0.012437955261412996,
    "bleu1": 1.3322740763942875e-12,
    "bleu2": 5.102613334211897e-13,
    "bleu3": 1.7517914389065585e-13,
    "bleu4": 4.8581360621511714e-14,
    "bertscore_precision": 0.338282972574234,
    "bertscore_recall": 0.5228613615036011,
    "bertscore_f1": 0.4107908606529236
  }
}