{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/01/24\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Barrett', 'Ralph Hemecker', 'Robert Harmon', 'Alex Zakrzewski', 'John Behring', 'Alex Chapple', 'Jackeline Tejada', 'Eric Laneuville', 'Michael Pressman', 'Douglas Aarniokoski'], 'Studio': ['CBS']}\nReview Text: CBS can definitely keep this show coming. It's one of the best new shows they've had in a long time which is evident by their current high ratings, highest for a show on Friday nights in quite sometime from what I read. Tom Selleck is awesome as Frank and everyone else is great too, just like a family. The family dinner is always my favorite scene. I will continue to buy these seasons as they come out. Long live Blue Bloods!\nReview Title: Blue Bloods is one of the best newer shows out there, high ratings too!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Diagnosis Murder - Season 4\nFormat: DVD\nMovies & TV, First to Know, Television\n{'Media Format': 'NTSC', 'Studio': 'Paramount'}\nI agree with the other person whose review is going on a year old! Please Amazon, if you have any clout with Paramount TV, get them to release the rest of the Diagnosis Murder series. I couldn't find how to sign up to be notified of any new DM DVDs so I thought I'd just write this review in the hopes that someone at Amazon will see it and realize we DM fans just want the rest of our show on DVD. Pretty much everything else I like is already making good progress on DVDs such as House, Bones, and some of the newer ones. Please light a fire under the powers that be so that the rest of DM can be released soon! Season 4 is awesome, I remember from watching it first time around and from my tapes that I have to rely on if I want anything past season 3.\nDiagnosis Starved Here!\nThe Hardy Boys: Season 3\nShaun Cassidy  (Actor),     Parker Stevenson  (Actor),     Joseph Pevney  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', 'Follow the clues to adventure as the Hardy Boys: The Final Season comes to DVD for the first time! Inspired by the hugely popular books teen sensations Shaun Cassidy and Parker Stevenson star as brave super-sleuths who continue to solve spooky mysteries.', 'Amazon.com', \"When the first of many Hardy Boys books was published in 1927, nobody could have imagined this version of the amateur crime-fighting duo: feathered hair, bell-bottoms, the action set to a disco beat. But that's what you get in\", 'The Hardy Boys: Season Three', ', a vintage \\'70s experience. (The show had begun with the Hardys rotating with episodes featuring Nancy Drew, but she was quietly erased for this final season.) Shaun Cassidy and Parker Stevenson play Joe and Frank Hardy, whose adventures in crime fighting take a new twist when they\\'re recruited to join their dad as US secret agents. There\\'s a lot of globetrotting involved, although stock-footage establishing shots of London, Greece, Hawaii, etc., take the place of actual location shooting. The two-part opening episode sees Joe go after the killers of his fiancée, a trauma that is mostly forgotten by episode three. The stories are serviceable, but frankly the season is most notable for its cascade of incredible \\'70s style and its wild gimmicks: government-trained killer sharks at a secret California beach? Bring it on! Stevenson and Cassidy (who enjoyed/endured a phase of teenybopper stardom at this time) boast the kind of hair that belongs in a Smithsonian exhibit on what was notable about the 1970s, and if you remember the soft-rock band Bread, be advised that group leader David Gates and the band are featured in another two-part episode that features lots of Bread songs and also Cold War defection espionage (\"Bread isn\\'t the only thing on the menu tonight,\" Stevenson notes at a suspense-filled concert). The season lasted only 10 episodes, and given the shoddy production values and the mostly subpar writing, that is no surprise. Future blockbuster screenwriter Steven E. de Souza worked on the series, and the guest cast is the usual collection of \\'70s regulars: Nehemiah Persoff, Edd \"Kookie\" Byrnes, June Lockhart, Dana Andrews, Dane Clark, etc. Don\\'t go for quality, but if you have a weakness for Smiley Face camp, this does the job.', '--Robert Horton']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Contributor': 'Parker Stevenson, Joseph Pevney, Shaun Cassidy', 'Language': 'English', 'Number Of Discs': '3', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Joseph Pevney', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Run time': '8 hours and 30 minutes', 'Release date': 'February 12, 2013', 'Actors': 'Shaun Cassidy, Parker Stevenson', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '3'}\nAlthough the 3rd season may not be everyone's favorite season since it means that the series was drawing to a close, I was still happy to see it finally released on DVD.\nLong awaited 3rd season\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Barrett', 'Ralph Hemecker', 'Robert Harmon', 'Alex Zakrzewski', 'John Behring', 'Alex Chapple', 'Jackeline Tejada', 'Eric Laneuville', 'Michael Pressman', 'Douglas Aarniokoski'], 'Studio': ['CBS']}\nCBS can definitely keep this show coming. It's one of the best new shows they've had in a long time which is evident by their current high ratings, highest for a show on Friday nights in quite sometime from what I read. Tom Selleck is awesome as Frank and everyone else is great too, just like a family. The family dinner is always my favorite scene. I will continue to buy these seasons as they come out. Long live Blue Bloods!\nBlue Bloods is one of the best newer shows out there, high ratings too!",
  "profile": "**User Summary:**\n\n- **Media Preference:** Strong interest in classic television series, particularly within crime and mystery genres, with a specific fondness for shows that evoke nostalgia. Recently expressed enthusiasm for newer series that reflect high quality and strong ratings.\n- **Format Preference:** Favors physical media, especially DVDs, and seeks out complete collections of classic and popular contemporary series, emphasizing a commitment to preserving media history.\n- **Engagement Level:** Actively participates in product reviews and engages with retailers about the availability of sought-after products, indicating a passion for both classic and notable new shows.\n- **Community Involvement:** Engages in public discussions and advocates for the release of vintage and deserving series, showcasing a desire to connect with fellow fans and influence product availability.\n- **Nostalgia Factor:** Values content that elicits personal memories and experiences, particularly appreciating vintage shows from earlier decades while also willing to embrace newer offerings that resonate with viewers.\n- **Request for Action:** Demonstrates a proactive approach, frequently prompting retailers to consider more releases of classic and notable newer shows.\n- **Review Engagement:** Recently rated a newer series highly, highlighting joy in both the plot and character dynamics, specifically enjoying family-oriented themes.\n\nOverall, the user exemplifies a deep passion for both classic and high-quality newer television series, continuously striving for comprehensive access to their favorites on DVD and actively engaging in the fan community to advocate for their interests.",
  "metrics": {
    "rouge1_f": 0.2098421541318477,
    "rouge2_f": 0.013023255813953489,
    "rougeL_f": 0.08542246982358404,
    "meteor": 0.07120253164556961,
    "bleu1": 0.025987700619926547,
    "bleu2": 0.0072510767095808875,
    "bleu3": 0.001058513737653546,
    "bleu4": 0.00040477832240324603,
    "bertscore_precision": 0.3694790005683899,
    "bertscore_recall": 0.4718785881996155,
    "bertscore_f1": 0.4144473969936371
  }
}