{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dallas: Season 1\nReview Date: 2013/01/24\nStore: Larry Hagman  (Actor),     Josh Henderson  (Actor),     Michael M. Robin  (Director),     Steve Robin  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Dallas (2012): The Complete First Season (DVD)', 'The Ewing family is back in the all-new Dallas — based upon one of the most popular television dramas ever. Secrets, schemes and betrayals abound within the Texas oil dynasty as the iconic elder Ewings — original series stars Larry Hagman, Patrick Duffy and Linda Gray — are joined by the next generation, who give lies and ambition new meaning. In the new series, John Ross (Josh Henderson), JR and Sue Ellen Ewing’s son, is determined to drill for oil on Ewing land. Christopher (Jesse Metcalfe), Bobby’s adopted son, hopes to take the family business away from oil and toward alternative energy sources, with his fiancée (Julie Gonzalo). Complicating matters is the presence of Elena Ramos (Jordana Brewster), John Ross’s girlfriend and Christopher’s ex-fiancée. With an increasingly volatile feud brewing, the stage is set for JR to return to his nefarious ways and rekindle his own long-standing rivalry with younger brother, Bobby.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Josh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda GrayJosh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda Gray  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '26229142', 'Director': 'Michael M. Robin, Steve Robin', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Run time': '7 hours and 20 minutes', 'Release date': 'January 8, 2013', 'Actors': 'Larry Hagman, Josh Henderson, Jesse Metcalf, Jordana Brewster, Julie Gonzalo', 'Subtitles': 'Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '3'}\nReview Text: I absolutely LOVED the first season of the new Dallas and as of this review, the 2nd season is coming up next week. The only sad thing is that Larry Hagman will only be a part of about 6 episodes of season 2--at least I now have Season 1 and all the deliciously typical J.R Ewing scenes that went with it. I think a Dallas DVD marathon is in order at my house just to get ready for the Season 2 premiere. Thanks again TNT for releasing this and to Amazon for the nice affordable price! I have Prime but I think this came even quicker than usual.\nReview Title: Awesome and kudos to TNT for releasing this!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Diagnosis Murder - Season 4\nFormat: DVD\nMovies & TV, First to Know, Television\n{'Media Format': 'NTSC', 'Studio': 'Paramount'}\nI agree with the other person whose review is going on a year old! Please Amazon, if you have any clout with Paramount TV, get them to release the rest of the Diagnosis Murder series. I couldn't find how to sign up to be notified of any new DM DVDs so I thought I'd just write this review in the hopes that someone at Amazon will see it and realize we DM fans just want the rest of our show on DVD. Pretty much everything else I like is already making good progress on DVDs such as House, Bones, and some of the newer ones. Please light a fire under the powers that be so that the rest of DM can be released soon! Season 4 is awesome, I remember from watching it first time around and from my tapes that I have to rely on if I want anything past season 3.\nDiagnosis Starved Here!\nThe Hardy Boys: Season 3\nShaun Cassidy  (Actor),     Parker Stevenson  (Actor),     Joseph Pevney  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Boxed Sets, Television\n['Product Description', 'Follow the clues to adventure as the Hardy Boys: The Final Season comes to DVD for the first time! Inspired by the hugely popular books teen sensations Shaun Cassidy and Parker Stevenson star as brave super-sleuths who continue to solve spooky mysteries.', 'Amazon.com', \"When the first of many Hardy Boys books was published in 1927, nobody could have imagined this version of the amateur crime-fighting duo: feathered hair, bell-bottoms, the action set to a disco beat. But that's what you get in\", 'The Hardy Boys: Season Three', ', a vintage \\'70s experience. (The show had begun with the Hardys rotating with episodes featuring Nancy Drew, but she was quietly erased for this final season.) Shaun Cassidy and Parker Stevenson play Joe and Frank Hardy, whose adventures in crime fighting take a new twist when they\\'re recruited to join their dad as US secret agents. There\\'s a lot of globetrotting involved, although stock-footage establishing shots of London, Greece, Hawaii, etc., take the place of actual location shooting. The two-part opening episode sees Joe go after the killers of his fiancée, a trauma that is mostly forgotten by episode three. The stories are serviceable, but frankly the season is most notable for its cascade of incredible \\'70s style and its wild gimmicks: government-trained killer sharks at a secret California beach? Bring it on! Stevenson and Cassidy (who enjoyed/endured a phase of teenybopper stardom at this time) boast the kind of hair that belongs in a Smithsonian exhibit on what was notable about the 1970s, and if you remember the soft-rock band Bread, be advised that group leader David Gates and the band are featured in another two-part episode that features lots of Bread songs and also Cold War defection espionage (\"Bread isn\\'t the only thing on the menu tonight,\" Stevenson notes at a suspense-filled concert). The season lasted only 10 episodes, and given the shoddy production values and the mostly subpar writing, that is no surprise. Future blockbuster screenwriter Steven E. de Souza worked on the series, and the guest cast is the usual collection of \\'70s regulars: Nehemiah Persoff, Edd \"Kookie\" Byrnes, June Lockhart, Dana Andrews, Dane Clark, etc. Don\\'t go for quality, but if you have a weakness for Smiley Face camp, this does the job.', '--Robert Horton']\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Contributor': 'Parker Stevenson, Joseph Pevney, Shaun Cassidy', 'Language': 'English', 'Number Of Discs': '3', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'Joseph Pevney', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Closed-captioned', 'Run time': '8 hours and 30 minutes', 'Release date': 'February 12, 2013', 'Actors': 'Shaun Cassidy, Parker Stevenson', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '3'}\nAlthough the 3rd season may not be everyone's favorite season since it means that the series was drawing to a close, I was still happy to see it finally released on DVD.\nLong awaited 3rd season\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Barrett', 'Ralph Hemecker', 'Robert Harmon', 'Alex Zakrzewski', 'John Behring', 'Alex Chapple', 'Jackeline Tejada', 'Eric Laneuville', 'Michael Pressman', 'Douglas Aarniokoski'], 'Studio': ['CBS']}\nCBS can definitely keep this show coming. It's one of the best new shows they've had in a long time which is evident by their current high ratings, highest for a show on Friday nights in quite sometime from what I read. Tom Selleck is awesome as Frank and everyone else is great too, just like a family. The family dinner is always my favorite scene. I will continue to buy these seasons as they come out. Long live Blue Bloods!\nBlue Bloods is one of the best newer shows out there, high ratings too!\nDallas: Season 1\nLarry Hagman  (Actor),     Josh Henderson  (Actor),     Michael M. Robin  (Director),     Steve Robin  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Dallas (2012): The Complete First Season (DVD)', 'The Ewing family is back in the all-new Dallas — based upon one of the most popular television dramas ever. Secrets, schemes and betrayals abound within the Texas oil dynasty as the iconic elder Ewings — original series stars Larry Hagman, Patrick Duffy and Linda Gray — are joined by the next generation, who give lies and ambition new meaning. In the new series, John Ross (Josh Henderson), JR and Sue Ellen Ewing’s son, is determined to drill for oil on Ewing land. Christopher (Jesse Metcalfe), Bobby’s adopted son, hopes to take the family business away from oil and toward alternative energy sources, with his fiancée (Julie Gonzalo). Complicating matters is the presence of Elena Ramos (Jordana Brewster), John Ross’s girlfriend and Christopher’s ex-fiancée. With an increasingly volatile feud brewing, the stage is set for JR to return to his nefarious ways and rekindle his own long-standing rivalry with younger brother, Bobby.', ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Josh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda GrayJosh Henderson, Julie Gonzalo, Steve Robin, Larry Hagman, Jordana Brewster, Michael M. Robin, Brenda Strong, Callard Harris, Patrick Duffy, Jesse Metcalf, Linda Gray  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '26229142', 'Director': 'Michael M. Robin, Steve Robin', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled', 'Run time': '7 hours and 20 minutes', 'Release date': 'January 8, 2013', 'Actors': 'Larry Hagman, Josh Henderson, Jesse Metcalf, Jordana Brewster, Julie Gonzalo', 'Subtitles': 'Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '3'}\nI absolutely LOVED the first season of the new Dallas and as of this review, the 2nd season is coming up next week. The only sad thing is that Larry Hagman will only be a part of about 6 episodes of season 2--at least I now have Season 1 and all the deliciously typical J.R Ewing scenes that went with it. I think a Dallas DVD marathon is in order at my house just to get ready for the Season 2 premiere. Thanks again TNT for releasing this and to Amazon for the nice affordable price! I have Prime but I think this came even quicker than usual.\nAwesome and kudos to TNT for releasing this!",
  "profile": "**User Summary:**\n\n- **Media Preference:** Strong interest in classic television series, particularly within crime and mystery genres, while also expressing enthusiasm for high-quality newer series that reflect strong ratings. Recently showcased a specific admiration for the revival of classic shows.\n- **Format Preference:** Favors physical media, especially DVDs, with a focus on complete collections of both vintage and contemporary series. Prioritizes preserving media history through tangible formats.\n- **Engagement Level:** Actively participates in product reviews, highlighting satisfaction with recent purchases and engaging with retailers regarding the availability of sought-after titles, demonstrating a commitment to quality television.\n- **Community Involvement:** Engages in public discussions and advocates for the release of both vintage and contemporary series, indicating a desire to connect with fellow fans and influence media releases.\n- **Nostalgia Factor:** Values content that elicits personal memories, particularly appreciating vintage shows from earlier decades while also embracing newer offerings that resonate with viewers.\n- **Request for Action:** Proactively prompts retailers to consider more releases of beloved classic and newer shows, reflecting a strong advocacy for fan interests.\n- **Review Engagement:** Recently rated a new series highly, expressing joy in the plot, character dynamics, and nostalgic elements, while planning to host a viewing marathon in anticipation of new seasons.\n\nOverall, the user exemplifies a passionate dedication to both classic and notable new television series, seeking comprehensive access to favorites on DVD and actively engaging in the fan community to advocate for their interests.",
  "metrics": {
    "rouge1_f": 0.15006468305304013,
    "rouge2_f": 0.011658031088082901,
    "rougeL_f": 0.0685640362225097,
    "meteor": 0.05098878482462511,
    "bleu1": 0.003820370485357872,
    "bleu2": 0.0012806416448491176,
    "bleu3": 0.0001715152102250478,
    "bleu4": 6.282016476426702e-05,
    "bertscore_precision": 0.36153197288513184,
    "bertscore_recall": 0.47633126378059387,
    "bertscore_f1": 0.41106703877449036
  }
}