{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Touch [DVD]\nReview Date: 2013/03/08\nStore: Skeet Ulrich  (Actor),     Bridget Fonda  (Actor),     Paul Schrader  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'R', 'Release Date:', '12-FEB-2008', 'Media Type:', 'DVD']\nAverage Rating: 4.0\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 2.4 Ounces', 'Director': 'Paul Schrader', 'Media Format': 'Color, Dolby, Dubbed, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Skeet Ulrich, Bridget Fonda, Christopher Walken, Tom Arnold, Paul Mazursky', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nReview Text: I am fond of this one .The humor and spiritual perspective are right up my alley. It is not for everyone though.It pokes at organized religion.\nReview Title: Enjoyable quirky little movie\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Mr North\nAnthony Edwards  (Actor),     Robert Mitchum  (Actor),     Danny Huston  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', \"Anthony Edwards, Mary Stuart Masterson and Virginia Madsen star with a cast of luminaries, including Robert Mitchum, Harry Dean Stanton, Anjelica Huston, Tammy Grimes and Lauren Bacall, in this heartwarming and hilarious fable about a man who sets a wealthy community's hair on end literally! When young Yale graduate Theophilus North (Edwards) settles in Newport, Rhode Island, in 1926, he charms the elite with his ability to heal with an unusual energy that flows from his fingertips. But as North gains a reputation as a savior, he simultaneously endures the wrath of the local doctor, who labels him a charlatan. Suddenly this gifted newcomer must defend his honor before his unique talent sparks a backlash that lands him in jail!\", 'Amazon.com', \"T. Theopholis North (Anthony Edwards) is an aspiring adventurer making do as a tutor and reader to the upper-crust in 1920s Newport, Rhode Island, in Danny Huston's enchanting if rough-edged adaptation of Thornton Wilder's\", 'comic novel', \". Equally at home with the rich (Robert Mitchum's blustery but big-hearted philosopher millionaire) and the poor (butler and all-around-town character Harry Dean Stanton), the young man with an electric personality (literally) becomes a liberator, a matchmaker, a reluctant faith healer, and a tonic for a community in the thrall of charlatans. Huston, son of the great John Huston (who helped script the film), is not a deft filmmaker, but he has a welcoming warmth and a contagious affection for his colorful characters. If his cast (which includes Lauren Bacall, Mary Stuart Masterson, and Anjelica Huston, Danny's sister) tends to overplay their parts, it's in the genial spirit of this lighthearted lark.\", '--Sean Axmaker']\n{'Format': 'Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Anthony Edwards, Harry Dean Stanton, Anjelica Huston, Robert Mitchum, Christopher Durang, James Costigan, Thornton Wilder, John Huston, Mark Metcalf, Mary Stuart Masterson, Virginia Madsen, Danny Huston, Sandra Birnhak Ames, Hunter Carson, David R. Ames, Janet Roach, David Warner, Tammy Grimes, Lauren BacallAnthony Edwards, Harry Dean Stanton, Anjelica Huston, Robert Mitchum, Christopher Durang, James Costigan, Thornton Wilder, John Huston, Mark Metcalf, Mary Stuart Masterson, Virginia Madsen, Danny Huston, Sandra Birnhak Ames, Hunter Carson, David R.…  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.64 Ounces', 'Director': 'Danny Huston', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'February 18, 2003', 'Actors': 'Anthony Edwards, Robert Mitchum, Lauren Bacall, Harry Dean Stanton, Anjelica Huston', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'David R. Ames, John Huston, Sandra Birnhak Ames', 'Studio': 'MGM (Video & DVD)', 'Writers': 'James Costigan, Janet Roach, John Huston, Thornton Wilder', 'Number of discs': '1'}\nSo glad we could find it here on DVD. It is packed with stars and gentle humor. It prompted us to read the book it is based upon, and we like the movie better in this case.It is not mainstream, but is treasured at our house!\nWe love this little movie!\nTouch [DVD]\nSkeet Ulrich  (Actor),     Bridget Fonda  (Actor),     Paul Schrader  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'R', 'Release Date:', '12-FEB-2008', 'Media Type:', 'DVD']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 2.4 Ounces', 'Director': 'Paul Schrader', 'Media Format': 'Color, Dolby, Dubbed, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Skeet Ulrich, Bridget Fonda, Christopher Walken, Tom Arnold, Paul Mazursky', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nI am fond of this one .The humor and spiritual perspective are right up my alley. It is not for everyone though.It pokes at organized religion.\nEnjoyable quirky little movie",
  "profile": "The user maintains a strong preference for classic and less mainstream movies, especially within the science fiction and fantasy genres. They enjoy films that showcase ensemble casts and feature a blend of humor and heartwarming themes, often enhanced by notable performances from well-known actors. Their affinity for adaptations of literary works reflects a desire to explore original source material after watching films. The user rates movies positively, indicating a fondness for nostalgic and unique cinematic experiences over blockbuster hits. \n\nRecent interactions highlight the user's appreciation for films that have a quirky and spiritual perspective, as well as an ability to tackle complex themes, such as critiques of organized religion. The user enjoys character-driven narratives that resonate with charm, richness in character, and a gentle tone, often infused with moral undertones. Their engagement with the content of films suggests they value deeper explorations of character dynamics and storytelling. Overall, the user seeks films that evoke both thoughtfulness and enjoyment, blending humor with a unique narrative style while also connecting to broader themes or social commentary.",
  "metrics": {
    "rouge1_f": 0.17900552486187848,
    "rouge2_f": 0.0221483942414175,
    "rougeL_f": 0.07734806629834255,
    "meteor": 0.05851488322756551,
    "bleu1": 0.004173998491023593,
    "bleu2": 0.0016026771267318404,
    "bleu3": 0.0007567331616877877,
    "bleu4": 0.00022247476550299832,
    "bertscore_precision": 0.31190598011016846,
    "bertscore_recall": 0.4510785937309265,
    "bertscore_f1": 0.3687993586063385
  }
}