{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Kung Fu: The Legend Continues: The Complete First Season\nReview Date: 2015/03/11\nStore: David Carradine  (Actor)    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"When we last saw Kwai Chang Caine, in Kung Fu: the Movie, he was united with the son he never knew he had in the turn-of-the-century Wild West. Now, the son of that son, also named Kwai Chang Caine (David Carradine), must emerge from seclusion to save the son he thought lost. Like his legendary namesake, this Caine is also a warrior monk, operating a Shaolin temple in Northern California. After an evil priest, Tan (Ernest Abuba), destroys the temple, Caine and his young son, Peter (Nathaniel Moreau) each believe the other has perished. The two embark on very different paths -- Caine wanders the Earth, while Peter (Chris Potter) is a cop. When fate brings the two together, they work to overcome their differing philosophies to battle Tan, and then to help the innocent and bring justice to the new Wild West -- 90s urban America. Please note the series' pilot movie is presented here in its international release version, and contains brief nudity.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'NTSC', 'Contributor': 'David Carradine', 'Language': 'English', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'B00KKZ4K1A', 'Media Format': 'NTSC', 'Run time': '16 hours and 50 minutes', 'Release date': 'August 28, 2014', 'Actors': 'David Carradine', 'Studio': 'Warner Archive Collection', 'Number of discs': '6'}\nReview Text: There are some missing scenes, and I loved that show. The characters got more and more interesting with time. Sure hope the whole series gets onto DVD!\nReview Title: A teasing taste,Want more.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Mr North\nAnthony Edwards  (Actor),     Robert Mitchum  (Actor),     Danny Huston  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', \"Anthony Edwards, Mary Stuart Masterson and Virginia Madsen star with a cast of luminaries, including Robert Mitchum, Harry Dean Stanton, Anjelica Huston, Tammy Grimes and Lauren Bacall, in this heartwarming and hilarious fable about a man who sets a wealthy community's hair on end literally! When young Yale graduate Theophilus North (Edwards) settles in Newport, Rhode Island, in 1926, he charms the elite with his ability to heal with an unusual energy that flows from his fingertips. But as North gains a reputation as a savior, he simultaneously endures the wrath of the local doctor, who labels him a charlatan. Suddenly this gifted newcomer must defend his honor before his unique talent sparks a backlash that lands him in jail!\", 'Amazon.com', \"T. Theopholis North (Anthony Edwards) is an aspiring adventurer making do as a tutor and reader to the upper-crust in 1920s Newport, Rhode Island, in Danny Huston's enchanting if rough-edged adaptation of Thornton Wilder's\", 'comic novel', \". Equally at home with the rich (Robert Mitchum's blustery but big-hearted philosopher millionaire) and the poor (butler and all-around-town character Harry Dean Stanton), the young man with an electric personality (literally) becomes a liberator, a matchmaker, a reluctant faith healer, and a tonic for a community in the thrall of charlatans. Huston, son of the great John Huston (who helped script the film), is not a deft filmmaker, but he has a welcoming warmth and a contagious affection for his colorful characters. If his cast (which includes Lauren Bacall, Mary Stuart Masterson, and Anjelica Huston, Danny's sister) tends to overplay their parts, it's in the genial spirit of this lighthearted lark.\", '--Sean Axmaker']\n{'Format': 'Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Anthony Edwards, Harry Dean Stanton, Anjelica Huston, Robert Mitchum, Christopher Durang, James Costigan, Thornton Wilder, John Huston, Mark Metcalf, Mary Stuart Masterson, Virginia Madsen, Danny Huston, Sandra Birnhak Ames, Hunter Carson, David R. Ames, Janet Roach, David Warner, Tammy Grimes, Lauren BacallAnthony Edwards, Harry Dean Stanton, Anjelica Huston, Robert Mitchum, Christopher Durang, James Costigan, Thornton Wilder, John Huston, Mark Metcalf, Mary Stuart Masterson, Virginia Madsen, Danny Huston, Sandra Birnhak Ames, Hunter Carson, David R.…  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.64 Ounces', 'Director': 'Danny Huston', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dubbed, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'February 18, 2003', 'Actors': 'Anthony Edwards, Robert Mitchum, Lauren Bacall, Harry Dean Stanton, Anjelica Huston', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Producers': 'David R. Ames, John Huston, Sandra Birnhak Ames', 'Studio': 'MGM (Video & DVD)', 'Writers': 'James Costigan, Janet Roach, John Huston, Thornton Wilder', 'Number of discs': '1'}\nSo glad we could find it here on DVD. It is packed with stars and gentle humor. It prompted us to read the book it is based upon, and we like the movie better in this case.It is not mainstream, but is treasured at our house!\nWe love this little movie!\nTouch [DVD]\nSkeet Ulrich  (Actor),     Bridget Fonda  (Actor),     Paul Schrader  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['No Description Available.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'R', 'Release Date:', '12-FEB-2008', 'Media Type:', 'DVD']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 2.4 Ounces', 'Director': 'Paul Schrader', 'Media Format': 'Color, Dolby, Dubbed, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Skeet Ulrich, Bridget Fonda, Christopher Walken, Tom Arnold, Paul Mazursky', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '1'}\nI am fond of this one .The humor and spiritual perspective are right up my alley. It is not for everyone though.It pokes at organized religion.\nEnjoyable quirky little movie\nKnight and Day (Single-Disc Edition)\nTom Cruise  (Actor),     Cameron Diaz  (Actor),     James Mangold  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'Big screen superstars Tom Cruise and Cameron Diaz come together in this fun, action-packed thrill-ride that will keep you on the edge of your seat. When a small-town girl named June (Diaz) meets a mysterious stranger, she thinks she\\'s found the man of her dreams. But she soon discovers he\\'s a fugitive super-spy, who thrusts her into a thrilling cat-and-mouse chase that spans the globe. As the bullets and sparks fly, June must decide if her \"Knight\" in shining armor is a dangerous traitor or the love of her life.', 'Amazon.com', 'Knight and Day', 'has action by the boatload, cheeky wit, unexpected double-crossing, sexual tension, and the blinding smile of its star, Tom Cruise. In short, what more could you ask of a rollicking good-time movie?', 'Knight and Day', \", which also stars the irresistible Cameron Diaz as Cruise's superspy's ultimate foil, channels the best elements of earlier films like\", 'Mr. and Mrs. Smith', ',', 'Mission: Impossible', ', the', 'Bourne', 'films, and even a little of', 'Duplicity', \"'s sophistication. Mostly, though,\", 'Knight and Day', 'is about moving things along merrily, if not completely coherently, as the two stars tangle, and tussle with trust issues, in a completely believable, compulsively watchable way. Cruise plays Roy, an on-the-lam spy (who may have had some kind of psychotic break--or who may in fact be the only person telling the truth); he runs into the winsome June (Diaz), who gets caught up in Roy\\'s mad dash to escape the cabal of federal agents on his tail. \"No one follows us,\" Roy announces to a terrified diner crowd as he moves to make his escape with June, \"or I kill myself--and then her.\" While', 'Knight and Day', ', directed by James Mangold, has more than its share of high-speed chases, hails of bullets, and explosions, it works far better as a romantic comedy--for the chemistry between Diaz and Cruise is delicious, palpable, and believable. So grab a date and an extra-large popcorn, and get ready for a sweet and fun', 'Knight and Day', '. --', 'A.T. Hurley']\n{'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Subtitled, Widescreen, Dubbed', 'Contributor': 'Tom Cruise, Cameron Diaz, James Mangold', 'Language': 'Unqualified', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.54 x 5.37 x 7.55 inches; 0.01 Ounces', 'Item model number': 'FOXS2267223DVD', 'Director': 'James Mangold', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, AC-3, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 49 minutes', 'Release date': 'November 30, 2010', 'Actors': 'Tom Cruise, Cameron Diaz', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis one is a bit of a guilty pleasure. It definitely strains credibility ,but so do many fun action movies. It is like an amusement ride,it gives my brain a rest from stress, and makes me smile at the finish. It is a fun break as far as I am concerned. Though I am not a huge Tom Cruise fan(or Cameron Diaz - though I own on or two of their other movies), the chemistry is so good here , I enjoy it thoroughly.I worked in a video store for 10 years and have pretty eclectic tastes ,  this one  just goes under fun.\nAction packed fun.\nStrangers in Good Company\nMary Meigs  (Actor),     Beth Webber  (Actor),     Cynthia Scott  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Independently Distributed, Comedy\n['Product Description', \"In this film by Academy Award winner Cynthia Scott, seven old women become stranded at a deserted farmhouse miles from civilization. They don't have much food, or a decent place to sleep. Or much in common. But these surprising, remarkable women turn a crisis into a magical time of humor and spirit.\", 'Amazon.com', \"This touching, 1991 Canadian film directed by Cynthia Scott takes the unusual step of casting nonprofessional actors, and the gamble pays off very well indeed. The story concerns eight elderly women whose tour bus breaks down driving through the wilderness. While waiting to be rescued, they find an abandoned house and look for food. The days and nights they end up spending away from civilization prove restorative to their spirits as each character gets an opportunity to tell her life story. The ensemble cast, as it turns out, essentially plays themselves in the film: the tales they tell are truly their own. A very talky, slowly paced production, it's best to get into the gentle rhythm of Scott's design and let the experience flow in the same way it does for the performers.\", '--Tom Keogh', 'Review', 'Sweet, unpretentious, charmingly low-keyed and appealing all the way through. A genuine tonic. --The New York TimesEloquently witty and touching! There may be bigger, costlier, weightier films around; there are none lovelier! --Peter Travers, Rolling StoneBoth witty and wise-an epiphany for the price of a movie ticket! --Philadelphia Inquirer', 'See more']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Anamorphic, Dolby, NTSC, HiFi Sound, Widescreen, Surround Sound, THX', 'Contributor': 'Beth Webber, Constance Garneau, Catherine Roche (II), Cissy Meddings, Michelle Sweeney, Alice Diabo, Mary Meigs, Cynthia ScottBeth Webber, Constance Garneau, Catherine Roche (II), Cissy Meddings, Michelle Sweeney, Alice Diabo, Mary Meigs, Cynthia Scott  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.25 Ounces', 'Item model number': '909167', 'Director': 'Cynthia Scott', 'Media Format': 'Multiple Formats, Color, Anamorphic, Dolby, NTSC, HiFi Sound, Widescreen, Surround Sound, THX', 'Run time': '1 hour and 45 minutes', 'Release date': 'December 7, 1999', 'Actors': 'Mary Meigs, Beth Webber, Michelle Sweeney, Constance Garneau, Cissy Meddings', 'Studio': 'First Run Features', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI hunted for this movie, it had been a lot of years since I viewed it . It has stuck with me though. it is a movie that helps awaken a feeling of inner strength and a can do attitude. Even though these old lady's have problems and are not perfect ,they manage to pull it together and survive on their own.\nA great transformation movie\nMrs. Henderson Presents (Widescreen Edition)\nJudi Dench  (Actor),     Bob Hoskins  (Actor),     Stephen Frears  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Mrs. Laura Henderson may be a widow but she is by no means going to spend the rest her days playing bridge. The Windmill Theater becomes her game and the infamous showman Vivian Van Dam becomes her partner and fiercest opponent. The Germans are bombing London but the roar of the Windmill is all that can be heard, as Laura convinces Lord Cromer to allow her actresses to be the one thing no one could ever imagine: Nude. Brought to its knees by war, what Mrs. Henderson Presents brings a nation to its feet in applause.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Kelly Reilly, Anna Brewster, Thomas Allen, Christopher Guest, Rosalind Halstead, Kathy Rose, Judi Dench, David Rose, Sarah Solemani, Bob Hoskins, Martin Sherman, Will Young, Stephen Frears, Thelma Barlow, Richard Syms, Natalia TenaKelly Reilly, Anna Brewster, Thomas Allen, Christopher Guest, Rosalind Halstead, Kathy Rose, Judi Dench, David Rose, Sarah Solemani, Bob Hoskins, Martin Sherman, Will Young, Stephen Frears, Thelma Barlow, Richard Syms, Natalia Tena  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WENC79099DVD', 'Director': 'Stephen Frears', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'April 18, 2006', 'Actors': 'Judi Dench, Bob Hoskins, Christopher Guest, Will Young, Kelly Reilly', 'Subtitles': 'English, Spanish', 'Studio': 'Weinstein Company', 'Writers': 'David Rose, Kathy Rose, Martin Sherman', 'Number of discs': '1'}\nI bought this one blind. Judi Dench does not disappoint. It took me right to the WWII era and I found it sweet , sad, and touching , but also funny in places, just like life in general\nInteresting hisorical view\n{'Content advisory': ['Alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Madden'], 'Producers': ['Graham Broadbent', 'Peter Czernin', 'Sarah Harvey', 'Caroline Hewitt', 'Jonathan King', 'Pravesh Sahni', 'Jeff Skoll', 'Ricky Strauss'], 'Starring': ['Tom Wilkinson', 'Bill Nighy'], 'Studio': ['Fox Searchlight']}\nThe acting is perfect. The setting authentic and the human life lessons are pretty universal. It consider it a teaching movie that shows how much a good life is about what you believe and how it affects what you perceive.\nWonderful movie about growing older and staying alive\nMary Poppins (Two-Disc 45th Anniversary Special Edition) [DVD]\nJulie Andrews  (Actor),     Dick Van Dyke  (Actor),     Robert Stevenson  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Musicals\n['Product Description', 'The movie received 13 Academy Award(R) nominations and won 5 Oscars(R) for Best Actress, Best Song, Best Music Score, Best Film Editing, and Best Special Visual Effects. It also received a special scientific award for the creation and application of Color Traveling Matte Composite Cinematography, which helped make the combination of live action and animated actors in the film possible.', 'Amazon.com', 'There is only one word that comes close to accurately describing the enchanting', 'Mary Poppins', ', and that term was coined by the movie itself: supercalifragilisticexpialidocious! Even at 2 hours and 20 minutes, Disney\\'s pioneering mixture of live action and animation (based on the books by P.L. Travers) still holds kids spellbound. Julie Andrews won an Oscar as the world\\'s most magically idealized nanny (\"practically perfect in every way,\" and complete with lighter-than-air umbrella), and Dick Van Dyke is her clownishly charming beau, Bert the chimney sweep. The songs are also terrific, ranging from bright and cheery (\"A Spoonful of Sugar\") to dark and cheery (the Oscar-winning \"Chim Chim Cher-ee\") to touchingly melancholy (\"Feed the Birds\"). Many consider', 'Mary Poppins', \"to be the crowning achievement of Walt Disney's career--and it was the only one of his features to be nominated for a best picture Academy Award until\", 'Beauty and the Beast', 'in 1991.', '--Jim Emerson', 'Stills from', 'Mary Poppins', '(Click for larger image)']\n{'Genre': 'Animation, Action & Adventure', 'Format': 'Color, Dolby, AC-3, DVD, NTSC, Dubbed, Widescreen', 'Contributor': 'Julie Andrews, Hermione Baddeley, Glynis Johns, Robert Stevenson, Dick Van Dyke, Matthew Garber, Elsa Lanchester, David Tomlinson, Karen Dotrice, Reta ShawJulie Andrews, Hermione Baddeley, Glynis Johns, Robert Stevenson, Dick Van Dyke, Matthew Garber, Elsa Lanchester, David Tomlinson, Karen Dotrice, Reta Shaw   See more', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.4 x 0.55 inches; 7.2 Ounces', 'Director': 'Robert Stevenson', 'Media Format': 'Color, Dolby, AC-3, DVD, NTSC, Dubbed, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'January 27, 2009', 'Actors': 'Julie Andrews, Dick Van Dyke, David Tomlinson, Glynis Johns, Hermione Baddeley', 'Dubbed': 'French, Spanish', 'Studio': 'Walt Disney Studios Home Entertainment', 'Number of discs': '1'}\nYou can't feel grumpy after watching this movie. There are so many classic tunes and scenes. Steppin' Time , and &#34;I love to laugh&#34; are some that just leave me feeling great . They just do not make them like this anymore.\nJoy in a box\n84 Charing Cross Road\nAnne Bancroft  (Actor),     Anthony Hopkins  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['An American writer forms an enduring relationship with a London bookseller which is carried on over 20 years and across two continents.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'PG', 'Release Date:', '23-SEP-2003', 'Media Type:', 'DVD']\n{'Genre': 'Romance', 'Format': 'Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Anne Bancroft, Judi Dench, Anthony Hopkins', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 0.8 Ounces', 'Item model number': '043396077621', 'Media Format': 'Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 21, 2002', 'Actors': 'Anne Bancroft, Anthony Hopkins, Judi Dench', 'Subtitles': 'Chinese, English, French, Korean, Portuguese, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis movie inspired me to read the book. Anne Bancroft is perfect for this role. A great role for John Hopkins too.\nGreat acting and a good movie for book lovers\nTravels With My Aunt\nGeorge Cukor  (Director),     Maggie Smith  (Actor),     Alec Mccowen  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['\"They\\'re killing him bit by bit!\" Flamboyant, flame-haired 70-plus Augusta Bertram has opened a package containing a finger that recently belonged to her years-ago lover. The victim\\'s kidnappers continue mailing expendable body parts, and Augusta enlists the aid of her stuffy nephew in a mad to-the-rescue adventure across Europe in pursuit of $100,000 in ransom money. The scramble to save a life just might also liberate the nephew\\'s life-starved soul. Based on one of Graham Greene\\'s drollest novels, directed with elan by George Cukor, and starring the magnificent Maggie Smith as Augusta and nimble Alec McCowen as bewildered nephew Henry, the joyously cockeyed Travels with My Aunt won a Best Costume Design Academy Award (out of four nominations*) and a valise full of critical praise.']\n{'Genre': 'Comedy', 'Format': 'NTSC, Original recording remastered', 'Contributor': 'Alec Mccowen, Lou Gossett Jr, George Cukor, Robert Stephens, Maggie Smith', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'D239737D', 'Director': 'George Cukor', 'Media Format': 'NTSC, Original recording remastered', 'Run time': '1 hour and 49 minutes', 'Release date': 'November 10, 2011', 'Actors': 'Maggie Smith, Alec Mccowen, Lou Gossett Jr, Robert Stephens', 'Studio': 'Warner Archive', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt was fun to see Maggie Smith in an earlier role. It does feel a bit dated, but entertained me for an evening.\nAn Intergenerational Road Trip\nKung Fu: The Legend Continues: The Complete First Season\nDavid Carradine  (Actor)    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"When we last saw Kwai Chang Caine, in Kung Fu: the Movie, he was united with the son he never knew he had in the turn-of-the-century Wild West. Now, the son of that son, also named Kwai Chang Caine (David Carradine), must emerge from seclusion to save the son he thought lost. Like his legendary namesake, this Caine is also a warrior monk, operating a Shaolin temple in Northern California. After an evil priest, Tan (Ernest Abuba), destroys the temple, Caine and his young son, Peter (Nathaniel Moreau) each believe the other has perished. The two embark on very different paths -- Caine wanders the Earth, while Peter (Chris Potter) is a cop. When fate brings the two together, they work to overcome their differing philosophies to battle Tan, and then to help the innocent and bring justice to the new Wild West -- 90s urban America. Please note the series' pilot movie is presented here in its international release version, and contains brief nudity.\"]\n{'Genre': 'Television, Television/Crime', 'Format': 'NTSC', 'Contributor': 'David Carradine', 'Language': 'English', 'Number Of Discs': '6', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': 'B00KKZ4K1A', 'Media Format': 'NTSC', 'Run time': '16 hours and 50 minutes', 'Release date': 'August 28, 2014', 'Actors': 'David Carradine', 'Studio': 'Warner Archive Collection', 'Number of discs': '6'}\nThere are some missing scenes, and I loved that show. The characters got more and more interesting with time. Sure hope the whole series gets onto DVD!\nA teasing taste,Want more.",
  "profile": "The user has a deep affection for classic, lesser-known films, particularly within the science fiction and fantasy genres, and appreciates ensemble casts that blend humor with heartwarming narratives. Their growing interest in quirky, character-driven stories reflects a desire for thoughtful explorations of complex themes, such as critiques of organized religion, while still valuing light-hearted, action-packed comedies that provide escapism. \n\nRecent interactions reveal a new fascination with narratives that explore themes of aging and perspective, emphasizing universal lessons and the influence of beliefs on perception. This ongoing quest for insightful storytelling resonates across various life stages. The user also exhibits a fondness for classic musicals featuring iconic performances, showcasing their appreciation for nostalgia and timeless storytelling. \n\nTheir latest experience with a beloved television series demonstrates a commitment to narratives that delve into the interplay of humor and heart, stressing the nuances of intergenerational relationships. The user’s cinematic tastes remain beautifully diverse, merging whimsical comedies, meaningful narratives, and the charm of historical insights, encapsulating a rich engagement with film and television that spans multiple genres and resonates with a variety of themes. They continue to seek stories that combine character depth with compelling interactions, highlighting a robust appreciation for the artistry of storytelling.",
  "metrics": {
    "rouge1_f": 0.06816337571003517,
    "rouge2_f": 0.008660351826792964,
    "rougeL_f": 0.03516364619962132,
    "meteor": 0.017749383891359428,
    "bleu1": 2.8806649877589986e-10,
    "bleu2": 1.1684322097908427e-10,
    "bleu3": 4.0898816492238714e-11,
    "bleu4": 1.145493530844345e-11,
    "bertscore_precision": 0.32162225246429443,
    "bertscore_recall": 0.5024228096008301,
    "bertscore_f1": 0.3921881318092346
  }
}