{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/09/28\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Kiviat'], 'Producers': ['Robert Kiviat', 'Antonio Bardales', \"James 'Jim' Courant\", 'Don Ecker', 'Sean Fanton', 'David Kiviat', 'Matthew Kleinman', 'David Rajter', 'Jeff Sagansky', 'Scott Silver'], 'Starring': ['Buzz Aldrin', 'Mike Bara', 'Joshua P. Warren'], 'Studio': ['Gaia']}\nReview Text: Meh. The woman is trying to explain to them that the &#34;pipe&#34; or &#34;bridge&#34; is just a lava tube or molten rock formation (The moon used to be part of the earth) but they are ignoring her. This is bad documentary film making. They are literally just speaking over her with their own interpretations. Why even bother bringing in an expert to look?\nReview Title: This is bad documentary film making\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "The After\nScience Fiction\n['A new Amazon Original Series: From Chris Carter, creator of The X-Files. Eight strangers are thrown together by mysterious forces and must help each other survive in a violent world that defies explanation. More episodes coming soon exclusively on Prime Instant Video.']\n{'Subtitles': ['None available'], 'Directors': ['Chris Carter'], 'Producers': ['Chris Carter', 'Marc Rosen', 'Gabe Rotter'], 'Starring': ['Aldis Hodge', 'Andrew Howard', 'Arielle Kebbel']}\nI really wanted to like this. But this isn't a show so much as a series of somewhat related scenes.<br /><br />A rather attractive woman gets nude after IT happens (whatever IT is)...so if that's your thing, at least there's that. To be clear...the girl skinny dips in front of strangers after IT happens because....ratings?<br /><br />I guess ratings are immaterial here. But it's just a very strange thing to shoe-horn into a show about the end of the world.<br /><br />Anyway, cliches ahoy, matey! I think we pretty much have every modern stereotype covered here, and it's all terribly boring.<br /><br />This show is like The Walking Dead with a much smaller budget, worse actors, a much smaller budget and a terrible script.<br /><br />If you do watch it, consider it a comedy going in and you might enjoy it.\nI really wanted to like this. But this isn't a show so much ...\n{'Content advisory': ['Violence', 'substance use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Christian Tureaud', 'David Salzberg'], 'Producers': ['Christian Tureaud', 'David Salzberg', 'Mike Boettcher', 'Carlos Boettcher'], 'Starring': ['Mike Boettcher', 'Carlos Boettcher'], 'Studio': ['Anderson Digital']}\nGreat film, but why was the son allowed to tag along? That seems really weird and irresponsible. It's an extra person that the soldiers have to babysit.\nGreat film, but why was the son allowed to ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': [\"Thaddeus O'Sullivan\"], 'Producers': ['Julie Payne', 'Ann Wingate', 'Frank Doelger', 'Tracey Scoffield', 'David M. Thompson'], 'Starring': ['Brendan Gleeson', 'Janet McTeer', 'Len Cariou'], 'Studio': ['HBO']}\nI prefer the first actor, but the film is still great!\nA unique view on Churchill as a person\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Beth Carpenter'], 'Studio': ['Fisher Klingenstein Films']}\nGreat show.<br /><br />The woman's defense attorney is so sleazy, lol. It's really sad.\nGreat show. The woman's defense attorney is so sleazy\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ed Bianchi', 'Daniel Minahan', 'Davis Guggenheim', 'Gregg Fienberg', 'Mark Tinker', 'Steve Shill', 'Alan Taylor', 'Michael Engler', 'Walter Hill', 'Michael Almereyda'], 'Producers': ['David Milch', 'Davis Guggenheim', 'Scott Stephens'], 'Starring': ['Timothy Olyphant', 'Ian McShane', 'Molly Parker'], 'Studio': ['HBO']}\nOne of the most dangerous places on Earth in the 1870s, without a doubt :P. A great show, if you can suspend disbelief just a tad.\nA great show, if you can suspend disbelief just a ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Donna Trapani'], 'Studio': ['Fisher Klingenstein Films']}\nGood episode.<br /><br />The husband is clearly a psychopath too. He is just as responsible for what happened. Putting them in a room together.\nGood Episode\n{'Content advisory': ['Nudity', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Parrish Smith'], 'Starring': ['---'], 'Studio': ['Unscripted']}\nGood if you're doing research for fiction or something else. Just want to point that out. Looks like this is getting hate because the producer decided to get a bit...cheeky.\nGood if you're doing research for fiction or something else\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Kiviat'], 'Producers': ['Robert Kiviat', 'Antonio Bardales', \"James 'Jim' Courant\", 'Don Ecker', 'Sean Fanton', 'David Kiviat', 'Matthew Kleinman', 'David Rajter', 'Jeff Sagansky', 'Scott Silver'], 'Starring': ['Buzz Aldrin', 'Mike Bara', 'Joshua P. Warren'], 'Studio': ['Gaia']}\nMeh. The woman is trying to explain to them that the &#34;pipe&#34; or &#34;bridge&#34; is just a lava tube or molten rock formation (The moon used to be part of the earth) but they are ignoring her. This is bad documentary film making. They are literally just speaking over her with their own interpretations. Why even bother bringing in an expert to look?\nThis is bad documentary film making",
  "profile": "**Updated User Summary:**\n\nThe user maintains a strong preference for Science Fiction while valuing nuanced storytelling across various genres, including historical narratives. Their recent review emphasizes an appreciation for character-driven plots and emotional depth, as they engage thoughtfully with historical themes. This critical approach underscores the significance of expert voices in narratives, as seen in their latest interaction regarding a documentary that they found lacking in effective storytelling. \n\nIn this instance, the user expressed disappointment with poorly executed documentary filmmaking, highlighting their expectation for clarity and respect toward knowledgeable contributors. Their frustration at the disregard for an expert's commentary reflects a commitment to depth and authenticity in narratives, reinforcing their high standards for storytelling quality.\n\nAdditionally, the user enjoys multifaceted characters and the interplay of humor in critiques, demonstrating a discerning taste for originality and coherence. Their thoughtful evaluation process reveals a pattern of acknowledging both strengths and weaknesses while appreciating diverse interpretations. This recent interaction further emphasizes their intent to engage with complex narratives and the essential role of expert insight in shaping discourse.\n\nIn summary, the user exemplifies a discerning approach to storytelling, favoring depth, coherence, and humor across genres, and they possess a keen interest in character dynamics and emotional resonance, while holding creators accountable for their narrative choices.",
  "metrics": {
    "rouge1_f": 0.13347921225382933,
    "rouge2_f": 0.0043859649122807015,
    "rougeL_f": 0.0700218818380744,
    "meteor": 0.0465573002465994,
    "bleu1": 0.0064703205029657904,
    "bleu2": 0.001620946581257494,
    "bleu3": 0.000277756427707901,
    "bleu4": 0.00011509781033631954,
    "bertscore_precision": 0.32488515973091125,
    "bertscore_recall": 0.4411618709564209,
    "bertscore_f1": 0.3741988241672516
  }
}