{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/10/01\nAverage Rating: 3.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Andrea Yates'], 'Studio': ['Fisher Klingenstein Films']}\nReview Text: Tough one. She was acquitted in 2007 by reason of insanity. That should have been the first verdict. She was clearly quite insane Personally, I think the husband is more to blame than she is. He was an enabler. That female prosecutor clearly has no experience with mental illness.\nReview Title: Good episode, tragic case.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The After\nScience Fiction\n['A new Amazon Original Series: From Chris Carter, creator of The X-Files. Eight strangers are thrown together by mysterious forces and must help each other survive in a violent world that defies explanation. More episodes coming soon exclusively on Prime Instant Video.']\n{'Subtitles': ['None available'], 'Directors': ['Chris Carter'], 'Producers': ['Chris Carter', 'Marc Rosen', 'Gabe Rotter'], 'Starring': ['Aldis Hodge', 'Andrew Howard', 'Arielle Kebbel']}\nI really wanted to like this. But this isn't a show so much as a series of somewhat related scenes.<br /><br />A rather attractive woman gets nude after IT happens (whatever IT is)...so if that's your thing, at least there's that. To be clear...the girl skinny dips in front of strangers after IT happens because....ratings?<br /><br />I guess ratings are immaterial here. But it's just a very strange thing to shoe-horn into a show about the end of the world.<br /><br />Anyway, cliches ahoy, matey! I think we pretty much have every modern stereotype covered here, and it's all terribly boring.<br /><br />This show is like The Walking Dead with a much smaller budget, worse actors, a much smaller budget and a terrible script.<br /><br />If you do watch it, consider it a comedy going in and you might enjoy it.\nI really wanted to like this. But this isn't a show so much ...\n{'Content advisory': ['Violence', 'substance use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Christian Tureaud', 'David Salzberg'], 'Producers': ['Christian Tureaud', 'David Salzberg', 'Mike Boettcher', 'Carlos Boettcher'], 'Starring': ['Mike Boettcher', 'Carlos Boettcher'], 'Studio': ['Anderson Digital']}\nGreat film, but why was the son allowed to tag along? That seems really weird and irresponsible. It's an extra person that the soldiers have to babysit.\nGreat film, but why was the son allowed to ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': [\"Thaddeus O'Sullivan\"], 'Producers': ['Julie Payne', 'Ann Wingate', 'Frank Doelger', 'Tracey Scoffield', 'David M. Thompson'], 'Starring': ['Brendan Gleeson', 'Janet McTeer', 'Len Cariou'], 'Studio': ['HBO']}\nI prefer the first actor, but the film is still great!\nA unique view on Churchill as a person\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Beth Carpenter'], 'Studio': ['Fisher Klingenstein Films']}\nGreat show.<br /><br />The woman's defense attorney is so sleazy, lol. It's really sad.\nGreat show. The woman's defense attorney is so sleazy\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ed Bianchi', 'Daniel Minahan', 'Davis Guggenheim', 'Gregg Fienberg', 'Mark Tinker', 'Steve Shill', 'Alan Taylor', 'Michael Engler', 'Walter Hill', 'Michael Almereyda'], 'Producers': ['David Milch', 'Davis Guggenheim', 'Scott Stephens'], 'Starring': ['Timothy Olyphant', 'Ian McShane', 'Molly Parker'], 'Studio': ['HBO']}\nOne of the most dangerous places on Earth in the 1870s, without a doubt :P. A great show, if you can suspend disbelief just a tad.\nA great show, if you can suspend disbelief just a ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Donna Trapani'], 'Studio': ['Fisher Klingenstein Films']}\nGood episode.<br /><br />The husband is clearly a psychopath too. He is just as responsible for what happened. Putting them in a room together.\nGood Episode\n{'Content advisory': ['Nudity', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Parrish Smith'], 'Starring': ['---'], 'Studio': ['Unscripted']}\nGood if you're doing research for fiction or something else. Just want to point that out. Looks like this is getting hate because the producer decided to get a bit...cheeky.\nGood if you're doing research for fiction or something else\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Kiviat'], 'Producers': ['Robert Kiviat', 'Antonio Bardales', \"James 'Jim' Courant\", 'Don Ecker', 'Sean Fanton', 'David Kiviat', 'Matthew Kleinman', 'David Rajter', 'Jeff Sagansky', 'Scott Silver'], 'Starring': ['Buzz Aldrin', 'Mike Bara', 'Joshua P. Warren'], 'Studio': ['Gaia']}\nMeh. The woman is trying to explain to them that the &#34;pipe&#34; or &#34;bridge&#34; is just a lava tube or molten rock formation (The moon used to be part of the earth) but they are ignoring her. This is bad documentary film making. They are literally just speaking over her with their own interpretations. Why even bother bringing in an expert to look?\nThis is bad documentary film making\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Andrea Yates'], 'Studio': ['Fisher Klingenstein Films']}\nTough one. She was acquitted in 2007 by reason of insanity. That should have been the first verdict. She was clearly quite insane Personally, I think the husband is more to blame than she is. He was an enabler. That female prosecutor clearly has no experience with mental illness.\nGood episode, tragic case.",
  "profile": "**Updated User Summary:**\n\nThe user continues to hold a strong preference for Science Fiction while also valuing nuanced storytelling across various genres, including historical narratives. Recent interactions reflect their appreciation for character-driven plots and emotional depth, particularly when engaging with complex themes. Their thoughtful critique of a documentary they found lacking underscores their expectation for clarity and respect towards knowledgeable contributors, reinforcing their commitment to authenticity in narratives.\n\nThe new review reveals the user’s ability to analyze sensitive subjects, focusing on psychological aspects and moral implications in storytelling. They express a nuanced perspective, attributing responsibility in a tragic case to multiple parties, demonstrating their tendency to consider varied interpretations of events and characters. This aligns with their previous emphasis on multifaceted characters and emotional resonance.\n\nMoreover, the user appreciates humor in critiques while maintaining high standards for storytelling quality, emphasizing coherence and depth. Their thoughtful evaluation process showcases a pattern of recognizing both strengths and weaknesses of narratives, highlighting their discerning taste and engagement with complex materials.\n\nIn summary, the user exemplifies a sophisticated approach to storytelling, favoring emotional depth, coherence, and originality across genres, while continuing to call for accountability in creators' narrative choices.",
  "metrics": {
    "rouge1_f": 0.11995863495346432,
    "rouge2_f": 0.008290155440414509,
    "rougeL_f": 0.05997931747673216,
    "meteor": 0.04017408638470646,
    "bleu1": 0.002915273832973337,
    "bleu2": 0.0009417636983410837,
    "bleu3": 0.00015019114008360657,
    "bleu4": 6.0045613551192645e-05,
    "bertscore_precision": 0.3194589912891388,
    "bertscore_recall": 0.4355824589729309,
    "bertscore_f1": 0.36859098076820374
  }
}