{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/10/03\nAverage Rating: 3.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['David Koresh'], 'Studio': ['Fisher Klingenstein Films']}\nReview Text: Tough one. The government overreacted, but those people were definitely brainwashed, and it was hardly fair to the kids. Good documentary.\nReview Title: Good documentary.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The After\nScience Fiction\n['A new Amazon Original Series: From Chris Carter, creator of The X-Files. Eight strangers are thrown together by mysterious forces and must help each other survive in a violent world that defies explanation. More episodes coming soon exclusively on Prime Instant Video.']\n{'Subtitles': ['None available'], 'Directors': ['Chris Carter'], 'Producers': ['Chris Carter', 'Marc Rosen', 'Gabe Rotter'], 'Starring': ['Aldis Hodge', 'Andrew Howard', 'Arielle Kebbel']}\nI really wanted to like this. But this isn't a show so much as a series of somewhat related scenes.<br /><br />A rather attractive woman gets nude after IT happens (whatever IT is)...so if that's your thing, at least there's that. To be clear...the girl skinny dips in front of strangers after IT happens because....ratings?<br /><br />I guess ratings are immaterial here. But it's just a very strange thing to shoe-horn into a show about the end of the world.<br /><br />Anyway, cliches ahoy, matey! I think we pretty much have every modern stereotype covered here, and it's all terribly boring.<br /><br />This show is like The Walking Dead with a much smaller budget, worse actors, a much smaller budget and a terrible script.<br /><br />If you do watch it, consider it a comedy going in and you might enjoy it.\nI really wanted to like this. But this isn't a show so much ...\n{'Content advisory': ['Violence', 'substance use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Christian Tureaud', 'David Salzberg'], 'Producers': ['Christian Tureaud', 'David Salzberg', 'Mike Boettcher', 'Carlos Boettcher'], 'Starring': ['Mike Boettcher', 'Carlos Boettcher'], 'Studio': ['Anderson Digital']}\nGreat film, but why was the son allowed to tag along? That seems really weird and irresponsible. It's an extra person that the soldiers have to babysit.\nGreat film, but why was the son allowed to ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': [\"Thaddeus O'Sullivan\"], 'Producers': ['Julie Payne', 'Ann Wingate', 'Frank Doelger', 'Tracey Scoffield', 'David M. Thompson'], 'Starring': ['Brendan Gleeson', 'Janet McTeer', 'Len Cariou'], 'Studio': ['HBO']}\nI prefer the first actor, but the film is still great!\nA unique view on Churchill as a person\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Beth Carpenter'], 'Studio': ['Fisher Klingenstein Films']}\nGreat show.<br /><br />The woman's defense attorney is so sleazy, lol. It's really sad.\nGreat show. The woman's defense attorney is so sleazy\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ed Bianchi', 'Daniel Minahan', 'Davis Guggenheim', 'Gregg Fienberg', 'Mark Tinker', 'Steve Shill', 'Alan Taylor', 'Michael Engler', 'Walter Hill', 'Michael Almereyda'], 'Producers': ['David Milch', 'Davis Guggenheim', 'Scott Stephens'], 'Starring': ['Timothy Olyphant', 'Ian McShane', 'Molly Parker'], 'Studio': ['HBO']}\nOne of the most dangerous places on Earth in the 1870s, without a doubt :P. A great show, if you can suspend disbelief just a tad.\nA great show, if you can suspend disbelief just a ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Donna Trapani'], 'Studio': ['Fisher Klingenstein Films']}\nGood episode.<br /><br />The husband is clearly a psychopath too. He is just as responsible for what happened. Putting them in a room together.\nGood Episode\n{'Content advisory': ['Nudity', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Parrish Smith'], 'Starring': ['---'], 'Studio': ['Unscripted']}\nGood if you're doing research for fiction or something else. Just want to point that out. Looks like this is getting hate because the producer decided to get a bit...cheeky.\nGood if you're doing research for fiction or something else\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Kiviat'], 'Producers': ['Robert Kiviat', 'Antonio Bardales', \"James 'Jim' Courant\", 'Don Ecker', 'Sean Fanton', 'David Kiviat', 'Matthew Kleinman', 'David Rajter', 'Jeff Sagansky', 'Scott Silver'], 'Starring': ['Buzz Aldrin', 'Mike Bara', 'Joshua P. Warren'], 'Studio': ['Gaia']}\nMeh. The woman is trying to explain to them that the &#34;pipe&#34; or &#34;bridge&#34; is just a lava tube or molten rock formation (The moon used to be part of the earth) but they are ignoring her. This is bad documentary film making. They are literally just speaking over her with their own interpretations. Why even bother bringing in an expert to look?\nThis is bad documentary film making\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Andrea Yates'], 'Studio': ['Fisher Klingenstein Films']}\nTough one. She was acquitted in 2007 by reason of insanity. That should have been the first verdict. She was clearly quite insane Personally, I think the husband is more to blame than she is. He was an enabler. That female prosecutor clearly has no experience with mental illness.\nGood episode, tragic case.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['David Koresh'], 'Studio': ['Fisher Klingenstein Films']}\nTough one. The government overreacted, but those people were definitely brainwashed, and it was hardly fair to the kids. Good documentary.\nGood documentary.",
  "profile": "**Updated User Summary:**\n\nThe user maintains a strong preference for Science Fiction while also valuing nuanced storytelling across various genres, including historical narratives. They continue to appreciate character-driven plots and emotional depth, particularly in complex themes. Their latest review reflects this, where they analyze a sensitive documentary, attributing responsibility for a tragic situation to multiple parties, demonstrating their ability to navigate varied interpretations and advocate for accountability in narratives.\n\nTheir thoughtful critique illustrates a discerning taste for authenticity, coherence, and depth in storytelling, while also recognizing the multifaceted nature of events and characters. The user expresses a balanced perspective, acknowledging both the government’s overreach and the troubling influence of brainwashing, which showcases their engagement with psychological and moral implications in narratives.\n\nAdditionally, they appreciate humor in critiques while holding high standards for storytelling quality. Their evaluation process consistently highlights the strengths and weaknesses of narratives, reinforcing their sophisticated approach to storytelling. Overall, the user exemplifies a commitment to emotional resonance and originality, while continuing to expect clarity and respect from creators regarding their narrative choices.",
  "metrics": {
    "rouge1_f": 0.10942249240121582,
    "rouge2_f": 0.006091370558375634,
    "rougeL_f": 0.06686930091185411,
    "meteor": 0.033246259795772976,
    "bleu1": 0.0010709249175898542,
    "bleu2": 0.0002566297872889593,
    "bleu3": 4.668578186453991e-05,
    "bleu4": 1.9937112099587583e-05,
    "bertscore_precision": 0.3142964541912079,
    "bertscore_recall": 0.44157591462135315,
    "bertscore_f1": 0.36722007393836975
  }
}