{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/07/08\nAverage Rating: 4.3\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vanessa Caswill', 'China Moo-Young'], 'Producers': ['Hugh Warren', 'Elizabeth Kilgarriff'], 'Starring': ['Jodie Comer', 'Natasha Little', 'Stuart Graham'], 'Studio': ['BBC America']}\nReview Text: I can give it 4 stars because I got it for free with my Prime membership. It's entertaining, but some things about the way the police interact with her are unrealistic.\nReview Title: Worth a watch if you have Prime\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The After\nScience Fiction\n['A new Amazon Original Series: From Chris Carter, creator of The X-Files. Eight strangers are thrown together by mysterious forces and must help each other survive in a violent world that defies explanation. More episodes coming soon exclusively on Prime Instant Video.']\n{'Subtitles': ['None available'], 'Directors': ['Chris Carter'], 'Producers': ['Chris Carter', 'Marc Rosen', 'Gabe Rotter'], 'Starring': ['Aldis Hodge', 'Andrew Howard', 'Arielle Kebbel']}\nI really wanted to like this. But this isn't a show so much as a series of somewhat related scenes.<br /><br />A rather attractive woman gets nude after IT happens (whatever IT is)...so if that's your thing, at least there's that. To be clear...the girl skinny dips in front of strangers after IT happens because....ratings?<br /><br />I guess ratings are immaterial here. But it's just a very strange thing to shoe-horn into a show about the end of the world.<br /><br />Anyway, cliches ahoy, matey! I think we pretty much have every modern stereotype covered here, and it's all terribly boring.<br /><br />This show is like The Walking Dead with a much smaller budget, worse actors, a much smaller budget and a terrible script.<br /><br />If you do watch it, consider it a comedy going in and you might enjoy it.\nI really wanted to like this. But this isn't a show so much ...\n{'Content advisory': ['Violence', 'substance use', 'smoking', 'foul language'], 'Subtitles': ['None available'], 'Directors': ['Christian Tureaud', 'David Salzberg'], 'Producers': ['Christian Tureaud', 'David Salzberg', 'Mike Boettcher', 'Carlos Boettcher'], 'Starring': ['Mike Boettcher', 'Carlos Boettcher'], 'Studio': ['Anderson Digital']}\nGreat film, but why was the son allowed to tag along? That seems really weird and irresponsible. It's an extra person that the soldiers have to babysit.\nGreat film, but why was the son allowed to ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': [\"Thaddeus O'Sullivan\"], 'Producers': ['Julie Payne', 'Ann Wingate', 'Frank Doelger', 'Tracey Scoffield', 'David M. Thompson'], 'Starring': ['Brendan Gleeson', 'Janet McTeer', 'Len Cariou'], 'Studio': ['HBO']}\nI prefer the first actor, but the film is still great!\nA unique view on Churchill as a person\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Beth Carpenter'], 'Studio': ['Fisher Klingenstein Films']}\nGreat show.<br /><br />The woman's defense attorney is so sleazy, lol. It's really sad.\nGreat show. The woman's defense attorney is so sleazy\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ed Bianchi', 'Daniel Minahan', 'Davis Guggenheim', 'Gregg Fienberg', 'Mark Tinker', 'Steve Shill', 'Alan Taylor', 'Michael Engler', 'Walter Hill', 'Michael Almereyda'], 'Producers': ['David Milch', 'Davis Guggenheim', 'Scott Stephens'], 'Starring': ['Timothy Olyphant', 'Ian McShane', 'Molly Parker'], 'Studio': ['HBO']}\nOne of the most dangerous places on Earth in the 1870s, without a doubt :P. A great show, if you can suspend disbelief just a tad.\nA great show, if you can suspend disbelief just a ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Donna Trapani'], 'Studio': ['Fisher Klingenstein Films']}\nGood episode.<br /><br />The husband is clearly a psychopath too. He is just as responsible for what happened. Putting them in a room together.\nGood Episode\n{'Content advisory': ['Nudity', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Parrish Smith'], 'Starring': ['---'], 'Studio': ['Unscripted']}\nGood if you're doing research for fiction or something else. Just want to point that out. Looks like this is getting hate because the producer decided to get a bit...cheeky.\nGood if you're doing research for fiction or something else\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Kiviat'], 'Producers': ['Robert Kiviat', 'Antonio Bardales', \"James 'Jim' Courant\", 'Don Ecker', 'Sean Fanton', 'David Kiviat', 'Matthew Kleinman', 'David Rajter', 'Jeff Sagansky', 'Scott Silver'], 'Starring': ['Buzz Aldrin', 'Mike Bara', 'Joshua P. Warren'], 'Studio': ['Gaia']}\nMeh. The woman is trying to explain to them that the &#34;pipe&#34; or &#34;bridge&#34; is just a lava tube or molten rock formation (The moon used to be part of the earth) but they are ignoring her. This is bad documentary film making. They are literally just speaking over her with their own interpretations. Why even bother bringing in an expert to look?\nThis is bad documentary film making\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['Andrea Yates'], 'Studio': ['Fisher Klingenstein Films']}\nTough one. She was acquitted in 2007 by reason of insanity. That should have been the first verdict. She was clearly quite insane Personally, I think the husband is more to blame than she is. He was an enabler. That female prosecutor clearly has no experience with mental illness.\nGood episode, tragic case.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ellen Goosenberg Kent'], 'Starring': ['David Koresh'], 'Studio': ['Fisher Klingenstein Films']}\nTough one. The government overreacted, but those people were definitely brainwashed, and it was hardly fair to the kids. Good documentary.\nGood documentary.\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Minn'], 'Producers': ['Charlie Minn'], 'Starring': ['Robert Caldwell', 'John Hook'], 'Studio': ['Unscripted']}\nPretty good overview of the case. Worth watching, though I deducted one star for including the 'psychic' toward the end.\nWorth a watch\n{'Subtitles': ['None available'], 'Directors': ['Lyn Goldfarb', 'Margaret Koval'], 'Producers': ['PBS'], 'Studio': ['PBS']}\nTook several points off because they mention Jesus as if he were a historical person when there is no evidence of this being the case.\nTook several points off because they mention Jesus as if ...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Vanessa Caswill', 'China Moo-Young'], 'Producers': ['Hugh Warren', 'Elizabeth Kilgarriff'], 'Starring': ['Jodie Comer', 'Natasha Little', 'Stuart Graham'], 'Studio': ['BBC America']}\nI can give it 4 stars because I got it for free with my Prime membership. It's entertaining, but some things about the way the police interact with her are unrealistic.\nWorth a watch if you have Prime",
  "profile": "**Updated User Summary:**\n\nThe user remains firmly inclined toward Science Fiction while also valuing nuanced storytelling across various genres, including historical narratives. Their discerning taste for character-driven plots and emotional complexity continues to shine through, particularly in their critiques which highlight the importance of authenticity and historical integrity.\n\nIn their recent review, the user rated a free streaming title positively but noted unrealistic portrayals of police interactions, demonstrating their commitment to realism in storytelling, even when enjoying lighter content. This interaction reflects their balance of enjoyment and critical insight, maintaining high standards regardless of the medium or genre.\n\nTheir reviews consistently blend humor with analytical rigor, advocating for coherent narratives that resonate emotionally. The user thoughtfully navigates differing interpretations and emphasizes accountability from creators, while remaining open to diverse narrative techniques. Their critiques underscore a careful examination of strengths and weaknesses, particularly when addressing sensational aspects.\n\nOverall, the user exemplifies a dedication to originality, clarity, and a respectful engagement with the moral implications of storytelling. Their latest interaction illustrates a meticulous approach to critique, reinforcing their ongoing investment in responsible narratives that prioritize realism and depth, whether in serious or entertaining contexts.",
  "metrics": {
    "rouge1_f": 0.11054421768707483,
    "rouge2_f": 0.006814310051107325,
    "rougeL_f": 0.05612244897959184,
    "meteor": 0.03216054544285071,
    "bleu1": 0.0004404042996983985,
    "bleu2": 0.00011940143116783062,
    "bleu3": 1.9770044641753492e-05,
    "bleu4": 8.053893801682012e-06,
    "bertscore_precision": 0.3041723966598511,
    "bertscore_recall": 0.432753324508667,
    "bertscore_f1": 0.3572452664375305
  }
}