{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/10/15\nAverage Rating: 2.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Mina Đukić'], 'Producers': ['Mina Đukić', 'Nikola Lezaic'], 'Starring': ['Hana Selimovic', 'Mladen Sovilj', 'Mina Subota'], 'Studio': ['Visit Films']}\nReview Text: Some funny and some touching scenes spread out within a generally slow but interesting story. Then either my cultural differences or murky writing leads to another ( at least for me) huh? ending. Worth the watch if nothing else to do.\nReview Title: OK until the what? ending.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Fury [Blu-ray]\nBrad Pitt  (Actor),     Shia LaBeouf  (Actor),     David Ayer  (Director, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['April, 1945. As the Allies make their final push in the European Theatre, a battle-hardened army sergeant named Wardaddy (Brad Pitt) commands a Sherman tank and her five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, and with a rookie soldier thrust into their platoon, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.']\n{'Digital Copy Expiration Date': 'December 31, 2018', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '31571277', 'Director': 'David Ayer', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 27, 2015', 'Actors': 'Brad Pitt, Shia LaBeouf, Logan Lerman, Michael Peña', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'David Ayer', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWell acted, grim WWII action. Good job pointing out the inferiority of American armor and number of crews lost in the war, Rather orchestrated ending, but contains a nice surprise.\nGrim but well done.\nGirls' Generation (SNSD) - Girls' Generation -Love & Peace- Japan 3Rd Tour [Japan BD] UPXH-20030\nFormat: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '11.81 x 3.94 x 7.87 inches; 2.82 Ounces', 'Number of discs': '1'}\nI think this is consistently rated best of their videos by most fans. I rate it number one for best with original lineup. A close second is current 8 member lineup of the &#34;Tokyo Dome-The Best&#34; video.\nI think this is consistently rated best of their videos by most fans\nSalt (Deluxe Unrated Edition) [Blu-ray]\nAngelina Jolie  (Actor),     Liev Schreiber  (Actor),     Philip Noyce  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Angelina Jolie stars in Columbia Pictures'\", 'Salt', ', a contemporary espionage thriller. Before becoming a CIA officer, Evelyn Salt (Jolie) swore an oath to duty, honor, and country. She will prove loyal to these when a defector accuses her of being a Russian sleeper spy. Salt goes on the run, using all her skills and years of experience as a covert operative to elude capture, protect her husband, and stay one step ahead of her colleagues at the CIA.', 'Amazon.com', 'Angelina Jolie confirms her status as action-heroine supreme in the sinewy thriller', 'Salt', \". Evelyn Salt (Jolie) is a respected high-ranking CIA agent… until a defecting Russian operative declares that she's a Russian mole in deep cover, launching her on the most delicious chase sequence since the\", 'Bourne', \"movies. When the film's over you'll realize the motivations for much of what happened didn't make much sense, but while the movie's going on the pell-mell pace will brush such concerns from your mind. Director Phillip Noyce (\", 'Patriot Games', ',', 'Dead Calm', \") has a gift for staging action sequences you can actually follow moment to moment, which is infinitely more engaging than frenzied editing that blurs everything into cattle-prod jolts--the movie's first third is top-notch orchestration. Jolie's star magnetism provides the cool, calm axis around which everything else revolves; the sturdy supporting performances of Liev Schreiber (\", 'The Manchurian Candidate', ') and Chiwetel Ejiofor (', 'Inside Man', ',', 'Dirty Pretty Things', ') give enough heft to the plot to keep you from questioning anything.', 'Salt', 'is an old-fashioned entertainment, a skillfully made mechanism with enough grace notes to let it breathe and catch you by surprise.', '--Bret Fetzer']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Angelina Jolie, Liev Schreiber, Philip Noyce', 'Language': 'English, French, Spanish', 'Runtime': '5 hours and 5 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': 'Salt Blu Ray', 'Director': 'Philip Noyce', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 5 minutes', 'Release date': 'September 6, 2011', 'Actors': 'Angelina Jolie, Liev Schreiber', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures', 'Number of discs': '1'}\nMs Jolie kicks ass in a relatively coherent and interesting script.\nFour Stars\n{'Subtitles': ['None available'], 'Directors': ['Mina Đukić'], 'Producers': ['Mina Đukić', 'Nikola Lezaic'], 'Starring': ['Hana Selimovic', 'Mladen Sovilj', 'Mina Subota'], 'Studio': ['Visit Films']}\nSome funny and some touching scenes spread out within a generally slow but interesting story. Then either my cultural differences or murky writing leads to another ( at least for me) huh? ending. Worth the watch if nothing else to do.\nOK until the what? ending.",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** Primarily focused on movies, especially in the Action & Adventure genre, with a notable interest in historical war films, particularly those set in World War II. The user also enjoys music performances from popular K-pop groups and has shown an interest in diverse storytelling, including slightly offbeat narratives. \n- **Key Preferences:** Values high-quality storytelling and acting, gravitating towards well-crafted narratives that reflect the realities of conflict. They have demonstrated an appreciation for both impactful films and performances in various media formats.\n- **Rating Trends:** Shows a consistent pattern of high ratings for films and performances with emotional depth, but has also rated a film with moderate appreciation for its humor and emotional moments, despite a confusing conclusion. This indicates openness to experimenting with different narratives, even those that may not fully resonate.\n- **Director & Actor Appreciation:** Favors acclaimed directors and actors, particularly in war dramas, while remaining receptive to strong performances and unique storytelling in other genres.\n- **Content Preference:** Enjoys realistic portrayals of history and culture, highlighting character development and emotional impact. The recent interaction suggests a willingness to engage with films that offer humor despite uneven writing.\n- **Media Format:** Prefers physical formats like Blu-ray for a high-definition viewing experience, including both movies and live performances, maintaining an emphasis on coherent storytelling wrapped in engaging narratives. \n\nThe user's evolving interests reflect a broader entertainment scope while upholding a dedication to impactful and creative storytelling.",
  "metrics": {
    "rouge1_f": 0.18028169014084508,
    "rouge2_f": 0.011288805268109126,
    "rougeL_f": 0.08075117370892018,
    "meteor": 0.06382788787716479,
    "bleu1": 0.016980265074339466,
    "bleu2": 0.004105058223259535,
    "bleu3": 0.0014088800043937897,
    "bleu4": 0.00046452881396195607,
    "bertscore_precision": 0.36189016699790955,
    "bertscore_recall": 0.4611440896987915,
    "bertscore_f1": 0.4055323600769043
  }
}