{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/10/16\nAverage Rating: 2.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Jag Mundhra'], 'Producers': ['Jag Mundhra', 'Kalpana Saxena', 'Vivek Singhania'], 'Starring': ['Richard Tyson'], 'Studio': ['AMBI Distribution']}\nReview Text: It had everything going for it, hunky American who couldn't act, blonde girlfriend , and Asian temptress, all set in India. But as Mr. Cortez says elsewhere, the movie doesn't live up to it's title. Skip this one.\nReview Title: Don't waste your time\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Fury [Blu-ray]\nBrad Pitt  (Actor),     Shia LaBeouf  (Actor),     David Ayer  (Director, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['April, 1945. As the Allies make their final push in the European Theatre, a battle-hardened army sergeant named Wardaddy (Brad Pitt) commands a Sherman tank and her five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, and with a rookie soldier thrust into their platoon, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.']\n{'Digital Copy Expiration Date': 'December 31, 2018', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '31571277', 'Director': 'David Ayer', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 27, 2015', 'Actors': 'Brad Pitt, Shia LaBeouf, Logan Lerman, Michael Peña', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'David Ayer', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWell acted, grim WWII action. Good job pointing out the inferiority of American armor and number of crews lost in the war, Rather orchestrated ending, but contains a nice surprise.\nGrim but well done.\nGirls' Generation (SNSD) - Girls' Generation -Love & Peace- Japan 3Rd Tour [Japan BD] UPXH-20030\nFormat: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '11.81 x 3.94 x 7.87 inches; 2.82 Ounces', 'Number of discs': '1'}\nI think this is consistently rated best of their videos by most fans. I rate it number one for best with original lineup. A close second is current 8 member lineup of the &#34;Tokyo Dome-The Best&#34; video.\nI think this is consistently rated best of their videos by most fans\nSalt (Deluxe Unrated Edition) [Blu-ray]\nAngelina Jolie  (Actor),     Liev Schreiber  (Actor),     Philip Noyce  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Angelina Jolie stars in Columbia Pictures'\", 'Salt', ', a contemporary espionage thriller. Before becoming a CIA officer, Evelyn Salt (Jolie) swore an oath to duty, honor, and country. She will prove loyal to these when a defector accuses her of being a Russian sleeper spy. Salt goes on the run, using all her skills and years of experience as a covert operative to elude capture, protect her husband, and stay one step ahead of her colleagues at the CIA.', 'Amazon.com', 'Angelina Jolie confirms her status as action-heroine supreme in the sinewy thriller', 'Salt', \". Evelyn Salt (Jolie) is a respected high-ranking CIA agent… until a defecting Russian operative declares that she's a Russian mole in deep cover, launching her on the most delicious chase sequence since the\", 'Bourne', \"movies. When the film's over you'll realize the motivations for much of what happened didn't make much sense, but while the movie's going on the pell-mell pace will brush such concerns from your mind. Director Phillip Noyce (\", 'Patriot Games', ',', 'Dead Calm', \") has a gift for staging action sequences you can actually follow moment to moment, which is infinitely more engaging than frenzied editing that blurs everything into cattle-prod jolts--the movie's first third is top-notch orchestration. Jolie's star magnetism provides the cool, calm axis around which everything else revolves; the sturdy supporting performances of Liev Schreiber (\", 'The Manchurian Candidate', ') and Chiwetel Ejiofor (', 'Inside Man', ',', 'Dirty Pretty Things', ') give enough heft to the plot to keep you from questioning anything.', 'Salt', 'is an old-fashioned entertainment, a skillfully made mechanism with enough grace notes to let it breathe and catch you by surprise.', '--Bret Fetzer']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Angelina Jolie, Liev Schreiber, Philip Noyce', 'Language': 'English, French, Spanish', 'Runtime': '5 hours and 5 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': 'Salt Blu Ray', 'Director': 'Philip Noyce', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 5 minutes', 'Release date': 'September 6, 2011', 'Actors': 'Angelina Jolie, Liev Schreiber', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures', 'Number of discs': '1'}\nMs Jolie kicks ass in a relatively coherent and interesting script.\nFour Stars\n{'Subtitles': ['None available'], 'Directors': ['Mina Đukić'], 'Producers': ['Mina Đukić', 'Nikola Lezaic'], 'Starring': ['Hana Selimovic', 'Mladen Sovilj', 'Mina Subota'], 'Studio': ['Visit Films']}\nSome funny and some touching scenes spread out within a generally slow but interesting story. Then either my cultural differences or murky writing leads to another ( at least for me) huh? ending. Worth the watch if nothing else to do.\nOK until the what? ending.\n{'Subtitles': ['None available'], 'Directors': ['Jag Mundhra'], 'Producers': ['Jag Mundhra', 'Kalpana Saxena', 'Vivek Singhania'], 'Starring': ['Richard Tyson'], 'Studio': ['AMBI Distribution']}\nIt had everything going for it, hunky American who couldn't act, blonde girlfriend , and Asian temptress, all set in India. But as Mr. Cortez says elsewhere, the movie doesn't live up to it's title. Skip this one.\nDon't waste your time",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user remains focused on movies, particularly in the Action & Adventure genre and historical war films, especially those about World War II. Additionally, there is a continued enjoyment of K-pop music performances and diverse, slightly offbeat storytelling.\n- **Key Preferences:** They prioritize high-quality storytelling and acting, seeking well-crafted narratives that reflect the realities of conflict. The user appreciates impactful films and performances across various media formats, but recent interactions indicate a more critical stance towards films that fail to deliver on their promises.\n- **Rating Trends:** While previously open to experimenting with different narratives, recent ratings reflect a more discerning taste, particularly for films lacking coherence or depth. They recently rated a film poorly due to shallow character development and ineffective storytelling, suggesting a desire for quality over mere entertainment value.\n- **Director & Actor Appreciation:** With a preference for acclaimed directors and actors, especially in war dramas, the user remains receptive to strong performances and unique storytelling in other genres but expects higher standards.\n- **Content Preference:** The user favors realistic portrayals of history and culture that emphasize character development and emotional impact while showing a declining tolerance for poorly executed narratives.\n- **Media Format:** They continue to prefer high-definition physical formats like Blu-ray for movies and live performances, underscoring their emphasis on coherent and engaging storytelling.\n\nThe user's preferences are evolving towards a more critical approach, reflecting a commitment to impactful and meaningful narratives.",
  "metrics": {
    "rouge1_f": 0.17537643932683789,
    "rouge2_f": 0.014196983141082519,
    "rougeL_f": 0.07617360496014171,
    "meteor": 0.05795790858270306,
    "bleu1": 0.012254812113822875,
    "bleu2": 0.0033564484814716422,
    "bleu3": 0.0010910789563330385,
    "bleu4": 0.00035011183625900454,
    "bertscore_precision": 0.35770338773727417,
    "bertscore_recall": 0.459783136844635,
    "bertscore_f1": 0.402369886636734
  }
}