{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/11/17\nAverage Rating: 2.9\nProduct Details: {'Audio languages': ['Français'], 'Subtitles': ['English [CC]'], 'Directors': ['Mathilde Elu'], 'Starring': ['Agnès Hurstel', 'Isabelle Joly'], 'Studio': ['Films Grand Huit']}\nReview Text: Short film about an actress getting a laser hair removal treatment. The actress apparently has a rather full pubic b**h and the attendant wants to remove it all. Film seems to be mostly in favor of the actress's desire to keep it. Humorous and entertaining. English subs were also quite good.\nReview Title: Interesting dilemma for modern women.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Fury [Blu-ray]\nBrad Pitt  (Actor),     Shia LaBeouf  (Actor),     David Ayer  (Director, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['April, 1945. As the Allies make their final push in the European Theatre, a battle-hardened army sergeant named Wardaddy (Brad Pitt) commands a Sherman tank and her five-man crew on a deadly mission behind enemy lines. Outnumbered and outgunned, and with a rookie soldier thrust into their platoon, Wardaddy and his men face overwhelming odds in their heroic attempts to strike at the heart of Nazi Germany.']\n{'Digital Copy Expiration Date': 'December 31, 2018', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '31571277', 'Director': 'David Ayer', 'Media Format': 'Blu-ray', 'Run time': '2 hours and 14 minutes', 'Release date': 'January 27, 2015', 'Actors': 'Brad Pitt, Shia LaBeouf, Logan Lerman, Michael Peña', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': 'Sony Pictures Home Entertainment', 'Writers': 'David Ayer', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWell acted, grim WWII action. Good job pointing out the inferiority of American armor and number of crews lost in the war, Rather orchestrated ending, but contains a nice surprise.\nGrim but well done.\nGirls' Generation (SNSD) - Girls' Generation -Love & Peace- Japan 3Rd Tour [Japan BD] UPXH-20030\nFormat: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '11.81 x 3.94 x 7.87 inches; 2.82 Ounces', 'Number of discs': '1'}\nI think this is consistently rated best of their videos by most fans. I rate it number one for best with original lineup. A close second is current 8 member lineup of the &#34;Tokyo Dome-The Best&#34; video.\nI think this is consistently rated best of their videos by most fans\nSalt (Deluxe Unrated Edition) [Blu-ray]\nAngelina Jolie  (Actor),     Liev Schreiber  (Actor),     Philip Noyce  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Angelina Jolie stars in Columbia Pictures'\", 'Salt', ', a contemporary espionage thriller. Before becoming a CIA officer, Evelyn Salt (Jolie) swore an oath to duty, honor, and country. She will prove loyal to these when a defector accuses her of being a Russian sleeper spy. Salt goes on the run, using all her skills and years of experience as a covert operative to elude capture, protect her husband, and stay one step ahead of her colleagues at the CIA.', 'Amazon.com', 'Angelina Jolie confirms her status as action-heroine supreme in the sinewy thriller', 'Salt', \". Evelyn Salt (Jolie) is a respected high-ranking CIA agent… until a defecting Russian operative declares that she's a Russian mole in deep cover, launching her on the most delicious chase sequence since the\", 'Bourne', \"movies. When the film's over you'll realize the motivations for much of what happened didn't make much sense, but while the movie's going on the pell-mell pace will brush such concerns from your mind. Director Phillip Noyce (\", 'Patriot Games', ',', 'Dead Calm', \") has a gift for staging action sequences you can actually follow moment to moment, which is infinitely more engaging than frenzied editing that blurs everything into cattle-prod jolts--the movie's first third is top-notch orchestration. Jolie's star magnetism provides the cool, calm axis around which everything else revolves; the sturdy supporting performances of Liev Schreiber (\", 'The Manchurian Candidate', ') and Chiwetel Ejiofor (', 'Inside Man', ',', 'Dirty Pretty Things', ') give enough heft to the plot to keep you from questioning anything.', 'Salt', 'is an old-fashioned entertainment, a skillfully made mechanism with enough grace notes to let it breathe and catch you by surprise.', '--Bret Fetzer']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Angelina Jolie, Liev Schreiber, Philip Noyce', 'Language': 'English, French, Spanish', 'Runtime': '5 hours and 5 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': 'Salt Blu Ray', 'Director': 'Philip Noyce', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 5 minutes', 'Release date': 'September 6, 2011', 'Actors': 'Angelina Jolie, Liev Schreiber', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures', 'Number of discs': '1'}\nMs Jolie kicks ass in a relatively coherent and interesting script.\nFour Stars\n{'Subtitles': ['None available'], 'Directors': ['Mina Đukić'], 'Producers': ['Mina Đukić', 'Nikola Lezaic'], 'Starring': ['Hana Selimovic', 'Mladen Sovilj', 'Mina Subota'], 'Studio': ['Visit Films']}\nSome funny and some touching scenes spread out within a generally slow but interesting story. Then either my cultural differences or murky writing leads to another ( at least for me) huh? ending. Worth the watch if nothing else to do.\nOK until the what? ending.\n{'Subtitles': ['None available'], 'Directors': ['Jag Mundhra'], 'Producers': ['Jag Mundhra', 'Kalpana Saxena', 'Vivek Singhania'], 'Starring': ['Richard Tyson'], 'Studio': ['AMBI Distribution']}\nIt had everything going for it, hunky American who couldn't act, blonde girlfriend , and Asian temptress, all set in India. But as Mr. Cortez says elsewhere, the movie doesn't live up to it's title. Skip this one.\nDon't waste your time\n{'Subtitles': ['None available'], 'Directors': ['Alan Overton'], 'Producers': ['Ted Leversuch', 'Phillip Watson'], 'Starring': ['Susan Baxter', 'Carol MacKenzie'], 'Studio': ['Sprocket Flicks']}\nI've never seen the original, but seeing it was made in 62 I figured there wouldn't be much nudity anyway, but this was ridiculous. Viewed as half east coast travelogue and half proper boat etiquette it might have been OK, but...  The cheesy music played throughout ( think early Bewitched episodes), the ever present voice over ( think any travel film from the late 50's early 60's), the couple of nudists scenes that were shot from a distance and the whole early sixties fashion vibe make this version mostly unwatchable. But if you must, pop a beer, relax in your plastic webbed chaise lounge, and turn on the sunlamp.\nDo not waste your time 2\n{'Audio languages': ['한국어'], 'Subtitles': ['English [CC]'], 'Directors': ['Kwak Jae-yong'], 'Producers': ['Ho-Cheol Ahn', 'Young-jun Ji', 'Sang Han Shin'], 'Starring': ['Shin Min-ah', 'On Ju-wan', 'Yu Geon'], 'Studio': ['AsianCrush']}\nThe first two thirds of the movie is a rather slow romance between Shin Min-a and her hockey playing crush. Not much action except a couple of gang fights demonstrating the four martial arts types in the movie and some flashbacks on the Green Destiny sword, which Shin Min-a's mother wielded. The last third finally gets to the antagonist and improves a bit but not really enough to make the movie. Not a bad movie, but just not great. Also, for some reason the director(?) seemed to like the look of Shin Min-a's face when she puffed out her cheeks, and he has her do it way too much for my taste.\nTries hard but a trifle slow\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ryan Eslinger'], 'Producers': ['Steve Luna', 'Jamie Hoang'], 'Starring': ['Jaz Kemp', 'William Ferrer', 'Noah Cohen']}\nI thought the premise was plausible and interesting, the acting was outstanding, and the movie moved right along. What else could you want? This is what Hollywood should be making instead of remakes and reboots.\nWell made, interesting story\n{'Subtitles': ['None available'], 'Directors': ['Han Sang Hee'], 'Producers': ['Hirotsugu Asai', 'Shinji Fujiwara', 'Atsushi Hoshino', 'Atsushi Ichikawa', 'Yoshiharu Ishigaki', 'Sangwoo Kang', 'Mitsugu Matsuda', 'Yoshihisa Uragami'], 'Starring': ['Nanami Sakuraba', 'Byung Hun'], 'Studio': ['Jetsen']}\nSet on the Island of Ishigaki in the Okinawa archipelago, the story concerns a heart recipient's discovery of whose heart beats within her chest. Part fable, part ghost story, let it lull you into a world where the impossible may be possible. Satisfying cast and beautiful scenery\nLanguid story of a girl's search for her destiny.\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ian Truitner'], 'Producers': ['Gabriella Cristiani', 'Matthew Gore', 'Hayley Helmreich', 'Jeffrey Magnussen', 'Chuck Parker', 'Merik Pelletier'], 'Starring': ['Sunny Mabrey', 'Lance Broadway', 'Michael Nouri'], 'Studio': ['High Octane Pictures', 'Thousand Mile Media']}\nYes the blurb is technically correct, but the rescue crew is comprised of the latest model ART (artificial intelligence) and is more about their existence than a rescue in this B scifi drama. I gave it 4 stars for the attempt to present the dichotomy of human emotion and AI logic. The reason for all this is a tad contrived, but what the hey, it's a movie!\nNot what I expected, but not a bad treatise on the human condition.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Daniel Petrie Jr.'], 'Producers': ['Daniel Petrie Jr.', 'Sean E. DeMott', 'Matt DiNicola', 'Rick Dugdale', 'Nancye Ferguson', 'Michael B. Johnson', 'Sean Lydiard', 'Bryan Sullivan'], 'Starring': ['Ayla Kell', 'Brendan Michael Coughlin', 'Grace Zabriski'], 'Studio': ['Ammo Content']}\nI'm a real sucker for a good Christmas movie, and while this movie was set during the holiday season, to me it was more like the winter of their discontent. Well acted believable characters, well written, and a beautiful location. Yea it has a sappy ending, but it really deserved one, and you be the judge of the grandmother's sanity. Does she really believe, or has she just convinced herself?\nWhat's not to like?\n{'Subtitles': ['None available'], 'Directors': ['Charlie Tyrell'], 'Producers': ['Julie Baldassi'], 'Studio': ['Younger Daughter Films', 'Topic Studios']}\nMostly educators and musicians talking about the need for school students to have instruments to use and access to people that can help them learn. Not quite what I expected from the title,but interesting nonetheless. I would liked to have seen an extended version showing more of the discovery, repair, and disbursemt of the instruments themselves.\nInteresting presentation of a man's desire to hep his community.\n{'Audio languages': ['Français'], 'Subtitles': ['English [CC]'], 'Directors': ['Mathilde Elu'], 'Starring': ['Agnès Hurstel', 'Isabelle Joly'], 'Studio': ['Films Grand Huit']}\nShort film about an actress getting a laser hair removal treatment. The actress apparently has a rather full pubic b**h and the attendant wants to remove it all. Film seems to be mostly in favor of the actress's desire to keep it. Humorous and entertaining. English subs were also quite good.\nInteresting dilemma for modern women.",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user shows a diverse interest in films, particularly Action & Adventure, historical war narratives, and K-pop performances. They have a growing appreciation for educational narratives and community-focused stories, highlighting a desire for impactful themes beyond conventional filmmaking.\n\n- **Key Preferences:** They value high-quality storytelling, with an emphasis on authentic portrayals of conflict and emotionally resonant narratives. Their recent positive review of a humorous short film demonstrates an openness to lighter themes while maintaining a focus on modern societal dilemmas, showcasing their ability to appreciate diverse narratives regardless of genre.\n\n- **Rating Trends:** They maintain a critical yet open-minded approach in their ratings, awarding high marks to emotionally engaging and thought-provoking works. Their reviews reflect a preference for complex themes, while still engaging with humor and lighter subjects when they resonate personally.\n\n- **Director & Actor Appreciation:** The user favors acclaimed directors and actors, especially within war dramas, while also exploring narratives that challenge societal norms and focus on social responsibility.\n\n- **Content Preference:** They expect realistic portrayals that emphasize character development and emotional depth, expressing dissatisfaction with shallow narratives, regardless of the film's tone.\n\n- **Media Format:** Their preference for high-definition physical formats like Blu-ray remains consistent, underscoring a commitment to coherent and engaging storytelling.\n\nOverall, the user demonstrates a dedication to meaningful narratives, valuing works that provoke reflection on contemporary issues, while also enjoying well-crafted, emotionally resonant stories with humor.",
  "metrics": {
    "rouge1_f": 0.11240506329113924,
    "rouge2_f": 0.012164216928535226,
    "rougeL_f": 0.05063291139240506,
    "meteor": 0.03569124899025716,
    "bleu1": 0.0001865590300413641,
    "bleu2": 6.036435970852295e-05,
    "bleu3": 2.2831528027717374e-05,
    "bleu4": 6.64535827347139e-06,
    "bertscore_precision": 0.35942691564559937,
    "bertscore_recall": 0.48465606570243835,
    "bertscore_f1": 0.4127519428730011
  }
}