{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sonic X, Vol. 5: Sonic's Scream Test [DVD]\nReview Date: 2015/02/07\nStore: Jason Griffith  (Actor),     Dan Green  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Anime\nProduct Description: [\"The episodes include The Adventures of Knuckles and Hawk, The Dam Scam, Sonic's Scream Test, Cruise Blues and Fast Friends.\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Color, NTSC, Animated', 'Contributor': 'Lisa Ortiz, Dan Green, Kathleen Delaney, Andy Rannells, Mike Pollock, Jason Griffith', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC, Animated', 'Run time': '1 hour and 40 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Jason Griffith, Dan Green, Mike Pollock, Andy Rannells, Kathleen Delaney', 'Studio': 'Funimation Prod', 'Number of discs': '1'}\nReview Text: Once again, five stars as per my seven year old niece's viewing. She's a huge 'Sonic' fan.\nReview Title: Sonic X, Vol. 5 Sonic's Scream Test\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Blob (1988) / Christine (1983) / Fright Night (1985) / Seventh Sign\nKevin Dillon  (Actor),     Keith Gordon  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['The Blob - a malignant, gelatinous life-form takes over a small town in this visually gut-wrenching thriller. Christine - the twisted love story of a teenager and his obsessively jealous 1958 Plymouth Fury. Fright Night - a teenager enlists the help of a TV horror movie host to subdue a suave vampire. The Seventh Sign - Demi Moore electrifies as a young woman who must prevent her unborn baby from playing an ominous role in the coming of the end of the world.']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Chris Sarandon, Amanda Bearse, Demi Moore, Keith Gordon, 4-Movie Horror Unleashed Collection, Kevin DillonChris Sarandon, Amanda Bearse, Demi Moore, Keith Gordon, 4-Movie Horror Unleashed Collection, Kevin Dillon  See more', 'Language': 'English', 'Runtime': '6 hours and 47 minutes', 'Aspect Ratio': '2.35:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '6 hours and 47 minutes', 'Release date': 'March 11, 2013', 'Actors': 'Kevin Dillon, Keith Gordon, Chris Sarandon, Amanda Bearse, Demi Moore', 'Subtitles': 'Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nEvery movie in this set is great! Originally wanted just the classic Fright Night, but who's to say no to a few dollars more to get three other great movies.\nFour fantastic movies\nThe Other Guys (The Unrated Other Edition)\nMark Wahlberg  (Actor),     Will Ferrell  (Actor),     Adam McKay  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Misfit NYPD detectives Gamble and Hoitz (Will Ferrell and Mark Wahlberg) are sentenced to life behind the desk. They hate each other and the monotony of their meaningless jobs, as they’re forced to live in the shadow of the two biggest and most badass cops on the force (Samuel L. Jackson and Dwayne Johnson). But when those guys go down for the count, opportunity knocks for Gamble and Hoitz. Stumbling onto what could be one of the biggest crimes in years, can The Other Guys step up their game to solve the case without killing each other and destroying NYC in the process? From the director of', 'Step Brothers', 'and', 'Talladega Nights: The Ballad of Ricky Bobby', '.', 'Amazon.com', 'Although the comedy team of Will Ferrell and Mark Wahlberg does not sound like a threat to Laurel and Hardy or Abbott and Costello, they conjure up consistent laughs in', 'The Other Guys', ', yet another comedy from', 'Talladega Nights', \"director Adam McKay. Ferrell plays a mild-mannered police accountant partnered with Wahlberg's hothead (recently demoted to desk-jockey duty after shooting a very famous Yankee player during the World Series), and both men must endure the showboating fame of a pair of supercops (Samuel L. Jackson and Dwayne Johnson) in their New York City precinct house. Along with sending up cop-movie clichés, the movie basically exists to give Ferrell and Wahlberg room to work amusing variations on their characters (with grace notes for Michael Keaton's stereotypical tough captain, too). The loosey-goosey structure works especially well when Wahlberg is needling his partner's squareness or marveling, in wonderfully awestruck tones, at the unbelievable hot-i-tude of Ferrell's wife (Eva Mendes)--a discrepancy made all the more maddening because Ferrell seems indifferent to her charms. Throw in a plot about a billionaire Wall Street crook (Steve Coogan) and the revelation of Ferrell's hilariously dark past, and the movie finds a nice zone of silliness. Of course, any Will Ferrell vehicle must be judged by the opportunities for the star to launch into some borderline-surreal riff--and happily, this film comes through. From the moment Ferrell begins deconstructing Wahlberg's lion versus tuna metaphor,\", 'The Other Guys', 'manages to find time for such nonsense, and the film--the world in general, for that matter--is the better for it.', '--Robert Horton']\n{'Genre': 'Action, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Mark Wahlberg, Adam McKay, Will Ferrell', 'Language': 'English', 'Runtime': '3 hours and 44 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.56 x 5.31 x 7.55 inches; 2.4 Ounces', 'Item model number': 'CTR35002DVD', 'Director': 'Adam McKay', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 44 minutes', 'Release date': 'December 14, 2010', 'Actors': 'Mark Wahlberg, Will Ferrell', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFunny, entertaining.\nThe Other Guys DVD\n4 Film Favorites: Tear-Jerkers (Divine Secrets of the Ya-Ya Sisterhood, My Sister's Keeper, The Time Traveler's Wife, White Oleander)\nRated:    R    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['4 Film Favorites: Tear-Jerkers Collection (4FF)', 'The Time Traveler’s Wife, White Oleander, Divine Secrets of the Ya-Ya Sisterhood, My Sister’s Keeper', ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Initial release date': '2012-03-13', 'Language': 'English', 'Studio': 'Studio Distribution Services', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '8741520', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Release date': 'March 13, 2012', 'Number of discs': '4'}\nWonderful selection! Price was fab too!\n4 Film Faves\nSonic X - Beating Eggman (Edited) [DVD]\nJason Griffith  (Actor),     Mike Pollock  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n['Sonic X - Beating Eggman (Edite']\n{'Format': 'Animated, Color, DVD, NTSC, Full Screen', 'Contributor': 'Dan Green, Lisa Ortiz, Amy Palant, Kathleen Delaney, Andy Rannells, Mike Pollock, Jason Griffith', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 4 Ounces', 'Media Format': 'Animated, Color, DVD, NTSC, Full Screen', 'Run time': '1 hour and 40 minutes', 'Release date': 'December 7, 2004', 'Actors': 'Jason Griffith, Mike Pollock, Dan Green, Andy Rannells, Kathleen Delaney', 'Studio': 'Funimation Prod', 'Number of discs': '1'}\n5 stars because it was purchased for my niece & she LUVS it! BTW she's seven. :)\nSonic X Beating Eggman\nSonic X, Vol. 5: Sonic's Scream Test [DVD]\nJason Griffith  (Actor),     Dan Green  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Anime\n[\"The episodes include The Adventures of Knuckles and Hawk, The Dam Scam, Sonic's Scream Test, Cruise Blues and Fast Friends.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Color, NTSC, Animated', 'Contributor': 'Lisa Ortiz, Dan Green, Kathleen Delaney, Andy Rannells, Mike Pollock, Jason Griffith', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.4 x 0.6 inches; 3.2 Ounces', 'Media Format': 'Color, NTSC, Animated', 'Run time': '1 hour and 40 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Jason Griffith, Dan Green, Mike Pollock, Andy Rannells, Kathleen Delaney', 'Studio': 'Funimation Prod', 'Number of discs': '1'}\nOnce again, five stars as per my seven year old niece's viewing. She's a huge 'Sonic' fan.\nSonic X, Vol. 5 Sonic's Scream Test",
  "profile": "**Updated User Profile Summary:**\n\nThis user continues to showcase a dynamic taste in film and television, increasingly embracing animated series along with their established preferences for emotionally resonant dramas, comedies, and classic 1980s horror. Their recent acquisition of a family-friendly animated series highlights a dedication to finding quality entertainment that can be enjoyed together with younger audiences, underscoring their interest in character-driven stories that resonate across generations.\n\nThe user’s choice reflects an adventurous spirit in content selection, valuing narratives that foster shared moments with loved ones. Their engagement with animated titles further emphasizes a broader exploration of storytelling, illustrating a commitment to diverse genres that blend quality entertainment with emotional depth.\n\nWith a focus on films and shows that elicit joy and nostalgia, the user continues to seek multifaceted experiences that enrich their viewing repertoire. This pursuit not only appeals to their taste for engaging narratives but also enriches familial connections, allowing for meaningful interactions during shared viewing experiences. Overall, their evolving preferences indicate a love for diverse storytelling formats that cater to both adult and younger viewers, enhancing their enjoyment and appreciation for animated and traditional media.",
  "metrics": {
    "rouge1_f": 0.10989010989010989,
    "rouge2_f": 0.004126547455295736,
    "rougeL_f": 0.05357142857142857,
    "meteor": 0.03335080884158024,
    "bleu1": 0.00013681775076911773,
    "bleu2": 3.564825630159426e-05,
    "bleu3": 6.1901516974186715e-06,
    "bleu4": 2.582563712393638e-06,
    "bertscore_precision": 0.3034592866897583,
    "bertscore_recall": 0.450958788394928,
    "bertscore_f1": 0.36278989911079407
  }
}