{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Natural Waterproof Lash Mascara Black, 4D Silk Fiber Eyelash Mascara Makeup, Lengthening and Thick, No Clumping, Smudge-proof, Long-Lasting Voluminous Eyelashes Dramatic Extension Makeup Kit Eye Lash\nReview Date: 2020/07/30\nStore: SIKEMAY\nAverage Rating: 4.1\nProduct Details: {'Color': 'black', 'Brand': 'SIKEMAY', 'Item Form': 'Cream', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.2 inches; 2.4 Ounces', 'UPC': '764690676845', 'Manufacturer': 'SIKEMAY'}\nReview Text: I tried two 4D Silk mascaras by this brand on each eye for comparison and the CPCP Real Eyes Long Fiber Eyelash Mascara offers excellent lash separation. The thin comb bristle brush is great for separation, especially on the lower lashes.  I've worn both for 36 hours and after massive eye rubbing, I am surprised at how fresh it looks. I awoke with no raccoon eyes and no need to reapply it today. it didn't flake off! This is truly a long-lasting mascara.<br /><br />**  If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: Truly long lasting mascara with no raccoon eyes after 36 hours!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nMOSTORY\n{'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nOkay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nFantastic natural-looking STAY PUT color with excellent pencil shape for easy application\n[Weekly Point Cosmetic Rose edition mask sheet] - Facial skin care mask sheet 3solutions(Wriklecare, Brighten up, Moisture) in one (1Pack of 10pcs)\nWeekly Point Cosmetic\n{'Brand': 'Weekly Point Cosmetic', 'Item Form': 'Sheet', 'Product Benefits': 'Moisture,Skin', 'Scent': 'Rose', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 4.84 x 7.01 inches; 12.63 Ounces'}\nEven though I am not fond of the paper masks (prefer collagen), there is no denying they work well and my aging skin feels replenished, hydrated and rejuvenated. I have very sensitive skin due to seborrheic dermatitis, so I have to be very careful with skincare products. Why do I always feel the need to test them on Sunday when I have work the next day? No worries, my skin will look great and If I can find the time I may do another treatment in the morning to give my skin a little more radiance. There is no denying the results.<br /><br />Pro Tip: They work even better when you put them in the freezer for about 15 minutes before use. It will help tighten the pores up and feels extra refreshing!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nMy aging skin feels replenished, hydrated and rejuvenated.\nHair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nMilantia\n{'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nI have finally found the perfect flat iron for my bangs.  The Milantia Mini Hair Straightener 3/4\" Ceramic Tourmaline Ionic Flat Iron heats up fast to take care of my half curly bangs that have a mind of their own.<br /><br /> I have coarse thick hair, but my bangs have thinned with age and have started developing weird curls and cowlicks. It's the only part of my hair that needs the nuclear option because I keep the rest of it braised most of the time.<br /><br />I don't have time for a lot of hair care, and this little flat iron heats up fast and does exactly what I need it to do. It's small, lightweight,  nimble, and exactly what I have been looking for!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 *\nExactly what I have been looking for!\nHair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nKapelli Hair\n{}\nLately, I have become enamored with hair building fibers for both root and scalp coverage. The results have been amazing, and many of the products I have used contain Keratin or Gossypium as the primary ingredient. The Toppik Hair Building Fibers contains 99% Keratin, but the fibers were larger and coarser than others and did not blend or adhere as well. It wasn't the natural-looking coverage I had come to expect. Just goes to show they're not all the same.<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nNot impressed\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nOut of all the 4D Silk Mascaraas I've tried recently the CPCP Elegant Princess Long Fiber Eyelash Mascara is one of my favorites. The packaging is gorgeous and the brush is a thicker comb-like bristle, which is great for volume and definition. My lashes looked dramatically darker and fuller and I really noticed the difference when I went outside and checked it out in my rearview mirror. I had tested two mascaras on each eye and this one really stood out. I have been wearing it for almost 36 hours and even slept in it.  After rubbing my eyes since the last night, the top lashes held and I didn't wake up with raccoon eyes. however, it does flake a bit. It applied smoothly and since It's not a quick drying mascara so you have a bit of time to tease out the lashes to avoid  any clumping..\nMade my lashes dramatically darker and fuller\nNatural Waterproof Lash Mascara Black, 4D Silk Fiber Eyelash Mascara Makeup, Lengthening and Thick, No Clumping, Smudge-proof, Long-Lasting Voluminous Eyelashes Dramatic Extension Makeup Kit Eye Lash\nSIKEMAY\n{'Color': 'black', 'Brand': 'SIKEMAY', 'Item Form': 'Cream', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.2 inches; 2.4 Ounces', 'UPC': '764690676845', 'Manufacturer': 'SIKEMAY'}\nI tried two 4D Silk mascaras by this brand on each eye for comparison and the CPCP Real Eyes Long Fiber Eyelash Mascara offers excellent lash separation. The thin comb bristle brush is great for separation, especially on the lower lashes.  I've worn both for 36 hours and after massive eye rubbing, I am surprised at how fresh it looks. I awoke with no raccoon eyes and no need to reapply it today. it didn't flake off! This is truly a long-lasting mascara.<br /><br />**  If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nTruly long lasting mascara with no raccoon eyes after 36 hours!",
  "profile": "**User Summary:**\n\n- **Cosmetics Preferences:** Has a strong interest in eyebrow products and mascaras that focus on natural finishes and long-lasting wear, valuing precise application and blending tools.\n\n- **Application Style:** Seeks ease of application to achieve a natural look, particularly for thin brows and lashes. Prefers products that balance control and softness for a seamless appearance, avoiding harsh lines.\n\n- **Color Selection:** Opts for neutral or cool-toned shades suitable for brunettes, steering clear of red undertones, especially in mascara choices.\n\n- **Product Features:** Actively seeks waterproof and long-lasting cosmetics that support an active lifestyle. Prioritizes products that are smudge-proof, hypoallergenic, and enhance volume without clumping. They continue to experiment with high-performing mascaras that provide durability and dramatic results.\n\n- **User Experience:** Enjoys experimenting with cosmetics that yield satisfying results while being knowledgeable about various products. Recent comparisons of mascaras reflect an interest in performance, particularly with regard to wearability over long periods without touch-ups.\n\n- **Skincare Interest:** Expresses a growing commitment to facial skincare, focusing on hydration and sensitivity for aging skin, while being selective with product choices.\n\n- **Hair Care Interests:** Interested in hair-building fibers for thinning hair, prioritizing natural-looking results and consistent application.\n\nOverall, this user is dedicated to enhancing their natural beauty through high-quality cosmetics, skincare, and hair care, while continuously exploring innovative products that align with their performance standards.",
  "metrics": {
    "rouge1_f": 0.16096579476861167,
    "rouge2_f": 0.022834116856950974,
    "rougeL_f": 0.06975184439973171,
    "meteor": 0.0680419753799344,
    "bleu1": 0.005510840208812296,
    "bleu2": 0.002177248886717266,
    "bleu3": 0.0005797380207917108,
    "bleu4": 0.00016837204061716018,
    "bertscore_precision": 0.3889387249946594,
    "bertscore_recall": 0.5237902402877808,
    "bertscore_f1": 0.4464026391506195
  }
}