{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nReview Date: 2020/01/01\nStore: MOSTORY\nAverage Rating: 4.0\nProduct Details: {'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nReview Text: Okay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nReview Title: Fantastic natural-looking STAY PUT color with excellent pencil shape for easy application\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nMOSTORY\n{'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nOkay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nFantastic natural-looking STAY PUT color with excellent pencil shape for easy application",
  "profile": "**User Summary:**\n\n- **Cosmetics Preferences:** Strong interest in eyebrow products, particularly in formulas that offer natural finishes and long-lasting wear. The user appreciates products that allow for precise application and blending, indicating a preference for tools that support easy and layered use.\n\n- **Application Style:** Values ease of application with a focus on achieving a natural look, especially for thin brows. The user prefers products that provide a good balance between control and softness to avoid harsh lines.\n\n- **Color Selection:** Prefers shades that do not lean towards red, indicating a preference for neutral or cool-toned brow products suitable for brunettes.\n\n- **Product Features:** Looks for waterproof and long-lasting features in cosmetics, suggesting an active lifestyle or a tendency to seek reliable products that endure throughout the day.\n\n- **User Experience:** Enjoys products that perform well overall, indicated by satisfaction with the application and end result, despite some minor drawbacks noted in previous experiences. The user has a level of familiarity with cosmetics and might appreciate innovations in application forms (e.g., pencil shape, sponge tips).\n\nOverall, the user seems to be knowledgeable about brow cosmetics, seeking high-quality, efficient products that enhance their natural appearance without the heaviness of traditional makeup.",
  "metrics": {
    "rouge1_f": 0.3385300668151448,
    "rouge2_f": 0.053691275167785234,
    "rougeL_f": 0.13808463251670375,
    "meteor": 0.20834273865559735,
    "bleu1": 0.2800141053723797,
    "bleu2": 0.09797899330896094,
    "bleu3": 0.014894511613263134,
    "bleu4": 0.005813080575909907,
    "bertscore_precision": 0.45661377906799316,
    "bertscore_recall": 0.47594839334487915,
    "bertscore_f1": 0.4660806655883789
  }
}