{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: [Weekly Point Cosmetic Rose edition mask sheet] - Facial skin care mask sheet 3solutions(Wriklecare, Brighten up, Moisture) in one (1Pack of 10pcs)\nReview Date: 2020/02/16\nStore: Weekly Point Cosmetic\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Weekly Point Cosmetic', 'Item Form': 'Sheet', 'Product Benefits': 'Moisture,Skin', 'Scent': 'Rose', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 4.84 x 7.01 inches; 12.63 Ounces'}\nReview Text: Even though I am not fond of the paper masks (prefer collagen), there is no denying they work well and my aging skin feels replenished, hydrated and rejuvenated. I have very sensitive skin due to seborrheic dermatitis, so I have to be very careful with skincare products. Why do I always feel the need to test them on Sunday when I have work the next day? No worries, my skin will look great and If I can find the time I may do another treatment in the morning to give my skin a little more radiance. There is no denying the results.<br /><br />Pro Tip: They work even better when you put them in the freezer for about 15 minutes before use. It will help tighten the pores up and feels extra refreshing!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: My aging skin feels replenished, hydrated and rejuvenated.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nMOSTORY\n{'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nOkay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nFantastic natural-looking STAY PUT color with excellent pencil shape for easy application\n[Weekly Point Cosmetic Rose edition mask sheet] - Facial skin care mask sheet 3solutions(Wriklecare, Brighten up, Moisture) in one (1Pack of 10pcs)\nWeekly Point Cosmetic\n{'Brand': 'Weekly Point Cosmetic', 'Item Form': 'Sheet', 'Product Benefits': 'Moisture,Skin', 'Scent': 'Rose', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 4.84 x 7.01 inches; 12.63 Ounces'}\nEven though I am not fond of the paper masks (prefer collagen), there is no denying they work well and my aging skin feels replenished, hydrated and rejuvenated. I have very sensitive skin due to seborrheic dermatitis, so I have to be very careful with skincare products. Why do I always feel the need to test them on Sunday when I have work the next day? No worries, my skin will look great and If I can find the time I may do another treatment in the morning to give my skin a little more radiance. There is no denying the results.<br /><br />Pro Tip: They work even better when you put them in the freezer for about 15 minutes before use. It will help tighten the pores up and feels extra refreshing!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nMy aging skin feels replenished, hydrated and rejuvenated.",
  "profile": "**User Summary:**\n\n- **Cosmetics Preferences:** Strong interest in eyebrow products, particularly those offering natural finishes and long-lasting wear. The user values precise application and blending tools, indicating a preference for layered use.\n\n- **Application Style:** Focuses on ease of application to achieve a natural look, especially for thin brows. Prefers products that balance control and softness to avoid harsh lines.\n\n- **Color Selection:** Prefers neutral or cool-toned shades that are suitable for brunettes, avoiding any product with a red undertone.\n\n- **Product Features:** Seeks waterproof and long-lasting cosmetics to support an active lifestyle and ensure durability throughout the day.\n\n- **User Experience:** Enjoys high-performing products that deliver satisfying results with minimal drawbacks. Familiar with cosmetics and open to innovations in application forms, reflecting a knowledgeable approach to makeup.\n\n- **Skincare Interest:** Recently expressed a growing interest in facial skincare, highlighting the importance of hydration and condition for sensitive, aging skin. The user is cautious with skincare choices due to a history of sensitivity and seeks effective products that provide replenishment and rejuvenation.\n\nOverall, the user demonstrates a commitment to enhancing their natural appearance through both cosmetics and skincare, routinely testing new products while maintaining a focus on quality and performance.",
  "metrics": {
    "rouge1_f": 0.2713864306784661,
    "rouge2_f": 0.03254437869822485,
    "rougeL_f": 0.11209439528023599,
    "meteor": 0.12415011217269437,
    "bleu1": 0.1025028481522159,
    "bleu2": 0.035939062995911444,
    "bleu3": 0.005144632285062721,
    "bleu4": 0.0019484000333070202,
    "bertscore_precision": 0.3922208547592163,
    "bertscore_recall": 0.46658921241760254,
    "bertscore_f1": 0.42618507146835327
  }
}