{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nReview Date: 2020/06/14\nStore: Kapelli Hair\nAverage Rating: 3.7\nProduct Details: {}\nReview Text: Lately, I have become enamored with hair building fibers for both root and scalp coverage. The results have been amazing, and many of the products I have used contain Keratin or Gossypium as the primary ingredient. The Toppik Hair Building Fibers contains 99% Keratin, but the fibers were larger and coarser than others and did not blend or adhere as well. It wasn't the natural-looking coverage I had come to expect. Just goes to show they're not all the same.<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nReview Title: Not impressed\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "MOSTORY 3 in 1 Eyebrow Pencil - Super Model Perfect Brow Stylist Waterproof Brown Eye Brow Makeup Long Lasting Professional Soft Powder Pen Brush (MEDIUM BROWN)\nMOSTORY\n{'Brand': 'MOSTORY', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Package Dimensions': '7 x 1 x 0.5 inches; 1.59 Ounces'}\nOkay, I am a fan but with caveats. I love the long chiseled pencil shape because it makes it easier to apply straight stokes of color to my very thin brows without looking drawn on or penciled in. However, it does skip a bit compared to my gel brow color that is applied with a brush. The sponge tip is great for softening the sharp line on the thicker area of my brow and i dab it with a bit of eye shadow to set it.  The color stays put and looks natural without leaning towards red. What more can you ask of a good brow pencil for brunettes? I overplucked my brows in my youth when pencil-thin brows were was the style (okay, I'm dating myself here) but this seems to apply quickly and easily and works well with super-thin brows without making me look like Groucho Marx. It works, it stays and looks great. Gals with thicker brows will reap the most benefit b using the mascara type brush for the most natural look and pigment distribution.\nFantastic natural-looking STAY PUT color with excellent pencil shape for easy application\n[Weekly Point Cosmetic Rose edition mask sheet] - Facial skin care mask sheet 3solutions(Wriklecare, Brighten up, Moisture) in one (1Pack of 10pcs)\nWeekly Point Cosmetic\n{'Brand': 'Weekly Point Cosmetic', 'Item Form': 'Sheet', 'Product Benefits': 'Moisture,Skin', 'Scent': 'Rose', 'Skin Type': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 4.84 x 7.01 inches; 12.63 Ounces'}\nEven though I am not fond of the paper masks (prefer collagen), there is no denying they work well and my aging skin feels replenished, hydrated and rejuvenated. I have very sensitive skin due to seborrheic dermatitis, so I have to be very careful with skincare products. Why do I always feel the need to test them on Sunday when I have work the next day? No worries, my skin will look great and If I can find the time I may do another treatment in the morning to give my skin a little more radiance. There is no denying the results.<br /><br />Pro Tip: They work even better when you put them in the freezer for about 15 minutes before use. It will help tighten the pores up and feels extra refreshing!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nMy aging skin feels replenished, hydrated and rejuvenated.\nHair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nMilantia\n{'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nI have finally found the perfect flat iron for my bangs.  The Milantia Mini Hair Straightener 3/4\" Ceramic Tourmaline Ionic Flat Iron heats up fast to take care of my half curly bangs that have a mind of their own.<br /><br /> I have coarse thick hair, but my bangs have thinned with age and have started developing weird curls and cowlicks. It's the only part of my hair that needs the nuclear option because I keep the rest of it braised most of the time.<br /><br />I don't have time for a lot of hair care, and this little flat iron heats up fast and does exactly what I need it to do. It's small, lightweight,  nimble, and exactly what I have been looking for!<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 *\nExactly what I have been looking for!\nHair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nKapelli Hair\n{}\nLately, I have become enamored with hair building fibers for both root and scalp coverage. The results have been amazing, and many of the products I have used contain Keratin or Gossypium as the primary ingredient. The Toppik Hair Building Fibers contains 99% Keratin, but the fibers were larger and coarser than others and did not blend or adhere as well. It wasn't the natural-looking coverage I had come to expect. Just goes to show they're not all the same.<br /><br />** If you found this review to be helpful at all, please take a moment and click the button below to let Amazon know. Thank you so much 😊 **\nNot impressed",
  "profile": "**User Summary:**\n\n- **Cosmetics Preferences:** Demonstrates a strong interest in eyebrow products, particularly those offering natural finishes and long-lasting wear. Values precise application and blending tools, indicating a preference for layered use.\n\n- **Application Style:** Focuses on ease of application to achieve a natural look, especially for thin brows. Prefers products that balance control and softness to avoid harsh lines.\n\n- **Color Selection:** Opts for neutral or cool-toned shades suitable for brunettes, avoiding any with red undertones.\n\n- **Product Features:** Seeks waterproof and long-lasting cosmetics to support an active lifestyle and ensure durability throughout the day.\n\n- **User Experience:** Enjoys high-performing products that deliver satisfying results with minimal drawbacks. Familiar with cosmetics and open to innovations in application forms, reflecting a knowledgeable approach to makeup.\n\n- **Skincare Interest:** Recently expressed a growing interest in facial skincare, emphasizing hydration and condition for sensitive, aging skin. Cautious with skincare choices due to sensitivity history, seeking effective replenishing and rejuvenating products.\n\n- **Hair Care Interests:** Has recently developed an interest in hair building fibers for thinning hair, aiming for natural-looking coverage. They are discerning with hair care products, particularly seeking those that deliver consistent and seamless results while effectively managing specific concerns.\n\nOverall, the user is committed to enhancing their natural appearance through cosmetics, skincare, and hair care, routinely testing new products while maintaining a focus on quality and performance.",
  "metrics": {
    "rouge1_f": 0.21091581868640147,
    "rouge2_f": 0.03521779425393883,
    "rougeL_f": 0.09435707678075854,
    "meteor": 0.09657071889571718,
    "bleu1": 0.03238598390086755,
    "bleu2": 0.013541722287822007,
    "bleu3": 0.0051412915787896725,
    "bleu4": 0.0024091483990095674,
    "bertscore_precision": 0.3980359435081482,
    "bertscore_recall": 0.5105526447296143,
    "bertscore_f1": 0.44732746481895447
  }
}