{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/04/06\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Testa', 'Luke Terbieten', 'Michael Simon', 'Ryan Polito', 'Brian Campbell'], 'Producers': ['Justin Sena', 'Mark Neal', 'Alevil Rincones', 'Carl Kocis III', 'Shawn Greenson']}\nReview Text: It's an MTV reality show so don't expect anything more than that. The first season was better but if you like some mindless drama and laughing at or yelling at the crazy things people will do for money, this is your show. The little southern girl is a kick in the pants.\nReview Title: The first season was better but if you like some mindless drama and laughing ...\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Cartoon Network: Chowder: Volume 2\nNicky Jones  (Actor),     John DiMaggio  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Cartoon Network: Chowder: Volume 2', 'Marzipan City is a place where anything can happen and the unorthodox is commonplace. In the middle of this bizarre city is a quaint little shop known as Mung Daal Catering, which is owned by Mung Daal, one of the ost accomplished chefs and well known in the entire world. However, things have become a bit hectic in the kitchen as of late, as Mung Daal has recently acquired a young apprentice named Chowder, whom he wishes to pass along all of his knowledge towards. Chowder is an energetic young lad who wishes to become the greatest chef in the world, but his love of food and his extremely short attention span often results in him causing unintended havoc. However, theyre not alone. Truffles works at Mung Daal Catering and she takes the orders that her husband, Mung Daal, must prepare. Shnitzel, a rock monster, also helps out in the kitchen as he has worked for Mung Daal for years. Along the way, theyll meet the many colorful and zany residents of Marzipan City, though there will always be new dishes to prepare and exciting recipes to follow.', ']]>', 'Amazon.com', 'Five more episodes of', 'Chowder', 'await fans of the surreal and sublimely silly animated television series on this delicious second volume DVD. As with its predecessor, the episodes are not in broadcast order, which has no effect on their enjoyment; each of the 22-minute stories (broken into two 11-minute episodes) stands on its own in terms of zaniness and visual charm. Strongest among the batch included here is the Emmy- and Annie-nominated “Burple Nurples,” which circles around a somewhat morbid conceit: in an attempt to make the title dish, aspiring chef Chowder accidentally laces it with rat poison, sending his boss and mentor Mung Daal on a mad quest to track down all of his creations. Other episodes underscore the show’s gentle blend of kid-friendly storylines and out-and-out wackiness: “Mung on the Rocks” gives Chowder a chance to prove himself by bailing Mung out of a pickle with his wife, Truffles, while its companion piece, “Sniffleball,” finds our hero facing the classic conundrum: will he be the hero in a game of sniffleball or the goat? It’s this inherent sweetness, mixed with the lovely, off-kilter artwork and characterizations that make', 'Chowder', 'so appealing to viewers of all ages. Extras detailing the conception of this unique show would have been appreciated, but only a gallery of sketches and designs are present on this disc.', '--Paul Gaita']\n{'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Contributor': 'C.H. Greenblatt, Tara Strong, John DiMaggio, Dwight Schultz, Nicky Jones, Liliana Mumy, Dana Snyder', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.4 Ounces', 'Item model number': 'DT90008D', 'Media Format': 'Multiple Formats, Color, Widescreen, Subtitled, NTSC, Animated', 'Run time': '1 hour and 50 minutes', 'Release date': 'March 3, 2009', 'Actors': 'Nicky Jones, John DiMaggio, Liliana Mumy, Tara Strong, Dana Snyder', 'Subtitles': 'English', 'Producers': 'C.H. Greenblatt', 'Studio': 'WarnerBrothers', 'Writers': 'C.H. Greenblatt', 'Number of discs': '1'}\nMy step-son loves chowder and has had the volume 1 disc for a long time. I got this one for him for good grades and he loves it. He watches it all the time.\nFor my step-son\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Farrne Blackburn', 'Tom Shankland'], 'Producers': ['Caroline Skinner', 'Sue Hogg'], 'Starring': ['Iain De Caestecker', 'Daniel Kaluuya', 'Tom Ellis'], 'Studio': ['BBC America']}\nnot very good quality, good concept, but bad acting as well. here are 9 more words, yep, there you go.\nCouldn't get through it\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Yves Simoneau'], 'Producers': ['Not Specified'], 'Starring': ['Elizabeth Mitchell', 'Morris Chestnut', 'Joel Gretsch']}\nNot as good as the original but worth watching if you're curious. Necessary spoiler, the second season ends abruptly with no resolution, so if you need a series to really end, this is not for you!\nNot as good as the original but worth watching if you're curious\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Not Specified'], 'Starring': ['Eliza Taylor', 'Paige Turco', 'Thomas McDonell']}\nGreat first season for a show. A little cliche and predictable but over-all a good time.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill McClane', 'Ted Schillinger'], 'Producers': ['Bill McClane', 'Ted Schillinger', 'Emily Dillon Berry', 'Lena Bhise', 'Joe Flynn Connor', 'Shawn Cuddy', 'Jennifer DeQuattro', 'Bruce David Klein', 'Angela Marsh', 'Kevin Maguire'], 'Studio': ['National Geographic Channel']}\nNot really a survival show and definitely not good. The first episode about &#34;zombies&#34; has nothing to do with zombies and drags on.\nNot really a survival show and definitely not good. The first episode about \"zombies\" has nothing to ...\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Howard McCain'], 'Producers': ['Chris Roberts', 'John Schimmel'], 'Starring': ['Jim Caviezel', 'Sophia Myles', 'John Hurt'], 'Studio': ['Lionsgate']}\nI've seen this before and loved it, but recently rented it so that my son could watch it. He loved it and I loved that it was action packed enough to keep his attention, but no nudity and I got to enjoy it too. Middle of the road movies are difficult to find with a 12-year-old and this one was definitely a hit.\nI've seen this before and loved it, but recently rented it so that my ...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susan Seidelman'], 'Producers': ['Midge Sanford', 'Sarah Pillsbury', 'Michael Peyser'], 'Starring': ['Rosanna Arquette', 'Madonna', 'Aidan Quinn'], 'Studio': ['MGM Domestic Television']}\nProbably the best Madonna movie I've ever seen. Funny, cute, and great from beginning to end. Love this.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Testa', 'Luke Terbieten', 'Michael Simon', 'Ryan Polito', 'Brian Campbell'], 'Producers': ['Justin Sena', 'Mark Neal', 'Alevil Rincones', 'Carl Kocis III', 'Shawn Greenson']}\nIt's an MTV reality show so don't expect anything more than that. The first season was better but if you like some mindless drama and laughing at or yelling at the crazy things people will do for money, this is your show. The little southern girl is a kick in the pants.\nThe first season was better but if you like some mindless drama and laughing ...",
  "profile": "**Updated User Preferences Profile Summary:**\n\n- **Interests:** The user continues to enjoy animated content in the Kids & Family genre, while also branching out into live-action entertainment that appeals to their step-son, reflecting an evolving taste.\n\n- **Context:** Their commitment to age-appropriate media remains strong, focusing on engaging and safe options for younger viewers, enhancing family viewing experiences.\n\n- **Content Style:** Recently, the user has shown an interest in more relaxed, reality-based programming, indicating a willingness to embrace diverse content styles that foster family entertainment, even if they maintain certain expectations of quality.\n\n- **Viewing Patterns:** The user still utilizes media as a reward system for positive behavior but is now more open to exploring various genres, including those that contain lighter, more humorous themes. This reflects an adjustment to their previous strict content guidelines, driven by a desire for quality storytelling that satisfies a range of family preferences.\n\n- **Overall Sentiment:** Their viewpoint on family-friendly content is evolving, as demonstrated by their review of a reality show described as \"mindless drama.\" This highlights a newfound appreciation for entertainment that, while not traditionally family-oriented, offers a humorous and engaging experience.\n\nThis updated profile illustrates the user’s balanced approach towards media consumption, embracing a wider array of content that meets the diverse interests of their family without compromising on the quality of entertainment.",
  "metrics": {
    "rouge1_f": 0.1512481644640235,
    "rouge2_f": 0.014705882352941176,
    "rougeL_f": 0.06167400881057269,
    "meteor": 0.04718824440325331,
    "bleu1": 0.002239879034790636,
    "bleu2": 0.0007248463749951679,
    "bleu3": 0.00021762779764227788,
    "bleu4": 6.711834462640543e-05,
    "bertscore_precision": 0.3406808376312256,
    "bertscore_recall": 0.474181592464447,
    "bertscore_f1": 0.39649534225463867
  }
}