{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: anmas rucci Acrylic Nail Art Tools Kit Set Colorful Glitter Nail Rhinestones Acrylic Nail Art Curved Tweezer 3D Nail Butterfly Sticker Manicure Color Rhinestones #F\nReview Date: 2021/02/24\nStore: anmas rucci\nAverage Rating: 3.9\nProduct Details: {'Material': 'Acrylic', 'Brand': 'Anmas rucci', 'Included Components': 'Glitter, Tweezer', 'Package Dimensions': '8.74 x 6.06 x 2.6 inches; 8.15 Ounces', 'UPC': '786118089648'}\nReview Text: The anmas rucci Acrylic Nail Art Tools Kit gives you a little bit of everything for making your nails, or even crafting creations several different options for creative expression. My favorite part of the set is the half-pearls and pixie beads, but all of the pieces are really pretty. The tape works well with my own adhesive I already had on hand. This is a really fun set and I'd recommend them to anyone that likes to get creative with their nail art!\nReview Title: Very Nice Set!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Butterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nB bangcool\n{'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nThe Butterfly Nail Art Decals Water Transfer Stickers bundle is a great deal. You get 22 full sheets of stickers. Each sheet has over 50 stickers as far as I've counted them. They are either multi-colored and halographic or metallic outlined patterns. Every sheet is a little different, so there are no repeats. They apply easily, but I highly recommend doing a base coat first and a coat on top as well. There are also 2 generously filled jars of holographic butterflies that measure 4mm by 4mm at the widest points. This is a really pretty collection of butterflies and I couldn't recommend them more for both the value and variety!\nFantastic Value!\nanmas rucci Acrylic Nail Art Tools Kit Set Colorful Glitter Nail Rhinestones Acrylic Nail Art Curved Tweezer 3D Nail Butterfly Sticker Manicure Color Rhinestones #F\nanmas rucci\n{'Material': 'Acrylic', 'Brand': 'Anmas rucci', 'Included Components': 'Glitter, Tweezer', 'Package Dimensions': '8.74 x 6.06 x 2.6 inches; 8.15 Ounces', 'UPC': '786118089648'}\nThe anmas rucci Acrylic Nail Art Tools Kit gives you a little bit of everything for making your nails, or even crafting creations several different options for creative expression. My favorite part of the set is the half-pearls and pixie beads, but all of the pieces are really pretty. The tape works well with my own adhesive I already had on hand. This is a really fun set and I'd recommend them to anyone that likes to get creative with their nail art!\nVery Nice Set!",
  "profile": "**User Profile Summary:**\n\n- **Interests:** Enthusiastic about nail art, favoring decorative stickers, decals, and crafting supplies for personalized designs.\n- **Aesthetic Preferences:** Drawn to vibrant, colorful designs, particularly those featuring holographic, metallic elements, and nature themes like butterflies.\n- **Value Sensitivity:** Prioritizes cost-effective products that offer a variety of options in a single purchase, seeking high value in the items they buy.\n- **Application Preferences:** Favors easy-to-apply products and appreciates recommendations for optimal use, such as base and top coats.\n- **Usage Patterns:** Enjoys DIY projects focused on personal grooming and fashion aesthetics, demonstrating a creative flair in personal expression.\n- **Feedback Behavior:** Leaves detailed, positive reviews that highlight the value and quality of products, emphasizing the versatility and fun aspects of the items used in nail art.\n\nRecent interactions indicate a continued appreciation for comprehensive nail art kits, showcasing a preference for sets that include various components, enhancing creative possibilities. The user values products that facilitate creativity and self-expression, underpinning a strong interest in both the aesthetic and practical elements of nail art tools.",
  "metrics": {
    "rouge1_f": 0.3046875,
    "rouge2_f": 0.03529411764705882,
    "rougeL_f": 0.14453125,
    "meteor": 0.13784987557098094,
    "bleu1": 0.15513551531438427,
    "bleu2": 0.04570373692936249,
    "bleu3": 0.01592054237871114,
    "bleu4": 0.005289711289393308,
    "bertscore_precision": 0.38540202379226685,
    "bertscore_recall": 0.4509057402610779,
    "bertscore_f1": 0.4155885875225067
  }
}