{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Butterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nReview Date: 2020/10/26\nStore: B bangcool\nAverage Rating: 4.6\nProduct Details: {'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nReview Text: The Butterfly Nail Art Decals Water Transfer Stickers bundle is a great deal. You get 22 full sheets of stickers. Each sheet has over 50 stickers as far as I've counted them. They are either multi-colored and halographic or metallic outlined patterns. Every sheet is a little different, so there are no repeats. They apply easily, but I highly recommend doing a base coat first and a coat on top as well. There are also 2 generously filled jars of holographic butterflies that measure 4mm by 4mm at the widest points. This is a really pretty collection of butterflies and I couldn't recommend them more for both the value and variety!\nReview Title: Fantastic Value!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Butterfly Nail Art Decals Water Transfer Stickers, 22 Sheets Butterfly Nail Sticker DIY Nail Decals, 2 Set Butterfly Nail Glitter Holographic Stickers Reflected Butterfly Designs for Nails Supply\nB bangcool\n{'Surface Recommendation nail': '', '': 'Unit Count 1.00 Count', 'Shape Irregular': '', 'Brand': 'B bangcool', 'Item Dimensions LxWxH': '6.3 x 3.54 x 1.57 inches', 'Theme': 'Butterfly', 'Age Range (Description)': 'Adult', 'Reusability': 'Single Use', 'Item Form': 'Sheet', 'Pattern': 'Insects', 'Product Dimensions': '6.3 x 3.54 x 1.57 inches; 5.61 Ounces'}\nThe Butterfly Nail Art Decals Water Transfer Stickers bundle is a great deal. You get 22 full sheets of stickers. Each sheet has over 50 stickers as far as I've counted them. They are either multi-colored and halographic or metallic outlined patterns. Every sheet is a little different, so there are no repeats. They apply easily, but I highly recommend doing a base coat first and a coat on top as well. There are also 2 generously filled jars of holographic butterflies that measure 4mm by 4mm at the widest points. This is a really pretty collection of butterflies and I couldn't recommend them more for both the value and variety!\nFantastic Value!",
  "profile": "**User Profile Summary:**\n\n- **Interests:** Nail art, specifically decorative stickers and decals\n- **Aesthetic Preferences:** Enjoys vibrant, colorful designs; has a penchant for holographic and metallic elements; appreciates themes involving nature, particularly butterflies\n- **Value Sensitivity:** Looks for cost-effective, high-value products with a variety of options included in a single purchase\n- **Application Preferences:** Prefers products that are easy to apply, with recommendations for optimal use (such as base and top coats)\n- **Usage Patterns:** Likely enjoys DIY projects, particularly involving personal grooming or fashion aesthetics\n- **Feedback Behavior:** Tends to leave detailed, positive reviews emphasizing value and quality of products\n\nOverall, this user exhibits a strong inclination towards creative expression through nail art, valuing both the aesthetic appeal and practicality of the items they purchase.",
  "metrics": {
    "rouge1_f": 0.3052959501557633,
    "rouge2_f": 0.025078369905956115,
    "rougeL_f": 0.14953271028037385,
    "meteor": 0.142128091522471,
    "bleu1": 0.19647295341744325,
    "bleu2": 0.037919734832427984,
    "bleu3": 0.008088671180872807,
    "bleu4": 0.0037412139028750635,
    "bertscore_precision": 0.39960354566574097,
    "bertscore_recall": 0.43673834204673767,
    "bertscore_f1": 0.4173465371131897
  }
}