{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 3 Pieces Rhinestone Crystal Diamond Headband Wide Velvet Padded Hairbands Hair Party Wedding Headwear Accessories for Women Girls (Gold, Silver, Rainbow)\nReview Date: 2021/04/05\nStore: EBOOT\nAverage Rating: 4.5\nProduct Details: {'Age Range (Description)': 'Adult', 'Material': 'Plastic', 'Fabric Type': 'Velvet', 'Number of Items': '3', 'Brand': 'EBOOT', 'Package Dimensions': '9.29 x 9.25 x 2.09 inches; 9.98 Ounces'}\nReview Text: absolutely gorgeous and sparkly they did not come damaged no Stones were missing they look like they are made really well and should hold up for a long time but we shall see but so far so good and I am very happy with this purchase!!!!!\nReview Title: BEAUTIFUL!!!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Style Icon Lace Front Wigs Short Bob Wig Middle Part Wig for Women Synthetic Wig 130% Density Heat Resistant Replacement Wig (9.5 INCH, 1)\nStyle Icon\n{'Package Dimensions': '10.6 x 7.6 x 2.4 inches; 10.41 Ounces'}\nToo small..  hate it will be returning\nNope\nAfro Kinky Straight Ponytail,Yaki Straight Wrap Around Ponytail Hairpieces Heat Resistant Synthetic Clip in Ponytail Hair Extension (1B)\nSissi's Fashion Hair\n['Feature: * Easy to apply and ready to wear in minutes * Naturally blends into your own hair – people will not know you are wearing extensions * Glamorous new look without damaging your own hair * Provides secure yet comfortable attachment for all day wear * Reusable, Washable, Will keep style by using a little shampoo washed in cold water * Attached by a claw/crocodile clip with drawstring which will make you comfortable for all day * If you are not sure whether the hair color is match your hair, pls send your hair picture to us, we will give you some advise', 'HOW TO WASH THE HAIR EXTENSIONS', \"1.Comb your hair with a brush that has soft bristles or a comb with wire pin just before you wash it.This releases any tangles.It is best not to comb from top to ends one time if the hair is a curly style. 2.Wet your hair with lukewarm water.Hot water may be more comfortable,but it deteriorates the synthetic hair fibers and shortens the extensions' lifespan.Do not attempt to brush your synthetic hair extensions when they are wet. 3.Lather the hair and extensions with a mild shampoo without a bunch of unpronounceable chemicals as ingredients.All-natural is best. 4.Rinse the shampoo out of hair extensions.Use a hair conditioner that is very oily,like a deep conditioning treatment.Rinse off 90% but leave just a little in,to prevent tangling. 5.Towel-dry your hair as best you can and then allow nature to finish the process.Do not blow dry,this will cause a lot of useless tangles that will ruin your extensions.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7 x 5 x 3 inches; 5.28 Ounces'}\nIt's not horrible but it's also not what I was looking for I was looking for a yaki textured ponytail which is how they described it which is false advertising and this definitely is not it's very shiny and fake looking but it was only $13 so I don't see the point in taking it back but if you're looking for yaki texture then I wouldn't get this or u will be disappointed\nNot what I was hoping\nLagunamoon Gel Base and Top Coat,Long Lasting Glossy Top Coat for Soak Off UV LED Gel Nail Polish Polygel Nail Acrylic Style Artificial False Nails,2x10 ML\nLagunamoon\n{'Brand': 'Lagunamoon', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Material Feature': 'Cruelty Free, Vegan', 'Age Range (Description)': 'Adult', 'Unit Count': '2 Count', 'Number of Items': '2', 'Liquid Volume': '0.33 Fluid Ounces', 'Package Dimensions': '4 x 4 x 1.1 inches; 1.27 Ounces'}\nJust got it yesterday love it looks beautiful looks just like pictures and it was beautifully packaged unfortunately Amazon is not allowing anyone or maybe just me to post pictures at this moment or I would..... Haven't used product yet but will give updates when I do\nLovveeeee ❤️❤️❤️❤️\nfani 12 Inch Long Bob Human Hair Wigs with Straight Flat Bangs None Lace Front Wigs Natural Black Real Hair for Women\nfani\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Brand': 'Fani', 'Package Dimensions': '9.5 x 6 x 2 inches; 11.99 Ounces'}\nI love this hair at first I did not like it because the wig came curled at the ends and I didn't like that but I just flat ironed it and it looks just fine now, also I did not receive my free gifts but I reached out to the seller and they sent me 16 pairs of free hair clips because they were out of eyelashes so overall I'm happy with my experience.....\nOverall I'm happy!\nWig Grip Band Velvet Adjustable Non Slip Wig Grip with Middle Invisible Mesh for Women Lace Wigs (Black 1PCS)\nSUNiYA\n{'Material': 'Lace', 'Style': 'Modern', 'Brand': 'SUNiYA', 'Age Range (Description)': 'Adult', 'Cartoon Character': 'Black', 'Package Dimensions': '8.8 x 2.3 x 0.3 inches; 0.81 Ounces', 'UPC': '824918248299'}\nfinally exactly what I was looking for a black one they having brown & beige but it was really hard to find a black one like this but it's perfect and I love it it's just what I needed\nYes finally!!!!\nDÉBUT Lace Front Wigs Human Hair Wigs Loose Body 10A Brazilian Virgin Remy Hair Lace Parting 180% Density Natural Black (Middle Parting, 14 inches)\nDÉBUT\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Brand': 'DÉBUT', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.9 x 7.6 x 2.3 inches; 10.41 Ounces', 'Item model number': 'D&GW WH LACE ALL F MP LOOSE BODY14'}\nVery pretty hair love the wave pattern and the color came with two hair stockings and eyelashes the only reason I cannot keep it is because it's not big head friendly it is to tight and uncomfortable so unfortunately I will be having to return it\nNot BIG head friendly\nWIGENIUS Brazilian Short Human Hair Bob Wigs 150% Density Ombre Green Cut Bob Wigs Dark Roots Straight Center Part Lace Wigs with Pre-plucked Hairline 12 inch (T1B/Green)\nWIGENIUS\n{'Package Dimensions': '11.34 x 7.68 x 2.6 inches; 11.71 Ounces'}\nAbsolutely beautiful!!! I tested it doing the burn test and it's definitely 100% human hair the hair color is gorgeous like a hunter green it matched my plaid green and black dress perfectly I also got the dress on Amazon the belt and my fiance's matching shirt as well we took pictures for our holiday Christmas card for this year!!! The hair is very full and thick it's very silky the softest texture human hair I've ever had I would definitely highly recommend I will be getting this wig and a different color soon!!\nBeautiful green wig!!💚💚💚\n3 Pieces Rhinestone Crystal Diamond Headband Wide Velvet Padded Hairbands Hair Party Wedding Headwear Accessories for Women Girls (Gold, Silver, Rainbow)\nEBOOT\n{'Age Range (Description)': 'Adult', 'Material': 'Plastic', 'Fabric Type': 'Velvet', 'Number of Items': '3', 'Brand': 'EBOOT', 'Package Dimensions': '9.29 x 9.25 x 2.09 inches; 9.98 Ounces'}\nabsolutely gorgeous and sparkly they did not come damaged no Stones were missing they look like they are made really well and should hold up for a long time but we shall see but so far so good and I am very happy with this purchase!!!!!\nBEAUTIFUL!!!!!",
  "profile": "**User Summary:**\n\n- **Product Category Preference:** The user continues to prioritize high-quality wigs and hair extensions, successfully exploring human hair options while also appreciating premium synthetic products. Their beauty interest has notably expanded to include accessories like headbands, highlighting a keen eye for aesthetic appeal alongside functionality.\n\n- **Size and Fit Concerns:** Fit remains essential for the user, particularly regarding hair products, to ensure comfort and satisfaction.\n\n- **Quality Expectations:** The user consistently demands premium quality across all purchases, as evidenced by their positive experience with recently acquired beauty accessories. They value performance that aligns with advertised features, showcasing their commitment to quality.\n\n- **Return Behavior:** They are open to returning unsatisfactory items and consider lower-cost alternatives when returns aren't feasible. This reflects a focus on value and encourages thoughtful spending decisions.\n\n- **Rating Trends:** Adapting to past disappointments, the user has been providing high ratings for aesthetically appealing products. They celebrate quality in their beauty purchases, with recent reviews addressing satisfaction across attributes such as texture, design, and overall functionality.\n\n- **Recent Interaction:** The latest purchase demonstrates enthusiasm for beautifully crafted accessories, emphasizing that quality craftsmanship positively influences their buying choices. The user remains vigilant against misleading marketing while enjoying successful additions to their beauty repertoire.",
  "metrics": {
    "rouge1_f": 0.10995542347696878,
    "rouge2_f": 0.00744047619047619,
    "rougeL_f": 0.05200594353640416,
    "meteor": 0.049970202727831196,
    "bleu1": 0.004966270860356709,
    "bleu2": 0.0010989411737401433,
    "bleu3": 0.0001946040414702833,
    "bleu4": 8.196985646511331e-05,
    "bertscore_precision": 0.3440512418746948,
    "bertscore_recall": 0.440707802772522,
    "bertscore_f1": 0.3864270746707916
  }
}