{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: fani 12 Inch Long Bob Human Hair Wigs with Straight Flat Bangs None Lace Front Wigs Natural Black Real Hair for Women\nReview Date: 2020/06/23\nStore: fani\nAverage Rating: 2.9\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Brand': 'Fani', 'Package Dimensions': '9.5 x 6 x 2 inches; 11.99 Ounces'}\nReview Text: I love this hair at first I did not like it because the wig came curled at the ends and I didn't like that but I just flat ironed it and it looks just fine now, also I did not receive my free gifts but I reached out to the seller and they sent me 16 pairs of free hair clips because they were out of eyelashes so overall I'm happy with my experience.....\nReview Title: Overall I'm happy!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Style Icon Lace Front Wigs Short Bob Wig Middle Part Wig for Women Synthetic Wig 130% Density Heat Resistant Replacement Wig (9.5 INCH, 1)\nStyle Icon\n{'Package Dimensions': '10.6 x 7.6 x 2.4 inches; 10.41 Ounces'}\nToo small..  hate it will be returning\nNope\nAfro Kinky Straight Ponytail,Yaki Straight Wrap Around Ponytail Hairpieces Heat Resistant Synthetic Clip in Ponytail Hair Extension (1B)\nSissi's Fashion Hair\n['Feature: * Easy to apply and ready to wear in minutes * Naturally blends into your own hair – people will not know you are wearing extensions * Glamorous new look without damaging your own hair * Provides secure yet comfortable attachment for all day wear * Reusable, Washable, Will keep style by using a little shampoo washed in cold water * Attached by a claw/crocodile clip with drawstring which will make you comfortable for all day * If you are not sure whether the hair color is match your hair, pls send your hair picture to us, we will give you some advise', 'HOW TO WASH THE HAIR EXTENSIONS', \"1.Comb your hair with a brush that has soft bristles or a comb with wire pin just before you wash it.This releases any tangles.It is best not to comb from top to ends one time if the hair is a curly style. 2.Wet your hair with lukewarm water.Hot water may be more comfortable,but it deteriorates the synthetic hair fibers and shortens the extensions' lifespan.Do not attempt to brush your synthetic hair extensions when they are wet. 3.Lather the hair and extensions with a mild shampoo without a bunch of unpronounceable chemicals as ingredients.All-natural is best. 4.Rinse the shampoo out of hair extensions.Use a hair conditioner that is very oily,like a deep conditioning treatment.Rinse off 90% but leave just a little in,to prevent tangling. 5.Towel-dry your hair as best you can and then allow nature to finish the process.Do not blow dry,this will cause a lot of useless tangles that will ruin your extensions.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7 x 5 x 3 inches; 5.28 Ounces'}\nIt's not horrible but it's also not what I was looking for I was looking for a yaki textured ponytail which is how they described it which is false advertising and this definitely is not it's very shiny and fake looking but it was only $13 so I don't see the point in taking it back but if you're looking for yaki texture then I wouldn't get this or u will be disappointed\nNot what I was hoping\nLagunamoon Gel Base and Top Coat,Long Lasting Glossy Top Coat for Soak Off UV LED Gel Nail Polish Polygel Nail Acrylic Style Artificial False Nails,2x10 ML\nLagunamoon\n{'Brand': 'Lagunamoon', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Material Feature': 'Cruelty Free, Vegan', 'Age Range (Description)': 'Adult', 'Unit Count': '2 Count', 'Number of Items': '2', 'Liquid Volume': '0.33 Fluid Ounces', 'Package Dimensions': '4 x 4 x 1.1 inches; 1.27 Ounces'}\nJust got it yesterday love it looks beautiful looks just like pictures and it was beautifully packaged unfortunately Amazon is not allowing anyone or maybe just me to post pictures at this moment or I would..... Haven't used product yet but will give updates when I do\nLovveeeee ❤️❤️❤️❤️\nfani 12 Inch Long Bob Human Hair Wigs with Straight Flat Bangs None Lace Front Wigs Natural Black Real Hair for Women\nfani\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Brand': 'Fani', 'Package Dimensions': '9.5 x 6 x 2 inches; 11.99 Ounces'}\nI love this hair at first I did not like it because the wig came curled at the ends and I didn't like that but I just flat ironed it and it looks just fine now, also I did not receive my free gifts but I reached out to the seller and they sent me 16 pairs of free hair clips because they were out of eyelashes so overall I'm happy with my experience.....\nOverall I'm happy!",
  "profile": "**User Summary:**\n\n- **Product Category Preference:** The user has a strong preference for wigs and hair extensions, especially high-quality synthetic options with a focus on realism and texture. Their recent engagement with beauty products, particularly gel nail treatments, indicates an expanding interest in personal care items.\n\n- **Size and Fit Concerns:** They prioritize well-fitting products and have previously experienced dissatisfaction with sizing, particularly in hair-related purchases.\n\n- **Quality Expectations:** The user has a clear demand for premium quality, as evidenced by critical reviews on product discrepancies. They uphold expectations for performance that aligns with advertised features across all purchases, including new beauty items.\n\n- **Return Behavior:** The user is willing to return unsatisfactory items yet often opts for lower-cost alternatives when returns are unfeasible, highlighting a focus on value for money.\n\n- **Rating Trends:** Consistently dissatisfied when products do not meet expectations, the user carefully selects items based on criteria such as quality, appearance, and comfort. Their recent positive review of a wig reflects a willingness to adapt and find satisfaction in new products, especially when they can be modified to meet personal preferences.\n\nIn summary, the user seeks high-quality, realistic wigs with a strong emphasis on fit and texture, while remaining increasingly open to other beauty products, with a continued commitment to value and an aversion to misleading marketing claims across all purchases.",
  "metrics": {
    "rouge1_f": 0.1901639344262295,
    "rouge2_f": 0.015334063526834609,
    "rougeL_f": 0.07650273224043716,
    "meteor": 0.09125321076111936,
    "bleu1": 0.05455223133008981,
    "bleu2": 0.012472238819029093,
    "bleu3": 0.0020726307893467236,
    "bleu4": 0.0008456775586604272,
    "bertscore_precision": 0.3502807021141052,
    "bertscore_recall": 0.43076422810554504,
    "bertscore_f1": 0.38637569546699524
  }
}