{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tyler Perry's Madea's Big Happy Family [DVD]\nReview Date: 2013/06/02\nStore: Tyler Perry  (Actor, Director),     Loretta Devine  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Madea, everyone’s favorite wise-cracking, take-no-prisoners grandma, jumps into action when her niece, Shirley, receives distressing news about her health. All Shirley wants is to gather her three adult children around her and share the news as a family. But Tammy, Kimberly and Byron are too distracted by their own problems: Tammy can’t manage her unruly children or her broken marriage; Kimberly is gripped with anger and takes it out on her husband; and Byron, after spending two years in jail, is under pressure to deal drugs again. It’s up to Madea, with the help of the equally rambunctious Aunt Bam, to gather the clan together and make things right the only way she knows how: with a lot of tough love, laughter…and the revelation of a long-buried family secret.', 'Amazon.com', \"Tyler Perry's entertainment empire continues its long march toward ubiquity with another installment chronicling the slapstick soap opera lives of the squabbling Simmons/Brown family. For Perry fans, who are legion, the fact that his output of movie and TV projects keeps growing larger than the bust lines of his matriarchal characters is nothing but good news. And\", \"Madea's Big Happy Family\", \"will certainly be the crowd-pleasingly funny, moralistic piece of uplifting fluff that they have every right to expect from the multi-hyphenated man on the throne. Based on one of his popular road show plays (as were many of his other movies), this one features as big and juicy a role for his in-drag alter ego as any. The pistol-packing, vitriol-spewing Madea steals the show all over the place, whether she's raging with one-liner insults, babbling down-home homilies, sweet-talking, or slapping someone silly. Perry also gives himself even more in-character fun playing crotchety old Uncle Joe, who has some choice observations about the obesity that's on display among more than half the cast. The story centers on Madea's niece Shirley (Loretta Devine, giving the only performance that's anywhere near understated), who is quickly succumbing to cancer, but resigned that it's God's will, and is OK with it because she'll soon be going home to Jesus. Her dying wish is to gather her loved ones to break the news, a task that proves nearly impossible given how fractious every single relationship is involving the lives of her children and extended family. Yes, the family is certainly big--but happy?--not so much. Swooping down on them in her bouncing boat of a broken-down Cadillac, Madea orders them together and orchestrates the many revelatory or shocking crises and catharses that finally bring some closure to the bickering. It's done in typical Tyler Perry fashion with bursts of pop-Christian and pop-psychological moralizing filtered straight outta Madea's motor-mouth and standup comic delivery. The men fare better than the women in Perry's philosophical, literary, and directorial intention. Without exception, the young female characters are portrayed as horrible shrews, and their men burdened providers who require the backhanded wisdom of Madea to set everyone straight. In his own performance and in the funny, sad, or inspirational messages laced throughout, Perry is playing to his core demographic to great effect. Though unremarkable in its stylistic and technical specifications,\", \"Madea's Big Happy Family\", 'has all the right stuff to fill the hearts and souls of all those who appreciate his very specific brand of ethnic family values. And that seems to be a group that grows with every project bearing his imprimatur.', '--Ted Fry']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Loretta Devine, Tyler Perry, Bow Wow, Natalie Desselle, Shannon Kane', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '64804845805', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Tyler Perry, Loretta Devine, Natalie Desselle, Shannon Kane, Bow Wow', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: one of the funniest movies I've seen..Tyler Perry came up with a winner..I would recommend this movie will tickle ur funnybone\nReview Title: madea's happy family\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Disappearance [VHS]\nHarry Hamlin  (Actor),     Susan Dey  (Actor),     Walter Klenhard  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n[\"Weaver, New Mexico... Population 0... is about to welcome its latest visitors. Or are they victims? For the Henley family is about to discover why Weaver is the last place on earth you want to be stranded. Everybody has disappeared without a trace. Even the town has vanished from the map. An unseen and malicious force stalks this town, and it's not going to let them escape without a fight!\"]\n{'Format': 'Closed-captioned, Color, NTSC', 'Contributor': \"Rob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy Lelliott, Basia A'Hern, Susan DeyRob MacPherson, Jamie Croft, Victoria Dixon-Whittle, Nikki Fort, Brad Gordon, Ashley Aitken, Jeremy Kewley, Laurie Goldstein, Annie Carter, Ian Boyce, Philip K. Kleinbart, Robert Greenwald, Roger Newcombe, Harry Hamlin, Walter Klenhard, Michael O. Gallant, Jeremy L…   See more\", 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 32 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Walter Klenhard', 'Run time': '1 hour and 32 minutes', 'Release date': 'January 21, 2003', 'Date First Available': 'September 29, 2006', 'Actors': \"Harry Hamlin, Susan Dey, Jeremy Lelliott, Basia A'Hern, Jamie Croft\", 'Studio': 'New Concorde', 'Producers': 'Ashley Aitken, Brad Gordon, Laurie Goldstein, Michael O. Gallant, Philip K. Kleinbart', 'Writers': 'Walter Klenhard'}\nThis is a very good creepy and erie movie. Has alot of suspense and mystery. If you like Harry Hamlin and Susan Day of the Partridge Family I well reccommened this movie.\ndiaaappearence\nThe Family That Preys (Full Screen Edition)\nKathy Bates  (Actor),     Alfre Woodard  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Full Screen edition. Working-class Alice (Academy Award nominee Alfre Woodard) and wealthy Charlotte (Academy Award winner Kathy Bates) are friends and mothers who have supported each other through all that their families have gone through over the years. But now their families are embroiled in new turmoil - with each other. Can the two women save their children from the dark secrets and dirty deeds that threaten to destroy them all?', 'Amazon.com', 'Academy Award®-winner Kathy Bates (Lead Actress,', 'Misery', ', 1990) and Academy Award®-nominee Alfre Woodard (Supporting Actress,', 'Cross Creek', ', 1983) star as the matriarchs of two very different families being torn apart by greed and scandal in the contemporary drama', \"Tyler Perry's The Family That Preys\", '. The sixth feature film by Perry chronicles the inner workings of two families—one upper-crust and the other working class—that become inextricably linked by scandal. Wealthy socialite Charlotte Cartwright (Kathy Bates) and her dear friend Alice Pratt (Alfre Woodard), a working class woman of high ideals, have enjoyed a lasting friendship throughout many years. Suddenly, their lives become mired in turmoil as their adult children’s extramarital affairs, unethical business practices and a dark paternity secret threaten to derail family fortunes and unravel the lives of all involved. Alice’s self-centered newlywed daughter Andrea (Sanaa Lathan) is betraying her trusting husband Chris (Rockmond Dunbar) by engaging in a torrid affair with her boss and mother’s best friend’s son William (Cole Hauser). While cheating on his wife Jillian (KaDee Strickland) with a string of ongoing dalliances with his mistress Andrea, William’s true focus is to replace the COO of his mother’s lucrative construction corporation. Meanwhile, Alice’s other daughter Pam (Taraji P. Henson), a kind but no nonsense woman married to a hard working construction worker (Tyler Perry), tries to steer the family in a more positive direction. While paternity secrets, marital infidelity, greed and unsavory business dealings threaten to derail both families, Charlotte and Alice decide to take a breather from it all by making a cross-country road trip in which they rediscover themselves and possibly find a way to save their families from ruin in', \"Tyler Perry's The Family That Preys\", '.', 'Beyond', \"Tyler Perry's The Family That Preys\", 'on DVD', \"Tyler Perry's Meet the Browns\", 'on DVD', \"Tyler Perry's Why Did I Get Married\", 'on DVD', \"Tyler Perry's Daddy's Little Girls\", 'on DVD']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Contributor': 'Rockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana PruittRockmond Dunbar, Robin Givens, Sanaa Lathan, Cole Hauser, Alfre Woodard, Tyler Perry, Kaira Akita, Taraji P. Henson, Sebastian Siegel, KaDee Strickland, Kathy Bates, Santana Pruitt  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Item model number': 'LGT24756DVD', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 51 minutes', 'Release date': 'January 13, 2009', 'Actors': 'Kathy Bates, Alfre Woodard, Sanaa Lathan, Rockmond Dunbar, KaDee Strickland', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Writers': 'Tyler Perry', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWell worth seeing one of Tyler Perrys best movies!!!  I would reccommened this movie to any one that is a Tyler Peerry fan.\nthe family that preys together\nTyler Perry's Madea's Big Happy Family [DVD]\nTyler Perry  (Actor, Director),     Loretta Devine  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'Madea, everyone’s favorite wise-cracking, take-no-prisoners grandma, jumps into action when her niece, Shirley, receives distressing news about her health. All Shirley wants is to gather her three adult children around her and share the news as a family. But Tammy, Kimberly and Byron are too distracted by their own problems: Tammy can’t manage her unruly children or her broken marriage; Kimberly is gripped with anger and takes it out on her husband; and Byron, after spending two years in jail, is under pressure to deal drugs again. It’s up to Madea, with the help of the equally rambunctious Aunt Bam, to gather the clan together and make things right the only way she knows how: with a lot of tough love, laughter…and the revelation of a long-buried family secret.', 'Amazon.com', \"Tyler Perry's entertainment empire continues its long march toward ubiquity with another installment chronicling the slapstick soap opera lives of the squabbling Simmons/Brown family. For Perry fans, who are legion, the fact that his output of movie and TV projects keeps growing larger than the bust lines of his matriarchal characters is nothing but good news. And\", \"Madea's Big Happy Family\", \"will certainly be the crowd-pleasingly funny, moralistic piece of uplifting fluff that they have every right to expect from the multi-hyphenated man on the throne. Based on one of his popular road show plays (as were many of his other movies), this one features as big and juicy a role for his in-drag alter ego as any. The pistol-packing, vitriol-spewing Madea steals the show all over the place, whether she's raging with one-liner insults, babbling down-home homilies, sweet-talking, or slapping someone silly. Perry also gives himself even more in-character fun playing crotchety old Uncle Joe, who has some choice observations about the obesity that's on display among more than half the cast. The story centers on Madea's niece Shirley (Loretta Devine, giving the only performance that's anywhere near understated), who is quickly succumbing to cancer, but resigned that it's God's will, and is OK with it because she'll soon be going home to Jesus. Her dying wish is to gather her loved ones to break the news, a task that proves nearly impossible given how fractious every single relationship is involving the lives of her children and extended family. Yes, the family is certainly big--but happy?--not so much. Swooping down on them in her bouncing boat of a broken-down Cadillac, Madea orders them together and orchestrates the many revelatory or shocking crises and catharses that finally bring some closure to the bickering. It's done in typical Tyler Perry fashion with bursts of pop-Christian and pop-psychological moralizing filtered straight outta Madea's motor-mouth and standup comic delivery. The men fare better than the women in Perry's philosophical, literary, and directorial intention. Without exception, the young female characters are portrayed as horrible shrews, and their men burdened providers who require the backhanded wisdom of Madea to set everyone straight. In his own performance and in the funny, sad, or inspirational messages laced throughout, Perry is playing to his core demographic to great effect. Though unremarkable in its stylistic and technical specifications,\", \"Madea's Big Happy Family\", 'has all the right stuff to fill the hearts and souls of all those who appreciate his very specific brand of ethnic family values. And that seems to be a group that grows with every project bearing his imprimatur.', '--Ted Fry']\n{'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Loretta Devine, Tyler Perry, Bow Wow, Natalie Desselle, Shannon Kane', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': '64804845805', 'Director': 'Tyler Perry', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 47 minutes', 'Release date': 'August 30, 2011', 'Actors': 'Tyler Perry, Loretta Devine, Natalie Desselle, Shannon Kane, Bow Wow', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Number of discs': '1'}\none of the funniest movies I've seen..Tyler Perry came up with a winner..I would recommend this movie will tickle ur funnybone\nmadea's happy family",
  "profile": "**Updated User Profile Summary:**\n\nThe user has recently expanded their media preferences to include comedy films, particularly those produced by Tyler Perry, indicating a newfound appreciation for humor within their film consumption. While they continue to favor drama films with emotional depth and suspense, this latest interest suggests they value diverse storytelling that can elicit laughter alongside drama.\n\nTheir affinity for established actors remains strong, with interest now encompassing performers like Tyler Perry and Loretta Devine, complementing their previous favorites and reflecting a broader appreciation for notable talents in both dramatic and comedic roles.\n\nThe user is consistently open to various formats, as evidenced by their willingness to purchase DVDs, while maintaining a focus on quality narratives across genres. Their rating behavior continues to showcase a penchant for high-quality cinematic experiences, as highlighted by their recent 5-star review, no matter the genre. \n\nOverall, the user can be characterized as someone who enjoys emotionally charged narratives, values strong performances, and is now appreciating comedic elements in storytelling, maintaining a strong focus on family dynamics and moral complexities throughout their film choices.",
  "metrics": {
    "rouge1_f": 0.10598834128245896,
    "rouge2_f": 0.00636604774535809,
    "rougeL_f": 0.04981452040275569,
    "meteor": 0.03199099384216815,
    "bleu1": 1.8795554834351327e-05,
    "bleu2": 6.969988934829538e-06,
    "bleu3": 3.0765590727205033e-06,
    "bleu4": 8.744608235064025e-07,
    "bertscore_precision": 0.3239869177341461,
    "bertscore_recall": 0.47764527797698975,
    "bertscore_f1": 0.38608935475349426
  }
}