{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Morovan Gel Nail Polish Remover Kit - 16oz Gel Polish Remover Professional Remover Liquid Set with Soak-Off Clip Cuticle Pusher Nail File Quick Easy Remove UV Gel Polish Glitter Powder\nReview Date: 2022/01/19\nStore: Morovan\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Morovan', 'Item Weight': '16 Ounces', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.23 x 5.39 x 3.43 inches; 1 Pounds'}\nReview Text: I recently purchased a gel nail polish set for myself. Of course I needed the removing kit to go with it. I chose this one because it really seemed like the whole kit. And it is. I was able to open this box and use it right away. Everything from tools to the remover is included. The 16 ounces of remover is a generous amount and should last me a while.<br /><br />I am pleased with how the remover works and the entire kit has made taking off my gel polish very easy.\nReview Title: Remover kit\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Pretty Frank Natural Deodorant - No Aluminum Deodorant for Women, Men, Teens, & Kids – Paraben Sulfate Free Solid Deodorant Featuring Shea Butter, Coconut Oil, Vitamin E & Baking Soda (Lavender)\nPRETTY FRANK\n{'Brand': 'PRETTY FRANK', 'Item Form': 'Powder', 'Scent': 'Lavender, Coconut', 'Material Feature': 'Natural', 'Number of Items': '1', 'Package Dimensions': '5.87 x 5.12 x 1.14 inches; 4.23 Ounces', 'Item model number': 'DSF-BS-LAV'}\nIn the past, I have not had good experience with baking soda deodorant. Usually, my armpits breakout in a red rash. However, I have not had this deodorant irritate my skin.<br /><br />The lavender scent is earthy and natural. It has a deep lavender scent that is fairly strong. As it is a more natural deodorant, it does not glide like the big name brands. It has a slight moisture to it and by warming the deodorant, it slide slightly better.<br /><br />I have noticed that I need to reapply. Depending on my activity level, I have had to reapply two or three times throughout a day. I think the important thing to remember with these natural deodorants is to not expect them to perform like the big name brands. They provide minimal long term fragrance as well as sweat protection.\nPowerful initial scent\nBath Body Brush with Super Comfy Bristles for Universal Skin,Long Bamboo Handle Gentle Exfoliation Improve Skin's Health and Beauty Wet or Dry Brushing Back Scrubber for Shower\nZhaoyun\n['Bath Body Exfoliating Brush,Shower Back Cleaning Scrubber with Long Handle,Dry or Wet Skin Exfoliator Brush with Soft Bristles Back Washer', 'Perfect for Daily Hygiene and Sensitive Skin.', 'Soft Nylon Bristles Be Easier to produce abundant foam,Just add some gel on it and rub the bristles.', 'This Brush will help you a better bath experience, Feel Fresh and Renewed Every Day.', 'Long Reach Handle', 'The Extended 16 inches Long Handle Will Use More Friendly.', 'Note：this brush bristles is too soft so if you want to exfoliate, we recommend using it with a body scrub.']\n{'Product Dimensions': '17 x 4 x 2 inches; 7.55 Ounces', 'Manufacturer': 'Zhaoyun'}\nI have been using a loofah but I feel like I wanted something that could easily reach my entire back without having to be a total contortionist in the shower. A brush with handle seemed like the obvious choice.<br /><br />The first one I bought had bristles on it and it was so hard it hurt to use so I couldn’t even bear the discomfort on my back. That one was better for scrubbing feet or less sensitive areas.<br /><br />This one is completely different and luxurious. The handle is a thick bamboo that is sealed. It’s a neutral colored wood but very attractive. There is some wrapped smooth rope on the base of the brush for holding. It makes the brush less slick when it’s wet and soapy. There is also a hole with a piece of that same rope for hanging. I use the rope to hang the body brush off of my shower caddy.<br /><br />The bristles are extremely soft! They are pure white and have been cut so that they have a texture for the skin.  The bristles are tightly positioned and there are a ton of tiny ones. They are as soft it not softer than some of my smoothest make up brushes. It’s soft enough that it could be used on my skin without irritating it.<br /><br />Now the flip side is that because it is so soft there isn’t any exfoliating action. I wouldn’t mind some slightly more rigid like a loofah for really deep cleaning. It’s even softer than a wash cloth but closer to a makeup cloth. This brush is really going to depend on the user and the need. It’s not for exfoliating.\nSoftest soft, not for exfoliating\nDisney Frozen - Townley Girl Mega Nail Set with Nail Dryer Foldable Gift Set for Parties, Sleepovers and Makeovers\nTownley Girl\n{'Package Dimensions': '11.18 x 11.06 x 2.8 inches; 1.87 Pounds', 'Item model number': 'FZ2169GA', 'UPC': '719565451850'}\nThis is a huge set with a lot of color options. Everything needed from start to finish for little nails is included.<br /><br />There are two cubed nail files and buffers with the frozen nature, Anna, and Elsa printed on them. The nail polishes are very Arendelle<br />colors. Blue, purple, green, yellow, and orange are the main color themes in the set. They are natural and remind us of the elements; trees, water, ice, etc. There is a nail dryer that is in the shade of purple with an Elsa and Ana sticker on the front. It’s a petite size and perfect for little princess hands. I like that the battery case is enclosed with two tiny screws. They are safe and the children are unable to get to them. After the nails have been dried there are various gemstones and stickers that can be used. They are a small size and work for toddler and up. The gemstones are a little bit bigger and a little large on my toddler‘s fingers.  However the size is ideal for a child’s finger nails.<br /><br />My daughter has had so much fun with this kit. There are a ton of options for color. Naturally with so much to choose from, she never wants any one fingernail painted the same.<br /><br />The bottles have all been easy to open and use. They each have a different color as well as a different sticker for the handle of the nail polish. Again, everything is Frozen theme so it’s a huge draw for my little Frozen lover.<br /><br />Also this is a completely gift-able set. Every piece is nicely displayed and not one had come dislodged from the packaging prematurely.\nMega options indeed\nHeadbands for Woman Pearls Headbands,Logiverl 2PCS Pearls Headband Elegant Hair Clip Hairpins Headwear Barrette Styling Tools Accessories for Christmas Gift\nLogiverl\n{'Age Range (Description)': 'Adult', 'Material': 'velvet', 'Fabric Type': 'Velvet', 'Number of Items': '2', 'Brand': 'Logiverl', 'Package Dimensions': '7.6 x 5.3 x 1.3 inches; 3.21 Ounces', 'UPC': '682365963406'}\nThese headbands are extremely soft not only on the top but also on the bottom. They are wider in width so they have a very light feel on the head. They are larger and the puffiness on the top of them gives them a Renaissance feel. Inside the satin fabric that is braided, there are pearls throughout. The pearl accents give it an extra something special. They do feel very old world to me and they look adorable with outfits I put my daughter in. She has worn them with both dresses and pants.  I have had an occasional pearl accent fall off so they are more delicate than I would have hoped for.\nRenaissance head bands\nNxconsu 12Pcs Headbands for Women Girls Teens Elastic Hair Bands Silky Solid Colors Pleated Crinkle Head Band Fashion Trendy Outfit Colorful Thin Comfortable Hair Accessories for Home Work Gym Casual\nNxconsu\n{'Material': 'Plastic', 'Fabric Type': 'elastic', 'Number of Items': '1', 'Brand': 'Nxconsu', 'Size': '12 Count (Pack of 1)', 'Package Dimensions': '11.06 x 9.76 x 1.46 inches; 6.38 Ounces'}\nThese hairbands have a plastic interior. They are thinner in width and have enough gives that they work well for both children and adult heads. While the plastic is covered in a soft material that is ruched, the ends are a little bit harder. They have been folded but there is some glue and they aren’t completely without flaw.  I would say quality falls into the average lane.  Some of them have more glue visible than others but overall they’ve been done well enough. The key for the area that goes behind the ears is to position it so it’s not directly on the skin but more on hair. Another thing I like about these hairbands is that the set contains a large variety of colors.  Literally any outfit color or style should have a match in this set.\nHarder ends with glue\nS SNUOY Purple Crystal Vintage Queen Crowns Baroque Tiaras Wedding Bridal Queen Tiaras and Crowns for Women and Girls Party Headbands\nS SNUOY\n{'Package Dimensions': '7.17 x 4.88 x 4.33 inches; 4.66 Ounces'}\nThis tiara is stunning. Even though it’s for play/dress up it’s very attractive. The tiara is mainly a rose gold color on the metal. It has fine detail around the headband of the tiara. Each delicate flower is antique looking. The metal is darkened in areas. The gemstones in the leaves are a light pink/purple color. The other gemstones are other various shades of purple. There’s a deep purple that is almost red and a purple that’s in the middle of the light and dark. The tiara is substantial. It’s not sharp despite looking like it has many sharp pieces to it. I will say a few of the rhinestones that set up on top of the metal decoration were bent. I was able to bend them back ever so slightly. Of course I worry too much bending may break the tiara.<br /><br />It fits well on the head and it is quite comfortable. It’s a attractive tiara and definitely one that’s more for an adult or teen head. I wouldn’t consider something like this for a child. It’s definitely larger for a larger head.\nStunning overall\nIce Globes for Facials, 2Pcs Cooling Facial Globes for Facial Massage, Tighten Skin, Reduce Puffiness and Dark Circles (Two-color)\nFeijie\n{'Package Dimensions': '6.65 x 4.69 x 2.44 inches; 8.47 Ounces', 'UPC': '705887428892', 'Manufacturer': 'Feijie'}\nThese ice globes have a nice pop of color. Each globe is colorful, smooth and well made. I find these to be helpful to use both alone and in home spa care. After I have done a mask or an exfoliating treatment, I find these globes to be soothing. You can control how cold you get them by how long you leave them in the fridge or let them sit out a bit before using. I think they relieve tension and stress significantly. They are easy to use and straightforward too. Keeping them clean is easy to do as soap and water is all you need. I really like the way they feel on my skin and how they truly help me to relax.\nRelieves tension and stress\nMorovan Gel Nail Polish Remover Kit - 16oz Gel Polish Remover Professional Remover Liquid Set with Soak-Off Clip Cuticle Pusher Nail File Quick Easy Remove UV Gel Polish Glitter Powder\nMorovan\n{'Brand': 'Morovan', 'Item Weight': '16 Ounces', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.23 x 5.39 x 3.43 inches; 1 Pounds'}\nI recently purchased a gel nail polish set for myself. Of course I needed the removing kit to go with it. I chose this one because it really seemed like the whole kit. And it is. I was able to open this box and use it right away. Everything from tools to the remover is included. The 16 ounces of remover is a generous amount and should last me a while.<br /><br />I am pleased with how the remover works and the entire kit has made taking off my gel polish very easy.\nRemover kit",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Remover kit",
    "text": "I recently purchased a gel nail polish set for myself. Of course I needed the removing kit to go with it. I chose this one because it really seemed like the whole kit. And it is. I was able to open this box and use it right away. Everything from tools to the remover is included. The 16 ounces of remover is a generous amount and should last me a while.<br /><br />I am pleased with how the remover works and the entire kit has made taking off my gel polish very easy.",
    "images": [],
    "asin": "B09LLKBZ3S",
    "parent_asin": "B09LLKBZ3S",
    "user_id": "AHCR53CDYDQAS6C5TZXQWB4PWTCQ",
    "timestamp": "2022-01-19 03:19:26.079000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Morovan Gel Nail Polish Remover Kit - 16oz Gel Polish Remover Professional Remover Liquid Set with Soak-Off Clip Cuticle Pusher Nail File Quick Easy Remove UV Gel Polish Glitter Powder",
    "average_rating": 4.1,
    "rating_number": 256,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51BRvoTW8GL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51BRvoTW8GL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71zlIYIjefL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51FP119+YuL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51FP119+YuL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71xPQNIRIpL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/518TWN1Aw8L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/518TWN1Aw8L.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71KT9-NlXAL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51B17xH-caL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51B17xH-caL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71kNCTzLo3L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/516vX9G5-RL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/516vX9G5-RL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71EQRIBCK-L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/4117TnV5-DL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/4117TnV5-DL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71C9kp+6koL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51qkoU6C6AL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51qkoU6C6AL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71d0t5v1RFL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41eAgeIv0BL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41eAgeIv0BL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/61aeJ1ykejL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Gel Nail Polish Remover for Beginners - Quick Easy Removal",
        "url": "https://www.amazon.com/vdp/0347157e191743a382593557326ec769?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Morovan",
    "categories": [],
    "details": {
      "Brand": "Morovan",
      "Item Weight": "16 Ounces",
      "Unit Count": "1.00 Count",
      "Package Dimensions": "8.23 x 5.39 x 3.43 inches; 1 Pounds"
    },
    "bought_together": null
  }
}