{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Replacement Toothbrush Heads Compatible For Oral-B Braun Electric Toothbrush ,Sensitive brush heads Extra soft bristles. 8 Count\nReview Date: 2019/01/17\nStore: YuanJian\nAverage Rating: 4.2\nProduct Details: {'Brand': 'YuanJian', 'Age Range (Description)': 'Kid', 'Item Firmness Description': 'Extra Soft', 'Number of Pieces': '8', 'Item Form': 'ROUND', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.43 x 0.39 x 2.76 inches; 0.81 Ounces', 'UPC': '633337444805'}\nReview Text: I have used several Oral-B model toothbrushes over the years and have tried many different brush heads.  I always come back to the standard size like this one.  It just fits my mouth and gums better than the larger ones.  These generic replacement heads works just fine.  There are subtle differences.  The extra soft is more like a soft.  Not near as firm as some replacements heads I've tried though.  That's good.  I think they slide onto the motor easier than the originals.  I really can't see any reason to pay more for the original brush heads.  These are a good value.\nReview Title: Good replacement brush for a lot less money.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Replacement Toothbrush Heads Compatible For Oral-B Braun Electric Toothbrush ,Sensitive brush heads Extra soft bristles. 8 Count\nYuanJian\n{'Brand': 'YuanJian', 'Age Range (Description)': 'Kid', 'Item Firmness Description': 'Extra Soft', 'Number of Pieces': '8', 'Item Form': 'ROUND', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.43 x 0.39 x 2.76 inches; 0.81 Ounces', 'UPC': '633337444805'}\nI have used several Oral-B model toothbrushes over the years and have tried many different brush heads.  I always come back to the standard size like this one.  It just fits my mouth and gums better than the larger ones.  These generic replacement heads works just fine.  There are subtle differences.  The extra soft is more like a soft.  Not near as firm as some replacements heads I've tried though.  That's good.  I think they slide onto the motor easier than the originals.  I really can't see any reason to pay more for the original brush heads.  These are a good value.\nGood replacement brush for a lot less money.",
  "profile": "**User Profile Summary:**\n\n- **Product Type Preference:** Favors replacement toothbrush heads, particularly for compatibility with specific electric toothbrush models. Leaning towards generic or value alternatives over original brands.\n\n- **Brushing Sensitivity:** Opts for soft or extra soft bristles, indicating a preference for gentle oral care that is less abrasive, likely due to sensitivity concerns.\n\n- **Value-Conscious:** Values cost-effectiveness, expressing satisfaction with generic options that perform adequately compared to more expensive originals.\n\n- **Size Preference:** Prefers standard-sized brush heads over larger options, suggesting a need for comfort and fit within the mouth.\n\n- **User Experience:** Has experience with multiple brands and models, indicating a knowledgeable perspective on dental care tools. Prefers options that deliver similar performance to premium brands without the higher price.\n\n- **Overall Satisfaction:** Generally positive toward products that meet personal comfort and effectiveness criteria, rating them favorably while providing constructive feedback on performance nuances.\n\nThis profile reflects a user who is practical, cost-effective, and attentive to their oral health needs, prioritizing gentleness and comfort in their dental care products.",
  "metrics": {
    "rouge1_f": 0.28152492668621704,
    "rouge2_f": 0.041297935103244844,
    "rougeL_f": 0.12903225806451613,
    "meteor": 0.16679777535156723,
    "bleu1": 0.23555555555555555,
    "bleu2": 0.0648563736756011,
    "bleu3": 0.012355684793958802,
    "bleu4": 0.005398981902954876,
    "bertscore_precision": 0.4438752830028534,
    "bertscore_recall": 0.44608423113822937,
    "bertscore_f1": 0.4449770152568817
  }
}