{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The League of Extraordinary Gentlemen (Widescreen Edition)\nReview Date: 2004/06/13\nStore: Sean Connery  (Actor),     Stuart Townsend  (Actor),     Stephen Norrington  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure/Superheroes', 'Format': 'Multiple Formats, Closed-captioned, Color, Anamorphic, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': \"Tom Goodman-Hill, Tony Curran, David Hemmings, Stephen Norrington, Stuart Townsend, Alan Moore, Bruce Devan, Peta Wilson, Jason Flemyng, Shane West, Terry O'Neill, Naseeruddin Shah, James Robinson, Michael Nelson, Max Ryan, Don Murphy, Mark Gordon, Richard Roxburgh, Sean Connery, Kevin O'NeillTom Goodman-Hill, Tony Curran, David Hemmings, Stephen Norrington, Stuart Townsend, Alan Moore, Bruce Devan, Peta Wilson, Jason Flemyng, Shane West, Terry O'Neill, Naseeruddin Shah, James Robinson, Michael Nelson, Max Ryan, Don Murphy, Mark Gordon,…  See more\", 'Language': 'English', 'Runtime': '1 hour and 50 minutes'}\nReview Text: I was hoping for so much more, especially with Sean Connery in it. It start off well enough but descended into absurdity soon after the entrance on Mr Hyde. After awhile you forget what the plot was originally meant to be. The special effects are good in places, not so in others.A good movie needs more than special effects, it needs a story and characters you can relate to. I am sure any sequel will be stright to video/DVD as I am sure Connery won't be in it, though his character probably will. All that said it's entertaining for kids when there's nothing else to watch on TV.\nReview Title: Disappointment\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Terminator 3: Rise of the Machines (Two-Disc Widescreen Edition)\nArnold Schwarzenegger  (Actor),     Nick Stahl  (Actor),     Jonathan Mostow  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Futuristic\n['Product Description', 'A decade has passed since John Connor (NICK STAHL) helped prevent Judgment Day and save mankind from mass destruction. Now 25, Connor lives \"off the grid\" - no home, no credit cards, no cell phone and no job. No record of his existence. No way he can be traced by Skynet - the highly developed network of machines that once tried to kill him and wage war on humanity. Until?out of the shadows of the future steps the T-X (KRISTANNA LOKEN), Skynet\\'s most sophisticated cyborg killing machine yet. Sent back through time to complete the job left unfinished by her predecessor, the T-1000, this machine is as relentless as her human guise is beautiful. Now Connor\\'s only hope for survival is the Terminator (ARNOLD SCHWARZENEGGER), his mysterious former assassin. Together, they must triumph over the technologically superior T-X and forestall the looming threat of Judgment Day?or face the apocalypse and the fall of civilization as we know it.', 'Set Contains:', 'There\\'s only one deleted scene in this two-disc DVD set, but it\\'s a doozy. The \"Sgt. Candy Scene\" is a must-see and, unfortunately, the best thing on the second disc. The rushed HBO documentary shows us far more flash than substance. Better is the Visual Effects Lab that goes more in-depth with four sequences, although you need to wade through a hokey interface for each segment. Making your \"own\" effects isn\\'t that much fun; you can only choose a few effects that change in two scenes. Anyone looking to get the complicated backstory of the trilogy figured out should dig into the \"Sky Net Database\" and an intricate timeline. The two commentary tracks are worth a listen, with director Jonathan Mostow\\'s solo track the better one. The director goes into great detail on how the little things (from lighting street scenes to tricks for destroying buildings) count. The second track is pieced together from the actors recorded separately. Mostow appears with actress Claire Danes (doing her first commentary track) and their chemistry is enjoyable after a slow start. The other actors have less interesting things to say, including Schwarzenegger who is constantly--yet enthusiastically--selling the film.', '--Doug Thomas']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Anamorphic, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC, DubbedMultiple Formats, AC-3, Color, Anamorphic, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC, Dubbed  See more', 'Contributor': 'Mark Famiglietti, Claire Danes, Michael Ferris, Nick Stahl, Carolyn Hennesy, John D. Brancato, Jonathan Mostow, Arnold Schwarzenegger, David Andrews, Tedi Sarafian, Earl Boen, Chopper Bernet, Jay Acovone, Kristanna Loken, James Cameron, Moira Harris, Christopher Lawford, Gale Anne HurdMark Famiglietti, Claire Danes, Michael Ferris, Nick Stahl, Carolyn Hennesy, John D. Brancato, Jonathan Mostow, Arnold Schwarzenegger, David Andrews, Tedi Sarafian, Earl Boen, Chopper Bernet, Jay Acovone, Kristanna Loken, James Cameron, Moira Harris, Christopher Lawford,…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Jonathan Mostow', 'Media Format': 'Multiple Formats, AC-3, Color, Anamorphic, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC, Dubbed', 'Run time': '1 hour and 49 minutes', 'Release date': 'June 1, 2004', 'Actors': 'Arnold Schwarzenegger, Nick Stahl, Kristanna Loken, Claire Danes, David Andrews', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Gale Anne Hurd, James Cameron, John D. Brancato, Michael Ferris, Tedi Sarafian', 'Number of discs': '2'}\nFirstly let me say I loved the first 2 movies and the special effects are wonderful. The problem is the plot seems to be to take T2 make the bad terminator a she instead of a he. Throw in a few good special effects, and some very very bad jokes, which should of  been cut on final editing and call yourself T3. It never seems to reach the drama of T2, the jokes are old and the plot recycled. I gave it 4 stars because of the special effects and that I love the other movies in the series.\nGood effects, same plot\nPirates of the Caribbean: The Curse of the Black Pearl (Two-Disc Collector's Edition)\nJohnny Depp  (Actor),     Geoffrey Rush  (Actor),     Gore Verbinski  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['Product Description', \"From producer Jerry Bruckheimer (PEARL HARBOR) comes PIRATES OF THE CARIBBEAN: THE CURSE OF THE BLACK PEARL, the thrilling high-seas adventure with a mysterious twist. The roguish yet charming Captain Jack Sparrow's (Academy Award(R) Nominee Johnny Depp) idyllic pirate life capsizes after his nemesis, the wily Captain Barbossa (Geoffrey Rush), steals his ship, the Black Pearl, and later attacks the town of Port Royal, kidnapping the governor's beautiful daughter Elizabeth (Keira Knightley). In a gallant attempt to rescue her and recapture the Black Pearl, Elizabeth's childhood friend Will Turner (Orlando Bloom) joins forces with Jack. What Will doesn't know is that a cursed treasure has doomed Barbossa and his crew to live forever as the undead. Rich in suspense-filled adventure, sword-clashing action, mystery, humor, unforgettable characters, and never-before-seen special effects, PIRATES is a must-have epic on the grandest scale ever.\", 'Set Contains:', 'Like any DVD blockbuster from producer Jerry Bruckheimer, the extras are plentiful and often a bit too self-congratulatory (worst offender here is the primary commentary track). The slickly (natch) produced making-of documentary goes through the standard routine; however, the less-flashy \"fly on the wall\" bits--just showing what happens on set without comment--is more fun, offering effortless insight on the filmmaking process. The best treasure is a nifty interactive history on pirates with plenty of background material. You can simply play the filmed segments or take a tour around a ship to discover the material (and a few surprises). There\\'s a lot of archival material on the theme-park ride that inspired the film and several odds and ends including an enjoyable chronicle of the vintage ship\\'s voyage from its home harbor to the movie set. The kids should really dig the DVD-ROM \"Moonlight Becomes Ye,\" in which they can turn their own mug into a ghostly pirate. There\\'s also a bounty of extended and deleted scenes (19 in all) and a very funny blooper reel. With both DTS and Dolby 5.1, sound systems will get a workout with the excellent (and loud) sound design.', '--Doug Thomas']\n{'Genre': 'Action/Adventure', 'Format': \"Multiple Formats, AC-3, Anamorphic, Closed-captioned, Collector's Edition, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, THXMultiple Formats, AC-3, Anamorphic, Closed-captioned, Collector's Edition, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, THX   See more\", 'Contributor': 'Lee Arenberg, David Bailie, Johnny Depp, Jonathan Pryce, Mackenzie Crook, Kevin McNally, Michael Berry Jr., David Schofield, Giles New, Angus Barnett, Isaac C. Singleton Jr., Gore Verbinski, Keira Knightley, Jack Davenport, Geoffrey Rush, Orlando BloomLee Arenberg, David Bailie, Johnny Depp, Jonathan Pryce, Mackenzie Crook, Kevin McNally, Michael Berry Jr., David Schofield, Giles New, Angus Barnett, Isaac C. Singleton Jr., Gore Verbinski, Keira Knightley, Jack Davenport, Geoffrey Rush, Orlando Bloom   See more', 'Language': 'English (PCM Surround), English (Dolby Digital 5.1 EX), French, Unqualified', 'Runtime': '2 hours and 23 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.59 x 5.39 x 7.46 inches; 3.2 Ounces', 'Item model number': '03166300', 'Director': 'Gore Verbinski', 'Media Format': \"Multiple Formats, AC-3, Anamorphic, Closed-captioned, Collector's Edition, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, THX\", 'Run time': '2 hours and 23 minutes', 'Release date': 'December 2, 2003', 'Actors': 'Johnny Depp, Geoffrey Rush, Orlando Bloom, Keira Knightley, Jack Davenport', 'Dubbed': 'French', 'Subtitles': 'French', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI've never been a fan of Disney movies, most are just so plain awful and sugar-coated it's sickening. When I got this DVD I feared the worst but I was wrong. I loved the movie, though it is NOT one for the kids despite being made by Disney. To the people that complain about the violence, by their very nature pirates were far from nice people. The only problem I had was the accents seem to get strangely Australian rather than English by the end. There is also one point where Depp slide down a rope, a little difficult to do when your hands are chained together, he clearly throws the chain over the rope. Aside from that I loved it but then I prefer the darker movies. Buy it but do not buy it for kids! It's the same people complaining that thought taking the kids to see Jurassic Park a good idea... Dinosaurs they are, Barney they're not!\nwow\nThe League of Extraordinary Gentlemen (Widescreen Edition)\nSean Connery  (Actor),     Stuart Townsend  (Actor),     Stephen Norrington  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n{'Genre': 'Action & Adventure/Superheroes', 'Format': 'Multiple Formats, Closed-captioned, Color, Anamorphic, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': \"Tom Goodman-Hill, Tony Curran, David Hemmings, Stephen Norrington, Stuart Townsend, Alan Moore, Bruce Devan, Peta Wilson, Jason Flemyng, Shane West, Terry O'Neill, Naseeruddin Shah, James Robinson, Michael Nelson, Max Ryan, Don Murphy, Mark Gordon, Richard Roxburgh, Sean Connery, Kevin O'NeillTom Goodman-Hill, Tony Curran, David Hemmings, Stephen Norrington, Stuart Townsend, Alan Moore, Bruce Devan, Peta Wilson, Jason Flemyng, Shane West, Terry O'Neill, Naseeruddin Shah, James Robinson, Michael Nelson, Max Ryan, Don Murphy, Mark Gordon,…  See more\", 'Language': 'English', 'Runtime': '1 hour and 50 minutes'}\nI was hoping for so much more, especially with Sean Connery in it. It start off well enough but descended into absurdity soon after the entrance on Mr Hyde. After awhile you forget what the plot was originally meant to be. The special effects are good in places, not so in others.A good movie needs more than special effects, it needs a story and characters you can relate to. I am sure any sequel will be stright to video/DVD as I am sure Connery won't be in it, though his character probably will. All that said it's entertaining for kids when there's nothing else to watch on TV.\nDisappointment",
  "profile": "**User Summary:**\n\n- **Key Interests:** The user maintains a strong preference for science fiction and action-adventure genres, particularly those involving futuristic themes and advanced technology, while also appreciating historical narratives.\n- **Favorites:** They enjoy classic and critically acclaimed films, favoring established series with significant cultural impact and notable visual effects.\n- **Viewpoint on Sequels:** The user values originality and depth in storytelling, expressing critique towards sequels that recycle plots or fail to capture the essence of their predecessors, indicating a desire for fresh narratives alongside high production values.\n- **Rating Tendencies:** Their ratings reflect a critical eye toward narrative quality, with an appreciation for strong visual effects and high production quality, while also valuing thought-provoking storytelling.\n- **Expectations from Experience:** They seek comprehensive viewing experiences, favoring content that enhances their understanding of film production, such as behind-the-scenes features and commentaries. They are open to films outside their usual preferences if they offer unexpected depth or darker themes.\n\nRecent interactions suggest a willingness to engage with big-budget productions that may defy initial expectations, especially those blending action with darker storytelling. However, the user remains discerning, as they critique films that fail to deliver a cohesive plot or relatable characters, indicating a cautious approach to lighter or family-friendly content.",
  "metrics": {
    "rouge1_f": 0.09743847312908087,
    "rouge2_f": 0.0060331825037707384,
    "rougeL_f": 0.045203415369161226,
    "meteor": 0.030614414382868615,
    "bleu1": 9.7956223129418e-05,
    "bleu2": 2.326297864258455e-05,
    "bleu3": 3.915472125840121e-06,
    "bleu4": 1.6079350055059924e-06,
    "bertscore_precision": 0.3358105719089508,
    "bertscore_recall": 0.4709291458129883,
    "bertscore_f1": 0.39205455780029297
  }
}