{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/01/23\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike Disa'], 'Producers': ['Raed Al Natsheh', 'Robert Anich', 'Sarah Arnott', 'Randa Ayoubi', 'Carl Castelino', 'David J. Corbett', 'Kristin Dornig', 'Eric Ellenbogen', 'Arish Fyzee'], 'Starring': ['Jim Broadbent', 'Jane Carr', 'Robin Atkin Downes'], 'Studio': ['Shout Factory']}\nReview Text: My 2 year old daughter LOVES this. Especially the robots.  I don't know how many times we have watched it. She asks to watch it &#34;watch cat and robots? &#34; the robots, especially the cat robot,  may scare sensitive kids though\nReview Title: Fun even for little kids\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Terminator 3: Rise of the Machines (Two-Disc Widescreen Edition)\nArnold Schwarzenegger  (Actor),     Nick Stahl  (Actor),     Jonathan Mostow  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Futuristic\n['Product Description', 'A decade has passed since John Connor (NICK STAHL) helped prevent Judgment Day and save mankind from mass destruction. Now 25, Connor lives \"off the grid\" - no home, no credit cards, no cell phone and no job. No record of his existence. No way he can be traced by Skynet - the highly developed network of machines that once tried to kill him and wage war on humanity. Until?out of the shadows of the future steps the T-X (KRISTANNA LOKEN), Skynet\\'s most sophisticated cyborg killing machine yet. Sent back through time to complete the job left unfinished by her predecessor, the T-1000, this machine is as relentless as her human guise is beautiful. Now Connor\\'s only hope for survival is the Terminator (ARNOLD SCHWARZENEGGER), his mysterious former assassin. Together, they must triumph over the technologically superior T-X and forestall the looming threat of Judgment Day?or face the apocalypse and the fall of civilization as we know it.', 'Set Contains:', 'There\\'s only one deleted scene in this two-disc DVD set, but it\\'s a doozy. The \"Sgt. Candy Scene\" is a must-see and, unfortunately, the best thing on the second disc. The rushed HBO documentary shows us far more flash than substance. Better is the Visual Effects Lab that goes more in-depth with four sequences, although you need to wade through a hokey interface for each segment. Making your \"own\" effects isn\\'t that much fun; you can only choose a few effects that change in two scenes. Anyone looking to get the complicated backstory of the trilogy figured out should dig into the \"Sky Net Database\" and an intricate timeline. The two commentary tracks are worth a listen, with director Jonathan Mostow\\'s solo track the better one. The director goes into great detail on how the little things (from lighting street scenes to tricks for destroying buildings) count. The second track is pieced together from the actors recorded separately. Mostow appears with actress Claire Danes (doing her first commentary track) and their chemistry is enjoyable after a slow start. The other actors have less interesting things to say, including Schwarzenegger who is constantly--yet enthusiastically--selling the film.', '--Doug Thomas']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Anamorphic, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC, DubbedMultiple Formats, AC-3, Color, Anamorphic, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC, Dubbed  See more', 'Contributor': 'Mark Famiglietti, Claire Danes, Michael Ferris, Nick Stahl, Carolyn Hennesy, John D. Brancato, Jonathan Mostow, Arnold Schwarzenegger, David Andrews, Tedi Sarafian, Earl Boen, Chopper Bernet, Jay Acovone, Kristanna Loken, James Cameron, Moira Harris, Christopher Lawford, Gale Anne HurdMark Famiglietti, Claire Danes, Michael Ferris, Nick Stahl, Carolyn Hennesy, John D. Brancato, Jonathan Mostow, Arnold Schwarzenegger, David Andrews, Tedi Sarafian, Earl Boen, Chopper Bernet, Jay Acovone, Kristanna Loken, James Cameron, Moira Harris, Christopher Lawford,…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Director': 'Jonathan Mostow', 'Media Format': 'Multiple Formats, AC-3, Color, Anamorphic, Closed-captioned, Dolby, Subtitled, Widescreen, NTSC, Dubbed', 'Run time': '1 hour and 49 minutes', 'Release date': 'June 1, 2004', 'Actors': 'Arnold Schwarzenegger, Nick Stahl, Kristanna Loken, Claire Danes, David Andrews', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Gale Anne Hurd, James Cameron, John D. Brancato, Michael Ferris, Tedi Sarafian', 'Number of discs': '2'}\nFirstly let me say I loved the first 2 movies and the special effects are wonderful. The problem is the plot seems to be to take T2 make the bad terminator a she instead of a he. Throw in a few good special effects, and some very very bad jokes, which should of  been cut on final editing and call yourself T3. It never seems to reach the drama of T2, the jokes are old and the plot recycled. I gave it 4 stars because of the special effects and that I love the other movies in the series.\nGood effects, same plot\nPirates of the Caribbean: The Curse of the Black Pearl (Two-Disc Collector's Edition)\nJohnny Depp  (Actor),     Geoffrey Rush  (Actor),     Gore Verbinski  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['Product Description', \"From producer Jerry Bruckheimer (PEARL HARBOR) comes PIRATES OF THE CARIBBEAN: THE CURSE OF THE BLACK PEARL, the thrilling high-seas adventure with a mysterious twist. The roguish yet charming Captain Jack Sparrow's (Academy Award(R) Nominee Johnny Depp) idyllic pirate life capsizes after his nemesis, the wily Captain Barbossa (Geoffrey Rush), steals his ship, the Black Pearl, and later attacks the town of Port Royal, kidnapping the governor's beautiful daughter Elizabeth (Keira Knightley). In a gallant attempt to rescue her and recapture the Black Pearl, Elizabeth's childhood friend Will Turner (Orlando Bloom) joins forces with Jack. What Will doesn't know is that a cursed treasure has doomed Barbossa and his crew to live forever as the undead. Rich in suspense-filled adventure, sword-clashing action, mystery, humor, unforgettable characters, and never-before-seen special effects, PIRATES is a must-have epic on the grandest scale ever.\", 'Set Contains:', 'Like any DVD blockbuster from producer Jerry Bruckheimer, the extras are plentiful and often a bit too self-congratulatory (worst offender here is the primary commentary track). The slickly (natch) produced making-of documentary goes through the standard routine; however, the less-flashy \"fly on the wall\" bits--just showing what happens on set without comment--is more fun, offering effortless insight on the filmmaking process. The best treasure is a nifty interactive history on pirates with plenty of background material. You can simply play the filmed segments or take a tour around a ship to discover the material (and a few surprises). There\\'s a lot of archival material on the theme-park ride that inspired the film and several odds and ends including an enjoyable chronicle of the vintage ship\\'s voyage from its home harbor to the movie set. The kids should really dig the DVD-ROM \"Moonlight Becomes Ye,\" in which they can turn their own mug into a ghostly pirate. There\\'s also a bounty of extended and deleted scenes (19 in all) and a very funny blooper reel. With both DTS and Dolby 5.1, sound systems will get a workout with the excellent (and loud) sound design.', '--Doug Thomas']\n{'Genre': 'Action/Adventure', 'Format': \"Multiple Formats, AC-3, Anamorphic, Closed-captioned, Collector's Edition, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, THXMultiple Formats, AC-3, Anamorphic, Closed-captioned, Collector's Edition, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, THX   See more\", 'Contributor': 'Lee Arenberg, David Bailie, Johnny Depp, Jonathan Pryce, Mackenzie Crook, Kevin McNally, Michael Berry Jr., David Schofield, Giles New, Angus Barnett, Isaac C. Singleton Jr., Gore Verbinski, Keira Knightley, Jack Davenport, Geoffrey Rush, Orlando BloomLee Arenberg, David Bailie, Johnny Depp, Jonathan Pryce, Mackenzie Crook, Kevin McNally, Michael Berry Jr., David Schofield, Giles New, Angus Barnett, Isaac C. Singleton Jr., Gore Verbinski, Keira Knightley, Jack Davenport, Geoffrey Rush, Orlando Bloom   See more', 'Language': 'English (PCM Surround), English (Dolby Digital 5.1 EX), French, Unqualified', 'Runtime': '2 hours and 23 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.59 x 5.39 x 7.46 inches; 3.2 Ounces', 'Item model number': '03166300', 'Director': 'Gore Verbinski', 'Media Format': \"Multiple Formats, AC-3, Anamorphic, Closed-captioned, Collector's Edition, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen, THX\", 'Run time': '2 hours and 23 minutes', 'Release date': 'December 2, 2003', 'Actors': 'Johnny Depp, Geoffrey Rush, Orlando Bloom, Keira Knightley, Jack Davenport', 'Dubbed': 'French', 'Subtitles': 'French', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI've never been a fan of Disney movies, most are just so plain awful and sugar-coated it's sickening. When I got this DVD I feared the worst but I was wrong. I loved the movie, though it is NOT one for the kids despite being made by Disney. To the people that complain about the violence, by their very nature pirates were far from nice people. The only problem I had was the accents seem to get strangely Australian rather than English by the end. There is also one point where Depp slide down a rope, a little difficult to do when your hands are chained together, he clearly throws the chain over the rope. Aside from that I loved it but then I prefer the darker movies. Buy it but do not buy it for kids! It's the same people complaining that thought taking the kids to see Jurassic Park a good idea... Dinosaurs they are, Barney they're not!\nwow\nThe League of Extraordinary Gentlemen (Widescreen Edition)\nSean Connery  (Actor),     Stuart Townsend  (Actor),     Stephen Norrington  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n{'Genre': 'Action & Adventure/Superheroes', 'Format': 'Multiple Formats, Closed-captioned, Color, Anamorphic, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': \"Tom Goodman-Hill, Tony Curran, David Hemmings, Stephen Norrington, Stuart Townsend, Alan Moore, Bruce Devan, Peta Wilson, Jason Flemyng, Shane West, Terry O'Neill, Naseeruddin Shah, James Robinson, Michael Nelson, Max Ryan, Don Murphy, Mark Gordon, Richard Roxburgh, Sean Connery, Kevin O'NeillTom Goodman-Hill, Tony Curran, David Hemmings, Stephen Norrington, Stuart Townsend, Alan Moore, Bruce Devan, Peta Wilson, Jason Flemyng, Shane West, Terry O'Neill, Naseeruddin Shah, James Robinson, Michael Nelson, Max Ryan, Don Murphy, Mark Gordon,…  See more\", 'Language': 'English', 'Runtime': '1 hour and 50 minutes'}\nI was hoping for so much more, especially with Sean Connery in it. It start off well enough but descended into absurdity soon after the entrance on Mr Hyde. After awhile you forget what the plot was originally meant to be. The special effects are good in places, not so in others.A good movie needs more than special effects, it needs a story and characters you can relate to. I am sure any sequel will be stright to video/DVD as I am sure Connery won't be in it, though his character probably will. All that said it's entertaining for kids when there's nothing else to watch on TV.\nDisappointment\nFantastic Four (Widescreen Edition)\nIoan Gruffudd  (Actor),     Jessica Alba  (Actor),     Tim Story  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'Jessica Alba, Chris Evans and Michael Chiklis head a sexy, star-powered cast in this explosive adventure about a quartet of flawed, ordinary human beings who suddenly find themselves with extraordinary abilities.', 'After exposure to cosmic radiation, four astronauts become the most remarkable, if dysfunctional, superheroes of all time. Unfortunately, the mission\\'s sponsor has also been transformed ? into the world\\'s most lethal supervillain ? setting the stage for a confrontation of epic proportions. Packed with nonstop action, big laughs and awesome special effects, Fantastic 4 is \"powerful fun\" (The Baltimore Sun) from start to finish!', 'Amazon.com', \"Marvel Comics' first family of superherodom, the Fantastic Four, hits the big screen in a light-hearted and funny adventure. It begins when down-on-his-luck genius Reed Richards (Ioan Gruffudd,\", 'Horatio Hornblower', ') has to enlist the financial and intellectual help from former schoolmate and rival Victor Von Doom (Julian McMahon,', 'Nip/Tuck', \") in order to pursue outer-space research into human DNA. Also on the trip are Reed's best friend, Ben Grimm (Michael Chiklis,\", 'The Shield', '); his former lover, Sue Storm (Jessica Alba,', 'Dark Angel', ',', 'Sin City', \"), who's now Doom's employee and love interest; and her hotshot-pilot brother, Johnny Storm (Chris Evans,\", 'Cellular', \"). Things don't go as planned, of course, and the quartet becomes blessed--or is it cursed?--with superhuman powers: flexibility, brute strength, invisibility and projecting force fields, and bursting into flame. Meanwhile, Doom himself is undergoing a transformation.\", 'Among the many entries in the comic-book-movie frenzy,', 'Fantastic Four', 'is refreshing because it doesn\\'t take itself too seriously. Characterization isn\\'t too deep, and the action is a bit sparse until the final reel (like most \"first\" superhero movies, it has to go through the \"how did we get these powers and what we will do with them\" churn). But it\\'s a good-looking cast, and original comic-book cocreator Stan Lee makes his most significant Marvel-movie cameo yet, in a speaking role as the FF\\'s steadfast postal carrier, Willie Lumpkin. Newcomers to superhero movies might find the idea of a family with flexibility, strength, invisibility, and force fields a retread of', 'The Incredibles', \", but Pixar's animated film was very much a tribute to the FF and other heroes of the last 40 years. The irony is that while\", 'Fantastic Four', \"is an enjoyable B-grade movie, it's the tribute,\", 'The Incredibles', ', that turned out to be a film for the ages.', '--David Horiuchi', 'On the DVD', 'The principal extra on the DVD is a spirited commentary track by Jessica Alba, Michael Chiklis, and Ioan Gruffud. Self-avowed FF fan Chiklis explains why the Thing doesn\\'t have a craggy brow, Alba recalls which things were \"cool,\" and they talk about looking forward to the sequel. There are three short deleted scenes (including a goofy Wolverine reference), 20 minutes of barely watchable hand-held video footage from the press tour, music videos, and some short featurettes including an appearance by FF creator Stan Lee.', '--David Horiuchi', 'The Fantastic Four at Amazon.com', 'Comics and Graphic Novels', 'Disney animated series', 'The classic comic book', 'Movie tie-in graphic novel', 'The Xbox game', 'Fantastic Four', 'Soundtrack', 'The Fantastic Cast', 'Jessica Alba', 'as Sue Storm', 'Michael Chiklis', 'as The Thing', 'Ioan Gruffudd', 'as Reed Richards', 'Chris Evans', 'as Johnny Storm', 'Stills from', 'Fantastic Four', '(click for larger images)']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Closed-captioned, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Lauren Sanchez, Jennifer Lothrop, Morgan Reynolds, Andrew Airlie, Lynnanne Zager, Pascale Hutton, Nicole Edwards (II), Maria Menounos, Rhys Edwards, Michael Kopsa, Kerry Washington, Jon Brady, David Parker (IV), Lorena Gale, Laurie Holden, Devon Soltendieck, Tim Story, Dewi Edwards, Nicole Muoz, Taryn Winter Brill, Ellen Ewusie, Jim Ferguson (IV), Jaimie McVittie, Lou Torres, Colin Lawrence, G. Michael Gray, Kathleen Mullan, Ioan Gruffudd, Hector A. Leguillow, Patrick Stoner, Ronnie Renner, Lisa Fuller Magee, Bonnie Laufer-Krebs, Doug Abrahams, Ron Chartier, David Moss (VII), Sean Bennett, Dee Jay Jackson, Heidi Eng, Kenny Bartram, Bobby Bysouth, Michelle Kulas, Terry David Mulligan, Jason Diablo, Jason Kaufman (II), Bethann Schebece, Sienna Rose, Sara Edwards, David Richmond-Peck, Jessica Alba, Sandra-Jessica Couturier, Sanja Banic, Julian McMahon, Juanita Mirehouse, Ylenia Aurucci, Maria Salas, Kevin McNulty, Aonika Laurent, Liam Mayclem, Sam Hallenbeck, Danielle Dunn-Morris, Tony Alcantar, Lee Thomas (VIII), Michael Chiklis, Scott Patrick, Marlaina Mah, Jenni Squair, Ralph Winter, Jason Schombing, Georgia Dewson, Tony Toscano, Maurice Tyson, Brian Deegan, Gina Holden, Tre Verhoeven, Ben Mulroney, Douglas Weston, Stefanie Singer, Penelope Corrin, Donavon Stinson, Lia Salmond, Steven Fulani Hart, Daniel Bacon, CB Hackworth, Sam Rubin, Richard Ho, Jamie Little, Ed Hodson, Andrew Hunsaker, Stan Lee, Dave Holmes, Peter Bryant, Marian Etoile Watson, Preston Thomas Peet, Shaheem Reid, Brenda Crichlow, Taylor Johnson (II), Mark S. Allen, John Speredakos, Mike Waco, Barbara Christabella, Peggy Gormley, Hamish Linklater, Bret Martin, Chris Evans, Paul BelsitoLauren Sanchez, Jennifer Lothrop, Morgan Reynolds, Andrew Airlie, Lynnanne Zager, Pascale Hutton, Nicole Edwards (II), Maria Menounos, Rhys Edwards, Michael Kopsa, Kerry Washington, Jon Brady, David Parker (IV), Lorena Gale, Laurie Holden, Devon Soltendieck, T…  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (DTS 5.1), French (DTS 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 2.4 Ounces', 'Item model number': '2218778', 'Director': 'Tim Story', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 46 minutes', 'Release date': 'December 6, 2005', 'Actors': 'Ioan Gruffudd, Jessica Alba, Chris Evans, Michael Chiklis, Julian McMahon', 'Dubbed': 'English, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nI was hoping for a lot more than this when I bought this movie. The premise for the movie was great, the special effects were great but the storyline was OK. It just didn't gel too well for the most part. A great movie needs a storyline no matter how great the special effects are. I just couldn't seem to relate to the characters or their feelings. It's worth watching for the effects, as long as you don't mind the storyline being weak.\nCould of been better\nFlyboys (Full Screen Edition)\nJames Franco  (Actor),     Jean Reno  (Actor),     Tony Bill  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', \"Inspired by the true story of the legendary Lafayette Escadrille, this action-packed epic tells the tale of America's first fighter pilots. These courageous young men distinguish themselves in a manner that none before them had dared, becoming true heroes who experience triumph, tragedy, love, and loss amid the chaos of World War I. Hang on for the ride of your life!\", 'Amazon.com', 'World War I aviation action gets an impressive digital upgrade in', 'Flyboys', ', a welcome addition to the \"dogfight\" sub-genre that includes such previous war-in-the-air films like', \"Hell's Angels\", ',', 'Wings', ', and', 'The Blue Max', '. While those earlier films had the advantage of real and genuinely dangerous flight scenes (resulting, in some cases, in fatal accidents during production),', 'Flyboys', \"takes full (and safe) advantage of the digital revolution, with intensely photo-realistic recreations of WWI aircraft, authentic period structures, and CGI environments requiring a total of 850 digital effects shots, resulting in an abundance of amazing images, many of them virtually indistinguishable from reality. Unfortunately, the film's technical achievement is more impressive than its screenplay, which conventionally and predictably tells the fact-based story, set in France in 1916, of the daring young pilots of the Lafayette Escadrille, a pioneering French air-combat unit that welcomed American enlistees prior to the United States' entry into the war.\", 'There\\'s a familiar cliché to match every thrilling scene of aerial combat, but director Tony Bill manages to keep it all interesting, from the romance between a young American maverick (James Franco) and a pretty French girl (newcomer Jennifer Decker) to the exciting action in the air, which includes a stock variety of heroes (many of them composites of real-life WWI pilots) and an intimidating villain known only as \"The Black Falcon,\" whose Fokker Dr-1 triplane (one of many in the film) recalls the exploits of German \"ace of aces\" Manfred von Richtofen, the dreaded \"Red Baron\" of legend. With impeccable production values that will impress even the most nit-picking aviation buffs,', 'Flyboys', '(like', 'Superman Returns', 'and', 'Apocalypto', \", also released in 2006) was also one of the first feature films to be shot with Panavision's state-of-the-art Genesis digital cameras, resulting in beautiful images that meet or exceed the visual nuance of film.\", 'Flyboys', \"also benefits from painstaking attention to physical detail, making it easier to forgive its shortcomings as a generic and formulaic slice of romanticized history. So while some viewers may have wished for a more realistic and grown-up depiction of the Lafayette Escadrille, it's safe to say that\", 'Flyboys', 'will be thrilling its target audience for many years to come. --', 'Jeff Shannon', 'Extras from', 'Flyboys', 'Director Tony Bill on Filming Dogfight Sequences', '...On throwing away the script for pilot training', '...On the real-life stunt pilot who stars in the film', 'Beyond', 'Flyboys', 'More \"War in the Sky\" Films', 'SPA124 Lafayette Escadrille: American Volunteer Airmen in World War 1', 'More \"Military and War\" Films', 'Stills from', 'Flyboys']\n{'Genre': 'Romance, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, DTS Surround Sound', 'Contributor': 'Tony Bill, Tim Pigott-Smith, Jennifer Decker, Scott Hazell, Abdul Salis, David S. Ward, Philip Winchester, Karen Ford, Todd Boyce, Phil Sears, Ruth Bradley, Jean Reno, Jean-Philippe coffey, Mac McDonald, Blake T. Evans, James FrancoTony Bill, Tim Pigott-Smith, Jennifer Decker, Scott Hazell, Abdul Salis, David S. Ward, Philip Winchester, Karen Ford, Todd Boyce, Phil Sears, Ruth Bradley, Jean Reno, Jean-Philippe coffey, Mac McDonald, Blake T. Evans, James Franco  See more', 'Language': 'English (DTS 5.1), Unqualified, French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 20 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 4 Ounces', 'Director': 'Tony Bill', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, DTS Surround Sound', 'Run time': '2 hours and 20 minutes', 'Release date': 'January 30, 2007', 'Actors': 'James Franco, Jean Reno, Jennifer Decker, Scott Hazell, Mac McDonald', 'Dubbed': 'English, French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Writers': 'Blake T. Evans, David S. Ward, Phil Sears', 'Number of discs': '1'}\nI am not sure which movie all the critics were watching, obviously not the same one I was watching. Granted it could of been better in the development of characters but if they'd included the amount of detail some people would want then the movie would be as long as WW1. The computer generated dog fight scenes are great and keep you on the edge of your seat. It has its funny and sad moments but not too many dull moments. So if you're looking for a couple of hours of entertainment give it a try, if you're looking for a sickly love interest go and watch Titanic for the 50th time..\nAlmost great\nStar Trek Voyager - The Complete First Season\nKate Mulgrew  (Actor),     Robert Beltran  (Actor),     Winrich Kolbe  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Science Fiction\n['Product Description', 'The complete first season of the TV series Star Trek Voyager.', 'Amazon.com', 'Star Trek: Voyager', 'began life in 1995 with some truly fascinating prospects in its two-hour pilot episode. Opening in the 24th century, a setting contemporary with that of', 'Star Trek: The Next Generation', 'and', 'Star Trek: Deep Space Nine', 'and carrying over story elements from each of those series, \"Caretaker\" finds Starfleet Captain Kathryn Janeway (Kate Mulgrew) stepping into the middle of Federation troubles with the Maquis, an army of rebels violently resisting the interplanetary organization\\'s treaty with the brutal Cardassians. In the process, both', 'Voyager', \"and the Maquis ship under surveillance are accidentally catapulted out of the galaxy's Alpha Quadrant (the familiar stomping grounds of Starfleet personnel) by a benign but dying being called the Caretaker.\", 'Voyager', 'ends up in the unexplored Delta Quadrant, some 70,000 light years away.', 'So much seemed dramatically promising in this debut, especially the unwieldy alliance of Starfleet regulars and hostile Maquis, and the likelihood that a lifetime spent in isolation, trying to get home, would lead to the development of a self-contained society on the ship, yet', 'Voyager', 'never entirely made up its mind what it was supposed to be about. The curiously cheesy sets and fascinating, progressive management style of Janeway (half mommy, half taskmaster) were also new developments in', 'Star Trek', 'culture. As the 16-episode season continued, character backstories were developed in such episodes as \"The Cloud\" (arguably the best episode of the season), \"Eye of the Needle\" (underscoring Janeway and the crew\\'s sadness), \"State of Flux\" (in which a search for a traitor reveals a past romance between Commander Chakotay, played by Robert Beltran, and sexy Bajoran engineer Seska, played by Martha Hackett), and \"Jetrel\" (which explores the character of Neelix, the Talaxian played by Ethan Phillips, during a parable about scientific ethics and moral responsibility).', 'Among other notable episodes, \"Phage\" strikes a nice balance among character development, story hook, and moral and emotional conflict when Neelix is literally robbed of his lungs by the Vidiians, a once-civilized people who are combating a deadly disease called the Phage by stealing organs. (The disease would return in \"Faces,\" a fine showcase for Roxann Biggs-Dawson as Chief Engineer B\\'Elanna Torres.) \"Emanations\" stirred controversy among the series\\' producers and some fans for its philosophical look at death, and \"Time and Again\" is a unique time-travel story in which Janeway and Tom Paris (Robert Duncan McNeill) get caught in a subspace fracture that places them just hours before they know a planet is going to be destroyed. In \"Prime Factors,\" latent tensions among', 'Voyager', 'personnel erupts into serious conflict, an issue revisited in the season finale, \"Learning Curve.\" Despite a pat ending that resolves the Maquis conflict much too easily, the episode drives home the fact that', 'Voyager', 'and its crew are all alone, making the most of a difficult predicament.', '--Tom Keogh and Jeff Shannon', 'Set Contains:', \"There's a rare treat in the first-season set of\", 'Star Trek: Voyager', \": scenes from the pilot episode featuring the original captain Janeway, played by Genevieve Bujold. She was quickly replaced, and with the benefit of hindsight, it's easy to see that she lacked sufficient presence for the role. That segment is part of the set's 78 minutes of bonus features, including a spotlight on the eventual captain Janeway, Kate Mulgrew (mostly comprised of 1994 and 2003 interviews); a season overview; reflections by the cast; and spotlights on visual effects, location, Startrek.com, and the science behind the show (wormholes, time travel). The basic format of the discs is the same as\", 'The Next Generation', 'and', 'Deep Space Nine', ': full screen, 5.1 and 2.0 surround sound, English subtitles, and easy-to-find Easter eggs. The discs are housed in a nicely compact Digistak case like', 'DS9', ', though with a bolder color scheme and a plastic outer casing that fits together awkwardly. But unlike any previous', 'Star Trek', 'DVD series, the opening credits of every episode come at the very end of track 1, making it easy to skip past them.', '--David Horiuchi', 'See more']\n{'Format': 'Box set, Color, Dolby, NTSC', 'Contributor': 'Kate Mulgrew, Merri D. Howard, Gene Roddenberry, Majel Barrett, Jeri Taylor, Tarik Ergin, Rick Berman, Tim Russ, David Livingston, Jennifer Lien, Robert Duncan McNeill, Ethan Phillips, Winrich Kolbe, Robert Beltran, Michael Piller, Garrett Wang, Robert Picardo, Roxann Dawson, Jeri RyanKate Mulgrew, Merri D. Howard, Gene Roddenberry, Majel Barrett, Jeri Taylor, Tarik Ergin, Rick Berman, Tim Russ, David Livingston, Jennifer Lien, Robert Duncan McNeill, Ethan Phillips, Winrich Kolbe, Robert Beltran, Michael Piller, Garrett Wang, Robert Picardo, Roxann Dawso…   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '5', 'Runtime': '12 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1 inches; 9.91 Ounces', 'Director': 'Winrich Kolbe', 'Media Format': 'Box set, Color, Dolby, NTSC', 'Run time': '12 hours and 13 minutes', 'Release date': 'February 24, 2004', 'Actors': 'Kate Mulgrew, Robert Beltran, Roxann Dawson, Jennifer Lien, Robert Duncan McNeill', 'Subtitles': 'English', 'Producers': 'David Livingston, Jeri Taylor, Merri D. Howard', 'Studio': 'Paramount', 'Writers': 'Gene Roddenberry, Jeri Taylor, Michael Piller, Rick Berman', 'Number of discs': '5'}\nI wish I could afford to spend $100 per season. What I don't understand though is why the same set, but region 2 dvd, is the equivalent of $60 from the UK version of Amazon.. (amazon.co.uk). You use the same log in and password as on Amazon and it can be shipped internationally.  So if anyone has a multi-regional DVD player get it from there, even with shipping it's got to be cheaper. The series itself is 5 star but the price sucks.<br /><br />Update 5-28-08: Finally this comes down to a much more reasonable price :) Love it!\nI wish\nArthur Christmas\nSarah Smith  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'How CAN Santa deliver billions of presents to the whole world in just one night? With an army of one million combat-style Field Elves and a vast, state-of-the-art control center under the ice of the North Pole! So how could this incredible operation have MISSED one child?! To Santa’s young son, Arthur, it threatens to end the magic of Christmas. With retired Grandsanta, a rebellious young elf, an old sleigh and some untrained reindeer, Arthur sets out in a crazy mission to deliver the last present! Deck the halls with excitement, fun and wonder in this new Christmas classic!', 'Amazon.com']\n{'Genre': 'Family, Animation, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Sarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla ShelleySarah Smith, David Sproxton, Aardman Animations; Columbia Pictures; Sony Pictures Animation Inc., Peter Lord, Steve Pegram, Carla Shelley   See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 37 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '40952', 'Director': 'Sarah Smith', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 6, 2012', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Producers': 'Peter Lord, David Sproxton, Carla Shelley, Steve Pegram', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis is funnier if you are British or like British style humor as the jokes are on the subtle side. My wife even laughed several times at grandsanta, and she's not usually one to watch British comedy.\nCute and funny\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike Disa'], 'Producers': ['Raed Al Natsheh', 'Robert Anich', 'Sarah Arnott', 'Randa Ayoubi', 'Carl Castelino', 'David J. Corbett', 'Kristin Dornig', 'Eric Ellenbogen', 'Arish Fyzee'], 'Starring': ['Jim Broadbent', 'Jane Carr', 'Robin Atkin Downes'], 'Studio': ['Shout Factory']}\nMy 2 year old daughter LOVES this. Especially the robots.  I don't know how many times we have watched it. She asks to watch it &#34;watch cat and robots? &#34; the robots, especially the cat robot,  may scare sensitive kids though\nFun even for little kids",
  "profile": "The user maintains a strong preference for science fiction and action-adventure genres that incorporate advanced technology and historical themes, highlighting their appreciation for complex narratives. The latest interaction reveals a growing engagement with family-friendly content, particularly projects that captivate younger audiences while still providing quality storytelling. This versatility showcases the user’s ability to appreciate different genres without compromising their standards for narrative depth and artistry.\n\nTheir review indicates a continued enjoyment of humor, with a specific fondness for British comedy, while they remain selective about lighter themes, emphasizing the importance of meaningful engagement and avoiding clichéd romantic plots. The user values cohesive narratives and seeks productions that both challenge and entertain, reinforcing their standards for depth and intellectual stimulation.\n\nAdditionally, the user has expressed patience regarding international pricing disparities, reflecting a practical approach to media consumption. Overall, they demonstrate an evolving exploration of cinema and television, successfully navigating diverse genres while firmly adhering to their established critical standards. The recent interaction with family-oriented content suggests an adaptive taste that embraces quality storytelling across age groups, enhancing the breadth of their cinematic experiences.",
  "metrics": {
    "rouge1_f": 0.03699593044765075,
    "rouge2_f": 0.0025906735751295338,
    "rougeL_f": 0.020717721050684423,
    "meteor": 0.0102097019884538,
    "bleu1": 5.543726283396471e-16,
    "bleu2": 2.100511644474105e-16,
    "bleu3": 3.0866748748485495e-17,
    "bleu4": 1.1847188512139864e-17,
    "bertscore_precision": 0.3045092821121216,
    "bertscore_recall": 0.4912167191505432,
    "bertscore_f1": 0.3759586811065674
  }
}