{
  "interaction_number": 20,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Sasy n Savy, Citrus Soufflè Hydrating and Nourishing Body Crème, Plant-Based Natural Ingredients For Daily Moisture, 6.08 fl oz(180mL)\nReview Date: 2022/05/30\nStore: Sasy n Savy\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Sasy n Savy', 'Item Form': 'Cream', 'Unit Count': '6.1 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.76 x 1.77 x 6.69 inches; 10.41 Ounces'}\nReview Text: This is a nice body moisturizer that softens and hydrates your skin.  It absorbs well and has a nice scent.  The moisturizing effect isn't as long-lasting as I would like, but it's still a good lotion.\nReview Title: Good Moisturizer\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "AG Care Natural Remedy Apple Cider Vinegar Leave On Mist\n{'Brand': 'AG Care', 'Item Form': 'Spray', 'Material Feature': 'Plant Based, Vegan', 'Hair Type': 'All, Color Treated', 'Product Benefits': 'Gently cleanses and seals cuticle to enhance shine. Superfoods and apple cider vinegar support soft, healthy hair.Gently cleanses and seals cuticle to enhance shine. Superfoods and apple cider vinegar support soft, healthy hair.  See more', 'Product Dimensions': '1.75 x 1.75 x 6 inches; 6.14 Ounces', 'Item model number': '100150', 'UPC': '625336002391', 'Manufacturer': 'AG Hair', 'Country of Origin': 'Canada'}\nThis is pretty good.  I was surprised at how well it worked for detangling wet hair.  The scent is also nice -- it does not smell like vinegar.  It does help with frizziness, too, on those really humid days.  It also reduces static electricity in your hair on really dry days.  I would definitely use this again.\nDetangles Well\nTaya Beauty Buriti Nut Intensive Repair Shampoo & Conditioner Duo – Organic Hydrating Shampoo and Conditioner for Dry Damaged Hair - Restorative Hair Care – Travel Size 2 fl oz\nTAYA I AM.\n{'Product Benefits': 'Hydrating', 'Item Form': 'Liquid', 'Brand': 'TAYA I AM.', 'Hair Type': 'All, Dull, Color Treated, Dry, Chemically Treated, Damaged', 'Number of Items': '2', 'Package Dimensions': '5.25 x 3.5 x 1.1 inches; 2 Ounces', 'UPC': '858308002635'}\nThis shampoo and conditioner set is very moisturizing, but doesn't leave your hair limp or greasy-looking.  It leaves my fine, shoulder-length hair bouncy and shiny.  The travel size is also very convenient.\nNice\n2 Pack Hair Towel Wrap Turban Microfiber Drying Shower and Bath, Twist Head Towels with Button, Magic Quick Dryer, Hair Care for Women and Girls, One Wrap Plus One Cap and Two Velvet Hair Bands\nMEETWIN\n{}\nI like the twist towel a lot, but I found the shower-cap-like towel to be a little hard to use.  My hair is below shoulder-length, and it just didn't work well for me.  The twist towel is great, though.  I didn't care for the hair ties and won't be using those.  If you have longer hair and just want some twist towels, I would go with a different product because the cap probably won't work for you.  But if you're hair is shorter, this set would be a pretty good choice.\nOkay\nLavender Fields Sugar Polish by South of France Clean Body Care | Moisturizing Sugar Scrub for Women | Shea Butter + Sunflower Oil | 8 oz Tube\nSouth of France Natural Body Care\n{'Brand': 'South of France Natural Body Care', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Active Ingredients': 'Lavender', 'Material Feature': 'Gluten Free, Natural', 'Product Dimensions': '20.3 x 7.1 x 5.1 inches; 8.82 Ounces', 'UPC': '856885005155'}\nThis body polish is very good at exfoliating, but not as moisturizing as I would like.  It smells nice, although the scent seems to be fake and not real lavender.  It's still a nice scent, though.  I would get this again if I found a good deal, but there are others that I like better.\nGood Exfoliation\nMicrofiber Hair Towel Two Layers Turban Wrap YANJIE Super Absorbent Shower Head Towel Hair Caps with 2 Buttons,Quick Dryer Hat,Bathing Wrapped Cap for Women Girls Mom Daughter(Blue&Purple)\nYanJie\n{'Package Dimensions': '12.2 x 7.4 x 3.11 inches; 10.58 Ounces'}\nI've become addicted to these hair towels because they're so convenient and effective.  Regular towels are kind of heavy on your head.  These are perfect.  They're very soft, just the right size, and do a great job of soaking the water out of your hair.\nGreat for Wrapping Wet Hair\nMaya Mari -  Castor Oil Shampoo for Women, Strengthening and Moisturizing Shampoo for Coarse, Textured, and Curly Hair, 32 oz\nMAYA MARI\n{'Brand': 'MAYA MARI', 'Item Form': 'Liquid', 'Hair Type': 'Damaged Hair,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Dimensions': '4 x 8 x 11 inches; 2 Pounds', 'Item model number': 'MMCACCSP', 'UPC': '850004068229', 'Manufacturer': 'HGI Brands'}\nThis shampoo does an excellent job of moisturizing (and cleaning) your hair.  However, you don't want to use it more than 3-4 times a week, because the castor oil builds up and starts making your hair look greasy.  I alternate it with another shampoo, and it works great that way.\nVery Moisturizing\nThink Nature Orange Blossom Shampoo, No Sulfate Paraben, All hair types16.9fl.oz(500ml)\nthink nature\n{'Brand': 'Think nature', 'Item Form': 'Foam', 'Hair Type': 'All Hair Types16.9fl.oz,All Hair Types', 'Scent': 'Citrus,Orange', 'Age Range (Description)': 'Adult', 'Product Dimensions': '3.1 x 2.7 x 7.8 inches; 1.06 Pounds'}\nThis did a great job of leaving my hair moisturized without being greasy, and also leaving it shiny and bouncy.  I gave it 4 stars instead of 5 because it's not as good as some of the products I use that have coconut oil.  Nevertheless, it's a good product and worth a try.\nVery Good\nHair Drying Towels, METLUCK 3 Pack Hair Wrap Towels Super Absorbent Microfiber Hair Towel with Button Design to Dry Hair Quickly (Gray/Brown/Stripe)\nMETLUCK\n{'Package Dimensions': '12.95 x 9.45 x 3.15 inches; 9.38 Ounces'}\nI've become addicted to these hair towels because they're so convenient and effective. Regular towels are kind of heavy on your head. These are perfect. They're very soft, just the right size, and do a great job of soaking the water out of your hair.  They won't get your hair completely dry, but they will absorb a lot of water and leave your hair so that it's wet but not dripping wet.\nNice Hair Towels\nMicrofiber Hair Towels - 5 Towel Set – 5 Beautiful Colors - Great for all Hair Types - Size (10 x 26 inches) Lightweight, Absorbent, and Ultra Soft. Colors Rose, Pink, Gray, Blue, and Lilac.\nAViBNiUM\n{'Brand': 'AViBNiUM', 'Towel form type': 'Hair Towel', 'Age Range (Description)': 'All Ages', 'Material': 'Microfiber', 'Product Dimensions': '26\"L x 10\"W', 'Package Dimensions': '13 x 10 x 3 inches; 1.06 Pounds', 'UPC': '860005528004'}\nThese hair towels are very soft and comfortable.  This set is a good value because you get 5 of them.  They're well-made and should last a long time.\nNice Towels\nOrganic Dry Shampoo Light - Dry Shampoo Travel Size, Hair Powder Dry Shampoo for Women and Men, Volumizing Powder for Hair and Texture Powder, Hair Volume Powder for Blonde Hair\nBeauty by Earth\n{'Brand': 'Beauty by Earth', 'Item Form': 'Powder', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '1.5 Ounce', 'Package Dimensions': '5.5 x 1.3 x 1.3 inches; 2.4 Ounces', 'UPC': '850003968254'}\nThis dry shampoo does a really good job of making your hair look clean and also adding some volume.  It's also a great size for taking to the gym to use after a workout.\nGood Dry Shampoo\nSnowBuddy Kids 3 in 1 Shampoo + Conditioner + Body wash, Dust Cleansing Natural All in One - for kids - Gentle Baby head to toe wash, pH-Blanced with 90% of Natural derived Ingredients, Sulfate Free, Paraben Free, 350ml (11.8 fl.oz) (Shampoo)\nSnow Buddy\n{'Brand': 'Snow Buddy', 'Item Form': 'Liquid', 'Hair Type': 'Oily', 'Scent': 'Coconut, Floral', 'Age Range (Description)': 'Adult', 'Package Dimensions': '5.94 x 2.56 x 2.56 inches; 15.2 Ounces'}\nThis is a good shampoo that cleans well and leaves your hair soft and shiny. It has a nice, refreshing scent.  It can be used by anybody, not just kids.\nGood Shampoo\nJohn Frieda Detox and Repair Shampoo and Conditioner Set with Nourishing Avocado Oil and Green Tea, 8.45 Fl Oz (Pack of 2)\nJohn Frieda\n['John Frieda Detox and Repair Shampoo and Conditioner set removes product build up and revitalizes dry and stressed hair. Detox and Repair moisturizes and cleanses damaged hair and leaves hair visibly healthy and repaired. With antioxidant rich green tea and nourishing avocado oil. Your hair is exposed to many daily challenges that could make it look stressed and lifeless. Styling, product build up, and environmental influences can strain hair and can reduce the effect of caring ingredients. With antioxidant rich green tea and nourishing avocado oil, John Frieda Detox and Repair removes product build up and revitalizes hair immediately. The result: Repaired and healthy looking hair with silky shine. Satisfaction Guaranteed. Limitations may apply.']\n{'Product Benefits': 'Detoxifying', 'Brand': 'John Frieda', 'Hair Type': 'All, Dry', 'Number of Items': '2', 'Unit Count': '16.9 Fl Oz', 'Product Dimensions': '3 x 3.8 x 9.06 inches; 8.45 Ounces', 'UPC': '717226276545'}\nAvocado oil seems to be good at moisturizing without being greasy.  I have some body lotion with avocado oil and really like that, so I decided to try this shampoo/conditioner set.  It does a very good job of cleaning your hair and leaving it shiny and bouncy.  I still prefer coconut oil for hair, but avocado oil is doing a good job, too.\nGood Set\nLittle Moon Essentials Floral Bath & Shower Sugar Exfoliant, Relax, 2 oz.\nLittle Moon Essentials\n{'Brand': 'Little Moon Essentials', 'Skin Type': 'Dry', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Natural', 'Material Type Free': 'preservative free,paraben free', 'Package Dimensions': '2.2 x 2.2 x 1.3 inches; 2 Ounces', 'UPC': '673673882459'}\nThis is a pretty good body scrub that exfoliates your skin and leaves it soft and moisturized.  It's a little pricey for everyday use, so I took off one star for that.\nNice Scrub\nMirror Flower Nail Clippers Set 2Pcs, No Splash Nail Clippers for Fingernail and Toenail, Medical Grade Stainless Steel, Sharp Stainless Steel Flat/Oblique Nail Clipper, Trimmer Set for Men and Women\nMirror Flower\n{'Package Dimensions': '5.39 x 3.74 x 0.67 inches; 2.89 Ounces', 'UPC': '742703082661'}\nThese nail clippers are decent quality and do a good job of cutting/clipping your nails.  One of them is for clipping your fingernails, and the other for toenails.  They both work well and I have no complaints.\nGood Nail Clippers\nSibu NotOr Omega 7 Sea Buckthorn Oil Soft Gels, Anytime Face Wash, Facial Defense Oil, Skin Cleansing, Skin Moisturizing Core Kit\nsibu\n{'Brand': 'sibu', 'Scent': 'Berry, Coriander, Grapefruit, Orange, Patchouli', 'Item Form': 'Oil', 'Unit Count': '3.00 Count', 'Use for': 'Face', 'Package Dimensions': '10.94 x 10.31 x 3.78 inches; 1.19 Pounds', 'UPC': '850021730062'}\nThis is a very nice set of sea buckthorn oil products.  Sea buckthorn helps with a variety of skin problems.  My main issue is age spots.  The topical products help right away, by softening and moisturizing your skin as well as reducing any redness or discoloration.  The soft gels help long-term by repairing from within.  I think it's a great idea to have an entire set of products packaged all together.  It's nice not only for yourself, but would make a great gift for somebody this holiday season.\nGreat Set\nLemon Oil Towelettes - 20 Count\nHerban Essentials\n[\"The Essential Oil Towelettes from Herban Essentials combines clean hands with soothing scents. Our travel hand wipes work to keep your hands clean and skin soft. They also work as face cleansing wipes, face cloths, body wipes for adults bathing, and body wipes for men when you are traveling and cannot stop to take a shower. If you need a midday refresher, use one of our citrus moisture towelettes for an energizing pick-me-up! Our collection includes lemon wipes, facial wipes cleansing cloths, a natural towelette, and men's wipes.\"]\n{'Brand': 'Herban Essentials', 'Skin Type': 'All', 'Material Feature': 'Natural', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7 x 1 x 6 inches; 5.29 Ounces', 'Manufacturer': 'Herban Essentials', 'Country of Origin': 'USA'}\nThese towelettes are great for keeping in your car's glove compartment, putting inside your tote bag, or stashing away in your office desk.  They're very handy for times when you can't get to a sink and use soap and water.  They also smell great.  They're a little pricey for everyday use, so I took off one star for that.\nVery Convenient\nISA LAZO Body Scrub with Cranberry Seeds and Tea Tree Oil, Rejuvenating Botanical Oils, Clean Beauty, 6.7 oz.\nISA LAZO\n['Blended with tea tree oil and cranberry seed, there is an air of strength and confidence with every application. With active ingredients, this rejuvenating treatment defines miraculous development and improvement in skin texture, resilience and appearance.']\n{'Brand': 'ISA LAZO', 'Item Form': 'Seeds', 'Product Benefits': 'Softening', 'Material Feature': 'Natural', 'Item Volume': '6.7 Fluid Ounces', 'Package Dimensions': '5.2 x 5.16 x 2.83 inches; 6.7 Ounces', 'UPC': '860000693448'}\nThis body scrub does a nice job of both exfoliating and moisturizing.  It also smells great.\nNice Body Scrub\nGreenIVe Handcrafted Neem Bar Soap, Small Handmade Batches, Moisturize and Cleanse (1 Pack)\nGreenIVe\n{'Item Form': 'Flakes,Bar Soap', 'Skin Type': 'Dry', 'Brand': 'GreenIVe', 'Scent': 'Neem', 'Age Range (Description)': 'Adult', 'Package Dimensions': '7.64 x 3.03 x 1.57 inches; 4.16 Ounces', 'UPC': '810017844227'}\nThis soap is very nice.  It lathers up well and doesn't strip your skin of moisture.  It also smells great and doesn't have a lot of synthetic perfume.\nNice Soap\n100% PURE Coconut Body Scrub Exfoliating Deep Cleanse with Sea Salts & Nourishing Oils - Natural Deeply Moisturizing Skincare - Vibrant Radiant Skin Restore & Pore Cleanser - Vegan - 10oz\n100% PURE\n['Crystalline sea salt scrub smoothes while softening skin with rich, supple moisture. Suspended in a base of silky sunflower and apricot oils, this emollient sea salt scrub buffs away bumps and flakes to reveal glowing, rejuvenated skin.']\n{'Brand': '100% PURE', 'Material Feature': 'Natural', 'Number of Items': '1', 'Scent': 'Coconut', 'Recommended Uses For Product': 'Exfoliating', 'Package Dimensions': '3.66 x 3.62 x 1.93 inches; 11.99 Ounces', 'UPC': '843585107999', 'Manufacturer': '100% PURE'}\nThis is a good body scrub that exfoliates plus moisturizes your skin.  It also smells great.  Although it contains oils, it doesn't leave your skin excessively oily once you rinse it off.  It just leaves your skin soft and smooth.\nGood Body Scrub\nSasy n Savy, Citrus Soufflè Hydrating and Nourishing Body Crème, Plant-Based Natural Ingredients For Daily Moisture, 6.08 fl oz(180mL)\nSasy n Savy\n{'Brand': 'Sasy n Savy', 'Item Form': 'Cream', 'Unit Count': '6.1 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.76 x 1.77 x 6.69 inches; 10.41 Ounces'}\nThis is a nice body moisturizer that softens and hydrates your skin.  It absorbs well and has a nice scent.  The moisturizing effect isn't as long-lasting as I would like, but it's still a good lotion.\nGood Moisturizer",
  "actual_interaction": {
    "rating": 4.0,
    "title": "Good Moisturizer",
    "text": "This is a nice body moisturizer that softens and hydrates your skin.  It absorbs well and has a nice scent.  The moisturizing effect isn't as long-lasting as I would like, but it's still a good lotion.",
    "images": [],
    "asin": "B009GPP546",
    "parent_asin": "B009GPP546",
    "user_id": "AEE4M36AZAKURLEYGV23TM3BE7OQ",
    "timestamp": "2022-05-30 20:45:59.752000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Sasy n Savy, Citrus Soufflè Hydrating and Nourishing Body Crème, Plant-Based Natural Ingredients For Daily Moisture, 6.08 fl oz(180mL)",
    "average_rating": 4.8,
    "rating_number": 29,
    "features": [],
    "description": [],
    "price": 24.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31u3gbwCrCS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31u3gbwCrCS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/617SWVhQHyS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41nlF6VoyxL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41nlF6VoyxL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61fpxCFGGEL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61SVcf7TegL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/61SVcf7TegL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/91-tj9Fe1uL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51pcwG-9d8L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51pcwG-9d8L.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71FQTzcgq3L._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Deep Moisture with Citrus Body Souffle Creme",
        "url": "https://www.amazon.com/vdp/0806db6562cf4ab59143c399c005528b?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Excellent body products!!! ",
        "url": "https://www.amazon.com/vdp/0b78ad0ad9374562b4a26b736f852e8e?ref=dp_vse_rvc_1",
        "user_id": "/shop/momtravelsandhacks"
      }
    ],
    "store": "Sasy n Savy",
    "categories": [],
    "details": {
      "Brand": "Sasy n Savy",
      "Item Form": "Cream",
      "Unit Count": "6.1 Fl Oz",
      "Number of Items": "1",
      "Use for": "Whole Body",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "2.76 x 1.77 x 6.69 inches; 10.41 Ounces"
    },
    "bought_together": null
  }
}