{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/08/22\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Tim Miller'], 'Producers': ['Simon Kinberg', 'Ryan Reynolds', 'Lauren Shuler Donner'], 'Starring': ['Ryan Reynolds', 'Morena Baccarin', 'Ed Skrein'], 'Studio': ['Fox']}\nReview Text: This was a gift\nReview Title: Deadpool fans here’s your movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Psycho II / Psycho III / Psycho IV - The Beginning\nAnthony Perkins  (Actor, Director),     Meg Tilly  (Actor),     Mick Garris  (Director),     Richard Franklin  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['PSYCHO IIAfter years of treatment at a mental institution for the criminally insane, Norman Bates (Anthony Perkins) still can\\'t quite elude the demands of \"Mother.\" Vera Miles also returns as the inquisitive woman who is haunted by her sister\\'s brutal murder and the ominous motel where it all occurred. Meg Tilly and Dennis Franz co-star in this terrifying sequel to tone of the most suspenseful films of all time.PSYCHO IIIAnthony Perkins stars in and directs the most shocking Psycho film of all: Psycho III. After years in prison, Norman Bates returns home to the Bates Motel. When a pretty young woman (Diana Scarwid) runs to the motel - and Norman\\'s open arms - to escape a scandalous secret, he finally gets a chance at a new life. But he has one murderous skeleton in his closet that will do anything not to share him. It\\'s a new day at the Bates Motel, but the nightmares are just beginning…PSYCHO IV THE BEGINNINGIn this chilling prequel to the classic Hitchcock thriller, Norman Bates (Anthony Perkins) is drawn to a late night radio show, where the host (C.C.H. Pounder) encourages him to share his views on the topic of matricide - the murder of a mother by her own child. Reliving his childhood, Norman recounts his trails as a young boy (Henry Thomas) living with his widowed schizophrenic mother (Olivia Hussey). These haunting memories are more than just images of the past; they threaten to rekindle his killing urge in this spine-chilling thriller.', 'Bonus Content:', 'Disc 1 - Psycho II:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - Psycho III:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Aspect Ratio': '1.78:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': '2288184', 'Director': 'Mick Garris, Anthony Perkins, Richard Franklin', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 3 minutes', 'Release date': 'May 6, 2008', 'Actors': 'Anthony Perkins, Meg Tilly, Diana Scarwid, Henry Thomas, Vera Miles', 'Dubbed': 'Spanish, French', 'Subtitles': 'Spanish, French', 'Producers': 'Hilton A. Green', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0), Unqualified (DTS ES 6.1), Spanish (Dolby Digital 2.0), English (Dolby Digital 4.0)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Charles Edward Pogue, Tom Holland', 'Number of discs': '2'}\n. Very good, movie shows the dynamic between Norman, his mom, and her boyfriend. Creepy as the first one.\nPhysco\nBeachbody Tony Horton's P90 Base Kit DVD Workout\nBeachbody\nMovies & TV, TV\n[\"Extreme programs like P90X aren't for everyone. So welcome to the all-new P90—your gateway to getting fit regardless of your age or fitness level! Legendary trainer Tony Horton has now created shorter workouts that are simple, doable, and less extreme than his others, but still just as effective. So whether you haven't worked out in a decade, or you're just looking to maintain what you've got, P90 opens the door for you to see dramatic, visible results in just 90 days!   P90 includes 10 workouts on 4 DVDs, Simple Kitchen Nutrition Guide, 4-Step Power Plan, “How to Hit It” Tutorial, Pro-Grade Resistance Band, 6-Day Shred and 90-Day Workout Calendar.   NOTE: Speed Sculpt, Speed Sweat, Speed Abs, and Horton's Greatest Hits are NOT included in the P90 Base Kit, but can be purchased separately on Amazon\"]\n{'Item Package Dimensions L x W x H': '10.6 x 7.3 x 4.3 inches', 'Package Weight': '0.75 Kilograms', 'Brand Name': 'Beachbody', 'Model Name': 'FBA_P2DVD2108', 'Material': 'Plastic', 'Suggested Users': 'teen-boys, unisex-adult, womens, mens', 'Manufacturer': 'Beachbody', 'Part Number': 'FBA_P2DVD2108', 'Included Components': 'DVD', 'Date First Available': 'October 10, 2014', 'Brand': 'Beachbody', 'Format': 'DVD', 'Target Audience': 'consumer audience', 'Binding': 'Sports', 'Special Feature': 'Disc, Sports & Exercise'}\nExcellent program. As always drink your water and eat right. These exercises work!!! In 90 days you better be showing off what you have. Do take a before and after photo it really helps!\nPower 90\nCoat of Many Colors (DVD)\nStephen Herek  (Director),     Jennifer Nettles  (Actor),     Ricky Schroder  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Musicals\n['Coat of Many Colors (DVD)', 'Experience the magic and warmth of Dolly Parton’s Coat of Many Colors, a television movie event based on the inspiring true story of living legend Dolly Parton’s remarkable upbringing in rural Tennessee. This once-in-a-lifetime special takes place inside the tight-knit Parton family as they struggle to overcome devastating tragedy and discover the healing power of love, faith and a raggedy patchwork coat — vividly described in the well-known song of the film’s title — that helped make Parton who she is today. Set in the Tennessee Great Smokey Mountains in 1955, this poignant and uplifting family-friendly experience stars popular singer-songwriter and award winner Jennifer Nettles (Sugarland) as Parton’s mother, Avie Lee Parton; Ricky Schroder (NYPD Blue, 24) as Dolly’s father, Lee Parton; Gerald McRaney (Longmire, Deadwood, House of Cards) as Grandpa Jake Owens; and the young Alyvia Alyn Lind as 9-year-old Dolly.', ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.56 x 5.5 x 7.56 inches; 0.01 Ounces', 'Item model number': '35302918', 'Director': 'Stephen Herek, Sam Haskell', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '2 hours and 50 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Jennifer Nettles, Ricky Schroder, Gerald McRaney, Alyvia Alyn Lind', 'Subtitles': 'Spanish, English', 'Producers': 'Dolly Parton, Sam Haskell', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'Studio Distribution Services', 'Writers': 'Pamela Long', 'Number of discs': '1'}\nHeart warming story.\nDolly movie\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Danny Boyle'], 'Producers': ['Danny Boyle', 'Eric Fellner', 'Matthew James Wilkinson', 'Tim Bevan', 'Bernard Bellew', 'Richard Curtis'], 'Starring': ['Himesh Patel', 'Lily James', 'Sophia Di Martino'], 'Studio': ['Universal Pictures']}\nGood movie\nGood movie/soundtrack\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Anthony Russo', 'Joe Russo'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr.', 'Chris Evans', 'Mark Ruffalo'], 'Studio': ['Marvel']}\nThis was a gift for my brother and he loves it\nAvengers fans must have\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Crichton'], 'Producers': ['Michael Rachmil'], 'Starring': ['Richard Benjamin', 'James Brolin', 'Yul Brynner']}\nI was a small child when this came out. Almost any movie that had any type of robots fascinated me. SThis one sure did not knowing who might or might not be robots, even the ANIMALS❗️I had to rewatch all these years later.\nSci Fi Cowboy Robot movie\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Tim Miller'], 'Producers': ['Simon Kinberg', 'Ryan Reynolds', 'Lauren Shuler Donner'], 'Starring': ['Ryan Reynolds', 'Morena Baccarin', 'Ed Skrein'], 'Studio': ['Fox']}\nThis was a gift\nDeadpool fans here’s your movie",
  "profile": "The user maintains a strong affinity for horror films, particularly psychological thrillers that highlight suspenseful narratives and complex familial dynamics. Their reviews indicate a preference for classic and cult horror, alongside an appreciation for sequels and prequels that enhance the viewing experience. In recent interactions, they have embraced heartwarming narratives, showcasing a balanced taste that includes uplifting themes, as evidenced by gifting films to family members.\n\nThe user's commitment to health and wellness is emphasized by their engagement in a DVD workout program, reflecting a proactive approach and a desire to motivate others. This commitment indicates a well-rounded personality that integrates fitness into their lifestyle.\n\nAdditionally, the user is expanding their cinematic horizons to include superhero narratives, which resonate with their interest in character-driven stories. Their recent exploration of sci-fi themes, particularly films featuring robots, adds another layer to their diverse interests, emphasizing their appreciation for storytelling that blends science fiction concepts with psychological tension.\n\nOverall, the user cultivates a multifaceted personality that seamlessly merges their passion for horror with a focus on health, personal growth, and an expanding appreciation for varied storytelling across genres, including family-friendly, uplifting narratives, and sci-fi elements.",
  "metrics": {
    "rouge1_f": 0.11889596602972398,
    "rouge2_f": 0.007087172218284904,
    "rougeL_f": 0.05803255484784148,
    "meteor": 0.03332341565010414,
    "bleu1": 0.00023108721039768286,
    "bleu2": 6.082614441515255e-05,
    "bleu3": 9.972713112190426e-06,
    "bleu4": 4.0427665816143965e-06,
    "bertscore_precision": 0.3160569667816162,
    "bertscore_recall": 0.4484209418296814,
    "bertscore_f1": 0.37078002095222473
  }
}