{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Alvin And The Chipmunks - The Chipmunks Go To The Movies\nReview Date: 2014/03/03\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nAverage Rating: 4.5\nProduct Details: {'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Alvin & The Chipmunks', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 6 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 6 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Alvin & The Chipmunks', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: my 4 yr old grdaughter loves all of the chipmonk movies.so I try to get them at good prices,I myself didnt care for this one too much\nReview Title: 4 yr old loved it\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Action 10-Pack (Walking Tall / Juggernaut / The Killer Elite / Blown Away / Harley Davidson and the Marlboro Man / No Man's Land / Ronin / Stone Cold / Winners Take All / Boot Camp)\nDwayne Johnson  (Actor),     Richard Harris  (Actor),     Kevin Bray  (Director),     Richard Lester  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['This collection contains', 'Juggernaut', ',', 'The Killer Elite', ',', 'Blown Away', ',', 'Harley Davidson and the Marlboro Man', ',', \"No Man's Land\", ',', 'Ronin', ',', 'Stone Cold', ',', 'Winners Take All', ',', 'Boot Camp', ', and', 'Walking Tall']\n{'Genre': 'Action & Adventure', 'Format': 'Widescreen, NTSC', 'Contributor': 'Stephen Hopkins, Mickey Rourke, Kevin Bray, Richard Lester, James Caan, Sam Peckinpah, Dwayne Johnson, Richard Harris, Jeff Bridges, Simon WincerStephen Hopkins, Mickey Rourke, Kevin Bray, Richard Lester, James Caan, Sam Peckinpah, Dwayne Johnson, Richard Harris, Jeff Bridges, Simon Wincer  See more', 'Language': 'English', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 7.2 Ounces', 'Director': 'Kevin Bray, Richard Lester, Sam Peckinpah, Stephen Hopkins, Simon Wincer', 'Media Format': 'Widescreen, NTSC', 'Release date': 'October 5, 2010', 'Actors': 'Dwayne Johnson, Richard Harris, James Caan, Jeff Bridges, Mickey Rourke', 'Studio': 'MGM (Video & DVD)', 'Number of discs': '6'}\nwas happy with how fast it was shipped and all the movies in the combo pack...was looking for one movie on this list and it was over 20..got this 10 pk for less than half of the one movie.\nnice collection\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Minkoff'], 'Producers': ['Doug Wick', 'Lucy Fisher'], 'Starring': ['Geena Davis', 'Michael J. Fox', 'Hugh Laurie'], 'Studio': ['Columbia Pictures']}\nthis is an older movie that my kids and grandkids love to watch..love the way that Stuart looks so real and the way he and the cats mouths move when they talk..my 3yr old gd. loves it..and so do I..\nso cute to watch\nNi Hao Kai-Lan: Princess Kai-Lan\nU, Karen Chau  (Director),     Chau, Karen  (Director),     Peters, Jade-Lianna  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Movies & TV Holiday Wishlist\n['Kai-lan, Rintoo, Tolee and Hoho are playing in the backyard when they get a visit from their superhero friend, the Monkey King, who really needs their help. Will Kai-lan and her friends go on an adventure with the Monkey King and see what they can do? Of course they will! The Monkey King gives them robes to wear that give them special powers to float, jump, and spin in the air! They’ll have to use their special powers – and the viewer’s help – to leap over bamboo forests, travel past a moat of giant bubbles, and find their way into the majestic palaces.']\n{'Genre': \"Children's\", 'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Peters, Jade-Lianna, U, Karen Chau, Chau, Karen', 'Language': 'Unqualified', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'U, Karen Chau, Chau, Karen', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Actors': 'Peters, Jade-Lianna', 'Studio': 'NIC'}\nmy 4 yr old grandaughter loves these movies.I couldnt find any of them in the stores so I was very glad to be able to find them on the amazon. I like the fact that each one of these kinds of movies teaches  about different cultures and lifestyles in a way that is interesting for little kids.\ngreat story line\nNi Hao, Kai-Lan: Kai-Lan's Great Trip to China\nRated:    NR    Format: DVD\nMovies & TV, Animation\n[\"Join Kai-Lan and her friends Rintoo, Tolee and Ho Ho on their exciting trip to China! In the double-length, feature episode Kai-lan and her friends travel to visit her aunt and a baby panda in China, and are amazed by all the things they see along the way! The DVD includes 2 additional episodes, plus a Kai-Lan Goes to China game. Special Features: Full Frame Audio: Dolby Digital, Stereo - English Features: 1. Music Video: We're Going to China Music Video Runtime: 96 Minutes.\"]\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '097368931046', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'July 14, 2009', 'Studio': 'Nickelodeon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nmy 4 yr old grandaughter loves these movies.I couldnt find any of them in the stores so I was very glad to be able to find them on the amazon. I like the fact that each one of these kinds of movies teaches  about different cultures and lifestyles in a way that is interesting for little kids.\ngood culture movie\nNi Hao, Kai-Lan: Super Special Days\nClem Cheung  (Actor),     Khamani Griffin  (Actor),     Allan Jacobsen  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Product Description', 'Super Special Days!', 'is the DVD launch of', 'Ni Hao, Kai-lan', '.', 'Ni Hao Kai-lan', 'is an all-new animated series from Nickelodeon designed to open the eyes, ears and hearts of children to a fantastic new way to understand their social, emotional and physical world. Kai-lan and her animal friends encounter and learn to overcome daily obstacles that will help kids at home make sense of the world around them. Aspects of Chinese-American family, food and culture, as well as basic Mandarin Chinese phrases are woven throughout the episodes.', 'Amazon.com', 'A sort of', 'Dora the Explorer', 'that features Mandarin Chinese instead of Spanish,', 'Ni hao, Kai-lan', \"is an entertaining Nick Jr. animated program for preschoolers that positively portrays biculturalism, helps build problem solving skills, and introduces basic Chinese words. Kai-lan is a creative, compassionate young girl who has a very close relationship with her Grandfather (YeYe) and loves to play and try new things with her many animal friends including Tolee the koala, Rintoo the tiger, and Hoho the monkey. Like all young children, Kai-lan and her friends play and explore and minor conflicts and emotional outbursts inevitably arise. Kai-lan has a way of stepping back and reviewing the situation to reveal the underlying problem, whether it's hurt feelings, frustration, or downright anger. With a little help from her grandfather and his calming techniques, she always finds a way to support her friends and make everyone feel better. Along the way, viewers learn some basic Chinese words and get a sense of the importance Chinese culture places on things like intergenerational families, calmness, and looking at things from another's perspective. (Ages 3 to 7)\", '--Tami Horiuchi']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Philip Malamuth, Khamani Griffin, Clem Cheung, Jade-Lianna Peters, Preston Strother, Zachary Gordon, Jack Samson, Laura Marano, Cheryl Katz, Karen Chau, Allan Jacobsen, Beverly Duan, Angie Wu, Ben Wang, Hsiang LoPhilip Malamuth, Khamani Griffin, Clem Cheung, Jade-Lianna Peters, Preston Strother, Zachary Gordon, Jack Samson, Laura Marano, Cheryl Katz, Karen Chau, Allan Jacobsen, Beverly Duan, Angie Wu, Ben Wang, Hsiang Lo   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.57 x 5.36 x 7.59 inches; 2.72 Ounces', 'Item model number': '3978295', 'Director': 'Allan Jacobsen', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'May 8, 2012', 'Actors': 'Clem Cheung, Khamani Griffin, Angie Wu, Jack Samson, Jade-Lianna Peters', 'Dubbed': 'English', 'Studio': 'Nickelodeon', 'Writers': 'Karen Chau', 'Number of discs': '1'}\ngood for kids to watch, shows them that life is always good when you have family and friends around you\nevery day is special when you have friends\nTop Gun (Full Screen Collector's Edition)\nTom Cruise  (Actor),     Kelly McGillis  (Actor),     Tony Scott  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['In TOP GUN, Tom Cruise stars as Maverick, a talented training pilot in an elite U.S. school for fighter pilots. When he stumbles upon some MiG\\'s over the Persian Gulf, and his wingman panics, Maverick cleverly talks him through the situation to safety. Consequently, he is moved up in rank and sent to the Top Gun Naval Flying School. There he has several conflicts with other students while trying to live up to his deceased father\\'s reputation. Unable to cope with the death of his best friend, and fellow pilot, Goose, Maverick contemplates dropping out, but follows through with his dream and ultimately becomes one of the \"best of the best.\"']\n{'Format': \"Collector's Edition, Color, Dolby, DTS Surround Sound, Full Screen, NTSC, Widescreen\", 'Contributor': 'Kelly McGillis, Anthony Edwards, Rick Rossovich, Jerry Bruckheimer, Michael Ironside, Bill Badalato, Ehud Yonay, Tim Robbins, Barry Tubb, Warren Skaaren, Jim Cash, John Stockwell, Tom Skerritt, Whip Hubley, Tony Scott, Don Simpson, Clarence Gilyard Jr., Meg Ryan, Jack Epps Jr., Tom Cruise, Val KilmerKelly McGillis, Anthony Edwards, Rick Rossovich, Jerry Bruckheimer, Michael Ironside, Bill Badalato, Ehud Yonay, Tim Robbins, Barry Tubb, Warren Skaaren, Jim Cash, John Stockwell, Tom Skerritt, Whip Hubley, Tony Scott, Don Simpson, Clarence Gilyard Jr., Meg Ryan, Jack E…  See more', 'Language': 'English', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4 Ounces', 'Director': 'Tony Scott', 'Media Format': \"Collector's Edition, Color, Dolby, DTS Surround Sound, Full Screen, NTSC, Widescreen\", 'Run time': '1 hour and 50 minutes', 'Release date': 'December 14, 2004', 'Actors': 'Tom Cruise, Kelly McGillis, Val Kilmer, Anthony Edwards, Tom Skerritt', 'Producers': 'Bill Badalato, Don Simpson, Jerry Bruckheimer, Warren Skaaren', 'Studio': 'Paramount', 'Writers': 'Ehud Yonay, Jack Epps Jr., Jim Cash', 'Number of discs': '2'}\nlove this movie cause I love anything with jets in them..the case was a little damaged by opening it alot Im guessing..but the disc itself was just fine\ngreat movie\nAlvin And The Chipmunks - The Chipmunks Go To The Movies\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n{'Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Contributor': 'Alvin & The Chipmunks', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 6 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.88 Ounces', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Full Screen, NTSC', 'Run time': '1 hour and 6 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Alvin & The Chipmunks', 'Studio': 'Paramount', 'Number of discs': '1'}\nmy 4 yr old grdaughter loves all of the chipmonk movies.so I try to get them at good prices,I myself didnt care for this one too much\n4 yr old loved it",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interest**: The user is enthusiastic about action and adventure films, particularly those centered on aviation themes. They also display a growing fascination with family-friendly content that educates children about cultural diversity. Recent activities indicate a preference for animated films that engage younger audiences, alongside classic military movies emphasizing personal growth and resilience.\n\n- **Shopping Behavior**: The user values cost-effectiveness, especially in acquiring educational and entertaining children’s media. They are inclined to seek out iconic action films for their collection while also appreciating popular animated features that appeal to their granddaughter.\n\n- **Content Format Preference**: A strong inclination towards physical media persists, with a preference for DVDs that foster shared family experiences. Recent purchases highlight a blend of animated content and educational films, enriching family learning environments.\n\n- **Quality Expectations**: The user maintains high standards for product quality and shipping, typically providing positive feedback for experiences that meet or exceed expectations, particularly regarding entertainment and educational value.\n\n- **Entertainment Value**: They cherish narratives that resonate across generations, focusing on themes of ambition, responsibility, and cultural storytelling. Their engagement with animated films indicates an evolving interest in accessible content for children.\n\n- **Rating Behavior**: The user tends to rate highly, particularly valuing the quality of content and physical condition of media, demonstrating an affinity for products that effectively cater to family interests.\n\nThis summary reflects the user’s commitment to blending adventure with education while enhancing family connections through diverse cinematic experiences.",
  "metrics": {
    "rouge1_f": 0.10273643783005279,
    "rouge2_f": 0.004805382027871216,
    "rougeL_f": 0.052808449351896304,
    "meteor": 0.031861287121198706,
    "bleu1": 0.0001539802839207672,
    "bleu2": 2.9017638134229943e-05,
    "bleu3": 4.869825071138376e-06,
    "bleu4": 1.996615362400556e-06,
    "bertscore_precision": 0.34532299637794495,
    "bertscore_recall": 0.46572864055633545,
    "bertscore_f1": 0.3965883255004883
  }
}