{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nReview Date: 2020/12/01\nStore: AILIWEI\nAverage Rating: 3.7\nProduct Details: {'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nReview Text: So for me this wig looks different than the photos but it's okay enough for me. I'm not picky but it's not a 5 star item because of the differences between the photos and the item. though for the price it does look great and realistic.\nReview Title: Hmmm....\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Taya Beauty Buriti Nut Intensive Repair Shampoo & Conditioner Duo – Organic Hydrating Shampoo and Conditioner for Dry Damaged Hair - Restorative Hair Care – Travel Size 2 fl oz\nTAYA I AM.\n{'Product Benefits': 'Hydrating', 'Item Form': 'Liquid', 'Brand': 'TAYA I AM.', 'Hair Type': 'All, Dull, Color Treated, Dry, Chemically Treated, Damaged', 'Number of Items': '2', 'Package Dimensions': '5.25 x 3.5 x 1.1 inches; 2 Ounces', 'UPC': '858308002635'}\nFor the price of shampoo and conditioner, I buy all natural and still get bottles easily 10-20x the size of these, this would be a good travel kit, but it's not worth the money... The scent isn't bad, and it's overall decent, but it's far too expensive for the size.\nTiny bottles, good product...\nX5 Superlite Advanced Ionic Cushion Hairbrush - Frizz-free Styler & Detangler for Wet or Dry Hair - Silver Black\nX5 Superlite\n{'Brand': 'X5 Superlite', 'Color': 'Black,Silver', 'Shape': 'Oval', 'Special Feature': 'Vented, Ionic, Non Slip', 'Product Benefits': 'Smoothing', 'Product Dimensions': '3 x 1 x 10 inches; 4.66 Ounces', 'UPC': '705320126538'}\nSo I'm used to hairbrushes being heavy and making brushing my long hair even more of a chore than it already is to get all the tangles out, but this brush is extremely light and it doesn't compromise on quality to get that light... I'm thoroughly impressed at how well this brush performs with my mess of hair. ^.^\nWell that's a light hairbrush!\n24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nAILIWEI\n{'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nSo for me this wig looks different than the photos but it's okay enough for me. I'm not picky but it's not a 5 star item because of the differences between the photos and the item. though for the price it does look great and realistic.\nHmmm....",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** This user favors natural and organic personal care products, particularly those aimed at restoring and hydrating hair. They appreciate high-quality hair tools that enhance their hair care routine. Recently, they have also shown interest in wigs, reflecting a willingness to explore diverse hair styling options.\n\n- **Value Sensitivity:** They place a significant emphasis on value for money, expressing dissatisfaction with the size-to-price ratio of products, and prefer larger sizes for better cost-effectiveness. While they appreciate affordability, their recent purchase indicates they are open to spending on products that meet their expectations.\n\n- **Travel Compatibility:** The user continues to express a preference for travel-sized products, highlighting their priority for convenience while traveling.\n\n- **Scent Acceptance:** They maintain a neutral to positive attitude towards product scents, which are not a primary factor in their purchasing decisions.\n\n- **Overall Experience:** Generally satisfied with product performance, the user remains pragmatic about cost and size in personal care purchases. Their recent experience with a wig reveals that while they seek quality, they are somewhat flexible regarding appearances versus expectations, provided they receive decent value.\n\n- **Hair Care Focus:** They are particularly engaged in caring for dry and damaged hair and value lightweight tools that streamline their hair care routine, reflecting their desire for ease and efficiency while styling.",
  "metrics": {
    "rouge1_f": 0.22299651567944254,
    "rouge2_f": 0.02447552447552448,
    "rougeL_f": 0.10801393728222997,
    "meteor": 0.10984182776801406,
    "bleu1": 0.1254134909559334,
    "bleu2": 0.03334152255259487,
    "bleu3": 0.005826413187026558,
    "bleu4": 0.0024378374170585574,
    "bertscore_precision": 0.37395551800727844,
    "bertscore_recall": 0.443728506565094,
    "bertscore_f1": 0.4058651328086853
  }
}