{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nReview Date: 2020/12/11\nStore: YanJie\nAverage Rating: 4.2\nProduct Details: {'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReview Text: I specifically use these to keep hair off my face when washing, and it works very well for that... makes it much easier to wash up! quality seems to be good too, I have no complaints.\nReview Title: So...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Taya Beauty Buriti Nut Intensive Repair Shampoo & Conditioner Duo – Organic Hydrating Shampoo and Conditioner for Dry Damaged Hair - Restorative Hair Care – Travel Size 2 fl oz\nTAYA I AM.\n{'Product Benefits': 'Hydrating', 'Item Form': 'Liquid', 'Brand': 'TAYA I AM.', 'Hair Type': 'All, Dull, Color Treated, Dry, Chemically Treated, Damaged', 'Number of Items': '2', 'Package Dimensions': '5.25 x 3.5 x 1.1 inches; 2 Ounces', 'UPC': '858308002635'}\nFor the price of shampoo and conditioner, I buy all natural and still get bottles easily 10-20x the size of these, this would be a good travel kit, but it's not worth the money... The scent isn't bad, and it's overall decent, but it's far too expensive for the size.\nTiny bottles, good product...\nX5 Superlite Advanced Ionic Cushion Hairbrush - Frizz-free Styler & Detangler for Wet or Dry Hair - Silver Black\nX5 Superlite\n{'Brand': 'X5 Superlite', 'Color': 'Black,Silver', 'Shape': 'Oval', 'Special Feature': 'Vented, Ionic, Non Slip', 'Product Benefits': 'Smoothing', 'Product Dimensions': '3 x 1 x 10 inches; 4.66 Ounces', 'UPC': '705320126538'}\nSo I'm used to hairbrushes being heavy and making brushing my long hair even more of a chore than it already is to get all the tangles out, but this brush is extremely light and it doesn't compromise on quality to get that light... I'm thoroughly impressed at how well this brush performs with my mess of hair. ^.^\nWell that's a light hairbrush!\n24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nAILIWEI\n{'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nSo for me this wig looks different than the photos but it's okay enough for me. I'm not picky but it's not a 5 star item because of the differences between the photos and the item. though for the price it does look great and realistic.\nHmmm....\nMakeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nYanJie\n{'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nI specifically use these to keep hair off my face when washing, and it works very well for that... makes it much easier to wash up! quality seems to be good too, I have no complaints.\nSo...",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** This user has a strong inclination towards natural and organic personal care products, especially those designed for restoring and hydrating hair. They appreciate high-quality hair tools that support their hair care routine and are increasingly exploring wig options for diverse styling.\n\n- **Recent Engagement:** The user recently purchased hair accessories to enhance their skincare routine, indicating an interest in practical tools that facilitate personal care. They rated this purchase highly, reflecting their satisfaction with the product's quality and functionality.\n\n- **Value Sensitivity:** They emphasize value for money and prefer larger sizes for better cost-effectiveness. Although they appreciate affordability, they are open to investing in products that deliver quality and meet their expectations.\n\n- **Travel Compatibility:** The user prioritizes travel-sized products for convenience while on the go, aligning with their active lifestyle.\n\n- **Scent Acceptance:** They maintain a neutral to positive stance on scents, noting that this factor does not heavily influence their purchasing decisions.\n\n- **Overall Experience:** Generally content with product performance, the user is pragmatic about cost and size. Their recent accessory purchase indicates a focus on ease and efficiency in their personal care routine, further highlighting their commitment to caring for dry and damaged hair and streamlining their styling process.",
  "metrics": {
    "rouge1_f": 0.2072072072072072,
    "rouge2_f": 0.015060240963855418,
    "rougeL_f": 0.09009009009009009,
    "meteor": 0.08957515782289711,
    "bleu1": 0.07185479371001531,
    "bleu2": 0.01449531785228566,
    "bleu3": 0.002739459713532081,
    "bleu4": 0.0011920659841922613,
    "bertscore_precision": 0.35960233211517334,
    "bertscore_recall": 0.4414724111557007,
    "bertscore_f1": 0.3963538110256195
  }
}