{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fabulous Frannie Anxious 10ml Roll-On Pre-Diluted made with Pure Essential Oils (Lavender, Bitter Orange, Bergamot and Clary Sage) Great for Aromatherapy\nReview Date: 2020/06/17\nStore: Fabulous Frannie\nProduct Description: ['Fabulous Frannie Anxious Roll On made with Lavender, Bitter Orange, Bergamot and Clary Sage Pure Essential Oils and Coconut Carrier Oil. Instructions: For best results shake well before use. Apply to the back of the neck, temples, forehead and reflex areas on the hands and feet.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '2 x 2 x 4 inches; 0.34 Ounces', 'UPC': '095474144633', 'Manufacturer': 'Fabulous Frannie'}\nReview Text: Product leaks around the roller and gets everywhere not worth the money due to poor quality very disappointing\nReview Title: Leaks\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Essential Oils Travel Case - Classic Khaki Waxed Canvas Bag | Holds 6 Essential Oil Bottles\nRed Silk Essentials\n{'Package Dimensions': '6.1 x 4.1 x 0.9 inches; 2.4 Ounces', 'UPC': '013415448831'}\nI got it and after 2 days later the zipper broke very poor quality. They said they would replace it still haven’t seen one it’s been over a month still nothing I’d like an address to return this item and get a refund! I was promised a replacement it’s honorable to keep your word!\nBroken zipper\nFabulous Frannie Anxious 10ml Roll-On Pre-Diluted made with Pure Essential Oils (Lavender, Bitter Orange, Bergamot and Clary Sage) Great for Aromatherapy\nFabulous Frannie\n['Fabulous Frannie Anxious Roll On made with Lavender, Bitter Orange, Bergamot and Clary Sage Pure Essential Oils and Coconut Carrier Oil. Instructions: For best results shake well before use. Apply to the back of the neck, temples, forehead and reflex areas on the hands and feet.']\n{'Product Dimensions': '2 x 2 x 4 inches; 0.34 Ounces', 'UPC': '095474144633', 'Manufacturer': 'Fabulous Frannie'}\nProduct leaks around the roller and gets everywhere not worth the money due to poor quality very disappointing\nLeaks",
  "profile": "**User Profile Summary:**\n\n- **Product Focus:** Interest in essential oils and related accessories.\n- **Quality Consciousness:** Strong emphasis on product quality, particularly zippers, overall durability, and the functionality of applicators.\n- **Customer Service Expectation:** Expects prompt and reliable customer service, including timely replacements and clear return processes.\n- **Frustration with Delays:** Discontent with slow responses and unresolved issues in customer service, indicating a low tolerance for delays and unmet promises.\n- **Skepticism:** Experiences with poor product quality, especially issues like leaking, leading to increased skepticism towards future purchases in similar categories.\n- **Review Behavior:** Willing to share negative feedback publicly, reflecting a desire for accountability and improvement in product standards. Recent reviews display a direct correlation to specific product deficiencies—highlighting issues such as quality control and functionality.\n\nOverall, this user exhibits a preference for high-quality essential oil products, a strong expectation for effective customer service, and readiness to express dissatisfaction when these expectations are not met, particularly when experiencing poor product performance. Their recent negative review emphasizes an ongoing concern regarding the impact of product quality on overall satisfaction.",
  "metrics": {
    "rouge1_f": 0.22994652406417113,
    "rouge2_f": 0.01612903225806452,
    "rougeL_f": 0.1122994652406417,
    "meteor": 0.14297554910899293,
    "bleu1": 0.21478257757881647,
    "bleu2": 0.009438943372206458,
    "bleu3": 0.0033356832405501947,
    "bleu4": 0.001985100497172233,
    "bertscore_precision": 0.37944090366363525,
    "bertscore_recall": 0.4096565246582031,
    "bertscore_f1": 0.39397019147872925
  }
}