{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Real Smoothness Unrefined African Shea Butter for Skin and Hair, 16 oz\nReview Date: 2015/09/13\nStore: Real Smoothness\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Real Smoothness', 'Item Form': 'Butter', 'Unit Count': '1 count', 'Skin Type': 'Dry', 'Item Volume': '473 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.35 x 2.17 x 0.79 inches; 2.15 Pounds', 'Item model number': 'REALSHEA', 'UPC': '784672309981'}\nReview Text: I am a huge fan of shea butter!  I use it in several receipes as I am always making lotions, or salves.  This brick of shea butter does not disappoint.  It has the nutty earthy aroma which is normal for shea butter.  This melted down evenly.  I was able to easily blend it with other ingredients very easily. I had no issues with this product at all  The best part is it came with a free bottle of lavender.  Well that just gave me the go ahead to make some whipped shea butter lotion.  I put the shea butter melted it down, with some coconut oil, and cocoa butter and then added about 30 drops of the lavender to make me some great lotion.  All ingredients are good for the skin and will heal all dry skin issues.<br /> I received this product for free for testing and reviewing purposes,  this is my honest and unbiased opinion.\nReview Title: This brick of shea butter does not disappoint. It has the nutty earthy aroma which is ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Real Smoothness Unrefined African Shea Butter for Skin and Hair, 16 oz\nReal Smoothness\n{'Brand': 'Real Smoothness', 'Item Form': 'Butter', 'Unit Count': '1 count', 'Skin Type': 'Dry', 'Item Volume': '473 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.35 x 2.17 x 0.79 inches; 2.15 Pounds', 'Item model number': 'REALSHEA', 'UPC': '784672309981'}\nI am a huge fan of shea butter!  I use it in several receipes as I am always making lotions, or salves.  This brick of shea butter does not disappoint.  It has the nutty earthy aroma which is normal for shea butter.  This melted down evenly.  I was able to easily blend it with other ingredients very easily. I had no issues with this product at all  The best part is it came with a free bottle of lavender.  Well that just gave me the go ahead to make some whipped shea butter lotion.  I put the shea butter melted it down, with some coconut oil, and cocoa butter and then added about 30 drops of the lavender to make me some great lotion.  All ingredients are good for the skin and will heal all dry skin issues.<br /> I received this product for free for testing and reviewing purposes,  this is my honest and unbiased opinion.\nThis brick of shea butter does not disappoint. It has the nutty earthy aroma which is ...",
  "profile": "**User Profile Summary:**\n\nThe user exhibits a strong preference for natural skincare products, particularly those that are rich in nourishing ingredients like shea butter. They demonstrate an interest in DIY skincare, frequently blending ingredients to create personalized lotions and salves. The user appreciates the sensory aspects of products, noting the pleasant earthy aroma of shea butter and its versatility in formulations. They prioritize healing properties for dry skin and seem to favor products that enhance the efficacy of their homemade recipes. \n\nAdditionally, the user's willingness to incorporate complimentary items (like lavender) into their routines indicates a trend towards holistic and scented skincare options. Their enthusiasm for the quality of the shea butter and the positive outcome of their DIY projects showcases a commitment to effective, natural solutions for skin care. This aligns with a broader inclination towards sustainable and health-conscious beauty practices. Overall, the user values utility, quality, and sensory enjoyment in their skincare journey.",
  "metrics": {
    "rouge1_f": 0.2797927461139896,
    "rouge2_f": 0.06770833333333333,
    "rougeL_f": 0.15544041450777202,
    "meteor": 0.15058321017022067,
    "bleu1": 0.20085393896461512,
    "bleu2": 0.09993098782892199,
    "bleu3": 0.04540699820857263,
    "bleu4": 0.013096912744164796,
    "bertscore_precision": 0.4298146069049835,
    "bertscore_recall": 0.4846397042274475,
    "bertscore_f1": 0.4555836617946625
  }
}