{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Brazilian Kinky Weave Hair Virgin Hair Kinky Curly Remy Brazillian 100% Human Hair Weave Jerry Curly Virgin Remy Human Hair Bundles Brown Human Hair Weave kinky curly 18 20 22 Inch NIUDINNG\nReview Date: 2021/07/05\nStore: NIUDINNG\nAverage Rating: 1.0\nProduct Details: {'Brand': 'NIUDINNG', 'Material': 'Human Hair', 'Extension Length': '22 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Durable'}\nReview Text: Well, I have tried many  of Amazon Weave hair and this  was not a good selection. It was very thin and stringy, not good quality.  I put one bundle on and I am sure it is not human hair. I returned the package back to the seller for a refund.  Just my opinion\nReview Title: Brazilian Kinky weave hair is not as good as it looks\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Curly Hair Wave 1 Bundles 18 Inch 100% Unprocessed Kinky Curly Human Hair Bundles Extensions Natural Black Color\nSnowHair\n{'Brand': 'SnowHair', 'Color': 'Black', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Product Dimensions': '4.8 x 1 x 0.4 inches; 4.8 Ounces', 'UPC': '682559651836'}\nExcellent hair. I  really enjoying it\nI love this hair, very soft and natural\nSelina, Brazilian Curly Hair Bundles, 1 Bundle,cheap bundles, Kinky Curly, human hair bundles, Remy Hair bundles, virgin curly hair bundles, 100 Gram/Bundle (18\", Natural Black)\nSelina\n{'Brand': 'Selina', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7 x 5 x 2.6 inches; 3.99 Ounces', 'UPC': '824918169808'}\nThis hair was very soft and natural. Very thin but nice hair\nNice hair\nBeautyGirl Hair Brazilian Water Wave 4 Bundles 16 18 20 22inches Unprocessed Water Wave Curly Human Hair Weave Brazilian Water Wave Virgin Hair Bundles Natural Color\nBeautyGirl\n{'Brand': 'BeautyGirl', 'Material': 'Human Hair', 'Extension Length': '22 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Package Dimensions': '10.94 x 7.68 x 2.76 inches; 10.23 Ounces'}\nYour ad said Brazilian Water Wave human hair. This is not Human hair. I received a blend of synthetic hair. This was false advertisement.  Not good.<br /><br />Taylor\nVery disappointment with this hair\nBrazilian Kinky Weave Hair Virgin Hair Kinky Curly Remy Brazillian 100% Human Hair Weave Jerry Curly Virgin Remy Human Hair Bundles Brown Human Hair Weave kinky curly 18 20 22 Inch NIUDINNG\nNIUDINNG\n{'Brand': 'NIUDINNG', 'Material': 'Human Hair', 'Extension Length': '22 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Durable'}\nWell, I have tried many  of Amazon Weave hair and this  was not a good selection. It was very thin and stringy, not good quality.  I put one bundle on and I am sure it is not human hair. I returned the package back to the seller for a refund.  Just my opinion\nBrazilian Kinky weave hair is not as good as it looks",
  "profile": "**Updated User Profile Summary:**\n\n- **Purchase Preference:** The user remains committed to human hair extensions, particularly those with curly textures. However, they have encountered multiple instances of disappointment with new brands, leading to heightened caution and skepticism regarding product claims.\n  \n- **Quality Expectation:** There is an unwavering expectation for softness, durability, and a natural appearance in hair products. Recent experiences have highlighted significant discrepancies from these standards, particularly regarding product authenticity.\n\n- **Rating Trend:** The user's satisfaction ratings have shifted markedly, as evidenced by multiple low ratings reflecting serious dissatisfaction due to issues related to quality and false advertising. This indicates a growing awareness and intolerance for subpar products.\n\n- **Brand Affinity:** While the user is still open to exploring new brands, they approach potential purchases with increased scrutiny and skepticism, especially after facing misleading marketing claims.\n\n- **Hair Color Preference:** Consistent with prior preferences, the user seeks natural hair colors.\n\n- **Length Preference:** The user continues to prefer 18-inch extensions but demonstrates some flexibility, as seen in recent purchases of longer lengths.\n\n- **Interaction Style:** The user has voiced frustration and disappointment in their latest reviews, contrasting sharply with their previously positive feedback, revealing a more critical approach to evaluating hair products.\n\nOverall, the user has become more discerning due to a series of disappointing experiences with new brands, reinforcing their commitment to quality and honest marketing in future purchases.",
  "metrics": {
    "rouge1_f": 0.1798941798941799,
    "rouge2_f": 0.017699115044247787,
    "rougeL_f": 0.09523809523809523,
    "meteor": 0.09235169929907149,
    "bleu1": 0.12656315738448776,
    "bleu2": 0.026434633286595233,
    "bleu3": 0.005053315892683717,
    "bleu4": 0.002211288718616703,
    "bertscore_precision": 0.3624502420425415,
    "bertscore_recall": 0.38739386200904846,
    "bertscore_f1": 0.37450721859931946
  }
}