{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bumblebee\nReview Date: 2019/08/23\nCategories: Action, Adventure, Intense, Stunning\nProduct Description: ['Charlie, on the cusp of turning 18 and trying to find her place in the world, discovers Bumblebee, battle-scarred and broken. When Charlie revives him, she quickly learns this is no ordinary, yellow VW bug.']\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Travis Knight'], 'Producers': ['Don Murphy', 'Tom Desanto', 'Lorenzo Di Bonaventura', 'Michael Bay', 'Mark Vahradian', 'Steven Spielberg', 'Brian Goldner', 'Chris Brigham'], 'Starring': ['Hailee Steinfeld', 'Jorge Lendeborg Jr.']}\nReview Text: Terrible. Couldn't stand to get past the first 20 or so minutes. Had to fast forward to the end. Worst TF movie in the franchise.\nReview Title: Don't bother. Barf.\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Inception (Blu-ray)\nLeonardo DiCaprio  (Actor),     Ken Watanabe  (Actor),     Christopher Nolan  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Acclaimed filmmaker Christopher Nolan directs an international cast in this sci-fi actioner that travels around the globe and into the world of dreams. Dom Cobb (Leonardo DiCaprio) is the best there is at extraction: stealing valuable secrets inside the subconscious during the mind’s vulnerable dream state. His skill has made him a coveted player in industrial espionage but also has made him a fugitive and cost him dearly. Now he may get a second chance if he can do the impossible: inception, planting an idea rather than stealing one. If they succeed, Cobb and his team could pull off the perfect crime. But no planning or expertise can prepare them for a dangerous enemy that seems to predict their every move. An enemy only Cobb could have seen coming.', 'Review', \"In terms of sheer originality, ambition and achievement, Inception is the movie of the summer, the movie of the year and the movie of our dreams --Pete Hammond, Boxoffice MagazineAs engrossing and logic-resistant as the state of dreaming it seeks to replicate, Christopher Nolan's audacious new creation demands further study to fully absorb the multiple, simultaneous stories Nolan finagles into one narrative experience. --Lisa Schwarzbaum, Entertainment WeeklyThis is a deeply felt work of art in the form of a big, brassy movie-movie. --Shawn Levy, Portland Oregonian\"]\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, Widescreen, Subtitled, DTS Surround Sound', 'Contributor': 'Marion Cotillard, Christopher Nolan, Leonardo DiCaprio, Michael Caine, Ken Watanabe, Joseph Gordon-Levitt, Ellen Page, Tom Hardy, Cillian Murphy, Tom BerengerMarion Cotillard, Christopher Nolan, Leonardo DiCaprio, Michael Caine, Ken Watanabe, Joseph Gordon-Levitt, Ellen Page, Tom Hardy, Cillian Murphy, Tom Berenger  See more', 'Language': 'French (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1), Unqualified (DTS-HD Master Audio 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '2 hours and 28 minutes', 'Digital Copy Expiration Date': 'November 20, 2014', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.3 x 0.5 inches; 5.6 Ounces', 'Director': 'Christopher Nolan', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Widescreen, Subtitled, Blu-ray, DTS Surround Sound', 'Run time': '2 hours and 28 minutes', 'Release date': 'December 7, 2010', 'Actors': 'Leonardo DiCaprio, Ken Watanabe, Joseph Gordon-Levitt, Marion Cotillard, Ellen Page', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nWhoa! Leo DiCaprio seems to ONLY do top notch work in top notch movies nowadays, and for some years now.  He not only tackles major issues & biopics/biographical in his cinematic masterpieces in the last several years, BUT now he has become a believable, yet vulnerable while flawed protagonist.  Who knew this kid would kid would go on to work so hard at his craft after his first few offerings as a teen heart throb.  He first won me over as \"The Aviator,\" and not as Romeo nor as Cameron's dying 'king of the world' in those icy waters either.  While I don't usually go for the main character dying at the end of the movie, as it kind of breaks from the traditional \"Hollywood Formula:\"  One of his best performances to be sure was in \"Blood Diamond,\" and it worked very well being a most impressive performance as well.  Inception is one that you will certainly NOT mind seeing again and again from time to time - as it has many layers, on the action, story, and human levels!  And that is a direct result of tremendous writing, acting, directing, and not too over-used CGIas well.  Word has it he is very hard working on the set, not a prima donna, helping to making the final product a synergistic tour de force.  He is surely one to watch as he grows with the industry.  His volunteer and activism is impressive as well, putting his resources to work for GOOD.  I think more actors would be more grounded (and stay a little more outa trouble if they followed in his example).  Young people wouldn't do too bad to continue to look up to his better facets.  Nicely done, kid!  \"Inception\" - we'd like to see more like this one.\nPerfect Condition, best movie I've seen in months to years!\nThe Color of Magic\nDavid Jason  (Actor),     Sean Astin  (Actor),     Vadim Jean  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Inside a magical realm known as Discworld, a naive tourist (Astin) is on holiday until a terrible fire breaks out, forcing him to flee along with an incompetent wizard (Jason). Now, as the clueless pair set out on a magical journey across the disc, neither realizes that they are merely pawns in an elaborate board game being played by the Gods. After encountering a pair of barbarians, they take a trip to an inverted mountain housing dragons that only exist in imagination, survive a fall off the edge of the disc during a perilous visit to the country Krull, and attempt to beat the wizard's former classmate (Curry) to a collection of eight spells that could save Discworld from total destruction.\"]\n{'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Nigel Planer, Christopher Lee, Stephen Marcus, Tim Curry, Terry Pratchett, Jeremy Irons, David Jason, Brian Cox, Vadim Jean, David Bradley, Sean Astin, Janet Suzman, Laura Haddock, James CosmoNigel Planer, Christopher Lee, Stephen Marcus, Tim Curry, Terry Pratchett, Jeremy Irons, David Jason, Brian Cox, Vadim Jean, David Bradley, Sean Astin, Janet Suzman, Laura Haddock, James Cosmo  See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '3 hours and 17 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.4 Ounces', 'Director': 'Vadim Jean', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 17 minutes', 'Release date': 'July 14, 2009', 'Actors': 'David Jason, Sean Astin, Tim Curry, Jeremy Irons, Brian Cox', 'Studio': 'Rhi Entertainment', 'Writers': 'Terry Pratchett, Vadim Jean', 'Number of discs': '1'}\nWe could NOT believe just how good this movie was, having 1st checked it via by mail rental, then realizing we had to have for our collection - in order to view it during the holidays (during the colder months).  It is in 2 parts, 1.5 hrs each.  It is well-acted, finely directed, and terrifically scripted.  You'll recognize Sean Astin, who played Samwise Gamje (sp?) the Hobbit in LOTR, a traveller who stumbles in to a fantastical & literally magical adventure; and then there's Tim Curry, the evil & plotting wizard.  Not to give it away, but Astin has a magical walking chest full of gold that looks out for him, and acquires a 'guide' - a not so magical & bumbling wizard, who finds his powers, and they go on a quest all over this 'far out' world set upon a celestial Tortoise's back.  * MY SON IS 15 NOW, NO LONGER GOES FOR GREASY KID STUFF, BUT HEY- HE ENJOYED THE DICKENS OUTA THIS ONE HERE! * The two travel to the edge of their world, learn to fly, swim, take a short trip into space; and eventually learn that they must somehow find, or \"set free,\" a lost or missing 'spell' but it's missing from \"The Octavio.\"  This chained up book of spells at the wizarding school is rather unsettled, if not angry- but why?  The 8th spell is missing and it is the key to saving their world.  See the movie, go on an amazing adventure, and be spellbound along with our characters in this comedic adventure filled with action, intrigue, treachery, and magical creatures, many landscapes as they travel far & wide - as they find the truth of things BOTH within and without of themselves.  ***  THIS ONE'S A REAL HIDDEN GEM THAT I AM SURPRISED DOES NOT CONTINUE TO PLAY MORE ON TELEVISION!!  ***  Amazing production, CGI, acting, directing, & scripting make this a treat for the whole family, and --as I hate to sound like a commercial ad - but indeed:  You want this in your collection, as we need to VOTE WITH OUR POCKETBOOKS IN SUPPORT OF MORE MOVIES LIKE THIS ONE.\nAwesome Family Movie: A real 'Hidden Gem' -Not to be Missed!!\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Susanna Fogel'], 'Producers': ['Brian Grazer', 'Erica Huggins'], 'Starring': ['Mila Kunis', 'Kate McKinnon', 'Justin Theroux'], 'Studio': ['Lionsgate']}\nGreat fun, albeit UN-believable in some parts; but, otherwise totally enjoyed this female empowered flick.\nOriginal, as in not wholly predictable; and, it defies typical stereotypes.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Leigh Whannell'], 'Producers': ['Jason Blum', 'Kylie du Fresne'], 'Starring': ['Logan Marshall-Green', 'Betty Gabriel', 'Harrison Gilbertson'], 'Studio': ['Universal Pictures']}\nI was impressed; but, it stopped streaming half way through, and I can’t seem to get Amazon to honor a request for further viewing OR give me a refund.\nFuturistic, original, and engaging; unlike many fluff Sci-FI flicks out nowadays.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher McQuarrie'], 'Producers': ['Tom Cruise', 'Christopher McQuarrie', 'Jake Myers', 'J. J. Abrams', 'David Ellison', 'Dana Goldberg', 'Don Granger'], 'Starring': ['Tom Cruise', 'Henry Cavill', 'Ving Rhames'], 'Studio': ['Paramount Pictures']}\nAwesome.  Best flick on every level of 2018.\nThe ONLY movie I actually paid to own for 2018.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Antoine Fuqua'], 'Producers': ['Denzel Washington'], 'Starring': ['Denzel Washington', 'Pedro Pascal', 'Ashton Sanders']}\nExcellent.  Not a mindless action flick.  Impressive character development.  Broaches some very hot topics and touchy issues, relevant to our current times.\nWorthwhile rental if you want to see wrongs made right.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Leo Zhang'], 'Producers': ['Jackie Chan', 'Paul Currie', 'Kailuo Liu', 'Javier Zhang'], 'Starring': ['Jackie Chan', 'Snow Lo', 'Nana OuYang'], 'Studio': ['Lionsgate']}\nit stopped streaming half way through, and I was unable to continue it during the rental period; so, had to ask for more viewing time or a refund - and, I’m still waiting for either or both; not happy with customer “service” for prime video rentals!\nFuturistic, fun, action packed; but, would’ve liked to be able to finish it!\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Fede Alvarez'], 'Producers': ['Scott Rudin', 'Eli Bush', 'Ole Søndberg', 'Søren Stærmose', 'Berna Levin', 'Amy Pascal', 'Elizabeth Cantillon'], 'Starring': ['Claire Foy', 'Sverrir Gudnason', 'Lakeith Stanfield']}\nFew plot “skips,” needed a wee bit more character development, and slight editing issues; but, overall an excellent movie. Stands on its own, so don’t compare to original European made trilogy.\nTruly amazing, organic, and intriguing film.\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Donovan Marsh'], 'Producers': ['Xu Bin', 'Christa Campbell'], 'Starring': ['Corey Johnson', 'Adam James', 'Common']}\nExcellent action, thriller, intrigue with ample technical details that make it virtually fully plausible.\nA must see for military, naval, air-land-sea-battle story buffs.\n{'Content advisory': ['Violence'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christian Rivers'], 'Producers': ['Deborah Forte', 'Fran Walsh', 'Amanda Walker', 'Zane Weiner', 'Peter Jackson'], 'Starring': ['Ronan Raftery', 'Leila George', 'Patrick Malahide'], 'Studio': ['Universal Pictures']}\nDespite some editing (cuts) issues, lack of full and proper characters’ back-story development, and a few action thread “skips,” this is still a very thoroughly enjoyable thrill-ride, replete with technicals, beautiful sweeping panoramic filmwork, fully immersive in an other worldly fashion, and off-the-charts mechanical machinations of a future dystopia; that said, hopeful, optimistic, and lots of charm and heart-warming plot threads, likeable characters, and superb action sequences.  To be sure, a terrific flick, ahead of it’s time, and will play in streaming video for years to come.\nIt is an original story, new kinds of characters, exciting & immersive.\nBumblebee\nAction, Adventure, Intense, Stunning\n['Charlie, on the cusp of turning 18 and trying to find her place in the world, discovers Bumblebee, battle-scarred and broken. When Charlie revives him, she quickly learns this is no ordinary, yellow VW bug.']\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Travis Knight'], 'Producers': ['Don Murphy', 'Tom Desanto', 'Lorenzo Di Bonaventura', 'Michael Bay', 'Mark Vahradian', 'Steven Spielberg', 'Brian Goldner', 'Chris Brigham'], 'Starring': ['Hailee Steinfeld', 'Jorge Lendeborg Jr.']}\nTerrible. Couldn't stand to get past the first 20 or so minutes. Had to fast forward to the end. Worst TF movie in the franchise.\nDon't bother. Barf.",
  "profile": "**Updated User Profile Summary:**\n\n- **Film Preferences:** The user continues to favor sophisticated cinema, particularly within the science fiction and action-adventure genres, while also appreciating whimsical fantasy and female-led comedies. Their latest interaction indicates a shift towards heightened selectivity, as they expressed strong discontent with a recent blockbuster, illustrating a critical stance against mainstream cinematic offerings that fail to engage. A focus on character development and unique plots remains paramount, particularly narratives that emphasize empowerment and social issues.\n\n- **Actor Appreciation:** They admire talents such as Leonardo DiCaprio, Tom Cruise, and Claire Foy, while also recognizing the contributions of Mila Kunis and Kate McKinnon, with a clear preference for performers resonating with societal themes.\n\n- **Viewer Engagement:** The user previously exhibited a discerning taste by rating action thrillers highly, but their recent negative review reflects an evolving expectation for quality and innovation in storytelling, demanding depth and emotional resonance even in blockbuster formats.\n\n- **Social Values:** The user's commitment to entertainment as a platform for reflection and dialogue persists, supporting creators advocating for social change.\n\n- **Overall Sentiment:** While they continue to seek original and innovative narratives, their latest critique highlights a cautious approach to well-known franchises, reinforcing their dedication to thoughtful cinema that provides meaningful experiences and challenges conventional storytelling.",
  "metrics": {
    "rouge1_f": 0.09106239460370995,
    "rouge2_f": 0.012658227848101266,
    "rougeL_f": 0.04468802698145025,
    "meteor": 0.02723474374098954,
    "bleu1": 5.544213632716874e-06,
    "bleu2": 2.0541598928859214e-06,
    "bleu3": 5.862451671969187e-07,
    "bleu4": 1.762863072375946e-07,
    "bertscore_precision": 0.3504105806350708,
    "bertscore_recall": 0.4982844293117523,
    "bertscore_f1": 0.41146495938301086
  }
}