{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/02/22\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ernest Dickerson', 'Billy Gierhart', 'Guy Ferland', 'Greg Nicotero'], 'Producers': ['Glen Mazzara', 'Robert Kirkman', 'Gale Anne Hurd', 'David Alpert'], 'Starring': ['Andrew Lincoln', 'Sarah Wayne Callies', 'Laurie Holden']}\nReview Text: Can't say enough great things about this show!  Definitely hooked!  Season three was incredible, just as I knew it would be.\nReview Title: Love This Show!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton']}\nHow I missed this series for two years is beyond me, and I really have to thank Amazon Prime because I would have never known about it without them.  Earth has been invaded by aliens and they are attempting to destroy our race and enslave our children.  Hands down the best Sci-Fi series I've seen since Lost.  The characters are amazing enough that even those that don't like the action in a series, will fall in love with it because of the underlying human drama element. I watched the entire two years in less than two weeks if that tells you how blown away I was by this series.\nFalling Skies is Phenomenal\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ernest Dickerson', 'Billy Gierhart', 'Guy Ferland', 'Greg Nicotero'], 'Producers': ['Glen Mazzara', 'Robert Kirkman', 'Gale Anne Hurd', 'David Alpert'], 'Starring': ['Andrew Lincoln', 'Sarah Wayne Callies', 'Laurie Holden']}\nCan't say enough great things about this show!  Definitely hooked!  Season three was incredible, just as I knew it would be.\nLove This Show!",
  "profile": "**Updated User Profile Summary:**\n\n- **Preferred Genre:** Strong preference for science fiction, particularly series that feature alien invasion and human drama, with a growing appreciation for post-apocalyptic narratives.\n- **Viewing Behavior:** Engages deeply with shows, indicated by binge-watching multiple seasons in a short time frame; recently demonstrated a tendency to become hooked on series quickly.\n- **Emotional Engagement:** Values character development and emotional narratives alongside action; enjoys series that balance drama with thrilling elements, showing a particular fondness for intense, suspenseful storylines.\n- **Discovery Method:** Relies on streaming platforms for discovering new content, suggesting a preference for curated recommendations.\n- **Rating Pattern:** Tends to give high ratings (4.6-5.0 average), indicating satisfaction with quality content, particularly when both plot and character are well-executed.\n- **Social Sharing:** Appreciates thankfulness towards platforms that introduce them to quality series, highlighting a possible tendency to share experiences with others; enthusiasm for the impact of shows leads to strong positive reviews.\n\nOverall, this user demonstrates a passion for immersive, character-driven science fiction narratives, enriched by a love for suspenseful storytelling and character arcs, with a tendency to binge-watch when captivated.",
  "metrics": {
    "rouge1_f": 0.18136020151133497,
    "rouge2_f": 0.01518987341772152,
    "rougeL_f": 0.07052896725440806,
    "meteor": 0.1043338683788122,
    "bleu1": 0.16576036975626499,
    "bleu2": 0.03879285702685421,
    "bleu3": 0.007704279023476164,
    "bleu4": 0.0034369380377793552,
    "bertscore_precision": 0.3867291212081909,
    "bertscore_recall": 0.43162935972213745,
    "bertscore_f1": 0.40794748067855835
  }
}