{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Gangster Squad\nReview Date: 2014/06/09\nStore: Josh Brolin  (Actor),     Ryan Gosling  (Actor),     Ruben Fleischer  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['Product Description', 'Gangster Squad (DVD)', \"Los Angeles, 1949. Ruthless, Brooklyn-born mob king Mickey Cohen runs the show in this town, reaping the ill-gotten gains from the drugs, the guns, the prostitutes and if he has his way, every wire bet placed west of Chicago. And he does it all with the protection of not only his own paid goons, but also the police and the politicians he has under his thumb. It's enough to intimidate even the bravest, street-hardened cop except, perhaps, for the small, secret crew of LAPD outsiders led by Sgt. John O'Mara and Sgt. Jerry Wooters, who come together to try to tear Cohen's world apart. Under the direction of Ruben Fleischer, Gangster Squad is a stylish retelling of events surrounding the LAPD's efforts to take back their nascent city from one of the most dangerous mafia bosses of all time.\", ']]>', 'Amazon.com', 'The turf explored in', 'Gangster Squad', \"may not be entirely accurate to historical truth, but it sure looks like the world of the movie mobster: the basics are instantly recognizable if you've seen\", 'L.A. Confidential', 'and', 'The Untouchables', \". Take a post-World War II Los Angeles, plunge it in noir, drop a ruthless gangster into the mix, and let loose an extralegal squad of cops to break the mob's rule. The crime kingpin in question is Mickey Cohen (Sean Penn), and his LAPD adversaries include a detective so square his fedora appears permanently affixed to his skull (Josh Brolin) and a ladies' man (Ryan Gosling) whose dalliance with Cohen's escort (Emma Stone) might not be the best idea for a smooth relationship. Their squad includes stalwart character actors such as Anthony Mackie, Michael Peña, Giovanni Ribisi, and an especially droll Robert Patrick. With all this talent on display, the movie must surely have some bang in its Tommy gun--but alas, director Ruben Fleischer (\", 'Zombieland', \") has opted for a peculiarly lighthearted, bantering tone for much of the action, which sits oddly with the gun massacres and dismemberments on display. He's also got Sean Penn in full Actor mode, snorting and stamping and wearing his prosthetic nose like a badge of pride. All of which might make for a juicy piece of entertainment, if the film didn't keep tripping over its own clichés and periodically losing its momentum. (\", 'Gangster Squad', \"was bumped from its original 2012 opening date after the mass shooting at a Colorado movie theater; a shootout scene set in a movie theater was cut and re-shot in a different location for the film's eventual January 2013 release.)\", '--Robert Horton']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama, Action & Adventure/Crime, Mystery & Suspense/Crime/Cops, Mystery & Suspense/Crime, Action & AdventureDrama, Action & Adventure/Crime, Mystery & Suspense/Crime/Cops, Mystery & Suspense/Crime, Action & Adventure  See more', 'Format': 'Multiple Formats, Color, Widescreen, Dolby, NTSC, Ultraviolet', 'Contributor': 'Holt McCallany, Michael Tadross, Will Beall, Nick Nolte, Robert Patrick, Mireille Enos, Dan Lin, Bruce Berman, Giovanni Ribisi, Paul Lieberman, Emma Stone, Ruben Fleischer, Josh Brolin, Michael Peña, Bill Finkelstein, Sean Penn, Ryan Gosling, Kevin McCormick, Anthony Mackie, Sullivan StapletonHolt McCallany, Michael Tadross, Will Beall, Nick Nolte, Robert Patrick, Mireille Enos, Dan Lin, Bruce Berman, Giovanni Ribisi, Paul Lieberman, Emma Stone, Ruben Fleischer, Josh Brolin, Michael Peña, Bill Finkelstein, Sean Penn, Ryan Gosling, Kevin McCormick, Anthony Mackie,…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '26410930', 'Director': 'Ruben Fleischer', 'Media Format': 'Multiple Formats, Color, Widescreen, Dolby, NTSC, Ultraviolet', 'Run time': '1 hour and 50 minutes', 'Release date': 'April 23, 2013', 'Actors': 'Josh Brolin, Ryan Gosling, Sean Penn, Nick Nolte, Emma Stone', 'Subtitles': 'French, Spanish', 'Producers': 'Ruben Fleischer, Dan Lin, Kevin McCormick, Paul Lieberman, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'Will Beall, Bill Finkelstein', 'Number of discs': '1'}\nReview Text: The Gangster Squad, is in no way elegant w/suit and tie as Elliot Ness. The action was plenty and the squad took a few black eyes for the team. As was the protocol of early day policing in Los Angeles or any city where low level thugs tried to appear in charge of a high level extension operation. What is unique about the Gangster Squad is it tells the story honestly. I includes the mistakes that were made, it shows how some of their own guys got made and how if you can find the bad guys hangout...you can be damn sure they can find yours. Overall the movie was entertaining. As a disclaimer: for retired lawmen there may be some sense of &#34;crap I've done that&#34; while for the average Joe it may however be hard to make just a connection, that is ok if you don't you never will understand it...because its a cop thing.\nReview Title: Old Day Cop Tactics - No longer allowed in todays world...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Blues for Willadean\nBeth Grant  (Actor),     Octavia Spencer  (Actor),     Del Shores  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Review', 'Two N.A.A.C.P. Awards for Del Shores and this material, based on the original stageplay, The Trials and Tribulations of a Trailer Trash Housewife. --NAACP Awards', 'About the Actor', 'Beth Grant (as Willadean) is popularly recognized from her many feature film roles, including No Country for Old Men, and her current TV series role on The Mindy Project; Octavia Spencer has built a solid career following her recent Oscar win for her memorable performance in The Help; Dale Dickey can be seen on True Blood and many features and series, most recently on Breaking Bad.', 'About the Director', \"Del Shores is an acclaimed film director with roots in playwriting / directing and producing. He is also a noted regular on the stand-up comedy circuit and is a respected activist for a variety of progressive causes. Notable film and TV projects include Sordid Lives and Daddy's Dyin, Who's Got The Will.\", 'See more']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Del Shores', 'Media Format': 'Multiple Formats, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'January 21, 2014', 'Actors': 'Beth Grant, Octavia Spencer, Dale Dickey, David Steen, Debby Holiday', 'Studio': 'Hannover House', 'Number of discs': '1'}\nThe performances of each actor were as powerful as the message of the movies subject line. The movie brings to front the hush and hidden denials of many relationships. It causes the viewer to question their own responsibility for friends or relatives, who they suspect may be in relationships that are abusive. It is a must see for everyone. Because everyone in someway will see their own reflection, some which they may wish not to acknowledge.\nOutstanding Performance and Storyline!\nBehind the Candelabra\nMichael Douglas  (Actor),     Matt Damon  (Actor),     Steven Soderbergh  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Golden Globe Central, Past Golden Globe Winners\n['Product Description', 'Behind the Candelabra (DVD)', 'Directed by acclaimed filmmaker Steven Soderbergh and executive produced by Jerry Weintraub, this HBO Films drama recreates the glittering private world of Liberace (Michael Douglas), the flamboyant, phenomenally successful entertainer whose extravagant costumes, trademark candelabra, and elaborate stage shows made him the most bankable entertainer of his time. The story focuses on Liberace’s tempestuous relationship with Scott Thorson (Matt Damon) in Las Vegas from 1977 to 1982 – a time when Liberace was at the peak of his popularity but remained closeted as a homosexual. Featuring a pair of electrifying performances by Douglas and Damon (the first time either has starred in an HBO production), Behind the Candelabra captures the essence of Liberace’s appeal while reminding viewers how different attitudes were at the time, as few high-profile entertainers (including Liberace) could admit they were gay, at least in front of the public which made them stars.', ']]>', 'Amazon.com', 'Now that', 'Behind the Candelabra', ', the HBO movie about the secret relationship between pianist/entertainer Liberace and former animal trainer Scott Thorson, has won three Emmys (including statues for best movie or miniseries, lead actor Michael Douglas, and director Steven Soderbergh), it\\'s hard to imagine that this was once a film that no one wanted to make. \"Too gay,\" they said. But after languishing in development for several years, and with Soderbergh, Douglas, and Matt Damon attached, the film finally premiered in 2013--and it is a triumph. Damon is thoroughly convincing as Thorson (whose book supplied the source material), the callow, not-especially-bright young man so susceptible to Liberace\\'s charming, unctuous persuasions (things get nutty when Scott agrees to undergo extensive plastic surgery designed to turn him into a younger version of \"Lee,\" as the pianist\\'s friends call him). Screenwriter Richard LaGravenese\\'s dialogue is hilarious (\"In gay years,\" one character tells Scott, \"you\\'re Judy during the Sid Luft obese period\"), while Soderbergh\\'s directorial choices are also amusing. Meanwhile, the rest of the cast is clearly having a field day: Rob Lowe (as the cosmetic surgeon) and Debbie Reynolds (as Liberace\\'s mother) gleefully chew the scenery, while Scott Bakula and Dan Aykroyd are entertaining as well. But this is Douglas\\'s show, and he steals it. His performance isn\\'t a caricature. Nor is it a parody, or an impersonation; the real Liberace, a guy whose name was seemingly always preceded by \"flamboyant,\" was such an over-the-top character that Douglas merely has to play it straight, so to speak. In the process, he sheds light not only on Liberace\\'s manipulative tendencies (\"Scott, why don\\'t you let me decide what\\'s important?\") but also his vulnerabilities--especially at the end, when he and Thorson have one last poignant meeting following a bitter falling out. The filmmakers also have something valuable to say about gay culture during a period when celebrities like Liberace and Rock Hudson tried desperately to stay in the closet, especially after contracting AIDS.', '--Sam Graham']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC', 'Contributor': 'Scott Bakula, Matt Damon, Steven Soderbergh, Michael Douglas', 'Language': 'Spanish (Dolby Digital 2.0 Surround), English (DTS 5.1)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'HBO1000411874DVD', 'Director': 'Steven Soderbergh', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC', 'Run time': '2 hours', 'Release date': 'September 17, 2013', 'Actors': 'Michael Douglas, Matt Damon, Scott Bakula', 'Dubbed': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '1'}\nThe movie brings some camp back for those who remember the 1970's. The classmanship and craftmanship that laid many housewives in denial, while many young men on their backs brought out much of what many onlookers had speculated. The Gossip Rags couldn't put out such spice in such a rise and fall, with so many sparkles as Douglas and Damon were able to do. Both putting out a spectacular performance, that even &#34;Lee&#34; may eventually would have approved of.\nGoodmorning...a snap and glimer of what was!\nAce in the Hole (Criterion Collection) (Blu-ray + DVD)\nKirk Douglas  (Actor),     Jan Sterling  (Actor),     Billy Wilder  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"A New York newsman in New Mexico delays a cave-in victim's rescue to milk the story. Directed by Billy Wilder.\"]\n{'Format': 'Multiple Formats, Blu-ray, Black & White, NTSC', 'Contributor': 'Bob Arthur, Kirk Douglas, Jan Sterling, Billy Wilder', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'CRRN2355BR', 'Director': 'Billy Wilder', 'Media Format': 'Multiple Formats, Blu-ray, Black & White, NTSC', 'Run time': '1 hour and 51 minutes', 'Release date': 'May 6, 2014', 'Actors': 'Kirk Douglas, Jan Sterling, Bob Arthur', 'Studio': 'Criterion', 'Number of discs': '1'}\nAce in the Hole, is a classic. Loaded with flashes of the past. From political correctness to social norms, the film is a study of progress a society has made. It also suggests where the hunger for the 24 hour news cycle originated.  For those pursuing journalist endeavors, the movie is a must see because it is news reporting from its rawest form.\nA classic with flashes of history!\nLawless\nTom Hardy  (Actor),     Shia LaBeouf  (Actor),     John Hillcoat  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'LAWLESS is the true story of the infamous Bondurant Brothers: bootlegging siblings who made a run for the American Dream in Prohibition-era Virginia. In this epic gangster tale, inspired by true-life tales of author Matt Bondurant’s family in his novel “The Wettest County In The World,” the loyalty of three brothers is put to the test against the backdrop of the nation’s most notorious crime wave.', 'Amazon.com', 'Director John Hillcoat and writer-musician Nick Cave made a brutal, brilliant splash with', 'The Proposition', ', a revisionist Outback Western that quickly tore away any lingering notions of frontier romanticism.', 'Lawless', \", the duo's take on another turbulent period of history--namely, the bloodiest years of America's Prohibition--eases up on the unrelenting grimness a bit, but the hard edges still shine through. Adapted from the historical novel\", 'The Wettest County in the World', \", by Matt Bondurant, Cave's script follows three Virginia brothers determined to continue their family's legacy of providing quality moonshine to their faithful customers (including members of local law enforcement) during the Great Depression. While the youngest brother (Shia LaBeouf) attempts to gain the business of a feared local mobster (Gary Oldman), the three find themselves under assault from a ruthless federal agent (Guy Pearce) with a sadistic agenda of his own. Hillcoat, working with cinematographer Benoît Delhomme, delivers a fantastically realized period piece, one where the folksy, lived-in atmosphere is randomly dispelled by moments of shockingly raw savagery. Unfortunately, the attention to detail doesn't quite extend itself to LaBeouf's character, whose motivations and actions feel strangely half-baked throughout. Still, even if the main storyline occasionally falters, the film offers plenty to recommend itself, including Cave's ominously cheery score, small but vivid turns by Jessica Chastain and Mia Wasikowska, and the gloriously weird Pearce, who starts his performance somewhere in the outer stratosphere and just keeps heading upwards. The main draw of\", 'Lawless', \", however, ultimately comes from Tom Hardy, who goes all out and then some as the enforcer and reluctant father figure of the family. Clad in incongruously mellow cardigans and mumbling like a cartoon sailor man, he's a Terminator for the ages. When it comes to his performance, White Lightning hardly covers it.\", '--Andrew Wright']\n{'Genre': 'Action/Adventure', 'Format': 'NTSC', 'Contributor': 'Guy Pearce, Marcus Hester, Dane DeHaan, Ben Sachs, Clayton Young, Cassian Elwes, Tim Tolin, Mia Wasikowska, Douglas Wick, John Hillcoat, Shia LaBeouf, Jason Clarke, Jessica Chastain, Gary Oldman, Matt Bondurant, Lew Temple, Chris McGarry, Dany Wolf, Tom Hardy, Nick CaveGuy Pearce, Marcus Hester, Dane DeHaan, Ben Sachs, Clayton Young, Cassian Elwes, Tim Tolin, Mia Wasikowska, Douglas Wick, John Hillcoat, Shia LaBeouf, Jason Clarke, Jessica Chastain, Gary Oldman, Matt Bondurant, Lew Temple, Chris McGarry, Dany Wolf, Tom Hard…  See more', 'Language': 'English', 'Runtime': '1 hour and 56 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': '260504919', 'Director': 'John Hillcoat', 'Media Format': 'NTSC', 'Run time': '1 hour and 56 minutes', 'Release date': 'November 27, 2012', 'Actors': 'Tom Hardy, Shia LaBeouf, Guy Pearce, Jason Clarke, Jessica Chastain', 'Subtitles': 'English', 'Producers': 'Ben Sachs, Cassian Elwes, Clayton Young, Dany Wolf, Douglas Wick', 'Studio': 'Starz / Anchor Bay', 'Writers': 'Matt Bondurant, Nick Cave', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe movie was opened with the recollections of prohibition and revenuers, Feds and local lawmen who could be bought off. It spun even tighter as a grip is squeezed on a community by far reaching government interests. As a family struggles to maintain their standing in the community (not financial) as social strongholds prices will be paid and fire will be fought with fire. The show is gripping, maintaining attention right up to the last of the credit rolls, because as long as the movie is still rolling...anything could change by the time the &#34;grip holder&#34; credits appear.\nOne of the best unpredictable, wrenching movies you may ever watch\nAmerican Psycho (Uncut Version) (Killer Collector's Edition)\nChristian Bale  (Actor),     Justin Theroux  (Actor),     Mary Harron  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"Patrick Bateman - a Wall Street yuppie obsessed with success, status and style - is also a serial killer who murders, rapes, and mutilates both strangers and acquaintances without reason. A police detective is on his trail as Bateman's mask of studied, distant cool begins to fall apart. Direction: Mary Harron Special Features: On-Set Interviews & Behind-The-Scenes Footage; Postcards from the 80s; Director / Writer Commentary; Cast & Crew Commentary. Year: 2000 Runtime: 102 minutes.\"]\n{'Genre': 'Mystery & Suspense', 'Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Contributor': 'Christian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt RossChristian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt Ross  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.37 x 7.53 inches; 0.01 Ounces', 'Item model number': 'MFR031398176374#VG', 'Director': 'Mary Harron', 'Media Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Run time': '1 hour and 42 minutes', 'Release date': 'June 21, 2005', 'Actors': 'Christian Bale, Justin Theroux, Josh Lucas, Bill Sage, Chloë Sevigny', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nYou never truly know someone until you have lived with them. Such can be the case in this flick. Heavy in nostalgic 80's theme music, clothing and slang. The movie can be a gory way of concluding you might have a problem or you might not.\nIf you loved the 80's you will enjoy this\nGangster Squad\nJosh Brolin  (Actor),     Ryan Gosling  (Actor),     Ruben Fleischer  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Product Description', 'Gangster Squad (DVD)', \"Los Angeles, 1949. Ruthless, Brooklyn-born mob king Mickey Cohen runs the show in this town, reaping the ill-gotten gains from the drugs, the guns, the prostitutes and if he has his way, every wire bet placed west of Chicago. And he does it all with the protection of not only his own paid goons, but also the police and the politicians he has under his thumb. It's enough to intimidate even the bravest, street-hardened cop except, perhaps, for the small, secret crew of LAPD outsiders led by Sgt. John O'Mara and Sgt. Jerry Wooters, who come together to try to tear Cohen's world apart. Under the direction of Ruben Fleischer, Gangster Squad is a stylish retelling of events surrounding the LAPD's efforts to take back their nascent city from one of the most dangerous mafia bosses of all time.\", ']]>', 'Amazon.com', 'The turf explored in', 'Gangster Squad', \"may not be entirely accurate to historical truth, but it sure looks like the world of the movie mobster: the basics are instantly recognizable if you've seen\", 'L.A. Confidential', 'and', 'The Untouchables', \". Take a post-World War II Los Angeles, plunge it in noir, drop a ruthless gangster into the mix, and let loose an extralegal squad of cops to break the mob's rule. The crime kingpin in question is Mickey Cohen (Sean Penn), and his LAPD adversaries include a detective so square his fedora appears permanently affixed to his skull (Josh Brolin) and a ladies' man (Ryan Gosling) whose dalliance with Cohen's escort (Emma Stone) might not be the best idea for a smooth relationship. Their squad includes stalwart character actors such as Anthony Mackie, Michael Peña, Giovanni Ribisi, and an especially droll Robert Patrick. With all this talent on display, the movie must surely have some bang in its Tommy gun--but alas, director Ruben Fleischer (\", 'Zombieland', \") has opted for a peculiarly lighthearted, bantering tone for much of the action, which sits oddly with the gun massacres and dismemberments on display. He's also got Sean Penn in full Actor mode, snorting and stamping and wearing his prosthetic nose like a badge of pride. All of which might make for a juicy piece of entertainment, if the film didn't keep tripping over its own clichés and periodically losing its momentum. (\", 'Gangster Squad', \"was bumped from its original 2012 opening date after the mass shooting at a Colorado movie theater; a shootout scene set in a movie theater was cut and re-shot in a different location for the film's eventual January 2013 release.)\", '--Robert Horton']\n{'Genre': 'Drama, Action & Adventure/Crime, Mystery & Suspense/Crime/Cops, Mystery & Suspense/Crime, Action & AdventureDrama, Action & Adventure/Crime, Mystery & Suspense/Crime/Cops, Mystery & Suspense/Crime, Action & Adventure  See more', 'Format': 'Multiple Formats, Color, Widescreen, Dolby, NTSC, Ultraviolet', 'Contributor': 'Holt McCallany, Michael Tadross, Will Beall, Nick Nolte, Robert Patrick, Mireille Enos, Dan Lin, Bruce Berman, Giovanni Ribisi, Paul Lieberman, Emma Stone, Ruben Fleischer, Josh Brolin, Michael Peña, Bill Finkelstein, Sean Penn, Ryan Gosling, Kevin McCormick, Anthony Mackie, Sullivan StapletonHolt McCallany, Michael Tadross, Will Beall, Nick Nolte, Robert Patrick, Mireille Enos, Dan Lin, Bruce Berman, Giovanni Ribisi, Paul Lieberman, Emma Stone, Ruben Fleischer, Josh Brolin, Michael Peña, Bill Finkelstein, Sean Penn, Ryan Gosling, Kevin McCormick, Anthony Mackie,…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 50 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '26410930', 'Director': 'Ruben Fleischer', 'Media Format': 'Multiple Formats, Color, Widescreen, Dolby, NTSC, Ultraviolet', 'Run time': '1 hour and 50 minutes', 'Release date': 'April 23, 2013', 'Actors': 'Josh Brolin, Ryan Gosling, Sean Penn, Nick Nolte, Emma Stone', 'Subtitles': 'French, Spanish', 'Producers': 'Ruben Fleischer, Dan Lin, Kevin McCormick, Paul Lieberman, Bruce Berman', 'Studio': 'WarnerBrothers', 'Writers': 'Will Beall, Bill Finkelstein', 'Number of discs': '1'}\nThe Gangster Squad, is in no way elegant w/suit and tie as Elliot Ness. The action was plenty and the squad took a few black eyes for the team. As was the protocol of early day policing in Los Angeles or any city where low level thugs tried to appear in charge of a high level extension operation. What is unique about the Gangster Squad is it tells the story honestly. I includes the mistakes that were made, it shows how some of their own guys got made and how if you can find the bad guys hangout...you can be damn sure they can find yours. Overall the movie was entertaining. As a disclaimer: for retired lawmen there may be some sense of &#34;crap I've done that&#34; while for the average Joe it may however be hard to make just a connection, that is ok if you don't you never will understand it...because its a cop thing.\nOld Day Cop Tactics - No longer allowed in todays world...",
  "profile": "The user has a strong preference for drama films that delve into complex social themes and character-driven narratives, particularly those set against historical backdrops. Recently, they explored a cult classic that incorporated mystery and psychological complexities, revealing a willingness to engage with diverse genres as long as the storytelling illuminates societal issues. Their interest in narratives that scrutinize family dynamics and personal identity in the face of societal pressures remains evident.\n\nIn their thoughtful reviews, the user articulates a nuanced perspective on films that showcase struggles against governmental overreach and reflect cultural implications and evolving societal norms. Their latest review emphasizes how the film portrays the gritty realities of early policing in Los Angeles, highlighting mistakes and challenges faced by law enforcement, while still valuing impactful storytelling. The user maintains an appreciation for emotional depth, critical self-reflection, and high artistic standards.\n\nThis adaptability in their film preferences suggests an openness to narratives that challenge moral perceptions and resonate culturally, reaffirming their commitment to seeking out cinematic experiences that provoke introspection and address contemporary societal themes.",
  "metrics": {
    "rouge1_f": 0.05813605034462092,
    "rouge2_f": 0.006596701649175413,
    "rougeL_f": 0.03296373988612526,
    "meteor": 0.016880449785939028,
    "bleu1": 2.416761003780995e-10,
    "bleu2": 1.0250292201575326e-10,
    "bleu3": 5.1306775297197814e-11,
    "bleu4": 2.8905796633418107e-11,
    "bertscore_precision": 0.3078114986419678,
    "bertscore_recall": 0.5131471753120422,
    "bertscore_f1": 0.38480037450790405
  }
}