{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ace in the Hole (Criterion Collection) (Blu-ray + DVD)\nReview Date: 2014/06/09\nStore: Kirk Douglas  (Actor),     Jan Sterling  (Actor),     Billy Wilder  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"A New York newsman in New Mexico delays a cave-in victim's rescue to milk the story. Directed by Billy Wilder.\"]\nAverage Rating: 4.6\nProduct Details: {'Format': 'Multiple Formats, Blu-ray, Black & White, NTSC', 'Contributor': 'Bob Arthur, Kirk Douglas, Jan Sterling, Billy Wilder', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'CRRN2355BR', 'Director': 'Billy Wilder', 'Media Format': 'Multiple Formats, Blu-ray, Black & White, NTSC', 'Run time': '1 hour and 51 minutes', 'Release date': 'May 6, 2014', 'Actors': 'Kirk Douglas, Jan Sterling, Bob Arthur', 'Studio': 'Criterion', 'Number of discs': '1'}\nReview Text: Ace in the Hole, is a classic. Loaded with flashes of the past. From political correctness to social norms, the film is a study of progress a society has made. It also suggests where the hunger for the 24 hour news cycle originated.  For those pursuing journalist endeavors, the movie is a must see because it is news reporting from its rawest form.\nReview Title: A classic with flashes of history!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Blues for Willadean\nBeth Grant  (Actor),     Octavia Spencer  (Actor),     Del Shores  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Review', 'Two N.A.A.C.P. Awards for Del Shores and this material, based on the original stageplay, The Trials and Tribulations of a Trailer Trash Housewife. --NAACP Awards', 'About the Actor', 'Beth Grant (as Willadean) is popularly recognized from her many feature film roles, including No Country for Old Men, and her current TV series role on The Mindy Project; Octavia Spencer has built a solid career following her recent Oscar win for her memorable performance in The Help; Dale Dickey can be seen on True Blood and many features and series, most recently on Breaking Bad.', 'About the Director', \"Del Shores is an acclaimed film director with roots in playwriting / directing and producing. He is also a noted regular on the stand-up comedy circuit and is a respected activist for a variety of progressive causes. Notable film and TV projects include Sordid Lives and Daddy's Dyin, Who's Got The Will.\", 'See more']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Del Shores', 'Media Format': 'Multiple Formats, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'January 21, 2014', 'Actors': 'Beth Grant, Octavia Spencer, Dale Dickey, David Steen, Debby Holiday', 'Studio': 'Hannover House', 'Number of discs': '1'}\nThe performances of each actor were as powerful as the message of the movies subject line. The movie brings to front the hush and hidden denials of many relationships. It causes the viewer to question their own responsibility for friends or relatives, who they suspect may be in relationships that are abusive. It is a must see for everyone. Because everyone in someway will see their own reflection, some which they may wish not to acknowledge.\nOutstanding Performance and Storyline!\nBehind the Candelabra\nMichael Douglas  (Actor),     Matt Damon  (Actor),     Steven Soderbergh  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Golden Globe Central, Past Golden Globe Winners\n['Product Description', 'Behind the Candelabra (DVD)', 'Directed by acclaimed filmmaker Steven Soderbergh and executive produced by Jerry Weintraub, this HBO Films drama recreates the glittering private world of Liberace (Michael Douglas), the flamboyant, phenomenally successful entertainer whose extravagant costumes, trademark candelabra, and elaborate stage shows made him the most bankable entertainer of his time. The story focuses on Liberace’s tempestuous relationship with Scott Thorson (Matt Damon) in Las Vegas from 1977 to 1982 – a time when Liberace was at the peak of his popularity but remained closeted as a homosexual. Featuring a pair of electrifying performances by Douglas and Damon (the first time either has starred in an HBO production), Behind the Candelabra captures the essence of Liberace’s appeal while reminding viewers how different attitudes were at the time, as few high-profile entertainers (including Liberace) could admit they were gay, at least in front of the public which made them stars.', ']]>', 'Amazon.com', 'Now that', 'Behind the Candelabra', ', the HBO movie about the secret relationship between pianist/entertainer Liberace and former animal trainer Scott Thorson, has won three Emmys (including statues for best movie or miniseries, lead actor Michael Douglas, and director Steven Soderbergh), it\\'s hard to imagine that this was once a film that no one wanted to make. \"Too gay,\" they said. But after languishing in development for several years, and with Soderbergh, Douglas, and Matt Damon attached, the film finally premiered in 2013--and it is a triumph. Damon is thoroughly convincing as Thorson (whose book supplied the source material), the callow, not-especially-bright young man so susceptible to Liberace\\'s charming, unctuous persuasions (things get nutty when Scott agrees to undergo extensive plastic surgery designed to turn him into a younger version of \"Lee,\" as the pianist\\'s friends call him). Screenwriter Richard LaGravenese\\'s dialogue is hilarious (\"In gay years,\" one character tells Scott, \"you\\'re Judy during the Sid Luft obese period\"), while Soderbergh\\'s directorial choices are also amusing. Meanwhile, the rest of the cast is clearly having a field day: Rob Lowe (as the cosmetic surgeon) and Debbie Reynolds (as Liberace\\'s mother) gleefully chew the scenery, while Scott Bakula and Dan Aykroyd are entertaining as well. But this is Douglas\\'s show, and he steals it. His performance isn\\'t a caricature. Nor is it a parody, or an impersonation; the real Liberace, a guy whose name was seemingly always preceded by \"flamboyant,\" was such an over-the-top character that Douglas merely has to play it straight, so to speak. In the process, he sheds light not only on Liberace\\'s manipulative tendencies (\"Scott, why don\\'t you let me decide what\\'s important?\") but also his vulnerabilities--especially at the end, when he and Thorson have one last poignant meeting following a bitter falling out. The filmmakers also have something valuable to say about gay culture during a period when celebrities like Liberace and Rock Hudson tried desperately to stay in the closet, especially after contracting AIDS.', '--Sam Graham']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC', 'Contributor': 'Scott Bakula, Matt Damon, Steven Soderbergh, Michael Douglas', 'Language': 'Spanish (Dolby Digital 2.0 Surround), English (DTS 5.1)', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'HBO1000411874DVD', 'Director': 'Steven Soderbergh', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC', 'Run time': '2 hours', 'Release date': 'September 17, 2013', 'Actors': 'Michael Douglas, Matt Damon, Scott Bakula', 'Dubbed': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '1'}\nThe movie brings some camp back for those who remember the 1970's. The classmanship and craftmanship that laid many housewives in denial, while many young men on their backs brought out much of what many onlookers had speculated. The Gossip Rags couldn't put out such spice in such a rise and fall, with so many sparkles as Douglas and Damon were able to do. Both putting out a spectacular performance, that even &#34;Lee&#34; may eventually would have approved of.\nGoodmorning...a snap and glimer of what was!\nAce in the Hole (Criterion Collection) (Blu-ray + DVD)\nKirk Douglas  (Actor),     Jan Sterling  (Actor),     Billy Wilder  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"A New York newsman in New Mexico delays a cave-in victim's rescue to milk the story. Directed by Billy Wilder.\"]\n{'Format': 'Multiple Formats, Blu-ray, Black & White, NTSC', 'Contributor': 'Bob Arthur, Kirk Douglas, Jan Sterling, Billy Wilder', 'Language': 'English', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'CRRN2355BR', 'Director': 'Billy Wilder', 'Media Format': 'Multiple Formats, Blu-ray, Black & White, NTSC', 'Run time': '1 hour and 51 minutes', 'Release date': 'May 6, 2014', 'Actors': 'Kirk Douglas, Jan Sterling, Bob Arthur', 'Studio': 'Criterion', 'Number of discs': '1'}\nAce in the Hole, is a classic. Loaded with flashes of the past. From political correctness to social norms, the film is a study of progress a society has made. It also suggests where the hunger for the 24 hour news cycle originated.  For those pursuing journalist endeavors, the movie is a must see because it is news reporting from its rawest form.\nA classic with flashes of history!",
  "profile": "The user continues to express a strong preference for drama films that explore complex social themes and interpersonal relationships, emphasizing quality storytelling and performances. Their recent interaction reflects a deep appreciation for historical context intertwined with character-driven narratives, reinforcing their interest in how societal issues shape personal identities and experiences. They are drawn to films that not only showcase the intricacies of human relationships but also critically reflect on societal progress and challenges.\n\nThe user’s review highlighted the cultural implications of media, particularly in the context of journalism and the evolution of societal norms. Their thoughtful evaluation, coupled with a positive rating, underscores their tendency to engage with cinema that offers profound insights into human nature and the effects of contemporary issues. They remain committed to seeking impactful films that entertain while prompting self-reflection and a greater understanding of the world. This pattern of enjoying compelling narratives with a historical lens further cements their role as a discerning viewer who values artistic merit and emotional depth in cinema. Overall, the user’s tastes align with thought-provoking dramas that illuminate the complexities of life against broader social backdrops.",
  "metrics": {
    "rouge1_f": 0.12885538039753253,
    "rouge2_f": 0.008236101578586138,
    "rougeL_f": 0.06716929403701166,
    "meteor": 0.040116825526986796,
    "bleu1": 0.0002940119453328312,
    "bleu2": 9.071758753205304e-05,
    "bleu3": 1.3701487464972369e-05,
    "bleu4": 5.331441624741055e-06,
    "bertscore_precision": 0.3183676600456238,
    "bertscore_recall": 0.4837636947631836,
    "bertscore_f1": 0.38401371240615845
  }
}