{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Marshique Skin Fit Flat Auto Eyebrow Pencil(Golden Brown)- including Spoolie Brush, Soft Texture, Natural Looking, Long Lasting\nReview Date: 2021/01/29\nStore: Marshique\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Marshique', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Softening,Long Lasting', 'Package Dimensions': '5.63 x 0.67 x 0.67 inches; 0.32 Ounces'}\nReview Text: I was tired of paying twenty dollars for my eyebrow pencils, so when I found the \"Marshique Skin Fit Flat Auto Eyebrow Pencil(Golden Brown)- including Spoolie Brush, Soft Texture, Natural Looking, Long Lasting\" I didn't hesitate to get it.<br />This eyebrow pencil is very natural-looking and easy to apply. The spoolie is very soft and brushes through any brow in any condition.<br />I love the way my brows look after using this brow. You can definitely tell the difference, but its not too noticeable to others the way other pencils are.<br />Overall, this pencil is a five star pencil! Amazing!\nReview Title: Great, very natural-looking\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "CIMIY Gel Nail Polish Set 8 bottles - Manicure Colors Infinity with Top Base Coat for Forest Nail Art Natural Daily All Seasons for Nail Profession Salon and Starter at Home Soak Off UV LED 0.32oz\nCIMIY\n{'Brand': 'CIMIY', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Liquid Volume': '0.3 Fluid Ounces', 'Package Dimensions': '11.54 x 3.58 x 1.22 inches; 11.64 Ounces'}\nMy daughter was sick of paying more money at the salon for them to paint her acrylics, so I got her the \"CIMIY Gel Nail Polish Set 8 bottles - Manicure Colors Infinity with Top Base Coat for Forest Nail Art Natural Daily All Seasons for Nail Profession Salon and Starter at Home Soak Off UV LED 0.32oz\" to paint her nails with.<br />This polish requires an LED/UV lamp, so I also had to buy that for her. Other than that, this polish is great. It came with a base coat and a top coat, as well as 6 fall-inspired shades. The polish is very beautiful and doesn't make a huge mess. I had her put them under the lamp for 3 minutes after each coat and wound up using 2 coats of the colored polish on her nails. This gel polish hardens very nicely an doesn't get any dents or fingerprints.<br />Overall, I recommend this polish to people who are tired of overpaying at the salon.\nGreat polish\nGel Nail Polish Set, Glitter 6 Colors Gel Polish Kit Popular Nail Art Design Soak Off LED Lamp Nail Polish Gel Manicure Kit Gifts Set for Girls Women Professional DIY Home Use\nAnzuo\n{'Brand': 'Anzuo', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '6.00 Count', 'Number of Items': '6', 'Number of Pieces': '6', 'Product Dimensions': '5.12 x 3.15 x 3.54 inches; 10.23 Ounces'}\nI grew tired of paying to have my gel done at a salon, so I decided that I would do it myself now. After looking for a while, I decided to get the \"ANZUO Shimmer Gel Nail Polish Set Christmas Party 6 Colors UV LED Soak Off Gold Silver Nail Polish Kit for Women\" with hopes that it would work well.<br />I'm glad that I did, because this polish is great. Aside from the fact that the glitter is very messy, this polish is very nice. It is very smooth and hardens quickly, as well. Whenever I went to remove the polish, I could glitter everywhere. I kinda saw it coming, but it was still a little bit annoying. This polish does last quite a long time, though.<br />Overall, this polish gets a 4 out of 5. If the glitter wasn't so messy, my rating would be higher.\nGreat polish, messy to apply and/or remove\nMarshique Skin Fit Flat Auto Eyebrow Pencil(Golden Brown)- including Spoolie Brush, Soft Texture, Natural Looking, Long Lasting\nMarshique\n{'Brand': 'Marshique', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Softening,Long Lasting', 'Package Dimensions': '5.63 x 0.67 x 0.67 inches; 0.32 Ounces'}\nI was tired of paying twenty dollars for my eyebrow pencils, so when I found the \"Marshique Skin Fit Flat Auto Eyebrow Pencil(Golden Brown)- including Spoolie Brush, Soft Texture, Natural Looking, Long Lasting\" I didn't hesitate to get it.<br />This eyebrow pencil is very natural-looking and easy to apply. The spoolie is very soft and brushes through any brow in any condition.<br />I love the way my brows look after using this brow. You can definitely tell the difference, but its not too noticeable to others the way other pencils are.<br />Overall, this pencil is a five star pencil! Amazing!\nGreat, very natural-looking",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest:** At-home nail care and manicure, with an emerging interest in eyebrow grooming.\n- **Product Preference:** Prefers gel polish for its durability and professional finish, favors non-toxic and cruelty-free beauty products across all categories. Values items that allow for vibrant, glittery designs for nails; recently explored and found satisfaction in affordable, natural-looking eyebrow products with durable attributes.\n- **Usage Context:** Engages in DIY nail art for cost-effectiveness and personal expression while now considering budgeting for eyebrow care products as well. Recent experiences have highlighted challenges with glitter products in nails, while the recent eyebrow pencil purchase reflects a focus on practicality and natural aesthetics.\n- **Behavior Patterns:** Focuses on quality and ease of use, balancing aesthetics with functionality across both nail and eyebrow care. Values reliable products that deliver long-lasting results and enhance the overall beauty routine.\n- **Target Audience:** Interested in products suitable for personal use and family, maintaining a practical and budget-conscious approach towards all beauty routines.\n- **Seasonal Considerations:** Prefers colors and products that align with seasonal themes, showing a trend towards versatile and aesthetically pleasing options for various occasions.\n- **User Experience:** Values products that minimize mess and enhance the at-home beauty experience, demonstrating a commitment to high-performing items in nail care and new interests in eyebrow grooming.",
  "metrics": {
    "rouge1_f": 0.20728929384965833,
    "rouge2_f": 0.025114155251141548,
    "rougeL_f": 0.09339407744874716,
    "meteor": 0.07840884286606913,
    "bleu1": 0.0402012485884119,
    "bleu2": 0.008736659663694264,
    "bleu3": 0.003312985302288607,
    "bleu4": 0.001148291334521266,
    "bertscore_precision": 0.36043959856033325,
    "bertscore_recall": 0.42658573389053345,
    "bertscore_f1": 0.390733003616333
  }
}