{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/02/19\nAverage Rating: 3.9\nProduct Details: {'Content advisory': ['Alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Brahm'], 'Producers': ['Hunt Stromberg'], 'Starring': ['Anne Baxter', 'Ralph Bellamy', 'Aline MacMahon'], 'Studio': ['The Film Detective']}\nReview Text: I just love films from this period...I am a sucker for them.  Everyone turns in a good performance; Anne Baxter dominates the screen; she is so watchable.  Watching these old movies has made me familiar with all the players/cast members.<br /><br />Had the privilege of seeing Ruth Warrick in person many years ago...she was already maturing.  She did a reading of &#34;Love Letters&#34;...I think that was the name.  She was the most beautifully groomed woman I have every seen, and I surmised she was very serious about acting.  Should also be remembered for Citizen Kane.<br /><br />This movie is entertaining, I am so glad it is available on Amazon Prime.  Love the sets with the period furniture.  The older ways of doing things: dressmakers, etc.  Have already watched it more than once.\nReview Title: Vintage Entertainment\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Whirlpool\nGene Tierney  (Actor),     Richard Conte  (Actor),     Otto Preminger  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"A hypnotist frames a psychiatrist's kleptomaniac wife for murder. Directed by Otto Preminger.\", 'Amazon.com', 'Laura', 'will always be director Otto Preminger\\'s most beloved movie, but he gets closer to the essence of film noir in this fascinatingly slippery item about a psychiatrist\\'s wife whose weakness for kleptomania makes her prey to an oily hypnotist, con artist, and manipulator par excellence. The fashion-plate wife (dresses, robes, and peignoirs by Oleg Cassini) is played by Laura herself, Gene Tierney. The mellifluous conniver is Jose Ferrer, coming off like the illegitimate son of Waldo Lydecker (\"I\\'m so glad you\\'re here--you make Tina\\'s party seem an almost human event\"). Among other things, Ferrer would probably like to get Tierney into bed, and a good many people--including Richard Conte as the caring husband--come to believe he has. But that\\'s not the extent of his ambitions, and before long Tierney has been framed for a murder of convenience to clear up another bit of messiness in the cad\\'s career.', 'Whirlpool', \"'s mise-en-scène has a sinuous fluidity and subtle play of light and shadow (it was among the last films shot by that master of black-and-white, Arthur C. Miller), and the complexly structured screenplay--by Ben Hecht and Andrew Solt--takes us by surprise in reel after reel. There's nothing redeeming about Ferrer's character (except how much pleasure his villainy affords), but Preminger doesn't really side with any of the characters or permit our facile identification with anyone. Different parts of the movie are dominated by each of the key figures, including police detective Charles Bickford, and we keep learning there's more to each of them than we initially assumed.\", 'Whirlpool', \"'s a good title for it. Dive in.\", '--Richard T. Jameson']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': \"Gene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss BradleyGene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss Bradley  See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Otto Preminger', 'Media Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 6, 2005', 'Actors': \"Gene Tierney, Richard Conte, Jos Ferrer, Charles Bickford, Barbara O'Neil\", 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Andrew Solt, Ben Hecht, Guy Endore', 'Number of discs': '1'}\nThe best thing about this DVD is the quality and the commentary.  When you listen to the commentary the film is much more interesting.  Just watching it, well, it is not a very interesting or exciting film.  I was curious because I had not heard of it or seen it.  If I had seen it before, I may not have purchased it.  Good performances.\nNot Preminger's Best\nGirl Of The Night [Remaster]\nJoseph Cates  (Director),     Anne Francis  (Actor),     Lloyd Nolan  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['\"An Exciting Step Forward into a New Realm of Adult Motion Pictures!\" promised the ads for 1960\\'s Girl of the Night and there was truth to the claim. The film was rare for its time, a sympathetic portrait of a young girl (Anne Francis in a strong performance) raised in a loveless home who drifts into a life of prostitution. Friendless and lonely, she\\'s an easy target for her boozed-up madam (Kay Medford) and sadistic pimp (John Kerr) until a compassionate doctor (Lloyd Nolan) helps her unlock the secrets of her past and gain a sense of self-worth. Based on Dr. Harold Greenwald\\'s academic work The Call Girl: A Social and Psychoanalytical Study, this is a fascinating curio, a reminder of an era that was just coming to grips with the sordid side of reality.']\n{'Genre': 'Drama', 'Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Contributor': 'John Kerr, Anne Francis, Joseph Cates, Lloyd Nolan, Kay Medford', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Joseph Cates', 'Media Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 24, 2011', 'Actors': 'Anne Francis, Lloyd Nolan, Kay Medford, John Kerr', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSo grateful to Amazon...I came across this film because of my constant browsing.  If you are a fan of film from this circa, you will enjoy this.  Great performance from Anne Francis...an underrated actress.  Worthy of an Academy Award nomination if not a win.  She walks away with this film.  Beautiful, sympathetic, no over acting...which could happen in this kind of role.  A film ahead of its time.\nLost Gem\nSudden Fear\nJoan Crawford  (Actor),     Jack Palance  (Actor),     David Miller  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Joan Crawford turns in one of the most emotionally charged performances of her career as a playwright who must use her plotting skills to save her own life, in this beautifully crafted film noir thriller. Nominated for four Academy Awards, \"Sudden Fear\" is an unbeatable combination of lush melodrama and drop-dead suspense.', 'Amazon.com', 'Sudden Fear', \"is one of those noir gems about a love-hate relationship between a husband and wife that's doomed from the very beginning. Jack Palance plays an ambitious actor rebuffed by playwright and heiress Joan Crawford. He later romances and marries her before falling under the dark spell of ex-girlfriend Gloria Grahame. When Palance and Grahame plot to get her fortune, the evil scheme backfires with ironically twisted results. Palance has no idea how much his wife truly loves him, and she has no idea how sinister he truly is. It's a fascinating if contrived film, with wonderful nuances and sensitive performances by the three leads.\", '--Bill Desowitz']\n{'Genre': 'Mystery & Thrillers', 'Format': 'NTSC, Multiple Formats, Black & White', 'Contributor': 'Bess Flowers, Gloria Grahame, Bruce Bennett, Virginia Huston, Estelle Etterre, Robert Smith, Jack Palance, David Miller, Joan Crawford, Selmer Jackson, Harold Miller, Lenore J. Coffee, Taylor Holmes, Edna Sherry, Mike Connors, Lewis MartinBess Flowers, Gloria Grahame, Bruce Bennett, Virginia Huston, Estelle Etterre, Robert Smith, Jack Palance, David Miller, Joan Crawford, Selmer Jackson, Harold Miller, Lenore J. Coffee, Taylor Holmes, Edna Sherry, Mike Connors, Lewis Martin   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Director': 'David Miller', 'Media Format': 'NTSC, Multiple Formats, Black & White', 'Run time': '1 hour and 50 minutes', 'Release date': 'September 2, 2003', 'Actors': 'Joan Crawford, Jack Palance, Gloria Grahame, Bruce Bennett, Virginia Huston', 'Studio': 'Kino Video', 'Writers': 'Edna Sherry, Lenore J. Coffee, Robert Smith', 'Number of discs': '1'}\nStars that I always enjoy watching, Joan Crawford, Gloria Grahame...flawless.  I could watch this film every week.  Love the location shots.  Great camera work, authentic locations.  Good story...a middle-aged woman who, although extremely bright, is completely deceived by Jack Palance's character...he is, after all, an actor.  Love Gloria Grahame...but I would watch anything she was in.  The DVD sound is inferior.  But I am grateful...I never see this film on TV...cannot understand why.  Have not seen this film since it came out and I was a very, young girl.  Glad to have it. Took a star off because of the quality of the DVD.\n5 Star Film, inferior DVD\n{'Subtitles': ['None available'], 'Directors': ['Chris Valentini'], 'Producers': ['Outpost Entertainment', 'Jodi Flynn', 'Brent Montgomery', 'Cynthia Bruck'], 'Starring': ['Chip Bolcik'], 'Studio': ['PBS']}\ninteresting, good commentators, some new information for me, especially re: his release and death\ngood commentators, some new information for me\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Sturges'], 'Producers': ['Niven Busch', 'Eddie Donahoe'], 'Starring': ['Lew Ayres', 'Teresa Wright', 'Victor Jory']}\nTerrible print...watched because I like Teresa Wright.  Both actors do a fine job, but the print is so bad it is distracting...fell asleep watching, will not re-watch.  Plot OK, not exciting.\nTerrible print.\n{'Content advisory': ['Alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Brahm'], 'Producers': ['Hunt Stromberg'], 'Starring': ['Anne Baxter', 'Ralph Bellamy', 'Aline MacMahon'], 'Studio': ['The Film Detective']}\nI just love films from this period...I am a sucker for them.  Everyone turns in a good performance; Anne Baxter dominates the screen; she is so watchable.  Watching these old movies has made me familiar with all the players/cast members.<br /><br />Had the privilege of seeing Ruth Warrick in person many years ago...she was already maturing.  She did a reading of &#34;Love Letters&#34;...I think that was the name.  She was the most beautifully groomed woman I have every seen, and I surmised she was very serious about acting.  Should also be remembered for Citizen Kane.<br /><br />This movie is entertaining, I am so glad it is available on Amazon Prime.  Love the sets with the period furniture.  The older ways of doing things: dressmakers, etc.  Have already watched it more than once.\nVintage Entertainment",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences**: The user continues to exhibit a strong affinity for classic films, particularly in the drama and mystery genres, expressing a deep appreciation for performances from well-known actors. Their recent activity highlights a nostalgic admiration for the era's filmmaking, evidenced by their enjoyment of period-specific details.\n\n- **Viewing Expectations**: While high production values remain crucial, the user also cherishes the charm of vintage cinema, which reflects in their fondness for set designs and authentic portrayals of past lifestyles. They value strong performances and narrative authenticity even more, often linking the quality of performances to their overall enjoyment.\n\n- **Critical Perspective**: The user balances their passion for classic films with a discerning eye for quality. While they praise individual performances, they remain critical of technical aspects that could diminish their viewing experience. Their reviews reflect a growing awareness of the film's overall presentation.\n\n- **Experience Over Popularity**: The user's commitment to exploring lesser-known works in the classic genre is evident, as they seek out films that provide rich narratives and character development. Their familiarity with actors from this period enhances their viewing experience, leading them to appreciate the nuances of performances.\n\n- **Engagement with Film History**: A profound interest in cinema's historical context remains strong, with a desire for discussions around film legacy and retrospectives. Their enthusiasm for the film medium is complemented by personal anecdotes related to prominent figures in the industry. \n\nIn summary, this user is a devoted fan of classic dramas and mysteries, passionately engaging with both the performances and historical context of the films, while also developing a critical eye toward overall quality and presentation.",
  "metrics": {
    "rouge1_f": 0.13824884792626727,
    "rouge2_f": 0.0194771911840082,
    "rougeL_f": 0.06963645673323092,
    "meteor": 0.04114839569427654,
    "bleu1": 0.0008527236893641349,
    "bleu2": 0.00029974111644949687,
    "bleu3": 0.00010375826621286866,
    "bleu4": 2.888896039215457e-05,
    "bertscore_precision": 0.35008901357650757,
    "bertscore_recall": 0.47956183552742004,
    "bertscore_f1": 0.40472283959388733
  }
}