{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Girl Of The Night [Remaster]\nReview Date: 2011/10/10\nStore: Joseph Cates  (Director),     Anne Francis  (Actor),     Lloyd Nolan  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['\"An Exciting Step Forward into a New Realm of Adult Motion Pictures!\" promised the ads for 1960\\'s Girl of the Night and there was truth to the claim. The film was rare for its time, a sympathetic portrait of a young girl (Anne Francis in a strong performance) raised in a loveless home who drifts into a life of prostitution. Friendless and lonely, she\\'s an easy target for her boozed-up madam (Kay Medford) and sadistic pimp (John Kerr) until a compassionate doctor (Lloyd Nolan) helps her unlock the secrets of her past and gain a sense of self-worth. Based on Dr. Harold Greenwald\\'s academic work The Call Girl: A Social and Psychoanalytical Study, this is a fascinating curio, a reminder of an era that was just coming to grips with the sordid side of reality.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Drama', 'Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Contributor': 'John Kerr, Anne Francis, Joseph Cates, Lloyd Nolan, Kay Medford', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Joseph Cates', 'Media Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 24, 2011', 'Actors': 'Anne Francis, Lloyd Nolan, Kay Medford, John Kerr', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: So grateful to Amazon...I came across this film because of my constant browsing.  If you are a fan of film from this circa, you will enjoy this.  Great performance from Anne Francis...an underrated actress.  Worthy of an Academy Award nomination if not a win.  She walks away with this film.  Beautiful, sympathetic, no over acting...which could happen in this kind of role.  A film ahead of its time.\nReview Title: Lost Gem\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Whirlpool\nGene Tierney  (Actor),     Richard Conte  (Actor),     Otto Preminger  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"A hypnotist frames a psychiatrist's kleptomaniac wife for murder. Directed by Otto Preminger.\", 'Amazon.com', 'Laura', 'will always be director Otto Preminger\\'s most beloved movie, but he gets closer to the essence of film noir in this fascinatingly slippery item about a psychiatrist\\'s wife whose weakness for kleptomania makes her prey to an oily hypnotist, con artist, and manipulator par excellence. The fashion-plate wife (dresses, robes, and peignoirs by Oleg Cassini) is played by Laura herself, Gene Tierney. The mellifluous conniver is Jose Ferrer, coming off like the illegitimate son of Waldo Lydecker (\"I\\'m so glad you\\'re here--you make Tina\\'s party seem an almost human event\"). Among other things, Ferrer would probably like to get Tierney into bed, and a good many people--including Richard Conte as the caring husband--come to believe he has. But that\\'s not the extent of his ambitions, and before long Tierney has been framed for a murder of convenience to clear up another bit of messiness in the cad\\'s career.', 'Whirlpool', \"'s mise-en-scène has a sinuous fluidity and subtle play of light and shadow (it was among the last films shot by that master of black-and-white, Arthur C. Miller), and the complexly structured screenplay--by Ben Hecht and Andrew Solt--takes us by surprise in reel after reel. There's nothing redeeming about Ferrer's character (except how much pleasure his villainy affords), but Preminger doesn't really side with any of the characters or permit our facile identification with anyone. Different parts of the movie are dominated by each of the key figures, including police detective Charles Bickford, and we keep learning there's more to each of them than we initially assumed.\", 'Whirlpool', \"'s a good title for it. Dive in.\", '--Richard T. Jameson']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': \"Gene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss BradleyGene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss Bradley  See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Otto Preminger', 'Media Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 6, 2005', 'Actors': \"Gene Tierney, Richard Conte, Jos Ferrer, Charles Bickford, Barbara O'Neil\", 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Andrew Solt, Ben Hecht, Guy Endore', 'Number of discs': '1'}\nThe best thing about this DVD is the quality and the commentary.  When you listen to the commentary the film is much more interesting.  Just watching it, well, it is not a very interesting or exciting film.  I was curious because I had not heard of it or seen it.  If I had seen it before, I may not have purchased it.  Good performances.\nNot Preminger's Best\nGirl Of The Night [Remaster]\nJoseph Cates  (Director),     Anne Francis  (Actor),     Lloyd Nolan  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['\"An Exciting Step Forward into a New Realm of Adult Motion Pictures!\" promised the ads for 1960\\'s Girl of the Night and there was truth to the claim. The film was rare for its time, a sympathetic portrait of a young girl (Anne Francis in a strong performance) raised in a loveless home who drifts into a life of prostitution. Friendless and lonely, she\\'s an easy target for her boozed-up madam (Kay Medford) and sadistic pimp (John Kerr) until a compassionate doctor (Lloyd Nolan) helps her unlock the secrets of her past and gain a sense of self-worth. Based on Dr. Harold Greenwald\\'s academic work The Call Girl: A Social and Psychoanalytical Study, this is a fascinating curio, a reminder of an era that was just coming to grips with the sordid side of reality.']\n{'Genre': 'Drama', 'Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Contributor': 'John Kerr, Anne Francis, Joseph Cates, Lloyd Nolan, Kay Medford', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Joseph Cates', 'Media Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 24, 2011', 'Actors': 'Anne Francis, Lloyd Nolan, Kay Medford, John Kerr', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSo grateful to Amazon...I came across this film because of my constant browsing.  If you are a fan of film from this circa, you will enjoy this.  Great performance from Anne Francis...an underrated actress.  Worthy of an Academy Award nomination if not a win.  She walks away with this film.  Beautiful, sympathetic, no over acting...which could happen in this kind of role.  A film ahead of its time.\nLost Gem",
  "profile": "**User Profile Summary:**\n\n- **Media Preferences**: The user maintains a strong affinity for classic films, particularly in the drama genre, showcasing a keen interest in both well-known and lesser-known works. Their recent purchase highlights an appreciation for the historical context of films and a desire to explore unique narratives.\n\n- **Viewing Expectations**: This user values high-quality film production, with a focus on aspects like sound quality, visual presentation, and remastered formats. They respond positively to strong performances, as evidenced by their admiration for the lead actress in their latest review, further indicating their preference for substance in storytelling.\n\n- **Critical Perspective**: The user approaches films with a discerning eye, valuing character development and narrative depth. Their reviews reflect a blend of critical analysis and genuine appreciation for performances, as they highlight the worthiness of accolades for underrated actors while maintaining a thoughtful critique.\n\n- **Experience Over Popularity**: Their engagement with obscure films exhibits a commitment to personal discovery within the classic cinema landscape, revealing a preference for films that provoke thought and offer insights into societal issues.\n\n- **Engagement with Film History**: The user demonstrates a strong interest in film history, expressing curiosity about the evolution of cinema and its cultural implications. This aspect of their profile suggests a likelihood of enjoying retrospectives or in-depth discussions surrounding classic films.\n\nIn summary, this user is an avid consumer of classic dramas, valuing quality performances and historical significance while applying a critical lens to their viewing experiences.",
  "metrics": {
    "rouge1_f": 0.18382978723404256,
    "rouge2_f": 0.010230179028132993,
    "rougeL_f": 0.0851063829787234,
    "meteor": 0.0595187842971718,
    "bleu1": 0.013295476865491202,
    "bleu2": 0.002865543136360494,
    "bleu3": 0.00046688100570283007,
    "bleu4": 0.00018861370976582916,
    "bertscore_precision": 0.347825288772583,
    "bertscore_recall": 0.4544680118560791,
    "bertscore_f1": 0.39405903220176697
  }
}