{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/03/13\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Sturges'], 'Producers': ['Niven Busch', 'Eddie Donahoe'], 'Starring': ['Lew Ayres', 'Teresa Wright', 'Victor Jory']}\nReview Text: Terrible print...watched because I like Teresa Wright.  Both actors do a fine job, but the print is so bad it is distracting...fell asleep watching, will not re-watch.  Plot OK, not exciting.\nReview Title: Terrible print.\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Whirlpool\nGene Tierney  (Actor),     Richard Conte  (Actor),     Otto Preminger  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"A hypnotist frames a psychiatrist's kleptomaniac wife for murder. Directed by Otto Preminger.\", 'Amazon.com', 'Laura', 'will always be director Otto Preminger\\'s most beloved movie, but he gets closer to the essence of film noir in this fascinatingly slippery item about a psychiatrist\\'s wife whose weakness for kleptomania makes her prey to an oily hypnotist, con artist, and manipulator par excellence. The fashion-plate wife (dresses, robes, and peignoirs by Oleg Cassini) is played by Laura herself, Gene Tierney. The mellifluous conniver is Jose Ferrer, coming off like the illegitimate son of Waldo Lydecker (\"I\\'m so glad you\\'re here--you make Tina\\'s party seem an almost human event\"). Among other things, Ferrer would probably like to get Tierney into bed, and a good many people--including Richard Conte as the caring husband--come to believe he has. But that\\'s not the extent of his ambitions, and before long Tierney has been framed for a murder of convenience to clear up another bit of messiness in the cad\\'s career.', 'Whirlpool', \"'s mise-en-scène has a sinuous fluidity and subtle play of light and shadow (it was among the last films shot by that master of black-and-white, Arthur C. Miller), and the complexly structured screenplay--by Ben Hecht and Andrew Solt--takes us by surprise in reel after reel. There's nothing redeeming about Ferrer's character (except how much pleasure his villainy affords), but Preminger doesn't really side with any of the characters or permit our facile identification with anyone. Different parts of the movie are dominated by each of the key figures, including police detective Charles Bickford, and we keep learning there's more to each of them than we initially assumed.\", 'Whirlpool', \"'s a good title for it. Dive in.\", '--Richard T. Jameson']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': \"Gene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss BradleyGene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss Bradley  See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Otto Preminger', 'Media Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 6, 2005', 'Actors': \"Gene Tierney, Richard Conte, Jos Ferrer, Charles Bickford, Barbara O'Neil\", 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Andrew Solt, Ben Hecht, Guy Endore', 'Number of discs': '1'}\nThe best thing about this DVD is the quality and the commentary.  When you listen to the commentary the film is much more interesting.  Just watching it, well, it is not a very interesting or exciting film.  I was curious because I had not heard of it or seen it.  If I had seen it before, I may not have purchased it.  Good performances.\nNot Preminger's Best\nGirl Of The Night [Remaster]\nJoseph Cates  (Director),     Anne Francis  (Actor),     Lloyd Nolan  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['\"An Exciting Step Forward into a New Realm of Adult Motion Pictures!\" promised the ads for 1960\\'s Girl of the Night and there was truth to the claim. The film was rare for its time, a sympathetic portrait of a young girl (Anne Francis in a strong performance) raised in a loveless home who drifts into a life of prostitution. Friendless and lonely, she\\'s an easy target for her boozed-up madam (Kay Medford) and sadistic pimp (John Kerr) until a compassionate doctor (Lloyd Nolan) helps her unlock the secrets of her past and gain a sense of self-worth. Based on Dr. Harold Greenwald\\'s academic work The Call Girl: A Social and Psychoanalytical Study, this is a fascinating curio, a reminder of an era that was just coming to grips with the sordid side of reality.']\n{'Genre': 'Drama', 'Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Contributor': 'John Kerr, Anne Francis, Joseph Cates, Lloyd Nolan, Kay Medford', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Joseph Cates', 'Media Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 24, 2011', 'Actors': 'Anne Francis, Lloyd Nolan, Kay Medford, John Kerr', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSo grateful to Amazon...I came across this film because of my constant browsing.  If you are a fan of film from this circa, you will enjoy this.  Great performance from Anne Francis...an underrated actress.  Worthy of an Academy Award nomination if not a win.  She walks away with this film.  Beautiful, sympathetic, no over acting...which could happen in this kind of role.  A film ahead of its time.\nLost Gem\nSudden Fear\nJoan Crawford  (Actor),     Jack Palance  (Actor),     David Miller  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Joan Crawford turns in one of the most emotionally charged performances of her career as a playwright who must use her plotting skills to save her own life, in this beautifully crafted film noir thriller. Nominated for four Academy Awards, \"Sudden Fear\" is an unbeatable combination of lush melodrama and drop-dead suspense.', 'Amazon.com', 'Sudden Fear', \"is one of those noir gems about a love-hate relationship between a husband and wife that's doomed from the very beginning. Jack Palance plays an ambitious actor rebuffed by playwright and heiress Joan Crawford. He later romances and marries her before falling under the dark spell of ex-girlfriend Gloria Grahame. When Palance and Grahame plot to get her fortune, the evil scheme backfires with ironically twisted results. Palance has no idea how much his wife truly loves him, and she has no idea how sinister he truly is. It's a fascinating if contrived film, with wonderful nuances and sensitive performances by the three leads.\", '--Bill Desowitz']\n{'Genre': 'Mystery & Thrillers', 'Format': 'NTSC, Multiple Formats, Black & White', 'Contributor': 'Bess Flowers, Gloria Grahame, Bruce Bennett, Virginia Huston, Estelle Etterre, Robert Smith, Jack Palance, David Miller, Joan Crawford, Selmer Jackson, Harold Miller, Lenore J. Coffee, Taylor Holmes, Edna Sherry, Mike Connors, Lewis MartinBess Flowers, Gloria Grahame, Bruce Bennett, Virginia Huston, Estelle Etterre, Robert Smith, Jack Palance, David Miller, Joan Crawford, Selmer Jackson, Harold Miller, Lenore J. Coffee, Taylor Holmes, Edna Sherry, Mike Connors, Lewis Martin   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Director': 'David Miller', 'Media Format': 'NTSC, Multiple Formats, Black & White', 'Run time': '1 hour and 50 minutes', 'Release date': 'September 2, 2003', 'Actors': 'Joan Crawford, Jack Palance, Gloria Grahame, Bruce Bennett, Virginia Huston', 'Studio': 'Kino Video', 'Writers': 'Edna Sherry, Lenore J. Coffee, Robert Smith', 'Number of discs': '1'}\nStars that I always enjoy watching, Joan Crawford, Gloria Grahame...flawless.  I could watch this film every week.  Love the location shots.  Great camera work, authentic locations.  Good story...a middle-aged woman who, although extremely bright, is completely deceived by Jack Palance's character...he is, after all, an actor.  Love Gloria Grahame...but I would watch anything she was in.  The DVD sound is inferior.  But I am grateful...I never see this film on TV...cannot understand why.  Have not seen this film since it came out and I was a very, young girl.  Glad to have it. Took a star off because of the quality of the DVD.\n5 Star Film, inferior DVD\n{'Subtitles': ['None available'], 'Directors': ['Chris Valentini'], 'Producers': ['Outpost Entertainment', 'Jodi Flynn', 'Brent Montgomery', 'Cynthia Bruck'], 'Starring': ['Chip Bolcik'], 'Studio': ['PBS']}\ninteresting, good commentators, some new information for me, especially re: his release and death\ngood commentators, some new information for me\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Sturges'], 'Producers': ['Niven Busch', 'Eddie Donahoe'], 'Starring': ['Lew Ayres', 'Teresa Wright', 'Victor Jory']}\nTerrible print...watched because I like Teresa Wright.  Both actors do a fine job, but the print is so bad it is distracting...fell asleep watching, will not re-watch.  Plot OK, not exciting.\nTerrible print.",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences**: The user maintains a strong preference for classic films, particularly in the drama and mystery genres. Recent activity indicates a focus not only on the performances of favored actors but also on the importance of film quality, as highlighted by their response to subpar print conditions.\n\n- **Viewing Expectations**: High production values remain a priority, especially in sound and visual presentation. Although they appreciate strong performances and authentic storytelling, recent interactions reveal a growing intolerance for technical inadequacies, which can significantly impact their enjoyment.\n\n- **Critical Perspective**: The user continues to approach film analysis with discernment, valuing character complexity and narrative intricacies. While they express genuine appreciation for performances, they are increasingly critical of overall film quality when it detracts from the viewing experience.\n\n- **Experience Over Popularity**: Their commitment to exploring lesser-known films persists, favoring narratives that challenge and provoke thought. However, they are more aware of the importance of restoration and presentation in enhancing these experiences.\n\n- **Engagement with Film History**: A deep interest in the historical context of cinema remains evident, as they enjoy in-depth discussions and retrospectives. This recent interaction underscores their commitment to not only enjoying classic films but also critically assessing their technical quality.\n\nIn summary, this user is a dedicated consumer of classic dramas and mysteries, increasingly attentive to film quality, which informs their thoughtful critiques and reinforces their interest in film history.",
  "metrics": {
    "rouge1_f": 0.11615871190339276,
    "rouge2_f": 0.010362694300518135,
    "rougeL_f": 0.062104657849338704,
    "meteor": 0.03566297208538588,
    "bleu1": 0.0006981882963808455,
    "bleu2": 0.000207141746861514,
    "bleu3": 2.9798841218134236e-05,
    "bleu4": 1.1312057022166272e-05,
    "bertscore_precision": 0.33884143829345703,
    "bertscore_recall": 0.46276506781578064,
    "bertscore_f1": 0.39122429490089417
  }
}