{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: House of Strangers\nReview Date: 2019/02/06\nStore: Edward G. Robinson  (Actor),     Susan Hayward  (Actor),     Joseph L. Mankiewicz  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['An Italian New York banker has a son who is loyal and three who are not. Directed by Joseph L. Mankiewicz.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Black & White, NTSC, Full Screen', 'Contributor': 'Hope Emerson, Esther Minciotti, Philip Yordan, Edward G. Robinson, Paul Valentine, Efrem Zimbalist Jr., Susan Hayward, Jerome Weidman, Debra Paget, Luther Adler, Richard Conte, Diana Douglas, Tito Vuolo, Fred Aldrich, Joseph L. MankiewiczHope Emerson, Esther Minciotti, Philip Yordan, Edward G. Robinson, Paul Valentine, Efrem Zimbalist Jr., Susan Hayward, Jerome Weidman, Debra Paget, Luther Adler, Richard Conte, Diana Douglas, Tito Vuolo, Fred Aldrich, Joseph L. Mankiewicz   See more', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 1.0), Unqualified', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 0.01 Ounces', 'Director': 'Joseph L. Mankiewicz', 'Media Format': 'Multiple Formats, Black & White, NTSC, Full Screen', 'Run time': '1 hour and 41 minutes', 'Release date': 'June 6, 2006', 'Actors': 'Edward G. Robinson, Susan Hayward, Richard Conte, Luther Adler, Paul Valentine', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Jerome Weidman, Joseph L. Mankiewicz, Philip Yordan', 'Number of discs': '1'}\nReview Text: One of my favorite films from that time.  Love the cast, the director.  There are a few skips in the disc but that seems to happen with many of the discs I purchase.  However, I am keeping it.  Great commentary included.\nReview Title: Glad I purchased\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Whirlpool\nGene Tierney  (Actor),     Richard Conte  (Actor),     Otto Preminger  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"A hypnotist frames a psychiatrist's kleptomaniac wife for murder. Directed by Otto Preminger.\", 'Amazon.com', 'Laura', 'will always be director Otto Preminger\\'s most beloved movie, but he gets closer to the essence of film noir in this fascinatingly slippery item about a psychiatrist\\'s wife whose weakness for kleptomania makes her prey to an oily hypnotist, con artist, and manipulator par excellence. The fashion-plate wife (dresses, robes, and peignoirs by Oleg Cassini) is played by Laura herself, Gene Tierney. The mellifluous conniver is Jose Ferrer, coming off like the illegitimate son of Waldo Lydecker (\"I\\'m so glad you\\'re here--you make Tina\\'s party seem an almost human event\"). Among other things, Ferrer would probably like to get Tierney into bed, and a good many people--including Richard Conte as the caring husband--come to believe he has. But that\\'s not the extent of his ambitions, and before long Tierney has been framed for a murder of convenience to clear up another bit of messiness in the cad\\'s career.', 'Whirlpool', \"'s mise-en-scène has a sinuous fluidity and subtle play of light and shadow (it was among the last films shot by that master of black-and-white, Arthur C. Miller), and the complexly structured screenplay--by Ben Hecht and Andrew Solt--takes us by surprise in reel after reel. There's nothing redeeming about Ferrer's character (except how much pleasure his villainy affords), but Preminger doesn't really side with any of the characters or permit our facile identification with anyone. Different parts of the movie are dominated by each of the key figures, including police detective Charles Bickford, and we keep learning there's more to each of them than we initially assumed.\", 'Whirlpool', \"'s a good title for it. Dive in.\", '--Richard T. Jameson']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Contributor': \"Gene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss BradleyGene Tierney, Otto Preminger, Andrew Solt, Eduard Franz, Barbara O'Neil, Guy Endore, Charles Bickford, Gail Bonney, Beau Anderson, Constance Collier, Jos Ferrer, Fortunio Bonanova, Richard Conte, Ben Hecht, Myrtle Anderson, Lovyss Bradley  See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Otto Preminger', 'Media Format': 'Multiple Formats, Dubbed, Black & White, Full Screen, Subtitled, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'September 6, 2005', 'Actors': \"Gene Tierney, Richard Conte, Jos Ferrer, Charles Bickford, Barbara O'Neil\", 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Andrew Solt, Ben Hecht, Guy Endore', 'Number of discs': '1'}\nThe best thing about this DVD is the quality and the commentary.  When you listen to the commentary the film is much more interesting.  Just watching it, well, it is not a very interesting or exciting film.  I was curious because I had not heard of it or seen it.  If I had seen it before, I may not have purchased it.  Good performances.\nNot Preminger's Best\nGirl Of The Night [Remaster]\nJoseph Cates  (Director),     Anne Francis  (Actor),     Lloyd Nolan  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['\"An Exciting Step Forward into a New Realm of Adult Motion Pictures!\" promised the ads for 1960\\'s Girl of the Night and there was truth to the claim. The film was rare for its time, a sympathetic portrait of a young girl (Anne Francis in a strong performance) raised in a loveless home who drifts into a life of prostitution. Friendless and lonely, she\\'s an easy target for her boozed-up madam (Kay Medford) and sadistic pimp (John Kerr) until a compassionate doctor (Lloyd Nolan) helps her unlock the secrets of her past and gain a sense of self-worth. Based on Dr. Harold Greenwald\\'s academic work The Call Girl: A Social and Psychoanalytical Study, this is a fascinating curio, a reminder of an era that was just coming to grips with the sordid side of reality.']\n{'Genre': 'Drama', 'Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Contributor': 'John Kerr, Anne Francis, Joseph Cates, Lloyd Nolan, Kay Medford', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Joseph Cates', 'Media Format': 'Black & White, NTSC, Widescreen, Original recording remastered', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 24, 2011', 'Actors': 'Anne Francis, Lloyd Nolan, Kay Medford, John Kerr', 'Studio': 'WB', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSo grateful to Amazon...I came across this film because of my constant browsing.  If you are a fan of film from this circa, you will enjoy this.  Great performance from Anne Francis...an underrated actress.  Worthy of an Academy Award nomination if not a win.  She walks away with this film.  Beautiful, sympathetic, no over acting...which could happen in this kind of role.  A film ahead of its time.\nLost Gem\nSudden Fear\nJoan Crawford  (Actor),     Jack Palance  (Actor),     David Miller  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Joan Crawford turns in one of the most emotionally charged performances of her career as a playwright who must use her plotting skills to save her own life, in this beautifully crafted film noir thriller. Nominated for four Academy Awards, \"Sudden Fear\" is an unbeatable combination of lush melodrama and drop-dead suspense.', 'Amazon.com', 'Sudden Fear', \"is one of those noir gems about a love-hate relationship between a husband and wife that's doomed from the very beginning. Jack Palance plays an ambitious actor rebuffed by playwright and heiress Joan Crawford. He later romances and marries her before falling under the dark spell of ex-girlfriend Gloria Grahame. When Palance and Grahame plot to get her fortune, the evil scheme backfires with ironically twisted results. Palance has no idea how much his wife truly loves him, and she has no idea how sinister he truly is. It's a fascinating if contrived film, with wonderful nuances and sensitive performances by the three leads.\", '--Bill Desowitz']\n{'Genre': 'Mystery & Thrillers', 'Format': 'NTSC, Multiple Formats, Black & White', 'Contributor': 'Bess Flowers, Gloria Grahame, Bruce Bennett, Virginia Huston, Estelle Etterre, Robert Smith, Jack Palance, David Miller, Joan Crawford, Selmer Jackson, Harold Miller, Lenore J. Coffee, Taylor Holmes, Edna Sherry, Mike Connors, Lewis MartinBess Flowers, Gloria Grahame, Bruce Bennett, Virginia Huston, Estelle Etterre, Robert Smith, Jack Palance, David Miller, Joan Crawford, Selmer Jackson, Harold Miller, Lenore J. Coffee, Taylor Holmes, Edna Sherry, Mike Connors, Lewis Martin   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 3.2 Ounces', 'Director': 'David Miller', 'Media Format': 'NTSC, Multiple Formats, Black & White', 'Run time': '1 hour and 50 minutes', 'Release date': 'September 2, 2003', 'Actors': 'Joan Crawford, Jack Palance, Gloria Grahame, Bruce Bennett, Virginia Huston', 'Studio': 'Kino Video', 'Writers': 'Edna Sherry, Lenore J. Coffee, Robert Smith', 'Number of discs': '1'}\nStars that I always enjoy watching, Joan Crawford, Gloria Grahame...flawless.  I could watch this film every week.  Love the location shots.  Great camera work, authentic locations.  Good story...a middle-aged woman who, although extremely bright, is completely deceived by Jack Palance's character...he is, after all, an actor.  Love Gloria Grahame...but I would watch anything she was in.  The DVD sound is inferior.  But I am grateful...I never see this film on TV...cannot understand why.  Have not seen this film since it came out and I was a very, young girl.  Glad to have it. Took a star off because of the quality of the DVD.\n5 Star Film, inferior DVD\n{'Subtitles': ['None available'], 'Directors': ['Chris Valentini'], 'Producers': ['Outpost Entertainment', 'Jodi Flynn', 'Brent Montgomery', 'Cynthia Bruck'], 'Starring': ['Chip Bolcik'], 'Studio': ['PBS']}\ninteresting, good commentators, some new information for me, especially re: his release and death\ngood commentators, some new information for me\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Sturges'], 'Producers': ['Niven Busch', 'Eddie Donahoe'], 'Starring': ['Lew Ayres', 'Teresa Wright', 'Victor Jory']}\nTerrible print...watched because I like Teresa Wright.  Both actors do a fine job, but the print is so bad it is distracting...fell asleep watching, will not re-watch.  Plot OK, not exciting.\nTerrible print.\n{'Content advisory': ['Alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Brahm'], 'Producers': ['Hunt Stromberg'], 'Starring': ['Anne Baxter', 'Ralph Bellamy', 'Aline MacMahon'], 'Studio': ['The Film Detective']}\nI just love films from this period...I am a sucker for them.  Everyone turns in a good performance; Anne Baxter dominates the screen; she is so watchable.  Watching these old movies has made me familiar with all the players/cast members.<br /><br />Had the privilege of seeing Ruth Warrick in person many years ago...she was already maturing.  She did a reading of &#34;Love Letters&#34;...I think that was the name.  She was the most beautifully groomed woman I have every seen, and I surmised she was very serious about acting.  Should also be remembered for Citizen Kane.<br /><br />This movie is entertaining, I am so glad it is available on Amazon Prime.  Love the sets with the period furniture.  The older ways of doing things: dressmakers, etc.  Have already watched it more than once.\nVintage Entertainment\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Tim Blake Nelson', 'Mike Barker', 'Neasa Hardiman', 'Minkie Spiro', 'Wash Westmoreland'], 'Producers': ['Antonia Elli', 'Christina Ricci', 'Christine Vachon', 'Dawn Prestwich', 'Ian Deithman Kristin', 'Kathy Ciric', 'Lydia Woodward', 'Mike Barker', 'Minkie Spiro', 'Neasa Hardiman', 'Nicole Yorkin', 'Pamela Koffler', 'Rusk Robinson', 'Theresa Anne Fowler', 'Tim Blake Nelson', 'Wash Westmoreland'], 'Starring': ['Christina Ricci', 'David Hoflin'], 'Studio': ['Amazon Studios']}\nI am hooked.  No need to be a fan of Fitzgerald (although I am) this series is addictive  Cannot wait to go from one episode to the next.  Love everything, acting, screenplay, costumes.  It is a treat, and available on Amazon Prime.  Don't know when this series ends, hope it goes on and on and on; can't get enough.\nAddictive\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Baz Luhrmann'], 'Producers': ['Baz Luhrmann', 'Catherine Martin', 'Douglas Wick', 'Lucy Fisher', 'Catherine Knapman'], 'Starring': ['Leonardo DiCaprio', 'Tobey Maguire', 'Carey Mulligan'], 'Studio': ['Warner Bros.']}\nGood acting (particular Tom<br /><br />]''''''''''<br /><br />Good acting by everyone...(the actor who plays Tom Buchanan is a stand out), great photography, sound track with modern music just fine, but it did not grab me.  Something missing...could not see the pathos of the situation as I had in other versions.  Too much &#34;in your face entertainment&#34; with the jazz age chorus girls.  The deeper meaning of the story was lost, for me.  &#34;Nick&#34; does a good job yet seems somewhat miscast.  For me, a miss.  One of my favorite books, one of my favorite authors.  His prose, beyond compare.\nDisappointed\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Andre de Toth'], 'Producers': ['Samuel Bischoff'], 'Starring': ['Dick Powell', 'Jane Wyatt', 'Lizabeth Scott'], 'Studio': ['Synergy Ent']}\nVery good film noir, everyone gives a good performance.  Raymond Burr is particularly creepy.  All others are strong performances.  Lizabeth Scott looks lovely, good acting, plausible story line, plot.  Watched several times; a favorite.  A must-see for film noir fans and fans of black and white films from the forties.  Highly recommend.\nWorth your time\nThe Great Gatsby [DVD]\nMira Sorvino  (Actor),     Toby Stephens  (Actor),     Robert Markowitz  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Considered by many to be the greatest American romantic novel. The Great Gatsby is set in the volatile jazz age of the 1920s. It is the story of Jay Gatsby, a poor boy whose love for rich golden girl Daisy Buchanan is the catalyst that leads to his rise, and ultimate demise, in the society whose respect he craves.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Toby Stephens, Mira Sorvino, Paul Rudd, Martin Donovan, Robert Markowitz', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Audio Description': 'English', 'Item model number': '25327583', 'Director': 'Robert Markowitz', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'July 17, 2012', 'Actors': 'Mira Sorvino, Toby Stephens, Paul Rudd, Martin Donovan', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLiked better than I did when it first came out...however, do not understand the casting of Toby Stephens...ranges from an understated performance to an almost not present performance.  Not my favorite Nick, but better than I had anticipated.  Strong Jordan.  But this is not a memorable production even though everyone is trying...to me it is disappointing.  My DVD defective...pauses and stops, excellent seller ...replaced immediately but still defective...just better than the first one.\nSomewhat disappointing\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bobby Farrelly', 'Peter Farrelly'], 'Producers': ['John Davis', 'Marc S. Fischer', 'Joe Rosenberg', 'Ted Field', 'Bradley Thomas'], 'Starring': ['Ben Stiller', 'Michelle Monaghan', 'Malin Akerman'], 'Studio': ['Paramount Pictures']}\nTorn between one star and 1-1/2 stars...had to fast forward to the end because I couldn't  stand watching anymore.  The 1972 version of this script is so outstanding, and this is such a bust.  Silly, inane, pointless, completely disappointing.  The role of Lila is completely miscast...the actress tries hard to be disagreeable but she is far too attractive.  Jeannie Berlin (in the original) is very attractive, however, she manages to make  her character rise above physicality...acting, direction, I don't know.  In this film the entire point of the story is lost...it should not be just  about a hasty marriage of two people who are not a match, but a cultural commentary.  That is not addressed in this film.  Don't watch unless you have seen or plan to see the original 1972 version .  It is well photographed.\nWhat a waste\nSUSPENSE\nBarry Sullivan  (Actor),     Albert Dekker  (Actor),     Frank Tuttle  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Let other movie ice queens skate into happily-ever-after. Belita straps on her blades for the noir-on-ice thriller Suspense, a torrid tale of an ice-show star who commits adultery for the man she loves -- and of the man who commits murder for her. Frank Tuttle (This Gun for Hire, The Glass Key) directs; Barry Sullivan co-stars. Belita's career was exceptional, even by Hollywood standards. A 12-year-old sensation at the 1936 Winter Olympics, the British-born beauty made several films in the 1940s that showcased her dazzling skating skills. But her artistry was not limited to the rink. Also an accomplished ballerina, she worked with Gene Kelly in 1956's Invitation to the Dance.\"]\n{'Brand': 'WARNER BROS', 'Number of Items': '1', 'Unit Count': '1.00 1', 'Coverage': 'Full', 'Age Range (Description)': 'Adult', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Frank Tuttle', 'Media Format': 'Full Screen, Black & White, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'December 2, 2009', 'Actors': 'Barry Sullivan, Albert Dekker, Belita, Eugene Pallette, Bonita Granville', 'Studio': 'MONOGR', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat a treat for me.  I love Barry Sullivan and I love Belita.  I also love ice skating.  The skating in this film is beautifully choreographed, gorgeous costumes,  Belita’s skating is amazing.  I have heard that she really didn’t like skating.  Well you can be good at something you don’t like , and not good at something you do like... unfortunate fact of life.<br /><br />The complaints about this film are that it is predictable , lacks originality, and that it is not a good script.  I think the skating adds originality.  I think the script is as good as other films of this genre.  Most importantly, I found it entertaining and highly recommend it.\nThoroughly enjoyable\nHouse of Strangers\nEdward G. Robinson  (Actor),     Susan Hayward  (Actor),     Joseph L. Mankiewicz  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['An Italian New York banker has a son who is loyal and three who are not. Directed by Joseph L. Mankiewicz.']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Black & White, NTSC, Full Screen', 'Contributor': 'Hope Emerson, Esther Minciotti, Philip Yordan, Edward G. Robinson, Paul Valentine, Efrem Zimbalist Jr., Susan Hayward, Jerome Weidman, Debra Paget, Luther Adler, Richard Conte, Diana Douglas, Tito Vuolo, Fred Aldrich, Joseph L. MankiewiczHope Emerson, Esther Minciotti, Philip Yordan, Edward G. Robinson, Paul Valentine, Efrem Zimbalist Jr., Susan Hayward, Jerome Weidman, Debra Paget, Luther Adler, Richard Conte, Diana Douglas, Tito Vuolo, Fred Aldrich, Joseph L. Mankiewicz   See more', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 1.0), Unqualified', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 0.01 Ounces', 'Director': 'Joseph L. Mankiewicz', 'Media Format': 'Multiple Formats, Black & White, NTSC, Full Screen', 'Run time': '1 hour and 41 minutes', 'Release date': 'June 6, 2006', 'Actors': 'Edward G. Robinson, Susan Hayward, Richard Conte, Luther Adler, Paul Valentine', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Jerome Weidman, Joseph L. Mankiewicz, Philip Yordan', 'Number of discs': '1'}\nOne of my favorite films from that time.  Love the cast, the director.  There are a few skips in the disc but that seems to happen with many of the discs I purchase.  However, I am keeping it.  Great commentary included.\nGlad I purchased",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences**: The user has a strong appreciation for classic films, particularly dramas, and has shown interest in contemporary adaptations that respect vintage storytelling. Their latest engagement highlights a fondness for films featuring notable casts and artistic direction, affirming their nuanced taste in both well-known and lesser-known works.\n\n- **Viewing Expectations**: High production values and detailed character development are paramount for this user. They appreciate well-choreographed sequences and performances that enhance narrative integrity, remaining discerning about casting authenticity and character dynamics.\n\n- **Critical Perspective**: The user evaluates both classic and contemporary films with an emphasis on narrative integrity and performance quality. They are particularly engaged in how historical context and individual artistry shape the viewing experience, consistently analyzing unique storytelling elements.\n\n- **Experience Over Popularity**: While they value lesser-known classics, the user also seeks out unique interpretations that enrich original narratives, as indicated by their recent interactions celebrating cast and directorial talent.\n\n- **Engagement with Film and TV History**: Their deep knowledge of cinema history greatly informs their critiques, fostering a connection to the artistry of performances and thematic movements within their choices.\n\nIn summary, this user is a discerning film enthusiast who values narrative excellence, blending classic and innovative elements to enhance their cinematic experience.",
  "metrics": {
    "rouge1_f": 0.0554735910298023,
    "rouge2_f": 0.00354295837023915,
    "rougeL_f": 0.032457952198288585,
    "meteor": 0.015015364559083711,
    "bleu1": 1.2697475231874924e-08,
    "bleu2": 3.983401480244304e-09,
    "bleu3": 5.838836781022529e-10,
    "bleu4": 2.237608525989572e-10,
    "bertscore_precision": 0.3346903324127197,
    "bertscore_recall": 0.4811341166496277,
    "bertscore_f1": 0.3947685956954956
  }
}