{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/10/19\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Owen Morris', 'Robert Chetwyn', 'Martyn Friend', 'Ronald Wilson', 'Ken Hannam', 'Christopher Hodson', 'Robert Tronson'], 'Producers': ['Ken Riddington', 'Jonathan Alwyn'], 'Studio': ['BBC']}\nReview Text: I read all the Allingham books & stories many years ago, and enjoyed them greatly.  So I was quite pleased to find these televised versions ... at least, until I started watching them.  They are abysmal.  The director and the actors seem to have completely missed the spirit of the stories, the acting is wooden, and the whole thing comes across as rather lame.<br /><br />If you're a Campion fan, give this a miss.  If you're not a Campion fan, give it a wide berth.\nReview Title: poorly done\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Rio Bravo\nJohn Wayne  (Actor),     Dean Martin  (Actor),     Howard Hawks  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Rio Bravo (Widescreen) (Sous-titres français)']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Howard Hawks', 'Media Format': 'Anamorphic, Color, DVD, Subtitled, Widescreen, Closed-captioned, NTSC', 'Run time': '2 hours and 21 minutes', 'Release date': 'May 8, 2001', 'Actors': 'John Wayne, Dean Martin, Ricky Nelson, Angie Dickinson, Walter Brennan', 'Subtitles': 'English, Spanish, French, Portuguese', 'Language': 'English (Dolby Digital 2.0), Unqualified (Dolby Digital 2.0 Mono)', 'Studio': 'Warner Home Video', 'Writers': 'B.H. McCampbell, Jules Furthman, Leigh Brackett', 'Number of discs': '1'}\nI first saw this movie in the early 60s, when I was a young kid, and it stayed in my mind.  It's that good.  I recently saw it with my 11 year old son, and he just loved it; this boy normally won't watch westerns.  It's that good.<br /><br />John Wayne, Dean Martin, Walter Brennan all do a great job.  Even Rick Nelson, not someone you'd expect to see in a western, does a solid job.  Angie Dickinson is very likable.  It all hangs together, and doesn't work too hard at it; just goes down nice and easy.  (Ok, I mixed my metaphors, but you get the drift.)<br /><br />What can I say, I love this movie!  If you like the classic ones, buy it, it's worth every penny.\nif you like the classic westerns, this is a must-see, must-own\nDistrict B13/District 13: Ultimatum 2-Pack\nCyril Raffaelli  (Actor),     David Belle  (Actor),     Patrick Alessandrin  (Director),     Pierre Morel  (Director)    &                   1                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Includes: District B13 Paris, 2010. An isolation wall surrounds the ghetto cities of District B13. Within these walls, without effective law enforcement, gang rule is absolute. Damien is a member of an elite police squadron, highly trained in martial arts. He goes undercover to infiltrate a gang in order to defuse a neutron bomb and save District B13 from annihilation. Damien recruits the help of a criminal named Leito - whose only goal is to save his sister from the clutches of the same gang. District 13: Ultimatum Two years have passed since elite police officer Damien Tomasso (Cyril Raffaelli) teamed up with reformed vigilante Leito (David Belle) to save the notorious District 13, a racially charged ghetto populated by violent drug dealing gangs and vicious killers. Despite government promises to maintain order, the state of the district has deteriorated and is causing civil unrest. A group of corrupt cops and elected officials conspire to cash in on the redevelopment of the district by proposing it's destruction under the nuclear air strike. Damien and Leito must join forces again, using their martial arts and unique physical skills, to bring peace to the neighborhood by any means necessary.\"]\n{'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': 'MGNO10299BR', 'Director': 'Patrick Alessandrin, Pierre Morel', 'Media Format': 'Blu-ray', 'Run time': '3 hours and 5 minutes', 'Release date': 'April 27, 2010', 'Actors': 'Cyril Raffaelli, David Belle, Philippe Torreton, Daniel Duval, Elodie Yung', 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Studio': 'Magnolia Home Ent', 'Country of Origin': 'USA', 'Number of discs': '2'}\nYes, I do mean that: these are among the best action movies ever made -- but I'll qualify by adding \"which involve humans doing athletic things\", such as martial arts movies.  (I like the other kinds too, BTW.)<br /><br />But if you enjoy watching incredibly gifted athletes doing great stunts done in a very believable way, and don't mind preposterous plots, then these movies might tickle your fancy.  Just being able to watch David Belle (said to be the founder of parkour/parcour) is worth the price in my opinion.<br /><br />So remember, don't expect any Profound Commentary on the Human Condition (thank goodness).  Don't get too hung up on the silliness or the stereotypes, that's part of the fun.  Just relax and enjoy great escapist fun with a good companion or two.\nsilly plots, but among the best action movies ever made\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Guy Ferland', 'Christine Moore', 'John Polson', 'Ron Fortunato', 'Seith Mann', 'Jerry Levine', 'Larry Teng', 'Lucy Liu', 'Aaron Lipstadt', 'Andrew Bernstein'], 'Studio': ['CBS']}\nIf you're a fan of the Sherlock Holmes stories, and don't object to a well-done transformation of the theme, then you are likely to really enjoy this series.  The acting is superb, the stories are compelling, and the whole thing just reeks of excellence and attention to detail.<br /><br />I've been a fan of the Holmes stories since I was a little boy, having read all of them multiple times, and have watched the various film versions over the years.  I've enjoyed some of them:  I'm not a big fan of the Basil Rathbone versions, and I quite disliked the Guy Ritchie/Robert Downey versions. I think that the recent re-imagining done in this series and in the British series (by Gatiss/Moffat, with Benedict Cumberbatch & Martin Freeman) are excellent, and hugely enjoyable if you're not offended by the variation from the canonical texts.\nVery good revised version of Holmes & Watson\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Attenborough', 'Richard'], 'Producers': ['Richard Attenborough'], 'Starring': ['Ben Kingsley', 'Candice Bergen', 'Edward Fox'], 'Studio': ['Classics']}\nGandhi was human, and had his weaknesses.  But you wouldn't know it from this movie, this is about Gandhi the soon-to-revered, and presents him as someone just barely short of being a god.  I would have preferred him presented as a great man, with all his compassion and leadership and steadfastness, but also with some human weaknesses.<br /><br />Further, although I don't want to go into the history in a brief review (there are many authoritative sources for those who might be interested), but the portrayal of events, and of the other important players, is a bit too slick and shallow.  It does great disservice to a worldwide audience that is unlikely to hear another version of the story.\nA bit too much worship.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Owen Morris', 'Robert Chetwyn', 'Martyn Friend', 'Ronald Wilson', 'Ken Hannam', 'Christopher Hodson', 'Robert Tronson'], 'Producers': ['Ken Riddington', 'Jonathan Alwyn'], 'Studio': ['BBC']}\nI read all the Allingham books & stories many years ago, and enjoyed them greatly.  So I was quite pleased to find these televised versions ... at least, until I started watching them.  They are abysmal.  The director and the actors seem to have completely missed the spirit of the stories, the acting is wooden, and the whole thing comes across as rather lame.<br /><br />If you're a Campion fan, give this a miss.  If you're not a Campion fan, give it a wide berth.\npoorly done",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference**: The user maintains a strong affinity for classic westerns and high-energy action films, particularly martial arts and parkour features, while also cultivating an interest in adaptations and reimaginings of classic literature, emphasizing the crime and detective genres.\n\n- **Influence of Nostalgia**: Values films that evoke childhood memories, seeking titles enjoyable for both adults and children, now extending to adaptations of beloved literary works.\n\n- **Recommendation Tendencies**: Likely to recommend highly rated titles, regardless of genre, demonstrating a broadened focus that includes intelligently crafted series that reinterpret classic narratives.\n\n- **Rating Behavior**: Recent interactions reveal a growing critical engagement, as evidenced by a sharp decline in rating for a well-loved literary adaptation, indicating a discerning view towards productions that fail to capture the original spirit, particularly in casting and direction.\n\n- **Family Engagement**: Continues to prioritize films and series that resonate across generations for an inclusive viewing experience.\n\n- **Review Style**: Appreciates rich storytelling, character development, and production details, while enjoying escapism, even in lighter narratives. However, the user is now applying a more critical lens, seeking authentic portrayals in adaptations of literary works and expressing disappointment when these expectations aren’t met.\n\nOverall, this user demonstrates an evolving engagement with cinema, balancing nostalgia with a discerning critique of adaptations, particularly those based on classic literature, reflecting a deepening appreciation for nuanced storytelling.",
  "metrics": {
    "rouge1_f": 0.13258897418004187,
    "rouge2_f": 0.008385744234800839,
    "rougeL_f": 0.061409630146545706,
    "meteor": 0.0458501922500274,
    "bleu1": 0.0028250882615963604,
    "bleu2": 0.0007306826169718245,
    "bleu3": 0.0002436454476755667,
    "bleu4": 7.918570944112471e-05,
    "bertscore_precision": 0.3574386239051819,
    "bertscore_recall": 0.46492648124694824,
    "bertscore_f1": 0.4041579067707062
  }
}