{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Glass spray bottle-16 ounce empty bottle ounce refillable container 2 packs, suitable for essential oils, cleaning products, aromatherapy, water mist plants with mist and air flow settings\nReview Date: 2020/09/17\nStore: DS DOODLE SABBATH\nAverage Rating: 4.5\nProduct Details: {'Brand': 'DS DOODLE SABBATH', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Item Dimensions LxWxH': '2.76 x 2.76 x 8.27 inches', 'Special Feature': 'Adjustable Nozzle', 'Product Dimensions': '2.76 x 2.76 x 8.27 inches; 1.4 Pounds', 'UPC': '619011520959'}\nReview Text: This box comes with 2 blue glass spray bottles that hold 16 fluid ounces each. The spray tops have an option to adjust the type of spray and you can also use a regular bottle top on these. This includes label stickers and plastic funnels so you can pour in what you wish to and label the contents with a liquid chalk marker. The bottles work as intended and this is a reasonable price for this type of glass bottle set.\nReview Title: Pair of blue glass spray bottles with accessories\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Charcoal Teeth Whitening Powder,from Organic Coconut Shell and Food Grade Formula - All Natural Freshmint Flavor Tooth Whitener 30 g by Gemmaz\nNUTRILUSH\n['How To Use:', '1. Wet toothbrush.2. Dip brush into charcoal powder.3. Brush gently for 1-2 minutes, paying special attention to stained teeth.4. Rinse mouth well with water.', 'Cautions:', '-Charcoal can stain grout and fabrics. Protect counters, floors and clothing before using.- If you have crowns, caps or porcelain veneers, it’s possible that activated charcoal may stain them.- Keep out of reach of children.- Avoid contact with eyes. - Stop use if irritation Occurs.', 'Storage Conditions:', '(1)It should be stored in cool and dryplace. Pleaseavoid direct sunlight and do not expose to any high temperature.(2)Our teeth whitening powder can remove most of teeth stains from coffee, wine, tea and tobacco. But this product is not bleach. If your enamel is naturally discolored, this product will not help whiten, but is still an excellent natural daily toothpaste alternative!', 'Ingredients:', 'Activated Charcoal from Coconut, Calcium Carbonate, Sorbitol, Sodium Bicarbonate, Cellulose Microcrystalline, DendrobiumOfficinale Kimura et Migo, Resveratrol, Natural Freshmint Flavor, Stevia']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.5 x 5.5 x 1.1 inches; 4.8 Ounces', 'Manufacturer': 'NUTRILUSH'}\nThese multi-colored, multi-use clips can be used for a variety of projects. This resealable bag contains 100 of the clips. The spring mechanism on the clips is of adequate strength for use in many arts and crafts applications. Having the mix of colors is useful. These are both attractive and practical, and this is a good value for this number of clips. I was provided a free sample of these for my honest, unbiased review.\nGreat bag of multi-colored wonder clips for crafts\nManicure and Pedicure Nail Clipper from POWERGROOMING - Powerful Trimmer for Thick and Thin Finger Nails and Toe Nails - Included Nail File and\"Catcher\" for Easy Cleanup (1 Pack)\nPOWERGROOMING\n{'Brand': 'POWERGROOMING', 'Material': 'Stainless Steel', 'Blade Edge': 'Straight', 'Blade Material': 'Stainless Steel', 'Target Audience': 'Women, Men', 'Package Dimensions': '3.8 x 1.3 x 1 inches; 3.21 Ounces', 'UPC': '653233212735', 'Manufacturer': 'POWERGROOMING'}\nThis is a basic nail clipping set with a clipper and file. The clipper has a nice look and a smooth cut, with a special material on its edge (feels like silicone) that makes it easy and comfortable to grip. There is a storage case with a snap to close it. If you need these simple nail clipping tools this set is fine, though a bit expensive.\nA nail clipper and file with storage case\nNail Clipper Set, 19 In 1 Manicure Pedicure Ear Picking Tool Set, Tools For Nail, Cutter Kits, Includes Cuticle Remover with Portable, Nail Tools with Luxurious Travel Case\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.22 x 3.31 x 0.91 inches; 9.38 Ounces', 'UPC': '759675599820'}\nThis is a set of manicure and pedicure tools that includes pretty much all the clippers and instruments you would need to use. These function well and they also have an attractive design that will appeal especially to girls. The case is nice and it matches the tools. This would make a nice gift.\nAn attractive, flashy manicure/pedicure tool set\nEye Mask Natural Mulberry 100% Silk Super Smooth Sleep Eye Mask for Eye Mask for Puffy Eyes for Dry Eyes for Dark Circles Sleeping Travel While Camping Multi Purpose Men and Women Eye Mask\n{'Package Dimensions': '7.3 x 1.6 x 0.4 inches; 0.81 Ounces'}\nThis eye mask fits comfortably and feels smooth on your face. It functions as desired for blocking out light and helping you relax and sleep. It is not substantially different than other silk eye masks I have tried, while it is not the least expensive option and it doesn't come with any box or bag to store it in.\nA simple smooth silk eye mask\nWig Head Wig Stands (Purple)\nBAIHONG\n{'Manufacturer': 'XUCHANG BAIHONG HAIR PRODUCTS CO., LTD.'}\nThis package includes a pair of scalp massaging brushes along with a stretchable shower cap. The brushes have points with silicone tips so you can safely stimulate your scalp as you wash your head and hair. They feel OK, though not as good as manually massaging your scalp since the brush doesn't have the dexterity of fingers. These are nice to have although I don't expect to rely on them too much. For what is included in this package it seems reasonably priced.\nSilicone tipped scalp massage brushes along with shower hair cap\nAUGNORYE 13 Pcs Hair Cutting Scissors Kit, Professional Hair Barber Scissors Kit with Thinning Shears, Home Hair Shears for Women, Men, Kids\nAUGNORYE\n{'Brand': 'AUGNORYE', 'Included Components': 'Scissors', 'Unit Count': '1.00 Count', 'Blade Material': 'Stainless Steel'}\nThis barber kit includes scissors, combs, and other items used by barbers. This all fits in a carry bag and would be fine for any amateur or professional hair stylist. The items are good quality and are affordably priced when you purchase them all together in this kit.\nEverything you'd need for manual hair cutting\nEmpty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nThis package comes with two amber glass bottles that include spray tops. The bottles are wrapped with bubble wrap so they don't crack during transit. The labels are a black color suitable for writing on with liquid chalk markers - so you would need that type of marker, which isn't included with the labels here. These bottles function as intended and are useful if you wish to avoid plastic.\nAmber glass bottles with spray tops and labels\nPretty Frank Natural Deodorant Jar- No Aluminum Deodorant for Women, Men, Teens, & Kids – Paraben Sulfate Free Cream Deodorant with Shea Butter, Coconut Oil, Vitamin E & Baking Soda (Jasmine)\nPRETTY FRANK\n{'Brand': 'PRETTY FRANK', 'Item Form': 'Cream', 'Scent': 'Jasmine, Coconut', 'Material Feature': 'Natural', 'Number of Items': '1', 'Package Dimensions': '3.42 x 2.79 x 2.59 inches; 5.61 Ounces'}\nThis deodorant comes in a glass jar and is made with simple, natural ingredients that are good for your skin and provide pleasant aromas. Baking soda, coconut oil, shea butter, and vitamin E are included along with some natural essential oils that add a pleasant aroma. This company offers different scent options - this one is rather flowery, with scents like ylang ylang and gardenia. This is certainly somewhat expensive for a deodorant but it is worth paying extra to get something natural with organic ingredients that won't irritate your skin or harm your health. Unlike some products that just spray on scents this item uses baking soda to help absorb odors too. This is something I would definitely suggest if you want a natural deodorant and don't mind applying something that is in a jar rather than a roll-on or spray container.\nGreat natural deodorant with baking soda and essential oils\nGlass spray bottle-16 ounce empty bottle ounce refillable container 2 packs, suitable for essential oils, cleaning products, aromatherapy, water mist plants with mist and air flow settings\nDS DOODLE SABBATH\n{'Brand': 'DS DOODLE SABBATH', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Item Dimensions LxWxH': '2.76 x 2.76 x 8.27 inches', 'Special Feature': 'Adjustable Nozzle', 'Product Dimensions': '2.76 x 2.76 x 8.27 inches; 1.4 Pounds', 'UPC': '619011520959'}\nThis box comes with 2 blue glass spray bottles that hold 16 fluid ounces each. The spray tops have an option to adjust the type of spray and you can also use a regular bottle top on these. This includes label stickers and plastic funnels so you can pour in what you wish to and label the contents with a liquid chalk marker. The bottles work as intended and this is a reasonable price for this type of glass bottle set.\nPair of blue glass spray bottles with accessories",
  "profile": "**User Summary:**\n\n- **Health-Conscious:** Prioritizes natural and organic products that enhance well-being, focusing on items devoid of harmful additives while promoting eco-friendliness and sustainable practices.\n- **Aesthetic & Practical:** Values stylish and functional items, particularly in grooming and personal care, appreciating designs that are both visually appealing and easy to use.\n- **Quality and Value-Oriented:** Seeks a balance between cost and performance, favoring effective mid-range products that offer aesthetic charm and are worth the investment.\n- **Detail-Oriented:** Attentive to product instructions and safety guidelines, the user seeks items that maximize functionality while supporting sustainable practices.\n- **Positive User Experience:** Maintains a critical approach to assessments, reflected in an average rating of around 4.3 stars, emphasizing satisfactory performance and thoughtful design.\n- **Varied Interests:** Engages with a diverse array of health-focused and personal care items, particularly those versatile enough to meet multiple needs.\n- **Gift-Considerate:** Looks for functional and aesthetically pleasing products that serve as thoughtful gifts.\n- **Recent Trends:** Reinforced commitment to stylish, practical, and eco-friendly solutions in personal care, with an appreciation for organization and a minimalist lifestyle. The user remains budget-conscious while favoring effective products made from simple, natural ingredients. Recent purchases reflect a strong affinity for reusable, adjustable, and versatile containers that align with their health-conscious, sustainable lifestyle.",
  "metrics": {
    "rouge1_f": 0.1248423707440101,
    "rouge2_f": 0.016414141414141416,
    "rougeL_f": 0.06557377049180328,
    "meteor": 0.05134911486205532,
    "bleu1": 0.0027878151236797287,
    "bleu2": 0.0010832366689215252,
    "bleu3": 0.0004885752318089467,
    "bleu4": 0.00023222573581739494,
    "bertscore_precision": 0.3843379020690918,
    "bertscore_recall": 0.5004355311393738,
    "bertscore_f1": 0.4347696900367737
  }
}