{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/09/04\nAverage Rating: 4.0\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Rush'], 'Producers': ['Marty Bowen', 'Wyck Godfrey'], 'Starring': ['Will Ferrell', 'Rebecca Hall', 'Michael Pena'], 'Studio': ['Lionsgate']}\nReview Text: Maybe it's because it spoke to me and my biggest fears, but this was a really good movie. I wish that lady across the street wasn't married.\nReview Title: but this was a really good movie. I wish that lady across the street ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "My Cousin Vinny\nJoe Pesci  (Actor),     Ralph Macchio  (Actor),     Jonathan Lynn  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"Bill and Stan are mistaken for murderers while on vacation. Bill's family sends his cousin, Vinny Gambini, to defend them in his first case as a lawyer. (1992) Running time: 120 minutes\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane SmithJonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane Smith  See more', 'Language': 'Unqualified', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.56 x 5.49 x 7.3 inches; 0.71 Ounces', 'Item model number': '2000532', 'Director': 'Jonathan Lynn', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'July 25, 2000', 'Actors': 'Joe Pesci, Ralph Macchio, Marisa Tomei, Mitchell Whitfield, Fred Gwynne', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nCame in perfect shape as described.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nVery sappy, Tessa made me watch it.\nDon't get punched in the stomach\n{'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Rush'], 'Producers': ['Marty Bowen', 'Wyck Godfrey'], 'Starring': ['Will Ferrell', 'Rebecca Hall', 'Michael Pena'], 'Studio': ['Lionsgate']}\nMaybe it's because it spoke to me and my biggest fears, but this was a really good movie. I wish that lady across the street wasn't married.\nbut this was a really good movie. I wish that lady across the street ...",
  "profile": "**User Summary:**\n\nThe user maintains a strong preference for comedy films, particularly those that blend action and legal drama elements, alongside an appreciation for classic cinema. Their recent interaction reflects a nuanced appreciation for storytelling that resonates personally, even in films that may contain more serious themes. The high ratings given indicate an expectation for well-executed productions, while their critique showcases a discerning eye for quality in terms of content and presentation.\n\nRecent engagement highlights their openness to diverse genres, evidenced by a positive review of a film that resonated on a personal level despite its dramatic undertones. This suggests that while they have a fondness for humor and nostalgia, they are also willing to explore narratives that evoke emotional connections.\n\nThe user demonstrates interest in film features such as multi-language audio, subtitles, and notable directorial efforts, which enrich their viewing experience. Their critique style remains balanced, focusing on the film's entertainment value and emotional impact, with a flair for providing constructive feedback.\n\nOverall, this profile suggests a discerning viewer who is committed to exploring a variety of cinematic narratives while prioritizing well-reviewed, character-driven comedies that blend humor with relatable storytelling and quality execution.",
  "metrics": {
    "rouge1_f": 0.14785992217898833,
    "rouge2_f": 0.0,
    "rougeL_f": 0.07782101167315175,
    "meteor": 0.0548411497730711,
    "bleu1": 0.04236281188371309,
    "bleu2": 0.00202415253816606,
    "bleu3": 0.0007356234731974718,
    "bleu4": 0.0004439751419927846,
    "bertscore_precision": 0.30453842878341675,
    "bertscore_recall": 0.3635312616825104,
    "bertscore_f1": 0.33143019676208496
  }
}