{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/09/15\nAverage Rating: 3.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michal Siewierski'], 'Producers': ['Peter Eastwood', 'Nicky Taylor', 'Gwyn Whittaker'], 'Starring': ['John Mackey', 'Rich Roll', 'Rip Esselstyn'], 'Studio': ['Gravitas Ventures']}\nReview Text: I'm going to wait for the English speaking version.\nReview Title: Not sure\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "My Cousin Vinny\nJoe Pesci  (Actor),     Ralph Macchio  (Actor),     Jonathan Lynn  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"Bill and Stan are mistaken for murderers while on vacation. Bill's family sends his cousin, Vinny Gambini, to defend them in his first case as a lawyer. (1992) Running time: 120 minutes\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane SmithJonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane Smith  See more', 'Language': 'Unqualified', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.56 x 5.49 x 7.3 inches; 0.71 Ounces', 'Item model number': '2000532', 'Director': 'Jonathan Lynn', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'July 25, 2000', 'Actors': 'Joe Pesci, Ralph Macchio, Marisa Tomei, Mitchell Whitfield, Fred Gwynne', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nCame in perfect shape as described.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nVery sappy, Tessa made me watch it.\nDon't get punched in the stomach\n{'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Rush'], 'Producers': ['Marty Bowen', 'Wyck Godfrey'], 'Starring': ['Will Ferrell', 'Rebecca Hall', 'Michael Pena'], 'Studio': ['Lionsgate']}\nMaybe it's because it spoke to me and my biggest fears, but this was a really good movie. I wish that lady across the street wasn't married.\nbut this was a really good movie. I wish that lady across the street ...\nDiner (DVD)\nSteve Guttenberg  (Actor),     Daniel Stern  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Diner (DVD)', \"The film that launched successful careers for Kevin Bacon, Ellen Barkin, Paul Reiser, Mickey Rourke and more! It's a lively, poignant tale of friends trying to recapture their lost innocence in 1959 Baltimore.\", ']]>']\n{'Genre': 'Drama, Comedy', 'Format': 'Closed-captioned, Multiple Formats, Color, Letterboxed, NTSC, Subtitled, Widescreen', 'Contributor': 'Ellen Barkin, Steve Guttenberg, Mickey Rourke, Paul Reiser, Tim Daly, Barry Levinson, Jerry Weintraub, Mark Johnson, Kevin Bacon, Daniel SternEllen Barkin, Steve Guttenberg, Mickey Rourke, Paul Reiser, Tim Daly, Barry Levinson, Jerry Weintraub, Mark Johnson, Kevin Bacon, Daniel Stern   See more', 'Initial release date': '2004-02-03', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.45 x 5.61 x 7.54 inches; 2.08 Ounces', 'Item model number': 'MFR012569507722#VG', 'Director': 'Barry Levinson', 'Media Format': 'Closed-captioned, Multiple Formats, Color, Letterboxed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'February 3, 2004', 'Actors': 'Steve Guttenberg, Daniel Stern, Mickey Rourke, Kevin Bacon, Tim Daly', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Jerry Weintraub, Mark Johnson', 'Studio': 'Studio Distribution Services', 'Writers': 'Barry Levinson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI got this movie to watch with my mom because she grew up on the East Coast around this time. It's a sweet movie with a little R ish material, not too much, but all in all a nice escape, and a movie that stands up to rewatching.\nIt's a sweet movie with a little R ish material\n{'Subtitles': ['None available'], 'Directors': ['Henry Singer'], 'Producers': ['Henry Singer'], 'Studio': ['XiveTV']}\nThey should retitle this one &#34;The Most Narcissistic Photographer in the History of Photographs&#34;. This guy tried to make the entire story about him, a guy who pushed a button on a machine. Line after line of how he was Picasso, how his photograph compared to Pulitzer Prize winning photos, every last thing the guy said was about himself. I defy you to find a sentence without the word &#34;I&#34; or &#34;me&#34; in it.\nThe Most Narcissistic Photographer in the History of Photographs\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephanie Kaim'], 'Producers': ['Irène Challand', 'Claire Colart', 'Sandrine Delegiewicz', 'Stéphane Haumant', 'Gaspard Lamunière', 'Daniel Leconte', 'Andreas Lemos', 'Émilie Raffoul', 'Olivier Stroh'], 'Studio': ['MagellanTV']}\nOut after 40 seconds. I at first couldn't realize if the video was warped, or the guy had a speech impediment. No way could I make it through 90 minutes of that.\nOut after 40 seconds. I at first couldn't realize ...\n{'Content advisory': ['Violence', 'frightening scenes', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['None'], 'Starring': ['Ruth Blackwell'], 'Studio': ['Independent Documentary']}\nWater faucets running and junk scattered on the floor. That HAD to be a ghost! I now believe in ghosts! This was a lower budget Blair Witch Project that was hoping a large percentage of the people were too young to remember The Blair Witch Project. The only reason it barely made it to three stars is that it's a cute couple. And they did get me to watch the whole thing. This was very terrible.\nThis was very terrible.\n{'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lee Schloss'], 'Producers': ['Mike Bocchetti'], 'Starring': ['Mike Bocchetti', 'Artie Lange', 'Sal the Stockbroker']}\nThe quality of the video could be better, but the quality of Mike could not. He's got a heart of gold, and if you want to see who he is, I recommend youtubing \"Mike Bocchetti and the weather\". Crisp video quality, and Mike never has a bad word to say about anyone. His true comic talents are brought out by Artie Lange on Artie's show when he does the weather. Please watch, I've seen it so many times.\nMike is a 5 star person\n{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['CJ Wallis'], 'Producers': ['Mallory Kennedy', 'CJ Wallis'], 'Starring': ['Ted Slauson', 'Bob Barker', 'Roger Dobkowitz']}\nThe guy who does the narrating (the principle subject) has this style that doesn't seem like he'd like any kind of game show at all. But it kind of grows on you. There is a surprising amount of footage that captures all of his appearances. I thought there would be a little more scandal to it. It really should be titled The Contestant Who Knew a Fair Amount. There were some tones of stalker in him, but that helped my fascination.  And Holly didn't have to fear him because well, ya know, I mean- ya know? She knew.<br /><br />Also, at the time when he was young, he was a good looking guy, I think that's how the models kind of liked him. In his prime, it wasn't weird to ask for a kiss from Holly. It was really sad to see Bob Barker get older, because you see the pics of him when he was younger, and you just couldn't look more alive. For even someone that good looking to get old, damn, what's that say for the rest of us.<br /><br />But I highly recommend this doc for sure for sure watch it.\nA really good documentary\n{'Content advisory': ['Violence'], 'Subtitles': ['None available'], 'Directors': ['Sally Howell'], 'Producers': ['Heather Dreiling', 'Eric Schotz', 'Kathy Williamson'], 'Studio': ['MagellanTV']}\nThe narrator, who looks like the kind of guy who got beat up a lot in grammar school, is a little too alarmist, and rehashes  stuff the main authority on sugar has already talked about. This goofball says he is serious about exercise and then says who needs a gym and walks up a hill with rocks. Wow. I've lived in England, and just like the rest of English TV, this seems like, I don't know- practice television, and a practice documentary. Also what I've noticed in English documentaries, they seem to be fascinated by the narrator WALKING. It must be a luxury in the UK to walk, or it must denote thinking. Anyway, I couldn't make it all the way through.\nCouldn't make it to the end\n{'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['Paul Dechant'], 'Starring': ['Paul Dechant']}\nThe way we think about sugar is going to change; but not from this micro-mentary. I had a longer report about sugar in 5th grade. In about 300 seconds, this snippet talks about how there is sugar in food, and they made labels to know how much.<br /><br />I have changed the way I think about sugar. Also, I wish I had the last 5 minutes of my life back.\nWay too long\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Austin Meyer'], 'Producers': ['Austin Meyer'], 'Starring': ['Austin Meyer', 'Peter Braxton', 'Alex Charro'], 'Studio': ['AMC Plus Documentaries']}\nThis had me thinking the next day. Somebody told me about it, and I couldn't wait to watch it, even though I have nothing to do with patents. It's well told on a low budget and you'll find out why the budget is low. I could only slightly see the point of the other side, it was cool of Oscar Meyer to include them too, but in the balance, these patent trolls are very terrible people.\nBest Doc in a long while\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michal Siewierski'], 'Producers': ['Peter Eastwood', 'Nicky Taylor', 'Gwyn Whittaker'], 'Starring': ['John Mackey', 'Rich Roll', 'Rip Esselstyn'], 'Studio': ['Gravitas Ventures']}\nI'm going to wait for the English speaking version.\nNot sure",
  "profile": "**User Summary:**\n\nThe user demonstrates a strong preference for comedy films that blend drama and nostalgia, emphasizing personal connections and cultural experiences in storytelling. Their discerning taste reflects a passion for well-rounded narratives and deep character exploration, coupled with an aversion to self-absorbed protagonists. Recent interactions reveal an increasing intolerance for poorly executed filmmaking, placing a heightened priority on emotional engagement and narrative clarity, while still acknowledging strong performances in otherwise lacking films.\n\nA review of a recent purchase indicates a notable consideration for the availability of language options; the user expressed a desire for an English-speaking version of the content, hinting at a pragmatic approach to accessibility. Although highlighting a lower rating, the user’s expectations remain rooted in a demand for superior storytelling and production quality across formats. They appreciate well-crafted documentaries that foster thoughtful reflection, revealing a nuanced understanding of the genre.\n\nOverall, the profile portrays a sophisticated viewer dedicated to quality storytelling and character depth, seeking films that evoke warmth, tackle complex themes, and uphold rigorous execution. Their preferences further emphasize a commitment to accessible narratives through multi-language audio and subtitles, aligning with their expectation for films that resonate on multiple levels while offering relevant social commentary or cultural significance.",
  "metrics": {
    "rouge1_f": 0.0978021978021978,
    "rouge2_f": 0.009900990099009901,
    "rougeL_f": 0.05604395604395604,
    "meteor": 0.027492400125337074,
    "bleu1": 1.980214995517892e-05,
    "bleu2": 5.474059620858567e-06,
    "bleu3": 8.66509550676464e-07,
    "bleu4": 3.4512818539621803e-07,
    "bertscore_precision": 0.31239378452301025,
    "bertscore_recall": 0.4473876953125,
    "bertscore_f1": 0.36789825558662415
  }
}