{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2018/09/23\nAverage Rating: 3.2\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lee Schloss'], 'Producers': ['Mike Bocchetti'], 'Starring': ['Mike Bocchetti', 'Artie Lange', 'Sal the Stockbroker']}\nReview Text: The quality of the video could be better, but the quality of Mike could not. He's got a heart of gold, and if you want to see who he is, I recommend youtubing \"Mike Bocchetti and the weather\". Crisp video quality, and Mike never has a bad word to say about anyone. His true comic talents are brought out by Artie Lange on Artie's show when he does the weather. Please watch, I've seen it so many times.\nReview Title: Mike is a 5 star person\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "My Cousin Vinny\nJoe Pesci  (Actor),     Ralph Macchio  (Actor),     Jonathan Lynn  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"Bill and Stan are mistaken for murderers while on vacation. Bill's family sends his cousin, Vinny Gambini, to defend them in his first case as a lawyer. (1992) Running time: 120 minutes\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane SmithJonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane Smith  See more', 'Language': 'Unqualified', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.56 x 5.49 x 7.3 inches; 0.71 Ounces', 'Item model number': '2000532', 'Director': 'Jonathan Lynn', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'July 25, 2000', 'Actors': 'Joe Pesci, Ralph Macchio, Marisa Tomei, Mitchell Whitfield, Fred Gwynne', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nCame in perfect shape as described.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nVery sappy, Tessa made me watch it.\nDon't get punched in the stomach\n{'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Rush'], 'Producers': ['Marty Bowen', 'Wyck Godfrey'], 'Starring': ['Will Ferrell', 'Rebecca Hall', 'Michael Pena'], 'Studio': ['Lionsgate']}\nMaybe it's because it spoke to me and my biggest fears, but this was a really good movie. I wish that lady across the street wasn't married.\nbut this was a really good movie. I wish that lady across the street ...\nDiner (DVD)\nSteve Guttenberg  (Actor),     Daniel Stern  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Diner (DVD)', \"The film that launched successful careers for Kevin Bacon, Ellen Barkin, Paul Reiser, Mickey Rourke and more! It's a lively, poignant tale of friends trying to recapture their lost innocence in 1959 Baltimore.\", ']]>']\n{'Genre': 'Drama, Comedy', 'Format': 'Closed-captioned, Multiple Formats, Color, Letterboxed, NTSC, Subtitled, Widescreen', 'Contributor': 'Ellen Barkin, Steve Guttenberg, Mickey Rourke, Paul Reiser, Tim Daly, Barry Levinson, Jerry Weintraub, Mark Johnson, Kevin Bacon, Daniel SternEllen Barkin, Steve Guttenberg, Mickey Rourke, Paul Reiser, Tim Daly, Barry Levinson, Jerry Weintraub, Mark Johnson, Kevin Bacon, Daniel Stern   See more', 'Initial release date': '2004-02-03', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.45 x 5.61 x 7.54 inches; 2.08 Ounces', 'Item model number': 'MFR012569507722#VG', 'Director': 'Barry Levinson', 'Media Format': 'Closed-captioned, Multiple Formats, Color, Letterboxed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'February 3, 2004', 'Actors': 'Steve Guttenberg, Daniel Stern, Mickey Rourke, Kevin Bacon, Tim Daly', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Jerry Weintraub, Mark Johnson', 'Studio': 'Studio Distribution Services', 'Writers': 'Barry Levinson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI got this movie to watch with my mom because she grew up on the East Coast around this time. It's a sweet movie with a little R ish material, not too much, but all in all a nice escape, and a movie that stands up to rewatching.\nIt's a sweet movie with a little R ish material\n{'Subtitles': ['None available'], 'Directors': ['Henry Singer'], 'Producers': ['Henry Singer'], 'Studio': ['XiveTV']}\nThey should retitle this one &#34;The Most Narcissistic Photographer in the History of Photographs&#34;. This guy tried to make the entire story about him, a guy who pushed a button on a machine. Line after line of how he was Picasso, how his photograph compared to Pulitzer Prize winning photos, every last thing the guy said was about himself. I defy you to find a sentence without the word &#34;I&#34; or &#34;me&#34; in it.\nThe Most Narcissistic Photographer in the History of Photographs\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephanie Kaim'], 'Producers': ['Irène Challand', 'Claire Colart', 'Sandrine Delegiewicz', 'Stéphane Haumant', 'Gaspard Lamunière', 'Daniel Leconte', 'Andreas Lemos', 'Émilie Raffoul', 'Olivier Stroh'], 'Studio': ['MagellanTV']}\nOut after 40 seconds. I at first couldn't realize if the video was warped, or the guy had a speech impediment. No way could I make it through 90 minutes of that.\nOut after 40 seconds. I at first couldn't realize ...\n{'Content advisory': ['Violence', 'frightening scenes', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['None'], 'Starring': ['Ruth Blackwell'], 'Studio': ['Independent Documentary']}\nWater faucets running and junk scattered on the floor. That HAD to be a ghost! I now believe in ghosts! This was a lower budget Blair Witch Project that was hoping a large percentage of the people were too young to remember The Blair Witch Project. The only reason it barely made it to three stars is that it's a cute couple. And they did get me to watch the whole thing. This was very terrible.\nThis was very terrible.\n{'Content advisory': ['Alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lee Schloss'], 'Producers': ['Mike Bocchetti'], 'Starring': ['Mike Bocchetti', 'Artie Lange', 'Sal the Stockbroker']}\nThe quality of the video could be better, but the quality of Mike could not. He's got a heart of gold, and if you want to see who he is, I recommend youtubing \"Mike Bocchetti and the weather\". Crisp video quality, and Mike never has a bad word to say about anyone. His true comic talents are brought out by Artie Lange on Artie's show when he does the weather. Please watch, I've seen it so many times.\nMike is a 5 star person",
  "profile": "**User Summary:**\n\nThe user maintains a strong affinity for comedy films that incorporate elements of drama and nostalgia, emphasizing narratives rich in personal connections and cultural experiences. Their discerning taste reveals a clear preference for balanced storytelling and in-depth character exploration, coupled with a notable aversion to self-absorbed protagonists. \n\nRecent interactions have highlighted a growing intolerance for subpar execution in filmmaking, indicating exacting standards for emotional engagement and narrative clarity. This trend is evident in their critical stance on projects perceived as lacking coherence, despite recognizing redeeming qualities, such as the charm of lead characters.\n\nThe user's appreciation for nuanced storytelling continues to be supported by their engagement with multi-language audio and subtitles, reinforcing a commitment to accessible narratives. Their feedback style remains balanced, concentrating on emotional impact and entertainment value, but they are increasingly less forgiving of poorly executed content.\n\nA recent interaction showcasing enthusiasm for a talented individual in a comedic context emphasizes their recognition of authenticity and genuine character in performance, evidenced by a glowing review despite overall production shortcomings. This reflects an evolving perspective that values the heartfelt contributions of individuals in the entertainment sphere while maintaining high standards for quality.\n\nOverall, this profile illustrates a sophisticated viewer who prizes quality storytelling and character development, seeking films that offer warmth and nuanced explorations of complex themes, with an increasing demand for coherence and execution in their cinematic choices.",
  "metrics": {
    "rouge1_f": 0.137987012987013,
    "rouge2_f": 0.008130081300813007,
    "rougeL_f": 0.06493506493506493,
    "meteor": 0.040157461516171535,
    "bleu1": 0.0017199002409874723,
    "bleu2": 0.00048327830896740203,
    "bleu3": 7.690563561134246e-05,
    "bleu4": 3.0708732176568735e-05,
    "bertscore_precision": 0.3194388151168823,
    "bertscore_recall": 0.41416850686073303,
    "bertscore_f1": 0.3606875240802765
  }
}