{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/08/28\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nReview Text: Very sappy, Tessa made me watch it.\nReview Title: Don't get punched in the stomach\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "My Cousin Vinny\nJoe Pesci  (Actor),     Ralph Macchio  (Actor),     Jonathan Lynn  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"Bill and Stan are mistaken for murderers while on vacation. Bill's family sends his cousin, Vinny Gambini, to defend them in his first case as a lawyer. (1992) Running time: 120 minutes\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane SmithJonathan Lynn, Ralph Macchio, Marisa Tomei, Peter Deming, Bruce McGill, Joe Pesci, Fred Gwynne, Mitchell Whitfield, Randy Edelman, Lane Smith  See more', 'Language': 'Unqualified', 'Runtime': '2 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.56 x 5.49 x 7.3 inches; 0.71 Ounces', 'Item model number': '2000532', 'Director': 'Jonathan Lynn', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'July 25, 2000', 'Actors': 'Joe Pesci, Ralph Macchio, Marisa Tomei, Mitchell Whitfield, Fred Gwynne', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nCame in perfect shape as described.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nVery sappy, Tessa made me watch it.\nDon't get punched in the stomach",
  "profile": "**User Summary:**\n\nThe user has a strong preference for comedy films, particularly those blending action and legal drama elements. Their appreciation for classic movies continues to be evident, with a consistent focus on high-quality content and presentation. Previous interactions highlight a tendency to provide high ratings, reflecting their expectation for well-executed films. \n\nRecent engagement indicates that while the user enjoys cinematic experiences that feature humor and relatable storytelling, they also encounter films that don’t fully resonate, as seen in their lukewarm review of a more dramatic title. This suggests an openness to various genres, although their fondness for comedic elements and feelings of nostalgia remains significant in their preferences. \n\nTheir interactions demonstrate an interest in film features such as multi-language audio, subtitles, and notable directorial and production efforts. The user's critique style, marked by a balanced assessment of both entertainment value and emotional impact, reinforces their inclination to provide constructive feedback, even when a film disappoints. \n\nOverall, this profile suggests a consumer committed to exploring diverse cinematic narratives, with a particular affinity for well-reviewed, nostalgic comedies that incorporate humor, classic storytelling, and strong character development, while maintaining a discerning eye for quality and coherence in film execution.",
  "metrics": {
    "rouge1_f": 0.12612612612612614,
    "rouge2_f": 0.004524886877828055,
    "rougeL_f": 0.06756756756756756,
    "meteor": 0.062331948178929356,
    "bleu1": 0.06771965694041555,
    "bleu2": 0.003528255800279053,
    "bleu3": 0.0013197004989063835,
    "bleu4": 0.0008079980016779064,
    "bertscore_precision": 0.3304346203804016,
    "bertscore_recall": 0.3681739270687103,
    "bertscore_f1": 0.34828492999076843
  }
}