{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hair Treatment Mask 120ml, 2019 PURC Magical Hair Mask, Deep Conditioner for Dry or Damaged Hair, 5 Seconds Repairs Damage Hair Root and Keratin\nReview Date: 2020/05/26\nStore: GHEART\nAverage Rating: 3.7\nProduct Details: {'Brand': 'GHEART', 'Material Feature': 'Natural', 'Hair Type': 'Dull, Frizzy, Color Treated, Dry, Chemically Treated, Damaged', 'Product Benefits': 'Hydrating', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.8 x 2.8 x 1.9 inches; 5.61 Ounces', 'Item model number': 'Hair Treatment Mask-411', 'UPC': '778299243728'}\nReview Text: I bought two masks to try out. This one for dry and damaged hair and a keratin one. First, I want to say my hair is very damaged. The top of my hair seems oily but the bottom is super dry. I buy regular conditioner from just any store and they never detangle my hair. My niece told me I needed to try a \"hair mask.\" I had never heard of it but she swears by it. So I decided to give it a try. You guys, it really works. You have to follow the directions though and put it on your hair longer than what the bottle says. The more damaged your hair is, the longer you should keep it on. I left mine on for a long while.. I cant even remember how long. I think maybe 30 minutes? Anyhow, when I washed it off, my hair actually was actually easier to comb through. I wish I could find conditioners like this though b/c I don't want to spend so much washing my hair!\nReview Title: leave on longer and it will be smoother\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hair Treatment Mask 120ml, 2019 PURC Magical Hair Mask, Deep Conditioner for Dry or Damaged Hair, 5 Seconds Repairs Damage Hair Root and Keratin\nGHEART\n{'Brand': 'GHEART', 'Material Feature': 'Natural', 'Hair Type': 'Dull, Frizzy, Color Treated, Dry, Chemically Treated, Damaged', 'Product Benefits': 'Hydrating', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.8 x 2.8 x 1.9 inches; 5.61 Ounces', 'Item model number': 'Hair Treatment Mask-411', 'UPC': '778299243728'}\nI bought two masks to try out. This one for dry and damaged hair and a keratin one. First, I want to say my hair is very damaged. The top of my hair seems oily but the bottom is super dry. I buy regular conditioner from just any store and they never detangle my hair. My niece told me I needed to try a \"hair mask.\" I had never heard of it but she swears by it. So I decided to give it a try. You guys, it really works. You have to follow the directions though and put it on your hair longer than what the bottle says. The more damaged your hair is, the longer you should keep it on. I left mine on for a long while.. I cant even remember how long. I think maybe 30 minutes? Anyhow, when I washed it off, my hair actually was actually easier to comb through. I wish I could find conditioners like this though b/c I don't want to spend so much washing my hair!\nleave on longer and it will be smoother",
  "profile": "**User Profile Summary:**\n\n- **Hair Type:** Prefers products for dry, damaged, and chemically treated hair, exhibiting concerns about oiliness at the roots and dryness at the ends.\n- **Product Interests:** Shows interest in hair treatments, particularly masks that offer deep conditioning and hydration benefits.\n- **Usage Behavior:** Willing to experiment with new products, particularly when recommended by others. Favors effective solutions that provide noticeable improvements, such as easier detangling.\n- **Application Preferences:** Willing to adjust product application times; values following directions for optimal results, indicating a thoughtful approach to hair care.\n- **Value Sensitivity:** Indicates a desire for effective products at a reasonable price, with a slight frustration about the cost of specialty hair care items, suggesting budget-conscious tendencies.\n- **Brand Loyalty:** Open to exploring products from various brands, demonstrating a willingness to try different offerings in pursuit of better hair management.\n\nOverall, the user seeks effective, affordable hair care solutions focused on repairing and hydrating damaged hair, exhibiting a preference for treatments that yield tangible results.",
  "metrics": {
    "rouge1_f": 0.277511961722488,
    "rouge2_f": 0.03365384615384616,
    "rougeL_f": 0.1339712918660287,
    "meteor": 0.1553267244345231,
    "bleu1": 0.20833476791270245,
    "bleu2": 0.04956032573423795,
    "bleu3": 0.008992675402625204,
    "bleu4": 0.003834921472993288,
    "bertscore_precision": 0.4004780650138855,
    "bertscore_recall": 0.4352278709411621,
    "bertscore_f1": 0.4171304702758789
  }
}