{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/03/12\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Curtis Hanson'], 'Producers': ['David Foster', 'Lawrence Turman'], 'Starring': ['Meryl Streep', 'Kevin Bacon', 'David Strathairn'], 'Studio': ['UNIVERSAL PAY TELEVISION']}\nReview Text: I recently watched TRW via Amazon Prime, after not seeing the movie since it was first released in theaters, over 20 years ago. I enjoyed it then, and it still holds up as a suspense thriller. The suspense builds slowly and steadily to a satisfying climax. There isn't a lot of action, just solid acting, directing, and storytelling. And Kevin Bacon is the bad guy you love to hate.\nReview Title: Satisfying suspense thriller\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nThe main reason I read the HG trilogy is because I had seen \"Winter's Bone\" in theaters when it was first released, and I thought Jennifer Lawrence was an amazing actress. When I learned that she was going to play the lead in The Hunger Games, I knew I'd want to see the movie. Fortunately, I've enjoyed reading speculative fiction all of my life, so it was no stretch for me to read THG. I have a problem with the basic premise --  that a totalitarian government would be able to take its citizens' children away from them to fight in gladiatorial combat. I don't believe in real life that people would put up with it. There would surely have been a revolution long before 74 years of Hunger Games competition had passed. That said, I set aside my disbelief as best I could while reading the books and watching the movie. The books aren't literary fiction, but they were entertaining and interesting enough to keep me engaged, mostly to find out what happens to Katniss.<br /><br />I thought the movie was faithful enough to the first book in the series, and the video and audio quality of this Blu-Ray disc is excellent, about what I'd expect. All of the performances were very good, and, as I expected, Jennifer Lawrence was outstanding. She's one of the greatest young actresses of our time, and I'm sure she'll have a highly successful career. I wasn't crazy about the jerky, handheld camera movements, but I got used to it, and I understand the director's rationale for using it. Actually he explained it well in the disc's extras. I enjoyed the behind-the-scenes documentary about the making of the movie, although I thought it felt at times as if they were trying to justify their creative choices to appease Hunger Games geeks. I know there were people who were frustrated at the various ways the movie didn't precisely follow the book, and who thought Jennifer Lawrence was a bad choice to play Katniss. I can't imagine another actress in the role of Katniss Everdeen.\nHunger Games is good. Jennifer Lawrence is awesome.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard'], 'Studio': ['FX Cable Channel']}\nI don't know if the character was written specifically for Tim Olyphant, but I can't imagine anyone else playing Raylan Givens, and Olyphant plays Raylan perfectly. This show has everything I like: great, character-driven stories, suspense, romance, action, comedy, you-name-it. In my opinion, Justified couldn’t exist without Raylan Givens, but almost as important is Walton Goggins' Boyd Crowder. I love the chemistry between these two charismatic men, and the fact that the line between good and evil is blurry. It's shows like Justified that make me occasionally fantasize buying a cable subscription.\nTimothy Olyphant is Raylan Givens\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jack Bender', 'Peter Leto', 'David Barrett', 'Sergio Mimica-Gezzan', 'Kari Skogland', 'Eriq La Salle', 'Edward Ornelas', 'Peter Weller', 'Roxann Dawson', 'Paul A. Edwards'], 'Starring': ['Mike Vogel', 'Rachelle Lefevre', 'Natalie Martinez'], 'Studio': ['CBS']}\nI watched several episodes hoping it would get better, but it was too contrived, formulaic, and inconsistent for me. It wasn’t awful, just mediocre-or-worse, and I've seen variations of it all in much-better TV shows and/or movies.\nStandard TV Series Quality\nPacific Rim [Blu-ray]\nIdris Elba  (Actor),     Charlie Hunnam  (Actor),     Guillermo del Toro  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Blu-ray, DTS Surround Sound, Dolby, Color, Digital Sound', 'Contributor': 'Guillermo del Toro, Burn Gorman, Idris Elba, Diego Klattenhoff, Max Martini, Charlie Hunnam, Rinko Kikuchi, Charlie DayGuillermo del Toro, Burn Gorman, Idris Elba, Diego Klattenhoff, Max Martini, Charlie Hunnam, Rinko Kikuchi, Charlie Day  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WarnerBrothers', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '27605068', 'Director': 'Guillermo del Toro', 'Media Format': 'Blu-ray, DTS Surround Sound, Dolby, Color, Digital Sound', 'Release date': 'October 15, 2013', 'Actors': 'Idris Elba, Charlie Hunnam, Diego Klattenhoff, Rinko Kikuchi, Charlie Day', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French, Portuguese', 'Number of discs': '2'}\nI enjoyed Godzilla, Rodan, Mothra, and other cheesy Japanese monster movies when I was a kid, but none of them could hold a candle to Pacific Rim. Pacific Rim is immensely fun and exciting, and there's a bit of a human-interest subplot that develops between the Kaiju-Jaeger battles. The visuals and effects are awesome. This is lightweight sci-fi action movie, nothing more, and for me it was totally satisfying.\nWhat \"Godzilla\" dreamed of being...\nJustified\nSuspense, Western, Drama, Action\n[\"Deputy US Marshal Raylan Givens (Timothy Olyphant) will start to pick at the thread of a cold case over 30 years in the making, unraveling a riddle that echoes all the way back to his boyhood and his criminal father's bad dealings. Meanwhile, Boyd Crowder (Walton Goggins) finds his grip on Harlan loosening due to a Pentecostal preacher with a penchant for theatrics and a knack for manipulation...\"]\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nI watch Justified for the characters and the stories. It's dark (but not too dark), suspenseful, and sometimes funny. I think of the funny parts as comic relief, because generally there's a lot of tension, and I'm always in suspense to see who gets killed or beaten next. I especially love the chemistry between Raylan Givens (Timothy Olyphant) and Boyd Crowder (Walton Goggins), but even the supporting characters are richly drawn, and it's fascinating watching all these law enforcers and criminals from another culture. Justified feels like an old western set in contemporary times.\nJuicy, character-driven series\n{'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Michael Glaser'], 'Producers': ['George Linder', 'Tim Zinnemann', 'Keith Barish', 'Rob Cohen'], 'Starring': ['Arnold Schwarzenegger', 'Maria Conchita Alonso', 'Yaphet Kotto']}\nSometimes I don't mind watching bad movies. I'd already seen this when it was first released, years ago, and at the time I had enjoyed it, more-or-less. Now I wonder what I liked about the movie when I first saw it. The concept is interesting, and with good writing, acting, and directing, this could have been a good movie. It's okay if you're in the mood for a mindless, cheesy, cornball, action movie, and you don't mind terrible acting and dialog that sounds like it was written by a 13-year-old high school dropout.\nAbout as subtle as a week-old skunk roadkill in the middle of July\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Nankin', 'Allan Kroeker', 'Andy Wolk', 'Allan Arkush', 'Larry Shaw', 'Omar Madha', 'Scott Stewart', 'Mairzee Almas', 'Félix Enríquez Alcalá', 'Todd Slavkin'], 'Starring': ['Grant Bowler', 'Julie Benz', 'Tony Curran'], 'Studio': ['Syfy']}\nIt's not must-see TV, but if you're into SF, it's a mildly entertaining, if occasionally cheesy and predictable, diversion. One of the problems I have with shows like Defiance is that the &#34;aliens&#34; are all-too-human, in appearance and behavior. Star Trek was like this too. When I'm watching Defiance, I can't help but think of Firefly, which, like Defiance, gives us a civilization employing old and new technology. But for me, Firefly was a fresher, more engaging show, with great characters. Watching Defiance makes me wish Joss Whedon would resurrect Firefly.\nGood, not great, SF adventure series\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Graham Yost', 'Elmore Leonard', 'Michael Dinner', 'Sarah Timberman', 'Carl Beverly'], 'Starring': ['Timothy Olyphant', 'Nick Searcy', 'Jere Burns'], 'Studio': ['FX Cable Channel']}\nExcept for Raylan and his fellow law-enforcement professionals, almost everyone on this show is bad. They do evil, despicable things, which the creators of Justified have no qualms about showing us in graphic detail. A part of me feels guilty for loving such a lurid show, and that's the only reason I don't give Justified five stars. But the characters, even the bad ones, are so *interesting,* and then, of course, there's Raylan Givens and Boyd Crowder. I'm a straight guy, but I think Tim Olyphant's Raylan Givens is one sexy male TV character.\nGuilty pleasure\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Marc Forster'], 'Producers': ['Deborah Schoeneman', 'Mark Hudis', 'Becky Hartman Edwards', 'Jillian Kugler', 'Jeff King', 'Ron Perlman', 'Brian Wilkins', 'Marc Forster', 'Ben Watkins'], 'Starring': ['Ron Perlman', 'Dana Delany', 'Andre Royo'], 'Studio': ['Amazon Studios']}\nThe concept is interesting, and the acting is very good all around. It's quite dark, and I have no problem with dark stories per se. For example, I loved Breaking Bad and rated it five stars. But there isn't a single likable character in HoG. I've only watched the pilot, but all the characters are despicable, more-or-less. There's no one to root for. I can see where the story is going, at least in a general sense: Ron Perlman's judge is convinced God has given him a mission, and he will have more visions that seem to defy logic and common sense, in which he is directed to kill someone, or have them killed. It will seem like the person he's going to kill is innocent, couldn’t possibly be guilty of any wrongdoing, but then there will be a shocking reveal near the end of the chapter/episode, in which we learn that the judge's latest victim is a guilty, evil person after all who deserved to die.<br />I'm not sure whether my curiosity about the ultimate fate of the judge and his mission will keep me watching beyond the pilot.\nOK if you like dark stories with no likable characters\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English'], 'Directors': ['S. Craig Zahler'], 'Producers': ['Dallas Sonnier', 'Jack Heller'], 'Starring': ['Kurt Russell', 'Patrick Wilson', 'Matthew Fox'], 'Studio': ['RLJ Entertainment']}\nI'm not a fan of horror movies, generally, but this didn't feel like a stereotypical horror movie. The quaint, interesting dialogue gave the story a feeling of authenticity, and it helped build more or less three-dimensional characters. Events near the beginning of the story set the stage for a dreadful, disturbing final act, where the real horror was on display. For my taste, the &#34;road-trip&#34; (middle) part of story dragged on a bit too much; otherwise I would have rated the movie 3.5 stars. There came a point during the second act where I was thinking, okay, when are we going to get to the climax. I'll probably never watch it again, but I don't regret watching it. Oh yeah, right now I can't think of a good alternate title, but to me, &#34;Bone Tomahawk&#34; is a stupid title.\nbut this didn't feel like a stereotypical horror movie\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '日本語', 'Português', 'Deutsch', 'Español (España)', 'Español (Latinoamérica)', 'Polski', 'Čeština', 'Magyar', 'Français'], 'Subtitles': ['English', 'English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['David Semel', 'Daniel Percival', 'Ken Olin', 'Michael Rymer', 'Bryan Spicer', 'Nelson Mccormick', 'Brad Anderson', 'Karyn Kusama', 'Michael Slovis'], 'Producers': ['Ridley Scott', 'David W. Zucker', 'Frank Spotnitz', 'Isa Dick Hackett', 'Christopher Tricarico', 'Stewart Mackinnon', 'Chrtistian Baute', 'Jace Richdale', 'Richard Heus', 'Dan Percival', 'Jordan Sheehan', 'Kalen Egan', 'Erin Smith'], 'Starring': ['Alexa Davalos', 'Rupert Evans', 'Luke Kleintank'], 'Studio': ['Amazon Studios']}\nThe Man in the High Castle presents an alternate reality in which the axis powers had won WWII, from the point of view of characters living in what had been the United States, circa 1962. I've not read Philip K. Dick's novel, but the Amazon series is fascinating and well done. It's also dark, mysterious, and suspenseful, with the suspense slowly simmering until it reaches a full boil by the last couple of episodes. If the series continues, I'll be watching.\nCompelling speculative fiction\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Curtis Hanson'], 'Producers': ['David Foster', 'Lawrence Turman'], 'Starring': ['Meryl Streep', 'Kevin Bacon', 'David Strathairn'], 'Studio': ['UNIVERSAL PAY TELEVISION']}\nI recently watched TRW via Amazon Prime, after not seeing the movie since it was first released in theaters, over 20 years ago. I enjoyed it then, and it still holds up as a suspense thriller. The suspense builds slowly and steadily to a satisfying climax. There isn't a lot of action, just solid acting, directing, and storytelling. And Kevin Bacon is the bad guy you love to hate.\nSatisfying suspense thriller",
  "profile": "**Updated User Profile Summary:**\n\n- **Genres:** The user maintains a strong enthusiasm for speculative fiction and fantasy, now further enriched by their ongoing interest in suspense and darker narratives, particularly thrillers. This interaction highlights their appreciation for character-driven stories, even when the narratives are classic.\n\n- **Key Interests:** The user prioritizes media adaptations with masterful performances and intricate storytelling, particularly those that explore human behavior within diverse cultural contexts.\n\n- **Themes:** Emotional complexity and moral ambiguity remain central to their preferences, with a noted enjoyment of suspenseful storytelling that challenges character relatability.\n\n- **Viewing Experience:** They continue to value high-quality audiovisual content while increasingly embracing narratives that may not be wholly original yet deliver engaging experiences. Their enjoyment of flawed narratives and morally ambiguous characters has intensified.\n\n- **Engagement:** The user is invested in character arcs, particularly those featuring morally ambiguous figures. Their recent interaction indicates a growing fondness for stories built on solid acting and storytelling rather than mere action.\n\n- **Rating Patterns:** Though discerning regarding originality, the user has become more inclined to appreciate narratives driven by complex plots and character dynamics that are neither wholly likable nor agreeable.\n\n- **Community Insights:** The user celebrates compelling storytelling and performances, continuing to embrace the deeper layers and challenges presented by darker narratives, reflecting their evolving taste in film and television.",
  "metrics": {
    "rouge1_f": 0.07412844036697248,
    "rouge2_f": 0.008079324274697024,
    "rougeL_f": 0.03963302752293577,
    "meteor": 0.02103229008423725,
    "bleu1": 1.0013037552007835e-06,
    "bleu2": 3.375051851304307e-07,
    "bleu3": 1.0271756240325856e-07,
    "bleu4": 3.189466822689619e-08,
    "bertscore_precision": 0.3435351848602295,
    "bertscore_recall": 0.48312947154045105,
    "bertscore_f1": 0.40154606103897095
  }
}