{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Pacific Rim [Blu-ray]\nReview Date: 2013/12/14\nStore: Idris Elba  (Actor),     Charlie Hunnam  (Actor),     Guillermo del Toro  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Blu-ray, DTS Surround Sound, Dolby, Color, Digital Sound', 'Contributor': 'Guillermo del Toro, Burn Gorman, Idris Elba, Diego Klattenhoff, Max Martini, Charlie Hunnam, Rinko Kikuchi, Charlie DayGuillermo del Toro, Burn Gorman, Idris Elba, Diego Klattenhoff, Max Martini, Charlie Hunnam, Rinko Kikuchi, Charlie Day  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WarnerBrothers', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '27605068', 'Director': 'Guillermo del Toro', 'Media Format': 'Blu-ray, DTS Surround Sound, Dolby, Color, Digital Sound', 'Release date': 'October 15, 2013', 'Actors': 'Idris Elba, Charlie Hunnam, Diego Klattenhoff, Rinko Kikuchi, Charlie Day', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French, Portuguese', 'Number of discs': '2'}\nReview Text: I enjoyed Godzilla, Rodan, Mothra, and other cheesy Japanese monster movies when I was a kid, but none of them could hold a candle to Pacific Rim. Pacific Rim is immensely fun and exciting, and there's a bit of a human-interest subplot that develops between the Kaiju-Jaeger battles. The visuals and effects are awesome. This is lightweight sci-fi action movie, nothing more, and for me it was totally satisfying.\nReview Title: What \"Godzilla\" dreamed of being...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nThe main reason I read the HG trilogy is because I had seen \"Winter's Bone\" in theaters when it was first released, and I thought Jennifer Lawrence was an amazing actress. When I learned that she was going to play the lead in The Hunger Games, I knew I'd want to see the movie. Fortunately, I've enjoyed reading speculative fiction all of my life, so it was no stretch for me to read THG. I have a problem with the basic premise --  that a totalitarian government would be able to take its citizens' children away from them to fight in gladiatorial combat. I don't believe in real life that people would put up with it. There would surely have been a revolution long before 74 years of Hunger Games competition had passed. That said, I set aside my disbelief as best I could while reading the books and watching the movie. The books aren't literary fiction, but they were entertaining and interesting enough to keep me engaged, mostly to find out what happens to Katniss.<br /><br />I thought the movie was faithful enough to the first book in the series, and the video and audio quality of this Blu-Ray disc is excellent, about what I'd expect. All of the performances were very good, and, as I expected, Jennifer Lawrence was outstanding. She's one of the greatest young actresses of our time, and I'm sure she'll have a highly successful career. I wasn't crazy about the jerky, handheld camera movements, but I got used to it, and I understand the director's rationale for using it. Actually he explained it well in the disc's extras. I enjoyed the behind-the-scenes documentary about the making of the movie, although I thought it felt at times as if they were trying to justify their creative choices to appease Hunger Games geeks. I know there were people who were frustrated at the various ways the movie didn't precisely follow the book, and who thought Jennifer Lawrence was a bad choice to play Katniss. I can't imagine another actress in the role of Katniss Everdeen.\nHunger Games is good. Jennifer Lawrence is awesome.\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard'], 'Studio': ['FX Cable Channel']}\nI don't know if the character was written specifically for Tim Olyphant, but I can't imagine anyone else playing Raylan Givens, and Olyphant plays Raylan perfectly. This show has everything I like: great, character-driven stories, suspense, romance, action, comedy, you-name-it. In my opinion, Justified couldn’t exist without Raylan Givens, but almost as important is Walton Goggins' Boyd Crowder. I love the chemistry between these two charismatic men, and the fact that the line between good and evil is blurry. It's shows like Justified that make me occasionally fantasize buying a cable subscription.\nTimothy Olyphant is Raylan Givens\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jack Bender', 'Peter Leto', 'David Barrett', 'Sergio Mimica-Gezzan', 'Kari Skogland', 'Eriq La Salle', 'Edward Ornelas', 'Peter Weller', 'Roxann Dawson', 'Paul A. Edwards'], 'Starring': ['Mike Vogel', 'Rachelle Lefevre', 'Natalie Martinez'], 'Studio': ['CBS']}\nI watched several episodes hoping it would get better, but it was too contrived, formulaic, and inconsistent for me. It wasn’t awful, just mediocre-or-worse, and I've seen variations of it all in much-better TV shows and/or movies.\nStandard TV Series Quality\nPacific Rim [Blu-ray]\nIdris Elba  (Actor),     Charlie Hunnam  (Actor),     Guillermo del Toro  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure', 'Format': 'Blu-ray, DTS Surround Sound, Dolby, Color, Digital Sound', 'Contributor': 'Guillermo del Toro, Burn Gorman, Idris Elba, Diego Klattenhoff, Max Martini, Charlie Hunnam, Rinko Kikuchi, Charlie DayGuillermo del Toro, Burn Gorman, Idris Elba, Diego Klattenhoff, Max Martini, Charlie Hunnam, Rinko Kikuchi, Charlie Day  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WarnerBrothers', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '27605068', 'Director': 'Guillermo del Toro', 'Media Format': 'Blu-ray, DTS Surround Sound, Dolby, Color, Digital Sound', 'Release date': 'October 15, 2013', 'Actors': 'Idris Elba, Charlie Hunnam, Diego Klattenhoff, Rinko Kikuchi, Charlie Day', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French, Portuguese', 'Number of discs': '2'}\nI enjoyed Godzilla, Rodan, Mothra, and other cheesy Japanese monster movies when I was a kid, but none of them could hold a candle to Pacific Rim. Pacific Rim is immensely fun and exciting, and there's a bit of a human-interest subplot that develops between the Kaiju-Jaeger battles. The visuals and effects are awesome. This is lightweight sci-fi action movie, nothing more, and for me it was totally satisfying.\nWhat \"Godzilla\" dreamed of being...",
  "profile": "**User Profile Summary:**\n\n- **Genres:** Maintains a strong enthusiasm for speculative fiction and fantasy, with a notable preference for character-driven dramas. The user exhibits a critical perspective towards formulaic narratives, but remains open to lighter, fun sci-fi adventures.\n- **Key Interests:** Enjoys adaptations of books into films, especially when featuring strong performances from acclaimed actors. Emphasizes the importance of innovative storytelling and is particularly appreciative of high-quality production values.\n- **Themes:** Values emotional depth and prefers narratives that navigate complex moral dilemmas, but also appreciates sheer entertainment value in well-crafted sci-fi action, recognizing the joy in lighter plots alongside serious themes.\n- **Viewing Experience:** Prioritizes high-quality audiovisual content while being cautious about overly complex or intrusive filming techniques. Shows interest in behind-the-scenes insights but is becoming increasingly critical of repetitive styles.\n- **Engagement:** Connects deeply with character arcs and strong dynamics, showing noticeable disappointment if these are lacking. Recently demonstrated enjoyment of entertaining action spectacles that combine thrilling visuals with engaging humanoid narratives.\n- **Rating Patterns:** Typically rates content positively, but has articulated a more critical perspective on storytelling originality, balancing this with a capacity to appreciate enjoyable escapism.\n- **Community Insights:** Remains aware of broader audience trends while advocating for strong narratives and actor integrity, showcasing a versatile taste that blends highbrow and accessible storytelling.",
  "metrics": {
    "rouge1_f": 0.1614035087719298,
    "rouge2_f": 0.012302284710017573,
    "rougeL_f": 0.05964912280701754,
    "meteor": 0.050145583953413134,
    "bleu1": 0.007386917372822709,
    "bleu2": 0.001998305980766629,
    "bleu3": 0.00031396966282072624,
    "bleu4": 0.00012456501037965922,
    "bertscore_precision": 0.35973435640335083,
    "bertscore_recall": 0.4603084921836853,
    "bertscore_f1": 0.40385398268699646
  }
}