{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/11/02\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Starring': ['Paul Giamatti', 'Laura Linney', 'Stephen Dilane'], 'Studio': ['HBO']}\nReview Text: Johnny A finally gets his due! And Abigail too!<br />Fantastic acting. Great production quality for a period piece.<br />Adams, Jefferson, Washington, Hamilton, and Franklin are all here.\nReview Title: Entertaining and educational! All the founding fathers excellently portrayed--but Abigail steals the show!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sam Esmail', 'Jim McKay', 'Tricia Brock', 'Deborah Chow', 'Nisha Ganatra', 'Niels Arden Oplev', 'Christoph Schrewe'], 'Producers': ['Sam Esmail', 'Kyle Bradstreet', 'Steve Golin', 'Chad Hamilton'], 'Starring': ['Rami Malek', 'Christian Slater']}\nPretty clever plot lines (though not always realistic) and very good acting. Far more interesting than you think a &#34;hacker&#34; drama would be.  Definitely R-rated and pushes the limit of that at times. I'll keep watching on Amazon Prime.\nBetter than expected for a hacker drama\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Rapley'], 'Producers': ['Rob Rapley', 'Stephanie Haberman Bordas', 'Kathryn Lord'], 'Starring': ['Michael Murphy', 'Shuler Hensley', 'Kathryn Erbe'], 'Studio': ['PBS']}\nLots of info about presidents Garfield and Arthur I never knew. Garfield could have been one of the best presidents ever. Looks like his doctor did more to kill him than the guy who shot him. Good acting in the docu-drama parts. Very engrossing.\nWell worth your time if you like learning little known history.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Starring': ['Paul Giamatti', 'Laura Linney', 'Stephen Dilane'], 'Studio': ['HBO']}\nJohnny A finally gets his due! And Abigail too!<br />Fantastic acting. Great production quality for a period piece.<br />Adams, Jefferson, Washington, Hamilton, and Franklin are all here.\nEntertaining and educational! All the founding fathers excellently portrayed--but Abigail steals the show!",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** The user maintains a strong interest in mature-rated content, particularly narratives intertwining technology, hacking, and thriller elements. They appreciate complex plots that challenge realism while still finding value in engaging historical docu-dramas. Recent interactions indicate a fascination with productions that offer enlightening insights into significant figures and themes in history.\n\n- **Genre Affinity:** Aside from suspenseful dramas, the user's latest engagement highlights a growing appreciation for historical narratives featuring prominent historical figures, reflecting their desire for stimulating and educational storytelling.\n\n- **Quality of Production:** The user upholds high standards for both acting and production quality, consistently commending outstanding performances and direction in various formats, including period pieces.\n\n- **Platform Engagement:** They exhibit a clear preference for streaming services, especially Amazon Prime and similar platforms that offer on-demand viewing, underscoring their enjoyment of diverse content.\n\n- **Content Advisory Awareness:** The user remains alert to content advisories, comfortable with adult themes such as violence and substance use, showcasing a receptiveness to boundary-pushing narratives.\n\n- **Rating Behavior:** The user typically rates content highly, averaging around 4.5, but demonstrated an even stronger inclination towards exceptional quality in their recent review, showcasing their critical approach to the realism and storytelling effectiveness.\n\nOverall, the user's profile reflects an ongoing pursuit of engaging, high-quality dramas and informative historical narratives within a streaming context, balancing entertainment with educational value.",
  "metrics": {
    "rouge1_f": 0.22448979591836735,
    "rouge2_f": 0.03278688524590164,
    "rougeL_f": 0.09387755102040818,
    "meteor": 0.09634703646293259,
    "bleu1": 0.1184310093454229,
    "bleu2": 0.03290363145060021,
    "bleu3": 0.0058346536726655955,
    "bleu4": 0.0024591122647738893,
    "bertscore_precision": 0.3705482482910156,
    "bertscore_recall": 0.41443055868148804,
    "bertscore_f1": 0.39126285910606384
  }
}