{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/01/05\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Condon'], 'Producers': ['Anne Carey', 'Iain Canning', 'Emile Sherman', 'Len Blavatnik', 'Aviv Giladi', 'Vince Holden', 'Christine Langan', 'Zanne Devine', 'Amy Nauiokas'], 'Starring': ['Ian McKellen', 'Laura Linney', 'Hiroyuki Sanada'], 'Studio': ['Paramount Pictures']}\nReview Text: Great acting but devoid of any action or intrigue. This is a drama about a retired Sherlock slipping into senility.  Mystery fans will be disappointed.\nReview Title: Boring but well-acted drama. Not a Sherlock mystery movie.\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sam Esmail', 'Jim McKay', 'Tricia Brock', 'Deborah Chow', 'Nisha Ganatra', 'Niels Arden Oplev', 'Christoph Schrewe'], 'Producers': ['Sam Esmail', 'Kyle Bradstreet', 'Steve Golin', 'Chad Hamilton'], 'Starring': ['Rami Malek', 'Christian Slater']}\nPretty clever plot lines (though not always realistic) and very good acting. Far more interesting than you think a &#34;hacker&#34; drama would be.  Definitely R-rated and pushes the limit of that at times. I'll keep watching on Amazon Prime.\nBetter than expected for a hacker drama\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Rapley'], 'Producers': ['Rob Rapley', 'Stephanie Haberman Bordas', 'Kathryn Lord'], 'Starring': ['Michael Murphy', 'Shuler Hensley', 'Kathryn Erbe'], 'Studio': ['PBS']}\nLots of info about presidents Garfield and Arthur I never knew. Garfield could have been one of the best presidents ever. Looks like his doctor did more to kill him than the guy who shot him. Good acting in the docu-drama parts. Very engrossing.\nWell worth your time if you like learning little known history.\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Starring': ['Paul Giamatti', 'Laura Linney', 'Stephen Dilane'], 'Studio': ['HBO']}\nJohnny A finally gets his due! And Abigail too!<br />Fantastic acting. Great production quality for a period piece.<br />Adams, Jefferson, Washington, Hamilton, and Franklin are all here.\nEntertaining and educational! All the founding fathers excellently portrayed--but Abigail steals the show!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Condon'], 'Producers': ['Anne Carey', 'Iain Canning', 'Emile Sherman', 'Len Blavatnik', 'Aviv Giladi', 'Vince Holden', 'Christine Langan', 'Zanne Devine', 'Amy Nauiokas'], 'Starring': ['Ian McKellen', 'Laura Linney', 'Hiroyuki Sanada'], 'Studio': ['Paramount Pictures']}\nGreat acting but devoid of any action or intrigue. This is a drama about a retired Sherlock slipping into senility.  Mystery fans will be disappointed.\nBoring but well-acted drama. Not a Sherlock mystery movie.",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** The user has a strong interest in mature-rated content, particularly narratives intertwining technology, hacking, and thriller elements. They appreciate complex plots that challenge realism while still valuing engaging historical docu-dramas. Recent interactions indicate a continuing fascination with productions offering enlightening insights into significant figures and themes in history.\n\n- **Genre Affinity:** Their latest engagement reveals a more critical perspective towards suspenseful dramas. While they enjoy historical narratives featuring prominent historical figures, they’ve recently expressed disappointment in works lacking action or intrigue, indicating a need for dynamic storytelling.\n\n- **Quality of Production:** The user maintains high standards for acting and production quality but has become more discerning. A recent review emphasized that while a production had great acting, it fell short in action and intrigue, suggesting that they now seek a balance between performance and engaging plots.\n\n- **Platform Engagement:** Their preference for streaming services, especially Amazon Prime and similar platforms, remains evident, as they enjoy diverse content.\n\n- **Content Advisory Awareness:** They are alert to content advisories and comfortable with adult themes such as violence and substance use, showcasing a receptiveness to boundary-pushing narratives.\n\n- **Rating Behavior:** The user typically rates content highly, averaging around 4.5, but their recent review reflects a growing critical approach, as they rated a drama as low as 1.0 for failing to meet their expectations of engagement and excitement.\n\nOverall, the user's profile reflects an ongoing pursuit of engaging, high-quality dramas and informative historical narratives, now balanced with a stronger emphasis on the need for captivating storytelling.",
  "metrics": {
    "rouge1_f": 0.22222222222222224,
    "rouge2_f": 0.033783783783783786,
    "rougeL_f": 0.08754208754208755,
    "meteor": 0.09177569324716764,
    "bleu1": 0.1005502041471101,
    "bleu2": 0.02997710402467835,
    "bleu3": 0.010479521458575237,
    "bleu4": 0.0034870249055071216,
    "bertscore_precision": 0.35759907960891724,
    "bertscore_recall": 0.410541832447052,
    "bertscore_f1": 0.3822459578514099
  }
}