{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/09/22\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Rapley'], 'Producers': ['Rob Rapley', 'Stephanie Haberman Bordas', 'Kathryn Lord'], 'Starring': ['Michael Murphy', 'Shuler Hensley', 'Kathryn Erbe'], 'Studio': ['PBS']}\nReview Text: Lots of info about presidents Garfield and Arthur I never knew. Garfield could have been one of the best presidents ever. Looks like his doctor did more to kill him than the guy who shot him. Good acting in the docu-drama parts. Very engrossing.\nReview Title: Well worth your time if you like learning little known history.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sam Esmail', 'Jim McKay', 'Tricia Brock', 'Deborah Chow', 'Nisha Ganatra', 'Niels Arden Oplev', 'Christoph Schrewe'], 'Producers': ['Sam Esmail', 'Kyle Bradstreet', 'Steve Golin', 'Chad Hamilton'], 'Starring': ['Rami Malek', 'Christian Slater']}\nPretty clever plot lines (though not always realistic) and very good acting. Far more interesting than you think a &#34;hacker&#34; drama would be.  Definitely R-rated and pushes the limit of that at times. I'll keep watching on Amazon Prime.\nBetter than expected for a hacker drama\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Rapley'], 'Producers': ['Rob Rapley', 'Stephanie Haberman Bordas', 'Kathryn Lord'], 'Starring': ['Michael Murphy', 'Shuler Hensley', 'Kathryn Erbe'], 'Studio': ['PBS']}\nLots of info about presidents Garfield and Arthur I never knew. Garfield could have been one of the best presidents ever. Looks like his doctor did more to kill him than the guy who shot him. Good acting in the docu-drama parts. Very engrossing.\nWell worth your time if you like learning little known history.",
  "profile": "**User Profile Summary:**\n\n- **Content Preference:** The user continues to showcase a strong interest in mature-rated content, particularly narratives that weave together technology, hacking, and thriller elements. They appreciate complex and clever plotlines, even those that may stretch realism.\n\n- **Genre Affinity:** While primarily favoring dramas with suspense and intellectual engagement, the user has demonstrated an appreciation for historical docu-dramas that provide engaging and lesser-known insights into significant figures and events, aligning with their preference for stimulating narratives.\n\n- **Quality of Production:** High standards for acting and production quality are maintained, as the user comments positively on standout performances and effective direction even in documentary formats.\n\n- **Platform Engagement:** The user shows a clear preference for streaming services, especially enjoying content on Amazon Prime and similar platforms that facilitate on-demand viewing.\n\n- **Content Advisory Awareness:** The user remains vigilant regarding content advisories and is comfortable with adult themes, including violence and substance use, reflecting their ongoing interest in content that pushes boundaries.\n\n- **Rating Behavior:** The user displays a tendency to rate content positively (averaging 4.5), signifying an inclination towards high-quality entertainment, coupled with a critical approach to its realism and storytelling effectiveness.\n\nOverall, the user's profile indicates a pursuit of engaging, high-quality dramas and informative historical content within a streaming context, highlighting their engagement with both entertainment and education.",
  "metrics": {
    "rouge1_f": 0.178743961352657,
    "rouge2_f": 0.02912621359223301,
    "rougeL_f": 0.09178743961352656,
    "meteor": 0.10839934155476875,
    "bleu1": 0.15753567559767587,
    "bleu2": 0.030094471238303177,
    "bleu3": 0.013773064893972117,
    "bleu4": 0.005244358642830243,
    "bertscore_precision": 0.38623911142349243,
    "bertscore_recall": 0.4162686765193939,
    "bertscore_f1": 0.40069204568862915
  }
}