{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nReview Date: 2020/10/29\nStore: Vedory\nProduct Description: ['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nReview Text: Been since March 2020 using face mask at work and we all know how difficult is to be 8 to 12 hours with a face mask and this accessories make it easier. With this 3d bracket you can breath and talk much better and does long hours are less painful.  The best part is they are made out of plastic and they can be wash anytime, usually i wash it every time I got to the bathroom or lunch. This bracket does not bother and is very useful. I recommend you to try it.\nReview Title: Much easier for breathing with mask\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "TUKNON Toenail Corrector Patch Kit 100 Pre\nTUKNON\n{'Brand': 'TUKNON', 'Item Form': 'Wipes,Tablets', 'Specific Uses For Product': 'Camera, Eyewear', 'Material Feature': 'Glue Free', 'Unit Count': '100 Count', 'Package Dimensions': '5.5 x 4.25 x 2.5 inches; 8.01 Ounces', 'UPC': '754407654068 754407655782', 'Manufacturer': 'VISUMALL FOOX'}\nI got this for my cellphone to desinfect them after getting home from work because my daughter play with my phone and now with covid-19 we have to be more careful. They do the job and that's what I'm looking for . They are not to moistened  and is great because you want to clean your lens,phone,camera not give a shower.  This wipes is only alcohol with water and to much could damage your device.<br /><br />Recommendation<br />Don't use wipes for sunglasses, it could damage them. Use better warm water and soap for desinfect thing them if you don't have the right cleaner.\nDoes the job\nQiray Hair Ties Hair Accessories Set For Girls and Women,Large Retractable Cotton,18 Colors 36 Pieces.\nQiray\n{'Material': 'Cotton', 'Item Form': 'Elastic', 'Brand': 'Qiray', 'Item Dimensions LxWxH': '5.51 x 5.51 x 1.57 inches', 'Hair Type': 'Straight', 'Product Dimensions': '5.51 x 5.51 x 1.57 inches; 3.99 Ounces', 'UPC': '655160582479'}\nThis hair bands come in a nice bag that's is perfect for a gift and not having that problem when doing hair not finding hair ties. They are strong, stretch well and grabs hair nicely. I do my kids hair and they like it.,Good quality.\nGreat quality and grabs the hair very well\n3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly - Protect Lipstick Lips - DIY Face Mask Accessories - 5Pcs (L-Adult)\nLinberfor\n{'Brand': 'Linberfor', 'Item Form': 'Stick', 'Scent': 'Mint', 'Unit Count': '5 Count', 'Number of Items': '5', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.57 x 4.25 x 0.87 inches; 0.71 Ounces', 'UPC': '745860354299'}\nFace mask is something that we will be using for a long time and we need to find the way to be the most comfortable and this item is the perfect. this helps you have your mouth free and much better when you want to talk. normally you feel the mask touching your lips but with this that's over.  you breath better and does not bother having it inside the mask, actually i been using it for a month all ready and i wish i knew about this before. is plastic and you can wash it and dry it with a paper. i work in the hospital and has been very useful for me and my work partners.\nMakes breathing much better\nElectric Shaver for Men, SOOCAS Mens Electric Razor, Wet & Dry IPX7 Waterproof Rotary Facial Shaver, Portable Face Shaver Cordless Travel USB Rechargeable for Husband Dad, Black\nSOOCAS\n{'Brand': 'SOOCAS', 'Special Feature': 'Portable,Rechargeable,Cordless,Waterproof,Compact', 'Power Source': 'Battery Powered', 'Included Components': 'Charger', 'Blade Material': 'Stainless Steel', 'Package Dimensions': '7.36 x 4.21 x 2.68 inches; 11.18 Ounces', 'Batteries': '1 Lithium Ion batteries required. (included)', 'Manufacturer': 'SOOCAS'}\nWas expecting more of this shaver and got a bit disappointed. It looks amazing and feels amazing but does not shave well. Leaves a lot of miss spot and need to pass it to many times and I have small amount of hair and don't want to imagen a person with bigger amount of hair.  Is easy to clean and charges very fast thanks to the type c port.\nLove the style but does not shave well\n3D Mask Bracket - Internal Support Holder Frame Nose Breathing Smoothly- Lipstick Protection Cool Mask Bracket - DIY Face Mask Accessories - 5Pcs (L-Adult)\nVedory\n['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\n{'Package Dimensions': '6.3 x 4.72 x 2.36 inches; 1.41 Ounces', 'UPC': '800914455053', 'Manufacturer': 'Vedory'}\nBeen since March 2020 using face mask at work and we all know how difficult is to be 8 to 12 hours with a face mask and this accessories make it easier. With this 3d bracket you can breath and talk much better and does long hours are less painful.  The best part is they are made out of plastic and they can be wash anytime, usually i wash it every time I got to the bathroom or lunch. This bracket does not bother and is very useful. I recommend you to try it.\nMuch easier for breathing with mask",
  "profile": "**Updated User Profile Summary:**\n\n- **Health and Hygiene Focus:** The user remains dedicated to cleanliness and comfort during prolonged mask usage, reflecting their professional healthcare background and proactive approach to personal hygiene.\n\n- **Enhanced Mask Comfort:** They have recently integrated a specific accessory designed to improve mask usability, emphasizing the importance of breathability and comfort during extended wear. This aligns with their focus on tools that facilitate daily routines, especially in a work context.\n\n- **Practical Device Care:** The user values products that merge functionality with durability. Their experiences with grooming devices and mask accessories highlight a preference for items that enhance performance while being easy to maintain and clean.\n\n- **Quality and Product Effectiveness:** They continue to seek high-quality, functional solutions that meet their practical needs. Recent purchases clearly demonstrate their desire for effective appliances that enhance comfort and usability.\n\n- **Commitment to Comfort:** The user appreciates products that not only serve aesthetic purposes but also improve practicality and ease of use. Their emphasis on comfort, particularly with mask usage, underscores a commitment to enhancing everyday experiences.\n\nOverall, the user exhibits a consistent pattern of prioritizing health, comfort, and functionality in their purchases, actively seeking innovative solutions that improve their daily routines while maintaining high standards for quality and effectiveness.",
  "metrics": {
    "rouge1_f": 0.14794007490636707,
    "rouge2_f": 0.015009380863039398,
    "rougeL_f": 0.07116104868913857,
    "meteor": 0.06244347482266332,
    "bleu1": 0.017174279037085616,
    "bleu2": 0.0041939865441275506,
    "bleu3": 0.0006704771525560404,
    "bleu4": 0.0002683381819615431,
    "bertscore_precision": 0.3587709665298462,
    "bertscore_recall": 0.46369147300720215,
    "bertscore_f1": 0.40453892946243286
  }
}