{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Masterpiece Mystery: Inspector Lewis Series 5\nReview Date: 2014/01/26\nStore: Kevin Whately  (Actor),     Laurence Fox  (Actor),     Dan Reed  (Director),     Nicholas Renton  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, PBS, All\nProduct Description: ['Product Description', 'Four new mysteries, which were inspired by the Inspector Morse novels of Colin Dexter. Episodes include - THE SOUL OF GENIUS; GENERATION OF VIPERS; FEARFUL SYMMETRY; and THE INDELIBLE STAIN.', 'Amazon.com', 'You might think that Oxford, England--a place known as \"the city of dreaming spires,\" nestled in the countryside, dominated by the oldest university in the English-speaking world--would be at least somewhat immune to the vagaries and superficialities of the modern world. But in this fifth season of the outstanding murder mystery series', 'Inspector Lewis', '(with four 90-minute episodes on two discs), that world intrudes anyway. Did a lonely college professor who was once a well-known author kill herself because her online video dating profile was stolen, leaked, and then publicly ridiculed at a snarky TMZ/Perez Hilton-like gossip site (\"Man-hating feminist who\\'s punting for a poke,\" the caption reads)? Do \"fetish photos\" of women bound with elaborate knots have something to do with a young babysitter\\'s killing? As always, Detective Inspector Robbie Lewis (Kevin Whately) and his right-hand man, Detective Sergeant James Hathaway (Laurence Fox), do their dogged best to solve these complex crimes, which also include the more recondite kind of misdeeds typical of the show\\'s genteel setting (\"The Soul of Genius\" involves an obsession with Lewis Carroll\\'s poem', 'The Hunting of the Snark', ', along with \"the Wednesday Club,\" a secret Oxford society that may or may not really exist). The stories are good, but better yet, we also learn a bit more about the lives of our principals. When Hathaway flirts with an attractive woman, Lewis offers quiet encouragement, telling him, \"You need a partner, James\"; meanwhile, could Lewis, the widower still mourning the death of his wife in a hit-and-run accident, finally be surrendering to the charms of Dr. Laura Hobson (Clare Holman)?', 'Inspector Lewis', 'fans will surely want to stay tuned for the answers to this and other pressing issues--not to mention the dastardly murders that will follow as this terrific show winds down after just one more season.', '--Sam Graham']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Nicholas Renton, Rebecca Front, Alton Letto, Clare Holman, Dan Reed, Kevin Whately, Laurence Fox', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '25334417', 'Director': 'Dan Reed, Nicholas Renton', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours', 'Release date': 'July 24, 2012', 'Actors': 'Kevin Whately, Laurence Fox, Clare Holman, Rebecca Front, Alton Letto', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nReview Text: My Wife ordered these and liked them very much. I never got into them but she liked them so I watched a bit too.\nReview Title: My Wife's Videos\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "American Heritage Series - Ten DVD Set\nDavid Barton  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Join historian David Barton and experience the untold story of our nation's history in the American Heritage Series. Discover the forgotten and astonishing story of our nation's foundation in the American Heritage Series. For centuries, Americans were taught a truthful view of history that recognized the Godly heroes and moral foundation our nation was founded upon. But in recent years, a new version of history has assaulted the moral and spiritual fiber of our nation, leaving the truth of our past eliminated and forgotten. Until today. From Separation of Church and State, to the Civil Rights Movement, the heroism of our founding Fathers to the building of our nation's monuments, this series will inspire every American to reclaim the Godly, true story of our nation.\", \"When sold by Amazon.com, this product is manufactured on demand using DVD-R recordable media. Amazon.com's standard return policy will apply.\"]\n{'Genre': 'Faith_&_spirituality', 'Format': 'NTSC', 'Contributor': 'David Barton', 'Language': 'Unqualified', 'Number Of Discs': '10', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 6 inches; 2.05 Pounds', 'Item model number': '14544071', 'Director': 'David Barton', 'Media Format': 'NTSC', 'Run time': '13 hours', 'Release date': 'August 11, 2009', 'Actors': 'David Barton', 'Studio': 'Bridgestone', 'Number of discs': '10'}\nMy DVDs came fast!<br /><br />This is a fantastic series. David Barton really knows his history. I love listening to and watching him.<br /><br />I received the set yesterday, 9-26-11, and watched the first two DVDs. They even look good playing them on the computer but are better on an HDTV.<br /><br />How many of us actually knew there were about 250 Founding Fathers/Framers? I actually knew of a few, probably like most. Like David says, around the 60's they started changing the way we learned history and moved away from the faith aspects of the Founders and moved toward the economic aspects. Most who want to change history talk about Ben Franklin and Thomas Jefferson about being non-religous and portray all founders that way. They might have been the least religous but in today's world they would be far more outspoken about faith and God than most preachers today.<br /><br />For anyone who wants to learn the truth about our history I would highly recommend this series. I've only watched two of the DVDs so far and can't wait until I watch the rest.\nFantastic DVD series!\nDune\nKyle MacLachlan  (Actor),     Jose Ferrer  (Actor),     David Lynch  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\n['Product Description', \"Dazzling special effects, unforgettable images and powerful performances highlight David Lynch's stunning film version of Frank Herbert's classic science fiction epic about an intergalactic warrior's messianic rise. Starring Kyle MacLachlan, Jose Ferrer, Max von Sydow, Oscar winner Linda Hunt and Sting, Dune is the ultimate adventure experience that goes beyond the imagination.Bonus Content:\", 'Deleted Scenes with Introduction By Raffaella De Laurentiis', 'Deleted Scenes with Introduction By Raffaella De Laurentiis', 'Designing Dune', 'Designing Dune', 'Special Effects', 'Special Effects', 'Models & Minatures', 'Models & Minatures', 'Wardrobe Design', 'Wardrobe Design', 'Photography Gallery', 'Photography Gallery', 'Production Notes', 'Production Notes', 'Amazon.com', \"Even more than most of David Lynch's deliberately bizarre and idiosyncratic movies,\", 'Dune', 'is a \"love-it-or-hate-it\" affair. An ambitious, epic, utterly mind-boggling--and, let\\'s admit it, all-out weird--adaptation of Frank Herbert\\'s classic science fiction novel,', 'Dune', \"remains one of the most controversial films in the director's exceedingly provocative career. The story (if\", 'Dune', \"can be said to have just one story) is complex and convoluted in the epic tradition; it has  Kyle MacLachlan as Paul Usul Muad'Dib Atreides something to do with political intrigue and a planet that is home to a precious spice and gigantic sand worms. Think Shakespeare's\", 'Henry IV', 'with a dash of', 'Tremors', \", and set in another galaxy. But despite plenty of strangely whispered voice-overs that explain the characters' thoughts (and endlessly detailed exposition), storytelling is not really among the film's strong points. There are, however, a lot of memorably fantastic/grotesque images, an extraordinary cast, and a soundtrack featuring Toto. I told you it was weird. Among the stars are Kyle MacLachlan, José Ferrer, Dean Stockwell, Brad Dourif, Sting, Kenneth McMillan, Patrick  Sting as Feyd-Rautha Stewart, Sean Young, and Linda Hunt.\", '--Jim Emerson', 'DVD features', 'Melange fans have a lot to be excited about with this impressive edition of', 'Dune', ', though the \"Extended Edition\" label is a bit misleading. If you are expecting the mythic 4 hour \"David Lynch preferred\" version that is rumored to be sitting in a vault, don\\x92t get your hopes up. This isn\\'t it. In an attempt to quickly sober spice-fueled giddy fans, producer Raffaella De Laurentiis (daughter of Dino De Laurentiis) immediately reveals in the \\'Deleted Scenes\\' introduction that the rumored 4 hour version is just that; a rumor. What this DVD set does contain is the 2 Hour 17 Minute original theatrical release digitally remastered, available for the first time in 2.35:1 anamorphic widescreen and 5.1 surround sound. The presentation on this edition is a drastic improvement from the original letterboxed release. On the flipside of the DVD  Knife fight! is the alternate 2 hour 57 minute version cut for television. As many fans know, this \\'extended\\' version was disowned by Lynch, who insisted his name be replaced by that famous Hollywood pseudonym \"Alan Smithee;\" the name used by directors whose film was taken away and recut against their wishes. There is some new material in the 14 minutes of deleted scenes offering a bit more background into the Bene Gesserit sisterhood, the Kwisatz Haderach prophecy and the Fremen culture and their struggle. All other extras focus on the international production crew of', 'Dune', 'including the design team, special effects, and short documentaries on the miniature models and wardrobe designs. Disappointingly, there are no appearances in the bonus features by any of the original cast or Lynch himself. However, many of the production crew members talk openly about working with David Lynch and his artistic involvement in the visual process. To cap it off, this edition comes in a very stylish and sturdy DVD tin that opens like a keep case.', '--Rob Bracco', 'Further Explore the World Of Dune', 'Dune', '(Dune Chronicles, Book 1)', 'Dune Messiah', '(Dune Chronicles, Book 2)', 'Children of Dune', '(Dune Chronicles, Book 3)', 'Sci-Fi Action Films on DVD', 'The', 'Dune', 'TV Series', 'David Lynch Essentials']\n{'Genre': 'Science Fiction & Fantasy, Drama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & AdventureScience Fiction & Fantasy, Drama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure   See more', 'Format': 'Anamorphic, Widescreen, Color, Subtitled', 'Contributor': \"Brad Dourif, Paul Smith, Alicia Roanne Witt, Freddie Jones, Kenneth McMillan, Kyle MacLachlan, Dino De Laurentiis, Richard Jordan, Raffaella De Laurentiis, Nelson Stoll, Sean Young, Kevin O'Connell, Patrick Stewart, Jurgen Prochnow, Max von Sydow, Sting, Dean Stockwell, Sian Phillips, Steve Maslow, David Lynch, Jose Ferrer, Bill Varney, Virginia Madsen, Francesca Annis, Linda HuntBrad Dourif, Paul Smith, Alicia Roanne Witt, Freddie Jones, Kenneth McMillan, Kyle MacLachlan, Dino De Laurentiis, Richard Jordan, Raffaella De Laurentiis, Nelson Stoll, Sean Young, Kevin O'Connell, Patrick Stewart, Jurgen Prochnow, Max von Sydow, Sting, Dean St…   See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo)', 'Runtime': '5 hours and 14 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 6.4 Ounces', 'Director': 'David Lynch', 'Media Format': 'Anamorphic, Widescreen, Color, Subtitled', 'Run time': '5 hours and 14 minutes', 'Release date': 'January 31, 2006', 'Actors': 'Kyle MacLachlan, Jose Ferrer, Max von Sydow, Linda Hunt, Sting', 'Subtitles': 'English, Spanish, French', 'Producers': 'Raffaella De Laurentiis, Dino De Laurentiis', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'David Lynch', 'Number of discs': '1'}\nWhile I'd rather watch paint dry or go out to the garage and hit my thumb with a hammer my wife loves this movie.<br />When I see her watching it I say, &#34;Oh, I see you are watching the dumbest movie ever made!&#34; She just gives me &#34;The Look&#34; and keeps watching.<br />I guess to each her own.\nOne of my Wife's favorite movies\nStar Trek: The Complete Original Series DVD (Seasons 1-3)\nWilliam Shatner  (Actor),     Leonard Nimoy  (Actor),     Anton Leader  (Director),     David Alexander  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['Product Description', '\"Space...The Final Frontier. These are the voyages of the Starship, Enterprise. Its 5-year mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no man has gone before !\" The series is set in the 23rd century where Earth has survived World War III then moved on to explore the stars. Brought to you in a brilliant remastered edition….this is Star Trek like you’ve never seen it before!', 'Amazon.com', 'Season One', 'In 1966,', 'Star Trek', 'set out to boldly go where no series had gone before, beginning a three-year mission that led to a', 'franchise', 'that would last decades. Here at last is the first season of the original series all in one box, 29 episodes in their original broadcast order. That means starting with \"The Man Trap,\" and soon followed by \"Where No Man Has Gone Before,\" the second pilot filmed and the first one starring William Shatner as Captain Kirk. The many highlight episodes include \"Balance of Terror\" and \"Errand of Mercy\" (introducing, respectively, the Romulans and the Klingons), the two-part \"The Menagerie\" (which recycled footage from the original pilot, \"The Cage,\" which featured Christopher Pike as the captain of the', 'Enterprise', 'and is not included in this set), \"Space Seed\" (introducing Ricardo Montalban\\'s Khan character), and \"The City of the Edge of Forever\" (written by sci-fi giant Harlan Ellison and considered by many the best-ever episode of the series).', 'The first-season DVD set is supplemented by 80 minutes of featurettes incorporating 2003-04 interviews with Shatner, Leonard Nimoy, other cast members, and producers, and some 1988 footage of Gene Roddenberry. The longest (24 minutes) featurette, \"The Birth of a Timeless Legacy,\" examines the two pilot episodes and the development of the crew. Slightly shorter are \"To Boldly Go... Season One,\" which highlights key episodes, and \"Sci-Fi Visionaries,\" which discusses the series\\' great science fiction writers (most famously in \"The City of the Edge of Forever\"). Shatner shows off his love of horses in \"Life Beyond', 'Trek', ',\" and, more interestingly, Nimoy debunks various rumors in \"Reflections of Spock.\" As they\\'ve done for many of the', 'feature-film special editions', \", Michael Okuda and Denise Okuda provide a pop-up text commentary on four of the episodes filled with history, trivia, and dry wit. It's the first commentary of any kind for a\", 'Star Trek', 'TV show, but an audio commentary is still overdue. The technical specs are mostly the same as other', 'Trek', \"TV series--Dolby 5.1, English subtitles--but with the welcome addition of the episode trailers. The plastic case is an attempt to replicate some of the fun packaging of the series' European DVD releases, but it's a bit clunky, and the paper sleeve around the disc case seems awkward and crude. Still, the set is a vast improvement both in terms of shelf space and bonus features compared to the old\", 'two-episode discs', ', which were released before full-season boxed sets became the model for television DVDs.', '--David Horiuchi', 'Season Two', 'The most famous episode in franchise history, \"The Trouble with Tribbles,\" is one of the highlights of the second season of', 'Star Trek: The Original Series', '. A deserved classic, the humorous story centers on an ever-expanding mass of furry creatures that memorably rain themselves down on top of Captain Kirk (William Shatner) and into the middle of a Federation-Klingon showdown. It inspired one of the most memorable episodes in the spin-off series', 'Deep Space Nine', ', \"Trial and Tribble-ations.\" Also in the second season, the Vulcan culture of Mr. Spock (Leonard Nimoy) is fleshed out in \"Amok Time\" (in which Spock is faced with the possibility of killing his captain and friend) and \"Journey to Babel\" (introducing Spock\\'s father, played by Mark Sarek, in what would turn out to be a long-recurring role). A new character, navigator Pavel Chekov (Walter Koenig), was introduced; his Monkees haircut was intended to appeal to the younger audience, but he was also a Russian, which at the height of the cold war reflected Gene Roddenberry\\'s optimistic vision of a more enlightened future. Other social-commentary opportunities presented themselves in \"The Omega Glory,\" \"The Doomsday Machine,\" and \"Assignment: Earth,\" the last also one of those periodic opportunities to scrimp on the budget by time-traveling to an earlier version of Earth. Another example was \"A Piece of the Action,\" a comic episode set in the Roaring Twenties and memorable for, among other things, Kirk\\'s teaching a made-up card game called Fizzbin. In other significant episodes, \"I, Mudd\" saw the return of the bounder from season 1, \"The Changeling\" was the original inspiration for the first', 'Trek', 'feature film a decade later, \"Wolf in the Fold\" (penned by the author of', 'Psycho', ') provides an example of the series\\' great writing, and \"Mirror, Mirror\" introduced the concept of the parallel universe inhabited by vicious, amoral counterparts of the regular crew, another theme later borrowed (more than once, and to good emotional effect) by', 'DS9', '.', 'On the DVD', 'The remastered episodes are the highlight of the 2008 second-season release; like in season one, the reworked visual effects might irk purists but are an improvement overall, and some of the space exteriors are very exciting. It\\'s not in high definition, however; season one was released in 2007 on two-sided combination HD DVD and standard DVD discs, which are now obsolete. Season two mimics the packaging, but is only standard-definition DVD, not Blu-ray. The picture, while obviously not high-definition quality, is still much improved over the 2004 DVD release. Special features here mostly mirror that 2004 set: 80 minutes of featurettes (\"To Boldly Go\" season recap, \" Kirk, Spock & Bones: The Great Trio,\" \"Star Trek\\'s Divine Diva,\" \"Designing the Final Frontier,\" and \"Writer\\'s Notebook: D.C. Fontana\"), though missing from this set are the text commentaries on two episodes, the Red Shirt Logs, the production art, and the photo gallery. There are two new featurettes: \"', 'Star Trek', '\\'s Favorite Moments,\" in which cast members of later', 'Trek', 'franchises and fans recall certain episodes, and \"Billy Blackburn\\'s Treasure Chest, part 2,\" in which a', 'Trek', 'extra tells stories and shows some of his on-set home movies. And because season 2 includes \"The Trouble with Tribbles,\" the set includes two bonus episodes: \"More Tribbles, More Troubles\" from the', 'Animated Series', 'and \"Trials and Tribble-ations\" from', 'Deep Space Nine', '. Conveniently, all three Tribble-centric episodes are on the same disc, and include the bonus features from the earlier DVD releases (the commentary by writer David Gerrold on \"More Troubles\" and the two featurettes--\"Uniting Two Legends\" and \"An Historic Endeavor\"--from \"Tribble-ations\"). The bonus episodes were not remastered, and you can tell the difference when comparing the original Tribble episode on this set with the grainier footage that was used in the', 'DS9', 'episode. A minor annoyance is that the discs are one-sided but appear to be two-sided, as if they had been designed for combo HD DVD again before a late change. That means the info on the disc is restricted to a ring around the middle, rather than a full label that could have listed the episodes on each disc; as is, they\\'re only listed on the glossy \"collector\\'s data cards.\" And once again, the plastic shell is clunky and the disc spindles are way too tight. All in all, it\\'s a nice package, especially if one doesn\\'t already have the other Tribble episodes, but it feels like it\\'s floating in a standard-definition limbo, stuck in the transition between HD DVD and Blu-ray.', '--David Horiuchi', 'Season Three', 'Saved from the brink of cancellation by its loyal fanbase,', 'Star Trek', '\\'s third and final season rewarded them with a number of memorable episodes. Tight budgets and slipping creative control, however, made it the series\\' most uneven season, though it did have some of the coolest episode titles (\"For the World Is Hollow and I Have Touched the Sky,\" \"Is There in Truth No Beauty,\" \"Let That Be Your Last Battlefield\"). Some of the best moments involved a gunfight at the OK Corral (\"Spectre of the Gun\"), a knock-down drag-out sword battle with the Klingons aboard the Enterprise (\"Day of the Dove\"), the ship getting caught in an ever-tightening spacial net (\"The Tholian Web\"), TV\\'s first interracial kiss (\"Plato\\'s Stepchildren,\" and it should be easy to guess who participated), Sulu taking command (\"The Savage Curtain\"), and Kirk\\'s switching bodies with an ex-love interest (\"Turnabout Intruder\").', 'The 2008 DVD set benefits from the same remastering given to the other two seasons, though only the first was released in high definition (the now-defunct HD DVD format). Still, the episodes are substantially cleaned up to the point where they look quite good, rather than jarringly fuzzy to the modern viewer. And there are some new visual effects that are well-done, and obtrusive only to the strictest fans. Compare, for example, the dramatic close-up of the green-glowing', 'U.S.S. Defiant', 'in \"The Tholian Web\" with the original effect, which had the ship floating in a green haze. New bonus features are 11 more minutes of rare footage from extra Billy Blackburn; \"Collectible', 'Trek', ',\" a 14-minute discussion of rare', 'Trek', 'items, filmed in 2004 with the rest of the bonus content but not included on the previous DVD set; and the newly filmed \"Captain\\'s Log: Bob Justman,\" an affectionate nine-minute tribute to the series producer. Otherwise, the set retains almost all the special features from the 2004 set, including the features on Walter Koenig, George Takei, and James Doohan (who died the following year), plus the two versions of the series pilot, \"The Cage,\" a restored color version and the original, never-aired version that alternates between color and black and white. Starring Jeffery Hunter as Captain Pike, Leonard Nimoy as a relatively emotional Spock, and Majel Barrett (the future Nurse Chapel and Mrs. Gene Roddenberry) as a frosty Number One, this pilot was rejected, but a second was commissioned, \"Where No Man Has Gone Before,\" now considered the \"official\" beginning of the series. But \"The Cage\" is very recognizably', 'Star Trek', 'with its far-out concepts (telepathic aliens collecting species samples), sexy humanoid women, character development, and of course cheesy costumes and special effects. Footage was later reused in the season 1 two-parter, \"The Menagerie.\"', '--David Horiuchi']\n{'Genre': 'Science Fiction', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Original recording remastered', 'Contributor': 'Walter Koenig, Frank da Vinci, David Alexander, Gene Nelson, William Shatner, James Doohan, Katherine Woodville, George Takei, Majel Barrett, Anton Leader, Gerd Oswald, Herbert Kenwith, DeForest Kelley, Nichelle Nichols, Don McDougall, Jon Lormer, Herb Wallerstein, Byron Morrow, Harvey Hart, Leonard NimoyWalter Koenig, Frank da Vinci, David Alexander, Gene Nelson, William Shatner, James Doohan, Katherine Woodville, George Takei, Majel Barrett, Anton Leader, Gerd Oswald, Herbert Kenwith, DeForest Kelley, Nichelle Nichols, Don McDougall, Jon Lormer, Herb Wall…  See more', 'Language': 'Unqualified', 'Number Of Discs': '25', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.8 x 6.9 x 5.5 inches; 4 Ounces', 'Director': 'Anton Leader, David Alexander, Don McDougall, Gene Nelson, Gerd Oswald', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Original recording remastered', 'Run time': '68 hours and 41 minutes', 'Release date': 'November 18, 2008', 'Actors': 'William Shatner, Leonard Nimoy, DeForest Kelley, Katherine Woodville, James Doohan', 'Studio': 'Paramount', 'Number of discs': '25'}\nI love it. It's Star Trek. Need I say more? Well yes I have six more words to go before I can quit. I can quit.\nStar Trek: The Complete Original Series DVD (Seasons 1-3)\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Hettie Macdonald', 'Metin Hüseyin', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whatley', 'Laurence Fox'], 'Studio': ['PBS']}\nMy Wife ordered these and liked them very much. I never got into them but she liked them so I watched a bit too.\nMy Wife's Videos\nMasterpiece Mystery: Inspector Lewis Series 5\nKevin Whately  (Actor),     Laurence Fox  (Actor),     Dan Reed  (Director),     Nicholas Renton  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, PBS, All\n['Product Description', 'Four new mysteries, which were inspired by the Inspector Morse novels of Colin Dexter. Episodes include - THE SOUL OF GENIUS; GENERATION OF VIPERS; FEARFUL SYMMETRY; and THE INDELIBLE STAIN.', 'Amazon.com', 'You might think that Oxford, England--a place known as \"the city of dreaming spires,\" nestled in the countryside, dominated by the oldest university in the English-speaking world--would be at least somewhat immune to the vagaries and superficialities of the modern world. But in this fifth season of the outstanding murder mystery series', 'Inspector Lewis', '(with four 90-minute episodes on two discs), that world intrudes anyway. Did a lonely college professor who was once a well-known author kill herself because her online video dating profile was stolen, leaked, and then publicly ridiculed at a snarky TMZ/Perez Hilton-like gossip site (\"Man-hating feminist who\\'s punting for a poke,\" the caption reads)? Do \"fetish photos\" of women bound with elaborate knots have something to do with a young babysitter\\'s killing? As always, Detective Inspector Robbie Lewis (Kevin Whately) and his right-hand man, Detective Sergeant James Hathaway (Laurence Fox), do their dogged best to solve these complex crimes, which also include the more recondite kind of misdeeds typical of the show\\'s genteel setting (\"The Soul of Genius\" involves an obsession with Lewis Carroll\\'s poem', 'The Hunting of the Snark', ', along with \"the Wednesday Club,\" a secret Oxford society that may or may not really exist). The stories are good, but better yet, we also learn a bit more about the lives of our principals. When Hathaway flirts with an attractive woman, Lewis offers quiet encouragement, telling him, \"You need a partner, James\"; meanwhile, could Lewis, the widower still mourning the death of his wife in a hit-and-run accident, finally be surrendering to the charms of Dr. Laura Hobson (Clare Holman)?', 'Inspector Lewis', 'fans will surely want to stay tuned for the answers to this and other pressing issues--not to mention the dastardly murders that will follow as this terrific show winds down after just one more season.', '--Sam Graham']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Nicholas Renton, Rebecca Front, Alton Letto, Clare Holman, Dan Reed, Kevin Whately, Laurence Fox', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '25334417', 'Director': 'Dan Reed, Nicholas Renton', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours', 'Release date': 'July 24, 2012', 'Actors': 'Kevin Whately, Laurence Fox, Clare Holman, Rebecca Front, Alton Letto', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nMy Wife ordered these and liked them very much. I never got into them but she liked them so I watched a bit too.\nMy Wife's Videos",
  "profile": "**User Profile Summary:**\n\n- **Interests:** The user has a strong preference for historical documentaries with a faith-based perspective on American history and has recently developed an interest in classic television series, particularly in the mystery and suspense genre. They continue to engage with content enjoyed by family members, especially their spouse.\n\n- **Favorite Themes:** They are fascinated by the moral and spiritual underpinnings of American history, enjoy exploring narrative complexities in both historical and fictional realms, and appreciate content recommended by loved ones.\n\n- **Content Format:** The user favors physical media, particularly DVDs, indicating a preference for traditional viewing experiences over digital formats.\n\n- **Engagement Level:** They demonstrate high enthusiasm for quality educational and entertaining content across genres, showing a willingness to expand their viewing options based on family interests.\n\n- **Critical Thinking:** The user maintains a critical perspective on historical narratives and enjoys content that presents alternative interpretations, along with lighthearted critiques of entertainment.\n\n- **Quality Expectations:** They prioritize high production quality and visually appealing narratives across all genres.\n\n- **Community Recommendations:** The user is inclined to share knowledge and recommend content that aligns with their values, connecting with like-minded individuals.\n\nOverall, the user exhibits a robust inclination toward educational, thought-provoking content while increasingly embracing classic mystery narratives, valuing family engagement in media choices. Their recent experiences reflect a growing interest in narrative-driven series that resonate with their loved ones' preferences.",
  "metrics": {
    "rouge1_f": 0.06533490011750882,
    "rouge2_f": 0.0037620503174229957,
    "rougeL_f": 0.03149236192714453,
    "meteor": 0.017997750281214843,
    "bleu1": 1.344678689978763e-08,
    "bleu2": 4.725460968661325e-09,
    "bleu3": 1.9107904425959207e-09,
    "bleu4": 9.240349094940672e-10,
    "bertscore_precision": 0.354445219039917,
    "bertscore_recall": 0.5013366937637329,
    "bertscore_f1": 0.41528427600860596
  }
}