{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: COLORGRAM Artist Formula Auto Brow Pencil 0.25g- True Beauty K-Drama Makeup, Built-in-Spoolie, Clump-Free Formula, Softly Glides, Natural Look (02 Natural Brown)\nReview Date: 2021/06/07\nStore: COLORGRAM\nProduct Description: [\"Featuring a unique, triangular tip, Brow Definer's retractable pencil design is ideal for outlining and filling your brows in one fluid motion. The custom spooley end is created with a precise width and firmness to seamlessly blend color.\"]\nAverage Rating: 3.5\nProduct Details: {'Brand': 'COLORGRAM', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Softening', 'Product Dimensions': '0.59 x 0.71 x 6.1 inches; 0.32 Ounces'}\nReview Text: I have a love hate relationship with this eyebrow tool.<br /><br />Pros<br />• I like the Color<br />• The Spooly is nice it’s so soft<br />• Very easy to hold<br />• Sits on your eyebrow decently<br />• Seems to be smudge proof<br /><br />Cons<br />• Too dang smudge proof if you mess up you will not be able to take it off unless you use a makeup remover. So my advice have your concealer on deck or do your eyebrows before you do any other part of your face because you’ll be taken off whatever you put on with this<br />• You’ll have to apply some pressure to get anything off dark enough<br />• The tip isn’t as precise as what I’m used to using which is why it’ll cause you to mess up a bit.<br /><br />I like it but I’m not in like with it. I don’t really see myself reaching for this unless it’s all I have on hand.\nReview Title: It’s ok\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Yawamica 15 Pairs 6D Mink Eyelashes Faux 20MM Lashes Fluffy Cat Eye Wispy False Eyelashes Thick Dramatic Fake Eyelashes Handmade Reusable Natural Look Eyelashes Pack Long Eye Lashes\nYawamica\n{'Brand': 'Yawamica', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '8.9 x 8.3 x 0.5 inches; 2.4 Ounces'}\nI ordered two different lashes from this company so this review might be duplicated.<br /><br />Both sets of lashes are so sexy and very easy to apply. They take glue very well and very easy to clean (I just pick the glue off them). These are definitely reusable which is honestly my favorite part about them.<br /><br />The lashes offer slightly different sizes within their packs so please look before you pick. My only complaint is that it’s hard for me to tell which lash goes to with which lash because of the placement of the lashes. So this leads to me having to put a lash back after realizing it’s not the right lash.<br /><br />Beside that the lashes are fantastic and I would recommend them.\nSo cute but confusing\nAISI QUEENS Curly Bob Wig Short Ombre Brown Wig for Black Women Kinky Hair Middle Part Heat Resistant Synthetic Hair Wig for Women 14inch\nAISI QUEENS\n{'Hair Type': 'Coily', 'Style': 'Modern', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.71 x 8.9 x 2.72 inches; 9.14 Ounces'}\nThis such a beautiful soft wig. I love the color and length. The cap has 3 combs two in the front and one in the back. The wig does have come with a very tiny piece of lace that you will have to cut. The lace while dark in color when looking at it is very transparent. You do not get any parting space but the part you get (middle part) is a decent length.<br /><br />The wig is very manageable doesn’t do too much shedding (it hasn’t shed at all). The wig is synthetic so I wouldn’t recommend adding direct heat to it. If you want to style it use steam. Once the lace is cut the wig is ready to wear.\nShe is cute\nMICPANG Electric Eyebrow Trimmer Precision Electric Eyebrow Razor for Women Battery-Operated Facial Hair Remover with Comb (Pink)\nMICPANG\n{'Package Dimensions': '7.28 x 2.64 x 0.94 inches; 1.13 Ounces'}\nThe product hardly works and it drains the battery you put in it so quickly. I haven’t even used it for 15 minutes and the fresh battery I put in it is completely DRAINED!<br /><br />I’m not a fan of this product so all I can say is buy it at your own risk.\nNO\nCOLORGRAM Artist Formula Auto Brow Pencil 0.25g- True Beauty K-Drama Makeup, Built-in-Spoolie, Clump-Free Formula, Softly Glides, Natural Look (02 Natural Brown)\nCOLORGRAM\n[\"Featuring a unique, triangular tip, Brow Definer's retractable pencil design is ideal for outlining and filling your brows in one fluid motion. The custom spooley end is created with a precise width and firmness to seamlessly blend color.\"]\n{'Brand': 'COLORGRAM', 'Item Form': 'Pencil', 'Finish Type': 'Natural', 'Material Feature': 'Natural', 'Product Benefits': 'Softening', 'Product Dimensions': '0.59 x 0.71 x 6.1 inches; 0.32 Ounces'}\nI have a love hate relationship with this eyebrow tool.<br /><br />Pros<br />• I like the Color<br />• The Spooly is nice it’s so soft<br />• Very easy to hold<br />• Sits on your eyebrow decently<br />• Seems to be smudge proof<br /><br />Cons<br />• Too dang smudge proof if you mess up you will not be able to take it off unless you use a makeup remover. So my advice have your concealer on deck or do your eyebrows before you do any other part of your face because you’ll be taken off whatever you put on with this<br />• You’ll have to apply some pressure to get anything off dark enough<br />• The tip isn’t as precise as what I’m used to using which is why it’ll cause you to mess up a bit.<br /><br />I like it but I’m not in like with it. I don’t really see myself reaching for this unless it’s all I have on hand.\nIt’s ok",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to favor false eyelashes and versatile hair solutions, with a notable interest in facial hair removal tools, albeit with caution due to recent experiences. Their latest purchase indicates an exploration of eyebrow grooming tools, reflecting a desire for products that enhance makeup application while considering practicality.\n  \n- **Material Preference:** The commitment to cruelty-free and ethical beauty products remains strong, showcasing unwavering dedication to sustainability in all beauty choices, including skincare and grooming tools.\n\n- **Usage Pattern:** A preference for reusable and low-maintenance items is prominent, extending to recent purchases in makeup and personal grooming. This reflects their emphasis on sustainability and practicality across all beauty products.\n\n- **Buying Behavior:** While the user experiments with a variety of products from trusted brands, they are increasingly discerning following a previous negative experience. Their recent eyebrow tool purchase highlights a balanced approach—recognizing pros and cons while maintaining caution when selecting new products.\n\n- **Quality Expectations:** The user expects high-quality and effective products, with a focus on ease of use and minimal maintenance. Their scrutiny has intensified, particularly after a previous less-than-satisfactory experience with grooming tools.\n\n- **Design Sensitivity:** Aesthetic appeal and functionality in packaging and product design remain priorities.\n\n- **General Sentiment:** Enthusiasm for beauty products that merge aesthetics and practicality is evident, though recent interactions suggest a growing emphasis on reliability and effectiveness, especially in makeup and grooming tools.",
  "metrics": {
    "rouge1_f": 0.1846153846153846,
    "rouge2_f": 0.014388489208633094,
    "rougeL_f": 0.07794871794871794,
    "meteor": 0.0729790510948905,
    "bleu1": 0.037506066995006256,
    "bleu2": 0.005422609973176419,
    "bleu3": 0.0010496727495105565,
    "bleu4": 0.00046221377503296603,
    "bertscore_precision": 0.3810232877731323,
    "bertscore_recall": 0.4592677354812622,
    "bertscore_f1": 0.41650259494781494
  }
}