{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: AISI QUEENS Curly Bob Wig Short Ombre Brown Wig for Black Women Kinky Hair Middle Part Heat Resistant Synthetic Hair Wig for Women 14inch\nReview Date: 2021/02/21\nStore: AISI QUEENS\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Coily', 'Style': 'Modern', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.71 x 8.9 x 2.72 inches; 9.14 Ounces'}\nReview Text: This such a beautiful soft wig. I love the color and length. The cap has 3 combs two in the front and one in the back. The wig does have come with a very tiny piece of lace that you will have to cut. The lace while dark in color when looking at it is very transparent. You do not get any parting space but the part you get (middle part) is a decent length.<br /><br />The wig is very manageable doesn’t do too much shedding (it hasn’t shed at all). The wig is synthetic so I wouldn’t recommend adding direct heat to it. If you want to style it use steam. Once the lace is cut the wig is ready to wear.\nReview Title: She is cute\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Yawamica 15 Pairs 6D Mink Eyelashes Faux 20MM Lashes Fluffy Cat Eye Wispy False Eyelashes Thick Dramatic Fake Eyelashes Handmade Reusable Natural Look Eyelashes Pack Long Eye Lashes\nYawamica\n{'Brand': 'Yawamica', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '8.9 x 8.3 x 0.5 inches; 2.4 Ounces'}\nI ordered two different lashes from this company so this review might be duplicated.<br /><br />Both sets of lashes are so sexy and very easy to apply. They take glue very well and very easy to clean (I just pick the glue off them). These are definitely reusable which is honestly my favorite part about them.<br /><br />The lashes offer slightly different sizes within their packs so please look before you pick. My only complaint is that it’s hard for me to tell which lash goes to with which lash because of the placement of the lashes. So this leads to me having to put a lash back after realizing it’s not the right lash.<br /><br />Beside that the lashes are fantastic and I would recommend them.\nSo cute but confusing\nAISI QUEENS Curly Bob Wig Short Ombre Brown Wig for Black Women Kinky Hair Middle Part Heat Resistant Synthetic Hair Wig for Women 14inch\nAISI QUEENS\n{'Hair Type': 'Coily', 'Style': 'Modern', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.71 x 8.9 x 2.72 inches; 9.14 Ounces'}\nThis such a beautiful soft wig. I love the color and length. The cap has 3 combs two in the front and one in the back. The wig does have come with a very tiny piece of lace that you will have to cut. The lace while dark in color when looking at it is very transparent. You do not get any parting space but the part you get (middle part) is a decent length.<br /><br />The wig is very manageable doesn’t do too much shedding (it hasn’t shed at all). The wig is synthetic so I wouldn’t recommend adding direct heat to it. If you want to style it use steam. Once the lace is cut the wig is ready to wear.\nShe is cute",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Strong inclination towards false eyelashes and versatile hair solutions, demonstrating a preference for styles that are fluffy, dramatic, and easy to manage.\n- **Material Preference:** Commitment to cruelty-free and ethical beauty products, indicating a conscious choice for sustainable beauty options.\n- **Usage Pattern:** Favors reusable and low-maintenance items, showcasing an interest in sustainability and practicality across various beauty products, including wigs.\n- **Buying Behavior:** Tends to explore multiple varieties from trusted brands, suggesting brand loyalty and a desire to integrate diverse beauty items into their routine.\n- **Quality Expectations:** Expects high quality, ease of use, and minimal maintenance in all purchased items, reflected in positive assessments of both lashes and hair products.\n- **Design Sensitivity:** Prioritizes user-friendly packaging and organization, hinting at a desire for aesthetically pleasing and functional design across products.\n- **General Sentiment:** Enthusiastic about beauty products, successfully pairing aesthetics with practicality, as evidenced by enjoyment of versatile styles that enhance personal appearance and are effortless to wear.\n\nOverall, the user demonstrates a clear preference for stylish, ethical, and functional beauty solutions, with an expanding interest in hair products, alongside their established love for dramatic lashes.",
  "metrics": {
    "rouge1_f": 0.2257495590828924,
    "rouge2_f": 0.01415929203539823,
    "rougeL_f": 0.09171075837742504,
    "meteor": 0.10819928395421177,
    "bleu1": 0.11534413216690569,
    "bleu2": 0.028237412103569434,
    "bleu3": 0.011142296468372113,
    "bleu4": 0.003939773586810828,
    "bertscore_precision": 0.3828313648700714,
    "bertscore_recall": 0.43589672446250916,
    "bertscore_f1": 0.4076443612575531
  }
}