{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: MICPANG Electric Eyebrow Trimmer Precision Electric Eyebrow Razor for Women Battery-Operated Facial Hair Remover with Comb (Pink)\nReview Date: 2021/06/07\nStore: MICPANG\nAverage Rating: 3.1\nProduct Details: {'Package Dimensions': '7.28 x 2.64 x 0.94 inches; 1.13 Ounces'}\nReview Text: The product hardly works and it drains the battery you put in it so quickly. I haven’t even used it for 15 minutes and the fresh battery I put in it is completely DRAINED!<br /><br />I’m not a fan of this product so all I can say is buy it at your own risk.\nReview Title: NO\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Yawamica 15 Pairs 6D Mink Eyelashes Faux 20MM Lashes Fluffy Cat Eye Wispy False Eyelashes Thick Dramatic Fake Eyelashes Handmade Reusable Natural Look Eyelashes Pack Long Eye Lashes\nYawamica\n{'Brand': 'Yawamica', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '8.9 x 8.3 x 0.5 inches; 2.4 Ounces'}\nI ordered two different lashes from this company so this review might be duplicated.<br /><br />Both sets of lashes are so sexy and very easy to apply. They take glue very well and very easy to clean (I just pick the glue off them). These are definitely reusable which is honestly my favorite part about them.<br /><br />The lashes offer slightly different sizes within their packs so please look before you pick. My only complaint is that it’s hard for me to tell which lash goes to with which lash because of the placement of the lashes. So this leads to me having to put a lash back after realizing it’s not the right lash.<br /><br />Beside that the lashes are fantastic and I would recommend them.\nSo cute but confusing\nAISI QUEENS Curly Bob Wig Short Ombre Brown Wig for Black Women Kinky Hair Middle Part Heat Resistant Synthetic Hair Wig for Women 14inch\nAISI QUEENS\n{'Hair Type': 'Coily', 'Style': 'Modern', 'Brand': 'AISI QUEENS', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.71 x 8.9 x 2.72 inches; 9.14 Ounces'}\nThis such a beautiful soft wig. I love the color and length. The cap has 3 combs two in the front and one in the back. The wig does have come with a very tiny piece of lace that you will have to cut. The lace while dark in color when looking at it is very transparent. You do not get any parting space but the part you get (middle part) is a decent length.<br /><br />The wig is very manageable doesn’t do too much shedding (it hasn’t shed at all). The wig is synthetic so I wouldn’t recommend adding direct heat to it. If you want to style it use steam. Once the lace is cut the wig is ready to wear.\nShe is cute\nMICPANG Electric Eyebrow Trimmer Precision Electric Eyebrow Razor for Women Battery-Operated Facial Hair Remover with Comb (Pink)\nMICPANG\n{'Package Dimensions': '7.28 x 2.64 x 0.94 inches; 1.13 Ounces'}\nThe product hardly works and it drains the battery you put in it so quickly. I haven’t even used it for 15 minutes and the fresh battery I put in it is completely DRAINED!<br /><br />I’m not a fan of this product so all I can say is buy it at your own risk.\nNO",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to show a strong inclination towards false eyelashes and versatile hair solutions, particularly those that are fluffy, dramatic, and easy to manage. There is now a noted interest in facial hair removal tools, though with caution due to recent experience.\n- **Material Preference:** A commitment to cruelty-free and ethical beauty options remains evident, showcasing an ongoing dedication to sustainability in their beauty choices.\n- **Usage Pattern:** The user still favors reusable and low-maintenance items, emphasizing the importance of sustainability and practicality, which extends to all beauty products, including wigs and now personal grooming tools.\n- **Buying Behavior:** The user explores a variety of products from trusted brands but is becoming more discerning, as illustrated by the negative experience with a recent purchase, leading to a cautious approach when trying new tools.\n- **Quality Expectations:** There is a strong expectation for high quality, ease of use, and minimal maintenance. The negative experience with a facial hair remover has heightened their scrutiny of product performance.\n- **Design Sensitivity:** The user prioritizes aesthetically pleasing and functional design in packaging and organization, which remains a consistent aspect of their beauty product choices.\n- **General Sentiment:** The user remains enthusiastic about beauty products that blend aesthetics with practicality. However, their recent experience reflects a growing concern for reliability and effectiveness in new purchases.\n\nOverall, the user maintains a clear preference for stylish, ethical, and functional beauty solutions, tempered by an increased caution toward ineffective grooming products.",
  "metrics": {
    "rouge1_f": 0.23529411764705885,
    "rouge2_f": 0.02247191011235955,
    "rougeL_f": 0.10364145658263305,
    "meteor": 0.11729114450424559,
    "bleu1": 0.12817785474993432,
    "bleu2": 0.02691546863455597,
    "bleu3": 0.004682733606733541,
    "bleu4": 0.0019547452647466074,
    "bertscore_precision": 0.3832339644432068,
    "bertscore_recall": 0.43879491090774536,
    "bertscore_f1": 0.40913674235343933
  }
}