{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/03/29\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Stephen Gyllenhaal', 'Billy Gierhart', 'Ray McKinnon', 'Nicole Kassell', 'Jim McKay', 'Scott Teems', 'Keith Gordon', 'Romeo Tirone', 'Andrew Bernstein', 'Dennie Gordon'], 'Producers': ['Mark Johnson', 'Melissa Bernstein', 'Ray McKinnon'], 'Studio': ['Sundance', 'AMC Plus Drama']}\nReview Text: One of the most compelling dramas I've ever seen on tv.  The study of a man who has been in prison for 20 yrs. and then tries to readjust to &#34;normalcy&#34; outside the confines of the prison, is in-depth, smart, and compelling - sorry for the use of that adjective again.\nReview Title: smart, and compelling - sorry for the use of ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "American Hustle\nDrama, Strange, Fun, Serious\n['From the director of Silver Linings Playbook and The Fighter, AMERICAN HUSTLE is outrageously entertaining and one of the most acclaimed films of the year.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['David Russell'], 'Producers': ['Charles Roven', 'Richard Suckle', 'Megan Ellison', 'Jonathan Gordon'], 'Starring': ['Christian Bale', 'Bradley Cooper', 'Amy Adams']}\nI didn't like it.....it was a great story and could have  been intense and exciting.  Instead, it was hokey.  Just not my cup of tea.\nHokey\n{'Audio languages': ['English'], 'Subtitles': ['English'], 'Directors': ['Stephen Gyllenhaal', 'Billy Gierhart', 'Ray McKinnon', 'Nicole Kassell', 'Jim McKay', 'Scott Teems', 'Keith Gordon', 'Romeo Tirone', 'Andrew Bernstein', 'Dennie Gordon'], 'Producers': ['Mark Johnson', 'Melissa Bernstein', 'Ray McKinnon'], 'Studio': ['Sundance', 'AMC Plus Drama']}\nOne of the most compelling dramas I've ever seen on tv.  The study of a man who has been in prison for 20 yrs. and then tries to readjust to &#34;normalcy&#34; outside the confines of the prison, is in-depth, smart, and compelling - sorry for the use of that adjective again.\nsmart, and compelling - sorry for the use of ...",
  "profile": "**User Summary:**\n\n- **General Preference:** The user continues to engage deeply with films and series that prioritize strong narratives, with a clear affinity for serious and dramatic themes.\n\n- **Critique Style:** They maintain a discerning critical eye, expressing disappointment towards films and shows that fail to deliver intensity and excitement. Their use of terms like “hokey” illustrates a sustained distaste for unrealistic or superficial storytelling.\n\n- **Rating Trends:** Recently, the user rated a highly compelling drama 5.0, reflecting their appreciation for well-crafted narratives. This is consistent with their previous ratings, indicating they reserve high scores for truly exceptional storytelling that engages them on multiple levels.\n\n- **Categories of Interest:** They are particularly attracted to dramas that offer depth and intrigue, and their low tolerance for poorly executed humor or melodrama remains evident.\n\n- **Film and Series Expectations:** The user's desire for meaningful engagement over superficial enjoyment is reiterated through their recent review, emphasizing their quest for thought-provoking content that explores complex human experiences.\n\nOverall, the user values films and series with depth and intelligence, maintaining a high standard for storytelling that aims to evoke genuine emotional and intellectual responses. Their recent viewing choices further solidify their preference for stories that grapple with profound themes, particularly those involving personal transformation and societal reintegration.",
  "metrics": {
    "rouge1_f": 0.18090452261306536,
    "rouge2_f": 0.020202020202020204,
    "rougeL_f": 0.1256281407035176,
    "meteor": 0.09945460378569136,
    "bleu1": 0.17043973695657255,
    "bleu2": 0.03256331403832625,
    "bleu3": 0.0069181397723195,
    "bleu4": 0.0031917943045275607,
    "bertscore_precision": 0.37691426277160645,
    "bertscore_recall": 0.4149155616760254,
    "bertscore_f1": 0.3950030505657196
  }
}