{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Headbands for Women,MHDGG 1Pcs Flower Knot Headband Wide Headband Turban Headband Bowknot Bows HeadwrapHead Band Elastic Hair Accessories for Women,Yellow\nReview Date: 2021/03/14\nStore: MHDGG\nAverage Rating: 5.0\nProduct Details: {'Material': 'Cloth', 'Fabric Type': 'Cloth', 'Brand': 'MHDGG', 'Size': 'Medium', 'Item Form': 'Spiral', 'Package Dimensions': '0.2 x 0.06 x 0.02 inches; 1.28 Ounces'}\nReview Text: If you love yellow you will love this lovely headband. It's stylish and the wide width makes it more lovely.\nReview Title: Beautiful headband\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "WINIAER Headbands for Women 8 Pack, Fabric Hair Band Accessories Elastic Head Wrap Cute Outdoor Hair Accessories, Suitable for Women and Girls\nWINIAER\n{'Material': 'Plastic', 'Fabric Type': 'Elastic', 'Brand': 'WINIAER', 'Item Form': 'Wrap', 'Unit Count': '1.00 Count', 'Package Dimensions': '8 x 7 x 2 inches; 7.2 Ounces', 'UPC': '791405583280'}\nBeautiful style, nice and wide headbands\nLovely headbands\nBandana Headband for Women,MHDGG Sequins Wide Headbands Turban Headband Hair Band Bandana Hairband Head Band Wrap with Bow Cloth Wrapped Headwear,Pink\nMHDGG\n{'Material': 'Cloth', 'Brand': 'MHDGG', 'Size': 'Medium', 'Item Form': 'Wrap', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.14 x 5.24 x 1.77 inches; 1.13 Ounces'}\nThis headband is beautiful the shade of purple is very pretty its a nice width also\nVery Pretty\nMHDGG 1 Pack Chic Bling Sequins Headbands for Women - Cross Knot Hairbands Wide Headbands for Women Knot Turban Headband Hair Accessories,Beige\nMHDGG\n{'Age Range (Description)': 'Adult', 'Material': 'Lace, Cloth', 'Fabric Type': 'Lace,Sequins', 'Number of Items': '1', 'Brand': 'MHDGG', 'Package Dimensions': '6.14 x 5.51 x 2.36 inches; 0.95 Ounces', 'UPC': '193078575492'}\nLovely gold headband, love the wide width and the style\nLovely gold headband\nHeadbands for Women,MHDGG 1Pcs Flower Knot Headband Wide Headband Turban Headband Bowknot Bows HeadwrapHead Band Elastic Hair Accessories for Women,Yellow\nMHDGG\n{'Material': 'Cloth', 'Fabric Type': 'Cloth', 'Brand': 'MHDGG', 'Size': 'Medium', 'Item Form': 'Spiral', 'Package Dimensions': '0.2 x 0.06 x 0.02 inches; 1.28 Ounces'}\nIf you love yellow you will love this lovely headband. It's stylish and the wide width makes it more lovely.\nBeautiful headband",
  "profile": "**User Summary:**\n\n- **Fashion Preferences:** Enjoys stylish and functional accessories, particularly headbands that merge aesthetic appeal with practicality. Recent purchases continue to emphasize a focus on beautiful designs, especially in vibrant colors like yellow.\n- **Material Preference:** Prefers elastic and cloth materials for comfort and elegance, appreciating designs that incorporate luxe elements like lace and sequins.\n- **Aesthetic Style:** Favors wider styles that stand out visually, showcasing an affinity for unique and attractive looks, as evidenced by recent choices highlighting both width and color.\n- **Quality:** Prioritizes high-quality products, consistently giving top ratings for her purchases, reflecting her discerning taste and appreciation for well-crafted accessories.\n- **Demographic:** Likely targets women and girls, focusing on feminine accessories that cater to varied styles and occasions.\n- **Shopping Behavior:** Engages positively with brands that blend aesthetics and functionality, demonstrating loyalty to those that meet her elevated standards.\n- **Rating History:** Frequently rates purchases highly; her latest review underscores her strong appreciation for width and stylish designs in headbands.\n- **Color Preference:** Enjoys a range of visually appealing colors, particularly fond of shades that enhance her collection's diversity and charm, with a recent emphasis on brighter, cheerful tones.\n\nOverall, the user embodies a sophisticated, style-conscious approach to headbands, prioritizing design, comfort, and quality while remaining attuned to trends and unique aesthetics.",
  "metrics": {
    "rouge1_f": 0.16149068322981364,
    "rouge2_f": 0.01663201663201663,
    "rougeL_f": 0.08281573498964803,
    "meteor": 0.09471191791633782,
    "bleu1": 0.12716297669561785,
    "bleu2": 0.024981672297419,
    "bleu3": 0.005356303380718495,
    "bleu4": 0.0024823518368215815,
    "bertscore_precision": 0.3791540861129761,
    "bertscore_recall": 0.3982376754283905,
    "bertscore_f1": 0.3884616196155548
  }
}