{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/10/29\nAverage Rating: 3.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Whit Stillman'], 'Producers': ['Katie Holly', 'Lauranne Bourrachot', 'Whit Stillman'], 'Starring': ['Kate Beckinsale', 'Chloe Sevigny', 'Xavier Samuel'], 'Studio': ['Amazon Studios']}\nReview Text: Tricky to follow the dialogue\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "After Earth [Blu-ray + DVD]\nJaden Smith  (Actor),     Will Smith  (Actor, Producer),     M. Shyamalan  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['A crash landing leaves Kitai Raige (Jaden Smith) and his legendary father Cypher (Will Smith) stranded on Earth, 1,000 years after cataclysmic events forced humanity’s escape. With Cypher injured, Kitai must embark on a treacherous journey to signal for help. They must learn to work together and trust each other, if they want any chance of returning home.']\n{'Genre': 'Sci-Fi, Adventure', 'Format': 'AC-3, Closed-captioned, Color, Dolby, Dubbed, Subtitled, Widescreen', 'Contributor': 'Chris Gonzalez, Demetrice Jackson, Philippe Badreau, Sincere Bobb, Jada Pinkett Smith, Sacha Dhawan, Lincoln Lewis, Olia Voronkova, Zoë Kravitz, M. Shyamalan, James Lassiter, Caleeb Pinkett, Jada Smith, Jaden Martin, Will Smith, Kristofer Hivju, Monika Jolly, Glenn Morshower, Chris Geere, Sophie Okonedo, David Denman, Jaden Smith, Nova Prime, Inc., Diego KlattenhoffChris Gonzalez, Demetrice Jackson, Philippe Badreau, Sincere Bobb, Jada Pinkett Smith, Sacha Dhawan, Lincoln Lewis, Olia Voronkova, Zoë Kravitz, M. Shyamalan, James Lassiter, Caleeb Pinkett, Jada Smith, Jaden Martin, Will Smith, Kristofer Hivju, Monika Jolly, Glenn M…  See more', 'Language': 'English', 'Runtime': '1 hour and 41 minutes', 'Digital Copy Expiration Date': 'December 31, 2016', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.8 inches; 3.2 Ounces', 'Audio Description': 'English', 'Item model number': '27597388', 'Director': 'M. Shyamalan', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'October 8, 2013', 'Actors': 'Jaden Smith, Will Smith, Zoë Kravitz, Sophie Okonedo, Glenn Morshower', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'James Lassiter, Jada Pinkett Smith, Caleeb Pinkett, Will Smith, Jada Smith', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nGreat adventure flick. Rare to see a movie that handles issues between father and son and one that showcases both as really willing to try. Didn't make a joke out of Dad or of the son\nSurprisingly entertaining!!!\nStar Trek Into Darkness\nChris Pine  (Actor),     Zachary Quinto  (Actor),     J.J. Abrams  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis. With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew. The digital code works irrespective of the expiry date.']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.7 inches; 10.72 Ounces', 'Item model number': '139863', 'Director': 'J.J. Abrams', 'Media Format': 'Blu-ray, AC-3, Color, Dubbed, Dolby, Digital_copy, Widescreen, Subtitled', 'Run time': '2 hours and 12 minutes', 'Release date': 'September 10, 2013', 'Actors': 'Chris Pine, Zachary Quinto, Karl Urban, Zoe Saldana, Simon Pegg', 'Dubbed': 'French, Spanish, Portuguese', 'Subtitles': 'English, French, Spanish, Portuguese', 'Studio': 'PARAMOUNT', 'Number of discs': '2'}\nLoved the story, villain was evil, yet elegant. A lot of humor but not over the top. Great movie for a Saturday night with the family\nGreat adventure story\nWorld War Z (Blu-ray + DVD + Digital HD)\nBrad Pitt  (Actor),     Mireille Enos  (Actor),     Marc Forster  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'A former UN investigator is thrust into the middle of trying to stop what could be the end of the world. Worldwide destruction sends him around the globe seeking clues about what they are fighting and what it will take to defeat it, as he tries to save the lives of billions of strangers, as well as his own beloved family.', 'Amazon.com', 'Few monsters lend themselves better to allegory than the zombie. In the years since George Romero first set the shambling mold with', 'Night of the Living Dead', ', filmmakers have been using the undead as handy substitutes for concepts as varied as mall-walking consumers, punk rockers, soccer hooligans, and every political movement imaginable. (All this, plus brain chomping.)', 'World War Z', \", the mega-scale adaptation of Max Brooks's richly detailed faux-historical novel, presents a zombie apocalypse on a ginormous level never seen before on film. Somehow, however, the sheer size of the scenario, coupled with a distinct lack of visceral explicitness, ends up blunting much of the metaphoric impact. While the globe-hopping action certainly doesn't want for spectacle, viewers may find themselves wishing there was something more to, you know, chew on. Director Marc Forster and his team of screenwriters (including J. Michael Straczynski and\", 'Lost', \"'s Damon Lindelof) have kept the basic gist of the source material, in which an unexplained outbreak results in a rapidly growing army of the undead. Unlike the novel's sprawling collection of unrelated narrators, however, the film streamlines the plot, following a retired United Nations investigator (Brad Pitt) who must leave his family behind in order to seek out the origins of the outbreak. While the introduction of a central character does help connect some of Brooks's cooler ideas, it also has the curious effect of narrowing the global scale of the crisis. By the time of the third act, in which Pitt finds himself under siege in a confined space, the once epic scope has decelerated into something virtually indistinguishable from any other zombie movie. Even if it's not a genre changer, though,\", 'World War Z', \"still has plenty to distinguish itself, including a number of well-orchestrated set pieces--this is a movie that will never be shown on airplanes--and the performances, with Pitt's gradually eroding calm strengthened by a crew of supporting actors (including Mireille Enos, James Badge Dale, and a fantastically loony David Morse) who manage to make a large impression in limited time. Most importantly, it's got those tremendous early scenes of zombie apocalypse, which display a level of frenetic chaos that's somehow both over-the-top and eerily plausible. When the fleet-footed ghouls start dogpiling en masse, even the most level-headed viewer may find themselves checking the locks and heading for the basement.\", '--Andrew Wright']\n{'Genre': 'Action & Adventure/Thrillers', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copyMultiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy  See more', 'Contributor': 'Brad Pitt, Daniella Kertesz, Mireille Enos, Marc Forster', 'Language': 'English', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.4 x 0.6 x 6.7 inches; 2.61 Ounces', 'Item model number': '165757', 'Director': 'Marc Forster', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen, Digital_copy', 'Run time': '2 hours and 3 minutes', 'Release date': 'September 17, 2013', 'Actors': 'Brad Pitt, Mireille Enos, Daniella Kertesz', 'Dubbed': 'French, Portuguese, Spanish', 'Subtitles': 'Spanish, Portuguese, French, English', 'Studio': 'Paramount', 'Number of discs': '2'}\nA pretty good adventure movie. Loved the way the zombies moved, like a swarm of ants but fast. Brad Pitt was perfect for the lead. Looking forward to the sequel\nVisually stunning\nSkyfall [Blu-ray]\nDaniel Craig  (Actor),     Judi Dench  (Actor),     Sam Mendes  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', \"Daniel Craig is back as James Bond 007 in Skyfall, the 23rd adventure in the longest-running film franchise of all time. In Skyfall, Bond's loyalty to M is tested as her past comes back to haunt her. As MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.\", 'Amazon.com', 'For longtime viewers of the James Bond films, one of the larger pleasures of the series--aside from the eternally awesome jetpacks and ejector seats--has been watching it adapt itself to the times, scooting its unflappable central character past the Cold War to the Disco Age to beyond the Millennium seemingly without breaking a sweat.', 'Skyfall', \", Daniel Craig's third turn in the tux, lands itself firmly in the utmost tier of the franchise, delivering the expected goods as well as a rather unusual vein of introspection. Celebrating the 50th year of Bond's existence, it continues cultivating the gritty, back-to-basics vibe of\", 'Casino Royale', ', while also slowly letting some of the more fancifully escapist elements in through the filters. Kicking off with a humdinger of a car/bike/train chase in Istanbul, the plot finds an aging 007 on uneasy footing, struggling to get back in the game while his boss M (a magnificent Judi Dench) is marked for death by a mysterious assassin. As Bond draws closer to his target (Javier Bardem, having an absolute blast), he uncovers some details that draw uncomfortably close to his own origins. Director Sam Mendes, an Oscar winner for', 'American Beauty', ', ably brings his game to the blockbuster level, keeping the globe-hopping narrative moving at a swift pace while also allowing plenty of room for the cast (including newcomers Ralph Fiennes and Naomie Harris) to do their thing. For all of the talent assembled on both sides of the camera, however,', 'Skyfall', \"'s true MVP proves to be director of photography Roger Deakins, who gives an astonishingly ravishing look to the proceedings, culminating in a battle in a Shanghai skyscraper that may very well be the best fight scene the series has ever had. By the time of the surprisingly moving finale, set in a location far, far away from the standard Evil Lair, Mendes and Craig and Co. have reminded the viewer of exactly what these films can do. Where it ends is a perfect beginning. Extras on the disc include a wry and informative director's track, a more laid-back commentary from the producers and production designer, and an exhaustively detailed look behind the scenes. If you want to learn more about Bardem's wig, that information is available. --\", 'Andrew Wright']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Digital_copy', 'Contributor': 'Javier Bardem, Sam Mendes, Albert Finney, Naomie Harris, Rory Kinnear, Judi Dench, Ralph Fiennes, Berenice Marlohe, Ben Whishaw, Daniel CraigJavier Bardem, Sam Mendes, Albert Finney, Naomie Harris, Rory Kinnear, Judi Dench, Ralph Fiennes, Berenice Marlohe, Ben Whishaw, Daniel Craig  See more', 'Language': 'English', 'Runtime': '2 hours and 23 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 6.7 inches; 0.01 Ounces', 'Item model number': 'MGMV128541BR', 'Director': 'Sam Mendes', 'Media Format': 'Multiple Formats, Blu-ray, Color, Widescreen, Digital_copy', 'Run time': '2 hours and 23 minutes', 'Release date': 'February 12, 2013', 'Actors': 'Daniel Craig, Judi Dench, Javier Bardem, Ralph Fiennes, Naomie Harris', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish, Bambara', 'Studio': 'Twentieth Century Fox', 'Number of discs': '2'}\nBest Bond movie ever, except that maybe he will be retiring from Bond. He really is quit perfect in the roll, he plays the character with an edge then a softer pretty boy version. He'll be missed\nDaniel Craig rocks as Bond!!!\nThe Uninvited (The Criterion Collection) [Blu-ray]\nRay Milland  (Actor),     Ruth Hussey  (Actor),     Lewis Allen  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['A pair of siblings (Ministry of Fear’s Ray Milland and The Philadelphia Story’s Ruth Hussey) from London purchase a surprisingly affordable, lonely cliff-top house in Cornwall, only to discover that it actually carries a ghostly price; soon they’re caught up in a bizarre romantic triangle from beyond the grave. Rich in atmosphere, THE UNINVITED, directed by Lewis Allen (Suddenly), was groundbreaking for the seriousness with which it treated the haunted-house genre, and it remains an elegant and eerie experience, featuring a classic score by Victor Young (Written on the Wind). A tragic family past, a mysteriously locked room, cold chills, bumps in the night—this gothic Hollywood classic has it all.']\n{'Genre': 'Horror', 'Format': 'Black & White, Full Screen, NTSC, Subtitled', 'Contributor': 'Ray Milland, Ruth Hussey, Donald Crisp, Lewis Allen', 'Language': 'English', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.37:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.88 Ounces', 'Item model number': 'CRRN2328BR', 'Director': 'Lewis Allen', 'Media Format': 'Black & White, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 39 minutes', 'Release date': 'October 22, 2013', 'Actors': 'Ray Milland, Ruth Hussey, Donald Crisp', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nBut the house on the cliff by the sea is gorgeous and perfect  Love the old black and white movies, and this one has some beautiful sets and scenery\nSpooky old story\nEnchanted [Blu-ray + DVD]\nAmy Adams  (Actor),     Patrick Dempsey  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"A fairy tale comes to life in this thoroughly original Disney Classic. And the sights and sounds are even more stunning on Disney Blu-ray. Drawing inspiration from its classic heritage, Disney creates an inspired story unlike any you've experienced before. Filled with excitement, fun and spectacular music from the legendary Alan Menken, ENCHANTED is the ultimate fish-out-of-water adventure. For princess-to-be Giselle, life is a fairy tale -- until she's banished from the animated land of Andalasia and thrust into the very unmagical, live-action world of modern-day Manhattan. When a cynical, no-nonsense divorce lawyer comes to her aid, little does he realize this joyful, wide-eyed innocent is about to enchant him. ENCHANTED -- the musical comedy that casts a more entrancing and dazzling spell in Blu-ray(TM) High Definition.\"]\n{'Genre': 'Musical', 'Format': 'Multiple Formats, Blu-ray, AC-3, Dolby, Dubbed, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Rachel Covey, Tonya Pinkins, Amy Adams, Elizabeth Mathis, Fred Tatasciore, William Huntley, Kevin Lima, Jeff Bennett, Bill Kelly, Idina Menzel, Courtney Williams, Samantha Ivers, Timothy Spall, James Marsden, Susan Sarandon, Edmund Lyndeck, Teala Dunn, Patrick Dempsey, Emma Rose Lima, Isiah Whitlock, Jr.Rachel Covey, Tonya Pinkins, Amy Adams, Elizabeth Mathis, Fred Tatasciore, William Huntley, Kevin Lima, Jeff Bennett, Bill Kelly, Idina Menzel, Courtney Williams, Samantha Ivers, Timothy Spall, James Marsden, Susan Sarandon, Edmund Lyndeck, Teala Dunn, Patrick De…   See more', 'Language': 'English', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '786936811308', 'Director': 'Kevin Lima', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Dolby, Dubbed, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 47 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Amy Adams, Patrick Dempsey, James Marsden, Timothy Spall, Idina Menzel', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Bill Kelly', 'Country of Origin': 'USA', 'Number of discs': '2'}\nGreat movie at a great price.\nFive Stars\nSalmon Fishing in the Yemen\nEwan McGregor  (Actor),     Emily Blunt  (Actor),     Lasse Hallström  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From the beloved director of Chocolat and the Oscar®-winning screenwriter of Slumdog Millionaire (2008) comes the inspirational comedy Salmon Fishing in the Yemen. A visionary Sheikh (Amr Waked) believes his passion for the peaceful pastime of salmon fishing can enrich the lives of his people, and he dreams of bringing the sport to the not so fish-friendly desert. Willing to spare no expense, he instructs his representative (Emily Blunt) to turn the dream into reality, an extraordinary feat that will require the involvement of Britain's leading fisheries expert (Ewan McGregor), who happens to think the project both absurd and unachievable. That is, until the Prime Minister's overzealous press secretary (Kristin Scott Thomas) latches onto it as a 'good will' story. Now, this unlikely team will put it all on the line and embark on an upstream journey of faith and fish to prove the impossible, possible.\"]\n{'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.4 x 5.3 x 6.7 inches; 5.92 Ounces', 'Item model number': 'Relay time: 107min', 'Director': 'Lasse Hallström', 'Media Format': 'AC-3, Blu-ray, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 47 minutes', 'Release date': 'July 17, 2012', 'Actors': 'Ewan McGregor, Emily Blunt, Kristin Scott Thomas, Amr Waked, Tom Mison', 'Subtitles': 'English, Spanish', 'Producers': 'Paul Webster', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nOne of the sweetest movies around.\nFive Stars\nPirates of the Caribbean: On Stranger Tides (Two-Disc Blu-ray / DVD Combo in Blu-ray Packaging)\nJohnny Depp  (Actor),     Ian McShane  (Actor),     Rob Marshall  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"From Disney and Producer Jerry Bruckheimer comes all the fun, epic adventure and humor that ignited the original. Johnny Depp returns as Captain Jack Sparrow in Pirates Of The Caribbean: On Stranger Tides. A tale of truth, betrayal, youth, demise - and mermaids! When Jack crosses paths with a woman from his past (Penelope Cruz), he's not sure if it's love, or if she's a ruthless con artist using him to find the fabled Fountain of Youth. Forced aboard the ship of the most feared pirate ever, Jack doesn't know who to fear more -Blackbeard (Ian McShane) or the woman from his past. Directed by Rob Marshall, it's filled with eye-popping battle scenes, mystery and all-out wit.\", 'Versions of', 'Pirates of the Caribbean: On Stranger Tides', \"Title Pirates of the Caribbean: On Stranger Tides (DVD) Pirates of the Caribbean: On Stranger Tides (Two-Disc Blu-ray / DVD Combo in Blu-ray Packaging) Pirates of the Caribbean: On Stranger Tides (Two-Disc Blu-ray / DVD Combo in DVD Packaging)  Pirates of the Caribbean: On Stranger Tides (Five-Disc Combo: Blu-ray 3D / Blu-ray / DVD / Digital Copy) Pirates of the Caribbean Four-Movie Collection (Blu-ray + Digital Copy) Release Date 10/18/2011 10/18/2011 10/18/2011 10/18/2011 10/18/2011 Format/ Number of discs One Disc: DVD Two Discs: Blu-ray + DVD Two Discs: Blu-ray + DVD Five Discs: Blu-ray + Blu-ray 3D+ DVD + Digital Copy 15 disc total: Curse of the Black Pearl Two Discs: BD + Digital Copy Dead Man's Chest Two Discs: Disc BD + Digital Copy At World's End Two Discs: BD + Digital Copy On Stranger Tides Blu-ray 3D + 2-Disc BD + BD Bonus Disc + DVD + Digital Copy Blu-ray 3D No No No Yes Yes (On\", 'Stranger Tides', 'Only) Blu-ray  No Yes Yes Yes Yes DVD Yes Yes Yes Yes Yes (On', 'Stranger Tides', 'Only) Digital Copy No No No Yes Yes Bonus Features(Bonus Material Not Rated) Bloopers of the CaribbeanLEGO Animated Shorts: Captain', \"Jack's Brick TalesAudio Commentary by Director Rob Marshall\", '*Not available in all territories. Features subject to change', 'Same as DVD plus: Disney Second Screen', '*Not available in all territories. Features subject to change', 'Same as DVD plus: Disney Second Screen         *', 'Not available in all territories. Features subject to change.', 'Same as Blu-ray / DVD Combo pack plus: Under the Scene: Bringing Mermaids to Life Legends of On Stranger Tides In Search of the Fountain Last Sail, First Voyage     *', 'Not available in all territories. Features subject to change.', 'Same as', 'Pirates of the Caribbean: On Stranger Tides (Five-Disc Combo)', 'plus: Digital Copies of first 3 films (never before released) 2-Disc Blu-rays of first 3 movies including all previous bonus All new Blu-ray bonus disc which includes an all-new short film and more!  *', 'Not available in all territories. Features subject to change.']\n{'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Johnny Depp, Ian McShane, Rob Marshall', 'Language': 'French, English (Dolby Digital 2.0), Spanish, English (DTS-HD High Res Audio)', 'Runtime': '2 hours and 16 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': 'WD10792500BR', 'Director': 'Rob Marshall', 'Media Format': 'Multiple Formats, Blu-ray, AC-3, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 16 minutes', 'Release date': 'October 18, 2011', 'Actors': 'Johnny Depp, Ian McShane', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Walt Disney Pictures', 'Country of Origin': 'USA', 'Number of discs': '2'}\nGreat adventure flick.\nFive Stars\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'Andy Goddard', 'Jeremy Webb', 'David Evans'], 'Producers': ['Liz Trubridge', 'Gareth Neame', 'Julian Fellowes', 'Rebecca Eaton'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nThe. Best series ever!\nBest series ever\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Sam Mendes'], 'Producers': ['Barbara Broccoli', 'Michael G. Wilson'], 'Starring': ['Daniel Craig', 'Christoph Waltz', 'Lйa Seydoux'], 'Studio': ['MGM']}\nBest Bond ever!\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn'], 'Studio': ['BritBox']}\nNear perfect movie\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Whit Stillman'], 'Producers': ['Katie Holly', 'Lauranne Bourrachot', 'Whit Stillman'], 'Starring': ['Kate Beckinsale', 'Chloe Sevigny', 'Xavier Samuel'], 'Studio': ['Amazon Studios']}\nTricky to follow the dialogue\nFour Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user continues to appreciate high-quality films and television series across various genres, particularly favoring Sci-Fi, Adventure, and Horror. Their interest in period dramas remains strong, as evidenced by their recent purchase, which reflects a fondness for productions that showcase notable performances and high production values.\n\n- **Themes:** The exploration of complex family dynamics and relationships continues to be a central focus. The user is increasingly drawn to uplifting narratives that effectively blend humor with emotional depth, seeking stories that offer both excitement and genuine heart.\n\n- **Emotional Engagement:** Demonstrating a commitment to emotional resonance, the user values substantial character development in their selections. Their most recent review emphasizes a preference for narratives that balance joy with depth, reinforcing their sophisticated taste in storytelling.\n\n- **Rating Behavior:** The user maintains a pattern of high ratings, often reflecting their enjoyment of engaging and heartwarming productions. Their recent interaction indicates an appreciation for thoughtful, albeit challenging narratives that prompt deeper engagement.\n\n- **Production Quality:** With a keen eye for acclaimed talent and high production values, the user values both thrilling and emotionally impactful storytelling. Their dedication to quality entertainment encompasses both classic and innovative works, celebrating adventurous and whimsical narratives.\n\nOverall, the user's refined taste continues to prioritize adventure, emotional depth, and standout performances, further enriched by their ongoing engagement with intricate storytelling.",
  "metrics": {
    "rouge1_f": 0.05385002516356316,
    "rouge2_f": 0.004531722054380664,
    "rougeL_f": 0.033719174635128336,
    "meteor": 0.016264373769812494,
    "bleu1": 9.160544581507443e-09,
    "bleu2": 3.020389364334579e-09,
    "bleu3": 4.1238659031398284e-10,
    "bleu4": 1.5251350856965518e-10,
    "bertscore_precision": 0.34059491753578186,
    "bertscore_recall": 0.48599207401275635,
    "bertscore_f1": 0.40050581097602844
  }
}