{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Aloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nReview Date: 2020/07/10\nStore: CIMIY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nReview Text: The description for this Aloe Vera Gel by CIMIY Skin Care confuses me a little. One of the uses suggested by the manufacturer is to put the gel on before going outside, “which can protect skin from sunburns.” This gel has hyaluronic acid listed as an ingredient, which can actually make skin even more sensitive to UV rays.<br /><br />Aloe Vera is great for soothing sunburns *after* exposure. This gel absorbed into my skin after about a minute, without leaving behind a sticky or tacky feeling. I’ve used some aloe vera gels that have left me a sticky mess, but not this one. So I like the quick absorption.<br /><br />The gel does have a slight scent to it. It’s a fresh-smelling scent that sticks around for a while.<br /><br />This Aloe Vera gel would also be great for homemade hand sanitizer.<br /><br />This gel is manufactured in China.\nReview Title: Aloe Vera Gel\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Water Flosser Cordless Oral Irrigator Portable Rechargeable Dental Flossers with 5 Modes & 6 Tips Water Flossing with 300ml Water Tank for Home and Travel, Braces & Bridges Care (Blue)\nDuomishu\n{'Brand': 'Duomishu', 'Power Source': 'Battery Powered', 'Special Feature': 'Por, Multiple Operation Modes, Multiple Tips', 'Unit Count': '1 Count', 'Tank Volume': '300 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.9 x 5 x 3.1 inches; 1.2 Pounds', 'Item model number': 'hf-6', 'Batteries': '1 Lithium Ion batteries required. (included)', 'UPC': '786738939194', 'Manufacturer': 'Duomishu'}\nIf you’ve never used a water flosser before, there’s a definite learning curve. Expect to get wet the first few times, if not more. The learning curve and mess is worth it -- my mouth generally feels cleaner after using one -- but I don’t love this particular model.<br /><br />I wanted a water flosser that wouldn’t take up a lot of space on my bathroom counter. This one is a sort of all-in-one, with the reservoir built into the handle, but I kept getting water bubbles in the tank/tip, which made flossing take a lot longer.<br /><br />There’s only 3 speeds: low, medium, and high. The low is quite low. And because of where the speed switch button is, it’s really easy to accidentally switch speeds while using the flosser.<br /><br />The flosser charges via USB, but with a proprietary end (not A or C or anything like that).\nCordless Water Flosser\nPharmacopia Tangerine-Flavored Lip Balm - Set of 2, 0.25oz - Nourishing Herbal Lip Elixir with 100% Natural and Certified Organic Ingredients\nPharmacopia\n{'Brand': 'Pharmacopia', 'Item Form': 'Balm', 'Finish Type': 'Natural', 'Skin Type': 'Dry', 'Product Benefits': 'Hydrating,Soothing,Nourishing', 'Package Dimensions': '3.6 x 1.7 x 0.7 inches; 0.25 Ounces', 'UPC': '087819800366'}\nI spend 99% of my life with chapped lips, so I’m always looking for a chapstick or lip balm that will actually work.<br /><br />I was intrigued by the hemp oil in the Pharmacopia Tangerine-Flavored Lip Balm. But not all of the ingredients are listed in the product information. I am allergic to beeswax, which is the second ingredient in the lip balm. So I was unable to use it.<br /><br />I’m including a picture of the tube, but for reference, here are the ingredients: helianthus annuus (sunflower) oil, beeswax/cire d’abeille, olea europaea (extra virgin olive) oil, aroma (flavor), cannabis sativa (hemp) seed oil, rosmarinus officinalis (rosemary) leaf extract, tocopherol (vitamin E), aloe barbadensis.\nPharmacopia Tangerine-Flavored Lip Balm\nKale Firm & Smooth Body Lotion - Superfood Infused Firming Body Lotion with Kale. 6.8 fl.oz, Anti-Aging Moisturizing Lotion For All Skin Types\nCancun Collection\n{'Brand': 'Cancun Collection', 'Item Form': 'Lotion', 'Unit Count': '6.8 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Package Dimensions': '7.5 x 4 x 1.1 inches; 8.01 Ounces', 'UPC': '659436986671'}\nKale Leaf Extract (Brassica Oleracea Acephala) is the 14th ingredient listed out of 23 for the Cancun Collection Kale Firm & Smooth Body Lotion. This lotion is made in Canada.<br /><br />The lotion absorbed quickly into my skin, but did leave behind a slightly tacky feel for about 5 minutes after application.<br /><br />It’s currently the middle of winter where I am, so I was able to see just how moisturizing the lotion is for me when I already had dry skin. The lotion has a medium-weight consistency and gets the job done for about half the day.<br /><br />What I don’t like about this lotion is the scent. The scent is subtle, sort of like vanilla coconut, and it’s fine at first. But the scent lingers for several hours, and after that time, I’ve had enough of it.\nCancun Collection Kale Firm & Smooth Body Lotion\nWorkman's Friend Ultimate Hand Care Bundle\nWORKMAN'S FRIEND\n{'Package Dimensions': '9 x 4.5 x 2.3 inches; 1.3 Pounds', 'UPC': '023857030709'}\nFor me, I like the Hand Cleaner and Barrier Cream the most in this bundle. I found that the Superior Healing Hand Cream was just average. These products might seem dude oriented, but they work for anyone.<br /><br />Superior Hand Cleaner with Activated Charcoal (individually 4/5 stars):<br />--Works great to remove grease and odors. I like the pumice in the cleanser, as it gives me a real clean, scrubby feeling.<br /><br />Superior Barrier Skin Cream (individually 4/5 stars):<br />--Actually does help prevent grease or oil from staining my hands. Also helps keep my fingernails from becoming a dirt mess when I weed without gloves. But doesn’t provide much of a moisturizing effect.<br /><br />Superior Healing Hand Cream (individually 3/5 stars):<br />--Truly unscented hand lotion. But it’s just average as a lotion -- it took a few days of 2-3x per day applications to help heal my cracked hands.\nWorkman's Friend Ultimate Hand Care Bundle\nBeast Blue Ultra Cooling Body Wash, 6 oz -Beast\nTame the Beast\n{'Item Form': 'Cream', 'Skin Type': 'Dry', 'Brand': 'Tame the Beast', 'Scent': 'Green Tea', 'Age Range (Description)': 'Adult', 'Package Dimensions': '7 x 3 x 2 inches; 7.2 Ounces', 'UPC': '817662018539'}\nA friendly word of warning: don’t use Beast Blue Cooling Body Wash down south unless you like tingly body parts.<br /><br />The consistency of the body wash is a little watery, so it’s easy to squeeze out more than you might want. It lathers well and rinses clean without leaving behind a residue.<br /><br />I really like the smell of the body wash. It’s a strong, crisp scent that really does wake you up. My nose tingled the first time I smelled it. The scent is hard to describe. I can’t pick out any individual notes, just a crisp smell that made me go “Wow, this smells cool and different.”\nBeast Blue Cooling Body Wash\nAloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nCIMIY\n{'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nThe description for this Aloe Vera Gel by CIMIY Skin Care confuses me a little. One of the uses suggested by the manufacturer is to put the gel on before going outside, “which can protect skin from sunburns.” This gel has hyaluronic acid listed as an ingredient, which can actually make skin even more sensitive to UV rays.<br /><br />Aloe Vera is great for soothing sunburns *after* exposure. This gel absorbed into my skin after about a minute, without leaving behind a sticky or tacky feeling. I’ve used some aloe vera gels that have left me a sticky mess, but not this one. So I like the quick absorption.<br /><br />The gel does have a slight scent to it. It’s a fresh-smelling scent that sticks around for a while.<br /><br />This Aloe Vera gel would also be great for homemade hand sanitizer.<br /><br />This gel is manufactured in China.\nAloe Vera Gel",
  "profile": "**User Summary:**\n\n- **Health & Hygiene Focus**: The user prioritizes oral hygiene, lip care, and body care products that offer a refreshing experience.\n- **Ingredient Awareness**: Demonstrates a strong awareness of ingredients, particularly due to allergies, favoring transparent and safe personal care items. This includes a keen eye for products like aloe vera, which is known for soothing properties.\n- **Portability & Space Efficiency**: Values portable, travel-friendly options with compact designs, reflecting a minimalist approach to personal care.\n- **Ease of Use**: Prefers intuitive designs that minimize inconvenience, particularly as they navigate the learning curves of new hygiene tools.\n- **Functional Features**: Seeks products with multiple capabilities but values straightforward controls to avoid accidental adjustments.\n- **Charging Convenience**: Prefers USB charging solutions for practicality in use.\n- **Skepticism Towards Claims**: Approaches new products with caution, focusing on solid performance and ingredient reliability, often critically assessing marketing messages.\n- **Scent Sensitivity**: Sensitive to scents but is open to unique, refreshing fragrances that are not overpowering.\n- **Additional Preferences**: Recently expressed appreciation for hand care products that effectively remove dirt and can be used in multifunctional ways, supporting an active lifestyle. Shows an interest in versatile products that aid in post-sun exposure care while maintaining ease of use. \n\nOverall, the user values effectiveness, convenience, ingredient clarity, and mindful sensory experiences in their personal care choices.",
  "metrics": {
    "rouge1_f": 0.13986013986013987,
    "rouge2_f": 0.012605042016806725,
    "rougeL_f": 0.060139860139860134,
    "meteor": 0.05727616919073988,
    "bleu1": 0.004748560868300954,
    "bleu2": 0.0012332642505876973,
    "bleu3": 0.0003938590962734158,
    "bleu4": 0.00012526997186852116,
    "bertscore_precision": 0.37517186999320984,
    "bertscore_recall": 0.48718011379241943,
    "bertscore_f1": 0.42390176653862
  }
}