{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Pharmacopia Tangerine-Flavored Lip Balm - Set of 2, 0.25oz - Nourishing Herbal Lip Elixir with 100% Natural and Certified Organic Ingredients\nReview Date: 2020/02/27\nStore: Pharmacopia\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Pharmacopia', 'Item Form': 'Balm', 'Finish Type': 'Natural', 'Skin Type': 'Dry', 'Product Benefits': 'Hydrating,Soothing,Nourishing', 'Package Dimensions': '3.6 x 1.7 x 0.7 inches; 0.25 Ounces', 'UPC': '087819800366'}\nReview Text: I spend 99% of my life with chapped lips, so I’m always looking for a chapstick or lip balm that will actually work.<br /><br />I was intrigued by the hemp oil in the Pharmacopia Tangerine-Flavored Lip Balm. But not all of the ingredients are listed in the product information. I am allergic to beeswax, which is the second ingredient in the lip balm. So I was unable to use it.<br /><br />I’m including a picture of the tube, but for reference, here are the ingredients: helianthus annuus (sunflower) oil, beeswax/cire d’abeille, olea europaea (extra virgin olive) oil, aroma (flavor), cannabis sativa (hemp) seed oil, rosmarinus officinalis (rosemary) leaf extract, tocopherol (vitamin E), aloe barbadensis.\nReview Title: Pharmacopia Tangerine-Flavored Lip Balm\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Water Flosser Cordless Oral Irrigator Portable Rechargeable Dental Flossers with 5 Modes & 6 Tips Water Flossing with 300ml Water Tank for Home and Travel, Braces & Bridges Care (Blue)\nDuomishu\n{'Brand': 'Duomishu', 'Power Source': 'Battery Powered', 'Special Feature': 'Por, Multiple Operation Modes, Multiple Tips', 'Unit Count': '1 Count', 'Tank Volume': '300 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.9 x 5 x 3.1 inches; 1.2 Pounds', 'Item model number': 'hf-6', 'Batteries': '1 Lithium Ion batteries required. (included)', 'UPC': '786738939194', 'Manufacturer': 'Duomishu'}\nIf you’ve never used a water flosser before, there’s a definite learning curve. Expect to get wet the first few times, if not more. The learning curve and mess is worth it -- my mouth generally feels cleaner after using one -- but I don’t love this particular model.<br /><br />I wanted a water flosser that wouldn’t take up a lot of space on my bathroom counter. This one is a sort of all-in-one, with the reservoir built into the handle, but I kept getting water bubbles in the tank/tip, which made flossing take a lot longer.<br /><br />There’s only 3 speeds: low, medium, and high. The low is quite low. And because of where the speed switch button is, it’s really easy to accidentally switch speeds while using the flosser.<br /><br />The flosser charges via USB, but with a proprietary end (not A or C or anything like that).\nCordless Water Flosser\nPharmacopia Tangerine-Flavored Lip Balm - Set of 2, 0.25oz - Nourishing Herbal Lip Elixir with 100% Natural and Certified Organic Ingredients\nPharmacopia\n{'Brand': 'Pharmacopia', 'Item Form': 'Balm', 'Finish Type': 'Natural', 'Skin Type': 'Dry', 'Product Benefits': 'Hydrating,Soothing,Nourishing', 'Package Dimensions': '3.6 x 1.7 x 0.7 inches; 0.25 Ounces', 'UPC': '087819800366'}\nI spend 99% of my life with chapped lips, so I’m always looking for a chapstick or lip balm that will actually work.<br /><br />I was intrigued by the hemp oil in the Pharmacopia Tangerine-Flavored Lip Balm. But not all of the ingredients are listed in the product information. I am allergic to beeswax, which is the second ingredient in the lip balm. So I was unable to use it.<br /><br />I’m including a picture of the tube, but for reference, here are the ingredients: helianthus annuus (sunflower) oil, beeswax/cire d’abeille, olea europaea (extra virgin olive) oil, aroma (flavor), cannabis sativa (hemp) seed oil, rosmarinus officinalis (rosemary) leaf extract, tocopherol (vitamin E), aloe barbadensis.\nPharmacopia Tangerine-Flavored Lip Balm",
  "profile": "**User Summary:**\n\n- **Health & Hygiene Focus**: The user prioritizes oral hygiene, as indicated by the purchase of a water flosser, and extends this concern to lip care, seeking products that effectively combat chapped lips.\n- **Ingredient Awareness**: Displays a keen awareness of ingredients due to specific allergies (e.g., beeswax), suggesting a preference for transparency and safety in personal care products.\n- **Portability**: Prefers portable and travel-friendly products, aligning with an active lifestyle or frequent travel.\n- **Space Efficiency**: Values compact design, indicating a desire for products that do not occupy much counter space.\n- **Ease of Use**: Finds the learning curve of new hygiene tools challenging and favors intuitive operation to minimize inconvenience.\n- **Functional Features**: Interested in multiple operational modes and settings for customization, yet prefers straightforward controls to avoid accidental adjustments.\n- **Charging Convenience**: Favors USB charging options and is critical of proprietary connectors, reflecting an awareness of practicality in charging solutions.\n- **Skepticism Towards Claims**: Demonstrates a cautious approach to new products, looking for those with solid performance and reliable ingredients rather than marketing fluff.\n\nOverall, the user seeks a blend of effectiveness, convenience, and safety in personal care tools, alongside simplicity in design and ingredient clarity.",
  "metrics": {
    "rouge1_f": 0.24115755627009647,
    "rouge2_f": 0.03225806451612903,
    "rougeL_f": 0.09646302250803858,
    "meteor": 0.11070918182710196,
    "bleu1": 0.10455039957809502,
    "bleu2": 0.0305569164712648,
    "bleu3": 0.010151837001880434,
    "bleu4": 0.0032935674515866954,
    "bertscore_precision": 0.37686455249786377,
    "bertscore_recall": 0.4398934245109558,
    "bertscore_f1": 0.4059470295906067
  }
}