{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/12/23\nAverage Rating: 4.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Peter Jackson'], 'Producers': ['Peter Jackson', 'Carolyn Blackwood', 'Philippa Boyens', 'Carolynne Cunningham', 'Matthew Dravitzki', 'Toby Emmerich', 'Callum Greene', 'Alan F. Horn', 'Ken Kamins', 'Eric Monette'], 'Starring': ['Ian Mckellen', 'Martin Freeman', 'Benedict Cumberbatch'], 'Studio': ['Warner Bros.']}\nReview Text: Awesome!!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Atlas Shrugged: Part One\nPatrick Fischler  (Actor),     Taylor Schilling  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'Ayn Rand\\'s timeless novel of\\xa0rational self-interest\\xa0comes to life for a new millennium.\". The year is 2016, and America is on the verge of economic disaster. The greatest citizens are being targeted, and dark forces are working to bring about America’s final days. Our only hope for salvation lies with Dagny Taggart and Henry Rearden, rugged individualists whose bold ideas may have the power to spark a revolution and reclaim to the American Dream.', 'Amazon.com', 'After years of trying, somebody finally made a film out of Ayn Rand\\'s big-selling novel of \"rational self-interest,\"', 'Atlas Shrugged', '. Well, got a start on it, anyway, with this 2011 release of', 'Part One', \"(of three). The sprawling novel is necessarily telescoped down to size, and the focus is on railroad magnate Dagny Taggart (Taylor Schilling) and her intricate strategies involving a piece of real estate in Colorado, an ongoing economic collapse, and the rugged individualist, Hank Rearden (Grant Bowler), whose new metal alloy might come in handy for laying new track. Of course, the real issue in Rand's scenario is not metal alloy but the fact that government regulation and a misguided sense of collectivism and altruism is strangling the elite members of society, something the movie reminds us of with grim regularity. As a kind of boardroom-plotting movie,\", 'Atlas Shrugged', 'isn\\'t incompetent, and if director Paul Johansson hasn\\'t devised a way to make these heavy-handed discussions come to life, at least it keeps moving along. If you like Rand\\'s objectivist philosophy, you\\'ll bask in the glow of having those ideas reaffirmed, and if you\\'re uninitiated, well, they certainly are laid out there in stark fashion. (And if you find Rand\\'s ideas absurd, you\\'ll find this movie a little like watching a cult meeting.) As to the question \"Who is John Galt?\" you\\'ll have to move on to', 'Atlas Shrugged: Part Two', \", released in 2012, to pick that up--but be ready to work at sorting the plot out anew, because Part One's cast has been replaced by a new roster of actors.\", '--Robert Horton']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': '22914266', 'Director': 'Paul Johansson', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 8, 2011', 'Actors': 'Patrick Fischler, Taylor Schilling, Grant Bowler, Matthew Marsden, Edi Gathegi', 'Subtitles': 'English, Spanish', 'Producers': 'Harmon M. Kaslow, John Aglialoro', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nThis is one of the best movies I have ever seen.  The movie reviewers were way off on this flick.  The actors are outstanding. It is happening right now in our nation!  Wake up America and Europe!\nLook around and smell our future!\nAtlas Shrugged II: The Strike\nSamantha Mathis  (Actor),     Jason Beghe  (Actor),     John Putch  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', \"Part two of Ayn Rand’s groundbreaking novel comes to the screen in this thrilling and powerful drama. The global economy is on the brink of collapse. Brilliant creators, from artists to industrialists, continue to mysteriously disappear. Dagny Taggart, Vice President in Charge of Operations for Taggart Transcontinental, has discovered what may very well be the answer to a mounting energy crisis - a revolutionary motor that could seemingly power the World. But, the motor is dead... there is no one left to decipher its secret... and, someone is watching. It's a race against the clock to find the inventor before the motor of the World is stopped for good.\", 'Amazon.com', \"The USA hurtles toward crisis, infrastructure wobbles, the rich and famous disappear. You just know Atlas is about to shrug. And so the modestly budgeted three-part adaptation of Ayn Rand's massive novel slouches its way into its middle section, as\", 'Atlas Shrugged: Part II', 'picks up where the first one left off, but reshapes its look: the cast members are all new. Thus you might need a scorecard to track the doings of the adorably named Dagny Taggart (Samantha Mathis); she\\'s trying to save her railroad company from the clutches of government regulations, flirting with rugged individualist Hank Rearden (Jason Beghe), and wondering why the heck everybody keeps answering her questions about a mysterious energy-saving gizmo by saying, \"Who is John Galt?\" Say this for the film, it certainly functions as a no-holds-barred delivery system for Ayn Rand\\'s objectivist philosophy, in which the creative elite must reject the mooching ways of the \"looters\" in society (oddly, there\\'s little of Rand\\'s committed atheism in these movies). Despite the fact that most of the actors are upgrades over', 'Part I', \", the middle section feels even clumsier in laying out the cardboard characters and ham-fisted dialogue, or in shifting from talky scenes to tinny digital effects--although Rand's device of slowly teasing out the arrival of this John Galt fellow remains a darned good dramatic gimmick. Esai Morales is nicely on his game, and he gets to deliver the explanation of the title--which, like so much else here, is spelled out in laborious fashion. Although the first two films performed poorly at the box office, the Rand faithful will likely buoy DVD sales;\", 'Part III', 'is promised.', '--Robert Horton']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Jason Beghe, John Putch, Samantha Mathis', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26228956', 'Director': 'John Putch', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'February 19, 2013', 'Actors': 'Samantha Mathis, Jason Beghe', 'Subtitles': 'English, French, Spanish', 'Studio': 'Atlas Distribution Company', 'Number of discs': '1'}\nAwesome movie!  Need to see this or read the book!\nAwesome movie! Need to see this or read the ...\n{'Subtitles': ['None available'], 'Directors': ['Peter Jackson'], 'Producers': ['Peter Jackson', 'Carolyn Blackwood', 'Philippa Boyens', 'Carolynne Cunningham', 'Matthew Dravitzki', 'Toby Emmerich', 'Callum Greene', 'Alan F. Horn', 'Ken Kamins', 'Eric Monette'], 'Starring': ['Ian Mckellen', 'Martin Freeman', 'Benedict Cumberbatch'], 'Studio': ['Warner Bros.']}\nAwesome!!\nFive Stars",
  "profile": "The user displays a strong enthusiasm for thought-provoking films, particularly those exploring themes of individualism, economic philosophy, and objectivism. Their recent high rating and brief, positive review indicate a consistent engagement with quality storytelling and performances, even in films that may diverge from their usual philosophical focus. They maintain high standards for narrative quality and acting, with a preference for films that resonate with societal issues and provoke critical thought.\n\nKey preferences continue to include:\n\n- **Philosophical Engagement**: The user is drawn to films that wrestle with complex social and economic concepts and advocate for rational self-interest and personal empowerment.\n- **Diverse Genre Appreciation**: Their latest interaction suggests an openness to enjoying narratives beyond strictly philosophical themes, while still valuing strong storytelling and character development.\n- **Proactive Advocacy**: Their ongoing interest in objectivist themes indicates a commitment to raising awareness about the pitfalls of government regulation and collective ideologies, highlighting a proactive approach.\n\nOverall, their profile reflects a deep alignment with media that critiques mainstream societal norms and celebrates individual empowerment, underpinned by impactful storytelling and compelling performances. The latest interaction further indicates a broadening of their cinematic interests, showcasing an appreciation for a variety of high-quality films.",
  "metrics": {
    "rouge1_f": 0.12204424103737606,
    "rouge2_f": 0.0106951871657754,
    "rougeL_f": 0.06712433257055682,
    "meteor": 0.04256222983543003,
    "bleu1": 0.0016347048060928202,
    "bleu2": 0.0005634147024689823,
    "bleu3": 0.00017787663071216806,
    "bleu4": 5.6264607022938285e-05,
    "bertscore_precision": 0.336453378200531,
    "bertscore_recall": 0.4772023558616638,
    "bertscore_f1": 0.394654244184494
  }
}