{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 2016: Obama’s America\nReview Date: 2016/09/08\nStore: Dinesh D'Souza  (Director),     John Sullivan  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['Product Description', \"Immersed in exotic locales across four continents, best selling author Dinesh D'Souza races against time to find answers to Obama's past and reveal where America will be in 2016. During this journey he discovers how Hope and Change became radically misunderstood, and identifies new flashpoints for hot wars in mankind's greatest struggle. The journey moves quickly over the arc of the old colonial empires, into America's empire of liberty, and we see the unfolding realignment of nations and the shape of the global future.\", 'Amazon.com', \"Watching Dinesh D'Souza's\", \"2016: Obama's America\", 'in the wake of the 2012 U.S. presidential election is an interesting experience. Since the film was clearly produced and released (in July \\'12) with the intention of convincing Americans not to reelect Barack Obama, does the fact that he won anyway render it irrelevant? Or is it a good thing that now that Obama will remain in the White House, we\\'ll have a chance to see if D\\'Souza\\'s dire predictions about the havoc the president will wreak on the nation (cutting the military, raising taxes, continuing to ignore Iran\\'s nuclear potential, spending money irresponsibly, and so on) will come true? It\\'s the filmmaker\\'s contention that Obama\\'s dreams, aspirations, and values come from his father; although he barely knew Barack Obama Sr., his mother passed on his influence--influence that was largely misguided, as the elder Obama was a radical anti-colonialist whose son has spent his life trying to \"become worthy of his father\\'s love… the love he never got.\" D\\'Souza illustrates his thesis by way of reenactments, interviews (including plenty of face time for himself), footage from visits to Kenya (Obama Sr.\\'s native country) and Indonesia (where the president briefly lived with his mother and stepfather), and excerpts from Obama\\'s first book,', 'Dreams from My Father', ', read by the president himself. He does his case no favors by not talking to anyone with a differing point of view; at the same time, he tends to prod those he does interview into giving the answers that he wants to hear (\"Do you see Israel as a little colonial power in the Middle East?\" is typical), and his references to \"founding fathers\" of Obama\\'s alleged radicalism (William Ayers, the Rev. Jeremiah Wright, et al.) are old and tired. About an hour into the story, having declared the new brand of anti-colonialism (unlike the older kind, which helped India, D\\'Souza\\'s own homeland, rid itself of the British) to be \"anti-capitalist (and) anti-Christian,\" he declares that Obama \"possesses a Third World, anti-American view.\" At that point, pretty much all pretense of objectivity is abandoned; this is where the true believers will move closer and turn up the volume, while others will turn off their TVs in disgust. That\\'s unfortunate, as the end result will be that those predisposed to mistrust Obama will find nothing to soften their view here; neither will those who think it\\'s nothing but hateful, divisive nonsense.', '--Sam Graham']\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT33285DVD', 'Director': \"Dinesh D'Souza, John Sullivan\", 'Media Format': 'Multiple Formats, Dolby, Color, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'October 16, 2012', 'Subtitles': 'English', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nReview Text: He hates us. He tested the waters as far as what people really listen to in campainges.  He ruined our country. He won and we lost!\nReview Title: He hates us. He tested the waters as far ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Atlas Shrugged: Part One\nPatrick Fischler  (Actor),     Taylor Schilling  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'Ayn Rand\\'s timeless novel of\\xa0rational self-interest\\xa0comes to life for a new millennium.\". The year is 2016, and America is on the verge of economic disaster. The greatest citizens are being targeted, and dark forces are working to bring about America’s final days. Our only hope for salvation lies with Dagny Taggart and Henry Rearden, rugged individualists whose bold ideas may have the power to spark a revolution and reclaim to the American Dream.', 'Amazon.com', 'After years of trying, somebody finally made a film out of Ayn Rand\\'s big-selling novel of \"rational self-interest,\"', 'Atlas Shrugged', '. Well, got a start on it, anyway, with this 2011 release of', 'Part One', \"(of three). The sprawling novel is necessarily telescoped down to size, and the focus is on railroad magnate Dagny Taggart (Taylor Schilling) and her intricate strategies involving a piece of real estate in Colorado, an ongoing economic collapse, and the rugged individualist, Hank Rearden (Grant Bowler), whose new metal alloy might come in handy for laying new track. Of course, the real issue in Rand's scenario is not metal alloy but the fact that government regulation and a misguided sense of collectivism and altruism is strangling the elite members of society, something the movie reminds us of with grim regularity. As a kind of boardroom-plotting movie,\", 'Atlas Shrugged', 'isn\\'t incompetent, and if director Paul Johansson hasn\\'t devised a way to make these heavy-handed discussions come to life, at least it keeps moving along. If you like Rand\\'s objectivist philosophy, you\\'ll bask in the glow of having those ideas reaffirmed, and if you\\'re uninitiated, well, they certainly are laid out there in stark fashion. (And if you find Rand\\'s ideas absurd, you\\'ll find this movie a little like watching a cult meeting.) As to the question \"Who is John Galt?\" you\\'ll have to move on to', 'Atlas Shrugged: Part Two', \", released in 2012, to pick that up--but be ready to work at sorting the plot out anew, because Part One's cast has been replaced by a new roster of actors.\", '--Robert Horton']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': '22914266', 'Director': 'Paul Johansson', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 8, 2011', 'Actors': 'Patrick Fischler, Taylor Schilling, Grant Bowler, Matthew Marsden, Edi Gathegi', 'Subtitles': 'English, Spanish', 'Producers': 'Harmon M. Kaslow, John Aglialoro', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nThis is one of the best movies I have ever seen.  The movie reviewers were way off on this flick.  The actors are outstanding. It is happening right now in our nation!  Wake up America and Europe!\nLook around and smell our future!\nAtlas Shrugged II: The Strike\nSamantha Mathis  (Actor),     Jason Beghe  (Actor),     John Putch  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', \"Part two of Ayn Rand’s groundbreaking novel comes to the screen in this thrilling and powerful drama. The global economy is on the brink of collapse. Brilliant creators, from artists to industrialists, continue to mysteriously disappear. Dagny Taggart, Vice President in Charge of Operations for Taggart Transcontinental, has discovered what may very well be the answer to a mounting energy crisis - a revolutionary motor that could seemingly power the World. But, the motor is dead... there is no one left to decipher its secret... and, someone is watching. It's a race against the clock to find the inventor before the motor of the World is stopped for good.\", 'Amazon.com', \"The USA hurtles toward crisis, infrastructure wobbles, the rich and famous disappear. You just know Atlas is about to shrug. And so the modestly budgeted three-part adaptation of Ayn Rand's massive novel slouches its way into its middle section, as\", 'Atlas Shrugged: Part II', 'picks up where the first one left off, but reshapes its look: the cast members are all new. Thus you might need a scorecard to track the doings of the adorably named Dagny Taggart (Samantha Mathis); she\\'s trying to save her railroad company from the clutches of government regulations, flirting with rugged individualist Hank Rearden (Jason Beghe), and wondering why the heck everybody keeps answering her questions about a mysterious energy-saving gizmo by saying, \"Who is John Galt?\" Say this for the film, it certainly functions as a no-holds-barred delivery system for Ayn Rand\\'s objectivist philosophy, in which the creative elite must reject the mooching ways of the \"looters\" in society (oddly, there\\'s little of Rand\\'s committed atheism in these movies). Despite the fact that most of the actors are upgrades over', 'Part I', \", the middle section feels even clumsier in laying out the cardboard characters and ham-fisted dialogue, or in shifting from talky scenes to tinny digital effects--although Rand's device of slowly teasing out the arrival of this John Galt fellow remains a darned good dramatic gimmick. Esai Morales is nicely on his game, and he gets to deliver the explanation of the title--which, like so much else here, is spelled out in laborious fashion. Although the first two films performed poorly at the box office, the Rand faithful will likely buoy DVD sales;\", 'Part III', 'is promised.', '--Robert Horton']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Jason Beghe, John Putch, Samantha Mathis', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '26228956', 'Director': 'John Putch', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'February 19, 2013', 'Actors': 'Samantha Mathis, Jason Beghe', 'Subtitles': 'English, French, Spanish', 'Studio': 'Atlas Distribution Company', 'Number of discs': '1'}\nAwesome movie!  Need to see this or read the book!\nAwesome movie! Need to see this or read the ...\n{'Subtitles': ['None available'], 'Directors': ['Peter Jackson'], 'Producers': ['Peter Jackson', 'Carolyn Blackwood', 'Philippa Boyens', 'Carolynne Cunningham', 'Matthew Dravitzki', 'Toby Emmerich', 'Callum Greene', 'Alan F. Horn', 'Ken Kamins', 'Eric Monette'], 'Starring': ['Ian Mckellen', 'Martin Freeman', 'Benedict Cumberbatch'], 'Studio': ['Warner Bros.']}\nAwesome!!\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Reinhard Klooss'], 'Producers': ['Reinhard Klooss', 'Robert Kulzer', 'Martin Moszkowicz', 'Bernhard Thur'], 'Starring': ['Kellan Lutz', 'Spencer Locke', 'Jaime Ray Newman'], 'Studio': ['Lionsgate']}\ngood animation\nFour Stars\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['---'], 'Producers': ['Simon Perry'], 'Starring': ['John Hurt', 'Richard Burton', 'Suzanna Hamilton'], 'Studio': ['Epix']}\nThis is a book that isn't far off for us here in the USA.  This is a must watch for every American.... this is what waits for us.... a gift from the Progressives who have been working on this kind of control since the very late 1800's!  Wake up USA!!!\nMUST WATCH FOR USA!\n2016: Obama’s America\nDinesh D'Souza  (Director),     John Sullivan  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD\n['Product Description', \"Immersed in exotic locales across four continents, best selling author Dinesh D'Souza races against time to find answers to Obama's past and reveal where America will be in 2016. During this journey he discovers how Hope and Change became radically misunderstood, and identifies new flashpoints for hot wars in mankind's greatest struggle. The journey moves quickly over the arc of the old colonial empires, into America's empire of liberty, and we see the unfolding realignment of nations and the shape of the global future.\", 'Amazon.com', \"Watching Dinesh D'Souza's\", \"2016: Obama's America\", 'in the wake of the 2012 U.S. presidential election is an interesting experience. Since the film was clearly produced and released (in July \\'12) with the intention of convincing Americans not to reelect Barack Obama, does the fact that he won anyway render it irrelevant? Or is it a good thing that now that Obama will remain in the White House, we\\'ll have a chance to see if D\\'Souza\\'s dire predictions about the havoc the president will wreak on the nation (cutting the military, raising taxes, continuing to ignore Iran\\'s nuclear potential, spending money irresponsibly, and so on) will come true? It\\'s the filmmaker\\'s contention that Obama\\'s dreams, aspirations, and values come from his father; although he barely knew Barack Obama Sr., his mother passed on his influence--influence that was largely misguided, as the elder Obama was a radical anti-colonialist whose son has spent his life trying to \"become worthy of his father\\'s love… the love he never got.\" D\\'Souza illustrates his thesis by way of reenactments, interviews (including plenty of face time for himself), footage from visits to Kenya (Obama Sr.\\'s native country) and Indonesia (where the president briefly lived with his mother and stepfather), and excerpts from Obama\\'s first book,', 'Dreams from My Father', ', read by the president himself. He does his case no favors by not talking to anyone with a differing point of view; at the same time, he tends to prod those he does interview into giving the answers that he wants to hear (\"Do you see Israel as a little colonial power in the Middle East?\" is typical), and his references to \"founding fathers\" of Obama\\'s alleged radicalism (William Ayers, the Rev. Jeremiah Wright, et al.) are old and tired. About an hour into the story, having declared the new brand of anti-colonialism (unlike the older kind, which helped India, D\\'Souza\\'s own homeland, rid itself of the British) to be \"anti-capitalist (and) anti-Christian,\" he declares that Obama \"possesses a Third World, anti-American view.\" At that point, pretty much all pretense of objectivity is abandoned; this is where the true believers will move closer and turn up the volume, while others will turn off their TVs in disgust. That\\'s unfortunate, as the end result will be that those predisposed to mistrust Obama will find nothing to soften their view here; neither will those who think it\\'s nothing but hateful, divisive nonsense.', '--Sam Graham']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT33285DVD', 'Director': \"Dinesh D'Souza, John Sullivan\", 'Media Format': 'Multiple Formats, Dolby, Color, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'October 16, 2012', 'Subtitles': 'English', 'Studio': 'Lionsgate', 'Number of discs': '1'}\nHe hates us. He tested the waters as far as what people really listen to in campainges.  He ruined our country. He won and we lost!\nHe hates us. He tested the waters as far ...",
  "profile": "The user continues to demonstrate a strong inclination toward films that engage with individualism and critiques of government ideologies, particularly those aligned with objectivist principles. Their latest interaction with a politically charged documentary underscores their interest in content that explores controversial social themes and historical narratives, reinforcing their commitment to critical engagement with societal norms.\n\nThis interaction also highlights a preference for media that analyzes the impact of leadership and political ideology, suggesting their interest in films that provoke thought about personal agency and the implications of governance on individual freedom. Their pursuit of high-quality storytelling remains evident, as they seek out films that challenge mainstream perspectives and stimulate deep reflection.\n\nIn addition, the user maintains an appreciation for diverse genres, as previously indicated by their openness to animation. This willingness to explore varied narratives enhances their cinematic experience, allowing for a broader understanding of storytelling techniques while still adhering to rigorous standards of quality in narrative and character development.\n\nOverall, the user’s profile reflects a distinct alignment with media that confronts complex social and economic issues, emphasizing personal empowerment and the critique of collective ideologies, all while exploring a range of genres that enrich their film-watching journey.",
  "metrics": {
    "rouge1_f": 0.09156626506024095,
    "rouge2_f": 0.006753497346840329,
    "rougeL_f": 0.05397590361445783,
    "meteor": 0.0268683572735748,
    "bleu1": 8.955385408839139e-06,
    "bleu2": 3.05437117429893e-06,
    "bleu3": 4.4607565808228084e-07,
    "bleu4": 1.7067033963081176e-07,
    "bertscore_precision": 0.3149011731147766,
    "bertscore_recall": 0.4769415259361267,
    "bertscore_f1": 0.37934160232543945
  }
}