{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Yes To Face Wipes for Women and Men, Sensitive Facial Cleansing Wipes for use as a Make Up Remover, Cleaning, Soothing, Cucumbers Aloe Vera (Pack of 2)\nReview Date: 2018/04/23\nStore: Yes To\nProduct Description: [\"Yes To Cucumbers Hypoallergenic Facial Wipes gently remove dirt, sweat and makeup (eye makeup too!) without the need to rinse. Whether you're out and about, going for a run, or having a late night, these wipes make it a snap to refresh on-the-go. Packed with green superfoods these all-natural, biodegradable wipes naturally refresh and rejuvenate all-in-one. Stay gorgeous, and go from zero to clean in seconds! Snap up the lid and snatch out a towelette! Gently glide across your face and neck. Feel refreshed? You should- your skin is clean, revitalized and nourished- in just a snap! These 95% natural, oil-free, non-comedogenic, hypoallergenic wipes are made with compostable, FSC certified fabric. They are petroleum free, SLS free, paraben free, and cruelty-free. Say Yes to Cucumbers Hypoallergenic Facial Wipes! These 2 pack wipes are specifically sold by the manfucaturer. We can&rsquo. INGREDIENTS Water, Glycerin, Cucumis Sativas (Cucumber) Extract, Aloe Barbadensis (Aloe) Extract, Camellia Sinensis (Green Tea) Extract, Sodium Chloride (Sea Salt), Carpylyl/Capryl Glucoside, Guar Hydroxypropyltrimonium Chloride, Polyglyceryl-4 Caprate, Caprylic/Capric Triglyceride, Sodium Benzoate, Potassium Sorbate, Citric Acid, Phenoxyethanol, Fragrance.\"]\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Yes To', 'Skin Type': 'Sensitive', 'Material Feature': 'Compostable Warning', 'Unit Count': '60 Count', 'Number of Items': '2', 'Product Dimensions': '4.6 x 3.75 x 5.5 inches; 14.4 Ounces', 'Item model number': '1024734', 'UPC': '815921024734', 'Manufacturer': 'Yes To Inc.', 'Country of Origin': 'USA', 'Domestic Shipping': 'Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.', 'International Shipping': 'This item can be shipped to select countries outside of the U.S.  Learn More'}\nReview Text: These Yes wipes feel equivalent to others on the market & they remove makeup about as well as other makeup removal wipes.<br /><br />I am not a heavy makeup user - very light foundation, powder, a little blush & a little eye shadow. The wipes do not completely remove makeup/residue, so if I use the wipes exclusively, I will get clogged pores within a couple of weeks. This result is the same using other manufacturer's wipes.  Consequently, while super convenient especially while traveling, if I travel with make-up wipes, I also travel with blemish cream.\nReview Title: Nice, Pleasant Smell. Do not Completely Remove Make-up\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Precision Clean Oral-B Vitality Rechargeable Electric Toothbrush\nOral-B\n['ORAL-B\" ULTRA PLAK CONTROL REMOVER Ultra-speed oscillating brushing action Cleans better than manual toothbrush Removes heavy plaque build- up and stains Unique cup shaped brush head surrounds each tooth Interdental tips penetrate deep between teeth and along the gum line \"Indicator\" bristles fade halfway to signal when to replace brush head for optimal performance Ergonomic handle Lasts 7 days between charges Includes 1 brush head Replacement brush head Ace No. 6012678 White with turquoise accent Blister pack']\n{'Brand': 'Oral-B', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Color': 'Blue', 'Product Dimensions': '4.33 x 9.45 x 2.05 inches; 10.4 Ounces', 'Item model number': 'Oral B Vitality Presision Clean - D12513', 'UPC': '069055816127 069055838440', 'Manufacturer': 'Oral-B'}\nMy family has used Oral B rechargeable toothbrushes for years.  We end up replacing them after about 3 years or so, but, at a price under $20 each, it still is cheaper than a Sonicare.  The replacement head brushes are about the same price as the more expenseive rechargeables, and we purchase them at Sam's and on line.  And, in the end, the results are what matter.  No one in our family has had a cavity in over 7 years.  Some of that has to be the results of a good toothbrushing (especially with my children).\nGreat Product. Great Price. Great Results.\nYes To Face Wipes for Women and Men, Sensitive Facial Cleansing Wipes for use as a Make Up Remover, Cleaning, Soothing, Cucumbers Aloe Vera (Pack of 2)\nYes To\n[\"Yes To Cucumbers Hypoallergenic Facial Wipes gently remove dirt, sweat and makeup (eye makeup too!) without the need to rinse. Whether you're out and about, going for a run, or having a late night, these wipes make it a snap to refresh on-the-go. Packed with green superfoods these all-natural, biodegradable wipes naturally refresh and rejuvenate all-in-one. Stay gorgeous, and go from zero to clean in seconds! Snap up the lid and snatch out a towelette! Gently glide across your face and neck. Feel refreshed? You should- your skin is clean, revitalized and nourished- in just a snap! These 95% natural, oil-free, non-comedogenic, hypoallergenic wipes are made with compostable, FSC certified fabric. They are petroleum free, SLS free, paraben free, and cruelty-free. Say Yes to Cucumbers Hypoallergenic Facial Wipes! These 2 pack wipes are specifically sold by the manfucaturer. We can&rsquo. INGREDIENTS Water, Glycerin, Cucumis Sativas (Cucumber) Extract, Aloe Barbadensis (Aloe) Extract, Camellia Sinensis (Green Tea) Extract, Sodium Chloride (Sea Salt), Carpylyl/Capryl Glucoside, Guar Hydroxypropyltrimonium Chloride, Polyglyceryl-4 Caprate, Caprylic/Capric Triglyceride, Sodium Benzoate, Potassium Sorbate, Citric Acid, Phenoxyethanol, Fragrance.\"]\n{'Brand': 'Yes To', 'Skin Type': 'Sensitive', 'Material Feature': 'Compostable Warning', 'Unit Count': '60 Count', 'Number of Items': '2', 'Product Dimensions': '4.6 x 3.75 x 5.5 inches; 14.4 Ounces', 'Item model number': '1024734', 'UPC': '815921024734', 'Manufacturer': 'Yes To Inc.', 'Country of Origin': 'USA', 'Domestic Shipping': 'Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.', 'International Shipping': 'This item can be shipped to select countries outside of the U.S.  Learn More'}\nThese Yes wipes feel equivalent to others on the market & they remove makeup about as well as other makeup removal wipes.<br /><br />I am not a heavy makeup user - very light foundation, powder, a little blush & a little eye shadow. The wipes do not completely remove makeup/residue, so if I use the wipes exclusively, I will get clogged pores within a couple of weeks. This result is the same using other manufacturer's wipes.  Consequently, while super convenient especially while traveling, if I travel with make-up wipes, I also travel with blemish cream.\nNice, Pleasant Smell. Do not Completely Remove Make-up",
  "profile": "**User Summary:**\n\n- **Product Preference**: Maintains a strong preference for rechargeable electric toothbrushes, particularly from Oral-B, but also shows interest in personal care products that cater to specific needs.\n- **Value Sensitivity**: Continues to prioritize cost-effectiveness, seeking products that deliver results at competitive price points.\n- **Family-Centric**: Emphasizes family health, with a focus on long-term dental and skincare routines for all family members, especially children.\n- **Performance Focus**: Values effectiveness in all products, noting the importance of results in both dental care and skincare; expresses dissatisfaction when products do not meet performance expectations.\n- **Longevity and Maintenance**: Demonstrates a practical approach to product life cycles, familiar with replacement needs for both dental and personal care items.\n- **Shopping Habits**: Utilizes various shopping avenues, including in-store and online, to ensure convenience and better deals on health and beauty products.\n- **Consistency in Quality**: Remains a loyal user of Oral-B but seeks quality alternatives in other personal care brands, reflecting a broader interest in reliable products across different categories.\n- **Overall Satisfaction**: While generally satisfied with product performance, remains discerning about effectiveness, particularly in makeup removal and skincare, highlighting a willingness to adapt based on results. \n\nThis summary showcases a user focused on reliable, cost-effective products that cater to the health and grooming needs of their family.",
  "metrics": {
    "rouge1_f": 0.20183486238532108,
    "rouge2_f": 0.013793103448275862,
    "rougeL_f": 0.09403669724770641,
    "meteor": 0.08431945072743997,
    "bleu1": 0.05256429913442513,
    "bleu2": 0.010277611013803206,
    "bleu3": 0.0017462981259532802,
    "bleu4": 0.000720472138426057,
    "bertscore_precision": 0.3862706422805786,
    "bertscore_recall": 0.46373283863067627,
    "bertscore_f1": 0.42147210240364075
  }
}