{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mountain Falls Regular Dip-It Nail Polish Remover for Natural Nails, with Vitamin E and Panthenol, 9 Fluid Ounce\nReview Date: 2019/09/22\nStore: Mountain Falls\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Mountain Falls', 'Item Weight': '0.5 Pounds', 'Unit Count': '9 Fl Oz'}\nReview Text: This dip in nail polish is essentially a container size sponge soaked in nail polish remover.  The sponge acts as the abrasive to assist the nail polish remover liquid complete the removal job. It works pretty well on fingers - you have th kind of twist your fingers around/about. Can't see using this for toes at all.<br /><br />3-1/2 stars because limited use.  Still need to use cotton ball and remove on toes.\nReview Title: Good for Regular Polish and Fingers\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Precision Clean Oral-B Vitality Rechargeable Electric Toothbrush\nOral-B\n['ORAL-B\" ULTRA PLAK CONTROL REMOVER Ultra-speed oscillating brushing action Cleans better than manual toothbrush Removes heavy plaque build- up and stains Unique cup shaped brush head surrounds each tooth Interdental tips penetrate deep between teeth and along the gum line \"Indicator\" bristles fade halfway to signal when to replace brush head for optimal performance Ergonomic handle Lasts 7 days between charges Includes 1 brush head Replacement brush head Ace No. 6012678 White with turquoise accent Blister pack']\n{'Brand': 'Oral-B', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Color': 'Blue', 'Product Dimensions': '4.33 x 9.45 x 2.05 inches; 10.4 Ounces', 'Item model number': 'Oral B Vitality Presision Clean - D12513', 'UPC': '069055816127 069055838440', 'Manufacturer': 'Oral-B'}\nMy family has used Oral B rechargeable toothbrushes for years.  We end up replacing them after about 3 years or so, but, at a price under $20 each, it still is cheaper than a Sonicare.  The replacement head brushes are about the same price as the more expenseive rechargeables, and we purchase them at Sam's and on line.  And, in the end, the results are what matter.  No one in our family has had a cavity in over 7 years.  Some of that has to be the results of a good toothbrushing (especially with my children).\nGreat Product. Great Price. Great Results.\nYes To Face Wipes for Women and Men, Sensitive Facial Cleansing Wipes for use as a Make Up Remover, Cleaning, Soothing, Cucumbers Aloe Vera (Pack of 2)\nYes To\n[\"Yes To Cucumbers Hypoallergenic Facial Wipes gently remove dirt, sweat and makeup (eye makeup too!) without the need to rinse. Whether you're out and about, going for a run, or having a late night, these wipes make it a snap to refresh on-the-go. Packed with green superfoods these all-natural, biodegradable wipes naturally refresh and rejuvenate all-in-one. Stay gorgeous, and go from zero to clean in seconds! Snap up the lid and snatch out a towelette! Gently glide across your face and neck. Feel refreshed? You should- your skin is clean, revitalized and nourished- in just a snap! These 95% natural, oil-free, non-comedogenic, hypoallergenic wipes are made with compostable, FSC certified fabric. They are petroleum free, SLS free, paraben free, and cruelty-free. Say Yes to Cucumbers Hypoallergenic Facial Wipes! These 2 pack wipes are specifically sold by the manfucaturer. We can&rsquo. INGREDIENTS Water, Glycerin, Cucumis Sativas (Cucumber) Extract, Aloe Barbadensis (Aloe) Extract, Camellia Sinensis (Green Tea) Extract, Sodium Chloride (Sea Salt), Carpylyl/Capryl Glucoside, Guar Hydroxypropyltrimonium Chloride, Polyglyceryl-4 Caprate, Caprylic/Capric Triglyceride, Sodium Benzoate, Potassium Sorbate, Citric Acid, Phenoxyethanol, Fragrance.\"]\n{'Brand': 'Yes To', 'Skin Type': 'Sensitive', 'Material Feature': 'Compostable Warning', 'Unit Count': '60 Count', 'Number of Items': '2', 'Product Dimensions': '4.6 x 3.75 x 5.5 inches; 14.4 Ounces', 'Item model number': '1024734', 'UPC': '815921024734', 'Manufacturer': 'Yes To Inc.', 'Country of Origin': 'USA', 'Domestic Shipping': 'Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.', 'International Shipping': 'This item can be shipped to select countries outside of the U.S.  Learn More'}\nThese Yes wipes feel equivalent to others on the market & they remove makeup about as well as other makeup removal wipes.<br /><br />I am not a heavy makeup user - very light foundation, powder, a little blush & a little eye shadow. The wipes do not completely remove makeup/residue, so if I use the wipes exclusively, I will get clogged pores within a couple of weeks. This result is the same using other manufacturer's wipes.  Consequently, while super convenient especially while traveling, if I travel with make-up wipes, I also travel with blemish cream.\nNice, Pleasant Smell. Do not Completely Remove Make-up\nMountain Falls Regular Dip-It Nail Polish Remover for Natural Nails, with Vitamin E and Panthenol, 9 Fluid Ounce\nMountain Falls\n{'Brand': 'Mountain Falls', 'Item Weight': '0.5 Pounds', 'Unit Count': '9 Fl Oz'}\nThis dip in nail polish is essentially a container size sponge soaked in nail polish remover.  The sponge acts as the abrasive to assist the nail polish remover liquid complete the removal job. It works pretty well on fingers - you have th kind of twist your fingers around/about. Can't see using this for toes at all.<br /><br />3-1/2 stars because limited use.  Still need to use cotton ball and remove on toes.\nGood for Regular Polish and Fingers",
  "profile": "**User Summary:**\n\n- **Product Preference**: Strongly favors rechargeable electric toothbrushes, especially from Oral-B, while also exploring personal care products like nail polish removers that cater to specific needs.\n- **Value Sensitivity**: Prioritizes cost-effectiveness, gravitating towards products that provide reliable results at competitive prices.\n- **Family-Centric**: Emphasizes family health, focusing on long-term dental and skincare routines for all family members, particularly children.\n- **Performance Focus**: Values effectiveness across all purchases; expresses dissatisfaction when products underperform, especially in skincare and makeup removal.\n- **Longevity and Maintenance**: Has a practical approach to product life cycles, knowledgeable about replacement needs for health and beauty items.\n- **Shopping Habits**: Utilizes both in-store and online shopping endeavors to secure convenience and competitive deals on health and beauty products.\n- **Consistency in Quality**: Remains loyal to Oral-B but actively seeks quality alternatives in other personal care brands, reflecting a broad interest in dependable products across various categories.\n- **Overall Satisfaction**: Generally satisfied with product performance but discerning about effectiveness; recent experiences with specialized products have influenced her evaluation, indicating a willingness to adjust preferences based on results.\n\nThis summary illustrates a user focused on reliable, cost-effective personal care products that meet the health and grooming needs of their family while being open to exploring new options with specific functionalities.",
  "metrics": {
    "rouge1_f": 0.17849898580121706,
    "rouge2_f": 0.018292682926829267,
    "rougeL_f": 0.08316430020283976,
    "meteor": 0.07041478710529211,
    "bleu1": 0.02860756752532018,
    "bleu2": 0.00644066706655052,
    "bleu3": 0.0010648318930800082,
    "bleu4": 0.000433361421913439,
    "bertscore_precision": 0.38877207040786743,
    "bertscore_recall": 0.4741971492767334,
    "bertscore_f1": 0.4272564947605133
  }
}