{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Aloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nReview Date: 2020/07/14\nStore: CIMIY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nReview Text: As an Aloe Vera product, this gel is OK. Its moisturizing capabilities are below average and its soothing abilities on tender skin are average.<br /><br />The gel leans thin-ish for a \"thick\" gel. The smell is light and inoffensive. The seller says this can be used as a base to make homemade hand sanitizer and the thickness is about on par with typical hand sanitizers on the market.\nReview Title: Mildly Moisturizing.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Precision Clean Oral-B Vitality Rechargeable Electric Toothbrush\nOral-B\n['ORAL-B\" ULTRA PLAK CONTROL REMOVER Ultra-speed oscillating brushing action Cleans better than manual toothbrush Removes heavy plaque build- up and stains Unique cup shaped brush head surrounds each tooth Interdental tips penetrate deep between teeth and along the gum line \"Indicator\" bristles fade halfway to signal when to replace brush head for optimal performance Ergonomic handle Lasts 7 days between charges Includes 1 brush head Replacement brush head Ace No. 6012678 White with turquoise accent Blister pack']\n{'Brand': 'Oral-B', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Color': 'Blue', 'Product Dimensions': '4.33 x 9.45 x 2.05 inches; 10.4 Ounces', 'Item model number': 'Oral B Vitality Presision Clean - D12513', 'UPC': '069055816127 069055838440', 'Manufacturer': 'Oral-B'}\nMy family has used Oral B rechargeable toothbrushes for years.  We end up replacing them after about 3 years or so, but, at a price under $20 each, it still is cheaper than a Sonicare.  The replacement head brushes are about the same price as the more expenseive rechargeables, and we purchase them at Sam's and on line.  And, in the end, the results are what matter.  No one in our family has had a cavity in over 7 years.  Some of that has to be the results of a good toothbrushing (especially with my children).\nGreat Product. Great Price. Great Results.\nYes To Face Wipes for Women and Men, Sensitive Facial Cleansing Wipes for use as a Make Up Remover, Cleaning, Soothing, Cucumbers Aloe Vera (Pack of 2)\nYes To\n[\"Yes To Cucumbers Hypoallergenic Facial Wipes gently remove dirt, sweat and makeup (eye makeup too!) without the need to rinse. Whether you're out and about, going for a run, or having a late night, these wipes make it a snap to refresh on-the-go. Packed with green superfoods these all-natural, biodegradable wipes naturally refresh and rejuvenate all-in-one. Stay gorgeous, and go from zero to clean in seconds! Snap up the lid and snatch out a towelette! Gently glide across your face and neck. Feel refreshed? You should- your skin is clean, revitalized and nourished- in just a snap! These 95% natural, oil-free, non-comedogenic, hypoallergenic wipes are made with compostable, FSC certified fabric. They are petroleum free, SLS free, paraben free, and cruelty-free. Say Yes to Cucumbers Hypoallergenic Facial Wipes! These 2 pack wipes are specifically sold by the manfucaturer. We can&rsquo. INGREDIENTS Water, Glycerin, Cucumis Sativas (Cucumber) Extract, Aloe Barbadensis (Aloe) Extract, Camellia Sinensis (Green Tea) Extract, Sodium Chloride (Sea Salt), Carpylyl/Capryl Glucoside, Guar Hydroxypropyltrimonium Chloride, Polyglyceryl-4 Caprate, Caprylic/Capric Triglyceride, Sodium Benzoate, Potassium Sorbate, Citric Acid, Phenoxyethanol, Fragrance.\"]\n{'Brand': 'Yes To', 'Skin Type': 'Sensitive', 'Material Feature': 'Compostable Warning', 'Unit Count': '60 Count', 'Number of Items': '2', 'Product Dimensions': '4.6 x 3.75 x 5.5 inches; 14.4 Ounces', 'Item model number': '1024734', 'UPC': '815921024734', 'Manufacturer': 'Yes To Inc.', 'Country of Origin': 'USA', 'Domestic Shipping': 'Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.', 'International Shipping': 'This item can be shipped to select countries outside of the U.S.  Learn More'}\nThese Yes wipes feel equivalent to others on the market & they remove makeup about as well as other makeup removal wipes.<br /><br />I am not a heavy makeup user - very light foundation, powder, a little blush & a little eye shadow. The wipes do not completely remove makeup/residue, so if I use the wipes exclusively, I will get clogged pores within a couple of weeks. This result is the same using other manufacturer's wipes.  Consequently, while super convenient especially while traveling, if I travel with make-up wipes, I also travel with blemish cream.\nNice, Pleasant Smell. Do not Completely Remove Make-up\nMountain Falls Regular Dip-It Nail Polish Remover for Natural Nails, with Vitamin E and Panthenol, 9 Fluid Ounce\nMountain Falls\n{'Brand': 'Mountain Falls', 'Item Weight': '0.5 Pounds', 'Unit Count': '9 Fl Oz'}\nThis dip in nail polish is essentially a container size sponge soaked in nail polish remover.  The sponge acts as the abrasive to assist the nail polish remover liquid complete the removal job. It works pretty well on fingers - you have th kind of twist your fingers around/about. Can't see using this for toes at all.<br /><br />3-1/2 stars because limited use.  Still need to use cotton ball and remove on toes.\nGood for Regular Polish and Fingers\nDERMALOGY by NEOGENLAB Real Charcoal Pad, 60 Count\n{'Product Dimensions': '3.35 x 3.35 x 3.15 inches; 1.12 Ounces', 'Item model number': '8809381449994'}\nThese charcoal pads are intended to be used after you wash your face.  They are suppose to draw out impurities (charcoal side) and soothe the skin for a \"healthier\" look.<br /><br />The pads are premoistened and have plenty of moisture.  It is easy to discern the charcoal side.  After about 3 weeks of use every 3rd day, I cannot see the difference in my skin. I'm not a heavy make-up wearer, so this may be a factor in trying to see noticeable differences when using/not using the Neogen charcoal pad.\nOK Facial Pads.\nAloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nCIMIY\n{'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nAs an Aloe Vera product, this gel is OK. Its moisturizing capabilities are below average and its soothing abilities on tender skin are average.<br /><br />The gel leans thin-ish for a \"thick\" gel. The smell is light and inoffensive. The seller says this can be used as a base to make homemade hand sanitizer and the thickness is about on par with typical hand sanitizers on the market.\nMildly Moisturizing.",
  "profile": "**User Summary:**\n\n- **Product Preference**: The user strongly favors rechargeable electric toothbrushes from Oral-B and is exploring effective personal care products, including those for skincare and hair care. Recent purchases indicate interest in natural and soothing ingredients.\n- **Value Sensitivity**: They consistently look for cost-effective and dependable products, remaining conscious of price while ensuring quality and performance.\n- **Family-Centric**: The user prioritizes the health and skincare needs of the entire family, with a particular focus on children's products and long-term regimens.\n- **Performance Focus**: They place high importance on the effectiveness of products. Recent experiences with skincare items have led to a reassessment of efficacy, and they expressed mixed feelings about a new moisturizing gel, noting its average performance and lighter consistency.\n- **Longevity and Maintenance**: The user understands the need for regular replacements in health and beauty, highlighting a commitment to consistent care.\n- **Shopping Habits**: They engage in both online and in-store shopping, looking for competitive pricing and convenience in acquiring health and beauty products.\n- **Consistency in Quality**: While loyal to Oral-B, the user remains open to exploring quality alternatives, reflecting a discerning approach to product selection.\n- **Overall Satisfaction**: Generally satisfied with product performance, the user is ready to adjust preferences based on results, particularly in skincare, while continuing to seek reliable, cost-effective solutions that meet family needs.",
  "metrics": {
    "rouge1_f": 0.1787709497206704,
    "rouge2_f": 0.017585931254996003,
    "rougeL_f": 0.08778930566640064,
    "meteor": 0.06598179236615719,
    "bleu1": 0.013278355021682575,
    "bleu2": 0.0031731327098911675,
    "bleu3": 0.00047834025160066137,
    "bleu4": 0.00018588211794755082,
    "bertscore_precision": 0.38060957193374634,
    "bertscore_recall": 0.48054924607276917,
    "bertscore_f1": 0.4247802495956421
  }
}