{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hyalogic HA Daily Skin Perfecting Lotion 1oz - The Premium Spa-Grade Hyaluronic Acid Facial Moisturizer to Control Oiliness and Improve Skin Texture - 1 Fl Ounce\nReview Date: 2021/07/01\nStore: Hyalogic\nProduct Description: ['Try HA Spa Skin Perfecting Lotion w/ Hyaluronic Acid & Regu-SEB (1 Fl oz)', 'Benefits & Details:', 'Diminishes skin oil to reduce acne & blemishes using Regu-Seb.', 'Diminishes skin oil to reduce acne & blemishes using Regu-Seb.', 'Soothes skin using Argan Oil base', 'Soothes skin using Argan Oil base', 'Moisturizes skin using and Hyaluronic Acid', 'Moisturizes skin using and Hyaluronic Acid', 'Non greasy formula', 'Non greasy formula', 'Fragrance free, Gluten free, Paraben free, Dye free, and Cruelty free', 'Fragrance free, Gluten free, Paraben free, Dye free, and Cruelty free', 'Supports Healthy Collagen, Youthful Appearance & Skin Elasticity', 'Supports Healthy Collagen, Youthful Appearance & Skin Elasticity', 'High Molecular Weight, Premium-sourced Hyaluronic Acid', 'High Molecular Weight, Premium-sourced Hyaluronic Acid', 'REgu-Seb made from North American Saw Palmetto & South American Sesame Seeds.  Directions: After cleansing, apply product to face twice daily.  Caution:  Keep away from eyes. Store at room temperature. For external use only. Keep out of reach from children. Discontinue use if irritation occurs.', 'REgu-Seb made from North American Saw Palmetto & South American Sesame Seeds.', 'Directions:', 'After cleansing, apply product to face twice daily.', 'Caution:', 'Keep away from eyes. Store at room temperature. For external use only. Keep out of reach from children. Discontinue use if irritation occurs.']\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Hyalogic', 'Scent': 'Fresh', 'Item Form': 'Lotion', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1.00 Fl Oz', 'Package Dimensions': '5.39 x 1.69 x 1.18 inches; 2.86 Ounces', 'UPC': '856682008212', 'Manufacturer': 'Hyalogic'}\nReview Text: I'm not a fan of this \"lotion\". It has a odd, oily, but not oily feel when I apply it to my face. It also seems to lay on my face and I have to rub it into my skin. And, once my skin absorbs this lotion, my face still feels a bit dry, so I have to either layer this one again or use a different, more moisturizing face lotion.<br /><br />I have more of a T zone face and my natural oiliness has decreased over the years. I apply face lotion both day and night. This lotion may be better for someone with noticeably oily skin who doesn't normally apply lotion on the face.\nReview Title: Do Not Like the Way This Feels When Applying to My Face\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Precision Clean Oral-B Vitality Rechargeable Electric Toothbrush\nOral-B\n['ORAL-B\" ULTRA PLAK CONTROL REMOVER Ultra-speed oscillating brushing action Cleans better than manual toothbrush Removes heavy plaque build- up and stains Unique cup shaped brush head surrounds each tooth Interdental tips penetrate deep between teeth and along the gum line \"Indicator\" bristles fade halfway to signal when to replace brush head for optimal performance Ergonomic handle Lasts 7 days between charges Includes 1 brush head Replacement brush head Ace No. 6012678 White with turquoise accent Blister pack']\n{'Brand': 'Oral-B', 'Age Range (Description)': 'Adult', 'Special Feature': 'Brushing Timer', 'Power Source': 'Corded Electric, Battery Powered', 'Color': 'Blue', 'Product Dimensions': '4.33 x 9.45 x 2.05 inches; 10.4 Ounces', 'Item model number': 'Oral B Vitality Presision Clean - D12513', 'UPC': '069055816127 069055838440', 'Manufacturer': 'Oral-B'}\nMy family has used Oral B rechargeable toothbrushes for years.  We end up replacing them after about 3 years or so, but, at a price under $20 each, it still is cheaper than a Sonicare.  The replacement head brushes are about the same price as the more expenseive rechargeables, and we purchase them at Sam's and on line.  And, in the end, the results are what matter.  No one in our family has had a cavity in over 7 years.  Some of that has to be the results of a good toothbrushing (especially with my children).\nGreat Product. Great Price. Great Results.\nYes To Face Wipes for Women and Men, Sensitive Facial Cleansing Wipes for use as a Make Up Remover, Cleaning, Soothing, Cucumbers Aloe Vera (Pack of 2)\nYes To\n[\"Yes To Cucumbers Hypoallergenic Facial Wipes gently remove dirt, sweat and makeup (eye makeup too!) without the need to rinse. Whether you're out and about, going for a run, or having a late night, these wipes make it a snap to refresh on-the-go. Packed with green superfoods these all-natural, biodegradable wipes naturally refresh and rejuvenate all-in-one. Stay gorgeous, and go from zero to clean in seconds! Snap up the lid and snatch out a towelette! Gently glide across your face and neck. Feel refreshed? You should- your skin is clean, revitalized and nourished- in just a snap! These 95% natural, oil-free, non-comedogenic, hypoallergenic wipes are made with compostable, FSC certified fabric. They are petroleum free, SLS free, paraben free, and cruelty-free. Say Yes to Cucumbers Hypoallergenic Facial Wipes! These 2 pack wipes are specifically sold by the manfucaturer. We can&rsquo. INGREDIENTS Water, Glycerin, Cucumis Sativas (Cucumber) Extract, Aloe Barbadensis (Aloe) Extract, Camellia Sinensis (Green Tea) Extract, Sodium Chloride (Sea Salt), Carpylyl/Capryl Glucoside, Guar Hydroxypropyltrimonium Chloride, Polyglyceryl-4 Caprate, Caprylic/Capric Triglyceride, Sodium Benzoate, Potassium Sorbate, Citric Acid, Phenoxyethanol, Fragrance.\"]\n{'Brand': 'Yes To', 'Skin Type': 'Sensitive', 'Material Feature': 'Compostable Warning', 'Unit Count': '60 Count', 'Number of Items': '2', 'Product Dimensions': '4.6 x 3.75 x 5.5 inches; 14.4 Ounces', 'Item model number': '1024734', 'UPC': '815921024734', 'Manufacturer': 'Yes To Inc.', 'Country of Origin': 'USA', 'Domestic Shipping': 'Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.', 'International Shipping': 'This item can be shipped to select countries outside of the U.S.  Learn More'}\nThese Yes wipes feel equivalent to others on the market & they remove makeup about as well as other makeup removal wipes.<br /><br />I am not a heavy makeup user - very light foundation, powder, a little blush & a little eye shadow. The wipes do not completely remove makeup/residue, so if I use the wipes exclusively, I will get clogged pores within a couple of weeks. This result is the same using other manufacturer's wipes.  Consequently, while super convenient especially while traveling, if I travel with make-up wipes, I also travel with blemish cream.\nNice, Pleasant Smell. Do not Completely Remove Make-up\nMountain Falls Regular Dip-It Nail Polish Remover for Natural Nails, with Vitamin E and Panthenol, 9 Fluid Ounce\nMountain Falls\n{'Brand': 'Mountain Falls', 'Item Weight': '0.5 Pounds', 'Unit Count': '9 Fl Oz'}\nThis dip in nail polish is essentially a container size sponge soaked in nail polish remover.  The sponge acts as the abrasive to assist the nail polish remover liquid complete the removal job. It works pretty well on fingers - you have th kind of twist your fingers around/about. Can't see using this for toes at all.<br /><br />3-1/2 stars because limited use.  Still need to use cotton ball and remove on toes.\nGood for Regular Polish and Fingers\nDERMALOGY by NEOGENLAB Real Charcoal Pad, 60 Count\n{'Product Dimensions': '3.35 x 3.35 x 3.15 inches; 1.12 Ounces', 'Item model number': '8809381449994'}\nThese charcoal pads are intended to be used after you wash your face.  They are suppose to draw out impurities (charcoal side) and soothe the skin for a \"healthier\" look.<br /><br />The pads are premoistened and have plenty of moisture.  It is easy to discern the charcoal side.  After about 3 weeks of use every 3rd day, I cannot see the difference in my skin. I'm not a heavy make-up wearer, so this may be a factor in trying to see noticeable differences when using/not using the Neogen charcoal pad.\nOK Facial Pads.\nAloe Vera Gel 100% Natural Moisturisers - Pure Organic Fresh Soothing Aloe-Vera Moisturizing Gel Skin Hair, Aloe Leaf Wash-free Clean After Sun Face Body (8.8 oz)\nCIMIY\n{'Brand': 'CIMIY', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '8.8 Fl Oz', 'Number of Items': '1', 'Product Dimensions': '5.91 x 1.57 x 1.57 inches; 11.22 Ounces'}\nAs an Aloe Vera product, this gel is OK. Its moisturizing capabilities are below average and its soothing abilities on tender skin are average.<br /><br />The gel leans thin-ish for a \"thick\" gel. The smell is light and inoffensive. The seller says this can be used as a base to make homemade hand sanitizer and the thickness is about on par with typical hand sanitizers on the market.\nMildly Moisturizing.\nHair Clipper Beard Trimmer Kit for Men,Cordless Hair Trimmer Mustache Trimmer Body Groomer Trimmer for Nose Ear Facial Hair with LED Display USB Rechargeable 5 In 1\n8sanlione\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6.5 x 1.77 x 1.18 inches; 1.12 Pounds'}\nReview from my bearded spouse:<br /><br />Things I like about this trimmer:<br />1. The dial adjustment works very well for the gate.<br />2. The trimmer is very quiet (especially compared to my old one).<br />3. The nose/ear trimmer works better than any I have ever used before.<br />4. I generally use a razor for shaving but the two micro screen shaving heads work well for a quick clean up (beware of an occasional pulled whisker).<br />5. For my beard and mustache, the large trimmer used with the gate does a fantastic job.<br />6. Doesn't come with an adapter to plug the USB charging cord into the wall.<br /><br />Verdict: great for beard, mustache and ear/nose hair removal, but I wouln't want to use it as an everyday shaver\nVery Quiet. Good For Maintenance\nMaya Mari Hydrating Argan Oil Shampoo – Rich in Nutrients, Restores Moisture & Shine, 32 oz\nMAYA MARI\n{'Brand': 'MAYA MARI', 'Hair Type': 'Damaged,Curly Hair', 'Age Range (Description)': 'Adult', 'Material Type Free': 'Paraben Free', 'Product Benefits': 'Hydrating', 'Product Dimensions': '3.25 x 3.25 x 10 inches; 1.94 Pounds', 'Item model number': 'MMAROILSP', 'UPC': '850004068267'}\nOverall, this Argan Oil shampoo is fine.  It cleans well but leaves my hair with some fly-aways, so I follow the shampoo with a conditioner when washing my hair.  I can go about every other day for washing, which is about normal for most of my shampoos. The lather is adequate and not overly generous (so not a lot of additive to produce excess lather).<br /><br />The bottle arrived a bit slimy because the screw cap came loose in shipping. Luckily, the bottle was sealed in plastic. The pump action works as expected.\nCleans Well. Leaves Hair a Little Fly-Away\nHyalogic HA Daily Skin Perfecting Lotion 1oz - The Premium Spa-Grade Hyaluronic Acid Facial Moisturizer to Control Oiliness and Improve Skin Texture - 1 Fl Ounce\nHyalogic\n['Try HA Spa Skin Perfecting Lotion w/ Hyaluronic Acid & Regu-SEB (1 Fl oz)', 'Benefits & Details:', 'Diminishes skin oil to reduce acne & blemishes using Regu-Seb.', 'Diminishes skin oil to reduce acne & blemishes using Regu-Seb.', 'Soothes skin using Argan Oil base', 'Soothes skin using Argan Oil base', 'Moisturizes skin using and Hyaluronic Acid', 'Moisturizes skin using and Hyaluronic Acid', 'Non greasy formula', 'Non greasy formula', 'Fragrance free, Gluten free, Paraben free, Dye free, and Cruelty free', 'Fragrance free, Gluten free, Paraben free, Dye free, and Cruelty free', 'Supports Healthy Collagen, Youthful Appearance & Skin Elasticity', 'Supports Healthy Collagen, Youthful Appearance & Skin Elasticity', 'High Molecular Weight, Premium-sourced Hyaluronic Acid', 'High Molecular Weight, Premium-sourced Hyaluronic Acid', 'REgu-Seb made from North American Saw Palmetto & South American Sesame Seeds.  Directions: After cleansing, apply product to face twice daily.  Caution:  Keep away from eyes. Store at room temperature. For external use only. Keep out of reach from children. Discontinue use if irritation occurs.', 'REgu-Seb made from North American Saw Palmetto & South American Sesame Seeds.', 'Directions:', 'After cleansing, apply product to face twice daily.', 'Caution:', 'Keep away from eyes. Store at room temperature. For external use only. Keep out of reach from children. Discontinue use if irritation occurs.']\n{'Brand': 'Hyalogic', 'Scent': 'Fresh', 'Item Form': 'Lotion', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1.00 Fl Oz', 'Package Dimensions': '5.39 x 1.69 x 1.18 inches; 2.86 Ounces', 'UPC': '856682008212', 'Manufacturer': 'Hyalogic'}\nI'm not a fan of this \"lotion\". It has a odd, oily, but not oily feel when I apply it to my face. It also seems to lay on my face and I have to rub it into my skin. And, once my skin absorbs this lotion, my face still feels a bit dry, so I have to either layer this one again or use a different, more moisturizing face lotion.<br /><br />I have more of a T zone face and my natural oiliness has decreased over the years. I apply face lotion both day and night. This lotion may be better for someone with noticeably oily skin who doesn't normally apply lotion on the face.\nDo Not Like the Way This Feels When Applying to My Face",
  "profile": "**User Summary:**\n\n- **Product Preference**: The user remains focused on rechargeable electric toothbrushes and has a more pronounced interest in effective personal care products, particularly skincare, hair care, and grooming tools. They've shown increasing interest in quality hair care solutions that address specific hair needs and skin moisturizers.\n- **Value Sensitivity**: They prioritize finding reliable products that deliver quality performance without overspending, maintaining awareness of budget constraints.\n- **Family-Centric**: Emphasizing health and grooming needs for the entire family, the user seeks products suitable for diverse hair types and concerns, ensuring both spouse and children are considered.\n- **Performance Focus**: High effectiveness is crucial in personal care items. The user is willing to adapt preferences based on new experiences, though recent dissatisfaction with a facial moisturizer suggests a need for products that better meet their skincare requirements.\n- **Longevity and Maintenance**: Regular upkeep is a key factor in product selection, highlighting a commitment to the long-term care of all family members.\n- **Shopping Habits**: They shop online and in-store, always looking for competitive pricing and functional features.\n- **Consistency in Quality**: While loyal to certain brands, the user is open to alternatives to meet their family's diverse needs.\n- **Overall Satisfaction**: Generally content with product performance, they are adaptive and seek to ensure products fulfill varied family grooming and skincare requirements, although recent negative experiences may prompt a reevaluation of skincare products.",
  "metrics": {
    "rouge1_f": 0.11254980079681273,
    "rouge2_f": 0.009970089730807579,
    "rougeL_f": 0.05776892430278885,
    "meteor": 0.04011602782460813,
    "bleu1": 0.0005167288366913588,
    "bleu2": 0.00014234280041904905,
    "bleu3": 2.069016304833834e-05,
    "bleu4": 7.89483523069697e-06,
    "bertscore_precision": 0.37104177474975586,
    "bertscore_recall": 0.48853230476379395,
    "bertscore_f1": 0.42175745964050293
  }
}