{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dragonball: Evolution [Blu-ray]\nReview Date: 2016/03/08\nStore: Justin Chatwin  (Actor),     Chow Yun-Fat  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', \"Based on one of the most popular Japanese manga series of all time, Dragonball: Evolution follows a young warrior on an epic adventure to discover his destiny...and save the world from the forces of darkness. For his eighteenth birthday, mild-mannered Goku is given a mystical Dragonball, one of only seven in existence, which combine to grant a perfect wish to whoever possesses them. But an ancient warlord named Piccolo has escaped eternal imprisonment and is on his own quest to gather the Dragonballs. Goku must enlist the help of his friends--and the power of his evolving martial arts skills--to defeat Piccolo before it's too late! Packed with spectacular visual effects, high-flying action, and over an hour of hard-hitting extras, Dragonball: Evolution Z-Edition brings the legend to life like never before!\", 'Amazon.com', 'Co-produced by Hong Kong legend Stephen Chow (', 'Kung Fu Hustle', '),', 'Dragonball Evolution', 'is an agreeable if low-wattage live action adaptation of the iconic manga and anime series', 'Dragon Ball', '. Director James Wong fuses the series’ fantasy-based characters and devices with a somewhat lackluster storyline involving average teen Goku (Justin Chatwin), who breaks from his wholesale pining for classmate Chi-Chi (Jamie Chung) to that he’s at the center of an intergalactic search for the all-powerful Dragonballs by evil warlord Piccolo (', 'Buffy', '’s James Marsters). With the help of master Roshi (Chow Yun-Fat, who backburners his stoic screen image in favor of some', 'God of Gamblers', '/', 'Once a Thief', '-level hamminess), Goku develops his fighting skills to take on Piccolo and save the Earth. The film’s abundance of martial arts should please younger and less discerning viewers, but its hackneyed dialogue and sluggish pace (especially in the fight scenes, which stutter where they should flow) may disappoint longtime fans of the book and television adaptations. The CGI effects, which labor mightily to reproduce the source material’s eye-popping look, also fall short, though the cast is game, especially Marsters and Chow.', '-- Paul Gaita', 'Stills from', 'Dragonball: Evolution', '(Click for larger image)']\nAverage Rating: 3.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen, DubbedMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen, Dubbed  See more', 'Contributor': 'Chow Yun-Fat, Justin Chatwin', 'Language': 'English', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '2.40:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 0.01 Ounces', 'Item model number': 'FOXS22599900BR', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 25 minutes', 'Release date': 'July 28, 2009', 'Actors': 'Justin Chatwin, Chow Yun-Fat', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: the first 2 minutes I was actually enjoying the movie then FOX decided to take a dump all over the story after that and the rest just got worse.\nReview Title: amazon would have to offer this movie for free in order for me to order it.\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "The Big Bang Theory: Season 1\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Big Bang Theory: S1 (DVD)', 'Leonard and Sheldon are brilliant physicists, the kind of \"beautiful minds\" that understand how the universe works. But none of that genius helps them interact with people, especially women. All this begins to change when a free-spirited beauty named Penny moves in next door. Sheldon, Leonard\\'s roommate, is quite content spending his nights playing Klingon Boggle with their socially dysfunctional friends, fellow Caltech scientists Wolowitz and Koothrappali. However, Leonard sees in Penny a whole new universe of possibilities ... including love.', ']]>', 'Amazon.com', 'The delightful sitcom', 'The Big Bang Theory', \"revolves around a character type rarely seen on television: The alpha geek. Physicists Leonard (Johnny Galecki) and Sheldon (Jim Parsons) get their lives shaken up when an attractive young woman named Penny (Kaley Cuoco) moves in to the apartment across from theirs. The key to the show, though, is not that they both fall haplessly in love--Leonard does, but Sheldon remains impermeably aloof and caustic about anything resembling romance or human relationships in general. While the push and pull of Leonard's yearning for Penny motivates much of the series' ongoing plot, the show's real drive comes from Sheldon's fantastic combination of obsessive-compulsive neurosis and grandiose obliviousness. He's a brilliant comic creation, imperious and dorky, a seamless collaboration of clever writing and an inspired performance by Parsons. Whether Sheldon loses his job for insulting his new boss, or finds his ego bruised by a child prodigy, or finds himself unable to bear being part of a lie that Leonard has told, he attacks the world with a relentless need to assert his supremacy--and the results are deeply funny.\", 'The triumph of', 'The Big Bang Theory', 'is that everyone is written with genuine affection; what could have been a lifeless parade of stereotypes--', 'Two Nerds and a Hot Chick', \"--becomes instead a charming collision of cultures. The familiar stuff (computer games, comic books, social incompetence) has the grit of specificity; the show understands the difference between Halo and Halo 3, knows what the Bottle City of Kandor is, and grasps the infinite variety of ways in which a conversation can go terribly awry. (Penny gets less nuance, but Cuoco still gives her a distinctive personality.) Kudos as well to supporting players Simon Helberg and Kunal Nayyar, who bring their own variations on geekiness to the table, and to great appearances by some of Galecki's former cohorts on\", 'Roseanne', \"--Sara Gilbert as geekette Leslie and Laurie Metcalf as Sheldon's fundamentalist mother. All in all, one of the most winning sitcoms in years.\", '--Bret Fetzer']\n{'Genre': 'Comedy', 'Format': 'NTSC, AC-3, Multiple Formats, Color, Subtitled, Box set, Widescreen, Dolby', 'Contributor': 'Jim Parsons, Johnny Galecki, Kaley Cuoco', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': '1419873148', 'Media Format': 'NTSC, AC-3, Multiple Formats, Color, Subtitled, Box set, Widescreen, Dolby', 'Run time': '5 hours and 55 minutes', 'Release date': 'September 2, 2008', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco', 'Dubbed': 'Portuguese', 'Subtitles': 'English, Spanish, French, Chinese, Portuguese, Korean, Thai', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nwhat can i say i'm a nerd and i love this show what more could you want out of a show\ngreat show\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Takao Kato'], 'Starring': ['Kyle Hebert', 'Chris Smith', 'David Keefir'], 'Studio': ['Viz Media']}\nso far so good i read the manga and wanted to check out the anime. the manga writer wrote rurouni kenshin (one of my all time favorite series).\nso far so good\nDragon Ball Z: Resurrection 'F' [Blu-ray]\nChristopher R. Sabat  (Actor, Director),     Sean Schemmel  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Hot on the heels of last year’s summer blockbuster, Dragon Ball Z is back in theaters. Dragon Ball Z: Resurrection ‘F’ is the second film personally supervised by the series creator Akira Toriyama, following Battle of Gods. The new movie showcases the return of Frieza – one of the anime world’s greatest villains. Frieza has been resurrected and plans to take his revenge on the Z-Fighters of Earth. Goku and Vegeta must reach new levels of power in order to protect Earth from their vengeful nemesis.']\n{'Genre': 'DVD Movie, DragonBallZ: Resurrection F, Animation, Blu-ray Movie, Anime & Manga, Dragon Ball Z: Resurrection F, DragonBall Z: Resurrection F, Action & AdventureDVD Movie, DragonBallZ: Resurrection F, Animation, Blu-ray Movie, Anime & Manga, Dragon Ball Z: Resurrection F, DragonBall Z: Resurrection F, Action & Adventure   See more', 'Format': 'Blu-ray, Animated, Color, Digital_copy', 'Contributor': 'Chris Ayres, Christopher R. Sabat, Sean Schemmel', 'Language': 'English (Dolby Digital 5.1), Japanese (Dolby Digital 5.1)', 'Runtime': '3 hours and 6 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.3 x 0.4 inches; 0.01 Ounces', 'Director': 'Christopher R. Sabat', 'Media Format': 'Blu-ray, Animated, Color, Digital_copy', 'Run time': '3 hours and 6 minutes', 'Release date': 'October 20, 2015', 'Actors': 'Christopher R. Sabat, Sean Schemmel, Chris Ayres', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'Funimation', 'Country of Origin': 'USA', 'Number of discs': '2'}\ni love dbz but i liked this movie. great battle scenes but the movie wasn't as good as battle of gods\nit's a good movie but just not great.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ian Graham', 'Colin Heck', 'Joaquim Dos Santos', 'Ki Hyun Ryu', 'Melchior Zwyer', 'Michael Dante DiMartino'], 'Producers': ['Joaquim Dos Santos', 'Ki Hyun Ryu', 'Michael Dante DiMartino', 'Bryan Konietzko', 'Tim Yoon', 'Karen Malach', 'Lauren Montgomery'], 'Studio': ['NICKELODEON']}\ngreat show but just shy of being equal to avatar the last airbender but worth watch still\nFive Stars\nDragonball: Evolution [Blu-ray]\nJustin Chatwin  (Actor),     Chow Yun-Fat  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Based on one of the most popular Japanese manga series of all time, Dragonball: Evolution follows a young warrior on an epic adventure to discover his destiny...and save the world from the forces of darkness. For his eighteenth birthday, mild-mannered Goku is given a mystical Dragonball, one of only seven in existence, which combine to grant a perfect wish to whoever possesses them. But an ancient warlord named Piccolo has escaped eternal imprisonment and is on his own quest to gather the Dragonballs. Goku must enlist the help of his friends--and the power of his evolving martial arts skills--to defeat Piccolo before it's too late! Packed with spectacular visual effects, high-flying action, and over an hour of hard-hitting extras, Dragonball: Evolution Z-Edition brings the legend to life like never before!\", 'Amazon.com', 'Co-produced by Hong Kong legend Stephen Chow (', 'Kung Fu Hustle', '),', 'Dragonball Evolution', 'is an agreeable if low-wattage live action adaptation of the iconic manga and anime series', 'Dragon Ball', '. Director James Wong fuses the series’ fantasy-based characters and devices with a somewhat lackluster storyline involving average teen Goku (Justin Chatwin), who breaks from his wholesale pining for classmate Chi-Chi (Jamie Chung) to that he’s at the center of an intergalactic search for the all-powerful Dragonballs by evil warlord Piccolo (', 'Buffy', '’s James Marsters). With the help of master Roshi (Chow Yun-Fat, who backburners his stoic screen image in favor of some', 'God of Gamblers', '/', 'Once a Thief', '-level hamminess), Goku develops his fighting skills to take on Piccolo and save the Earth. The film’s abundance of martial arts should please younger and less discerning viewers, but its hackneyed dialogue and sluggish pace (especially in the fight scenes, which stutter where they should flow) may disappoint longtime fans of the book and television adaptations. The CGI effects, which labor mightily to reproduce the source material’s eye-popping look, also fall short, though the cast is game, especially Marsters and Chow.', '-- Paul Gaita', 'Stills from', 'Dragonball: Evolution', '(Click for larger image)']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen, DubbedMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen, Dubbed  See more', 'Contributor': 'Chow Yun-Fat, Justin Chatwin', 'Language': 'English', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '2.40:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 0.01 Ounces', 'Item model number': 'FOXS22599900BR', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 25 minutes', 'Release date': 'July 28, 2009', 'Actors': 'Justin Chatwin, Chow Yun-Fat', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nthe first 2 minutes I was actually enjoying the movie then FOX decided to take a dump all over the story after that and the rest just got worse.\namazon would have to offer this movie for free in order for me to order it.",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** Strong affinity for TV comedies, particularly sitcoms featuring nerd culture, alongside a deep appreciation for manga and anime. Recent engagement suggests a shift towards a broader genre interest, including action-oriented content.\n- **Genre Preference:** Enjoys character-driven narratives with socially awkward, relatable characters, but recent views reflect disappointment with adaptations that fail to meet expectations, particularly in storytelling quality.\n- **Cultural References:** Values shows and films that incorporate geeky elements like gaming and comics, enhancing emotional connections through narrative depth.\n- **Character Appeal:** Draws attraction to characters with neurodiverse traits, showcasing obsessive-compulsive behaviors or brilliance coupled with social ineptness.\n- **Emotional Connection:** Prioritizes genuine humor and character evolution, avoiding stories reliant on stereotypes; resonates with personal experiences in both manga and anime.\n- **Rating Behavior:** Tends to provide high ratings for relatable content but shows recent indications of strong criticism towards poorly executed adaptations, impacting overall rating tendencies.\n- **Self-Identification:** Identifies as a \"nerd,\" reflecting a robust connection between personal identity and enjoyed content, while continuing to embrace both traditional and contemporary forms of geek culture. The latest experience underlines a commitment to quality storytelling over nostalgic attachment, indicating a potential reevaluation of past favorites.",
  "metrics": {
    "rouge1_f": 0.10454545454545455,
    "rouge2_f": 0.0068259385665529,
    "rougeL_f": 0.046590909090909086,
    "meteor": 0.033138787219309525,
    "bleu1": 0.0002290845587536643,
    "bleu2": 5.7379505234113166e-05,
    "bleu3": 1.9930098076150853e-05,
    "bleu4": 6.611490352229139e-06,
    "bertscore_precision": 0.35381588339805603,
    "bertscore_recall": 0.4898558557033539,
    "bertscore_f1": 0.410867840051651
  }
}