{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Segbeauty empty bottle 290\nReview Date: 2019/10/21\nStore: TruuMe\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nReview Text: This Fine Mist Clear Bottles, Segbeauty 5.4oz/160ml Continuous Plastic Spray Squirt Bottle is a unique style spray bottle that mists fairly well, without the typical pump action you need with regular manual spray bottles. This has a pressurized lever that provides a longer spray with one squeeze. The mist is fine, but not quite as fine as I was hoping- it's more granular than a steamer or vibration dispenser (like cool mist vaporizers), but this is manual, so I guess I'm complaining for no reason. For a hand pump spray, this is a very good (fine) spray overall.  They recommend that you not put anything but water in the device, and I'm guessing that may be due to it being easy to clog. So, if you do add some other products in the bottle, just be aware that it's not recommended.\nReview Title: Unique, Manual Squeeze-type Water Spray\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Imstyle Drag Queens Wig Wavy Ash Brown Heat Resistant Synthetic Lace Wig\nIMSTYLE\n{'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'IMSTYLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.21 x 6.5 x 2.4 inches; 13.05 Ounces', 'Item model number': 'CWN5#16/8', 'UPC': '795400523081'}\nAmazing quality and realistic looking product. Imstyle's Ash Brown. I hope they bring this back. After trying out so many wigs for fun and costuming, this is IT. I would buy this again in a heartbeat.\nAmazing. This Looks So Real. Color is Fantastic\nCORELLE Livingware South Beach 8.5\" Plate (Set of 4), 8.5 Inch (Pack of 4)\nCorelle\n['Corelle Livingware South Beach 8.5\" Plate (Set of 4)']\n{'Material': 'Glass', 'Brand': 'Corelle', 'Color': 'Nipple-471', 'Special Feature': 'Alcohol-Free', 'Occasion': 'Beach', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 10 x 1 inches; 8.64 Ounces', 'Item model number': '1113999', 'Department': 'Womens', 'UPC': '071160081611 793842466546 735343339578', 'Manufacturer': 'CORELLE'}\nWhen I was a kid, we'd always had these around our home- different patterns of course, but the same Corelle glass plate sets that I still love today. And boy am I sorry I had given so many settings away to charities over the years as I've moved, thinking I'd just get some nicer plates.  Well, I do have &#34;nicer&#34; (aka at least more expensive, anyways) plates, and had gone through that whole phase w the bridal registry picks, fancy parties and such. Lately tho, I am back to ease of use, and simple living is far more important to me. I've been purchasing Corelle plates and bowls again, which I like to use the most, because nothing beats their lightweight and thin design, and I love their bright designs, like this newer South Beach pattern, which is just very Happy.  Some things just are good, and stay good, no matter how many years pass.\nAwesome Corelle. What's Not to Love?\n1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nTemer\n{'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nThis Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer is a very good moisturizing acid, with the benefit of stimulating skin sloughing and renewal over time. The texture is like a lightweight syrup (but not sticky), and it has very little fragrance. This goes on the face smoothly and provides a protective, lightly moisturizing feel that does not sting at all. I like how my face feels very soft and dewy when I wake up, as I use this before bedtime. I think my skin has definitely improved in texture over the few weeks I've used this.\nLightly Moisturizing and Non-Stinging\nSegbeauty empty bottle 290\nTruuMe\n{'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nThis Fine Mist Clear Bottles, Segbeauty 5.4oz/160ml Continuous Plastic Spray Squirt Bottle is a unique style spray bottle that mists fairly well, without the typical pump action you need with regular manual spray bottles. This has a pressurized lever that provides a longer spray with one squeeze. The mist is fine, but not quite as fine as I was hoping- it's more granular than a steamer or vibration dispenser (like cool mist vaporizers), but this is manual, so I guess I'm complaining for no reason. For a hand pump spray, this is a very good (fine) spray overall.  They recommend that you not put anything but water in the device, and I'm guessing that may be due to it being easy to clog. So, if you do add some other products in the bottle, just be aware that it's not recommended.\nUnique, Manual Squeeze-type Water Spray",
  "profile": "The user maintains a strong interest in high-quality wigs characterized by realistic appearances and versatility for various uses, including costuming. Their appreciation for features such as heat resistance, contemporary styles, and authentic colors underscores a commitment to creative expression through fashion. Recently, they have expanded their focus to include practical and nostalgic homeware, favoring lightweight and durable items that promote simplicity and ease of use.\n\nIn addition to fashion and home essentials, the user is increasingly dedicated to skincare and personal wellness. They have expressed satisfaction with a hydrating serum that enhances skin texture while providing soothing moisture, highlighting their preference for products that yield visible results without overwhelming scents or textures.\n\nThe user has also shown interest in practical beauty tools, evidenced by a recent purchase of a unique spray bottle that improves misting efficiency for daily routines. Their focus on such items suggests a desire for functionality alongside quality.\n\nOverall, the user's preferences reflect a harmonious blend of creativity, practicality, and self-care. They prioritize quality and aesthetic appeal across all aspects of their lifestyle, seeking products that evoke positive memories while enhancing daily experiences.",
  "metrics": {
    "rouge1_f": 0.21709006928406466,
    "rouge2_f": 0.018518518518518517,
    "rougeL_f": 0.09930715935334873,
    "meteor": 0.07325112928824319,
    "bleu1": 0.016353312759669756,
    "bleu2": 0.0057630657814844955,
    "bleu3": 0.0023098458618536774,
    "bleu4": 0.0006923386111029651,
    "bertscore_precision": 0.3237031102180481,
    "bertscore_recall": 0.4515196979045868,
    "bertscore_f1": 0.3770744204521179
  }
}