{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Snowball Express\nReview Date: 2013/01/15\nStore: Dean Jones  (Actor),     Nancy Olson  (Actor),     Norman Tokar  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: ['Product Description', 'Johnny Baxter (Dean Jones), a New York accountant, inherits a hotel in the Rocky Mountains, quits his job, and moves his family out West to beautiful Colorado. The Rockies never seemed rockier as the Baxters find their \"estate\" in a state of total dilapidation.|A city ordinance prohibiting snowmobiles on the main street of Crested Butte in the Colorado Rockies had to be temporarily suspended so the crew could film a snowmobile race.', 'Amazon.com', \"When New York accountant Johnny Baxter (Dean Jones) learns he has inherited a Colorado hotel, he promptly quits his thankless job, packs up his dubious family, and heads west. Since this is a Disney comedy, the inn's only customers turn out to be nonpaying raccoons and its decorating motif is strictly cobweb. To make matters worse, the local banker not only refuses Baxter a loan, but tries to buy out the desperate newcomer with a lowball figure. But with the help of an eccentric squatter (\", 'M*A*S*H', \"'s Harry Morgan), a local snowmobile dude, and an avalanche, the city slickers eventually prevail. Jones' slapstick style is showcased in ski and snowmobile scenes featuring vintage 1972 special effects that are nevertheless hysterical to kids. With a G rating, this is safe, relatively entertaining family fare. (Ages 5 and older)\", '--Kimberly Heinrichs']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Michael McGreevey, David White, Arnold Margolin, Alice Backes, Norman Tokar, Dean Jones, Johnny Whitaker, Keenan Wynn, Jim Parker, Nancy Olson, Mary Wickes, Don Tait, John Myhers, Joanna Phillips, Kathleen Cody, George Lindsey, Harry Morgan, Dick Van PattenMichael McGreevey, David White, Arnold Margolin, Alice Backes, Norman Tokar, Dean Jones, Johnny Whitaker, Keenan Wynn, Jim Parker, Nancy Olson, Mary Wickes, Don Tait, John Myhers, Joanna Phillips, Kathleen Cody, George Lindsey, Harry Morgan, Dick Van Patten   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '786936219647', 'Director': 'Norman Tokar', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'April 22, 2003', 'Actors': 'Dean Jones, Nancy Olson, Harry Morgan, Keenan Wynn, Johnny Whitaker', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Don Tait, Jim Parker, Arnold Margolin', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: We have it on VHS but wanted it on DVD.  This is a funny movie.  It has action and comedy combined.\nReview Title: Great Movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hot Lead & Cold Feet\nJim Dale  (Actor),     Karen Valentine  (Actor),     Robert Butler  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"There's magic in the memories as great Disney moments are captured right here for you and your family to enjoy. A two-gun terror and his terrified twin brother turn an old cowtown upside down. A blazing, rip-roaring, riotous saga of brotherly competition in a winner-take-all battle for an inheritance. Jim Dale (PETE'S DRAGON, UNIDENTIFIED FLYING ODDBALL) stars in a triple-header of a role, pulling all the stops out as he plays three different people: Old Jasper Bloodshy and his two sons.|Portions of the film were shot on location in Deschutes National Forest in Oregon, from Snowy Mt. Bachelor along the Cascade Range, across the Deschutes River gorge, to the black rocks of Lava Butte.\"]\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Color, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': 'Jim Dale, Warren Vanders, Debbie Lytton, Robert Butler, Jack Elam, Screenplay By Joe McEveety And Arthur Alsberg And, John Williams, Michael Sharrett, Don Knotts, Ed Bakey, John Steadman, Karen Valentine, Based On A Story By Rod Piffath, Darren McGavinJim Dale, Warren Vanders, Debbie Lytton, Robert Butler, Jack Elam, Screenplay By Joe McEveety And Arthur Alsberg And, John Williams, Michael Sharrett, Don Knotts, Ed Bakey, John Steadman, Karen Valentine, Based On A Story By Rod Piffath, Darren McGavin  See more', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '2259773', 'Director': 'Robert Butler', 'Media Format': 'Color, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'July 6, 2004', 'Actors': 'Jim Dale, Karen Valentine, Don Knotts, Darren McGavin, Jack Elam', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Screenplay By Joe McEveety And Arthur Alsberg And, Based On A Story By Rod Piffath', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  It is a funny family movie.  We can watch it over and over.\nGreat Movie\nThe One and Only, Genuine, Original Family Band\nWalter Brennan  (Actor),     Buddy Ebsen  (Actor),     Michael O'Herlihy  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', 'There\\'s magic in the memories as great Disney moments are captured right here for you and your family to enjoy in THE ONE AND ONLY, GENUINE, ORIGINAL FAMILY BAND -- a large slice of Americana set to music and dance. This is the captivating saga of a musical family that homesteads in the Dakota Territory of the 1880s and becomes embroiled in the presidential battle between Grover Cleveland and Benjamin Harrison. A robust, song-filled movie for those who enjoy a good love story, admire a family that sticks together through thick and thin, or respond to rousing, Broadway-style music ... composed by the Academy Award(R) winning Sherman Brothers (1964 Best Score, Best Original Song, MARY POPPINS).|Goldie \"Jean\" Hawn plays a bit part in this 1968 film, which also features her future significant other, Kurt Russell.', 'Amazon.com', '\"All I know is, the Democrats elected a president, and the Republicans cheated \\'em out of it!\" No, this is not a Michael Moore documentary, but a 1968 Disney musical.', 'The One and Only, Genuine, Original Family Band', 'is probably the best musical comedy set against the 1888 presidential campaign between Grover Cleveland and Benjamin Harrison. The family band, a bit like American prairie Von Trapps, settles in the Dakota territory. Problem is, Grandpappy Walter Brennan is a diehard Democrat, and Dakota is rife with Republicans, including the suitor (John Davidson at his dimpledest) to his granddaughter (Lesley Ann Warren). The score by the Sherman brothers is not their best, and the \"family fare\" approach almost killed Disney films during this era. Nice to see old hoofer Buddy Ebsen get to dance a bit, and trivia buffs should note that Kurt Russell and Goldie Hawn are first linked here--he\\'s one of the kids, she\\'s a featured dancer.', '--Robert Horton']\n{'Genre': 'ACTION, Musical, LIVE', 'Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Contributor': \"Heidi Rook, Wally Cox, Steve Harmon, Debbie Smith, Jon Walmsley, Bobby Riha, Kurt Russell, Walter Brennan, Janet Blair, Smith Wordes, Michael O'Herlihy, Lowell S. Hawley, John Davidson, Pamelyn Ferdin, Buddy Ebsen, Lesley Ann Warren, Richard DeaconHeidi Rook, Wally Cox, Steve Harmon, Debbie Smith, Jon Walmsley, Bobby Riha, Kurt Russell, Walter Brennan, Janet Blair, Smith Wordes, Michael O'Herlihy, Lowell S. Hawley, John Davidson, Pamelyn Ferdin, Buddy Ebsen, Lesley Ann Warren, Richard Deacon   See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '2259768', 'Director': \"Michael O'Herlihy\", 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Run time': '1 hour and 50 minutes', 'Release date': 'July 6, 2004', 'Actors': 'Walter Brennan, Buddy Ebsen, Lesley Ann Warren, John Davidson, Janet Blair', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Lowell S. Hawley', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  We love this movie.  It is fun to watch.  They do not make musicals like these anymore.\nGreat Movie\nBlackbeard's Ghost\nDean Jones  (Actor),     Peter Ustinov  (Actor),     Robert Stevenson  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', \"Award-winning actor Peter Ustinov stars in this hilarious fantasy as the ghost of the legendary pirate Blackbeard. The once blackhearted scoundrel materializes in a small New England town, cursed to wander in limbo until he performs a good deed. He gets his chance when he decides to help a local college track team ... that hasn't a ghost of a chance of winning! Blackbeard finds himself full of team spirit, and dispensing his own brand of invisible coaching ... in this warmhearted comedy that will have you laughing from his first fade-in to his final fade-out!|This film featured the second Disney teaming of Suzanne Pleshette and Dean Jones, who scored a hit in 1966's THE UGLY DACHSHUND. They would team up once again in 1976 for THE SHAGGY D.A.\", 'Amazon.com', 'In the moody prologue, amid a raging storm that evokes Hollywood golden-age high-seas swashbucklers, a foreboding scroll recounts the legend of one of the bloodiest pirates in the history of the Caribbean. Leave it to Disney to turn him into a fun-loving old prankster with a whimsical side. Peter Ustinov mugs shamelessly as the bombastic but harmless apparition who renounces his wicked ways to become the mischievous school spirit of the local college, much to the annoyance of straight-arrow track coach Dean Jones. Made in the heyday of Disney\\x92s live-action family comedies,', \"Blackbeard's Ghost\", 'is all haphazard but high-energy slapstick and squeaky-clean romance (courtesy of contemporary schoolmarm Suzanne Pleshette) performed with more gumption than grace, but there\\x92s a nostalgic innocence to the whole overplayed affair.', '--Sean Axmaker']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Michael Conrad, Joby Baker, Suzanne Pleshette, Dean Jones, Peter Ustinov, Bill Walsh, Don DaGradi, Gil Lamb, Robert Stevenson, Norman Grabowski, Elliott Reid, Elsa Lanchester, Herbie Faye, Ned Glass, George Murdock, Hank Jones, Charlie Brill, Richard DeaconMichael Conrad, Joby Baker, Suzanne Pleshette, Dean Jones, Peter Ustinov, Bill Walsh, Don DaGradi, Gil Lamb, Robert Stevenson, Norman Grabowski, Elliott Reid, Elsa Lanchester, Herbie Faye, Ned Glass, George Murdock, Hank Jones, Charlie Brill, Richard Deacon   See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '2578000', 'Director': 'Robert Stevenson', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'June 4, 2002', 'Actors': 'Dean Jones, Peter Ustinov, Suzanne Pleshette, Elsa Lanchester, Charlie Brill', 'Subtitles': 'English', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Don DaGradi, Bill Walsh', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  We love this movie.  It is funny.  We can watch it over and over.\nGreat Movie\nIf a Man Answers\nSandra Dee  (Actor),     Bobby Darin  (Actor),     Henry Levin  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Sandra Dee and Bobby Darin co-star in a devilishly wicked romantic comedy about the lengths people will go to win the game of love. Rich, beautiful and stylish socialite Chantal Stacy (Dee) has just married charming, talented photographer Eugene Wright (Darin). On the advice of her mother, Chantal tries to \"train\" her man to be the perfect husband. But once he\\'s on to her womanly wiles, Eugene answers with some jealousy-baiting tactics in this fun-filled battle of the sexes.Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Richard Morris, Christopher W. Knight, Ross Hunter, Sandra Dee, Bobby Darin, John Lund, Stefanie Powers, Cesar Romero, Micheline Presle, Henry LevinRichard Morris, Christopher W. Knight, Ross Hunter, Sandra Dee, Bobby Darin, John Lund, Stefanie Powers, Cesar Romero, Micheline Presle, Henry Levin  See more', 'Initial release date': '2004-08-03', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '2:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.6 Ounces', 'Item model number': '1025590', 'Director': 'Henry Levin', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Sandra Dee, Bobby Darin, Micheline Presle, John Lund, Cesar Romero', 'Subtitles': 'French, Spanish', 'Producers': 'Ross Hunter', 'Studio': 'Studio Distribution Services', 'Writers': 'Richard Morris', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  I have not seen it on TV.  I remember it from years ago.  It is a cute funny movie with a suprise ending.\nGreat Movie\nSnowball Express\nDean Jones  (Actor),     Nancy Olson  (Actor),     Norman Tokar  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', 'Johnny Baxter (Dean Jones), a New York accountant, inherits a hotel in the Rocky Mountains, quits his job, and moves his family out West to beautiful Colorado. The Rockies never seemed rockier as the Baxters find their \"estate\" in a state of total dilapidation.|A city ordinance prohibiting snowmobiles on the main street of Crested Butte in the Colorado Rockies had to be temporarily suspended so the crew could film a snowmobile race.', 'Amazon.com', \"When New York accountant Johnny Baxter (Dean Jones) learns he has inherited a Colorado hotel, he promptly quits his thankless job, packs up his dubious family, and heads west. Since this is a Disney comedy, the inn's only customers turn out to be nonpaying raccoons and its decorating motif is strictly cobweb. To make matters worse, the local banker not only refuses Baxter a loan, but tries to buy out the desperate newcomer with a lowball figure. But with the help of an eccentric squatter (\", 'M*A*S*H', \"'s Harry Morgan), a local snowmobile dude, and an avalanche, the city slickers eventually prevail. Jones' slapstick style is showcased in ski and snowmobile scenes featuring vintage 1972 special effects that are nevertheless hysterical to kids. With a G rating, this is safe, relatively entertaining family fare. (Ages 5 and older)\", '--Kimberly Heinrichs']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Michael McGreevey, David White, Arnold Margolin, Alice Backes, Norman Tokar, Dean Jones, Johnny Whitaker, Keenan Wynn, Jim Parker, Nancy Olson, Mary Wickes, Don Tait, John Myhers, Joanna Phillips, Kathleen Cody, George Lindsey, Harry Morgan, Dick Van PattenMichael McGreevey, David White, Arnold Margolin, Alice Backes, Norman Tokar, Dean Jones, Johnny Whitaker, Keenan Wynn, Jim Parker, Nancy Olson, Mary Wickes, Don Tait, John Myhers, Joanna Phillips, Kathleen Cody, George Lindsey, Harry Morgan, Dick Van Patten   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '786936219647', 'Director': 'Norman Tokar', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'April 22, 2003', 'Actors': 'Dean Jones, Nancy Olson, Harry Morgan, Keenan Wynn, Johnny Whitaker', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Don Tait, Jim Parker, Arnold Margolin', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  This is a funny movie.  It has action and comedy combined.\nGreat Movie",
  "profile": "**User Profile Summary:**\n\n- **Media Format Preference:** Strong inclination towards DVDs, actively transitioning from VHS, underscored by recent purchases of classic films in DVD format; specifically focused on replacing older VHS titles for enhanced viewing quality.\n- **Genre Affinity:** Enjoys family-friendly content, particularly in action, comedy, and musical genres. Continued interest in light-hearted romantic comedies and films that offer nostalgic charm, integrating humor and engaging storytelling.\n- **Viewing Frequency:** Values rewatchable films, preferring timeless classics and family-oriented comedies that can be enjoyed multiple times. Recent acquisitions reflect a commitment to experiencing beloved films in improved formats.\n- **Emotional Engagement:** Seeks movies that evoke magic and humor, favoring light-hearted, nostalgic storytelling with family themes. Recent interactions indicate a preference for films with comedic elements and enjoyable surprises.\n- **Ratings Behavior:** Maintains a positive rating average of 4.7, showcasing a discerning taste in quality family entertainment, with notable engagement in films that resonate with nostalgia.\n- **Purchase Behavior:** Engages with content from renowned studios, particularly Disney, demonstrating continued interest in films with notable actors and Americana themes.\n- **Family-Oriented:** Emphasizes family-centric films that blend joy, humor, and romance, reinforcing a commitment to joyful family viewing experiences.\n\nThis profile reflects a user dedicated to enjoying quality family entertainment, cherishing nostalgic classics, and enhancing their collection with DVDs.",
  "metrics": {
    "rouge1_f": 0.08637873754152822,
    "rouge2_f": 0.004987531172069825,
    "rougeL_f": 0.04568106312292359,
    "meteor": 0.025909494232475596,
    "bleu1": 1.9551721916287684e-05,
    "bleu2": 4.1383474891421385e-06,
    "bleu3": 6.702395375966473e-07,
    "bleu4": 2.6997110543836005e-07,
    "bertscore_precision": 0.3555351495742798,
    "bertscore_recall": 0.4979936480522156,
    "bertscore_f1": 0.4148758351802826
  }
}