{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Don Knotts 4-Movie Collection (The Apple Dumpling Gang / The Apple Dumpling Gang Rides Again / Gus / Hot Lead & Cold Feet)\nReview Date: 2014/06/25\nStore: Don Knotts  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: [\"Get ready for four times the fun with THE DON KNOTTS 4-MOVIE COLLECTION. Experience the sidesplitting laughs and outrageous adventure of four Disney comedy classics together for the first time in one sensational DVD set. Legendary funnyman Don Knotts teams with Tim Conway as a bumbling duo who can't shoot straight in THE APPLE DUMPLING GANG and its hit sequel, THE APPLE DUMPLING GANG RIDES AGAIN. The fun is just getting started as Knotts plays the coach of a place-kicking mule in the uproarious comedy, GUS, and as the hysterical Denver Kid in HOT LEAD & COLD FEET. The whole family will love these four hilarious Don Knotts movies in one collectible set!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': 'Don Knotts', 'Language': 'English', 'Runtime': '6 hours and 16 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.59 Ounces', 'Item model number': '35437820', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '6 hours and 16 minutes', 'Release date': 'September 2, 2012', 'Actors': 'Don Knotts', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: Don Knotts movies never get old.  They are good for the young and old.  We can watch them over and over and they never get old.\nReview Title: Disney Movies\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hot Lead & Cold Feet\nJim Dale  (Actor),     Karen Valentine  (Actor),     Robert Butler  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"There's magic in the memories as great Disney moments are captured right here for you and your family to enjoy. A two-gun terror and his terrified twin brother turn an old cowtown upside down. A blazing, rip-roaring, riotous saga of brotherly competition in a winner-take-all battle for an inheritance. Jim Dale (PETE'S DRAGON, UNIDENTIFIED FLYING ODDBALL) stars in a triple-header of a role, pulling all the stops out as he plays three different people: Old Jasper Bloodshy and his two sons.|Portions of the film were shot on location in Deschutes National Forest in Oregon, from Snowy Mt. Bachelor along the Cascade Range, across the Deschutes River gorge, to the black rocks of Lava Butte.\"]\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Color, NTSC, Subtitled, Dolby, Widescreen', 'Contributor': 'Jim Dale, Warren Vanders, Debbie Lytton, Robert Butler, Jack Elam, Screenplay By Joe McEveety And Arthur Alsberg And, John Williams, Michael Sharrett, Don Knotts, Ed Bakey, John Steadman, Karen Valentine, Based On A Story By Rod Piffath, Darren McGavinJim Dale, Warren Vanders, Debbie Lytton, Robert Butler, Jack Elam, Screenplay By Joe McEveety And Arthur Alsberg And, John Williams, Michael Sharrett, Don Knotts, Ed Bakey, John Steadman, Karen Valentine, Based On A Story By Rod Piffath, Darren McGavin  See more', 'Language': 'English (Dolby Digital 2.0 Mono), French (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '2259773', 'Director': 'Robert Butler', 'Media Format': 'Color, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'July 6, 2004', 'Actors': 'Jim Dale, Karen Valentine, Don Knotts, Darren McGavin, Jack Elam', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Screenplay By Joe McEveety And Arthur Alsberg And, Based On A Story By Rod Piffath', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  It is a funny family movie.  We can watch it over and over.\nGreat Movie\nThe One and Only, Genuine, Original Family Band\nWalter Brennan  (Actor),     Buddy Ebsen  (Actor),     Michael O'Herlihy  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', 'There\\'s magic in the memories as great Disney moments are captured right here for you and your family to enjoy in THE ONE AND ONLY, GENUINE, ORIGINAL FAMILY BAND -- a large slice of Americana set to music and dance. This is the captivating saga of a musical family that homesteads in the Dakota Territory of the 1880s and becomes embroiled in the presidential battle between Grover Cleveland and Benjamin Harrison. A robust, song-filled movie for those who enjoy a good love story, admire a family that sticks together through thick and thin, or respond to rousing, Broadway-style music ... composed by the Academy Award(R) winning Sherman Brothers (1964 Best Score, Best Original Song, MARY POPPINS).|Goldie \"Jean\" Hawn plays a bit part in this 1968 film, which also features her future significant other, Kurt Russell.', 'Amazon.com', '\"All I know is, the Democrats elected a president, and the Republicans cheated \\'em out of it!\" No, this is not a Michael Moore documentary, but a 1968 Disney musical.', 'The One and Only, Genuine, Original Family Band', 'is probably the best musical comedy set against the 1888 presidential campaign between Grover Cleveland and Benjamin Harrison. The family band, a bit like American prairie Von Trapps, settles in the Dakota territory. Problem is, Grandpappy Walter Brennan is a diehard Democrat, and Dakota is rife with Republicans, including the suitor (John Davidson at his dimpledest) to his granddaughter (Lesley Ann Warren). The score by the Sherman brothers is not their best, and the \"family fare\" approach almost killed Disney films during this era. Nice to see old hoofer Buddy Ebsen get to dance a bit, and trivia buffs should note that Kurt Russell and Goldie Hawn are first linked here--he\\'s one of the kids, she\\'s a featured dancer.', '--Robert Horton']\n{'Genre': 'ACTION, Musical, LIVE', 'Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Contributor': \"Heidi Rook, Wally Cox, Steve Harmon, Debbie Smith, Jon Walmsley, Bobby Riha, Kurt Russell, Walter Brennan, Janet Blair, Smith Wordes, Michael O'Herlihy, Lowell S. Hawley, John Davidson, Pamelyn Ferdin, Buddy Ebsen, Lesley Ann Warren, Richard DeaconHeidi Rook, Wally Cox, Steve Harmon, Debbie Smith, Jon Walmsley, Bobby Riha, Kurt Russell, Walter Brennan, Janet Blair, Smith Wordes, Michael O'Herlihy, Lowell S. Hawley, John Davidson, Pamelyn Ferdin, Buddy Ebsen, Lesley Ann Warren, Richard Deacon   See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '2259768', 'Director': \"Michael O'Herlihy\", 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled', 'Run time': '1 hour and 50 minutes', 'Release date': 'July 6, 2004', 'Actors': 'Walter Brennan, Buddy Ebsen, Lesley Ann Warren, John Davidson, Janet Blair', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Lowell S. Hawley', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  We love this movie.  It is fun to watch.  They do not make musicals like these anymore.\nGreat Movie\nBlackbeard's Ghost\nDean Jones  (Actor),     Peter Ustinov  (Actor),     Robert Stevenson  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', \"Award-winning actor Peter Ustinov stars in this hilarious fantasy as the ghost of the legendary pirate Blackbeard. The once blackhearted scoundrel materializes in a small New England town, cursed to wander in limbo until he performs a good deed. He gets his chance when he decides to help a local college track team ... that hasn't a ghost of a chance of winning! Blackbeard finds himself full of team spirit, and dispensing his own brand of invisible coaching ... in this warmhearted comedy that will have you laughing from his first fade-in to his final fade-out!|This film featured the second Disney teaming of Suzanne Pleshette and Dean Jones, who scored a hit in 1966's THE UGLY DACHSHUND. They would team up once again in 1976 for THE SHAGGY D.A.\", 'Amazon.com', 'In the moody prologue, amid a raging storm that evokes Hollywood golden-age high-seas swashbucklers, a foreboding scroll recounts the legend of one of the bloodiest pirates in the history of the Caribbean. Leave it to Disney to turn him into a fun-loving old prankster with a whimsical side. Peter Ustinov mugs shamelessly as the bombastic but harmless apparition who renounces his wicked ways to become the mischievous school spirit of the local college, much to the annoyance of straight-arrow track coach Dean Jones. Made in the heyday of Disney\\x92s live-action family comedies,', \"Blackbeard's Ghost\", 'is all haphazard but high-energy slapstick and squeaky-clean romance (courtesy of contemporary schoolmarm Suzanne Pleshette) performed with more gumption than grace, but there\\x92s a nostalgic innocence to the whole overplayed affair.', '--Sean Axmaker']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Contributor': 'Michael Conrad, Joby Baker, Suzanne Pleshette, Dean Jones, Peter Ustinov, Bill Walsh, Don DaGradi, Gil Lamb, Robert Stevenson, Norman Grabowski, Elliott Reid, Elsa Lanchester, Herbie Faye, Ned Glass, George Murdock, Hank Jones, Charlie Brill, Richard DeaconMichael Conrad, Joby Baker, Suzanne Pleshette, Dean Jones, Peter Ustinov, Bill Walsh, Don DaGradi, Gil Lamb, Robert Stevenson, Norman Grabowski, Elliott Reid, Elsa Lanchester, Herbie Faye, Ned Glass, George Murdock, Hank Jones, Charlie Brill, Richard Deacon   See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '2578000', 'Director': 'Robert Stevenson', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'June 4, 2002', 'Actors': 'Dean Jones, Peter Ustinov, Suzanne Pleshette, Elsa Lanchester, Charlie Brill', 'Subtitles': 'English', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Don DaGradi, Bill Walsh', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  We love this movie.  It is funny.  We can watch it over and over.\nGreat Movie\nIf a Man Answers\nSandra Dee  (Actor),     Bobby Darin  (Actor),     Henry Levin  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Sandra Dee and Bobby Darin co-star in a devilishly wicked romantic comedy about the lengths people will go to win the game of love. Rich, beautiful and stylish socialite Chantal Stacy (Dee) has just married charming, talented photographer Eugene Wright (Darin). On the advice of her mother, Chantal tries to \"train\" her man to be the perfect husband. But once he\\'s on to her womanly wiles, Eugene answers with some jealousy-baiting tactics in this fun-filled battle of the sexes.Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Richard Morris, Christopher W. Knight, Ross Hunter, Sandra Dee, Bobby Darin, John Lund, Stefanie Powers, Cesar Romero, Micheline Presle, Henry LevinRichard Morris, Christopher W. Knight, Ross Hunter, Sandra Dee, Bobby Darin, John Lund, Stefanie Powers, Cesar Romero, Micheline Presle, Henry Levin  See more', 'Initial release date': '2004-08-03', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '2:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.6 Ounces', 'Item model number': '1025590', 'Director': 'Henry Levin', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Sandra Dee, Bobby Darin, Micheline Presle, John Lund, Cesar Romero', 'Subtitles': 'French, Spanish', 'Producers': 'Ross Hunter', 'Studio': 'Studio Distribution Services', 'Writers': 'Richard Morris', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  I have not seen it on TV.  I remember it from years ago.  It is a cute funny movie with a suprise ending.\nGreat Movie\nSnowball Express\nDean Jones  (Actor),     Nancy Olson  (Actor),     Norman Tokar  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', 'Johnny Baxter (Dean Jones), a New York accountant, inherits a hotel in the Rocky Mountains, quits his job, and moves his family out West to beautiful Colorado. The Rockies never seemed rockier as the Baxters find their \"estate\" in a state of total dilapidation.|A city ordinance prohibiting snowmobiles on the main street of Crested Butte in the Colorado Rockies had to be temporarily suspended so the crew could film a snowmobile race.', 'Amazon.com', \"When New York accountant Johnny Baxter (Dean Jones) learns he has inherited a Colorado hotel, he promptly quits his thankless job, packs up his dubious family, and heads west. Since this is a Disney comedy, the inn's only customers turn out to be nonpaying raccoons and its decorating motif is strictly cobweb. To make matters worse, the local banker not only refuses Baxter a loan, but tries to buy out the desperate newcomer with a lowball figure. But with the help of an eccentric squatter (\", 'M*A*S*H', \"'s Harry Morgan), a local snowmobile dude, and an avalanche, the city slickers eventually prevail. Jones' slapstick style is showcased in ski and snowmobile scenes featuring vintage 1972 special effects that are nevertheless hysterical to kids. With a G rating, this is safe, relatively entertaining family fare. (Ages 5 and older)\", '--Kimberly Heinrichs']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Michael McGreevey, David White, Arnold Margolin, Alice Backes, Norman Tokar, Dean Jones, Johnny Whitaker, Keenan Wynn, Jim Parker, Nancy Olson, Mary Wickes, Don Tait, John Myhers, Joanna Phillips, Kathleen Cody, George Lindsey, Harry Morgan, Dick Van PattenMichael McGreevey, David White, Arnold Margolin, Alice Backes, Norman Tokar, Dean Jones, Johnny Whitaker, Keenan Wynn, Jim Parker, Nancy Olson, Mary Wickes, Don Tait, John Myhers, Joanna Phillips, Kathleen Cody, George Lindsey, Harry Morgan, Dick Van Patten   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '786936219647', 'Director': 'Norman Tokar', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'April 22, 2003', 'Actors': 'Dean Jones, Nancy Olson, Harry Morgan, Keenan Wynn, Johnny Whitaker', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Don Tait, Jim Parker, Arnold Margolin', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  This is a funny movie.  It has action and comedy combined.\nGreat Movie\nThe Moon-Spinners\nHayley Mills  (Actor),     Joan Greenwood  (Actor),     James Neilson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"Start with a fortune in stolen jewels. Add a dash of danger. A pinch of romance. Season with Hitchcock-like intrigue and comic flair. What do you have? A mystery thriller for the whole family ... with the Disney touch. Set against the sun-bleached beauty of the Isle of Crete, the story pits a young English tourist (Hayley Mills) against a wily Greek jewel thief (Eli Wallach). Mistaken identities and perilous escapes -- including a nail-biting battle with a windmill -- lead the junior-miss detective to a final confrontation aboard the yacht of an eccentric millionairess (Pola Negri) with a passion for priceless gems and pet cheetahs!|Pola Negri, the famous silent film star who hadn't made a film in more than 20 years, was personally coaxed out of retirement by Walt Disney to appear as the treacherous Madame Habib.|This was Peter McEnery's Disney film debut, the success of which landed him the title role in THE FIGHTING PRINCE OF DONEGAL.|The script called for Madame Habib (Pola Negri) to own a Siamese cat, but Negri suggested the character own a cheetah instead. The filmmakers agreed.\"]\n{'Genre': 'ACTION, Action/Adventure, LIVE', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Full Screen', 'Contributor': 'Eli Wallach, Michael Dyne, Joan Greenwood, Peter McEnery, Pola Negri, Sheila Hancock, Tutte Lemkow, Hayley Mills, Michael Davis, Harry Tardios, Andre Morell, Irene Papas, Paul Stassino, John Le Mesurier, George Pastell, James Neilson, Steve PlytasEli Wallach, Michael Dyne, Joan Greenwood, Peter McEnery, Pola Negri, Sheila Hancock, Tutte Lemkow, Hayley Mills, Michael Davis, Harry Tardios, Andre Morell, Irene Papas, Paul Stassino, John Le Mesurier, George Pastell, James Neilson, Steve Plytas   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 59 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 118 min', 'Director': 'James Neilson', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Full Screen', 'Run time': '1 hour and 59 minutes', 'Release date': 'January 14, 2003', 'Actors': 'Hayley Mills, Joan Greenwood, Peter McEnery, Pola Negri, Eli Wallach', 'Studio': 'Disney Home Video', 'Writers': 'Michael Dyne', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWE used to have it on VHS but the tape broke and we wanted it on DVD.  It is a cute movie.  Haley Mills movies are always good.\nFun Movie\nSummer Magic\nHayley Mills  (Actor),     Dorothy McGuire  (Actor),     James Neilson  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Hayley Mills brings a joyful enthusiasm to this nostalgic, musical, and bighearted adventure in small-town living, now on Disney DVD. When a close-knit Boston family loses their fortune, they find a wealth of family secrets, young love, and charming summer nights in Beulah, Maine. A good-natured postmaster, pretentious cousin Julia, and the mysterious absentee landlord, Mr. Hamilton, populate their new life in a charming old yellow house. Featuring an all-star supporting cast, including Burl Ives, Dorothy McGuire, and Deborah Walley, this classic and wondrous tale will delight the entire family and belongs in every Disney collection.|This film is based on the novel \"Mother Carey\\'s Chickens,\" by Kate Douglas, which has become an American classic.']\n{'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '3980600', 'Director': 'James Neilson', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '1 hour and 48 minutes', 'Release date': 'May 3, 2005', 'Actors': 'Hayley Mills, Dorothy McGuire, Burl Ives, Deborah Walley, Michael J. Pollard', 'Language': 'English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), Unqualified', 'Studio': 'Walt Disney Home Entertainment', 'Writers': 'Screenplay By Sally Benson, Based On A Book By Kate Douglas Wiggin', 'Number of discs': '1'}\nWe have it on VHS but wanted it on DVD.  This is one of my favorite movies of Haley Mills.  Pollyanna is still number one and this is #2.\nGreat Movie\nFollow Me, Boys!\nFred MacMurray  (Actor),     Vera Miles  (Actor),     Norman Tokar  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['After one year too many on the road with a ramshackle jazz band, Lem Siddons (Fred MacMurray) decides to put down roots. He marries sweetheart Vida Downey (Vera Miles) and embarks on a lifelong roller-coaster ride as a scoutmaster to a steady stream of high-spirited youngsters. Set against lovingly recreated scenes of 1930s America, this family classic shines with all the warmth and humor of Disney entertainment at its nostalgic best.|The movie marks Kurt Russell\\'s Disney film debut, as Whitey.|Variety wrote, \"The production catches the spirit of rural America in the \\'30s with moving charm, blending comedy, drama, and romance in a buildup toward an emotionally charged climax.\"']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Norman Tokar, Luana Patten, Lillian Gish, Madge Blake, Fred MacMurray, David Bailey, Vera Miles, Bill Booth, Elliot Reid, Louis Pelletier, Johnny Bangert, Kurt Russell, Ken Murray, Tol Avery, Charles Ruggles, Richard BakalyanNorman Tokar, Luana Patten, Lillian Gish, Madge Blake, Fred MacMurray, David Bailey, Vera Miles, Bill Booth, Elliot Reid, Louis Pelletier, Johnny Bangert, Kurt Russell, Ken Murray, Tol Avery, Charles Ruggles, Richard Bakalyan  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': '3357900', 'Director': 'Norman Tokar', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '2 hours and 13 minutes', 'Release date': 'February 3, 2004', 'Actors': 'Fred MacMurray, Vera Miles, Lillian Gish, Charles Ruggles, Kurt Russell', 'Subtitles': 'Spanish', 'Studio': 'Walt Disney Home Entertainment', 'Writers': 'Louis Pelletier', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe used to have it on VHS but someone it was taped over part way.  We decided to get it on DVD.  This is a funny and heart warming movie.\nGreat Movie\nThe Ugly Dachshund\nDean Jones  (Actor),     Suzanne Pleshette  (Actor),     Norman Tokar  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'There\\'s magic in the memories as great Disney moments are captured right here for you and your family to enjoy. You don\\'t have to own a pet to enjoy this story of a happy suburban household gone to the dogs! The Garrisons (Dean Jones and Suzanne Pleshette) are the \"proud parents\" of three adorable dachshund pups -- and one overgrown Great Dane named Brutus, who nevertheless thinks of himself as a dainty dachsie. His identity crisis results in an uproarious series of household crises that reduce the Garrisons\\' house to shambles -- and viewers to howls of laughter!|The movie earned $6 million, which was considered a hit in 1966, and it received the \"Boxoffice\" magazine Blue Ribbon Award for the month of March that year.|In the movie, Pleshette is obsessed with dachshunds, but in real life, she shared her home with a Yorkshire terrier named Missy. Because her pooch could smell Pleshette\\'s \"costars\" on her when she got home at night -- and didn\\'t like it -- the actress had to shower and change her clothes before leaving the studio.', 'Amazon.com', \"When a Great Dane puppy is raised with a litter of Dachshunds, it naturally thinks it's a Dachshund too--even when it grows to 10 times the size. Dean Jones and Suzanne Pleshette star as the hapless couple who took in the galumphing dog, which wreaks havoc on their house and home.\", 'The Ugly Dachshund', \"is mostly a series of spectacular disasters (the doggy demolition of Jones's art studio will delight kids and reduce adults to nervous wrecks), but it's held together by the convincing domestic banter of Jones and Pleshette (who was quite a dish in 1965); the pair went on to star in a couple of other Disney live-action flicks,\", \"Bluebeard's Ghost\", 'and', 'The Shaggy D.A.', \". Despite some racial and gender stereotypes, it's a good-natured and amusing movie in the Disney mold. Also featuring classic character actor Charlie Ruggles (\", 'Bringing Up Baby', ',', 'The Parent Trap', ').', '--Bret Fetzer']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Color, Anamorphic, NTSC, Subtitled', 'Contributor': 'Charles Lane, Suzanne Pleshette, Norman Tokar, Dean Jones, Gil Lamb, Screenplay By Albert Aley, Kelly Thordsen, Charles Ruggles, Based On The Book By G.B. Stern, Parley Baer, Robert Kino, Mako, Dick WesselCharles Lane, Suzanne Pleshette, Norman Tokar, Dean Jones, Gil Lamb, Screenplay By Albert Aley, Kelly Thordsen, Charles Ruggles, Based On The Book By G.B. Stern, Parley Baer, Robert Kino, Mako, Dick Wessel   See more', 'Language': 'English (Dolby Digital 2.0 Mono), French, Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '786936234305', 'Director': 'Norman Tokar', 'Media Format': 'Multiple Formats, Color, Anamorphic, NTSC, Subtitled', 'Run time': '1 hour and 33 minutes', 'Release date': 'July 6, 2004', 'Actors': 'Dean Jones, Suzanne Pleshette, Charles Ruggles, Kelly Thordsen, Parley Baer', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Screenplay By Albert Aley, Based On The Book By G.B. Stern', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWe have it on VHS and wanted it on DVD.  This is a really funny movie and we love how it ends.  Dean Jones was perfect for the roll\nGreat Funny Movie\nLittle Secrets [DVD]\nEvan Wood  (Actor),     Michael Angarano  (Actor),     Blair Treu  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Emily Lindstrom, a gifted 14-year-old violinist, skips summer camp in order to prepare for an audition with the prestigious San Francisco Youth Orchestra. Emily has also set up a side business as a \"secret keeper\", charging a 50-cent fee to share and keep the neighborhood children\\'s secrets. She soon discovers, however, that there is a price to keeping secrets that can\\'t be measured in coins.', 'Amazon.com', 'Keeping secrets is difficult and, sometimes, unhealthy. Emily (Evan Rachel Wood) discovers a talent for keeping secrets early in life and deems the skill marketable enough to open her own neighborhood business. Emily is also an amazing violin player with high aspirations for a musical career. Secret-keeping proves lucrative at first, but eventually the burden weighs on Emily and affects her ability to concentrate, hurting her chances of making the local youth symphony. Resolving her dilemma requires the help of two new friends, her violin teacher, parents, and a fair amount of soul-searching. Eventually, Emily\\'s journey leads to the dissolution of her business and a cathartic revelation of a major secret of her own. The moral of Emily\\'s experiences: \"You can\\'t keep secrets about yourself and live a true life,\" and \"if you want to be close to someone, you can\\'t keep secrets from them.\" (Ages 7 and older)', '--Tami Horiuchi']\n{'Genre': 'Drama, Family', 'Format': 'Closed-captioned, Color, Dolby, Dubbed, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Evan Wood, Don Schain, Michael Angarano, Leucadia Film Corporation, David Gallagher, Vivica Fox, Blair TreuEvan Wood, Don Schain, Michael Angarano, Leucadia Film Corporation, David Gallagher, Vivica Fox, Blair Treu  See more', 'Language': 'English', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '7.3 x 5.1 x 0.6 inches; 2.4 Ounces', 'Director': 'Blair Treu', 'Media Format': 'Closed-captioned, Color, Dolby, Dubbed, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Evan Wood, Michael Angarano, David Gallagher, Vivica Fox', 'Dubbed': 'Spanish, Portuguese, French', 'Subtitles': 'Mandarin Chinese, Korean, Thai, English, Portuguese, French, Spanish', 'Producers': 'Don Schain, Blair Treu', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis is a great movie for young and old.  It is great for those who love music.  I watched part of it on the Family Chanel on TV and did not find where it was viewing again.  I ordered the DVD so I could have it in my library and watch it anytime.\nLittle Secrets DVD Movie\nDisney 4-Movie Collection: Classics (Gnome-Mobile / Darby O'gill & Little People / One & Only Genuine Family / Happiest Millionaire)\nRated:    G    Format: DVD\nMovies & TV, Boxed Sets, Drama\n[\"Your wish has been granted. the CLASSIC DISNEY MOVIES COLLECTION mixes music, magic and memories in one fantastic 4-movie set. Relive these timeless family films, featuring Sean Connery, Fred MacMurray, Walter Brennan, Kurt Russell, Lesley Ann Warren and many more of your favorite Disney stars. Get your toes tapping with two musical extravaganzas brimming with sparkling songs and irresistible dances. THE HAPPIEST MILLIONAIRE and THE ONE AND ONLY, GENUINE, FAMILY BAND are captivating stories that will have the whole family singing along. Then, enjoy a wee bit of fun with the enchanting fantasies DARBY O'GILL AND THE LITTLE PEOPLE and THE GNOME-MOBILE. The CLASSIC DISNEY MOVIES COLLECTION has something for everyone!\"]\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': \"Warren, Lesley Ann, Ebsen, Buddy, Stevenson, Robert, Buena Vista Home Entertainment, Munro, Janet, Brennan, Walter, Macmurray, Fred, Garson, Greer, Sharpe, Albert, Garber, Matthew, Connery, Sean, Tokar, Norman, O'Herlihy, Michael, Steele, Tommy, Dotrice, KarenWarren, Lesley Ann, Ebsen, Buddy, Stevenson, Robert, Buena Vista Home Entertainment, Munro, Janet, Brennan, Walter, Macmurray, Fred, Garson, Greer, Sharpe, Albert, Garber, Matthew, Connery, Sean, Tokar, Norman, O'Herlihy, Michael, Steele, Tommy, Dotrice, Karen  See more\", 'Language': 'English', 'Runtime': '7 hours and 42 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 0.01 Ounces', 'Item model number': '786936828375', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '7 hours and 42 minutes', 'Release date': 'September 2, 2012', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '4'}\nThese 4 Disney Movies are Classics.  They are great for young and old.  We are retired but we still enjoy the old Disney Movies.  They do not make movies like that anymore.\nDisney Movies\nDon Knotts 4-Movie Collection (The Apple Dumpling Gang / The Apple Dumpling Gang Rides Again / Gus / Hot Lead & Cold Feet)\nDon Knotts  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"Get ready for four times the fun with THE DON KNOTTS 4-MOVIE COLLECTION. Experience the sidesplitting laughs and outrageous adventure of four Disney comedy classics together for the first time in one sensational DVD set. Legendary funnyman Don Knotts teams with Tim Conway as a bumbling duo who can't shoot straight in THE APPLE DUMPLING GANG and its hit sequel, THE APPLE DUMPLING GANG RIDES AGAIN. The fun is just getting started as Knotts plays the coach of a place-kicking mule in the uproarious comedy, GUS, and as the hysterical Denver Kid in HOT LEAD & COLD FEET. The whole family will love these four hilarious Don Knotts movies in one collectible set!\"]\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': 'Don Knotts', 'Language': 'English', 'Runtime': '6 hours and 16 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.59 Ounces', 'Item model number': '35437820', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '6 hours and 16 minutes', 'Release date': 'September 2, 2012', 'Actors': 'Don Knotts', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '4'}\nDon Knotts movies never get old.  They are good for the young and old.  We can watch them over and over and they never get old.\nDisney Movies",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Format Preference:** Continues to prioritize DVDs, phasing out VHS, while expanding a classic film collection that highlights iconic family-friendly titles.\n\n- **Genre Affinity:** Strongly favors family-friendly action, comedy, and musical genres, with recent acquisitions reinforcing a love for whimsical narratives and classic Disney films, particularly those featuring Don Knotts.\n\n- **Viewing Frequency:** Values highly rewatchable films and timeless classics, demonstrating a sustained passion for nostalgia-infused storytelling and family comedies.\n\n- **Emotional Engagement:** Actively seeks films that blend humor, magic, and adventure, highlighting a love for engaging tales filled with comedic elements and heartfelt moments that resonate across generations.\n\n- **Ratings Behavior:** Consistently provides positive ratings, averaging around 4.7, reflecting a discerning taste for quality entertainment that aligns with personal nostalgia, recently even reaching an average of 5.0 for specific titles.\n\n- **Purchase Behavior:** Engages frequently with renowned studios like Disney and notable actors such as Don Knotts, underlining an interest in uplifting narratives suitable for all ages, particularly those with a comedic touch that appeals to both children and adults.\n\n- **Family-Oriented:** Prioritizes family-centric films that celebrate joy, humor, and music, reinforcing a commitment to titles that create emotional connections and collective enjoyment for families. Recent interactions further emphasize an appreciation for timeless classics that entertain viewers of all ages.",
  "metrics": {
    "rouge1_f": 0.049980476376415464,
    "rouge2_f": 0.00390625,
    "rougeL_f": 0.027723545490042953,
    "meteor": 0.013364526867822628,
    "bleu1": 2.8151431605596924e-11,
    "bleu2": 9.326762383940298e-12,
    "bleu3": 2.680903237526369e-12,
    "bleu4": 8.089928989373967e-13,
    "bertscore_precision": 0.35840141773223877,
    "bertscore_recall": 0.5317419171333313,
    "bertscore_f1": 0.4281941056251526
  }
}