{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/07/23\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard LaGravenese'], 'Producers': ['Erwin Stoff', 'Andrew A. Kosove', 'Broderick Johnson', 'Molly Mickler Smith', 'David Valdes'], 'Starring': ['Alden Ehrenreich', 'Alice Englert', 'Jeremy Irons']}\nReview Text: I admit that I am one of those people who reads a book then sees the movie and am disappointed.  This movie is no exception.  What could have been a series of very good movies was condensed into one movie that cannot possibly move forward into the sequels.  How can it when so much was changed in the first movie that there is no way to incorporate the other books?<br /><br />That being said, if you have not read the series you will probably enjoy this movie. On it's own, it really wasn't bad.  The acting was decent, although a bit cheesy in parts.  It moved along well and had a decent story line.  So, if you're just looking for a movie whose trailer looks interesting, I definitely wouldn't tell you to pass on this one.  If you're looking for a movie that reflects even 1/3 of the actual book series, choose another one.\nReview Title: Not like the book\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Kenneth Branagh'], 'Producers': ['Walt Disney Pictures'], 'Starring': ['Chris Hemsworth', 'Anthony Hopkins']}\nIf you just want a move that's fun to watch, Thor would fit the bill.  It's not going to be intellectually stimulating, but what super hero movie is?  Thor is eye candy, the fight scenes are fun, and the ending is sweet.  Overall an enjoyable way to spend an hour and a half.\nVery enjoyable movie!\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Ben Affleck'], 'Producers': ['Grant Heslov', 'Marion Kodama Yue', 'George Clooney'], 'Starring': ['Ben Affleck', 'Bryan Cranston', 'Alan Arkin'], 'Studio': ['WARNER BROS.']}\nI rented this movie after hearing all of the hype about it, not really knowing all that much about it.  Then I found out it was a true story from declassified files from the government and was stunned.  The news reels made you feel like they were happening right then, not a filmed version.  The movie dragged in spots, I think I expected a bit more action in some parts, but the ending more than made up for it.\nSurprising...\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Joss Whedon'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr. Chris Evans'], 'Studio': ['Hit Movies']}\nI have watched this movie over and over again and every time it makes me laugh.  Robert Downey, Jr. is outstanding at using his sarcastic whit.  The Hulk, though, is who really made this movie for me.  I laughed until I cried at the scene involving him and Loki.  Here's this big green beast of a guy and I found myself wanting to hug him and then hang out and have a laugh.  This one is a keeper.\nLOVE this movie!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Richard LaGravenese'], 'Producers': ['Erwin Stoff', 'Andrew A. Kosove', 'Broderick Johnson', 'Molly Mickler Smith', 'David Valdes'], 'Starring': ['Alden Ehrenreich', 'Alice Englert', 'Jeremy Irons']}\nI admit that I am one of those people who reads a book then sees the movie and am disappointed.  This movie is no exception.  What could have been a series of very good movies was condensed into one movie that cannot possibly move forward into the sequels.  How can it when so much was changed in the first movie that there is no way to incorporate the other books?<br /><br />That being said, if you have not read the series you will probably enjoy this movie. On it's own, it really wasn't bad.  The acting was decent, although a bit cheesy in parts.  It moved along well and had a decent story line.  So, if you're just looking for a movie whose trailer looks interesting, I definitely wouldn't tell you to pass on this one.  If you're looking for a movie that reflects even 1/3 of the actual book series, choose another one.\nNot like the book",
  "profile": "**User Profile Summary:**\n\n- **Genre Preference:** The user enjoys superhero and action-packed films, recently showing an openness to true-story films and adaptations that offer engaging experiences. They appreciate humor and levity, indicating a balanced taste that leans towards entertaining narratives.\n\n- **Rating Tendencies:** The user maintains a generally positive review habit with an average rating of 4.7, reflecting a strong appreciation for enjoyable content. They often celebrate lighthearted experiences, though they are occasionally critical when adaptations do not live up to their source material.\n\n- **Content Preferences:** Favors films featuring action, vibrant visuals, and engaging fight sequences. They particularly enjoy humor, memorable character interactions, and narratives that blend action with emotional appeal, though they may express disappointment when adaptations do not do justice to their original stories.\n\n- **Content Sensitivity:** Comfortable with elements of violence, adult themes, and strong language, the user seeks mature content that provides excitement alongside intelligent humor and engaging storytelling.\n\n- **Overall Attitude:** The user prioritizes enjoyment and escapism, favoring lighthearted films with emotional depth. They appreciate films that evoke strong emotional responses and feature witty dialogue, enhancing their viewing experience. Their recent review highlights a tendency to critique adaptations for not resonating with their source material while still being able to enjoy films on their own merit. ",
  "metrics": {
    "rouge1_f": 0.169811320754717,
    "rouge2_f": 0.0027027027027027024,
    "rougeL_f": 0.08355795148247978,
    "meteor": 0.0678345626975764,
    "bleu1": 0.03928441367170638,
    "bleu2": 0.007528212302691878,
    "bleu3": 0.0013985863428719715,
    "bleu4": 0.000603392683977764,
    "bertscore_precision": 0.35524144768714905,
    "bertscore_recall": 0.4369109272956848,
    "bertscore_f1": 0.39186617732048035
  }
}