{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Shakira Perfumes - Dance for Women - Long Lasting - Femenine, Charming and Modern Perfume - Fruity Floral Notes - Ideal for Day Wear - 1.7 Fl Oz\nReview Date: 2021/06/11\nStore: Shakira\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Shakira', 'Item Form': 'Liquid', 'Item Volume': '50 Milliliters', 'Scent': 'Dance', 'Special Feature': 'Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Product Dimensions': '2.64 x 2.05 x 5.63 inches; 1.76 Ounces', 'Item model number': '8411061823033'}\nReview Text: I really love the smell of this scent. It’s a nice warm seductive smell. It stays around for a long period of time and I’m always so excited to spritz it on. It has a fun bottle and makes for cute display.\nReview Title: Smells great!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stamped Glorious Short Hair Extensions Halo Wire Sercet Crown Synthetic Wavy Curly Brown Blonde Bayalage Hairpieces For Women Invisible (16 inch, 16H613)\nStamped Glorious\n{'Brand': 'Stamped Glorious', 'Material': 'Synthetic', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.76 x 7.05 x 1.69 inches; 6.74 Ounces'}\nThe quality of this hair is great! No one could even tell there was a hairpiece in. The hair is nice and thick. It does advertise that heat products can be used on it. When trying to curl for tighter curls, it didn’t really hold well, but none the less the curls it came with have held up well.\nWow! Can you even tell this is fake!!!\nScrunchie Holder Stands with 8 Pack Large Size Scrunchies - Acrylic Hair Ties Organizer for Teenage Girls and VSCO Girls Gift Stuff\nBeeager\n{'Color': 'Yellow,Gray,White', 'Material': 'Acrylic', 'Item Form': 'Scrunchie', 'Brand': 'Beeager', 'Hair Type': 'Straight', 'Package Dimensions': '10.55 x 3.98 x 3.7 inches; 10.86 Ounces'}\nThis is such a cute idea/ makes for a cute display in my vanity room. The scrunchies are great quality and several color options for any outfit. I would recommend this to any fellow scrunchie lover!\nJust as advertised!\nBold Men, Mens Hair Brush For Head and Beard, Thick and Thin Hair Types\nBOLD MEN\n{'Brand': 'BOLD MEN', 'Shape': 'Oblong', 'Handle Material': 'Wood', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Product Dimensions': '2.36 x 2.36 x 1.97 inches; 1.76 Ounces', 'UPC': '793611800557'}\nThis brush is a decent option for a beard brush, but it is pretty soft bristled. It’s not a very dense brush. The bristles are kinda cheap looking but it has held up.\nSoft bristles\nShakira Perfumes - Dance for Women - Long Lasting - Femenine, Charming and Modern Perfume - Fruity Floral Notes - Ideal for Day Wear - 1.7 Fl Oz\nShakira\n{'Brand': 'Shakira', 'Item Form': 'Liquid', 'Item Volume': '50 Milliliters', 'Scent': 'Dance', 'Special Feature': 'Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Product Dimensions': '2.64 x 2.05 x 5.63 inches; 1.76 Ounces', 'Item model number': '8411061823033'}\nI really love the smell of this scent. It’s a nice warm seductive smell. It stays around for a long period of time and I’m always so excited to spritz it on. It has a fun bottle and makes for cute display.\nSmells great!",
  "profile": "**User Summary:**\n\n- **Product Type Preference:** The user enjoys hair extensions, particularly curly styles that provide a natural look and texture. They have recently expanded their interests to include hair accessories like scrunchies for aesthetic display and grooming products for men's hair and beard care, indicating a broader exploration of beauty and grooming items. Their recent purchase of a fragrance suggests an appreciation for personal scent as an integral part of their grooming routine.\n\n- **Material Preference:** The user prefers synthetic materials for hair extensions, valuing their natural appearance and low maintenance. Their recent choices in durable grooming tools and now a fragrance confirm their preference for quality materials that enhance their overall grooming experience.\n\n- **Quality Sensitivity:** The user emphasizes high quality and durability across all products, as reflected in their focus on effective grooming accessories and the lasting nature of the fragrance. They have shown a discerning attitude toward product performance.\n\n- **Visual Appeal:** The user appreciates products that seamlessly integrate with their natural style. Their interest in coordinated aesthetics is evident in their choices for hair, accessories, and fragrance, indicating a desire for visually appealing products.\n\n- **Performance Expectations:** While the user values aesthetics, they also prioritize functionality and performance, as seen in their concern for effective styling and the lasting power of scents.\n\nOverall, the user combines a focus on natural appearance with a strong appreciation for quality, versatility, and aesthetic coherence in their beauty and grooming selections.",
  "metrics": {
    "rouge1_f": 0.2382445141065831,
    "rouge2_f": 0.009433962264150943,
    "rougeL_f": 0.10658307210031347,
    "meteor": 0.10767160161507404,
    "bleu1": 0.13256049601929185,
    "bleu2": 0.01391964860497832,
    "bleu3": 0.003051578531170512,
    "bleu4": 0.001430021667340233,
    "bertscore_precision": 0.37734144926071167,
    "bertscore_recall": 0.44827932119369507,
    "bertscore_f1": 0.4097628891468048
  }
}