{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Scrunchie Holder Stands with 8 Pack Large Size Scrunchies - Acrylic Hair Ties Organizer for Teenage Girls and VSCO Girls Gift Stuff\nReview Date: 2021/04/09\nStore: Beeager\nAverage Rating: 4.7\nProduct Details: {'Color': 'Yellow,Gray,White', 'Material': 'Acrylic', 'Item Form': 'Scrunchie', 'Brand': 'Beeager', 'Hair Type': 'Straight', 'Package Dimensions': '10.55 x 3.98 x 3.7 inches; 10.86 Ounces'}\nReview Text: This is such a cute idea/ makes for a cute display in my vanity room. The scrunchies are great quality and several color options for any outfit. I would recommend this to any fellow scrunchie lover!\nReview Title: Just as advertised!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stamped Glorious Short Hair Extensions Halo Wire Sercet Crown Synthetic Wavy Curly Brown Blonde Bayalage Hairpieces For Women Invisible (16 inch, 16H613)\nStamped Glorious\n{'Brand': 'Stamped Glorious', 'Material': 'Synthetic', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '9.76 x 7.05 x 1.69 inches; 6.74 Ounces'}\nThe quality of this hair is great! No one could even tell there was a hairpiece in. The hair is nice and thick. It does advertise that heat products can be used on it. When trying to curl for tighter curls, it didn’t really hold well, but none the less the curls it came with have held up well.\nWow! Can you even tell this is fake!!!\nScrunchie Holder Stands with 8 Pack Large Size Scrunchies - Acrylic Hair Ties Organizer for Teenage Girls and VSCO Girls Gift Stuff\nBeeager\n{'Color': 'Yellow,Gray,White', 'Material': 'Acrylic', 'Item Form': 'Scrunchie', 'Brand': 'Beeager', 'Hair Type': 'Straight', 'Package Dimensions': '10.55 x 3.98 x 3.7 inches; 10.86 Ounces'}\nThis is such a cute idea/ makes for a cute display in my vanity room. The scrunchies are great quality and several color options for any outfit. I would recommend this to any fellow scrunchie lover!\nJust as advertised!",
  "profile": "**User Summary:**\n\n- **Product Type Preference:** The user enjoys hair extensions, particularly those that provide a natural look and texture, such as curly styles. Recently, they have shown an interest in hair accessories like scrunchies, valuing aesthetic display as an extension of their beauty routine.\n- **Material Preference:** The user prefers synthetic materials due to their ability to mimic real hair while requiring less maintenance. Their recent purchase of acrylic accessories indicates an appreciation for durable yet stylish materials.\n- **Quality Sensitivity:** The user places a strong emphasis on quality and durability, evident in their positive remarks about products' thickness and natural appearance. They exhibit an awareness of the performance limitations of different materials, including heat resistance and varying styles.\n- **Visual Appeal:** The user appreciates products that seamlessly blend with their natural hair, highlighting a preference for items that are indistinguishable from real hair. Their interest in a diverse color palette for accessories suggests a focus on coordinated styles.\n- **Performance Expectations:** While generally satisfied with aesthetics, the user has a notable concern regarding products' ability to hold styling and a desire for versatility in styling options. This aligns with their overall approach to selecting beauty products that are both functional and visually appealing.\n\nOverall, the user values natural appearance, quality, product versatility, and aesthetic display in their beauty and hair accessory choices, indicating a comprehensive approach to beauty that combines function with style.",
  "metrics": {
    "rouge1_f": 0.25688073394495414,
    "rouge2_f": 0.013824884792626727,
    "rougeL_f": 0.11926605504587155,
    "meteor": 0.16033264645582912,
    "bleu1": 0.24054982817869416,
    "bleu2": 0.040730385859538046,
    "bleu3": 0.008310868334259713,
    "bleu4": 0.003757393498524858,
    "bertscore_precision": 0.4072411358356476,
    "bertscore_recall": 0.4451032876968384,
    "bertscore_f1": 0.4253312945365906
  }
}