{
  "interaction_number": 18,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Angels In The Outfield\nReview Date: 2022/02/26\nStore: Danny Glover  (Actor),     Joseph Gordon-Levitt  (Actor),     Matthew F. Leonetti  (Director),     William Dear  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: [\"Catch the movie that flew over the fence and into the hearts of millions of cheering fans! It's Disney's ANGELS IN THE OUTFIELD, the feel-good film about a young boy praying for a father -- and a struggling baseball team praying for a pennant. Danny Glover plays George Knox, the frustrated coach of the California Angels, a ragtag team of major-league misfits who are down on their luck. But things begin to look up when 11-year-old Roger, their biggest fan, starts giving Knox some winning tips from a real live angel named Al (Christopher Lloyd). The team miraculously climbs back into the pennant race ... all the while learning to believe in themselves. With its heavenly mix of outrageous comedy, dazzling special effects, and amazing baseball action, Disney's ANGELS IN THE OUTFIELD is an entertainment home run for the whole family!|The movie is a remake of a 1951 film starring Paul Douglas and Janet Leigh.|In Great Britain, the film is known simply as ANGELS.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family Entertainment, ACTION, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Christopher Lloyd, Tony Danza, Stoney Jackson, Albert Alexander Garcia, Tim Conlon, Richard Conlin, Joseph Gordon-Levitt, Taylor Negron, Danny Glover, Jay O. Sanders, Neal McDonough, Matthew F. Leonetti, William Dear, Tony Longo, Brenda Fricker, Matthew McConaughey, Ben Johnson, George Wells, Dorothy Kingsley, Adrien Brody, Milton Davis Jr., Dermot Mulroney, Holly Goldberg Sloan, Israel JuarbeChristopher Lloyd, Tony Danza, Stoney Jackson, Albert Alexander Garcia, Tim Conlon, Richard Conlin, Joseph Gordon-Levitt, Taylor Negron, Danny Glover, Jay O. Sanders, Neal McDonough, Matthew F. Leonetti, William Dear, Tony Longo, Brenda Fricker, Matthew McConaughey, Be…   See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': '786936169713', 'Director': 'Matthew F. Leonetti, William Dear', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 43 minutes', 'Release date': 'April 23, 2002', 'Actors': 'Danny Glover, Joseph Gordon-Levitt, Christopher Lloyd, Tony Danza, Brenda Fricker', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Dorothy Kingsley, George Wells, Richard Conlin, Holly Goldberg Sloan', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great family movie, great ending.\nReview Title: Great family movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Grace & Glorie\nGena Rowlands  (Actor),     Diane Lane  (Actor),     Arthur Allan Seidelman  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n[\"When a lonely ex-New Yorker moves into the home of a rural senior to act as a hospice worker, the two initially couldn't seem to be less alike. However, as time passes, the two find much kinship including a lost child. Slowly the two build a bond and learn about life.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.5 x 3.9 x 1.1 inches; 0.8 Ounces', 'Director': 'Arthur Allan Seidelman', 'Release date': 'January 12, 1999', 'Date First Available': 'February 9, 2007', 'Actors': 'Gena Rowlands, Diane Lane, Gordana Rashovich, William Severs, Jack Willis', 'Studio': 'Hallmark'}\nrecieved on time. I bought this item for a gift. It is such a great movie. It arrived new and I would recommend this to anyone.\nthe best\nLost in the Barrens\nNicholas Shields  (Actor),     Evan Adams  (Actor),     Michael J.F. Scott  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['\"Your strength and your courage will be shown in the good works that you do for others.\" When the trust fund keeping orphaned Jamie in his upper-class boarding school runs out, he must cross the continent to live with his Uncle Angus, a fur trapper, in the Canadian wilderness. Disobeying his father, Awasis, a native boy, and Jamie explore the breathtaking territory on their own. A careless accident makes the unlikely pair realize that their disobedience could cost them their lives. A loyal friendship is sparked as they begin to their vast cultural differences in a different light. But will that light burn brightly enough to lead them safely home?']\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Jeff Madden, Victor Cowie, Harry Nelken, Nicholas Shields, Lee J. Campbell, Graham Greene, Paul Grau, Michael J.F. Scott, Ken Babb, Fred Robinson, Farley Mowat, Keith Ross Leckie, Evan Adams, Brian Richardson, Marianne JonesJeff Madden, Victor Cowie, Harry Nelken, Nicholas Shields, Lee J. Campbell, Graham Greene, Paul Grau, Michael J.F. Scott, Ken Babb, Fred Robinson, Farley Mowat, Keith Ross Leckie, Evan Adams, Brian Richardson, Marianne Jones  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Director': 'Michael J.F. Scott', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 13, 2004', 'Actors': 'Nicholas Shields, Evan Adams, Lee J. Campbell, Graham Greene, Marianne Jones', 'Studio': 'Bonneville Ent.', 'Writers': 'Farley Mowat, Keith Ross Leckie', 'Number of discs': '1'}\nFeature films for families always has wonderful movies for families who like the clean educational and adventurous movies. One of our favorites.\nFantastic movie\nI Was a Rat\nNed Beatty  (Actor),     Tom Conti  (Actor),     Laurie Lynd  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Laurie Lynd', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 1, 2008', 'Actors': 'Ned Beatty, Tom Conti, Edward Fox, Brenda Fricker, Sheila McCarthy', 'Studio': 'Peace Arch Trinity'}\nThis is a nice movie for the family to enjoy. I gave this as a gift. They enjoyed it as well.\ngood movie\nSlow Moe, A Feature Films for Families DVD\nScotty Leavenworth  (Actor),     Amanda Michalka  (Actor),     Tim Nelson  (Director)    &                   0                  more   Rated:    G    Format: Unknown Binding\nMovies & TV, Movies\n['(2009) Marvin Mobley dreams of becoming a great baseball player but no matter how much he practices or how hard he tries, he doesn’t improve. His dream finally comes true when he finds a mysterious pair of glasses that turns him into the greatest baseball player his town has ever seen. After the glasses disappear, Marvin doesn’t believe he can play but with the support of his team he learns that winning doesn’t mean anything if you can’t be proud of how you play the game.']\n{'Theme': 'Movies', 'Item Package Quantity': '1', 'Item Weight': '0.2 Pounds', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 3.2 Ounces', 'Director': 'Tim Nelson', 'Media Format': 'Color', 'Run time': '90 minutes', 'Actors': 'Scotty Leavenworth, Amanda Michalka, Marc John Jeffries, Susan Walters, Laurence Lau', 'Producers': 'Jeff T. Miller'}\nthe movie arrived on time. It was a new item. I was not as pleased with the movie as I thought I would be. good one though.\nok movie\nLegend of the Viking Cross Dvd! Feature Film for Families\nFormat: Unknown Binding\nMovies & TV, Movies\n['\"If your brother needs you, you can\\'t refuse him,\" Angeline tells Awasis, urging him to help their friend, Jamie, who has embarked on a dangerous journey. However, Jamie is guiding a treasure hunter named Connolly to a place Awasis never wants to see again -- the Viking grave. Connolly is nothing but a grave robber as far as Awasis is concerned. That\\'s why he didn\\'t hire on as one of Connolly\\'s guides. Unfortunately, the lure of fame and fortune proves irresistible to Jamie. He is soon caught up in the hunt for a jewel-laden cross made of white gold, supposedly buried in the ancient Viking crypt. Jamie realizes too late that the cost of his perilous adventure may be far too high. If Jamie is to survive, Awasis must overcome his hurt feelings and team up with Angeline to rescue their \"brother.\"']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'DVD'}\nThis is a great movie if you like clean decent family entertainment for your self and family. I gave this as a gift as well.\ngood family movie\nStill Mine\nJames Cromwell  (Actor),     Genevieve Bujold  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['In his first lead role after decades of playing supporting characters, James Cromwell gives a tour de force performance in STILL MINE, an exquisitely crafted and deeply affecting love story about a couple in their twilight years. Based on true events and laced with wry humor, STILL MINE tells the heartfelt tale of Craig Morrison (Academy Award(R) nominee Cromwell), who comes up against the system when he sets out to build a more suitable house for his ailing wife Irene (Academy Award(R) nominee Genevieve Bujold). Although Morrison uses the same methods his father, an accomplished shipbuilder, taught him, times have changed. He quickly gets blindsided by local building codes and bureaucratic officials. As Irene becomes increasingly ill - and amidst a series of stop-work orders - Craig races to finish the house. Hauled into court and facing jail, Craig takes a final stance against all odds in a truly inspirational story.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOX2294981DVD', 'Media Format': 'AC-3, Multiple Formats, Dolby, NTSC, Color, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'May 6, 2014', 'Actors': 'James Cromwell, Genevieve Bujold, Campbell Scott, Still Mine', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Number of discs': '1'}\ngreat movie, recieved when expected\nFive Stars\nAdventures of Mickey Matson & Copperhead Treasure\nChristopher Lloyd  (Actor),     Derek Brandon  (Actor),     Harold Cronk  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Unraveling a series of clues left behind by his grandfather, Mickey Matson and his friends embark on a magical journey in search of a mythical ancient device. With the future of the country hanging in the balance, they will have to outsmart and outrun an evil conspiracy that dates back to the civil war. Chock full of exciting twists and turns, the Adventures of Mickey Matson and the Copperhead Treasure is a fun adventure for the whole family!']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.8 Ounces', 'Director': 'Harold Cronk', 'Media Format': 'Multiple Formats, Anamorphic, Color, NTSC, Widescreen, Surround Sound', 'Run time': '1 hour and 33 minutes', 'Release date': 'October 14, 2013', 'Actors': 'Christopher Lloyd, Derek Brandon, Ernie Hudson, Lee Arenberg, Francesca Derosa', 'Subtitles': 'English', 'Studio': 'Screen Media', 'Number of discs': '1'}\nGreat movie wanted to purchase it after seeing it. arrived on time, however movie was distorted.\nTwo Stars\nThe Cat's Meow Cat Sitter DVD (Animal Planet)\nFormat: DVD\nMovies & TV, Movies\n['Animal Planet has created the perfect cat sitting solution. Your cat will be captivated by the fish swimming in a larger than life aquarium, birds in motion, rabbits, squirrels and lizards scurrying across the screen...']\n{'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'DVD'}\nMy cat loves this dvd. She sits through almost all of it. It is nice to see the large birds and chickens and rabbits etc. great sounds as well. The only thing I did not like is the inappropriate people part. They did not have to add the people or long length of cats playing. Otherwise I would have rated it a 5 if they left out the people and put a short time of other cats playing.\nIt is nice to see the large birds and chickens and rabbits ...\nHoney, I Shrunk the Kids\nRick Moranis  (Actor),     Thomas Brown  (Actor),     Hiro Narita  (Director),     Joe Johnston  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Get set for the adventure of a lifetime in the No.1 comedy hit of the year, Honey, I shrunk the kids! Rick Moranis stars as a preoccupied inventor who just can\\'t seem to get his electro-magnetic shrinking machine to work. Then, when he accidentally shrinks his kids down to one-quarter-inch tall and tosses them out in the trash, the real adventure begins! Now the kids face incredible dangers as they try to make their way home through the jungle of their own backyard! Hurricane sprinklers! Dive-bombing bees! A runaway lawn mower and much, much more! Directed by Academy Award(R)-winner Joe Johnston (Visual Effects, Raiders of the lost ark, 1981), this record-breaking smash is full of amazing special effects, hilarious comedy, wild chases, and nonstop surprises! Early on one of the characters realizes, \"We\\'re now a quarter of an inch tall and 64 feet from the house. That\\'s an equivalent of 3.2 miles\". The movie was directed by Joe Johnston, who won a 1981 Academy Awards for Visual effects for raiders of the lost ark.']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': \"Hiro Narita, Brian Yuzna, Thomas Brown, Matt Frewer, Amy O'Neill, Marcia Strassman, Tom Schulman, Ed Naha, Jared Rushton, Joe Johnston, Kristine Sutherland, Stuart Gordon, Robert Oliveri, Rick MoranisHiro Narita, Brian Yuzna, Thomas Brown, Matt Frewer, Amy O'Neill, Marcia Strassman, Tom Schulman, Ed Naha, Jared Rushton, Joe Johnston, Kristine Sutherland, Stuart Gordon, Robert Oliveri, Rick Moranis  See more\", 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': '786936190991', 'Director': 'Hiro Narita, Joe Johnston', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'October 8, 2002', 'Actors': \"Rick Moranis, Thomas Brown, Matt Frewer, Amy O'Neill, Marcia Strassman\", 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Stuart Gordon, Brian Yuzna, Ed Naha, Tom Schulman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nkind of scary as well for children especially but a good movie.\nGreat family movie\nA Goofy Movie (Walt Disney Gold Classic Collection)\nBill Farmer  (Actor),     Jim Cummings  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Now you can enjoy all the outrageous fun and laughter of Disney\\'s most legendary comedian as he stars in his very own full-length motion picture! In the great tradition of quality Disney animation, A GOOFY MOVIE is a classic blend of irresistible characters, unforgettable music, and an endearing modern-day story about how the lovable Goof bonds with his teenage son Max on a hilarious cross-country road trip. En route to the ol\\' fishing hole, they find themselves up to their floppy ears in misadventure! Will Max learn there\\'s nothing wrong with taking after dear old dad ... if he is a little goofy? The question is answered in the showstopping finale when Max and Goofy \"crash the stage\" at the most spectacular rock concert ever performed! Filled with action-packed scenes, narrow escapes -- even a comic close encounter with Bigfoot -- Disney\\'s critically acclaimed hit comedy is a delightfully memorable adventure your family will love taking again and again!|The film was animated primarily at a new Disney studio in France after character design, art direction, and storyboarding had been completed in Burbank, California.|The nuns who help Goofy sing \"Out On The Open Road\" appear three other times in the movie: at the diner one of them sticks her head in the picture, at a monster truck show, sitting right behind Goofy and Max, and at the gates of the Powerline Concert.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled, Closed-captioned', 'Contributor': 'Jason Marsden, Joey Lawrence, Brain Pimental, Jymn Magon, Bill Farmer, Jim Cummings, Kevin Lima, Jo Anne Worley, Frank Welker, Dan Rounds, Chris Matheson, Kellie Martin, Rob Paulsen, Florence Stanley, Jenna Von Oy, Wayne Allwine, Julie Brown, Wallace Shawn, Pauly ShoreJason Marsden, Joey Lawrence, Brain Pimental, Jymn Magon, Bill Farmer, Jim Cummings, Kevin Lima, Jo Anne Worley, Frank Welker, Dan Rounds, Chris Matheson, Kellie Martin, Rob Paulsen, Florence Stanley, Jenna Von Oy, Wayne Allwine, Julie Brown, Wallace Shawn, Paul…  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 18 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Audio Description': 'Spanish, English, French', 'Item model number': '1957800', 'Director': 'Kevin Lima', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Subtitled, Closed-captioned', 'Run time': '1 hour and 18 minutes', 'Release date': 'June 20, 2000', 'Actors': 'Bill Farmer, Jim Cummings, Jason Marsden, Kevin Lima, Jo Anne Worley', 'Subtitles': 'Spanish', 'Producers': 'Dan Rounds', 'Studio': 'WALT DISNEY ANIMATION', 'Writers': 'Brain Pimental, Chris Matheson, Jymn Magon', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is not fit for a good Christian home. This has very poor inappropriate content.\ninappropriate content at the very beginning.\nThe BFG\nMark Rylance  (Actor),     Ruby Barnhill  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney presents a Roald Dahl classic directed by Steven Spielberg. In an imaginative tale filled with magic, wonder and unexpected friendship, a young girl is launched on an enormous adventure when she crosses paths with a mysterious being called the Big Friendly Giant.']\n{'Genre': 'Family Entertainment', 'Format': 'NTSC, Subtitled', 'Contributor': 'Bill Hader, Penelope Wilton, Mark Rylance, Screenplay By Melissa Mathison, Steven Spielberg, Ruby Barnhill, Rebecca Hall, Jemaine Clement, Based On The Book By Roald DahlBill Hader, Penelope Wilton, Mark Rylance, Screenplay By Melissa Mathison, Steven Spielberg, Ruby Barnhill, Rebecca Hall, Jemaine Clement, Based On The Book By Roald Dahl  See more', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936849059', 'Director': 'Steven Spielberg', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 58 minutes', 'Release date': 'November 29, 2016', 'Actors': 'Mark Rylance, Ruby Barnhill, Penelope Wilton, Jemaine Clement, Rebecca Hall', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Screenplay By Melissa Mathison, Based On The Book By Roald Dahl', 'Country of Origin': 'USA', 'Number of discs': '1'}\nwonderful movie for adults as well. Really like BFG himself. Such a kind hearted giant.\nfantastic movie, great laugh at the end.\nBear with Me\nMichael Ontkean  (Actor),     Helen Shaver  (Actor),     Paul Ziller  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n{}\nGreat clean family movie\nAwesome DVD\nWallace and Gromit: A Grand Day Out\nPeter Sallis  (Actor),     Nick Park  (Director, Writer)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['WALLACE AND GROMIT A GRAND DAY OUT']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '8.84487E+11', 'Director': 'Nick Park', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '23 minutes', 'Release date': 'February 10, 2009', 'Actors': 'Peter Sallis', 'Language': 'Unqualified', 'Studio': 'Lyons / Hit Ent.', 'Writers': 'Nick Park', 'Number of discs': '1'}\nFun to watch, great extras they added to the dvd as well.\nGreat movie\nOwd Bob\nJames Cromwell  (Actor),     Colm Meaney  (Actor),     Rodney Gibbons  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Widower Adam MacAdam (', 'James Cromwell', ',', 'Secretariat', \") passes his lonely days with his prized sheepdog, Zac, by his side. When his orphaned grandson, David, visits for the summer, he's pulled into the decades-old feud between Adam and his neighbor, Keith Moore (\", 'Colm Meaney', ',', 'Law Abiding Citizen', ')--years of fierce sheepherding competition have driven the men apart. But with help from David and Zac, Adam slowly learns to accept his tragic past, to love again, and to make amends with a friend lost.']\n{'Format': 'Color, Multiple Formats, NTSC', 'Contributor': 'Jemima Rooper, James Cromwell, Colm Meaney, Rodney Gibbons', 'Runtime': '1 hour and 32 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': '096009944698', 'Director': 'Rodney Gibbons', 'Media Format': 'Color, Multiple Formats, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'September 7, 2010', 'Actors': 'James Cromwell, Colm Meaney, Jemima Rooper', 'Language': 'Unqualified', 'Studio': 'Echo Bridge Home Entertainment', 'Number of discs': '1'}\nGreat story, loved it.\nAwesome movie\nSarah, Plain & Tall Collection\nGlenn Close  (Actor),     Christopher Walken  (Actor),     Glenn Jordan  (Director),     Joseph Sargent  (Director)    &                   1                  more   Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{'Format': 'Box set, Closed-captioned, Color, NTSC', 'Contributor': 'Christopher Walken, Kara Beth Taylor, Glenn Jordan, Woody Watson, Glenn Close, James Rebhorn, Malgorzata Zajaczkowska, Christopher Bell, Jon DeVries, Larry Moran, Betty Laird, Carol Sobieski, Patricia MacLachlan, Lexi Randall, Marc Penney, Joseph SargentChristopher Walken, Kara Beth Taylor, Glenn Jordan, Woody Watson, Glenn Close, James Rebhorn, Malgorzata Zajaczkowska, Christopher Bell, Jon DeVries, Larry Moran, Betty Laird, Carol Sobieski, Patricia MacLachlan, Lexi Randall, Marc Penney, Joseph Sargent   See more', 'Number Of Discs': '3', 'Runtime': '4 hours and 55 minutes', 'Publication Date': 'November 30, 1999', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 4.96 Ounces', 'Item model number': 'DVD1199', 'Director': 'Glenn Jordan, Joseph Sargent', 'Media Format': 'Box set, Closed-captioned, Color, NTSC', 'Run time': '4 hours and 55 minutes', 'Release date': 'November 30, 1999', 'Actors': 'Glenn Close, Christopher Walken, Lexi Randall, Malgorzata Zajaczkowska, Jon DeVries', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Hallmark', 'Writers': 'Carol Sobieski, Patricia MacLachlan', 'Number of discs': '3'}\nLove this dvd series. One of my favorites. The dvd's are new, fast shipping.\ngreat collection\nDisney Game Changers 4-Movie Collection (Angels in the Outfield / Angels in the Infield / Angels in the Endzone / Perfect Game)\nDanny Glover  (Actor),     Paul Dooley  (Actor)    Format: DVD\nMovies & TV, Boxed Sets, Drama\n[\"Get ready for a grand slam of fun with four classic Disney sports films in one incredible collection. Huddle up with these inspirational favorites that are sure to be a hit with the whole family! Catch the movies that flew over the fence and into the hearts of millions of cheering fans. ANGELS IN THE OUTFIELD and its hilarious sequel ANGELS IN THE INFIELD are full of outrageous comedy, thrills and amazing baseball action. Tackle even more fun as Al the Angel lends a hand to two brothers and a ragtag football team without a prayer in ANGELS IN THE ENDZONE. Then step to the plate with PERFECT GAME, a touching story about the true meaning of sportsmanship and teamwork, starring Edward Asner and Patrick Duffy. It's an entertainment home run for everyone!\"]\n{'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 5.44 Ounces', 'Item model number': '42927210', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Release date': 'September 2, 2012', 'Actors': 'Danny Glover, Paul Dooley, Patrick Warburton, Edward Asner', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '4'}\nreturned\nNot what I expected\nHoney, We Shrunk Ourselves\nRick Moranis  (Actor),     Eve Gordon  (Actor),     Dean Cundey  (Director),     Raymond N. Stella  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Get ready for king-sized laughs with Disney\\'s brand-new sequel to the colossal movie hit, HONEY, I SHRUNK THE KIDS. Rick Moranis returns as wacky, absent-minded inventor Wayne Szalinski, a scientific giant who gets into huge trouble when he decides to use his infamous shrink machine just one more time. A tiny glitch causes Wayne, his brother, and their wives to shrink big time! Soon, they must brave household insects the size of dinosaurs, a treacherous loop-the-loop track in a toy race car, dizzying \"balloon\" rides inside soap bubbles, and more! Meanwhile, thinking they have the house all to themselves, the kids get into mega-mischief -- never guessing their pint-sized parents are watching their every move! With amazing special effects and nonstop excitement, HONEY, WE SHRUNK OURSELVES is a hilarious, heartwarming, hugely entertaining adventure for the entire family!|Wayne Szalinksi is back, and this time when his notorious shrink machine misfires, it\\'s the adults who are shrunk. Believing their parents have left them home alone for the weekend, the kids take advantage of their newfound unsupervised freedom by filling up on junk food, Rollerblading in the house, playing loud music, and throwing a party for their friends. While desperately trying to get the kids to notice them, since they are only three quarters of an inch tall, the adults are able to learn a few things about their offspring. The film was extremely complicated to produce, with almost 400 composite shots totaling approximately 40 minutes of screen time. Dream Quest Images, which produced the visual effects, had the advantage of new technologies that were not available when the first film in the series was made.']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Dean Cundey, Nell Scovell, Allison Mack, Raymond N. Stella, Joel Hodgson, Eve Gordon, Karey Kirkpatrick, Jake Richardson, Robin Bartlett, Rick MoranisDean Cundey, Nell Scovell, Allison Mack, Raymond N. Stella, Joel Hodgson, Eve Gordon, Karey Kirkpatrick, Jake Richardson, Robin Bartlett, Rick Moranis   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 15 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WD02718900DVD', 'Director': 'Dean Cundey, Raymond N. Stella', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 15 minutes', 'Release date': 'October 8, 2002', 'Actors': 'Rick Moranis, Eve Gordon, Robin Bartlett, Allison Mack, Jake Richardson', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Karey Kirkpatrick, Nell Scovell, Joel Hodgson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI gave this one away. Not for me.\nI think the Honey, I shrunk the kids is best.\nAngels In The Outfield\nDanny Glover  (Actor),     Joseph Gordon-Levitt  (Actor),     Matthew F. Leonetti  (Director),     William Dear  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"Catch the movie that flew over the fence and into the hearts of millions of cheering fans! It's Disney's ANGELS IN THE OUTFIELD, the feel-good film about a young boy praying for a father -- and a struggling baseball team praying for a pennant. Danny Glover plays George Knox, the frustrated coach of the California Angels, a ragtag team of major-league misfits who are down on their luck. But things begin to look up when 11-year-old Roger, their biggest fan, starts giving Knox some winning tips from a real live angel named Al (Christopher Lloyd). The team miraculously climbs back into the pennant race ... all the while learning to believe in themselves. With its heavenly mix of outrageous comedy, dazzling special effects, and amazing baseball action, Disney's ANGELS IN THE OUTFIELD is an entertainment home run for the whole family!|The movie is a remake of a 1951 film starring Paul Douglas and Janet Leigh.|In Great Britain, the film is known simply as ANGELS.\"]\n{'Genre': 'Family Entertainment, ACTION, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Christopher Lloyd, Tony Danza, Stoney Jackson, Albert Alexander Garcia, Tim Conlon, Richard Conlin, Joseph Gordon-Levitt, Taylor Negron, Danny Glover, Jay O. Sanders, Neal McDonough, Matthew F. Leonetti, William Dear, Tony Longo, Brenda Fricker, Matthew McConaughey, Ben Johnson, George Wells, Dorothy Kingsley, Adrien Brody, Milton Davis Jr., Dermot Mulroney, Holly Goldberg Sloan, Israel JuarbeChristopher Lloyd, Tony Danza, Stoney Jackson, Albert Alexander Garcia, Tim Conlon, Richard Conlin, Joseph Gordon-Levitt, Taylor Negron, Danny Glover, Jay O. Sanders, Neal McDonough, Matthew F. Leonetti, William Dear, Tony Longo, Brenda Fricker, Matthew McConaughey, Be…   See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': '786936169713', 'Director': 'Matthew F. Leonetti, William Dear', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 43 minutes', 'Release date': 'April 23, 2002', 'Actors': 'Danny Glover, Joseph Gordon-Levitt, Christopher Lloyd, Tony Danza, Brenda Fricker', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Dorothy Kingsley, George Wells, Richard Conlin, Holly Goldberg Sloan', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat family movie, great ending.\nGreat family movie",
  "profile": "**Updated User Profile Summary:**\n\n- **Genres of Interest:** The user continues to prioritize drama and family narratives that emphasize emotional connections and personal growth, along with action-adventure stories that spark curiosity and exploration.\n\n- **Content Format:** They prefer classic and modern cinema, especially in VHS and DVD formats, relishing a mix of nostalgic favorites and contemporary films.\n\n- **Gift-Giving:** The user remains committed to selecting family-friendly films suitable for all ages, emphasizing shared experiences and quality time with loved ones.\n\n- **Review Behavior:** Their reviews reflect a discerning taste for captivating narratives and appropriateness. Recent experiences have highlighted a more critical stance towards films, especially when expectations are not met, reinforcing a strong commitment to quality family entertainment.\n\n- **Personal Values:** They value connection, compassion, and meaningful storytelling, seeking material aligning with their moral beliefs. Their latest interaction indicates an appreciation for engaging films that foster shared enjoyment and emotional connections.\n\n- **Latest Interaction:** A recent purchase of a family-friendly movie received high praise, reinforcing their expectation for quality content. This experience contrasts with a previous disappointment, illustrating their dedication to selecting films that resonate positively with family audiences.\n\nOverall, the user seeks high-quality films for themselves and their family, with a significant focus on suitability, moral alignment, and impactful storytelling.",
  "metrics": {
    "rouge1_f": 0.048003398470688186,
    "rouge2_f": 0.00509987250318742,
    "rougeL_f": 0.02888700084961767,
    "meteor": 0.013330332565829337,
    "bleu1": 6.913561902114865e-11,
    "bleu2": 2.5397509400236387e-11,
    "bleu3": 3.3546822302555062e-12,
    "bleu4": 1.220354168560537e-12,
    "bertscore_precision": 0.33643847703933716,
    "bertscore_recall": 0.5018028616905212,
    "bertscore_f1": 0.4028095006942749
  }
}