{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: I Was a Rat\nReview Date: 2014/02/10\nStore: Ned Beatty  (Actor),     Tom Conti  (Actor),     Laurie Lynd  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Laurie Lynd', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 1, 2008', 'Actors': 'Ned Beatty, Tom Conti, Edward Fox, Brenda Fricker, Sheila McCarthy', 'Studio': 'Peace Arch Trinity'}\nReview Text: This is a nice movie for the family to enjoy. I gave this as a gift. They enjoyed it as well.\nReview Title: good movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Grace & Glorie\nGena Rowlands  (Actor),     Diane Lane  (Actor),     Arthur Allan Seidelman  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n[\"When a lonely ex-New Yorker moves into the home of a rural senior to act as a hospice worker, the two initially couldn't seem to be less alike. However, as time passes, the two find much kinship including a lost child. Slowly the two build a bond and learn about life.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.5 x 3.9 x 1.1 inches; 0.8 Ounces', 'Director': 'Arthur Allan Seidelman', 'Release date': 'January 12, 1999', 'Date First Available': 'February 9, 2007', 'Actors': 'Gena Rowlands, Diane Lane, Gordana Rashovich, William Severs, Jack Willis', 'Studio': 'Hallmark'}\nrecieved on time. I bought this item for a gift. It is such a great movie. It arrived new and I would recommend this to anyone.\nthe best\nLost in the Barrens\nNicholas Shields  (Actor),     Evan Adams  (Actor),     Michael J.F. Scott  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['\"Your strength and your courage will be shown in the good works that you do for others.\" When the trust fund keeping orphaned Jamie in his upper-class boarding school runs out, he must cross the continent to live with his Uncle Angus, a fur trapper, in the Canadian wilderness. Disobeying his father, Awasis, a native boy, and Jamie explore the breathtaking territory on their own. A careless accident makes the unlikely pair realize that their disobedience could cost them their lives. A loyal friendship is sparked as they begin to their vast cultural differences in a different light. But will that light burn brightly enough to lead them safely home?']\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Jeff Madden, Victor Cowie, Harry Nelken, Nicholas Shields, Lee J. Campbell, Graham Greene, Paul Grau, Michael J.F. Scott, Ken Babb, Fred Robinson, Farley Mowat, Keith Ross Leckie, Evan Adams, Brian Richardson, Marianne JonesJeff Madden, Victor Cowie, Harry Nelken, Nicholas Shields, Lee J. Campbell, Graham Greene, Paul Grau, Michael J.F. Scott, Ken Babb, Fred Robinson, Farley Mowat, Keith Ross Leckie, Evan Adams, Brian Richardson, Marianne Jones  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Director': 'Michael J.F. Scott', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 13, 2004', 'Actors': 'Nicholas Shields, Evan Adams, Lee J. Campbell, Graham Greene, Marianne Jones', 'Studio': 'Bonneville Ent.', 'Writers': 'Farley Mowat, Keith Ross Leckie', 'Number of discs': '1'}\nFeature films for families always has wonderful movies for families who like the clean educational and adventurous movies. One of our favorites.\nFantastic movie\nI Was a Rat\nNed Beatty  (Actor),     Tom Conti  (Actor),     Laurie Lynd  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Laurie Lynd', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 1, 2008', 'Actors': 'Ned Beatty, Tom Conti, Edward Fox, Brenda Fricker, Sheila McCarthy', 'Studio': 'Peace Arch Trinity'}\nThis is a nice movie for the family to enjoy. I gave this as a gift. They enjoyed it as well.\ngood movie",
  "profile": "**User Profile Summary:**\n\n- **Genres of Interest:** The user maintains a strong preference for drama, particularly stories that delve into deep emotional connections and personal growth. Their interest now increasingly includes family-oriented narratives that promote adventure, education, and insight into different perspectives.\n  \n- **Content Format:** They continue to enjoy classic cinema, favoring VHS purchases, while also exploring modern formats like DVD, illustrating an appreciation for both nostalgia and contemporary storytelling.\n\n- **Gift-Giving:** The user is thoughtful in their gifting, often selecting family-friendly films that cater to a wide age range, enhancing shared enjoyment and family bonding experiences.\n\n- **Review Behavior:** Typically, they provide positive feedback, with particular emphasis on family-friendly content they find heartwarming. Their reviews reflect an appreciation for quality filmmaking and inclusive storytelling.\n\n- **Personal Values:** The user values narratives showcasing connection, compassion, and the journey of life, resonating particularly with themes centered on relationships, personal struggles, friendship, and cultural understanding.\n\nThe recent review reiterates their enjoyment of family-centric films that foster togetherness, highlighting their ongoing commitment to sharing meaningful cinematic experiences that combine entertainment with educational value. Overall, this user exhibits an inclination toward heartfelt storytelling that promotes positivity and connection.",
  "metrics": {
    "rouge1_f": 0.17098445595854925,
    "rouge2_f": 0.005194805194805194,
    "rougeL_f": 0.07253886010362694,
    "meteor": 0.06480174515590914,
    "bleu1": 0.03112794834355786,
    "bleu2": 0.006002545647477944,
    "bleu3": 0.0011175584975666847,
    "bleu4": 0.0004826969765713505,
    "bertscore_precision": 0.35820651054382324,
    "bertscore_recall": 0.44596418738365173,
    "bertscore_f1": 0.3972969055175781
  }
}