{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Legend of the Viking Cross Dvd! Feature Film for Families\nReview Date: 2014/02/10\nStore: Format: Unknown Binding\nCategories: Movies & TV, Movies\nProduct Description: ['\"If your brother needs you, you can\\'t refuse him,\" Angeline tells Awasis, urging him to help their friend, Jamie, who has embarked on a dangerous journey. However, Jamie is guiding a treasure hunter named Connolly to a place Awasis never wants to see again -- the Viking grave. Connolly is nothing but a grave robber as far as Awasis is concerned. That\\'s why he didn\\'t hire on as one of Connolly\\'s guides. Unfortunately, the lure of fame and fortune proves irresistible to Jamie. He is soon caught up in the hunt for a jewel-laden cross made of white gold, supposedly buried in the ancient Viking crypt. Jamie realizes too late that the cost of his perilous adventure may be far too high. If Jamie is to survive, Awasis must overcome his hurt feelings and team up with Angeline to rescue their \"brother.\"']\nAverage Rating: 4.9\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'DVD'}\nReview Text: This is a great movie if you like clean decent family entertainment for your self and family. I gave this as a gift as well.\nReview Title: good family movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Grace & Glorie\nGena Rowlands  (Actor),     Diane Lane  (Actor),     Arthur Allan Seidelman  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n[\"When a lonely ex-New Yorker moves into the home of a rural senior to act as a hospice worker, the two initially couldn't seem to be less alike. However, as time passes, the two find much kinship including a lost child. Slowly the two build a bond and learn about life.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.5 x 3.9 x 1.1 inches; 0.8 Ounces', 'Director': 'Arthur Allan Seidelman', 'Release date': 'January 12, 1999', 'Date First Available': 'February 9, 2007', 'Actors': 'Gena Rowlands, Diane Lane, Gordana Rashovich, William Severs, Jack Willis', 'Studio': 'Hallmark'}\nrecieved on time. I bought this item for a gift. It is such a great movie. It arrived new and I would recommend this to anyone.\nthe best\nLost in the Barrens\nNicholas Shields  (Actor),     Evan Adams  (Actor),     Michael J.F. Scott  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['\"Your strength and your courage will be shown in the good works that you do for others.\" When the trust fund keeping orphaned Jamie in his upper-class boarding school runs out, he must cross the continent to live with his Uncle Angus, a fur trapper, in the Canadian wilderness. Disobeying his father, Awasis, a native boy, and Jamie explore the breathtaking territory on their own. A careless accident makes the unlikely pair realize that their disobedience could cost them their lives. A loyal friendship is sparked as they begin to their vast cultural differences in a different light. But will that light burn brightly enough to lead them safely home?']\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Jeff Madden, Victor Cowie, Harry Nelken, Nicholas Shields, Lee J. Campbell, Graham Greene, Paul Grau, Michael J.F. Scott, Ken Babb, Fred Robinson, Farley Mowat, Keith Ross Leckie, Evan Adams, Brian Richardson, Marianne JonesJeff Madden, Victor Cowie, Harry Nelken, Nicholas Shields, Lee J. Campbell, Graham Greene, Paul Grau, Michael J.F. Scott, Ken Babb, Fred Robinson, Farley Mowat, Keith Ross Leckie, Evan Adams, Brian Richardson, Marianne Jones  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.2 Ounces', 'Director': 'Michael J.F. Scott', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 13, 2004', 'Actors': 'Nicholas Shields, Evan Adams, Lee J. Campbell, Graham Greene, Marianne Jones', 'Studio': 'Bonneville Ent.', 'Writers': 'Farley Mowat, Keith Ross Leckie', 'Number of discs': '1'}\nFeature films for families always has wonderful movies for families who like the clean educational and adventurous movies. One of our favorites.\nFantastic movie\nI Was a Rat\nNed Beatty  (Actor),     Tom Conti  (Actor),     Laurie Lynd  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Laurie Lynd', 'Media Format': 'NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'April 1, 2008', 'Actors': 'Ned Beatty, Tom Conti, Edward Fox, Brenda Fricker, Sheila McCarthy', 'Studio': 'Peace Arch Trinity'}\nThis is a nice movie for the family to enjoy. I gave this as a gift. They enjoyed it as well.\ngood movie\nSlow Moe, A Feature Films for Families DVD\nScotty Leavenworth  (Actor),     Amanda Michalka  (Actor),     Tim Nelson  (Director)    &                   0                  more   Rated:    G    Format: Unknown Binding\nMovies & TV, Movies\n['(2009) Marvin Mobley dreams of becoming a great baseball player but no matter how much he practices or how hard he tries, he doesn’t improve. His dream finally comes true when he finds a mysterious pair of glasses that turns him into the greatest baseball player his town has ever seen. After the glasses disappear, Marvin doesn’t believe he can play but with the support of his team he learns that winning doesn’t mean anything if you can’t be proud of how you play the game.']\n{'Theme': 'Movies', 'Item Package Quantity': '1', 'Item Weight': '0.2 Pounds', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 3.2 Ounces', 'Director': 'Tim Nelson', 'Media Format': 'Color', 'Run time': '90 minutes', 'Actors': 'Scotty Leavenworth, Amanda Michalka, Marc John Jeffries, Susan Walters, Laurence Lau', 'Producers': 'Jeff T. Miller'}\nthe movie arrived on time. It was a new item. I was not as pleased with the movie as I thought I would be. good one though.\nok movie\nLegend of the Viking Cross Dvd! Feature Film for Families\nFormat: Unknown Binding\nMovies & TV, Movies\n['\"If your brother needs you, you can\\'t refuse him,\" Angeline tells Awasis, urging him to help their friend, Jamie, who has embarked on a dangerous journey. However, Jamie is guiding a treasure hunter named Connolly to a place Awasis never wants to see again -- the Viking grave. Connolly is nothing but a grave robber as far as Awasis is concerned. That\\'s why he didn\\'t hire on as one of Connolly\\'s guides. Unfortunately, the lure of fame and fortune proves irresistible to Jamie. He is soon caught up in the hunt for a jewel-laden cross made of white gold, supposedly buried in the ancient Viking crypt. Jamie realizes too late that the cost of his perilous adventure may be far too high. If Jamie is to survive, Awasis must overcome his hurt feelings and team up with Angeline to rescue their \"brother.\"']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'DVD'}\nThis is a great movie if you like clean decent family entertainment for your self and family. I gave this as a gift as well.\ngood family movie",
  "profile": "**Updated User Profile Summary:**\n\n- **Genres of Interest:** The user has a strong preference for drama, especially stories that explore deep emotional connections and personal growth. Their interests continue to embrace family-oriented narratives that promote adventure, education, and a wider understanding of different perspectives.\n\n- **Content Format:** They enjoy classic cinema, particularly VHS purchases, while also exploring modern formats like DVD. This reflects their appreciation for both nostalgic and contemporary storytelling.\n\n- **Gift-Giving:** The user carefully selects family-friendly films that cater to a wide age range, enhancing shared enjoyment and fostering family bonding experiences.\n\n- **Review Behavior:** Their reviews are generally positive, with a recent focus on family-centric films. They maintain a discerning approach to filmmaking quality, evidenced by their enthusiastic endorsement of films that deliver clean, decent entertainment suitable for families.\n\n- **Personal Values:** The user values narratives that emphasize connection, compassion, and the journey of life, resonating with themes centered on relationships, personal struggles, friendship, and cultural understanding. \n\nThe recent interaction highlights their continued commitment to family-friendly content, particularly films that are engaging yet appropriate for all ages. Overall, they exhibit a strong inclination toward heartfelt storytelling that promotes positivity, connection, and valuable life lessons, reinforcing their role as a thoughtful curator of family entertainment.",
  "metrics": {
    "rouge1_f": 0.14900662251655628,
    "rouge2_f": 0.013266998341625208,
    "rougeL_f": 0.07450331125827814,
    "meteor": 0.05087266181419739,
    "bleu1": 0.0056944210051375664,
    "bleu2": 0.0014945598775286705,
    "bleu3": 0.0002324772584968795,
    "bleu4": 9.177503113259369e-05,
    "bertscore_precision": 0.34218689799308777,
    "bertscore_recall": 0.4498929977416992,
    "bertscore_f1": 0.38871705532073975
  }
}