{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Detangling Brush Pink Hair Brush For Women Best Detangler for Adults and Kids - HAIR GLIDER\nReview Date: 2015/07/01\nStore: Hair Glider\nProduct Description: ['The HAIR GLIDER is the ultimate detangler brush. This specially designed hairbrush glides through the toughest snarls. This features 2 levels of bristles designed to tease out knots with each stroke. Whether detangling adult hair or kids rushing to school this is sure to cut down on time and snags. When this arrives on your doorstep, simply tear open the Amazon box and see for yourself what all the rave reviews are about. With our 100% no hassle return policy consider ordering extra for family members, travel or as a gift.']\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Hair Glider', 'Hair Type': 'Oily, Dry, Normal', 'Color': 'Peach', 'Model Name': 'Part.no', 'Item Weight': '0.2 Pounds', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '8 x 2 x 1 inches; 3.2 Ounces', 'Item model number': 'SPX8FL009-AF11', 'UPC': '755464306846', 'Manufacturer': 'Saprex'}\nReview Text: I have very thick hair, for a long time I had a mat of tangles at the base of my skull that used to take me up to an hour to detangle. My hair was getting unmanageable so I cut it off. After donating 4 pony tails to locks of love, as my hair reached all the way down to my knees when I was standing up, I thought my hair would be easy to care for. But if I'm not careful, I still get very bad tangles in my short hair. Now that I am starting to grow it out again, I thought my troubles would be back, but I received an opportunity to try this brush at a discounted rate in exchange for my honest, unbiased, review. (all opinions are my own) I took my hair down from it's ponytail and ran the brush through, figuring it would get caught fairly quickly. To my surprise, it didn't really snag at all. It actually did as it claimed. My hair was smooth and the spot at the base of my skull that always gets missed no matter how hard I try, was also smooth and untangled. I am really shocked. I have tried so many brushes for myself and had sort of given up on finding something just for me. I will be keeping my brush in a safe place so my kids don't lose it and recommending to all of my friends. I am very happy with this purchase and would buy it again. It is worth the money.\nReview Title: It actually detangled my extremely thick hair\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Detangling Brush Pink Hair Brush For Women Best Detangler for Adults and Kids - HAIR GLIDER\nHair Glider\n['The HAIR GLIDER is the ultimate detangler brush. This specially designed hairbrush glides through the toughest snarls. This features 2 levels of bristles designed to tease out knots with each stroke. Whether detangling adult hair or kids rushing to school this is sure to cut down on time and snags. When this arrives on your doorstep, simply tear open the Amazon box and see for yourself what all the rave reviews are about. With our 100% no hassle return policy consider ordering extra for family members, travel or as a gift.']\n{'Brand': 'Hair Glider', 'Hair Type': 'Oily, Dry, Normal', 'Color': 'Peach', 'Model Name': 'Part.no', 'Item Weight': '0.2 Pounds', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '8 x 2 x 1 inches; 3.2 Ounces', 'Item model number': 'SPX8FL009-AF11', 'UPC': '755464306846', 'Manufacturer': 'Saprex'}\nI have very thick hair, for a long time I had a mat of tangles at the base of my skull that used to take me up to an hour to detangle. My hair was getting unmanageable so I cut it off. After donating 4 pony tails to locks of love, as my hair reached all the way down to my knees when I was standing up, I thought my hair would be easy to care for. But if I'm not careful, I still get very bad tangles in my short hair. Now that I am starting to grow it out again, I thought my troubles would be back, but I received an opportunity to try this brush at a discounted rate in exchange for my honest, unbiased, review. (all opinions are my own) I took my hair down from it's ponytail and ran the brush through, figuring it would get caught fairly quickly. To my surprise, it didn't really snag at all. It actually did as it claimed. My hair was smooth and the spot at the base of my skull that always gets missed no matter how hard I try, was also smooth and untangled. I am really shocked. I have tried so many brushes for myself and had sort of given up on finding something just for me. I will be keeping my brush in a safe place so my kids don't lose it and recommending to all of my friends. I am very happy with this purchase and would buy it again. It is worth the money.\nIt actually detangled my extremely thick hair",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Needs:** User has very thick hair and faced significant tangling issues, indicating a strong need for effective hair care solutions.\n- **Preference for Functionality:** They prioritize products that genuinely deliver on their promises, specifically in detangling capabilities.\n- **Positive Product Experience:** The user expressed notable satisfaction with the performance of the detangling brush, confirming it worked well on their hair's challenges, leading to a heightened appreciation for functional hair tools.\n- **Willingness to Recommend:** They showed a tendency to share positive experiences with friends, indicating a social aspect to their purchasing decisions.\n- **Commitment to Quality:** User is likely to invest in products that are perceived as effective, even at higher price points, suggesting they value quality over cost.\n- **Family-Oriented:** The mention of keeping the brush safe from children implies consideration for family needs in product choices.\n\nOverall, this user’s profile indicates a strong commitment to finding high-quality hair care products that cater specifically to thick hair, with a willingness to share and recommend successful purchases within their social circles.",
  "metrics": {
    "rouge1_f": 0.23706176961602665,
    "rouge2_f": 0.023450586264656615,
    "rougeL_f": 0.10350584307178631,
    "meteor": 0.11491332284294174,
    "bleu1": 0.11320594411469985,
    "bleu2": 0.029966615984528752,
    "bleu3": 0.013360341504822827,
    "bleu4": 0.004223039539406003,
    "bertscore_precision": 0.3900139331817627,
    "bertscore_recall": 0.4382474422454834,
    "bertscore_f1": 0.4127262532711029
  }
}