{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/05/04\nAverage Rating: 3.9\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Unavailable'], 'Producers': ['Caryl Ebenezer', 'Cenwyn Edwards', 'John Alick Macpherson', 'J. Mervyn Williams'], 'Studio': ['FilmRise']}\nReview Text: I do feel this is a comprehensive coverage these people. So many are mistaken in have the view that you have to be Irish to be considered a Celt.\nReview Title: Comprehensive\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremy Lovering', 'Colm McCathy', 'Nick Hurran'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nWonderful screen play. The parallel with the original books is good while incorporating modern situations. A fine mix of comedy and drama. Very enjoyable.\nGreat Performances\nCalendar Girls\nHelen Mirren  (Actor),     Julie Walters  (Actor),     Nigel Cole  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"When 12 ordinary members of the Women's Institute, a prim and proper local ladies' club, decide they need to find a more compelling way to raise money for a new charity, they turn to their traditional annual calendar and give it a very untraditional twist. Behind the usual baked goods, the apple pressing, and the flower arrangements are the women -- completely nude! Starring 2003 Golden Globe nominee Helen Mirren (Best Actress, CALENDAR GIRLS) and Julie Walters (HARRY POTTER AND THE CHAMBER OF SECRETS), CALENDAR GIRLS is a terrifically entertaining comedy. And that's the naked truth.\"]\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'MFR786936227932#VG', 'Director': 'Nigel Cole', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'May 4, 2004', 'Actors': 'Helen Mirren, Julie Walters, John Alderton, Linda Bassett, Annette Crosbie', 'Subtitles': 'Spanish', 'Language': 'French, Unqualified, English (Dolby Digital 5.1)', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Juliette Towhidi, Tim Firth', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAnother movie I will be watching over and over for many years! It's a great movie for Girls Night In Movie Night! Wonderful story and fantastic performances by a star studded cast, a great mix of comedy and drama.\nA keeper\n{'Subtitles': ['None available'], 'Directors': ['Unavailable'], 'Producers': ['Caryl Ebenezer', 'Cenwyn Edwards', 'John Alick Macpherson', 'J. Mervyn Williams'], 'Studio': ['FilmRise']}\nI do feel this is a comprehensive coverage these people. So many are mistaken in have the view that you have to be Irish to be considered a Celt.\nComprehensive",
  "profile": "**User Summary:**\n\nThis user has a strong affinity for quality storytelling that artfully combines humor and drama, consistently showcased in their enthusiastic reviews of well-crafted screenplays. They enjoy adaptations that respect the integrity of the source material while offering modern updates. Their preference for nuanced performances is emphasized by their high ratings for productions featuring esteemed actors, illustrating a deep appreciation for talent and character depth.\n\nRecent interactions highlight the user’s enjoyment of comedic narratives, with a particular interest in engaging blends of humor and heartfelt moments. They maintain a commitment to superior audio options, reinforcing their sensitivity to dialogue clarity and immersive experiences, which suggests a focus on accessibility. Their high rating for a recent purchase exemplifies their pursuit of comprehensive content, demonstrating an interest in quality discussions and representations of cultural themes. \n\nAdditionally, the user's consistent trends show a fondness for intelligent narratives and captivating performances, complemented by a preference for memorable, light-hearted content suitable for group viewing experiences. This aligns with their social approach to media consumption, as they seek both entertainment and thoughtful storytelling, underpinned by strong performances and high production standards. Overall, the user continues to value productions with quality production values and talented directors and writers, alongside a commitment to fostering an inclusive understanding of diverse narratives.",
  "metrics": {
    "rouge1_f": 0.24703891708967848,
    "rouge2_f": 0.013582342954159592,
    "rougeL_f": 0.10829103214890017,
    "meteor": 0.08838383838383837,
    "bleu1": 0.07431506099925138,
    "bleu2": 0.019227670135525884,
    "bleu3": 0.0033303206019539935,
    "bleu4": 0.0013874495000809632,
    "bertscore_precision": 0.3331688642501831,
    "bertscore_recall": 0.43170812726020813,
    "bertscore_f1": 0.3760910630226135
  }
}