{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/08/13\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Anthony Byrne', 'Marc Jobst', 'Brendan Maher', 'Saul Metzstein'], 'Producers': ['Euros Lynn', 'Nikki Wilson', 'Piers Wenger', 'Heidi Thomas', 'Kate Harwood'], 'Starring': ['Dame Eileen Atkins', 'Keeley Hawes', 'Ed Stoppard'], 'Studio': ['BBC America']}\nReview Text: Nice to see the house alive again. Thanks for including &#34;Rose&#34; she always had such a strong connection to house.<br />The stories & characters seem very authentic. Every family has it's troubles, no matter who they are!\nReview Title: Nice to see the house alive again\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremy Lovering', 'Colm McCathy', 'Nick Hurran'], 'Producers': ['Sue Vertue', 'Beryl Vertue', 'Steven Moffat', 'Mark Gatiss'], 'Starring': ['Benedict Cumberbatch', 'Martin Freeman'], 'Studio': ['BBC America']}\nWonderful screen play. The parallel with the original books is good while incorporating modern situations. A fine mix of comedy and drama. Very enjoyable.\nGreat Performances\nCalendar Girls\nHelen Mirren  (Actor),     Julie Walters  (Actor),     Nigel Cole  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"When 12 ordinary members of the Women's Institute, a prim and proper local ladies' club, decide they need to find a more compelling way to raise money for a new charity, they turn to their traditional annual calendar and give it a very untraditional twist. Behind the usual baked goods, the apple pressing, and the flower arrangements are the women -- completely nude! Starring 2003 Golden Globe nominee Helen Mirren (Best Actress, CALENDAR GIRLS) and Julie Walters (HARRY POTTER AND THE CHAMBER OF SECRETS), CALENDAR GIRLS is a terrifically entertaining comedy. And that's the naked truth.\"]\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'MFR786936227932#VG', 'Director': 'Nigel Cole', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'May 4, 2004', 'Actors': 'Helen Mirren, Julie Walters, John Alderton, Linda Bassett, Annette Crosbie', 'Subtitles': 'Spanish', 'Language': 'French, Unqualified, English (Dolby Digital 5.1)', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Juliette Towhidi, Tim Firth', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAnother movie I will be watching over and over for many years! It's a great movie for Girls Night In Movie Night! Wonderful story and fantastic performances by a star studded cast, a great mix of comedy and drama.\nA keeper\n{'Subtitles': ['None available'], 'Directors': ['Unavailable'], 'Producers': ['Caryl Ebenezer', 'Cenwyn Edwards', 'John Alick Macpherson', 'J. Mervyn Williams'], 'Studio': ['FilmRise']}\nI do feel this is a comprehensive coverage these people. So many are mistaken in have the view that you have to be Irish to be considered a Celt.\nComprehensive\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bryn Higgins'], 'Producers': ['Bryn Higgins'], 'Starring': ['Sarah Smart', 'Tom Riley', 'Cherie Lunghi'], 'Studio': ['BBC America']}\nIt is very authentic and I love the extra blurbs of information that is given on screen before & after program. The actors selected seem to portray their characters very well also.\nIt is very authentic and I love the extra blurbs of information that is given on ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Euros Lyn', 'Anthony Byrne', 'Marc Jobst', 'Brendan Maher', 'Saul Metzstein'], 'Producers': ['Euros Lynn', 'Nikki Wilson', 'Piers Wenger', 'Heidi Thomas', 'Kate Harwood'], 'Starring': ['Dame Eileen Atkins', 'Keeley Hawes', 'Ed Stoppard'], 'Studio': ['BBC America']}\nNice to see the house alive again. Thanks for including &#34;Rose&#34; she always had such a strong connection to house.<br />The stories & characters seem very authentic. Every family has it's troubles, no matter who they are!\nNice to see the house alive again",
  "profile": "**User Summary:**\n\nThis user exhibits a strong affinity for quality storytelling that seamlessly blends humor and drama, as reflected in their enthusiastic reviews of well-crafted screenplays. They favor adaptations that respect the source material while infusing modern updates, showcasing their appreciation for nuanced performances, particularly from esteemed actors.\n\nRecent interactions emphasize their enjoyment of narratives that evoke laughter alongside heartfelt moments. Their dedication to superior audio options highlights a sensitivity to dialogue clarity and a pursuit of immersive experiences, underscoring a focus on accessibility in media consumption.\n\nThe user's latest review further emphasizes their interest in narratives grounded in authenticity, praising the effective representation of familial struggles and strong character connections. They consistently gravitate towards intelligent narratives and captivating performances, favoring lighthearted content suited for group viewing. This social approach blends entertainment with thoughtful storytelling, underscored by strong performances and high production standards.\n\nThe user maintains a priority for productions with quality values, talented directors and writers, and a commitment to fostering an inclusive understanding of diverse narratives. Their appreciation for authenticity, as reflected in their recent review, reinforces their quest for enriching media experiences that deliver both emotional depth and engaging storytelling, continually shaping their media consumption preferences.",
  "metrics": {
    "rouge1_f": 0.18904109589041093,
    "rouge2_f": 0.005494505494505494,
    "rougeL_f": 0.07945205479452055,
    "meteor": 0.06123469132716822,
    "bleu1": 0.01840655170575544,
    "bleu2": 0.004930277654934222,
    "bleu3": 0.0008639577879973363,
    "bleu4": 0.0003620669517580697,
    "bertscore_precision": 0.3153422176837921,
    "bertscore_recall": 0.44590169191360474,
    "bertscore_f1": 0.3694259524345398
  }
}