{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Bishop's Wife\nReview Date: 2017/11/12\nStore: Cary Grant  (Actor),     Loretta Young  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Bishop's Wife, The (DVD)\", 'Recently re-made as \"The Preacher\\'s Wife\" starring Denzel Washington and Whitney Houston, the original was nominated for 5 Academy Awards(R)! Cary Grant stars as an angel come to earth in answer to the prayers of a struggling young bishop. Year: 1947 Director: Henry Koster Starring: Cary Grant, Loretta Young, David Niven, Elsa Lanchester.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': 'Cary Grant, Henry Koster, David Niven, Loretta Young', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '344834', 'Director': 'Henry Koster', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Cary Grant, Loretta Young, David Niven', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: This is a wonderful classic movie that never grows old. One of the very best.\nReview Title: An Enduring Classic\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hawaii Five-0: Season 2\nAlex O'Loughlin  (Actor),     Scott Caan  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n[\"HAWAII FIVE-0 is a contemporary take on the classic series about a new elite federalized task force whose mission is to wipe out the crime that washes up on the Islands' sun-drenched beaches.\"]\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Alex O'Loughlin, Masi Oka, Grace Park, Daniel Dae Kim, Scott Caan, Lauren German\", 'Language': 'English', 'Number Of Discs': '6', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '540985509', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 25 minutes', 'Release date': 'December 19, 2017', 'Actors': \"Alex O'Loughlin, Scott Caan, Daniel Dae Kim, Grace Park, Masi Oka\", 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '6'}\nWhile I own & love the first season of Hawaii 5-0, I will not be purchasing Season Two. The fun and camaraderie of Season One was destroyed with slipshod writing and the introduction of the useless character of Lori Weston. Where I used to look forward to Monday nights to get my 5-0 fix, now I DVR the show and fast-forward through all the scenes that feature Lori. It's a shame, as I had initially planned to own all seasons as soon as they became available. Am sincerely hoping the writers do away with the Weston character in Season Three, and that the show regains its former greatness.\nWon't Be Buying Season Two\nStolen Women, Captured Hearts\nJanine Turner  (Actor),     Patrick Bergin  (Actor),     Jerry London  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Anna (Janine Turner), a beautiful young woman, allows her brother to arrange her marriage. She travels west to marry Daniel (Patrick Bergin), a man whom she has never met, but on the way is taken prisoner by the Sioux Indians. Their leader, the handsome warrior Tokalah (Michael Greyeyes), is set to kill Anna, until he realizes she is the woman who has come to him repeatedly in his dreams. He spares Anna's life and she continues to travel to Fort Hays where she meets and marries Daniel, the ordinary man her brother has chosen for her. After only one night with her new husband, Anna and her friend Sarah (Jean Louisa Kelly) are taken hostage by a tribe of Sioux warriors led by Tokolah. They are forced to live like the Sioux, learning their language, dressing like them and adapting to their customs. During this time Tokalah and Anna spend together, they give in to their emotions and, regardless of the consequences, they fall in love. After a year, the U.S. Cavalry and the Indians are at war and the women are rescued by General Custer. But Anna's heart still longs to be with Tokalah. Will she choose to follow her heart or obey the rules of convention?\"]\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Audio Description': 'English', 'Item model number': 'CBMO46338DVD', 'Director': 'Jerry London', 'Media Format': 'NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 17, 2013', 'Actors': 'Janine Turner, Patrick Bergin, Jean Louisa Kelly, Michael Greyeyes, Rodney A Grant', 'Subtitles': 'German, Italian, English', 'Producers': 'Vanessa Greene', 'Studio': 'CBS Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI always loved this movie, and was thrilled that it is available on DVD. What's not to love about the handsome Michael Greyeyes? Is it historically accurate? No. The real Anna Brewster Morgan's story is utterly tragic. But this film is a wonderful romantic escape. It would have been lovely if the real Anna's story had ended as this movie did.\nA Favorite\nColumbo: The Complete Series\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Editor's Picks\n['Legendary Peter Falk is a four-time Primetime Emmy Award-winner for his iconic role as the beloved, trenchcoat-wearing Police Lieutenant Columbo. Columbo is the landmark series that inspired a genre. And now, for the first time ever, all 69 episodes from its seven seasons and all 24 television movies are together in this 34-disc anthology. Every criminal, every innocent victim (and some not-so-innocent ones), and every wily deduction are here in one definitive collection. Seemingly befuddled but always brilliant, the cigar-chomping detective will have you following the clues and asking \"just one more thing\" until the last case is cracked.   Note: This set contains 34 discs which are contained in 8 cases.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Pounds', 'Media Format': 'Color, Full Screen, Widescreen, NTSC', 'Run time': '99 hours and 52 minutes', 'Release date': 'October 16, 2012', 'Actors': 'Peter Falk', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 2.0 Mono), Unknown (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal', 'Number of discs': '34'}\nMy mom just sent this to me as an early Christmas present. She bought it here on Amazon (we’re both Prime customers) at a great price. I’ve always loved Columbo, and it’s wonderful to have the entire series to watch. It never gets old. The package arrived in great shape. If you’re a fan of Columbo, buy this! You won’t be disappointed.\nSo Happy to Own the Entire Series\nAll I Want For Christmas\nLauren Bacall  (Actor),     Thora Birch  (Actor),     Robert Lieberman  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['All I Want For Christmas (DVD)', \"If teenaged Ethan and his younger sister Hallie put every toy in Macy's on their Christmas list, it still wouldn't include what they want most. They want a miracle - they want their divorced parents back together! Wi th lots of humor, heart and yuletide sparkle, All I Want For Christmas i s all you could want in a family film treat. Ethan Randall (Dutch) and T hora Birch (Patriot Games) play the siblings who come up with a hilariou s plan to reunite their parents (Harley Jane Kozak and Jamey Sheridan). Movie legend Lauren Bac all plays the sympathetic grandmother who assist s the kids. And Leslie Nielsen (The Naked Gun. films) appears as Santa C laus. So what is the plan? Ho-ho-ho! Aren't you in for a surprise!\", ']]>']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Kevin Nealon, Leslie Nielsen, Robert Lieberman, Thora Birch, Harley Jane Kozak, Ethan Randall, Jamey Sheridan, Lauren BacallKevin Nealon, Leslie Nielsen, Robert Lieberman, Thora Birch, Harley Jane Kozak, Ethan Randall, Jamey Sheridan, Lauren Bacall  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 32 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '883929303748', 'Director': 'Robert Lieberman', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 5, 2004', 'Actors': 'Lauren Bacall, Thora Birch, Harley Jane Kozak, Kevin Nealon, Leslie Nielsen', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nOf course it’s cute, cliche, corny, and predictable. But it’s also utterly charming. I was delighted to finally own a copy, and it’s fun to watch again during the holidays.\nA Fun Christmas movie\nThe Bishop's Wife\nCary Grant  (Actor),     Loretta Young  (Actor),     Henry Koster  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Bishop's Wife, The (DVD)\", 'Recently re-made as \"The Preacher\\'s Wife\" starring Denzel Washington and Whitney Houston, the original was nominated for 5 Academy Awards(R)! Cary Grant stars as an angel come to earth in answer to the prayers of a struggling young bishop. Year: 1947 Director: Henry Koster Starring: Cary Grant, Loretta Young, David Niven, Elsa Lanchester.', ']]>']\n{'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': 'Cary Grant, Henry Koster, David Niven, Loretta Young', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '344834', 'Director': 'Henry Koster', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Cary Grant, Loretta Young, David Niven', 'Subtitles': 'English, Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nThis is a wonderful classic movie that never grows old. One of the very best.\nAn Enduring Classic",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference**: Enjoys action and crime television centered on elite task forces, while also appreciating family films and romantic dramas that weave in historical themes and emotional depth. Nostalgic for classic detective series and family favorites, showcasing a wide-ranging taste that balances serious and light-hearted storytelling. \n- **Content Engagement**: Exhibits enthusiasm for classic films, particularly those with enduring appeal, while maintaining a fondness for charming holiday narratives that elicit feelings of joy and warmth. \n- **Review Style**: Expresses preferences and critiques articulately, highlighting elements that resonate emotionally. Positively reinforces works that offer warmth and familiarity, indicating a strong connection to storytelling.\n- **Commitment to Series/Films**: Willing to invest in both full series and standalone films, reassessing favorites based on narrative quality and character development.\n- **Expectations**: Anticipates high-caliber storytelling across genres, with a sustained interest in character evolution and a growing appreciation for classic comedies that blend humor and heartfelt themes.\n- **Viewing Habits**: Prefers live viewing but utilizes DVR for flexibility. Enjoys re-watching seasonal favorites, underscoring a deep connection to holiday traditions, and celebrates classic films that stand the test of time. \n\nOverall, the user demonstrates discerning tastes, balancing serious narratives with an increasing fondness for uplifting and classic films, enriching their viewing experience and emotional resonance.",
  "metrics": {
    "rouge1_f": 0.11438679245283019,
    "rouge2_f": 0.0035419126328217238,
    "rougeL_f": 0.05778301886792453,
    "meteor": 0.0384836902455626,
    "bleu1": 0.0004676849529010999,
    "bleu2": 7.919944505116503e-05,
    "bleu3": 1.4119147071077522e-05,
    "bleu4": 5.966999415616307e-06,
    "bertscore_precision": 0.35358500480651855,
    "bertscore_recall": 0.4758176803588867,
    "bertscore_f1": 0.4056943655014038
  }
}