{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Stolen Women, Captured Hearts\nReview Date: 2016/03/19\nStore: Janine Turner  (Actor),     Patrick Bergin  (Actor),     Jerry London  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Anna (Janine Turner), a beautiful young woman, allows her brother to arrange her marriage. She travels west to marry Daniel (Patrick Bergin), a man whom she has never met, but on the way is taken prisoner by the Sioux Indians. Their leader, the handsome warrior Tokalah (Michael Greyeyes), is set to kill Anna, until he realizes she is the woman who has come to him repeatedly in his dreams. He spares Anna's life and she continues to travel to Fort Hays where she meets and marries Daniel, the ordinary man her brother has chosen for her. After only one night with her new husband, Anna and her friend Sarah (Jean Louisa Kelly) are taken hostage by a tribe of Sioux warriors led by Tokolah. They are forced to live like the Sioux, learning their language, dressing like them and adapting to their customs. During this time Tokalah and Anna spend together, they give in to their emotions and, regardless of the consequences, they fall in love. After a year, the U.S. Cavalry and the Indians are at war and the women are rescued by General Custer. But Anna's heart still longs to be with Tokalah. Will she choose to follow her heart or obey the rules of convention?\"]\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Audio Description': 'English', 'Item model number': 'CBMO46338DVD', 'Director': 'Jerry London', 'Media Format': 'NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 17, 2013', 'Actors': 'Janine Turner, Patrick Bergin, Jean Louisa Kelly, Michael Greyeyes, Rodney A Grant', 'Subtitles': 'German, Italian, English', 'Producers': 'Vanessa Greene', 'Studio': 'CBS Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I always loved this movie, and was thrilled that it is available on DVD. What's not to love about the handsome Michael Greyeyes? Is it historically accurate? No. The real Anna Brewster Morgan's story is utterly tragic. But this film is a wonderful romantic escape. It would have been lovely if the real Anna's story had ended as this movie did.\nReview Title: A Favorite\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hawaii Five-0: Season 2\nAlex O'Loughlin  (Actor),     Scott Caan  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n[\"HAWAII FIVE-0 is a contemporary take on the classic series about a new elite federalized task force whose mission is to wipe out the crime that washes up on the Islands' sun-drenched beaches.\"]\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Alex O'Loughlin, Masi Oka, Grace Park, Daniel Dae Kim, Scott Caan, Lauren German\", 'Language': 'English', 'Number Of Discs': '6', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '540985509', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 25 minutes', 'Release date': 'December 19, 2017', 'Actors': \"Alex O'Loughlin, Scott Caan, Daniel Dae Kim, Grace Park, Masi Oka\", 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '6'}\nWhile I own & love the first season of Hawaii 5-0, I will not be purchasing Season Two. The fun and camaraderie of Season One was destroyed with slipshod writing and the introduction of the useless character of Lori Weston. Where I used to look forward to Monday nights to get my 5-0 fix, now I DVR the show and fast-forward through all the scenes that feature Lori. It's a shame, as I had initially planned to own all seasons as soon as they became available. Am sincerely hoping the writers do away with the Weston character in Season Three, and that the show regains its former greatness.\nWon't Be Buying Season Two\nStolen Women, Captured Hearts\nJanine Turner  (Actor),     Patrick Bergin  (Actor),     Jerry London  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Anna (Janine Turner), a beautiful young woman, allows her brother to arrange her marriage. She travels west to marry Daniel (Patrick Bergin), a man whom she has never met, but on the way is taken prisoner by the Sioux Indians. Their leader, the handsome warrior Tokalah (Michael Greyeyes), is set to kill Anna, until he realizes she is the woman who has come to him repeatedly in his dreams. He spares Anna's life and she continues to travel to Fort Hays where she meets and marries Daniel, the ordinary man her brother has chosen for her. After only one night with her new husband, Anna and her friend Sarah (Jean Louisa Kelly) are taken hostage by a tribe of Sioux warriors led by Tokolah. They are forced to live like the Sioux, learning their language, dressing like them and adapting to their customs. During this time Tokalah and Anna spend together, they give in to their emotions and, regardless of the consequences, they fall in love. After a year, the U.S. Cavalry and the Indians are at war and the women are rescued by General Custer. But Anna's heart still longs to be with Tokalah. Will she choose to follow her heart or obey the rules of convention?\"]\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Audio Description': 'English', 'Item model number': 'CBMO46338DVD', 'Director': 'Jerry London', 'Media Format': 'NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 17, 2013', 'Actors': 'Janine Turner, Patrick Bergin, Jean Louisa Kelly, Michael Greyeyes, Rodney A Grant', 'Subtitles': 'German, Italian, English', 'Producers': 'Vanessa Greene', 'Studio': 'CBS Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI always loved this movie, and was thrilled that it is available on DVD. What's not to love about the handsome Michael Greyeyes? Is it historically accurate? No. The real Anna Brewster Morgan's story is utterly tragic. But this film is a wonderful romantic escape. It would have been lovely if the real Anna's story had ended as this movie did.\nA Favorite",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference**: Enjoys action and crime television, particularly series involving elite task forces, but also appreciates romantic dramas that provide an escape, blending historical contexts with emotional narratives.  \n- **Content Engagement**: Initially enthusiastic about shows and films, emphasizing strong character dynamics. Displays a balanced appreciation, willing to endorse projects that resonate personally, as shown by favorable reviews of romantic escapes despite historical inaccuracies.  \n- **Review Style**: Articulates preferences and disappointments with clarity, providing specific reasons for shortcomings, particularly focusing on character impact and narrative quality. Positively reinforces works that align with personal taste, showcasing appreciation for elements like romance and allure.  \n- **Commitment to Series/Films**: Willing to invest in complete series or films but reassesses favorability based on the quality and direction of subsequent narratives. Consistently values high-quality writing and character development.  \n- **Expectations**: Expects high-caliber storytelling in both series and films, with a keen eye for character evolution. Proactively shares hopes for improvements and thematic adherence in future content.  \n- **Viewing Habits**: Prefers live viewing but uses DVR to manage the experience, indicating a desire for control over content consumption. Additionally, appreciates when favorite films are re-released on formats that allow for personal enjoyment.\n\nOverall, the user has discerning tastes, demonstrating a blend of expectations for both genre-specific narratives and emotionally driven romantic tales.",
  "metrics": {
    "rouge1_f": 0.1807909604519774,
    "rouge2_f": 0.011325028312570781,
    "rougeL_f": 0.08361581920903954,
    "meteor": 0.07413607557096735,
    "bleu1": 0.036828447094983716,
    "bleu2": 0.008554627017091388,
    "bleu3": 0.0014291185101083606,
    "bleu4": 0.0005846442446796273,
    "bertscore_precision": 0.3692309856414795,
    "bertscore_recall": 0.44732826948165894,
    "bertscore_f1": 0.4045449197292328
  }
}