{
  "interaction_number": 18,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Harvest Love\nReview Date: 2022/11/13\nStore: Jen Lilley  (Actor),     Ryan Paevey  (Actor),     Christie Will Wolf  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"A widowed surgeon visits her family's pear orchard in hopes of taking a break from her overbooked life and reconnecting with her distant son. She starts to fall for the farm manager, Will, who is growing a new hybrid pear and teaches her the importance of her heritage.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie', 'Format': 'NTSC, Subtitled', 'Contributor': 'Brenden Sunderland, Jen Lilley, Christie Will Wolf, Lincoln Lageson, Ryan Paevey', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'Christie Will Wolf', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 24 minutes', 'Release date': 'September 10, 2019', 'Actors': 'Jen Lilley, Ryan Paevey, Brenden Sunderland', 'Producers': 'Lincoln Lageson', 'Studio': 'Cinedigm', 'Number of discs': '1'}\nReview Text: Jen Lily and Ryan Peve are 2 of my favorite actors and the cemestry between the two of them makes this movie so believable. It also brings back special memories of the harvest times I shared with my family throughout my life. Truly beautiful story.\nReview Title: I really enjoy this harvest time story.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Shadowlands\nAnthony Hopkins  (Actor),     Debra Winger  (Actor),     Richard Attenborough  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Amazon.com', 'This emotionally moving romantic drama was adapted by William Nicholson from his own acclaimed play, based upon the real-life romance (during the 1950s) between the British writer C.S. Lewis and a divorced American poet named Joy Gresham. Best known for writing', 'The Lion, The Witch, and The Wardrobe', \", Lewis (Anthony Hopkins) is living comfortably as a respected Oxford don, his academic lifestyle a kind of shell protecting him from the emotional risk of love. Joy Gresham (Debra Winger) arrives at Oxford as an avid admirer of Lewis's writing, and the safety of his collegiate routine is quickly disrupted when Lewis realizes that he's fallen deeply and unexpectedly in love. Their courtship is uniquely engaging; he's shy and uncertain, she's outspoken and bold. But when Joy is diagnosed with cancer, Lewis's Christian faith is put to the test--he cannot fathom why their happiness together would be so drastically challenged. Together, they find a way to accept and honor the time they have shared together, and under the sensitive direction of Richard Attenborough,\", 'Shadowlands', 'arrives at a conclusion that is both heartbreaking and uplifting at the same time. Hopkins and Winger are equally superb in this absorbing story of personal and spiritual transformation--a story previously filmed for British television in 1985, with Joss Ackland and Claire Bloom.', '--Jeff Shannon']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Richard Attenborough', 'Media Format': 'AC-3, Color, Dolby, DVD, Widescreen, NTSC, Letterboxed', 'Run time': '2 hours and 11 minutes', 'Release date': 'April 13, 1999', 'Actors': 'Anthony Hopkins, Debra Winger, Michael Denison, Andrew Seear, Tim McMullan', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 1.0), French (Dolby Digital 2.0 Surround)', 'Studio': 'Hbo Home Video', 'Number of discs': '1'}\nI thought I  was purchasing the full version of the movie on DVD, but got an edited version. This was a disappointment to me because I  saw the fill version at the theater many years ago when it was released. I also had the full (unedited) version on VHS, but can not view it because have no VHS player to view it from anymore.\nWish I'd known it was edited  (shorter) version.\nThe Space Between Us [DVD]\nGary Oldman  (Actor),     Asa Butterfield  (Actor),     Peter Chelsom  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"Sixteen-year-old Gardner Elliot (Asa Butterfield) has lived his whole life with a team of scientists on Mars. He's always longed to see Earth to find the father he's never known and to meet a beautiful street-smart girl named Tulsa he's become friends with online. But when his chance finally comes, doctors discover his heart can't withstand the Earth's atmosphere. Eager to find his father, Gardner and Tulsa escape on a cross-country race against time to unravel the mysteries of how he came to be and where he belongs in the universe. Gary Oldman and Carla Gugino also star in this heartfelt and inspiring romantic adventure about how far one person can go for love.\", 'Bonus Content:', 'Alternate Ending', 'Alternate Ending', 'Deleted Scenes', 'Deleted Scenes', 'Love Featurette', 'Love Featurette', 'Feature Commentary with Director Peter Chelsom', 'Feature Commentary with Director Peter Chelsom', ']]>']\n{'Genre': 'Drama, Art House & International, Action & Adventure', 'Format': 'Digital_copy, NTSC, Subtitled', 'Contributor': 'Britt Robertson, Gary Oldman, Carla Gugino, Asa Butterfield, Peter Chelsom, Allan Loeb, BD Wong, Richard B. LewisBritt Robertson, Gary Oldman, Carla Gugino, Asa Butterfield, Peter Chelsom, Allan Loeb, BD Wong, Richard B. Lewis   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Peter Chelsom', 'Media Format': 'Digital_copy, NTSC, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'May 16, 2017', 'Actors': 'Gary Oldman, Asa Butterfield, Carla Gugino, Britt Robertson, BD Wong', 'Subtitles': 'Spanish', 'Producers': 'Richard B. Lewis', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Allan Loeb', 'Number of discs': '1'}\nWhat an suprising and original movie. The concept of being on a planet in space and not knowing how a body functions so differently than being on earth. I loved this story so much and would like to see more like it made.\nDifferent, Believable, and totally Entertaining\nLetters to Juliet\nAmanda Seyfried  (Actor),     Gael García Bernal  (Actor),     Gary Winick  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'When a young American travels to the city of Verona, home of the star-crossed lover Juliet Capulet of Romeo and Juliet fame, she joins a group of volunteers who respond to letters to Juliet seeking advice about love. After answering one letter dated 1951, she inspires its author to travel to Italy in search of her long-lost love and sets off a chain of events that will bring a love into both their lives unlike anything they ever imagined.', 'Amazon.com', 'Letters to Juliet', 'succeeds in being just what it\\'s meant to be, a feel-good romantic comedy about love lost and love found, in which love triumphs in the face of cynicism. Inspired by the book of the same name, and filmed against the beautiful backdrop of Verona, Italy, the movie tells the story of how troubled young women seek advice from Shakespeare\\'s Juliet by leaving letters tacked to a wall, where they are carefully answered by Juliet\\'s self-appointed \"secretaries.\" One such note is found 50 years later by Sophie (Amanda Seyfried), a young American woman who is soon to be married and who yearns to become a writer. Her heartfelt answer to the letter serves as a catalyst for an epic romantic journey that will span continents and generations. The success of the film lies in the powerful interaction between the wistfully romantic and fully mature author of the letter, Claire (Vanessa Redgrave); the romantically idealistic Sophie; and Claire\\'s overly pragmatic, downright cynical grandson Charlie (Christopher Egan), who grudgingly accompanies his grandmother on what he deems an insane quest to Verona to find her long lost love, Lorenzo. The filmmakers, writers, and actors all capitalize well on the comic possibilities of the situation, and there are more than a few good chuckles to be had at the absurdity of the interactions between these three very different characters, as they experience everything from hope and longing to disappointment and unexpected fulfillment. In the end, each character grows and changes profoundly as a result of their shared journey. Sure, the events portrayed in the film are highly unrealistic, but that doesn\\'t change the fact that the film speaks to that innermost part of us all that, despite all logic, makes us want to believe that true love really does exist and that it just might triumph in the end.', '--Tami Horiuchi']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Amanda Seyfried, Gary Winick, Gael García Bernal', 'Language': 'Unqualified', 'Runtime': '1 hour and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.61 x 5.48 x 7.57 inches; 2.08 Ounces', 'Item model number': '6611462', 'Director': 'Gary Winick', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'September 14, 2010', 'Actors': 'Amanda Seyfried, Gael García Bernal', 'Subtitles': 'English', 'Studio': 'Summit Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI really liked Letters to Juilet. It was a fresh look at seeing what one kind deed, becoming involved in doing something nice for someone that you do not know can make a difference in their life. I loved the intrigue of the journey to find the one love, lost years earlier,  took 3 persons on a journey that changed each of their lives. It's a splendid love story. I have shared my DVD with several of my friends and family members and they all love the story as well.\nThat there is happiness where you least expect to find it. So never give up searching for it.\nSECRET, THE: DARE TO DREAM BD + DGTL + ECOPY\nKatie Holmes  (Actor),     Josh Lucas  (Actor),     Andy Tennant  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n{'Genre': 'Drama, Romance', 'Format': 'NTSC, Subtitled, Digital_copy', 'Contributor': \"Sydney Tennant, Katie Holmes, Sarah Hoffmeister, Andy Tennant, Josh Lucas, Katrina Begin, Robert Cort, Rhonda Byrne, Aidan Brennan, Celia Weston, Matthew George, Joe Gelchion, Robert Katz, Jerry O'ConnellSydney Tennant, Katie Holmes, Sarah Hoffmeister, Andy Tennant, Josh Lucas, Katrina Begin, Robert Cort, Rhonda Byrne, Aidan Brennan, Celia Weston, Matthew George, Joe Gelchion, Robert Katz, Jerry O'Connell   See more\", 'Language': 'English', 'Runtime': '1 hour and 41 minutes'}\nIt's hard to find movies with a different story line, but SECRET, THE DARE TO DREAM, does this perfectly. It's entertaining and wholesome. A movie for the whole family. I think Katy Holmes and Josh Lucas nailed this one right on the nose.\nA surprising family story.\nMidnight Sun [Blu-ray]\nBella Thorne  (Actor),     Patrick Schwarzenegger  (Actor),     Scott Speer  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['Midnight Sun Blu-ray + DVD']\n{'Genre': 'Drama, Drama/Love & Romance, DVD Movie, Blu-ray Movie', 'Format': 'Color, NTSC, Subtitled, Widescreen, Digital_copy', 'Contributor': 'Scott Speer, Zack Schiller, Eric Kirsten, John Rickard, Patrick Schwarzenegger, Rob Riggle, Ken Tremblett, Quinn Shephard, Jen Gatien, Bella Thorne, Suleka MathewScott Speer, Zack Schiller, Eric Kirsten, John Rickard, Patrick Schwarzenegger, Rob Riggle, Ken Tremblett, Quinn Shephard, Jen Gatien, Bella Thorne, Suleka Mathew   See more', 'Language': 'English (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.75 x 5.25 x 0.55 inches; 3.52 Ounces', 'Director': 'Scott Speer', 'Media Format': 'Color, NTSC, Subtitled, Widescreen, Digital_copy', 'Run time': '1 hour and 32 minutes', 'Release date': 'June 19, 2018', 'Actors': 'Bella Thorne, Patrick Schwarzenegger, Quinn Shephard, Ken Tremblett, Suleka Mathew', 'Subtitles': 'Spanish', 'Producers': 'John Rickard, Zack Schiller, Jen Gatien', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Eric Kirsten', 'Number of discs': '2'}\nI liked the storyline because it showed the depth of love the father had for his daughter and how he protected her from harm in a very difficult challenge with her health issues. The actors in this movie were superb.\nOne of the best dad's I've seen in years.\nSame Kind of Different As Me\nGreg Kinnear  (Actor),     Jon Voight  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Same Kind of Different as Me (2017)', 'Successful businessman Ron Hall and his wife, Deborah, discover a renewed sense of purpose when they begin to volunteer at a local mission in Fort Worth, Texas. Their lives change forever when they develop an unlikely friendship with Denver Moore, a homeless man who inspires them to save their struggling marriage.']\n{'Genre': 'Drama', 'Format': 'AC-3, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Contributor': 'Greg Kinnear, Jon Voight, Djimon Hounsou, Rene Zellweger', 'Language': 'English', 'Runtime': '1 hour and 59 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.92 Ounces', 'Item model number': 'D59194412D', 'Media Format': 'AC-3, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 59 minutes', 'Release date': 'April 13, 2021', 'Actors': 'Greg Kinnear, Jon Voight, Rene Zellweger, Djimon Hounsou', 'Dubbed': 'French, Spanish', 'Subtitles': 'German, Spanish, French', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nI had to watch this movie for a few minutes to get into the storyline. I almost turned it off, but I'm glad I didn't. The interrelationship between the characters proved to be the best part,however, I feel that it might have edited to much information out which seemed to be too chopped up.\nThe title of this movie fit the movie perfectly.\nMariah Carey's All I Want for Christmas Is You [Blu-ray]\nBreanna Yde  (Actor),     Henry Winkler  (Actor),     Guy Vasilovich  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['When little Mariah (Breanna Yde) sees a darling little puppy named \"Princess\" at the pet store, she suddenly knows exactly what she wants for Christmas.']\n{'Genre': 'Kids & Family, DVD Movie, Animation, Blu-ray Movie, Kids & Family/Holidays & Festivals', 'Format': 'Color, Digital_copy, Animated, NTSC, Subtitled, Widescreen', 'Contributor': 'Henry Winkler, Guy Vasilovich, Mariah Carey, Temple Mathews, Breanna Yde, Mike Young, Liz Young, Steven RosenHenry Winkler, Guy Vasilovich, Mariah Carey, Temple Mathews, Breanna Yde, Mike Young, Liz Young, Steven Rosen  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '3 hours and 2 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7 x 5 x 0.5 inches; 3.2 Ounces', 'Director': 'Guy Vasilovich', 'Media Format': 'Color, Digital_copy, Animated, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 2 minutes', 'Release date': 'November 14, 2017', 'Actors': 'Breanna Yde, Henry Winkler', 'Subtitles': 'French, Spanish', 'Producers': 'Mike Young, Liz Young, Steven Rosen, Mariah Carey', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Temple Mathews', 'Number of discs': '2'}\nMany great lessons can be gleaned from watching this DVD followed by a discussion on values such as: honesty, choices, responsibility, family support, accepting help when it is offered, and being true to yourself, and others. It is also very enjoyable and just plain cute to watch.\nGreat family holiday dvd\nThe Spirit of Christmas\nJen Lilley  (Actor),     Thomas Beaudoin  (Actor),     David Jackson  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Attorney Kate Jordan is sent to broker the sale of Hollygrove Inn, but she is told that her appraiser has left because of a ghost. Sure enough, it s not long before she meets Daniel Forsythe...a man who mysteriously died 95 years ago. The two strike a deal if she can help him discover the truth behind his death and why he is cursed to return to the inn for Christmas each year, he will leave and allow Kate to finish her job. As they work together, Kate can t help but fall for this dashing Christmas spirit, and a romance develops that will alter the course of both their lives.']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Director': 'David Jackson', 'Media Format': 'AC-3, NTSC, Surround Sound, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'November 15, 2016', 'Actors': 'Jen Lilley, Thomas Beaudoin', 'Subtitles': 'German, English', 'Studio': 'Monarch Video', 'Number of discs': '1'}\nThe story was very creative, with two of my favorite actors. I'll surprise my family with a copy for Christmas this coming year. However, I'll enjoy it through this year myself.\nGreat Movie.\nA Bear Named Winnie [DVD]\nFormat: DVD\nMovies & TV, Movies\n['Based on a true story, this charming film, which will appeal to adults and children alike, explores the relationship of the extraordinary black bear who became the inspiration for the stories of A.A. Milne, and the heroic man who saved her life and gave her to the world.', 'August 1914. The outbreak of World War One. The Canadian city of Winnipeg is gripped by a patriotic frenzy. Troops march through the heart of the city as young men in civilian clothes rush to join the ranks. Among the troops is Lieutenant Harry Colebourn (Michael Fassbender, Alien Covenant, Assassins Creed), a supremely confident and likeable vet who has a gift with animals.', 'But Winnie (Winnipeg) is a breath of fresh air from the harsh realities of war for the soldiers and is given a reprieve by old fashioned General Halholland (David Suchet, Poirot, Henry VIII) by becoming the regimental mascot.']\n{'Format': 'PAL', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.09 x 5.43 x 0.59 inches; 2.93 Ounces', 'Media Format': 'PAL', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 25, 2017', 'Studio': 'Spirit Entertainment Limited', 'Number of discs': '1'}\nI liked best how a group of military men could work so hard to save an orphaned bear in a time in the world when most people didn't even think about saving any wild animals. There were even many people mistreated their transportation animals. I'm a great fan of Winnie the Pooh.\nSuch a tender movie.\nAngel & The Badman / John Wayne on Film\nJohn Wayne  (Actor),     Gail Russell  (Actor),     James Edward Grant  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, John Wayne Store, All Titles\n['A story of an outlaw trying to change his life. While being nursed back to health, Wayne begins to fall in love with Gail Russell.', 'Also included: \"John Wayne On Film - A documentary\", an introduction by Tony Curtis and additional bonus footage of John Wayne.', 'Menus: English \\x95 Spanish \\x95 Chinese \\x95 Japanese', 'Subtitles: Spanish \\x95 Chinese \\x95 Japanese', 'B&W/Color Running Time: 100 min.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.25 x 0.75 inches; 4 Ounces', 'Director': 'James Edward Grant', 'Media Format': 'Multiple Formats, Black & White, Color, NTSC', 'Release date': 'July 24, 1999', 'Actors': 'John Wayne, Gail Russell, Harry Carey, Bruce Cabot, Irene Rich', 'Subtitles': 'Spanish, Japanese, Chinese', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Studio': 'Delta', 'Writers': 'James Edward Grant, Jerome Stern', 'Number of discs': '1'}\nHe has always been one of my favorite actors. I have quiet a few of his movies on VHF's, but wanted to go to DVD OR BLU-RAY.\nLove John Wayne Movies.\nThe Quiet Man (Collector's Edition)\nJohn Wayne  (Actor),     Maureen O'Hara  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Independently Distributed, Comedy\n[\"Australia released, NTSC/Region 0 DVD: LANGUAGES: English ( Dolby Digital 2.0 ), SPECIAL FEATURES: Collectors Edition, Commentary, Documentary, Interactive Menu, Remastered, Scene Access, Trailer(s), SYNOPSIS: Sean Thornton arrives by train in Castletown in Ireland coming from Pittsburgh and in the train station, he seeks direction to Inisfree. Michaleen Oge Flynn comes with his horse-drawn chaise and takes Sean to Inisfree. Along their way, Sean sees the red-haired Mary Kate Danaher in the field and a cottage in White O'Morn that belongs to the widow Sarah Tillane. Sean tells to Michaleen that he was born in that cottage and he wants to buy the real-estate. The coachman recognizes him and then they meet Father Peter Lonergan that had known Sean's family and welcomes him. When Sean meets Miss Tillane, her neighbor Squire 'Red' Will Danaher that wants to buy the property and marry Tillane is very upset with her. When she sells the real-estate to Sean, Will becomes his declared enemy. Sean decides to get married with Mary Kate and he hires the service of the matchmaker Michaleen; however, he does not succeed since Mary Kate is the sister of Will Danaher. However, Michaleen, Father Peter Lonergan, and other locals lure Will and he consents the marriage of his sister expecting to marry Miss Tillane. When he finds that he was deceived, he does not pay the dowry for his sister. Mary Kate tries to force Sean to take her money by force from her brother, but Sean does not want to fight against Sean. Mary Kate and the locals believe that he is a coward, but Sean actually wants to forget a fatal incident from his past and start a new life. SCREENED/AWARDED AT: Golden Globes, Oscar Academy Awards, Venice Film Festival, ...The Quiet Man\"]\n{'Genre': 'Comedy', 'Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Collector's Edition\", 'Contributor': \"John Wayne, Mildred Natwick, Barry Fitzgerald, Ward Bond, Leonard Maltin, Michael Wayne, Andrew V. McLaglen, Toni Wayne, John Ford, Victor McLaglen, Francis Ford, Maureen O'HaraJohn Wayne, Mildred Natwick, Barry Fitzgerald, Ward Bond, Leonard Maltin, Michael Wayne, Andrew V. McLaglen, Toni Wayne, John Ford, Victor McLaglen, Francis Ford, Maureen O'Hara  See more\", 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '2 hours and 9 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.35 x 7.56 x 0.75 inches; 2.75 Ounces', 'Director': 'John Ford', 'Media Format': \"Multiple Formats, Closed-captioned, Color, NTSC, Collector's Edition\", 'Run time': '2 hours and 9 minutes', 'Release date': 'October 22, 2002', 'Actors': \"John Wayne, Maureen O'Hara, Leonard Maltin, Michael Wayne, Toni Wayne\", 'Studio': 'Republic Pictures', 'Number of discs': '1'}\nThis is one of JW's best!\nIt's John Wayne.\nDonovan's Reef\nJohn Wayne  (Actor),     Dorothy Lamour  (Actor),     John Ford  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['\"Guns\" Donovan (John Wayne), \"Boats\" Gilhooley (Lee Marvin), and \"Doc\" Dedham (Jack Warden) are former Navy men who live a leisurely life on an idyllic Pacific island where they had fought during World War II. But Donovan finds his boozing and brawling ways could be coming to an end when he falls for Doc\\'s estranged daughter (Elizabeth Allen), who arrives on the island to determine if her father is worthy of collecting a sizable family inheritance. Cesar Romero and Dorothy Lamour co-star; directed by John Ford. 109 min. Widescreen (Enhanced); Soundtracks: English Dolby Digital mono, French Dolby Digital mono; Subtitles: English; theatrical trailer.']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'donovans-reef', 'Director': 'John Ford', 'Media Format': 'Subtitled, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'September 12, 2017', 'Actors': 'John Wayne, Dorothy Lamour, Cesar Romero, Elizabeth Allen, Lee Marvin', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nGave this to my Nephew as a birthday gift.\nThis one was a gift.\nThe Wedding Veil Unveiled\nTerry Ingram  (Director),     Autumn Reeser  (Actor),     Paolo Bernardini  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Emma (Autumn Reeser) travels to Italy to teach and research a wedding veil said to bring its owner love. While there, she meets Paolo (Paolo Bernardini), the son of a local lace-making family.']\n{'Genre': 'Drama, Romance', 'Format': 'NTSC, Subtitled', 'Contributor': 'Autumn Reeser, Alison Sweeney, Paolo Bernardini, Terry Ingram, Lacey Chabert', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.68 x 5.35 x 0.59 inches; 2.61 Ounces', 'Director': 'Terry Ingram', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 24 minutes', 'Release date': 'June 7, 2022', 'Actors': 'Autumn Reeser, Paolo Bernardini, Lacey Chabert, Alison Sweeney', 'Subtitles': 'English', 'Studio': 'Hallmark', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI liked this film because like all hallmark films they represent the best part of personal rationships and this one has 3 of my favorite hallmark actresses, and of course the happy ending.\nTypical halmark story\nSweetness In The Belly\nDrama, Gentle, Inspiring, Touching\n['A moving story of Lilly (Dakota Fanning), a child abandoned in Africa as a child. Lily is forced to flee Ethiopia for England when civil war breaks. She befriends Amina (Wunmi Mosaku), an Ethiopian refugee who has fled the same war. Together they begin a mission to reunite people with their scattered families.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Zeresenay Berhane Mehari'], 'Producers': ['Julia Sereny', 'Alan Moloney', 'Susan Mullen'], 'Starring': ['Dakota Fanning', 'Wunmi Mosaku', 'Kunal Nayyar']}\nI have followed Dakota Fanning and have been since she was young. I  was intrigued by the story of the character she played but felt too much of her story was left out and it made me wonder if she ever found happiness in her life. It was well acted by all of the cast; just too short.\nWhat a sad life\nThe Mistletoe Promise\nDavid Winning  (Director),     Jaime King  (Actor),     Luke Macfarlane  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['A chance meeting between two strangers who share a disdain for Christmas results in The Mistletoe Promise, a pact to help them navigate their holiday complications – together. But as they spend more time with each other and experience the magic of Christmas the phony couple discovers there may be more to their contract than business. Based on the bestselling novel by Richard Paul Evans.']\n{'Genre': 'Christmas, Drama', 'Format': 'NTSC, Subtitled', 'Contributor': 'David Winning, Luke Macfarlane, Jaime King', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.44 x 5.35 x 0.51 inches; 2.4 Ounces', 'Director': 'David Winning', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 24 minutes', 'Release date': 'June 28, 2022', 'Actors': 'Jaime King, Luke Macfarlane', 'Subtitles': 'English', 'Studio': 'Hallmark', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have been waiting a long time to pick this movie up. I mean years, and could not find it even at Hallmark and was so sad. The story has great  hidden messages in it, if you look and listen for them. It is, in my opinion one of Hallmarks greatest movies. A must have for good and authentic Christmas time watching. However, I think it is best meant for ages 16+ ages just because younger ages would not be able to understand the subject of its meaning and get bored. Still, there is nothing offensive in the movie at all.\nWhat a wonderful Christmas DVD\nAn Innocent Man [DVD]\nTom Selleck  (Actor),     F. Murray Abraham  (Actor),     Peter Yates  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Tom Selleck (THREE MEN AND A BABY) turns in a riveting performance as Jimmie Rainwood, an average citizen whose life becomes a living nightmare when he's framed by a pair of crooked cops and sent to prison for a crime he didn't commit. With his life torn apart, Rainwood swears revenge, vowing to fight back and deliver justice to the dishonest cops who set him up -- no matter what the price! Ultimately, Rainwood risks everything to recapture his normal life, and prove once and for all that he is an innocent man!\"]\n{'Format': 'NTSC, Color, DVD', 'Contributor': 'Tom Selleck, Larry Brothers, F. Murray Abraham, Bruce A. Young, David Rasche, Badja Djola, Todd Graff, Laila Robins, M.C. Gainey, Peter Yates, Peter Van Norden, Richard Young, Terry Golden, James T. MorrisTom Selleck, Larry Brothers, F. Murray Abraham, Bruce A. Young, David Rasche, Badja Djola, Todd Graff, Laila Robins, M.C. Gainey, Peter Yates, Peter Van Norden, Richard Young, Terry Golden, James T. Morris  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Director': 'Peter Yates', 'Media Format': 'NTSC, Color, DVD', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 8, 2003', 'Actors': 'Tom Selleck, F. Murray Abraham, Laila Robins, David Rasche, Richard Young', 'Studio': 'Walt Disney Video / Mill Creek', 'Writers': 'Larry Brothers', 'Number of discs': '1'}\nI do not watch R rated movies and didn't realize that when I ordered it so I gave it to my brother and he said it was a good movie.\nDidn't realize it was rated R.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mike Rohl'], 'Starring': [\"Brooke D'Orsay\", 'Marc Blucas'], 'Studio': ['Cinedigm']}\nThis movie had a great cast of actors. Miss Christmas has a beautiful way of expressing how one Christmas Tree had the ability to bring joy, hope,  togetherness, and love to so many people at the same time. The trees in the movie are so breathtakingly beautiful.\nI enjoyed the beautiful trees.\nHarvest Love\nJen Lilley  (Actor),     Ryan Paevey  (Actor),     Christie Will Wolf  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"A widowed surgeon visits her family's pear orchard in hopes of taking a break from her overbooked life and reconnecting with her distant son. She starts to fall for the farm manager, Will, who is growing a new hybrid pear and teaches her the importance of her heritage.\"]\n{'Genre': 'Drama, Television, DVD Movie, Blu-ray Movie', 'Format': 'NTSC, Subtitled', 'Contributor': 'Brenden Sunderland, Jen Lilley, Christie Will Wolf, Lincoln Lageson, Ryan Paevey', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'Christie Will Wolf', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 24 minutes', 'Release date': 'September 10, 2019', 'Actors': 'Jen Lilley, Ryan Paevey, Brenden Sunderland', 'Producers': 'Lincoln Lageson', 'Studio': 'Cinedigm', 'Number of discs': '1'}\nJen Lily and Ryan Peve are 2 of my favorite actors and the cemestry between the two of them makes this movie so believable. It also brings back special memories of the harvest times I shared with my family throughout my life. Truly beautiful story.\nI really enjoy this harvest time story.",
  "profile": "**User Summary (Updated):**\n\n- **Genre Preference:** The user's passion for emotionally rich narratives thrives in romantic dramas and adventure-driven science fiction. Their latest interactions highlight a strong affinity for storytelling that resonates personally, especially those that evoke cherished memories and familial connections.\n\n- **Media Format Preference:** The user maintains a preference for DVDs, which they find enhance their engagement with heartfelt narratives. This format is particularly enjoyable during festive seasons, aligning with their desire for stories that celebrate togetherness and meaningful experiences.\n\n- **Emotional Engagement:** They are consistently drawn to narratives exploring love, relationships, and personal growth. Their recent review emphasizes the emotional impact of family traditions and the beauty of heartfelt connections, reinforcing their dedication to uplifting storytelling.\n\n- **Critical Review Behavior:** Their reviews underscore emotional depth, character dynamics, and personal resonance. The user appreciates films that captivate through joy and nostalgia, valuing visual beauty and emotional richness in their critiques.\n\n- **Community Sharing:** The user actively shares insights on films that promote positive themes and personal connections, encouraging storytelling that inspires happiness and collective celebrations within their community.\n\nOverall, the user's profile reflects a steadfast commitment to narratives that evoke emotional resonance and uplift the spirit, particularly those that celebrate family's lasting influence and the joy of shared experiences.",
  "metrics": {
    "rouge1_f": 0.046269519953730485,
    "rouge2_f": 0.006171648987463838,
    "rougeL_f": 0.028147291305186044,
    "meteor": 0.012737773589707076,
    "bleu1": 4.923674888018114e-12,
    "bleu2": 1.8413895758569662e-12,
    "bleu3": 2.3978647606538517e-13,
    "bleu4": 8.661101506201119e-14,
    "bertscore_precision": 0.34102532267570496,
    "bertscore_recall": 0.5200420022010803,
    "bertscore_f1": 0.411924809217453
  }
}