{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: SECRET, THE: DARE TO DREAM BD + DGTL + ECOPY\nReview Date: 2021/03/20\nStore: Katie Holmes  (Actor),     Josh Lucas  (Actor),     Andy Tennant  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama, Romance', 'Format': 'NTSC, Subtitled, Digital_copy', 'Contributor': \"Sydney Tennant, Katie Holmes, Sarah Hoffmeister, Andy Tennant, Josh Lucas, Katrina Begin, Robert Cort, Rhonda Byrne, Aidan Brennan, Celia Weston, Matthew George, Joe Gelchion, Robert Katz, Jerry O'ConnellSydney Tennant, Katie Holmes, Sarah Hoffmeister, Andy Tennant, Josh Lucas, Katrina Begin, Robert Cort, Rhonda Byrne, Aidan Brennan, Celia Weston, Matthew George, Joe Gelchion, Robert Katz, Jerry O'Connell   See more\", 'Language': 'English', 'Runtime': '1 hour and 41 minutes'}\nReview Text: It's hard to find movies with a different story line, but SECRET, THE DARE TO DREAM, does this perfectly. It's entertaining and wholesome. A movie for the whole family. I think Katy Holmes and Josh Lucas nailed this one right on the nose.\nReview Title: A surprising family story.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Shadowlands\nAnthony Hopkins  (Actor),     Debra Winger  (Actor),     Richard Attenborough  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Amazon.com', 'This emotionally moving romantic drama was adapted by William Nicholson from his own acclaimed play, based upon the real-life romance (during the 1950s) between the British writer C.S. Lewis and a divorced American poet named Joy Gresham. Best known for writing', 'The Lion, The Witch, and The Wardrobe', \", Lewis (Anthony Hopkins) is living comfortably as a respected Oxford don, his academic lifestyle a kind of shell protecting him from the emotional risk of love. Joy Gresham (Debra Winger) arrives at Oxford as an avid admirer of Lewis's writing, and the safety of his collegiate routine is quickly disrupted when Lewis realizes that he's fallen deeply and unexpectedly in love. Their courtship is uniquely engaging; he's shy and uncertain, she's outspoken and bold. But when Joy is diagnosed with cancer, Lewis's Christian faith is put to the test--he cannot fathom why their happiness together would be so drastically challenged. Together, they find a way to accept and honor the time they have shared together, and under the sensitive direction of Richard Attenborough,\", 'Shadowlands', 'arrives at a conclusion that is both heartbreaking and uplifting at the same time. Hopkins and Winger are equally superb in this absorbing story of personal and spiritual transformation--a story previously filmed for British television in 1985, with Joss Ackland and Claire Bloom.', '--Jeff Shannon']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Richard Attenborough', 'Media Format': 'AC-3, Color, Dolby, DVD, Widescreen, NTSC, Letterboxed', 'Run time': '2 hours and 11 minutes', 'Release date': 'April 13, 1999', 'Actors': 'Anthony Hopkins, Debra Winger, Michael Denison, Andrew Seear, Tim McMullan', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 1.0), French (Dolby Digital 2.0 Surround)', 'Studio': 'Hbo Home Video', 'Number of discs': '1'}\nI thought I  was purchasing the full version of the movie on DVD, but got an edited version. This was a disappointment to me because I  saw the fill version at the theater many years ago when it was released. I also had the full (unedited) version on VHS, but can not view it because have no VHS player to view it from anymore.\nWish I'd known it was edited  (shorter) version.\nThe Space Between Us [DVD]\nGary Oldman  (Actor),     Asa Butterfield  (Actor),     Peter Chelsom  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"Sixteen-year-old Gardner Elliot (Asa Butterfield) has lived his whole life with a team of scientists on Mars. He's always longed to see Earth to find the father he's never known and to meet a beautiful street-smart girl named Tulsa he's become friends with online. But when his chance finally comes, doctors discover his heart can't withstand the Earth's atmosphere. Eager to find his father, Gardner and Tulsa escape on a cross-country race against time to unravel the mysteries of how he came to be and where he belongs in the universe. Gary Oldman and Carla Gugino also star in this heartfelt and inspiring romantic adventure about how far one person can go for love.\", 'Bonus Content:', 'Alternate Ending', 'Alternate Ending', 'Deleted Scenes', 'Deleted Scenes', 'Love Featurette', 'Love Featurette', 'Feature Commentary with Director Peter Chelsom', 'Feature Commentary with Director Peter Chelsom', ']]>']\n{'Genre': 'Drama, Art House & International, Action & Adventure', 'Format': 'Digital_copy, NTSC, Subtitled', 'Contributor': 'Britt Robertson, Gary Oldman, Carla Gugino, Asa Butterfield, Peter Chelsom, Allan Loeb, BD Wong, Richard B. LewisBritt Robertson, Gary Oldman, Carla Gugino, Asa Butterfield, Peter Chelsom, Allan Loeb, BD Wong, Richard B. Lewis   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Peter Chelsom', 'Media Format': 'Digital_copy, NTSC, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'May 16, 2017', 'Actors': 'Gary Oldman, Asa Butterfield, Carla Gugino, Britt Robertson, BD Wong', 'Subtitles': 'Spanish', 'Producers': 'Richard B. Lewis', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Allan Loeb', 'Number of discs': '1'}\nWhat an suprising and original movie. The concept of being on a planet in space and not knowing how a body functions so differently than being on earth. I loved this story so much and would like to see more like it made.\nDifferent, Believable, and totally Entertaining\nLetters to Juliet\nAmanda Seyfried  (Actor),     Gael García Bernal  (Actor),     Gary Winick  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'When a young American travels to the city of Verona, home of the star-crossed lover Juliet Capulet of Romeo and Juliet fame, she joins a group of volunteers who respond to letters to Juliet seeking advice about love. After answering one letter dated 1951, she inspires its author to travel to Italy in search of her long-lost love and sets off a chain of events that will bring a love into both their lives unlike anything they ever imagined.', 'Amazon.com', 'Letters to Juliet', 'succeeds in being just what it\\'s meant to be, a feel-good romantic comedy about love lost and love found, in which love triumphs in the face of cynicism. Inspired by the book of the same name, and filmed against the beautiful backdrop of Verona, Italy, the movie tells the story of how troubled young women seek advice from Shakespeare\\'s Juliet by leaving letters tacked to a wall, where they are carefully answered by Juliet\\'s self-appointed \"secretaries.\" One such note is found 50 years later by Sophie (Amanda Seyfried), a young American woman who is soon to be married and who yearns to become a writer. Her heartfelt answer to the letter serves as a catalyst for an epic romantic journey that will span continents and generations. The success of the film lies in the powerful interaction between the wistfully romantic and fully mature author of the letter, Claire (Vanessa Redgrave); the romantically idealistic Sophie; and Claire\\'s overly pragmatic, downright cynical grandson Charlie (Christopher Egan), who grudgingly accompanies his grandmother on what he deems an insane quest to Verona to find her long lost love, Lorenzo. The filmmakers, writers, and actors all capitalize well on the comic possibilities of the situation, and there are more than a few good chuckles to be had at the absurdity of the interactions between these three very different characters, as they experience everything from hope and longing to disappointment and unexpected fulfillment. In the end, each character grows and changes profoundly as a result of their shared journey. Sure, the events portrayed in the film are highly unrealistic, but that doesn\\'t change the fact that the film speaks to that innermost part of us all that, despite all logic, makes us want to believe that true love really does exist and that it just might triumph in the end.', '--Tami Horiuchi']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Amanda Seyfried, Gary Winick, Gael García Bernal', 'Language': 'Unqualified', 'Runtime': '1 hour and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.61 x 5.48 x 7.57 inches; 2.08 Ounces', 'Item model number': '6611462', 'Director': 'Gary Winick', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'September 14, 2010', 'Actors': 'Amanda Seyfried, Gael García Bernal', 'Subtitles': 'English', 'Studio': 'Summit Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI really liked Letters to Juilet. It was a fresh look at seeing what one kind deed, becoming involved in doing something nice for someone that you do not know can make a difference in their life. I loved the intrigue of the journey to find the one love, lost years earlier,  took 3 persons on a journey that changed each of their lives. It's a splendid love story. I have shared my DVD with several of my friends and family members and they all love the story as well.\nThat there is happiness where you least expect to find it. So never give up searching for it.\nSECRET, THE: DARE TO DREAM BD + DGTL + ECOPY\nKatie Holmes  (Actor),     Josh Lucas  (Actor),     Andy Tennant  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n{'Genre': 'Drama, Romance', 'Format': 'NTSC, Subtitled, Digital_copy', 'Contributor': \"Sydney Tennant, Katie Holmes, Sarah Hoffmeister, Andy Tennant, Josh Lucas, Katrina Begin, Robert Cort, Rhonda Byrne, Aidan Brennan, Celia Weston, Matthew George, Joe Gelchion, Robert Katz, Jerry O'ConnellSydney Tennant, Katie Holmes, Sarah Hoffmeister, Andy Tennant, Josh Lucas, Katrina Begin, Robert Cort, Rhonda Byrne, Aidan Brennan, Celia Weston, Matthew George, Joe Gelchion, Robert Katz, Jerry O'Connell   See more\", 'Language': 'English', 'Runtime': '1 hour and 41 minutes'}\nIt's hard to find movies with a different story line, but SECRET, THE DARE TO DREAM, does this perfectly. It's entertaining and wholesome. A movie for the whole family. I think Katy Holmes and Josh Lucas nailed this one right on the nose.\nA surprising family story.",
  "profile": "**User Summary:**\n\n- **Genre Preference:** The user exhibits a strong inclination towards emotionally impactful romantic dramas, especially those inspired by real-life stories or literary figures. Their growing interest in unique, adventure-driven science fiction narratives that weave romance is noteworthy.\n\n- **Media Format Preference:** While the user primarily favors DVD formats, their recent purchase of a Blu-ray indicates a willingness to explore high-definition options, provided they offer complete and unedited films, reinforcing their desire for immersive storytelling.\n\n- **Emotional Engagement:** The user seeks narratives that explore personal and spiritual themes, favoring content that entertains while inviting thought and emotional reflection. They appreciate original storytelling that presents fresh perspectives, as demonstrated by their recent review highlighting wholesome and transformative themes.\n\n- **Critical Review Behavior:** With a discerning eye, the user values imaginative plots and character development. They are particularly pleased with films that offer unexpected and original concepts, often sharing heartwarming stories that emphasize kindness and the power of love.\n\n- **Community Sharing:** Actively sharing media with friends and family, the user aims to spread joy through cinematic experiences that resonate with them, further underscoring their deep appreciation for compelling narratives.\n\nOverall, the user's profile reflects a clear preference for quality and emotional depth in their media consumption, alongside an openness to exploring new formats that enrich their viewing experience.",
  "metrics": {
    "rouge1_f": 0.12555555555555556,
    "rouge2_f": 0.017797552836484983,
    "rougeL_f": 0.06222222222222222,
    "meteor": 0.03868046580537187,
    "bleu1": 0.0004195540891626589,
    "bleu2": 0.00014720056099991994,
    "bleu3": 6.375972417605763e-05,
    "bleu4": 1.7946880443722507e-05,
    "bertscore_precision": 0.34263917803764343,
    "bertscore_recall": 0.4857744574546814,
    "bertscore_f1": 0.4018411934375763
  }
}