{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nReview Date: 2021/10/07\nStore: Auban\nProduct Description: ['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nReview Text: I found this very good for wearing around the house during the day but not so good for sleeping, this is because it did not stay on. It kept sliding off. It is good for hair because of the satin insert and I quite like it for this. Stitching was good, no issues there.\nReview Title: Sleep Bonnet\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Gel Nail Polish Kit with Gel Base and Top Coat, 12 Pcs All Seasons Skin Tones Pink Neutral Brown Gel Polish Kit, Soak Off LED Gel Nail Kit Manicure DIY Nail Art Home Salon\nBEUXITUN\n{'Brand': 'BEUXITUN', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '4.32 Fl Oz', 'Number of Items': '15', 'Liquid Volume': '0.33 Fluid Ounces', 'Package Dimensions': '8.5 x 4 x 3 inches; 1.35 Pounds'}\nThis is an ok gel polish. I got the gold and the silver and by themselves they don’t pop but I made a design with other colors and it looked good. It takes a few more dries under the light to cure. One bottle did come with the label upside down. It’s inexpensive and kinda feels it.\nOk\nLenaqueen Wig Caps for Making Wigs Open Wig Caps with PVC Paper for DIY Wigs Swiss Lace Wig Cap with Adjustable Strap for Weave Wig (Medium, Black)\nLenaqueen\n{'Product Dimensions': '2.36 x 1.18 x 0.39 inches; 0.42 Ounces', 'Item model number': 'LNWIGCAP'}\nThis is a good quality wig cap that comes with 3 combs. It’s easy to fit on to the head and it feels comfortable. I plan to use this to make a weave and think it’s good quality for that.\nGood quality\nLenaqueen Velvet Wig Grip Band Adjustable No Slip Wig Grip Headbands for Women Keep Wigs in Place Grip Wig Bands (Black)\nLenaqueen\n{'Material': 'Velvet', 'Fabric Type': 'Velvet', 'Brand': 'Lenaqueen', 'Product Dimensions': '2.36 x 1.18 x 0.39 inches; 0.32 Ounces'}\nI’m new to wig grips but I really like them. I use this one on my headband wig in order to keep it from shifting on my head. It’s easy to put on and does not add a bulge to the wig.\nWig grip\nO.M.CHIC Mannequin Head with shoulders for wig, Display wigs Eyeglasses Necklaces and Earrings\nO.M.CHIC\n{'Package Dimensions': '18.3 x 15.7 x 9 inches; 5.1 Pounds', 'UPC': '714676502699 714676502675'}\nI really like this mannequin. It’s different to others that I’ve had. It is able to stand alone without the use of a tripod thanks to its base. Her make up is great for accentuating wigs or jewelry I want to display for sale. Her lips give a bit of attitude which I like. It’s good quality and I think well price.\nExcellent quality\n8 Color Colored Liquid Eyeliner Colorful Pen Set,Neon Green Purple White Blue Black Rainbow Colorful Matte Liquid Eyeliner Set Eye Liners for Women Waterproof Pencil delineadores de colores para ojos\nevpct\n{'Product Dimensions': '6.85 x 5.28 x 0.63 inches; 4.66 Ounces'}\n8 different colors and they are all amazing. My first time with different color eyeliners and I really like them. It’s waterproof and lasts a hood few hours. I unintentionally fell i asleep in the blue and it was a mess the day after but that’s to be expected. I wore to work (in a kitchen/chef duties) and it lasted, so it pretty good in my books.\nGreat combination and a fantastic price\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nAuban\n['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\n{'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nI found this very good for wearing around the house during the day but not so good for sleeping, this is because it did not stay on. It kept sliding off. It is good for hair because of the satin insert and I quite like it for this. Stitching was good, no issues there.\nSleep Bonnet",
  "profile": "**User Summary**\n\n- **Product Preference:** The user demonstrates a strong passion for DIY beauty projects, particularly in gel nail care, wig-making, and now exploring colorful eyeliners. Their recent purchase of a satin sleep bonnet indicates an interest in hair care accessories, reflecting a holistic approach to beauty routines.\n\n- **Quality Expectations:** The user maintains a clear preference for non-toxic and cruelty-free products, with a focus on those that prioritize hair health. Their balanced review indicates a commitment to quality while recognizing the need for practicality in their beauty items.\n\n- **Aesthetics:** The user appreciates high-quality accessories that serve both functional and aesthetic purposes, shown through their interest in vibrant makeup and a stylish sleep bonnet. Their choices reflect a blend of fashion and utility in beauty products.\n\n- **Performance Concerns:** The user values ease of use and performance, as evident in their feedback highlighting both the positive aspects and limitations of products. Their recent experience with the sleep bonnet, particularly regarding fit during sleep, underscores their focus on seamless beauty experiences.\n\n- **Pricing Sensitivity:** The user is budget-conscious, seeking quality items at reasonable prices. Their assessments highlight satisfaction with the value provided, indicating a discerning approach to spending.\n\n- **Rating Behavior:** The user provides nuanced reviews, addressing both strengths and weaknesses. This thoughtful evaluation showcases their experienced perspective on beauty products, reinforcing their desire for reliable and effective solutions.\n\nOverall, the user seeks versatile, ethical, and aesthetically pleasing beauty products while maintaining high standards for performance and value across their beauty journey.",
  "metrics": {
    "rouge1_f": 0.2011834319526627,
    "rouge2_f": 0.023715415019762848,
    "rougeL_f": 0.08284023668639053,
    "meteor": 0.08519249159887926,
    "bleu1": 0.04821308813356099,
    "bleu2": 0.011435078199709589,
    "bleu3": 0.0018099860264872499,
    "bleu4": 0.0007206770621470561,
    "bertscore_precision": 0.37780773639678955,
    "bertscore_recall": 0.4630662202835083,
    "bertscore_f1": 0.4161146879196167
  }
}