{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/08/13\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Livingston', 'Allan Kroeker', 'Michael Vejar', 'Roxann Dawson', 'David Straiton', 'LeVar Burton', 'James L. Conway', 'James A. Contner', 'Robert Duncan McNeill', 'Michael Grossman'], 'Producers': ['Brannon Braga'], 'Starring': ['Scott Bakula', 'Jolene Blalock', 'John Billingsley']}\nReview Text: I have to admit it: I'm a Trekkie. I very much enjoy the Original Series, the Next Generation, and Deep Space Nine. I even enjoy reading the novels. However, the Star Trek universe began to sour for me with the arrival of Captain Janeway and the Vulcan who wouldn't stop frowning. I stopped watching Voyager at all in the later seasons and even chose to ignore the series finale entirely. So I had high hopes when Enterprise came out. Those hopes soon tanked, though, starting with the opening credits. Years later, I decided to give this series a second try, seeing as I enjoy most of the other series so much. I came to like the song used for the opening credits in the first two seasons. However, with the exception of a couple of characters, I found most of the people in this cast either thoroughly unlikable or barely developed. Captain Archer struck me as uppity and self-righteous in most episodes in the first couple of seasons, so much so that I sometimes couldn't bear to watch an episode all the way to the end. Then, especially starting in Season 3, he was always angry; he even spoke gruffly to his cute little dog, Porthos, for cryin' out loud. Hoshi Sato seems to me like a whiny brat who has no business on a starship. Poor Mayweather had little or no substance to him at all. Several episodes seemed to have no point, like &#34;Shuttlepod One&#34; and &#34;Two Days and Two Nights&#34; in Season 1. And for anyone concerned with continuity in the Star Trek universe, this series dashes all that to pieces, complete with an appearance by the Ferengi in Season 1 and one by the Borg in Season 2.<br /><br />Variations of Star Trek were on the small screen for fourteen years straight before this series came along and killed the TV franchise dead. It's that bad. I'm convinced it only survived four seasons because of Trekkies who would support any and all things Trek, regardless of the quality (or lack thereof). I hope Enterprise isn't the end of Star Trek on the small screen, but I hope just as fervently that Enterprise's show runners--Berman and Braga--aren't allowed anywhere near the next one.\nReview Title: The Series that Killed Star Trek on the Small Screen\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Livingston', 'Allan Kroeker', 'Michael Vejar', 'Roxann Dawson', 'David Straiton', 'LeVar Burton', 'James L. Conway', 'James A. Contner', 'Robert Duncan McNeill', 'Michael Grossman'], 'Producers': ['Brannon Braga'], 'Starring': ['Scott Bakula', 'Jolene Blalock', 'John Billingsley']}\nI have to admit it: I'm a Trekkie. I very much enjoy the Original Series, the Next Generation, and Deep Space Nine. I even enjoy reading the novels. However, the Star Trek universe began to sour for me with the arrival of Captain Janeway and the Vulcan who wouldn't stop frowning. I stopped watching Voyager at all in the later seasons and even chose to ignore the series finale entirely. So I had high hopes when Enterprise came out. Those hopes soon tanked, though, starting with the opening credits. Years later, I decided to give this series a second try, seeing as I enjoy most of the other series so much. I came to like the song used for the opening credits in the first two seasons. However, with the exception of a couple of characters, I found most of the people in this cast either thoroughly unlikable or barely developed. Captain Archer struck me as uppity and self-righteous in most episodes in the first couple of seasons, so much so that I sometimes couldn't bear to watch an episode all the way to the end. Then, especially starting in Season 3, he was always angry; he even spoke gruffly to his cute little dog, Porthos, for cryin' out loud. Hoshi Sato seems to me like a whiny brat who has no business on a starship. Poor Mayweather had little or no substance to him at all. Several episodes seemed to have no point, like &#34;Shuttlepod One&#34; and &#34;Two Days and Two Nights&#34; in Season 1. And for anyone concerned with continuity in the Star Trek universe, this series dashes all that to pieces, complete with an appearance by the Ferengi in Season 1 and one by the Borg in Season 2.<br /><br />Variations of Star Trek were on the small screen for fourteen years straight before this series came along and killed the TV franchise dead. It's that bad. I'm convinced it only survived four seasons because of Trekkies who would support any and all things Trek, regardless of the quality (or lack thereof). I hope Enterprise isn't the end of Star Trek on the small screen, but I hope just as fervently that Enterprise's show runners--Berman and Braga--aren't allowed anywhere near the next one.\nThe Series that Killed Star Trek on the Small Screen",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest:** Strong inclination toward the Star Trek franchise, with a preference for the Original Series, Next Generation, and Deep Space Nine.\n- **Content Engagement:** Enjoys watching series and reading related novels; has emotional investment in character development and continuity within the Star Trek universe.\n- **Critical Perspective:** Exhibits a discerning taste, particularly critical of elements that disrupt narrative coherence or character depth, especially within the Enterprise series.\n- **Review Tendencies:** Willing to provide candid, detailed critiques of series, indicating disappointment can stem from character portrayal, story quality, and production choices.\n- **Franchise Loyalty:** Despite criticisms, maintains a hope for the future of the Star Trek franchise but is opposed to the involvement of certain producers in future projects.\n- **Viewing Preferences:** Prefers character-driven storytelling over superficial or poorly-developed narratives; values continuity and contributes to overall enjoyment of series.\n\nOverall, the user demonstrates a deeply rooted passion for Star Trek while expressing frustrations with specific titles and creative decisions within the franchise, reflecting a sophisticated understanding of storytelling and character dynamics.",
  "metrics": {
    "rouge1_f": 0.2479608482871125,
    "rouge2_f": 0.055646481178396066,
    "rougeL_f": 0.1468189233278956,
    "meteor": 0.11551589283526674,
    "bleu1": 0.1036006908957989,
    "bleu2": 0.05004388809788467,
    "bleu3": 0.030751495617063095,
    "bleu4": 0.021553873993205953,
    "bertscore_precision": 0.3923681080341339,
    "bertscore_recall": 0.48239463567733765,
    "bertscore_f1": 0.43274879455566406
  }
}