{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/08/31\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['James Gunn'], 'Producers': ['Kevin Feige'], 'Starring': ['Chris Pratt', 'Bradley Cooper', 'Vin Diesel']}\nReview Text: Not all of the jokes land, but enough of them do. This is a fun and colorful ride that gets richer with repeat viewings, which give you a chance to catch facial expressions or even musical cues that you might well miss if you only watch it once. I actually liked this movie better than I liked the first, which I found to be darker in tone. I don't think there's another series in the MCU with quite the same feel to it, although it seems like Thor: Ragnorok is leaning toward the same flavor--fun and colorful. I rented GotG Vol. 2 and liked it so much that I bought it. I'm looking forward to seeing the Guardians again in Avengers: Infinity War.\nReview Title: A Fun Ride\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Livingston', 'Allan Kroeker', 'Michael Vejar', 'Roxann Dawson', 'David Straiton', 'LeVar Burton', 'James L. Conway', 'James A. Contner', 'Robert Duncan McNeill', 'Michael Grossman'], 'Producers': ['Brannon Braga'], 'Starring': ['Scott Bakula', 'Jolene Blalock', 'John Billingsley']}\nI have to admit it: I'm a Trekkie. I very much enjoy the Original Series, the Next Generation, and Deep Space Nine. I even enjoy reading the novels. However, the Star Trek universe began to sour for me with the arrival of Captain Janeway and the Vulcan who wouldn't stop frowning. I stopped watching Voyager at all in the later seasons and even chose to ignore the series finale entirely. So I had high hopes when Enterprise came out. Those hopes soon tanked, though, starting with the opening credits. Years later, I decided to give this series a second try, seeing as I enjoy most of the other series so much. I came to like the song used for the opening credits in the first two seasons. However, with the exception of a couple of characters, I found most of the people in this cast either thoroughly unlikable or barely developed. Captain Archer struck me as uppity and self-righteous in most episodes in the first couple of seasons, so much so that I sometimes couldn't bear to watch an episode all the way to the end. Then, especially starting in Season 3, he was always angry; he even spoke gruffly to his cute little dog, Porthos, for cryin' out loud. Hoshi Sato seems to me like a whiny brat who has no business on a starship. Poor Mayweather had little or no substance to him at all. Several episodes seemed to have no point, like &#34;Shuttlepod One&#34; and &#34;Two Days and Two Nights&#34; in Season 1. And for anyone concerned with continuity in the Star Trek universe, this series dashes all that to pieces, complete with an appearance by the Ferengi in Season 1 and one by the Borg in Season 2.<br /><br />Variations of Star Trek were on the small screen for fourteen years straight before this series came along and killed the TV franchise dead. It's that bad. I'm convinced it only survived four seasons because of Trekkies who would support any and all things Trek, regardless of the quality (or lack thereof). I hope Enterprise isn't the end of Star Trek on the small screen, but I hope just as fervently that Enterprise's show runners--Berman and Braga--aren't allowed anywhere near the next one.\nThe Series that Killed Star Trek on the Small Screen\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Reinhard Klooss'], 'Producers': ['Reinhard Klooss', 'Robert Kulzer', 'Martin Moszkowicz', 'Bernhard Thur'], 'Starring': ['Kellan Lutz', 'Spencer Locke', 'Jaime Ray Newman'], 'Studio': ['Lionsgate']}\nThe animation was pretty good, and so was the story--right up until the end. A very unsatisfactory conclusion that defies logic. I liked that Tarzan communicated mostly by grunting and that the animals didn't talk. If I could, I would give it 2.5 stars, but it's either 3 or 2 stars, and I didn't completely dislike it, so 3 stars it is.<br /><br />SPOILERS<br />Tarzan's vocabulary seemed to make quite a leap when he was reintroduced to other people. The bad guy's assistant was a walking cliche. Even though there is a narrator for most of the movie, any explanation of how the meteorite changed the plants an animals within its realm of influence is glossed over. There is also little rhyme or reason to the disturbances caused by interfering with the meteorite. If the bad guy sent an entire army of people into the heart of the jungle who were presumably killed near the conclusion of the story, why would Jane assume she and Tarzan would now be left in peace? All those people had to have loved ones who would want a search and rescue mission launched, meaning even more people would come to their little piece of paradise. And Jane's father with his piece of rock just happened to escape the catastrophe unscathed in order to do--what exactly?\nPretty Good Animation and Characterization, Spoiled by Gaps in Logic\nFerris Bueller's Day Off\nComedy, Joyous, Outlandish, Playful\n['A high schooler is determined to have a day off from school.']\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Hughes'], 'Producers': ['John Hughes'], 'Starring': ['Matthew Broderick', 'Alan Ruck', 'Mia Sara']}\nWhen I was a kid, I loved this movie. Now that I'm older, Ferris comes off as being almost as big a jerk as his principal. Meanwhile, I still love E.T.\nWhat Did I Ever See In This Movie?\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'David Morrissey', 'Michelle Ryan'], 'Studio': ['BBC America']}\nWhen I watched the first episode of Doctor Who following David Tennant's departure, I was all set to view the next guy as a miserable excuse for a Doctor. Matt Smith charms from the very beginning, though, starting with his demands of various food items from a young Amelia Pond. Looking back, I'd have to say that Donna Noble is my favorite companion for the simple reason that she was just that--a companion--never once flirting with the Doctor. Also, for someone who thought very little of herself, Donna was pretty smart. Amy gets on my nerves a lot in Series Five, repeatedly taking stupid risks that turn out all right only because she's a character on a TV show. Having Rory around somehow improves things. I'm glad he joins the adventures full time in the sixth series. I also think Steve Moffat and his team made great improvements on the show's score/soundtrack. I had been watching nuWho from the beginning, but never wanted to own a piece of music from the show until Series 5, with the debut of &#34;I Am the Doctor&#34; (&#34;Onwards&#34; is a much shorter form of this piece).<br /><br />Geronimo!!\nBravo, Matt Smith\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'Catherine Tate', 'Freema Agyeman'], 'Studio': ['BBC America']}\nDonna Noble is, by far, my favorite companion of all the nuWho companions simply because she wanted to see all of time and space with the Doctor, not make out or sleep with him. Catherine Tate, imo, captures a great range of emotion during her run; I think I laughed the most while Donna accompanied the Doctor. But she did grief and indignation very well too. My only complaint, though, is the way Donna is set up to be this all-important figure throughout the multiverse. As far as I know, this is the first time one of the companions is given such a role, and it sets an annoying precedent that is repeated with Clara Oswald. Why can't companions just be ordinary people banging around space and time with the Doctor? Why must they be pivotal to the survival of the universe or the survival of the Doctor? On the whole, I enjoyed the Doctor Donna, and I hope we see more companions like her in attitude in the future.\nTennant and Tate Make a Great Team\nThe Martian\nScience Fiction, Drama, Anxious, Biting\n['From legendary director Ridley Scott (Alien, Prometheus) comes a gripping tale of human strength and the will to survive, starring Matt Damon as an astronaut stranded on Mars.']\n{'Content advisory': ['Nudity', 'violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ridley Scott'], 'Producers': ['Simon Kinberg', 'Ridley Scott', 'Michael Schaeffer', 'Aditya Sood', 'Mark Huffam'], 'Starring': ['Matt Damon', 'Jessica Chastain', 'Kristen Wiig']}\nA review on one site calls this flick &#34;Human Ingenuity: The Movie.&#34; Meh. I think &#34;Cast Away&#34; did that much better. I did not read the book on which this movie was based or read any reviews (critical or otherwise) before I watched &#34;The Martian&#34;. All I had seen was the trailer, and all I knew was that people seemed to love it and praise it to high heaven. So I eagerly anticipated enjoying the movie myself. Man, was this a letdown!<br /><br />Thin or nonexistent characterizations, too many superfluous characters (many of them flat), too much talking, too much switching between sets of characters. I think Jeff Daniels must have gotten botox injections before his scenes, because his face barely moved the entire movie. At one point two characters spend at least a minute debating the tone in which Matt Damon's character had written something along the lines of &#34;Are you kidding me?&#34; I'm serious. That conversation actually took place in the movie.<br /><br />Character A: 'Do you think he meant, &#34;Are you kidding me?&#34; Or was it more like &#34;Are you kidding me?!&#34;'<br />Character B: 'I think it was the first one.'<br /><br />I'm not watching this scene as I type this, so I can't be totally sure that's what they said, but it's close. And it didn't end there! They continued to discuss the possible tone of the message! Are YOU kidding me, movie? Stop wasting my time! This asinine conversation does NOT qualify as humor! The movie bored me and had zero emotional punch. I agree with others who have mentioned how predictable this was, too. That means zero tension, zero suspense, which translates to zero enjoyment. It was pretty, with mostly good SFX; that's IT. I might have found the movie more fascinating if the tagline (and outcome) had been &#34;Left to Die&#34; instead of &#34;Bring Him Home&#34; and the movie was about the recovery of Watney's body and cheery, yet resolute video logs (I dislike the non-word &#34;vlogs&#34;) and not the rescue of Watney himself. I didn't even like the guy.<br /><br />If you find profanity distasteful like I do, you'll be annoyed early and often. You get two f-bombs within the first half hour or so of the movie and more f-bombs are implied later. For me, this did nothing to make Matt Damon's character either sympathetic or heroic. On the back end of the movie, you get a gratuitous, yet creepy CGI visual of Matt Damon's naked back and backside as he walks away from a shower. I'm pretty sure I would have been able to tell that the character had lost a lot of weight without seeing &#34;him&#34; naked. And by &#34;him&#34;, I mean the CGI body they pasted onto the Matt Damon's head. It looked weird and slimy, probably because of the unnatural way it moved. Yuck.<br /><br />I feel I wasted my time and money on this movie. Maybe I can spare someone else.\n\"Cast Away\" Covered This Theme Much, Much Better\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Peyton Reed'], 'Producers': ['Kevin Feige'], 'Starring': ['Paul Rudd', 'Michael Douglas', 'Evangeline Lilly']}\nMaybe because this movie focused more on character development and less on fireworks and maybe because of the humor threaded throughout, I very much enjoyed this movie. I can only echo what others have said, which is that this movie is lots of fun. Marvel movies in general tend to be laced with humor, but this movie is funnier than all of them, I think. I rented it and watched it several times within my 24-hour window, and I was tickled and entertained every time.\nMore Laughs Than Your Average \"Disney\" Marvel Movie--And That's Saying Something\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Reed', 'Marc Jobst', 'Sarah Harding'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Kate McKerrell', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nI very much enjoy this show, but this version of Season 1 has something missing. Can you guess what? Have you ever wondered how Inspector Lewis and Detective Hathaway met, or wanted to see their first case together? I did. I came back to Season 1 a second time to see if I missed that episode, but it seemed from the listing that &#34;Whom the Gods Would Destroy&#34; was their first outing as the follow-up team to Morse and Lewis. Imagine my surprise to discover that there is a pilot episode (or movie), called &#34;Reputation&#34;. Granted, it aired two years before Season 1, but Amazon Prime Video gives no indication that it even exists. It isn't even possible to rent or buy this first movie in which, yes, you actually get to see Lewis and Hathaway meet and work their first case together. This unforgivable omission is the reason I'm docking Season 1 by two stars.\nPut the Pilot on Amazon Prime Video (Even to Rent) to Get My Five Star Rating\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Justin Lin'], 'Producers': ['J. J. Abrams', 'Roberto Orci', 'Lindsey Weber', 'Justin Lin', 'Jeffrey Chernov', 'David Ellison', 'Dana Goldberg', 'Tommy Harper'], 'Starring': ['Chris Pine', 'Zachary Quinto', 'Karl Urban'], 'Studio': ['Hit Movies']}\nThis is the first Star Trek movie I have really enjoyed since &#34;First Contact&#34;. There was action and humor, a completely new storyline and villain, and a good ending in which the villain is undone by his own wickedness. I could detail why I didn't like &#34;Insurrection&#34;, &#34;Nemesis&#34; and the first two Abramsverse films, but that's neither here nor there. I rented this film on Amazon, but I think I'd like to own it.\nFirst Star Trek Since \"First Contact\" to Leave Me Happy\nMegamind\nWill Ferrell  (Actor),     Brad Pitt  (Actor),     Tom McGrath  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n[\"“A smart, funny and original treat,” Michael O'Sullivan, The Washington Post, Megamind puts a whole new hilarious twist on the superhero movie. Packed with high-flying action and non-stop laughs, the smash hit starring Will Ferrell, Brad Pitt, David Cross and Tina Fey will debut in DreamWorks Animation’s Blu-ray + DVD Combo Pack which includes the all-new comedy-adventure MEGAMIND: THE BUTTON OF DOOM, plus hours of bonus features and exclusive interactive Blu-ray features including picture-in-picture storyboards, behind the scenes footage, interviews, music videos, the lost scene, a comic book creator, an insider tour of Megamind’s Lair, interactive games, and so much more.\", 'MEGAMIND: THE BUTTON OF DOOM', 'An all-new MEGA adventure! For their first day on the job as the new protectors of Metro City, Megamind (Will Ferrell) and Minion (David Cross) are selling off the gadgets from their evil lair. But when one seemingly harmless “button” unleashes the gigantic robot MEGA-MEGAmind, the duo will have to resort to their old tricks to restore order in this all-new action-comedy from DreamWorks Animation.']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': '097361246642', 'Director': 'Tom McGrath', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 5, 2010', 'Actors': 'Will Ferrell, Brad Pitt', 'Dubbed': 'Spanish, French, Portuguese', 'Subtitles': 'English, Portuguese, French, Spanish', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '2'}\nI bought &#34;Megamind&#34; on DVD on Amazon.com previously, and was VERY disappointed to receive only a disc in a clear purple CD case! What?!<br /><br />Not this time. Somehow my previously purchased DVD got scratched and I could no longer play it, so I bought this two-disc combo at a very reasonable price. The discs came in the case you see on the product page and both were in pristine condition. Yes!\nFist Pump!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Watts'], 'Producers': ['Kevin Feige', 'Amy Pascal'], 'Starring': ['Tom Holland', 'Michael Keaton', 'Robert Downey Jr.'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nI love Spider-Man, but I HATED this movie--and I have seen all six of them. I grew up reading Spider-Man comics, and as far as I am concerned, Spider-Man 2 from Sam Raimi remains the best film depiction that exists.<br /><br />****SPOILERS FOLLOW***<br />I found this movie to be aggressively stupid, from the best friend (who, despite being a nerd, has apparently never read a comic book or seen a superhero movie and encourages Peter to tell everyone he is Spider-Man to win cool points with classmates) to the AI housed in his fancy suit (telling him to kiss the girl he likes right after he has saved her, while she is surrounded by people). The AI even tells Peter that she would want to be with him if she were a person. What?!<br /><br />I have no intention of ever paying to watch another Spider-Man film in this vein again--sorry, Tom Holland, but no, and no to Marisa Tomei, and no to Happy Hogan and Tony messing with Peter's head or ignoring him instead of helping him out. This Spider-Man is most definitely not my Spider-Man.\nNot My Spider-Man\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['James Gunn'], 'Producers': ['Kevin Feige'], 'Starring': ['Chris Pratt', 'Bradley Cooper', 'Vin Diesel']}\nNot all of the jokes land, but enough of them do. This is a fun and colorful ride that gets richer with repeat viewings, which give you a chance to catch facial expressions or even musical cues that you might well miss if you only watch it once. I actually liked this movie better than I liked the first, which I found to be darker in tone. I don't think there's another series in the MCU with quite the same feel to it, although it seems like Thor: Ragnorok is leaning toward the same flavor--fun and colorful. I rented GotG Vol. 2 and liked it so much that I bought it. I'm looking forward to seeing the Guardians again in Avengers: Infinity War.\nA Fun Ride",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interests:** The user has a strong passion for the Star Trek franchise, particularly the Original Series, Next Generation, and Deep Space Nine, alongside a fondness for Doctor Who, emphasizing character-driven narratives. They also enjoy other franchises that blend humor and emotional depth.\n\n- **Content Engagement:** They favor series and novels that excel in character development and narrative depth, expressing discontent with superficial storytelling. Their recent interaction indicates an appreciation for fun, colorful narratives that benefit from repeat viewings, highlighting their enjoyment of well-crafted humor.\n\n- **Critical Perspective:** The user exhibits discerning tastes, prioritizing narrative coherence, authentic character motivations, and genuine interactions. They advocate for relatable experiences, maintaining high standards across various franchises.\n\n- **Review Tendencies:** They articulate critiques focused on narrative completeness and character depth. Recently, they rated a film positively, acknowledging its humor and rich visual experience while still noting that not all jokes land, showcasing their balanced perspective.\n\n- **Franchise Loyalty:** Despite ongoing concerns about certain producers, they remain hopeful for the future of Star Trek and acknowledge improvements in Doctor Who’s narrative quality.\n\n- **Viewing Preferences:** They emphasize logical consistency, high production quality, and well-developed character dynamics, advocating for authentic storytelling that merges humor with emotional resonance.\n\nOverall, the user is a dedicated science fiction and animation enthusiast continually seeking media that embodies depth, humor, and narrative integrity, underscoring their commitment to quality content across various genres.",
  "metrics": {
    "rouge1_f": 0.08047337278106509,
    "rouge2_f": 0.013025458851391355,
    "rougeL_f": 0.037278106508875745,
    "meteor": 0.026761378828408438,
    "bleu1": 9.294857534141302e-07,
    "bleu2": 4.4240434650776764e-07,
    "bleu3": 2.420229390785614e-07,
    "bleu4": 1.4393912452385306e-07,
    "bertscore_precision": 0.368741512298584,
    "bertscore_recall": 0.5254563093185425,
    "bertscore_f1": 0.43336617946624756
  }
}