{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/05/06\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'David Morrissey', 'Michelle Ryan'], 'Studio': ['BBC America']}\nReview Text: When I watched the first episode of Doctor Who following David Tennant's departure, I was all set to view the next guy as a miserable excuse for a Doctor. Matt Smith charms from the very beginning, though, starting with his demands of various food items from a young Amelia Pond. Looking back, I'd have to say that Donna Noble is my favorite companion for the simple reason that she was just that--a companion--never once flirting with the Doctor. Also, for someone who thought very little of herself, Donna was pretty smart. Amy gets on my nerves a lot in Series Five, repeatedly taking stupid risks that turn out all right only because she's a character on a TV show. Having Rory around somehow improves things. I'm glad he joins the adventures full time in the sixth series. I also think Steve Moffat and his team made great improvements on the show's score/soundtrack. I had been watching nuWho from the beginning, but never wanted to own a piece of music from the show until Series 5, with the debut of &#34;I Am the Doctor&#34; (&#34;Onwards&#34; is a much shorter form of this piece).<br /><br />Geronimo!!\nReview Title: Bravo, Matt Smith\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Livingston', 'Allan Kroeker', 'Michael Vejar', 'Roxann Dawson', 'David Straiton', 'LeVar Burton', 'James L. Conway', 'James A. Contner', 'Robert Duncan McNeill', 'Michael Grossman'], 'Producers': ['Brannon Braga'], 'Starring': ['Scott Bakula', 'Jolene Blalock', 'John Billingsley']}\nI have to admit it: I'm a Trekkie. I very much enjoy the Original Series, the Next Generation, and Deep Space Nine. I even enjoy reading the novels. However, the Star Trek universe began to sour for me with the arrival of Captain Janeway and the Vulcan who wouldn't stop frowning. I stopped watching Voyager at all in the later seasons and even chose to ignore the series finale entirely. So I had high hopes when Enterprise came out. Those hopes soon tanked, though, starting with the opening credits. Years later, I decided to give this series a second try, seeing as I enjoy most of the other series so much. I came to like the song used for the opening credits in the first two seasons. However, with the exception of a couple of characters, I found most of the people in this cast either thoroughly unlikable or barely developed. Captain Archer struck me as uppity and self-righteous in most episodes in the first couple of seasons, so much so that I sometimes couldn't bear to watch an episode all the way to the end. Then, especially starting in Season 3, he was always angry; he even spoke gruffly to his cute little dog, Porthos, for cryin' out loud. Hoshi Sato seems to me like a whiny brat who has no business on a starship. Poor Mayweather had little or no substance to him at all. Several episodes seemed to have no point, like &#34;Shuttlepod One&#34; and &#34;Two Days and Two Nights&#34; in Season 1. And for anyone concerned with continuity in the Star Trek universe, this series dashes all that to pieces, complete with an appearance by the Ferengi in Season 1 and one by the Borg in Season 2.<br /><br />Variations of Star Trek were on the small screen for fourteen years straight before this series came along and killed the TV franchise dead. It's that bad. I'm convinced it only survived four seasons because of Trekkies who would support any and all things Trek, regardless of the quality (or lack thereof). I hope Enterprise isn't the end of Star Trek on the small screen, but I hope just as fervently that Enterprise's show runners--Berman and Braga--aren't allowed anywhere near the next one.\nThe Series that Killed Star Trek on the Small Screen\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Reinhard Klooss'], 'Producers': ['Reinhard Klooss', 'Robert Kulzer', 'Martin Moszkowicz', 'Bernhard Thur'], 'Starring': ['Kellan Lutz', 'Spencer Locke', 'Jaime Ray Newman'], 'Studio': ['Lionsgate']}\nThe animation was pretty good, and so was the story--right up until the end. A very unsatisfactory conclusion that defies logic. I liked that Tarzan communicated mostly by grunting and that the animals didn't talk. If I could, I would give it 2.5 stars, but it's either 3 or 2 stars, and I didn't completely dislike it, so 3 stars it is.<br /><br />SPOILERS<br />Tarzan's vocabulary seemed to make quite a leap when he was reintroduced to other people. The bad guy's assistant was a walking cliche. Even though there is a narrator for most of the movie, any explanation of how the meteorite changed the plants an animals within its realm of influence is glossed over. There is also little rhyme or reason to the disturbances caused by interfering with the meteorite. If the bad guy sent an entire army of people into the heart of the jungle who were presumably killed near the conclusion of the story, why would Jane assume she and Tarzan would now be left in peace? All those people had to have loved ones who would want a search and rescue mission launched, meaning even more people would come to their little piece of paradise. And Jane's father with his piece of rock just happened to escape the catastrophe unscathed in order to do--what exactly?\nPretty Good Animation and Characterization, Spoiled by Gaps in Logic\nFerris Bueller's Day Off\nComedy, Joyous, Outlandish, Playful\n['A high schooler is determined to have a day off from school.']\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Hughes'], 'Producers': ['John Hughes'], 'Starring': ['Matthew Broderick', 'Alan Ruck', 'Mia Sara']}\nWhen I was a kid, I loved this movie. Now that I'm older, Ferris comes off as being almost as big a jerk as his principal. Meanwhile, I still love E.T.\nWhat Did I Ever See In This Movie?\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'David Morrissey', 'Michelle Ryan'], 'Studio': ['BBC America']}\nWhen I watched the first episode of Doctor Who following David Tennant's departure, I was all set to view the next guy as a miserable excuse for a Doctor. Matt Smith charms from the very beginning, though, starting with his demands of various food items from a young Amelia Pond. Looking back, I'd have to say that Donna Noble is my favorite companion for the simple reason that she was just that--a companion--never once flirting with the Doctor. Also, for someone who thought very little of herself, Donna was pretty smart. Amy gets on my nerves a lot in Series Five, repeatedly taking stupid risks that turn out all right only because she's a character on a TV show. Having Rory around somehow improves things. I'm glad he joins the adventures full time in the sixth series. I also think Steve Moffat and his team made great improvements on the show's score/soundtrack. I had been watching nuWho from the beginning, but never wanted to own a piece of music from the show until Series 5, with the debut of &#34;I Am the Doctor&#34; (&#34;Onwards&#34; is a much shorter form of this piece).<br /><br />Geronimo!!\nBravo, Matt Smith",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest:** Strong inclination toward the Star Trek franchise, particularly the Original Series, Next Generation, and Deep Space Nine. Recently expressed interest in Doctor Who, especially regarding the portrayal of its characters.\n- **Content Engagement:** Enjoys watching series and reading related novels; invested in character development and continuity within narratives.\n- **Critical Perspective:** Exhibits discerning taste, particularly critical of narrative coherence and character depth, a viewpoint that extends beyond Star Trek to other media, including Doctor Who. Demonstrated a thoughtful examination of character dynamics, favoring the intelligence and non-romantic nature of certain companions.\n- **Review Tendencies:** Willing to provide candid critiques, with recent dissatisfaction stemming from logical inconsistencies and character motivations across various titles. Exhibited a shift in perception towards past films, indicating a growing critical lens on youthful favorites.\n- **Franchise Loyalty:** Maintains hope for the future of the Star Trek franchise while opposing certain producers' involvement in new projects. Similarly, appreciates character-driven storytelling in Doctor Who and recognizes improvements in storytelling elements over time.\n- **Viewing Preferences:** Prefers character-driven storytelling over superficial narratives; values continuity and logical consistency, contributing to overall enjoyment of series and films. Enjoys character dynamics and music in shows, reflecting a nuanced appreciation for production quality.\n\nOverall, the user showcases a deep passion for both Star Trek and Doctor Who, while expressing disappointment in specific titles and creative decisions across various franchises, reinforcing their established concerns for narrative logic and character development.",
  "metrics": {
    "rouge1_f": 0.17054263565891473,
    "rouge2_f": 0.027950310559006212,
    "rougeL_f": 0.08527131782945736,
    "meteor": 0.06464994479005136,
    "bleu1": 0.012049568463845162,
    "bleu2": 0.005037958857847419,
    "bleu3": 0.0028570117631609862,
    "bleu4": 0.0018951079080171357,
    "bertscore_precision": 0.3892323970794678,
    "bertscore_recall": 0.4994466006755829,
    "bertscore_f1": 0.4375050961971283
  }
}