{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: A Reiki Prosperity Attunement plus Subliminal Persuasion Programs to Increase Your Prosperity\nReview Date: 2014/09/16\nStore: Steve Murray  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Special Interests\nProduct Description: [\"Watch Steve's trailers on this page for his new Reiki DVD and see his psychic abilities. Tens of thousands of people throughout the world have successfully received Reiki Attunements from Steve Murray s DVDS and are now healing themselves and others ----The Reiki Prosperity Attunement, when taken will reveal what you need to know to increase Prosperity in your life. It does this by unlocking your prosperity knowledge hidden in your subconscious and revealing it to your conscious mind. Once this is done, you can act upon your own unique prosperity knowledge. Any person can take the Reiki Prosperity Attunement and start their Prosperity Course of Action. The DVD also has three bonus programs. Each program creates a process called Subliminal Persuasion. One program releases the fear that keeps away prosperity and the other two motivate and keep you focused on prosperity---DVD includes: A Reiki Prosperity Attunement, How the Attunement works, Directions for taking the Attunement, Prosperity Subliminal Persuasion Program One, Prosperity Subliminal Persuasion Program Two, Prosperity Subliminal Persuasion Program Three. You will also learn: What is a Prosperity Course of Action, What is a Prosperity Mental Blockage, What is a Prosperity Plan---An Attunement is a sacred process, initiation and/or meditation with a specific purpose and intent performed by a Spiritual Master, in this case, Steve Murray. The Attunement will last for life and can be taken many times for reinforcement and enhancement --- This Reiki DVD is part of Steve’s Reiki Certification program. Contact Steve through his web site to get details on how to get you Reiki Master Certification. No belief system or religion is required to experience the Attunement\"]\nAverage Rating: 3.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Steve Murray', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Steve Murray', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '59 minutes', 'Release date': 'June 15, 2009', 'Actors': 'Steve Murray', 'Studio': 'body and mind productions inc', 'Number of discs': '1'}\nReview Text: waste of money\nReview Title: One Star\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Journey Into the Structure of Your Beliefs & How You Create Reality\nFormat: DVD\nMovies & TV, Featured Categories, DVD\n['This exclusive interview was filmed live in San Francisco in 2009, and is packed with a variety of practical information on how to identify and change beliefs. Here is your opportunity to learn all about the deeper structure of core limiting beliefs, how they are formed and how they influence your ability to create reality. Robert Dilts and Tim Hallbom are internationally recognized experts in the field of Neurolinguistic Programming, as well as co-authors of the best selling book, Beliefs: Pathways to Health and Well-Being. Dilts and Hallbom have developed many popular techniques for identifying and changing limiting beliefs throughout their expansive careers, and are world renowned for their work with belief systems. Join Kris Hallbom, as she interviews these two pioneers of belief change about their fascinating discoveries and vast experiences with NLP and Belief Applications. By watching this DVD, you will: Learn all about the deeper structure of core limiting beliefs and how they are formed, and why they can be so difficult to identify and change. Discover what a Premature Cognitive Commitment is, and how these unconscious commitments influence your perceptual filters and the world around you. Learn what a belief is, and the four ways for identifying and recognizing core limiting beliefs. Find out new information about how we create reality, and how our perceptions of reality are often influenced by our limiting beliefs. Discover how to identify and change limiting beliefs through Reimprinting, Eye Accessing Cues, and Timeline Orientation Experience Tim and Robert sharing some incredible stories about the power of your beliefs and how they can influence every area of your life including: health, relationships, business and money.']\n{'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'NTSC', 'Actors': 'Robert Dilts, Tim Hallbom'}\nThis DVD has no content- you can google nlp or go to utube and get 100 times more infomation for free. wasnt worth 5 bucks much less what they are asking.\nDont waste your money\nLove Your Legs, Cellulite Reduction At-Home Program\nFormat: DVD\nMovies & TV, Featured Categories, DVD, Romance\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 5.4 x 0.6 inches; 4 Ounces', 'Media Format': 'DVD'}\nI have been doing this for 2-3 weeks and already see a huge difference - the video itself isn't all that great or organized all that well but the exercises definitely work  would highly recommend\nworth every penny\nA Reiki Prosperity Attunement plus Subliminal Persuasion Programs to Increase Your Prosperity\nSteve Murray  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n[\"Watch Steve's trailers on this page for his new Reiki DVD and see his psychic abilities. Tens of thousands of people throughout the world have successfully received Reiki Attunements from Steve Murray s DVDS and are now healing themselves and others ----The Reiki Prosperity Attunement, when taken will reveal what you need to know to increase Prosperity in your life. It does this by unlocking your prosperity knowledge hidden in your subconscious and revealing it to your conscious mind. Once this is done, you can act upon your own unique prosperity knowledge. Any person can take the Reiki Prosperity Attunement and start their Prosperity Course of Action. The DVD also has three bonus programs. Each program creates a process called Subliminal Persuasion. One program releases the fear that keeps away prosperity and the other two motivate and keep you focused on prosperity---DVD includes: A Reiki Prosperity Attunement, How the Attunement works, Directions for taking the Attunement, Prosperity Subliminal Persuasion Program One, Prosperity Subliminal Persuasion Program Two, Prosperity Subliminal Persuasion Program Three. You will also learn: What is a Prosperity Course of Action, What is a Prosperity Mental Blockage, What is a Prosperity Plan---An Attunement is a sacred process, initiation and/or meditation with a specific purpose and intent performed by a Spiritual Master, in this case, Steve Murray. The Attunement will last for life and can be taken many times for reinforcement and enhancement --- This Reiki DVD is part of Steve’s Reiki Certification program. Contact Steve through his web site to get details on how to get you Reiki Master Certification. No belief system or religion is required to experience the Attunement\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Steve Murray', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Steve Murray', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '59 minutes', 'Release date': 'June 15, 2009', 'Actors': 'Steve Murray', 'Studio': 'body and mind productions inc', 'Number of discs': '1'}\nwaste of money\nOne Star",
  "profile": "**User Summary:**\n\n- **Content Preference:** The user maintains a keen interest in self-improvement, personal development, and holistic self-care methods. While previously engaging with programs tied to physical well-being, their recent experience with a Reiki-focused product suggests a continued exploration of practices aimed at enhancing prosperity and well-being.\n  \n- **Learning Style:** Preferring accessible and practical resources, the user favors platforms that provide free or easy access to information. They value programs with clear, demonstrable results but can be disappointed by poor presentation and overall quality.\n\n- **Value Sensitivity:** The user is highly particular about value and quality, as demonstrated by their starkly critical review of a recent purchase, which they deemed a waste of money. This indicates a possible shift toward demanding higher standards from the resources they choose to engage with.\n\n- **Critique Approach:** Willing to provide unreserved critiques when content does not meet their expectations, the user emphasizes the importance of quality in educational and self-improvement materials.\n\n- **Engagement with Topics:** The user shows a deep engagement with complex psychological concepts while also demonstrating an openness to diverse personal development methodologies, albeit with a more critical eye in light of their latest experience.\n\nIn summary, the user seeks high-quality resources on personal development, while exhibiting a growing critical stance toward content that falls short of their expectations.",
  "metrics": {
    "rouge1_f": 0.18834951456310678,
    "rouge2_f": 0.02140077821011673,
    "rougeL_f": 0.09514563106796116,
    "meteor": 0.07363944185836582,
    "bleu1": 0.025924123580287128,
    "bleu2": 0.007715019324884866,
    "bleu3": 0.002479383471606949,
    "bleu4": 0.0007911448113444174,
    "bertscore_precision": 0.3696473240852356,
    "bertscore_recall": 0.46320492029190063,
    "bertscore_f1": 0.4111712872982025
  }
}