{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/10/22\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Bogdanovich'], 'Producers': ['Logan Levy', 'Holly Wiersma', 'Louise Stratten', 'George Drakoulias'], 'Starring': ['Owen Wilson', 'Imogen Poots', 'Kathryn Hahn'], 'Studio': ['LIONS GATE FILMS', 'INC.']}\nReview Text: ok not great\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Journey Into the Structure of Your Beliefs & How You Create Reality\nFormat: DVD\nMovies & TV, Featured Categories, DVD\n['This exclusive interview was filmed live in San Francisco in 2009, and is packed with a variety of practical information on how to identify and change beliefs. Here is your opportunity to learn all about the deeper structure of core limiting beliefs, how they are formed and how they influence your ability to create reality. Robert Dilts and Tim Hallbom are internationally recognized experts in the field of Neurolinguistic Programming, as well as co-authors of the best selling book, Beliefs: Pathways to Health and Well-Being. Dilts and Hallbom have developed many popular techniques for identifying and changing limiting beliefs throughout their expansive careers, and are world renowned for their work with belief systems. Join Kris Hallbom, as she interviews these two pioneers of belief change about their fascinating discoveries and vast experiences with NLP and Belief Applications. By watching this DVD, you will: Learn all about the deeper structure of core limiting beliefs and how they are formed, and why they can be so difficult to identify and change. Discover what a Premature Cognitive Commitment is, and how these unconscious commitments influence your perceptual filters and the world around you. Learn what a belief is, and the four ways for identifying and recognizing core limiting beliefs. Find out new information about how we create reality, and how our perceptions of reality are often influenced by our limiting beliefs. Discover how to identify and change limiting beliefs through Reimprinting, Eye Accessing Cues, and Timeline Orientation Experience Tim and Robert sharing some incredible stories about the power of your beliefs and how they can influence every area of your life including: health, relationships, business and money.']\n{'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'NTSC', 'Actors': 'Robert Dilts, Tim Hallbom'}\nThis DVD has no content- you can google nlp or go to utube and get 100 times more infomation for free. wasnt worth 5 bucks much less what they are asking.\nDont waste your money\nLove Your Legs, Cellulite Reduction At-Home Program\nFormat: DVD\nMovies & TV, Featured Categories, DVD, Romance\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 5.4 x 0.6 inches; 4 Ounces', 'Media Format': 'DVD'}\nI have been doing this for 2-3 weeks and already see a huge difference - the video itself isn't all that great or organized all that well but the exercises definitely work  would highly recommend\nworth every penny\nA Reiki Prosperity Attunement plus Subliminal Persuasion Programs to Increase Your Prosperity\nSteve Murray  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n[\"Watch Steve's trailers on this page for his new Reiki DVD and see his psychic abilities. Tens of thousands of people throughout the world have successfully received Reiki Attunements from Steve Murray s DVDS and are now healing themselves and others ----The Reiki Prosperity Attunement, when taken will reveal what you need to know to increase Prosperity in your life. It does this by unlocking your prosperity knowledge hidden in your subconscious and revealing it to your conscious mind. Once this is done, you can act upon your own unique prosperity knowledge. Any person can take the Reiki Prosperity Attunement and start their Prosperity Course of Action. The DVD also has three bonus programs. Each program creates a process called Subliminal Persuasion. One program releases the fear that keeps away prosperity and the other two motivate and keep you focused on prosperity---DVD includes: A Reiki Prosperity Attunement, How the Attunement works, Directions for taking the Attunement, Prosperity Subliminal Persuasion Program One, Prosperity Subliminal Persuasion Program Two, Prosperity Subliminal Persuasion Program Three. You will also learn: What is a Prosperity Course of Action, What is a Prosperity Mental Blockage, What is a Prosperity Plan---An Attunement is a sacred process, initiation and/or meditation with a specific purpose and intent performed by a Spiritual Master, in this case, Steve Murray. The Attunement will last for life and can be taken many times for reinforcement and enhancement --- This Reiki DVD is part of Steve’s Reiki Certification program. Contact Steve through his web site to get details on how to get you Reiki Master Certification. No belief system or religion is required to experience the Attunement\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Steve Murray', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': 'Steve Murray', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '59 minutes', 'Release date': 'June 15, 2009', 'Actors': 'Steve Murray', 'Studio': 'body and mind productions inc', 'Number of discs': '1'}\nwaste of money\nOne Star\nReiki 2nd Level Attunement Learn and Use the Reiki Sacred Symbols\nSteve Murray  (Actor),     steve murray  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n[\"Watch Steve's trailer on this page for his new Reiki DVD. This DVD is to be used with this Reiki 2nd Level Attunement. Tens of thousands of people throughout the world have successfully received Reiki Attunements from Steve Murray s DVDS and are now healing themselves and others. Take the Reiki Master Attunement and you will become a Reiki Master Healer and able to use the Reiki Master Symbol --- Take the Reiki 2nd Level Attunement and you will become a Reiki 2nd Level Healer and will instantly be attuned to the three Reiki Symbols: The Power, Long Distance, Mental/Emotional and will able to start using them right away. The Reiki 2nd Level Attunement and the three Reiki Symbols will enhance your healing abilities and expand your spiritual and personal growth --- Included in DVD, Preparation and practice for the Reiki 2nd Level Attunement, Reiki 2nd Level Attunement on the Pacific Ocean performed by Reiki Master, Steve Murray. You will also learn: Three sacred Reiki Symbols, How to draw each symbol, How to activate each symbol, How to use each symbol, What to expect during and after the attunement. ---An Attunement is a sacred process, initiation and/or meditation with a specific purpose and intent performed by a Spiritual Master, in this case, Steve Murray. The Attunement will last for life and can be taken many times for reinforcement and enhancement --- This Reiki DVD is part of Steve’s Reiki Certification program. Contact Steve through his web site to get details on how to get you Reiki Master Certification.\"]\n{'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Steve Murray, Steve murray', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Item model number': '09854987', 'Director': 'steve murray', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '30 minutes', 'Release date': 'March 2, 2004', 'Actors': 'Steve Murray', 'Studio': 'Body & Mind Prod.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nwaste of money\nOne Star\nThe Blissology Project: Yoga, Meditation & Lifestyle with Eoin Finn\nEoin Finn  (Actor),     Insiya Rasiwala  (Actor),     Bjorn Enga  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n{'Genre': 'Exercise & Fitness', 'Format': 'Multiple Formats, NTSC, Widescreen, Import', 'Contributor': 'Christy Feaver, Paula Blanchet, Alicia Reinsch, Bjorn Enga, Eoin Finn, Insiya Rasiwala, Oliver ReinschChristy Feaver, Paula Blanchet, Alicia Reinsch, Bjorn Enga, Eoin Finn, Insiya Rasiwala, Oliver Reinsch  See more', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 13.76 Ounces', 'Director': 'Bjorn Enga', 'Media Format': 'Multiple Formats, NTSC, Widescreen, Import', 'Run time': '8 hours and 20 minutes', 'Release date': 'September 25, 2012', 'Actors': 'Eoin Finn, Insiya Rasiwala, Christy Feaver, Paula Blanchet, Oliver Reinsch', 'Studio': 'IMPORTS', 'Number of discs': '1'}\nall of the dvd's skip - all of the dvd's have a nice background and are filmed in pretty areas - but that is as far as the compliments go - he his horrible at directing you into positions if you are a beginner you could really hurt yourself  - its not much of a work out either nor is the meditation any good - I purchased the 108 day ultimate yogi which I love! it is the best but all of those workouts are like an hour long so I purchased this set for days when I was running behind on time and wanted a shorter workout - but this was a waste of money - I end up turning it off because it gets on my nerves so bad - the ultimate yogi has me feeling great and ready to start my day - this bliss ology has me wishing I had my 50 dollars and 30 minutes back - don't waste your money\ndont waste your money - get ultimate yogi instead\nCarole Maggio Ultimate Facercise\nFormat: DVD\nMovies & TV, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'NTSC, CD+DVD', 'Studio': 'Carole Maggio', 'Number of discs': '3'}\nThis also comes in a book, which I purchased and ended up sending back because it was to hard to figure out what she is trying to get you to do just from looking at the pictures. You definitely need the DVD.  What this does  is it tones up the muscles in the face and neck. Just like your abs or arms have muscles that can get saggy, so does your face, so this helps tone up the facial muscles, it can help get rid of the saggy chin and help lift the eyes and the corners of the mouth. This comes with 2 DVD's as well as an audio cd.  the 1st DVD that you start with goes into great detail about each exercise to make sure that you are doing them properly after you do that several times and you learn how to do the exercises the right way then you move onto the 2nd DVD which is the same thing but much shorter, it doesn't have all of the instruction, you just quickly move through the exercises and only takes about 15 minutes.  The audio cd is just the audio version of the 2nd dvd so that you can listen to it on the go and do your exercises in the car. So this is a great way to multitask and keep your face in shape. lol\nthis really works!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['David Dobkin'], 'Producers': ['Susan Downey', 'David Dobkin', 'David Gambino'], 'Starring': ['Robert Downey Jr.', 'Robert Duvall', 'Vera Farmiga'], 'Studio': ['Warner Bros.']}\ngreat movie\nFive Stars\n{'Content advisory': ['Foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['---'], 'Producers': ['John H. Addison'], 'Starring': ['George Cox']}\nwhat a waste of money and time - a total joke\nwhere on earth do they get off charging 1.99 for this crap?\n{'Subtitles': ['None available'], 'Directors': ['Vladimir Kabelik'], 'Producers': ['Vladimír Kabelík'], 'Starring': ['Vladimir Kabelik'], 'Studio': ['Syndicado']}\nok\nTwo Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['William Arntz'], 'Producers': ['William Arntz', 'Betsy Chasse'], 'Starring': ['Marlee Matlin', 'Elaine Hendrix', 'John Ross Bowie'], 'Studio': ['GRAVITAS']}\nworth watching\nFour Stars\n{'Subtitles': ['None available'], 'Directors': ['Unavailable'], 'Starring': ['Deborah Gee'], 'Studio': ['FilmRise']}\nworth watching very helpful - after watching I researched feng shui and made several changes to my home and started to see positive changes quickly\nworth watching very helpful - after watching I researched feng ...\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jean-Marc Vallee'], 'Producers': ['Reese Witherspoon', 'Bruna Papandrea', 'Bill Pohlad'], 'Starring': ['Reese Witherspoon', 'Laura Dern'], 'Studio': ['20th Century Fox']}\ngood not great but worth watching\nFour Stars\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Bogdanovich'], 'Producers': ['Logan Levy', 'Holly Wiersma', 'Louise Stratten', 'George Drakoulias'], 'Starring': ['Owen Wilson', 'Imogen Poots', 'Kathryn Hahn'], 'Studio': ['LIONS GATE FILMS', 'INC.']}\nok not great\nThree Stars",
  "profile": "**User Summary:**\n\nThe user prioritizes self-improvement and holistic self-care, actively curating high-quality resources that yield effective outcomes. Their recent interaction—a review reflecting a nuanced perspective on a film—further emphasizes their discerning taste while revealing a willingness to engage with content that may not fully meet their high standards. Describing it as \"ok not great,\" the user demonstrates their balanced approach, acknowledging utility even when material falls short of excellence, and assigning a moderate rating.\n\nThis selective engagement indicates their preference for clear, practical resources that contribute positively to their personal enrichment journey. The user continues to explore complex themes while voicing concerns when offerings do not align with their elevated expectations, reinforcing their commitment to accountability and meaningful experiences. Their emphasis on impactful content highlights a strong desire for growth, empowerment, and fulfillment.\n\nAs the user navigates their quest for valuable resources, their approach underscores a dedication to engaging only with trustworthy materials that foster sustained progress. This ongoing curatorial process reflects their intention to cultivate an enriching environment, ensuring that their journey of self-exploration remains aligned with their aspirations for impactful and transformative experiences.",
  "metrics": {
    "rouge1_f": 0.06874717322478517,
    "rouge2_f": 0.0027161611588954276,
    "rougeL_f": 0.03618272274988693,
    "meteor": 0.02162969954380997,
    "bleu1": 1.7858476574629476e-06,
    "bleu2": 5.107174620247107e-07,
    "bleu3": 1.76179122986839e-07,
    "bleu4": 5.8259205730779616e-08,
    "bertscore_precision": 0.31705230474472046,
    "bertscore_recall": 0.4699050784111023,
    "bertscore_f1": 0.3786342144012451
  }
}