{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Energy Medicine for Women\nReview Date: 2009/03/16\nStore: Donna Eden  (Actor),     Dondi Simone Dahlin  (Actor),     Jill Stevens  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Special Interests\nProduct Description: ['Product Description', 'A companion to the book', 'Energy Medicine for Women', \"or an independent program to optimize your health. For more than three decades, Donna Eden has been teaching people how to work with the body's energies to reclaim their natural healing capabilities. In this long-awaited follow-up to her bestselling classic,\", 'Energy Medicine', \", Eden speaks directly to women, showing them how they can use energy medicine to tackle the specific health challenges they face. Hormonal health is essential to a woman's well-being, and in this DVD Eden reveals that women can manage their hormones by managing their energies. In fact, energy medicine is beneficial in treating a host of health issues. From PMS to menopause, from heart disease to depression, energy medicine offers solutions to health issues that traditional medicine often fails to provide.\", 'Energy Medicine for Women', 'is an indispensable health resource for women.', 'The program is abased on a series of simple exercises that:', \"Stabilize and maintaing your energies Protect you from negative energies Determine what may harm your health (as well as your family's) Support the body's healing process against illness Focusing on women's issues, the program provides energy techniques for regulating hormones, enhancing sexuality and fertility, easing the challenges of pregnancy and birth, managing PMS and menopause, preventing osteoporosis, controlling weight gain, etc.\", 'Review', \"Donna Eden's body energy work is perhaps the most brilliant, comprehensive, and effective system in the genre that I have ever seen. --Jean Houston, Ph.D.Donna Eden is one of the few practitioners whom I would call a `Master Healer.' Her empathy, insight, and curative powers are so strong that she is able to consistently locate the deepest source of her clients' problems, free their reservoir of untapped vitality, and lead them on a road back toward health. --Stanley Krippner, Ph.D.My thyroid was overactive. Traditional medicine can't cure this, it only treats the symptoms. I actually tried to get a healing with Donna, but it's very difficult because there are hundreds of people who want to get a healing with her. So as it was, I went to one of her classes and started to use some of the exercises she showed us. With these exercises, my thyroid condition is, at least for the time being, now cured. --Carmen Milan\", 'About the Actor', \"A pioneer in the field of energy medicine for more than two decades, Donna Eden has taught people worldwide how to understand the body as an energy system. Speaking of Donna s book, Energy Medicine, which is rapidly becoming the classic in the field, Richard Gerber, M.D., states Donna Eden's unique clairvoyant observations of energy patterns have led to a fabulous, practical guide to managing the body s subtle energies. Eden, who is Founder and President of the non-profit Energy Medicine Institute, is frequently consulted within traditional and alternative health care settings.\", 'See more']\nAverage Rating: 5.0\nProduct Details: {'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Jill Stevens', 'Media Format': 'NTSC', 'Run time': '2 hours and 52 minutes', 'Release date': 'September 17, 2008', 'Actors': 'Donna Eden, Dondi Simone Dahlin, Titanya Dahlin, Pethrena M. Shirley, Mireille Barnard', 'Studio': 'Innersource', 'Number of discs': '2'}\nReview Text: Donna Eden does not believe being female is a disease.  Sensitive to the imbalances that often accompany the different stages of life, she developed a system of energy exercises which gently adjust the energy flow.<br /><br />Touted as both a stand alone dvd as well as a companion to the book Energy Medicine for Women, this set of two dvds demonstrates the exercises contained in the book.  It is broken down into modules, including PMS, pregnancy and menopause and each of the exercises is listed in the index.<br /><br />Eden herself narrates and demonstrates some of the exercises. Initially I was put off by her toothy grin and careful enunciation, however, as it progressed it was obvious that she is a jolly person and her smile is reflected in her eyes.  Each exercise is prefaced with a photo of the model with the acupressure/acupuncture points addressed by the exercise marked. The models are a diverse group of varying ages, races and sizes.  Be advised these are not the botoxed Barbies we have been accustomed to seeing in fitness programs.  These are real women with breasts, bellies and butts. I admit to being amazed (okay, initially horrified) that some of the chubbier models did not corset themselves up in spanx and encase themselves in dark, drab colors.  However, my cultural conditioning evaporated as I realized that these women were truly beautiful. They exude health and happiness and are obviously comfortable with their bodies regardless of size. The promise of that type of acceptance is well worth the price.<br /><br />The techniques are not difficult and I think this dvd serves best as a companion to the book. I found it annoying to have to flip back and forth between pages to complete a routine.  I have been using some of the exercises for over a month and notice a general improvement in my energy level and outlook.  Additionally, I have lost a few pounds. Note, that this is not a slick presentation by any extent of the imagination.  It is filmed outdoors in what appears to be Eden's backyard. It is attractive but occasionally background noises intrude.  However, everyone involved appears to be enjoying the creation of the program and it is certainly easy and fun to follow.\nReview Title: Feel Like A Natural Woman\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Dancing With the Stars - Cardio Dance\nCal Pozo  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product Description', \"On ABC's hit show DANCING WITH THE STARS, countless pounds are shed and bodies transform before our very eyes. Now it's your turn to dance your way to fitness with three of the show's favorite pro dancers Ashly, Kym and Maks. With this fat-blasting program you will learn four choreographed dance routines featuring some of the best moves from the show. Then shake things up with a bonus freestyle routine to test your new dance skills. Have fun and gain confidence on the dance floor while building a stronger, sexier, super-star body!(Not final packaging synopsis.)\", 'Amazon.com', 'Each era has its own defining exercise video--or in this age, DVD.', 'Dancing With the Stars: Cardio Dance', \"isn't going to go down as the 21st century's answer to Jane Fonda's exercise tapes, but it's not a bad way to learn a few basic steps, thanks to instructions from some of the professional dancers from the ABC hit series\", 'Dancing With the Stars', '. Ashly Costa (the brunette who danced up a storm with Harry Hamlin), Kym Johnson (the blonde who almost made a', 'DWTS', 'winner out of Joey Fatone), and Maksim Chmerkovsy (the dude who sparred with Laila Ali on and off the dance floor) make for nice eye candy as they teach viewers how to do the cha-cha, the jive, and the paso doble.', 'Cardio Dance', \"does a good job of showing viewers how to warm their bodies up before getting into the more aerobic dance exercises. Women will probably benefit most from Kym's instructional portion, which focuses on toning the hips and waistline. The patient Australian (who once taught Jerry Springer how to waltz) is relatively easy to follow as she teaches the Brazilian samba. This DVD isn't for the serious dancer. Its target audience is comprised of fans of the show who'd like to get in shape with Ashly, Kym, and Maks. If you already know the basics of dance, you won't have problems keeping up with their instructions. But if you have two left feet, some of the dance terms they toss around (but don't explain) will leave you scratching your head rather than hoofing it up. And while we're not expecting anyone like season-four winner Apolo Anton Ohno to make an appearance here, it would've been nice to include a segment or two with\", 'DWTS', 'judges Carrie Ann Inaba, Bruno Tonioli, and Len Goodman.', '--Jae-Ha Kim']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.5 x 0.5 x 7.5 inches; 3.2 Ounces', 'Item model number': '50685980855', 'Director': 'Cal Pozo', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour', 'Release date': 'April 3, 2007', 'Language': 'Unqualified', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nCapitalizing on the popularity of the Dancing with the Stars TV show, this dvd is a disappointment.  It features three of the shows dancers, Kym, Ashly and Maksim and promises to teach the viewer dance steps while providing a good workout.  Unfortunately, the cuing is inadequate and the instructions are spare at best. The warm up and cool down segments are short.  The dance segments feature the Paso Doble, ChaCha, Samba and Jive(supposedly a combination of the Lindy and the swing). These are followed by a  totally annoying and frustrating freestyle section that seems designed to  spotlight the three dancers.  It is way to fast and even the three teachers are unable to follow each other's lead.  The instructors are oblivious to the fact that they are actually supposed to be leading non-professionals.  The banter is truly irritating--it is very hard to believe that toned, professional dancers would be winded and sore from this workout. The segments do not flow smoothly from one to the other.<br /><br />If you want a good workout that are many superb videos catering to virtually every taste that are much easier to follow. If you want to learn to dance, sign up for classes.  If you want to see your favorite dancer, skip this video and tape the tv show.\nDancing Gets Only Three Stars\nEnergy Medicine for Women\nDonna Eden  (Actor),     Dondi Simone Dahlin  (Actor),     Jill Stevens  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Genre for Featured Categories, Special Interests\n['Product Description', 'A companion to the book', 'Energy Medicine for Women', \"or an independent program to optimize your health. For more than three decades, Donna Eden has been teaching people how to work with the body's energies to reclaim their natural healing capabilities. In this long-awaited follow-up to her bestselling classic,\", 'Energy Medicine', \", Eden speaks directly to women, showing them how they can use energy medicine to tackle the specific health challenges they face. Hormonal health is essential to a woman's well-being, and in this DVD Eden reveals that women can manage their hormones by managing their energies. In fact, energy medicine is beneficial in treating a host of health issues. From PMS to menopause, from heart disease to depression, energy medicine offers solutions to health issues that traditional medicine often fails to provide.\", 'Energy Medicine for Women', 'is an indispensable health resource for women.', 'The program is abased on a series of simple exercises that:', \"Stabilize and maintaing your energies Protect you from negative energies Determine what may harm your health (as well as your family's) Support the body's healing process against illness Focusing on women's issues, the program provides energy techniques for regulating hormones, enhancing sexuality and fertility, easing the challenges of pregnancy and birth, managing PMS and menopause, preventing osteoporosis, controlling weight gain, etc.\", 'Review', \"Donna Eden's body energy work is perhaps the most brilliant, comprehensive, and effective system in the genre that I have ever seen. --Jean Houston, Ph.D.Donna Eden is one of the few practitioners whom I would call a `Master Healer.' Her empathy, insight, and curative powers are so strong that she is able to consistently locate the deepest source of her clients' problems, free their reservoir of untapped vitality, and lead them on a road back toward health. --Stanley Krippner, Ph.D.My thyroid was overactive. Traditional medicine can't cure this, it only treats the symptoms. I actually tried to get a healing with Donna, but it's very difficult because there are hundreds of people who want to get a healing with her. So as it was, I went to one of her classes and started to use some of the exercises she showed us. With these exercises, my thyroid condition is, at least for the time being, now cured. --Carmen Milan\", 'About the Actor', \"A pioneer in the field of energy medicine for more than two decades, Donna Eden has taught people worldwide how to understand the body as an energy system. Speaking of Donna s book, Energy Medicine, which is rapidly becoming the classic in the field, Richard Gerber, M.D., states Donna Eden's unique clairvoyant observations of energy patterns have led to a fabulous, practical guide to managing the body s subtle energies. Eden, who is Founder and President of the non-profit Energy Medicine Institute, is frequently consulted within traditional and alternative health care settings.\", 'See more']\n{'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Jill Stevens', 'Media Format': 'NTSC', 'Run time': '2 hours and 52 minutes', 'Release date': 'September 17, 2008', 'Actors': 'Donna Eden, Dondi Simone Dahlin, Titanya Dahlin, Pethrena M. Shirley, Mireille Barnard', 'Studio': 'Innersource', 'Number of discs': '2'}\nDonna Eden does not believe being female is a disease.  Sensitive to the imbalances that often accompany the different stages of life, she developed a system of energy exercises which gently adjust the energy flow.<br /><br />Touted as both a stand alone dvd as well as a companion to the book Energy Medicine for Women, this set of two dvds demonstrates the exercises contained in the book.  It is broken down into modules, including PMS, pregnancy and menopause and each of the exercises is listed in the index.<br /><br />Eden herself narrates and demonstrates some of the exercises. Initially I was put off by her toothy grin and careful enunciation, however, as it progressed it was obvious that she is a jolly person and her smile is reflected in her eyes.  Each exercise is prefaced with a photo of the model with the acupressure/acupuncture points addressed by the exercise marked. The models are a diverse group of varying ages, races and sizes.  Be advised these are not the botoxed Barbies we have been accustomed to seeing in fitness programs.  These are real women with breasts, bellies and butts. I admit to being amazed (okay, initially horrified) that some of the chubbier models did not corset themselves up in spanx and encase themselves in dark, drab colors.  However, my cultural conditioning evaporated as I realized that these women were truly beautiful. They exude health and happiness and are obviously comfortable with their bodies regardless of size. The promise of that type of acceptance is well worth the price.<br /><br />The techniques are not difficult and I think this dvd serves best as a companion to the book. I found it annoying to have to flip back and forth between pages to complete a routine.  I have been using some of the exercises for over a month and notice a general improvement in my energy level and outlook.  Additionally, I have lost a few pounds. Note, that this is not a slick presentation by any extent of the imagination.  It is filmed outdoors in what appears to be Eden's backyard. It is attractive but occasionally background noises intrude.  However, everyone involved appears to be enjoying the creation of the program and it is certainly easy and fun to follow.\nFeel Like A Natural Woman",
  "profile": "**User Profile Summary:**\n\n- **Fitness Orientation**: The user is interested in fitness and workout routines that incorporate dance, alongside exploring holistic health concepts like energy medicine.\n- **Entertainment Preference**: They enjoy reality competition television shows, showing a strong engagement with formats that feature performance and personal growth.\n- **Critique of Instructional Content**: The user values thoroughness and clarity in fitness instructional content, evidencing a preference for well-structured and accessible videos. Their feedback reflects a thoughtful analysis of both fitness and health resources.\n- **Desire for Ease of Use**: They express frustration with complexity in instruction, favoring straightforward programs suitable for beginners or non-professionals. They appreciate instructional content that includes diverse representation and authenticity.\n- **High Expectations**: Their experiences suggest that the user has high expectations for quality and effectiveness in both fitness and health resources, influenced by their engagements with quality entertainment.\n- **Review Tendencies**: The user tends to provide constructive criticism and thoughtful insights in their reviews, indicating a reflective approach to their experiences with various products.\n\nOverall, this user seeks fitness and health resources that seamlessly blend effective instruction, entertainment value, ease of use, and authenticity, while avoiding products that do not meet these criteria.",
  "metrics": {
    "rouge1_f": 0.11364843335103558,
    "rouge2_f": 0.007442849548112706,
    "rougeL_f": 0.057355284121083365,
    "meteor": 0.03804810557684121,
    "bleu1": 0.0003373120604089525,
    "bleu2": 0.00010144573421060842,
    "bleu3": 1.466264547692165e-05,
    "bleu4": 5.580033054929315e-06,
    "bertscore_precision": 0.3672313690185547,
    "bertscore_recall": 0.498710036277771,
    "bertscore_f1": 0.4229893088340759
  }
}