{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NCIS: Season 4\nReview Date: 2011/09/28\nStore: Mark Harmon  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', 'TRT: 1054 MIN.', 'Amazon.com', 'The fourth season of', 'NCIS', \"begins with one of the investigators being charged with assassinating an Iranian prisoner. Former Mossad intelligence agent Ziva David (Cote de Pablo), who was introduced last season, has been framed, and there's only one man who can clear her name. Unfortunately, lead investigator Jethro Gibbs (Mark Harmon) has retired to Mexico. But since Harmon is the star of the show, Gibbs returns to the United States to help out his colleague. While most of his former team is happy, Tony DiNozzo (Michael Weatherly) has mixed feelings (During Gibbs' absence, DiNozzo became the de facto head of the team, and going back to being Gibbs' underling doesn't sit well with the usually easygoing special agent.). Like William Petersen on\", 'CSI', ', Harmon is instrumental to the success of', 'NCIS', \". Low-key and sarcastic, he injects humor and drama into a role that could've come off as dull. And while other cast members may come and go, his presence makes even some of the weaker storylines forgivable. In general, this season--which originally aired from 2006 to 2007--is full of well-developed plot lines that drive each episode along at a good pace. But there are some subplots that are trite: When agent Timothy McGee (Sean Murray) reveals that that book he's writing is based on his co-workers, it's not much of a reveal. Also, the serial-killer storyline in this season overstays its welcome by at least one episode. As NCIS director Jennifer Shepard, Lauren Holly makes a sometimes unlikable character come to life, especially when Shepard's motives are questionable. As the show's name suggests, the majority of crimes featured revolve around military personnel, but some of the show's best moments occur when they touch of the personal relationships between the characters. All 24 episodes are included in this six-disc box set, which also includes commentaries, a Q&A session with cast members answer fans' questions, and a surprisingly interesting look at the props used on the show.\", '--Jae-Ha Kim']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure/Television, Television', 'Format': 'Closed-captioned, Color, Dolby, Subtitled', 'Contributor': 'Mark Harmon', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.96 x 5.49 x 7.72 inches; 10.88 Ounces', 'Item model number': '12266', 'Media Format': 'Closed-captioned, Color, Dolby, Subtitled', 'Run time': '17 hours and 33 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Mark Harmon', 'Studio': 'Paramount', 'Number of discs': '6'}\nReview Text: Any NCIS fan will enjoy watching these dvds all over again. A must for the collection. Amazon makes it affordable so why stream when you can own them!\nReview Title: Great Series\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The L Word: Complete Series Pack\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Follows the lives and loves of a small, close-knit group of lesbians living in Los Angeles as well as the friends and family members that either support or loath them.', 'Amazon.com', 'Season One', 'Four years after Showtime made gay men the focus of its original series', 'Queer as Folk', ', it was time for a little turnabout with', 'The L Word', '(bad title, great show). Centering around a tight-knit group of lesbians in Los Angeles, this drama was far removed from its working-class male counterpart in both style and content. While the men of', 'QAF', 'enjoyed a fabulous if melodramatic life on the middle-class streets of Pittsburgh, the women of', 'The L Word', 'lived it up in sunny California, with gorgeous houses, glamorous careers, and sexy wardrobes. Ironically, though,', 'The L Word', 'adhered more to the everyday drama of ensemble shows like', 'thirtysomething', 'than the soap opera antics of', 'QAF', ', and the results were surprisingly heartfelt and effective, appropriately stylish but never over the top. There was plenty of room for titillation, but creator Ilene Chaiken fashioned from the start a show centered on characters and not just sex, aiming for the heart rather than... well, other places.', 'The L Word', \"focused primarily on committed couple Bette (Jennifer Beals) and Tina (Laurel Holloman), a former power-career duo who've decided to have a baby; however, artificial insemination and the changing dynamics of their relationship throw their previously happy existence off-kilter. Within their orbit are spunky journalist Alice (Leisha Hailey), sultry hairdresser Shane (Katherine Moenning), closeted pro tennis player Dana (Erin Daniels), and espresso bar owner Marina (Karina Lombard) who, in the show's most polarizing storyline, bedded the seemingly straight Jenny (Mia Kirschner) and shook up her heterosexual world. Jenny's am-I-straight-or-not? kvetching frustrated both her fiancé (Eric Mabius) and many viewers, who were alternately irritated and intrigued by her inability to decide one way or the other. But Jenny's weakness was part of\", 'The L Word', \"'s strength: in exploring many sides of many issues, both domestic and political, it never came up with an easy answer for any of them, making the show all that more fascinating--and compulsively watchable.\", '--Mark Englehart', 'Season Two', \"Once a series has broken new ground, where does it go from there? Showtime's\", 'The L Word', \", concerning the relationships of a community of lesbian Los Angelenos, turned heads with its smart, funny writing and fully realized characters. Season Two offers more of the same, with some notable guest stars and experiments in narrative and music. This season, Jenny (Mia Kirshner) fully embraces her sexuality as her ex-husband/roomie (Eric Mabius) departs and voyeuristic documentary filmmaker Mark (Eric Lively) and womanchaser Shane (Katherine Moennig) move in. Shane and Jenny struggle good-heartedly over the affections of new character Carmen (Sarah Shahi), who isn't given much to do plot-wise apart from occasionally spinning records and serving as one corner of the love triangle. Bette (Jennifer Beals) and Tina (Laurel Holloman) start the season on the rocks due to Bette's infidelity; the introduction of the one-dimensionally nasty Helena Peabody (Rachel Shelley) causes further friction between Bette and Tina while playing havoc with Bette's curatorial career. Meanwhile, Dana (Erin Daniels) and Alice (Leisha Hailey) go from being best friends to being a whole lot more, providing some of the most touching scenes of the season. Kit (Pam Grier) takes on The Planet, the seeming center of LA's lesbian universe, converting it into a nightclub where, conveniently, guest-starring bands can play.\", \"Strong points of the season include Bette and Kit confronting the death of their father (the superb Ossie Davis) and Shane's new job as a gopher for a high-powered Hollywood producer (the equally superb Camryn Manheim). Less strong are the distracting, neo-expressionistic passages meant to be glimpses into Jenny's creative mind and the interminable use of the series' theme song--re-interpreted in a number of genres--to the point of distraction. Mark's voyeurism, which crosses all sorts of boundaries as he installs hidden cameras around the house, is a brilliant way to challenge male viewers who may tune in just to TiVo their way to the sex scenes. That said, the arc of that particular story grows increasingly far-fetched as Mark somehow avoids criminal prosecution and instead endures the horrible fate of having Jenny refuse his offer of coffee and a muffin. Despite its flaws,\", 'The L Word', 'is a show that deserves to be cheered on, not for its politics, but for the skillful way it conveys complex human entanglements with sensitivity.', '--Ryan Boudinot', 'Season Three', \"The third season of Showtime's\", 'The L Word', \"is all about transitions. The season opens with Alice Pieszecki (Leisha Hailey) coping with her between-seasons break-up with Dana Fairbanks (Erin Daniels), who is herself headed for an even heavier series of transitions. Kit Porter (Pam Grier) both falls in love with a younger man and discovers she is going through menopause. Shane (Katherine Moennig), who spent much of the first two seasons of the show hopping from bed to bed, finds herself more or less committed to Latina deejay Carmen (Sarah Shahi). And the second season's resident villain, Helena Peabody (Rachel Shelley), becomes embroiled in a sexual harassment case that leaves her ultimately looking like the victim. As with previous seasons,\", 'The L Word', \"gets all hot and bothered with various seductions filmed to sometimes jarring music on the soundtrack, but it's the day-to-day foibles and celebrations of Los Angeles's lesbian community that keep the show interesting. Newcomer Moira/Max (Daniela Sea) begins the process of gender reassignment, making for some curious situations with potential employers. Bette (Jennifer Beals) and Tina (Laurel Holloman) begin to drift apart when Tina lands a big movie studio job and starts feeling attracted to men, leading to a custody battle over their baby daughter. Where\", 'The L Word', 'starts getting preachy and obvious is in the opening flashback sequences. When these vignettes refer to current characters of the show, they make sense; when they depict situations meant to underline how queer identity has evolved over the years, they seem politically overloaded.', 'The L Word', \"works intelligently through its characters' concerns without having to resort to such direct appeals for tolerance. Its strength isn't in making lesbian culture appear more mainstream, but in making us care and identify with these women's struggles, regardless of our sexual orientation.\", '--Ryan Boudinot', 'Season Four', 'If the third season was marked by transitions,', 'The L Word', \"'s fourth concerns growing up--or trying to, at any rate. Shane (Katherine Moennig) becomes her brother Shay's guardian, Bette (Jennifer Beals) and Tina (Laurel Holloman) stop fighting over their daughter Angelica, and Bette's new boss, Phyllis (a very game Cybill Shepherd), decides it's time to embrace her true nature. So, after 25 years of marriage (Bruce Davison plays her husband), Chancellor Kroll comes out of the closet--and sets her sights on Alice (Leisha Hailey). For all the inclusiveness, Max (Daniela Sea), still remains on the margins. Dumped by Jenny (Mia Kirshner) the year before, Max continues to share her apartment while acclimating to life as a man.\", \"For those who felt season three was too dark, four offers a welcome corrective. There's still plenty of angst--Jenny's memoir meets with a few negative notices (Heather Matarazzo's journalist pens the harshest critique) and Helena (Rachel Shelley) learns to live without Mommy's money--but there are plenty of moving moments to compensate (most revolving around Shane and Shay). New additions also arrive to shake things up, like Marlee Matlin as an artist who helps Bette to broaden her horizons, Kristanna Loken as a single mother with a yen for Shane, and Rose Rollins as an Iraq War veteran with whom Alice has a tryst (leading to a well intentioned, if heavy-handed message about how even liberals should support the troops). As in seasons past, the directorial line-up impresses as much as the acting talent, and includes Oscar winner Marleen Gorris (\", \"Antonia's Line\", ') and playwright Moisés Kaufman (', 'The Laramie Project', '). Since creator Ilene Chaiken makes most special features, like deleted scenes, available online, this set offers few extras, other than biographies, a photo gallery, and episodes of', 'The Tudors', 'and', 'Californication', '.', '--Kathleen C. Fennessy', 'Season Five', 'In a clever move, the producers of', 'The L Word', 'use season five to revisit the origins of their own creation. After Jenny (Mia Kirshner) sets out to direct the silver-screen edition of her novel,', 'Lez Girls', ', she enters a parallel world populated by actors playing thinly-veiled versions of the central cast (in a typical Jenny move, she sleeps with the star who portrays \"Jesse\"). This post-modern plotline brings newcomers up to speed, while offering early-adapters new perspectives on the past. Naturally, the shoot doesn\\'t go smoothly. When the increasingly self-absorbed Jenny hires adoring fan Adele (', 'ER', \"'s Malaya Rivera Drew) as her assistant, events take on\", 'All About Eve', 'overtones. Since Jenny is turning her life into a movie, it only makes sense for the two to bleed into each other. In other developments, Tina (Laurel Holloman) and Bette (Jennifer Beals) consider reconciliation, Helena (Rachel Shelley) does time in prison, Alice (Leisha Hailey) takes her penchant for gossip too far, Tasha (Rose Rollins) fights to stay in the military, and Shane (Katherine Moennig), a dead ringer for Warren Beatty in', 'Shampoo', \", rejoins the ranks of the single, only to fall for straight girl Molly (Cybill Shepherd's daughter, Clementine Ford).\", 'In a more melodramatic, but equally entertaining move, Dawn Denbo (Elizabeth Keener), proprietor of new hotspot SheBar makes life hell for the Planet, but Kit (Pam Grier) and her loyal clientele refuse to go down without a fight--even if they don\\'t offer \"Lesbian Turkish Oil Wrestling.\" Aside from the fact that Max (Daniela Sea) continues to get short shrift,', 'The L Word', \"'s fifth year proves the show has more than a little lusty and gutsy life left in it, and was renewed for a sixth season. Extras include cast biographies and episodes of Showtime's\", 'Dexter', ',', 'Californication', ', and', 'This American Life', '.', '--Kathleen C. Fennessy']\n{'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '9.4 x 7.7 x 5.6 inches; 4.4 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Widescreen', 'Release date': 'October 20, 2009', 'Dubbed': 'English, Spanish', 'Language': 'Unqualified (DTS ES 6.1)', 'Studio': 'Showtime Ent.', 'Number of discs': '24'}\nDon't sterotype anyone that buys this set. It is excellent and no one should be ashamed to watch any of the dvds. I watched the show on prime time and enjoyed the weekly suspense so I bought the set. Now others have asked to borrow the dvds and they are on loan. Yes  females, amles and couples have borrowed this dvd set\nClassic that speaks to all\n3rd Rock from the Sun: The Best Episodes in the Universe, Really\nJohn Lithgow  (Actor),     Jane Curtin  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Attention Earthlings: It is hereby decreed by intergalactic order of The Big Giant Head \\x96 and a unanimous vote by the show\\x92s cast and creators \\x96 that these are The Most Hilarious Episodes In The Universe, Really! In the now-classic First Episode (aka \"Brains And Eggs\"), the Solomons discover that humans can produce feelings when Dick falls for his office mate Mary Albright. The aliens realize they have no roots in \"Dick Like Me\", and their yearning to fit in sends Dick on an anthropological encounter with Italians. The Solomons decide to cheat the IRS in \"Dick And Taxes\", leading to a terrifying audit, some outrageous confessions and Sally\\x92s not-so-failed home business. And when Dick wrecks the family car in \"The Fifth Solomon\", the aliens experience the pain of grief and the price of auto insurance. Resistance is futile: The Most Hilarious Episodes In The Universe are here']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 3.2 Ounces', 'Media Format': 'Box set, Color, DVD, NTSC', 'Run time': '1 hour and 28 minutes', 'Release date': 'April 4, 2006', 'Actors': 'John Lithgow, Jane Curtin, Kristen Johnston, French Stewart, Joseph Gordon-Levitt', 'Studio': 'Starz / Anchor Bay', 'Writers': 'Bonnie Turner, Terry Turner', 'Number of discs': '1'}\nJust a great funny classic that was made the way comedy could for all ages. I bought all the series from Amazon and have enjoyed them all\nGreat Classic\n3rd Rock from the Sun: Season 5\nJohn Lithgow  (Actor),     French Stewart  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['3rd Rock from the Sun: Season 5']\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1.25 inches; 12.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '7 hours and 11 minutes', 'Release date': 'August 15, 2006', 'Actors': 'John Lithgow, French Stewart, Kirsten Johnston', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '4'}\nJust a great funny classic that was made the way comedy could for all ages. I bought all the series from Amazon and have enjoyed them all\nGreat Classics\n3rd Rock from the Sun: Season 6\nJohn Lithgow  (Actor),     Jane Curtin  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Their Out-Of-This-World Mission Ends With The Unforgettable Final Season! After six brilliant seasons, over 30 Emmy® nominations and more laughs than any superior alien race can possibly tabulate, the Solomon\\x92s mission ends here: It was the year in which Tommy goes to college, Sally becomes a weather girl, Harry bothers the Amish, Mary\\x92s rich sister proposes, Dick buys a timeshare, evil nemesis Dr. Liam Neesam returns, and The Big Giant Head issues a shocking final order. There\\x92s love and sex, psychics and magicians, power brunches and pumping gas, self-help books and self-defense classes, a time/space portal in the closet, and the hour-long series finale that finishes their time on Earth forever. Join John Lithgow, Kristen Johnson, French Stewart, Joseph Gordon-Levitt, Jane Curtin, Simbi Khali, Elmarie Wendel and Wayne Knight \\x96 along with such guest stars as Megan Mullally, John Cleese, Richard Belzer, Darrell Hammond, Tracy Morgan, Ana Gasteyer, Elaine Stritch and Elvis Costello \\x96 for these 20 final episodes of the series that legions of humans will forever hail as the most hilarious sci-fi sitcom in the history of the universe!']\n{'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.56 x 5.75 x 1.26 inches; 12.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '7 hours and 42 minutes', 'Release date': 'November 14, 2006', 'Actors': 'John Lithgow, Jane Curtin', 'Language': 'Unqualified', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '4'}\nJust a great funny classic that was made the way comedy could for all ages. I bought all the series from Amazon and have enjoyed them all\nGreat Classics\n3rd Rock from the Sun - Season 1\nJohn Lithgow  (Actor),     Jane Curtin  (Actor),     James Burrows  (Director),     Robert Berlinger  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Product Description', '3rd Rock from the Sun, which has earned 31 Emmy nominations,is an inspired half-hour comedy series farcically dealing with the human condition. It was created by Bonnie Turner and Terry Turner in association with Carsey-Werner Productions, LLC for NBC-TV. Set in the fictional city of Rutherford, Ohio, this gentle-hearted series stars John Lithgow as the High Commander of an investigative team sent to Earth on a mission to learn everything about humans and their so-called advanced cilvilization.', 'Amazon.com', 'In the irreverent tradition of', 'My Favorite Martian', 'and', 'Mork and Mindy', ', Bonnie and Terry Turner (', 'That \\x9170s Show', ') created', '3rd Rock From the Sun', '. Launched in 1996 as a midseason replacement, the alien comedy ran for six seasons, garnering 31 Emmy nominations and eight wins, including three for John Lithgow and two for Kristen Johnston.', 'In the pilot (\"Brains and Eggs\"), four extra-terrestrials suddenly materialize in the college town of Rutherford, Ohio. Disguised as humans, they dub themselves the Solomons. They are Dick (Lithgow), Sally (Johnston), Tommy (Joseph Gordon-Levitt), and Harry (French Stewart). On the surface, Dick is a physics professor and Tommy is his hormonally challenged 14-year-old son. In reality, Dick is the high commander, Tommy (who\\'s actually the oldest) is the senior information officer, Sally (who\\'s actually a man) is the lieutenant, and squinty-eyed Harry is the transmitter/receiver. The humans in their lives include Dick\\'s colleague--and object of his affections--Mary (Jane Curtin,', 'Kate and Allie', '), secretary Nina (Simbi Khali), and landlady Mrs. Dubcek (Elmarie Wendel). The first season also introduces Officer Don (Wayne Knight,', 'Seinfeld', '), who will appear more often in future seasons.', 'There were 20 episodes in the first year. In each, the Solomons learn something new about the human condition. In the debut, it\\x92s feelings. Dick finds them silly, until he realizes how essential they are--you can\\'t be fully human without them. Then there\\'s sportsmanship (\"Green-Eyed Dick\"), mortality (\"Body & Soul & Dick\"), and so on. Guest stars include Harry\\'s dream girl, Martha Stewart (\"Post-Nasal Dick\"),', 'The Gilmore Girls', '\\x92 Lauren Graham (\"Dick\\'s First Birthday\"), and', 'Newsradio', '\\x92s Phil Hartman (\"Lonely Dick\"). After the show\\x92s demise, the cast would move on to other ventures, most notably Broadway hit', 'Dirty Rotten Scoundrels', 'for the versatile Lithgow and independent drama', 'Mysterious Skin', 'for the grown-up Gordon-Levitt.', '--Kathleen C. Fennessy']\n{'Genre': 'Comedy', 'Format': 'Box set, Color, Closed-captioned, NTSC, Full Screen', 'Contributor': 'Christine Zander, Ian Lithgow, John Lithgow, Simbi Khali, David DeLuise, Joseph Gordon-Levitt, Elmarie Wendel, Andy Cowan, Bonnie Turner, Chris Hogan, Robert Berlinger, Andrew Orenstein, Danielle Nicolet, James Burrows, Bill Martin, Wayne Knight, French Stewart, Jane Curtin, Kristen Johnston, Bob KushellChristine Zander, Ian Lithgow, John Lithgow, Simbi Khali, David DeLuise, Joseph Gordon-Levitt, Elmarie Wendel, Andy Cowan, Bonnie Turner, Chris Hogan, Robert Berlinger, Andrew Orenstein, Danielle Nicolet, James Burrows, Bill Martin, Wayne Knight, French Stewart, Jan…  See more', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.44 x 5.79 x 1.38 inches; 14.4 Ounces', 'Director': 'James Burrows, Robert Berlinger', 'Media Format': 'Box set, Color, Closed-captioned, NTSC, Full Screen', 'Run time': '7 hours and 22 minutes', 'Release date': 'July 26, 2005', 'Actors': 'John Lithgow, Jane Curtin, Kristen Johnston, French Stewart, Joseph Gordon-Levitt', 'Studio': 'Anchor Bay Entertainment', 'Writers': 'Andrew Orenstein, Andy Cowan, Bill Martin, Bob Kushell, Bonnie Turner', 'Number of discs': '4'}\nJust a great funny classic that was made the way comedy could for all ages. I bought all the series from Amazon and have enjoyed them all\nGreat Classics\n3rd Rock from the Sun: Season 3\nJohn Lithgow  (Actor),     French Stewart  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Product Description', 'Welcome to the most outrageous year of alien lunacy yet! Get ready for out-of-this-world and certified-classic hilarity as Dick Solomon (John Lithgow) and his \\x91family\\x92 Sally (Kristen Johnston), Harry (French Stewart), Tommy (Joseph Gordon- Levitt) and Dr. Albright (Jane Curtin) experience the insanity of human behavior like no other comedy in television history! Wayne Knight, Simbi Khali, Elmarie Wendel and Jan Hooks co-star in this acclaimed third season that was nominated for 8 Emmy® Awards and featured such special guests as Cindy Crawford, John Cleese and Roseanne!', 'Amazon.com', 'Season three of the cult comedy sitcom', '3rd Rock From the Sun', 'has been delivered to Earth in a fancy box set comprising twenty-seven episodes of the TV show plus zany bonus material such as a colorful booklet entitled,', 'A Guide To Living On Earth', '. Four DVDs further showcase the Solomon family, alien outcasts who have been sent to Earth to investigate human concerns. Equipped with the ability to feel human emotions but lacking the knowledge of how to handle them,', '3rd Rock', \"'s Dick (John Lithgow), Sally (Kristen Johnson), Harry (French Stewart), and Tommy (Joseph Gordon-Levitt), take instructions from leader, Big Giant Head, but are often left to make sense out of chaos, creating settings for optimal comic effect. Masterfully written by co-creators Bonnie and Terry Turner (\", 'That 70s Show', '),', '3rd Rock', \"\\x92s original combination of smart wit and slapstick comedy is still hilarious ten years after the show's inception.\", 'The third season delves into core human experiences, namely love and fear. In a two-part episode kicking off the season, Dick is assigned a wife (Rosanne Barr) by Big Giant Head, disrupting his plan to marry his true love, human and co-star, Mary Albright (Jane Curtin). During a series of rude awakenings occurring over several episodes, Dick learns in trial-by-fire fashion that human trust isn\\'t easily won back, as Mary repeatedly rejects his apologies for not confessing his secret. Subplots about Dick\\'s attraction to Venusians and his hookup with a human woman (Auto Erodicka) temper his heartbreak with whimsical commentary on humankind\\'s sexual nature. Highlights include the Halloween special \"Scaredy Dick,\" in which the cast dress up, and Dick goes as a pirate to disguise his fear of getting a doctor\\'s check-up. Also brilliant is \"Just Your Average Dick,\" featuring a cameo appearance by John Cleese, who shows the aliens that there\\'s more to being human than simply fitting in.', '--Trinie Dalton']\n{'Genre': 'Comedy', 'Format': 'Box set, Color, Closed-captioned, Full Screen, NTSC', 'Contributor': 'John Lithgow, French Stewart', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '4', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.25 x 5.25 x 1.75 inches; 13.6 Ounces', 'Director': 'French Stewart', 'Media Format': 'Box set, Color, Closed-captioned, Full Screen, NTSC', 'Run time': '9 hours and 54 minutes', 'Release date': 'February 21, 2006', 'Actors': 'John Lithgow', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '4'}\nJust a great funny classic that was made the way comedy could for all ages. I bought all the series from Amazon and have enjoyed them all\nGreat Classics\n3rd Rock From the Sun - Season 2\nJohn Lithgow  (Actor),     Kristen Johnston  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Aliens have come to Earth to learn about its population, customs, etc. To blend in, they have taken on human form which gives them human emotions but no comprehension of how to decipher such emotions. Their uninhibited and candid reactions along with their complete lack of social etiquette turn everyday events into unusual, awkward and hilarious situations. Watch this army of lovable clueless resident \"visitors\" as they make their way through everyday life, observing the humans\\' every move.']\n{'Format': 'Multiple Formats, Box set, Color, Closed-captioned, Full Screen, NTSC', 'Contributor': 'John Lithgow, Joseph Gordon-Levitt, Kristen Johnston', 'Language': 'English (Dolby Digital 2.0)', 'Number Of Discs': '4', 'Runtime': '9 hours and 32 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.5 x 5.6 x 1.5 inches; 14.4 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, Closed-captioned, Full Screen, NTSC', 'Run time': '9 hours and 32 minutes', 'Release date': 'October 25, 2005', 'Actors': 'John Lithgow, Kristen Johnston, Joseph Gordon-Levitt', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '4'}\nJust a great funny classic that was made the way comedy could for all ages. I bought all the series from Amazon and have enjoyed them all\nGreat Classics\nBones: Season 5\nDavid Boreanaz  (Actor),     Emily Deschanel  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'Dr. Temperance Brennan (Emily Deschanel) and Special Agent Seeley Booth (David Boreanaz) are back for more mystery, murder, and mayhem in the fifth season of', 'Bones', '. Relying on Brennan’s unparalleled scientific abilities and Booth’s street-wise instincts, the sexy, crime-solving duo and their team face everything from modern-day witches to murdered rock-n-rollers as they scramble for evidence to stop a gruesome serial killer. This spectacular new season brings a wedding, the show’s landmark 100th episode, and decisions Bones and Booth must make that could change their lives forever.', 'Amazon.com', 'At first glance,', 'Bones', \"is a solid crime procedural. But as the series enters its fifth season, it's clear that\", 'Bones', 'really works as a romantic drama as well. Not romantic in the mushy sense, but in a way that makes viewers\\' hearts skip a beat (from joy at seeing a good coupling, not from the shock of all the gory bodies being discovered, examined, and dissected). FBI special agent Seeley Booth (David Boreanaz) and forensic anthropologist Dr. Temperance \"Bones\" Brennan (Emily Deschanel) have a complicated relationship that gets stronger over time. The writers have done an admirable job in throwing viewers a few bones to hint at what could be for the pair and this is no more evident than in the season premiere, where Booth is given the OK to return to work and Bones returns from a soul-searching trip to Guatemala. And in the 100th episode (\"The Parts in the Sum of the Whole\"), which Boreanaz directed, the series goes back in time six years to when Booth first met Bones. And it\\'s clear that the two were attracted to each other then, sharing an admiration of solving a case efficiently and correctly. Who knew that decayed bodies could be such a turn-on? There\\'s a lot going on this season, and some of the episodes do fall short. The case revolving around witchcraft doesn\\'t ring true and the quest to ID body parts found in a shark isn\\'t up to par by', 'Bones', 'standards. But overall, the season is a winner. Whether the team is racing against time to deal with a serial killer, finding clues left by a compulsive hoarder, or simply celebrating another wedding, the viewer is left anticipating what comes next. The six-disc set includes all 22 episodes from the fifth season, which originally aired during the 2009-2010 television season. \"The Bodies of the Bones\" featurette is as fascinating as it is gross and \"The Nunchuck Way\" special feature is pretty cool. While the gag reel is fun to watch, it at times may leave you wondering if the actors purposely made mistakes simply to put on the DVD.', '--Jae-Ha Kim']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, Box set, Color, Dolby, Widescreen, NTSC, AC-3', 'Contributor': 'David Boreanaz, John Francis Daley, Tamara Taylor, Emily Deschanel, T.J. Thyne, Michaela Conlin', 'Language': 'Unqualified, English (Dolby Digital 5.1), French (Dolby Surround), Spanish (Dolby Surround)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.58 x 5.39 x 7.54 inches; 6.4 Ounces', 'Item model number': '24543674603', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Widescreen, NTSC, AC-3', 'Release date': 'October 5, 2010', 'Actors': 'David Boreanaz, Emily Deschanel, T.J. Thyne, Michaela Conlin, John Francis Daley', 'Subtitles': 'Spanish, French, English', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nYou will enjoy this dvd set as much as the original airing on TV. I have watched it several times. You have to if you enjoy the chemistry between Bones and Booth\nGreat Dvds for Bones Fans\nHeroes: Season 4\nJack Coleman  (Actor),     Hayden Panettiere  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Experience all the intrigue and suspense of Heroes: Season 4 in this 5-disc set that includes all 18 gripping episodes from the fourth season’s volume, Redemption. As the Heroes mourn fallen friends and face dangerous new foes, prepare for a wild ride — filled with shocking twists and turns — through an ominous funhouse that culminates in a Brave New World. Then step right up and explore hours of exclusive, behind-the-curtain magic with the show’s writers, stars and artists.']\n{'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'AC-3, Box set, Color, Multiple Formats, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Jack Coleman, Ali Larter, Ashley Crow, Masi Oka, Cristine Rose, Adrian Pasdar, Greg Grunberg, Jimmy Jean-Louis, Sendhil Ramamurthy, James Kyson-Lee, Hayden Panettiere, Milo Ventimiglia, Zachary QuintoJack Coleman, Ali Larter, Ashley Crow, Masi Oka, Cristine Rose, Adrian Pasdar, Greg Grunberg, Jimmy Jean-Louis, Sendhil Ramamurthy, James Kyson-Lee, Hayden Panettiere, Milo Ventimiglia, Zachary Quinto  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '13 hours and 32 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '5.7 x 1 x 7.5 inches; 9.6 Ounces', 'Item model number': 'BOX SET', 'Media Format': 'AC-3, Box set, Color, Multiple Formats, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '13 hours and 32 minutes', 'Release date': 'August 3, 2010', 'Actors': 'Jack Coleman, Hayden Panettiere, Milo Ventimiglia, Masi Oka, Sendhil Ramamurthy', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nAny Heroes fan will enjoy watching these dvds all over again. A must for the collection. Amazon makes it affordable so why stream when you can own them!\nGreat Series\nNCIS: Season 5\nMark Harmon  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['Product Description', 'Taking viewers behind the sealed doors of the military, NCIS follows the workings of investigators at the Naval Criminal Investigative Service. Led by the wise Special Agent Leroy Jethro Gibbs (Mark Harmon), a crack investigator with no qualms about bending the rules to find his answers, the team takes on cases involving terrorism, murder, espionage, and international arms smuggling. Gibbs is aided by homicide detective Anthony Dinozzo (Michael Weatherly), forensic scientist Abby Sciuto (Pauley Perrette), medical examiner Dr. Donald \"Ducky\" Mallard (Davi McCallum), computer expert Timothy McGee (Sean Murray), and department head Jennifer Shepard (Lauren Holly). This collection presents the series fifth season, including a shocking season finale that is sure to shake up the unit. Star: Mark Harmon, Lauren Holly, David McCallum, Sean Murray, Michael Weatherly, Special Features: Widescreen Format. Audio: 5.1 Surround Stereo English Running Time: 835 minutes.', 'Amazon.com', 'Describing season four of', 'NCIS', 'as \"the season of secrets,\" executive producer Shane Brennan suggests that season five (offered here with 18 episodes, including a two-part finale, on five discs) is \"the season of answers.\" For the most part, that\\'s true--but at season\\'s end, loyal viewers are likely to be thrown for a loop by the death of a major character and a startling set of changes bound to have a profound effect on the show\\'s future. Picking up where the previous year left off, this new batch jumps right in with a continuation of Special Agent Jethro Gibbs (Mark Harmon) and company\\'s pursuit of notorious international arms dealer La Grenouille (\"The Frog,\" played by Armand Assante), whom NCIS director Jenny Shepard (Lauren Holly) is particularly keen on taking down--a quest that\\'s complicated by the fact that the bad guy is a CIA asset, and by Agent Anthony DiNozzo\\'s (Michael Weatherly) love affair with La Grenouille\\'s daughter. That storyline, barely touched on thereafter, is resolved in the 14th episode, \"Internal Affairs.\" Meanwhile, the NCIS crew is distracted by an array of other cases, most of them involving murder. Of particular interest are several episodes related to Iraq and the War on Terror: a Naval officer of Syrian descent who\\'s suspected of being an Al Qaeda mole is murdered seconds after Gibbs talks him out of jumping off a building ledge; a Marine who\\'s having a violent bout of post-traumatic stress after returning from the Mideast turns out to be far worse off than that; Medical Examiner Donald \"Ducky\" Mallard (David McCallum) refuses to conduct an autopsy because of the deceased\\'s Muslim beliefs.', \"There's no doubt that\", 'NCIS', \"is slick, entertaining prime-time television in every respect: writing, acting, production values, music, and so on. Still, one's appreciation of the show largely depends on the characters' likeability, and that's very much a matter of taste. Gibbs may be a chick magnet, with four former wives and a past relationship with Shepard to prove it, but he's also a taciturn fellow with horrible social skills. DiNozzo's funny and insouciant, but his smugness and incessant razzing of computer nerd Timothy McGee (Sean Murray) soon becomes tiresome, while Shepard is steely and simply unlikeable (the most appealing characters are arguably McCallum's Mallard and Pauley Perrette's mouthy Abby Sciuto, the goth-like forensic expert). Bonus material includes cast and crew commentary on various episodes and a typical assortment of featurettes.\", '--Sam Graham']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.93 x 6.19 x 7.08 inches; 13.6 Ounces', 'Item model number': '64290844851', 'Media Format': 'AC-3, Box set, Color, Dolby, DVD, Widescreen, NTSC', 'Run time': '13 hours and 56 minutes', 'Release date': 'August 26, 2008', 'Actors': 'Mark Harmon', 'Language': 'Unqualified', 'Studio': 'Paramount', 'Number of discs': '5'}\nAny NCIS fan will enjoy watching these dvds all over again. A must for the collection. Amazon makes it affordable so why stream when you can own them!\nGreat Dvds\nNCIS: Season 4\nMark Harmon  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', 'TRT: 1054 MIN.', 'Amazon.com', 'The fourth season of', 'NCIS', \"begins with one of the investigators being charged with assassinating an Iranian prisoner. Former Mossad intelligence agent Ziva David (Cote de Pablo), who was introduced last season, has been framed, and there's only one man who can clear her name. Unfortunately, lead investigator Jethro Gibbs (Mark Harmon) has retired to Mexico. But since Harmon is the star of the show, Gibbs returns to the United States to help out his colleague. While most of his former team is happy, Tony DiNozzo (Michael Weatherly) has mixed feelings (During Gibbs' absence, DiNozzo became the de facto head of the team, and going back to being Gibbs' underling doesn't sit well with the usually easygoing special agent.). Like William Petersen on\", 'CSI', ', Harmon is instrumental to the success of', 'NCIS', \". Low-key and sarcastic, he injects humor and drama into a role that could've come off as dull. And while other cast members may come and go, his presence makes even some of the weaker storylines forgivable. In general, this season--which originally aired from 2006 to 2007--is full of well-developed plot lines that drive each episode along at a good pace. But there are some subplots that are trite: When agent Timothy McGee (Sean Murray) reveals that that book he's writing is based on his co-workers, it's not much of a reveal. Also, the serial-killer storyline in this season overstays its welcome by at least one episode. As NCIS director Jennifer Shepard, Lauren Holly makes a sometimes unlikable character come to life, especially when Shepard's motives are questionable. As the show's name suggests, the majority of crimes featured revolve around military personnel, but some of the show's best moments occur when they touch of the personal relationships between the characters. All 24 episodes are included in this six-disc box set, which also includes commentaries, a Q&A session with cast members answer fans' questions, and a surprisingly interesting look at the props used on the show.\", '--Jae-Ha Kim']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Closed-captioned, Color, Dolby, Subtitled', 'Contributor': 'Mark Harmon', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.96 x 5.49 x 7.72 inches; 10.88 Ounces', 'Item model number': '12266', 'Media Format': 'Closed-captioned, Color, Dolby, Subtitled', 'Run time': '17 hours and 33 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Mark Harmon', 'Studio': 'Paramount', 'Number of discs': '6'}\nAny NCIS fan will enjoy watching these dvds all over again. A must for the collection. Amazon makes it affordable so why stream when you can own them!\nGreat Series",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest**: Dramatic series and comedies, particularly with LGBTQ+ themes, alongside a strong appreciation for classic comedies and multi-generational storytelling.\n- **Content Type Preference**: Enjoys complete series DVD collections focusing on comprehensive narratives, character development, and humor, while showing a growing interest in well-crafted crime dramas with strong romantic dynamics and emotional undertones.\n- **Engagement**: Actively engages with complex human interactions and social dynamics, consistently favoring quality content that evokes emotional responses. Recently, the user has embraced revisiting beloved series, indicating a commitment to re-engaging with well-crafted narratives.\n- **Diversity in Audience**: Values inclusivity in viewership, favoring media that connect with diverse audiences across genders and sexual orientations while highlighting broad appeal in comedic storytelling.\n- **Emotional Connection**: Drawn to character-driven narratives that provoke thought and elicit emotional responses, with a fondness for heartfelt dramas and engaging series with intricate relationships.\n- **Recommendation Inclination**: Frequently shares positive experiences with engaging media, encouraging exploration of selections blending humor and emotional depth.\n- **Quality over Genre**: Prioritizes high-quality storytelling and character arcs, with an expanding appreciation for series combining action, suspense, and intricate relationships, emphasizing tangible ownership of complete collections. The user values the affordability and accessibility of owning complete series.",
  "metrics": {
    "rouge1_f": 0.03906126949125847,
    "rouge2_f": 0.0022057665038600913,
    "rougeL_f": 0.022050716648291068,
    "meteor": 0.010741722754775987,
    "bleu1": 6.62439514899192e-14,
    "bleu2": 2.0616026307974188e-14,
    "bleu3": 2.9194803869841995e-15,
    "bleu4": 1.0996800591300027e-15,
    "bertscore_precision": 0.35581427812576294,
    "bertscore_recall": 0.5335865020751953,
    "bertscore_f1": 0.4269339442253113
  }
}