{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/07/18\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Nutter', 'Alan Taylor', 'Alex Graves', 'Miguel Sapochnik', 'Mark Mylod', 'Jeremy Podeswa', 'Daniel Minahan', 'Alik Sakharov', 'Michelle MacLaren', 'Brian Kirk'], 'Producers': ['Bernadette Caulfield', 'Frank Doelger', 'David Benioff', 'D.B. Weiss', 'Carolyn Strauss', 'Guymon Casady', 'Vince Gerardis', 'George R.R. Martin', 'Alan Taylor', 'Vanessa Taylor'], 'Starring': ['Peter Dinklage', 'Lena Headey', 'Michelle Fairley'], 'Studio': ['Discovery Global']}\nReview Text: This is such a great series.  The acting is fantastic, set design, music and costuming are spectacular and the story moves along at a good pace.  It's the kind of show one has to see over and over again to take in all of the facets of the production.  I wish there were more like it!!!!  Thank you for speedy delivery and excellent product.\nReview Title: Excellent production\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Strauss Family\nDerek Jacobi  (Actor),     Jane Seymour  (Actor),     David Giles  (Director),     Peter Potter  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Two generations of genius are brought to life in this lavish, eight-part British miniseries about one of the most talented musical families in history. THE STRAUSS FAMILY spans 85 years and chronicles the rise of Johann Strauss, Sr. from his humble beginnings to becoming one of the most famous musicians in Europe. But at the height of his success, a series of scandalous love affairs estrange him from his wife and prodigiously talented son Johann, Jr. Father and son soon become fierce rivals in the musical and political worlds of nineteenth-century Austria. THE STRAUSS FAMILY follows the advancing career of the younger Strauss as he achieves even greater fame as Vienna s Waltz King, celebrated even today for the Blue Danube waltz and Die Fledermaus. With a superb cast including Emmy-award winner actors Derek Jacobi (Anastezsi) and Jane Seymour (Dr. Quinn, Medicine Woman), and glorious renditions of the Strauss s works by the London Symphony Orchestra, THE STRAUSS FAMILY is a dramatic family saga of tragedy and triumph. DVD Features: Cast Biographies; Selected List of Compositions', 'Amazon.com', \"British teledrama and miniseries fans--and classical music lovers--will love 1972's\", 'The Strauss Family', ', a soapy, well-acted look at the life of the Strauss musical dynasty in Vienna.', 'The Strauss Family', 'is as compulsively watchable as any dysfunctional family drama, from', 'Dallas', 'to', 'Arrested Development', \"--but the power mongering happening in 19th-century Vienna was far more subtle in the musical world. The miniseries focuses on Johann, played with equal parts passion and lazy excess by the talented young actor Eric Woofe, whose last performance this series would be. Johann's brother, Josef (Nicolas Simmonds), was the disciplined half of the brother act, though ultimately not nearly as talented as Johann.\", 'The Strauss Family', 'traces the beginnings of the popularity of the Strauss waltz and shows just how proletarian the three-quarter time dance was in 19th-century Vienna--it almost looks like a pogo mosh pit in the local pubs where the Strauss brothers play to be barely heard above the beery din. Another treat in', 'The Strauss Family', \"is seeing talented young British actors just before their mega stardom, including Derek Jacobi, who has a small role as Johann's confidante, Josef Lanner. Jacobi steals every scene he's in, in a precursor to his career-changing role just four years later in\", 'I, Claudius', '. Also making appearances are the comely young Jane Seymour and the very talented Georgina Hale, in smaller roles. The set includes cast biographies and a handy list of compositions, though even non-classical music fans will recognize the strains of \"The Blue Danube\" and arias from', 'Die Fledermaus', '.', 'The Strauss Family', 'is equally a rich tribute to a dynasty of talent and an entertaining bodice-ripper--one that can double as a music-appreciation class. --', 'A.T. Hurley']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'David Giles, Jane Seymour, Peter Potter, Derek Jacobi, David Reid', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo)', 'Runtime': '6 hours and 48 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'David Giles, Peter Potter, David Reid', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours and 48 minutes', 'Release date': 'July 29, 2008', 'Actors': 'Derek Jacobi, Jane Seymour', 'Studio': 'A&E Home Video', 'Number of discs': '2'}\nVery entertaining and well acted story of the Kings of the Viennese Waltz. We are never disappointed in orders that we have placed with Amazon.  They always arrive in tact, well packaged and on or ahead of the scheduled delivery date.  Thank you.\nStrauss Family\nDownton Abbey: Season 4\nFormat: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nEnjoy the series and characters.  The quality of both the product and content is excellent.  Can hardly wait for the next installment which I will most certainly be ordering from Amazon.  Thank you\nQuality product and content\nI, Claudius (35th Anniversary Edition)\nSian Phillips  (Actor),     Derek Jacobi  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['\"A true masterpiece\" —', 'San Francisco Chronicle', '\"Fiendishly sophisticated\" —', 'The New York Times', '\"Handsomely produced, grandly acted, and…thoroughly involving\" —', 'The Washington Post', '\"Irresistible, witty\" —', 'Los Angeles Times', 'Rated one of the \"100 Best TV Shows of All Time\" by Time magazine, this epic BBC series spans the history of the Roman Empire from Augustus through Claudius, a stuttering scholar who learns early to play the fool and stay alive. Based on the novels by Robert Graves, it stars Derek Jacobi (', 'The King’s Speech', ',', 'Cadfael', ') in a career-defining role. Siân Phillips (', 'The Age of Innocence', ') is “exquisitely wicked” (Los Angeles Times) as the lethal Livia, wife to Augustus (Brian Blessed,', 'Hamlet', '), while John Hurt (', 'The Elephant Man', ') is \"decadence personified\" (', 'USA Today', ') as the depraved Caligula, whose reign of terror paves the way for Claudius’s ascension.', 'Winner of an Emmy® and numerous other awards, this riveting tale of ambition, debauchery, and intrigue remains one of the most popular and acclaimed dramas in Masterpiece Theatre history. Patrick Stewart (', 'X-Men', '), George Baker (', 'The Ruth Rendell Mysteries', '), Margaret Tyzack (', 'Cousin Bette', '), and James Faulkner (', 'The Bank Job', ') also star.']\n{'Genre': 'Drama/Television, Television/British Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Patrick Stewart, John Hurt, Sian Phillips, Derek Jacobi', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.64 Ounces', 'Item model number': '8750', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '11 hours and 8 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Sian Phillips, Derek Jacobi, Patrick Stewart, John Hurt', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Number of discs': '5'}\nIncredibly well done performance.  Every actor and actress played his/her role impeccably.  It was a horrible, bloody time historically but it is beautifully captured in this series.\nIncredibly Well Done\nThe Jewel in the Crown (25th Anniversary Edition)\nPeggy Ashcroft  (Actor),     Charles Dance  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, A&E Home Video, All A&E Titles\n['JEWEL IN THE CROWN, THE: 25TH ANNIV. ED.']\n{'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Art Malik, Charles Dance, Peggy Ashcroft', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Runtime': '12 hours and 58 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.25 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 58 minutes', 'Release date': 'September 30, 2008', 'Actors': 'Peggy Ashcroft, Charles Dance, Art Malik', 'Studio': 'A&E Home Video', 'Number of discs': '4'}\nWell done!!!  As usual, the English have scored another home run with this series.  Every character in this series plays his or her part to perfection!!  The background, scenery and costuming is terrific.  Bravo.\nBeautifully done\nDoc Martin Series 6\nMartin Clunes  (Actor),     Caroline Catz  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['\"“Sweet, stirring, and completely addictive” —', 'Slate', '“One of the funniest, most entertaining shows on television” —', 'Sunday Express', '(U.K.)  He’s surly, tactless, self-centered, and uptight—but he’s the only doctor in town.  Even on his own wedding day, Dr. Martin Ellingham (Martin Clunes,', 'Men Behaving Badly', ') is all scowls. Then following a calamitous honeymoon, he and Louisa (Caroline Catz,', 'DCI Banks', ') must learn to live together, raise a child, and manage two careers. It’s a big adjustment for both, especially Martin, who’s unaccustomed to clutter and noise. And yet he’s still not as picky as their OCD manny.  Factor in the Doc’s usual string of batty patients—including a hypochondriac, a hoarder, two elderly tattoo artists, and a bumbling constable with a string of self-inflicted injuries—and Martin is soon more ill-tempered than ever. Plus, his crippling blood phobia is back, and his ghastly mother (Claire Bloom,', 'The King’s Speech', ') picks a bad time to show up at the Ellinghams’ door. With much at stake, Martin turns for advice to his aunt Ruth (Emmy', 'winner Eileen Atkins,', 'Cranford', '), perhaps the sanest person in Portwenn—but it may already be too late.  Contains graphic medical scenes', 'Episodes', 'Sickness and Health', 'Sickness and Health', 'Guess Who’s Coming to Dinner', 'Guess Who’s Coming to Dinner', 'The Tameness of a Wolf', 'The Tameness of a Wolf', 'Nobody Likes Me', 'Nobody Likes Me', 'The Practice Around the Corner', 'The Practice Around the Corner', 'Hazardous Exposure', 'Hazardous Exposure', 'Listen with Mother', 'Listen with Mother', 'Departure', 'Departure']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 5.12 Ounces', 'Item model number': 'ACRN2145DVD', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '6 hours and 24 minutes', 'Release date': 'December 10, 2013', 'Actors': 'Doc Martin, Martin Clunes, Caroline Catz, Ian McNeice, Joe Absolom', 'Studio': 'ACORN MEDIA', 'Number of discs': '2'}\nRefreshingly fun and entertaining.  I am looking forward to the next installment with great anticipation.\nRefreshing\nDoc Martin Special Collection: Series 1-5 plus the Movies\nClunes, Martin  (Actor),     Catz, Caroline  (Actor),     Ferguson, Craig  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['“Sweet, stirring, and completely addictive” ––', 'Slate', '“Delightfully quirky” —', 'Los Angeles Times', 'He’s surly, tactless, self-centered, and uptight—but he’s the only doctor in town.  Relocating to the picturesque village of Portwenn is not what this doctor ordered. After developing a crippling fear of blood, hotshot London surgeon Martin Ellingham (Martin Clunes,', 'Men Behaving Badly', ') reluctantly retrains as a GP and opens a practice in the quirky seaside town, where he quickly offends the villagers with his dour and dismissive bedside manner.  In these five complete series, Doc Martin catches the eye of the most beautiful woman in Portwenn (Caroline Catz,', 'Murder in Suburbia', '), tests the patience of his long-suffering aunt (Stephanie Cole,', 'Tenko', '), and repeatedly hurts feelings as he heals bodies. The two feature-length movies reveal the character’s first incarnation as Dr. Martin Bamford. He’s still ornery but less socially inept, an obstetrician fleeing to the coastal village to reassess his marriage and career.  Martin Clunes delivers an uproarious lead performance, aided by outstanding supporting casts, in this award-winning fish-out-of-water comedy.']\n{'Genre': 'Comedy', 'Format': 'Box set, Widescreen, Multiple Formats, NTSC, Color', 'Contributor': 'Absolom, Joe, Clunes, Martin, Catz, Caroline, McNeice, Ian, Ferguson, Craig', 'Language': 'English', 'Number Of Discs': '13', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 3.6 x 7.7 inches; 15.2 Ounces', 'Item model number': '21388', 'Director': 'Ferguson, Craig', 'Media Format': 'Box set, Widescreen, Multiple Formats, NTSC, Color', 'Run time': '32 hours and 45 minutes', 'Release date': 'May 7, 2013', 'Actors': 'Clunes, Martin, Catz, Caroline, McNeice, Ian, Absolom, Joe', 'Studio': 'ACORN MEDIA', 'Number of discs': '13'}\nLove the series.  The individual characters and their unique situations are priceless and the filming location is breathtakingly beautiful.  Nothing has been overlooked in this story.\nLove the series\nGame of Thrones: Season 5\nPeter Dinklage  (Actor),     Lena Headey  (Actor)    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Emmy Central, Emmy Nominees\n['Game of Thrones: The Complete Fifth Season (DVD)', \"A plethora of compelling storylines play out to their inevitable, often bloody conclusions in Season 5 of HBO's blockbuster, Emmy(R)-winning drama series. In the wake of the numerous shocking deaths of Season 4, the season opens with a power vacuum that the various players all across Westeros and Essos scramble to fill. At Castle Black, Jon Snow must balance the demands of the Night's Watch with those of the newly arrived Stannis Baratheon. Meanwhile, Cersei struggles to hold on to power in King's Landing; Jaime embarks on a secret mission; Arya seeks out an old friend; Tyrion--now a fugitive--finds a new cause; and Daenerys finds that her tenuous hold on the city of Meereen requires hard sacrifices.\", ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Full Screen, NTSC, Box set', 'Contributor': 'Nathalie Emmanuel, Liam Cunningham, Diana Rigg, Frank Doelger, Kristofer Hivju, David Benioff, Bryan Cogman, Indira Varma, Alfie Allen, Lisa McAtackney, Iwan Rheon, Jessica Henwick, Natalie Dormer, Toby Sebastian, Conleth Hill, Deobia Oparei, Guymon Casady, Maisie Williams, D. B. Weiss, Keisha Castle-Hughes, Greg Spence, Jonathan Pryce, John Bradley, Dean-Charles Chapman, Peter Dinklage, Stephen Dillane, Gwendoline Christie, Michiel Huisman, Rory McCann, Bernie Caulfield, Lena Headey, Jerome Flynn, Bernadette Caulfield, Carice van Houten, Nikolaj Coster-Waldau, Nell Tiger Free, George R.R. Martin, Christopher Newman, Vince Gerardis, Sophie Turner, Carolyn Strauss, Iain Glen, Emilia Clarke, Michael McElhatton, Kit Harington, Aidan Gillen, Tom Wlaschiha, Rosabell Laurenti Sellers, Alexander Siddig, Chris Newman, D.B. WeissNathalie Emmanuel, Liam Cunningham, Diana Rigg, Frank Doelger, Kristofer Hivju, David Benioff, Bryan Cogman, Indira Varma, Alfie Allen, Lisa McAtackney, Iwan Rheon, Jessica Henwick, Natalie Dormer, Toby Sebastian, Conleth Hill, Deobia Oparei, Guymon Casady, Mai…  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.32 Ounces', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Box set', 'Run time': '559 minutes', 'Release date': 'March 15, 2016', 'Actors': 'Peter Dinklage, Lena Headey, Emilia Clarke, Nikolaj Coster-Waldau, Aidan Gillen', 'Producers': 'David Benioff, Christopher Newman, Greg Spence, D. B. Weiss, Lisa McAtackney', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nAs a devoted fan of Games of Thrones, I am delighted to add Season 5 to my collection.  It is a wonderful series and I see new things in it every time a watch each series.  Thank you so much for speedy delivery and a quality product.\nDelightful addition to my collection\nMasterpiece: Downton Abbey Season 6\nHugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter  (Actor),     .  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Return to Downton Abbey for the sixth and final season to discover the fates of the Crawley family, and the servants who work for them, as they face new challenges and begin forging different paths in a rapidly changing world. Creator Julian Fellowes brings the top PBS drama of all time to its climactic chapter, with the beloved ensemble led by Hugh Bonneville, Michelle Dockery, Elizabeth McGovern, and Maggie Smith.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': '02578', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '9 hours', 'Release date': 'January 26, 2016', 'Actors': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '1'}\nI am a devoted fan of Downton Abbey and have watched each and every episode.  It is wonderful to add each season to my collection so that I can see it again.  Thank you for prompt delivery and quality product.\nLove the Series\nGame of Thrones: Season 4\nAlfie Allen  (Actor),     John Bradley  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Emmy Central, Emmy Nominees\n['Game of Thrones is one of HBO’s signature series and a huge runaway hit for the network. This year, a plethora of compelling storylines will play out to their inevitable, and bloody, conclusions. As the season begins, encouraged by the Red Wedding slaughter in the Riverlands that wiped out many of their Stark nemeses, the Lannisters’ hold on the Iron Throne remains intact … but can they survive their own egos as well as new and ongoing threats from the south, north and east? While an unbowed Stannis Baratheon continues to rebuild his army in Dragonstone, a more immediate danger comes from the south, as Oberyn Martell, the Lannister-loathing “Red Viper of Dorne,” arrives at King’s Landing to attend Joffrey’s wedding to Margaery Tyrell, and perhaps act on an ulterior agenda. In the north, a depleted Night’s Watch seems overmatched against the inexorable Wall advances of Mance Rayder’s army of wildlings, which in turn is being trailed by an even more formidable foe: the undead White Walkers. If that’s not enough, Daenerys Targaryen, accompanied by her fierce trio of dragons and Unsullied army, is poised to \"liberate\" Meereen, the largest Slaver City in the east, which could provide her with an imposing force to execute her ultimate plan: to sail to Westeros and reclaim the Iron Throne the Lannisters usurped from her family.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, NTSC, Subtitled', 'Contributor': 'Jack Gleeson, John Bradley, Liam Cunningham, Charles Dance, Peter Dinklage, Frank Doelger, Stephen Dillane, Gwendoline Christie, Rory McCann, Jerome Flynn, Lena Headey, Bernadette Caulfield, Rose Leslie, Carice van Houten, Nikolaj Coster-Waldau, David Benioff, George R.R. Martin, Christopher Newman, Sibel Kekilli, Alfie Allen, Vince Gerardis, Sophie Turner, Carolyn Strauss, Iain Glen, Emilia Clarke, Natalie Dormer, Conleth Hill, Kit Harington, Aidan Gillen, Dianna Rigg, Guymon Casady, Isaac Hempstead Wright, D. B. Weiss, Maisie WilliamsJack Gleeson, John Bradley, Liam Cunningham, Charles Dance, Peter Dinklage, Frank Doelger, Stephen Dillane, Gwendoline Christie, Rory McCann, Jerome Flynn, Lena Headey, Bernadette Caulfield, Rose Leslie, Carice van Houten, Nikolaj Coster-Waldau, David Benioff, George R.R.…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.32 Ounces', 'Item model number': '375576', 'Media Format': 'Multiple Formats, NTSC, Subtitled', 'Run time': '9 hours and 10 minutes', 'Release date': 'February 17, 2015', 'Actors': 'Alfie Allen, John Bradley, Gwendoline Christie, Emilia Clarke, Nikolaj Coster-Waldau', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Thai, Korean, Spanish, Portuguese, French', 'Producers': 'Christopher Newman, David Benioff, D. B. Weiss, Carolyn Strauss, Frank Doelger', 'Studio': 'HBO', 'Number of discs': '5'}\nThis is one of my favorite seasons.  As a devoted fan of the show, I look forward to each and every episode of this series.  It is great to have them all in my collection so that I can see them again at any time.  Thank you for speedy delivery and quality product\nThis is my favorite season of Game of Thrones\nGame of Thrones: Season 3\nPeter Dinklage  (Actor),     Lena Headey  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['In the third season of the hit HBO drama series', 'Game of Thrones', ', the Lannisters are barely holding onto power after a savage naval onslaught from Stannis Baratheon, while stirrings in the North threaten to alter the overall balance of power in Westeros. Robb Stark, King in the North, is facing major calamity in his efforts to build on his victories over the Lannisters while beyond the Wall, Mance Rayder and his huge army of wildlings continue their inexorable march south. Across the Narrow Sea, Daenerys Targaryen - reunited with her three fast-maturing dragons - attempts to raise an army to sail with her from Essos, in hopes of eventually claiming the Iron Throne.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, NTSC, Full Screen, Subtitled', 'Contributor': 'Nathalie Emmanuel, Jack Gleeson, Jacob Anderson, Tara Fitzgerald, Clive Russell, John Bradley, Liam Cunningham, Diana Rigg, Peter Dinklage, Charles Dance, Stephen Dillane, Frank Doelger, Gwendoline Christie, Rory McCann, Lena Headey, Jerome Flynn, Ciarán Hinds, Bernadette Caulfield, Kristofer Hivju, Michelle Fairley, Richard Dormer, Carice van Houten, Rose Leslie, Vanessa Taylor, Nikolaj Coster-Waldau, David Benioff, Tobias Menzies, George R.R. Martin, Sibel Kekilli, Alan Taylor, Alfie Allen, Iwan Rheon, Vince Gerardis, Sophie Turner, Carolyn Strauss, Iain Glen, Emilia Clarke, Natalie Dormer, Conleth Hill, Kit Harington, Aidan Gillen, James Cosmo, Guymon Casady, Isaac Hempstead Wright, Maisie Williams, D. B. Weiss, Richard MaddenNathalie Emmanuel, Jack Gleeson, Jacob Anderson, Tara Fitzgerald, Clive Russell, John Bradley, Liam Cunningham, Diana Rigg, Peter Dinklage, Charles Dance, Stephen Dillane, Frank Doelger, Gwendoline Christie, Rory McCann, Lena Headey, Jerome Flynn, Ciarán Hinds, Bern…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '1.5 x 5.7 x 7.6 inches; 5.44 Ounces', 'Item model number': '265146', 'Media Format': 'Multiple Formats, NTSC, Full Screen, Subtitled', 'Run time': '9 hours and 10 minutes', 'Release date': 'February 18, 2014', 'Actors': 'Peter Dinklage, Lena Headey, Michelle Fairley, Emilia Clarke, Nikolaj Coster-Waldau', 'Subtitles': 'Korean, Spanish, Portuguese, Thai, French, English', 'Producers': 'David Benioff, D. B. Weiss, Carolyn Strauss, Alan Taylor, Frank Doelger', 'Studio': 'HBO Studios', 'Writers': 'David Benioff, D. B. Weiss', 'Number of discs': '5'}\nThank you for speedy delivery and great quality of this cherished edition to my collection of Game of Thrones.  It is a wonderful series and I am so thankful that I can go back through and see each episode over.  There is so much to see and appreciate that it has to be viewed over and over.\nWonderful Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Nutter', 'Alan Taylor', 'Alex Graves', 'Miguel Sapochnik', 'Mark Mylod', 'Jeremy Podeswa', 'Daniel Minahan', 'Alik Sakharov', 'Michelle MacLaren', 'Brian Kirk'], 'Producers': ['Bernadette Caulfield', 'Frank Doelger', 'David Benioff', 'D.B. Weiss', 'Carolyn Strauss', 'Guymon Casady', 'Vince Gerardis', 'George R.R. Martin', 'Alan Taylor', 'Vanessa Taylor'], 'Starring': ['Peter Dinklage', 'Lena Headey', 'Michelle Fairley'], 'Studio': ['Discovery Global']}\nThis is such a great series.  The acting is fantastic, set design, music and costuming are spectacular and the story moves along at a good pace.  It's the kind of show one has to see over and over again to take in all of the facets of the production.  I wish there were more like it!!!!  Thank you for speedy delivery and excellent product.\nExcellent production",
  "profile": "**Updated User Profile Summary**\n\n- **Interests**: The user maintains a profound passion for classic British drama and historical miniseries, now complemented by a notable admiration for epic fantasy series distinguished by intricate plots and complex character dynamics.\n\n- **Genres**: Their enthusiasm for drama remains consistent, enriched by interests in family, historical, musical, comedy, and fantasy genres that explore multifaceted character relationships and societal themes.\n\n- **Content Preferences**: The user demonstrates a strong appreciation for productions featuring talented actors and rich storytelling. They favor series that reward repeated viewings by offering new insights, enhancing the overall experience.\n\n- **Presentation Preferences**: They reinforce their preference for media formats that enhance the viewing journey, particularly collections that include behind-the-scenes content and extras, underlining their desire for a comprehensive understanding of production processes.\n\n- **Buying Behavior**: The user shows loyalty to trusted media platforms, actively collecting high-quality products and expressing satisfaction with timely deliveries.\n\n- **Viewer Experience**: They exhibit a strong preference for narratives intertwining drama and fantasy, eagerly anticipating new releases that promise compelling storytelling and engaging character arcs.\n\n- **General Attitude**: Their positive engagement with content highlights a fondness for series that invite contemplation and reward multiple viewings. They value high production quality in their collections, consistently expressing appreciation for excellent products and speedy delivery.",
  "metrics": {
    "rouge1_f": 0.05651340996168583,
    "rouge2_f": 0.004791566842357451,
    "rougeL_f": 0.032567049808429116,
    "meteor": 0.01558980304814816,
    "bleu1": 8.620100350991026e-10,
    "bleu2": 2.2486050570445163e-10,
    "bleu3": 3.338489481233077e-11,
    "bleu4": 1.2875669145446074e-11,
    "bertscore_precision": 0.3437598943710327,
    "bertscore_recall": 0.5120001435279846,
    "bertscore_f1": 0.41134220361709595
  }
}