{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Game of Thrones: Season 5\nReview Date: 2016/07/18\nStore: Peter Dinklage  (Actor),     Lena Headey  (Actor)    Format: DVD\nCategories: Movies & TV, Award Winners in Movies & TV, Emmy Central, Emmy Nominees\nProduct Description: ['Game of Thrones: The Complete Fifth Season (DVD)', \"A plethora of compelling storylines play out to their inevitable, often bloody conclusions in Season 5 of HBO's blockbuster, Emmy(R)-winning drama series. In the wake of the numerous shocking deaths of Season 4, the season opens with a power vacuum that the various players all across Westeros and Essos scramble to fill. At Castle Black, Jon Snow must balance the demands of the Night's Watch with those of the newly arrived Stannis Baratheon. Meanwhile, Cersei struggles to hold on to power in King's Landing; Jaime embarks on a secret mission; Arya seeks out an old friend; Tyrion--now a fugitive--finds a new cause; and Daenerys finds that her tenuous hold on the city of Meereen requires hard sacrifices.\", ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Full Screen, NTSC, Box set', 'Contributor': 'Nathalie Emmanuel, Liam Cunningham, Diana Rigg, Frank Doelger, Kristofer Hivju, David Benioff, Bryan Cogman, Indira Varma, Alfie Allen, Lisa McAtackney, Iwan Rheon, Jessica Henwick, Natalie Dormer, Toby Sebastian, Conleth Hill, Deobia Oparei, Guymon Casady, Maisie Williams, D. B. Weiss, Keisha Castle-Hughes, Greg Spence, Jonathan Pryce, John Bradley, Dean-Charles Chapman, Peter Dinklage, Stephen Dillane, Gwendoline Christie, Michiel Huisman, Rory McCann, Bernie Caulfield, Lena Headey, Jerome Flynn, Bernadette Caulfield, Carice van Houten, Nikolaj Coster-Waldau, Nell Tiger Free, George R.R. Martin, Christopher Newman, Vince Gerardis, Sophie Turner, Carolyn Strauss, Iain Glen, Emilia Clarke, Michael McElhatton, Kit Harington, Aidan Gillen, Tom Wlaschiha, Rosabell Laurenti Sellers, Alexander Siddig, Chris Newman, D.B. WeissNathalie Emmanuel, Liam Cunningham, Diana Rigg, Frank Doelger, Kristofer Hivju, David Benioff, Bryan Cogman, Indira Varma, Alfie Allen, Lisa McAtackney, Iwan Rheon, Jessica Henwick, Natalie Dormer, Toby Sebastian, Conleth Hill, Deobia Oparei, Guymon Casady, Mai…  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.32 Ounces', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Box set', 'Run time': '559 minutes', 'Release date': 'March 15, 2016', 'Actors': 'Peter Dinklage, Lena Headey, Emilia Clarke, Nikolaj Coster-Waldau, Aidan Gillen', 'Producers': 'David Benioff, Christopher Newman, Greg Spence, D. B. Weiss, Lisa McAtackney', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nReview Text: As a devoted fan of Games of Thrones, I am delighted to add Season 5 to my collection.  It is a wonderful series and I see new things in it every time a watch each series.  Thank you so much for speedy delivery and a quality product.\nReview Title: Delightful addition to my collection\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Strauss Family\nDerek Jacobi  (Actor),     Jane Seymour  (Actor),     David Giles  (Director),     Peter Potter  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Two generations of genius are brought to life in this lavish, eight-part British miniseries about one of the most talented musical families in history. THE STRAUSS FAMILY spans 85 years and chronicles the rise of Johann Strauss, Sr. from his humble beginnings to becoming one of the most famous musicians in Europe. But at the height of his success, a series of scandalous love affairs estrange him from his wife and prodigiously talented son Johann, Jr. Father and son soon become fierce rivals in the musical and political worlds of nineteenth-century Austria. THE STRAUSS FAMILY follows the advancing career of the younger Strauss as he achieves even greater fame as Vienna s Waltz King, celebrated even today for the Blue Danube waltz and Die Fledermaus. With a superb cast including Emmy-award winner actors Derek Jacobi (Anastezsi) and Jane Seymour (Dr. Quinn, Medicine Woman), and glorious renditions of the Strauss s works by the London Symphony Orchestra, THE STRAUSS FAMILY is a dramatic family saga of tragedy and triumph. DVD Features: Cast Biographies; Selected List of Compositions', 'Amazon.com', \"British teledrama and miniseries fans--and classical music lovers--will love 1972's\", 'The Strauss Family', ', a soapy, well-acted look at the life of the Strauss musical dynasty in Vienna.', 'The Strauss Family', 'is as compulsively watchable as any dysfunctional family drama, from', 'Dallas', 'to', 'Arrested Development', \"--but the power mongering happening in 19th-century Vienna was far more subtle in the musical world. The miniseries focuses on Johann, played with equal parts passion and lazy excess by the talented young actor Eric Woofe, whose last performance this series would be. Johann's brother, Josef (Nicolas Simmonds), was the disciplined half of the brother act, though ultimately not nearly as talented as Johann.\", 'The Strauss Family', 'traces the beginnings of the popularity of the Strauss waltz and shows just how proletarian the three-quarter time dance was in 19th-century Vienna--it almost looks like a pogo mosh pit in the local pubs where the Strauss brothers play to be barely heard above the beery din. Another treat in', 'The Strauss Family', \"is seeing talented young British actors just before their mega stardom, including Derek Jacobi, who has a small role as Johann's confidante, Josef Lanner. Jacobi steals every scene he's in, in a precursor to his career-changing role just four years later in\", 'I, Claudius', '. Also making appearances are the comely young Jane Seymour and the very talented Georgina Hale, in smaller roles. The set includes cast biographies and a handy list of compositions, though even non-classical music fans will recognize the strains of \"The Blue Danube\" and arias from', 'Die Fledermaus', '.', 'The Strauss Family', 'is equally a rich tribute to a dynasty of talent and an entertaining bodice-ripper--one that can double as a music-appreciation class. --', 'A.T. Hurley']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'David Giles, Jane Seymour, Peter Potter, Derek Jacobi, David Reid', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo)', 'Runtime': '6 hours and 48 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'David Giles, Peter Potter, David Reid', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours and 48 minutes', 'Release date': 'July 29, 2008', 'Actors': 'Derek Jacobi, Jane Seymour', 'Studio': 'A&E Home Video', 'Number of discs': '2'}\nVery entertaining and well acted story of the Kings of the Viennese Waltz. We are never disappointed in orders that we have placed with Amazon.  They always arrive in tact, well packaged and on or ahead of the scheduled delivery date.  Thank you.\nStrauss Family\nDownton Abbey: Season 4\nFormat: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nEnjoy the series and characters.  The quality of both the product and content is excellent.  Can hardly wait for the next installment which I will most certainly be ordering from Amazon.  Thank you\nQuality product and content\nI, Claudius (35th Anniversary Edition)\nSian Phillips  (Actor),     Derek Jacobi  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['\"A true masterpiece\" —', 'San Francisco Chronicle', '\"Fiendishly sophisticated\" —', 'The New York Times', '\"Handsomely produced, grandly acted, and…thoroughly involving\" —', 'The Washington Post', '\"Irresistible, witty\" —', 'Los Angeles Times', 'Rated one of the \"100 Best TV Shows of All Time\" by Time magazine, this epic BBC series spans the history of the Roman Empire from Augustus through Claudius, a stuttering scholar who learns early to play the fool and stay alive. Based on the novels by Robert Graves, it stars Derek Jacobi (', 'The King’s Speech', ',', 'Cadfael', ') in a career-defining role. Siân Phillips (', 'The Age of Innocence', ') is “exquisitely wicked” (Los Angeles Times) as the lethal Livia, wife to Augustus (Brian Blessed,', 'Hamlet', '), while John Hurt (', 'The Elephant Man', ') is \"decadence personified\" (', 'USA Today', ') as the depraved Caligula, whose reign of terror paves the way for Claudius’s ascension.', 'Winner of an Emmy® and numerous other awards, this riveting tale of ambition, debauchery, and intrigue remains one of the most popular and acclaimed dramas in Masterpiece Theatre history. Patrick Stewart (', 'X-Men', '), George Baker (', 'The Ruth Rendell Mysteries', '), Margaret Tyzack (', 'Cousin Bette', '), and James Faulkner (', 'The Bank Job', ') also star.']\n{'Genre': 'Drama/Television, Television/British Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Patrick Stewart, John Hurt, Sian Phillips, Derek Jacobi', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.64 Ounces', 'Item model number': '8750', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '11 hours and 8 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Sian Phillips, Derek Jacobi, Patrick Stewart, John Hurt', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Number of discs': '5'}\nIncredibly well done performance.  Every actor and actress played his/her role impeccably.  It was a horrible, bloody time historically but it is beautifully captured in this series.\nIncredibly Well Done\nThe Jewel in the Crown (25th Anniversary Edition)\nPeggy Ashcroft  (Actor),     Charles Dance  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, A&E Home Video, All A&E Titles\n['JEWEL IN THE CROWN, THE: 25TH ANNIV. ED.']\n{'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Art Malik, Charles Dance, Peggy Ashcroft', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Runtime': '12 hours and 58 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.25 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 58 minutes', 'Release date': 'September 30, 2008', 'Actors': 'Peggy Ashcroft, Charles Dance, Art Malik', 'Studio': 'A&E Home Video', 'Number of discs': '4'}\nWell done!!!  As usual, the English have scored another home run with this series.  Every character in this series plays his or her part to perfection!!  The background, scenery and costuming is terrific.  Bravo.\nBeautifully done\nDoc Martin Series 6\nMartin Clunes  (Actor),     Caroline Catz  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD\n['\"“Sweet, stirring, and completely addictive” —', 'Slate', '“One of the funniest, most entertaining shows on television” —', 'Sunday Express', '(U.K.)  He’s surly, tactless, self-centered, and uptight—but he’s the only doctor in town.  Even on his own wedding day, Dr. Martin Ellingham (Martin Clunes,', 'Men Behaving Badly', ') is all scowls. Then following a calamitous honeymoon, he and Louisa (Caroline Catz,', 'DCI Banks', ') must learn to live together, raise a child, and manage two careers. It’s a big adjustment for both, especially Martin, who’s unaccustomed to clutter and noise. And yet he’s still not as picky as their OCD manny.  Factor in the Doc’s usual string of batty patients—including a hypochondriac, a hoarder, two elderly tattoo artists, and a bumbling constable with a string of self-inflicted injuries—and Martin is soon more ill-tempered than ever. Plus, his crippling blood phobia is back, and his ghastly mother (Claire Bloom,', 'The King’s Speech', ') picks a bad time to show up at the Ellinghams’ door. With much at stake, Martin turns for advice to his aunt Ruth (Emmy', 'winner Eileen Atkins,', 'Cranford', '), perhaps the sanest person in Portwenn—but it may already be too late.  Contains graphic medical scenes', 'Episodes', 'Sickness and Health', 'Sickness and Health', 'Guess Who’s Coming to Dinner', 'Guess Who’s Coming to Dinner', 'The Tameness of a Wolf', 'The Tameness of a Wolf', 'Nobody Likes Me', 'Nobody Likes Me', 'The Practice Around the Corner', 'The Practice Around the Corner', 'Hazardous Exposure', 'Hazardous Exposure', 'Listen with Mother', 'Listen with Mother', 'Departure', 'Departure']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 5.12 Ounces', 'Item model number': 'ACRN2145DVD', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '6 hours and 24 minutes', 'Release date': 'December 10, 2013', 'Actors': 'Doc Martin, Martin Clunes, Caroline Catz, Ian McNeice, Joe Absolom', 'Studio': 'ACORN MEDIA', 'Number of discs': '2'}\nRefreshingly fun and entertaining.  I am looking forward to the next installment with great anticipation.\nRefreshing\nDoc Martin Special Collection: Series 1-5 plus the Movies\nClunes, Martin  (Actor),     Catz, Caroline  (Actor),     Ferguson, Craig  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['“Sweet, stirring, and completely addictive” ––', 'Slate', '“Delightfully quirky” —', 'Los Angeles Times', 'He’s surly, tactless, self-centered, and uptight—but he’s the only doctor in town.  Relocating to the picturesque village of Portwenn is not what this doctor ordered. After developing a crippling fear of blood, hotshot London surgeon Martin Ellingham (Martin Clunes,', 'Men Behaving Badly', ') reluctantly retrains as a GP and opens a practice in the quirky seaside town, where he quickly offends the villagers with his dour and dismissive bedside manner.  In these five complete series, Doc Martin catches the eye of the most beautiful woman in Portwenn (Caroline Catz,', 'Murder in Suburbia', '), tests the patience of his long-suffering aunt (Stephanie Cole,', 'Tenko', '), and repeatedly hurts feelings as he heals bodies. The two feature-length movies reveal the character’s first incarnation as Dr. Martin Bamford. He’s still ornery but less socially inept, an obstetrician fleeing to the coastal village to reassess his marriage and career.  Martin Clunes delivers an uproarious lead performance, aided by outstanding supporting casts, in this award-winning fish-out-of-water comedy.']\n{'Genre': 'Comedy', 'Format': 'Box set, Widescreen, Multiple Formats, NTSC, Color', 'Contributor': 'Absolom, Joe, Clunes, Martin, Catz, Caroline, McNeice, Ian, Ferguson, Craig', 'Language': 'English', 'Number Of Discs': '13', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 3.6 x 7.7 inches; 15.2 Ounces', 'Item model number': '21388', 'Director': 'Ferguson, Craig', 'Media Format': 'Box set, Widescreen, Multiple Formats, NTSC, Color', 'Run time': '32 hours and 45 minutes', 'Release date': 'May 7, 2013', 'Actors': 'Clunes, Martin, Catz, Caroline, McNeice, Ian, Absolom, Joe', 'Studio': 'ACORN MEDIA', 'Number of discs': '13'}\nLove the series.  The individual characters and their unique situations are priceless and the filming location is breathtakingly beautiful.  Nothing has been overlooked in this story.\nLove the series\nGame of Thrones: Season 5\nPeter Dinklage  (Actor),     Lena Headey  (Actor)    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Emmy Central, Emmy Nominees\n['Game of Thrones: The Complete Fifth Season (DVD)', \"A plethora of compelling storylines play out to their inevitable, often bloody conclusions in Season 5 of HBO's blockbuster, Emmy(R)-winning drama series. In the wake of the numerous shocking deaths of Season 4, the season opens with a power vacuum that the various players all across Westeros and Essos scramble to fill. At Castle Black, Jon Snow must balance the demands of the Night's Watch with those of the newly arrived Stannis Baratheon. Meanwhile, Cersei struggles to hold on to power in King's Landing; Jaime embarks on a secret mission; Arya seeks out an old friend; Tyrion--now a fugitive--finds a new cause; and Daenerys finds that her tenuous hold on the city of Meereen requires hard sacrifices.\", ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Full Screen, NTSC, Box set', 'Contributor': 'Nathalie Emmanuel, Liam Cunningham, Diana Rigg, Frank Doelger, Kristofer Hivju, David Benioff, Bryan Cogman, Indira Varma, Alfie Allen, Lisa McAtackney, Iwan Rheon, Jessica Henwick, Natalie Dormer, Toby Sebastian, Conleth Hill, Deobia Oparei, Guymon Casady, Maisie Williams, D. B. Weiss, Keisha Castle-Hughes, Greg Spence, Jonathan Pryce, John Bradley, Dean-Charles Chapman, Peter Dinklage, Stephen Dillane, Gwendoline Christie, Michiel Huisman, Rory McCann, Bernie Caulfield, Lena Headey, Jerome Flynn, Bernadette Caulfield, Carice van Houten, Nikolaj Coster-Waldau, Nell Tiger Free, George R.R. Martin, Christopher Newman, Vince Gerardis, Sophie Turner, Carolyn Strauss, Iain Glen, Emilia Clarke, Michael McElhatton, Kit Harington, Aidan Gillen, Tom Wlaschiha, Rosabell Laurenti Sellers, Alexander Siddig, Chris Newman, D.B. WeissNathalie Emmanuel, Liam Cunningham, Diana Rigg, Frank Doelger, Kristofer Hivju, David Benioff, Bryan Cogman, Indira Varma, Alfie Allen, Lisa McAtackney, Iwan Rheon, Jessica Henwick, Natalie Dormer, Toby Sebastian, Conleth Hill, Deobia Oparei, Guymon Casady, Mai…  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.32 Ounces', 'Media Format': 'Multiple Formats, Full Screen, NTSC, Box set', 'Run time': '559 minutes', 'Release date': 'March 15, 2016', 'Actors': 'Peter Dinklage, Lena Headey, Emilia Clarke, Nikolaj Coster-Waldau, Aidan Gillen', 'Producers': 'David Benioff, Christopher Newman, Greg Spence, D. B. Weiss, Lisa McAtackney', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nAs a devoted fan of Games of Thrones, I am delighted to add Season 5 to my collection.  It is a wonderful series and I see new things in it every time a watch each series.  Thank you so much for speedy delivery and a quality product.\nDelightful addition to my collection",
  "profile": "**Updated User Profile Summary**\n\n- **Interests**: The user remains passionate about classic British drama and historical miniseries, now also demonstrating a strong admiration for epic fantasy series known for intricate plotlines and character development.\n\n- **Genres**: While continuing their allegiance to drama, family, historical, musical, and comedy genres, the user has shown an openness to fantasy, particularly those that intricately weave character relationships and societal themes.\n\n- **Content Preferences**: Their attraction to productions featuring talented actors and deep storytelling has expanded to include shows that invite multiple viewings for new discoveries. They appreciate narratives that provide both entertainment and thought-provoking insights.\n\n- **Presentation Preferences**: The user values media formats that enrich the viewing experience, favoring collections that may offer additional content like behind-the-scenes features.\n\n- **Buying Behavior**: Their dedication to trusted media platforms and satisfaction with past purchases persists. Positive feedback on timely delivery and product quality shows a commitment to engaging with high-quality content.\n\n- **Viewer Experience**: A consistent desire for narratives combining drama, history, and nuanced character arcs is evident. Their anticipation for new releases continues to reflect a quest for compelling storytelling that resonates with their interests.\n\n- **General Attitude**: The user maintains a positive engagement with content and services, now indicating a special fondness for series that encourage reflective viewing and ongoing discoveries within the narrative.",
  "metrics": {
    "rouge1_f": 0.08762705923589205,
    "rouge2_f": 0.004910557699052963,
    "rougeL_f": 0.041359971959341046,
    "meteor": 0.023685797134736297,
    "bleu1": 1.3044705043920199e-06,
    "bleu2": 3.360187299724213e-07,
    "bleu3": 4.967787765648296e-08,
    "bleu4": 1.9118510948674806e-08,
    "bertscore_precision": 0.34270143508911133,
    "bertscore_recall": 0.488033264875412,
    "bertscore_f1": 0.40265488624572754
  }
}