{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Jewel in the Crown (25th Anniversary Edition)\nReview Date: 2015/01/18\nStore: Peggy Ashcroft  (Actor),     Charles Dance  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, A&E Home Video, All A&E Titles\nProduct Description: ['JEWEL IN THE CROWN, THE: 25TH ANNIV. ED.']\nAverage Rating: 4.3\nProduct Details: {'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Art Malik, Charles Dance, Peggy Ashcroft', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Runtime': '12 hours and 58 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.25 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 58 minutes', 'Release date': 'September 30, 2008', 'Actors': 'Peggy Ashcroft, Charles Dance, Art Malik', 'Studio': 'A&E Home Video', 'Number of discs': '4'}\nReview Text: Well done!!!  As usual, the English have scored another home run with this series.  Every character in this series plays his or her part to perfection!!  The background, scenery and costuming is terrific.  Bravo.\nReview Title: Beautifully done\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Strauss Family\nDerek Jacobi  (Actor),     Jane Seymour  (Actor),     David Giles  (Director),     Peter Potter  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Two generations of genius are brought to life in this lavish, eight-part British miniseries about one of the most talented musical families in history. THE STRAUSS FAMILY spans 85 years and chronicles the rise of Johann Strauss, Sr. from his humble beginnings to becoming one of the most famous musicians in Europe. But at the height of his success, a series of scandalous love affairs estrange him from his wife and prodigiously talented son Johann, Jr. Father and son soon become fierce rivals in the musical and political worlds of nineteenth-century Austria. THE STRAUSS FAMILY follows the advancing career of the younger Strauss as he achieves even greater fame as Vienna s Waltz King, celebrated even today for the Blue Danube waltz and Die Fledermaus. With a superb cast including Emmy-award winner actors Derek Jacobi (Anastezsi) and Jane Seymour (Dr. Quinn, Medicine Woman), and glorious renditions of the Strauss s works by the London Symphony Orchestra, THE STRAUSS FAMILY is a dramatic family saga of tragedy and triumph. DVD Features: Cast Biographies; Selected List of Compositions', 'Amazon.com', \"British teledrama and miniseries fans--and classical music lovers--will love 1972's\", 'The Strauss Family', ', a soapy, well-acted look at the life of the Strauss musical dynasty in Vienna.', 'The Strauss Family', 'is as compulsively watchable as any dysfunctional family drama, from', 'Dallas', 'to', 'Arrested Development', \"--but the power mongering happening in 19th-century Vienna was far more subtle in the musical world. The miniseries focuses on Johann, played with equal parts passion and lazy excess by the talented young actor Eric Woofe, whose last performance this series would be. Johann's brother, Josef (Nicolas Simmonds), was the disciplined half of the brother act, though ultimately not nearly as talented as Johann.\", 'The Strauss Family', 'traces the beginnings of the popularity of the Strauss waltz and shows just how proletarian the three-quarter time dance was in 19th-century Vienna--it almost looks like a pogo mosh pit in the local pubs where the Strauss brothers play to be barely heard above the beery din. Another treat in', 'The Strauss Family', \"is seeing talented young British actors just before their mega stardom, including Derek Jacobi, who has a small role as Johann's confidante, Josef Lanner. Jacobi steals every scene he's in, in a precursor to his career-changing role just four years later in\", 'I, Claudius', '. Also making appearances are the comely young Jane Seymour and the very talented Georgina Hale, in smaller roles. The set includes cast biographies and a handy list of compositions, though even non-classical music fans will recognize the strains of \"The Blue Danube\" and arias from', 'Die Fledermaus', '.', 'The Strauss Family', 'is equally a rich tribute to a dynasty of talent and an entertaining bodice-ripper--one that can double as a music-appreciation class. --', 'A.T. Hurley']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'David Giles, Jane Seymour, Peter Potter, Derek Jacobi, David Reid', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo)', 'Runtime': '6 hours and 48 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'David Giles, Peter Potter, David Reid', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours and 48 minutes', 'Release date': 'July 29, 2008', 'Actors': 'Derek Jacobi, Jane Seymour', 'Studio': 'A&E Home Video', 'Number of discs': '2'}\nVery entertaining and well acted story of the Kings of the Viennese Waltz. We are never disappointed in orders that we have placed with Amazon.  They always arrive in tact, well packaged and on or ahead of the scheduled delivery date.  Thank you.\nStrauss Family\nDownton Abbey: Season 4\nFormat: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nEnjoy the series and characters.  The quality of both the product and content is excellent.  Can hardly wait for the next installment which I will most certainly be ordering from Amazon.  Thank you\nQuality product and content\nI, Claudius (35th Anniversary Edition)\nSian Phillips  (Actor),     Derek Jacobi  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['\"A true masterpiece\" —', 'San Francisco Chronicle', '\"Fiendishly sophisticated\" —', 'The New York Times', '\"Handsomely produced, grandly acted, and…thoroughly involving\" —', 'The Washington Post', '\"Irresistible, witty\" —', 'Los Angeles Times', 'Rated one of the \"100 Best TV Shows of All Time\" by Time magazine, this epic BBC series spans the history of the Roman Empire from Augustus through Claudius, a stuttering scholar who learns early to play the fool and stay alive. Based on the novels by Robert Graves, it stars Derek Jacobi (', 'The King’s Speech', ',', 'Cadfael', ') in a career-defining role. Siân Phillips (', 'The Age of Innocence', ') is “exquisitely wicked” (Los Angeles Times) as the lethal Livia, wife to Augustus (Brian Blessed,', 'Hamlet', '), while John Hurt (', 'The Elephant Man', ') is \"decadence personified\" (', 'USA Today', ') as the depraved Caligula, whose reign of terror paves the way for Claudius’s ascension.', 'Winner of an Emmy® and numerous other awards, this riveting tale of ambition, debauchery, and intrigue remains one of the most popular and acclaimed dramas in Masterpiece Theatre history. Patrick Stewart (', 'X-Men', '), George Baker (', 'The Ruth Rendell Mysteries', '), Margaret Tyzack (', 'Cousin Bette', '), and James Faulkner (', 'The Bank Job', ') also star.']\n{'Genre': 'Drama/Television, Television/British Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Patrick Stewart, John Hurt, Sian Phillips, Derek Jacobi', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.64 Ounces', 'Item model number': '8750', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '11 hours and 8 minutes', 'Release date': 'August 5, 2012', 'Actors': 'Sian Phillips, Derek Jacobi, Patrick Stewart, John Hurt', 'Subtitles': 'English', 'Studio': 'ACORN MEDIA', 'Number of discs': '5'}\nIncredibly well done performance.  Every actor and actress played his/her role impeccably.  It was a horrible, bloody time historically but it is beautifully captured in this series.\nIncredibly Well Done\nThe Jewel in the Crown (25th Anniversary Edition)\nPeggy Ashcroft  (Actor),     Charles Dance  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, A&E Home Video, All A&E Titles\n['JEWEL IN THE CROWN, THE: 25TH ANNIV. ED.']\n{'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Art Malik, Charles Dance, Peggy Ashcroft', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Runtime': '12 hours and 58 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.25 x 1.25 inches; 8.8 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '12 hours and 58 minutes', 'Release date': 'September 30, 2008', 'Actors': 'Peggy Ashcroft, Charles Dance, Art Malik', 'Studio': 'A&E Home Video', 'Number of discs': '4'}\nWell done!!!  As usual, the English have scored another home run with this series.  Every character in this series plays his or her part to perfection!!  The background, scenery and costuming is terrific.  Bravo.\nBeautifully done",
  "profile": "**Updated User Profile Summary**\n\n- **Interests**: The user continues to favor classic British drama and historical miniseries with an emphasis on music and family dynamics. They appreciate content that intertwines entertainment with educational insights, especially regarding historical contexts.\n\n- **Genres**: Preference remains strong for drama, family, historical, and musical genres, particularly period pieces that delve into complex character relationships and societal themes.\n\n- **Content Preferences**: The user shows an affinity for well-acted productions featuring distinguished actors, valuing high-quality storytelling that is emotionally and intellectually engaging, particularly through historical narratives.\n\n- **Presentation Preferences**: Prefers media formats that enhance the viewing experience, such as box sets with supplemental content like cast biographies and detailed production notes.\n\n- **Buying Behavior**: The user remains loyal to trusted media acquisition platforms, consistently expressing satisfaction in their purchasing experiences, as reflected in their positive feedback.\n\n- **Viewer Experience**: They seek entertainment that effectively combines drama with historical context, demonstrating a commitment to character development and narrative continuity while eagerly anticipating upcoming installments of their favored series.\n\n- **General Attitude**: The user engages positively with content and services, maintaining high expectations that are consistently met. Their recent review highlights their appreciation for exceptional performances, stunning visuals, and impeccable character portrayals, reinforcing their love for the genre.",
  "metrics": {
    "rouge1_f": 0.11163337250293771,
    "rouge2_f": 0.010588235294117647,
    "rougeL_f": 0.05170387779083431,
    "meteor": 0.03438116312043763,
    "bleu1": 0.00035345972270544207,
    "bleu2": 0.00011087653697985574,
    "bleu3": 3.5011286465848514e-05,
    "bleu4": 1.107376104486826e-05,
    "bertscore_precision": 0.35136449337005615,
    "bertscore_recall": 0.47920140624046326,
    "bertscore_f1": 0.4054448902606964
  }
}