{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: VOKEYLA Blonde Short Wavy Wig with Bangs 12 Inch Shoulder Length Synthetic Cosplay Wig for Women None Lace Honey Blonde with Highlight Purple&Pink Stripe Pastel Wig(Blonde/Purple&Pink)\nReview Date: 2021/08/12\nStore: VOKEYLA\nAverage Rating: 3.9\nProduct Details: {'Material': 'Synthetic', 'Item Dimensions LxWxH': '12 x 6 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'VOKEYLA', 'Product Dimensions': '12 x 6 x 3 inches; 11.22 Ounces'}\nReview Text: Cute wig for fun.  If you have thick hair though, it just barely fits.  I would have to shave my head.\nReview Title: Cute\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "e.l.f. Cosmetics All Over Color Stick - Pink Lemonade\ne.l.f.\n['New Instantly Brightens Eyes, Lips and Face Naturally Illuminates for a Healthy Glow Instantly Soothes & Conditions Skin Multi-Purpose Formula Safe, Gentle Formula Instantly beautiful, healthy-looking skin designed, formulated and tested by our professional team of makeup artists.']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 3 inches; 0.8 Ounces', 'Date First Available': 'May 14, 2009', 'Manufacturer': 'E.L.F. Cosmetics'}\nThis is a pretty color but I bought this blush based on the ingredients shown in the picture on the back of the package which have a low toxic rating. HOWEVER the product I received has a different ingredient list that includes BHA which according to the Skin Deep website is a Human endocrine disruptor - strong evidence. As well as petrolatum classified as expected to be toxic or harmful  This also has proplyparaben a Human immune toxicant or allergen - strong evidence.  So I'm not sure I should use it which is a waste of money.  It rates an overall moderate toxic level according to EWG.\nModerately Toxic\nJade Rose Quartz Roller for Face 2 in 1 Gua Sha Set Including Rose Quartz Roller and Jade Face Massager 100% Real Natural Jade Facial Roller Anti Aging Face Roller Massager by Rayfarmo\nRAYFARMO\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 2 x 0.5 inches; 7.04 Ounces', 'UPC': '680727935887', 'Manufacturer': 'RAYFARMO'}\nI like the cool feel of the stone on my face.  The small end of the roller gives a nice light massage.  The extra stone piece is nice for other areas like the arms and such.  The roller is smooth.  The extra stone piece can really work tension out.\nMassaging\nZWIFEJIANQ Silicone Back Scrubber,Exfoliating Lengthen Silicone Bath Body Brush for Men and Women,Deep Clean & Invigorate Your Skin (30 inch, Purple)\nZWIFEJIANQ\n{'Package Dimensions': '7.72 x 4.57 x 1.93 inches; 7.37 Ounces', 'UPC': '781076826120'}\nWorks well to scrub your back and sholders.  The hook it comes with was not that great.\nScrubs without Scratching\nKPOKPO 2021 NEW - Soft Shower Body Brush ，Back Scrubber Soft Bristles Bath Brush， 3 in 1 Foldable Bath Brush Exfoliating Brush with Long Handle Body Brush Lotion Applicator and Massager\nKPOKPO\n{'Material': 'Sponge,Plastic,Nylon', 'Brand': 'KPOKPO', 'Item Dimensions LxWxH': '19.18 x 3.14 x 0.82 inches', 'Product Benefits': 'Softening,Nourishing,Clean,Exfoliating', 'Operation Mode': 'Manual', 'Product Dimensions': '19.18 x 3.14 x 0.82 inches; 13.44 Ounces', 'UPC': '712491891110', 'Manufacturer': 'ProOrganic'}\nThis is great.  It has a curve so you can reach the curves of your back.  The britsles are soft.  The sponge is great.  It folds up for travel.  The handle is solid and sturdy.  Just be careful when changing the head piece, I pinched the skin on my finger.\nLove it\nLong-Handled Back Scrubber for Shower Body-Brush - HFLHLL Super Long Portable Assembly 3 in 1 Bath Exfoliating Brush with Bristles Sponge Massager Head, Suitable for Wet or Dry, Women and Men\nHFLHLL\n{'Brand': 'HFLHLL', 'Power Source': 'hand_powered', 'Product Care Instructions': 'Wash with Warm Water', 'Operation Mode': 'Manual', 'Package Dimensions': '13.74 x 4.72 x 2.99 inches; 15.91 Ounces', 'UPC': '730869806597', 'Manufacturer': 'HFLHLL GROUP'}\nThe attachments are great.  Thick sponge and soft brush.  One of the best I have tried.  The only negative is releasing the attachment once it is on and you want to use a different attachement.  It's a bit difficult.\nGreat\nVOKEYLA Blonde Short Wavy Wig with Bangs 12 Inch Shoulder Length Synthetic Cosplay Wig for Women None Lace Honey Blonde with Highlight Purple&Pink Stripe Pastel Wig(Blonde/Purple&Pink)\nVOKEYLA\n{'Material': 'Synthetic', 'Item Dimensions LxWxH': '12 x 6 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'VOKEYLA', 'Product Dimensions': '12 x 6 x 3 inches; 11.22 Ounces'}\nCute wig for fun.  If you have thick hair though, it just barely fits.  I would have to shave my head.\nCute",
  "profile": "**Updated User Summary:**\n\n- **Cosmetic Preferences:** The user continues to prioritize multi-purpose beauty products that enhance natural beauty and promote a healthy glow. Their recent purchase of a synthetic wig indicates a playful engagement with cosmetic enhancement and self-expression, reflecting an enjoyment of fun, transformative beauty experiences.\n\n- **Ingredient Awareness:** The user remains committed to low-toxicity formulations, carefully reviewing ingredients to ensure safety and avoid harmful components. This commitment emphasizes their desire for integrity in beauty selections, focusing on products that align with their values.\n\n- **Skepticism of Brands:** The user maintains a critical view of brands that lack transparency regarding ingredient sourcing. They consistently evaluate product claims, prioritizing choices from reputable brands known for their integrity.\n\n- **Experience with Toxicity Ratings:** The user regularly consults reputable sources for product safety information, demonstrating a steadfast commitment to informed decision-making centered on ingredient integrity and safety.\n\n- **Overall Sentiment:** The user expresses satisfaction with products that meet their safety expectations while enjoying playful aspects of beauty, such as wigs. This reflects a balanced approach to beauty and self-care, focusing on effective, safe, and aesthetically pleasing products that resonate with their conscientious consumption values.\n\nIn summary, the user exemplifies a diligent approach to beauty and self-care, integrating fun, transformative elements while maintaining a strong commitment to product safety, efficacy, and integrity.",
  "metrics": {
    "rouge1_f": 0.20224719101123595,
    "rouge2_f": 0.01126126126126126,
    "rougeL_f": 0.09213483146067415,
    "meteor": 0.07939992186931753,
    "bleu1": 0.043302574624535205,
    "bleu2": 0.0014074918022712929,
    "bleu3": 0.00044973274203472863,
    "bleu4": 0.00025445367430842943,
    "bertscore_precision": 0.3488203287124634,
    "bertscore_recall": 0.4475204050540924,
    "bertscore_f1": 0.39205384254455566
  }
}