{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: e.l.f. Cosmetics All Over Color Stick - Pink Lemonade\nReview Date: 2017/03/09\nStore: e.l.f.\nProduct Description: ['New Instantly Brightens Eyes, Lips and Face Naturally Illuminates for a Healthy Glow Instantly Soothes & Conditions Skin Multi-Purpose Formula Safe, Gentle Formula Instantly beautiful, healthy-looking skin designed, formulated and tested by our professional team of makeup artists.']\nAverage Rating: 4.1\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 3 inches; 0.8 Ounces', 'Date First Available': 'May 14, 2009', 'Manufacturer': 'E.L.F. Cosmetics'}\nReview Text: This is a pretty color but I bought this blush based on the ingredients shown in the picture on the back of the package which have a low toxic rating. HOWEVER the product I received has a different ingredient list that includes BHA which according to the Skin Deep website is a Human endocrine disruptor - strong evidence. As well as petrolatum classified as expected to be toxic or harmful  This also has proplyparaben a Human immune toxicant or allergen - strong evidence.  So I'm not sure I should use it which is a waste of money.  It rates an overall moderate toxic level according to EWG.\nReview Title: Moderately Toxic\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "e.l.f. Cosmetics All Over Color Stick - Pink Lemonade\ne.l.f.\n['New Instantly Brightens Eyes, Lips and Face Naturally Illuminates for a Healthy Glow Instantly Soothes & Conditions Skin Multi-Purpose Formula Safe, Gentle Formula Instantly beautiful, healthy-looking skin designed, formulated and tested by our professional team of makeup artists.']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 3 inches; 0.8 Ounces', 'Date First Available': 'May 14, 2009', 'Manufacturer': 'E.L.F. Cosmetics'}\nThis is a pretty color but I bought this blush based on the ingredients shown in the picture on the back of the package which have a low toxic rating. HOWEVER the product I received has a different ingredient list that includes BHA which according to the Skin Deep website is a Human endocrine disruptor - strong evidence. As well as petrolatum classified as expected to be toxic or harmful  This also has proplyparaben a Human immune toxicant or allergen - strong evidence.  So I'm not sure I should use it which is a waste of money.  It rates an overall moderate toxic level according to EWG.\nModerately Toxic",
  "profile": "**User Summary:**\n\n- **Cosmetic Preferences:** Seeks multi-purpose beauty products that enhance natural appearance and provide a healthy glow.\n- **Ingredient Awareness:** Shows a strong concern for product ingredients, preferring low-toxicity formulations. Actively checks for harmful components and prioritizes safety, indicating an informed approach to skincare and cosmetic choices.\n- **Skepticism of Brands:** Demonstrates caution towards brands that do not align with stated ingredient transparency, leading to potential distrust if product formulations differ from advertised claims.\n- **Experience with Toxicity Ratings:** References external sources like the Skin Deep website and EWG, suggesting value placed on third-party evaluations of product safety.\n- **Overall Sentiment:** Experiences disappointment with products that do not meet ingredient expectations, leading to mixed satisfaction levels and an inclination to rate them critically.\n\nThis profile suggests a trend towards conscientious consumption, with a focus on safety and effectiveness in cosmetic products.",
  "metrics": {
    "rouge1_f": 0.29357798165137616,
    "rouge2_f": 0.04923076923076923,
    "rougeL_f": 0.12844036697247704,
    "meteor": 0.1745492230983302,
    "bleu1": 0.2203982127730442,
    "bleu2": 0.05468240517392906,
    "bleu3": 0.030071328385660536,
    "bleu4": 0.01877770630583815,
    "bertscore_precision": 0.4076453447341919,
    "bertscore_recall": 0.4554104208946228,
    "bertscore_f1": 0.4302061200141907
  }
}