{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/10/22\nAverage Rating: 3.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Moira Armstrong'], 'Producers': ['Jane Wellesley'], 'Starring': ['Sophie Ward', 'Kerry Fox', 'Nathaniel Parker'], 'Studio': ['Acorn Media']}\nReview Text: I love lesbian romances that aren't too youthful or edgy (or political), and this fits the bill plus I liked the English village setting. The ending was unexpected but probably realistic. I also love LGBT-for-a-straight-mainstream-audience and Christmas romances, so let's see -- the perfect movie:  A New York City-based lesbian Christmas comedy-romance for a mainstream audience! ... is it out there??\nReview Title: Addicted To Romance\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Umbrellas of Cherbourg [Korean Import]\nCatherine deneuve  (Actor),     Nino Castelnuovo  (Actor),     Jacques Demy  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Jacques Demy', 'Media Format': 'NTSC', 'Run time': '1 hour and 31 minutes', 'Actors': 'Catherine deneuve, Nino Castelnuovo', 'Subtitles': 'English, Korean', 'Language': 'Unqualified (Dolby Digital 2.0 Surround)'}\nGet the British/European disc with the colored stripes on the cover, not the Korean one which is fullscreen and of bootleggy quality. The Special Edition is widescreen and of good quality like 'The Girls of Rochefort' also available on Amazon.\nGet Special Edition, not Korean disc.\nThe Car\nJames Brolin  (Actor),     Elliot Silverstein  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['Fasten your seatbelts for the terrifying thrill ride that has become a cult classic - The Car! The peaceful tranquility of a small Western town is disturbed when a murderous car wreaks havoc by viciously mowing down innocent victims. New sheriff, Wade Parent (James Brolin), may be the only one who can stop this menace in its tracks until he realizes that the driver of this indestructible vehicle is far more dangerous than any man… it is driven by pure evil. With a digitally remastered picture, The Car has never been more thrilling, more chilling or more explosively entertaining!Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Horror, Suspense, Arthouse', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'James Brolin, Elliot Silverstein', 'Initial release date': '2008-05-06', 'Language': 'French (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1103503', 'Director': 'Elliot Silverstein', 'Media Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'May 6, 2008', 'Actors': 'James Brolin', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a review about this version of the disc, not the movie. This 'new' disc sold by Amazon, with no DVD security features on the packaging, has numerous glitches; I suspect it's on all copies of this edition, I bought it new. It pauses momentarily, perhaps makes a sound, and continues. It's done this several times already having started the movie (it's on as I speak). It's widescreen and the picture quality is okay, but my roommate pointed out to me that it's overdubbed, that is the sound isn't always matching the lips; I checked the listing, and sure enough, it says \"dubbed\". I haven't tried the French-language soundtrack. I already purchased a used copy of a more expensive edition of this film by Anchor Bay. I'll be returning this one. I'm surprised at Amazon for selling an inferior version as new.<br /><br />--<br /><br />I received and am playing the disk I referred to [[ASIN:6305511861 The Car]] and when trying to review the Amazon system informed me I have already reviewed the product, being the other disk of inferior condition that wouldn't play. This, of course, is ridiculous. This disk, as I have anticipated, is superior and is playing without a single glitch. It was professionally produced with packaging as a DVD should be. So, definitely get this (ASIN 6305511861) rather than the cheaper disk on Amazon which began this review. Both are Region 1. I bought a used disk which is in better condition than the \"new\" one sold by Amazon. Neither Region 1 DVD disk of this movie has subtitles. I'm happy with the widescreen version included on the ASIN mentioned. The single caveat of this edition is that the packaging has a definite flaw:  the ring that holds the disk continues in a full circle even past the finger indentations, making it impossible to remove the disk easily even when holding down the middle button. You could scratch the disk trying to get it out, I had to hold it upside down and dig with the \"button finger\". I won't return it to the case. But the disk itself is great, and the one I recommend (Anchor Bay). Too bad it's out of print.\nGlitched. Dubbed. New??\nAmanda\nRandy Ryan  (Actor),     Steve Marra  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Joe is a 40-year-old womanizer until he meets Amanda. It's love at first sight and a match made in heaven. They enjoy a storybook romance and decide to get married, much to the dismay of Joe's quirky but loving parents. It's marital bliss until Joe discovers that Amanda was born a man and had a sex change at age 18! Devastated by Amanda's shocking admission, Joe sends her out the door. After much thought, however, Joe comes to his senses and realizes that Amanda was the best thing that ever happened to him. In his quest to find Amanda and rekindle their relationship, he discovers the real truth about love. This charming romantic comedy features Randy Ryan (Public Enemies) and Ariana Dubynin (The List) in a film that identifies true love and explores gender identity.\"]\n{'Genre': 'Romance', 'Format': 'NTSC, Dolby', 'Contributor': 'Steve Marra, Randy Ryan', 'Language': 'Unqualified', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Steve Marra', 'Media Format': 'NTSC, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'August 13, 2015', 'Actors': 'Randy Ryan', 'Studio': 'osiris Entertainment', 'Number of discs': '1'}\nI like the movie because there aren't that many transgender-themed movies, and for the twist at the end. It had humorous moments, and raunchy references, but not a competitor for mainstream-LGBT hybrid comedy-romances (see Kissing Jessica Stein [[ASIN: B000QUCQXS]], Puccini for Beginners [[ASIN: B000N2H8XC]], Gray Matters [[ASIN: B000O76ZO4]], and Out At The Wedding [[ASIN: B001MVWMIY]] for spectacular examples).\nOkay, but I want more on this theme.\nGray Matters\nHeather Graham  (Actor),     Thomas Cavanagh  (Actor),     Sue Kramer  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'They finish each other\\'s sentences, dance like Fred and Ginger, and share the same downtown loft--the perfect couple? Not exactly. Gray and Sam (Heather Graham and Tom Cavanagh), are a sister and brother so compatible and inseparable that people actually assume they are dating. Mortified, they both agree they must branch out and start searching for love. He\\'ll look for a guy for her and she\\'ll look for a gal for him. But when Sam finds his perfect mate in Charlie (Bridget Moynahan) Gray\\'s life turns inside out. A romantic comedy that sets sibling rivalry on its head, \"Gray Matters\" gives a whole new meaning to love... and destiny.', 'Amazon.com', 'Gray Matters', 'has one of the most adorable casts of any movie in recent years--the combined sweetness of Heather Graham (', 'Austin Powers: The Spy Who Shagged Me', '), Bridget Moynahan (', 'Lord of War', '), Molly Shannon (', 'Year of the Dog', '), Thomas Cavanagh (', 'Ed', '), Alan Cumming (', 'X-Men 2', '), and Sissy Spacek (', 'Carrie', ',', 'In the Bedroom', \") narrowly avoids being diabetes-inducing. Gray (Graham) and her brother Sam (Cavanagh) have been best friends forever--so close that they find it hard to date. Gray pushes Sam into asking out Charlie (Moynahan), but when Sam and Charlie hit it off so well they spontaneously decide to get married, Gray finds herself unexpectedly dismayed... but not as dismayed as she is when, on a girls' night out before the ceremony, she and Charlie share a drunken kiss that sets Gray's body tingling.\", 'Gray Matters', \"juggles a lot of emotional issues; the sibling interconnectedness problem doesn't flow smoothly into the coming-out story of the movie's second half. But sprinkled throughout are charming scenes and wonderfully deft moments that make the story's clumsy missteps all the more baffling. There's no question that Graham is a star who just can't seem to find the right vehicle;\", 'Gray Matters', \"won't be her breakthrough, but it's further evidence of her significant appeal.\", '--Bret Fetzer']\n{'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.38 x 7.44 inches; 2.72 Ounces', 'Item model number': '2243466', 'Director': 'Sue Kramer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 19, 2007', 'Actors': 'Heather Graham, Thomas Cavanagh, Bridget Moynahan, Molly Shannon, Alan Cumming', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nIf you enjoy such &#34;LGBT for a mainstream audience&#34; films as Kissing Jessica Stein and Puccini For Beginners, you'll probably like this entry into the genre. Another film you may enjoy is &#34;Out At The Wedding&#34;.\nI love this genre!\n{'Subtitles': ['None available'], 'Directors': ['Moira Armstrong'], 'Producers': ['Jane Wellesley'], 'Starring': ['Sophie Ward', 'Kerry Fox', 'Nathaniel Parker'], 'Studio': ['Acorn Media']}\nI love lesbian romances that aren't too youthful or edgy (or political), and this fits the bill plus I liked the English village setting. The ending was unexpected but probably realistic. I also love LGBT-for-a-straight-mainstream-audience and Christmas romances, so let's see -- the perfect movie:  A New York City-based lesbian Christmas comedy-romance for a mainstream audience! ... is it out there??\nAddicted To Romance",
  "profile": "**User Profile Summary:**\n\nThe user showcases a deep appreciation for classic and international cinema, particularly within LGBTQ+ themes, with a pronounced interest in romantic comedies that resonate with mainstream audiences. Their recent interaction highlights a preference for lesbian romances that balance emotional depth with relatable narratives, favoring settings that evoke warmth and familiarity. They display an enthusiasm for films that cater to a broader audience without losing the essence of LGBTQ+ representation.\n\nQuality remains a significant factor for the user, who emphasizes well-produced media with high audio and visual standards. Their openness to foreign language films and positive reception of subtitles reflects their desire for a rich, diverse cinematic experience.\n\nThe user values aesthetic and functional packaging and strives for professionalism in all media formats, continuing to express frustration with inferior products. They are passionate about sharing recommendations, particularly for narratives that challenge conventions and display emotional complexity, especially within the LGBTQ+ context.\n\nAdditionally, their enthusiastic query for a specific genre—a New York City-based lesbian Christmas comedy—illustrates their ongoing search for films that blend romance with thematic inclusivity. Overall, the user exemplifies sophisticated taste, continuously seeking well-crafted, meaningful narratives that connect with both LGBTQ+ experiences and broader audiences.",
  "metrics": {
    "rouge1_f": 0.11261505143475908,
    "rouge2_f": 0.02168021680216802,
    "rougeL_f": 0.055224688684353006,
    "meteor": 0.03378552344190091,
    "bleu1": 4.4815577221182964e-05,
    "bleu2": 1.5637725948595277e-05,
    "bleu3": 7.644786190991317e-06,
    "bleu4": 4.499807059813152e-06,
    "bertscore_precision": 0.32437002658843994,
    "bertscore_recall": 0.4741665720939636,
    "bertscore_f1": 0.38521820306777954
  }
}