{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Altaba Long Wavy Wigs Ombre Golden Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nReview Date: 2020/11/26\nStore: Altaba\nAverage Rating: 3.4\nProduct Details: {'Material': 'synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult'}\nReview Text: La peluca se ve bella, me encantó el largo y los risos del cabello además los colores son hermosos, pero cuándo voy a comprar o usar una peluca tomo en cuenta varias cosas y esta peluca no cumple con ninguno de los requisitos. Esta peluca parece peluca, que quiero decir? Bueno la banda del centro es demasiado ancha se puede notar claramente el grosor de la peluca con la división de la frente y se ve feo, otra cosa que no me gusta es que si peinas o mueves el cabello se ven claramente las bandas y los huecos sin cabello, es decir tiene muy poco cabello. Otra cosa que no me gusta es que la peluca suelta demasiado cabello no puedes pasar los dedos o peinar con cepillo porqué se salen los cabellos de la peluca. Desafortunadamente no la recomiendo.\nReview Title: Peluca estilo ombre.\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nYanJie\n{'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReally gorgeous, these kitty ear headbands are super soft and pretty. I love them because they don't squeeze the ears. They fit great on me and my litt girl so I recommend them for mom and a daughter spa nights or for make a different gift.\nHeadlands\nEyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nEhinew\n{'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nRecomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nKit para cejas!\nMake-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nLOMANTOWN\n{'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\n[[VIDEOID:91aba66c2bcb51abc6efaed2336f619d]] Estoy encantada con mi nuevo storage, comenzando con lo lindo que se ve y lo espacioso que es, el artículo está hecho de plástico que se ve y se siente de buena calidad. Es un gavetero para guardar de todo desde cósmicos, cremas del cuidado del la piel o hasta artículos para el cabello, me encantó porqué es grande y espacioso, sinceramente me cupo todos mis artículos de mi cuidado facial y aún me queda espacio para guardar mas cosas. Otra cosa que me gustó mucho es que es tipo maletero, es fácil de mover y colocar en distintos lugares cómo en el vanity, baño, cuartos ect.\nOrganizador de cosméticos.\nAltaba Long Wavy Wigs Ombre Golden Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult'}\nLa peluca se ve bella, me encantó el largo y los risos del cabello además los colores son hermosos, pero cuándo voy a comprar o usar una peluca tomo en cuenta varias cosas y esta peluca no cumple con ninguno de los requisitos. Esta peluca parece peluca, que quiero decir? Bueno la banda del centro es demasiado ancha se puede notar claramente el grosor de la peluca con la división de la frente y se ve feo, otra cosa que no me gusta es que si peinas o mueves el cabello se ven claramente las bandas y los huecos sin cabello, es decir tiene muy poco cabello. Otra cosa que no me gusta es que la peluca suelta demasiado cabello no puedes pasar los dedos o peinar con cepillo porqué se salen los cabellos de la peluca. Desafortunadamente no la recomiendo.\nPeluca estilo ombre.",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Continues to enjoy soft, comfortable accessories for personal care and skincare routines, with an expanded focus on practical storage solutions for beauty items. However, recent experiences indicate a growing scrutiny for quality and style, particularly with items that do not meet her expectations for aesthetics and usability.\n- **Aesthetic Appeal:** Seeks visually appealing designs that are playful yet functional, though recent feedback highlights a disappointment with certain products that appear less natural or well-crafted.\n- **Family-Oriented:** Values products suitable for shared activities, particularly mother-daughter bonding experiences like spa nights, integrating organization with beauty routines for collective enjoyment.\n- **Gift-Giving:** Open to purchasing unique and cute gifts that are practical, now including thoughtful storage solutions that align with her standards for aesthetics and functionality.\n- **Practicality:** Appreciates durable and spacious items that streamline her beauty regimen. Recent experiences suggest a critical view of products lacking in quality or effectiveness, demonstrating her focus on convenience and user experience.\n- **Positive Experiences:** Generally favors products that meet her aesthetic and functional expectations but has become increasingly discerning. Recently, she provided a low rating to an item that failed to satisfy her comfort, design, and quality standards.\n\nOverall, this user emphasizes organization and quality while maintaining her priorities of comfort, design, and shared experiences. She demonstrates a growing sophistication in her approach to personal care and beauty routines.",
  "metrics": {
    "rouge1_f": 0.09227220299884659,
    "rouge2_f": 0.004624277456647398,
    "rougeL_f": 0.04613610149942329,
    "meteor": 0.05612310705778413,
    "bleu1": 0.03725920682376407,
    "bleu2": 0.004900801406852202,
    "bleu3": 0.0011581860297809365,
    "bleu4": 0.0005635212139241086,
    "bertscore_precision": 0.34273627400398254,
    "bertscore_recall": 0.4294205605983734,
    "bertscore_f1": 0.3812127411365509
  }
}