{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Canple Self-cleaning Slicker Brush for Medium Long Hair Types Dog and Cat, Removes Loose Hair Undercoat Effectively Reduce Mats & Tanglings Grooming Brush\nReview Date: 2021/02/21\nStore: Canple\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Canple', 'Special Feature': 'Self Cleaning', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Hair Type': 'All', 'Package Dimensions': '10.16 x 6.3 x 2.2 inches; 8.82 Ounces'}\nReview Text: [[VIDEOID:5ee8a58a8f5b5d4ef7ef0f6e1c59ab85]] Es un excelente artículo, lo recomiendo para aquellos gatos o perros que son muy peludos. En mi casa tengo un gato muy peludo, así que este cepillo es ideal para remover el pelo, y a la vez a mi gato le gusta el masaje que le da. En lo personal me gusta porqué es un cepillo fácil de limpiar. Me gustó mucho.\nReview Title: Ideal para mascotas muy peludas.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nYanJie\n{'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReally gorgeous, these kitty ear headbands are super soft and pretty. I love them because they don't squeeze the ears. They fit great on me and my litt girl so I recommend them for mom and a daughter spa nights or for make a different gift.\nHeadlands\nEyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nEhinew\n{'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nRecomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nKit para cejas!\nMake-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nLOMANTOWN\n{'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\n[[VIDEOID:91aba66c2bcb51abc6efaed2336f619d]] Estoy encantada con mi nuevo storage, comenzando con lo lindo que se ve y lo espacioso que es, el artículo está hecho de plástico que se ve y se siente de buena calidad. Es un gavetero para guardar de todo desde cósmicos, cremas del cuidado del la piel o hasta artículos para el cabello, me encantó porqué es grande y espacioso, sinceramente me cupo todos mis artículos de mi cuidado facial y aún me queda espacio para guardar mas cosas. Otra cosa que me gustó mucho es que es tipo maletero, es fácil de mover y colocar en distintos lugares cómo en el vanity, baño, cuartos ect.\nOrganizador de cosméticos.\nAltaba Long Wavy Wigs Ombre Golden Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult'}\nLa peluca se ve bella, me encantó el largo y los risos del cabello además los colores son hermosos, pero cuándo voy a comprar o usar una peluca tomo en cuenta varias cosas y esta peluca no cumple con ninguno de los requisitos. Esta peluca parece peluca, que quiero decir? Bueno la banda del centro es demasiado ancha se puede notar claramente el grosor de la peluca con la división de la frente y se ve feo, otra cosa que no me gusta es que si peinas o mueves el cabello se ven claramente las bandas y los huecos sin cabello, es decir tiene muy poco cabello. Otra cosa que no me gusta es que la peluca suelta demasiado cabello no puedes pasar los dedos o peinar con cepillo porqué se salen los cabellos de la peluca. Desafortunadamente no la recomiendo.\nPeluca estilo ombre.\nBH DERMCENTER Retinol Serum Restores Rejuvenates and Purifies Skin, 1 oz, Reduces Appearance of Fine Lines, Non-GMO, Vegan, Cruelty Free\nBH DERMCENTER\n{'Product Dimensions': '2 x 2 x 5 inches; 1 Ounces', 'Item model number': 'BHDRETSER', 'UPC': '850004068076'}\nNo me gustó este suero para el rostro, comencé a usar este suero y ya en la 2nd vez mi piel comenzó a cambiar notoriamente, piel es sensible y este suero me causó un brote en la piel, mi piel comenzó a sentirse muy reseca, me dejó la piel muy maltratada, así que no lo recomiendo para personas con piel sensible.\nNo lo recomiendo para pieles sensibles.\nCanple Self-cleaning Slicker Brush for Medium Long Hair Types Dog and Cat, Removes Loose Hair Undercoat Effectively Reduce Mats & Tanglings Grooming Brush\nCanple\n{'Brand': 'Canple', 'Special Feature': 'Self Cleaning', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Hair Type': 'All', 'Package Dimensions': '10.16 x 6.3 x 2.2 inches; 8.82 Ounces'}\n[[VIDEOID:5ee8a58a8f5b5d4ef7ef0f6e1c59ab85]] Es un excelente artículo, lo recomiendo para aquellos gatos o perros que son muy peludos. En mi casa tengo un gato muy peludo, así que este cepillo es ideal para remover el pelo, y a la vez a mi gato le gusta el masaje que le da. En lo personal me gusta porqué es un cepillo fácil de limpiar. Me gustó mucho.\nIdeal para mascotas muy peludas.",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Continues to favor soft, comfortable accessories for personal care and skincare routines, with a strong emphasis on quality and effectiveness. Recent purchases indicate an appreciation for multifunctional products that enhance overall experiences, especially in grooming.\n\n- **Aesthetic Appeal:** Seeks visually appealing and functional designs, maintaining a critical approach towards products that may not align with her natural quality standards. However, versatility in design remains a consideration when selecting items for family use.\n\n- **Family-Oriented:** Values items that promote shared activities, especially with her daughter, such as spa nights and grooming experiences for their pets, integrating enjoyment with effectiveness in their beauty and self-care routines.\n\n- **Gift-Giving:** Open to practical, cute gifts that feature thoughtful storage solutions, reflecting her evolving standards for aesthetics and usability, particularly in shared family experiences.\n\n- **Practicality:** Appreciates durable and efficient products that cater to the needs of both her and her pets. Recent experiences reveal a discerning perspective on items, highlighting the importance of convenience and user experience, particularly for pet grooming.\n\n- **Positive Experiences:** Generally favors products aligning with her aesthetic and functional expectations but has become increasingly discerning. Recent positive interactions reflect satisfaction with purchases that enhance grooming routines, emphasizing her interest in quality and user-friendly features.\n\nOverall, this user values organization, quality, and thoughtful design, prioritizing comfort and shared experiences, while enhancing her family's overall grooming and beauty routines.",
  "metrics": {
    "rouge1_f": 0.0870353581142339,
    "rouge2_f": 0.0018165304268846503,
    "rougeL_f": 0.04351767905711695,
    "meteor": 0.04534558939477239,
    "bleu1": 0.016041764391558338,
    "bleu2": 0.0020244605623535618,
    "bleu3": 0.00047186198275589274,
    "bleu4": 0.00022799955875991109,
    "bertscore_precision": 0.3470020592212677,
    "bertscore_recall": 0.4392906725406647,
    "bertscore_f1": 0.38773033022880554
  }
}