{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fascy Facial Mask Beauty Treatment 5 Packs 3 Step Mask, Korean Facial Skincare Mask, All Natural Moisturizing Facial Mask Skin Beauty Treatment with Eye Cream, Skin Rejuvenation Facial Mask\nReview Date: 2021/04/23\nStore: Fascy\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Fascy', 'Item Form': 'Cream, Sheet', 'Product Benefits': 'Hydrating', 'Scent': 'Centella Asiatica', 'Skin Type': 'Dry', 'Package Dimensions': '7.64 x 4.88 x 0.94 inches; 7.05 Ounces'}\nReview Text: Ya es la segunda vez que utilizo esta mascarilla, y tengo que decir que me encantan. Mi piel es sensible y me gusta que este set no causó ningún tipo de reacción alérgica, ni ardor, ni rojez. Al día siguiente mi piel se siente suave y reluciente, me encanta la sensación que deja esta mascarilla en mi piel.. algo que me gusta es que no se siente pegajosa y tampoco tienen olor, otra cosa que me gusta de esta mascarilla es que trae todo, crema para ojos, mascarilla de papel y una mascarilla para dormir.\nReview Title: Esta mascarilla me encantó, deja mi piel reluciente.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nYanJie\n{'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReally gorgeous, these kitty ear headbands are super soft and pretty. I love them because they don't squeeze the ears. They fit great on me and my litt girl so I recommend them for mom and a daughter spa nights or for make a different gift.\nHeadlands\nEyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nEhinew\n{'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nRecomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nKit para cejas!\nMake-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nLOMANTOWN\n{'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\n[[VIDEOID:91aba66c2bcb51abc6efaed2336f619d]] Estoy encantada con mi nuevo storage, comenzando con lo lindo que se ve y lo espacioso que es, el artículo está hecho de plástico que se ve y se siente de buena calidad. Es un gavetero para guardar de todo desde cósmicos, cremas del cuidado del la piel o hasta artículos para el cabello, me encantó porqué es grande y espacioso, sinceramente me cupo todos mis artículos de mi cuidado facial y aún me queda espacio para guardar mas cosas. Otra cosa que me gustó mucho es que es tipo maletero, es fácil de mover y colocar en distintos lugares cómo en el vanity, baño, cuartos ect.\nOrganizador de cosméticos.\nAltaba Long Wavy Wigs Ombre Golden Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult'}\nLa peluca se ve bella, me encantó el largo y los risos del cabello además los colores son hermosos, pero cuándo voy a comprar o usar una peluca tomo en cuenta varias cosas y esta peluca no cumple con ninguno de los requisitos. Esta peluca parece peluca, que quiero decir? Bueno la banda del centro es demasiado ancha se puede notar claramente el grosor de la peluca con la división de la frente y se ve feo, otra cosa que no me gusta es que si peinas o mueves el cabello se ven claramente las bandas y los huecos sin cabello, es decir tiene muy poco cabello. Otra cosa que no me gusta es que la peluca suelta demasiado cabello no puedes pasar los dedos o peinar con cepillo porqué se salen los cabellos de la peluca. Desafortunadamente no la recomiendo.\nPeluca estilo ombre.\nBH DERMCENTER Retinol Serum Restores Rejuvenates and Purifies Skin, 1 oz, Reduces Appearance of Fine Lines, Non-GMO, Vegan, Cruelty Free\nBH DERMCENTER\n{'Product Dimensions': '2 x 2 x 5 inches; 1 Ounces', 'Item model number': 'BHDRETSER', 'UPC': '850004068076'}\nNo me gustó este suero para el rostro, comencé a usar este suero y ya en la 2nd vez mi piel comenzó a cambiar notoriamente, piel es sensible y este suero me causó un brote en la piel, mi piel comenzó a sentirse muy reseca, me dejó la piel muy maltratada, así que no lo recomiendo para personas con piel sensible.\nNo lo recomiendo para pieles sensibles.\nCanple Self-cleaning Slicker Brush for Medium Long Hair Types Dog and Cat, Removes Loose Hair Undercoat Effectively Reduce Mats & Tanglings Grooming Brush\nCanple\n{'Brand': 'Canple', 'Special Feature': 'Self Cleaning', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Hair Type': 'All', 'Package Dimensions': '10.16 x 6.3 x 2.2 inches; 8.82 Ounces'}\n[[VIDEOID:5ee8a58a8f5b5d4ef7ef0f6e1c59ab85]] Es un excelente artículo, lo recomiendo para aquellos gatos o perros que son muy peludos. En mi casa tengo un gato muy peludo, así que este cepillo es ideal para remover el pelo, y a la vez a mi gato le gusta el masaje que le da. En lo personal me gusta porqué es un cepillo fácil de limpiar. Me gustó mucho.\nIdeal para mascotas muy peludas.\nRonas Timeless Albutin Ampoule 0.06fl oz 10vial. herbal extracts moisturizing.Skin Tone up clear Brightenting.vitality. Beautysalon Brand\nRonas\n{'Skin Type': 'Dry', 'Brand': 'Ronas', 'Item Form': 'Ampoule', 'Item Volume': '2 Milliliters', 'Unit Count': '1.00 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.61 x 5.24 x 0.98 inches; 4.2 Ounces'}\nDesafortunadamente deben de mejorar el paquete de envío de este artículo, este artículo es demasiado delicado para enviarlo en un sobre normal. Desafortunadamente  mi paquete llegó roto, sólo 2 ampollas llegaron en buen estado, así que desde mi experiencia no lo recomiendo.\nMi paquete llegó roto.\nFascy Facial Mask Beauty Treatment 5 Packs 3 Step Mask, Korean Facial Skincare Mask, All Natural Moisturizing Facial Mask Skin Beauty Treatment with Eye Cream, Skin Rejuvenation Facial Mask\nFascy\n{'Brand': 'Fascy', 'Item Form': 'Cream, Sheet', 'Product Benefits': 'Hydrating', 'Scent': 'Centella Asiatica', 'Skin Type': 'Dry', 'Package Dimensions': '7.64 x 4.88 x 0.94 inches; 7.05 Ounces'}\nYa es la segunda vez que utilizo esta mascarilla, y tengo que decir que me encantan. Mi piel es sensible y me gusta que este set no causó ningún tipo de reacción alérgica, ni ardor, ni rojez. Al día siguiente mi piel se siente suave y reluciente, me encanta la sensación que deja esta mascarilla en mi piel.. algo que me gusta es que no se siente pegajosa y tampoco tienen olor, otra cosa que me gusta de esta mascarilla es que trae todo, crema para ojos, mascarilla de papel y una mascarilla para dormir.\nEsta mascarilla me encantó, deja mi piel reluciente.",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to prioritize soft, comfortable accessories for personal care and skincare, valuing quality and effectiveness. Recent purchases reflect satisfaction with products that ensure no adverse reactions, reinforcing her focus on product reliability and safety, especially for sensitive skin.\n\n- **Aesthetic Appeal:** Maintains a discerning eye for visually appealing designs that align with her quality standards, now placing additional importance on the sensory experience of products, such as fragrance-free options.\n\n- **Family-Oriented:** Emphasizes grooming routines that can be shared with her daughter, actively seeking items that enhance enjoyment and bonding. Her elevated expectations for quality drive careful product selection for family use.\n\n- **Gift-Giving:** Open to practical and aesthetically pleasing gifts that include efficient storage solutions, while remaining cautious about their usability and delivery standards following recent experiences.\n\n- **Practicality:** Appreciates durable, effective grooming products for her family, exhibiting increasing selectivity regarding their reliability and the potential for damage during shipping.\n\n- **Positive Experiences:** Prefers products that meet her aesthetic and operational criteria. Recent positive experiences reinforce her commitment to reliability and quality assurance, making her more attentive to product reviews and shipping conditions.\n\nOverall, the user prioritizes organization, quality, and thoughtful design in enhancing her family's grooming routines, balancing these preferences with a more cautious and discerning purchasing approach focused on product reliability and delivery excellence.",
  "metrics": {
    "rouge1_f": 0.06578947368421054,
    "rouge2_f": 0.0,
    "rougeL_f": 0.03070175438596491,
    "meteor": 0.030504286045254455,
    "bleu1": 0.003956003570908548,
    "bleu2": 0.00016598920070724438,
    "bleu3": 5.7747039802065955e-05,
    "bleu4": 3.4090835819454244e-05,
    "bertscore_precision": 0.33539387583732605,
    "bertscore_recall": 0.43961817026138306,
    "bertscore_f1": 0.3804979622364044
  }
}