{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Eyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nReview Date: 2020/11/04\nStore: Ehinew\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nReview Text: Recomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nReview Title: Kit para cejas!\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nYanJie\n{'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReally gorgeous, these kitty ear headbands are super soft and pretty. I love them because they don't squeeze the ears. They fit great on me and my litt girl so I recommend them for mom and a daughter spa nights or for make a different gift.\nHeadlands\nEyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nEhinew\n{'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nRecomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nKit para cejas!",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Continues to enjoy soft, comfortable accessories for personal care and skincare routines, now expanded to include eyebrow grooming products.\n- **Aesthetic Appeal:** Prefers attractive, playful designs (e.g., cat ears) that add a fun element to practical items, but may be less focused on bold or dramatic looks, as indicated by recent experiences with eyebrow products.\n- **Family-Oriented:** Values products suitable for shared activities, particularly mother-daughter bonding experiences such as spa nights, which likely includes beauty routines.\n- **Gift-Giving:** Open to purchasing items as thoughtful gifts, suggesting a preference for unique and cute gift ideas, while also considering the practicality of such items.\n- **Practicality:** Appreciates products that fit well and do not cause discomfort. Recent experiences indicate a preference for items that prioritize gentle application and care to avoid harsh effects, especially regarding personal grooming.\n- **Positive Experiences:** Generally has a favorable view of products when they meet aesthetic and functional expectations. However, recent feedback shows a willingness to critique products that don’t align with comfort standards or personal care values, leading to moderate ratings for unsatisfactory experiences.\n\nOverall, this user maintains a priority for comfort, design, and shared experiences, while becoming increasingly discerning about the effects of beauty products on personal care routines.",
  "metrics": {
    "rouge1_f": 0.14830508474576273,
    "rouge2_f": 0.01702127659574468,
    "rougeL_f": 0.07203389830508475,
    "meteor": 0.10203195541088847,
    "bleu1": 0.1613816266511769,
    "bleu2": 0.02180036722911909,
    "bleu3": 0.005198320133281002,
    "bleu4": 0.002540744905364701,
    "bertscore_precision": 0.3749980628490448,
    "bertscore_recall": 0.4236173927783966,
    "bertscore_f1": 0.39782777428627014
  }
}