{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Wicky Brazilian Virgin Straight Virgin Hair Bundles with Closure(16 18 20 with 14 inch,Middle Part),Grade 8A 100% Unprocessed Human Hair Extensions,Hair Bundles with Closure,Natural Color\nReview Date: 2020/05/29\nStore: WICKY\nAverage Rating: 4.1\nProduct Details: {'Brand': 'WICKY', 'Color': 'Black', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight'}\nReview Text: [[VIDEOID:652b4da8daedc21dc23a7acb2b6a211c]] So far the hair is great and feels very soft. I got 30 inch bundle. The price is great. I will color the hair and add photos once that is done. But the hair is really great and have a natural shine and bounce to it. I recommend it. I will also do a review on it on my YouTube channel AgglaJ.\nReview Title: Best affordable hair\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Wicky Grade 9A Brazilian Body Wave Bundles With Closure (16 18 20+16,Three Part) 100% Unprocessed Brazilian Hair Bundles With Closure Nature Black\nWICKY\n{'Brand': 'WICKY', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Package Dimensions': '10 x 8.6 x 2.2 inches; 11.99 Ounces', 'UPC': '783057920803'}\nThe hair feels great and take color well. It holds and curls you may put in it. It did not become dry after being colored. It still feels soft. It’s worth the money. You can see a better review of it on my YouTube channel Aggla J.\nIt’s worth it\nWicky Brazilian Virgin Straight Virgin Hair Bundles with Closure(16 18 20 with 14 inch,Middle Part),Grade 8A 100% Unprocessed Human Hair Extensions,Hair Bundles with Closure,Natural Color\nWICKY\n{'Brand': 'WICKY', 'Color': 'Black', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight'}\n[[VIDEOID:652b4da8daedc21dc23a7acb2b6a211c]] So far the hair is great and feels very soft. I got 30 inch bundle. The price is great. I will color the hair and add photos once that is done. But the hair is really great and have a natural shine and bounce to it. I recommend it. I will also do a review on it on my YouTube channel AgglaJ.\nBest affordable hair",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Aficionado**: The user remains dedicated to high-quality hair products, particularly seeking natural, unprocessed human hair that is versatile and stylish. Their recent purchase emphasizes their preference for products that maintain softness and offer a natural shine.\n\n- **Color and Creativity**: Demonstrating a passion for customization, the user values hair products that can be easily colored without compromising quality. Sharing their intent to dye the hair highlights their desire for creative expression through hair care.\n\n- **Quality and Value Focus**: Maintaining their discerning nature, the user rates products based on performance and affordability, showing a clear preference for value-driven choices without sacrificing quality.\n\n- **Social Engagement and Influence**: With a thriving YouTube channel for beauty reviews, the user actively shares their experiences and recommendations, reinforcing their role as a knowledgeable influencer in hair care.\n\n- **Natural and Informative Choices**: The user exhibits a consistent inclination towards products that are described as natural and 100% unprocessed, reflecting a commitment to safer beauty options. They appreciate detailed product information and rely on comprehensive reviews, enhancing their purchase decisions and community engagement.\n\nOverall, the user is a conscientious consumer focused on quality, creativity, and community sharing in the realm of hair care, continuously seeking products that enhance their personal style while aligning with their values.",
  "metrics": {
    "rouge1_f": 0.25058004640371234,
    "rouge2_f": 0.037296037296037296,
    "rougeL_f": 0.12064965197215777,
    "meteor": 0.17029560616517136,
    "bleu1": 0.238972164961235,
    "bleu2": 0.07009380972822574,
    "bleu3": 0.02566133184934138,
    "bleu4": 0.00873946484893354,
    "bertscore_precision": 0.3932737708091736,
    "bertscore_recall": 0.4186541736125946,
    "bertscore_f1": 0.4055672883987427
  }
}