{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Gypsy Faux Locs Crochet Braids 18 Inch 5 Packs wavy crochet hair Natural Wave Pre-looped Twist Faux Locs Crochet 24 Strands/Pack African Roots Braid （1B）\nReview Date: 2020/10/22\nStore: Liang Dian\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Liang Dian', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10.16 x 9.06 x 3.66 inches; 1.1 Pounds', 'UPC': '738631321118'}\nReview Text: [[VIDEOID:71407be12dcaeedfbc76e27ac96097d6]] I like the locs and the wave pattern. However it just did not give me that real authentic locs look. They were easy to use and install. It comes with the hook to use and the little stylish hair accessories. The locs looked uniformed. But if you want the more natural look all you have to do is stretch it and slightly brush it\nReview Title: Cute locs\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Wicky Grade 9A Brazilian Body Wave Bundles With Closure (16 18 20+16,Three Part) 100% Unprocessed Brazilian Hair Bundles With Closure Nature Black\nWICKY\n{'Brand': 'WICKY', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Package Dimensions': '10 x 8.6 x 2.2 inches; 11.99 Ounces', 'UPC': '783057920803'}\nThe hair feels great and take color well. It holds and curls you may put in it. It did not become dry after being colored. It still feels soft. It’s worth the money. You can see a better review of it on my YouTube channel Aggla J.\nIt’s worth it\nWicky Brazilian Virgin Straight Virgin Hair Bundles with Closure(16 18 20 with 14 inch,Middle Part),Grade 8A 100% Unprocessed Human Hair Extensions,Hair Bundles with Closure,Natural Color\nWICKY\n{'Brand': 'WICKY', 'Color': 'Black', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight'}\n[[VIDEOID:652b4da8daedc21dc23a7acb2b6a211c]] So far the hair is great and feels very soft. I got 30 inch bundle. The price is great. I will color the hair and add photos once that is done. But the hair is really great and have a natural shine and bounce to it. I recommend it. I will also do a review on it on my YouTube channel AgglaJ.\nBest affordable hair\nBrazilian Straight Human Hair Bundles (20 22 24 Inch) Straight Bundles 10A Unprocessed Virgin Hair Weave Bundles\nALIANNA\n{'Brand': 'ALIANNA', 'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Durable', 'Package Dimensions': '10.5 x 10.13 x 2.48 inches; 10.86 Ounces'}\n[[VIDEOID:1ee6b1d47ec53f5cd5dfc2d99e1b3b63]] This hair is so soft and pretty. It is very straight and true to length. The bundles are full and the hair has volume. The hair remains straight even after a cowash. It’s worth the price. The hair is still soft after two installs.\nWorth it\nGypsy Faux Locs Crochet Braids 18 Inch 5 Packs wavy crochet hair Natural Wave Pre-looped Twist Faux Locs Crochet 24 Strands/Pack African Roots Braid （1B）\nLiang Dian\n{'Brand': 'Liang Dian', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10.16 x 9.06 x 3.66 inches; 1.1 Pounds', 'UPC': '738631321118'}\n[[VIDEOID:71407be12dcaeedfbc76e27ac96097d6]] I like the locs and the wave pattern. However it just did not give me that real authentic locs look. They were easy to use and install. It comes with the hook to use and the little stylish hair accessories. The locs looked uniformed. But if you want the more natural look all you have to do is stretch it and slightly brush it\nCute locs",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Aficionado**: The user continues to prioritize high-quality hair products, particularly valuing those made from natural, unprocessed human hair. Their recent acquisition reflects a commitment to styles that are versatile, durable, and maintain their integrity over repeated use.\n\n- **Color and Creativity**: Creativity in hair care remains central to the user’s identity. They appreciate products that allow for customization and styling flexibility, enhancing their ability to express personal style.\n\n- **Quality and Value Focus**: The user has a critical eye for balancing performance and affordability, consistently seeking products that deliver quality results while being cost-effective. They evaluate purchases based on detailed performance metrics and overall value.\n\n- **Social Engagement and Influence**: Actively involved in a popular YouTube channel, the user shares detailed reviews and recommendations, reinforcing their status as a knowledgeable hair care influencer and building community through shared experiences.\n\n- **Natural and Informative Choices**: Committed to safer beauty practices, the user favors products with natural characteristics and detailed product information. This focus informs their purchasing decisions and enhances community engagement around safer hair care options.\n\nOverall, the user embodies a conscientious and creative approach to hair care, continually exploring products that align with their values and enhance their personal styling while fostering a sense of community.",
  "metrics": {
    "rouge1_f": 0.19266055045871558,
    "rouge2_f": 0.00920245398773006,
    "rougeL_f": 0.0978593272171254,
    "meteor": 0.09754350983381688,
    "bleu1": 0.09475504444097092,
    "bleu2": 0.017940902973953104,
    "bleu3": 0.0033197133989118816,
    "bleu4": 0.001429362396525624,
    "bertscore_precision": 0.34698325395584106,
    "bertscore_recall": 0.4067498743534088,
    "bertscore_f1": 0.3744969666004181
  }
}