{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 24 Inch 6 Packs Soft Locs Braids Nu Faux Locs Crochet Hair Long Goddess Curly Hair Extensions 20 strands/pack (1B)\nReview Date: 2020/10/25\nStore: Liang Dian\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Liang Dian', 'Extension Length': '24 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.14 x 9.61 x 3.19 inches; 1.26 Pounds', 'UPC': '738631321033'}\nReview Text: These locs are so pretty and looks realistic. I love the length. They are so long. They were easy to install. I’m in love with them. They are real stretchy were you can make them look longer\nReview Title: Realistic locs\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Wicky Grade 9A Brazilian Body Wave Bundles With Closure (16 18 20+16,Three Part) 100% Unprocessed Brazilian Hair Bundles With Closure Nature Black\nWICKY\n{'Brand': 'WICKY', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Package Dimensions': '10 x 8.6 x 2.2 inches; 11.99 Ounces', 'UPC': '783057920803'}\nThe hair feels great and take color well. It holds and curls you may put in it. It did not become dry after being colored. It still feels soft. It’s worth the money. You can see a better review of it on my YouTube channel Aggla J.\nIt’s worth it\nWicky Brazilian Virgin Straight Virgin Hair Bundles with Closure(16 18 20 with 14 inch,Middle Part),Grade 8A 100% Unprocessed Human Hair Extensions,Hair Bundles with Closure,Natural Color\nWICKY\n{'Brand': 'WICKY', 'Color': 'Black', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight'}\n[[VIDEOID:652b4da8daedc21dc23a7acb2b6a211c]] So far the hair is great and feels very soft. I got 30 inch bundle. The price is great. I will color the hair and add photos once that is done. But the hair is really great and have a natural shine and bounce to it. I recommend it. I will also do a review on it on my YouTube channel AgglaJ.\nBest affordable hair\nBrazilian Straight Human Hair Bundles (20 22 24 Inch) Straight Bundles 10A Unprocessed Virgin Hair Weave Bundles\nALIANNA\n{'Brand': 'ALIANNA', 'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Durable', 'Package Dimensions': '10.5 x 10.13 x 2.48 inches; 10.86 Ounces'}\n[[VIDEOID:1ee6b1d47ec53f5cd5dfc2d99e1b3b63]] This hair is so soft and pretty. It is very straight and true to length. The bundles are full and the hair has volume. The hair remains straight even after a cowash. It’s worth the price. The hair is still soft after two installs.\nWorth it\nGypsy Faux Locs Crochet Braids 18 Inch 5 Packs wavy crochet hair Natural Wave Pre-looped Twist Faux Locs Crochet 24 Strands/Pack African Roots Braid （1B）\nLiang Dian\n{'Brand': 'Liang Dian', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10.16 x 9.06 x 3.66 inches; 1.1 Pounds', 'UPC': '738631321118'}\n[[VIDEOID:71407be12dcaeedfbc76e27ac96097d6]] I like the locs and the wave pattern. However it just did not give me that real authentic locs look. They were easy to use and install. It comes with the hook to use and the little stylish hair accessories. The locs looked uniformed. But if you want the more natural look all you have to do is stretch it and slightly brush it\nCute locs\n24 Inch 6 Packs Soft Locs Braids Nu Faux Locs Crochet Hair Long Goddess Curly Hair Extensions 20 strands/pack (1B)\nLiang Dian\n{'Brand': 'Liang Dian', 'Extension Length': '24 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.14 x 9.61 x 3.19 inches; 1.26 Pounds', 'UPC': '738631321033'}\nThese locs are so pretty and looks realistic. I love the length. They are so long. They were easy to install. I’m in love with them. They are real stretchy were you can make them look longer\nRealistic locs",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Aficionado**: The user remains dedicated to sourcing high-quality hair products, particularly those crafted from natural, unprocessed human hair. Their latest purchase showcases an appreciation for versatility and durability in styling, aligning with their preference for long-lasting, high-performing extensions.\n\n- **Color and Creativity**: The user values creativity in their hair care routine, favoring products that allow for customization and offer flexible styling options. This enables them to fully express their personal style and explore diverse looks.\n\n- **Quality and Value Focus**: With a keen eye for balancing performance with affordability, the user diligently evaluates products based on comprehensible performance metrics and overall value, ensuring that they optimize their beauty investments.\n\n- **Social Engagement and Influence**: Actively contributing to a popular YouTube channel, the user shares insightful reviews and recommendations, solidifying their role as a knowledgeable hair care influencer and nurturing a community around shared hair care experiences.\n\n- **Natural and Informative Choices**: The user is committed to safer beauty practices, preferring products with natural attributes and comprehensive product information. This informs their purchasing decisions and enhances engagement within the community regarding safer hair care options.\n\nOverall, the user exemplifies a conscientious and creative approach to hair care, continuously exploring products that resonate with their values and enrich their personal style while fostering community connections.",
  "metrics": {
    "rouge1_f": 0.1803713527851459,
    "rouge2_f": 0.007978723404255319,
    "rougeL_f": 0.09814323607427054,
    "meteor": 0.080526382340993,
    "bleu1": 0.06289447952868285,
    "bleu2": 0.0067946805608563735,
    "bleu3": 0.0015039279991498893,
    "bleu4": 0.0007082097939445347,
    "bertscore_precision": 0.33630338311195374,
    "bertscore_recall": 0.4066247344017029,
    "bertscore_f1": 0.368135929107666
  }
}