{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Wiwoseo Faux Mink Lashes False Eyelashes Dramatic 20MM Long Wispy Cat Eyes Look Lashes 20 Pairs Mixed 2 Styles Fake Eye Lashes Wholesale Pack\nReview Date: 2020/11/01\nStore: wiwoseo\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Wiwoseo', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '9 x 7.6 x 0.7 inches; 1.59 Ounces', 'Item model number': 'F1507-5'}\nReview Text: [[VIDEOID:360f58bdb171ac2bf8071487920bdaf5]] These lashes are cute! It has a lot of volume. It looks like mink eyelash extensions. It’s not super thick. That makes them feel comfortable. I don’t  feel like I have a lazy eye when I wear them.\nReview Title: Cute lashes\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Wicky Grade 9A Brazilian Body Wave Bundles With Closure (16 18 20+16,Three Part) 100% Unprocessed Brazilian Hair Bundles With Closure Nature Black\nWICKY\n{'Brand': 'WICKY', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Package Dimensions': '10 x 8.6 x 2.2 inches; 11.99 Ounces', 'UPC': '783057920803'}\nThe hair feels great and take color well. It holds and curls you may put in it. It did not become dry after being colored. It still feels soft. It’s worth the money. You can see a better review of it on my YouTube channel Aggla J.\nIt’s worth it\nWicky Brazilian Virgin Straight Virgin Hair Bundles with Closure(16 18 20 with 14 inch,Middle Part),Grade 8A 100% Unprocessed Human Hair Extensions,Hair Bundles with Closure,Natural Color\nWICKY\n{'Brand': 'WICKY', 'Color': 'Black', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight'}\n[[VIDEOID:652b4da8daedc21dc23a7acb2b6a211c]] So far the hair is great and feels very soft. I got 30 inch bundle. The price is great. I will color the hair and add photos once that is done. But the hair is really great and have a natural shine and bounce to it. I recommend it. I will also do a review on it on my YouTube channel AgglaJ.\nBest affordable hair\nBrazilian Straight Human Hair Bundles (20 22 24 Inch) Straight Bundles 10A Unprocessed Virgin Hair Weave Bundles\nALIANNA\n{'Brand': 'ALIANNA', 'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Durable', 'Package Dimensions': '10.5 x 10.13 x 2.48 inches; 10.86 Ounces'}\n[[VIDEOID:1ee6b1d47ec53f5cd5dfc2d99e1b3b63]] This hair is so soft and pretty. It is very straight and true to length. The bundles are full and the hair has volume. The hair remains straight even after a cowash. It’s worth the price. The hair is still soft after two installs.\nWorth it\nGypsy Faux Locs Crochet Braids 18 Inch 5 Packs wavy crochet hair Natural Wave Pre-looped Twist Faux Locs Crochet 24 Strands/Pack African Roots Braid （1B）\nLiang Dian\n{'Brand': 'Liang Dian', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '10.16 x 9.06 x 3.66 inches; 1.1 Pounds', 'UPC': '738631321118'}\n[[VIDEOID:71407be12dcaeedfbc76e27ac96097d6]] I like the locs and the wave pattern. However it just did not give me that real authentic locs look. They were easy to use and install. It comes with the hook to use and the little stylish hair accessories. The locs looked uniformed. But if you want the more natural look all you have to do is stretch it and slightly brush it\nCute locs\n24 Inch 6 Packs Soft Locs Braids Nu Faux Locs Crochet Hair Long Goddess Curly Hair Extensions 20 strands/pack (1B)\nLiang Dian\n{'Brand': 'Liang Dian', 'Extension Length': '24 Inches', 'Hair Type': 'Wavy, Curly', 'Material Feature': 'Natural', 'Package Dimensions': '11.14 x 9.61 x 3.19 inches; 1.26 Pounds', 'UPC': '738631321033'}\nThese locs are so pretty and looks realistic. I love the length. They are so long. They were easy to install. I’m in love with them. They are real stretchy were you can make them look longer\nRealistic locs\nRhinestone Crystal Diamond Headbands for Women Luxury Shiny Padded Diamond Headband Hair Hoops Fashion Hair Accessories for Girls Bejewelled Hairband Sparkly Party Headband (Silver)\nYMSGIRL\n{'Age Range (Description)': 'Adult', 'Occasion': 'party', 'Material': 'Rhinestone', 'Fabric Type': 'Rhinestone', 'Number of Items': '1', 'Package Dimensions': '6.06 x 5.87 x 1.14 inches; 3.21 Ounces'}\n[[VIDEOID:4bb8748a5c25eb3b3c37e6e8260d44f4]] I’m so in love with this headband. It’s really cute! There was no rhinestones missing. It sparkles. I’m happy it fits my big head. It’s worth the cost. It’s also a cute gift to give to someone.\nCute headband\nWiwoseo Faux Mink Lashes False Eyelashes Dramatic 20MM Long Wispy Cat Eyes Look Lashes 20 Pairs Mixed 2 Styles Fake Eye Lashes Wholesale Pack\nwiwoseo\n{'Brand': 'Wiwoseo', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '9 x 7.6 x 0.7 inches; 1.59 Ounces', 'Item model number': 'F1507-5'}\n[[VIDEOID:360f58bdb171ac2bf8071487920bdaf5]] These lashes are cute! It has a lot of volume. It looks like mink eyelash extensions. It’s not super thick. That makes them feel comfortable. I don’t  feel like I have a lazy eye when I wear them.\nCute lashes",
  "profile": "**User Profile Summary:**\n\n- **Hair and Beauty Enthusiast**: The user is dedicated to sourcing high-quality hair products, particularly those made from natural, unprocessed human hair. Their interest has expanded to include beauty accessories like false eyelashes, further enhancing their versatile styling options and personal expression.\n\n- **Creative Expression**: Emphasizing creativity in their beauty routines, the user appreciates products that allow for unique and eye-catching looks. Their recent foray into dramatic lashes reflects their desire for accessories that add flair to both everyday styles and special occasions.\n\n- **Quality and Value Focus**: Consistently balancing performance with affordability, the user evaluates products based on performance metrics and overall value. This meticulous approach ensures satisfying results in their beauty investments.\n\n- **Social Engagement and Influence**: Actively contributing to a well-followed YouTube channel, the user shares insightful reviews and recommendations, reinforcing their role as a knowledgeable beauty influencer and fostering community connections.\n\n- **Natural and Informative Choices**: Committed to safer beauty practices, the user prefers products with natural attributes and detailed information to aid in their purchasing decisions. They engage with their community around the importance of safe and effective beauty options.\n\nOverall, the user showcases a conscientious and creative approach to hair care and beauty, continuously exploring new products that resonate with their values while enhancing their personal style and community engagement.",
  "metrics": {
    "rouge1_f": 0.15866388308977036,
    "rouge2_f": 0.010460251046025104,
    "rougeL_f": 0.07306889352818371,
    "meteor": 0.06451135747535605,
    "bleu1": 0.0220919530672353,
    "bleu2": 0.0033366950469408047,
    "bleu3": 0.0006554534150686728,
    "bleu4": 0.0002907782334164004,
    "bertscore_precision": 0.34527888894081116,
    "bertscore_recall": 0.432184636592865,
    "bertscore_f1": 0.3838745653629303
  }
}