{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mozart in the Jungle\nReview Date: 2015/03/01\nCategories: Comedy\nProduct Description: ['A new Amazon Original Series: \\xa0What happens behind the curtains at the symphony is just as captivating as what happens on stage. Created by Paul Weitz (About a Boy), Roman Coppola (The Darjeeling Limited), and Jason Schwartzman (Rushmore). Brash new maestro Rodrigo (Gael Garcia Bernal) is stirring things up, and young oboist Hailey (Lola Kirke) hopes for her big chance.']\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Producers': ['ロマン･コッポラ', 'ジェイソン･シュワルツマン', 'ジョン･ストラウス', 'ポール･ワイツ'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows']}\nReview Text: What took me so long to finally tune in to this outstanding series? And where is the next season? (Can't wait!) And, where have you been keeping Gael Garcia Bernal? More, please!<br /><br />The music (!), casting, acting, scripts, directing . . . all brilliant!\nReview Title: Great Music, Great Drama\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Midnight in Paris\nKathy Bates  (Actor),     Adrien Brody  (Actor),     Woody Allen  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"This is a romantic comedy set in Paris about a family that goes there because of business, and two young people who are engaged to be married in the fall have experiences there that change their lives. It's about a young man's great love for a city, Paris, and the illusion people have that a life different from theirs would be much better.\", 'Amazon.com', 'Paris is a city that lends itself to daydreaming, to walking the streets and imagining all sorts of magic, a quality that Woody Allen understands perfectly.', 'Midnight in Paris', \"is Allen's charming reverie about just that quality, with a screenwriter hero named Gil (Owen Wilson) who strolls the lanes of Paris with his head in the clouds and walks right into his own best fantasy. Gil is there with his materialistic fiancée (Rachel McAdams) and her unpleasant parents, taking a break from his financially rewarding but spiritually unfulfilling Hollywood career--and he can't stop thinking that all he wants to do is quit the movies, move to Paris, and write that novel he's been meaning to finish. You know, be like his heroes in the bohemian Paris of the 1920s. Sure enough, a midnight encounter draws him into the jazzy world of Scott and Zelda Fitzgerald, Picasso and Dali, and an intense Ernest Hemingway, who promises to bring Gil's manuscript to Gertrude Stein for review. Gil wakes up every morning back in the real world, but returning to his enchanted Paris proves fairly easy. In the execution of this marvelous fantasia, Allen pursues the idea that people of every generation have always romanticized a previous age as golden (this is in fact explained to us by Michael Sheen's pedantic art expert), but he also honors Gil's need to find out certain truths for himself. The movie's on the side of gentle fantasy, and it has some literary/cinematic in-jokes that call back to the kind of goofy humor Allen created in\", 'Love and Death', \".The film is guilty of the slackness that Allen's latter-day directing has sometimes shown, and the underwritten roles for McAdams and Marion Cotillard are better acted than written. But the city glows with Allen's romantic sense of it, and Owen Wilson has just the right nice-guy melancholy to put the idea over. A worthy entry in the Cinema of the Daydream.\", '--Robert Horton']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Contributor': 'Michael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla BruniMichael Sheen, Woody Allen, Marion Cotillard, Stephen Tenenbaum, Rachel McAdams, Jaume Roures, Owen Wilson, Adrien Brody, Gravier Productions, Inc.; Mediaproduccion, S.L., Letty Aronson, Kathy Bates, Carla Bruni  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'MFR043396385269#N', 'Director': 'Woody Allen', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, Subtitled, Widescreen, Closed-captioned', 'Run time': '1 hour and 34 minutes', 'Release date': 'December 20, 2011', 'Actors': 'Kathy Bates, Adrien Brody, Carla Bruni, Marion Cotillard, Rachel McAdams', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Letty Aronson, Stephen Tenenbaum, Jaume Roures', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWoody Allen's love affair with Paris.<br /><br />A winner of a movie! Thanks for this one, Woody Allen, I hope you win an award and I hope this movie wins many. The first minute or two of this film, scenes of Paris with jazz music, was wonderful! (Frankly, I would have preferred classical cello music, but the visuals alone worked beautifully with their sepia overtones.)<br /><br />My favorite scene involved a surrealistic exchange among Dali, Luis Bunuel, Man Ray and our protagonist Gil where they all spoke about a rhinoceros from their individual viewpoints. (Inspired and hilarious -- loved it!) Other great philosophy came from Hemingway. And on writing, Gertrude Stein said it best.<br /><br />Brilliant cast: Kathy Bates as Gertrude Stein, Adrien Brody as Salvador Dali, Tom Hiddleston as F. Scott Fitzgerald and Carla Bruni as museum guide. The part of Owen Wilson would most likely have been played by Woody Allen himself if he had been slightly younger, but Wilson does his best to affect Allen's mannerisms.<br /><br />Paris IS a most beautiful city. I've walked much of Paris in the rain and I agree with one premise of this movie: rain enhances the beauty of Paris. (One of my most invigorating days, ever, was sitting on the top level of an open-air tour bus, in the rain, umbrella open, soaring around Paris from one arrondissement to another.)<br /><br />This is a movie I will want to watch at least once a year as I do with Enchanted April, Amelie, Up At The Villa, It's A Wonderful Life and a few other classics where immeasurable love and skill went into their creation.\nLove Affair In And With Paris\nMozart in the Jungle\nComedy\n['A new Amazon Original Series: \\xa0What happens behind the curtains at the symphony is just as captivating as what happens on stage. Created by Paul Weitz (About a Boy), Roman Coppola (The Darjeeling Limited), and Jason Schwartzman (Rushmore). Brash new maestro Rodrigo (Gael Garcia Bernal) is stirring things up, and young oboist Hailey (Lola Kirke) hopes for her big chance.']\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Ελληνικά', 'Suomi', 'Filipino', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', 'Українська', 'Tiếng Việt', '中文（简体）', '中文（繁體）'], 'Producers': ['ロマン･コッポラ', 'ジェイソン･シュワルツマン', 'ジョン･ストラウス', 'ポール･ワイツ'], 'Starring': ['Gael García Bernal', 'Lola Kirke', 'Saffron Burrows']}\nWhat took me so long to finally tune in to this outstanding series? And where is the next season? (Can't wait!) And, where have you been keeping Gael Garcia Bernal? More, please!<br /><br />The music (!), casting, acting, scripts, directing . . . all brilliant!\nGreat Music, Great Drama",
  "profile": "**User Profile Summary:**\n\nThe user expresses a profound appreciation for romantic comedies, particularly those set in Paris, favoring films that blend whimsical storytelling with rich visuals and cultural nostalgia. They enjoy works featuring literary elements and artistic references, as evidenced by their admiration for scenes involving renowned historical figures and philosophical discussions.\n\nRecent engagement with a series highlights their continued interest in narratives intersecting music and drama, showcasing a preference for captivating casting and brilliant storytelling. This interaction reflects their value for emotional depth and artistry, as they resonate with the music and overall production quality. Their interest in soundtracks, specifically classical music, remains noted, enhancing their viewing experience.\n\nThe user habitually re-watches beloved classics annually, maintaining an emotional connection with these films. Their preference for geographically themed narratives, especially those capturing the essence of romanticized locations like Paris, indicates a desire for atmospheric elements that contribute to the storytelling. Overall, their engagement reflects a strong love for cinematic narratives that intertwine romance, humor, art, and nostalgia, with a newfound enthusiasm for series that explore behind-the-scenes creativity in the artistic world.",
  "metrics": {
    "rouge1_f": 0.14497272018706156,
    "rouge2_f": 0.0156128024980484,
    "rougeL_f": 0.07170693686671863,
    "meteor": 0.04057362714235747,
    "bleu1": 0.0007358229653134013,
    "bleu2": 0.0002580996571781025,
    "bleu3": 0.00010033120412013926,
    "bleu4": 2.961597748728935e-05,
    "bertscore_precision": 0.3267483413219452,
    "bertscore_recall": 0.4913671910762787,
    "bertscore_f1": 0.39249569177627563
  }
}