{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/03/29\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Bowman', 'John Terlesky', 'Bill Roe', 'Bryan Spicer', 'Paul Holahan', 'Thomas J. Wright', 'Jeff Bleckner', 'David Barrett', 'Kate Woods', 'Larry Shaw'], 'Studio': ['ABC']}\nReview Text: I love Castle and Season 8 is no exception!!  Always twists and surprises.  My favorite show by far!!  All of the characters continue to keep me interested and you never know what to expect!  Fantastic writing and fun story lines along with the intrigue!\nReview Title: I love Castle and Season 8 is no exception\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Barrett', 'Ralph Hemecker', 'Robert Harmon', 'Alex Zakrzewski', 'John Behring', 'Alex Chapple', 'Jackeline Tejada', 'Eric Laneuville', 'Michael Pressman', 'Douglas Aarniokoski'], 'Studio': ['CBS']}\nGreat cast and neat storyline!  Love Tom Seleck!\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Doug Warner'], 'Producers': ['Andrew W. Marlowe', 'Rob Bowman'], 'Starring': ['Jon Huertas', 'Tamala Jones', 'Ruben Santiago-Hudson']}\nThis is a great video.  Fun to watch and you get to know the Actors and see how they relate to each other!  Very fun!!\nThis is a great video. Fun to watch and you get to ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James Burrows', 'David Lee', 'Andy Ackerman', 'Rick Beren'], 'Producers': ['David Angell', 'Peter Casey', 'David Lee', 'Kelsey Grammer', \"Dan O'Shannon\", 'Mark Reisman'], 'Starring': ['Kelsey Grammer', 'John Mahoney', 'David Hyde Pierce'], 'Studio': ['Grub Street Productions']}\nIt was a great show and it is fun to watch it via Amazon!!\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Bowman', 'John Terlesky', 'Bill Roe', 'Bryan Spicer', 'Paul Holahan', 'Thomas J. Wright', 'Jeff Bleckner', 'David Barrett', 'Kate Woods', 'Larry Shaw'], 'Studio': ['ABC']}\nI love Castle and Season 8 is no exception!!  Always twists and surprises.  My favorite show by far!!  All of the characters continue to keep me interested and you never know what to expect!  Fantastic writing and fun story lines along with the intrigue!\nI love Castle and Season 8 is no exception",
  "profile": "**User Profile Summary**\n\nThis user demonstrates a strong preference for high-quality productions featuring talented casts, particularly expressing a fondness for specific actors. They consistently gravitate towards content that includes varying degrees of mature themes, such as violence, substance use, and strong language. The user appreciates engaging storylines and well-crafted narratives, focusing on overall entertainment value, character development, and interpersonal dynamics among actors.\n\nRecent interactions further highlight their enjoyment of series known for plot twists and surprises, indicating a desire for content that keeps them intrigued and entertained. They have expressed particular enjoyment in watching videos that provide insights into actors' relationships, showcasing their appreciation for character interactions. Their latest endorsement of a series reinforces their interest in engaging narratives with fantastic writing and fun storylines.\n\nThe user favors content with English audio and captions, though they are open to watching without subtitles if the quality is high and the experience engaging. Their positive reviews are often coupled with high ratings, underscoring a focus on enjoyable viewing experiences. Overall, they value strong performances, intricate plots, and the connections fostered among the cast, revealing an affinity for productions that provide both entertainment and a deeper appreciation of character relationships.",
  "metrics": {
    "rouge1_f": 0.21029082774049218,
    "rouge2_f": 0.03595505617977528,
    "rougeL_f": 0.1029082774049217,
    "meteor": 0.08469760060949595,
    "bleu1": 0.07698744431641033,
    "bleu2": 0.022045239387087186,
    "bleu3": 0.011549981605624149,
    "bleu4": 0.003957699528810314,
    "bertscore_precision": 0.342961847782135,
    "bertscore_recall": 0.3977189064025879,
    "bertscore_f1": 0.3683163523674011
  }
}