{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ambari Black Crowns for Women Tiara Vintage Style Crown Hair Piece Accessories for Bride, Wedding, Prom, Birthday, Engagement, Bridal Shower - Baroque Jewelry for Women, New Packaging\nReview Date: 2020/08/17\nStore: ambari\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '4.53 x 4.53 x 2.36 inches; 6.38 Ounces', 'UPC': '645312483587'}\nReview Text: Own your QUEEN status by getting this crown so you can pin it in your hair and wear it all day long so no one forgets who runs the place.<br />I really love this crown. It's sort of heavy and not flimsy at all.  The rhinestones are obviously fake and not very clear but that won't stop me from rocking it.<br />The metal is sort of a coppery tarnish gold color in person. It has two little holes where you can use clips or even string to attach it to your head so it doesn't move around.<br />This would be cute for photo shoots, even for kids or pets.\nReview Title: Great for photo shoots, dress up or  just for fun.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hair Straightener Flat Iron for Straightening and Curling, Milantia 3/4 Inch Straightener for Bangs and Short Hair, Dual Voltage Ionic Mini Straightening Iron with Travelling Pouch and EU Adapter\nMilantia\n{'Shape': 'Flat', 'Brand': 'Milantia', 'Hair Type': 'Frizzy', 'Material': 'Ceramic', 'Size': '1 Count (Pack of 1)', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.09 x 0.79 x 1.57 inches; 7.1 Ounces', 'Item model number': 'LM-161', 'Manufacturer': 'Milantia'}\nI straighten my hair daily. This mini straightener is perfect for camping and on the go. I actually got this to keep at the office for emergencies but I'll be taking it with me when I go camping too.<br />Due to the smaller size it takes a little longer to straighten my hair. This isn't ideal for every day use unless you have really short hair, but it works great in a pinch or when you are trying to pack light.<br />It comes with a pretty blue green travel case/bag. It has dual voltage 100-240V and an adapter for worldwide travel.<br />It has 1 heat setting and that's 410°. This worked fine for me because that's the temp my regular straightener is set at.\nPerfect for my purse, the office and camping.\nMagnetic Eyelashes and Magnetic Eyeliner Kit, Magnetic Eyelashes with Eyeliner, 5 Pairs Reusable Magnetic Eyelashes with Tweezer, False Lashes\nEyenjoy\n{'Brand': 'Eyenjoy', 'Item Dimensions LxWxH': '5.71 x 5.39 x 0.71 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Magnet', 'Product Dimensions': '5.71 x 5.39 x 0.71 inches; 2.12 Ounces', 'UPC': '736067423758'}\nI've always struggled with gluing in lashes and I had pretty much given up. I ordered these after a friend was telling me about how great magnetic liner is. I was super impressed with how easy it is for me to put these on.<br />I'm kind of confused on whether the liner is sticky and magnetic or just magnetic. I didn't let it dry all the way before doing my eyebrows and my lower eyelid got stuck to my upper eyelid. I couldn't tell if that was magnet pull or glue.<br />Whatever the liner is, it keeps those lashes in place and they are so easy to put on. The brush is thin but the thicker the line, the better it will hold on to the lashes.<br />My eye lids are sort of small and I think I'm going to have to trim these a tiny bit or the ends can be a little jabby in the corner of my eye.<br />I haven't worn these out yet due to the pandemic but I know the liner lasts because you have to scrub hard to get it off. These should last all day.\nNice selection, super easy to use.\nPurple Hair Mask for Blonde with Keratin & Jojoba Oil - Platinum & Silver Hair - Instantly Eliminate Brassiness & Yellows - Made in USA - Hair Toner - Bleached & Highlighted Hair - Sulfate Free - 8 oz\nWELLUTION\n{'Brand': 'WELLUTION', 'Item Form': 'Oil', 'Material Feature': 'Natural', 'Hair Type': 'Damaged,Dry,Color-treated', 'Product Benefits': 'Hydrating Treatment', 'Package Dimensions': '3.07 x 2.9 x 2.8 inches; 8 Ounces', 'UPC': '749715278440'}\nI've followed the directions and used this twice after shampooing with my purple shampoo. I notice a slight difference in tone but it's not that noticeable. This mask really conditioned my hair and it made my hair feel so soft. It would be great right after I bleach my hair. It also has a light pleasant scent.\nVery conditioning but doesn't really tone my hair\nAmbari Black Crowns for Women Tiara Vintage Style Crown Hair Piece Accessories for Bride, Wedding, Prom, Birthday, Engagement, Bridal Shower - Baroque Jewelry for Women, New Packaging\nambari\n{'Product Dimensions': '4.53 x 4.53 x 2.36 inches; 6.38 Ounces', 'UPC': '645312483587'}\nOwn your QUEEN status by getting this crown so you can pin it in your hair and wear it all day long so no one forgets who runs the place.<br />I really love this crown. It's sort of heavy and not flimsy at all.  The rhinestones are obviously fake and not very clear but that won't stop me from rocking it.<br />The metal is sort of a coppery tarnish gold color in person. It has two little holes where you can use clips or even string to attach it to your head so it doesn't move around.<br />This would be cute for photo shoots, even for kids or pets.\nGreat for photo shoots, dress up or  just for fun.",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Use Case:** Frequently straightens hair for convenience and travel; continues exploring makeup enhancements, especially magnetic eyelashes for ease of use. Recently expressed an interest in unique accessories for special occasions.\n- **Behavior Patterns:** Values practicality and versatility in products that serve multiple purposes (e.g., travel, office emergencies) while favoring user-friendly applications in makeup and hair care. Enjoys items that enhance personal style for events.\n- **Hair Type & Needs:** Manages frizzy, color-treated hair and seeks hydration and tonal benefits to alleviate brassiness and enhance color vibrancy.\n- **Product Features:** Prefers miniaturized designs for easy transport and dual voltage for global use; appreciates effective conditioning properties in hair products and easy application features in beauty products. Also values accessories that are well-designed and suitable for various occasions.\n- **Performance Requirements:** Focuses on high heat settings and long-lasting makeup; values products that effectively address both immediate styling needs and longer-term hair health.\n- **Aesthetic Preferences:** Enjoys attractive packaging, uniquely designed products, and accessories that add flair to overall appearance. Recently gravitated towards items that provide both aesthetic appeal and functionality.\n- **Overall Satisfaction:** Consistently rates products highly when they meet specific functional needs efficiently. Recently expressed satisfaction with a styling accessory for its quality and versatility, reflecting a preference for products that enhance personal expression in both hair and makeup.",
  "metrics": {
    "rouge1_f": 0.19,
    "rouge2_f": 0.02004008016032064,
    "rougeL_f": 0.084,
    "meteor": 0.07742863784930544,
    "bleu1": 0.03627884338200712,
    "bleu2": 0.00785600663471928,
    "bleu3": 0.0012820351452172772,
    "bleu4": 0.0005183573594752522,
    "bertscore_precision": 0.3903002142906189,
    "bertscore_recall": 0.4738035798072815,
    "bertscore_f1": 0.42801719903945923
  }
}