{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Romancing The Stone + The Jewel Of The Nile Set\nReview Date: 2018/09/02\nStore: Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Romance\nProduct Description: ['Actors: Michael Douglas, Kathleen Turner Directors: Danny DeVito Format: AC-3, Color Subtitles: French, Spanish Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.75 x 0.3 x 6 inches; 2.88 Ounces', 'Media Format': 'DVD', 'Subtitles': 'English'}\nReview Text: Two of my favorite movies. I like that both are on one DVD.\nReview Title: Two Favorites\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Young in Heart\nJanet Gaynor  (Actor),     Douglas Fairbanks Jr.  (Actor),     Richard Wallace  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Having been given the bum's rush at Monte Carlo, a clan of polished grifters (Janet Gaynor, Douglas Fairbanks, Jr., Roland Young, Billie Burke) make the fortuitous acquaintance of a wealthy and lonely old widow (Minnie Dupree) during a cross-continent train trip. Their plans to insinuate themselves in her life and sponge off of her wind up crashing on shoals of unaccustomed conscience, in this winning and warm comedy. Paulette Goddard, Richard Carlson, Henry Stephenson also star. 90 min. Standard; Soundtrack: English Dolby Digital mono; Subtitles: English; theatrical trailer.\"]\n{'Genre': 'Comedy', 'Format': 'Anamorphic, NTSC, Subtitled', 'Contributor': 'Roland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard WallaceRoland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard Wallace  See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Richard Wallace', 'Media Format': 'Anamorphic, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 9, 2018', 'Actors': 'Janet Gaynor, Douglas Fairbanks Jr., Paulette Goddard, Roland Young, Billie Burke', 'Subtitles': 'English', 'Studio': 'Kl Studio Classics', 'Number of discs': '1'}\nA precious old movie! Love the transformation that occurs in the con artist family. Optimistic story with positive, uplifting outcome.\nPrecious story, great stars!\nRomancing The Stone + The Jewel Of The Nile Set\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Romance\n['Actors: Michael Douglas, Kathleen Turner Directors: Danny DeVito Format: AC-3, Color Subtitles: French, Spanish Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.75 x 0.3 x 6 inches; 2.88 Ounces', 'Media Format': 'DVD', 'Subtitles': 'English'}\nTwo of my favorite movies. I like that both are on one DVD.\nTwo Favorites",
  "profile": "**User Profile Summary:**\n\nThe user exhibits a strong affinity for classic cinema, particularly comedies and romantic adventures that highlight character development and transformative narratives. They appreciate films featuring renowned actors, indicating a preference for star power and cinematic history. Their recent purchase of a DVD set featuring beloved classics reflects their enjoyment of nostalgic films and reinforces their tendency toward feel-good entertainment. The user values quality in filmmaking, as evidenced by their high average rating of 4.5 out of 5 for previous purchases, with their latest review showcasing a perfect rating of 5.0 for two of their favorite films. This suggests a critical yet appreciative viewing style that leans toward uplifting stories with positive resolutions. Additionally, their engagement with DVD formats implies a preference for accessible viewing experiences while still valuing content quality. Overall, the user’s preferences gravitate heavily towards lighthearted, nostalgic films that balance humor with heartfelt themes, making them a connoisseur of uplifting classic cinema.",
  "metrics": {
    "rouge1_f": 0.19718309859154928,
    "rouge2_f": 0.0202020202020202,
    "rougeL_f": 0.08853118712273642,
    "meteor": 0.06786850477200423,
    "bleu1": 0.041819737267906096,
    "bleu2": 0.012366559580136705,
    "bleu3": 0.0024136095031381728,
    "bleu4": 0.0010678031882063862,
    "bertscore_precision": 0.3036477565765381,
    "bertscore_recall": 0.3985399603843689,
    "bertscore_f1": 0.34468209743499756
  }
}