{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Guarding Tess\nReview Date: 2018/09/02\nStore: Nicolas Cage  (Actor),     Shirley MacLaine  (Actor),     Hugh Wilson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['What do you do with a former First Lady who\\'s unpredictable, ornery and impossible to please? Anything she wants! Shirley MacLaine and Nicolas Cage star in this comic, compassionate look at life after the White House for two former Washington insiders: First Lady Tess Carlisle and Secret Service agent Doug Chesnic. As uproarious as it is uplifting, GUARDING TESS is \"a grand mixture of laughter and tears.\" Gary Franklin, KCOP-TV']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 95 min', 'Director': 'Hugh Wilson', 'Media Format': 'Color, Multiple Formats, NTSC, Closed-captioned, Full Screen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 7, 1998', 'Actors': 'Nicolas Cage, Shirley MacLaine, Austin Pendleton, Edward Albert, James Redhorn', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Nancy Tanen, Ned Tanen', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Still one of the greats. Representing some of the best acting from two Hollywood icons. Great storytelling!\nReview Title: Great! Masterful Storytelling!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Young in Heart\nJanet Gaynor  (Actor),     Douglas Fairbanks Jr.  (Actor),     Richard Wallace  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Having been given the bum's rush at Monte Carlo, a clan of polished grifters (Janet Gaynor, Douglas Fairbanks, Jr., Roland Young, Billie Burke) make the fortuitous acquaintance of a wealthy and lonely old widow (Minnie Dupree) during a cross-continent train trip. Their plans to insinuate themselves in her life and sponge off of her wind up crashing on shoals of unaccustomed conscience, in this winning and warm comedy. Paulette Goddard, Richard Carlson, Henry Stephenson also star. 90 min. Standard; Soundtrack: English Dolby Digital mono; Subtitles: English; theatrical trailer.\"]\n{'Genre': 'Comedy', 'Format': 'Anamorphic, NTSC, Subtitled', 'Contributor': 'Roland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard WallaceRoland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard Wallace  See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Richard Wallace', 'Media Format': 'Anamorphic, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 9, 2018', 'Actors': 'Janet Gaynor, Douglas Fairbanks Jr., Paulette Goddard, Roland Young, Billie Burke', 'Subtitles': 'English', 'Studio': 'Kl Studio Classics', 'Number of discs': '1'}\nA precious old movie! Love the transformation that occurs in the con artist family. Optimistic story with positive, uplifting outcome.\nPrecious story, great stars!\nRomancing The Stone + The Jewel Of The Nile Set\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Romance\n['Actors: Michael Douglas, Kathleen Turner Directors: Danny DeVito Format: AC-3, Color Subtitles: French, Spanish Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.75 x 0.3 x 6 inches; 2.88 Ounces', 'Media Format': 'DVD', 'Subtitles': 'English'}\nTwo of my favorite movies. I like that both are on one DVD.\nTwo Favorites\nTwins\nArnold Schwarzenegger  (Actor),     Danny DeVito  (Actor),     Ivan Reitman  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Monthly Deals\n['Superstars Arnold Schwarzenegger and Danny DeVito team up for twice the laughs in this hilarious box-office blockbuster from director Ivan Reitman (Ghostbusters). An ambitious genetic experiment takes the wrong turn when two twins - who look nothing alike - are born and then separated. Years later, the unlikely siblings meet: Julius, a highly educated but sheltered giant with a big heart, and Vincent, a pint-sized hustler with an insatiable lust for women and money. With girlfriends in tow and a hitman on their tail, the newfound brothers set off on a wild, cross-country misadventure to find their mother - but end up finding out more about themselves.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Schwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & AdventureSchwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & Adventure  See more', 'Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Contributor': 'Trey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan ReitmanTrey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan Reitman  See more', 'Language': 'Spanish (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.33 Ounces', 'Item model number': 'Relay Time: 107 min', 'Director': 'Ivan Reitman', 'Media Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Run time': '1 hour and 47 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Arnold Schwarzenegger, Danny DeVito, Kelly Preston, Chloe Webb, Bonnie Bartlett', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Davies, William Osborne, Timothy Harris, Herschel Weingrod', 'Number of discs': '1'}\nStill a fun watch!\nFun Watch!\nThe American President / Dave\nMichael Douglas  (Actor),     Annette Bening  (Actor),     Frank Langella  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, Warner Sale\n['American President/Dave (DVD) (DBFE) (Multi-Title)', \"Michael Douglas and Kevin Kline are both President and accounted for in two hit comedies about the nation's Oval Office. Rob Reiner directs The American President [Side A], starring Douglas as a widower chief executive whose poll numbers plummet when he falls for an environmental lobbyist (Annette Bening). Martin Sheen, Michael J. Fox, Richard Dreyfuss and more top talents co-star in this nimble exploration of private romance in a public Presidency. And in a land where anybody can become President, anybody just did! Kline and Sigourney Weaver star in Dave [Side B], the wry Ivan Reitman-directed story of a lookalike who becomes a stand-in for the country's actual President. From coast to coast the votes are in:this double feature is a winner by a landslide!\", ']]>']\n{'Genre': 'Drama/Love & Romance', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Annette Bening, Frank Langella, Martin Sheen, Kevin Kline, Sigourney Weaver, Michael Douglas', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Item model number': 'WHV83767DVD', 'Director': 'Frank Langella', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'January 2, 2007', 'Actors': 'Michael Douglas, Annette Bening, Kevin Kline, Sigourney Weaver, Martin Sheen', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nTwo favorites, one dvd! Chances are if you like one you're going to like the other!\nGood buy\nCrocodile Dundee / Crocodile Dundee II Double Feature\nPaul Hogan  (Actor),     Linda Kozlowski  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['A free spirited Australian croc hunter leaves the out back to visit America\\'s Big Apple and quickly finds a girlfriend accompanied by a huge pack of trouble waiting for him as \"down under\" takes on a whole new meaning in these two block busters.']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Paul Hogan, Linda Kozlowski', 'Language': 'English', 'Runtime': '3 hours and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Item model number': '170164', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 28 minutes', 'Release date': 'March 5, 2013', 'Actors': 'Paul Hogan, Linda Kozlowski', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '2'}\nStill fun features. Two on one dvd. Yay!\nTwo on one dvd\nHousesitter [DVD]\nSteve Martin  (Actor),     Goldie Hawn  (Actor),     Frank Oz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Steve Martin and Goldie Hawn star in this hilarious romantic comedy about the consequences of \"stretching\" the truth. When architect Newton Davis\\' girlfriend Becky (Dana Delany) turns down his marriage proposal, his newly-built dream house suddenly becomes nothing more than an empty monument to her rejection. That is, until a chance encounter with Gwen (Hawn) turns his life upside-down. Intrigued by Newton\\'s story, Gwen visits the house and decides to move in on her own. Resourceful and creative, Gwen is soon fixing up the house and charming Newton\\'s family and neighbors—and all the while passing herself off as his new wife! Gwen even befriends Becky, who begins to see a Newton she never knew existed. Horrified at the deception yet unable to stop it, Newton finds himself playing along with her preposterous stories, her attempts at reconciling differences within the family and her campaign for his promotion at work. Finally, he convinces Gwen to fabricate their \"divorce\" so he can still get married to Becky—until he has a change of heart. It\\'s a delightful, warmhearted and intelligent comedy from director Frank Oz.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Contributor': 'Goldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel CroninGoldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel Cronin   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Surround)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 102 min', 'Director': 'Frank Oz', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Steve Martin, Goldie Hawn, Dana Delany, Julie Harris, Donald Moffat', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Brian Grazer', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Mark Stein', 'Number of discs': '1'}\nA fun favorite! As only two masterful comedians can deliver!\nA fun favorite!\nWag the dog\nDustin Hoffman  (Actor),     Robert De Niro  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Wag The Dog (DVD)', 'Academy Award winners Robert De Niro and Dustin Hoffman star in a tale of politics, power and Hollywood so outrageous it could be true! Two weeks before re-election, the President of the United States (Michael Belson) is accused of accosting a girl scout. Before the news reaches the media, his advisors call in a political consultant (De Nireo) specializing in image rescues. What to do? Hire a Hollywood producer (Hoffman) to create a war--distracting public attention from the scandal and rallying Americans to their President in surge of patriotic ferver.', ']]>', 'Amazon.com', 'Not only was Barry Levinson\\'s comedy shot in a relatively fast period of 29 days, the satire of politics and show business feels as if it were made yesterday. There\\'s a fresh spin quite evident here, a nervy satire of a presidential crisis and the people who whitewash the facts. The main players are a mysterious Mr. Fix-It (Robert De Niro), veteran Hollywood producer (Dustin Hoffman), and a White House aide (Anne Heche). Can the president\\'s molesting of a young girl be buried in the two weeks before an election? A war in Albania just might do the trick. In the good old days, the president would just invade. With modern technology, it\\'s even cleaner. The hungry press looks for any lead, convenient misinformation is created by the latest Hollywood fakery (\"all developed by the new James Cameron film\") creating images and merchandise all instantly packaged. And it must be real, because it\\'s on TV. David Mamet\\'s script never questions the morals or the absolute secrecy needed to pull this thing off. He and director Barry Levinson have enough truth in the story to make you wonder what is real news and what is just promotion the next time you see CNN. Many of the supporting players impact the story with mere presence: Denis Leary as a quote man, Willie Nelson as a songwriter. The three leads are magnificent. With the similarities between history and this film,', 'Wag', 'will forever linked to the Monica Lewinsky saga. This video version contains a new minidocumentary focusing on the parallels of the film with the Bill Clinton scandal, including comments from director Barry Levinson and hosted by newsman Tom Brokaw.', '--Doug Thomas']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4908852', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 15, 2005', 'Actors': 'Dustin Hoffman, Robert De Niro, Anne Heche, Denis Leary, Willie Nelson', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'New Line', 'Country of Origin': 'USA', 'Number of discs': '1'}\nExplains perfectly what's going on with the media and political manipulation of this country. Intended as satire, it's a little too close to the truth for comfort! Amusing and effective in its storytelling. Masterful execution of a plot that should make you shudder. Will get you to thinking for sure!\nMore Bite Than Bark\nGuarding Tess\nNicolas Cage  (Actor),     Shirley MacLaine  (Actor),     Hugh Wilson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['What do you do with a former First Lady who\\'s unpredictable, ornery and impossible to please? Anything she wants! Shirley MacLaine and Nicolas Cage star in this comic, compassionate look at life after the White House for two former Washington insiders: First Lady Tess Carlisle and Secret Service agent Doug Chesnic. As uproarious as it is uplifting, GUARDING TESS is \"a grand mixture of laughter and tears.\" Gary Franklin, KCOP-TV']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 95 min', 'Director': 'Hugh Wilson', 'Media Format': 'Color, Multiple Formats, NTSC, Closed-captioned, Full Screen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 7, 1998', 'Actors': 'Nicolas Cage, Shirley MacLaine, Austin Pendleton, Edward Albert, James Redhorn', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Nancy Tanen, Ned Tanen', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nStill one of the greats. Representing some of the best acting from two Hollywood icons. Great storytelling!\nGreat! Masterful Storytelling!",
  "profile": "**User Profile Summary:**\n\nThe user continues to exhibit a profound passion for classic cinema, with a particular fondness for comedies and romantic adventures that emphasize character development and transformative narratives. Their latest engagement reinforces a preference for feel-good entertainment that combines humor with thought-provoking storytelling, as evidenced by their recent interaction featuring a film celebrated for its masterful storytelling and strong performances by iconic actors. This interaction has further raised their average rating to an impressive 4.7, reflecting their critical yet appreciative viewing style. \n\nThe user remains drawn to films that intertwine satire with poignant social commentary, highlighting their interest in narratives that provoke reflection on contemporary issues while retaining a humorous edge. Their collection thrives on uplifting stories, dynamic relationships, and comedic misadventures, showcasing a consistent pursuit of emotionally resonant entertainment. Furthermore, their dedication to the genre is complemented by an appreciation for talented comedians and directors, assuring that their viewing experiences remain vibrant and fulfilling. \n\nMaintaining a preference for DVD formats, the user continues to prioritize accessible and high-quality cinematic experiences that support their love for humor and substantial storytelling. This consistent pattern of behavior solidifies their identity as a connoisseur of cinema that celebrates laughter and heartwarming moments, while also engaging with films that offer deeper insights.",
  "metrics": {
    "rouge1_f": 0.07966616084977239,
    "rouge2_f": 0.005315110098709187,
    "rougeL_f": 0.0417298937784522,
    "meteor": 0.02102950408035154,
    "bleu1": 3.493313471239338e-07,
    "bleu2": 1.2127133259606107e-07,
    "bleu3": 1.730456063444034e-08,
    "bleu4": 6.543811667836787e-09,
    "bertscore_precision": 0.32428568601608276,
    "bertscore_recall": 0.47520726919174194,
    "bertscore_f1": 0.3855016231536865
  }
}