{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 6 Pack Fine Mist Spray Bottles, 3.4oz/100ml Travel Spray Bottle with 2 Funnels & 9 Stickers for Travel Container & Home\nReview Date: 2020/08/28\nStore: Aioink\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Aioink', 'Material': 'Plastic', 'Capacity': '100 Milliliters, 3.4 Ounces', 'Number of Items': '6', 'Special Feature': 'Mist Spray', 'Package Dimensions': '9.1 x 5.5 x 1.4 inches; 3.21 Ounces', 'Item model number': '6-Sbottles-001'}\nReview Text: The bottles are very nice - fairly hard, dense plastic that feels sturdy and durable.  I like that the bottles are clear so that you can see what is in them easily.  Comes with labels and two small funnels to assist in filling the bottles.  These seem leak-proof and I like the misting action.  Also comes with a plastic cap to cover the spray nozzle.  These are great for traveling, your car, purse, your pocket, etc.  I filled one up with rubbing alcohol to keep in the car as a disinfectant (don’t leave it in the sun though!).  Also good for hairspray, water (as a cooling solution), facial toner, etc.  The size is perfect - small enough for portability but holds enough volume to make it worthwhile.\nReview Title: Nice quality bottles\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "allez outdoor | Biodegradable Cleansing Cloths | Natural Plant-Based Face and Body Wipes | PH Balanced | Cactus Bloom and Chaparral Scent | 20ct Individually Wrapped Towelettes\nAllez\n{'Brand': 'Allez', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Material Feature': 'Biodegradable Warning', 'Unit Count': '20.00 Count', 'Number of Items': '1', 'Package Dimensions': '6.2 x 5.4 x 4.2 inches; 13.62 Ounces', 'Item model number': 'ABWPS001', 'UPC': '860000823210', 'Manufacturer': 'Allez Outdoor, LLC'}\nThese wipes are pretty good (albeit expensive).  I like that they are larger (10”x15”) and individually wrapped, which makes carrying them with you easier.  These would be great to take along on a hiking or camping trip, or any time you might want to wipe down your whole body.  I do NOT understand why the ad, pictures, description or box doesn’t include the size of the item - I find that oddly curious.  They have an interesting scent that I suspect some people may not like.  It is the chaparral scent which can smell a little ‘chemically’.  It isn’t bad but it *is* a somewhat unusual scent. After wiping down the scent does linger for a while, albeit somewhat lighter.  The wipes seem to have a lot of wiping power... it seemed that the moisture just remained as I wiped down most of my body.  They don’t feel any more moist than other wipes do, but it seems that the moisture goes a longer way.  Overall a very good product that is a little pricey, but does offer a nice convenience factor.\n10” by 15” - larger size wipes\nEmpty Clear Glass Spray Bottles 2-PACK,Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Special Feature': 'Mist Spray', 'Package Dimensions': '10 x 6.5 x 3.4 inches; 1.4 Pounds', 'UPC': '791523234156'}\nI got these to put water/vinegar mixture in one and alcohol in the other, to use for cleaning and disinfecting purposes, respectively.  I wanted glass, rather than plastic, for these purposes.  The bottles themselves are top notch - heavy duty glass, nice size that is easy to hold yet doesn’t require constant refilling.  There are two included cap tops which are also nice - leak-proof if you want to store something in them that you either don’t need the sprayer for, OR, are transporting them somewhere and want to make sure no spillage.  The sprayer on the other hand, is not so great.  I do like that the sprayer tube is extra long... meaning you can get down to the last few drops.  But it feels cheap overall.  Other problems with the sprayer:  the screw on top fits pretty firmly, but the nozzle does not stay in place - it sort of swivels around.  This gets to be annoying if you are squirting multiple squirts because the nozzle keeps shifting.  The other thing that might be an issue for some is that there are only two settings and they are BOTH mist settings.  It appears that one is a slightly finer mist than the other (barely) but I am not 100% sure that is even the case.  This is not a problem for me because of the purpose I am using them... but wanted to point this out in case it might be a problem for others.  Overall the glass bottles are great but the nozzles need some work.  It also comes with 4 black labels - the labels actually are sort of a thin rubbery material and seem really nice... but what the heck am I going to use to write on BLACK labels?\nGlass bottle is top notch, sprayer is not\n6 Pack Fine Mist Spray Bottles, 3.4oz/100ml Travel Spray Bottle with 2 Funnels & 9 Stickers for Travel Container & Home\nAioink\n{'Brand': 'Aioink', 'Material': 'Plastic', 'Capacity': '100 Milliliters, 3.4 Ounces', 'Number of Items': '6', 'Special Feature': 'Mist Spray', 'Package Dimensions': '9.1 x 5.5 x 1.4 inches; 3.21 Ounces', 'Item model number': '6-Sbottles-001'}\nThe bottles are very nice - fairly hard, dense plastic that feels sturdy and durable.  I like that the bottles are clear so that you can see what is in them easily.  Comes with labels and two small funnels to assist in filling the bottles.  These seem leak-proof and I like the misting action.  Also comes with a plastic cap to cover the spray nozzle.  These are great for traveling, your car, purse, your pocket, etc.  I filled one up with rubbing alcohol to keep in the car as a disinfectant (don’t leave it in the sun though!).  Also good for hairspray, water (as a cooling solution), facial toner, etc.  The size is perfect - small enough for portability but holds enough volume to make it worthwhile.\nNice quality bottles",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Continues to prefer high-quality, convenient personal care products, particularly biodegradable options, with a growing interest in refillable and durable containers for practical uses.\n- **Size & Packaging:** Values larger sizes and packs for portability, showcasing a strong inclination toward practicality during outdoor activities and travel. Recently purchased compact, travel-friendly spray bottles that reinforce this trend.\n- **Usage Context:** Likely enjoys outdoor activities such as hiking and camping, indicated by the focus on practical eco-friendly products for cleaning and disinfecting. Recent interactions highlight a desire for multifunctional items suitable for various uses, from skincare to disinfecting.\n- **Scent Sensitivity:** Open to unique scents, with a preference for natural or plant-based fragrances while being cautious about synthetic aromas.\n- **Value Sensitivity:** Willing to pay for quality and convenience but remains diligent in evaluating product details, especially performance-related claims.\n- **Moisture Efficiency:** Appreciates products that deliver lasting moisture and effective cleaning capabilities, indicating a commitment to functionality and efficiency in design.\n\nOverall, this user values eco-friendly, effective, and practical products that enhance outdoor experiences while maintaining a focus on quality, functionality, and transparency in marketing. Their recent purchase reflects a continued commitment to convenience and utility in personal care solutions.",
  "metrics": {
    "rouge1_f": 0.18577075098814227,
    "rouge2_f": 0.02178217821782178,
    "rougeL_f": 0.07509881422924901,
    "meteor": 0.07812500000000001,
    "bleu1": 0.023853433759732055,
    "bleu2": 0.006112730731850853,
    "bleu3": 0.0025605168127920026,
    "bleu4": 0.0013948679834724306,
    "bertscore_precision": 0.3873087167739868,
    "bertscore_recall": 0.49553924798965454,
    "bertscore_f1": 0.43478986620903015
  }
}