{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/10/21\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Gert Frobe'], 'Producers': ['Arnold Kopelson', 'Gert Frobe', 'Gail Katz'], 'Starring': ['Dustin Hoffman', 'Rene Russo', 'Morgan Freeman'], 'Studio': ['WARNER BROS.']}\nReview Text: Fun but not very realistic; certainly compared to Contagion.  Too bad the CDC does not have a rapid response team.  Probably just as well that the Army does not.\nReview Title: Another movie to not watch with the flu\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Emma\nKate Beckinsale  (Actor),     Bernard Hepton  (Actor),     Diarmuid Lawrence  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, A&E Home Video, All A&E Titles\n[\"From the producers of A&E's Emmy award winning Pride and Prejudice.\", \"From the greatest romantic novelist of all time comes a delightfully wicked comedy of love and matchmaking. Jane Austen's sly and vivacious heroines have enchanted readers for more than 200 years. Now, for the first time on DVD, this acclaimed production from the creators of A&E's best selling Pride and Prejudice brings to life one of the most fascinating Austen characters of all time - the charming and mischievous Emma Woodhouse.\", \"Starring Kate Beckinsale, Emma is the story of a rich, clever and beautiful young woman who can't resist orchestrating other people's love lives. As her romantic plans go ridiculously wrong, however, it's Emma herself who risks missing out on her perfect match!\", \"Join A&E for a wry visit to the drawing rooms and country manors of 19th-century England - a visit to the enchanting world of Jane Austen's Emma now in the crystal clear digital clarity of DVD.\"]\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Raymond Coulthard, Bernard Hepton, Dido Miles, James Hazeldine, Samantha Morton, Prunella Scales, Guy Henry, Jane Austen, Sylvia Barter, Dominic Rowan, Kate Beckinsale, Mark Strong, Samantha Bond, Diarmuid Lawrence, Andrew DaviesRaymond Coulthard, Bernard Hepton, Dido Miles, James Hazeldine, Samantha Morton, Prunella Scales, Guy Henry, Jane Austen, Sylvia Barter, Dominic Rowan, Kate Beckinsale, Mark Strong, Samantha Bond, Diarmuid Lawrence, Andrew Davies  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Director': 'Diarmuid Lawrence', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 47 minutes', 'Release date': 'July 5, 2000', 'Actors': 'Kate Beckinsale, Bernard Hepton, Mark Strong, Samantha Bond, James Hazeldine', 'Subtitles': 'English', 'Studio': 'A&E Home Video', 'Writers': 'Andrew Davies, Jane Austen', 'Number of discs': '1'}\nWith Kate Beckinsale in the lead, this should have been a whale of a movie, especially if Ms. Beckinsale was allowed to bring some of her persona from Cold Comfort Farm in which she played a more Emma-like character there than she was allowed to do here. Beckinsale's Emma was overly moody and had none of the light cheerfulness of Austen's Emma (or Ms. Paltrow's for that matter). Mark Stong is not Jeremey Northrup but he is VERY good. Unfortunately, this movie never establishes that Mr. Knightly is a daily presence in the Woodhouse household (i.e., compare with the Northrup-Paltrow version), which is critical to understanding the relationship between Mr. Knightly and Emma. Indeed, their love for each other is nearly a shocker in this version coming in its last 10 minutes. If you are an Emma fan, you may find this film a disappointment. In general, I prefer Ms. Beckinsale over Ms. Paltrow but Ms. Paltrow's film is a better Reader's Digest adaptation of this lengthly and rich novel. I wonder if modern movie/DVD audiences have the patience for a longer 4 and 6 hour versions of this novel akin to what has been done for Pride & Prejudice by the BBC and A&E, respectively. Indeed, the latest 2-hour version of P&P by Hollywood is a bare skeleton of that incredible story.\nNot quite Miss Jane's Emma\n{'Content advisory': ['Violence', 'frightening scenes', 'smoking'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Jackson'], 'Producers': ['Peter Jackson', 'Fran Walsh', 'Carolynne Cunningham', 'Zane Weiner'], 'Starring': ['Sir Ian McKellen', 'Martin Freeman', 'Richard Armitage']}\nWhile I appreciate bringing elements of the appendices of LOTR into the Hobbit movies, beginning with this one, this movie is misguided in vision and execution.  Trying to craft another Aragorn out of Thorin is silly and disingenuous to the spirit of the dwarves.  Making this more about Thorin and not Bilbo is also not in keeping with the core elements of this story.  And then, all those chase scenes!  There were too many, and they way, way were too long. I stopped watching the movie for awhile.  If this keeps up, this series of films will be reminescent of the second Star Wars series with the young Anakin - and that series was a disaster in story telling.\nWay too many tedious chases\nMarvel's The Avengers\nScience Fiction, Adventure, Ambitious, Fantastic\n['Marvel’s The Avengers is the Super Hero team up of a lifetime, featuring iconic Marvel Super Heroes Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joss Whedon'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr. Chris Evans']}\nGreat one liners and actually some very nice acting here and there from Downey, Johansson and Ruffalo (the man can communicate a lot without uttering a word) but otherwise this was tepid story.  We watched The Avengers to get background on the Agents of SHIELD TV show, which we are enjoying.\nGreat backstory for Agents of Shield - not much more\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Marc Forster'], 'Producers': ['Brad Pitt', 'Dede Gardner', 'Jeremy Kleiner', 'Ian Bryce', 'Marc Forster', 'Brad Simpson', 'David Ellison', 'Dana Goldberg', 'Paul Schwake', 'Graham King', 'Tim Headington'], 'Starring': ['Brad Pitt', 'Mireille Enos', 'Fana Mokoena'], 'Studio': ['SciFi and Fantasy']}\nI watched this film for the second time on bluray and thoroughly enjoyed it.  The story line bears little relationship to the book, which turns out to be OK as the plague theme runs well in this adaptation.  Indeed, it makes for a nice double feature with the movie Contagion.\nNot the book but a lot of fun anyway\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Clive Donner'], 'Producers': ['Robert E. Fuisz', 'Alfred R. Kelman', 'William F. Storke'], 'Starring': ['George C. Scott', 'Angela Pleasence', 'Edward Woodward'], 'Studio': ['20TH CENTURY FOX']}\nThe title of this review says it all.  I think that if Roger Rees' version of Scoorge's nephew bore the same lightness that Barry Mackay did in the 1938 version, this might be the superior film.  Too many versions ignore the importance of the lightness that Fred brings to this story.\nBetter than most but not the Reginald Owen 1938 version\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kathryn Bigelow'], 'Producers': ['Colin Wilson', 'Greg Shapiro', 'Ted Schipper', 'Mark Boal', 'Kathryn Bigelow', 'Megan Ellison'], 'Starring': ['Jessica Chastain', 'Mark Strong', 'Joel Edgerton'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nAfter what turned out to be the most entertaining exchange with the online help at Amazon Instant Video, we gave up trying to watch this video. DO NOT GET THIS ON AMAZON INSTANT VIDEO.  It will be a waste of $17 as  we are seeing more buffering time with Amazon Instant Video videos as we are movie....2-4 minutes of movie at a time.  By the time we ended our chat with the Amazon help, he had us unplugging everything.....I was waiting for him to tell us to go turn off the circuit at the circuit breaker or call the city to have them turn off power to our neighborhood....and then, reboot the move so that we can see 4-6 minutes of video at a time. By the way we have no problem with Netflix or Hulu+ steaming videos.\nMovie is great Amazon Instant Video is a disaster\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jonathan Glazer'], 'Producers': ['James Wilson', 'Nick Wechsler', 'Tessa Ross', 'Reno Antoniades', 'Walter Campbell', 'Claudia Bluemhuber', 'Ian Hutchinson', 'Florian Dargel'], 'Starring': ['Scarlett Johansson'], 'Studio': ['A24']}\nThere is really nothing here. Dark scenes with actors reciting vapid lines.  Lots of longing looks.  It is almost a parody of 60's minimalist dialogue art films but no where as interesting.\nEmpty movie - a waste of talent\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Steven Soderbergh'], 'Producers': ['Michael Shamberg', 'Stacey Sher', 'Gregory Jacobs'], 'Starring': ['Matt Damon', 'Kate Winslet', 'Jude Law'], 'Studio': ['Warner Bros. Domestic Televisi']}\nBetter than Outbreak, better, more real characters.  The structural biochemistry is flaky and the timeline for the research nuts but it was fun to see all the same\nDon't watch this with the flu\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Gert Frobe'], 'Producers': ['Arnold Kopelson', 'Gert Frobe', 'Gail Katz'], 'Starring': ['Dustin Hoffman', 'Rene Russo', 'Morgan Freeman'], 'Studio': ['WARNER BROS.']}\nFun but not very realistic; certainly compared to Contagion.  Too bad the CDC does not have a rapid response team.  Probably just as well that the Army does not.\nAnother movie to not watch with the flu",
  "profile": "User Profile Summary:\n\n- **Content Preference**: The user continues to show a strong interest in adaptations of classic literature, particularly those by Jane Austen, focusing on romantic themes and character development. They emphasize scrutiny of narratives for depth and authenticity, critiquing adaptations that appear vacuous.\n\n- **Format Preference**: Preferring DVD and Blu-ray formats, the user seeks high-quality productions and meticulously crafted adaptations. Recent frustrations with streaming services have reinforced their inclination towards physical media for a stable viewing experience.\n\n- **Genre Interest**: While enjoying romance and comedy, the user is increasingly exploring fantasy and science fiction narratives. They appreciate adaptations that present unique twists on source material, provided the storytelling is compelling and substantial.\n\n- **Actor Preference**: They favor performances by Kate Beckinsale and Scarlett Johansson but express disappointment in recent performances that lack engagement or resonance.\n\n- **Critical Approach**: The user remains highly critical, focusing on character development and tone, with a specific interest in authenticity and engagement. Their recent reviews suggest a desire for realism in narratives, yet they maintain an open mind towards well-crafted adaptations.\n\n- **Viewer Expectations**: Seeking in-depth storytelling with thoughtful pacing and complexity, the user desires substance and satisfaction in their viewing experiences, highlighting a preference for realistic portrayals without compromising on narrative depth.",
  "metrics": {
    "rouge1_f": 0.11136624569460392,
    "rouge2_f": 0.008045977011494253,
    "rougeL_f": 0.052812858783008045,
    "meteor": 0.03414822604465718,
    "bleu1": 0.00017453437415561633,
    "bleu2": 3.762569142643276e-05,
    "bleu3": 1.321046323082666e-05,
    "bleu4": 4.406088551604509e-06,
    "bertscore_precision": 0.34652483463287354,
    "bertscore_recall": 0.48220890760421753,
    "bertscore_f1": 0.4032594561576843
  }
}