{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fleabag\nReview Date: 2016/12/18\nCategories: Comedy, Drama\nProduct Description: ['Fleabag is a hilarious and poignant window into the mind of a dry-witted, sexual, angry, grief-riddled woman, as she hurls herself at modern living in London. Award-winning playwright Phoebe Waller-Bridge writes and stars as Fleabag, an unfiltered woman trying to heal, while rejecting anyone who tries to help her and keeping up her bravado all along.']\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Tim Kirkby', 'Harry Bradbeer'], 'Producers': ['Two Brothers Pictures Ltd'], 'Starring': ['Phoebe Waller-Bridge', 'Sian Clifford', 'Olivia Colman']}\nReview Text: Great dark British comedy. It's not for everyone, but I recommend it if you love a quirky comedy and have a twisted sense of humor.\nReview Title: Dark & Twisted Fun\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Jillian Michaels Ripped in 30\nJillian Michaels  (Actor),     Andrea Ambandos  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n[\"Get RIPPED with America's Toughest Trainer! Jillian Michaels new DVD Ripped in 30 is a comprehensive 30-day diet and exercise plan designed to get you in the best shape of your life! Ripped in 30 is comprised of four 24-minute workouts based on Jillian's best-selling body shredding 3-2-1 interval system: 3 minutes of strength, 2 minutes of cardio and 1 minute of abs. Each incredible routine has fresh, fun new moves that progress in difficulty over a four-week period (a new workout each week). You'll start with workout level 1 and advance to workout level 4. Jillian also shows modified moves for both beginners and advanced athletes in each workout. All you have to do to get sick, insane, crazy, amazing results fast is stick with the Ripped in 30 diet and exercise program for 30 days. Get ready to get RIPPED!\"]\n{'Genre': 'Exercise & Fitness', 'Format': 'NTSC', 'Contributor': 'Jillian Michaels, Andrea Ambandos', 'Language': 'Unqualified (Dolby Digital 2.0 Stereo)', 'Runtime': '2 hours and 16 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '05-58076', 'Director': 'Andrea Ambandos', 'Media Format': 'NTSC', 'Run time': '2 hours and 16 minutes', 'Release date': 'March 9, 2012', 'Actors': 'Jillian Michaels', 'Studio': 'Gaiam - Fitness', 'Number of discs': '1'}\nThis DVD is not for the faint of heart. It is quite challenging and you'll be pouring sweat after just a few minutes. I've made it through all four levels, though I've only done level 4 once. I'd say that level 1 done with 8lb handweights is the best overall workout on the DVD. If you're looking for an intense 30-min workout that hits all the right places, this is the one for you.\nBest Jillian workout yet!!!\nX-TrainFit: Circuit Burnout 30 Day Fat Shred- 5-Disc set\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['LOSE WEIGHT AT HOME WITH MONIQUE ST.PIERRE', 'Looking to scorch fat but have limited time each day? Then this is the set for you! Monique St.Pierre and X-TrainFit bring you a high energy and up-tempo full body workout that shreds fat while toning muscle in only 20 minutes a day.', 'The pyramid approach keeps you moving with cardio and toning sets while showing a variety of intensity levels. Work through multiple moves for 5 minutes, rest for 1 minute, sweat and tone for 4 minutes, rest for 1, shred it for 3 more minutes, rest for 1, push through 2 minutes, rest for 1 more then finish strong in the final 1 minute set!', '5 WORKOUTS ON 5 DVDS', 'Abs and Assets - Chisel your entire midsection and glutes with this killer workout.', 'Upper Body - Effective use of cardio moves and upper body toning will burn fat while toning everything from the belly button up.', 'Lower Body - Lunge, kick, squat and more to get the lower body you have been wanting.', 'Total Body - Monique will work every inch of your body in this intense workout.', 'Abs and Burn - This cardiovascular routine is a fast paced, no nonsense, full body fat burner.', 'SUPER SETS', 'If you think you can handle it or you are just a cardio-fanatic, well we have you covered. Each DVD includes a bonus Super Set designed to give you an added calorie burn at the end of each workout. Give us 5 more minutes and we will grant you bonus pounds shredded!', 'TRAINING AND NUTRITION GUIDE', 'The included guide guide will help maximize your workouts and fat loss by providing guidance and recipes designed to fuel your workouts and lose the fat. Combine this with the Training Calendar provided and your results are guaranteed!', 'Requires: Dumbbells or Resistance band and stability ball (not included)']\n{'Genre': 'Exercise & Fitness', 'Format': 'DVD', 'Contributor': 'Monique St.Pierre', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9 x 6.1 x 0.9 inches; 4 Ounces', 'Media Format': 'DVD', 'Actors': 'Monique St.Pierre', 'Studio': 'X-TrainFit', 'Number of discs': '5'}\nI love to switch up my workouts. This one is a great addition to my collection. It's challenging and moves at a quick pace. I'll definitely be buying more DVDs in this series.\nGreat Workouts\nBreathless Body 3: Hit It Big\nAmy Dixon  (Actor),     Rachel Tonick  (Director),     Jeven Dovey  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Product Description', \"Breathless Body 3: HIIT IT BIG is the perfect addition to the highly acclaimed Breathless Body cardio series. This high-energy program gets you moving with eight drills of Tabata-inspired high-intensity interval training (HIIT). Each bodyweight drill lasts for 40 exciting seconds followed by 20 seconds of light movement for recovery. The workout wraps up with a super-charged four-minute metabolic boost, a dynamic core blast for solid abs and a relaxing stretch. This all-level workout - where you choose the exercise options that suit you best - is expertly designed for burning massive amounts of calories and fat in a short amount of time. You'll complete every Breathless Body 3 workout feeling exhilarated and fitter than ever. HIIT IT BIG, GO BREATHLESS AND FEEL THE DIFFERENCE!\", 'About the Actor', \"Amy Dixon is one of the most dynamic fitness instructors and celebrity Master Trainers in the fitness industry. In addition to multiple fitness certifications, she holds a Bachelor of Science degree in exercise physiology. Amy is widely involved in notable health and fitness projects: She's a contributing editor at numerous fitness and lifestyle magazines; the Senior Group Fitness Manager for Equinox Fitness Clubs; the resident coach and spokesperson for Avon's breast cancer walks; Reebok's Global Walking Partner; and a Master Trainer for FitnessGlo, Gatorade, Schwinn Cycling, BOSU and Shockwave. A former world competitive power tumbler and coach, Amy applies her energy and athleticism to the many award-winning workout DVDs and online programs she has created. With more than 15 years of teaching experience, Amy specializes in educating and motivating her class participants and celebrity clients to achieve extraordinary results. Her television appearances include The Today Show, ABC News, E Entertainment Television, Good Day LA, Custom Fit, Exercise TV, Your LA, Fox News, and MTV. Her talents have also been featured in popular publications: Women's Health, Shape, SELF, Health, FITNESS, Better Homes and Gardens, Marie Claire, Variety, In Touch Weekly, The New York Times, The Washington Post and The Los Angeles Times. Amy resides in Southern California with her husband and two young daughters.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.48 x 5.35 x 0.55 inches; 2.65 Ounces', 'Director': 'Rachel Tonick, Jeven Dovey', 'Media Format': 'NTSC', 'Run time': '1 hour', 'Release date': 'December 3, 2013', 'Actors': 'Amy Dixon', 'Studio': 'Amy Dixon Fitness', 'Number of discs': '1'}\nI have the other two Breathless Body workouts and this one doesn't disappoint. This is a challenging workout that will have you pouring sweat and gasping for air. I can't wait for the next one!\nAmy Dixon Does It Again\n10 Minute Solution: Ultimate Bootcamp\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Exercise & Fitness\n[\"No Time to Exercise? We have the solution for youthe 10 MINUTE SOLUTION! Everyone can find at least 10 minutes in their day, and we've developed five different boot camp routines that are just 10 minutes each. These powerful little workouts fit into even the busiest of schedules. Split them into five separate workouts, mix and match your favorites to fit your schedule each day, or do them all together for the ultimate boot camp experience!\"]\n{'Genre': 'Fitness', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Jessica Smith', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DV21586', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '57 minutes', 'Release date': 'June 29, 2010', 'Actors': 'Jessica Smith', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI'm a big fan of Jessica Smith. I have several of her workouts. If you think a 10-minute workout is easy, think again. I'm easily bored and hate doing the same workout two days in a row. I really like the fact that you can mix and match segments to come up with different combinations. I'll definitely buy more in this series.\nYes!!!\nJeanette Jenkins/ The Hollywood Trainer: Sexy Abs Cardio Sculpt\nJeanette Jenkins  (Actor),     Kelly Rowland  (Actor)    Format: Unknown Binding\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Join Superstar Kelly Rowland & Hollywood Trainer Jeanette Jenkins for this heart pumping, Total Body Sculpting, Super Calorie Burning workout & perfect compliment to their best selling SEXY ABS DVD! Kelly & Jeanette\\xa0motivate\\xa0you through\\xa05minute time saving chapters\\xa0targeting each area of the body!\\xa0 This workout delivers a 3-in-1 mix of Fat Blasting Cardio, Head to Toe Sculpting and Focused Ab work with the bonus of over 10 new SEXY ABS Cardio Sculpt Signature Moves to maximize your fat burning, chisel your body & reveal SEXY ABS!']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Media Format': 'DVD', 'Actors': 'Jeanette Jenkins, Kelly Rowland'}\nI have quite a large library of workout DVDs because I'm easily bored. This one ranks as one of the most challenging. I was gasping for breath at minute three of the second chapter. I only wish the DVD allowed you to choose chapters to create a custom workout.\nNot Just Another Celebrity Workout\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Melville Shavelson'], 'Producers': ['Melville Shavelson'], 'Starring': ['Paul Newman', 'Joanne Woodward', 'Thelma Ritter'], 'Studio': ['Paramount']}\nI love classic movies. I'm not sure how I missed this one. It's set in Paris and has all the makings of the perfect romantic comedy. I'll be adding this to my list of favorites.\nGreat Movie\n{'Subtitles': ['None available'], 'Directors': ['Shin Won Ho'], 'Producers': ['CJ E&M'], 'Starring': ['Jung Eun Ji', 'Seo In Guk', 'Shin So Yool'], 'Studio': ['tvN']}\nI've recently become addicted to Korean dramas. This one doesn't disappoint. I binged four episodes on my first viewing. The only flaw is that no one seems to have aged at the reunion. Otherwise, it's a pretty perfect show.\nGreat intro to Korean dramas\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Roy Del Ruth'], 'Producers': ['William Jacobs'], 'Starring': ['Doris Day', 'Gordon MacRae', 'Jack Smith']}\nI thought I had seen most of Doris Day's movies. This one was a great find. If you love classic musicals, you'll love this one.\nGood Clean Fun\nFleabag\nComedy, Drama\n['Fleabag is a hilarious and poignant window into the mind of a dry-witted, sexual, angry, grief-riddled woman, as she hurls herself at modern living in London. Award-winning playwright Phoebe Waller-Bridge writes and stars as Fleabag, an unfiltered woman trying to heal, while rejecting anyone who tries to help her and keeping up her bravado all along.']\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Čeština', 'Dansk', 'Deutsch', 'Ελληνικά', 'Español (Latinoamérica)', 'Español (España)', 'Suomi', 'Filipino', 'Français', 'עברית', 'हिन्दी', 'Magyar', 'Indonesia', 'Italiano', '日本語', '한국어', 'Bahasa Melayu', 'Norsk Bokmål', 'Nederlands', 'Polski', 'Português (Brasil)', 'Português (Portugal)', 'Română', 'Русский', 'Svenska', 'தமிழ்', 'తెలుగు', 'ไทย', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Tim Kirkby', 'Harry Bradbeer'], 'Producers': ['Two Brothers Pictures Ltd'], 'Starring': ['Phoebe Waller-Bridge', 'Sian Clifford', 'Olivia Colman']}\nGreat dark British comedy. It's not for everyone, but I recommend it if you love a quirky comedy and have a twisted sense of humor.\nDark & Twisted Fun",
  "profile": "**Updated User Profile Summary:**\n\n- **Fitness Enthusiast**: The user maintains a strong commitment to intense exercise programs, emphasizing effective strength and cardio integration.\n- **Challenge-Seeker**: They thrive on demanding workouts, showcasing a willingness to push through tough training sessions for significant results.\n- **Structured Programs**: The user appreciates comprehensive fitness plans that offer progressive guidance, preferring systematic approaches to training.\n- **Diverse Workout Formats**: Actively seeking various workout formats, such as DVD workouts and high-intensity interval training (HIIT), keeps their regimen engaging and dynamic.\n- **Positive Reviews**: Their high ratings of fitness products indicate satisfaction with effective programs, underscoring a preference for well-crafted, results-oriented offerings.\n- **Equipment Use**: Incorporating resistance training, they utilize a range of equipment, including weights and resistance bands, aligning with their known shopping patterns.\n- **Commitment to Routine**: Demonstrating determination and discipline by completing full workout programs highlights their dedication to fitness.\n- **Preference for Quick Workouts**: Valuing shorter, high-intensity sessions, they appreciate flexibility in workouts, enjoying the ability to mix and match exercise segments to stave off monotony.\n- **Cultural Interests**: Recently, the user has expanded their cultural engagement with interest in dark comedies and quality storytelling, along with their existing love for classic musicals and Korean dramas, indicating a broader taste in media.\n\nOverall, the user exhibits serious dedication to fitness while embracing diverse cultural experiences, seeking invigorating and adaptable programs that fit their busy lifestyle and reflect their appreciation for both humor and depth in entertainment.",
  "metrics": {
    "rouge1_f": 0.11665930181175432,
    "rouge2_f": 0.015037593984962407,
    "rougeL_f": 0.06274856385329208,
    "meteor": 0.039803377721416414,
    "bleu1": 0.00021956531303068665,
    "bleu2": 7.206160217043637e-05,
    "bleu3": 3.376636117618287e-05,
    "bleu4": 2.0358745413096364e-05,
    "bertscore_precision": 0.38018882274627686,
    "bertscore_recall": 0.5173895359039307,
    "bertscore_f1": 0.438303142786026
  }
}