{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: WUDAS 7 Packs Passion Twist Hair 12 Inch Water Wave Crochet Hair for Braiding Short Passion Twist Crochet Hair for Butterfly Locs (7Pac.27#)\nReview Date: 2022/09/04\nStore: WUDAS\nAverage Rating: 3.3\nProduct Details: {'Brand': 'WUDAS', 'Extension Length': '12 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.19 x 2.6 inches; 13.44 Ounces'}\nReview Text: I love the curl pattern\nReview Title: Great price and hair\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Carol’s Daughter Almond Milk Leave In Conditioner with Almond Milk, Aloe Butter and Shea Oil for Extremely Damaged Hair, 8 fl oz\nCarol's Daughter\n['Reverses Damage']\n{'Brand': \"Carol's Daughter\", 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Hair Type': 'Curly, Damaged, Coily', 'Product Benefits': 'Repairs Damage, Strengthens and Protects Hair, Restores Softness for Over-Processed Hair', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.97 x 1.97 x 7.49 inches; 9.88 Ounces', 'Item model number': 'K4268600', 'UPC': '820645235120 755332169061', 'Manufacturer': \"Carol's Daughter\"}\nLove it\nAs expected\nAfro 8 Pack Pre Stretched Braiding Hair Braiding Crochet Hair Extensions Ombre Colors Professional Easy Braids Itch Free Hot Water Setting Kanekalon Synthetic Fiber (16\" 8packs, Tgray)\nAfro hair\n{'Brand': 'Afro hair', 'Material': 'Synthetic', 'Extension Length': '16 Inches', 'Hair Type': 'Kinky', 'Material Feature': 'Natural', 'Package Dimensions': '13.07 x 8.39 x 3.46 inches; 1.04 Pounds', 'UPC': '781829571987'}\nColor too dark\nGray is really dark\nPassion Twist Crochet Hair 6Packs 18Inch Pre-looped Passion Twist Crochet Braids Water Wave Synthetic Braiding Hair Extension (1B/30)\nQRH\n{'Brand': 'QRH', 'Material': 'Synthetic', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Package Dimensions': '10.24 x 6.77 x 3.46 inches; 1.15 Pounds'}\nLove it.\nIt don't take alot to be full\n14inch 6packs Senegalese Spring Twist crochet Hair Curly End Spring Locs Crochet Dreadlocks Havana mambo twist crochet braids Synthetic Braiding Hair Extension   (14inch, 4#)\nCallia\n{'Brand': 'Callia', 'Material': 'Synthetic', 'Extension Length': '14 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '17 x 8 x 1 inches; 1 Pounds', 'UPC': '824917732591'}\nGreat value\nLove it\n10 Pack Women's Boho Headbands with Buttons Non Slip Elastic Hair Bands for Cover Wide Turban Headband Twisted Criss Cross Head Wrap Knoted Headband Hair Accessories for Nurses Doctors\nYMHPRIDE\n{'Age Range (Description)': 'Adult', 'Material': 'Elastic', 'Fabric Type': 'Elastic', 'Number of Items': '1', 'Brand': 'YMHPRIDE', 'Package Dimensions': '9.65 x 9.37 x 2.83 inches; 8.85 Ounces'}\nGreat value\nGreat value\n14 Inch New Faux Locs Crochet Hair 4 Packs Goddess Soft Locs Pre-Looped Crochet Braids 100% Premium Fiber Synthetic Hair Extensions African Roots\nAmzxfxlv\n{'Brand': 'Amzxfxlv', 'Material': 'Synthetic', 'Extension Length': '14 Inches', 'Hair Type': 'Wavy, Short', 'Material Feature': 'Natural', 'Package Dimensions': '9.2 x 6.3 x 2.7 inches; 9.59 Ounces', 'UPC': '710877489814'}\nNice length\nPerfect\nStraight Synthetic Non Lace Front Wigs For Black Women Long Straight Highlight Wigs Middle Part Honey Blonde Highlights Hair Wigs Natural Looking Heat Resistant Fiber Daily Cosplay Party\nFXGZ\n{'Color': 'Honey blonde', 'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Package Dimensions': '10.55 x 6.61 x 1.69 inches; 10.02 Ounces'}\nI returned it. Its very shiny. The color is awful. Not as pictured at all.\nLooks like doll hair\nYYHR Kinky Straight Headband Wigs for Women Natural Looking Straight Yaki Synthetic Hair Wig with Black Headband 20 Inches for Daily Parties Use\nYYHR\n{'Material': 'Synthetic', 'Hair Type': 'Kinky Straight', 'Style': 'Modern', 'Brand': 'YYHR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.32 x 8.07 x 2.72 inches; 8.82 Ounces'}\nI didn't like the fact it had a green headband. Should have been a neutral colir\nToo thick\nShort Curly Headband Wigs for Black Women Black Curly Headband Wigs Shoet Curly Synthetic Glueless Hair Natural Looking Heat Resistant Hair for Daily Use\nLD HAIR\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'LD HAIR', 'Package Dimensions': '9.09 x 7.24 x 3.94 inches; 9.88 Ounces', 'UPC': '788384134619'}\nToo thick\nToo thick\nNostalgia Long Straight Wig For Women Headband Wig Natural Looking Heat-Resistant Fiber For Daily Wedding And Party (Light brown)\nNostalgia\n[\"Commodity type: Matte long straight hair wig Style: Women's long straight wig Wig type: Headband wig Color: Black gradient light brown on the top of the head Material: Heat-resistant synthetic fiber. ProductPackage: 1 wig + 1 free hair cap + 1 free hair band Version: V2 (add 4 comb inside to increase safety) How to wear a wig: 1. Wrap your hair tightly in the wig cap we prepared for you. 2. Push in all the hair on the sides, back and front to create a smooth surface. 3. Gently comb the wig and pull the adjustable strap to fit your head size. 4. Hold the top and bottom of the wig, pull it out from the front of the head, and then gently pull it back to adjust the wig to cover the hat and fit the head perfectly How to clean a wig: 1. Using mild shampoo, gently soak the wig in cold or warm water. 2. Rinse the hair in the same direction with warm water. 3. Gently comb your hair from top to bottom. 4. Tile the wig and let it dry naturally. How to care for a wig: 1. Do not spray gel water and wax on the wig to avoid greasy wigs. 2. Do not use hair clips to avoid damage to the net. 3. Do not curl hair that exceeds 400 degrees Fahrenheit (about 100.2 degrees Celsius). Comb your hair patiently. 4. After finishing use, put it back in the box or dust-proof. Q A 1. Why does hair fall out? After the new product is produced, some floating hair will appear on it. When wearing it for the first time, please comb and remove the floating hair. 2. About tangles: Hair will be tangled due to dryness, grease and dirt accumulation. And all synthetic wigs are a little tangled, which is normal.For long-term use, please make sure to wash and care for it at least once a week. If you have any questions, please feel free to email us.\"]\n{'Material': 'Steel', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Nostalgia', 'Cartoon Character': 'Straight', 'Package Dimensions': '9.69 x 4.96 x 2.13 inches; 10.23 Ounces'}\nNot what I expected\nPoor quality\nButterfly Locs Crochet Hair 18 inch , 7 Packs Natural Black Long Butterfly Locs Crochet Braids, Distressed Faux Locs Hair Extensions for Black Women T30#\nTioolioo\n{'Brand': 'Tioolioo', 'Material': 'Synthetic', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '10.98 x 8.27 x 4.02 inches; 13.12 Ounces'}\nAs expected\nLove\nWUDAS 7 Packs Passion Twist Hair 12 Inch Water Wave Crochet Hair for Braiding Short Passion Twist Crochet Hair for Butterfly Locs (7Pac.27#)\nWUDAS\n{'Brand': 'WUDAS', 'Extension Length': '12 Inches', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Package Dimensions': '11.5 x 8.19 x 2.6 inches; 13.44 Ounces'}\nI love the curl pattern\nGreat price and hair",
  "profile": "**Updated User Profile Summary:**\n\nThe user maintains a strong focus on hair care products tailored for curly, coily, and damaged hair. They have been exploring options like synthetic braiding extensions and wigs while seeking lighter, more manageable styles due to frustrations with previous purchases. Their latest successful acquisition of crochet hair extensions highlights their commitment to quality and an appreciation for aesthetically pleasing options that also meet comfort and functionality standards.\n\nRecent interactions indicate the user is actively refining their choices within the hair care landscape, showcasing a willingness to reassess brand loyalty. The user is particularly drawn to products that offer a natural look and versatility. Their recent purchase of crochet hair with a favorable curl pattern further emphasizes their discerning nature when evaluating hair accessories. \n\nThis ongoing journey reflects their dedication to curating a diverse yet cohesive array of hair care solutions that align with their unique preferences. As their collection evolves, they continue to prioritize high-quality items that harmonize health and style, maintaining a thoughtful balance in their hair care routine. The user remains open to exploring new styles while ensuring that each addition complements their aesthetic vision without sacrificing comfort.",
  "metrics": {
    "rouge1_f": 0.1225114854517611,
    "rouge2_f": 0.01687116564417178,
    "rougeL_f": 0.06278713629402756,
    "meteor": 0.03840919465240982,
    "bleu1": 0.0008141932673419521,
    "bleu2": 0.0002510023294006754,
    "bleu3": 4.1207512697519124e-05,
    "bleu4": 1.6716258449206217e-05,
    "bertscore_precision": 0.30495065450668335,
    "bertscore_recall": 0.4027664363384247,
    "bertscore_f1": 0.34709885716438293
  }
}