{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Silicone Facial Cleansing Brush, Three-sided Facial Lip Scrubber Brush Face Massager for Men and Women, 2PCS\nReview Date: 2021/07/05\nStore: BONLY\nAverage Rating: 4.1\nProduct Details: {'Package Dimensions': '7.99 x 2.83 x 2.8 inches; 3.53 Ounces', 'UPC': '661918753152'}\nReview Text: I have a bunch of these little brushes. I love the feel of the silicone \"bristles.\" So I have some for lip exfoliation, a few for facial massages, and even separate ones for facial cleansing. They're easy to clean and so soft.<br /><br />What I haven't had is a single brush that does it all. And when you travel, it's just ridiculous to be carrying not only a toothbrush, a sponge blender, and two makeup brushes, but three additional silicon brushes. You end up with a makeup tote instead of a makeup case, and suddenly you're checking a bag just because of your annoyingly overstuffed makeup bag.<br /><br />Not me, because now I have one, and a spare, silicon brush that does it all. One side for massage (which, by the way, if I am so lacking in good taste, I can do in the comfort of my seat on the plane), one side for cleaning, and one appropriately small-sized area for exfoliating lip and/or nose. And that lip exfoliation is one of my favorites - back in college, we used to grab a towel and do a quick scrub before putting on lipstick, but this is so much nicer to your lips.<br /><br />And these two brushes are so much more efficient and space saving for me.\nReview Title: Massages, Cleans, Exfoliates Lips\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Hair Bands for Women's Hair, Fashion Headbands, Headbands for Women, Headband for Fitness, Head Band for Outdoor Activities, Gift Pack 2pc, High Elastic, Non Slip, Breathable, Soft.\nJust Decors\n{'Age Range (Description)': 'Adult', 'Material': 'Polyester, Cotton', 'Fabric Type': 'Cloth', 'Number of Items': '1', 'Brand': 'Just Decors', 'Package Dimensions': '11.38 x 7.87 x 1.14 inches; 3.53 Ounces', 'UPC': '750226635974'}\nI got these headbands because of that one enticing line: \"perfect to keep the sweat out of your face.\" When I'm hot, my hairline starts dripping. Really. We call that a \"glow\" in the south, but it's just plain sweat, and it runs into my eyes, and then my eyes are stinging, my glasses get fogged and wet, and I'm just one huge, damp, panicky  blind mess.<br /><br />Which may be normal when you're working out, but when you're, say, touring the greenhouse or strolling the beach, I'm pretty sure it's unattractive. When you add sunscreen to the mix, dripping down my face, I've actually attracted a concerned crowd in the past, which makes me nervous, and then you can add clammy hands to the list of woes.<br /><br />You wouldn't think a seemingly simple headband like this would do the trick, but it actually has. The headband gets damp; my face stays dry. I normally wear a ball cap when I garden - hoping I won't burn my head while basically risking heat exhaustion - and I put this on first, then the cap.  The headband is a little bit bulky, being double thickness, but not too much so; wonder of wonders, wearing it, my face has stayed dry for the entire time I've been outside. No sweaty face, no drippy mess, no glasses I can't see through (or gnats interested in this new swampy damp visitor). I would wear these if they were hideous, they're so effective, but they're not - navy with flowers or white with flowers - I could wear them as a fashion statement. And so effective.<br /><br />Suddenly I can be outside without causing a shower on my face. It's a miracle. So pleased!\nKeeps My Face Dry!\nGL-Turelifes Liquid Eyebrow Styling Gel 3D Feathery Brows Shaping Cream Waterproof Natural Wild Eyebrow Styling Glue Long Lasting Eye Brow Gel Fresh Styling\nGL-Turelifes\n{'Brand': 'GL-Turelifes', 'Item Form': 'Cream,Gel,Liquid,Eyebrow Pencil,Eyebrow Powder', 'Finish Type': 'Natural', 'Special Feature': 'Waterproof, Long Lasting', 'Material Feature': 'Natural', 'Product Dimensions': '3.46 x 0.55 x 0.55 inches; 0.32 Ounces'}\nI use eye shadow, eye liner, and eyebrow shadow, and I think properly shaped eyebrows have a huge impact on how your face can appear to others.<br /><br />This product helps shape, and hold your eyebrows. It's like clear mascara, so it helps to brush - and hold - each existing hair.  It does have an expiration date, so make sure the product you're using isn't past the date.<br /><br />I have to admit I'm not a fan of the \"feathery\" eyebrow look, but I am a fan of ensuring that what eyebrow you have stays in place and provides a good base to build on, which this product supports.<br /><br />Once you use this gel, you can augment your shaped eyebrows with eyebrow shadow, which can provide a light shaping line, and help fill your brow in with consistent shading.  You can build on that, or use by itself a pencil, to add additional depth or go for that vintage look. This gel just gives you another tool to make your brows more defined.\nShape Eyebrows, Shape Face!\nLip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nMarine Forest\n{'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Package Dimensions': '6.42 x 2.28 x 0.94 inches; 2.24 Ounces', 'UPC': '729843697955'}\nLike most reviewers, the prospect of 12 lip liners was too tempting to pass up. I use soft crayon liners, or a brush of my lipstick, to create an one-the-spot liner all the time - so this seemed like a great buy.<br /><br />These are clearly imported. The good news is the manufacturer actually lists the ingredients on the box;  I've taken a photo of the box so you can see the ingredients - personally, I don't recommend using products where you can't see the ingredients before you order.<br /><br />The pencils you get are an interesting range, and seem to vary from package to package. Mine were in a variety of colors; the one color I was looking for - a basic nude - was not in my package - but I got a range of plums (which I never wear) and pinks (which I rarely wear).<br /><br />If you've used any of your mom's pencils, you're familiar with carmine, which can flake. You have to be careful with the pressure used to avoid application debris, but it's the best to stop lipstick from bleeding or feathering. Since none of the colors were perfect, I used a lighter pink with my lipstick so it wasn't noticeable, and it worked fine.\nCost Effecctive Mixed Bag\nCELIMAX The Real Sedum Aqua Boosting Essence - with 65.33% Sedum Extract, Hyaluronic Acid Complex, 150ml\nCELIMAX\n{'Brand': 'CELIMAX', 'Item Form': 'Liquid', 'Active Ingredients': 'Hyaluronic acid', 'Unit Count': '5.07 Fl Oz', 'Number of Items': '1', 'Package Dimensions': '9 x 3 x 2.25 inches; 9.59 Ounces'}\nI really love this hydrating and moisturizing product.<br /><br />I wasn't sure I would at first. Although the box is in English, and has clear instructions and ingredients, the product itself lacks those things. Celimax comes in a streamlined bottle that looks like mineral water. Aside from the general disaster that could pose with small children, the FDA requires cosmetic products sold in the USA list their ingredients on the bottle in English.<br /><br />The ingredients, by the way, which I wish Amazon would leave a spot for cosmetic vendors to include in their listings, so we would know before we order in case of allergies, are Sedum Sarmentosum, Butylene Glycol, Water, 1,2-Hexanediol, Glycerin, Glycereth-26, Polyglutamic Acid, Hydrolyzed Hyaluronic Acid, Ceramide NP, Xylityglucoside, Anhydroxylitol, Xylitol, Dipotassium Glycrrhizate, Citrus Tangerina Peel Oil, Pelargonium Graveolens Flower Oil, Lavandula Angustifolia Oil, Glucose, Phospholifpids, Diethoxyethyl Succinate, Caprylic/Capric Triclyceride, Ammonium Acryloylidimethyltaurate/VP Copolymer, Hydrogenated Lecithin, C12-13 Pareth-9, Disodium EDTA, Chlorphenesin.<br /><br />Having said that, I poured a little bit of the product onto a cotton pad in the evening and dabbed it onto my face, and onto the back of my hands. It initially felt just  a bit tacky, but almost immediately absorbed. I followed up on my face with my nightly cream. My face this morning feels AMAZING. The moisture level is through the roof.<br /><br />I also want to mention fragrance. Like 95% of chronic migraine headache sufferers, I have a sensitive sense of smell. Anything cosmetic that has perfume (think lip smackers) or added scent has the potential to make me nauseous and bring on a migraine. This had just a faint authentic citrus smell, vaguely pleasant, which thankfully disappeared within a few seconds of hitting the cotton ball. That kind of fragrance is ideal.<br /><br />And the effects are just amazing. I don't see my face all day, but I can sure see my hands on the keyboard. My hands are visibly more plumper, less dry, and  more hydrated. I am loving this product. Hopefully they're in process with getting their bottle properly labelled and safe for distribution in the United States, because this is my new routine. Such results!\nLove this Hydration!\n100% Organic Vitamin E Serum Face Oil – Premium 2 oz. by Cutis Sanus – Natural Advanced Hair, Nails, Skin Care Face Serum, For Reducing Scars & Stretch Marks, Wrinkles & Fine Lines\nCutis Sanus\n{'Product Benefits': 'Nourishing, Moisturize', 'Use for': 'Face', 'Brand': 'Cutis Sanus', 'Material Feature': 'Organic, Natural, Vegan', 'Active Ingredients': 'argan_oil', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.65 x 2.68 x 1.57 inches; 2.2 Pounds', 'Item model number': '627843597940', 'UPC': '627843597940'}\nI really like this Vitamin E Serum. And I don't get to say that very often.  My experience with serums, toners, and lotions is mainly one of \"I hope they don't.\"<br /><br />As in, I hope they don't have \"fragrance,\" because invariably, that gives me a horrific headache and I have to wash the stuff off within minutes of application. As in, I hope they're not \"sticky,\" because for some reason, that means they stay on the surface of my skin all night long, sticking to the pillow or my pajamas (or worse, the hubs). As in, I hope they don't do something \"creative with ingredients\" because my skin is pretty tolerant, but can only take so much.<br /><br />This serum has no fragrance, doesn't cause endless stickiness on the surface of my skin, doesn't do anything scary with the ingredients - and smooths over the problem spots on my face. I love that the ingredients are organic (on the box as well as on the site - I'm assuming \"certified organic\" is the same in the U.S. as it is in France) and I like the way the lotion feels. Recognizing, of course, that we all have individual skin that reacts differently, this is certainly a winner for me.\nNot Sticky, No Smell - Smooths Winkles\nQTMY Wide Headbands Fashion Women Baroque Crystal Gemstone Hair Accessories Head Band Fashion Headwear Hairbands for Women\nQTMY\n{'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Plastic', 'Number of Items': '1', 'Brand': 'QTMY', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.5 x 5.94 x 1.97 inches; 5.61 Ounces', 'Item model number': 'ZJ'}\nI have a major weakness for rhinestones. And this headband is just chock full of them. And when the headband arrived, they were all firmly affixed, ready to wear, not a flaw in sight...and SO attractive.<br /><br />I have short hair, so I can't do the major flip or wrap-around hairdo that perhaps others have tried, and  I haven't experienced the hair catching in the headband at all. The band is not tight, which is generally -my- major complaint. It's a little large, but rests comfortably behind my ears.<br /><br />And it's SO glittery! the rhinestones are just lovely. Couldn't be happier. My model (the Otter) is quite taken with the look. I plan on wearing the headband regularly. I will be the envy of all, I'm sure.\nAwesome Glitter!\nBurt's Bees Baby Bath Time Kit with Ultra Gentle Lotion, Bubble Bath, Foaming Shampoo & Wash, Nourishing Baby Oil, and Face & Hand Cloths\nBurt's Bees\n['Babies deserve a fresh start in life with ingredients from nature that are gentle for their delicate skin. Experience our most popular natural Burts Bees Baby products together in one. Our gentle, effective and natural baby products cleanse, soften and help moisturize babys precious skin safely and naturally. Its easy to make bath time fun with the mild, tear-free bubble bath, then simply cleanse with the foaming 2-in-1 baby shampoo and body wash. Finish by moisturizing with ultra gentle lotion and nourishing baby oil to keep skin soft and fresh. A pack of face and hand cloths is handy for on-the-go cleansing. These baby care essentials are pediatrician tested, gentle enough to use every day and formulated without parabens, phthalates, SLS, petrolatum or synthetic fragrances, so you can feel good about caring for babys delicate skin. This new baby gift basket is a sweet gift for any baby shower occasion.']\n{'Item Form': 'Lotion', 'Skin Type': 'All', 'Brand': \"Burt's Bees\", 'Scent': 'See Individual Packaging', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '11.5 x 6.44 x 3.19 inches; 3.13 Pounds', 'Item model number': 'TU_33789', 'UPC': '792850911796', 'Manufacturer': 'AmazonUs/BURBP'}\nI Love Burt's Bees products. I'm not sharing them generously with anyone - they're all for me, me, me.<br /><br />First of all, I like that the products are designed for sensitive skin. Like most people, I have a mix of really delicate skin and skin on which I could get a tattoo and not notice. So I love that these products support my delicate skin areas.<br /><br />And I like that Burt's uses natural origin ingredients - and no synthetic fragrances. I feel like I type this in every review: like 1B (in 2021) people, 3:1 of which are women, I suffer from chronic migraines. And like 95% of those sufferers, I have a sensitive sense of smell, and for me, artificial fragrances are dreadful. (I've found artificially made \"Honey\" to be one of the worst.) Burt's Bees products consistently have mild, unobtrusive natural scents.<br /><br />That's not to say I like every single Burt's Bees product, but their baby skin care products leave my adult skin feeling baby soft. I especially like the apricot baby oil, which is extra softening, smells faintly of apricot and leaves my skin feeling wonderful.  And I'm so happy that they have the ingredients not just on the products, but listed on Amazon as well, so we know in advance what we're getting. Awesome. Yes, I'm the baby here, and happy to be one if that means I get to use these great products.\nLOVE This Burt's Bees Package!\nSilicone Facial Cleansing Brush, Three-sided Facial Lip Scrubber Brush Face Massager for Men and Women, 2PCS\nBONLY\n{'Package Dimensions': '7.99 x 2.83 x 2.8 inches; 3.53 Ounces', 'UPC': '661918753152'}\nI have a bunch of these little brushes. I love the feel of the silicone \"bristles.\" So I have some for lip exfoliation, a few for facial massages, and even separate ones for facial cleansing. They're easy to clean and so soft.<br /><br />What I haven't had is a single brush that does it all. And when you travel, it's just ridiculous to be carrying not only a toothbrush, a sponge blender, and two makeup brushes, but three additional silicon brushes. You end up with a makeup tote instead of a makeup case, and suddenly you're checking a bag just because of your annoyingly overstuffed makeup bag.<br /><br />Not me, because now I have one, and a spare, silicon brush that does it all. One side for massage (which, by the way, if I am so lacking in good taste, I can do in the comfort of my seat on the plane), one side for cleaning, and one appropriately small-sized area for exfoliating lip and/or nose. And that lip exfoliation is one of my favorites - back in college, we used to grab a towel and do a quick scrub before putting on lipstick, but this is so much nicer to your lips.<br /><br />And these two brushes are so much more efficient and space saving for me.\nMassages, Cleans, Exfoliates Lips",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Interest:** The user continues to focus on functional fashion items and effective skincare solutions, particularly for sensitive skin. Her latest purchase of multifunctional beauty tools indicates a growing interest in products that streamline her beauty routine while maintaining safety and nourishment.\n\n- **Usage Context:** Engaging in outdoor activities such as gardening and beach strolls, she values products that offer hydration and comfort against environmental stressors while also ensuring practicality and style.\n\n- **Aesthetic Preference:** She enjoys attractive and versatile formulations with a focus on hydration. Her accessory preferences now include multifunctional beauty tools that combine practicality with appealing designs.\n\n- **Performance Priority:** She prioritizes effectiveness, sensitivity, and non-fragrant formulations due to fragrance sensitivity. Her enthusiasm for innovative and versatile beauty tools further emphasizes her commitment to convenience and efficiency.\n\n- **Positive Experience:** The user appreciates exceptional value and performance, particularly in products addressing her skin's specific needs. Her proactive research into ingredient safety continues to drive her purchases.\n\n- **Health-Conscious:** She maintains a strong focus on safe, hydrating formulas that align with her active, outdoor lifestyle. Her love for both functionality and aesthetic appeal is evident in her recent acquisition of space-saving beauty tools that enhance her routine.\n\nThis updated profile highlights her dedication to effective, safe, and visually appealing solutions that accommodate her lifestyle and evolving preferences.",
  "metrics": {
    "rouge1_f": 0.07194244604316548,
    "rouge2_f": 0.0064794816414686825,
    "rougeL_f": 0.038129496402877695,
    "meteor": 0.024659662872006213,
    "bleu1": 9.363416072961922e-06,
    "bleu2": 2.7462183933734058e-06,
    "bleu3": 1.1064940753092118e-06,
    "bleu4": 5.911374262697111e-07,
    "bertscore_precision": 0.3739296793937683,
    "bertscore_recall": 0.5043105483055115,
    "bertscore_f1": 0.4294421374797821
  }
}