{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/06/29\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Dennis Smith', \"Terrence O'Hara\", 'John Peter Kousakis', 'Tony Wharmby', 'Eric A. Pot', 'James Hanlon', 'James Whitmore Jr.', 'Diana Valentine', 'Frank Military', 'Tawnia McKiernan'], 'Studio': ['CBS']}\nReview Text: Great season to a great show. Gets more into the relationship of Jo and Callen - won't say anymore than that. Also it builds on the Deeks relationship with Kensi. All in all a great season. Can't wait for Season 8!\nReview Title: Excellent Season To Date\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nI didn't like this one as much since it seems like Jennifer's angst over being in the games were a little over done. I get it, she didn't want to be there - like the rest of them - but her whining did get on my nerves after a while. I do hope the next movie will be better.\nNot As Good As The First\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Dennis Smith', \"Terrence O'Hara\", 'John Peter Kousakis', 'Tony Wharmby', 'Eric A. Pot', 'James Hanlon', 'James Whitmore Jr.', 'Diana Valentine', 'Frank Military', 'Tawnia McKiernan'], 'Studio': ['CBS']}\nGreat season to a great show. Gets more into the relationship of Jo and Callen - won't say anymore than that. Also it builds on the Deeks relationship with Kensi. All in all a great season. Can't wait for Season 8!\nExcellent Season To Date",
  "profile": "The user maintains a strong preference for high-quality sci-fi and fantasy content, reflected in their average rating of 4.8. Their recent interaction indicates an improvement in their rating, now averaging 4.9, demonstrating ongoing satisfaction with content quality. While appreciative of engaging narratives, the user remains discerning, particularly critiquing story execution, character development, and emotional depth. They favor narratives that balance complex themes without excessive negativity and are sensitive to content advisories regarding violence and sexual content.\n\nTheir latest review highlights a deep interest in character relationships, particularly how they evolve over time, reinforcing their desire for emotional authenticity and connection. The user's aversion to excessive angst persists, suggesting they favor thoughtfully crafted portrayals. They express anticipation for improvements in future installments, indicating a commitment to high expectations for narrative and production quality.\n\nAdditionally, their use of audio enhancements and subtitles reflects a preference for accessibility and possibly a taste for multilingual content. Overall, the user engages critically with the material, showcasing both enthusiasm and a thoughtful approach to their viewing experiences. This profile solidifies their identity as a discerning consumer who values character-driven storytelling within the sci-fi and fantasy genres.",
  "metrics": {
    "rouge1_f": 0.20971867007672637,
    "rouge2_f": 0.015424164524421594,
    "rougeL_f": 0.10230179028132991,
    "meteor": 0.10016155088852989,
    "bleu1": 0.13414117089568994,
    "bleu2": 0.006201910679835336,
    "bleu3": 0.002229417308994669,
    "bleu4": 0.0013382437844678392,
    "bertscore_precision": 0.35173043608665466,
    "bertscore_recall": 0.40178588032722473,
    "bertscore_f1": 0.37509557604789734
  }
}