{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Blue Bloods: 5 Seasons\nReview Date: 2016/07/25\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Each season contains 6 discs.']\nAverage Rating: 4.9\nProduct Details: {'Format': 'Box set, Multiple Formats, Widescreen, Color, NTSC', 'Contributor': 'BLUE BLOODS: FIVE SEASON PACK', 'Number Of Discs': '6', 'Publication Date': 'September 8, 2015', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.15 Pounds', 'Media Format': 'Box set, Multiple Formats, Widescreen, Color, NTSC', 'Release date': 'September 8, 2015', 'Studio': 'Paramount', 'Number of discs': '6'}\nReview Text: Love this season! Delivery was fast and the product was undamaged.\nReview Title: Perfect!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nI didn't like this one as much since it seems like Jennifer's angst over being in the games were a little over done. I get it, she didn't want to be there - like the rest of them - but her whining did get on my nerves after a while. I do hope the next movie will be better.\nNot As Good As The First\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Dennis Smith', \"Terrence O'Hara\", 'John Peter Kousakis', 'Tony Wharmby', 'Eric A. Pot', 'James Hanlon', 'James Whitmore Jr.', 'Diana Valentine', 'Frank Military', 'Tawnia McKiernan'], 'Studio': ['CBS']}\nGreat season to a great show. Gets more into the relationship of Jo and Callen - won't say anymore than that. Also it builds on the Deeks relationship with Kensi. All in all a great season. Can't wait for Season 8!\nExcellent Season To Date\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['Norsk Bokmål'], 'Subtitles': ['English [CC]'], 'Directors': ['Roar Uthaug'], 'Producers': ['Martin Sundland', 'Are Heidenstrøm'], 'Starring': ['Kristoffer Joner', 'Ane Dahl Torp', 'Jonas Hoff Oftebro']}\nIncredible movie! Yes it has subtitles but it's well worth the read. Hollywood should take notes on how to make a disaster movie without all the unbelievable nonsense they LOVE to add in...<br /><br />Great movie with characters I actually cared about - wow - what a rarity these days in Hollywood.\nAwesome Movie\nBigfoot Vs. Zombies\nScience Fiction, Suspense, Comedy, Horror\n['A scientist creates a toxic cocktail that slowly leaks into the local population, creating flesh-eating zombies - and only one creature of legend can stop the growing hordes of the undead.']\n{'Subtitles': ['None available'], 'Directors': ['Mark Polonia'], 'Producers': ['Rob Hauschild']}\nI have seen a lot of movies that some would call extraordinarily bad. But alas, this one does not measure up to any of those. The spectacular Bigfoot gorilla suit...er...I mean, make-up, was outstanding. The zombies were obviously trained by the best acting coaches that Hollywood had to offer. Every &#34;Errr&#34; was pronounced with depth, every &#34;Arrrg&#34; was breathtakingly realistic. The last time I heard such agonizing sounds was when I slipped in my shower...<br /><br />And the humans - well - they left me as speechless as the stumbling zombies. Even with minimal dialog and plots that kept me on the edge of my seat. This brought back memories of the time I was hiking on Kauai, and almost slipped off a cliff in the rainstorm. Meaning, I had no idea if I would live through the next devastating twist...<br /><br />Bigfoot Vs. Zombies - a movie that I would highly recommend to anyone seeking a movie to watch while you're waiting for a meteor to strike the earth...\nIncredible!\nBlue Bloods: 5 Seasons\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Each season contains 6 discs.']\n{'Format': 'Box set, Multiple Formats, Widescreen, Color, NTSC', 'Contributor': 'BLUE BLOODS: FIVE SEASON PACK', 'Number Of Discs': '6', 'Publication Date': 'September 8, 2015', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.15 Pounds', 'Media Format': 'Box set, Multiple Formats, Widescreen, Color, NTSC', 'Release date': 'September 8, 2015', 'Studio': 'Paramount', 'Number of discs': '6'}\nLove this season! Delivery was fast and the product was undamaged.\nPerfect!",
  "profile": "The user exhibits a strong preference for high-quality sci-fi and fantasy content, maintaining an impressive average rating of 4.9. Their discerning critiques emphasize story execution, character development, and emotional depth, particularly valuing character relationships and authenticity. They actively avoid excessive angst and negativity in narratives. Recently, they rated a film 5.0 for its grounded storytelling and character investment, underscoring their desire for thoughtfully crafted narratives. Additionally, they demonstrated an ability to find humor in lower-quality content, rating a fun yet poorly produced movie 5.0 based on its entertainment value.\n\nTheir viewing habits highlight sensitivity to violence and sexual content advisories, alongside a preference for accessibility features like subtitles and audio enhancements. This reflects their desire for inclusive and meaningful viewing experiences. The latest interaction involved praising the quality of a television series collection, thereby reinforcing their appreciation for well-crafted dramas. \n\nOverall, the user is a critical yet enthusiastic viewer who seeks emotionally resonant storytelling within their preferred genres, while also embracing diverse viewing experiences, including engaging with lower-quality cinema when it offers humor or entertainment. Their profile paints a picture of a balanced viewer who enjoys both high standards in narrative quality and a willingness to enjoy a range of content.",
  "metrics": {
    "rouge1_f": 0.17892156862745096,
    "rouge2_f": 0.007371007371007371,
    "rougeL_f": 0.07352941176470588,
    "meteor": 0.06045601105481345,
    "bleu1": 0.012966388804137237,
    "bleu2": 0.0030845473329688825,
    "bleu3": 0.0005596882691644593,
    "bleu4": 0.00023867875415303566,
    "bertscore_precision": 0.31943279504776,
    "bertscore_recall": 0.41924357414245605,
    "bertscore_f1": 0.3625949025154114
  }
}