{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/08/22\nAverage Rating: 4.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['Olga Valanos'], 'Starring': ['Russel Means'], 'Studio': ['Syndicado']}\nReview Text: Most people think that Tribes have it made because they 1) Own Casinos  2) Get free government money 3) Get free homes.<br /><br />They don't realize that Tribes are the ONLY race of people that have NO rights and NO equality in the United States. It's disgusting.<br /><br />Watch this movie and educate yourselves BEFORE you open your mouth to tell us how we &#34;got it made.&#34;\nReview Title: Watch The Truth\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nI didn't like this one as much since it seems like Jennifer's angst over being in the games were a little over done. I get it, she didn't want to be there - like the rest of them - but her whining did get on my nerves after a while. I do hope the next movie will be better.\nNot As Good As The First\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Dennis Smith', \"Terrence O'Hara\", 'John Peter Kousakis', 'Tony Wharmby', 'Eric A. Pot', 'James Hanlon', 'James Whitmore Jr.', 'Diana Valentine', 'Frank Military', 'Tawnia McKiernan'], 'Studio': ['CBS']}\nGreat season to a great show. Gets more into the relationship of Jo and Callen - won't say anymore than that. Also it builds on the Deeks relationship with Kensi. All in all a great season. Can't wait for Season 8!\nExcellent Season To Date\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['Norsk Bokmål'], 'Subtitles': ['English [CC]'], 'Directors': ['Roar Uthaug'], 'Producers': ['Martin Sundland', 'Are Heidenstrøm'], 'Starring': ['Kristoffer Joner', 'Ane Dahl Torp', 'Jonas Hoff Oftebro']}\nIncredible movie! Yes it has subtitles but it's well worth the read. Hollywood should take notes on how to make a disaster movie without all the unbelievable nonsense they LOVE to add in...<br /><br />Great movie with characters I actually cared about - wow - what a rarity these days in Hollywood.\nAwesome Movie\nBigfoot Vs. Zombies\nScience Fiction, Suspense, Comedy, Horror\n['A scientist creates a toxic cocktail that slowly leaks into the local population, creating flesh-eating zombies - and only one creature of legend can stop the growing hordes of the undead.']\n{'Subtitles': ['None available'], 'Directors': ['Mark Polonia'], 'Producers': ['Rob Hauschild']}\nI have seen a lot of movies that some would call extraordinarily bad. But alas, this one does not measure up to any of those. The spectacular Bigfoot gorilla suit...er...I mean, make-up, was outstanding. The zombies were obviously trained by the best acting coaches that Hollywood had to offer. Every &#34;Errr&#34; was pronounced with depth, every &#34;Arrrg&#34; was breathtakingly realistic. The last time I heard such agonizing sounds was when I slipped in my shower...<br /><br />And the humans - well - they left me as speechless as the stumbling zombies. Even with minimal dialog and plots that kept me on the edge of my seat. This brought back memories of the time I was hiking on Kauai, and almost slipped off a cliff in the rainstorm. Meaning, I had no idea if I would live through the next devastating twist...<br /><br />Bigfoot Vs. Zombies - a movie that I would highly recommend to anyone seeking a movie to watch while you're waiting for a meteor to strike the earth...\nIncredible!\nBlue Bloods: 5 Seasons\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Each season contains 6 discs.']\n{'Format': 'Box set, Multiple Formats, Widescreen, Color, NTSC', 'Contributor': 'BLUE BLOODS: FIVE SEASON PACK', 'Number Of Discs': '6', 'Publication Date': 'September 8, 2015', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.15 Pounds', 'Media Format': 'Box set, Multiple Formats, Widescreen, Color, NTSC', 'Release date': 'September 8, 2015', 'Studio': 'Paramount', 'Number of discs': '6'}\nLove this season! Delivery was fast and the product was undamaged.\nPerfect!\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Ross Duffer'], 'Producers': ['Roy Lee'], 'Starring': ['Alexander Skarsgård', 'Andrea Riseborough', 'Emily Alyn Lind']}\nI really liked this movie. Creepy in its own right and great twist at the end. I'll certainly watch it again.\nGreat Movie!\nCosmos - War Of The Planets (1977)\nScience Fiction, Adventure\n['A strange signal arrives on the Earth disturbing all communications, while an ufo appears above the Antarctic sea.']\n{'Subtitles': ['None available'], 'Directors': ['Alfonso Brescia'], 'Producers': ['Luigi Alessi', 'Doro Vlado Hreljanovic'], 'Starring': ['John Richardson', 'Yanti Sommer']}\nUm...yah...not much to say really...lol! Oh wait! I liked the helmets...\nGreat Helmets...\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['The Snygg Brothers'], 'Producers': ['The Snygg Brothers'], 'Starring': ['Peter Sullivan', 'Marisol Custodio', 'John Fedele'], 'Studio': [\"Uncork'd Entertainment\"]}\nThis special effects of this movie had me on the edge of my seat!<br /><br />I couldn't believe how realistic a gigantic-marionette-zombie rabbit could look. This film has left me so scarred that I will never celebrate Easter ever again. Even looking at pictures of colored eggs leaves me shivering and almost catatonic!<br /><br />When the movie was over, I released all of your rabbits into the wild and was overwhelmed with joy when eagles appeared out of nowhere and protected me by taking them all away.<br /><br />I should have never watched this. Beware the rabbits - they - are - everywhere...\nOh the blood...the horror of it all...\n{'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['Olga Valanos'], 'Starring': ['Russel Means'], 'Studio': ['Syndicado']}\nMost people think that Tribes have it made because they 1) Own Casinos  2) Get free government money 3) Get free homes.<br /><br />They don't realize that Tribes are the ONLY race of people that have NO rights and NO equality in the United States. It's disgusting.<br /><br />Watch this movie and educate yourselves BEFORE you open your mouth to tell us how we &#34;got it made.&#34;\nWatch The Truth",
  "profile": "The user maintains a strong commitment to high-quality sci-fi and fantasy narratives, boasting an impressive average rating of 4.9. Their critiques are discerning, with a focus on story execution, character development, and emotional depth, particularly valuing authentic character relationships. Recently, they rated a film 5.0 for its grounded storytelling and character investment, while giving a 1.0 rating to a lower-quality film that lacked engaging content, noting its costume design humorously.\n\nTheir viewing habits reveal sensitivity to violence and sexual content, as well as a preference for accessibility features like subtitles and audio enhancements, indicating a commitment to inclusive viewing experiences. They enjoy films with a creepy atmosphere and surprising twists, which highlights their appreciation for engaging plots. \n\nIn a recent interaction, the user rated a horrifying film 5.0, commending its realistic special effects despite finding it disturbing, showing their open-mindedness to unsettling yet entertaining content. They express a balance between high standards and enjoyment of diverse experiences.\n\nAdditionally, their recent review reflects a supportive stance on social issues, emphasizing the need for awareness of the struggles faced by marginalized groups in society. Overall, the user remains a critical yet enthusiastic viewer, valuing emotionally resonant narratives while embracing content that delivers both quality and social commentary.",
  "metrics": {
    "rouge1_f": 0.1568627450980392,
    "rouge2_f": 0.008539709649871904,
    "rougeL_f": 0.07502131287297528,
    "meteor": 0.048694513911123116,
    "bleu1": 0.0014923709528340953,
    "bleu2": 0.00037389942615184436,
    "bleu3": 6.029645324391897e-05,
    "bleu4": 2.424004040262879e-05,
    "bertscore_precision": 0.3251522183418274,
    "bertscore_recall": 0.44505515694618225,
    "bertscore_f1": 0.3757706582546234
  }
}