{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/06/29\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['Norsk Bokmål'], 'Subtitles': ['English [CC]'], 'Directors': ['Roar Uthaug'], 'Producers': ['Martin Sundland', 'Are Heidenstrøm'], 'Starring': ['Kristoffer Joner', 'Ane Dahl Torp', 'Jonas Hoff Oftebro']}\nReview Text: Incredible movie! Yes it has subtitles but it's well worth the read. Hollywood should take notes on how to make a disaster movie without all the unbelievable nonsense they LOVE to add in...<br /><br />Great movie with characters I actually cared about - wow - what a rarity these days in Hollywood.\nReview Title: Awesome Movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nI didn't like this one as much since it seems like Jennifer's angst over being in the games were a little over done. I get it, she didn't want to be there - like the rest of them - but her whining did get on my nerves after a while. I do hope the next movie will be better.\nNot As Good As The First\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Dennis Smith', \"Terrence O'Hara\", 'John Peter Kousakis', 'Tony Wharmby', 'Eric A. Pot', 'James Hanlon', 'James Whitmore Jr.', 'Diana Valentine', 'Frank Military', 'Tawnia McKiernan'], 'Studio': ['CBS']}\nGreat season to a great show. Gets more into the relationship of Jo and Callen - won't say anymore than that. Also it builds on the Deeks relationship with Kensi. All in all a great season. Can't wait for Season 8!\nExcellent Season To Date\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['Norsk Bokmål'], 'Subtitles': ['English [CC]'], 'Directors': ['Roar Uthaug'], 'Producers': ['Martin Sundland', 'Are Heidenstrøm'], 'Starring': ['Kristoffer Joner', 'Ane Dahl Torp', 'Jonas Hoff Oftebro']}\nIncredible movie! Yes it has subtitles but it's well worth the read. Hollywood should take notes on how to make a disaster movie without all the unbelievable nonsense they LOVE to add in...<br /><br />Great movie with characters I actually cared about - wow - what a rarity these days in Hollywood.\nAwesome Movie",
  "profile": "The user maintains a strong preference for high-quality sci-fi and fantasy content, with their average rating now at 4.9, reflecting ongoing satisfaction with content quality. They are discerning, emphasizing story execution, character development, and emotional depth in their critiques. The recent interaction highlights their appreciation for character relationships and emotional authenticity, while demonstrating a continued aversion to excessive angst and negativity.\n\nDespite a past average rating of 4.2, the user recently rated an engaging movie 5.0, praising its grounded storytelling and character investment, which reinforces their desire for thoughtfully crafted narratives. Their preference for content is coupled with sensitivity to advisories, including violence and sexual content, and an inclination toward accessibility, as indicated by their use of subtitles and audio enhancements.\n\nThis user's profile showcases a critical yet enthusiastic approach to viewing experiences, indicating a commitment to high expectations for narrative and production quality. They value character-driven stories and express a keen interest in how relationships evolve over time, all while maintaining a thoughtful engagement with both the material and its execution. Overall, they are identified as a discerning consumer who seeks meaningful and emotionally resonant storytelling within the sci-fi and fantasy genres.",
  "metrics": {
    "rouge1_f": 0.21487603305785122,
    "rouge2_f": 0.008298755186721992,
    "rougeL_f": 0.10330578512396695,
    "meteor": 0.09215446992038222,
    "bleu1": 0.08473228957326276,
    "bleu2": 0.0034964387703608386,
    "bleu3": 0.0012101058288687266,
    "bleu4": 0.0007127352482214596,
    "bertscore_precision": 0.32249557971954346,
    "bertscore_recall": 0.3894519805908203,
    "bertscore_f1": 0.35282525420188904
  }
}