{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/11/08\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth']}\nReview Text: I wasn't a fan of the first movie in this series but found this one entertaining. I am actually looking forward to the next part of the story.\nReview Title: I wasn't a fan of the first movie in this ...\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Life of Birds\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"The definitive series on the most colorful, popular and perfectly adapted creatures on earth, The Life of Birds traverses the globe, covering 42 countries and examining over 300 different species. Calling upon the immense skills of many of the world's top wildlife cameramen and women, and pushing filming technology to the limits, new behavior is brought to the screen in staggering detail. Infra-red cameras find oilbirds deep in pitch black caves. Ultra slow motion film unravels the complexities of bird flight and ultraviolet cameras reveal the world from a bird's point of view.\"]\n{'Genre': 'Classics, Documentary', 'Format': \"Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC, Collector's Edition\", 'Contributor': 'David Attenborough', 'Language': 'Unqualified, English (Dolby Digital 2.0)', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 6.4 Ounces', 'Media Format': \"Multiple Formats, Box set, Closed-captioned, Full Screen, NTSC, Collector's Edition\", 'Run time': '9 hours', 'Release date': 'September 27, 2005', 'Studio': 'BBC Video', 'Number of discs': '3'}\nThis was purchased as a gift and was greatly appreciated.  It is always exciting to give something that can be enjoyed by the whole family over and over.\nMakes a great gift!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Joe Wright'], 'Producers': ['Tim Bevan', 'Eric Fellner', 'Paul Webster'], 'Starring': ['Keira Knightley', 'Matthew Macfadyen', 'Brenda Blethyn']}\nThis is one of those classic love stories that you just can't stop watching, over, and over.  You get a true feel for this historical period, without the Hollywood glitter and glamor we so often see. One of my favorite movies.\nA true classic!\nCayman Went\nMichael Lombardi  (Actor),     Jeff Demunn  (Actor),     Bobby Sheehan  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['TV personality Josh Anders (Michael Lombardi, FX’s Rescue Me) is a legend in his own mind … and even he has doubts. Ratings are down and the hottie star of Diver Down (a male Baywatch) can’t get arrested in Hollywood these days. When the smug pretty boy receives an ultimatum from an ultra-wealthy, powerful andunethical resort developer – who also happens to own the network that broadcasts his show – Josh finds himself the key player in a land grab scheme targeting the picturesque, unspoiled and tiny Caribbean island of Cayman Brac.The laid-back locals, most of them big fans, are putty in his hands, except for theeccentric Mr. Bowman (Jeffrey Demunn, Burn After Reading, Hollywoodland, CBS’s Law & Order, The Shawshank Redemption), a cranky retiree who’s never even heard of the show.Secretly petrified of the ocean, Josh just wants to close the deal and go home. That is until Mr. Bowman, a parentless kid named Rodney and Darby Thomas (Susan Misner,Chicago, Eavesdrop), the beautiful but opinionated owner of the local Sand Bar, change his mind about what really matters most.A romantic drama that proves It’s all good … if you just know what to look for.']\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Michael Lombardi, Jeff Demunn, Susan Misner, Eyalan Owona, Susan Misner, Michael Lombardi, Jeff Demunn, Jim Ritterhoff, Eyalan Owona, Bobby SheehanMichael Lombardi, Jeff Demunn, Susan Misner, Eyalan Owona, Susan Misner, Michael Lombardi, Jeff Demunn, Jim Ritterhoff, Eyalan Owona, Bobby Sheehan  See more', 'Language': 'English', 'Runtime': '1 hour and 29 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Bobby Sheehan', 'Media Format': 'NTSC', 'Run time': '1 hour and 29 minutes', 'Release date': 'February 19, 2014', 'Actors': 'Michael Lombardi, Jeff Demunn, Susan Misner, Eyalan Owona, Michael Lombardi, Jeff Demunn, Susan Misner, Eyalan Owona', 'Studio': 'Osiris Entertainment', 'Writers': 'Jim Ritterhoff, Bobby Sheehan', 'Number of discs': '1'}\nWhile this is not an achademy worthy movie it is certainly one I enjoyed.  I've been to Grand Cayman several times and it brought back great memories.\nnice story\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Craig Brewer'], 'Producers': ['Craig Zadan', 'Neil Meron', 'Dylan Sellers', 'Brad Weston'], 'Starring': ['Kenny Wormald', 'Julianne Hough', 'Dennis Quaid'], 'Studio': ['Paramount Pictures Corp.']}\nThis was so bad I couldn't even watch ten minutes of it.  The first version was done so well and I had hopes that this would be, at least, enjoyable.  I was disappointed!\nNot worth your time\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Español'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Francis Lawrence'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth']}\nI wasn't a fan of the first movie in this series but found this one entertaining. I am actually looking forward to the next part of the story.\nI wasn't a fan of the first movie in this ...",
  "profile": "**User Summary:**\n\n- **Content Focus**: The user maintains a strong passion for documentary films on nature and wildlife, as well as classic cinematic love stories with historical depth. Recent views indicate a continued appreciation for romantic dramas that evoke nostalgia and personal travel reflections. However, there is an increasingly critical perspective towards remakes and adaptations that do not meet quality expectations, suggesting a more discerning taste.\n\n- **Preferred Format**: The user prefers DVDs, especially multi-format or collector's editions, seeking high-quality productions that enhance their viewing experience.\n\n- **Target Audience**: The user focuses on family-oriented content that appeals to various age groups, facilitating shared enjoyment and bonding experiences.\n\n- **Gift-Giving**: Enjoying thoughtful gifts that blend education and entertainment, the user emphasizes impact and meaningful connections.\n\n- **Quality Appreciation**: With a strong appreciation for high production quality, the user is increasingly critical of titles that fail to deliver on engaging storytelling or advanced filming techniques, as seen in a recent rating for a less favored film.\n\n- **Emotional Engagement**: The user prioritizes films that foster family bonding and shared experiences, but their recent experience reflects a shift towards less tolerance for poorly executed content, even within genres they typically enjoy.\n\n- **Overall Ratings**: The user generally maintains a positive outlook but is demonstrating rising standards, indicated by their willingness to review and rate films critically, including those previously deemed entertaining.",
  "metrics": {
    "rouge1_f": 0.17228464419475656,
    "rouge2_f": 0.011257035647279551,
    "rougeL_f": 0.08426966292134833,
    "meteor": 0.05994533371673709,
    "bleu1": 0.011608085671971627,
    "bleu2": 0.002349227402716645,
    "bleu3": 0.0004037630730053159,
    "bleu4": 0.0001675342884220895,
    "bertscore_precision": 0.34499287605285645,
    "bertscore_recall": 0.4476121962070465,
    "bertscore_f1": 0.38965943455696106
  }
}