{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly, Top Japanese Makeup Remover, Gentle Skin Cleanser, Mild Floral Fragrance, Non-Greasy, 7.8 Ounce\nReview Date: 2020/05/20\nStore: Bioré\nProduct Description: ['Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly is a non-greasy makeup remover that removes dirt and impurities from deep below the surface of your skin. This top Japanese makeup remover glides on gently and leaves no sticky residue. Formulated with conditioning beauty essence, this jelly leaves skin feeling moisturized and free of makeup. Satisfaction Guaranteed. Limitations may apply.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '1.56 x 2.5 x 7.25 inches; 10.08 Ounces', 'Item model number': '28077_obs', 'UPC': '019100264557', 'Manufacturer': 'Kao USA Inc.'}\nReview Text: Biore Cleansing oil make-up removing clothes come in a plastic box of 44 and are made in Japan.  At first, my wife thought that these are small and thin, but she found that one was sufficient to remove makeup and mascara, with mascara top coat (which can be challenging to remove with other wipes).  My wife has tried several brands before, including top-rated wipes, and all of them except for this one irritates her skin slightly.  These do not!  Her skin is pretty tough, and she doesn't usually have reactions to cosmetics.<br /><br />There is a label on the inner package with Japanese writing, that's not translated into English on the package.  It says to make sure to use the plastic box to store the wipes to ensure quality and peel off the sticker completely; don't remove the wipes from the bag; make sure to close the lid after use.  I'd suggest that the manufacturer add a translated version on the package.  The package says to use the entire package within 45 days after opening, so if you don't wear make-up every day, you may not finish the package before they start to dry out.<br /><br />My wife loves these!  Highly recommended, especially for those who have sensitive skin!\nReview Title: Effective Wipes (with just one) - Recommended for those with Sensitive Skin!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "BeautyBio GloPRO Regeneration Tools\n{'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nAt first, I was excited to get this micro-needling device, but then I started to look into micro needling. Dermatologists said to take Vitamin C 2 for weeks before use, and avoid sunlight; avoid makeup; your skin may peel afterward. So, I was afraid to try it out.  It turns out, that using this is not painful at all.  But when used on my forehead, it looks like it has more pores.  So, I decided to start taking vitamins, and planned out when to try this out, but I avoided trying it out before times when I planned to expose it to sunlight, along with one week before my (wife’s) period.<br /><br />Finally, I had the right time to try it out, and it had no obvious side effects...no pain, no skin flushing, no damage, no problems with sunlight or wearing makeup.  Because this is a device made for home use, it is much more mild than professional devices.  You may be able to use this every other day.<br /><br />The device is light weight, and rechargeable, but comes with batteries, so you don’t have to charge before use; this makes it easy to bring on travel.  I wish I had tried it much earlier.<br /><br />The head is supposed to be replaced every three months at a current cost of $35.  You are supposed to use a new cleaning pad before every use, and it came with 5 pads; the replacement skin prep pads are $35 for 30 pads which will last you two months, using it two to three times a week, which is what the manufacturer recommends.  The minimum monthly cost of supplies is about $38 per month.  You also need to have isopropyl (rubbing) alcohol to use with the provided spray bottle to sanitize the micro-needling head.<br /><br />I would recommend using sun screen after use, to protect your skin.<br /><br />After the first few uses, I haven’t seen much effect, but my husband thinks my face’s skin looks better.\nDon’t Be Afraid, Just Give it a Try!\nBioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly, Top Japanese Makeup Remover, Gentle Skin Cleanser, Mild Floral Fragrance, Non-Greasy, 7.8 Ounce\nBioré\n['Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly is a non-greasy makeup remover that removes dirt and impurities from deep below the surface of your skin. This top Japanese makeup remover glides on gently and leaves no sticky residue. Formulated with conditioning beauty essence, this jelly leaves skin feeling moisturized and free of makeup. Satisfaction Guaranteed. Limitations may apply.']\n{'Product Dimensions': '1.56 x 2.5 x 7.25 inches; 10.08 Ounces', 'Item model number': '28077_obs', 'UPC': '019100264557', 'Manufacturer': 'Kao USA Inc.'}\nBiore Cleansing oil make-up removing clothes come in a plastic box of 44 and are made in Japan.  At first, my wife thought that these are small and thin, but she found that one was sufficient to remove makeup and mascara, with mascara top coat (which can be challenging to remove with other wipes).  My wife has tried several brands before, including top-rated wipes, and all of them except for this one irritates her skin slightly.  These do not!  Her skin is pretty tough, and she doesn't usually have reactions to cosmetics.<br /><br />There is a label on the inner package with Japanese writing, that's not translated into English on the package.  It says to make sure to use the plastic box to store the wipes to ensure quality and peel off the sticker completely; don't remove the wipes from the bag; make sure to close the lid after use.  I'd suggest that the manufacturer add a translated version on the package.  The package says to use the entire package within 45 days after opening, so if you don't wear make-up every day, you may not finish the package before they start to dry out.<br /><br />My wife loves these!  Highly recommended, especially for those who have sensitive skin!\nEffective Wipes (with just one) - Recommended for those with Sensitive Skin!",
  "profile": "The user maintains a cautious yet open-minded approach to skincare and beauty treatments, particularly valuing informed decision-making and thorough research. Their recent purchase of a Japanese makeup remover reflects a deep interest in effective, non-irritating products, especially for sensitive skin, which aligns with their emphasis on safety and skin health. This suggests that they prioritize gentleness in their beauty routine, showing a willingness to explore international products known for their quality.\n\nKey preferences include:\n- A focus on advanced skincare tools and non-invasive options, with an emphasis on safety and managing side effects.\n- An analytical mindset, evidenced by careful consideration of product effectiveness and compatibility with their skin type.\n- Commitment to product maintenance and preparation for optimal results, incorporating advice on usage and storage to enhance product longevity.\n- Practicality and ease of use in products, appreciating those that fit seamlessly into their lifestyle and travel needs.\n- Awareness of budget constraints concerning ongoing product costs, demonstrating a focus on cost-effectiveness.\n- Influence from positive feedback, especially from family, shaping their perceptions of product effectiveness.\n\nOverall, the user's behavior shows enthusiasm for exploring skincare innovations while maintaining a balanced approach that prioritizes both safety and effectiveness, particularly in products catering to sensitive skin.",
  "metrics": {
    "rouge1_f": 0.19017094017094016,
    "rouge2_f": 0.014989293361884369,
    "rougeL_f": 0.08333333333333333,
    "meteor": 0.07127963538793837,
    "bleu1": 0.022856895848575032,
    "bleu2": 0.00739305104501697,
    "bleu3": 0.002972122049770147,
    "bleu4": 0.0008920840347913289,
    "bertscore_precision": 0.3596295714378357,
    "bertscore_recall": 0.4501616358757019,
    "bertscore_f1": 0.3998349905014038
  }
}