{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Inferno [Blu-ray]\nReview Date: 2017/04/02\nStore: Tom Hanks  (Actor),     Felicity Jones  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Action & Adventure\nProduct Description: ['In this contemporary action thriller, the famous symbologist Robert Langdon (Tom Hanks) wakes up in an Italian hospital with amnesia and finds himself the target of a manhunt. Langdon teams up with Sienna Brooks (Felicity Jones), a doctor he hopes will help him recover his memories. Together, they race across Europe and against the clock to stop a virus that would wipe out half of the world’s population.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action, Drama, Thriller', 'Format': 'Subtitled', 'Contributor': 'Omar Sy, Ben Foster, Columbia Pictures, Tom Hanks, Sidse Knudsen, Felicity Jones, Irrfan Khan, Ida Darvish, Ana Ularu, Paul Ritter, Ron Howard, Brian GrazerOmar Sy, Ben Foster, Columbia Pictures, Tom Hanks, Sidse Knudsen, Felicity Jones, Irrfan Khan, Ida Darvish, Ana Ularu, Paul Ritter, Ron Howard, Brian Grazer   See more', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'Digital Copy Expiration Date': 'December 31, 2019', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Audio Description': 'English', 'Item model number': '43449631', 'Director': 'Ron Howard', 'Media Format': 'Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'January 24, 2017', 'Actors': 'Tom Hanks, Felicity Jones, Irrfan Khan, Omar Sy, Ben Foster', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Ron Howard, Brian Grazer', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Good flick, but they changed the ending from the novel.\nReview Title: Wrong ending.\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Midnight in Paris [Blu-ray]\nOwen Wilson  (Actor),     Rachel McAdams  (Actor),     Woody Allen  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', \"This is a romantic comedy set in Paris about a family that goes there because of business, and two young people who are engaged to be married in the fall have experiences there that change their lives. It's about a young man's great love for a city, Paris, and the illusion people have that a life different from theirs would be much better.\", 'Amazon.com', 'Paris is a city that lends itself to daydreaming, to walking the streets and imagining all sorts of magic, a quality that Woody Allen understands perfectly.', 'Midnight in Paris', \"is Allen's charming reverie about just that quality, with a screenwriter hero named Gil (Owen Wilson) who strolls the lanes of Paris with his head in the clouds and walks right into his own best fantasy. Gil is there with his materialistic fiancée (Rachel McAdams) and her unpleasant parents, taking a break from his financially rewarding but spiritually unfulfilling Hollywood career--and he can't stop thinking that all he wants to do is quit the movies, move to Paris, and write that novel he's been meaning to finish. You know, be like his heroes in the bohemian Paris of the 1920s. Sure enough, a midnight encounter draws him into the jazzy world of Scott and Zelda Fitzgerald, Picasso and Dali, and an intense Ernest Hemingway, who promises to bring Gil's manuscript to Gertrude Stein for review. Gil wakes up every morning back in the real world, but returning to his enchanted Paris proves fairly easy. In the execution of this marvelous fantasia, Allen pursues the idea that people of every generation have always romanticized a previous age as golden (this is in fact explained to us by Michael Sheen's pedantic art expert), but he also honors Gil's need to find out certain truths for himself. The movie's on the side of gentle fantasy, and it has some literary/cinematic in-jokes that call back to the kind of goofy humor Allen created in\", 'Love and Death', \".The film is guilty of the slackness that Allen's latter-day directing has sometimes shown, and the underwritten roles for McAdams and Marion Cotillard are better acted than written. But the city glows with Allen's romantic sense of it, and Owen Wilson has just the right nice-guy melancholy to put the idea over. A worthy entry in the Cinema of the Daydream.\", '--Robert Horton']\n{'Genre': 'Romance, Comedy', 'Format': 'Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Michel Vuillermoz, Olivier Rabourdin, Owen Wilson, Thierry Hancisse, Adrien de Van, Michael Sheen, Marianne Basler, Woody Allen, Marion Cotillard, Marcial Di Fonzo Bo, Laurent Spielvogel, Rachel McAdams, Gad Elmaleh, Adrien Brody, Catherine Benguigui, Léa Seydoux, Carla Bruni, Kathy BatesMichel Vuillermoz, Olivier Rabourdin, Owen Wilson, Thierry Hancisse, Adrien de Van, Michael Sheen, Marianne Basler, Woody Allen, Marion Cotillard, Marcial Di Fonzo Bo, Laurent Spielvogel, Rachel McAdams, Gad Elmaleh, Adrien Brody, Catherine Benguigui, Léa Seydoux…  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.4 x 6.7 inches; 2.4 Ounces', 'Item model number': '23915943', 'Director': 'Woody Allen', 'Media Format': 'Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'December 20, 2011', 'Actors': 'Owen Wilson, Rachel McAdams, Adrien Brody, Carla Bruni, Marion Cotillard', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe film is very entertaining, and worth watching just for the atmospheric views of Paris.  I never would have expected to find Owen Wilson in a Woody Allen film, but he is very good in this one.  Blu-Ray is nicely done.  All in all, an excellent presentation of an excellent film.\nExcellent\nHarry Potter and the Order of the Phoenix [Blu-ray]\nDaniel Radcliffe  (Actor),     Emma Watson  (Actor),     David Yates (II)  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Product Description', 'Harry Potter and the Order Of The Phoenix (BD)', ']]>', 'Amazon.com', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.  Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper The Daily Prophet to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.  This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a good movie.\", '--Jordan Thompson']\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'Blu-ray, Widescreen, Color, Dubbed, Subtitled', 'Contributor': 'Rupert Grint, Bridgette Millar, Emma Watson, George Harris (II), Peter Cartwright, Richard Griffiths, Fiona Shaw, Robert Pattinson, Miles Jupp, David Yates (II), Geraldine Somerville, Daniel Radcliffe, Richard Macklin, Brendan Gleeson, Gary Oldman, Jason Boyd (III), Harry Melling, Natalia Tena, Adrian Rawlins, Kathryn Hunter, Ralph FiennesRupert Grint, Bridgette Millar, Emma Watson, George Harris (II), Peter Cartwright, Richard Griffiths, Fiona Shaw, Robert Pattinson, Miles Jupp, David Yates (II), Geraldine Somerville, Daniel Radcliffe, Richard Macklin, Brendan Gleeson, Gary Oldman, Jason Boyd (III), Harry Mel…   See more', 'Language': 'German (Dolby Digital 5.1), Italian (Dolby Digital 5.1), Dutch (Dolby Digital 5.1), Japanese (Dolby Digital 5.1), Swedish (Dolby Digital 5.1), Catalan (Dolby Digital 5.1), English (Dolby Digital 5.1), French (Dolby Digital 5.1), Danish (Dolby Digital 5.1), English (PCM Surround), Spanish (Dolby Digital 5.1), Flemish (Dolby Digital 5.1)', 'Runtime': '2 hours and 18 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '6.5 x 5.25 x 0.5 inches; 1.6 Ounces', 'Item model number': '085391156949', 'Director': 'David Yates (II)', 'Media Format': 'Blu-ray, Widescreen, Color, Dubbed, Subtitled', 'Run time': '2 hours and 18 minutes', 'Release date': 'December 11, 2007', 'Actors': 'Daniel Radcliffe, Emma Watson, Rupert Grint, Harry Melling, Richard Macklin', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Japanese, Portuguese, French, Spanish, Chinese, Korean, German, Italian, Danish, Dutch, Finnish, Swedish, Norwegian, Catalan', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nPhoenix is not my favorite of the Potter films, but it is still a good view and I thought it was well worth reordering in Blu-ray when my original DVD copy started freezing and doing other weird things when I tried to watch it.  The Blu-Ray playback quality is excellent, and will hopefully be even better on the new Oppo player I have on order.\nGood stuff\nThe Best Exotic Marigold Hotel [Blu-ray]\nMaggie Smith  (Actor),     Bill Nighy  (Actor),     John Madden  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Comedy\n['The film follows a group of British retirees who decide to \"outsource\" their retirement to less expensive and seemingly exotic India. Enticed by advertisements for the newly restored Marigold Hotel and bolstered with visions of a life of leisure; they arrive to find the palace a shell of its former self. Though the new environment is less luxurious than imagined; they are forever transformed by their shared experiences; discovering that life and love can begin again when you let go of the past.']\n{'Genre': 'Romance', 'Format': 'AC-3, Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled', 'Contributor': 'John Madden, Bill Nighy, Maggie Smith', 'Language': 'English', 'Runtime': '2 hours and 4 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 6.8 inches; 2.4 Ounces', 'Item model number': 'FOXBR2277229', 'Director': 'John Madden', 'Media Format': 'AC-3, Blu-ray, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '2 hours and 4 minutes', 'Release date': 'September 18, 2012', 'Actors': 'Maggie Smith, Bill Nighy', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Fox Searchlight'}\nLoved this offbeat film.  The cast are excellent.  Blu-Ray playback quality was excellent. Nice to see a good adult film like this one.\nWonderful\nA Passage to India [Blu-ray]\nPeggy Ashcroft  (Actor),     Judy Davis  (Actor),     David Lean  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Set in 1928, this film portrays an indelibly sardonic picture of British life in territorial India.The story concerns Adela Quested, who is a free-spirited British woman, played by (Judy Davis), whohas settled in India and is to marry Ronny Heaslop (Nigel Havers), a town magistrate. She is befriended by the charming Dr. Aziz (Victor Banerjee), but it's a friendship that ultimately leads to tragedy.\"]\n{'Genre': 'Drama, Drama Classic', 'Format': \"AC-3, Blu-ray, Dolby, Collector's Edition, Dubbed, NTSC, Subtitled, Widescreen\", 'Contributor': 'Victor Banerjee, Alec Guinness, John Brabourne, Judy Davis, Richard Goodwin, David Lean, Nigel Navers, Thorn EMI Films Ltd., James Fox, Peggy AshcroftVictor Banerjee, Alec Guinness, John Brabourne, Judy Davis, Richard Goodwin, David Lean, Nigel Navers, Thorn EMI Films Ltd., James Fox, Peggy Ashcroft  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '2 hours and 44 minutes', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '0680798', 'Director': 'David Lean', 'Media Format': \"AC-3, Blu-ray, Dolby, Collector's Edition, Dubbed, NTSC, Subtitled, Widescreen\", 'Run time': '2 hours and 44 minutes', 'Release date': 'April 15, 2008', 'Actors': 'Peggy Ashcroft, Judy Davis, James Fox, Alec Guinness, Nigel Navers', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'John Brabourne, Richard Goodwin', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA Passage to India is a great film.  The film is an excellent adaptation of the novel, and the quality of the Blu-Ray recording is excellent.\nExcellent\nThe Da Vinci Code [Blu-ray]\nTom Hanks  (Actor),     Audrey Tautou  (Actor),     Ron Howard  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"Dan Brown's international bestseller comes alive in the film\", 'The Da Vinci Code', ', directed by Ron Howard with a screenplay by Akiva Goldsman. Join symbologist Robert Langdon (Academy Award® winner Tom Hanks, 1993 Best Actor,', 'Philadelphia', ', and 1994 Best Actor,', 'Forrest Gump', ') and cryptologist Sophie Neveu (Audrey Tautou) in their heart-racing quest to solve a bizarre murder mystery that will take them from France to England - and behind the veil of a mysterious ancient society, where they discover a secret protected since the time of Christ. With first-rate performances by Sir Ian McKellen, Alfred Molina, and Jean Reno, critics are calling', 'The Da Vinci Code', '\"involving\"* and \"intriguing,\"* \"a first rate thriller.\"**']\n{'Genre': 'Drama, Thriller, Mystery', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'John Calley, Columbia Pictures, Tom Hanks, Audrey Tautou, Alfred Molina, Jean Reno, Ron Howard, Brian Grazer, Ian McKellen, Paul Bettany, Jürgen ProchnowJohn Calley, Columbia Pictures, Tom Hanks, Audrey Tautou, Alfred Molina, Jean Reno, Ron Howard, Brian Grazer, Ian McKellen, Paul Bettany, Jürgen Prochnow   See more', 'Language': 'English', 'Runtime': '2 hours and 54 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.89 Ounces', 'Item model number': '15035607', 'Director': 'Ron Howard', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 54 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Tom Hanks, Audrey Tautou, Ian McKellen, Alfred Molina, Jürgen Prochnow', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'John Calley, Brian Grazer', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nAn excellent flick.  Great performances and production.  Blu-Ray disk quality is excellent.  No playback problems.\nAn excellent flick. Great performances and production\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Darren Aronofsky'], 'Producers': ['Scott Franklin', 'Darren Aronofsky', 'Mary Parent', 'Arnon Milchan', 'Ari Handel', 'Chris Brigham'], 'Starring': ['Russell Crowe', 'Jennifer Connelly', 'Ray Winstone'], 'Studio': ['Paramount']}\nI thought the actors' performances were quite good- especially Emma Watson's.  However, I was snot impressed with some of the special efffects, especially the rock people.\nI thought the actors' performances were quite good- especially Emma ...\nBallet Shoes\nEmma Watson  (Actor),     Eileen Atkins  (Actor),     Sandra Goldbacher  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Dreams do come true\\x85 Emma Watson (Hermione from', 'Harry Potter', ') stars in', 'Ballet Shoes', ', a heartwarming and uplifting film based on the beloved, best-selling novel by Noel Streatfeild and featuring an award-winning cast that includes Emilia Fox, Victoria Wood, Richard Griffiths and Eileen Atkins.', '\"We three Fossils vow to put our name in the history book, because it is ours, and ours alone\\x85\"', 'With these words, three orphans, raised as sisters, leave their sheltered lives and embark on an exhilarating journey that takes them to the heights of the stage, screen and sky!', 'DVD EXTRAS: Exclusive 20-Minute Interview with Emma Watson Deleted Scenes, Ballet Shoes Audiobook Excerpt', 'Amazon.com', 'Based on the Noel Streatfeild novel', 'Ballet Shoes', \", this is not the 1976 film starring Angela Thorne and Barbara Lott, but a 2007 BBC Northern Ireland production starring Eileen Atkins, Peter Bowles, Richard Griffiths, Gemma Jones, and Harriet Walter. The Fossils are an unconventional British family living in 1930's London. Orphans Pauline (Emma Watson), Petrova (Yasmin Paige), and Posy (Lucy Boynton) are being raised by an elder sister Sylvia (Emilia Fox) and her Nana (Victoria Wood) in the absence of their eccentric great uncle Matthew (Richard Griffiths). As Sylvia struggles to educate and support her three charges on very limited funds, she is forced to let rooms and enroll the girls in the Academy of Dance and Stage Training in hopes of furthering their education and preparing them to earn a comfortable living. While at the academy, each of the three ambitious girls discovers her own personal calling and labors intensively to achieve her dreams: Pauline studies to become a star on the stage, Petrova gravitates toward a career in aviation, and Posy trains to become a great classical ballerina. Their paths are difficult and full of adversity, but the sisters' steadfast support of one another and common resolve to earn a place in the history books based on their own merits propels each of them toward individual success. A compelling and inspirational film that encourages young women to strive for their dreams,\", 'Ballet Shoes', 'is most appealing to ages 9 and older.', '--Tami Horiuchi']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.16 Ounces', 'Item model number': 'KOC-DV6545', 'Director': 'Sandra Goldbacher', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 24 minutes', 'Release date': 'September 2, 2008', 'Actors': 'Emma Watson, Eileen Atkins, Peter Bowles, Richard Griffiths, Gemma Jones', 'Language': 'Unqualified', 'Studio': 'Koch Vision', 'Number of discs': '1'}\nA sweet movie.  Well acted.\nGood movie\nThe Jungle Book\nBill Murray  (Actor),     Ben Kingsley  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Kids & Family\n['In an epic adventure directed by Jon Favreau (IRON MAN), Mowgli, a man-cub raised in the jungle by a family of wolves, embarks on a captivating journey of self-discovery when he\\'s forced to abandon the only home he\\'s ever known. Featuring an all-star voice cast including Bill Murray, Ben Kingsley and Scarlett Johansson, THE JUNGLE BOOK is \"stunning\" (Todd McCarthy, The Hollywood Reporter).']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.4 x 5.3 x 6.7 inches; 8.32 Ounces', 'Item model number': '786936850628', 'Director': 'Jon Favreau', 'Media Format': 'AC-3, Dolby, Dubbed, Subtitled, DTS Surround Sound, NTSC', 'Run time': '2 hours', 'Release date': 'August 30, 2016', 'Actors': \"Bill Murray, Ben Kingsley, Idris Elba, Lupita Nyong'o, Scarlett Johansson\", 'Dubbed': 'French, Spanish', 'Subtitles': 'French, English, Spanish', 'Language': 'English (DTS-HD High Res Audio), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Walt Disney Studios', 'Writers': 'Justin Marks', 'Number of discs': '2'}\nVery good flick.  The kid who played Mowgli should have gotten an Oscar.  The whole movie is brilliantly done CGI, so he had to act entirely in front of a green screen.\nAmazing CGI.\nInferno [Blu-ray]\nTom Hanks  (Actor),     Felicity Jones  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['In this contemporary action thriller, the famous symbologist Robert Langdon (Tom Hanks) wakes up in an Italian hospital with amnesia and finds himself the target of a manhunt. Langdon teams up with Sienna Brooks (Felicity Jones), a doctor he hopes will help him recover his memories. Together, they race across Europe and against the clock to stop a virus that would wipe out half of the world’s population.']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'Subtitled', 'Contributor': 'Omar Sy, Ben Foster, Columbia Pictures, Tom Hanks, Sidse Knudsen, Felicity Jones, Irrfan Khan, Ida Darvish, Ana Ularu, Paul Ritter, Ron Howard, Brian GrazerOmar Sy, Ben Foster, Columbia Pictures, Tom Hanks, Sidse Knudsen, Felicity Jones, Irrfan Khan, Ida Darvish, Ana Ularu, Paul Ritter, Ron Howard, Brian Grazer   See more', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'Digital Copy Expiration Date': 'December 31, 2019', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Audio Description': 'English', 'Item model number': '43449631', 'Director': 'Ron Howard', 'Media Format': 'Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'January 24, 2017', 'Actors': 'Tom Hanks, Felicity Jones, Irrfan Khan, Omar Sy, Ben Foster', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Ron Howard, Brian Grazer', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGood flick, but they changed the ending from the novel.\nWrong ending.",
  "profile": "**Updated User Profile Summary:**\n\n- **Film Preference**: Continues to enjoy a mix of romantic comedies, nostalgic and fantasy-themed films, emotionally resonant dramas, and family-oriented content. Recently expressed interest in action thrillers with complex narratives, but retains selectivity regarding adaptations of beloved source material.\n- **Director Affinity**: Maintains a fondness for impactful narrative styles from directors like David Lean and Ron Howard, while remaining open to works by other cinematic figures.\n- **Actor Favoritism**: Continues to appreciate nuanced performances from actors such as Owen Wilson, Daniel Radcliffe, and Maggie Smith, with ongoing interest in seasoned talents like Tom Hanks and Emma Watson. Recent interactions reflect a mixed favor towards projects with significant star power.\n- **Viewing Format**: Prefers Blu-ray for bolstered visual and audio quality and remains open to DVD for specific content needs.\n- **Content Appreciation**: Values strong storytelling and atmospheric visuals, favoring films with evolving character arcs and complex themes, while also enjoying uplifting narratives.\n- **Rating Behavior**: Generally leans towards high ratings, but has recently displayed a more critical stance, apparent in a lower rating for an adapted thriller that diverged from its literary source.\n- **Review Tone**: Reviews often emphasize narrative integrity and emotional impact, showcasing a discerning yet appreciative perspective influenced by experiences with adaptations.",
  "metrics": {
    "rouge1_f": 0.0661111111111111,
    "rouge2_f": 0.006670372429127293,
    "rougeL_f": 0.03277777777777778,
    "meteor": 0.0189222824537229,
    "bleu1": 1.981345242433286e-08,
    "bleu2": 7.940044036792622e-09,
    "bleu3": 3.427606748846034e-09,
    "bleu4": 1.5939122265407246e-09,
    "bertscore_precision": 0.3591894507408142,
    "bertscore_recall": 0.5139827728271484,
    "bertscore_f1": 0.42286548018455505
  }
}