{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 84 Charing Cross Road\nReview Date: 2017/08/14\nStore: Anne Bancroft  (Actor),     Anthony Hopkins  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['An American writer forms an enduring relationship with a London bookseller which is carried on over 20 years and across two continents.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'PG', 'Release Date:', '23-SEP-2003', 'Media Type:', 'DVD']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romance', 'Format': 'Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Anne Bancroft, Judi Dench, Anthony Hopkins', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 0.8 Ounces', 'Item model number': '043396077621', 'Media Format': 'Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 21, 2002', 'Actors': 'Anne Bancroft, Anthony Hopkins, Judi Dench', 'Subtitles': 'Chinese, English, French, Korean, Portuguese, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: A favorite movie.  My old VHS copy finally gave up.  Good price and fast delivery.  Would buy from this seller again.\nReview Title: Favorite movie.  Replaces vhs copy.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Masterpiece Classic: Downton Abbey Season 2 (Original U.K. Edition)\nMaggie Smith  (Actor),     Hugh Bonneville  (Actor),     Julian Fellowes  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Season 2 of the Emmy® Award-winning Downton Abbey returns as The Great War rages across Europe, and not even the serene Yorkshire countryside is free from its effects. The men and women of Downton are doing their part both on the front lines and the home front, but the intensity of war only serves to inflame the more familiar passionslove, loss, blackmail, and betrayal.', 'Review', '...it remains a glorious, escapist entertainment which, as the fabric of society is torn asunder, the economy crashes around our ears and the autumnal rain lashes down, should at least keep us distracted until Christmas. --Andrew Pettie, The TelegraphSex, blackmail, girls in nice frocks and now a war. Downton Abbey just got even better. --Sam Wollaston, The Guardian']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Box set', 'Contributor': 'Hugh Bonneville, Julian Fellowes, Maggie Smith', 'Language': 'English', 'Runtime': '9 hours and 4 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 4 Ounces', 'Item model number': '551207', 'Director': 'Julian Fellowes', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Box set', 'Run time': '9 hours and 4 minutes', 'Release date': 'February 7, 2012', 'Actors': 'Maggie Smith, Hugh Bonneville', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nOkay, I resisted Downton for three seasons, thinking it would be too 'PBS&#34; for me.  Then a friend put it on while I was there and i was hooked.  Already devoured season 3 and can't understand why they don't make more episodes faster.\nHooked!\nDoubt\nMeryl Streep  (Actor),     Philip Seymour Hoffman  (Actor),     John Patrick Shanley  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Product Description', 'From Miramax Films comes one of the most honored and acclaimed motion pictures of the year, Doubt. Based on the Pulitzer Prize and Tony Award-winning play, Doubt is a mesmerizing, suspense-filled drama with four riveting performances from Meryl Streep, Philip Seymour Hoffman, Amy Adams and Viola Davis that will have you pinned to the edge of your seat. Sister Aloysius Beauvier (Streep), the rigid and fear-inspiring principal of the Saint Nicholas Church School, suffers an extreme dislike for the progressive and popular parish priest Father Flynn (Hoffman). Looking for wrongdoing in every corner, Sister Aloysius believes she\\'s uncovered the ultimate sin when she hears Father Flynn has taken a special interest in a troubled boy. But without proof, the only thing certain is doubt.\"One of the best pictures of the year,\" (USA Today, Rolling Stone, New York Post, San Francisco Examiner, Roger Ebert).Bonus Features include From Stage To Screen, Scoring Doubt, The Sisters Of Charity', 'Amazon.com', \"It's always a risk when writers direct their own work, since some playwrights don't travel well from stage to screen. Aided by Roger Deakins, of\", 'No Country for Old Men', 'fame, who vividly captures the look of a blustery Bronx winter,', 'Moonstruck', \"'s John Patrick Shanley pulls it off. If\", 'Doubt', 'makes for a dialogue-heavy experience, like', 'The Crucible', 'and', '12 Angry Men', \", the words and ideas are never dull, and a consummate cast makes each one count. Set in 1964 and loosely inspired by actual events, Shanley focuses on St. Nicholas, a Catholic primary school that has accepted its first African-American student, Donald Miller (Joseph Foster), who serves as altar boy to the warm-hearted Father Flynn (Phillip Seymour Hoffman). Donald may not have any friends, but that doesn't worry his mother, Mrs. Miller (Viola Davis in a scene-stealing performance), since her sole concern is that her son gets a good education. When Sister James (Amy Adams) notices Flynn concentrating more of his attentions on Miller than the other boys, she mentions the matter to Sister Aloysius Beauvier (Meryl Streep), the school's hard-nosed principal. Looking for any excuse to push the progressive priest out of her tradition-minded institution, Sister Aloysius sets out to destroy him, and if that means ruining Donald's future in the process--so be it. Naturally, she's the least sympathetic combatant in this battle, but Streep invests her disciplinarian with wit and unexpected flashes of empathy. Of all the characters she's played, Sister Aloysius comes closest to caricature, but she never feels like a cartoon; just a sad woman willing to do anything to hold onto what little she has before the forces of change render her--and everything she represents--redundant.\", '--Kathleen C. Fennessy', 'Stills from', 'Doubt', '(Click for larger image)', 'Review', \"Nominated for 5 Academy Awards, including Meryl Streep's record-setting 15th Oscar nomination (Best Performance by an Actress), Doubt continues to wow audiences and critics alike.2009 Academy AwardsNominated Best Performance by an Actor in a Supporting Role Philip Seymour HoffmanNominated Best Performance by an Actress in a Leading Role Meryl StreepNominated Best Performance by an Actress in a Supporting Role Amy AdamsNominated Best Performance by an Actress in a Supporting Role Viola DavisNominated Best Writing, Screenplay Based on Material Previously Produced or Published John Patrick Shanley2009 Art Directors GuildNominated Excellence in Production Design Award Period Films David Gropman (production designer)2009 BAFTA AwardsNominated BAFTA Film Award Best Leading Actress Meryl StreepNominated Best Supporting Actor Philip Seymour HoffmanNominated Best Supporting Actress Amy Adams2009 Broadcast Film Critics Association AwardsWinner Critics Choice Award Best Actress Meryl StreepNominated Critics Choice Award Best Acting Ensemble Meryl Streep, Philip Seymour Hoffman, Amy Adams, Viola DavisNominated Best PictureNominated Best Supporting Actor Philip Seymour HoffmanNominated Best Supporting Actress Viola DavisNominated Best Writer John Patrick Shanley2008 Chicago Film Critics Association AwardsNominated Best Actress Meryl StreepNominated Best Screenplay, Adapted John Patrick ShanleyNominated Best Supporting Actor Philip Seymour HoffmanNominated Best Supporting Actress Amy AdamsNominated Best Supporting Actress Viola Davis2008 Dallas-Fort Worth Film Critics Association AwardsWinner Best Supporting Actress Viola Davis2009 Golden GlobesNominated Best Performance by an Actor in a Supporting Role Philip Seymour HoffmanNominated Best Performance by an Actress Drama Meryl StreepNominated Best Performance by an Actress in a Supporting Role Amy AdamsNominated Best Performance by an Actress in a Supporting Role Viola DavisNominated Best Screenplay John Patrick Shanley2009 Kansas City Film Critics Circle AwardsWinner Best Actress Meryl Streep2009 London Critics Circle Film AwardsNominated Actress of the Year Meryl Streep2008 National Board of ReviewWinner Best Breakthrough Performance Female Viola DavisWinner Best Ensemble2009 Screen Actors Guild AwardsWinner Outstanding Performance by a Female Actor in a Leading Role Meryl StreepNominated Actor Outstanding Performance by a Cast in a Motion Picture Amy Adams, Viola Davis, Philip Seymour Hoffman, Meryl StreepNominated Outstanding Performance by a Female Actor in a Supporting Role Amy AdamsNominated Outstanding Performance by a Female Actor in a Supporting Role Viola DavisNominated Outstanding Performance by a Male Actor in a Supporting Role Philip Seymour Hoffman2008 Washington DC Area Film Critics Association AwardsWinner Best Actress Meryl StreepWinner Best Ensemble2009 Writers Guild of AmericaNominated Best Adapted Screenplay John Patrick Shanley --Walt Disney Studios Home Entertainment\", 'See more']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Amy Adams, Philip Seymour Hoffman, Meryl Streep, Viola Davis, John Patrick Shanley', 'Language': 'Unqualified (Dolby Digital 5.1)', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '7.5 x 5.4 x 0.7 inches; 0.71 Ounces', 'Director': 'John Patrick Shanley', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Meryl Streep, Philip Seymour Hoffman, Amy Adams, Viola Davis', 'Subtitles': 'English, Spanish', 'Studio': 'Miramax', 'Number of discs': '1'}\nBig fan of Hoffman and Streep.  They are great together, and I personally enjoy media which makes one think seriously about organized religion.\nconfirms my wifes stories of Catholic school\n4 Film Favorites: Dirty Harry (Dirty Harry: Deluxe Edition, The Enforcer: Deluxe Edition, Magnum Force: Deluxe Edition, Sudden Impact: Deluxe Edition)\nClint Eastwood  (Actor, Director),     Sondra Locke  (Actor),     Don Siegel  (Director),     Ted Post  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, Warner Bros. Featured Deals\n['4 Film Favorites: Dirty Harry Collection (4FF) (DVD)', 'Dirty Harry, Magnum Force, The Enforcer, & Sudden Impact MAGNUM FORCE INCLUDES: • Widescreen [16x9 2.4:1] Version • Commentary by Screenwriter John Milius • 2 Featurettes: A Moral Right: The Politics of Dirty Harry and The Hero Cop: Yesterday and Today THE ENFORCER INCLUDES: • Widescreen [16x9 2.4:1] Version • Commentary by Director James Fargo • 2 Featurettes: The Business End: Violence in Cinema and Harry Callahan/Clint Eastwood: Something Special in Films SUDDEN IMPACT INCLUDES: • Widescreen [16x9 2.4:1] Version • Commentary by Historian Richard Schickel DIRTY HARRY • The Evolution of Clint Eastwood Featurette ALL 4 MOVIES INCLUDE: • Dirty Harry Movies Trailer Gallery • Languages & Subtitles: English, Français, Español, Japanese & Português (Main Feature. Bounus Material/Trailer May Not Be Subtitled). INCLUDES: • Widescreen [16x9 2.4:1] Version • Commentary by Historian Richard Schickel • 2 Featurettes: Dirty Harry’s Way and Dirty Harry: The Original • Interview Gallery: Reminiscences by Clint Eastwood and Others', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'Anamorphic, NTSC, Subtitled, Multiple Formats, Dubbed, Widescreen', 'Contributor': 'Tyne Daly, Hal Holbrook, Sondra Locke, Andy Robinson, Ted Post, Clint Eastwood, James Fargo, Don SiegelTyne Daly, Hal Holbrook, Sondra Locke, Andy Robinson, Ted Post, Clint Eastwood, James Fargo, Don Siegel  See more', 'Initial release date': '2009-09-29', 'Language': 'Unqualified', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '99262', 'Director': 'Don Siegel, Ted Post, James Fargo, Clint Eastwood', 'Media Format': 'Anamorphic, NTSC, Subtitled, Multiple Formats, Dubbed, Widescreen', 'Run time': '7 hours and 19 minutes', 'Release date': 'September 29, 2009', 'Actors': 'Clint Eastwood, Sondra Locke, Andy Robinson, Hal Holbrook, Tyne Daly', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nEvery once in a while I get to feeling the need for the good guys to win, whether or not the lawyers and civil liberty people want to get in the way (don't get me wrong, I'm usually a pretty law and order kind of guy).  When these times strike, I put one of these classics on.\nClassics!\nWaltons: Season 2\nRichard Thomas  (Actor),     Ralph Waite  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Waltons, The: The Complete Second Season (Repackage/Stack Hub)', 'Enduring another hard year of the Depression, the Walton family remembers that the true richness of life comes from the joy, love and compassion they bring one another. John-Boy’s (Richard Thomas) parents, John (Ralph Waite) and Olivia (Michael Learned), and grandparents (Will Geer, Ellen Corby) set sterling examples of strength and determination for the generations to follow. In the second season, Thanksgiving joy turns to worry when John-Boy suffers a head injury, and Grandma Walton inherits some money — and a host of problems. Plus, John-Boy makes the family proud as he graduates from high school, and a corporation offers John a modest fortune to sell Walton’s Mountain. Will he do it? Sissy Spacek, John Ritter and Ron Howard guest star in this heartwarming, classic series.', ']]>']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Box set, Full Screen, NTSC, Subtitled, Color', 'Contributor': 'Lee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Earl Hamner, Joe Conley, Will Geer, Ralph Waite, Michael Learned, Kami Cotler, David W. Harper, Richard ThomasLee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Earl Hamner, Joe Conley, Will Geer, Ralph Waite, Michael Learned, Kami Cotler, David W. Harper, Richard Thomas   See more', 'Language': 'English (Mono)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '25312908', 'Media Format': 'Multiple Formats, Box set, Full Screen, NTSC, Subtitled, Color', 'Run time': '20 hours and 48 minutes', 'Release date': 'April 3, 2012', 'Actors': 'Richard Thomas, Ralph Waite, Michael Learned, Will Geer, Ellen Corby', 'Subtitles': 'French', 'Producers': 'Lee Rich', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nI was a fan of the show back when it was on TV.  Still a fan of the earlier years.  Hated it when John Boy and Olivia jumped ship.  But the early ones are wonderful!\nHated it when John Boy and Olivia jumped ship\nWaltons: Season 3\nRichard Thomas  (Actor),     Ralph Waite  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Waltons, The: The Complete Third Season (Repackage/Stack Hub)', 'In Season Three, John-Boy heads off to college – and life will never be the same on Walton’s Mountain. When scholarship winner John-Boy enters Boatwright University, Jason takes his big brother’s place as head kid wrangler for the Walton brood while finding his own identity in music. And while John and Olivia celebrate twenty years of marriage, Grandpa and Grandma leave home (but return). Change has come to Walton’s Mountain. But one thing will never change: the powerful family bond that keeps the Waltons forever together. Both topical and timeless, the third season sees the Waltons facing the age-old issues of family: holding children close and letting them go, doing without and making do.', ']]>']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Lee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Earl Hamner, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard ThomasLee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Earl Hamner, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard Thomas   See more', 'Language': 'English (Mono)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 13.6 Ounces', 'Item model number': 'D172213D', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '20 hours and 25 minutes', 'Release date': 'April 3, 2012', 'Actors': 'Richard Thomas, Ralph Waite, Michael Learned, Will Geer, Ellen Corby', 'Subtitles': 'French', 'Producers': 'Lee Rich', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nWhat can I say?  I'm a fan of the early years of the Waltons, and absolutely hate the later years when major cast members jumped ship.  Still mad a Richard Thomas for not coming back for a few episodes in the last season (John Boy, war has changed you!).  Anyway, these can be put on the TV any time, in any order, and be enjoyed by the whole family, with the exception of the teenage daughter who thinks they are lame.  But, she thinks practically everything is lame, so her opinion her is probably also lame.  PS.  I have season 1 & 2 also, and enjoy them every bit as much.\nand absolutely hate the later years when major cast members jumped ship\nSpencer's Mountain (DVD)\nMaureen O'Hara  (Actor),     Henry Fonda  (Actor),     Delmer Daves  (Director, Producer, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', \"Spencer's Mountain (DVD)\", 'Academy Award winner Henry Fonda stars with Maureen O\\'Hara as thepatriarch of a rural West Virginia family, a family that lives andstrives for a better life on the slopes of Spencer\\'s Mountain.ClaySpencer (Fonda--On Golden Pond, 12 Angry Men) and his wife, Olivia(O\\'Hara--The Parent Trap), have worked hard to rear their nine children.And they are filled with pride when their eldest son, Clayboy (JamesMacArthur--Swiss Family Robinson, \"Hawaii Five-O\"), graduates from highschool at the head of his class and dreams of being the first Spencer togo to college. But, even though Clay is the best employee at the localmill, there isn\\'t enough money to pay for Clayboy\\'s tuition at theuniversity. Now, the entire family will work hard, suffer and sacrificehopes to help the Clayboy live his dream in this classic family film.', ']]>', 'Amazon.com', 'Long before Henry Fonda played an irascible patriarch in', 'On Golden Pond', ', he played an equally crusty family man in this warmly rustic, 1963 drama', \"Spencer's Mountain\", ', based on an Earl Hamner Jr. novel that later inspired the television series', 'The Waltons', '. Fonda plays Clay Spencer, a fiercely independent, hard-drinking, foul-mouthed Wyoming laborer who believes in God but rejects (to his tiny community\\'s consternation) organized religion. Scraping together enough money to build a new house for his wife (Maureen O\\'Hara) and nine children, Spencer runs into an obstacle to both his plans and family pride when his college-bound son (James MacArthur) romances the daughter of Spencer\\'s boss. Director Delmer Daves whips up a kind of morose schmaltz out of the earnest material, but it\\'s Fonda\\'s grit and heartland integrity that carry the day and establish some self-effacing wit. Some nice features here, including interviews with Fonda and a short documentary, \"Spencer\\'s Mountain: Grand Teton Premiere.\"', '--Tom Keogh']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Wally Cox, James Mac Arthur, Donald Crisp, Delmer Daves, Maureen O'Hara, Henry Fonda\", 'Initial release date': '2005-02-08', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2289677', 'Director': 'Delmer Daves', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 58 minutes', 'Release date': 'February 8, 2005', 'Actors': \"Maureen O'Hara, Henry Fonda, James Mac Arthur, Donald Crisp, Wally Cox\", 'Subtitles': 'English, Spanish, French', 'Producers': 'Delmer Daves', 'Studio': 'Studio Distribution Services', 'Writers': 'Delmer Daves', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFrom here came the Waltons.  This is not the Waltons.  Takes place out west somewhere.  And with the exception of Olivia, all the names are changed.  Still, has a comfortable feel.  Pretty good story, based, apparently on the original novel (which I have a copy of around here somewhere and am meaning to read one of these days;  so many books, so little time!).  Good bunch of actors playing the main roles; faces you know from lots of other movies of this time period.  I like movies like this on in the background of my workshop rather than the radio.  Soothing.\nhas a comfortable feel. Pretty good story\nWinter's End - Sarah, Plain & Tall Vol.3\nFormat: Unknown Binding\nMovies & TV, Movies\n['Hallmark Hall of Fame 3rd installment of the Sarah Trilogy']\n{'Brand': \"Gold Crown Collector's Edition\", 'Item Weight': '0.2 Pounds', 'Operation Mode': 'Manual', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 5.4 x 0.6 inches; 3.2 Ounces', 'Item model number': '1998DVD1388', 'Media Format': 'DVD', 'Actors': 'Glenn Close, Christopher Walken', 'Studio': 'Hallmark', 'Number of discs': '1'}\nNice finish to the Hallmark Sarah Plain and Tall trilogy.\nFive Stars\nWaterhole #3 [DVD]\nJames Coburn  (Actor),     Carroll O'Connor  (Actor),     William A. Graham  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n[\"In WATERHOLE #3, an outlaw and a reluctant hostage join together with a disgruntled army officer to carry out a daring gold robbery. Meanwhile, back in town, the sheriff has his mind on a gambler who's stolen a prize-winning horse and is just about to steal the heart of the lawman's daughter, too.\"]\n{'Genre': 'Comedy', 'Format': 'Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': \"Jim Boles, Robert R. Young, Bruce Dern, Claude Akins, James Coburn, Robert Cornthwaite, Joseph T. Steck, Timothy Carey, James Whitmore, William A. Graham, Roy Jenson, Margaret Blye, Joan Blondell, Carroll O'Connor, Harry DavisJim Boles, Robert R. Young, Bruce Dern, Claude Akins, James Coburn, Robert Cornthwaite, Joseph T. Steck, Timothy Carey, James Whitmore, William A. Graham, Roy Jenson, Margaret Blye, Joan Blondell, Carroll O'Connor, Harry Davis  See more\", 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'William A. Graham', 'Media Format': 'Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'May 17, 2005', 'Actors': \"James Coburn, Carroll O'Connor, Margaret Blye, Claude Akins, Timothy Carey\", 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Joseph T. Steck, Robert R. Young', 'Number of discs': '1'}\nKnew what I was getting.  One of my favorite, often watched movies.  My old VHS copy finally tangled and snapped.  Great replacement at a good price!\nFavorite and often watched movie\nFurious 7\nVin Diesel  (Actor),     Dwayne Johnson  (Actor),     James Wan  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n{'Genre': 'Fast and Furious 7, Fast & Furious 7, Fast 7, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, The Fast and the Furious 7, Action & Adventure, Mystery & Suspense, Furious SevenFast and Furious 7, Fast & Furious 7, Fast 7, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, The Fast and the Furious 7, Action & Adventure, Mystery & Suspense, Furious Seven   See more', 'Format': 'Color, NTSC, Widescreen', 'Contributor': 'Chris ‘Ludacris’ Bridges, Jordana Brewster, Paul Walker, James Wan, Vin Diesel, Tyrese Gibson, Michelle Rodriguez, Dwayne JohnsonChris ‘Ludacris’ Bridges, Jordana Brewster, Paul Walker, James Wan, Vin Diesel, Tyrese Gibson, Michelle Rodriguez, Dwayne Johnson   See more', 'Language': 'English', 'Number Of Discs': '1'}\nGift for my daughter who's a fan of the series.  She was happy.  Watched it a few times.\nGreat, if you're a fan of the series\nBuena Vista Home Video, Hocus Pocus\nBette Midler  (Actor),     Thora Birch  (Actor),     Kenny Ortega  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['You\\'re in for a devil of a time when three outlandishly wild witches -- Bette Midler (BEACHES, BIG BUSINESS), Sarah Jessica Parker (HONEYMOON IN VEGAS), and Kathy Najimy (SISTER ACT) -- return from 17th-century Salem after they\\'re accidentally conjured up by some unsuspecting pranksters! It\\'s a night full of zany fun and comic chaos once the tricky 300-year-old trio sets out to cast a spell on the town and reclaim their youth -- but first they must get their act together and outwit three kids and a talking cat! Loaded with bewitching laughs, HOCUS POCUS is an outrageously wild comedy that\\'s sure to entertain everyone!|Producer David Kirschner came up with the idea for the movie one night while he and his young daughter were sitting outside and his neighbor\\'s black cat strayed by. Kirschner began to unspool a narrative of how the cat was once a boy who was changed into a feline 300 years ago by three witches.|Actress Kathy Najimy described her character Mary as \"Eddie Haskell as a witch,\" referring to the character on the classic TV series \"Leave It To Beaver.\" \"She sucks up to Winifred [Bette Midler\\'s character] every chance she gets. She wants to be part of the power club and Winifred\\'s got the power.\"|To create the costumes, designer Mary Vogt read many historical books about Salem, Massachusetts. \"I even read diaries of women who were hanged as witches,\" she says.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Letterboxed', 'Contributor': 'Stephanie Faracy, Sean Murray, Sarah Jessica Parker, Bette Midler, Thora Birch, Neil Cuthbert, Doug Jones, Kathy Najimy, Kathleen Freeman, Kenny Ortega, Vinessa Shaw, Mick Garris, Omri Katz, Charles RocketStephanie Faracy, Sean Murray, Sarah Jessica Parker, Bette Midler, Thora Birch, Neil Cuthbert, Doug Jones, Kathy Najimy, Kathleen Freeman, Kenny Ortega, Vinessa Shaw, Mick Garris, Omri Katz, Charles Rocket   See more', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.58 x 5.44 x 7.46 inches; 2.4 Ounces', 'Item model number': '1775800', 'Director': 'Kenny Ortega', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen, Letterboxed', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 4, 2002', 'Actors': 'Bette Midler, Thora Birch, Kathy Najimy, Sarah Jessica Parker, Stephanie Faracy', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Mick Garris, Neil Cuthbert', 'Number of discs': '1'}\nBought as a gift (requested) for my teen daughter.  Knew she liked it as a kid.  Assumed she had outgrown it.  Apparently not.  She be happy!\nShe be happy!\nFifty Shades of Grey\nDakota Johnson  (Actor),     Jamie Dornan  (Actor),     Sam Taylor-Johnson  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"The worldwide phenomenon comes to life in Fifty Shades of Grey, starring Dakota Johnson and Jamie Dornan in the iconic roles of Anastasia Steele and Christian Grey. Ana is an inexperienced college student tasked with interviewing enigmatic billionaire Christian Grey. But what starts as business quickly becomes an unconventional romance. Swept up in Christian's glamorous lifestyle, Ana soon finds another side to him as she discovers his secrets and explores her own dark desires. What results is a thrilling, all-consuming romance as Christian and Ana test the limits they will go to for their relationship.\", 'Bonus Content:', 'The World of Fifty Shades of Grey: Friends and Family', 'The World of Fifty Shades of Grey: Friends and Family', 'Behind the Shades', 'Behind the Shades', ']]>']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '33951313', 'Director': 'Sam Taylor-Johnson', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '2 hours and 6 minutes', 'Release date': 'May 8, 2015', 'Actors': 'Dakota Johnson, Jamie Dornan, Jennifer Ehle, Rita Ora, Marcia Gay Harden', 'Subtitles': 'French, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nJust wondered what all the buzz was about.  Sexy and risque.  Now I know what mommy porn us.\nRisque\n84 Charing Cross Road\nAnne Bancroft  (Actor),     Anthony Hopkins  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['An American writer forms an enduring relationship with a London bookseller which is carried on over 20 years and across two continents.', 'Genre:', 'Feature Film-Drama', 'Rating:', 'PG', 'Release Date:', '23-SEP-2003', 'Media Type:', 'DVD']\n{'Genre': 'Romance', 'Format': 'Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Anne Bancroft, Judi Dench, Anthony Hopkins', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 0.8 Ounces', 'Item model number': '043396077621', 'Media Format': 'Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 21, 2002', 'Actors': 'Anne Bancroft, Anthony Hopkins, Judi Dench', 'Subtitles': 'Chinese, English, French, Korean, Portuguese, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nA favorite movie.  My old VHS copy finally gave up.  Good price and fast delivery.  Would buy from this seller again.\nFavorite movie.  Replaces vhs copy.",
  "profile": "**User Profile Summary:**\n\n- **Media Preferences:** The user continues to demonstrate a strong interest in drama series and films featuring complex themes, particularly those that address historical contexts linked to organized religion and societal issues. They maintain a fondness for nostalgic family dramas that promote moral integrity and community values, while also increasing their appreciation for action films, especially within familiar franchises. They enjoy classic films and comedies but are also open to risqué content, as evidenced by recent explorations into more mature themes.\n\n- **Content Style:** They gravitate towards emotionally and intellectually engaging storytelling that delves into moral dilemmas and family dynamics, yet they are also receptive to lighter, mainstream narratives, including family-oriented comedies.\n\n- **Platform Affinity:** The user has a keen fondness for PBS programming, particularly British series and classic television, along with Hallmark content that focuses on family-oriented storytelling.\n\n- **Viewing Behavior:** They exhibit caution towards new shows or films, but become highly engaged when captivated. Their interest in popular family comedies and action series is growing, along with a newly reinforced appreciation for classic dramas.\n\n- **Community Influence:** Recommendations from friends and family heavily shape their viewing choices, as they value shared experiences.\n\n- **Emotional Connection:** The user seeks entertainment that serves as both a distraction and a reflection on moral and familial themes.\n\n- **Rating Tendency:** They rate content based on personal resonance, favoring films that bring joy and nostalgia to family members, highlighting a preference for character-driven narratives.",
  "metrics": {
    "rouge1_f": 0.05933250927070457,
    "rouge2_f": 0.006183017312448475,
    "rougeL_f": 0.027606098063452822,
    "meteor": 0.01652843466525055,
    "bleu1": 8.710796851794372e-10,
    "bleu2": 2.876538177239036e-10,
    "bleu3": 3.746129541623623e-11,
    "bleu4": 1.3529897687771383e-11,
    "bertscore_precision": 0.34778425097465515,
    "bertscore_recall": 0.5010864734649658,
    "bertscore_f1": 0.41059252619743347
  }
}