{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bee Gees: One Night Only\nReview Date: 2014/05/14\nStore: The Bee Gees  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, DTS\nProduct Description: ['Anniversary edition with a revised sleeve and additional content, released to celebrate 50 years of the Brothers Gibb. Barry, Maurice and Robin Gibb were performing together from childhood but it was in Australia in 1960 that they were first billed as the Bee Gees. The band went on to become one of the most successful performing, recording and songwriting acts of all time. This full-length concert was shot at the MGM Grand in Las Vegas on November 14, 1997 and is one of very few Bee Gees performances ever filmed.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Rock, Music Video & Concerts', 'Format': 'Color, Dolby, NTSC, DTS Surround Sound', 'Contributor': 'The Bee Gees', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '2 hours and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'DVD30313', 'Media Format': 'Color, Dolby, NTSC, DTS Surround Sound', 'Run time': '2 hours and 23 minutes', 'Release date': 'August 31, 2010', 'Actors': 'The Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Number of discs': '1'}\nReview Text: This is a must buy.  I have never enjoyed watching and listening to these guys as much as I did with this DVD.\nReview Title: OMG\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Merle Haggard Live On Stage!\nMerle Haggard  (Actor),     Multi  (Director)    Format: DVD\nMovies & TV, Music Artists, Haggard, Merle\n{'Format': 'NTSC', 'Contributor': 'Merle Haggard, Multi', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '28 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Multi', 'Media Format': 'NTSC', 'Run time': '28 minutes', 'Release date': 'July 22, 2004', 'Actors': 'Merle Haggard', 'Studio': 'Quality', 'Number of discs': '1'}\nI chose this because we really do like Merle Haggard. This was a good concert. I would recommend it his fans.\nGood Concert\nLive At The US Festival, 1983\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n[\"Waylon Jennings appeared at the US Festival on June 4, 1983. It was billed as Country Day, with Waylon performing alongside such artists as Willie Nelson, Alabama, Hank Williams, Jr.., and Emmylou Harris. Waylon's performance was one of the day's many highlights, and he is joined onstage by wife Jessi Colter for a particularly memorable rendition of 'Storms Never Last.' the US Festival was held over two weekends in 1982 and 1983. Steve Wozniak, cofounder of Apple Computer, funded the concerts and accompanying technology exposition, as well as the construction of a brand-new outdoor venue in Glen Helen Regional Park in San Bernadino, CA. Nearly every musical genre was represented by bands as diverse as U2, Fleetwood Mac, David Bowie, Ozzy Osbourne, Willie Nelson, Van Halen, the Police and the Clash. Over the combined seven days of the festival, more than one million people passed through the entrance gates.\"]\n{'Genre': 'Waylon Jennings Live At The US Festival, 1983, hard-rock-and-metal-music, Country', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Waylon Jennings', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.47 x 5.33 x 0.68 inches; 2.4 Ounces', 'Item model number': 'DVDSHFA12928', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 5 minutes', 'Release date': 'November 15, 2011', 'Actors': 'Waylon Jennings', 'Studio': 'SHOUT! FACTORY', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI loved this dvd. Yes, it was an oldie, but a goody. It featured Waylon and he was great. The song with him and his wife was awesome.  I highly recommend this\nLoved it\nLegendary Performances\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['From the vaults of the Country Music Hall Of Fame and Museum, this collection features nearly two decades of Merle Haggard performances in his prime not seen since their original broadcast. Now, for the first time on DVD, experience the hits through a chronology of vintage live performances such as \"Branded Man\" (Country Music Holiday,1968), \"Mama Tried\" (Billy Walker\\'s Country Carnival, 1968) and \"Okie From Muskogee\" (The Porter Wagoner Show, 1970). When Merle Haggard left prison in 1960, he went on to achieve 38 #1 hits (to date) and establish himself as one of the greats in country music. But getting out of prison didn\\'t quite mean leaving his rebel ways behind. His songwriting depicted the truths of a rough-and-tumble life which he fused with a musical style derived from hardcore country, jazz, blues and folk to create a sound no one had ever heard, with lyrics many could relate to. From the walls of San Quentin to his free-spirited life as an irreverent and unique voice outside the Nashville establishment to his induction in the Country Music Hall of Fame, Merle Haggard has never left a doubt that he is country\\'s original outlaw.']\n{'Genre': 'Merle Haggard Legendary Performances, Country', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Merle Haggard', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '5.4 x 7.5 x 0.6 inches; 2.4 Ounces', 'Item model number': 'DVD0808001', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 5 minutes', 'Release date': 'November 11, 2008', 'Actors': 'Merle Haggard', 'Studio': 'SHOUT! FACTORY', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI was not to thrilled with this dvd. Some of the audio and the visual was not clear. Did not cost that much so maybe I should not complain, but would not buy another one, for sure.\nNot to thrilled\nThe Everly Brothers: Reunion Concert: Live at the Royal Albert Hall\nEverly Brothers  (Actor),     n/a  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['When asked recently for the most memorable moment of his career, Phil Everly replied the Albert Hall reunion . It wasSeptember 1983 - ten years on from one of the most acrimonious splits in popular music history- when the EverlyBrothers, Don and Phil, took to the stage at London s Royal Albert Hall. One of the most successful duos of all time, theEverlys had dominated the charts in the late fifties and early to mid sixties. Their close harmony singing, acoustic guitars andbrilliant songwriting had become instantly recognizable and inspired millions of fans worldwide. On an emotional night inLondon, the reunion was an unqualified success and led to the renewal of their partnership on an ongoing basis and many moreyears of success, which continue to this day.1) Entrance 2) Claudette 3) Walk Right Back 4) Crying In the Rain 5) Cathy s Clown 6) Love IsStrange 7) Medley: Take A Message To Mary / Maybe Tomorrow 8) I Wonder If I Care As Much 9) When Will I Be Loved10) Bird Dog 11) Be-Bop-A-Lula 12) Barbara Allen 13) Put My Little Shoes Away 14) Long Time Gone 15) Step It Up And Go16) Bye Bye Love 17) Wake Up Little Susie 18) Medley: Devoted To You / Ebony Eyes / Love Hurts 19) ( Til) I Kissed You20) All I Have To Do Is Dream 21) Temptation 22) Lucille 23) Let It Be Me']\n{'Genre': 'Rock / Oldies & Retro, Music Video & Concerts', 'Format': 'Multiple Formats, Color, NTSC, Dolby, DTS Surround Sound', 'Contributor': 'N/a, Everly Brothers', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DVDEAG37056', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, DTS Surround Sound', 'Run time': '2 hours', 'Release date': 'September 14, 2010', 'Actors': 'Everly Brothers', 'Studio': 'Eagle Rock Entertainment', 'Number of discs': '1'}\nI have always loved listening to the Everly Brothers.  This was a very unique concert and I enjoyed it so much.\nEnjoyed very much\nBee Gees: One Night Only\nThe Bee Gees  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Anniversary edition with a revised sleeve and additional content, released to celebrate 50 years of the Brothers Gibb. Barry, Maurice and Robin Gibb were performing together from childhood but it was in Australia in 1960 that they were first billed as the Bee Gees. The band went on to become one of the most successful performing, recording and songwriting acts of all time. This full-length concert was shot at the MGM Grand in Las Vegas on November 14, 1997 and is one of very few Bee Gees performances ever filmed.']\n{'Genre': 'Rock, Music Video & Concerts', 'Format': 'Color, Dolby, NTSC, DTS Surround Sound', 'Contributor': 'The Bee Gees', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '2 hours and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'DVD30313', 'Media Format': 'Color, Dolby, NTSC, DTS Surround Sound', 'Run time': '2 hours and 23 minutes', 'Release date': 'August 31, 2010', 'Actors': 'The Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Number of discs': '1'}\nThis is a must buy.  I have never enjoyed watching and listening to these guys as much as I did with this DVD.\nOMG",
  "profile": "The user continues to exhibit a strong passion for classic and influential artists, especially within the realm of classic country and rock. Their recent positive experience with a premium concert DVD highlights their commitment to high production standards, as they express delight in authentic and emotionally resonant performances. This aligns with their previous appreciation for artists like the Everly Brothers, emphasizing their desire for immersive musical experiences that leave a lasting impact.\n\nTheir latest interaction showcases a particular affinity for well-curated live recordings, revealing a keen interest in historically significant performances. The user remains critical of audio and visual quality, maintaining a discerning approach to media consumption, while still celebrating genuine artistry. This behavior reflects their ongoing appreciation for memorable concert experiences, as they engage with rich content that resonates emotionally.\n\nThe user actively participates within the music community, sharing both accolades and warnings about various music media, signaling a commitment to fostering meaningful connections with fellow enthusiasts. Their profile is characterized by a focus on classic country and rock legends, a preference for high-quality DVD formats, a strong appreciation for authentic performances, and an eagerness to engage with like-minded individuals. Ultimately, they value the beauty of music and the emotional connections it can create, while ensuring that quality remains a top priority in their selections.",
  "metrics": {
    "rouge1_f": 0.13689700130378096,
    "rouge2_f": 0.00783289817232376,
    "rougeL_f": 0.06388526727509779,
    "meteor": 0.04041364554855581,
    "bleu1": 0.0005703492007829323,
    "bleu2": 0.00018708239496053415,
    "bleu3": 5.6434680477708946e-05,
    "bleu4": 1.744864597210262e-05,
    "bertscore_precision": 0.32609811425209045,
    "bertscore_recall": 0.4498363733291626,
    "bertscore_f1": 0.3781009614467621
  }
}