{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/10/14\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Louis Leterrier', 'Corey Yuen'], 'Producers': ['Luc Besson', 'Steven Chasman', 'Steve Chasman'], 'Starring': ['Jason Statham', 'Qi Shu', 'Franois Berland'], 'Studio': ['The Walt Disney Studios']}\nReview Text: ok\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Merle Haggard Live On Stage!\nMerle Haggard  (Actor),     Multi  (Director)    Format: DVD\nMovies & TV, Music Artists, Haggard, Merle\n{'Format': 'NTSC', 'Contributor': 'Merle Haggard, Multi', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '28 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Multi', 'Media Format': 'NTSC', 'Run time': '28 minutes', 'Release date': 'July 22, 2004', 'Actors': 'Merle Haggard', 'Studio': 'Quality', 'Number of discs': '1'}\nI chose this because we really do like Merle Haggard. This was a good concert. I would recommend it his fans.\nGood Concert\nLive At The US Festival, 1983\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n[\"Waylon Jennings appeared at the US Festival on June 4, 1983. It was billed as Country Day, with Waylon performing alongside such artists as Willie Nelson, Alabama, Hank Williams, Jr.., and Emmylou Harris. Waylon's performance was one of the day's many highlights, and he is joined onstage by wife Jessi Colter for a particularly memorable rendition of 'Storms Never Last.' the US Festival was held over two weekends in 1982 and 1983. Steve Wozniak, cofounder of Apple Computer, funded the concerts and accompanying technology exposition, as well as the construction of a brand-new outdoor venue in Glen Helen Regional Park in San Bernadino, CA. Nearly every musical genre was represented by bands as diverse as U2, Fleetwood Mac, David Bowie, Ozzy Osbourne, Willie Nelson, Van Halen, the Police and the Clash. Over the combined seven days of the festival, more than one million people passed through the entrance gates.\"]\n{'Genre': 'Waylon Jennings Live At The US Festival, 1983, hard-rock-and-metal-music, Country', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Waylon Jennings', 'Language': 'English', 'Number Of Discs': '1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.47 x 5.33 x 0.68 inches; 2.4 Ounces', 'Item model number': 'DVDSHFA12928', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 5 minutes', 'Release date': 'November 15, 2011', 'Actors': 'Waylon Jennings', 'Studio': 'SHOUT! FACTORY', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI loved this dvd. Yes, it was an oldie, but a goody. It featured Waylon and he was great. The song with him and his wife was awesome.  I highly recommend this\nLoved it\nLegendary Performances\nRated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['From the vaults of the Country Music Hall Of Fame and Museum, this collection features nearly two decades of Merle Haggard performances in his prime not seen since their original broadcast. Now, for the first time on DVD, experience the hits through a chronology of vintage live performances such as \"Branded Man\" (Country Music Holiday,1968), \"Mama Tried\" (Billy Walker\\'s Country Carnival, 1968) and \"Okie From Muskogee\" (The Porter Wagoner Show, 1970). When Merle Haggard left prison in 1960, he went on to achieve 38 #1 hits (to date) and establish himself as one of the greats in country music. But getting out of prison didn\\'t quite mean leaving his rebel ways behind. His songwriting depicted the truths of a rough-and-tumble life which he fused with a musical style derived from hardcore country, jazz, blues and folk to create a sound no one had ever heard, with lyrics many could relate to. From the walls of San Quentin to his free-spirited life as an irreverent and unique voice outside the Nashville establishment to his induction in the Country Music Hall of Fame, Merle Haggard has never left a doubt that he is country\\'s original outlaw.']\n{'Genre': 'Merle Haggard Legendary Performances, Country', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Merle Haggard', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '5.4 x 7.5 x 0.6 inches; 2.4 Ounces', 'Item model number': 'DVD0808001', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 5 minutes', 'Release date': 'November 11, 2008', 'Actors': 'Merle Haggard', 'Studio': 'SHOUT! FACTORY', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI was not to thrilled with this dvd. Some of the audio and the visual was not clear. Did not cost that much so maybe I should not complain, but would not buy another one, for sure.\nNot to thrilled\nThe Everly Brothers: Reunion Concert: Live at the Royal Albert Hall\nEverly Brothers  (Actor),     n/a  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['When asked recently for the most memorable moment of his career, Phil Everly replied the Albert Hall reunion . It wasSeptember 1983 - ten years on from one of the most acrimonious splits in popular music history- when the EverlyBrothers, Don and Phil, took to the stage at London s Royal Albert Hall. One of the most successful duos of all time, theEverlys had dominated the charts in the late fifties and early to mid sixties. Their close harmony singing, acoustic guitars andbrilliant songwriting had become instantly recognizable and inspired millions of fans worldwide. On an emotional night inLondon, the reunion was an unqualified success and led to the renewal of their partnership on an ongoing basis and many moreyears of success, which continue to this day.1) Entrance 2) Claudette 3) Walk Right Back 4) Crying In the Rain 5) Cathy s Clown 6) Love IsStrange 7) Medley: Take A Message To Mary / Maybe Tomorrow 8) I Wonder If I Care As Much 9) When Will I Be Loved10) Bird Dog 11) Be-Bop-A-Lula 12) Barbara Allen 13) Put My Little Shoes Away 14) Long Time Gone 15) Step It Up And Go16) Bye Bye Love 17) Wake Up Little Susie 18) Medley: Devoted To You / Ebony Eyes / Love Hurts 19) ( Til) I Kissed You20) All I Have To Do Is Dream 21) Temptation 22) Lucille 23) Let It Be Me']\n{'Genre': 'Rock / Oldies & Retro, Music Video & Concerts', 'Format': 'Multiple Formats, Color, NTSC, Dolby, DTS Surround Sound', 'Contributor': 'N/a, Everly Brothers', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'DVDEAG37056', 'Media Format': 'Multiple Formats, Color, NTSC, Dolby, DTS Surround Sound', 'Run time': '2 hours', 'Release date': 'September 14, 2010', 'Actors': 'Everly Brothers', 'Studio': 'Eagle Rock Entertainment', 'Number of discs': '1'}\nI have always loved listening to the Everly Brothers.  This was a very unique concert and I enjoyed it so much.\nEnjoyed very much\nBee Gees: One Night Only\nThe Bee Gees  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Anniversary edition with a revised sleeve and additional content, released to celebrate 50 years of the Brothers Gibb. Barry, Maurice and Robin Gibb were performing together from childhood but it was in Australia in 1960 that they were first billed as the Bee Gees. The band went on to become one of the most successful performing, recording and songwriting acts of all time. This full-length concert was shot at the MGM Grand in Las Vegas on November 14, 1997 and is one of very few Bee Gees performances ever filmed.']\n{'Genre': 'Rock, Music Video & Concerts', 'Format': 'Color, Dolby, NTSC, DTS Surround Sound', 'Contributor': 'The Bee Gees', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '2 hours and 23 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'DVD30313', 'Media Format': 'Color, Dolby, NTSC, DTS Surround Sound', 'Run time': '2 hours and 23 minutes', 'Release date': 'August 31, 2010', 'Actors': 'The Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Number of discs': '1'}\nThis is a must buy.  I have never enjoyed watching and listening to these guys as much as I did with this DVD.\nOMG\nBill Engvall - Here's Your Sign Live\nBill Engvall  (Actor, Writer),     Michael Drumm  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', \"Bill Engvall has sold more than two million comedy albums, including the certified-platinum Here's Your Sign. He has released six comedy CDs, starred in several television series and written the book You Don't Have To Be Dumb To Be Stupid. He was one of the headliners on the hugely successful Blue Collar Comedy Tour and starred in the follow-up hit film. Captured live in this dynamic stand-up performance, Engvall is at his smart-talking, sidesplitting best.\", 'Amazon.com', 'Bill Engvall mines one of the classic veins of comedy--family life--on', \"Bill Engvall: Here's Your Sign Live\", ', and comes up with some fresh, funny spin on old gags. His general recommendation for surviving marriage: Relinquish power to wives; that way, one gets to be just a \"guy\" instead of nominal head of the household. One of the funniest bits concerns linkage of real and imaginary marital crimes. \"\\'If you\\'re lying to me about smoking,\\'\" Engvall quotes his suspicious spouse, \"\\'how do I know you\\'re not sleeping with other women?\\' Not even Evel Knievel could have made that leap.\" On keeping sex fun after 21 years of domestic bliss: \"As soon as I try something new, she\\'s screaming, \\'Where\\'d you learn that?!\\'\" Engvall has some choice stuff about his kids, too, including a good story about traveling cross-country with his teenage son and stumbling into topless steakhouses.', '--Tom Keogh']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.48 x 5.35 x 0.55 inches; 4 Ounces', 'Director': 'Michael Drumm', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Dolby, Closed-captioned', 'Run time': '1 hour and 12 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Bill Engvall', 'Language': 'Unqualified', 'Studio': 'IMAGE ENTERTAINMENT', 'Writers': 'Bill Engvall', 'Number of discs': '1'}\ngood item\nThree Stars\nKathleen Madigan: Gone Madigan\nKathleen Madigan  (Actor),     Shannon Hartman  (Director)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Finally, a comedian who isn't whining, insulting or self-loathing. Kathleen Madigan is just brilliantly funny and is still, after 20 years in the business, actually having fun. In this hilarious stand-up special, shot at the Gramercy Theater in New York City, Kathleen takes on politics, American culture and her family who has given her full permission to sell them down them down the river. Winner of the American Comedy Award for Best Female Comic, Madigan has been seen over 12 times on The Tonight Show, The Late Show with David Letterman, The View, Dr. Phil, ESPN, The Joy Behar Show and has had her own specials on HBO and Comedy Central. Madigan was the only comedian in the history of NBC's Last Comic Standing to go unchallenged by any other comedian. She lives in Los Angeles but spends inordinate amounts of time with her family in the Missouri Ozarks.\"]\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '15395123', 'Director': 'Shannon Hartman', 'Media Format': 'Multiple Formats, Blu-ray, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 4 minutes', 'Release date': 'January 11, 2011', 'Actors': 'Kathleen Madigan', 'Studio': 'Image Entertainment', 'Number of discs': '1'}\nok\nThree Stars\nLIBRARIAN TRILOGY - MOVIE\nKyle MacLachlan  (Actor, Host),     Olympia Dukakis  (Actor, Host),     Jonathan Frakes  (Director, Host),     Peter Winther  (Director)    &                   1                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n{}\nok\nThree Stars\nTwo and a Half Men: Season 9\nJon Cryer  (Actor),     Ashton Kutcher  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Two and a Half Men: The Complete Ninth Season', 'The multi-talented Ashton Kutcher, whose success spans film, television and social media, joins the cast of the Emmy® Award–nominated TWO AND A HALF MEN as the hit comedy series returns for its ninth season, continuing the laughs about men, women, sex, dating, divorce, mothers, single parenthood, surrogate families, money and, most importantly, love. Playing Internet billionaire Walden Schmidt, Kutcher (That ‘70s Show) joins Jon Cryer as the tightly wound Alan Harper, Angus T. Jones as Alan’s laidback son, Jake Harper, Holland Taylor as Alan’s narcissistic mother, Evelyn Harper, Marin Hinkle as Alan’s neurotic ex-wife Judith Harper and Conchata Ferrell as the brash and blue-collar Berta on the top-rated series. Revamped and re-energized, the newly “manned” sitcom was created and executive produced by Chuck Lorre and Lee Aronsohn.', ']]>', 'Amazon.com', 'Season nine of', 'Two and a Half Men', \"marks a sea change--original star Charlie Sheen was fired for off-screen antics and was replaced by Ashton Kutcher. Fans of Sheen may be a bit slow to warm to Kutcher's character and chemistry, but viewers who give him a chance will realize that he and the rest of the cast (the amazing Jon Cryer and all-grown-up Angus T. Jones) are taking\", 'Two and a Half Men', 'in a creative, new, and yes, funny direction. Kutcher plays Walden Schmidt, an Internet magnate who buys the beach mansion where Alan (Cryer) and Jake (Jones) have lived. The next thing you know, the three have decided to live together and form a makeshift new family of guys to give rise to comedy. Is Kutcher as talented a deadpan cynic as Charlie (Sheen)? No, but his softer weirdness helps take the cast and storylines in fresh new directions--something', 'Two and a Half Men', ', after eight seasons, truly needed. Fans will not want to miss the long documentary/interview with show creator Chuck Lorre and the cast and writers about the \"real story\" behind the changes in the show (which necessitated the \"death\" of the character of Charlie). Also included is a feature on the \"redesign\" of the mansion set, which is a fascinating look at just how on-screen magic is created. Finally, there\\'s a gag reel that should lay to rest any doubt that this new cast is having the time of their lives. Long live', 'Men', '! --', 'A.T. Hurley']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Ashton Kutcher, Angus T. Jones, Jon Cryer', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.77:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '883929238804', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 48 minutes', 'Release date': 'August 28, 2012', 'Actors': 'Jon Cryer, Ashton Kutcher, Angus T. Jones', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Warner Home Video', 'Number of discs': '3'}\nok\nThree Stars\nThe Transporter 3 [Blu-ray]\nJason Statham  (Actor),     Olivier Megaton  (Director)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', \"Jason Statham is back as Frank Martin, the Transporter, in this explosive third installment of the action-adventure series. This time, Frank is presented an offer he can't refuse and ends up with a mysterious passenger and a dangerous destination - calling for a new machine and new rules. The stakes are bigger, the enemy is deadlier, and the action has never been hotter.\", 'Amazon.com', 'Jason Statham is back as Frank Martin, the Transporter, in this explosive third installment of the action-adventure series. This time, Frank is presented an offer he can’t refuse and ends up with a mysterious passenger and a dangerous destination - calling for a new machine and new rules. The stakes are bigger, the enemy is deadlier, and the action has never been hotter.']\n{'Genre': 'Action', 'Format': 'Digital_copy, Blu-ray, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Contributor': 'Olivier Megaton, Luc Besson, Jason Statham', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '25094', 'Director': 'Olivier Megaton', 'Media Format': 'Digital_copy, Blu-ray, Closed-captioned, Color, Dolby, NTSC, Subtitled, DTS Surround Sound', 'Run time': '1 hour and 44 minutes', 'Release date': 'March 10, 2009', 'Actors': 'Jason Statham', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Luc Besson', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nok\nThree Stars\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Louis Leterrier', 'Corey Yuen'], 'Producers': ['Luc Besson', 'Steven Chasman', 'Steve Chasman'], 'Starring': ['Jason Statham', 'Qi Shu', 'Franois Berland'], 'Studio': ['The Walt Disney Studios']}\nok\nThree Stars",
  "profile": "The user continues to showcase a profound appreciation for classic and influential artists, especially within classic country and rock music, emphasizing high-quality concert media for its production standards and authentic performances. While maintaining their devotion to these musical genres, they've recently broadened their interests to include live performances such as stand-up comedy, reflecting an openness to diverse performance art. Their recent purchase of a prominent comedy series indicates an enjoyment of humorous storytelling and a readiness to explore different entertainment formats.\n\nMoreover, the user has ventured into action films, indicating a further evolution in their media tastes while still prioritizing superior audio-visual experiences. This latest engagement highlights their ongoing commitment to quality entertainment across genres. \n\nDespite these new interests, the core of their profile remains rooted in classic country and rock music, demonstrating a harmonious blend of timeless musical preferences with a growing enthusiasm for high-standard performances in varied platforms. Their active participation in the entertainment community signifies a desire to connect with fellow enthusiasts and share insights on their diverse interests. Overall, the user exemplifies a dynamic yet cohesive engagement with quality entertainment that transcends traditional boundaries, all while holding true to their foundational music values.",
  "metrics": {
    "rouge1_f": 0.07281229124916501,
    "rouge2_f": 0.011363636363636362,
    "rougeL_f": 0.038744154976619906,
    "meteor": 0.019838261377059924,
    "bleu1": 1.4679032590652724e-08,
    "bleu2": 5.977380860865932e-09,
    "bleu3": 2.1742893916059094e-09,
    "bleu4": 1.1040064218441324e-09,
    "bertscore_precision": 0.3096364140510559,
    "bertscore_recall": 0.46313339471817017,
    "bertscore_f1": 0.37114018201828003
  }
}