{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: X-Files: The Event Series (2016)\nReview Date: 2017/07/20\nStore: David Duchovny  (Actor),     Mitch Pileggi  (Actor),     Chris Carter  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Alien Invasion\nProduct Description: ['Almost 14 years after the original series run, the next mind-bending chapter of THE X-FILESTM is a thrilling, six-episode event series from creator/executive producer Chris Carter, with stars David Duchovny and Gillian Anderson reinhabiting their roles as iconic FBI agents FOX MULDER and DANA SCULLY. Mitch Pileggi also returns as FBI Assistant Director WALTER SKINNER, Mulder and Scully s boss, who walks a fine line between loyalty to these investigators and accountability to his superiors. This marks the momentous return of the Emmy®- and Golden Globe® Award-winning pop culture phenomenon, which remains one of the longest-running sci-fi series in network television history. Bonus Features:Disc 1:**My Struggle**Founder\\'s Mutation**Mulder & Scully Meet the Were-Monster**Home Again**Audio Commentary on \"Founder\\'s Mutation\" with Chris Carter and James Wong**Audio Commentary on \"Mulder & Scully Meet the Were-Monster\" with David Duchovny, Gillian Anderson, Kumail Nanjiani and Darin MorganDisc 2:**Babylon**My Struggle II**Audio Commentary on \"My Struggle II\" with Chris Carter and Gabe Rotter**Deleted & Extended Scenes**43:45 The Makings of a Struggle**Season X: An In-Depth Behind-the-Scenes Look at The Event Series **Gag Reel**Monsters of the Week: A Recap of the Wildest and Scariest from the Original Series**The X-Files: Green Production PSA**Short Film \"Grace\" by Karen Nielsen']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'Mitch Pileggi, Jonathan Whitesell, David Duchovny, Chris Carter', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35396369', 'Director': 'Chris Carter', 'Media Format': 'AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 14, 2016', 'Actors': 'David Duchovny, Mitch Pileggi, Jonathan Whitesell', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nReview Text: &#34;Trust no one&#34; if they don't like the X-Files!!!!! Great add to my collection. I can't believe the series ever ended.\nReview Title: Xphile till i die\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Basic\nSamuel Jackson  (Actor),     John Travolta  (Actor),     John McTiernan  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Academy Award(r) nominees John Travolta (Best Actor in a Leading Role, Pulp Fiction, 1994) and SamuelL. Jackson (Best Actor in a Supporting Role, Pulp Fiction, 1994) team up with action director John McTiernan (Die Hard, The Hunt for Red October, Predator) in a white-knuckle \"thrill ride with a twist you won\\'t believe!\" (MairiAnna Bachynsky, ATV/CTV ENTERTAINMENT) Also starring Connie Nielsen (TheHunted, Gladiator), Giovanni Ribisi (Gone in Sixty Seconds), Brian Van Holt (Black Hawk Down), TayeDiggs (Chicago) and Roselyn Sanchez (Rush Hour 2). A DEA officer (Travolta) is recruited to investigate the mysterious disappearance of a famed U.S. Army drill instructor (Jackson) and a group of cadets on a routine military exercise in the jungles of Panama. But the journey to uncover the truth leads to some dangerous and unexpected places when two rescued survivors tell dramatically different versions of what transpired. \"Totally mesmerizing.\" (Lisa Petrillo, WFOR/CBS (Miami)/EXTRA)']\n{'Genre': 'Drama, Thriller', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Tadross, Taye Diggs, James Vanderbilt, Arnie Messer, Giovanni Ribisi, Intermedia Film Distribution, Ltd., Samuel Jackson, Connie Nielsen, Mike Medavoy, John Travolta, John McTiernanMichael Tadross, Taye Diggs, James Vanderbilt, Arnie Messer, Giovanni Ribisi, Intermedia Film Distribution, Ltd., Samuel Jackson, Connie Nielsen, Mike Medavoy, John Travolta, John McTiernan  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.5 x 5.25 inches; 1.76 Ounces', 'Director': 'John McTiernan', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'July 8, 2003', 'Actors': 'Samuel Jackson, John Travolta, Connie Nielsen, Taye Diggs, Giovanni Ribisi', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'James Vanderbilt, Arnie Messer, Michael Tadross, Mike Medavoy', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nLove this movie!\nGreat\nLucifer: The Complete First Season [DVD]\nTom Ellis  (Actor),     Lauren German  (Actor),     Len Wiseman  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Lucifer: The Complete First Season (DVD)', 'Bored and unhappy as the Lord of Hell, Lucifer has resigned his throne and retired to the City of Angels, where he is indulging in a few of his favorite things — wine, women, song. When a beautiful pop star is brutally murdered before his eyes, he feels something awaken deep within him – for the first time in roughly 10 billion years. Is he actually capable of feelings for a human being? The very thought disturbs him — as well as his best friend and confidante, Mazikeen (aka Maze), a fierce demon in the form of a beautiful young woman. The murder attracts the attention of LAPD homicide detective Chloe Dancer, who finds herself both repulsed and fascinated by Lucifer. As they work together to solve the murder, Lucifer is struck by Chloe’s inherent goodness. Used to dealing with the absolute worst of humanity, he begins to wonder if there’s hope yet. Maybe everyone’s got a chance for redemption. Even the Devil.', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Drama', 'Format': 'Dolby, DVD, NTSC, Subtitled, AC-3', 'Contributor': 'Len Wiseman, Jonathan Littman, Jerry Bruckheimer, Tom Ellis, Lauren German', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': '35645241', 'Director': 'Len Wiseman', 'Media Format': 'Dolby, DVD, NTSC, Subtitled, AC-3', 'Run time': '9 hours and 20 minutes', 'Release date': 'August 23, 2016', 'Actors': 'Tom Ellis, Lauren German', 'Subtitles': 'French', 'Producers': 'Jerry Bruckheimer, Jonathan Littman', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nThis is my favorite tv show of all time....and I'm no spring chicken.....I love to watch the devil learn and become more human(at times)....can't wait for season 2!<br />My package arrived on time and packaged nicely...\nLove Lucifer!\nMr. Magorium's Wonder Emporium\nDustin Hoffman  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', 'In writer-director Zach Helm\\'s whimsical 2007 film, MR. MAGORIUM\\'S WONDER EMPORIUM, veteran actor Dustin Hoffman plays the title character, a 243-year-old toy-store owner who is ready to pass his enchanted business on to his beloved assistant, Molly Mahoney (Natalie Portman). However, when Molly, a former composer and pianist, has doubts about taking over the (literally) magical store, and an uptight accountant (Jason Bateman) appears to assess the establishment, the many inhabitants of the Wonder Emporium begin to rebel, resulting in a chaotic situation that can be fixed only with the help of a shy, lonely boy (Zach Mills). Director Zach Helm Star Dustin Hoffman, Natalie Portman, Jason Bateman, Zach Mills Special Features: Widescreen - 2.35 Audio: Dolby Digital Surround - Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish, French - Optional Additional Release Material: Behind the Scenes - \"Strangely Weird and Weirdly Strange: The Magical World of a Wonder Emporium\" (Parts 1-5) Featurettes - 1. \"An Eccentric Boss and an Awkward Apprentice\" 2. \"To Find Eric Applebaum, Start by Saying Hi\" 3. \"A Magical Toy Store\" 4. \"The Big Book of Toys\" Trailers - 1. Forced Trailers 2. 20th Century Fox Previews DVD-ROM: Games - \"Paper Airplane Tutor\" Runtime: 94 minutes Year of Release: 2007.', 'Amazon.com', 'Equal parts whimsical and bittersweet,', \"Mr. Magorium's Wonder Emporium\", 'is a family-friendly movie that will charm youngsters. Dustin Hoffman stars in the titular role of an eccentric 243-year-old owner of a magical toy store. He doesn\\'t appear to be sick, but he has lived a long and happy life and is content to leave his emporium to his employee Molly Mahoney (Natalie Portman). A former child prodigy who has grown up unsure of herself, she barely knows who she is, much less what she wants to become. Molly is both frightened that her beloved boss is leaving and that she will be left in charge of a store she doesn\\'t know how to run. \"Are you dying?\" she asks him. Magorium points out, \"Light bulbs die, my dear. I am departing.\" His take on death is both comforting and matter of fact, things younger viewers may find soothing when dealing with mortality. Though the film has drawn comparisons to', 'Charlie and the Chocolate Factory', \", this G-rated venture is less dark, curious and interesting than the former. Still, it offers dazzling visuals and a premise that who you are isn't equivalent with who you think you are. Adult moviegoers may find the premise cloying and repetitive. But seen from a child's eye,\", \"Mr. Magorium's Wonder Emporium\", 'is indeed a magical place for a short visit. --', 'Jae-Ha Kim', 'Beyond', \"Mr. Magorium's Wonder Emporium\", \"Mr. Magorium's Wonder Emporium\", 'Books', \"Mr. Magorium's Wonder Emporium\", 'Toys and Games', 'More Kids & Family titles from Fox', 'Stills from', \"Mr. Magorium's Wonder Emporium\"]\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.63 x 5.41 x 7.57 inches; 2.72 Ounces', 'Item model number': '2250492', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Full Screen', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 4, 2008', 'Actors': 'Dustin Hoffman', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI'm a kid at heart...I love this movie. Very fun\nGreat for any age\nInterstellar\nAnne Hathaway  (Actor),     Jessica Chastain  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy\n['INTERSTELLAR opens on Earth in the distant future, as Mother Nature is waging war on humanity. Famine is widespread, and all of mankind\\'s resources are now dedicated to farming in a desperate fight for survival. A former NASA pilot and engineer named Cooper (Matthew McConaughey) has become a homesteader in order to support his teenage son Tom (Timothee Chalamet) and 10-year-old daughter Murph (Mackenzie Foy). Unfortunately, even that begins to look like a futile endeavor after a sandstorm ravages their close-knit community. Meanwhile, a seemingly supernatural mystery begins to unfold when the \"ghost\" that dwells in Murph\\'s room sends her a mysterious set of coordinates - which lead the curious father/daughter duo to a clandestine underground base housing the remnants of NASA. There, renowned physicist Professor Brand (Michael Caine) has been working with a team of astronauts and scientists to find a new planet capable of sustaining human life. Brand quickly persuades Cooper to pilot a mission that will hopefully carry the seeds of human life to a habitable planet in another galaxy. Cooper is soon bound for space with Brand\\'s daughter Amelia (Anne Hathaway) and researchers Doyle (Wes Bentley) and Romilly (David Gyasi).']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43381941', 'Media Format': 'NTSC', 'Run time': '2 hours and 48 minutes', 'Release date': 'January 7, 2020', 'Actors': 'Anne Hathaway, Jessica Chastain, Matthew McConaughey, Michael Caine, Ellen Burstyn', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie.....but then again.....how many times is a Matthew McConaughey movie a flop?\nGreat movie\nX-Files: The Event Series (2016)\nDavid Duchovny  (Actor),     Mitch Pileggi  (Actor),     Chris Carter  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Alien Invasion\n['Almost 14 years after the original series run, the next mind-bending chapter of THE X-FILESTM is a thrilling, six-episode event series from creator/executive producer Chris Carter, with stars David Duchovny and Gillian Anderson reinhabiting their roles as iconic FBI agents FOX MULDER and DANA SCULLY. Mitch Pileggi also returns as FBI Assistant Director WALTER SKINNER, Mulder and Scully s boss, who walks a fine line between loyalty to these investigators and accountability to his superiors. This marks the momentous return of the Emmy®- and Golden Globe® Award-winning pop culture phenomenon, which remains one of the longest-running sci-fi series in network television history. Bonus Features:Disc 1:**My Struggle**Founder\\'s Mutation**Mulder & Scully Meet the Were-Monster**Home Again**Audio Commentary on \"Founder\\'s Mutation\" with Chris Carter and James Wong**Audio Commentary on \"Mulder & Scully Meet the Were-Monster\" with David Duchovny, Gillian Anderson, Kumail Nanjiani and Darin MorganDisc 2:**Babylon**My Struggle II**Audio Commentary on \"My Struggle II\" with Chris Carter and Gabe Rotter**Deleted & Extended Scenes**43:45 The Makings of a Struggle**Season X: An In-Depth Behind-the-Scenes Look at The Event Series **Gag Reel**Monsters of the Week: A Recap of the Wildest and Scariest from the Original Series**The X-Files: Green Production PSA**Short Film \"Grace\" by Karen Nielsen']\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'Mitch Pileggi, Jonathan Whitesell, David Duchovny, Chris Carter', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35396369', 'Director': 'Chris Carter', 'Media Format': 'AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 14, 2016', 'Actors': 'David Duchovny, Mitch Pileggi, Jonathan Whitesell', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\n&#34;Trust no one&#34; if they don't like the X-Files!!!!! Great add to my collection. I can't believe the series ever ended.\nXphile till i die",
  "profile": "**User Profile Summary:**\n\n- **Media Preferences:** The user maintains a strong inclination towards action, thriller, drama, and fantasy, particularly enjoying whimsical narratives that blend supernatural elements with character-driven stories. They express growing interest in science fiction, demonstrating a willingness to explore complex narratives within their fantasy domain.\n\n- **Favorite Actors/Directors:** Continued appreciation for performances from well-known actors remains evident, particularly with a fondness for Matthew McConaughey, Dustin Hoffman, and now David Duchovny and Mitch Pileggi, indicating a preference for engaging stories with talented casts.\n\n- **Format Preference:** The user is committed to physical media formats, specifically DVDs, emphasizing their dedication to building a tangible collection.\n\n- **Review Patterns:** They consistently rate products highly (5 stars) when satisfied, showcasing enthusiasm in concise reviews. The incorporation of family-friendly films and series that resonate across age groups illustrates an evolving interest.\n\n- **Emotional Engagement:** The user emphasizes heartfelt storytelling, showcasing experiences that elicit love, emotional connection, and nostalgia, with a particular focus on beloved franchises.\n\n- **Longstanding Loyalty:** Since 2017, the user has shown consistent engagement with various entertainment media.\n\n- **Interaction Depth:** Preferring concise and enthusiastic reviews, they appreciate quality storytelling and character development across a wider range of genres, indicating a deeper connection to beloved series and narratives that resonate emotionally.",
  "metrics": {
    "rouge1_f": 0.09424558223833257,
    "rouge2_f": 0.010884353741496598,
    "rougeL_f": 0.044404168554599006,
    "meteor": 0.046749341333475525,
    "bleu1": 5.933343079367941e-05,
    "bleu2": 2.852256662064729e-05,
    "bleu3": 1.3082220100831782e-05,
    "bleu4": 3.065805666118457e-06,
    "bertscore_precision": 0.3620615303516388,
    "bertscore_recall": 0.48341089487075806,
    "bertscore_f1": 0.4140276610851288
  }
}