{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Arrival\nReview Date: 2020/10/17\nStore: Amy Adams  (Actor),     Jeremy Renner  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD\nProduct Description: ['When mysterious spacecrafts touch down across the globe, an elite team - led by expert codebreaker Louise Banks (Amy Adams) - is brought together to investigate.\\xa0 As mankind teeters on the verge of global war, Banks and the team race against time for answers – and to find them, she will take a chance that could threaten her life, and quite possibly humanity.']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43471750', 'Media Format': 'NTSC', 'Run time': '1 hour and 51 minutes', 'Release date': 'January 8, 2019', 'Actors': 'Amy Adams, Jeremy Renner, Forest Whitaker, Michael Stuhlbarg', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I finally just bought this... I've probably watched this a dozen times already.<br />The viewer will use his/her intellect instead of watching a shoot-em up alien-human battle.... It's a nice change.... This movie is  how I hope our first contact will take place.\nReview Title: It pulls you in\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Basic\nSamuel Jackson  (Actor),     John Travolta  (Actor),     John McTiernan  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Academy Award(r) nominees John Travolta (Best Actor in a Leading Role, Pulp Fiction, 1994) and SamuelL. Jackson (Best Actor in a Supporting Role, Pulp Fiction, 1994) team up with action director John McTiernan (Die Hard, The Hunt for Red October, Predator) in a white-knuckle \"thrill ride with a twist you won\\'t believe!\" (MairiAnna Bachynsky, ATV/CTV ENTERTAINMENT) Also starring Connie Nielsen (TheHunted, Gladiator), Giovanni Ribisi (Gone in Sixty Seconds), Brian Van Holt (Black Hawk Down), TayeDiggs (Chicago) and Roselyn Sanchez (Rush Hour 2). A DEA officer (Travolta) is recruited to investigate the mysterious disappearance of a famed U.S. Army drill instructor (Jackson) and a group of cadets on a routine military exercise in the jungles of Panama. But the journey to uncover the truth leads to some dangerous and unexpected places when two rescued survivors tell dramatically different versions of what transpired. \"Totally mesmerizing.\" (Lisa Petrillo, WFOR/CBS (Miami)/EXTRA)']\n{'Genre': 'Drama, Thriller', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael Tadross, Taye Diggs, James Vanderbilt, Arnie Messer, Giovanni Ribisi, Intermedia Film Distribution, Ltd., Samuel Jackson, Connie Nielsen, Mike Medavoy, John Travolta, John McTiernanMichael Tadross, Taye Diggs, James Vanderbilt, Arnie Messer, Giovanni Ribisi, Intermedia Film Distribution, Ltd., Samuel Jackson, Connie Nielsen, Mike Medavoy, John Travolta, John McTiernan  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 0.5 x 5.25 inches; 1.76 Ounces', 'Director': 'John McTiernan', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'July 8, 2003', 'Actors': 'Samuel Jackson, John Travolta, Connie Nielsen, Taye Diggs, Giovanni Ribisi', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'James Vanderbilt, Arnie Messer, Michael Tadross, Mike Medavoy', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nLove this movie!\nGreat\nLucifer: The Complete First Season [DVD]\nTom Ellis  (Actor),     Lauren German  (Actor),     Len Wiseman  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Lucifer: The Complete First Season (DVD)', 'Bored and unhappy as the Lord of Hell, Lucifer has resigned his throne and retired to the City of Angels, where he is indulging in a few of his favorite things — wine, women, song. When a beautiful pop star is brutally murdered before his eyes, he feels something awaken deep within him – for the first time in roughly 10 billion years. Is he actually capable of feelings for a human being? The very thought disturbs him — as well as his best friend and confidante, Mazikeen (aka Maze), a fierce demon in the form of a beautiful young woman. The murder attracts the attention of LAPD homicide detective Chloe Dancer, who finds herself both repulsed and fascinated by Lucifer. As they work together to solve the murder, Lucifer is struck by Chloe’s inherent goodness. Used to dealing with the absolute worst of humanity, he begins to wonder if there’s hope yet. Maybe everyone’s got a chance for redemption. Even the Devil.', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Drama', 'Format': 'Dolby, DVD, NTSC, Subtitled, AC-3', 'Contributor': 'Len Wiseman, Jonathan Littman, Jerry Bruckheimer, Tom Ellis, Lauren German', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': '35645241', 'Director': 'Len Wiseman', 'Media Format': 'Dolby, DVD, NTSC, Subtitled, AC-3', 'Run time': '9 hours and 20 minutes', 'Release date': 'August 23, 2016', 'Actors': 'Tom Ellis, Lauren German', 'Subtitles': 'French', 'Producers': 'Jerry Bruckheimer, Jonathan Littman', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nThis is my favorite tv show of all time....and I'm no spring chicken.....I love to watch the devil learn and become more human(at times)....can't wait for season 2!<br />My package arrived on time and packaged nicely...\nLove Lucifer!\nMr. Magorium's Wonder Emporium\nDustin Hoffman  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', 'In writer-director Zach Helm\\'s whimsical 2007 film, MR. MAGORIUM\\'S WONDER EMPORIUM, veteran actor Dustin Hoffman plays the title character, a 243-year-old toy-store owner who is ready to pass his enchanted business on to his beloved assistant, Molly Mahoney (Natalie Portman). However, when Molly, a former composer and pianist, has doubts about taking over the (literally) magical store, and an uptight accountant (Jason Bateman) appears to assess the establishment, the many inhabitants of the Wonder Emporium begin to rebel, resulting in a chaotic situation that can be fixed only with the help of a shy, lonely boy (Zach Mills). Director Zach Helm Star Dustin Hoffman, Natalie Portman, Jason Bateman, Zach Mills Special Features: Widescreen - 2.35 Audio: Dolby Digital Surround - Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish, French - Optional Additional Release Material: Behind the Scenes - \"Strangely Weird and Weirdly Strange: The Magical World of a Wonder Emporium\" (Parts 1-5) Featurettes - 1. \"An Eccentric Boss and an Awkward Apprentice\" 2. \"To Find Eric Applebaum, Start by Saying Hi\" 3. \"A Magical Toy Store\" 4. \"The Big Book of Toys\" Trailers - 1. Forced Trailers 2. 20th Century Fox Previews DVD-ROM: Games - \"Paper Airplane Tutor\" Runtime: 94 minutes Year of Release: 2007.', 'Amazon.com', 'Equal parts whimsical and bittersweet,', \"Mr. Magorium's Wonder Emporium\", 'is a family-friendly movie that will charm youngsters. Dustin Hoffman stars in the titular role of an eccentric 243-year-old owner of a magical toy store. He doesn\\'t appear to be sick, but he has lived a long and happy life and is content to leave his emporium to his employee Molly Mahoney (Natalie Portman). A former child prodigy who has grown up unsure of herself, she barely knows who she is, much less what she wants to become. Molly is both frightened that her beloved boss is leaving and that she will be left in charge of a store she doesn\\'t know how to run. \"Are you dying?\" she asks him. Magorium points out, \"Light bulbs die, my dear. I am departing.\" His take on death is both comforting and matter of fact, things younger viewers may find soothing when dealing with mortality. Though the film has drawn comparisons to', 'Charlie and the Chocolate Factory', \", this G-rated venture is less dark, curious and interesting than the former. Still, it offers dazzling visuals and a premise that who you are isn't equivalent with who you think you are. Adult moviegoers may find the premise cloying and repetitive. But seen from a child's eye,\", \"Mr. Magorium's Wonder Emporium\", 'is indeed a magical place for a short visit. --', 'Jae-Ha Kim', 'Beyond', \"Mr. Magorium's Wonder Emporium\", \"Mr. Magorium's Wonder Emporium\", 'Books', \"Mr. Magorium's Wonder Emporium\", 'Toys and Games', 'More Kids & Family titles from Fox', 'Stills from', \"Mr. Magorium's Wonder Emporium\"]\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.63 x 5.41 x 7.57 inches; 2.72 Ounces', 'Item model number': '2250492', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Full Screen', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 4, 2008', 'Actors': 'Dustin Hoffman', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Studios', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI'm a kid at heart...I love this movie. Very fun\nGreat for any age\nInterstellar\nAnne Hathaway  (Actor),     Jessica Chastain  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy\n['INTERSTELLAR opens on Earth in the distant future, as Mother Nature is waging war on humanity. Famine is widespread, and all of mankind\\'s resources are now dedicated to farming in a desperate fight for survival. A former NASA pilot and engineer named Cooper (Matthew McConaughey) has become a homesteader in order to support his teenage son Tom (Timothee Chalamet) and 10-year-old daughter Murph (Mackenzie Foy). Unfortunately, even that begins to look like a futile endeavor after a sandstorm ravages their close-knit community. Meanwhile, a seemingly supernatural mystery begins to unfold when the \"ghost\" that dwells in Murph\\'s room sends her a mysterious set of coordinates - which lead the curious father/daughter duo to a clandestine underground base housing the remnants of NASA. There, renowned physicist Professor Brand (Michael Caine) has been working with a team of astronauts and scientists to find a new planet capable of sustaining human life. Brand quickly persuades Cooper to pilot a mission that will hopefully carry the seeds of human life to a habitable planet in another galaxy. Cooper is soon bound for space with Brand\\'s daughter Amelia (Anne Hathaway) and researchers Doyle (Wes Bentley) and Romilly (David Gyasi).']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43381941', 'Media Format': 'NTSC', 'Run time': '2 hours and 48 minutes', 'Release date': 'January 7, 2020', 'Actors': 'Anne Hathaway, Jessica Chastain, Matthew McConaughey, Michael Caine, Ellen Burstyn', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie.....but then again.....how many times is a Matthew McConaughey movie a flop?\nGreat movie\nX-Files: The Event Series (2016)\nDavid Duchovny  (Actor),     Mitch Pileggi  (Actor),     Chris Carter  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Alien Invasion\n['Almost 14 years after the original series run, the next mind-bending chapter of THE X-FILESTM is a thrilling, six-episode event series from creator/executive producer Chris Carter, with stars David Duchovny and Gillian Anderson reinhabiting their roles as iconic FBI agents FOX MULDER and DANA SCULLY. Mitch Pileggi also returns as FBI Assistant Director WALTER SKINNER, Mulder and Scully s boss, who walks a fine line between loyalty to these investigators and accountability to his superiors. This marks the momentous return of the Emmy®- and Golden Globe® Award-winning pop culture phenomenon, which remains one of the longest-running sci-fi series in network television history. Bonus Features:Disc 1:**My Struggle**Founder\\'s Mutation**Mulder & Scully Meet the Were-Monster**Home Again**Audio Commentary on \"Founder\\'s Mutation\" with Chris Carter and James Wong**Audio Commentary on \"Mulder & Scully Meet the Were-Monster\" with David Duchovny, Gillian Anderson, Kumail Nanjiani and Darin MorganDisc 2:**Babylon**My Struggle II**Audio Commentary on \"My Struggle II\" with Chris Carter and Gabe Rotter**Deleted & Extended Scenes**43:45 The Makings of a Struggle**Season X: An In-Depth Behind-the-Scenes Look at The Event Series **Gag Reel**Monsters of the Week: A Recap of the Wildest and Scariest from the Original Series**The X-Files: Green Production PSA**Short Film \"Grace\" by Karen Nielsen']\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'Mitch Pileggi, Jonathan Whitesell, David Duchovny, Chris Carter', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35396369', 'Director': 'Chris Carter', 'Media Format': 'AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Run time': '4 hours and 24 minutes', 'Release date': 'June 14, 2016', 'Actors': 'David Duchovny, Mitch Pileggi, Jonathan Whitesell', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\n&#34;Trust no one&#34; if they don't like the X-Files!!!!! Great add to my collection. I can't believe the series ever ended.\nXphile till i die\nThe X-Files Mythology, Vol. 1 - Abduction\nDavid Duchovny  (Actor),     Gillian Anderson  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', 'For nine seasons, fans of ?The X Files? watched and waited for an ultimate explanation of the complex web of alien conspiracy theories, government cover-ups and shadow organizations woven by series creator Chris Carter. Now, for the first time, viewers can follow every twist and turn of the complete mythology story arc beginning with THE X FILES MYTHOLOGY: ABDUCTION. ABDUCTION consists of 16 episodes from seasons 1-3, and presents the government conspiracy episodes in order, beginning with the series pilot. The set also features commentary on selected episodes and part one of Chris Carter?s all-new documentary ?Threads Of Mythology,? which explains the meaning of ?The X Files? and how all lies lead to the truth.', 'Amazon.com', 'The X-Files Mythology', \"series consists of collections of episodes grouped around certain themes that were central to Chris Carter's gripping, funny, and sometimes impenetrable sci-fi/suspense/horror series. The 15 episodes in the first volume,\", 'Abduction', ', are culled from the first three seasons of the show, and they introduce FBI agent Dana Scully (Gillian Anderson), who has been assigned to keep tabs on her new partner, the eccentric Fox Mulder (David Duchovny). Mulder\\'s specialty is those cases that can\\'t seem to be solved on normal parameters--the \"X-Files\"--because he believes that many years ago his sister was abducted by aliens. We meet a dizzying cast of supporting characters: FBI assistant director Skinner (Mitch Pileggi); a government informant, code-named \"Deep Throat,\" who offers to get Mulder closer to the truth than he\\'s ever imagined; apparent abductee Duane Barry (Steve Railsback); a trio of conspiracy theorists called the Lone Gunmen (Dean Haglund, Tom Braidwood, and Bruce Harwood); the mysterious Cigarette Smoking Man (William B. Davis); and suspicious agent Krycek (Nicholas Lea). And the theme of alien abduction leads to deeper threads involving experiments with alien DNA, cloning, alien bounty hunters, and more. These early episodes are some of the best the series ever had to offer, and the reasonably priced', 'Mythology', 'sets might be enticing for novices who would like to get a feel for the series without having to wade through all the story arcs and concepts that wandered through the nine seasons. (They\\'re also conveniently packaged, with four discs in two Thinpaks.) X-philes, of course, would prefer the complete seasons, with the multiple arcs as well as the numerous excellent standalone (a.k.a. \"creature feature\") episodes. The discs include new commentary tracks on five of the episodes by Chris Carter, writer Frank Spotnitz, or director R.W. Goodwin, and there\\'s a new 28-minute documentary that provides an overview of the series and the pertinent episodes that\\'s well suited to novices.', '--David Horiuchi']\n{'Genre': 'Science Fiction', 'Format': 'Box set, Color, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'James Pickens Jr., Robert Patrick, Chris Carter, Dean Haglund, Annabeth Gish, Tom Braidwood, Gillian Anderson, Mitch Pileggi, David Duchovny, Bruce Harwood, Nicholas Lea, Sheila Larken, William B. DavisJames Pickens Jr., Robert Patrick, Chris Carter, Dean Haglund, Annabeth Gish, Tom Braidwood, Gillian Anderson, Mitch Pileggi, David Duchovny, Bruce Harwood, Nicholas Lea, Sheila Larken, William B. Davis   See more', 'Language': 'French (Dolby Digital 2.0 Stereo), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.44 Ounces', 'Media Format': 'Box set, Color, Dolby, Dubbed, Closed-captioned, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '45 minutes', 'Release date': 'June 7, 2005', 'Actors': 'David Duchovny, Gillian Anderson, Mitch Pileggi, Robert Patrick, Tom Braidwood', 'Dubbed': 'English, French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Chris Carter', 'Number of discs': '4'}\nYou can trust me Mulder......this was a great purchase to finish my set.<br />I've been an X-phile since day one!\nThe truth is out there......\nLucifer: The Complete Third Season\nEllis, Tom  (Actor),     German, Lauren  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n['DVD Lucifer 4']\n{'Genre': 'Feature', 'Format': 'NTSC', 'Contributor': 'German, Lauren, Alejandro, Kevin, Ellis, Tom', 'Number Of Discs': '5', 'Runtime': '1051 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.72 Ounces', 'Media Format': 'NTSC', 'Run time': '1051 minutes', 'Actors': 'Ellis, Tom, German, Lauren, Alejandro, Kevin', 'Studio': 'NTSC', 'Number of discs': '5'}\nSuch a huge cliffhanger for the best show on tv.<br />Cannot get enuf of this show.....but sadly fox cancelled it. Verified LUCIFAN!\nSuch a huge cliffhanger for the best show on tv\nThe Doctor [DVD]\nWilliam Hurt  (Actor),     Christine Lahti  (Actor),     Randa Haines  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Reunited for the first time since their Academy Award(R)-nominated CHILDREN OF A LESSER GOD, screen favorite William Hurt and director Randa Haines team up for another successful collaboration in THE DOCTOR. Oscar(R)-winning Hurt (Best Actor, 1986 -- KISS OF THE SPIDER WOMAN) joins Christine Lahti (RUNNING ON EMPTY), Mandy Patinkin (THE PRINCESS BRIDE), and Elizabeth Perkins (BIG) in the hit release that's been hailed as one of the must-see films of the year. It's the uplifting story of a man who becomes an extraordinary surgeon, as well as an extraordinary person, once he experiences firsthand what it's like being an ordinary patient. Touching hearts of critics and audiences alike, THE DOCTOR promises to entertain and inspire you from beginning to end.\"]\n{'Format': 'Closed-captioned, Color, DVD, NTSC', 'Contributor': 'Ed Rosenbaum, Elizabeth Perkins, Robert Caswell, Wendy Crewson, Randa Haines, William Hurt, Mandy Patinkin, Adam Arkin, Bill Macy, J.E. Freeman, Charlie Korsmo, Christine Lahti, William Marquez, Kyle Secor, Nicole Orth-PallaviciniEd Rosenbaum, Elizabeth Perkins, Robert Caswell, Wendy Crewson, Randa Haines, William Hurt, Mandy Patinkin, Adam Arkin, Bill Macy, J.E. Freeman, Charlie Korsmo, Christine Lahti, William Marquez, Kyle Secor, Nicole Orth-Pallavicini   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 2 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Randa Haines', 'Media Format': 'Closed-captioned, Color, DVD, NTSC', 'Run time': '2 hours and 2 minutes', 'Release date': 'April 6, 2004', 'Actors': 'William Hurt, Christine Lahti, Elizabeth Perkins, Mandy Patinkin, Adam Arkin', 'Subtitles': 'Spanish', 'Studio': 'Walt Disney Video / Mill Creek', 'Writers': 'Ed Rosenbaum, Robert Caswell', 'Number of discs': '1'}\nEvery doctor should watch this movie! One of my favorites.\nGive it to your Dr.\nBarbarians Rising\n-  (Actor, Director)    Format: DVD\nMovies & TV, Genre for Featured Categories, Military & War\n[\"Putting you in the heat of battle, this dynamic miniseries features some of history's most famous warriors including Hannibal and Spartacus.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Audio Description': 'English', 'Media Format': 'NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 53 minutes', 'Release date': 'September 27, 2016', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI love these programs from the History channel. So much better and informative than the stupid programs history channel has now....like Swamp people....how is shooting crocodiles historically fitting for the network......sry for the critique.\nLove the old history programs.....\nThe Prophecy Collection [DVD]\nRated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Prophecy Coll']\n{'Genre': 'Horror/Supernatural', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Contributor': 'PROPHECY COLLECTION', 'Language': 'English', 'Runtime': '7 hours and 6 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.01 Ounces', 'Item model number': 'LGT46234DVD', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Run time': '7 hours and 6 minutes', 'Release date': 'October 7, 2014', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nI was rather pleased with the movies. A lot of people criticized them, making fun of them...... The 1st movie does have a lot of leading names in it.  But the movies follow each other well.... I didn't want to shut it off. Loved Viggo as Satan.... And I also liked John Light as Satan.... He was a bit more subdued, but now I'm looking for other things he's been in.\nGood movies.\nDeadpool 2\nRyan Reynolds  (Actor, Writer),     Josh Brolin  (Actor),     David Leitch  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Marvel's potty-mouthed mercenary anti-hero is back in this laugh- and action-packed sequel. Deadpool (Ryan Reynolds) assembles a team of mutants called X-Force in order to stop cybernetic, time-traveling soldier Cable (Josh Brolin) from killing Russell Collins (Julian Dennison), a young mutant who will murder Cable's family in the future. What could possibly go wrong when Deadpool and Cable are forced to put their differences aside and work together? With Zazie Beetz, Morena Baccarin. 119 min. Widescreen; Soundtracks: English Dolby Digital 5.1, DVS 5.1, Spanish Dolby Digital stereo, French Dolby Digital stereo; Subtitles: English (SDH), Spanish, French; gag reel; photo gallery.\"]\n{'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'B07CF6WFZT', 'Director': 'David Leitch', 'Media Format': 'NTSC, Color', 'Release date': 'August 21, 2018', 'Actors': 'Ryan Reynolds, Josh Brolin, Morena Baccarin, Julian Dennison, Zazie Beetz', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish, French', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Rhett Reese, Paul Wernick, Ryan Reynolds', 'Country of Origin': 'USA', 'Number of discs': '1'}\nNothing better than a smart-assed super hero.....\nHahahahahaha\nOutlander: Season 4 [DVD]\nCaitriona Balfe  (Actor),     Sam Heughan  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Season Four of Outlander continues the story of Claire and Jamie Fraser as they try to make a home for themselves in colonial America. The Frasers settle in North Carolina at yet another turning point in history - the cusp of the American Revolution - where they must negotiate a tenuous loyalty to the current British ruling class, despite Claire's knowledge of the bloody rebellion to come. Along the way, the Frasers cross paths with notorious pirate and smuggler Stephen Bonnet in a fateful meeting that will come back to haunt the Fraser family. Meanwhile, Brianna Randall and Roger Wakefield grow closer in the 20th century but make a shocking discovery that makes them consider following in Claire's footsteps.\"]\n{'Genre': 'Drama/Television, Television/British Television', 'Format': 'Subtitled, NTSC', 'Contributor': \"Caitriona Balfe, Jennifer Yale, Shaina Fewell, Sam Heughan, Sophie Skelton, Richard Rankin, Michael O'HalloranCaitriona Balfe, Jennifer Yale, Shaina Fewell, Sam Heughan, Sophie Skelton, Richard Rankin, Michael O'Halloran  See more\", 'Language': 'English', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': '55480', 'Media Format': 'Subtitled, NTSC', 'Run time': '12 hours and 26 minutes', 'Release date': 'May 28, 2019', 'Actors': 'Caitriona Balfe, Sam Heughan, Sophie Skelton, Richard Rankin', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': \"Michael O'Halloran, Jennifer Yale, Shaina Fewell\", 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '5'}\nWhat would I ever say bad about Outlander? Nothing..... Nothing wrong with DVD either. Seems pretty good. So far with multiple watches and shares it's doing well.\nOutlander Great!\nThe Last of the Mohicans: Director’s Definitive Cut [Blu-ray]\nDaniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Academy Award(R) winner Daniel Day-Lewis (Best Actor in 1989 for', 'My Left Foot', ') stars as Hawkeye, rugged frontiersman and adopted son of the Mohicans, and Madeleine Stowe is Cora Munro, aristocratic daughter of a proud British Colonel. Their love, tested by fate, blazes amidst a brutal conflict between the British, the French and Native American allies that engulfs the majestic mountains and cathedral-like forests of Colonial America.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD)', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2265788', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Subtitles': 'French, English, Spanish', 'Producers': 'Michael Mann, Hunt Lowry, Mark Mann, Ned Dowd', 'Studio': '20th Century Fox', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI remember all the hype the movie caused when it came out. I also fell in love with Daniel Day Lewis's portrayal of the protagonist.... Looks and acting... But it took me until now to watch the movie..... I enjoyed it immensely....!\nLoved it....\nArrival\nAmy Adams  (Actor),     Jeremy Renner  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD\n['When mysterious spacecrafts touch down across the globe, an elite team - led by expert codebreaker Louise Banks (Amy Adams) - is brought together to investigate.\\xa0 As mankind teeters on the verge of global war, Banks and the team race against time for answers – and to find them, she will take a chance that could threaten her life, and quite possibly humanity.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43471750', 'Media Format': 'NTSC', 'Run time': '1 hour and 51 minutes', 'Release date': 'January 8, 2019', 'Actors': 'Amy Adams, Jeremy Renner, Forest Whitaker, Michael Stuhlbarg', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI finally just bought this... I've probably watched this a dozen times already.<br />The viewer will use his/her intellect instead of watching a shoot-em up alien-human battle.... It's a nice change.... This movie is  how I hope our first contact will take place.\nIt pulls you in",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user maintains their preference for action, thriller, drama, and fantasy genres, with an ongoing interest in whimsical and supernatural narratives that emphasize character-driven storytelling. They have continually explored historical narratives, deepening their engagement with series surrounding significant historical events.\n\n- **Favorite Actors/Directors:** The user has a consistent admiration for actors such as Matthew McConaughey, Dustin Hoffman, David Duchovny, and Mitch Pileggi, with a growing interest in John Light. Their appreciation for Ryan Reynolds, particularly in roles blending humor and action, has become significant. They also value the depth of Daniel Day-Lewis's performances.\n\n- **Format Preference:** The user's commitment to physical media endures, particularly DVDs and Blu-rays, as they thoughtfully expand their collection of tangible formats.\n\n- **Review Patterns:** The user continues to award 5-star ratings, consistently penning enthusiastic and concise reviews that focus on emotional depth and character significance. Their latest review underscores a preference for intellectually engaging narratives over typical action plots.\n\n- **Emotional Engagement:** Heartfelt narratives emphasizing love and connection remain paramount for the user, alongside a strong appreciation for emotional resonance across genres.\n\n- **Longstanding Loyalty:** Engaged with entertainment since 2017, the user has consistently demonstrated an interest in thoughtful content.\n\n- **Interaction Depth:** Their reviews continue to highlight a passion for strong character arcs and narratives that skillfully intertwine humor and intensity, reinforcing their established preferences.",
  "metrics": {
    "rouge1_f": 0.05573905862923204,
    "rouge2_f": 0.008674101610904586,
    "rougeL_f": 0.028901734104046246,
    "meteor": 0.0220684108028144,
    "bleu1": 3.5186962953093064e-10,
    "bleu2": 1.8443186847767702e-10,
    "bleu3": 8.309718746415943e-11,
    "bleu4": 3.31937585857905e-11,
    "bertscore_precision": 0.3629903793334961,
    "bertscore_recall": 0.5250529050827026,
    "bertscore_f1": 0.42923393845558167
  }
}