{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Earfodo Long Blonde Wigs for Women Ombre Dirty Blonde Wig with Bangs Middle Part Heat Resistant Layered Synthetic Wig For Women Daily Party Wear 21 Inch Natural Looking\nReview Date: 2022/03/07\nStore: Earfodo\nAverage Rating: 3.3\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Brand': 'Earfodo', 'Cartoon Character': 'American', 'Package Dimensions': '11.5 x 7.32 x 2.56 inches; 9.59 Ounces'}\nReview Text: The color on this is gorgeous, but it has a lot of issues.  The bangs are hard to get right.  They don't really part in a specific place and just want to hang forward.  The lengths of the bangs and layers are made for a longer face.  The longer layers have way more on one side than the other and both sides point in the same direction.  (Makes a \"C\" shape around the face) also even after paying it and pulling it forward the side hairs hang away from the face when you lean.  So much that you can see the line of the wig and my hairline.  The cap is so big that even with a wig cap and 3 clips this keeps pulling back so much it shows inches of my hairline.  I wish this was better because I really like this blonde, but this wig is not for me\nReview Title: Beautiful color but cap is huge and style is crooked\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "35pcs Eyebrow Stamp Stencil Kit ADIMANIS Eyebrow Powder One Step Brow Stamp and Shaping Kit Eyebrow Stencils Eyebrows Shape Reusable Eyebrow Brush, Hairline Powder Contouring Stick (Light Brown)\nADIMANIS\n{'Brand': 'ADIMANIS', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Material Feature': 'Reusable, Natural', 'Product Benefits': 'Waterproof', 'Package Dimensions': '5.59 x 4.13 x 1.65 inches; 2.08 Ounces', 'UPC': '761325190127'}\nAll the stencils and the purple t shape stencils are not long enough for my brows but otherwise work as described. The powder does not. Can't get enough powder on the presser to do any good. Doesn't show up well and not enough powder to really transfer or even do 1 brow without repressing the powder multiple times. I use the stencils with another kit. The powder and powder applicator are a joke\nPowder didn't work at all\nMulti-Purpose Electric Massage Gel & Oil Warmer, Wax Melter, Includes Aluminum Warming Pot (16.9 fl oz), Knob Dial To Adjust Temperature (95F to 257F), With LCD Screen\nEROTICGEL\n{'Package Dimensions': '7.83 x 7.72 x 7.6 inches; 1.77 Pounds', 'UPC': '754590183604'}\n[[VIDEOID:c9f78d09ec648d2bdc92f5ad9698e698]] The look of this is very modern and I like that you can see an actual degree not just high, medium, low. The soft wax pots from my old warmer have a lot of space on the sides even with the removable insert, but it still heats and melted them nicely.  My problem comes with the shape of the warmer.  I scrape the side of the stick that I'm not using on the edge of the pot to conserve my wax and the round shape makes it tip if I do this too hard.  It only comes with the warmer and the removable pot.  To not come with any more than that i feel like $50 is kind of steep.  (At the time of writing this $39.99 which is more reasonable.  The bottom glows red or green letting you know if your wax is up to temp. Its nice and looks nice, but not great for my usage.\nLooks great but not practical for me\nEarfodo Long Blonde Wigs for Women Ombre Dirty Blonde Wig with Bangs Middle Part Heat Resistant Layered Synthetic Wig For Women Daily Party Wear 21 Inch Natural Looking\nEarfodo\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Brand': 'Earfodo', 'Cartoon Character': 'American', 'Package Dimensions': '11.5 x 7.32 x 2.56 inches; 9.59 Ounces'}\nThe color on this is gorgeous, but it has a lot of issues.  The bangs are hard to get right.  They don't really part in a specific place and just want to hang forward.  The lengths of the bangs and layers are made for a longer face.  The longer layers have way more on one side than the other and both sides point in the same direction.  (Makes a \"C\" shape around the face) also even after paying it and pulling it forward the side hairs hang away from the face when you lean.  So much that you can see the line of the wig and my hairline.  The cap is so big that even with a wig cap and 3 clips this keeps pulling back so much it shows inches of my hairline.  I wish this was better because I really like this blonde, but this wig is not for me\nBeautiful color but cap is huge and style is crooked",
  "profile": "**User Profile Summary:**\n\n- **Beauty Focus**: The user remains engaged in eyebrow grooming products and is now exploring wigs, seeking items that enhance their overall appearance for daily and special occasions.\n- **Performance Expectations**: They maintain high expectations regarding product performance and display critical feedback when items do not align with advertised qualities, evident in their recent experience with a wig.\n- **Product Usability**: Valuing ease of use and practical results, the user prefers products that offer straightforward application without complicated techniques, indicating a desire for reliable solutions across different beauty categories.\n- **Quality Concerns**: The user is attentive to performance, fit, and design, expressing frustration when products like wigs lack proper sizing or styling, which impacts usability and satisfaction.\n- **Review Behavior**: They provide detailed, critical reviews that outline both aesthetic appeal and functional shortcomings, reflecting a discerning approach to evaluating beauty items, including hair products.\n- **Material Preferences**: They lean towards sustainable, eco-friendly options across their beauty purchases, valuing functionality alongside environmental impact, which remains consistent in their search for effective tools.\n- **Design and Practicality**: While appreciating modern aesthetics, the user prioritizes practicality and a comfortable fit in their beauty choices, seeking a balance between style and functionality.\n\nOverall, the user exhibits a meticulous approach to beauty products, continually seeking effective tools and accessories that align with their expectations for quality and usability across various categories.",
  "metrics": {
    "rouge1_f": 0.1738035264483627,
    "rouge2_f": 0.00505050505050505,
    "rougeL_f": 0.09319899244332494,
    "meteor": 0.0952455919395466,
    "bleu1": 0.08659244464583536,
    "bleu2": 0.012789054190852514,
    "bleu3": 0.005371651241861648,
    "bleu4": 0.001959357530980802,
    "bertscore_precision": 0.3568115234375,
    "bertscore_recall": 0.41590648889541626,
    "bertscore_f1": 0.3840993344783783
  }
}