{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Vegan Mia - USDA Organic Radiance Superfruit Cleansing Oil and Make-up Remover, Oil Cleanser and Makeup Remover Oil for Dry Skin and Other Skin Types, Loaded with Moisturizer Essential Fatty Acids, Rich in Antioxidants, Truly Natural Skincare, (With No Added Fragrance) 3.4 fl oz\nReview Date: 2022/03/15\nStore: Vegan Mia\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'Vegan Mia', 'Scent': 'Natural aroma of fruit oils - No fragrance added', 'Material Feature': 'Natural, Cruelty Free, Vegan', 'Package Dimensions': '6.34 x 1.77 x 1.73 inches; 9.14 Ounces', 'UPC': '762530483363', 'Manufacturer': 'Vegan Mia'}\nReview Text: I do not recommend this at all. It smells absolutely terrible. Leaves a thick greasy film on your skin that's hard to get off.  Smells like vegetable or olive oil.  More like something you'd cook with than put on your skin. Does remove the makeup but at the cost of smelling like a fry cook. Sorry but gross\nReview Title: Smells like cooking oil. Leaves grease on face\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "35pcs Eyebrow Stamp Stencil Kit ADIMANIS Eyebrow Powder One Step Brow Stamp and Shaping Kit Eyebrow Stencils Eyebrows Shape Reusable Eyebrow Brush, Hairline Powder Contouring Stick (Light Brown)\nADIMANIS\n{'Brand': 'ADIMANIS', 'Item Form': 'Powder', 'Finish Type': 'Natural', 'Material Feature': 'Reusable, Natural', 'Product Benefits': 'Waterproof', 'Package Dimensions': '5.59 x 4.13 x 1.65 inches; 2.08 Ounces', 'UPC': '761325190127'}\nAll the stencils and the purple t shape stencils are not long enough for my brows but otherwise work as described. The powder does not. Can't get enough powder on the presser to do any good. Doesn't show up well and not enough powder to really transfer or even do 1 brow without repressing the powder multiple times. I use the stencils with another kit. The powder and powder applicator are a joke\nPowder didn't work at all\nMulti-Purpose Electric Massage Gel & Oil Warmer, Wax Melter, Includes Aluminum Warming Pot (16.9 fl oz), Knob Dial To Adjust Temperature (95F to 257F), With LCD Screen\nEROTICGEL\n{'Package Dimensions': '7.83 x 7.72 x 7.6 inches; 1.77 Pounds', 'UPC': '754590183604'}\n[[VIDEOID:c9f78d09ec648d2bdc92f5ad9698e698]] The look of this is very modern and I like that you can see an actual degree not just high, medium, low. The soft wax pots from my old warmer have a lot of space on the sides even with the removable insert, but it still heats and melted them nicely.  My problem comes with the shape of the warmer.  I scrape the side of the stick that I'm not using on the edge of the pot to conserve my wax and the round shape makes it tip if I do this too hard.  It only comes with the warmer and the removable pot.  To not come with any more than that i feel like $50 is kind of steep.  (At the time of writing this $39.99 which is more reasonable.  The bottom glows red or green letting you know if your wax is up to temp. Its nice and looks nice, but not great for my usage.\nLooks great but not practical for me\nEarfodo Long Blonde Wigs for Women Ombre Dirty Blonde Wig with Bangs Middle Part Heat Resistant Layered Synthetic Wig For Women Daily Party Wear 21 Inch Natural Looking\nEarfodo\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Brand': 'Earfodo', 'Cartoon Character': 'American', 'Package Dimensions': '11.5 x 7.32 x 2.56 inches; 9.59 Ounces'}\nThe color on this is gorgeous, but it has a lot of issues.  The bangs are hard to get right.  They don't really part in a specific place and just want to hang forward.  The lengths of the bangs and layers are made for a longer face.  The longer layers have way more on one side than the other and both sides point in the same direction.  (Makes a \"C\" shape around the face) also even after paying it and pulling it forward the side hairs hang away from the face when you lean.  So much that you can see the line of the wig and my hairline.  The cap is so big that even with a wig cap and 3 clips this keeps pulling back so much it shows inches of my hairline.  I wish this was better because I really like this blonde, but this wig is not for me\nBeautiful color but cap is huge and style is crooked\nVegan Mia - USDA Organic Radiance Superfruit Cleansing Oil and Make-up Remover, Oil Cleanser and Makeup Remover Oil for Dry Skin and Other Skin Types, Loaded with Moisturizer Essential Fatty Acids, Rich in Antioxidants, Truly Natural Skincare, (With No Added Fragrance) 3.4 fl oz\nVegan Mia\n{'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'Vegan Mia', 'Scent': 'Natural aroma of fruit oils - No fragrance added', 'Material Feature': 'Natural, Cruelty Free, Vegan', 'Package Dimensions': '6.34 x 1.77 x 1.73 inches; 9.14 Ounces', 'UPC': '762530483363', 'Manufacturer': 'Vegan Mia'}\nI do not recommend this at all. It smells absolutely terrible. Leaves a thick greasy film on your skin that's hard to get off.  Smells like vegetable or olive oil.  More like something you'd cook with than put on your skin. Does remove the makeup but at the cost of smelling like a fry cook. Sorry but gross\nSmells like cooking oil. Leaves grease on face",
  "profile": "**User Profile Summary:**\n\n- **Beauty Focus**: The user continues to explore eyebrow grooming products and wigs, aiming to enhance their appearance for daily and special occasions.\n- **Performance Expectations**: They have high standards for product performance and provide critical feedback when products fall short of their advertised qualities, as illustrated by their recent negative experience with a cleansing oil.\n- **Product Usability**: The user values ease of use and practical results, favoring products that require straightforward application techniques, reflecting their desire for reliable beauty solutions.\n- **Quality Concerns**: Attentive to performance, fit, and design, they express dissatisfaction when items like skincare products do not meet usability expectations, particularly when they leave undesirable residues or scents.\n- **Review Behavior**: They leave detailed, constructive reviews that highlight both aesthetic appeal and functional issues, indicating a discerning approach to evaluating beauty products, including skincare.\n- **Material Preferences**: The user favors sustainable, eco-friendly options across beauty purchases and remains consistent in seeking products that balance efficacy with environmental impact.\n- **Design and Practicality**: While they appreciate modern aesthetics, their focus is on practicality and comfortable fit, ensuring that their beauty choices align with both style and functionality.\n\nOverall, the user's meticulous approach to beauty products drives them to seek exceptional tools and accessories that meet their expectations for quality, usability, and effectiveness across diverse categories.",
  "metrics": {
    "rouge1_f": 0.15449735449735452,
    "rouge2_f": 0.006362672322375398,
    "rougeL_f": 0.07195767195767196,
    "meteor": 0.07874969682766438,
    "bleu1": 0.041776517359626994,
    "bleu2": 0.007476302500710597,
    "bleu3": 0.0013574954483700588,
    "bleu4": 0.0005789562818811576,
    "bertscore_precision": 0.3587154746055603,
    "bertscore_recall": 0.43252235651016235,
    "bertscore_f1": 0.3921765387058258
  }
}