{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Karuna Oh, Glow On Face Mask Sheet, Skincare and Beauty Facial Masks with Moisturizing and Collagen Promotion Properties for Healthy Glow, Contain Green Tea, Vitamin C and Pineapple (3 Sheets)\nReview Date: 2020/09/15\nStore: Karuna\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrate Skin,Hydrate', 'Scent': 'Pineapple', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.54 x 4.88 x 0.87 inches; 9.59 Ounces', 'Item model number': 'MSF1004 - CA', 'UPC': '857950007166'}\nReview Text: I’ve used various Karuna masks, but this is defiantly my favorite.  The mask was super saturated out of the package, so I had to scrape some of the serum off to keep it from dripping.  I also had to fold the large mask over in a few spots where it covered my hairline on all 3 sides.  On my face the mask was cool and refreshing.  Conveniently, it didn’t slip at all, even while sitting up and looking at my cell phone.  I could smell the green tea, but it wasn’t overwhelming.  TIP:  I’ve learned that Karuna masks leave A LOT of serum on the face that doesn’t easily absorb into the skin once the mask is removed.  I left the mask on for 30 minutes, increasing absorption and letting it dry out a bit...I highly recommend this, followed by splashing cool water on your face to gently remove any excess serum.  This prevents sticky skin and left my face feeling smooth and soft almost immediately.  Within 2 hours my skin felt hydrated and looked brighter and super clean.  Very happy with this mask!\nReview Title: My favorite Karuna mask!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "6 Pack 3D Mask Bracket Internal Support Frame, Vamotto No Smell Nasal Mask Pad for Adult and Children to Creating More Space for Breathing and Protection Lipstick Ideal Makeup Saver\nVamotto\n{'Product Dimensions': '4 x 3.2 x 2 inches; 1.59 Ounces', 'UPC': '739210749279'}\nI had heard about these mask frames and was so excited to see them available on Amazon.  I was hoping they’d help keep my mask drier while at the gym.  Unfortunately, they’re simply too small for an adult face...I’m not even sure they’d work for a child.  The frame is surprisingly comfortable against the face, and it did indeed create a pocket/bubble around my nose and mouth.  However, the frames are so small, I literally can’t open my mouth to talk without my lower lip slipping uncomfortably out of the frame...and I have a pretty average sized face!  If you don’t talk to anyone while wearing a mask, this is a cool little find.  If you do talk, or just breathe heavily (like at the gym), this will never, ever work for you...not even close.  I did try cutting off the bottom of the frame, where it rests on the chin.  This helped, but the edges of the frame end up pushing into my face, which I’m guessing would be uncomfortable after a few minutes, and would definitely leave marks.  Oh well, I tried!\nGreat idea, but...no.\nKaruna Oh, Glow On Face Mask Sheet, Skincare and Beauty Facial Masks with Moisturizing and Collagen Promotion Properties for Healthy Glow, Contain Green Tea, Vitamin C and Pineapple (3 Sheets)\nKaruna\n{'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrate Skin,Hydrate', 'Scent': 'Pineapple', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.54 x 4.88 x 0.87 inches; 9.59 Ounces', 'Item model number': 'MSF1004 - CA', 'UPC': '857950007166'}\nI’ve used various Karuna masks, but this is defiantly my favorite.  The mask was super saturated out of the package, so I had to scrape some of the serum off to keep it from dripping.  I also had to fold the large mask over in a few spots where it covered my hairline on all 3 sides.  On my face the mask was cool and refreshing.  Conveniently, it didn’t slip at all, even while sitting up and looking at my cell phone.  I could smell the green tea, but it wasn’t overwhelming.  TIP:  I’ve learned that Karuna masks leave A LOT of serum on the face that doesn’t easily absorb into the skin once the mask is removed.  I left the mask on for 30 minutes, increasing absorption and letting it dry out a bit...I highly recommend this, followed by splashing cool water on your face to gently remove any excess serum.  This prevents sticky skin and left my face feeling smooth and soft almost immediately.  Within 2 hours my skin felt hydrated and looked brighter and super clean.  Very happy with this mask!\nMy favorite Karuna mask!",
  "profile": "**User Profile Summary:**\n\n- **Health and Fitness Focused:** The user demonstrates a strong commitment to health and fitness, using products that enhance their active lifestyle.\n- **Prioritizes Comfort and Functionality:** They seek comfort and practicality in wearables, emphasizing the need for products that work well during workouts and accommodate activities like talking and heavy breathing.\n- **Detailed Product Feedback:** The user provides thorough feedback based on their experiences, showing a preference for products that offer reliability and user-friendly designs. Their insights suggest they are likely to evaluate other products similarly.\n- **Sensitivity to Fit and Comfort Issues:** Recent experiences reveal a keen awareness of product fit, as they express frustration with sizing and issues related to prolonged wear, affecting skin sensitivity and overall comfort.\n- **Skincare Enthusiast:** The user enjoys exploring skincare solutions and shares helpful tips based on their experiences, further indicating their interest in products that deliver tangible results.\n- **Resourceful Modifications:** They are open to modifying products for improved usability, hinting at a proactive approach to finding functional solutions.\n\nOverall, the user values comfort, fit, and practicality in health-related products, with a notable focus on skincare applications that enhance their well-being and appearance.",
  "metrics": {
    "rouge1_f": 0.18259629101283878,
    "rouge2_f": 0.0,
    "rougeL_f": 0.09129814550641939,
    "meteor": 0.08233276157804459,
    "bleu1": 0.07011240802221433,
    "bleu2": 0.01132230498947521,
    "bleu3": 0.0022745076133634176,
    "bleu4": 0.001020474952686755,
    "bertscore_precision": 0.37382540106773376,
    "bertscore_recall": 0.4508691430091858,
    "bertscore_f1": 0.4087485373020172
  }
}