{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nReview Date: 2021/09/10\nStore: Auban\nProduct Description: ['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nReview Text: Auban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light<br /><br />Well, the first thing I noticed when I got it was that I accidentally ordered a \"Large\" cap instead of a smaller one.<br />Disappointed but I gave it a try. However, once I tried it on, I realized it might be actually better for an intended use as it could be comfortably worn while sleeping even down to cover the eyes.<br /><br />Personally, I ordered this to wear to keep my hair warm to enhance benefit of leave in conditioner (after I take a shower, put leave in conditioners and dry hair. )<br /><br />The best thing about this one is that it is such light weight that I even forgot I was wearing one while working on my computer (like you don't really feel it every second like some other thick bonnet with a tight band).<br /><br />To wear it for a long period of time, comfortableness is the most important thing to consider in my opinion and for such regard, this one gets 5 from me.<br /><br />For its durability, I will update my review accordingly if this bonnet gets torn apart easily.\nReview Title: Lightweight, comfortable to wear and even a bit stylish ? to wear around home.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Korean Face Mask - Korean Skin Care - Sano Silk Mask - All In One Pore Minimizer Anti Aging Facial Mask is the Best of K Beauty\nSano Naturals\n{'Brand': 'Sano Naturals', 'Scent': 'Silk', 'Skin Type': 'All', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.4 x 4.7 x 0.7 inches; 0.81 Ounces', 'UPC': '653981768157'}\nFirst time user and I liked it alot. I do go to a spa to get facials regularly but it gets harder when you becomes extremely busy. I hope I could use this mask for the weeks I cannot make a trip to my spa.\nFirst time user and I liked it alot\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light\nAuban\n['Thanks for your interest in', 'Auban Sleep Bonnet Eye Cover Cap', 'FEATURES  1. Two layer design, outer soft cotton and inner smooth satin, both are healthy to hair and will not stain.  2. Eye cover style, block lights and prevent skin wrinkles.  3. Fashionable and practical item, not only can you wear Auban eye cover bonnet at sleep, but also can put it on when doing sports or spas.  DETAILS Large size: 28 cm wide, 28 cm high Head girth: 56 cm (human average 52-58 cm)  Color: Outer black, inner gold', 'SUGGESTIONS:', '1. Dry your hair before you put on this sleep cap. 2. Better hand wash, turn inside around and spread to air.']\n{'Package Dimensions': '9.57 x 8.62 x 0.55 inches; 2.36 Ounces', 'Department': 'Womens', 'UPC': '700306967716'}\nAuban Sleep Hair Wrap Bonnet Eye Cover Large Black Satin Cap for Sleeping Silk Cap Double Layer for Long Hair Curl Women Sleeping Protection Hair Beanie Block Light<br /><br />Well, the first thing I noticed when I got it was that I accidentally ordered a \"Large\" cap instead of a smaller one.<br />Disappointed but I gave it a try. However, once I tried it on, I realized it might be actually better for an intended use as it could be comfortably worn while sleeping even down to cover the eyes.<br /><br />Personally, I ordered this to wear to keep my hair warm to enhance benefit of leave in conditioner (after I take a shower, put leave in conditioners and dry hair. )<br /><br />The best thing about this one is that it is such light weight that I even forgot I was wearing one while working on my computer (like you don't really feel it every second like some other thick bonnet with a tight band).<br /><br />To wear it for a long period of time, comfortableness is the most important thing to consider in my opinion and for such regard, this one gets 5 from me.<br /><br />For its durability, I will update my review accordingly if this bonnet gets torn apart easily.\nLightweight, comfortable to wear and even a bit stylish ? to wear around home.",
  "profile": "**User Profile Summary:**\n\n- **Interest in Skincare and Haircare:** This user exhibits a strong interest in skincare and haircare solutions that are effective and on-trend, particularly in alignment with K-beauty innovations.\n- **Spa Alternatives:** They prefer convenient alternatives to spa treatments, reflecting a busy lifestyle and an inclination towards at-home care routines that enhance both skin and hair health.\n- **Quality, Comfort, and Effectiveness:** Values the effectiveness of products as well as comfort in their application. Their recent experiences indicate a selective appreciation for items that provide both functionality and comfort, such as lightweight and easy-to-use treatments.\n- **Cruelty-Free and Ethical Products:** Maintains a preference for cruelty-free products, demonstrating an active awareness of ethical considerations in their skincare and haircare selections.\n- **Exploration of New Products:** Open to experimentation with skincare and haircare products, indicating a willingness to try new solutions that may integrate seamlessly into their routine.\n- **Regular Usage Patterns:** Incorporates masks and other protective items into both skincare and haircare regimens, particularly when unable to visit a spa, showcasing consistent maintenance habits for both skin and hair.\n\nOverall, the user seeks effective, convenient, and comfortable products that cater to their busy lifestyle while prioritizing ethical considerations in their choices.",
  "metrics": {
    "rouge1_f": 0.2119944211994421,
    "rouge2_f": 0.008391608391608392,
    "rougeL_f": 0.08647140864714087,
    "meteor": 0.09306122448979591,
    "bleu1": 0.07279318456421727,
    "bleu2": 0.015638952757516755,
    "bleu3": 0.0027423733616399634,
    "bleu4": 0.001149509737771801,
    "bertscore_precision": 0.35694581270217896,
    "bertscore_recall": 0.42252200841903687,
    "bertscore_f1": 0.38697549700737
  }
}