{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Under the Dome: Season 2\nReview Date: 2018/02/19\nStore: Rachelle  LeFevre  (Actor),     Colin Ford  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Boxed Sets\nProduct Description: ['From executive producer Steven Spielberg and based on the best-selling novel by Stephen King, Under the Dome is the story of a small New England town that is suddenly and inexplicably sealed off from the rest of the world by an enormous transparent dome. The town’s inhabitants must deal with surviving the post-apocalyptic conditions while searching for answers to what this barrier is, where it came from and if and when it will go away.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Contributor': 'Alexander  Koch, Natalie  Martinez, Rachelle  LeFevre, Britt  Robertson, Dean  Norris, Colin Ford, Mike VogelAlexander  Koch, Natalie  Martinez, Rachelle  LeFevre, Britt  Robertson, Dean  Norris, Colin Ford, Mike Vogel  See more', 'Language': 'English', 'Runtime': '8 hours and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '947922', 'Media Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Run time': '8 hours and 52 minutes', 'Release date': 'December 19, 2017', 'Actors': 'Rachelle  LeFevre, Colin Ford, Dean  Norris, Britt  Robertson, Alexander  Koch', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: Solid plot, the characters are okay, I'm just not that attached. I don't know why.\nReview Title: It's ok\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Barbie Diaries\nKelly Sheridan  (Actor),     Sarah Edmondson  (Actor),     Eric Fogel  (Director),     Kallen Kagen  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['It\\x92s a new school year and Barbie is hoping this year will be a little less ordinary. She loves hanging out with her best friends, playing with them in a band, working at the school TV station, and also has a crush on a boy. With a special diary and charm bracelet suddenly Barbie finds the courage to truly be herself, and exciting things start happening! Find out how fresh, fun, and exciting life can be in The Barbie Diaries!']\n{'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Closed-captioned, Animated, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Kallen Kagen, Sarah Edmondson, Venus Terzo, Anna Cummer, Ashleigh Ball, Michael Daingerfield, Andrew Francis, Maryke Hendrikse, Heather Doerksen, Kelly Sheridan, Matt Hill, Chiara Zanni, Eric Fogel, Joseph MayKallen Kagen, Sarah Edmondson, Venus Terzo, Anna Cummer, Ashleigh Ball, Michael Daingerfield, Andrew Francis, Maryke Hendrikse, Heather Doerksen, Kelly Sheridan, Matt Hill, Chiara Zanni, Eric Fogel, Joseph May  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 10 minutes', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5 x 0.5 inches; 3.2 Ounces', 'Director': 'Eric Fogel, Kallen Kagen', 'Media Format': 'Multiple Formats, Closed-captioned, Animated, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 10 minutes', 'Release date': 'May 9, 2006', 'Actors': 'Kelly Sheridan, Sarah Edmondson, Venus Terzo, Chiara Zanni, Matt Hill', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nA little mature for my seven year old, there was a lot of boy talk... I prefer the barbie movies that are more of an empowering theme.\nCute movie.\nBarbie in The Nutcracker\nKelly Sheridan  (Actor),     Kirby Morrow  (Actor),     Owen Hurley  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['The tale begins when Barbie™, playing the role of Clara, receives a beautiful wooden Nutcracker as a gift from her favorite aunt. That night, while Clara sleeps, the Nutcracker springs to life to ward off the evil Mouse King who has invaded Clara’s parlor. She awakes and aids the Nutcracker, but the Mouse King shrinks her by casting an evil spell. Clara and the Nutcracker set off on a spectacular adventure to find the Sugarplum Princess, the only one who can break the Mouse King’s evil enhancement. Barbie in the Nutcracker shows that, if you are kind, clever and brave, anything is possible…']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.56 x 5.28 x 7.51 inches; 2.72 Ounces', 'Director': 'Owen Hurley', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Kelly Sheridan, Kirby Morrow, Tim Curry, Peter Kelamis, Christopher Gaze', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Jesyca C. Durchin, Jennifer Twiner McCarron', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'Hilary Hinkle, Linda Engelsiepen, Rob Hudnut', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLoved the music and the ballet, they really stayed true to the story. My daughter loved this movie, and we all enjoyed the music.\nGreat movie\nGlee: Season 3\nLea Michele  (Actor),     Matthew Morrison  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"Despite their loss at the Regionals, the kids in New Directions are more motivated than ever. And whether it's Will doing a sexy tango with a substitute teacher (Gwyneth Paltrow), Sue joining the glee club, or everyone catching Bieber fever, the excitement at William McKinley High School is keeping everyone on their toes. With more incredible musical numbers, hugely popular guest stars like John Stamos, Carol Burnett and Kristin Chenowith and lots of behind-the-scenes special features, Glee Season 2 hits all the right notes.\", 'Amazon.com', 'A musical comedy-drama TV series that gains momentum with each season,', 'Glee: The Complete Third Season', 'takes on complicated contemporary teen issues and explores them in a music-filled way that resonates with both teen and adult viewers. This eventful year at McKinley High School begins with the glee club New Directions recruiting more members, Coach Sue Sylvester running for congress, Blaine transferring to McKinley, and several original New Directions members finishing up their senior year. As graduation nears, Rachel and Kurt struggle through the application procedure to gain acceptance into their college choice NYADA, there are a couple of wedding proposals (one more unexpected than the other), and Santana examines her sexual orientation. Mike Chang struggles with parental expectations, Kurt and Blaine hit a rocky patch, and Mercedes finds herself at the center of an interesting love triangle. Coaches Sylvester and Beiste each reveal a whole new side of their personalities, a serious accident threatens to derail several lives, and, of course, New Directions takes another crack at winning Regionals. As good as the stories and characters are, the best thing about', 'Glee', 'is the musical performances, and this season does not disappoint. Broadway-inspired numbers from shows like', 'Hairspray', ',', 'West Side Story', ', and', 'Dreamgirls', 'are passionately delivered right alongside classic rock and pop songs from bands such as Foreigner and Chicago and iconic artists like Michael Jackson and Whitney Houston. There are also plenty of songs made popular by contemporary artists like Coldplay, Katy Perry, Lady Gaga, Jason Mraz, and Taylor Swift. The special \"Extraordinary Merry Christmas\" episode takes the glee club back into the past when times were simpler and delivers a fine parody of 1950s-sitcom holiday specials with songs like \"Blue Christmas,\" \"Let It Snow,\" and \"My Favorite Things.\" The Michael Jackson-themed episode \"Michael\" celebrates the decades of musical contributions of an amazing artist, with songs ranging from \"Never Can Say Goodbye\" to \"I Just Can\\'t Stop Loving You\" and \"Black and White.\" The Whitney Houston-themed episode \"Dance with Somebody,\" aired just following Houston\\'s unexpected passing, pays tribute to a phenomenal artist with power-driven songs like \"Saving All My Love for You,\" \"I Wanna Dance with Somebody,\" and \"I Have Nothing.\" This season features some unexpected solos and vocal pairings for the regular cast; recurring roles for', 'Glee Project', 'winners Samuel Larsen (Joe Hart) and Damian McGinty (Rory Flanagan), and contestants Alex Newell (Wade) and Lindsay Pearce (Harmony); and an amazing list of guest artists, including Idina Menzel, Whoopi Goldberg, Brian Stokes Mitchell, Ricky Martin, Gloria Estefan, and Lindsay Lohan. The \"Jukebox\" special feature allows viewers to select and play the musical numbers from each episode. Other bonus features include a couple of deleted and extended scenes, a \"Glee Under the Stars\" interview session, the \"Glee Give a Note\" check presentation and student interviews from Culver City Middle School, and a behind-the-scenes look at the \"Props\" episode. Also offered are interviews with Glee\\'s newest cast members, backstage musings on the \"Goodbye\" episode, and a few choice words from Sue Sylvester. (Parental discretion advised due to mature themes)', '--Tami Horiuchi']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Matthew Morrison, Jane Lynch, Lea Michele, Cory Monteith', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '4098511098', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 1 minute', 'Release date': 'August 14, 2012', 'Actors': 'Lea Michele, Matthew Morrison, Cory Monteith, Jane Lynch', 'Subtitles': 'Spanish, French, English', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nWe have had so much fun watching all the old Glee episodes.... What a great show, they really introduce kids to a lot of old songs and it's a lot of fun.\nI Love Glee.\nGlee: Season 2\nCory Monteith  (Actor),     Lea Michele  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', \"Bring home the complete second season of TV's most exhilarating series! Despite their loss at the Regionals, the kids in New Directions are more motivated than ever. And whether it's Will doing a sexy tango with a substitute teacher (Gwyneth Paltrow), Sue joining the glee club, or everyone catching Bieber fever, the excitement at William McKinley High School is keeping everyone on their toes. With more incredible musical numbers, hugely popular guest stars like John Stamos, Carol Burnett and Kristin Chenowith and lots of behind-the-scenes special features, Glee Season 2 hits all the right notes.\", 'Amazon.com', \"With music that's arguably even better,\", 'Glee', 'also takes a dramatic turn in its second season, mixing some tough issues into its combination of musical performance and offbeat comedy. Most prominent is the topic of gay bullying, as Kurt (Chris Colfer) becomes the target of a macho football player. Around the same time, Kurt\\'s trip to scout a rival group from nearby Dalton Academy leads to the season\\'s most electric moment, a rendition of Katy Perry\\'s \"Teenage Dream\" by a men\\'s group called the Warblers, which became the show\\'s bestselling single ever, and the relationship between Kurt and the Warblers\\' lead singer, Blaine (Darren Criss), becomes the season\\'s heart. Other relationships develop and become complicated, involving Rachel (Lea Michele), Finn (Cory Monteith), Quinn (Dianna Agron), Artie (Kevin McHale), Brittany (Heather Morris), Santana (Naya Rivera), Puck (Mark Salling), Tina (Jenna Ushkowitz), and Mike (Harry Shum Jr.) as well as new additions Sam (Chord Overstreet) and Lauren (Ashley Fink). And the relationship between Will (Matthew Morrison) and Emma (Jayma Mays) runs into a roadblock in the person of a handsome dentist (John Stamos).', 'The season is an uneven one, losing steam with the Britney Spears tribute episode and some excruciating plot lines, then having slightly more success with themed episodes (', 'The Rocky Horror Picture Show', ', Christmas, and the cleverly handled episode involving Justin Bieber, of all people). Fresh energy came from the new students, guest star Gwyneth Paltrow as substitute teacher Holly Holliday, and new football coach Beiste (Dot-Marie Jones), who even inspires a temporary alliance between Will and Sue (Jane Lynch). The show relied less on Broadway tunes and more on classic rock and contemporary pop (Lady Antebellum, Queen, Fleetwood Mac, Lady Gaga) and even introduced its own original songs, the best of which (\"Get It Right,\" \"Loser Like Me\") are unveiled in the regionals. Morrison and Michele aren\\'t featured nearly as prominently as they were in the first season, but Michele still crushes her big numbers like \"Get It Right\" and Katy Perry\\'s \"Firework,\" and she participates in dazzling duets with Amber Riley (\"Take Me for What I Am\") and Agron (\"Unpretty/I Feel Pretty\"). Other showstopping moments from the season include Rivera\\'s \"Valerie,\" Rivera and Riley\\'s \"River Deep, Mountain High,\" Overstreet and Agron\\'s \"Lucky,\" Paltrow\\'s \"Forget You\" and \"Landslide,\" the group rendition of My Chemical Romance\\'s \"Sing,\" and almost anything by the Warblers (voiced by Tufts University\\'s Beelzebubs), especially Pink\\'s \"Raise Your Glass\" and Neon Trees\\' \"Animal.\" (Parental discretion advised due to mature themes)', '--David Horiuchi']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Matthew Morrison, Jane Lynch, Lea Michele, Cory Monteith', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 8 Ounces', 'Item model number': 'FOX2271868DVD', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 41 minutes', 'Release date': 'September 13, 2011', 'Actors': 'Cory Monteith, Lea Michele, Matthew Morrison, Jane Lynch', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nMy kids and I love watching this show, it's so much fun and such a wide array of music.... the characters are relate-able and fun.\nI love glee\nGlee: Season 1\nCharlotte Ross  (Actor),     Eve  (Actor),     John Scott  (Director),     Elodie Keene  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Join the club and bring home the fun with Glee Karaoke and Glee Jukebox -- available only on Blu-ray/DVD! A talented group of high school misfits transforms into a performing sensation with the help of a dedicated teacher. Through laughter, tears, irreverent humor and unforgettable music, they learn to follow their hearts and chase their dreams.']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Kristin Chenoweth, Chris Colfer, Matthew Morrison, John Scott, Josh Groban, Charlotte Ross, Dianna Agron, Lea Michele, Harry Shum Jr, Dijon Talton, Gregg Henry, Cory Monteith, Jessalyn Gilsig, Bill D'Elia, Kevin McHale, Jayma Mays, Eve, Jane Lynch, Elodie Keene, Naya Rivera, Amber Riley, Jenna Ushkowitz, Heather Morris, Mark SallingKristin Chenoweth, Chris Colfer, Matthew Morrison, John Scott, Josh Groban, Charlotte Ross, Dianna Agron, Lea Michele, Harry Shum Jr, Dijon Talton, Gregg Henry, Cory Monteith, Jessalyn Gilsig, Bill D'Elia, Kevin McHale, Jayma Mays, Eve, Jane Lynch, Elodie Keene, Naya Rivera, Am…  See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Surround), Spanish (Dolby Surround)', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': 'Glee Season 1', 'Director': \"John Scott, Elodie Keene, Bill D'Elia\", 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Release date': 'January 4, 2011', 'Actors': 'Charlotte Ross, Eve, Kristin Chenoweth, Josh Groban, Gregg Henry', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nMy whole family has had a blast watching this series, it's loads of fun with a wide array of songs.\nI love Glee\nDownton Abbey Seasons 1 & 2 Limited Edition Set - Original UK Version\nMaggie Smith  (Actor),     Hugh Bonneville  (Actor),     Julian Fellowes  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['The original and unedited UK version of Seasons 1 and 2 of the hit show', 'Downton Abbey', 'in one limited-edition boxed set.', 'Welcome to Downton Abbey, the splendid ancestral home of the Earl and Countess of Grantham (Hugh Bonneville and Elizabeth McGovern) and their daughters, who live there under the watchful eye of the Dowager Countess (Dame Maggie Smith). The household is a complicated community, with the servants below stairs as fiercely jealous of their ranks as anyone above. From the sinking of the Titanic to the First World War, the secure and ordered world of Downton is rocked as the lives of the inhabitants are shaped by romance, ambition, and heartbreak.   Enjoy this collection of both seasons of the Golden Globe® and multi-Emmy Award®-winning, Guinness World RecordTM-holding (highest critical review rating for a TV show), most talked-about program in recent memory, including the special Christmas episode.  This DVD set features subtitles in English (SDH).']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Hugh Bonneville, Elizabeth McGovern, Julian Fellowes, Maggie Smith', 'Number Of Discs': '6', 'Runtime': '15 hours', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.6 Ounces', 'Director': 'Julian Fellowes', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '15 hours', 'Release date': 'October 2, 2012', 'Actors': 'Maggie Smith, Hugh Bonneville, Elizabeth McGovern', 'Studio': 'PBS', 'Number of discs': '6'}\nMy whole family has loved this series, it has so much to offer, history, romance, my kids have learned a lot about what life was like back then, in a fun way.\nI love this show!\nMasterpiece Classic: Downton Abbey Season 3\nMaggie Smith  (Actor),     Bonneville, Hugh  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The Great War is over and a long-awaited engagement is on, but all is not tranquil at Downton Abbey as wrenching social changes, romantic intrigues, and personal crises grip the majestic English country estate for a third thrilling season. As other great houses are crippled psychologically and financially in the wake of World War I, Robert, Earl of Grantham, sticks to his duty to maintain Downton more firmly than ever. But in this changing landscape nothing is assured, and could it be that even the war-weary Crawleys must fight a new battle to safeguard their beloved Downton?  The returning cast includes Hugh Bonneville, Dame Maggie Smith, Elizabeth McGovern, Dan Stevens, Michelle Dockery, Jim Carter, Penelope Wilton, Joanne Froggatt, Brendan Coyle and a host of others, joined by Shirley MacLaine, who plays Martha Levinson, the very American mother of Cora, Countess of Grantham. Written and created by Julian Fellowes, Downton Abbey, Season 3 is a Carnival Films and Masterpiece co-production, in association with NBCUniversal.Includes the Downton Abbey Season 3 Finale, \"A Journey to the Highlands.\"', 'Amazon.com', 'The jewel in the', 'Masterpiece Classic', \"crown greets the 1920s with more history, romance--and dresses, gorgeous dresses. The old ways are changing, and the winds of social progress rustle through the well-appointed manor. Though war has ended, dark clouds gather as the Earl of Grantham (Hugh Bonneville) loses the family fortune to bad financial investments, the first of several shortsighted decisions on his part, making him the season's most unexpected villain--by contrast, even Mrs. O'Brien (Siobhan Finneran) doesn't seem so destructive. After his mother-in-law, Martha (Shirley MacLaine), arrives for the wedding of Mary (Michelle Dockery) and Matthew (Dan Stevens), Robert pins his hopes on the affluent American to bail them out. As expected, the tradition-minded Dowager Countess (Dame Maggie Smith) clashes with the thoroughly modern matron, who suggests they look elsewhere for a handout.\", 'While visiting from Dublin, Sybil\\'s husband, former chauffeur Tom Branson (Allen Leech, who really comes in to his own), clashes with most everyone until a tragedy helps to heal the political and religious divides, allowing him to more fully integrate into their world, a theme that runs throughout the year. Other conflicts revolve around Edith\\'s fiancé, Sir Anthony (Robert Bathurst), and the new footman, Alfred (Matt Milne), who strikes Thomas (Rob James-Collier) as a threat to his hegemony. Though Daisy (Sophie McShera) finds him appealing, Alfred prefers her kitchen colleague, Ivy (Cara Theobold), but she only has eyes for Jimmy (Ed Speleers), whom Mrs. Hughes (Phyllis Logan) aptly describes as \"vain and silly.\" In its third go-round, some storylines meander unnecessarily, like the saga of the fallen woman trying to reenter respectable society, but the multiple plotlines are always easy to follow, and', 'Downton', 'remains gloriously addictive. Abundant extra features examine every aspect of the production, including the tragic event that concludes the finale.', 'Kathleen C. Fennessy']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Smith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley MaclaineSmith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley Maclaine  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': '552840', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Maggie Smith, Bonneville, Hugh, Shirley Maclaine, Elizabeth McGovern', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '3'}\nThis series is amazing, a lot of great history mixed with romance and suspense it really has something to offer everyone.\nGreat show\nOuran High School Host Club: Complete Series\nCaitlin Glass  (Actor, Director),     Vic Mignogna  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Anime\n['Ouran High Scho C']\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '9536', 'Director': 'Caitlin Glass', 'Media Format': 'Multiple Formats, Animated, Box set, Color, NTSC', 'Run time': '10 hours and 50 minutes', 'Release date': 'May 15, 2012', 'Actors': 'Caitlin Glass, Vic Mignogna, J. Michael Tatum, Todd Haberkorn, Greg Ayres', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'Funimation Prod', 'Number of discs': '4'}\nThis is a great series. My daughter is obsessed with it. The artwork is very cool anime and the story is interesting.\nI love it.\nGilmore Girls: Season 4\nLauren Graham  (Actor),     Alexis Bledel  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['Product Description', 'Gilmore Girls: The Complete Fourth Season (Repackage)(DVD)', \"Season four marks a year of transitions for the Gilmores. Lorelai quits her job as manager of the Independence Inn, realizing her ambition of opening an inn of her own, The Dragonfly, with her best friend, Sookie. But various setbacks make renovating the new inn harder than Lorelai could have imagined. Lorelai & Sookie start a catering business to help pay for the expenses, made all the more difficult because Sookie is pregnant. Meanwhile, Rory is adjusting to her new life at Yale University, coping with the trials & tribulations that come with living at college. The stress of academia is bundled with having to handle her eccentric fellow students, especially her roommates, and the pressure of achieving her dream of becoming a journalist. All the while, the Gilmore girls still have to deal with Lorelai's parents every Friday night, the men of love lives past and the relationships of those who come in and out of Stars Hollow.\", ']]>', 'Amazon.com', 'The sum of its parts was definitely greater than the season whole as', 'Gilmore Girls', 'kicked off its fourth year by separating its high-powered mother-daughter duo. After years of toil at snooty private school Chilton, Rory (Alexis Bledel) was finally off to the greener pastures of college as she began her first year at Yale. The not-so-long distance put a crimp in her relationship with her mother, Lorelai (Lauren Graham), as the two were forced to continue their chatty conversations via phone--not exactly the same as trading barbs face-to-face. While Rory adjusted to college life with cranky roommate Paris (Liza Weil) in tow, Lorelai found herself without a daughter, but gained a boyfriend in the form of Jason \"Digger\" Stiles (Chris Eigeman), a childhood friend and now her father\\'s business partner. But the lure of Stars Hollow, the Gilmores\\' cherished country town, would prove too hard to resist, as Lorelai finally made plans to open her own inn, and the two ladies found themselves attracted to town residents--for Lorelai, an intensifying of her friendship with diner owner Luke (Scott Patterson), and for Rory, a return to old boyfriend Dean (Jared Padalecki), which put a decided tension into a show that sorely needed it. Nevermind that both men were married to other women!', 'The first half of the fourth season definitely foundered, as the show\\'s usually topnotch creative team struggled to find a way to keep the Gilmore chemistry afloat despite separating their main characters. There wasn\\'t much drama to be found for Rory in starting college, and though it got off to a great start, Lorelai\\'s relationship with Jason never fully gelled. However, once the show got its girls into the arms of their Stars Hollow men, it turned around almost immediately, surging towards a creative revival that put its ratings higher than they\\'d ever been before. Along the way to its surprising and complex season finale, there were great episodes to be had: \"Girls in Bikinis, Boys Doin\\' the Twist,\" which found Rory and Paris on spring break; \"The Reigning Lorelai,\" centering on an unexpected funeral; \"The Festival of Living Art,\" which had Stars Hollow resident re-creating classic works; and \"Luke Can See Her Face,\" which finally brought the Luke-Lorelai romance to the forefront. The season may have started out rough, but this fourth year ended with a bang, and the promise of more fireworks to come.', '--Mark Englehart']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Contributor': 'Daniel Palladino, Chris Eigeman, Edward Herrmann, Gavin Polone, Kelly Bishop, Yanic Truesdale, Sean Gunn, Liz Torres, Melissa McCarthy, Amy Sherman-Palladino, Alexis Bledel, Scott Patterson, Lauren Graham, Keiko Agena, Liza WeilDaniel Palladino, Chris Eigeman, Edward Herrmann, Gavin Polone, Kelly Bishop, Yanic Truesdale, Sean Gunn, Liz Torres, Melissa McCarthy, Amy Sherman-Palladino, Alexis Bledel, Scott Patterson, Lauren Graham, Keiko Agena, Liza Weil  See more', 'Language': 'Unqualified', 'Runtime': '15 hours and 59 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.4 Ounces', 'Item model number': '8064355240', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Run time': '15 hours and 59 minutes', 'Release date': 'June 16, 2009', 'Actors': 'Lauren Graham, Alexis Bledel, Melissa McCarthy, Scott Patterson, Keiko Agena', 'Subtitles': 'French', 'Producers': 'Amy Sherman-Palladino, Daniel Palladino, Gavin Polone', 'Studio': 'WarnerBrothers', 'Writers': 'Amy Sherman-Palladino', 'Number of discs': '6'}\nWe love this series. I can watch it a million times! It's a great series to watch with your teenage daughters.\nI love it.\nSpecial A: Complete Collection\nBlake Shepard  (Actor),     Monica Rial  (Actor),     Scott Gensch  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Boxed Sets, Anime\n[\"Until she was six, Hikari was always the best at everything she did. Right up until the moment she challenged Kei to a wrestling match and HE won. Ever since then, Hikari's entire life has revolved around beating Kei at something, ANYTHING! Unfortunately, a decade later, he's still the top student and athlete at their very exclusive high school and she's still SECOND best at everything. But what Hikari's never noticed is that he's actually in love with her! And that's only the beginning of the ridiculously convoluted web of relationships that ties the elite group of students who go by the name of the Special A together! Get ready for spring flings, split personalities and social (dys)functions galore as boy meets girl turns into boy beats girl in SPECIAL A - THE COMPLETE COLLECTION!\"]\n{'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 5.6 Ounces', 'Director': 'Scott Gensch', 'Media Format': 'Animated, Box set, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '10 hours and 50 minutes', 'Release date': 'July 16, 2013', 'Actors': 'Blake Shepard, Monica Rial', 'Subtitles': 'English', 'Studio': 'Section 23', 'Number of discs': '4'}\nGreat movie! We loved it! Characters are fun and interesting\nLove it\nBoys Over Flowers\nLee Min Ho  (Actor),     Kim Hyun Joong  (Actor)    Format: DVD\nMovies & TV, Movies\n['Geum Jan-Di comes from a poor family and she got admitted into the prestigious Shinhwa High School after stopping a Shinhwa student who was being bullied from committing suicide. Shinhwa High was established by Shinhwa Group, the biggest conglomerate in Korea , and is attended by the scions of the wealthiest families. Here she meets face-to-face with the notorious F4 members (Flower Four Boys), the four richest and most privileged students who reign over the entire school. Goo Jun-pyo is the leader of F4 and is also the heir of the Shinhwa Group. He issued a dreaded ‘red card’ to Jan-di and makes her life miserable after she humiliates him. The only person who seemed to have sympathy for her was Yoon Ji-hoo, one of F4 who saved her numerous times. However, Jun-pyo developed a feeling towards the spunky Jan-di, the first person ever in Shinhwa to declare war against the elitist F4! It turned out to be a twisted love triangle between Jan-di, Jun-pyo and Ji-hoo.']\n{'Format': 'NTSC, Subtitled, Import, Box set', 'Contributor': 'Lee Min Ho, Kim Hyun Joong, Kim Bum, Kim Joon, Gu Hye Sun', 'Language': 'Korean', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'NTSC, Subtitled, Import, Box set', 'Actors': 'Lee Min Ho, Kim Hyun Joong, Gu Hye Sun, Kim Bum, Kim Joon', 'Subtitles': 'Chinese, English', 'Studio': 'PMP Entertainment', 'Number of discs': '5'}\nreally, really fun to watch. it was incredibly refreshing and surprising!! love the main actress, she's so real and different from the types of girls cast in the US for sure. the story is so funny and awesome, loved it.\nSO MUCH LOVE\nBuilding Harmonica Technique Volume 1 & 2\nRated:    NR    Format: DVD\nMovies & TV, Musicals & Performing Arts, Independently Distributed\n[\"Designed to augment level 2 of David Barrett's Harmonica Masterclass Series, this video bridges the gap between what can be studied at home and what can only be learned in private lessons. Fantastic visuals and camera close-ups ensure that even the smallest details are seen. Topics include how to practice, holding the harmonica, memorizing the harp, and several lessons on embouchure, articulation, properties of a bend, draw bend embouchure, articulating the bend, blow bending, over-bends, vibrato types, music theory, 12-bar blues, and soloing scales.\"]\n{'Genre': 'Educational', 'Format': 'DVD', 'Contributor': 'Barrett, David', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '1.2 x 5.4 x 7.5 inches; 6.4 Ounces', 'Item model number': 'MLB99107DVD', 'Media Format': 'DVD', 'Run time': '2 hours and 27 minutes', 'Release date': 'February 16, 2006', 'Studio': 'Mel Bay Publications, Inc.', 'Number of discs': '1'}\nVery helpful loved it.\nlove it\nHiiro No Kakera ~ The Tamayori Princess Saga Season 1\nAndrew Love  (Actor),     Emily Neves  (Actor),     Steven Foster  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Anime & Manga\n[\"Every girl dreams of being an enchanted princess, but how many stop to think about all the grim and horrible things that happen in fairy tales? That's a lesson Tamaki learns all too graphically when she's attacked on the way to her grandmother's house by creatures she thought only existed in myths! Fortunately, she's rescued by an extraordinary young man: one who's not only part demon; but her future classmate as well, and one of the protectors that Tamaki will need if she's going to fulfill her destiny as a Tamayori princess. A destiny that no one's bothered to tell her she's inherited until now! And if it wasn't bad enough to learn that every plan she's had for the future has to change, to top it all off, Tamaki still has to start attending a new high school as well! The new girl in school will have to learn how to deal with some very, very old school-type problems in a hurry in Hiiro no Kakera ~ The Tamayori Princess Saga.\"]\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Steven Foster, Emily Neves, Andrew Love', 'Language': 'English, Japanese', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.93 Ounces', 'Director': 'Steven Foster', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '5 hours and 25 minutes', 'Release date': 'April 16, 2013', 'Actors': 'Andrew Love, Emily Neves', 'Subtitles': 'English', 'Studio': 'Sentai Filmworks', 'Number of discs': '3'}\nThe story was ok. I liked the art work but not a strong plot.\nokay.\nSupernatural: Season 2\nJared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'Supernatural: The Complete Second Season (DVD)', 'Twenty-two years ago, Sam and Dean Winchester lost their mother to a mysterious and demonic supernatural force, so their father, John, raised the brothers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America...and he taught them how to kill it. Sam, however, wanted nothing to do with this violent and dangerous life, and he left it behind, until the day Dean appeared on his doorstep with troubling news. Their father had gone missing on a \"hunting trip.\" Sam and Dean have spent the last year cruising the highways of the United States searching for their lost father and encountering creatures that most people believe exist only in folklore, superstition and nightmares. Along the way, they have battled the various supernatural threats--and each other as well, for their sibling rivalries and conflicts were never far from the surface.', ']]>', 'Amazon.com', 'As programs ranging from', 'Kolchak: The Night Stalker', 'to, well,', 'Night Stalker', \"have proven, it's difficult to scare TV audiences on a weekly basis, but\", 'Supernatural', 'seems to broken the trend. Not only has its blend of', 'Route 66', 'and', 'The X-Files', 'provided some of the more chilling TV moments in recent history, but its core story--two brothers, Sam and Dean Winchester (Jensen Ackles and Jared Padalecki) battle the forces of evil to avenge their late mother--has been compelling enough to warrant a second season, which is compiled in its entirety on this six-disc set. Season Two maintains the show\\'s \"Monster of the Week\" approach while adding compelling layers to the main characters and their history; in \"What Is And What Should Never Be,\" a djinn offers the boys a glimpse of how their lives might\\'ve played out had their mother not succumbed to demonic forces, while the two-part \"All Hell Breaks Loose\" brings the season to a close with not only a rift between Sam and Dean, but the gates of Hell swinging open to unleash monstrous spirits. And if that\\'s not enough of a creepshow for you, the boys also encounter a cannibal clown (\"Everybody Loves a Clown\"), seductive demons (\"Crossroad Blues\"), a town gripped by mass psychosis (\"Croatoan\"), as well as a barrage of ghosts, vampires and werewolves. If it\\'s chills you want, the second season of', 'Supernatural', \"has them by the score. There's also a wealth of extras on the\", 'Complete Second Season', 'set that should please longtime fans and help newcomers catch up with developments since the show\\'s debut. Informative and entertaining commentaries are featured on three episodes: \"In My Time of Dying\" (by Ackles and Padalecki), \"What Is And What Never Should Be\" (by series creator Eric Kripke), and \"All Hell Breaks Loose, Part 1\" (by Kripke, writer Sera Gambles, and director Robert Singer). There\\'s also a featurette on \"All Hell Breaks Loose Part 2\" that offers observations by the cast and crew on the season as a whole; viewers should note that the 11-minute short is difficult to find and is accessible only after accessing \"The Devil\\'s Road Map,\" a virtual tour of the places (and monsters) visited throughout the show\\'s history. Padalecki\\'s screen test for the role of Sam is also included, as well as three webisodes about the writers, visual effects and props for the show, and an amusing gag reel.', '-- Paul Gaita']\n{'Genre': 'Science Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & SuspenseScience Fiction & Fantasy, Horror, Drama, Mystery & Suspense/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Contributor': 'Jared Padalecki, Jensen Ackles', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.5 x 1.25 inches; 12 Ounces', 'Media Format': 'AC-3, Box set, Multiple Formats, Closed-captioned, Dolby, NTSC, Subtitled, Color, Widescreen', 'Run time': '15 hours and 3 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Jared Padalecki, Jensen Ackles', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese', 'Studio': 'WarnerBrothers', 'Number of discs': '6'}\nUgh, this show is not getting better. The plot is weak, the guys are shallow and stupid, lots of emaciated girls. That's about it. I do like the 80's music, that's about it.\nFull of starving girls.\nUnder the Dome: Season 2\nRachelle  LeFevre  (Actor),     Colin Ford  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['From executive producer Steven Spielberg and based on the best-selling novel by Stephen King, Under the Dome is the story of a small New England town that is suddenly and inexplicably sealed off from the rest of the world by an enormous transparent dome. The town’s inhabitants must deal with surviving the post-apocalyptic conditions while searching for answers to what this barrier is, where it came from and if and when it will go away.']\n{'Genre': 'Science Fiction & Fantasy/Television', 'Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Contributor': 'Alexander  Koch, Natalie  Martinez, Rachelle  LeFevre, Britt  Robertson, Dean  Norris, Colin Ford, Mike VogelAlexander  Koch, Natalie  Martinez, Rachelle  LeFevre, Britt  Robertson, Dean  Norris, Colin Ford, Mike Vogel  See more', 'Language': 'English', 'Runtime': '8 hours and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.92 Ounces', 'Item model number': '947922', 'Media Format': 'Multiple Formats, Box set, Color, Widescreen, NTSC', 'Run time': '8 hours and 52 minutes', 'Release date': 'December 19, 2017', 'Actors': 'Rachelle  LeFevre, Colin Ford, Dean  Norris, Britt  Robertson, Alexander  Koch', 'Subtitles': 'English, Spanish, Portuguese', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nSolid plot, the characters are okay, I'm just not that attached. I don't know why.\nIt's ok",
  "profile": "The user continues to prioritize family-friendly content that fosters empowerment and personal growth, particularly narratives appealing to their teenage daughters. Their recent interactions highlight a desire for engaging stories featuring strong, relatable characters infused with humor while addressing personal challenges. They've explored educational materials focused on personal development through music, reflecting their commitment to cultivating a well-rounded family skill set and encouraging meaningful discussions.\n\nWhile their preference leans towards entertainment that avoids excessive romance and mature themes, they recently interacted with a series that, despite darker elements, emphasizes family dynamics and sibling relationships, indicating a nuanced approach to content that balances entertainment with accessibility and relatability. \n\nTheir latest review of a series reveals a critical but open-minded stance; they appreciated certain aspects like the plot and overall quality but expressed a disconnect with the characters. This critique underscores their discerning taste while still maintaining an overarching objective of curating narratives that promote growth and joy for all family members. The user seeks diverse storytelling perspectives that resonate with strong family bonds and friendships, reinforcing their goal of inspiring educational viewing experiences for their family.",
  "metrics": {
    "rouge1_f": 0.03778221471356166,
    "rouge2_f": 0.004609002919035182,
    "rougeL_f": 0.020273383504837966,
    "meteor": 0.010027958324294248,
    "bleu1": 2.0956911100923886e-19,
    "bleu2": 9.040936565571223e-20,
    "bleu3": 2.520912549618726e-20,
    "bleu4": 7.495091358928342e-21,
    "bertscore_precision": 0.3075769543647766,
    "bertscore_recall": 0.5171250700950623,
    "bertscore_f1": 0.38572901487350464
  }
}