{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Glee: Season 1\nReview Date: 2013/03/14\nStore: Charlotte Ross  (Actor),     Eve  (Actor),     John Scott  (Director),     Elodie Keene  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Join the club and bring home the fun with Glee Karaoke and Glee Jukebox -- available only on Blu-ray/DVD! A talented group of high school misfits transforms into a performing sensation with the help of a dedicated teacher. Through laughter, tears, irreverent humor and unforgettable music, they learn to follow their hearts and chase their dreams.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Kristin Chenoweth, Chris Colfer, Matthew Morrison, John Scott, Josh Groban, Charlotte Ross, Dianna Agron, Lea Michele, Harry Shum Jr, Dijon Talton, Gregg Henry, Cory Monteith, Jessalyn Gilsig, Bill D'Elia, Kevin McHale, Jayma Mays, Eve, Jane Lynch, Elodie Keene, Naya Rivera, Amber Riley, Jenna Ushkowitz, Heather Morris, Mark SallingKristin Chenoweth, Chris Colfer, Matthew Morrison, John Scott, Josh Groban, Charlotte Ross, Dianna Agron, Lea Michele, Harry Shum Jr, Dijon Talton, Gregg Henry, Cory Monteith, Jessalyn Gilsig, Bill D'Elia, Kevin McHale, Jayma Mays, Eve, Jane Lynch, Elodie Keene, Naya Rivera, Am…  See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Surround), Spanish (Dolby Surround)', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': 'Glee Season 1', 'Director': \"John Scott, Elodie Keene, Bill D'Elia\", 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Release date': 'January 4, 2011', 'Actors': 'Charlotte Ross, Eve, Kristin Chenoweth, Josh Groban, Gregg Henry', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nReview Text: My whole family has had a blast watching this series, it's loads of fun with a wide array of songs.\nReview Title: I love Glee\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Barbie Diaries\nKelly Sheridan  (Actor),     Sarah Edmondson  (Actor),     Eric Fogel  (Director),     Kallen Kagen  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['It\\x92s a new school year and Barbie is hoping this year will be a little less ordinary. She loves hanging out with her best friends, playing with them in a band, working at the school TV station, and also has a crush on a boy. With a special diary and charm bracelet suddenly Barbie finds the courage to truly be herself, and exciting things start happening! Find out how fresh, fun, and exciting life can be in The Barbie Diaries!']\n{'Genre': 'Kids & Family, Animation', 'Format': 'Multiple Formats, Closed-captioned, Animated, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Kallen Kagen, Sarah Edmondson, Venus Terzo, Anna Cummer, Ashleigh Ball, Michael Daingerfield, Andrew Francis, Maryke Hendrikse, Heather Doerksen, Kelly Sheridan, Matt Hill, Chiara Zanni, Eric Fogel, Joseph MayKallen Kagen, Sarah Edmondson, Venus Terzo, Anna Cummer, Ashleigh Ball, Michael Daingerfield, Andrew Francis, Maryke Hendrikse, Heather Doerksen, Kelly Sheridan, Matt Hill, Chiara Zanni, Eric Fogel, Joseph May  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 10 minutes', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5 x 0.5 inches; 3.2 Ounces', 'Director': 'Eric Fogel, Kallen Kagen', 'Media Format': 'Multiple Formats, Closed-captioned, Animated, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 10 minutes', 'Release date': 'May 9, 2006', 'Actors': 'Kelly Sheridan, Sarah Edmondson, Venus Terzo, Chiara Zanni, Matt Hill', 'Studio': 'Lions Gate', 'Number of discs': '1'}\nA little mature for my seven year old, there was a lot of boy talk... I prefer the barbie movies that are more of an empowering theme.\nCute movie.\nBarbie in The Nutcracker\nKelly Sheridan  (Actor),     Kirby Morrow  (Actor),     Owen Hurley  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['The tale begins when Barbie™, playing the role of Clara, receives a beautiful wooden Nutcracker as a gift from her favorite aunt. That night, while Clara sleeps, the Nutcracker springs to life to ward off the evil Mouse King who has invaded Clara’s parlor. She awakes and aids the Nutcracker, but the Mouse King shrinks her by casting an evil spell. Clara and the Nutcracker set off on a spectacular adventure to find the Sugarplum Princess, the only one who can break the Mouse King’s evil enhancement. Barbie in the Nutcracker shows that, if you are kind, clever and brave, anything is possible…']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.56 x 5.28 x 7.51 inches; 2.72 Ounces', 'Director': 'Owen Hurley', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'October 5, 2010', 'Actors': 'Kelly Sheridan, Kirby Morrow, Tim Curry, Peter Kelamis, Christopher Gaze', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Producers': 'Jesyca C. Durchin, Jennifer Twiner McCarron', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'Hilary Hinkle, Linda Engelsiepen, Rob Hudnut', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLoved the music and the ballet, they really stayed true to the story. My daughter loved this movie, and we all enjoyed the music.\nGreat movie\nGlee: Season 3\nLea Michele  (Actor),     Matthew Morrison  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"Despite their loss at the Regionals, the kids in New Directions are more motivated than ever. And whether it's Will doing a sexy tango with a substitute teacher (Gwyneth Paltrow), Sue joining the glee club, or everyone catching Bieber fever, the excitement at William McKinley High School is keeping everyone on their toes. With more incredible musical numbers, hugely popular guest stars like John Stamos, Carol Burnett and Kristin Chenowith and lots of behind-the-scenes special features, Glee Season 2 hits all the right notes.\", 'Amazon.com', 'A musical comedy-drama TV series that gains momentum with each season,', 'Glee: The Complete Third Season', 'takes on complicated contemporary teen issues and explores them in a music-filled way that resonates with both teen and adult viewers. This eventful year at McKinley High School begins with the glee club New Directions recruiting more members, Coach Sue Sylvester running for congress, Blaine transferring to McKinley, and several original New Directions members finishing up their senior year. As graduation nears, Rachel and Kurt struggle through the application procedure to gain acceptance into their college choice NYADA, there are a couple of wedding proposals (one more unexpected than the other), and Santana examines her sexual orientation. Mike Chang struggles with parental expectations, Kurt and Blaine hit a rocky patch, and Mercedes finds herself at the center of an interesting love triangle. Coaches Sylvester and Beiste each reveal a whole new side of their personalities, a serious accident threatens to derail several lives, and, of course, New Directions takes another crack at winning Regionals. As good as the stories and characters are, the best thing about', 'Glee', 'is the musical performances, and this season does not disappoint. Broadway-inspired numbers from shows like', 'Hairspray', ',', 'West Side Story', ', and', 'Dreamgirls', 'are passionately delivered right alongside classic rock and pop songs from bands such as Foreigner and Chicago and iconic artists like Michael Jackson and Whitney Houston. There are also plenty of songs made popular by contemporary artists like Coldplay, Katy Perry, Lady Gaga, Jason Mraz, and Taylor Swift. The special \"Extraordinary Merry Christmas\" episode takes the glee club back into the past when times were simpler and delivers a fine parody of 1950s-sitcom holiday specials with songs like \"Blue Christmas,\" \"Let It Snow,\" and \"My Favorite Things.\" The Michael Jackson-themed episode \"Michael\" celebrates the decades of musical contributions of an amazing artist, with songs ranging from \"Never Can Say Goodbye\" to \"I Just Can\\'t Stop Loving You\" and \"Black and White.\" The Whitney Houston-themed episode \"Dance with Somebody,\" aired just following Houston\\'s unexpected passing, pays tribute to a phenomenal artist with power-driven songs like \"Saving All My Love for You,\" \"I Wanna Dance with Somebody,\" and \"I Have Nothing.\" This season features some unexpected solos and vocal pairings for the regular cast; recurring roles for', 'Glee Project', 'winners Samuel Larsen (Joe Hart) and Damian McGinty (Rory Flanagan), and contestants Alex Newell (Wade) and Lindsay Pearce (Harmony); and an amazing list of guest artists, including Idina Menzel, Whoopi Goldberg, Brian Stokes Mitchell, Ricky Martin, Gloria Estefan, and Lindsay Lohan. The \"Jukebox\" special feature allows viewers to select and play the musical numbers from each episode. Other bonus features include a couple of deleted and extended scenes, a \"Glee Under the Stars\" interview session, the \"Glee Give a Note\" check presentation and student interviews from Culver City Middle School, and a behind-the-scenes look at the \"Props\" episode. Also offered are interviews with Glee\\'s newest cast members, backstage musings on the \"Goodbye\" episode, and a few choice words from Sue Sylvester. (Parental discretion advised due to mature themes)', '--Tami Horiuchi']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Matthew Morrison, Jane Lynch, Lea Michele, Cory Monteith', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '4098511098', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 1 minute', 'Release date': 'August 14, 2012', 'Actors': 'Lea Michele, Matthew Morrison, Cory Monteith, Jane Lynch', 'Subtitles': 'Spanish, French, English', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nWe have had so much fun watching all the old Glee episodes.... What a great show, they really introduce kids to a lot of old songs and it's a lot of fun.\nI Love Glee.\nGlee: Season 2\nCory Monteith  (Actor),     Lea Michele  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', \"Bring home the complete second season of TV's most exhilarating series! Despite their loss at the Regionals, the kids in New Directions are more motivated than ever. And whether it's Will doing a sexy tango with a substitute teacher (Gwyneth Paltrow), Sue joining the glee club, or everyone catching Bieber fever, the excitement at William McKinley High School is keeping everyone on their toes. With more incredible musical numbers, hugely popular guest stars like John Stamos, Carol Burnett and Kristin Chenowith and lots of behind-the-scenes special features, Glee Season 2 hits all the right notes.\", 'Amazon.com', \"With music that's arguably even better,\", 'Glee', 'also takes a dramatic turn in its second season, mixing some tough issues into its combination of musical performance and offbeat comedy. Most prominent is the topic of gay bullying, as Kurt (Chris Colfer) becomes the target of a macho football player. Around the same time, Kurt\\'s trip to scout a rival group from nearby Dalton Academy leads to the season\\'s most electric moment, a rendition of Katy Perry\\'s \"Teenage Dream\" by a men\\'s group called the Warblers, which became the show\\'s bestselling single ever, and the relationship between Kurt and the Warblers\\' lead singer, Blaine (Darren Criss), becomes the season\\'s heart. Other relationships develop and become complicated, involving Rachel (Lea Michele), Finn (Cory Monteith), Quinn (Dianna Agron), Artie (Kevin McHale), Brittany (Heather Morris), Santana (Naya Rivera), Puck (Mark Salling), Tina (Jenna Ushkowitz), and Mike (Harry Shum Jr.) as well as new additions Sam (Chord Overstreet) and Lauren (Ashley Fink). And the relationship between Will (Matthew Morrison) and Emma (Jayma Mays) runs into a roadblock in the person of a handsome dentist (John Stamos).', 'The season is an uneven one, losing steam with the Britney Spears tribute episode and some excruciating plot lines, then having slightly more success with themed episodes (', 'The Rocky Horror Picture Show', ', Christmas, and the cleverly handled episode involving Justin Bieber, of all people). Fresh energy came from the new students, guest star Gwyneth Paltrow as substitute teacher Holly Holliday, and new football coach Beiste (Dot-Marie Jones), who even inspires a temporary alliance between Will and Sue (Jane Lynch). The show relied less on Broadway tunes and more on classic rock and contemporary pop (Lady Antebellum, Queen, Fleetwood Mac, Lady Gaga) and even introduced its own original songs, the best of which (\"Get It Right,\" \"Loser Like Me\") are unveiled in the regionals. Morrison and Michele aren\\'t featured nearly as prominently as they were in the first season, but Michele still crushes her big numbers like \"Get It Right\" and Katy Perry\\'s \"Firework,\" and she participates in dazzling duets with Amber Riley (\"Take Me for What I Am\") and Agron (\"Unpretty/I Feel Pretty\"). Other showstopping moments from the season include Rivera\\'s \"Valerie,\" Rivera and Riley\\'s \"River Deep, Mountain High,\" Overstreet and Agron\\'s \"Lucky,\" Paltrow\\'s \"Forget You\" and \"Landslide,\" the group rendition of My Chemical Romance\\'s \"Sing,\" and almost anything by the Warblers (voiced by Tufts University\\'s Beelzebubs), especially Pink\\'s \"Raise Your Glass\" and Neon Trees\\' \"Animal.\" (Parental discretion advised due to mature themes)', '--David Horiuchi']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Matthew Morrison, Jane Lynch, Lea Michele, Cory Monteith', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 8 Ounces', 'Item model number': 'FOX2271868DVD', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 41 minutes', 'Release date': 'September 13, 2011', 'Actors': 'Cory Monteith, Lea Michele, Matthew Morrison, Jane Lynch', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nMy kids and I love watching this show, it's so much fun and such a wide array of music.... the characters are relate-able and fun.\nI love glee\nGlee: Season 1\nCharlotte Ross  (Actor),     Eve  (Actor),     John Scott  (Director),     Elodie Keene  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Join the club and bring home the fun with Glee Karaoke and Glee Jukebox -- available only on Blu-ray/DVD! A talented group of high school misfits transforms into a performing sensation with the help of a dedicated teacher. Through laughter, tears, irreverent humor and unforgettable music, they learn to follow their hearts and chase their dreams.']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Kristin Chenoweth, Chris Colfer, Matthew Morrison, John Scott, Josh Groban, Charlotte Ross, Dianna Agron, Lea Michele, Harry Shum Jr, Dijon Talton, Gregg Henry, Cory Monteith, Jessalyn Gilsig, Bill D'Elia, Kevin McHale, Jayma Mays, Eve, Jane Lynch, Elodie Keene, Naya Rivera, Amber Riley, Jenna Ushkowitz, Heather Morris, Mark SallingKristin Chenoweth, Chris Colfer, Matthew Morrison, John Scott, Josh Groban, Charlotte Ross, Dianna Agron, Lea Michele, Harry Shum Jr, Dijon Talton, Gregg Henry, Cory Monteith, Jessalyn Gilsig, Bill D'Elia, Kevin McHale, Jayma Mays, Eve, Jane Lynch, Elodie Keene, Naya Rivera, Am…  See more\", 'Language': 'English (Dolby Digital 5.1), French (Dolby Surround), Spanish (Dolby Surround)', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': 'Glee Season 1', 'Director': \"John Scott, Elodie Keene, Bill D'Elia\", 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Release date': 'January 4, 2011', 'Actors': 'Charlotte Ross, Eve, Kristin Chenoweth, Josh Groban, Gregg Henry', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nMy whole family has had a blast watching this series, it's loads of fun with a wide array of songs.\nI love Glee",
  "profile": "The user maintains a strong preference for family-friendly animated movies and uplifting content that emphasizes empowerment and personal growth. They value narratives that foster friendship and enrichment for both themselves and their child, consistently opting for age-appropriate material while avoiding excessive romantic themes or mature content. \n\nRecently, their enthusiasm for a TV series with musical elements highlights their appreciation for musicality and storytelling that provides both entertainment and educational value. Their latest review underscores satisfaction with content that features fun, relatable characters and a variety of music, which they enjoy watching with their children.\n\nThe user has rated their recent purchase highly, reflecting a balance between quality and entertainment that aligns with their values. Their preference for shows that deliver strong, positive messages continues to guide their selection of family-oriented films and series. With a focus on enriching experiences that resonate with both adults and children, they prioritize content that is not only enjoyable but also fosters a sense of community and personal connection through music and relatable storytelling.",
  "metrics": {
    "rouge1_f": 0.07629427792915533,
    "rouge2_f": 0.008570315543435918,
    "rougeL_f": 0.04126119112495134,
    "meteor": 0.019841016874898216,
    "bleu1": 1.3814684032753916e-08,
    "bleu2": 5.235784789657913e-09,
    "bleu3": 1.6144027338846084e-09,
    "bleu4": 5.048105822857817e-10,
    "bertscore_precision": 0.30749452114105225,
    "bertscore_recall": 0.4932694435119629,
    "bertscore_f1": 0.3788323700428009
  }
}