{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Haywire\nReview Date: 2012/10/14\nStore: Carano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Directed by Oscar® winner* Steven Soderbergh (', 'Contagion', '), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,', 'HAYWIRE', 'is explosive movie entertainment.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'MFR031398152156#VG', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: When I rented movie I was thinking maybe I wasted my money.but after I started watching it ,wow was I wrong.gina carano was smoking hot and acting was not that bad.very good fight scenes.plot a little weak,but still a good flick.\nReview Title: Worth watching\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Columbo - The Complete Second Season\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', '\"Oh, there\\'s just one more thing….\" Everyone\\'s favorite cigar-chomping, trenchcoat-wearing Police Lieutenant is back on DVD asking all the right questions in all 8 thrilling episodes of the Complete Second Season of Columbo. Join five-time Emmy winner Peter Falk as wry and ruffled Lieutenant Columbo as he solves L.A.\\'s most puzzling crimes with his trademark wit and style. Along for the chase are a dazzling lineup of Hollywood\\'s brightest stars including Robert Culp, Valerie Harper, Dean Stockwell, Leonard Nimoy, Martin Landau, Marc Singer and more. In the smart, funny and exciting Second Season of Columbo, it\\'s no mystery to see why this is the DVD series that mystery lovers have been waiting for!', ']]>', 'Amazon.com', 'Armchair sleuths, get out your trenchcoats: Universal has released the sophomore season (1972-73) of the classic detective series', 'Columbo', \", starring Peter Falk as the sage but rumpled police lieutenant. As with the first season, there's plenty of star power in front of and behind the camera to abet Falk in these eight 90- and 120-minute episodes: John Cassavetes stars in the season premiere,\", 'Etude in Black', ', as a philandering symphony conductor, with Blythe Danner and Hollywood legend Myrna Loy in support; Oscar winner Ray Milland is a scheming orchid grower in \"The Greenhouse Jungle,\" co-starring Bradford Dillman and William Smith; Robert Culp and Dean Stockwell are a football team manager and owner, respectively, whose disagreements blossom into murder in \"The Most Crucial Game\"; and Jeanette Nolan offers stellar comic relief in \"Double Shock,\" which features Martin Landau as identical twins--one of whom has murdered their uncle. Performances by Richard Basehart, Laurence Harvey, Leonard Nimoy, Anne Francis, Anne Baxter, and Mel Ferrer also highlight the season; direction by small-screen stalwarts like Boris Sagal, Jeremy Paul Kagan, and Nicholas Colasanto (\"Coach\" on', 'Cheers', ') and scripts by Stephen Bochco also bring quality and style to the proceedings. Sadly, no extras are available in this five-disc set, but the stellar image and sound quality (and lack of commercials) should appeal to series fans and newcomers alike.', '--Paul Gaita']\n{'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Peter Falk', 'Language': 'Unqualified, Unknown (Dolby Digital 2.0), English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 6 x 1 inches; 1.6 Ounces', 'Item model number': '2220369', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '10 hours and 41 minutes', 'Release date': 'March 8, 2005', 'Actors': 'Peter Falk', 'Subtitles': 'English, Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '4'}\nTo start off I love colu.mbo,and my dvd even though used it looked new and played great.overall a-1.this is one of my favo.rite seasons of columbo\nGreat\nAirwolf: Season 2\nJan-Michael Vincent  (Actor),     Ernest Borgnine  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Product Description', \"Get ready to take off for action and adventure as all 22 one-hour episodes of Airwolf Season Two soar on to a spectacular five-disc DVD set for the first time ever! Cruise the skies once again with Airwolf, the cutting-edge, high-tech surveillance and defense helicopter of the future, and Stringfellow Hawke (Jan-Michael Vincent), its reclusive renegade pilot, as they touch down on dangerous secret missions from Afghanistan to the jungles of Central America. From drug runners to dambreakers to demented businessmen, there's no one who can hide from the Airwolf team's high-tech gadgetry and fighting power. Co-starring Ernest Borgnine and Alex Cord, this suspenseful and daring Emmy-nominated series from TV producer Donald P. Bellisario (Magnum P.I., Quantum Leap) is sure to be a thrill-ride fans won't want to leave!\", 'Amazon.com', 'Jan-Michael Vincent stars in', 'Airwolf', \"as Stringfellow Hawke, who, with trusty sidekick Dominic Santini (Ernest Borgnine), embarks on perilous missions for a top secret agency known as The Firm, which in turn allows him fairly free rein as he searches for his long lost brother. Vincent, then 40 years old, was still a year or two away from ruining his career with substance abuse problems, but his work here is hardly of Emmy-winning caliber; indeed, it's a lazy performance pretty much devoid of emotional resonance. Borgnine, on the other hand, is always reliable, but even the former Oscar winner (in 1955, for\", 'Marty', \") can't overcome\", 'Airwolf', \"'s procession of cardboard characters (especially the villains) and credulity-challenging scripts, which find our heroes traveling to a Laotian prison camp, battling nuclear terrorists in California, rescuing the president of a South American banana republic, investigating a religious cult, fending off jungle cats kept on a Texas hunting ranch, and saving a country singer from the nefarious machinations of her manager-husband, among other silliness. In fairness, creator-executive producer Donald Bellisario (who also brought us\", 'Magnum, P.I.', ',', 'Quantum Leap', ', and', 'JAG', ') and his team make an effort to inject a human element; there\\'s an episode in which Dominic is arrested for murdering his faithless wife, and a couple that find the guilt-ridden Hawke searching for his brother, Saint John (pronounced \"Sinjin\"), who was presumed lost during the Vietnam War when Stringfellow left him in the jungle. What\\'s more, considering its relatively ancient pedigree, technology-wise, the effects work isn\\'t bad, and there are some cool moments when the Airwolf helicopter does what it does best (i.e., blow stuff up).', \"It's unlikely that anyone will fondly look back at\", 'Airwolf', \"as one of television's finest moments. That doesn't mean that this five-disc set containing all 22 episodes from the series' second season (1984-85) won't find an audience eager to re-live the adventures of a super high-tech helicopter and the renegade flyboy who pilots it (heck, even\", 'Knight Rider', \", featuring David Hasselhoff and his talking car, has its adherents). Nonetheless, low expectations are definitely in order for anyone who wasn't, say, ten years old when the show was on the air.But overall, the show lacks a strong vibe, a recognizable sense of style and pace to draw viewers in and make believers out of us. Not terrible, not terrific,\", 'Airwolf', 'is just sort of there.', '--Sam Graham']\n{'Genre': 'Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Contributor': 'Jan-Michael Vincent, Ernest Borgnine', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '17 hours and 42 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 10.4 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Run time': '17 hours and 42 minutes', 'Release date': 'December 26, 2006', 'Actors': 'Jan-Michael Vincent, Ernest Borgnine', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nWell I liked airwolf way back then,and I still like it even now.and I think adding jean bruce scott was a plus for the show.overall a very good show cannot say the same for season 4 when it had a new cast and network.thanks\ngreat\nHaywire\nCarano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Directed by Oscar® winner* Steven Soderbergh (', 'Contagion', '), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,', 'HAYWIRE', 'is explosive movie entertainment.']\n{'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'MFR031398152156#VG', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhen I rented movie I was thinking maybe I wasted my money.but after I started watching it ,wow was I wrong.gina carano was smoking hot and acting was not that bad.very good fight scenes.plot a little weak,but still a good flick.\nWorth watching",
  "profile": "**User Profile Summary:**\n\n- **Interest in Classic Television and Action:** The user maintains a robust preference for classic detective and action series, with a particular fondness for vintage productions that evoke nostalgia. Their recent engagement with high-energy action films reinforces their appreciation for dynamic storytelling.\n\n- **Value for Quality and Performance:** The user consistently seeks high-quality media, showcasing discernment in their ratings for DVD condition and cinematic performance. This dedication to quality extends across both classic and contemporary content.\n\n- **Enjoyment of Mystery, Suspense, and Action:** The user delights in genres that require critical thinking and offer suspenseful narratives. Their passion for action-adventure series is evident, especially those intertwining elements of mystery with exciting plots.\n\n- **Celebration of Star Power:** Productions featuring renowned actors significantly enhance the user's viewing experience. Their preference for recognizable talent continues to shape their media choices.\n\n- **Positive Nostalgia and Revisiting Favorites:** The user finds joy in rewatching beloved series and films, indicating a strong inclination to revisit content that resonates with them.\n\n- **High Ratings and Reviews:** The user maintains high standards for their media selections, evident from their consistently positive ratings and thoughtful reviews, even when acknowledging occasional plot weaknesses.\n\nIn summary, the user enjoys both classic storytelling and high production quality, takes pleasure in revisiting nostalgic series and films, and continues to explore a variety of engaging genres, especially those with strong action and suspense elements.",
  "metrics": {
    "rouge1_f": 0.13325867861142218,
    "rouge2_f": 0.011210762331838564,
    "rougeL_f": 0.06606942889137737,
    "meteor": 0.0378451740878008,
    "bleu1": 0.0008488888559292301,
    "bleu2": 0.0002358422125763977,
    "bleu3": 3.437907818679852e-05,
    "bleu4": 1.313724559728363e-05,
    "bertscore_precision": 0.3526584506034851,
    "bertscore_recall": 0.47782474756240845,
    "bertscore_f1": 0.4058093726634979
  }
}