{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Rebecca\nReview Date: 2016/04/03\nStore: Diana Rigg, Charles Dance, Faye Dunaway, Emilia Fox  (Actor),     Jim O'Brien  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Based on the gothic romance novel by Daphne Du Maurier. Starring Anthony Bate.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Drama/Television, Television/British Television', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': \"Jim O'Brien, Diana Rigg, Charles Dance, Faye Dunaway, Emilia Fox\", 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': '2258437', 'Director': \"Jim O'Brien\", 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours', 'Release date': 'February 25, 2003', 'Actors': 'Diana Rigg, Charles Dance, Faye Dunaway, Emilia Fox', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: So, I love this story anyway and have read it several times. Very good. This is a good film adaptation of it. Recommended!\nReview Title: Good adaptation!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Basic Yoga Workout for Dummies VHS\nSara Ivanhoe  (Actor)    Rated:    NR    Format: VHS Tape\nMovies & TV, Yoga, General\n['Product Description', 'Anyone can do yoga with this step-by-step instruction of the 12 essential yoga postures. Hosted by Sara Ivanhoe, \"Basic Yoga Workout For Dummies\" is a simple introduction to the physical and spiritual rewards of beginning yoga.', 'Amazon.com', 'A workout that balances both the body and the mind can be found in the', 'Basic Yoga Workout for Dummies', '. Fundamental postures are explained and demonstrated slowly with an emphasis on breathing and motion. Sara Ivanhoe teaches 12 basic poses that are termed the \"daily dozen\" and offers challenges and modifications to each of these moves. Ivanhoe presents these concepts in an approachable and calming manner that adds to the overall relaxed feeling that this session exudes. Newcomers to the practice of yoga will learn jargon, essential postures, and focusing techniques. Experienced participants may find some information redundant, but Ivanhoe offers such thorough explanations about each posture that you can\\'t help but expand your existing knowledge of yoga. As the mountain pose, standing forward bend, and downward facing dog are explained (not to mention the nine other poses within the \"daily dozen\"), proper body alignment becomes the focus. Meticulous attention is given to the connection between breathing and body movement with several reminders to keep the spine in \"neutral alignment.\" This session ranks great for safety and content and makes yoga accessible to anyone who \"always wanted to, but never did.\" This is a substantial program that can introduce the basics and build your understanding of yoga.', '--Olivia Voigts']\n{'Package Dimensions': '7.5 x 3.9 x 1.2 inches; 7.36 Ounces', 'Run time': '45 minutes', 'Release date': 'November 14, 2000', 'Date First Available': 'September 29, 2006', 'Actors': 'Sara Ivanhoe', 'Studio': 'Starz / Anchor Bay'}\nThis was one of the first yoga videos that I bought and I really learned a lot from it.  Yes, it is somewhat talky but a beginner really needs to know all the things that Sara Ivanhoe talks about.  Proper form and execution of the poses is a crucial part of yoga, in order to get the most benefits from the practice and to prevent unnecessary injuries.  Several key poses are shown in this video that can be built upon as your practice increases.  They are very nicely described too, so that a beginner can start a yoga practice doing it right.  I like that about this video.<br />I have moved on to other, more complex videos now but I still like to come back to this one once in a while just to get back in touch with the basics.  It is a good yoga workout and I would recommend it to anyone wanting to get acquainted with yoga or just wanting a gentle yoga routine on hand!\nGreat video to start yoga with!\nBeyond Basic Yoga for Dummies [VHS]\nSara Ivanhoe  (Actor)    Rated:    Unrated    Format: VHS Tape\nMovies & TV, Yoga, General\n{'Genre': 'Exercise_&_fitness_-_yoga', 'Format': 'NTSC', 'Contributor': 'Sara Ivanhoe', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.3 x 4.2 x 1.1 inches; 5.6 Ounces', 'Run time': '56 minutes', 'Release date': 'September 24, 2002', 'Date First Available': 'September 29, 2006', 'Actors': 'Sara Ivanhoe', 'Studio': 'Starz / Anchor Bay'}\nSara Ivanhoe presents another good, effective yoga workout.  This one is only a slight bit tougher than the first Dummies video but it is worth having.  It seems to be assumed that the viewer has been doing the first video faithfully and has developed more flexibility and balance.  It uses both quite a bit more than the first video did.  It is a good workout and Sara Ivanhoe talks you through it like in the first one.<br />This video is a great addition to any yoga video library!\nA step up from the basics; nice video!\nElf (DVD)\nJon Favreau  (Director),     Leon Redbone  (Actor),     Will Ferrell  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', \"This hilarious Christmas film tells the tale of a young orphan child who mistakenly crawls into Santa's bag of gifts on Christmas Eve and is transported back to the North Pole and raised as an elf. Years later Buddy learns he is not really an elf and goes on a journey to New York City to find his true identity.\", 'DVD Features:', 'Audio Commentary:', '2 commentaries with Will Ferrell & Director', 'DVD ROM Features', 'Deleted Scenes', 'Featurette:', 'Film school for kids Tag along with Will Ferrell How they made the North Pole Kids on Christmas and more!', 'Amazon.com', 'Elf', 'is genuinely good. Not just', 'Saturday Night Live', '-movie good, when the movie has some funny bits but is basically an insult to humanity;', 'Elf', 'is a smartly written, skillfully directed, and deftly acted story of a human being adopted by Christmas elves who returns to the human world to find his father. And because the writing, directing, and acting are all genuinely good,', 'Elf', 'is also genuinely funny. Will Ferrell, as Buddy the adopted elf, is hysterically sincere. James Caan, as his rediscovered father, executes his surly dumbfoundedness with perfect aplomb. Zooey Deschanel, as a department store worker with whom Buddy falls in love, is adorably sardonic. Director Jon Favreau (', 'Swingers', \") shepherds the movie through all the obligatory Christmas cliches and focuses on material that's sometimes subtle and consistently surprising. Frankly,\", 'Elf', 'feels miraculous. Also featuring Mary Steenburgen, Bob Newhart, Peter Dinklage, and Ed Asner as Santa Claus.', '--Bret Fetzer']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 6.4 Ounces', 'Item model number': 'NEWL7168DVD', 'Director': 'Jon Favreau', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 35 minutes', 'Release date': 'October 24, 2006', 'Actors': 'Leon Redbone, Will Ferrell, James Caan, Ray Harryhausen, Zooey Deschanel', 'Dubbed': 'Spanish', 'Subtitles': 'English, Korean, French, Thai, Portuguese, Spanish, Indonesian', 'Producers': 'Jon Berg, Toby Emmerich, Kent Alterman, Todd Komarnicki, Cale Boyter', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Studio': 'WarnerBrothers', 'Writers': 'David Berenbaum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOkay, I will admit that this movie is a bit on the corny side but sometimes, you just need something corny.  Will Ferrell does a bang job with this character - Buddy the Elf.  He is just so nice that you can't HELP but like him.  He only tries to do good and help people but it backfires sometimes and he ends up feeling like he doesn't fit in anywhere.  This is a movie that I could watch every holiday season, right along with Christmas in Connecticut, Love Actually and The Bishop's Wife.  I thought it was delightful and something I could watch with my nephew and not think twice.  Yes, it is corny but it really is funny too and well worth renting!\nIt IS a bit corny but really good - a Christmas classic!\nGift of Love\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['Amazon.com', \"Inspired by O. Henry's short story about a young bride and groom, each of whom foolishly--but quite lovingly--sacrifices a treasured possession to buy the perfect Christmas gift for their mate. Amid a flurry of bustling New Yorkers clad in early-20th-century garb, O. Henry himself (David Wayne) sets the scene: Beth, a teenage orphan (Marie Osmond), comes to live with her wealthy aunt and uncle (the latter played by Donald Moffat). Her friendship with a cheerful kitchen maid soon leads to a stormy encounter with a handsome Swiss immigrant, Rudy (Timothy Bottoms). Despite Beth and Rudy's conflicting social statuses, and Beth's arranged engagement to a sickly bird watcher (a young James Woods, who truly fits the bill), the two fall in love and miraculously overcome these obstacles--all in about 95 minutes. Old-fashioned romance, elegant costumes, and a happy ending make this predictable story completely irresistible to those who love a good fairy tale--or to Osmond fans who fondly remember watching the movie on TV in 1978. Produced by the Osmond Brothers for PBS's\", 'American Short Story', 'series.', '--Liane Thomas']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Item model number': '1002756564', 'Release date': 'November 11, 1998', 'Date First Available': 'February 9, 2007', 'Actors': 'Osmond, Bottoms, Woods, Lockheart', 'Studio': 'Monterey Video'}\nI will admit that I heaved a sigh of disappointment when I saw Marie Osmond step out of the carriage.  However, she quickly won me over and I loved every minute of this film after that.  This story is wonderfully touching and in the end, their gifts to one another are funny but really felt.  You KNOW that they are gifts from the heart.  This movie really is about love at Christmastime and the actors in this version couldn't have been better chosen.  They all do a great job and I would recommend this film to anyone!  I plan to watch it time and again!\nReally, REALLY good... a definite MUST SEE!\nDaisy Miller [DVD]\nCybill Shepherd  (Actor),     Barry Brown  (Actor),     Peter Bogdanovich  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Paramount Home Entertainment, Classics\n['An adaptation of the Henry James novella of the same name, DAISY MILLER stars Cybill Shepherd as the title character, a beautiful American girl whose headstrong ways create quite a stir in European society during the 1800s. Drawn to European aristocrat Frederick Winterbourne (Brown) and the suave Italian Mr. Giovanelli (Del Prete), Daisy\\x92s American ways slowly clash with continental etiquette and concern her mother, Ms. Ezra B. Miller (Leachman), who tries to persuade her to act more like a proper lady. Ultimately snubbed by Roman high society, Daisy\\x92s un-ladylike conduct eventually ends in tragedy.']\n{'Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Albert Messmer, George Morfogen, Mildred Natwick, Nicholas Jones, Frederic Raphael, Jean-Pascal Bongard, Jacques Guhl, Cloris Leachman, Duilio Del Prete, Peter Bogdanovich, Eileen Brennan, James McMurtry, Cybill Shepherd, Henry James, Barry BrownAlbert Messmer, George Morfogen, Mildred Natwick, Nicholas Jones, Frederic Raphael, Jean-Pascal Bongard, Jacques Guhl, Cloris Leachman, Duilio Del Prete, Peter Bogdanovich, Eileen Brennan, James McMurtry, Cybill Shepherd, Henry James, Barry Brown   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 31 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.01 Ounces', 'Director': 'Peter Bogdanovich', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'August 12, 2003', 'Actors': 'Cybill Shepherd, Barry Brown, Cloris Leachman, Mildred Natwick, Eileen Brennan', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Frederic Raphael, Henry James', 'Number of discs': '1'}\nLet me start by saying that I LOVE films like this.  I watch them all the time and rarely dislike one.  This is a time though.  This movie was about as annoying as a movie could get.  Daisy (Cybil Shepard) is rambly, talks too much, is disrespectful, flirtatious, and hasn't one bit of class.  With no disrespect at all to Henry James, the story has no substance.  He kills her off in what seems like an effort to avoid letting us know if she actually is a wild one or is innocent, as Winterbourne wants to believe.  I guess we will never know... not from this version anyway!  It is just an annoying film and Ms. Shepard does nothing to make it better.  Avoid this one....\nnot worth your time....\nThe Girl in the Cafe\nBill Nighy  (Actor),     Kelly Macdonald  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', \"He's a shy civil servant (Bill Nighy, Love Actually) working for the British delegation to the 2005 G8 Summit. She's an alluring young woman (Kelly McDonald, Finding Neverland) he meets at a cafe - and invites her to the Summit on a whim. Together, this unlikely couple might just change history.\", 'DVD Features:', 'Audio Commentary', 'Deleted Scenes', 'Featurette', 'Amazon.com', 'As a pop star on the comeback trail, Bill Nighy handily stole', 'Love Actually', 'away from his more famous co-stars. In BBC/HBO co-production', 'The Girl in the Café', ', he takes the lead--and runs with it. Written by Richard Curtis (', 'Notting Hill', '), the offbeat political-romance concerns Lawrence, a 57-year-old Londoner with a successful governmental career and nonexistent social life. One day he stops in a café and meets the mysterious, considerably younger Gina (Kelly Macdonald,', 'Trainspotting', '). To their mutual amazement, they hit it off and agree to meet again (and yet again). Then he invites her to accompany him to the G8 Summit in Reykjavík, where she upends his carefully ordered world in ways both wonderful and terrible. Suddenly this \"man who has nothing in his life but his work\" must find a way to make room for something \"tender and true.\" With Corin Redgrave as the Prime Minister.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Romance', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Federico Zanni, Kelly Macdonald, Richard Curtis, Damon Younger, Meneka Das, Anton Lesser, Ken Stott, Philippe De Grossouvre, David Yates, Paul Ritter, Nna Dgg Filippusdttir, Bill Nighy, Penny Downie, Marit Velle KileFederico Zanni, Kelly Macdonald, Richard Curtis, Damon Younger, Meneka Das, Anton Lesser, Ken Stott, Philippe De Grossouvre, David Yates, Paul Ritter, Nna Dgg Filippusdttir, Bill Nighy, Penny Downie, Marit Velle Kile  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': 'Unknown', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'David Yates', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 6, 2009', 'Actors': 'Bill Nighy, Kelly Macdonald, Meneka Das, Anton Lesser, Paul Ritter', 'Subtitles': 'English, Spanish, French', 'Studio': 'HBO Studios', 'Writers': 'Richard Curtis', 'Number of discs': '1'}\nThis movie is more of a humanitarian story than it is a love story but it is powerful.  Admittedly, it is a bit predictable, which detracts from it.  But, it is good, powerful and the message is undeniable.  Bill Nighy is, as always, VERY good in this movie.  He has an on-screen presence that is incredible in whatever roll he takes on.  Great movie with a bit of mystery and a great moral.\nA bit predictable but a strong message...\nLadies in Lavender\nTimothy Bateson  (Actor),     Geoffrey Bayldon  (Actor),     Charles Dance  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Starring Academy Award winners Judi Dench and Maggie Smith, Ladies in Lavender is a heartwarming film about two sisters who find their lives changed by a young man, Andrea, (Daniel Brühl, The Edukators, Good Bye Lenin!) who has been washed ashore and badly injured. Upon taking him in, his presencequietly invokes Ursula's (Dench) abandoned feelings of longing and Janet's (Smith) maternal instincts, while also arousing suspicion and fear in the township during pre-war times in Europe. But throughout Andrea's stay, the two sisters discover his true origins, his talents as a gifted violinist and embark on a journey they had never imagined for themselves.\"]\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Scala Productions; Tale Partnerships, Freddie Jones, Clive Russell, Natascha McElhone, Daniel Bruhl, Judi Dench, Charles Dance, Maggie Smith, Nik Powell, Miriam Margolyes, David Warner, Elizabeth Karlsen, Geoffrey Bayldon, Timothy BatesonScala Productions; Tale Partnerships, Freddie Jones, Clive Russell, Natascha McElhone, Daniel Bruhl, Judi Dench, Charles Dance, Maggie Smith, Nik Powell, Miriam Margolyes, David Warner, Elizabeth Karlsen, Geoffrey Bayldon, Timothy Bateson  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.88 Ounces', 'Item model number': 'CTR13106DVD', 'Director': 'Charles Dance', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'December 6, 2005', 'Actors': 'Timothy Bateson, Geoffrey Bayldon, Daniel Bruhl, Freddie Jones, Clive Russell', 'Subtitles': 'English', 'Producers': 'Nik Powell, Elizabeth Karlsen', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nJudi Dench has a presence on screen that makes any movie she stars in well worth seeing.  This is no exception.  This movie is very innocent and simple but has a tender undertone.  The two ladies are stark contrasts to one another and really lend an intriguing dimension to the film.  Great flick.  Must see!\nA gem of a movie... refreshing!\nQuick Fix - Core Yoga Workout VHS\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Yoga, General\n['Amazon.com', 'Quickfix: Core Yoga', 'presents a short but effective workout that participants of all fitness levels can approach with ease. This 30-minute format is divided into three 10-minute sessions that focus on the basic practice of yoga. A series of sun salutations kick off the first segment, while the other two sets concentrate on strength and flexibility enhancing poses. The lower back, abdominals, and hamstrings receive intensive lengthening in both floor and standing postures. Each asana is shown in a modified form for anyone with a compromised range of motion or limited yoga familiarity. The instruction is informative and the music is not intrusive, so first-time students can collect the information that they need to execute each posture correctly without confusion. Breathing is touched upon briefly, but beginners may need more consistent reminders to maintain breath.', 'Core Yoga', 'is just that: a nuts-and-bolts course that addresses the fundamentals of movement and alignment in a limited amount of time.', '--Olivia Voigts']\n{'Language': 'English', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 7.36 Ounces', 'Release date': 'July 12, 2001', 'Date First Available': 'September 29, 2006', 'Actors': 'Quick Fix', 'Studio': 'Peter Pan'}\nI found a copy of this at a local thrift store and have been slacking on my yoga practice and thought a short pick-me-up would help.  This tape is nice and, even though it is short, it has some really good postures included in it.  Doing all three segments would be ideal and a nice little practice but even if you only do one of the 10-minute segments, it is better than nothing and you will feel results.  The instructor is a bit on the annoying side but her instructions are clear and easy to follow.  There is nothing overbearing or over-the-top to this tape; just clear-cut, to the point asanas.  This would be great for beginners or people who are trying to get back into their practice like I am.  I liked it and it was well worth the $1.99 I paid for it at the thrift store.  :)  Namaste.\nGood for beginners or a light workout\nCranford (2007) (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'Cranford (2007) (DVD)', 'The BBC drama series adapted from Mary Gaskells classic novels of small town gossip, secrets and romance. 1842. Cranford, a market town in the North West of England, is a place governed by etiquette, custom and above all, an intricate network of ladies. It seems that life has always been conducted according to their social rules, but Cranford is on the cusp of change…', ']]>', 'Amazon.com', \"Adapted from Elizabeth Gaskell's novels, the five-episode miniseries\", 'Cranford', 'focuses on female characters in the 19th-century British town to thematically contemplate encroaching modernity in rural England. With the camera roving house to house, each drama within the grander story is constructed of scenes featuring dialogue between several gossipy ladies obsessed with moral code, romantic ideas about courtship, and social occasions. Three main characters, the ever-appropriate Deborah Jenkyns (Eileen Atkins), her sweet sister, Matilda (Judi Dench), and their younger, more savvy relative, Miss Smith (Lisa Dillon), continuously weigh in on situations, providing a dependable view when other ladies, like the nosey Miss Pole (Imelda Staunton) are too judgmental. In fine period dress, the women of', 'Cranford', \"remind the viewer of how little action was needed in their small-town lives to provide unceasing entertainment. The series'most intriguing aspect lies not in the ample female conversation but rather in its display of earlier technologies and ways of life. Part One, for example, quickly launches a main narrative thread that runs throughout the series, namely the arrival and assimilation of London doctor, Frank Harrison (Simon Woods), into village society. Dr. Harrison's medical practices, such as his refusal to amputate a man's arm because it's broken, are all the more radical because they are so fundamental by today's standards. In subsequent episodes, he recommends Miss Smith get spectacles to cure her headaches, and saves his love's life by cooling her fever after conservative doctor, Dr. Morgan (John Bowe), recommends the old school practice of burying her in blankets in front of a raging fire. In Part Two, Lady Ludlow (Francesca Annis) throws a garden party at her estate, treating all the women in their fancy hats to a new novelty: ice cream. This scene foreshadows Ludlow's future concern at a railroad plan involving her land that would connect Cranford to Manchester, symbolizing the ruin of this idyllic setting.\", \"In fact, fluffy and clever as some scenes are, death and rebirth assert themselves in each showing, both physically and idealistically. Part Four shows an auctioning off of a deceased man's antiques, and focuses on issues of class and women's education, as Mr. Carter teaches a peasant boy to read while his assistant fumes at her trappings as a seamstress. Part Five ushers in a new period of medical emergencies, securing Dr. Harrison's shaky position in town. In total,\", 'Cranford', 'offers a powerful, if sentimental, look at how death begets life, love, and passion.', '--Trinie Dalton']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.44 x 5.39 x 0.67 inches; 5.6 Ounces', 'Item model number': '883929012404', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '4 hours and 55 minutes', 'Release date': 'May 20, 2008', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '2'}\nI'm a BBC period film junkie.  This is one of my favorites.  I have watched it again and again and never tire.\nOne of my favorites.\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Ben Taylor'], 'Producers': ['Rob Delaney', 'Sharon Horgan', 'Richard Allen-Turner', 'Kara Baker', 'Jon Thoday'], 'Starring': ['Sharon Horgan', 'Rob Delaney'], 'Studio': ['Amazon Studios']}\nLOVED it except for the last episode. Not at all congruent with what had come before. Not believable. Miss.\nAll but last episode... YES!\nRebecca\nDiana Rigg, Charles Dance, Faye Dunaway, Emilia Fox  (Actor),     Jim O'Brien  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Based on the gothic romance novel by Daphne Du Maurier. Starring Anthony Bate.']\n{'Genre': 'Drama/Television, Television/British Television', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': \"Jim O'Brien, Diana Rigg, Charles Dance, Faye Dunaway, Emilia Fox\", 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': '2258437', 'Director': \"Jim O'Brien\", 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '3 hours', 'Release date': 'February 25, 2003', 'Actors': 'Diana Rigg, Charles Dance, Faye Dunaway, Emilia Fox', 'Studio': 'PBS', 'Number of discs': '1'}\nSo, I love this story anyway and have read it several times. Very good. This is a good film adaptation of it. Recommended!\nGood adaptation!",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user remains dedicated to yoga, wellness, and physical fitness, while enjoying light-hearted family films, particularly during holidays. Their recent media choices continue to reflect an affinity for emotional and character-driven narratives, especially those rooted in historical contexts.\n\n- **Experience Level:** As a beginner to intermediate yoga practitioner, they seek accessible resources to enhance their practice while engaging with compelling film narratives.\n\n- **Learning Style:** The user values clarity and detailed instruction in yoga practices and storytelling, preferring content that simplifies complex concepts to enrich their learning experience.\n\n- **Content Preference:** They are drawn to uplifting media that intertwines mindfulness with positivity, particularly favoring films with strong character development and moral dilemmas. The user appreciates quality adaptations of beloved stories, reflecting their penchant for narratives that align with character arcs.\n\n- **Engagement Pattern:** Their commitment to a balanced lifestyle is evident in their consistent yoga practice and selective film choices, prioritizing both physical health and emotional enrichment. They express a nuanced appreciation for storytelling, with specific critiques of inconsistencies in character development.\n\n- **Community Engagement:** The user actively recommends thoughtful and uplifting content to their community, fostering a supportive environment around wellness and meaningful storytelling.\n\nOverall, the user exemplifies a holistic approach, seamlessly blending physical wellness through yoga with a discerning taste in impactful cinema.",
  "metrics": {
    "rouge1_f": 0.057701256398324796,
    "rouge2_f": 0.007448789571694599,
    "rougeL_f": 0.03024662633783155,
    "meteor": 0.017272162249469647,
    "bleu1": 2.8796343383483836e-09,
    "bleu2": 1.055448040494052e-09,
    "bleu3": 2.9410801364199704e-10,
    "bleu4": 8.738424026703804e-11,
    "bertscore_precision": 0.35030874609947205,
    "bertscore_recall": 0.5248600244522095,
    "bertscore_f1": 0.4201773703098297
  }
}