{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Beyond Basic Yoga for Dummies [VHS]\nReview Date: 2003/01/22\nStore: Sara Ivanhoe  (Actor)    Rated:    Unrated    Format: VHS Tape\nCategories: Movies & TV, Yoga, General\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Exercise_&_fitness_-_yoga', 'Format': 'NTSC', 'Contributor': 'Sara Ivanhoe', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.3 x 4.2 x 1.1 inches; 5.6 Ounces', 'Run time': '56 minutes', 'Release date': 'September 24, 2002', 'Date First Available': 'September 29, 2006', 'Actors': 'Sara Ivanhoe', 'Studio': 'Starz / Anchor Bay'}\nReview Text: Sara Ivanhoe presents another good, effective yoga workout.  This one is only a slight bit tougher than the first Dummies video but it is worth having.  It seems to be assumed that the viewer has been doing the first video faithfully and has developed more flexibility and balance.  It uses both quite a bit more than the first video did.  It is a good workout and Sara Ivanhoe talks you through it like in the first one.<br />This video is a great addition to any yoga video library!\nReview Title: A step up from the basics; nice video!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Basic Yoga Workout for Dummies VHS\nSara Ivanhoe  (Actor)    Rated:    NR    Format: VHS Tape\nMovies & TV, Yoga, General\n['Product Description', 'Anyone can do yoga with this step-by-step instruction of the 12 essential yoga postures. Hosted by Sara Ivanhoe, \"Basic Yoga Workout For Dummies\" is a simple introduction to the physical and spiritual rewards of beginning yoga.', 'Amazon.com', 'A workout that balances both the body and the mind can be found in the', 'Basic Yoga Workout for Dummies', '. Fundamental postures are explained and demonstrated slowly with an emphasis on breathing and motion. Sara Ivanhoe teaches 12 basic poses that are termed the \"daily dozen\" and offers challenges and modifications to each of these moves. Ivanhoe presents these concepts in an approachable and calming manner that adds to the overall relaxed feeling that this session exudes. Newcomers to the practice of yoga will learn jargon, essential postures, and focusing techniques. Experienced participants may find some information redundant, but Ivanhoe offers such thorough explanations about each posture that you can\\'t help but expand your existing knowledge of yoga. As the mountain pose, standing forward bend, and downward facing dog are explained (not to mention the nine other poses within the \"daily dozen\"), proper body alignment becomes the focus. Meticulous attention is given to the connection between breathing and body movement with several reminders to keep the spine in \"neutral alignment.\" This session ranks great for safety and content and makes yoga accessible to anyone who \"always wanted to, but never did.\" This is a substantial program that can introduce the basics and build your understanding of yoga.', '--Olivia Voigts']\n{'Package Dimensions': '7.5 x 3.9 x 1.2 inches; 7.36 Ounces', 'Run time': '45 minutes', 'Release date': 'November 14, 2000', 'Date First Available': 'September 29, 2006', 'Actors': 'Sara Ivanhoe', 'Studio': 'Starz / Anchor Bay'}\nThis was one of the first yoga videos that I bought and I really learned a lot from it.  Yes, it is somewhat talky but a beginner really needs to know all the things that Sara Ivanhoe talks about.  Proper form and execution of the poses is a crucial part of yoga, in order to get the most benefits from the practice and to prevent unnecessary injuries.  Several key poses are shown in this video that can be built upon as your practice increases.  They are very nicely described too, so that a beginner can start a yoga practice doing it right.  I like that about this video.<br />I have moved on to other, more complex videos now but I still like to come back to this one once in a while just to get back in touch with the basics.  It is a good yoga workout and I would recommend it to anyone wanting to get acquainted with yoga or just wanting a gentle yoga routine on hand!\nGreat video to start yoga with!\nBeyond Basic Yoga for Dummies [VHS]\nSara Ivanhoe  (Actor)    Rated:    Unrated    Format: VHS Tape\nMovies & TV, Yoga, General\n{'Genre': 'Exercise_&_fitness_-_yoga', 'Format': 'NTSC', 'Contributor': 'Sara Ivanhoe', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.3 x 4.2 x 1.1 inches; 5.6 Ounces', 'Run time': '56 minutes', 'Release date': 'September 24, 2002', 'Date First Available': 'September 29, 2006', 'Actors': 'Sara Ivanhoe', 'Studio': 'Starz / Anchor Bay'}\nSara Ivanhoe presents another good, effective yoga workout.  This one is only a slight bit tougher than the first Dummies video but it is worth having.  It seems to be assumed that the viewer has been doing the first video faithfully and has developed more flexibility and balance.  It uses both quite a bit more than the first video did.  It is a good workout and Sara Ivanhoe talks you through it like in the first one.<br />This video is a great addition to any yoga video library!\nA step up from the basics; nice video!",
  "profile": "**User Profile Summary:**\n\n- **Interests:** Yoga, wellness, physical fitness, instructional media; shows a particular preference for foundational to slightly advanced practices.\n- **Experience Level:** Beginner to intermediate, with a growing interest in building on foundational knowledge through progressively challenging content.\n- **Learning Style:** Values thorough explanations and step-by-step guidance; appreciates clarity in instructions and the supportive tone of instructors.\n- **Content Preference:** Enjoys instructional videos that blend physical practice with mindfulness; favors accessible, gentle routines for re-engagement with the basics while also seeking slightly more challenging variations.\n- **Engagement Pattern:** Regularly returns to familiar resources for skill reinforcement; indicates an openness to progressive learning, appreciating materials that introduce more complexity over time.\n- **Community Engagement:** Actively recommends resources to others, highlighting a desire to share knowledge and support novice practitioners, suggesting both engagement with and commitment to the yoga community.\n\nOverall, this user is committed to yoga as a holistic practice that balances physical and mental aspects. They focus on educational content that enhances understanding and application of yoga fundamentals, while also exploring more advanced techniques to further their practice.",
  "metrics": {
    "rouge1_f": 0.21686746987951808,
    "rouge2_f": 0.03381642512077295,
    "rougeL_f": 0.10361445783132532,
    "meteor": 0.08542089902266028,
    "bleu1": 0.0365660221315894,
    "bleu2": 0.012092930167804166,
    "bleu3": 0.0037655923751344247,
    "bleu4": 0.0011828977005944885,
    "bertscore_precision": 0.37270790338516235,
    "bertscore_recall": 0.48839062452316284,
    "bertscore_f1": 0.4227786660194397
  }
}