{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bloomy Essentials Organic Lemon Essential Oil 10 mL (1/3 oz) - USDA Certified Organic - Great for Household Cleaner & Laundry - 100% Pure\nReview Date: 2020/02/26\nStore: Bloomy Essentials\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Bloomy Essentials', 'Scent': 'Lemon', 'Special Feature': 'Pure', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Package Dimensions': '4.92 x 2.52 x 1.06 inches; 1.45 Ounces', 'UPC': '680912084635', 'Manufacturer': 'Bloomy Essentials'}\nReview Text: I have a diffuser that I use every single day.  I m always looking for different oils and scents to use to liven up my place.  I saw this and figured why not, give it a try..<br /><br />I'm glad I did.  This is literally the MOST natural lemon smelling scent I have ever used.  When using in a diffuser you won't need much, just a few drops.  If you buy this you won't regret it.  I've had it for over a week and I'm pretty pleased with it.  A little does go a long way.<br /><br />Pros<br /><br />Smells very good<br />No weird after smell<br /><br />Cons<br /><br />Not really much of it..<br />Bottle is pretty small.\nReview Title: I'm impressed by this Essential Lemon Oil\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Isshah Stainless Steel Metal Tongue Scraper Cleaner - Get Rid of Bad Breath and Bacteria - Pack of 4 - Eco Friendly Packaging\nIsshah\n{'Product Dimensions': '6.1 x 3.74 x 0.51 inches; 3.21 Ounces', 'UPC': '778299097277'}\nI used one of the tongue scrapers this morning and let me say.. It's life changing.  It felt like I just learned how to brush my teeth.<br /><br />I've never used a tongue scraper before but it was recommended by my Dentist maybe a year ago. I thought I was good by just brushing it with my Electric Toothbrush as I've always done it.  Using it this morning!!!  It was like an epiphany.  I can see how this helps exponentially with your oral hygiene.  I honestly felt like a fool after seeing the results and realize this was what I was missing out on for many years.<br /><br />The items come in a box, you take one out, sterilize it and all you do is place over your tongue, apply pressure and pull down.  You will be surprised at what you see removed from the back of your tongue to the front.  I was taken back.<br /><br />I honestly don't know how I could have lived this long without using one of these.  I think I will buy one for all of my family.\nI feel like I done dental hygiene wrong all my life\nBloomy Essentials Organic Lemon Essential Oil 10 mL (1/3 oz) - USDA Certified Organic - Great for Household Cleaner & Laundry - 100% Pure\nBloomy Essentials\n{'Brand': 'Bloomy Essentials', 'Scent': 'Lemon', 'Special Feature': 'Pure', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Package Dimensions': '4.92 x 2.52 x 1.06 inches; 1.45 Ounces', 'UPC': '680912084635', 'Manufacturer': 'Bloomy Essentials'}\nI have a diffuser that I use every single day.  I m always looking for different oils and scents to use to liven up my place.  I saw this and figured why not, give it a try..<br /><br />I'm glad I did.  This is literally the MOST natural lemon smelling scent I have ever used.  When using in a diffuser you won't need much, just a few drops.  If you buy this you won't regret it.  I've had it for over a week and I'm pretty pleased with it.  A little does go a long way.<br /><br />Pros<br /><br />Smells very good<br />No weird after smell<br /><br />Cons<br /><br />Not really much of it..<br />Bottle is pretty small.\nI'm impressed by this Essential Lemon Oil",
  "profile": "**User Summary:**\n\nThis user continues to demonstrate a robust commitment to enhancing personal hygiene and overall well-being, particularly in dental care, while also expanding their interest in eco-friendly and natural products. Their latest interaction with essential oils indicates a growing appreciation for plant-based solutions that can enhance the living environment, suggesting a holistic approach to health.\n\n**Key trends in the interaction include:**\n\n- **Focus on Natural Products:** The user actively seeks out organic and environmentally friendly options, as evidenced by the recent purchase of essential oil. This reflects a desire for pure, natural scents that contribute positively to their home atmosphere.\n\n- **Openness to Exploration:** Their willingness to try new products, from dental hygiene tools to essential oils, highlights a proactive stance toward enhancing their lifestyle through exploration and experimentation with health-related goods.\n\n- **Satisfaction with Quality:** The user appreciates high-quality products that deliver on their promises, as noted in their enthusiastic review of the essential oil's natural scent and effectiveness.\n\n- **Holistic Health Enthusiasm:** There is an indication of an evolving interest in various aspects of personal care, from oral hygiene to aromatic experiences, suggesting that the user values overall health enhancements.\n\n- **Community Sharing:** The inclination to consider family members in their purchasing decisions continues to indicate a shared commitment to well-being, reinforcing their role as a conscientious caregiver.\n\nOverall, the user's profile reflects a sustained pursuit of effective and sustainable health solutions, underscored by a readiness to trust expert recommendations and share beneficial products with their family.",
  "metrics": {
    "rouge1_f": 0.2212518195050946,
    "rouge2_f": 0.0145985401459854,
    "rougeL_f": 0.09606986899563319,
    "meteor": 0.1162574404761905,
    "bleu1": 0.13371388249146998,
    "bleu2": 0.030888829815557847,
    "bleu3": 0.005150197540098704,
    "bleu4": 0.0021046958267071443,
    "bertscore_precision": 0.3721826672554016,
    "bertscore_recall": 0.43579357862472534,
    "bertscore_f1": 0.4014841318130493
  }
}