{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Facial Cleansing Brush, Wireless Charging Base Soft Brush Set with 3 Brush Heads for Face Spa, Exfoliating, Massaging and Deep Cleansing\nReview Date: 2022/02/20\nStore: Syllable\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Syllable', 'Power Source': 'electric', 'Skin Type': 'All', 'Package Dimensions': '8.74 x 6.89 x 3.31 inches; 1.52 Pounds'}\nReview Text: 3/5 Rating<br /><br />I've read a lot of reviews concerning this facial cleansing brush. I think it's pretty good. It's not the best I've used but it's cool and it does it's job. I'm praying that it doesn't break down on me. Lol.  So far so good.<br /><br />Pros<br />Easy to use<br />Multiple settings<br />Multiple heads<br /><br />Cons<br />Big form factor\nReview Title: So far so good with me. This brush works..\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Isshah Stainless Steel Metal Tongue Scraper Cleaner - Get Rid of Bad Breath and Bacteria - Pack of 4 - Eco Friendly Packaging\nIsshah\n{'Product Dimensions': '6.1 x 3.74 x 0.51 inches; 3.21 Ounces', 'UPC': '778299097277'}\nI used one of the tongue scrapers this morning and let me say.. It's life changing.  It felt like I just learned how to brush my teeth.<br /><br />I've never used a tongue scraper before but it was recommended by my Dentist maybe a year ago. I thought I was good by just brushing it with my Electric Toothbrush as I've always done it.  Using it this morning!!!  It was like an epiphany.  I can see how this helps exponentially with your oral hygiene.  I honestly felt like a fool after seeing the results and realize this was what I was missing out on for many years.<br /><br />The items come in a box, you take one out, sterilize it and all you do is place over your tongue, apply pressure and pull down.  You will be surprised at what you see removed from the back of your tongue to the front.  I was taken back.<br /><br />I honestly don't know how I could have lived this long without using one of these.  I think I will buy one for all of my family.\nI feel like I done dental hygiene wrong all my life\nBloomy Essentials Organic Lemon Essential Oil 10 mL (1/3 oz) - USDA Certified Organic - Great for Household Cleaner & Laundry - 100% Pure\nBloomy Essentials\n{'Brand': 'Bloomy Essentials', 'Scent': 'Lemon', 'Special Feature': 'Pure', 'Seasons': 'All Seasons', 'Item Volume': '10 Milliliters', 'Package Dimensions': '4.92 x 2.52 x 1.06 inches; 1.45 Ounces', 'UPC': '680912084635', 'Manufacturer': 'Bloomy Essentials'}\nI have a diffuser that I use every single day.  I m always looking for different oils and scents to use to liven up my place.  I saw this and figured why not, give it a try..<br /><br />I'm glad I did.  This is literally the MOST natural lemon smelling scent I have ever used.  When using in a diffuser you won't need much, just a few drops.  If you buy this you won't regret it.  I've had it for over a week and I'm pretty pleased with it.  A little does go a long way.<br /><br />Pros<br /><br />Smells very good<br />No weird after smell<br /><br />Cons<br /><br />Not really much of it..<br />Bottle is pretty small.\nI'm impressed by this Essential Lemon Oil\nManicure Set, 14pcs Pedicure Kit, Nail Clippers, Professional Grooming Kit with Black Luxurious Leather Travel Case for Men Women\nEASTBUDDY\n{'Package Dimensions': '5.1 x 3.4 x 1.2 inches; 6.38 Ounces'}\nMy stepmother gave me a personal grooming kit almost 20 years ago. It did not have all the things this kit had, but nevertheless I still have and treasure that kit as my Stepmom has since passed away. It's something I keep and remember her by.<br /><br />This kit is like the 3.0 version of what she gave me.  It even has some items I'm not sure of the use.<br /><br />As soon as I opened it, it became useful. Oftentimes I'm sitting at my desk for super long periods of the day and oftentimes I may start biting my nails or even cleaning my ears as I'm looking at my computer screens. This kit allows me to clip my nails without having to run to the bathroom and grab my mother's kit. The tools in this kit allows it to be a one stop shop so that means it has a permanent place near my office desk.  You can't go wrong getting this.<br /><br />Pros<br />Fairly Compact<br />Portable<br />Many tools<br />Stainless steel<br />It has the ear scraper / cleaner.. That makes it a winner right there.<br /><br />Cons<br />Not really any.. I just wish I knew what all the tools were used for. I guess I have to do some researching.\nGood Portable ALL in ONE nail clipper / grooming kit\n24bio Hair Growth Supplement/ Get Results Or Money Back Guarantee/ Hair Care Supplement For Men And Women/ May Stimulate Hair Growth & Thicken Hair/ Full of Biotin, Amla Extract, M.S.M & More\n24bio\n{'Brand': '24bio', 'Item Form': 'Capsules', 'Material Type Free': 'Gluten Free', 'Age Range (Description)': 'Adult', 'Hair Type': 'Dry', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.17 x 2.13 x 1.89 inches; 2.65 Ounces', 'Department': 'Unisex-adult', 'UPC': '869539000475', 'Manufacturer': 'NutraScience'}\nI had high hopes when I ordered these pills. Since this quarantine I've decided to let my hair grow and thanks to the wonders of getting older I've noticed I have some thinning at the top of my head (around the crown).<br /><br />When these pills arrived first thing I noticed was the smell. They smell horrible - like old cabbage. But I learned to never judge a book by it's cover.  I decided to take anyway.<br /><br />I've been taking for a little over 2 weeks as my hair has grown, but I don't know if it's just natural growth. My hair has filled in somewhat in the thinning areas but I think this is what it would have done anyway.  I will continue to take and update my review if my beard / head hair fills in.<br /><br />Pros<br />Good quantity<br /><br />Cons<br />Not sure if it works<br />Smells horrible - like old cabbage\nHad high hopes, not sure if it really works. Smells like old cabbage\nWonder4 Electric Callus Remover - Rechargeable Electric Foot File Callus Shaver Hard Skin Remover Pedicure Tools with 3 in 1 Roller Heads, for Cracked Heels Calluses and Dead Skin\nWonder4\n{'Brand': 'Wonder4', 'Is Electric': 'Yes', 'Item Form': 'Roller', 'Style': 'Modern', 'Unit Count': '11.4 Ounce'}\nGrowing up I remember seeing my Dad's feet. It was very hard and crusty at the bottom because he would stand on his feet all night while he worked. My Dad still is a man's man.. He's relaxed in his old age but that's the site I have of him.<br /><br />When he took his socks off, you could see the hardened skin and callouses..  This would have worked WONDERS for him.  Ever since I've always been mindful to take care of my feet. I clip my nails regularly, I do not wear super tight shoes or socks where air can't get through to my feet. This callous remover kit will add another step in foot care.<br /><br />It arrived and I immediately opened it.. I followed the direction and now my feet feel even softer than before. I applied a lotion to them after I finished and washed them. I can actually feel every step. Lol.<br /><br />If you have second guesses about this, don't. It works.<br /><br />Pros<br />It Works<br />Simple to use<br />Rechargeable<br /><br />Cons<br />None\nI was very excited to get this.\nLeuxe Facial Cleansing Brush, IPX6 Waterproof Rotating Face Brush for Deep Cleansing, 3 Modes and Smart Timer\nleuxe\n{'Brand': 'leuxe', 'Power Source': 'electric', 'Product Benefits': 'Softening,Pores,Cleansing', 'Skin Type': 'All', 'Operation Mode': 'Automatic', 'Package Dimensions': '6.2 x 4 x 2.7 inches; 11.99 Ounces', 'UPC': '631517347748', 'Manufacturer': 'leuxe'}\nI recently ordered a rotating face brush last month and it was BAD. IT was battery operated, it didn't have a stand and  it didn't have the power I needed.<br /><br />THIS on the other hand is the complete opposite. This is a thorough rotating face brush that is rechargeable and has different modes. It also supports USB charging. Its a very thorough deep cleanser that you can use and carry with you that's portable.<br /><br />Pros<br />It actually works<br />It's rechargeable<br />3 different modes<br /><br />Cons<br />None\nOne of the BEST exfoliating and cleansing brushes out there\nEasydew Daily Double Hydra Cream 2.02 fl oz - Moisturizing Cream with EGF & Serine of NMFHydrating, Soothing, Anti-Aging EGF, Serine - N.M.F(Natural Moisturizing Factors) for Oily, Sensitive, Acne-Prone, Dry Skin Types\nEASYDEW\n{'Brand': 'EASYDEW', 'Item Form': 'Cream', 'Unit Count': '5.2911 Ounce', 'Number of Items': '1', 'Skin Type': 'Acne Prone,Oily,Sensitive,All Skin Types', 'Package Dimensions': '5.98 x 1.69 x 1.46 inches; 3 Ounces'}\n5/5 Rating<br /><br />First impressions - Looks unassuming until you screw the top off then you realize this is quality packaging. I've been using this for the past week and I'll use on my face as soon as I finish brushing my teeth and deep cleansing my face. I apply this moisturizer and I can immediately tell the difference. As an African American male I have oily / dry skin at times. I prefer for my face to be moisturized  as it prevents wrinkles for me.  This product goes on easy and smooth and doesn't leave oily residue on hands or face.<br /><br />Pros<br />Nice functioning container<br />Moisturizer works immediately after applying<br />Long lasting<br />Doesn't leave oily residue<br /><br />Cons<br />None.. Wish I had more.\nRight out the shower this stuff works\nsdoot Misting Spray Bottle, 2 Pack 200ml Plasitc Plant Spray Bottle Refillable Clear Mist Bottle Sprayer for Hair, Cleaning\nsdoot\n{'Brand': 'sdoot', 'Material': 'Plastic', 'Capacity': '200 Milliliters', 'Number of Items': '2', 'Special Feature': 'Lightweight, Mist Spray'}\n3/5 Ratings<br /><br />First impression - I won't lie, they arrived and looked a little on the cheap side. I got these for two reasons. My spray bottle for my fabric freshener broke and this spray bottle / spray nozzle fits the exact size of it. The second reason was to be able to spritz / water my plants.<br /><br />They are relatively inexpensive and feel as such. I don't like that there's no way to lock the nozzle with the exception of applying the blue \"lock\" accessory. But overall, it does exactly what it states<br /><br />Pros<br />Works well<br />Can use the nozzle on other containers<br /><br />Cons<br />Feel cheap<br />Uses accessory to \"lock\" nozzle.\nInexpensive but works well\nKLAVUU Pure Pearlsation pH Balancing Quick Cleansing Pad 100ea - Powerful Makeup Mild Exfoliating Cleansing Pad without Skin Irritation, Intense Moisturizing\nKLAVUU\n{'Brand': 'KLAVUU', 'Skin Type': 'Sensitive', 'Material Feature': 'Natural', 'Unit Count': '100.00 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.74 x 3.74 x 4.33 inches; 1.21 Pounds'}\n5/5 Ratings<br /><br />These cleansing pads are the TRUTH. They are very sizey and do a great job of deep cleansing your skin. They work on gentle and normal skin as well. These are not only for removing make up these are a good end of the day cleanser to use to open your pores and give your skin a refreshed feeling.<br /><br />Pros<br />Nice Sized pads<br />Can be used for morning or evenings<br />Cleans more than just make up<br /><br />Cons<br />None really\nNice big cleansing pads that really do work.\nFacial Cleansing Brush, Wireless Charging Base Soft Brush Set with 3 Brush Heads for Face Spa, Exfoliating, Massaging and Deep Cleansing\nSyllable\n{'Brand': 'Syllable', 'Power Source': 'electric', 'Skin Type': 'All', 'Package Dimensions': '8.74 x 6.89 x 3.31 inches; 1.52 Pounds'}\n3/5 Rating<br /><br />I've read a lot of reviews concerning this facial cleansing brush. I think it's pretty good. It's not the best I've used but it's cool and it does it's job. I'm praying that it doesn't break down on me. Lol.  So far so good.<br /><br />Pros<br />Easy to use<br />Multiple settings<br />Multiple heads<br /><br />Cons<br />Big form factor\nSo far so good with me. This brush works..",
  "actual_interaction": {
    "rating": 3.0,
    "title": "So far so good with me. This brush works..",
    "text": "3/5 Rating<br /><br />I've read a lot of reviews concerning this facial cleansing brush. I think it's pretty good. It's not the best I've used but it's cool and it does it's job. I'm praying that it doesn't break down on me. Lol.  So far so good.<br /><br />Pros<br />Easy to use<br />Multiple settings<br />Multiple heads<br /><br />Cons<br />Big form factor",
    "images": [],
    "asin": "B09C7SS1LY",
    "parent_asin": "B09C7SS1LY",
    "user_id": "AHR4NVRGPOS6GIJ3O4WQ3D4KUKRA",
    "timestamp": "2022-02-20 05:26:05.433000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Facial Cleansing Brush, Wireless Charging Base Soft Brush Set with 3 Brush Heads for Face Spa, Exfoliating, Massaging and Deep Cleansing",
    "average_rating": 3.5,
    "rating_number": 15,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31TxyPwC4zL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31TxyPwC4zL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/51cstX2-h4L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51VIjo6NhfL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51VIjo6NhfL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71bdMJhglEL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/419YCrPIWgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/419YCrPIWgL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61YpD15pFVL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/4143yCkigPL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/4143yCkigPL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71h6c1g+pmL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51-tBDTDSIL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51-tBDTDSIL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71a1z7sMrAL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51TiLPCYe4L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51TiLPCYe4L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71+Op2a-t8L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51QIBbNvX+L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51QIBbNvX+L.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71HnX0tq8OL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Syllable",
    "categories": [],
    "details": {
      "Brand": "Syllable",
      "Power Source": "electric",
      "Skin Type": "All",
      "Package Dimensions": "8.74 x 6.89 x 3.31 inches; 1.52 Pounds"
    },
    "bought_together": null
  }
}