{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2017/01/28\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Jonathan Newman'], 'Producers': ['Hale Coughlin', 'Alice Dawson', 'David Mutch', 'Deepak Nayar'], 'Starring': ['Toni Collette', 'Ioan Gruffudd', 'Hayley Mills'], 'Studio': ['Screen Media']}\nReview Text: I enjoyed this movie.  The little boy was so cute and did a good job.\nReview Title: Worth watching\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Holiday in Handcuffs\nMelissa Joan Hart  (Actor),     Mario Lopez  (Actor),     Ron Underwood  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['A ne er-do-well thirty-something (Melissa Joan Hart) attempts to appease her family by kidnapping herself an attractive boyfriend (Mario Lopez) for the family Christmas. Despite unlikely odds and dysfunctional family moments, the two fall in love and share a magical Christmas.StarringMelissaJoan Hart and Mario Lopez SPECIAL FEATURES: Cast Interviews!  Film Trailers of ABC Family s Original Movies: Snow and Snowglobe Sneak Peek Trailer of ABC Family s 25 Days of Christmas Holiday Event!']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Mario Lopez, Ron Underwood, Melissa Joan Hart', 'Language': 'Unqualified', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '18713532770', 'Director': 'Ron Underwood', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 7, 2008', 'Actors': 'Melissa Joan Hart, Mario Lopez', 'Studio': 'ABC Family - Gaiam', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI bought this for my mom's birthday.  She loves this movie.\nGift\nErnest Saves Christmas\nJim Varney  (Actor),     Billie Bird  (Actor),     John Cherry  (Director),     Peter Stein  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n[\"High-flying reindeer! Mischievous elves! Warp-speed sleigh rides! Get set for a magical dose of holiday cheer, zany season's greetings, and spell-binding special effects in this fast-paced, heartwarming comedy hit! When Santa Claus decides to retire and pass on his magic bag of Christmas surprises to a new St. Nick, he enlists the aid of a hilarious assortment of characters, including that lovable know-it-all Ernest P. Worrell (Emmy Award-winning comedian Jim Varney)! Along the way, Santa and Ernest help a cynical teen experience the season's spirit like never before. And that's where the fun -- and magic -- begin! ERNEST SAVES CHRISTMAS ... one delightful, surprising tale you'll never forget!\"]\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Contributor': 'Patty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher MartinPatty Maloney, Noelle Parker, Peter Stein, Robert Lesser, Ed Turner, Buddy Douglas, Douglas Seale, John Cherry, Billie Bird, Jim Varney, Phran Gauci, B. Kline, Gailard Sartain, Bill Christie, Bill Cordell, Bill Byrge, George Kaplan, Oliver Clark, Beecher Martin  See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Surround)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936188196', 'Director': 'John Cherry, Peter Stein', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Closed-captioned', 'Run time': '1 hour and 31 minutes', 'Release date': 'September 3, 2002', 'Actors': 'Jim Varney, Billie Bird, Bill Byrge, Douglas Seale, Oliver Clark', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'B. Kline, Ed Turner', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI hadn't seen this in years.  It is cute.\nFive Stars\nA Christmas Story (DVD)\nPeter Billingsley  (Actor),     Melinda Dillon  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', 'Christmas Story, A (WBFE) (DVD)', \"It's the final days before Christmas in early 1940s Cleveland, and 9-year-old Ralphie wants one thing from Santa Clause more than anything else: a Red Ryder Carbine Action Air Rifle. As he trudges through the snow to school, faces the neighborhood bully and visits a malevolent department store Santa Clause, Ralphie connives, conspires and campaigns for the most fabulous Christmas present ever in this heartwarming, hysterical and sweetly nostalgic holiday film.\", ']]>', 'Amazon.com', \"Director Bob Clark's charming, touching, and very funny adaptation of humorist Jean Shepherd's nostalgic, autobiographical Yuletide novel,\", 'In God We Trust, All Others Pay Cash', ', remains essential holiday family viewing. Narrated by a man (Shepherd) recalling his childhood, the film looks back at the compulsive efforts of 7-year-old Ralphie (Peter Billingsley) as he tries every means possible to acquire his dream Christmas gift--a Daisy-brand Red Ryder repeating BB carbine with a compass mounted in the stock. Problem is, he lives in a Norman Rockwell-esque Midwestern town in the 1940s, where his parents, teachers, and even Santa Claus all warn Ralphie that \"he\\'ll shoot his eye out.\" Episodic in nature and seen entirely through the eyes of a child, the film offers a wonderful look at the day-to-day eccentricities that grew out of this conservative period. More interestingly, it cleverly captures childhood urgency, where even the most trivial fantasies or objects become immediate life-or-death necessities. While countless family Christmas movies serve up clichéd situations suffocating with preachy sermons, Clark\\'s acute eye for detail and odd mixture of warmth, satire, and quirky humor are the reasons why so many viewers have rediscovered this after it initially bombed in the theaters. Sentimental without being syrupy, it\\'s a true rarity: a holiday movie that adults and children can enjoy equally, for completely different reasons and regardless of the season.', '--Dave McCoy', 'Review', \"In short, A Christmas Story isn't just about Christmas; it's about childhood and it recaptures a time and place with love and wonder. It seems an instant classic, a film that will give pleasure to people not only this Christmas, but for many Christmases to come. --Jay Car, Boston GlobeThe cast is wonderful--especially McGavin, Billingsley and Petrella--the laughs are nonstop if rarely subtle, and the whole thing deserves to become a Christmastime classic. --TV Guide, StaffIt is pitch-perfect, telling the story through the enthusiastic and single-minded vision of its hero Ralphie, and finding in young Peter Billingsley a sly combination of innocence and calculation. --Roger Ebert, Chicago Sun-Times\", 'About the Actor', \"Peter Billingsley has been a member of the Hollywood community since he was a small child. After appearing on numerous television shows and films during his youth, the Emmy Award-nominated actor delivered a performance for the ages in the beloved holiday film, A Christmas Story (1983). Melinda Dillon made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969) and in Steven Spielberg's Close Encounters of the Third Kind (1977). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987).\", 'About the Director', \"Bob Clark is a director known for his '80s movies such as A Christmas Story (1983), Porky's (1982) and Rhinestone (1984).\", 'See more']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.33 Ounces', 'Item model number': '3349475', 'Director': 'Bob Clark', 'Media Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2007', 'Actors': 'Peter Billingsley, Melinda Dillon, Darren McGavin, Ian Petrella, Scott Schwartz', 'Subtitles': 'English, French, Spanish', 'Producers': 'Rene Dupont, Bob Clark', 'Studio': 'Studio Distribution Services', 'Writers': 'Jean Sheppard, Leigh Brown', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is one of my favorite Christmas movies.\nChristmas classic\n4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['4 Film Favorites: Morgan Freeman (DVD) (Along Came a Spider, Kiss the Girls, Seven, Shawshank Redemption)', ']]>']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '8 hours and 38 minutes', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '11270413', 'Director': 'Various', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 38 minutes', 'Release date': 'October 15, 2013', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nMorgan Freeman is an excellent actor.  All these movies were good.  I don't regret my purchase. Great for when nothing is good on tv.\nGood combo\nThe Princess Diaries: Two-Movie Collection (Three-Disc Combo Blu-ray/DVD Combo in Blu-ray Packaging)\nJulie Andrews  (Actor),     Anne Hathaway  (Actor),     Garry Marshall  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['To commemorate the 10th anniversary (2001 - 2011) of a cherished family classic, Disney proudly presents a special movie collection featuring two modern-day fairy tales, THE PRINCESS DIARIES and THE PRINCESS DIARIES 2: ROYAL ENGAGEMENT, for the first time ever on Blu-ray! Starring Academy Award(R) winner Julie Andrews (Best Actress, MARY POPPINS, 1964) and Academy Award-nominated Anne Hathaway (Best Actress, RACHEL GETTING MARRIED, 2008), these two heartwarming and hilarious movies will touch your heart. As the future queen of Genovia, Princess Mia has everything a girl could want -- except the enchanting romance she\\'s always dreamed of. Comic complications rule the day in these delightfully engaging stories about finding out who you really are and discovering what it takes to make your dreams come true! Relive all the magic and excitement of these two beloved favorites on this 3-disc combo pack, which includes a DVD of each film. Share the laughter and the love for the first time on Disney Blu-ray.|Much of THE PRINCESS DIARIES was filmed on Stage 2 at The Walt Disney Studios in Burbank, the same sound stage where Julie Andrews filmed MARY POPPINS 37 years ago.|Director Garry Marshall says he almost didn\\'t accept the job at first -- because of a typo in the script. \"There was a typo on the title page which read The Princess \\'Dairies.\\' I thought it was a movie about privileged cows!\"|Recording artist Mandy Moore makes her film acting debut as Mia\\'s nemesis, Lana, and also sings the tune \"Stupid Cupid.\" The film also marks star Anne Hathaway\\'s big screen debut.|Whitney Houston is one of the film\\'s producers.']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': \"Robert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore, Sean O'Bryan, Meg CabotRobert Schwartzman, Sandra Oh, Larry Miller, Heather Matarazzo, Kathleen Marshall, Terry Wayne, Anne Hathaway, Hector Elizondo, Kim Leigh, Patrick Flueger, Mindy Burbano, Gina Wendkos, Garry Marshall, Erik Von Detten, Julie Andrews, Caroline Goodall, Mandy Moore,…  See more\", 'Language': 'French (Dolby Digital 5.1), English (DTS-HD High Res Audio), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.16 Ounces', 'Audio Description': 'English', 'Item model number': '109263', 'Director': 'Garry Marshall', 'Media Format': 'Blu-ray, Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'May 15, 2012', 'Actors': 'Julie Andrews, Anne Hathaway, Hector Elizondo, Heather Matarazzo, Mandy Moore', 'Subtitles': 'German, German', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Meg Cabot, Gina Wendkos', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI love these movies.\nLove!\nLast Holiday (2006)\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Last Holiday (2006) (DVD)', \"Enjoy Yourself … It's Later Than You Think! It's advice to follow for sh y New Orleans cookware salesclerk Georgia Byrd (Oscar® nomin ee* Queen L atifah) when her doctor informs her that she has less than a month to li ve. With news like that, it's time to give your life a serious makeover ! So Georgia jets off on a dream vacation to live life like there's no tomorrow. Enjoy hearty laughs and ro llicking comedic misadventures whe n Georgia shakes up a glamorous European resort spa while enthusiastical ly embracing a new look … new moves … and a new attitude! LL Cool J is the handsome suitor back home who's not about to let Georgia slip away. And Timothy H utton, Gerard Depardieu, Alicia Witt and Giancarlo Esposi to also star in this comedy hit that makes the good times last forever.\", ']]>']\n{'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '26193206', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'May 2, 2006', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nI really enjoy this movie.\nGood movie\n{'Subtitles': ['None available'], 'Directors': ['Jonathan Newman'], 'Producers': ['Hale Coughlin', 'Alice Dawson', 'David Mutch', 'Deepak Nayar'], 'Starring': ['Toni Collette', 'Ioan Gruffudd', 'Hayley Mills'], 'Studio': ['Screen Media']}\nI enjoyed this movie.  The little boy was so cute and did a good job.\nWorth watching",
  "profile": "User Profile Summary:\n\n- **Movie Preferences**: The user has a strong fixation on family-oriented films, particularly within the Kids & Family and Comedy genres. Their appreciation for lighthearted stories that foster nostalgia and family bonding is further emphasized by recent interactions, now highlighted by their enjoyment of adorable performances that resonate emotionally.\n\n- **Gifting Behavior**: The user values films as meaningful gifts, choosing titles that evoke personal memories and strengthen family connections. This approach reinforces their commitment to shared cinematic experiences as a pivotal element of their gifting strategy.\n\n- **Rating Tendencies**: The user consistently rates films positively, reflecting a clear appreciation for quality storytelling. Their latest review showcases excitement for joyful content, reinforcing their trend of favoring films that evoke emotional connections, often awarding them top ratings.\n\n- **Actor/Director Preference**: The user continues to favor familiar talent, celebrating performances by cherished actors. Recent interactions underline the influence of notable figures, particularly those whose performances have elicited further enthusiasm.\n\n- **Reviewer Intent**: The user writes reviews aimed at sharing personal experiences and evoking emotional connections, underscoring the role of films in crafting joyful memories and reinforcing familial bonds. Their dedication to family-friendly entertainment that nurtures shared experiences remains evident, signaling a consistent engagement with uplifting narratives.",
  "metrics": {
    "rouge1_f": 0.069221260815822,
    "rouge2_f": 0.0032989690721649486,
    "rougeL_f": 0.04202719406674907,
    "meteor": 0.020967630137935813,
    "bleu1": 3.057573464208207e-06,
    "bleu2": 4.699437144478693e-07,
    "bleu3": 2.000645150970305e-07,
    "bleu4": 7.347969441641211e-08,
    "bertscore_precision": 0.32828015089035034,
    "bertscore_recall": 0.459673136472702,
    "bertscore_f1": 0.38302162289619446
  }
}