{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Shaft Collection (Shaft / Shaft's Big Score / Shaft in Africa)\nReview Date: 2014/05/10\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Suspense', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Initial release date': '2006-12-12', 'Language': 'English'}\nReview Text: Enjoyed seeing old flicks of the 70's. Richard Roundtree was  calm &confident remind me of Samuel Jackson today. Someone make the remakes\nReview Title: Shaft Bringing Back The 70's\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "In the Heat of the Night (40th Anniversary Collector's Edition)\nSidney Poitier  (Actor),     Rod Steiger  (Actor),     Norman Jewison  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Product Description', \"While on a trip back home in Mississippi, detective Virgil Tibbs is arrested for the murder of a prominent industrialist. His only crimes: being out late at night and being black. After some prodding by his boss, Tibbs joins forces with the bigoted town sheriff to catch the real killer. A black Philadelphia detective becomes involved in a murder case in a small, bigoted southern town, much to the chagrin of the local, redneck police chief. An excellent production, adapted by Stirling Silliphant from John Ball's novel. Academy Award Nominations: 7, including Best Director. Academy Awards: 5, including Best Picture, Best Actor-Rod Steiger, Best (Adapted) Screenplay. Director Norman Jewison Star Sidney Poitier, Rod Steiger, Warren Oates, Lee Grant, Special Features: Widescreen - 1.85 Audio: Mono - English, Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish Optional Additional Release Material: Audio Commentaries - Norman Jewison Director; Lee Grant, Rod Steiger Stars; Haskell Wexler Cinematographer Runtime: 112 minutes Year of Release: 1967.\", 'Amazon.com', \"Both riveting murder mystery and classic fish-out-of-water yarn, Norman Jewison's Oscar-winning\", 'In the Heat of the Night', \"represents Hollywood at its wiliest, cloaking exposé in the most entertaining trappings. Sidney Poitier and Rod Steiger prove the decade's most formidable antagonists. Poitier plays Virgil Tibbs, an arrogant homicide detective waylaid in Sparta, Mississippi; Steiger, in his bravura Oscar-winning turn, is Bill Gillespie, the town's hardheaded, bigoted sheriff who first arrests Tibbs for murder and then begs for his expertise. As the clues and suspects mount, Gillespie and his deputies develop begrudging respect for the black officer. The first-rate supporting cast includes Lee Grant as the victim's angry widow, Warren Oates as a voyeuristic deputy, William Schallert as the pragmatic mayor, and, in his screen debut, Scott Wilson (\", 'In Cold Blood', ') as an unlucky fugitive. The brilliant widescreen cinematography is by Haskell Wexler, and the scat-music score is by Quincy Jones. Ray Charles wails the blues theme song. --', 'Glenn Lovell']\n{'Genre': 'Mystery & Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Timothy Scott, Sidney Poitier, Rod Steiger, Warren Oates, Fred Stewart, Norman Jewison, Quincy Jones, Lee Grant, Jack Teter, Haskell WexlerTimothy Scott, Sidney Poitier, Rod Steiger, Warren Oates, Fred Stewart, Norman Jewison, Quincy Jones, Lee Grant, Jack Teter, Haskell Wexler  See more', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '027616098610', 'Director': 'Norman Jewison', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Sidney Poitier, Rod Steiger, Warren Oates, Lee Grant, Timothy Scott', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Mgm (Video & DVD)', 'Number of discs': '1'}\nGreat movie  it depicts how a man of color was not respected because of his race but remains professional & knowledgable. Would not expect anything less from Mr. Poiter\nBe Admirable in the face of Adversity\nShaft Collection (Shaft / Shaft's Big Score / Shaft in Africa)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Suspense', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Initial release date': '2006-12-12', 'Language': 'English'}\nEnjoyed seeing old flicks of the 70's. Richard Roundtree was  calm &confident remind me of Samuel Jackson today. Someone make the remakes\nShaft Bringing Back The 70's",
  "profile": "**User Summary:**\n\nThis user demonstrates a strong appreciation for classic films that tackle significant social issues, particularly those related to race and justice. Their recent engagement with a collection of 70s films showcases a taste for nostalgic cinema, particularly in the action and suspense genres. This choice indicates a preference for films that combine engaging storytelling with strong character portrayals, reflecting their admiration for leading figures like Richard Roundtree, whose calm and confident demeanor reminds them of contemporary actors.\n\nKeywords and Trends:\n- **Film Genre Preference:** Mystery & Suspense, Classic Cinema, Action & Adventure\n- **Themes of Interest:** Racial discrimination, Professionalism, Social justice, Nostalgia\n- **Notable Actors/Directors:** Sidney Poitier, Rod Steiger, Norman Jewison, Richard Roundtree\n- **Quality Indicators:** High ratings (4.8 average), emphasis on storytelling and character development\n- **Engagement Style:** Thoughtful reviews, reflective of personal values and societal issues, with a nostalgic view of cinema's past\n\nOverall, this user seeks out films that are both entertaining and socially meaningful, enjoying a blend of action and classic storytelling while remaining critically engaged with the themes presented. Their appreciation for the 70s cinematic style suggests an evolving interest that encompasses both historical context and modern interpretations of classic tropes.",
  "metrics": {
    "rouge1_f": 0.1733821733821734,
    "rouge2_f": 0.029375764993880053,
    "rougeL_f": 0.08058608058608058,
    "meteor": 0.07484772311734159,
    "bleu1": 0.029780467617632173,
    "bleu2": 0.013344524654360574,
    "bleu3": 0.007803201007670269,
    "bleu4": 0.005310792661405658,
    "bertscore_precision": 0.3703152537345886,
    "bertscore_recall": 0.4650963246822357,
    "bertscore_f1": 0.41232916712760925
  }
}