{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lord of the Flies: Essential Art House\nReview Date: 2014/08/25\nStore: James Aubrey  (Actor),     Hugh Edwards  (Actor),     Peter Brook  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Criterion Collection, Essential Art House\nProduct Description: ['Product Description', \"Under the direction of Peter Brook, William Golding's classic fable, about a swarm of young boys who devolve into chaos without adult supervision after crash-landing on a remote island during wartime, becomes an unforgettable work of cinematic horror. Shot with almost verité camera work, Lord of the Flies takes a radical approach to Brook's metaphor, grounding it in a terrifying reality.\", 'Review', 'First rate...horrendously exciting. --Film Quarterly']\nAverage Rating: 4.6\nProduct Details: {'Format': 'Multiple Formats, AC-3, Black & White, Dolby, NTSC', 'Contributor': 'Peter Brook, Roger Elwin, Nicholas Hammond, Surtees Twins, Johnny Walsh, James Aubrey, Jerome Willis, David M. Walsh, Tom Gaman, Hugh Edwards, Tom ChapinPeter Brook, Roger Elwin, Nicholas Hammond, Surtees Twins, Johnny Walsh, James Aubrey, Jerome Willis, David M. Walsh, Tom Gaman, Hugh Edwards, Tom Chapin  See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4157647', 'Director': 'Peter Brook', 'Media Format': 'Multiple Formats, AC-3, Black & White, Dolby, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 9, 2008', 'Actors': 'James Aubrey, Hugh Edwards, Roger Elwin, Tom Gaman, Nicholas Hammond', 'Studio': 'Criterion', 'Number of discs': '1'}\nReview Text: Great black& white pic. True to the novel<br />my students enjoyed both movie& novel\nReview Title: Lord of the Flies Classic.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "In the Heat of the Night (40th Anniversary Collector's Edition)\nSidney Poitier  (Actor),     Rod Steiger  (Actor),     Norman Jewison  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Product Description', \"While on a trip back home in Mississippi, detective Virgil Tibbs is arrested for the murder of a prominent industrialist. His only crimes: being out late at night and being black. After some prodding by his boss, Tibbs joins forces with the bigoted town sheriff to catch the real killer. A black Philadelphia detective becomes involved in a murder case in a small, bigoted southern town, much to the chagrin of the local, redneck police chief. An excellent production, adapted by Stirling Silliphant from John Ball's novel. Academy Award Nominations: 7, including Best Director. Academy Awards: 5, including Best Picture, Best Actor-Rod Steiger, Best (Adapted) Screenplay. Director Norman Jewison Star Sidney Poitier, Rod Steiger, Warren Oates, Lee Grant, Special Features: Widescreen - 1.85 Audio: Mono - English, Spanish, French Dolby Digital 5.1 - English Subtitles - English, Spanish Optional Additional Release Material: Audio Commentaries - Norman Jewison Director; Lee Grant, Rod Steiger Stars; Haskell Wexler Cinematographer Runtime: 112 minutes Year of Release: 1967.\", 'Amazon.com', \"Both riveting murder mystery and classic fish-out-of-water yarn, Norman Jewison's Oscar-winning\", 'In the Heat of the Night', \"represents Hollywood at its wiliest, cloaking exposé in the most entertaining trappings. Sidney Poitier and Rod Steiger prove the decade's most formidable antagonists. Poitier plays Virgil Tibbs, an arrogant homicide detective waylaid in Sparta, Mississippi; Steiger, in his bravura Oscar-winning turn, is Bill Gillespie, the town's hardheaded, bigoted sheriff who first arrests Tibbs for murder and then begs for his expertise. As the clues and suspects mount, Gillespie and his deputies develop begrudging respect for the black officer. The first-rate supporting cast includes Lee Grant as the victim's angry widow, Warren Oates as a voyeuristic deputy, William Schallert as the pragmatic mayor, and, in his screen debut, Scott Wilson (\", 'In Cold Blood', ') as an unlucky fugitive. The brilliant widescreen cinematography is by Haskell Wexler, and the scat-music score is by Quincy Jones. Ray Charles wails the blues theme song. --', 'Glenn Lovell']\n{'Genre': 'Mystery & Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Timothy Scott, Sidney Poitier, Rod Steiger, Warren Oates, Fred Stewart, Norman Jewison, Quincy Jones, Lee Grant, Jack Teter, Haskell WexlerTimothy Scott, Sidney Poitier, Rod Steiger, Warren Oates, Fred Stewart, Norman Jewison, Quincy Jones, Lee Grant, Jack Teter, Haskell Wexler  See more', 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '027616098610', 'Director': 'Norman Jewison', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'January 15, 2008', 'Actors': 'Sidney Poitier, Rod Steiger, Warren Oates, Lee Grant, Timothy Scott', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Mgm (Video & DVD)', 'Number of discs': '1'}\nGreat movie  it depicts how a man of color was not respected because of his race but remains professional & knowledgable. Would not expect anything less from Mr. Poiter\nBe Admirable in the face of Adversity\nShaft Collection (Shaft / Shaft's Big Score / Shaft in Africa)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n{'Genre': 'Suspense', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Various', 'Initial release date': '2006-12-12', 'Language': 'English'}\nEnjoyed seeing old flicks of the 70's. Richard Roundtree was  calm &confident remind me of Samuel Jackson today. Someone make the remakes\nShaft Bringing Back The 70's\nThe Practice - Volume One\nDylan McDermott  (Actor),     Kelli Williams  (Actor),     Glenn Lazzaro  (Director),     Jonathan Pontell  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', 'Set in Boston, The Practice centers on a firm of passionate attorneys to whom every case is important and every client worth a fight to the end. Pursuing justice, however, sometimes means crossing the line...', 'Amazon.com', \"Defense attorney Bobby Donnell could've had his pick of high-paying jobs at any number of fancy Boston law firms. Instead, he chose to be his own boss.\", 'The Practice: Volume One', \"combines all six episodes from the debut mini season in 1997, along with seven episodes from the sophomore year. Though it would've been a more cohesive collection if entire two seasons were included on this four-disc DVD set, it's still a welcome addition for fans of this David E. Kelley drama. Starring Dylan McDermott as Bobby, the cast also includes Kelli Williams as uber-attorney Lindsay Dole, Emmy Award winner Camryn Manheim as Ellenor Frutt, and former cop-turned-defense attorney Eugene Young (Steve Harris). Then there's their friend--and also foil--prosecutor Helen Gamble (Lara Flynn Boyle), who admires the team's tenacity but stops at nothing to beat them in court. During the early seasons, Donnell's firm doesn't bring in enough money to decorate their offices, which are filthy--just like many of their clients. But as they slowly build a reputation as the go-to firm for clients who most likely are guilty but want to be set free, they begin to wrestle with moral dilemmas. As can be expected from a Kelley series, the cases presented here are fabulously sensationalist. But they also touch on human emotions, such as when they represent a client who was fired for being unattractive. The lawyers also have bittersweet moments as they realize they have surpassed their former legal mentors, some of whom have been seduced by the promise of big money. The most compelling episodes involve Dole--a brilliant but unseasoned attorney--who slowly and methodically tackles the tobacco industry. While the opponent has teams of senior attorneys, associates, paralegals, and interns at its disposal, Dole tirelessly works the case and refuses to give in, even when the outcome seems inevitable. The end result isn't believable in the least, but her passion sets the groundwork for one of the show's most watchable characters. --\", 'Jae-Ha Kim', 'The Practice: Volume One', 'Extras', 'View a clip of David E. Kelley speaking about the creation of', 'The Practice', '.', 'Beyond', 'The Practice: Volume One', 'More From David E. Kelley', 'More TV Dramas', 'More From 20th Century Fox', 'Stills from', 'The Practice: Volume One']\n{'Format': 'Multiple Formats, Box set, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled', 'Contributor': 'Steve Miner, Camryn Manheim, Glenn Lazzaro, Kelli Williams, Michael Badalucco, Dylan McDermott, Lisa Gay Hamilton, Jessica Capshaw, Holland Taylor, Lara Flynn Boyle, Stephen Cragg, Jonathan Pontell, Daniel Sussman, Steve Harris, Ray Abruzzo, Jason Kravits, David E. Kelley, Marla SokoloffSteve Miner, Camryn Manheim, Glenn Lazzaro, Kelli Williams, Michael Badalucco, Dylan McDermott, Lisa Gay Hamilton, Jessica Capshaw, Holland Taylor, Lara Flynn Boyle, Stephen Cragg, Jonathan Pontell, Daniel Sussman, Steve Harris, Ray Abruzzo, Jason Kravits, David E…   See more', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Runtime': '9 hours and 44 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 11.2 Ounces', 'Item model number': '2287877', 'Director': 'Glenn Lazzaro, Jonathan Pontell, Stephen Cragg, Steve Miner', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Dubbed, Full Screen, NTSC, Subtitled', 'Run time': '9 hours and 44 minutes', 'Release date': 'June 12, 2007', 'Actors': 'Dylan McDermott, Kelli Williams, Lara Flynn Boyle, Steve Harris, Camryn Manheim', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Daniel Sussman, David E. Kelley', 'Number of discs': '4'}\nLove this show!\nFive Stars\nImitation of Life (1934/1959)\nLana Turner  (Actor),     Claudette Colbert  (Actor),     Douglas Sirk  (Director),     John M. Stahl  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Product Description', \"Imitation of Life (1934) In this Academy Award-nominated Best Picture, Claudette Colbert and Louise Beavers are superb as two women with young daughters who build a fortune together. But success doesn't save them from sorrow with the passing years. Delilah's light-skinned teenager rejects her mother and her race, while Bea must choose between the man she loves and the daughter who loves him, too. Now all of them will pay the price of love in this spellbinding classic. Imitation of Life (1959) Lana Turner heads the outstanding cast with Juanita Moore in the second screen version of this emotionally-charged story about two widows and their troubled daughters. Lora's search for success causes her to neglect her daughter, while Annie's daughter rejects her culture by trying to pass for white. As the years pass, each of the four women realizes that she has been living out an emotionally fruitless existence.Bonus Content:\", 'Disc 1 - Imitation of Life (1959):', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations', 'Amazon.com', 'Imitation of Life (1959)', 'The last film in Hollywood of director Douglas Sirk (', 'Written on the Wind', \"), the 1959 Imitation of Life--an adaptation of Fannie Hurst's novel--is an endlessly fascinating film that speaks volumes about the American journey toward materialism and the racial tensions that are inseparable from it. Lana Turner plays a white single mother and aspiring actress who takes in a black housekeeper (Juanita Moore) and her daughter (played by an adolescent Susan Kohner), the latter so light-skinned she passes for white. As the years pass and success mounts for Turner, Moore also becomes more comfortable but her status as a domestic never changes. Meanwhile, Kohner's character, chafing against social constraints, rebels at every opportunity and throws a wrench into the perfect order Sirk chillingly captures through the precise, architectural design of his images. On one hand a '50s weepie and on the other a daring allegory,\", 'Imitation of Life', 'is an unusual masterpiece.', '--Tom Keogh']\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie', 'Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Contributor': \"Rochelle Hudson, Eleanore Griffin, Baby Jane, Susan Kohner, Henry Armetta, Ross Hunter, Carl Laemmle, Jr., Sandra Dee, Allan Scott, John Gavin, Alan Hale, Claudette Colbert, William Hurlbut, Dan O'Herlihy, Lana Turner, Juanita Moore, Warren William, Robert Alda, Douglas Sirk, Louise Beavers, John M. Stahl, Ned Sparks, Theodore SoderbergRochelle Hudson, Eleanore Griffin, Baby Jane, Susan Kohner, Henry Armetta, Ross Hunter, Carl Laemmle, Jr., Sandra Dee, Allan Scott, John Gavin, Alan Hale, Claudette Colbert, William Hurlbut, Dan O'Herlihy, Lana Turner, Juanita Moore, Warren William, Robert Alda, Douglas…   See more\", 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Runtime': '3 hours and 56 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 4 Ounces', 'Director': 'Douglas Sirk, John M. Stahl', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '3 hours and 56 minutes', 'Release date': 'February 10, 2004', 'Actors': 'Lana Turner, Claudette Colbert, Juanita Moore, Louise Beavers, John Gavin', 'Subtitles': 'English, Spanish, French', 'Producers': 'Ross Hunter, Carl Laemmle, Jr.', 'Studio': 'Universal Studios Home Entertainment', 'Writers': 'Eleanore Griffin, Allan Scott, William Hurlbut', 'Number of discs': '1'}\nBoth are excellent!\nFour Stars\nLord of the Flies: Essential Art House\nJames Aubrey  (Actor),     Hugh Edwards  (Actor),     Peter Brook  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Criterion Collection, Essential Art House\n['Product Description', \"Under the direction of Peter Brook, William Golding's classic fable, about a swarm of young boys who devolve into chaos without adult supervision after crash-landing on a remote island during wartime, becomes an unforgettable work of cinematic horror. Shot with almost verité camera work, Lord of the Flies takes a radical approach to Brook's metaphor, grounding it in a terrifying reality.\", 'Review', 'First rate...horrendously exciting. --Film Quarterly']\n{'Format': 'Multiple Formats, AC-3, Black & White, Dolby, NTSC', 'Contributor': 'Peter Brook, Roger Elwin, Nicholas Hammond, Surtees Twins, Johnny Walsh, James Aubrey, Jerome Willis, David M. Walsh, Tom Gaman, Hugh Edwards, Tom ChapinPeter Brook, Roger Elwin, Nicholas Hammond, Surtees Twins, Johnny Walsh, James Aubrey, Jerome Willis, David M. Walsh, Tom Gaman, Hugh Edwards, Tom Chapin  See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4157647', 'Director': 'Peter Brook', 'Media Format': 'Multiple Formats, AC-3, Black & White, Dolby, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 9, 2008', 'Actors': 'James Aubrey, Hugh Edwards, Roger Elwin, Tom Gaman, Nicholas Hammond', 'Studio': 'Criterion', 'Number of discs': '1'}\nGreat black& white pic. True to the novel<br />my students enjoyed both movie& novel\nLord of the Flies Classic.",
  "profile": "**User Summary:**\n\nThis user exhibits a profound appreciation for classic films and television that address significant social issues, particularly those related to race and justice. Their recent engagement with diverse vintage titles showcases a fondness for nostalgic cinema and narratives exploring moral complexities and human behavior. Their interest in films featuring powerful social themes is evident through their admiration for iconic directors and actors known for tackling issues like racial discrimination and gender dynamics, including Peter Brook, Lana Turner, and Douglas Sirk.\n\nThey enjoy a mixture of mystery, suspense, action, and drama, particularly when these genres delve into societal commentary. Notably, their interest in adaptations of literary works emphasizes their attraction to stories grounded in reality and ethical dilemmas. Their choice in classic adaptations reflects their preference for films that evoke strong emotional responses while encouraging critical discussions of social themes.\n\n**Keywords and Trends:**\n- **Film & TV Genre Preference:** Mystery & Suspense, Classic Cinema, Action & Adventure, Legal Dramas\n- **Themes of Interest:** Racial discrimination, Professionalism, Social justice, Nostalgia, Human behavior\n- **Notable Actors/Directors:** Peter Brook, Sidney Poitier, Richard Roundtree, Lana Turner, Douglas Sirk\n- **Quality Indicators:** High ratings (average 4.6 to 5.0), focus on storytelling and character development\n- **Engagement Style:** Thoughtful reviews reflecting personal values and societal issues, highlighting noteworthy performances and narratives\n\nOverall, the user seeks films and series that are not only entertaining but also provoke critical thought and discussion regarding social issues, blending enjoyment with meaningful engagement.",
  "metrics": {
    "rouge1_f": 0.11027568922305764,
    "rouge2_f": 0.01254180602006689,
    "rougeL_f": 0.04427736006683375,
    "meteor": 0.032840666877228836,
    "bleu1": 7.065081147276967e-05,
    "bleu2": 3.2299506235069845e-05,
    "bleu3": 1.7270945464235567e-05,
    "bleu4": 1.0051784429694853e-05,
    "bertscore_precision": 0.38330936431884766,
    "bertscore_recall": 0.5189593434333801,
    "bertscore_f1": 0.440937340259552
  }
}