{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dr. Horrible's Sing-Along Blog [Blu-ray]\nReview Date: 2015/11/18\nStore: Neil Patrick Harris  (Actor),     Nathan Fillion  (Actor),     Joss Whedon  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, TV\nProduct Description: ['Product Description', 'This Emmy®-winning phenomenon, a hilarious scifi musical starring Neil Patrick Harris (How I Met Your Mother), comes to Blu-Ray packed with over 90 minutes of bonus material.', 'Amazon.com', 'Conceived as an \"online miniseries event\" during the 2008 writers\\' strike,', \"Dr. Horrible's Sing-Along Blog\", 'is a 42-minute musical romp that bears the distinctive stamp of Joss Whedon. Neil Patrick Harris (', 'How I Met Your Mother', \") plays the title character, who video-blogs about his twin goals to join the Evil League of Evil and to woo the fair Penny (Felicia Day, of Whedon's\", 'Buffy the Vampire Slayer', 'and the Web series', 'The Guild', \"), a woman he met at the local laundromat. Dr. Horrible is foiled on both fronts, however, by his arch-nemesis, the self-absorbed superhero Captain Hammer (Nathan Fillion, Whedon's\", 'Firefly', ').', 'Dr. Horrible', 'was written by Whedon, his brothers Zack and Jed, and Jed\\'s fiancee Maurissa Tancharoen, and the songs were written by Joss and Jed (who also produced, orchestrated, played, etc.) with some lyrics by Tancharoen. (Jed and Tancharoen have backup singing roles.) The offbeat, off-the-cuff humor is laugh-out-loud funny, and just like Dr. Horrible wants to take over the world, the songs will take over your head: they\\'re engaging (\"My Freeze Ray\"), stirring (\"My Eyes\"), and sweet (\"Penny\\'s Song\"). \"So They Say\" is particularly evocative of Jonathan Larson\\'s', 'Rent', \", but as with Joss Whedon's musical episode of\", 'Buffy', ', \"Once More with Feeling,\" the influences are diverse. It\\'s hard to imagine a better cast. Harris, who\\'s sung Sondheim on Broadway, is a great lead and clearly the best singer, Day is completely charming, and who better than Captain Tightpants to play the pompous superhero? One could argue about the ending, and the independent budget shows, but', \"Dr. Horrible's Sing-Along Blog\", 'is a complete hoot for people who enjoy musicals with quirky humor. Plan on watching it multiple times.', '--David Horiuchi', 'On the Blu-ray disc', \"Even if you've already watched or downloaded\", \"Dr. Horrible's Sing-Along Blog\", ', a number of bonus features might entice you. There are two commentary tracks: Harris, the three Whedons, Tancharoen, Day, and Fillion recorded a spirited track discussing the movie, and there\\'s also \"Commentary! The Musical\" in which they ignore the movie and sing about the writers\\' strike and each other (e.g., Fillion sings \"I\\'m Better than Neil\")--the songs aren\\'t as good as the', 'Horrible', \"songs, but it's good silly fun. A 20-minute making-of discusses the cast, the recording sessions, and how the movie became a phenomenon, and 10 videos (a half-hour total) were recorded by fans who want to join the Evil League of Evil. And when's the last time you wanted to pause the FBI warning?\", '--David Horiuchi']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Musicals & Performing Arts/Musicals/General', 'Format': 'Blu-ray, Anamorphic, Multiple Formats, Color, Widescreen, Subtitled', 'Contributor': 'Felicia Day, Joss Whedon, Simon Helberg, Neil Patrick Harris, Nathan Fillion', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.1 Ounces', 'Item model number': '7262050', 'Director': 'Joss Whedon', 'Media Format': 'Blu-ray, Anamorphic, Multiple Formats, Color, Widescreen, Subtitled', 'Run time': '42 minutes', 'Release date': 'May 25, 2010', 'Actors': 'Neil Patrick Harris, Nathan Fillion, Felicia Day, Simon Helberg', 'Subtitles': 'English, Spanish, French, German, Japanese, Chinese', 'Studio': 'New Video Group', 'Number of discs': '1'}\nReview Text: ok\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "I Love Lucy: The Complete Series\nI Love Lucy  (Actor),     Lucille Ball  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['Product Description', \"The Whole McGillicuddy: All 9 Seasons! All 194 Episodes! Fall in love again and again with the timeless comedy that entertains generation after generation. This special 34-disc DVD collection contains every hilarious episode of every classic season of I Love Lucy - from the Lost Pilot to the The Lucy-Desi Comedy Hour shows. Join Lucy, Ricky, Fred and Ethel for non-stop laughter as you savor every magical moment of the greatest sitcom of all time. Includes all new special features including I Love Lucy: The Movie, the first Fully-Colorized I Love Lucy episode, I Love Lucy at the 6th Annual Emmy(R) Awards, highlights of Lucy & Desi's First Joint TV Appearance, and hours of bonus features from the individual complete season releases! NOTE:During shipping, discs in boxed sets occasionally become dislodged without damage. Please examine and play these discs. If you are not completely satisfied, we'll refund or replace your purchase.\", 'Amazon.com', 'Season Two', 'Season 2 of', 'I Love Lucy', 'includes two of the most famous half-hours in television history. \"Job Switching,\" originally broadcast mid-September of 1952, is the crazy, battle-of-the-sexes episode in which husbands Ricky Ricardo (Desi Arnaz) and Fred Mertz (William Frawley) trade roles with wives Lucy (Lucille Ball) and Ethel (Vivian Vance), culminating in the men making a shambles of domestic chores while Lucy and Ethel take disastrous work at a chocolate factory. That\\'s right: This is the show where the ladies have a Chaplinesque experience with a too-fast factory conveyor belt, forcing them to hide candies in their mouths, in their hats, and down their blouses lest a tough forewoman fire them for incompetence. A half-century later, the scene is still so fresh and funny it would grace any current sitcom. \"Lucy Goes to the Hospital,\" which received an amazing 71.7 rating on January 19, 1953, is the historic episode featuring the birth of Little Ricky and a load of wonderful slapstick. Other television series (', 'The Dick Van Dyke Show', ') and movies (', 'Nine Months', ') have tried to top', 'Lucy', \"'s time-to-go-to-the-hospital shenanigans, but there's nothing like the sight of Ricky and Fred falling all over themselves or Ricky showing up at the maternity ward (direct from a voodoo-themed show at the Tropicana) in witch doctor makeup.\", 'The other 31 episodes included in', 'I Love Lucy: The Compete Second Season', 'have choice moments, too. \"Lucy Becomes a Sculptress\" finds the ever-ambitious redhead falling for empty flattery at an art-supply store and commencing an ill-advised career working in clay. Ricky agrees to bless this new endeavor if an art critic says she has talent, but Lucy tries to increase her chances by posing as a bust of herself--resulting in mayhem, of course. The usual running themes in', 'I Love Lucy', \"--Lucy's misguided desire to be a part of Ricky's musical career, and her penchant for disguising herself to investigate something--are all over\", 'The Complete Second Season', '. \"Ricky Loses His Voice\" is a delightful piece in which Ricky\\'s laryngitis inspires Lucy, the Mertzes, and an aging chorus line to put on a Tropicana spectacle, and \"Ricky Has Labor Pains\" finds Lucy and Ethel going undercover as male reporters to find out what happens at a stag party. Lots to enjoy here, and the special features include bloopers, information about the guest cast, and snippets from Ball\\'s radio show.', '--Tom Keogh', 'Season Five', 'I Love Lucy: The Complete Fifth Season', 'finds Lucy Ricardo (Lucille Ball) making an international mess out of husband Ricky\\'s globe-trotting tour as an entertainer. Beginning with \"Lucy Visits Grauman\\'s\" and \"Lucy and John Wayne,\" the impulsive redhead risks Ricky\\'s sanity in Hollywood by stealing a cement slab, from the famous entrance to Grauman\\'s Chinese Theater, that contains the imprint of John Wayne\\'s footprints and signature. In the tradition of superstars playing themselves on', 'I Love Lucy', \", an exasperated (and very funny) Wayne gets into the act over and over and over again, making new imprints on multiple slabs because Lucy keeps messing up the results. After more shenanigans in Los Angeles (Lucy attends a ritzy party with a dummy substituting for her unavailable husband) and a disastrous train ride home, it's time to jeopardize Ricky's success during an interview show that ends disastrously.\", 'Lucy', \"'s fifth season travel theme continues when Ricky and his band are booked on a European tour that does not include his wife or the Mertzes. Of course, that doesn't stop the determined Lucy (or Ethel), who schemes her way into Ricky's plans, only to have a number of snafus arise as she tries to leave the country. In the\", 'I Love Lucy', 'tradition, entire episodes are written around such simple matters as trying to get a passport, or helping with Fred\\'s fear of getting seasick while traveling. All this show\\'s stars really need is a ridiculous, open-ended situation to exploit, and the comedy flows from there. \"Bon Voyage\" is a particularly funny episode in which Lucy gets left behind by the European-bound ship carrying Ricky and the others, and she has to find a way to get back aboard. The hilarious \"Lucy and the Queen\" finds her angling in London for a way to meet the Royal Family after Ricky is invited to say hello at the Palladium. From there, Lucy creates chaos in Scotland (this episode includes a memorable dream sequence in which Ricky appears as Scotty MacTavish MacDougal MacCardo), Paris (where she and Ethel plot to meet guest star and good sport Charles Boyer at an outdoor café), Rome (the outstanding \"Lucy\\'s Italian Movie\" finds her dispatched to a vineyard, where she has to crush grapes--brilliantly--with her feet). Lots of special features, including a behind-the-scenes peek and bloopers.', '--Tom Keogh', 'Season Six', 'The sixth and final season of', 'I Love Lucy', 'finds new laughs in some old formulas while also expanding the hugely popular show’s horizons with a change of scene. Things get off to a familiar start when Lucy Ricardo (Lucille Ball) gets in the middle of husband Ricky’s business--in this case, disguising herself as a hot dog salesman at Yankee Stadium in order to get near Bob Hope. Hope, she believes, has ignored Ricky’s offer to be the first act at his new nightclub. But, in fact, Hope had already agreed; Ricky was just sitting on the information to keep Lucy from getting typically ditzy in front of one of his celebrity pals. Not surprisingly, mayhem follows when poor Hope finds his hand slathered with condiments and his noggin bonked by a foul ball. Other celebrity sightings include Orson Welles, who copes with Lucy’s aspirations as a Shakespearean actress, and George Reeves, television’s Superman, who shows up unexpectedly, in costume, at Little Ricky’s birthday party. Meanwhile, Lucy--who didn’t want to disappoint the tyke--stands in a makeshift Man of Steel outfit on a window ledge, in the rain.', 'A number of episodes concern Little Ricky (Keith Thibodeaux) now that he’s old enough to be a functioning character on the show. In \"Little Ricky Learns to Play the Drums,\" the lad takes after his musician father and starts playing percussion, leading to some frayed nerves. A couple of episodes later, young Ricardo gets a bad case of stage fright at school, and Lucy suggests Ricky let him play the drums at the nightclub. (But then, of course, she has to figure out how to talk her son into performing.) A big change comes to', 'I Love Lucy', 'in the season’s second half, when the Ricardos decide it’s time to become homeowners and pull up stakes at their old Manhattan apartment. Moving to a nice, new house in Connecticut, they’re soon joined by Fred (William Frawley) and Ethel (Vivian Vance), and the season’s storylines take on a distinctly suburban flavor, with country clubs, barbecues, and gardens figuring into the comedy. With those developments,', 'I Love Lucy', 'came to a close after making television history as a much-beloved sitcom. Lots of special features, including multiple audio commentaries, flubs, lost scenes, and five episodes of', 'My Favorite Husband', ', Ball’s radio show.', '--Tom Keogh', 'Lucille Ball-Desi Arnaz Show', 'From Lucy-tormented Hollywood A-listers and bongo-propelled production numbers to archival goodies such as long-lost footage, there is much to love in this collection of all 13 episodes from', 'The Lucille Ball-Desi Arnaz Show', '(also known as', 'The Lucy-Desi Comedy Hour', '). Following', \"I Love Lucy's\", 'sixth and final season, these monthly (give or take) specials reunited America with Ricky and Lucy (and Keith Thibodeaux\\'s adorable Little Ricky, still living the country life in Connecticut. The expanded, hour-long format allowed for celebrity guest stars and excursions to far-flung locales, such as Japan and Mexico. Not matter where they go, Lucy can always be counted on to act, in Desi\\'s words, \"a little crazy in the head,\" which is how she winds up masquerading as Ernie Kovacs\\' chauffeur in \"Lucy Meets the Moustache\" (an episode making its home-video debut), dangling Milton Berle from a construction crane in \"Milton Berle Hides Out at the Ricardos,\" or sparking a uranium uproar in Las Vegas in \"Lucy Hunts Uranium.\"', 'A highlight of this set is the first-ever home video release of the uncut version of \"Lucy Takes a Cruise to Havana,\" a flashback episode in which Lucy meets Ricky on a \"maiden voyage\" to Cuba. She also meets future best friend Ethel (Vivian Vance) and her new husband Fred (a toupeed William Frawley), and goes overboard for her first celebrity sighting, Rudy Vallee. Because these episodes do not play as often in syndication, they seem fresher than their endlessly re-run counterparts. They are full of delights for movie, TV, and', 'Lucy', 'buffs, among them, Fred MacMurray getting \"Uranium\" fever, Maurice Chevalier singing \"Yankee Doodle Boy\" in the \"Mexico\" episode, prolific character actor Sid Melton as a bellboy in the \"Alaska\" episode, and a va-voom Vance decked out as maid and a dance hall girl, respectively, in the \"The Celebrity Next Door\" and \"Milton Berle\" episodes. Among this set\\'s prodigious bonus features include 1951 color footage that an audience member surreptitiously filmed, rediscovered scenes that were cut from the original broadcasts, and a filmed presentation to Westinghouse, which sponsored the series. If you don\\'t add this to your library, you have some \\'splainin\\' to do.', '--Donald Liebenson']\n{'Genre': 'Comedy/Television', 'Format': 'Dolby, Box set, Full Screen, NTSC, Black & White', 'Contributor': 'Vivian Vance, Desi Arnaz, William Frawley, I Love Lucy, Lucille Ball', 'Language': 'Unqualified', 'Number Of Discs': '34', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '11.1 x 8.4 x 2.4 inches; 2.85 Pounds', 'Item model number': 'PARD123434D', 'Media Format': 'Dolby, Box set, Full Screen, NTSC, Black & White', 'Run time': '89 hours and 54 minutes', 'Release date': 'October 23, 2007', 'Actors': 'I Love Lucy, Lucille Ball, Desi Arnaz, William Frawley, Vivian Vance', 'Studio': 'Paramount', 'Number of discs': '34'}\nGreat. I love them.\nFive Stars\nGet Smart - The Complete Series Gift Set\nDon Adams  (Actor),     Barbara Feldon  (Actor)    Rated:    G    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'Comedy legends Mel Brooks and Buck Henry created this classic, Emmy(R) Award-winning series that brilliantly spoofs the Cold War-era spy genre that was all the rage in the 1960s thanks to James Bond. Don Adams stars as Maxwell Smart--a.k.a. Agent 86--a hilariously inept and maladroit operative working for CONTROL, a top secret counterintelligence agency. Armed with an array of catchphrases (\"Would you believe...?,\" \"I asked you not to tell me that,\" \"And loving it!,\" \"Missed it by that much!”), along with his trusty shoe-phone and other ridiculous gadgets, Smart was able to foil the nefarious, though equally incompetent, espionage organization KAOS, aided immeasurably by his much smarter partner, sultry Agent 99, deliciously played by Barbara Feldon. Edward Platt co-stars as \\'Chief,\\' the head of CONTROL, and the series features notable guest appearances from Carol Burnett, Johnny Carson, Don Rickles and many others.', ']]>', 'Review', 'The feature film may have missed it by that much, but', 'Get Smart', ', the TV series, still hits the target with deadly funny accuracy. The right show at the right time,', 'Get Smart', 'brilliantly spoofed the spy genre that was all the rage in 1965, with James Bond on the big screen, and such series as', 'Danger Man, The Avengers, The Saint, The Man from U.N.C.L.E.', ', and', 'I Spy', 'more or less playing it straight on the small screen.', 'Get Smart', \", on the other hand, had a license to kill…with laughter. Mel Brooks and Buck Henry created one of TV's all-time greatest characters, Maxwell Smart, Agent 86 of CONTROL, the super-secret agency vigilantly on alert against the forces of KAOS. Smart (Don Adams in his iconic, Emmy-winning role), an American Clouseau, was not stupid. Though all evidence to the contrary, he was, in his own mind, a suave and sophisticated spy, albeit one who would inadvertently lean against a freshly painted wall while shadowing an enemy agent.\", 'Get Smart', 'hilariously deglamorized the business of espionage. Agents punch a time clock and dispute vacation time. Cool spy gadgets, such as the infamous Cone of Silence, are prone to malfunction. One running joke throughout the first season finds Agent 44 (Victor French) perched in a variety of unlikely and uncomfortable hiding places, among them a grandfather clock. Although the series would only get smarter and funnier in subsequent seasons (Bernie Kopell\\'s KAOS mastermind Siegfried would be introduced in season two), the first season contains several essential episodes, including the Emmy-winning two-parter, \"Ship of Spies,\" \"Aboard the Orient Express,\" featuring a cameo by Johnny Carson as an unflappable conductor, \"Diplomat\\'s Daughter\" with the arch --and decidedly non-PC-- villain, the Craw, and \"Back to the Drawing Board,\" featuring Dick Gautier as Hymie the robot. From \"Sorry about that\" to \"Would you believe,\" no show before Get Smart introduced so many catchphrases into the national language, while Smart and his partner, Agent 99 (the ravishing Barbara Feldon), were perhaps TV\\'s first \"will they or won\\'t they\" couple. Brooks and Henry contribute separate commentaries for the black and white pilot episode, while Feldon provides commentary for another, and purrs introductions to each episode (beware plot spoilers). With', 'Get Smart,', \"you will be witness to some of TV's funniest moments, sharpest writing, and expertly-executed physical comedy. And… loving it.\", '--Donald Liebenson']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Box set, NTSC', 'Contributor': 'Barbara Feldon, Edward Platt, Robert Karvelas, Don Adams', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '25', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '11.25 x 6.25 x 5.5 inches; 4 Ounces', 'Media Format': 'Multiple Formats, Box set, NTSC', 'Run time': '57 hours and 30 minutes', 'Release date': 'November 4, 2008', 'Actors': 'Don Adams, Barbara Feldon, Edward Platt, Robert Karvelas', 'Studio': 'HBO Studios', 'Number of discs': '25'}\nExcellent.\nFive Stars\nShaggy and Scooby-Doo Get a Clue Volume 2\nFrank Welker  (Actor),     Scott Menville  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Shaggy and Scooby-Doo Get a Clue Volume 2 (DVD)']\n{'Genre': 'Kids & Family, Science Fiction', 'Format': 'Color, Multiple Formats, Animated, NTSC, Subtitled', 'Contributor': 'Jim Meskimen, Grey Delisle, Scott Menville, Eric Radomski, Jeff Bennett, Frank Welker, Mindy Cohn, Sander SchwartzJim Meskimen, Grey Delisle, Scott Menville, Eric Radomski, Jeff Bennett, Frank Welker, Mindy Cohn, Sander Schwartz   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 2.88 Ounces', 'Media Format': 'Color, Multiple Formats, Animated, NTSC, Subtitled', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 8, 2008', 'Actors': 'Frank Welker, Scott Menville, Jeff Bennett, Jim Meskimen, Grey Delisle', 'Subtitles': 'English', 'Producers': 'Eric Radomski, Sander Schwartz', 'Studio': 'Turner Home Ent', 'Number of discs': '1'}\nGood child's movie.\nFive Stars\nShaggy and Scooby-Doo Get a Clue! Volume 1 (DVD)\nFrank Welker  (Actor),     Scott Menville  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n{'Genre': 'Mystery & Thrillers', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Jim Meskimen, Eric Radomski, Scott Menville, Grey DeLisle Griffin, Jeff Bennett, Frank Welker, Sander Schwartz, Mindy CohnJim Meskimen, Eric Radomski, Scott Menville, Grey DeLisle Griffin, Jeff Bennett, Frank Welker, Sander Schwartz, Mindy Cohn   See more', 'Language': 'English', 'Number Of Discs': '1'}\nGood child's movie.\nFive Stars\nShorts\nKat Dennings  (Actor),     Leslie Mann  (Actor),     Robert Rodriguez  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Shorts (DVD)', 'Eleven-year-old Toe Thompson already thinks his neighborhood is weird ... but it\\'s about to get a whole lot weirder! Toe (Jimmy Bennett) serves as the designated punching bag for the bullies of the suburban community of Black Falls, where, during a freak storm, a mysterious Rainbow Rock falls from the sky and grants wishes to anyone who finds it. As the Rock ricochets around the town--from kid to kid and parent to parent--wishes gone wrong quickly turn the neighborhood upside down in a wild rampage of everything from tiny aliens to giant boogers. A multi-generational ensemble cast including Emmy nominee Jon Cryer (\"Two and a Half Men\"), Oscar nominee William H. Macy (Fargo), Leslie Mann (Knocked Up) and three-time Emmy winner James Spader headlines this comedy adventure for all ages from Robert Rodriguez (Spy Kids).', ']]>']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, Widescreen, Full Screen, Subtitled, NTSC', 'Contributor': 'Kat Dennings, Leslie Mann, Robert Rodriguez', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '1000090287', 'Director': 'Robert Rodriguez', 'Media Format': 'Multiple Formats, Color, Widescreen, Full Screen, Subtitled, NTSC', 'Run time': '2 hours', 'Release date': 'November 24, 2009', 'Actors': 'Kat Dennings, Leslie Mann', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nGood value.\nFive Stars\nMichael Jackson's Vision\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['It might have been fate that MTV was born at the same time people began to notice the rare talent and artistic ingenuity of Michael Jackson. It proved to be a perfect match between the new television network and the young rising icon. Early on, Michael saw MTV’s potential as a force of its own and understood that it offered him the chance to pioneer a whole new visual style through which people could see music, not just listen to it. For the first time, artists had the opportunity to truly shape a vision of a story around their songs. For Michael, this meant treating the song as a “script” and creating a stand-alone film to tell that story. In fact, Michael referred to each of these productions as a \"short film\" and not a “music video.”  No other artist contributed more to the development of this art form than Michael Jackson. Just look at the impact of', 'Thriller', ', which was recently named the first (and only) music video ever to be inducted by the Library of Congress into the National Film Registry - an elite collection of only a few hundred films. In addition to this, Michael’s vision had immense cultural impact . The enormous popularity of his short films proved to MTV Executives that they were wrong about what their audience wanted; it was Michael who broke through that initial barrier and created opportunity for future African American artists.  Here, for the first time, is the complete collection of all 35 of the short films produced by Michael during his career as a solo artist - 10 of which are appearing on DVD for the first time. All of the short films have been meticulously restored and remastered for the ultimate audio and visual experience and a bonus DVD includes 7 additional videos including “Enjoy Yourself” with The Jacksons, “Say Say Say” with Paul McCartney and the Previously Unreleased video for “One More Chance”. This is a true representation of', 'Michael Jackson’s Vision', '.']\n{'Genre': \"Pop, Michael Jackson Michael Jackson's Vision\", 'Format': 'Multiple Formats, Color, NTSC, Box set', 'Contributor': 'Michael Jackson', 'Language': 'Italian (Dolby Digital 5.1), Czech (DTS 5.1), English (PCM Stereo)', 'Runtime': '4 hours and 33 minutes', 'Aspect Ratio': '16:9', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.82 x 5.41 x 1.01 inches; 11.84 Ounces', 'Item model number': '8 5 00776051', 'Media Format': 'Multiple Formats, Color, NTSC, Box set', 'Run time': '4 hours and 33 minutes', 'Release date': 'November 22, 2010', 'Actors': 'Michael Jackson', 'Dubbed': 'English', 'Subtitles': 'None', 'Studio': 'Legacy Recordings', 'Country of Origin': 'USA', 'Number of discs': '3'}\ngood\nFive Stars\nThe Sorcerer's Apprentice (Two-Disc Blu-ray / DVD Combo)\nNicolas Cage  (Actor),     Alfred Molina  (Actor),     Jon Turteltaub  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n{'Genre': 'Action/Adventure', 'Format': 'Blu-ray', 'Contributor': 'Nicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton ListNicole Ehinger, Alfred Molina, Teresa Palmer, Nicolas Cage, Jon Turteltaub, Jay Baruchel, Peyton List  See more', 'Language': 'English, Spanish, French', 'Runtime': '1 hour and 49 minutes'}\ngood\nFive Stars\nDr. Horrible's Sing-Along Blog [Blu-ray]\nNeil Patrick Harris  (Actor),     Nathan Fillion  (Actor),     Joss Whedon  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, TV\n['Product Description', 'This Emmy®-winning phenomenon, a hilarious scifi musical starring Neil Patrick Harris (How I Met Your Mother), comes to Blu-Ray packed with over 90 minutes of bonus material.', 'Amazon.com', 'Conceived as an \"online miniseries event\" during the 2008 writers\\' strike,', \"Dr. Horrible's Sing-Along Blog\", 'is a 42-minute musical romp that bears the distinctive stamp of Joss Whedon. Neil Patrick Harris (', 'How I Met Your Mother', \") plays the title character, who video-blogs about his twin goals to join the Evil League of Evil and to woo the fair Penny (Felicia Day, of Whedon's\", 'Buffy the Vampire Slayer', 'and the Web series', 'The Guild', \"), a woman he met at the local laundromat. Dr. Horrible is foiled on both fronts, however, by his arch-nemesis, the self-absorbed superhero Captain Hammer (Nathan Fillion, Whedon's\", 'Firefly', ').', 'Dr. Horrible', 'was written by Whedon, his brothers Zack and Jed, and Jed\\'s fiancee Maurissa Tancharoen, and the songs were written by Joss and Jed (who also produced, orchestrated, played, etc.) with some lyrics by Tancharoen. (Jed and Tancharoen have backup singing roles.) The offbeat, off-the-cuff humor is laugh-out-loud funny, and just like Dr. Horrible wants to take over the world, the songs will take over your head: they\\'re engaging (\"My Freeze Ray\"), stirring (\"My Eyes\"), and sweet (\"Penny\\'s Song\"). \"So They Say\" is particularly evocative of Jonathan Larson\\'s', 'Rent', \", but as with Joss Whedon's musical episode of\", 'Buffy', ', \"Once More with Feeling,\" the influences are diverse. It\\'s hard to imagine a better cast. Harris, who\\'s sung Sondheim on Broadway, is a great lead and clearly the best singer, Day is completely charming, and who better than Captain Tightpants to play the pompous superhero? One could argue about the ending, and the independent budget shows, but', \"Dr. Horrible's Sing-Along Blog\", 'is a complete hoot for people who enjoy musicals with quirky humor. Plan on watching it multiple times.', '--David Horiuchi', 'On the Blu-ray disc', \"Even if you've already watched or downloaded\", \"Dr. Horrible's Sing-Along Blog\", ', a number of bonus features might entice you. There are two commentary tracks: Harris, the three Whedons, Tancharoen, Day, and Fillion recorded a spirited track discussing the movie, and there\\'s also \"Commentary! The Musical\" in which they ignore the movie and sing about the writers\\' strike and each other (e.g., Fillion sings \"I\\'m Better than Neil\")--the songs aren\\'t as good as the', 'Horrible', \"songs, but it's good silly fun. A 20-minute making-of discusses the cast, the recording sessions, and how the movie became a phenomenon, and 10 videos (a half-hour total) were recorded by fans who want to join the Evil League of Evil. And when's the last time you wanted to pause the FBI warning?\", '--David Horiuchi']\n{'Genre': 'Science Fiction & Fantasy, Musicals & Performing Arts/Musicals/General', 'Format': 'Blu-ray, Anamorphic, Multiple Formats, Color, Widescreen, Subtitled', 'Contributor': 'Felicia Day, Joss Whedon, Simon Helberg, Neil Patrick Harris, Nathan Fillion', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.1 Ounces', 'Item model number': '7262050', 'Director': 'Joss Whedon', 'Media Format': 'Blu-ray, Anamorphic, Multiple Formats, Color, Widescreen, Subtitled', 'Run time': '42 minutes', 'Release date': 'May 25, 2010', 'Actors': 'Neil Patrick Harris, Nathan Fillion, Felicia Day, Simon Helberg', 'Subtitles': 'English, Spanish, French, German, Japanese, Chinese', 'Studio': 'New Video Group', 'Number of discs': '1'}\nok\nFour Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preference:** The user maintains a robust appreciation for classic television series and comedies from the mid-20th century, with continued interest in family-oriented animated content. They have recently explored whimsical adventure genres, blending lighthearted mystery with engaging narratives.\n\n- **Key Interests:** Nostalgic entertainment remains central, focusing on iconic characters and humor that resonates across generations. The user emphasizes family-friendly narratives that encourage multi-age engagement.\n\n- **Review Behavior:** They consistently rate media highly, often giving 4 to 5 stars. Recent reviews reveal an appreciation for the quirky humor and offbeat storytelling typical of contemporary works, while also addressing suitability for children.\n\n- **Product Format Preference:** The user favors physical media, particularly Blu-ray and DVD collections, seeking out editions with extensive bonus content to enhance their viewing experience.\n\n- **Cultural Appreciation:** They value the historical significance of classic sitcoms and innovative creations, recognizing their lasting impact on entertainment.\n\n- **Engagement Style:** The user provides thoughtful reviews, sharing insights on character dynamics and humor, reflecting a passionate enthusiasm for their favored media.\n\n- **Television Era Interest:** A keen appreciation for storytelling techniques from comedic classics highlights their love for humor that connects with both children and adults, while also embracing new narratives that showcase creativity and originality in storytelling.",
  "metrics": {
    "rouge1_f": 0.05472197705207414,
    "rouge2_f": 0.0035320088300220755,
    "rougeL_f": 0.025154457193292144,
    "meteor": 0.015300340007555722,
    "bleu1": 5.480155776301305e-10,
    "bleu2": 1.5783380451785256e-10,
    "bleu3": 2.2483861834220985e-11,
    "bleu4": 8.493940613482648e-12,
    "bertscore_precision": 0.34783706068992615,
    "bertscore_recall": 0.5192043781280518,
    "bertscore_f1": 0.41658568382263184
  }
}