{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dollhouse\nReview Date: 2013/05/10\nCategories: Science Fiction, Suspense, Drama, Action\nProduct Description: ['In the highly anticipated first season of Dollhouse, Echo (Eliza Dushku) is an \"Active,\" a member of a highly illegal and underground group who have had their personalities wiped clean so they can be imprinted with any number of new personas. Confined to a secret facility known as the \"Dollhouse,\" Echo and the other Actives including Sierra and Victor carry out engagements assigned by Adelle, one of the Dollhouse leaders. The engagements cater to the wealthy, powerful and connected, and require the Actives to immerse themselves in all manner of scenarios - romantic, criminal, uplifting, dangerous, comical and the occasional \"pro bono\" good deed. After each scenario, Echo, always under the watchful eye of her handler Boyd, returns to the mysterious Dollhouse where her thoughts, feelings and experiences are erased by Topher, the Dollhouse\\'s genius programmer. Echo enters the next scenario with no memory of before. Or does she?']\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Solomon', 'Joss Whedon', 'Tim Minear', 'Félix Enríquez Alcalá', 'Dwight H. Little', 'David Straiton', 'John Cassaday', 'James A. Contner', 'Steven S. DeKnight', 'Jonathan Frakes']}\nReview Text: I was pleasantly surprised to find Dollhouse filled with action and mystery. The overall story line is continues from one episode to another and the twist and turns of the plots keep me coming back to learn more about the dollhouse.\nReview Title: Suspenseful and Mysterious.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Andy Wilson', 'John Strickland'], 'Producers': ['ITV'], 'Starring': ['Geraldine McEwan'], 'Studio': ['Agatha Christie']}\nI have always loved Agatha Christie's Miss Marple. Read the books years ago and finding this series was such a joy.  Great to watch and unwind.  Makes an enjoyable weekend mini- marathon with friends.\nLove the books, enjoy the series!\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Edward Hall', 'Peter Medak', 'Tom Shankland', 'Paul Unwin'], 'Producers': ['Rebecca Eaton (WGBH)', 'Phil Clymer (Chorion)', 'Michele Buck', 'Damien Timmer'], 'Starring': ['Geraldine McEwan', 'Anthony Andrews', 'Michael Brandon'], 'Studio': ['Acorn Media']}\nLove the mysteries with the character Miss Marple.  They make me smile. I like the fact they focus on the story and not a lot of blood and gore.  Nice evening spent watching an engaging performance by Geraldine McEwan.\nSpend the evening with a murder mystery\nNumb3rs\nSuspense, Drama, Action\n['FBI agent Don Eppes recruits his mathematical genius brother Charlie to help the Bureau solve a wide range of challenging crimes in Los Angeles.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dennis Smith', 'Alex Zakrzewski', 'John Behring', 'J. Miller Tobin', 'Stephen Gyllenhaal', 'Ralph Hemecker', 'Julie Hébert', 'Ken Sanzel', 'Rob Morrow', 'Rod Holcomb']}\nLove the fact I can finally watch all the episodes I missed.  I love the family relationship and how  the characters interact together.<br />Smart little brother and the FBI older brother work well as a team to solve cases using math and science.\nLove this series!\nDollhouse\nScience Fiction, Suspense, Drama, Action\n['In the highly anticipated first season of Dollhouse, Echo (Eliza Dushku) is an \"Active,\" a member of a highly illegal and underground group who have had their personalities wiped clean so they can be imprinted with any number of new personas. Confined to a secret facility known as the \"Dollhouse,\" Echo and the other Actives including Sierra and Victor carry out engagements assigned by Adelle, one of the Dollhouse leaders. The engagements cater to the wealthy, powerful and connected, and require the Actives to immerse themselves in all manner of scenarios - romantic, criminal, uplifting, dangerous, comical and the occasional \"pro bono\" good deed. After each scenario, Echo, always under the watchful eye of her handler Boyd, returns to the mysterious Dollhouse where her thoughts, feelings and experiences are erased by Topher, the Dollhouse\\'s genius programmer. Echo enters the next scenario with no memory of before. Or does she?']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Solomon', 'Joss Whedon', 'Tim Minear', 'Félix Enríquez Alcalá', 'Dwight H. Little', 'David Straiton', 'John Cassaday', 'James A. Contner', 'Steven S. DeKnight', 'Jonathan Frakes']}\nI was pleasantly surprised to find Dollhouse filled with action and mystery. The overall story line is continues from one episode to another and the twist and turns of the plots keep me coming back to learn more about the dollhouse.\nSuspenseful and Mysterious.",
  "profile": "**Updated User Profile Summary**\n\n- **Content Preference**: The user has a strong affinity for classic detective stories and adaptations, particularly those by Agatha Christie. They appreciate character-driven narratives that emphasize story over graphic content and have recently shown an interest in suspenseful narratives incorporating family dynamics and teamwork, alongside the traditional mystery genre.\n  \n- **Viewing Habits**: Enjoys weekend marathons with friends, enhancing social interaction during viewing experiences. The recent interaction suggests an expanding interest in suspense and drama within various genres, including science fiction and action.\n\n- **Engagement with Material**: Values both source materials and adaptations, enjoying familiar narratives that provide emotional engagement and clever storytelling. They are drawn to storylines with complex plots and twists, as well as elements that incorporate math and science in problem-solving.\n\n- **Language & Accessibility**: Prefers English audio and subtitles for clarity in comprehension.\n\n- **Rating Behavior**: Generally provides high ratings for quality storytelling and engaging performances. The latest interaction reflects a continued appreciation for well-crafted narratives filled with suspense and mystery while maintaining their established preference for character interactions and intelligent plots without excessive graphic content.\n\nThe user continues to prioritize engaging and nostalgic narratives, particularly showcasing strong character work, clever plotting, and the enjoyment of shared viewing experiences with friends.",
  "metrics": {
    "rouge1_f": 0.24964131994261116,
    "rouge2_f": 0.04316546762589928,
    "rougeL_f": 0.109038737446198,
    "meteor": 0.08927393239778471,
    "bleu1": 0.04915851765457287,
    "bleu2": 0.01915010332207402,
    "bleu3": 0.007504001949672288,
    "bleu4": 0.002223436068596371,
    "bertscore_precision": 0.354793906211853,
    "bertscore_recall": 0.44245755672454834,
    "bertscore_f1": 0.3938060998916626
  }
}