{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2019/09/06\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Scott Zabielski', 'John Elerick', 'Jim Patton', 'Brit McAdams', 'Payman Benz', 'Jonathan Judge', 'Ewan Gotfryd'], 'Producers': ['Joe Borden', 'Christie Smith', 'Mike Gibbons'], 'Studio': ['COMEDY CENTRAL']}\nReview Text: I resisted this show thinking it was too childish and gross. Now I'm buying and rewatching it for a their time.\nReview Title: Go see him live too. He's great!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stargate SG-1: Season 5\nMichael Shanks  (Actor),     Christopher Judge  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sci Fi Channel, All Sci Fi Channel Shows\n['Repackaged']\n{'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'Closed-captioned, Color, Multiple Formats, Dolby, NTSC, Widescreen', 'Contributor': 'Michael Shanks, Richard Dean Anderson, Christopher Judge, Amanda Tapping', 'Language': 'English (Dolby Surround), Spanish (Dolby Surround), French (Dolby Surround), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 0.01 Ounces', 'Item model number': '2221665', 'Media Format': 'Closed-captioned, Color, Multiple Formats, Dolby, NTSC, Widescreen', 'Run time': '16 hours and 13 minutes', 'Release date': 'April 6, 2010', 'Actors': 'Michael Shanks, Christopher Judge, Richard Dean Anderson, Amanda Tapping', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nHad seasons 1-4.  Season 5's box is the size of a single DVD rather than half a dozen of them like the previous ones I have.\nSeason 5's box is the size of a single DVD rather than half a dozen of them like the previous ones I have\nStargate Atlantis\nDrama, Action, Adventure, Science Fiction\n['The Wraith threat is ever-present while the team travels to new worlds and adventures in the Pegasus Galaxy. Season 3 thrusts Dr. Elizabeth Weir (Torri Higginson) and Maj. John Sheppard (Joe Flanigan) right back into action, and the Atlantis team sees the return of several favorite guest stars and meets a sinister new foe.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert C. Cooper', 'Andy Mikita', 'Brad Turner', 'Martin Wood', 'Will Waring', 'Paul Ziller'], 'Producers': ['Brad Wright', 'Robert C. Cooper', 'Carl Binder', 'Martin Gero']}\nHave watched the whole series three times now. Awesome show.\nAwesome show.\nMr. Holmes [DVD + Digital]\nIan McKellen  (Actor),     Laura Linney  (Actor),     Bill Condon  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Mr. Holmes is a new twist on the world’s most famous detective. In 1947, in his remote seaside farmhouse, an aging Sherlock Holmes (Ian McKellen, Academy Award (r) nominee, 2002, Best Actor in a Supporting Role, The Lord of the Rings: The Fellowship of the Ring) tends to his bees, with only the company of his housekeeper (Laura Linney, Academy Award (r) nominee, 2001, Best Actress in a Leading Role, You Can Count on Me) and her charming young son, Roger. Grappling with the diminishing powers of his mind, Holmes comes to rely upon the boy as he revisits the circumstances of the unsolved case that forced him into retirement, and searches for answers to the mysteries of life and love – before it's too late.\"]\n{'Genre': 'Crime', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Laura Linney, Bill Condon, Hiroyuki Sanada, Milo Parker, Jeffrey Hatcher, Ian McKellen, Mitch Cullin', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '35225428', 'Director': 'Bill Condon', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'November 10, 2015', 'Actors': 'Ian McKellen, Laura Linney, Milo Parker, Hiroyuki Sanada', 'Studio': 'Lionsgate Home Entertainment', 'Writers': 'Mitch Cullin, Jeffrey Hatcher', 'Number of discs': '1'}\nThe DVD makes is incredibly hard to start the movie, and once there, if you stop or turn of the movie for any reason, you can start it back up, either then or later, you have to go through all the 4 minutes of the DVD's &#34;starting&#34; garbage.<br /><br />I stopped half way into it last night, had to restart, wasted half an hour with scene selection (having to go through the 4 minutes of &#34;startup&#34; in between each selection), the when I finally found the place, accidentally pressed stop instead of play, which reset the DVD for the 10th time.  So I clicked eject.  So I can't say how good the movie is but this DVD is horribly made.<br /><br />My DVD player is perfectly capable of remembering where it left off other DVDs, even weeks later.  The studio spent tons of money on the movie then apparently gave the DVD & its menus to be made by their unemployed nephew for $20.\nSo I can't say how good the movie is but this DVD is HORRIBLY made.\nArrival\nDrama, Science Fiction, Cerebral, Dreamlike\n['When mysterious spacecraft touch down across the globe, an elite team - led by expert translator Louise Banks (Academy Award nominee Amy Adams) - races against time to decipher their intent.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English (US) [CC]', 'English [CC]'], 'Directors': ['---'], 'Producers': ['Shawn Levy', 'Dan Levine', 'Aaron Ryder', 'David Linde'], 'Starring': ['Amy Adams', 'Jeremy Renner', 'Forest Whitaker']}\nFantastic movie.  If you loved Contact, you'll definitely like this movie too.  Not the same, but the same feel.\nFantastic movie. If you loved Contact\nValerian and the City of a Thousand Planets\nInternational, Action, Compelling, Futuristic\n['A dark force threatens Alpha, a vast metropolis and home to species from a thousand planets. Special operatives Valerian and Laureline must race to identify the marauding menace and safeguard not just Alpha, but the future of the universe.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Luc Besson'], 'Producers': ['Fanny Besson', 'Luc Besson', 'Virginie Besson-Silla', 'Jc Cheng', 'Camille Courau', 'Mark Gao', 'Dylan Haggerty', 'Gregory Ouanhon'], 'Starring': ['Dane DeHaan', 'Cara Delevingne', 'Clive Owen']}\nHigh production garbage.<br /><br />I keep wanting to rage about this or that aspect of the movie having done horribly but it would reduce from the other ones.<br /><br />It was bad all around, in so many ways.\nWish I'd not wasted my time and money watching it in theaters.\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Bob Persichetti', 'Peter Ramsey', 'Rodney Rothman'], 'Producers': ['Avi Arad', 'Amy Pascal', 'Phil Lord', 'Christopher Miller', 'Christina Steinberg'], 'Starring': ['Shameik Moore', 'Jake M. Johnson', 'Hailee Steinfeld'], 'Studio': ['Columbia Pictures', 'Sony Pictures Animation']}\nWas pretty good, but I was setup for much higher expectations.\nIt was nice.  My friends thought it was better than sliced butter, but it seemed fine to me.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Scott Zabielski', 'John Elerick', 'Jim Patton', 'Brit McAdams', 'Payman Benz', 'Jonathan Judge', 'Ewan Gotfryd'], 'Producers': ['Joe Borden', 'Christie Smith', 'Mike Gibbons'], 'Studio': ['COMEDY CENTRAL']}\nI resisted this show thinking it was too childish and gross. Now I'm buying and rewatching it for a their time.\nGo see him live too. He's great!",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interest**: The user continues to engage with science fiction television and films, particularly those blending fantasy elements with complex narratives. They appreciate adaptations that reflect notable literary characters and explore philosophical themes.\n\n- **Content Preferences**: The user has shown a capacity to surprise themselves with content outside their usual preferences, as demonstrated by their recent enjoyment of a show they initially dismissed. However, they still maintain high expectations for creativity and quality in media, becoming disillusioned when productions do not meet their standards.\n\n- **Format Preference**: They favor DVD collections for their tangible quality, but recent frustrations with poorly designed products underlie their demand for well-crafted packaging and superior usability.\n\n- **Quality Appreciation**: The user's acute awareness of production quality persists, as evidenced by their detailed ratings and criticisms. Recent interactions indicate they can appreciate and elevate their expectations for shows that ultimately surprise them positively.\n\n- **Engagement with Series**: They enjoy rewatching series and are open to expanding their views on new content, as seen in their latest purchase, suggesting a willingness to explore and engage with different genres.\n\n- **Rating Behavior**: Their ratings reflect a commitment to quality, showcasing a balanced approach of cautious appreciation. Recent positive feedback emphasizes their adaptability towards content that proves worthwhile despite initial perceptions, maintaining a focus on narrative depth and overall execution.",
  "metrics": {
    "rouge1_f": 0.11441307578008915,
    "rouge2_f": 0.004464285714285715,
    "rougeL_f": 0.0549777117384844,
    "meteor": 0.03909469280870156,
    "bleu1": 0.0016192611016662333,
    "bleu2": 0.0003419770947111844,
    "bleu3": 5.9619248283401643e-05,
    "bleu4": 2.4915504858218183e-05,
    "bertscore_precision": 0.329631507396698,
    "bertscore_recall": 0.43927857279777527,
    "bertscore_f1": 0.37663716077804565
  }
}