{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Arrival\nReview Date: 2017/11/20\nCategories: Drama, Science Fiction, Cerebral, Dreamlike\nProduct Description: ['When mysterious spacecraft touch down across the globe, an elite team - led by expert translator Louise Banks (Academy Award nominee Amy Adams) - races against time to decipher their intent.']\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English (US) [CC]', 'English [CC]'], 'Directors': ['---'], 'Producers': ['Shawn Levy', 'Dan Levine', 'Aaron Ryder', 'David Linde'], 'Starring': ['Amy Adams', 'Jeremy Renner', 'Forest Whitaker']}\nReview Text: Fantastic movie.  If you loved Contact, you'll definitely like this movie too.  Not the same, but the same feel.\nReview Title: Fantastic movie. If you loved Contact\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Stargate SG-1: Season 5\nMichael Shanks  (Actor),     Christopher Judge  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sci Fi Channel, All Sci Fi Channel Shows\n['Repackaged']\n{'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'Closed-captioned, Color, Multiple Formats, Dolby, NTSC, Widescreen', 'Contributor': 'Michael Shanks, Richard Dean Anderson, Christopher Judge, Amanda Tapping', 'Language': 'English (Dolby Surround), Spanish (Dolby Surround), French (Dolby Surround), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 0.01 Ounces', 'Item model number': '2221665', 'Media Format': 'Closed-captioned, Color, Multiple Formats, Dolby, NTSC, Widescreen', 'Run time': '16 hours and 13 minutes', 'Release date': 'April 6, 2010', 'Actors': 'Michael Shanks, Christopher Judge, Richard Dean Anderson, Amanda Tapping', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nHad seasons 1-4.  Season 5's box is the size of a single DVD rather than half a dozen of them like the previous ones I have.\nSeason 5's box is the size of a single DVD rather than half a dozen of them like the previous ones I have\nStargate Atlantis\nDrama, Action, Adventure, Science Fiction\n['The Wraith threat is ever-present while the team travels to new worlds and adventures in the Pegasus Galaxy. Season 3 thrusts Dr. Elizabeth Weir (Torri Higginson) and Maj. John Sheppard (Joe Flanigan) right back into action, and the Atlantis team sees the return of several favorite guest stars and meets a sinister new foe.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert C. Cooper', 'Andy Mikita', 'Brad Turner', 'Martin Wood', 'Will Waring', 'Paul Ziller'], 'Producers': ['Brad Wright', 'Robert C. Cooper', 'Carl Binder', 'Martin Gero']}\nHave watched the whole series three times now. Awesome show.\nAwesome show.\nMr. Holmes [DVD + Digital]\nIan McKellen  (Actor),     Laura Linney  (Actor),     Bill Condon  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Mr. Holmes is a new twist on the world’s most famous detective. In 1947, in his remote seaside farmhouse, an aging Sherlock Holmes (Ian McKellen, Academy Award (r) nominee, 2002, Best Actor in a Supporting Role, The Lord of the Rings: The Fellowship of the Ring) tends to his bees, with only the company of his housekeeper (Laura Linney, Academy Award (r) nominee, 2001, Best Actress in a Leading Role, You Can Count on Me) and her charming young son, Roger. Grappling with the diminishing powers of his mind, Holmes comes to rely upon the boy as he revisits the circumstances of the unsolved case that forced him into retirement, and searches for answers to the mysteries of life and love – before it's too late.\"]\n{'Genre': 'Crime', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Laura Linney, Bill Condon, Hiroyuki Sanada, Milo Parker, Jeffrey Hatcher, Ian McKellen, Mitch Cullin', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '35225428', 'Director': 'Bill Condon', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'November 10, 2015', 'Actors': 'Ian McKellen, Laura Linney, Milo Parker, Hiroyuki Sanada', 'Studio': 'Lionsgate Home Entertainment', 'Writers': 'Mitch Cullin, Jeffrey Hatcher', 'Number of discs': '1'}\nThe DVD makes is incredibly hard to start the movie, and once there, if you stop or turn of the movie for any reason, you can start it back up, either then or later, you have to go through all the 4 minutes of the DVD's &#34;starting&#34; garbage.<br /><br />I stopped half way into it last night, had to restart, wasted half an hour with scene selection (having to go through the 4 minutes of &#34;startup&#34; in between each selection), the when I finally found the place, accidentally pressed stop instead of play, which reset the DVD for the 10th time.  So I clicked eject.  So I can't say how good the movie is but this DVD is horribly made.<br /><br />My DVD player is perfectly capable of remembering where it left off other DVDs, even weeks later.  The studio spent tons of money on the movie then apparently gave the DVD & its menus to be made by their unemployed nephew for $20.\nSo I can't say how good the movie is but this DVD is HORRIBLY made.\nArrival\nDrama, Science Fiction, Cerebral, Dreamlike\n['When mysterious spacecraft touch down across the globe, an elite team - led by expert translator Louise Banks (Academy Award nominee Amy Adams) - races against time to decipher their intent.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English (US) [CC]', 'English [CC]'], 'Directors': ['---'], 'Producers': ['Shawn Levy', 'Dan Levine', 'Aaron Ryder', 'David Linde'], 'Starring': ['Amy Adams', 'Jeremy Renner', 'Forest Whitaker']}\nFantastic movie.  If you loved Contact, you'll definitely like this movie too.  Not the same, but the same feel.\nFantastic movie. If you loved Contact",
  "profile": "**User Profile Summary:**\n\n- **Primary Interest**: The user has a strong affinity for science fiction television and films, particularly those featuring fantasy elements and complex narratives. They enjoy content that resonates with iconic literary characters, such as Sherlock Holmes, and cerebral themes akin to films like \"Contact.\"\n  \n- **Content Preferences**: Prefers series and films that are part of well-established franchises, demonstrating a preference for enduring storylines and characters. Recent interactions show an appreciation for thought-provoking, dreamlike narratives.\n\n- **Format Preference**: Favors DVD collections, valuing the tangibility and high-quality formats. They have reported frustration with poorly designed DVDs, particularly those with navigation and playback issues, emphasizing their desire for quality packaging and presentation.\n\n- **Quality Appreciation**: Exhibits a keen eye for production quality and presentation. While they generally rate positively when products meet expectations, they express disappointment in cases of subpar usability, reflecting a strong commitment to high-quality media experiences.\n\n- **Engagement with Series**: Actively engages with multiple seasons of shows and frequently rewatched entire series, indicating a deep enjoyment and investment in extended narratives.\n\n- **Rating Behavior**: The user rates products based on quality and satisfaction. Their latest review demonstrates a high appreciation for well-made films, contributing positively to their overall rating behavior. This aligns with their established profile of valuing quality experiences while being critical of any shortcomings.",
  "metrics": {
    "rouge1_f": 0.15574548907882244,
    "rouge2_f": 0.007611798287345384,
    "rougeL_f": 0.06457739791073125,
    "meteor": 0.056495316862269884,
    "bleu1": 0.01002832908112687,
    "bleu2": 0.002304775828046748,
    "bleu3": 0.00038367060717442534,
    "bleu4": 0.00015668041223072408,
    "bertscore_precision": 0.35375770926475525,
    "bertscore_recall": 0.44007426500320435,
    "bertscore_f1": 0.39222320914268494
  }
}