{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Cilrofelr Makeup Liquid Blush,Blush Beauty Wand, Natural-looking Liquid Blush Wand Dewy Finish, Highly Pigmented, Easily Blendable, Weightless, Long-wearing (104 Cheery-Dark Rose)\nReview Date: 2023/02/13\nStore: Cilrofelr\nAverage Rating: 3.8\nProduct Details: {'Item Form': 'Cream', 'Finish Type': 'Glossy', 'Coverage': 'Lightweight', 'Brand': 'Cilrofelr', 'Color': 'Rose', 'Package Dimensions': '4.57 x 0.94 x 0.94 inches; 0.63 Ounces', 'Manufacturer': 'Cilrofelr'}\nReview Text: I think we all know what product this is trying to dupe so I didn't have very high expectations for this.  But I was actually really pleasantly surprised when I used it the first time.  I got the shade 101 and it is a really beautiful soft pink. It blended out so easily and it lasted all day. I love cream blushes and bronzers but they usually only last a few hours then they start to wear off so I'm really excited to find a cream blush that lasts on my skin. The only downside for me is that you don't get very much product in the tube so I don't expect it'll last very long. But at this price I don't mind too much.\nReview Title: It's actually really nice\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Baoyuan Makeup Brushes Color Removal Sponge and Mat Kit\nBaoyuan\n{'Package Dimensions': '6.61 x 5.55 x 1.69 inches; 2.54 Ounces', 'UPC': '703681245158'}\nThis thing does exactly what it says. Its actually made me kind of lazy cleaning my brushes because it does such a great job getting all the makeup off. The little silicone brush thingy is pretty useful.  It definitely helps me get my brushes clean faster.\nIt works\nSalux Nylon Japanese Beauty Skin Bath Wash Cloth/Towel - White2PACK\nSALUX\n['Beauty Skin Cloth is great for your skin. Use less soap and create more later This wash cloth is designed to stimulate your skin and help blood circulate leaving your skin feeling refreshed and smooth. It is excellent for massage.']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '34.65 x 34.65 x 0.04 inches; 2.88 Ounces', 'Item model number': 'AW00312PCK', 'UPC': '614409722533'}\nThese are amazing!  Even my husband loves them and I can never get him to exfoliate. It feels so great to wash with this.  If you like body scrubs i highly recommend try this because it is so much better.\nExfoliate everywhere!\nessence | Welcome to London Eyeshadow Palette | 12 Highly Pigmented, Matte & Metallic Blendable Shades | Vegan & Cruelty Free | Free From Oil, Fragrance, Parabens, Alcohol, & Microplastic Particles\nessence cosmetics\n{'Brand': 'Essence cosmetics', 'Item Form': 'Powder', 'Finish Type': 'Metallic, Matte', 'Special Feature': 'Cruelty Free', 'Number of Items': '1', 'Product Dimensions': '6.73 x 2.52 x 0.47 inches; 0.46 Ounces', 'Item model number': '934871', 'Manufacturer': 'Cosnova'}\nThis is my first time using essence eyeshadow and it will definitely not be my last. I never really use drug store eyeshadow and to be honest I don't think I have any in my collection.  But if this is the quality I can expect then that is about to change. I'm so impressed with the performance of these shadows! Most of the shades are buttery smooth and pigmented.  The mattes blend out so easily and I didn't get any patchiness. You do have to build these up but that is not necessarily a bad thing. There was quite a bit of kick up in the pan but I didn't get any fallout at all.  This color story is beautiful and even if you aren't a fan of colorful eyeshadow there's still lots to work with. I am very much looking forward to trying more palettes from this brand.\nI'm impressed!\nseedling Heated Eye Mask for Dry Eyes, Eye Compress Moist Heat, Silk sleep mask for dry eye relief, Plant Extract Warm Compress for Eyes, Stye Eye Therapy Mask (Blue)\nSeedling\n{'Brand': 'Seedling', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '1 Count', 'Item Dimensions LxWxH': '9.2 x 4.2 x 0.6 inches', 'Product Dimensions': '9.2 x 4.2 x 0.6 inches; 5.61 Ounces', 'Item model number': 'M', 'Manufacturer': 'seedling', 'Country of Origin': 'China'}\n[[VIDEOID:36d4410bf57b9b8fc73b6e62a0e7688b]] I've been dealing with dry eyes for a couple years now and I wear contacts so it can get pretty uncomfortable.  When I saw that these masks can help with dry eyes I had to give it a try. This has quickly become my favorite part of my nighttime routine.  It is so relaxing I think I could sleep with it on. I do wish it got a bit hotter but I guess they don't want you to burn your eyes.\nLove this!\nBaboo Kids Bamboo Toothbrush Soft Bristles - BPA Free Activated Charcoal - Organic Wooden Baby Tooth Brush - Eco-Friendly Biodegradable Toothbrushes for Toddlers, Child and Babies\nBABOO\n{'Brand': 'BABOO', 'Age Range (Description)': 'Kid', 'Special Feature': 'Charcoal Infused Bristle', 'Power Source': 'Battery Powered', 'Item Firmness Description': 'Ultra Soft', 'Product Dimensions': '5.12 x 0.44 x 0.44 inches; 0.42 Ounces', 'UPC': '869003000444', 'Material Feature': 'Biodegradable Warning', 'Manufacturer': 'Baboo'}\nThis is the cutest little toothbrush.  It's a little less than 6\" long.  It's the perfect size for small hands. The bristles are super soft so it won't be too rough on the kiddos. I like that they're black, I've never seen that before. The bamboo feels smooth and I'm not seeing any splintering so far.\nPerfect for little hands\nVitamasques Multivitamin Sleeping Mask Made with Essential Vitamins & Multi-Molecular Hyaluronic Acid for Healthy, Nourished & Hydrated Skin - Vegan, Free from Parabens & Gluten\nVitamasques\n{'Brand': 'Vitamasques', 'Scent': 'Hyaluronic Acid', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.0 Ounce', 'Number of Items': '1', 'Package Dimensions': '5.98 x 2.36 x 1.57 inches; 2.08 Ounces', 'UPC': '750258970081'}\n[[VIDEOID:890fbc174078c15263a7f9bc618c3905]] I've tried several things from this brand and so far this one is my favorite.  I'm surprised because I didn't expect to like it but I really enjoy it.  I've been using it after Thierry night cream.  It is really wet when you put it on. The little colored balls rub into your skin when you're applying.  It dries down and soaks into my skin so fast.  Plus it smells really good.  I love that it's a sleeping mask and you don't have to wash it off. I've got dry skin and the night cream alone wasn't enough moisture for me but adding this on top is so much better.\nLove this\nTropic Labs Washed Up All-In-One Shower Oil | Gentle Cleansing Body Wash, Bath Oil, & Shaving Oil | Sulfate-Free Body Oil Wash | Skin Moisturizing Body Rinse | Lightweight, Vegan & Cruelty-Free (TSA Friendly)\nTropic Labs\n{}\nI love this oil! I've got dry skin pretty much all the time and gets much worse in winter.  I've tried other oils but I didn't like the way they made my skin feel afterwards.  I hate it when my skin feels sticky and that's usually the way I feel after most oils and even moisturizers.  Not this though, it softens and moisturizes in the shower but it doesn't leave any stickiness behind. It does have a scent. I think it smells nice but if you're sensitive to fragrance this could be a problem for you.  I really love this product but I do think it's pretty expensive for the amount you get.\nIt's really great even though it's overpriced\nLUMINESS Silk Airbrush Spray Foundation - Full Coverage Foundation - Formula Hydrates & Moisturizes with Hyaluronic Acid, Aloe Vera & Hydrolyzed Silk (Shade - Tan)\nLUMINESS\n{'Color': 'Tan - 100', 'Finish Type': 'Satin', 'Package Information': 'Bottle', 'Brand': 'LUMINESS', 'Coverage': 'Full', 'UPC': '841249121725'}\nWhen I ordered this there were only two shade choices, fair light and medium.  I am a light neutral usually so I chose fair light.  It is too light for me but not so light that I can't make it work with bronzer. The instructions say to spray it on their brush then apply it. I wanted to spray it directly on my face so I did and it is the most immediate full coverage application I've ever had.  You do need to be careful because you could end up with it in your hair and whatnot. I also sprayed it on my sponge and applied it like that.  It worked fine that way but it wasn't as full coverage.<br />This takes a while to dry down and if you're like me and don't set your face this could be a problem when you're applying the rest of your makeup.  I did feel like my contour and bronzer was removing the foundation somewhat.  Once it dried down completely though it stayed.  The finish seemed more matte to me than satin but I have dry skin so that could be why. I think this is a really nice foundation but it takes some work. Also I seriously hope they do something about the shade range.\nVery full coverage\nDisposable Face Towel Extra Thick Lint-Free Disposable Face Cloths, Without Peculiar Smell, Cotton Tissue Dry Wipes for Sensitive Skin Face Cleansing, Surface Cleansing ,Baby Care, Travel,Outdoor Activities (70 Count (Pack of 1))\nXBSLPNCED\n{'Brand': 'XBSLPNCED', 'Skin Type': 'Dry,Sensitive', 'Material Feature': 'Disposable', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '9.76 x 8.43 x 4.06 inches; 1.07 Pounds', 'UPC': '727881143274'}\nThese towels are really great.  These are more textured than other similar towels I've tried.  These are super absorbent and very scrubby.\nThese are better\n14pcs Nail Drill Bits Set,3/32 Inch Acrylic Nail Drill Bits with Case,Quartz Pointed Nail Bits for Nails,Cuticle Remover Bits, Manicure Tools\nBouttarro\n{'Package Dimensions': '3.82 x 2.48 x 0.47 inches; 1.45 Ounces', 'Item model number': 'YSDMT014', 'UPC': '759060964790'}\nI love the round bits this kit comes with. You get three different sizes and the smallest one is so great for your cuticle area.  I like that the case isn't entirely filled up so you can add some others.\nLove the tiny round one\nVegan Mia - USDA Organic Radiance Superfruit Cleansing Oil and Make-up Remover, Oil Cleanser and Makeup Remover Oil for Dry Skin and Other Skin Types, Loaded with Moisturizer Essential Fatty Acids, Rich in Antioxidants, Truly Natural Skincare, (With No Added Fragrance) 3.4 fl oz\nVegan Mia\n{'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'Vegan Mia', 'Scent': 'Natural aroma of fruit oils - No fragrance added', 'Material Feature': 'Natural, Cruelty Free, Vegan', 'Package Dimensions': '6.34 x 1.77 x 1.73 inches; 9.14 Ounces', 'UPC': '762530483363', 'Manufacturer': 'Vegan Mia'}\nThis oil will remove your makeup super easily. It is very oily and I don't like using on my lashes but I will remove eyeshadow with it if I have a super glittery eye look that day.\nLike it for everything but lashes\nAIBRIT Gel Polish 4 Pcs Gel Base Coat, Strengthener Coat No Wipe Gel Top Coat Glossy Shiny & Matte Soak-off LED UV Light Gel Polish for Manicure Nail Art\nAIBRIT\n{'Brand': 'AIBRIT', 'Material Type Free': 'Non-toxic', 'Finish Type': 'Glossy, Matte', 'Material Feature': 'Non-Toxic', 'Unit Count': '1.00 Fl Oz', 'Number of Items': '4', 'Number of Pieces': '4', 'Liquid Volume': '0.33 Fluid Ounces'}\nI made the mistake of thinking the one labeled reinforced gel polish was supposed to be a top coat but it's definitely not. It still feels tacky after curing so I'm thinking it's just another base coat or a clear gel. It looks like you're supposed to apply it on top of your color before the top coat. Oops.<br />Regardless the base and top coats work well and the top coat is a no wipe. They played just fine with other brands of gel polish.\nCure in led/uv lamp\nCilrofelr Makeup Liquid Blush,Blush Beauty Wand, Natural-looking Liquid Blush Wand Dewy Finish, Highly Pigmented, Easily Blendable, Weightless, Long-wearing (104 Cheery-Dark Rose)\nCilrofelr\n{'Item Form': 'Cream', 'Finish Type': 'Glossy', 'Coverage': 'Lightweight', 'Brand': 'Cilrofelr', 'Color': 'Rose', 'Package Dimensions': '4.57 x 0.94 x 0.94 inches; 0.63 Ounces', 'Manufacturer': 'Cilrofelr'}\nI think we all know what product this is trying to dupe so I didn't have very high expectations for this.  But I was actually really pleasantly surprised when I used it the first time.  I got the shade 101 and it is a really beautiful soft pink. It blended out so easily and it lasted all day. I love cream blushes and bronzers but they usually only last a few hours then they start to wear off so I'm really excited to find a cream blush that lasts on my skin. The only downside for me is that you don't get very much product in the tube so I don't expect it'll last very long. But at this price I don't mind too much.\nIt's actually really nice",
  "actual_interaction": {
    "rating": 5.0,
    "title": "It's actually really nice",
    "text": "I think we all know what product this is trying to dupe so I didn't have very high expectations for this.  But I was actually really pleasantly surprised when I used it the first time.  I got the shade 101 and it is a really beautiful soft pink. It blended out so easily and it lasted all day. I love cream blushes and bronzers but they usually only last a few hours then they start to wear off so I'm really excited to find a cream blush that lasts on my skin. The only downside for me is that you don't get very much product in the tube so I don't expect it'll last very long. But at this price I don't mind too much.",
    "images": [],
    "asin": "B0BNH1LZ2P",
    "parent_asin": "B0BX53H8XD",
    "user_id": "AHSIR56YDJL76VXSFEKI5YQPYJ2Q",
    "timestamp": "2023-02-13 13:34:27.832000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Cilrofelr Makeup Liquid Blush,Blush Beauty Wand, Natural-looking Liquid Blush Wand Dewy Finish, Highly Pigmented, Easily Blendable, Weightless, Long-wearing (104 Cheery-Dark Rose)",
    "average_rating": 3.8,
    "rating_number": 73,
    "features": [
      "【Blendable & Smooth】Cilrofelr liquid blush wand come with airy, lightweight liquid formula blends effortlessly and goes on smooth for a soft flush of color. Liquid blush for cheeks layers beautifully over liquid/powder formulas without disturbing makeup.",
      "【Natural-look & Highly-pigmented】Cilrofelr blush beauty wand brings a flush of natural-looking color and lasting glow to all skin tones.Infused with long-lasting color pigments for all day wear,just a little goes a long way.",
      "【Easy to Apply】Liquid blush with sponge tip put two or three dots on your cheek.Just blend it with your fingers,you will build beautifully for a soft,weightless,blendable flush.TIP: Please tighten the head of applicator before unlock the super dewy liquid blush and don't forget to close the cap after use.",
      "【Cheek & Lip】 Blush wand can be used not only as a liquid blush stick and contour but also as an lip gloss. This super dewy liquid blush is compact to travel and easy to pack for trips or just carry in handbag for touchups.",
      "【Vegan & Cruelty-free】 There are five fresh rosy beautiful colors of liquid cheek blushyou can choose. soft cream blush applies beautifully over bare skin as well as over foundation.Cilrofelr provid 100% cruelty-free, fragrance-free, paraben-free and gluten-free formula. Never tested on animals."
    ],
    "description": [],
    "price": 9.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/313zPpF+g4L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/313zPpF+g4L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61lA0WttyVL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/4191+VKhr2L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/4191+VKhr2L.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61d-r1Xrk5L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51vXrYBB6TL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51vXrYBB6TL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81MXweYzs4L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41uPcGYt3LL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41uPcGYt3LL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71F-UnsVL0L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Z76K3OVLL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Z76K3OVLL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/718g1PYZ5ZL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51qSO5Q-YJL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51qSO5Q-YJL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71Xz5BofX8L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/416OlBMP2KL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/416OlBMP2KL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/712MiNMPvYL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Cilrofelr",
    "categories": [],
    "details": {
      "Item Form": "Cream",
      "Finish Type": "Glossy",
      "Coverage": "Lightweight",
      "Brand": "Cilrofelr",
      "Color": "Rose",
      "Package Dimensions": "4.57 x 0.94 x 0.94 inches; 0.63 Ounces",
      "Manufacturer": "Cilrofelr"
    },
    "bought_together": null
  }
}