{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Masterpiece Classic: Downton Abbey Season 3\nReview Date: 2017/05/05\nStore: Maggie Smith  (Actor),     Bonneville, Hugh  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Product Description', 'The Great War is over and a long-awaited engagement is on, but all is not tranquil at Downton Abbey as wrenching social changes, romantic intrigues, and personal crises grip the majestic English country estate for a third thrilling season. As other great houses are crippled psychologically and financially in the wake of World War I, Robert, Earl of Grantham, sticks to his duty to maintain Downton more firmly than ever. But in this changing landscape nothing is assured, and could it be that even the war-weary Crawleys must fight a new battle to safeguard their beloved Downton?  The returning cast includes Hugh Bonneville, Dame Maggie Smith, Elizabeth McGovern, Dan Stevens, Michelle Dockery, Jim Carter, Penelope Wilton, Joanne Froggatt, Brendan Coyle and a host of others, joined by Shirley MacLaine, who plays Martha Levinson, the very American mother of Cora, Countess of Grantham. Written and created by Julian Fellowes, Downton Abbey, Season 3 is a Carnival Films and Masterpiece co-production, in association with NBCUniversal.Includes the Downton Abbey Season 3 Finale, \"A Journey to the Highlands.\"', 'Amazon.com', 'The jewel in the', 'Masterpiece Classic', \"crown greets the 1920s with more history, romance--and dresses, gorgeous dresses. The old ways are changing, and the winds of social progress rustle through the well-appointed manor. Though war has ended, dark clouds gather as the Earl of Grantham (Hugh Bonneville) loses the family fortune to bad financial investments, the first of several shortsighted decisions on his part, making him the season's most unexpected villain--by contrast, even Mrs. O'Brien (Siobhan Finneran) doesn't seem so destructive. After his mother-in-law, Martha (Shirley MacLaine), arrives for the wedding of Mary (Michelle Dockery) and Matthew (Dan Stevens), Robert pins his hopes on the affluent American to bail them out. As expected, the tradition-minded Dowager Countess (Dame Maggie Smith) clashes with the thoroughly modern matron, who suggests they look elsewhere for a handout.\", 'While visiting from Dublin, Sybil\\'s husband, former chauffeur Tom Branson (Allen Leech, who really comes in to his own), clashes with most everyone until a tragedy helps to heal the political and religious divides, allowing him to more fully integrate into their world, a theme that runs throughout the year. Other conflicts revolve around Edith\\'s fiancé, Sir Anthony (Robert Bathurst), and the new footman, Alfred (Matt Milne), who strikes Thomas (Rob James-Collier) as a threat to his hegemony. Though Daisy (Sophie McShera) finds him appealing, Alfred prefers her kitchen colleague, Ivy (Cara Theobold), but she only has eyes for Jimmy (Ed Speleers), whom Mrs. Hughes (Phyllis Logan) aptly describes as \"vain and silly.\" In its third go-round, some storylines meander unnecessarily, like the saga of the fallen woman trying to reenter respectable society, but the multiple plotlines are always easy to follow, and', 'Downton', 'remains gloriously addictive. Abundant extra features examine every aspect of the production, including the tragic event that concludes the finale.', 'Kathleen C. Fennessy']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Smith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley MaclaineSmith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley Maclaine  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': '552840', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Maggie Smith, Bonneville, Hugh, Shirley Maclaine, Elizabeth McGovern', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '3'}\nReview Text: Prefect\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Yo Gabba Gabba: There's a Party in My City! Live Concert\nBiz Markie  (Actor),     Yo Gabba Gabba  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Join D.J. Lance Rock, Brobee, Toodee, Foofa, Plex, Muno and all of our favorite Yo Gabba Gabba! friends for their first-ever live concert! Yo Gabba Gabba! Live!: There's a Party in My City! is a non-stop musical extravaganza. Get up on your feet to sing and dance along over ten Gabba favorites, including: There's a Party in My Tummy, Name Game and Get The Sillies Out. This full-length concert is packed with special guests including beatboxing legend Biz Markie performing Biz's Beat of the Day, the incomparable Leslie Hall & DO IT teaching a Dancey Dance, and Super Music Friends Show guest The Aquabats performing everyone's favorite, Pool Party. Yo Gabba Gabba! Live!: There's a Party in My City! will get the whole family dancing and singing no matter what city you're in!\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '24252976', 'Director': 'Yo Gabba Gabba', 'Media Format': 'NTSC', 'Run time': '1 hour', 'Release date': 'March 13, 2012', 'Actors': 'Biz Markie', 'Studio': 'NCircle Entertainment', 'Number of discs': '1'}\nGot this for my grandson. He quickly ripped open the envelope and jumper up & down! Great choice to make me his special grandmother\nLove this movie\nSpaced Invaders [DVD]\nDouglas Barr  (Actor),     Royal Dano  (Actor),     Patrick Read Johnson  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Aliens\n[\"They're hip! They're hilarious! Earth will never be the same! It's a close encounter of the hilarious kind when five of the universe's coolest aliens crash-land on planet Earth! Piloted by an ultrahip Martian, the cosmic crew ends up in a sleepy Midwestern town. Unfortunately, it's Halloween night and the citizens mistake these spaced invaders for harmless trick-or-treaters. Instead of the global invasion they planned on, these misguided Martians bungle their way into a series of madcap misadventures! Get set for an outrageous blast of intergalactic fun and outlandish special effects in this wacked-out comedy-adventure!\"]\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Color, DVD, Widescreen, NTSC', 'Contributor': \"Barry O'Neill, Patrick Read Johnson, Wayne Alexander, Gregg Berger, Adam Hansley, J.J. Anderson, Fred Applegate, Ryan Todd, Douglas Barr, Ariana Richards, Patrika Darbo, Scott Lawrence Alexander, Royal Dano, Tonya Lee WilliamsBarry O'Neill, Patrick Read Johnson, Wayne Alexander, Gregg Berger, Adam Hansley, J.J. Anderson, Fred Applegate, Ryan Todd, Douglas Barr, Ariana Richards, Patrika Darbo, Scott Lawrence Alexander, Royal Dano, Tonya Lee Williams  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.64 Ounces', 'Director': 'Patrick Read Johnson', 'Media Format': 'Color, DVD, Widescreen, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 3, 2002', 'Actors': 'Douglas Barr, Royal Dano, Ariana Richards, J.J. Anderson, Gregg Berger', 'Studio': 'Buena Vista Pictures / Mill Creek', 'Writers': 'Patrick Read Johnson, Scott Lawrence Alexander', 'Number of discs': '1'}\nquick delivery - great movie\nFour Stars\nAnnie\nJamie Foxx  (Actor),     Quvenzhané Wallis  (Actor),     Will Gluck  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Customers who have shown an interest in \"Annie\" might like to know that Amazon.com exclusive mobile and desktop wallpapers are available. Select the desired image from those available located to the left of the product image (to the right for mobile) of this detail page, save the image to your device, and set the image as your background (process may vary by device).']\n{'Genre': 'Children/Family, Family, Comedy', 'Format': 'Ultraviolet, NTSC', 'Contributor': 'Jamie Foxx, Adewale Akinnuoye-Agbaje, Bobby Cannavale, Rose Byrne, Eden Duncan-Smith, Nicolette Pierini, Caleeb Pinkett, James Lassiter, Jada Smith, Stephanie Kurtzuba, Mike Birbiglia, Shawn \"Jay Z\" Carter, Laurence Brown, Will Smith, Zoe Colletti, Tracie Thoms, Columbia Pictures; Overbrook Entertainment Inc., Tyran \"Ty Ty\" Smith, Amanda Troya, Will Gluck, Quvenzhané Wallis, David Zayas, Cameron Diaz, Dorian MissickJamie Foxx, Adewale Akinnuoye-Agbaje, Bobby Cannavale, Rose Byrne, Eden Duncan-Smith, Nicolette Pierini, Caleeb Pinkett, James Lassiter, Jada Smith, Stephanie Kurtzuba, Mike Birbiglia, Shawn \"Jay Z\" Carter, Laurence Brown, Will Smith, Zoe Colletti, Tracie Thoms, Col…   See more', 'Language': 'English', 'Runtime': '1 hour and 58 minutes', 'Digital Copy Expiration Date': 'December 31, 2018', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '33569456', 'Director': 'Will Gluck', 'Media Format': 'Ultraviolet, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'March 17, 2015', 'Actors': 'Jamie Foxx, Quvenzhané Wallis, Rose Byrne, Bobby Cannavale, Adewale Akinnuoye-Agbaje', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Shawn \"Jay Z\" Carter, Laurence Brown, Caleeb Pinkett, Will Gluck, James Lassiter', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGrandkids enjoys it\nThree Stars\nVeggie Tales: Lord of the Beans, A Lesson in Using Your GIfts\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'VeggieTales: Lord of the Beans ™ follows the fantastic journey of a Flobbit named Toto Baggypants (Junior Asparagus) who inherits a most unusual and powerful bean. With the help of his mentor Randalf and a spirited group of friends, Toto embarks on a mission to discover how he should use his gift. On their quest, the group encounters many challenges, including crossing the mountains of Much-Snowia, and facing the dreaded Lord Scaryman – who seeks the bean for misguided, selfish reasons. Will Toto discover the purpose of his gift, or will the scary dude and his Spork army capture the bean and wield its awesome powers? Find out in VeggieTales: Lord of the Beans.™', 'Bonus Content:', 'Behind the Scenes', 'Behind the Scenes', 'Wynonna Music Video', 'Wynonna Music Video', 'Interview with Wynonna', 'Interview with Wynonna', 'Video Trivia', 'Video Trivia', 'Sing-Along with Larry', 'Sing-Along with Larry', 'Lord of the Beans Game', 'Lord of the Beans Game', \"Toto's Family Activity\", \"Toto's Family Activity\", \"The Other Elf's Secret Cookie Recipe\", \"The Other Elf's Secret Cookie Recipe\", 'How to Draw Toto', 'How to Draw Toto', 'How to Draw Leg-O-Lamb', 'How to Draw Leg-O-Lamb', 'Previews', 'Previews', ']]>', 'About the Author', 'Cuando el animador por computadora, Phil Vischer, busco una nueva manera de integrar la fe con los cuentos, nacio un tomate llamado Bob y un pepino llamado Larry. VeggieTales paso a revolucionar la cinematografia cristiana, vendiendo mas de 40 millones de videos y poniendo sus historias llenas de fe en uno de cada tres hogares norteamericanos con ninos pequenos. Vive con su esposa Lisa, sus tres hijos y un perro en Illinois.Mike Nawrocki is co-creator of the popular series, VeggieTales . Acting as the voice of Larry the Cucumber, and several other Veggie characters, Mike also wrote, directed, and contributed to the development of the 3-2-1 Penguins series. He resides in Chicago, IL, with his wife and 2 children.Cuando el animador por computadora, Phil Vischer, busco una nueva manera de integrar la fe con los cuentos, nacio un tomate llamado Bob y un pepino llamado Larry. VeggieTales paso a revolucionar la cinematografia cristiana, vendiendo mas de 40 millones de videos y poniendo sus historias llenas de fe en uno de cada tres hogares norteamericanos con ninos pequenos. Vive con su esposa Lisa, sus tres hijos y un perro en Illinois.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'BIDE58797DVD', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '53 minutes', 'Release date': 'July 2, 2012', 'Actors': 'Veggie Tales', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nLove veggie tales\nThree Stars\nDownton Abbey: Season 4\nFormat: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nPrefect\nFour Stars\nMasterpiece: Downton Abbey Season 5\nHugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter  (Actor),     .  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Golden Globe Central, Golden Globe Nominees\n['Season 5 of the international hit finds the Crawley family and the staff struggling with responsibilities and choices as they adjust to life in the Roaring Twenties. The beloved ensemble cast includes Dame Maggie Smith, Elizabeth McGovern, Hugh Bonneville, Michelle Dockery, Jim Carter, Joanne Froggatt, and a host of others. Region 1 US and Canada']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter, .', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'PBSDMST64500DVD', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 27, 2015', 'Actors': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nPrefect\nFour Stars\nMasterpiece Classic: Downton Abbey Season 3\nMaggie Smith  (Actor),     Bonneville, Hugh  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The Great War is over and a long-awaited engagement is on, but all is not tranquil at Downton Abbey as wrenching social changes, romantic intrigues, and personal crises grip the majestic English country estate for a third thrilling season. As other great houses are crippled psychologically and financially in the wake of World War I, Robert, Earl of Grantham, sticks to his duty to maintain Downton more firmly than ever. But in this changing landscape nothing is assured, and could it be that even the war-weary Crawleys must fight a new battle to safeguard their beloved Downton?  The returning cast includes Hugh Bonneville, Dame Maggie Smith, Elizabeth McGovern, Dan Stevens, Michelle Dockery, Jim Carter, Penelope Wilton, Joanne Froggatt, Brendan Coyle and a host of others, joined by Shirley MacLaine, who plays Martha Levinson, the very American mother of Cora, Countess of Grantham. Written and created by Julian Fellowes, Downton Abbey, Season 3 is a Carnival Films and Masterpiece co-production, in association with NBCUniversal.Includes the Downton Abbey Season 3 Finale, \"A Journey to the Highlands.\"', 'Amazon.com', 'The jewel in the', 'Masterpiece Classic', \"crown greets the 1920s with more history, romance--and dresses, gorgeous dresses. The old ways are changing, and the winds of social progress rustle through the well-appointed manor. Though war has ended, dark clouds gather as the Earl of Grantham (Hugh Bonneville) loses the family fortune to bad financial investments, the first of several shortsighted decisions on his part, making him the season's most unexpected villain--by contrast, even Mrs. O'Brien (Siobhan Finneran) doesn't seem so destructive. After his mother-in-law, Martha (Shirley MacLaine), arrives for the wedding of Mary (Michelle Dockery) and Matthew (Dan Stevens), Robert pins his hopes on the affluent American to bail them out. As expected, the tradition-minded Dowager Countess (Dame Maggie Smith) clashes with the thoroughly modern matron, who suggests they look elsewhere for a handout.\", 'While visiting from Dublin, Sybil\\'s husband, former chauffeur Tom Branson (Allen Leech, who really comes in to his own), clashes with most everyone until a tragedy helps to heal the political and religious divides, allowing him to more fully integrate into their world, a theme that runs throughout the year. Other conflicts revolve around Edith\\'s fiancé, Sir Anthony (Robert Bathurst), and the new footman, Alfred (Matt Milne), who strikes Thomas (Rob James-Collier) as a threat to his hegemony. Though Daisy (Sophie McShera) finds him appealing, Alfred prefers her kitchen colleague, Ivy (Cara Theobold), but she only has eyes for Jimmy (Ed Speleers), whom Mrs. Hughes (Phyllis Logan) aptly describes as \"vain and silly.\" In its third go-round, some storylines meander unnecessarily, like the saga of the fallen woman trying to reenter respectable society, but the multiple plotlines are always easy to follow, and', 'Downton', 'remains gloriously addictive. Abundant extra features examine every aspect of the production, including the tragic event that concludes the finale.', 'Kathleen C. Fennessy']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Smith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley MaclaineSmith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley Maclaine  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': '552840', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Maggie Smith, Bonneville, Hugh, Shirley Maclaine, Elizabeth McGovern', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '3'}\nPrefect\nFour Stars",
  "profile": "**User Summary:**\n\n- **Target Audience**: Engaging children and families remains a priority, with a continued focus on family-oriented content suitable for younger members.\n- **Content Type**: The user enjoys interactive, musical, and performance-based entertainment that promotes singing and dancing, alongside comedic and adventurous themes. Recently, the user has demonstrated a notable appreciation for quality drama series, indicating a broadened interest across genres.\n- **Emotional Engagement**: Values joyful family moments as a dedicated grandparent while nurturing deeper connections through storytelling. The user seeks narratives that foster moral lessons and stronger familial bonds.\n- **Rating Preference**: Traditionally favors high-quality offerings, typically rating between 4 to 5 stars. Recent interactions show an openness to diverse genres, maintaining a commitment to quality with a recent 4-star rating on a highly regarded drama.\n- **Purchase Motivation**: Aims to entertain and promote laughter within the family, increasingly incorporating comedic elements while embracing impactful narratives and character-driven stories.\n- **Product Format**: Continues to prefer physical media, such as DVDs, for accessible family viewing experiences, reflecting a dedication to quality presentation.\n\nThe updated profile highlights a balanced appreciation for both children's entertainment and engaging dramas, emphasizing the user’s commitment to nurturing family relationships while exploring a wider range of high-quality storytelling.",
  "metrics": {
    "rouge1_f": 0.07635829662261381,
    "rouge2_f": 0.006612784717119765,
    "rougeL_f": 0.038913362701908955,
    "meteor": 0.021638999659958576,
    "bleu1": 1.4625251187227887e-06,
    "bleu2": 4.765484879486732e-07,
    "bleu3": 6.852708748076478e-08,
    "bleu4": 2.601088080673125e-08,
    "bertscore_precision": 0.33437350392341614,
    "bertscore_recall": 0.4815005660057068,
    "bertscore_f1": 0.3946712613105774
  }
}