{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Francis the Talking Mule Complete Collection\nReview Date: 2021/06/13\nStore: Donald O'Connor  (Actor),     Mickey Rooney  (Actor),     Arthur Lubin  (Director),     Charles Lamont  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Comedy\nProduct Description: [\"Francis the Talking Mule Complete Collection features the hilarious escapades of the delightfully funny, old army mule…who happens to talk! Including all 7 movies from one of the most beloved comic series, Donald O'Connor stars as bewildered soldier Peter Stirling, who is helped out of one tricky situation after another by the unlikeliest of heroes, his pal Francis. Join the smart-alecky talking mule who continues to enchant audiences with his yackety-yakking, wise-cracking antics that the whole family can enjoy!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Drama, Comedy', 'Format': 'Multiple Formats, Box set, NTSC, Black & White', 'Contributor': \"Devery Freeman, Mickey Rooney, James B. Allardice, Alice Kelley, Richard Gaines, Virginia Welles, Clint Eastwood, David Janssen, Charles Lamont, Ray Collins, Herbert Margolis, Lori Nelson, Piper Laurie, Arthur Lubin, Patricia Medina, David Stern, Cecil Kellaway, Gene Lockhart, Martha Hyer, John McIntire, Tony Curtis, Donald O'Connor, Jim Backus, Ted Richmond, Zasu Pitts, Robert Arthur, Jesse White, Paul Cavanagh, Julie Adams, William Raynor, Yvette Dugay, Chill WillsDevery Freeman, Mickey Rooney, James B. Allardice, Alice Kelley, Richard Gaines, Virginia Welles, Clint Eastwood, David Janssen, Charles Lamont, Ray Collins, Herbert Margolis, Lori Nelson, Piper Laurie, Arthur Lubin, Patricia Medina, David Stern, Cecil Kellaway, Gene Lockh…  See more\", 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 4.8 Ounces', 'Director': 'Arthur Lubin, Charles Lamont', 'Media Format': 'Multiple Formats, Box set, NTSC, Black & White', 'Run time': '10 hours and 4 minutes', 'Release date': 'April 29, 2014', 'Actors': \"Donald O'Connor, Mickey Rooney, Piper Laurie, Patricia Medina, Yvette Dugay\", 'Subtitles': 'French, Spanish', 'Producers': 'Ted Richmond, Robert Arthur', 'Studio': 'Studio Distribution Services', 'Writers': 'Devery Freeman, James B. Allardice, Herbert Margolis, William Raynor, David Stern', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Comedy at its best\nReview Title: Classic\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Yo Gabba Gabba: There's a Party in My City! Live Concert\nBiz Markie  (Actor),     Yo Gabba Gabba  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Join D.J. Lance Rock, Brobee, Toodee, Foofa, Plex, Muno and all of our favorite Yo Gabba Gabba! friends for their first-ever live concert! Yo Gabba Gabba! Live!: There's a Party in My City! is a non-stop musical extravaganza. Get up on your feet to sing and dance along over ten Gabba favorites, including: There's a Party in My Tummy, Name Game and Get The Sillies Out. This full-length concert is packed with special guests including beatboxing legend Biz Markie performing Biz's Beat of the Day, the incomparable Leslie Hall & DO IT teaching a Dancey Dance, and Super Music Friends Show guest The Aquabats performing everyone's favorite, Pool Party. Yo Gabba Gabba! Live!: There's a Party in My City! will get the whole family dancing and singing no matter what city you're in!\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '24252976', 'Director': 'Yo Gabba Gabba', 'Media Format': 'NTSC', 'Run time': '1 hour', 'Release date': 'March 13, 2012', 'Actors': 'Biz Markie', 'Studio': 'NCircle Entertainment', 'Number of discs': '1'}\nGot this for my grandson. He quickly ripped open the envelope and jumper up & down! Great choice to make me his special grandmother\nLove this movie\nSpaced Invaders [DVD]\nDouglas Barr  (Actor),     Royal Dano  (Actor),     Patrick Read Johnson  (Director, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Aliens\n[\"They're hip! They're hilarious! Earth will never be the same! It's a close encounter of the hilarious kind when five of the universe's coolest aliens crash-land on planet Earth! Piloted by an ultrahip Martian, the cosmic crew ends up in a sleepy Midwestern town. Unfortunately, it's Halloween night and the citizens mistake these spaced invaders for harmless trick-or-treaters. Instead of the global invasion they planned on, these misguided Martians bungle their way into a series of madcap misadventures! Get set for an outrageous blast of intergalactic fun and outlandish special effects in this wacked-out comedy-adventure!\"]\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Color, DVD, Widescreen, NTSC', 'Contributor': \"Barry O'Neill, Patrick Read Johnson, Wayne Alexander, Gregg Berger, Adam Hansley, J.J. Anderson, Fred Applegate, Ryan Todd, Douglas Barr, Ariana Richards, Patrika Darbo, Scott Lawrence Alexander, Royal Dano, Tonya Lee WilliamsBarry O'Neill, Patrick Read Johnson, Wayne Alexander, Gregg Berger, Adam Hansley, J.J. Anderson, Fred Applegate, Ryan Todd, Douglas Barr, Ariana Richards, Patrika Darbo, Scott Lawrence Alexander, Royal Dano, Tonya Lee Williams  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.64 Ounces', 'Director': 'Patrick Read Johnson', 'Media Format': 'Color, DVD, Widescreen, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 3, 2002', 'Actors': 'Douglas Barr, Royal Dano, Ariana Richards, J.J. Anderson, Gregg Berger', 'Studio': 'Buena Vista Pictures / Mill Creek', 'Writers': 'Patrick Read Johnson, Scott Lawrence Alexander', 'Number of discs': '1'}\nquick delivery - great movie\nFour Stars\nAnnie\nJamie Foxx  (Actor),     Quvenzhané Wallis  (Actor),     Will Gluck  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Customers who have shown an interest in \"Annie\" might like to know that Amazon.com exclusive mobile and desktop wallpapers are available. Select the desired image from those available located to the left of the product image (to the right for mobile) of this detail page, save the image to your device, and set the image as your background (process may vary by device).']\n{'Genre': 'Children/Family, Family, Comedy', 'Format': 'Ultraviolet, NTSC', 'Contributor': 'Jamie Foxx, Adewale Akinnuoye-Agbaje, Bobby Cannavale, Rose Byrne, Eden Duncan-Smith, Nicolette Pierini, Caleeb Pinkett, James Lassiter, Jada Smith, Stephanie Kurtzuba, Mike Birbiglia, Shawn \"Jay Z\" Carter, Laurence Brown, Will Smith, Zoe Colletti, Tracie Thoms, Columbia Pictures; Overbrook Entertainment Inc., Tyran \"Ty Ty\" Smith, Amanda Troya, Will Gluck, Quvenzhané Wallis, David Zayas, Cameron Diaz, Dorian MissickJamie Foxx, Adewale Akinnuoye-Agbaje, Bobby Cannavale, Rose Byrne, Eden Duncan-Smith, Nicolette Pierini, Caleeb Pinkett, James Lassiter, Jada Smith, Stephanie Kurtzuba, Mike Birbiglia, Shawn \"Jay Z\" Carter, Laurence Brown, Will Smith, Zoe Colletti, Tracie Thoms, Col…   See more', 'Language': 'English', 'Runtime': '1 hour and 58 minutes', 'Digital Copy Expiration Date': 'December 31, 2018', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': '33569456', 'Director': 'Will Gluck', 'Media Format': 'Ultraviolet, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'March 17, 2015', 'Actors': 'Jamie Foxx, Quvenzhané Wallis, Rose Byrne, Bobby Cannavale, Adewale Akinnuoye-Agbaje', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Shawn \"Jay Z\" Carter, Laurence Brown, Caleeb Pinkett, Will Gluck, James Lassiter', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGrandkids enjoys it\nThree Stars\nVeggie Tales: Lord of the Beans, A Lesson in Using Your GIfts\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'VeggieTales: Lord of the Beans ™ follows the fantastic journey of a Flobbit named Toto Baggypants (Junior Asparagus) who inherits a most unusual and powerful bean. With the help of his mentor Randalf and a spirited group of friends, Toto embarks on a mission to discover how he should use his gift. On their quest, the group encounters many challenges, including crossing the mountains of Much-Snowia, and facing the dreaded Lord Scaryman – who seeks the bean for misguided, selfish reasons. Will Toto discover the purpose of his gift, or will the scary dude and his Spork army capture the bean and wield its awesome powers? Find out in VeggieTales: Lord of the Beans.™', 'Bonus Content:', 'Behind the Scenes', 'Behind the Scenes', 'Wynonna Music Video', 'Wynonna Music Video', 'Interview with Wynonna', 'Interview with Wynonna', 'Video Trivia', 'Video Trivia', 'Sing-Along with Larry', 'Sing-Along with Larry', 'Lord of the Beans Game', 'Lord of the Beans Game', \"Toto's Family Activity\", \"Toto's Family Activity\", \"The Other Elf's Secret Cookie Recipe\", \"The Other Elf's Secret Cookie Recipe\", 'How to Draw Toto', 'How to Draw Toto', 'How to Draw Leg-O-Lamb', 'How to Draw Leg-O-Lamb', 'Previews', 'Previews', ']]>', 'About the Author', 'Cuando el animador por computadora, Phil Vischer, busco una nueva manera de integrar la fe con los cuentos, nacio un tomate llamado Bob y un pepino llamado Larry. VeggieTales paso a revolucionar la cinematografia cristiana, vendiendo mas de 40 millones de videos y poniendo sus historias llenas de fe en uno de cada tres hogares norteamericanos con ninos pequenos. Vive con su esposa Lisa, sus tres hijos y un perro en Illinois.Mike Nawrocki is co-creator of the popular series, VeggieTales . Acting as the voice of Larry the Cucumber, and several other Veggie characters, Mike also wrote, directed, and contributed to the development of the 3-2-1 Penguins series. He resides in Chicago, IL, with his wife and 2 children.Cuando el animador por computadora, Phil Vischer, busco una nueva manera de integrar la fe con los cuentos, nacio un tomate llamado Bob y un pepino llamado Larry. VeggieTales paso a revolucionar la cinematografia cristiana, vendiendo mas de 40 millones de videos y poniendo sus historias llenas de fe en uno de cada tres hogares norteamericanos con ninos pequenos. Vive con su esposa Lisa, sus tres hijos y un perro en Illinois.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'BIDE58797DVD', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '53 minutes', 'Release date': 'July 2, 2012', 'Actors': 'Veggie Tales', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '1'}\nLove veggie tales\nThree Stars\nDownton Abbey: Season 4\nFormat: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The sweeping Downton Abbey saga continues with a fourth season of drama, romance, and family intrigue. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic Lord Crawley; Elizabeth McGovern is his American wife, Cora, and Michelle Dockery is their daughter Lady Mary. From Academy Award-winner Julian Fellowes.', 'Review', 'A glowing success. --The Telegraph (UK)Well-performed, beautifully scripted --The Independent (UK)A classic that will last for a long time to come. --The Independent (UK)The Sopranos was once the quintessential American television show. Now, it s Downton Abbey . --The New York Times...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today3.5 stars out of 4 - Walking a fine line between appreciation for the rituals and codes of this long-gone way of life and offering a gentle critique of the doomed culture of privilege, Downton Abbey has amassed a huge American following that will be clamoring for this latest set. --Video Librarian...Masterpiece s returning Downton Abbey is still a recommended stop, a place filled with witty conversations, luxe accommodations and beautiful people in equally beautiful clothes... --USA Today']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Box set, Widescreen, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Runtime': '8 hours and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 4 Ounces', 'Item model number': '452560', 'Media Format': 'Box set, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 28, 2014', 'Actors': 'Downton Abbey', 'Dubbed': 'Adygei', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nPrefect\nFour Stars\nMasterpiece: Downton Abbey Season 5\nHugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter  (Actor),     .  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Golden Globe Central, Golden Globe Nominees\n['Season 5 of the international hit finds the Crawley family and the staff struggling with responsibilities and choices as they adjust to life in the Roaring Twenties. The beloved ensemble cast includes Dame Maggie Smith, Elizabeth McGovern, Hugh Bonneville, Michelle Dockery, Jim Carter, Joanne Froggatt, and a host of others. Region 1 US and Canada']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter, .', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'PBSDMST64500DVD', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 27, 2015', 'Actors': 'Hugh Bonneville, Laura Carmichael, Michelle Dockery, Maggie Smith, Jim Carter', 'Dubbed': 'English', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '3'}\nPrefect\nFour Stars\nMasterpiece Classic: Downton Abbey Season 3\nMaggie Smith  (Actor),     Bonneville, Hugh  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Product Description', 'The Great War is over and a long-awaited engagement is on, but all is not tranquil at Downton Abbey as wrenching social changes, romantic intrigues, and personal crises grip the majestic English country estate for a third thrilling season. As other great houses are crippled psychologically and financially in the wake of World War I, Robert, Earl of Grantham, sticks to his duty to maintain Downton more firmly than ever. But in this changing landscape nothing is assured, and could it be that even the war-weary Crawleys must fight a new battle to safeguard their beloved Downton?  The returning cast includes Hugh Bonneville, Dame Maggie Smith, Elizabeth McGovern, Dan Stevens, Michelle Dockery, Jim Carter, Penelope Wilton, Joanne Froggatt, Brendan Coyle and a host of others, joined by Shirley MacLaine, who plays Martha Levinson, the very American mother of Cora, Countess of Grantham. Written and created by Julian Fellowes, Downton Abbey, Season 3 is a Carnival Films and Masterpiece co-production, in association with NBCUniversal.Includes the Downton Abbey Season 3 Finale, \"A Journey to the Highlands.\"', 'Amazon.com', 'The jewel in the', 'Masterpiece Classic', \"crown greets the 1920s with more history, romance--and dresses, gorgeous dresses. The old ways are changing, and the winds of social progress rustle through the well-appointed manor. Though war has ended, dark clouds gather as the Earl of Grantham (Hugh Bonneville) loses the family fortune to bad financial investments, the first of several shortsighted decisions on his part, making him the season's most unexpected villain--by contrast, even Mrs. O'Brien (Siobhan Finneran) doesn't seem so destructive. After his mother-in-law, Martha (Shirley MacLaine), arrives for the wedding of Mary (Michelle Dockery) and Matthew (Dan Stevens), Robert pins his hopes on the affluent American to bail them out. As expected, the tradition-minded Dowager Countess (Dame Maggie Smith) clashes with the thoroughly modern matron, who suggests they look elsewhere for a handout.\", 'While visiting from Dublin, Sybil\\'s husband, former chauffeur Tom Branson (Allen Leech, who really comes in to his own), clashes with most everyone until a tragedy helps to heal the political and religious divides, allowing him to more fully integrate into their world, a theme that runs throughout the year. Other conflicts revolve around Edith\\'s fiancé, Sir Anthony (Robert Bathurst), and the new footman, Alfred (Matt Milne), who strikes Thomas (Rob James-Collier) as a threat to his hegemony. Though Daisy (Sophie McShera) finds him appealing, Alfred prefers her kitchen colleague, Ivy (Cara Theobold), but she only has eyes for Jimmy (Ed Speleers), whom Mrs. Hughes (Phyllis Logan) aptly describes as \"vain and silly.\" In its third go-round, some storylines meander unnecessarily, like the saga of the fallen woman trying to reenter respectable society, but the multiple plotlines are always easy to follow, and', 'Downton', 'remains gloriously addictive. Abundant extra features examine every aspect of the production, including the tragic event that concludes the finale.', 'Kathleen C. Fennessy']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Smith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley MaclaineSmith, Maggie, McGovern, Elizabeth, Elizabeth McGovern, Bonneville, Hugh, Maggie Smith, Shirley Maclaine  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': '552840', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '8 hours and 45 minutes', 'Release date': 'January 29, 2013', 'Actors': 'Maggie Smith, Bonneville, Hugh, Shirley Maclaine, Elizabeth McGovern', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '3'}\nPrefect\nFour Stars\nTangled\nMandy Moore  (Actor),     Zachary Levi  (Actor),     Nathan Greno  (Director),     Byron Howard  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney presents a new twist on one of the most hilarious and hair-raising tales ever told. Your whole family will get tangled up in the fun, excitement and adventure of this magical motion picture.When the kingdom\\'s most wanted - and most charming - bandit Flynn Rider hides in a mysterious tower, the last thing he expects to find is Rapunzel, a spirited teen with an unlikely superpower - 70 feet of magical golden hair! Together, the unlikely duo sets off on a fantastic journey filled with surprising heroes, laughter and suspense.Let your hair down and get ready to cheer for \"Tangled.\" Bursting with never-before-seen bonus features, it\\'s even more enchanting on Blu-ray Hi-Def.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, SubtitledMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled  See more', 'Contributor': 'M.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. TompkinsM.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. Tompkins  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'WD10633400DVD', 'Director': 'Nathan Greno, Byron Howard', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 29, 2011', 'Actors': 'Mandy Moore, Zachary Levi, Donna Murphy, Ron Perlman, M.C. Gainey', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Walt Disney Pictures', 'Number of discs': '1'}\nPrefect\nThree Stars\nMasterpiece Classic: Downton Abbey, Season 1\nRated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Downton Abbeya sprawling, lavish Edwardian mansion nestled in the Yorkshire landscapeneeds an heir. Dame Maggie Smith stars as Violet, the stubborn Dowager Countess of Grantham, matriarch of Downton. Hugh Bonneville stars as her son, the stoic, unflappable Lord Crawley; Elizabeth McGovern is his far-sighted American wife, Cora. From Academy Award®-winner Julian Fellowes (Gosford Park).', 'Amazon.com', \"An addictive blend of suds and social commentary, ITV's\", 'Downton Abbey', 'brings a microcosm of Edwardian society together under one roof. Lord Robert Crawley (Hugh Bonneville) and his family live a life of leisure, while a fleet of servants, including butler Carson (Jim Carter), attend to their every need, but two events conspire to shake things up: the sinking of the', 'Titanic', \", which claims Crawley's heirs, and the return of his valet, Bates (Brendan Coyle). Since Crawley and Lady Cora (Elizabeth McGovern) have three daughters, his distant solicitor cousin, Matthew (Dan Stevens), becomes heir to the estate. With that, the scheming begins, since Thomas the footman (Rob James-Collier) views Bates as an interloper and Crawley's mother, Violet (Maggie Smith), feels the same way about Matthew's mother, Isobel (Penelope Wilton).\", \"In the tradition of the BBC's\", 'Upstairs Downstairs', \"and Robert Altman's\", 'Gosford Park', ', for which writer-creator Julian Fellowes received an Academy Award, the royals, servants, and middle-class relations struggle to get along. Sniffs uptight maid Miss O\\'Brien (Siobhan Finneran), \"Gentlemen don\\'t work,\" but that doesn\\'t stop Mary (Michelle Dockery) and Edith Crawley (Laura Carmichael) from competing for Matthew\\'s affections. Though it takes awhile to warm up to the tightest-wound characters, most everyone reveals their more vulnerable side before the first season comes to an end, and a new small-screen classic is born.', \"The entire sprawling cast is quite wonderful, particularly Bonneville, Carter, and James-Collier, who provide a fascinating study in contrasts (the latter is downright dastardly). Unlike the version that aired on PBS's\", 'Masterpiece Classic', \", this set offers seven parts rather than four. Extras include a featurette, in which cast and crew discuss the production, and an introduction to Hampshire's Highclere Castle, which doubles for Downton Abbey. The first season was a phenomenon in the United Kingdom, and Fellowes has promised a second season set during World War I.\", '--Kathleen C. Fennessy', 'Review', 'Crisp yet juicy, emotional yet subtle, serene yet funny. --Entertainment WeeklyViewers will be hard-pressed to find a more sumptuous, engaging drama than the Masterpiece Classic miniseries Downton Abbey. --Pittsburgh Post-Gazette', 'See more']\n{'Genre': 'Drama/Television, Drama/British Empire', 'Format': 'Multiple Formats, Color, Box set, NTSC', 'Contributor': 'Downton Abbey', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 4 Ounces', 'Item model number': '550882', 'Media Format': 'Multiple Formats, Color, Box set, NTSC', 'Run time': '6 hours and 8 minutes', 'Release date': 'January 11, 2011', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '3'}\nPrefect\nFour Stars\nLEGO Star Wars: The Empire Strikes Out\nAnthony Daniels  (Actor),     Kenneth Colley  (Actor),     Guy Vasilovich  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Your favorite characters are back to save the galaxy in LEGO(R) Star Wars(R): The Empire Strikes Out(TM). The heroes of the Rebel Alliance including heroic Luke Skywalker, swaggering Han Solo and steadfast Princess Leia have no time to celebrate their victory over the Empire as a new Imperial threat arises. But as Jedi-in-training Luke embarks on this next mission, he discovers that his celebrity status as a \"Death-Star-Blower-Upper\" can be a double-edged lightsaber when he\\'s constantly mobbed by crazed fans. So much for secret missions! Meanwhile, Darth Vader and Darth Maul are locked in a hilarious \"Sith-ling\" rivalry as they compete for the Emperor\\'s approval. It\\'s an action-packed comic adventure that\\'s out of this world!']\n{'Genre': \"Children's\", 'Format': 'Multiple Formats, Color, AC-3, Animated, Dolby, Subtitled, NTSC, Widescreen', 'Contributor': 'Lisa Fuson, Jason Canning, Tom Kane, Kenneth Colley, Andy Secombe, Matt Sloan, Ahmed Best, Guy Vasilovich, John Armstrong, Julian Glover, Sam Witwer, Michael Price, Lloyd Floyd, Anthony Daniels, Brian BlessedLisa Fuson, Jason Canning, Tom Kane, Kenneth Colley, Andy Secombe, Matt Sloan, Ahmed Best, Guy Vasilovich, John Armstrong, Julian Glover, Sam Witwer, Michael Price, Lloyd Floyd, Anthony Daniels, Brian Blessed  See more', 'Language': 'English', 'Runtime': '22 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2285719', 'Director': 'Guy Vasilovich', 'Media Format': 'Multiple Formats, Color, AC-3, Animated, Dolby, Subtitled, NTSC, Widescreen', 'Run time': '22 minutes', 'Release date': 'March 26, 2013', 'Actors': 'Anthony Daniels, Kenneth Colley, Brian Blessed, Julian Glover, Lloyd Floyd', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': '20th Century Fox', 'Writers': 'Michael Price', 'Number of discs': '1'}\nPrefect\nFour Stars\nBruce Wilkinson: The Prayer of Jabez [DVD]\nBruce Wilkinson  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n['PRAYER OF JABEZ, THE']\n{'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'DVD, NTSC, Color', 'Run time': '5 hours and 21 minutes', 'Release date': 'June 1, 2004', 'Actors': 'Bruce Wilkinson', 'Studio': 'Good Times Video', 'Number of discs': '1'}\nGood joirnal\nFour Stars\nThe Borrowers 2-Movie Family Fun Pack\nJohn Goodman  (Actor),     Christopher Eccleston  (Actor),     Tom Harper  (Director),     Peter Hewitt  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"The Borrowers They're charming and small and live behind the wall. They're The Borrowers, tiny people with big adventures! Starring John Goodman, The Borrowers is a film treat to be enjoyed by people of all sizes. The Borrowers (2011) Based on the beloved novels that have delighted generations, The Borrowers is a fun-filled adventure through the exciting world of the little people who live under our floorboards.\", ']]>']\n{'Aspect Ratio': '1.78:1, 1.85:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'MHV61130987DVD', 'Director': 'Tom Harper, Peter Hewitt', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '2 hours and 54 minutes', 'Release date': 'February 18, 2014', 'Actors': 'John Goodman, Christopher Eccleston, Jim Broadbent, Sharon Horgan, Mark Williams', 'Producers': 'Radford Neville, Tim Bevan, Eric Fellner, Rachel Talalay', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Ben Vanstone, Gavin Scott, John Kamps', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFun movie\nThree Stars\nCINDERELLA\nCate Blanchett  (Actor),     Lily James  (Actor),     Kenneth Branagh  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"Celebrate Disney's CINDERELLA, a modern classic that shines with beauty, imagination... and magic! Despite being bulled by her stepmother (Cate Blanchett) and stepsisters, a spirited Ella (Lily James) resolves to take charge of her fate. Add a royal ball, a Fairy Godmother (Helenal Bonham-Carter) and a glass slipper, and suddenly -- magic becomes reality!\"]\n{'Genre': 'Family Entertainment', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Paul Hunter, Eloise Webb, Alex MacQueen, Jana Perez, Lily James, Nonso Anozie, Richard McCabe, Gareth Mason, Cate Blanchett, Sophie McShera, Ben Chaplin, Kenneth Branagh, Stellan SkarsgÃ¥rd, Joshua McGuire, Holliday Grainger, Tom Edden, Helena Bonham Carter, Hayley Atwell, Derek Jacobi, Rob Brydon, Chris Weitz, Richard MaddenPaul Hunter, Eloise Webb, Alex MacQueen, Jana Perez, Lily James, Nonso Anozie, Richard McCabe, Gareth Mason, Cate Blanchett, Sophie McShera, Ben Chaplin, Kenneth Branagh, Stellan SkarsgÃ¥rd, Joshua McGuire, Holliday Grainger, Tom Edden, Helena Bonham Carter,…  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '12334800', 'Director': 'Kenneth Branagh', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'September 15, 2015', 'Actors': 'Cate Blanchett, Lily James, Richard Madden, Stellan SkarsgÃ¥rd, Holliday Grainger', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, English', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Chris Weitz', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie\nFive Stars\nThe Big Bang Theory: Season 1\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Big Bang Theory: S1 (DVD)', 'Leonard and Sheldon are brilliant physicists, the kind of \"beautiful minds\" that understand how the universe works. But none of that genius helps them interact with people, especially women. All this begins to change when a free-spirited beauty named Penny moves in next door. Sheldon, Leonard\\'s roommate, is quite content spending his nights playing Klingon Boggle with their socially dysfunctional friends, fellow Caltech scientists Wolowitz and Koothrappali. However, Leonard sees in Penny a whole new universe of possibilities ... including love.', ']]>', 'Amazon.com', 'The delightful sitcom', 'The Big Bang Theory', \"revolves around a character type rarely seen on television: The alpha geek. Physicists Leonard (Johnny Galecki) and Sheldon (Jim Parsons) get their lives shaken up when an attractive young woman named Penny (Kaley Cuoco) moves in to the apartment across from theirs. The key to the show, though, is not that they both fall haplessly in love--Leonard does, but Sheldon remains impermeably aloof and caustic about anything resembling romance or human relationships in general. While the push and pull of Leonard's yearning for Penny motivates much of the series' ongoing plot, the show's real drive comes from Sheldon's fantastic combination of obsessive-compulsive neurosis and grandiose obliviousness. He's a brilliant comic creation, imperious and dorky, a seamless collaboration of clever writing and an inspired performance by Parsons. Whether Sheldon loses his job for insulting his new boss, or finds his ego bruised by a child prodigy, or finds himself unable to bear being part of a lie that Leonard has told, he attacks the world with a relentless need to assert his supremacy--and the results are deeply funny.\", 'The triumph of', 'The Big Bang Theory', 'is that everyone is written with genuine affection; what could have been a lifeless parade of stereotypes--', 'Two Nerds and a Hot Chick', \"--becomes instead a charming collision of cultures. The familiar stuff (computer games, comic books, social incompetence) has the grit of specificity; the show understands the difference between Halo and Halo 3, knows what the Bottle City of Kandor is, and grasps the infinite variety of ways in which a conversation can go terribly awry. (Penny gets less nuance, but Cuoco still gives her a distinctive personality.) Kudos as well to supporting players Simon Helberg and Kunal Nayyar, who bring their own variations on geekiness to the table, and to great appearances by some of Galecki's former cohorts on\", 'Roseanne', \"--Sara Gilbert as geekette Leslie and Laurie Metcalf as Sheldon's fundamentalist mother. All in all, one of the most winning sitcoms in years.\", '--Bret Fetzer']\n{'Genre': 'Comedy', 'Format': 'NTSC, AC-3, Multiple Formats, Color, Subtitled, Box set, Widescreen, Dolby', 'Contributor': 'Jim Parsons, Johnny Galecki, Kaley Cuoco', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': '1419873148', 'Media Format': 'NTSC, AC-3, Multiple Formats, Color, Subtitled, Box set, Widescreen, Dolby', 'Run time': '5 hours and 55 minutes', 'Release date': 'September 2, 2008', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco', 'Dubbed': 'Portuguese', 'Subtitles': 'English, Spanish, French, Chinese, Portuguese, Korean, Thai', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nFunny dvd\nFour Stars\nFrancis the Talking Mule Complete Collection\nDonald O'Connor  (Actor),     Mickey Rooney  (Actor),     Arthur Lubin  (Director),     Charles Lamont  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n[\"Francis the Talking Mule Complete Collection features the hilarious escapades of the delightfully funny, old army mule…who happens to talk! Including all 7 movies from one of the most beloved comic series, Donald O'Connor stars as bewildered soldier Peter Stirling, who is helped out of one tricky situation after another by the unlikeliest of heroes, his pal Francis. Join the smart-alecky talking mule who continues to enchant audiences with his yackety-yakking, wise-cracking antics that the whole family can enjoy!\"]\n{'Genre': 'Kids & Family, Drama, Comedy', 'Format': 'Multiple Formats, Box set, NTSC, Black & White', 'Contributor': \"Devery Freeman, Mickey Rooney, James B. Allardice, Alice Kelley, Richard Gaines, Virginia Welles, Clint Eastwood, David Janssen, Charles Lamont, Ray Collins, Herbert Margolis, Lori Nelson, Piper Laurie, Arthur Lubin, Patricia Medina, David Stern, Cecil Kellaway, Gene Lockhart, Martha Hyer, John McIntire, Tony Curtis, Donald O'Connor, Jim Backus, Ted Richmond, Zasu Pitts, Robert Arthur, Jesse White, Paul Cavanagh, Julie Adams, William Raynor, Yvette Dugay, Chill WillsDevery Freeman, Mickey Rooney, James B. Allardice, Alice Kelley, Richard Gaines, Virginia Welles, Clint Eastwood, David Janssen, Charles Lamont, Ray Collins, Herbert Margolis, Lori Nelson, Piper Laurie, Arthur Lubin, Patricia Medina, David Stern, Cecil Kellaway, Gene Lockh…  See more\", 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 4.8 Ounces', 'Director': 'Arthur Lubin, Charles Lamont', 'Media Format': 'Multiple Formats, Box set, NTSC, Black & White', 'Run time': '10 hours and 4 minutes', 'Release date': 'April 29, 2014', 'Actors': \"Donald O'Connor, Mickey Rooney, Piper Laurie, Patricia Medina, Yvette Dugay\", 'Subtitles': 'French, Spanish', 'Producers': 'Ted Richmond, Robert Arthur', 'Studio': 'Studio Distribution Services', 'Writers': 'Devery Freeman, James B. Allardice, Herbert Margolis, William Raynor, David Stern', 'Country of Origin': 'USA', 'Number of discs': '3'}\nComedy at its best\nClassic",
  "profile": "**User Summary:**\n\n- **Target Audience**: The user continues to engage deeply with content designed for children and families, valuing narratives that resonate with both young audiences and adults.\n\n- **Content Type**: They appreciate a wide range of interactive entertainment, including comedy, adventure, singing, and animation. Their recent purchases reflect an ongoing fascination with classic storytelling that blends humor and charm, highlighting their interest in diverse comedic styles.\n\n- **Emotional Engagement**: As a grandparent, they prioritize joy-filled family moments, seeking stories that enhance bonds and encourage reflection and growth through shared experiences.\n\n- **Rating Preference**: The user actively favors content with ratings between 4 to 5 stars, demonstrating a consistent preference for high-quality viewing experiences.\n\n- **Purchase Motivation**: They aim to provide family-friendly entertainment infused with humor, choosing stories that inspire meaningful discussions and connections.\n\n- **Product Format**: The user has a clear preference for physical media, particularly DVDs and boxed sets, as they value curated, accessible family viewing experiences that foster interaction.\n\nTheir latest interaction with classic comedic content further emphasizes their commitment to quality entertainment that cultivates familial engagement and connects generations through laughter and shared enjoyment.",
  "metrics": {
    "rouge1_f": 0.04138950480413895,
    "rouge2_f": 0.004066543438077635,
    "rougeL_f": 0.022172949002217297,
    "meteor": 0.012117273057378341,
    "bleu1": 4.7550585802649025e-14,
    "bleu2": 1.430165043229546e-14,
    "bleu3": 2.067251060849775e-15,
    "bleu4": 7.867673642853592e-16,
    "bertscore_precision": 0.32517650723457336,
    "bertscore_recall": 0.513088583946228,
    "bertscore_f1": 0.39807063341140747
  }
}