{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: A Raisin in the Sun\nReview Date: 2016/11/23\nStore: Sean Combs  (Actor),     Sanaa Lathan  (Actor),     Kenny Leon  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Based on the play that inspired a generation, \"A Raisin in the Sun\" tells the story of a family living and struggling on Chicago\\'s South Side in the 1950s. A fiercely moving portrait of people whose hopes and dreams are constantly deferred, \"A Raisin in the Sun\" was the first play written by an African American woman to be produced on Broadway. The classic, still-relevant story now will be showcased in this totally new television movie adaptation. Sean Combs reprises the role which brought him critical acclaim in the highly anticipated, special three-hour television movie adaptation of the award-winning Broadway revival. Joining him is the cast of the award-winning production, including Emmy and Tony Award winner Phylicia Rashad, four-time Tony Award winner Audra McDonald, Tony Award nominee Sanaa Lathan, plus \"ER\" star John Stamos.', 'Amazon.com', 'Pride and poverty collide in this excellent television movie of the classic play', 'A Raisin in the Sun', '. When Walter Younger (Sean Combs, a.k.a. P. Diddy), his wife Ruth (Audra McDonald,', 'Private Practice', '), and his sister Beneatha (Sanaa Lathan,', 'Something New', ') learn that their deceased father has left their mother Lena (Phylicia Rashad,', 'The Cosby Show', \") with $10,000 in life insurance, their separate ideas of how to spend it threaten to pull the family apart. Lorraine Hansberry's passionate play ranks in the same tier as\", 'Death of a Salesman', 'and', \"Long Day's Journey Into Night\", '. This version is taken from an acclaimed stage production, but the actors have expertly re-pitched their performances for the intimacy of the camera and the script has been subtly but effectively opened up to allow scenes to take place at multiple locations. Lathan, McDonald, and Rashad all deliver rich, multilayered performances; the casting of rapper Combs could have been a mere stunt, but though he lacks the chops of the powerhouse women, he acquits himself decently. Excellent supporting performances from Bill Nunn (', 'Do the Right Thing', \") and John Stamos round out the cast. All in all, a rewarding adaptation of a play that continues to resonate with America's ongoing struggle with race.\", '--Bret Fetzer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'TV Drama, Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Audra McDonald, John M. Eckert, Sanaa Lathan, Cliffwood Productions, Ltd.; Sony Pictures Television; Topanga Productions, Inc., Kenny Leon, Phylicia Rashad, Bill Nunn, Justin Martin, Ron Jones, David Oyelowo, John Stamos, Sean Thomas, Sean CombsAudra McDonald, John M. Eckert, Sanaa Lathan, Cliffwood Productions, Ltd.; Sony Pictures Television; Topanga Productions, Inc., Kenny Leon, Phylicia Rashad, Bill Nunn, Justin Martin, Ron Jones, David Oyelowo, John Stamos, Sean Thomas, Sean Combs   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'CTR24961DVD', 'Director': 'Kenny Leon', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'May 13, 2008', 'Actors': 'Sean Combs, Sanaa Lathan, Audra McDonald, Phylicia Rashad, Justin Martin', 'Subtitles': 'English, French', 'Producers': 'John M. Eckert', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this for Black History Month\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "SOLOIST, THE\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Soloist, The (DVD)', 'Academy Award® nominee Robert Downey Jr. and Academy Award® winner Jamie Foxx star in an extraordinary and inspiring true story of h ow a chance meeting can change a life. The Soloist tells the poignant and ultimate ly soaring tale of a Los Angeles newspaper report er who discovers a bri lliant and distracted street musician, with unsinkable passion, and the unique friendship and bond that transf orms both their lives. The remark able performances make for an unforgettable experience in what is hailed as “a courageous and uncom promising film” (Gene Shalit, TODAY).', ']]>']\n{'Genre': 'Musicals & Performing Arts, Drama, Documentary/Biography', 'Format': 'NTSC', 'Contributor': 'Various', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1)', 'Runtime': '1 hour and 57 minutes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '31560303', 'Director': 'Various', 'Media Format': 'NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'August 4, 2009', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nI used it for my class to teach mental illness homelessness and the importance of music education in public schools\nI used it for my class to teach mental illness ...\nWhat About Bob?\nBill Murray  (Actor),     Richard Dreyfuss  (Actor),     Frank Oz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"Comic wizard Bill Murray (CRADLE WILL ROCK, RUSHMORE) teams up with Academy Award(R)-winner Richard Dreyfuss teams up with (Best Actor, 1978, THE GOODBYE GIRL; MR. HOLLAND'S OPUS) in an outrageously wild comedy that's sure to drive you off the deep end! Murray plays Bob Wiley, a troubled but lovable therapy patient who fears everything! After seeking help from noted psychiatrist Dr. Leo Marvin (Dreyfuss), Bob feels revived. But when the good doctor skips town to go on a quiet family vacation, Bob, afraid of being alone, follows -- showing up unexpectedly at the therapist's lakeside retreat. That's when the fun really begins! Bob innocently becomes the houseguest who just won't leave -- endearing himself to the other family members ... and, in the end, driving the stressed-out shrink absolutely crazy!\"]\n{'Genre': 'BILL, MURRAY, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, Subtitled, NTSC, Letterboxed', 'Contributor': 'Doris Belack, Frank Oz, Brian Reddy, Joan Lunden, Tom Aldredge, Kathryn Erbe, Melinda Mullins, Julie Hagerty, Fran Brill, Charlie Korsmo, Tom Schulman, Roger Bowen, Susan Willis, Bill Murray, Richard DreyfussDoris Belack, Frank Oz, Brian Reddy, Joan Lunden, Tom Aldredge, Kathryn Erbe, Melinda Mullins, Julie Hagerty, Fran Brill, Charlie Korsmo, Tom Schulman, Roger Bowen, Susan Willis, Bill Murray, Richard Dreyfuss   See more', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.41 x 7.45 inches; 0.71 Ounces', 'Item model number': '717951005205', 'Director': 'Frank Oz', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, Subtitled, NTSC, Letterboxed', 'Run time': '1 hour and 39 minutes', 'Release date': 'July 11, 2000', 'Actors': 'Bill Murray, Richard Dreyfuss, Julie Hagerty, Charlie Korsmo, Kathryn Erbe', 'Dubbed': 'French', 'Studio': 'Buena Vista Home Entertainment', 'Writers': 'Tom Schulman', 'Number of discs': '1'}\nGreat for psychology class.\nUsed for Psychology class.\nPhiladelphia\nTom Hanks  (Actor),     Denzel Washington  (Actor),     Jonathan Demme  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Hailed as a landmark film that dazzles with deep emotion and exceptional acting, PHILADELPHIA starsTom Hanks and Denzel Washington as two competing lawyers who join forces to sue a prestigious law firm for AIDS discrimination. And as their unlikely friendship develops, their courage overcomes the prejudice and corruption of their powerful adversaries.']\n{'Genre': 'Drama, Award Winning', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Dolby, NTSC, Subtitled, Widescreen, Color', 'Contributor': 'Antonio Banderas, Denzel Washington, Tom Hanks, Mary Steenburgen, Jonathan Demme, Joanne Woodward, Jason Robards, Edward Saxon, Apple Pie Productions, Inc.; TriStar Pictures, Ron VawterAntonio Banderas, Denzel Washington, Tom Hanks, Mary Steenburgen, Jonathan Demme, Joanne Woodward, Jason Robards, Edward Saxon, Apple Pie Productions, Inc.; TriStar Pictures, Ron Vawter  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 ounces', 'Item model number': 'CTR52619DVD', 'Director': 'Jonathan Demme', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Dolby, NTSC, Subtitled, Widescreen, Color', 'Run time': '2 hours and 5 minutes', 'Release date': 'July 25, 2002', 'Actors': 'Tom Hanks, Denzel Washington, Antonio Banderas, Mary Steenburgen, Ron Vawter', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, Korean', 'Producers': 'Edward Saxon, Jonathan Demme', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nUsed for Psychology Class\nFive Stars\nThe Pursuit of Happyness (Widescreen Edition)\nWill Smith  (Actor, Producer),     Thandie Newton  (Actor),     Gabriele Muccino  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Will Smith stars in this moving tale inspired by the true story of Chris Gardner, a San Francisco salesman struggling to build a future for himself and his 5-year-old son Christopher (Jaden Smith). When his girlfriend Linda (Thandie Newton) walks out, Chris is left to raise Christopher (Jaden Smith) on his own. Chris' determination finally pays off when he lands an unpaid internship in a brutally competitive stockbroker-training program, where only one in twenty interns will make the cut. But without a salary, Chris and his son are evicted from their apartment and are forced to sleep on the streets, in homeless shelters and even behind the locked doors of a metro station bathroom. With self-confidence and the love and trust of his son, Chris Gardner rises above his obstacles to become a Wall Street legend.\", 'Amazon.com', 'A heartwarming film that demonstrates how good, hard-working people can become homeless almost overnight,', 'Pursuit of Happyness', \"is a tour-de-force showcase for Will Smith, who convincingly portrays a down-and-out dad trying to better his family's life. Smith, who usually is cast in effortlessly boyish roles (\", 'Men in Black, Independence Day', \"), is wonderful in the film--even in the scenes that shamelessly tug at viewers' heartstrings. Based on the true-life story of Chris Gardner, a San Francisco salesman forced at times to shelter his young son (played by Smith's adorable look-alike offspring Jaden Smith) in a men's room, there is little suspense to the film in terms of Chris' outcome. (His story and eventual success a successful and wealthy Chicago businessman was well-publicized on the newsmagazine show\", '20/20', '.) And let\\'s face it, Hollywood\\'s not too keen on making feel-good movies with unhappy endings. The beauty (and suspense, to a certain extent) of this film is in the way the story is told. Though he is constantly rushing around to get to appointments and pick up his child, things do not happen quickly for Chris. When he accepts an internship with a prestigious stock brokerage firm, there\\'s a catch: The position is unpaid, suitable more for trust-fund children than single parents with no other source of income. In many scenes, the viewer panics along with Chris, wondering how he\\'s going to feed his child. While Smith and his son, Jaden, share many tender moments together, Thandie Newton has the thankless role of playing Chris\\' shrill wife, who deserts her family early in the film. It\\'s not a particularly challenging part for the talented actress, and her departure doesn\\'t impact the storyline much at all. As for the movie\\'s misspelled title, it\\'s inspired from a scene in the film. (Seeing a mural drawn by the children at a daycare center, Chris points out to the proprietor that \"happiness\" is spelled incorrectly. She notes that it doesn\\'t matter how the word is written--just that the kids have it.) With', 'Pursuit of Happyness', ', Smith has come out of his safety zone and, in turn, ends up playing his most heroic role to date. --', 'Jae-Ha Kim', 'Extras from', 'The Pursuit of Happyness', 'Behind the scenes footage of', 'The Pursuit of Happyness', 'high bandwidth', 'Chris Gardner:  \"On Being Studied By Will Smith\"', 'high bandwidth', 'Will Smith And Jaden Smith: \"On Will Always Being In Character\"', 'high bandwidth', 'Beyond', 'The Pursuit of Happyness', 'on Amazon.com', 'More Films Starring Will Smith', 'More Films About Fathers & Sons', 'The Book', 'Stills from', 'The Pursuit of Happyness', '(click for larger image)', '-- end6pak -->']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '15085', 'Director': 'Gabriele Muccino', 'Media Format': 'Multiple Formats, AC-3, Dolby, Dubbed, Subtitled, Widescreen, Color, NTSC, Closed-captioned', 'Run time': '1 hour and 57 minutes', 'Release date': 'March 27, 2007', 'Actors': 'Will Smith, Thandie Newton, Brian Howe, James Karen, Dan Castellaneta', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Jason Blumenthal, Will Smith, Steve Tisch, Todd Black, James Lassiter', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nUse for Psychology Class.\nFive Stars\nSybil (Two-Disc Special Edition)\nSally Field  (Actor),     Joanne Woodward  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Product Description', 'Sybil (1976) (DVD)', 'Based on a true story, this telefilm debut in 1976 to extraordinary response. Sally Field - in an Emmy Award winning and career-turning performance - portrays Sybil, a woman suffering from multiple personality disorder who develops over 16 distinct personalities in order to cope and escape haunting memories of her harrowing childhood. Joanne Woodward plays the understanding and compassionate psychiatrist that helps Sybil confront her horrific past and eliminate her demons.', ']]>', 'Amazon.com', 'The word \"landmark\" is fairly used in the case of', 'Sybil', \": this 1976 TV movie brought new frankness to television, it raised the quality bar for the made-for-television movie, and it utterly changed the career of a future Oscar-winning actress. The film was based on the bestselling nonfiction book about a multiple-personality patient and her exhaustive therapy. It opens with a brilliant series of scenes that suggest how a young woman named Sybil (Sally Field) experiences unexplained blackouts, which brings her to the attention of a psychiatrist, Dr. Wilbur (Joanne Woodward). The film unfolds around the searching therapy sessions, laced with flashbacks to Sybil's toxic childhood. There's also a tentative romance between the lonely Sybil and a manchild (Brad Davis) who lives across the alley. Most notably, of course, there are the appearances of Sybil's alternate personalities, who express her strangled emotional life. Stewart Stern's sensitive script seems to flow organically from one scene to the next, and director Daniel Petrie frequently allows the camera to observe the acting acrobatics in long, challenging takes.\", 'Woodward, who won an Oscar for playing a multiple-personality patient in', 'The Three Faces of Eve', ', is all nurturing warmth as the steadfast doctor. But really this film was a sober coming-out party for Sally Field, who astonished viewers at the time by erasing all memories of', 'Gidget', 'and', 'The Flying Nun', \", the bubblegum roles she'd mostly been known for. Field's work is anguished but non-actor-y, and despite the character's hidden personalities, she seems as clear as day in her performance. The production won four Emmys, not surprisingly including nods for Field, Stern, and Outstanding Special (Drama).\", 'The 187-minute movie takes up one disc; the second disc has informative featurettes about the making of the film.', 'Examining Sybil', \"is an absorbing hour-long documentary with comments from Field and Woodward, as well as executive producer Peter Dunne. It is dominated by the spellbinding storytelling of Stewart Stern, who developed the screenplay by spending time with the real Dr. Wilbur and listening to tapes of her sessions with Sybil. His tale of Sally Field's unlikely audition triumph is a small movie in itself.\", 'The Paintings of Sybil', 'presents a generous selection of paintings by the real Sybil (who became a professor of art), along with recollections by one of her friends. Something listed on the DVD cover as \"Sybil Therapy Session\" is misleadingly titled, suggesting some kind of actual footage or transcript of the real Sybil and her treatment; in fact, it\\'s Stewart Stern describing the harrowing process of listening to the doctor\\'s tapes. The real Sybil (now deceased) remains protected, as she should.', '--Robert Horton']\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Daniel Petrie, Flora Rheta Schreiber, Sally Field, Brad Davis, Jacqueline Babbin, Joanne Woodward', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '3 hours and 6 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.04 Ounces', 'Item model number': '70145', 'Director': 'Daniel Petrie', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '3 hours and 6 minutes', 'Release date': 'July 18, 2006', 'Actors': 'Sally Field, Joanne Woodward, Brad Davis', 'Subtitles': 'French, Spanish', 'Producers': 'Jacqueline Babbin', 'Studio': 'WarnerBrothers', 'Writers': 'Flora Rheta Schreiber', 'Number of discs': '2'}\nGreat for Psychology Class.\nFive Stars\nAwakenings\nRobert De Niro  (Actor),     Robin Williams  (Actor),     Penny Marshall  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['By opening one man\\'s eyes to the world... he opened his own. Robert De Niro (in an Oscar-nominated performance) and Robin Williams star in this powerful, true story of a maverick doctor and the patients whose lives he changes. Williams plays Dr. Malcolm Sayer, a shy research physician who uses an experimental drug to \"awaken\" the catatonic victims of a rare disease. De Niro co-stars as Leonard, the first patient to receive the controversial treatment. His awakening, filled with awe and enthusiasm, proves a rebirth for Sayer too, as the exuberant patient reveals life\\'s simple but unutterably sweet pleasures to the introverted doctor. Encouraged by Leonard\\'s stunning recovery, Sayer administers the drug to the other patients. The story of their friendship during this emotional journey is a testament to both the tenderness of the human heart and the strength of the human soul.']\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'Dolby, Full Screen, NTSC', 'Contributor': 'Robert De Niro, Penelope Ann Miller, Penny Marshall, Julie Kavner, Robin Williams, John Heard', 'Language': 'English', 'Runtime': '2 hours and 1 minute', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'IMG6819DVD', 'Director': 'Penny Marshall', 'Media Format': 'Dolby, Full Screen, NTSC', 'Run time': '2 hours and 1 minute', 'Release date': 'December 7, 2010', 'Actors': 'Robert De Niro, Robin Williams, Julie Kavner, John Heard, Penelope Ann Miller', 'Studio': 'Image Entertainment', 'Number of discs': '1'}\nGreat for Psychology Class\nFive Stars\nMy Life\nMichael Keaton  (Actor),     Dr. Haing S. Ngor  (Actor),     Bruce Joel Rubin  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Michael Keaton is a young ad executive who discovers he is dying of cancer, just as he and his wifeare expecting their first child. Deciding to make a video of his life as a gift for the child he may never know, he embarks on a journey of self discovery, confronting his painful past.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Item model number': 'MFR043396058538#VG', 'Director': 'Bruce Joel Rubin', 'Media Format': 'Color, Dolby, Full Screen, NTSC', 'Run time': '2 minutes', 'Release date': 'April 24, 2001', 'Actors': 'Michael Keaton, Dr. Haing S. Ngor, Bradley Whitford, Michael Constantine, Nicole Kidman', 'Producers': 'Bruce Joel Rubin, Hunt Lowry, Jerry Zucker', 'Language': 'Unqualified', 'Studio': 'Sony Pictures Home Entertainment - Mill Creek', 'Number of discs': '1'}\nGreat for Psychology Class\nFive Stars\nThe Bucket List\nJack Nicholson  (Actor),     Morgan Freeman  (Actor),     Rob Reiner  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Bucket List, The (WS/FS/DVD)', \"Academy Award winners Jack Nicholson and Morgan Freeman star in this comedy drama, directed by Rob Reiner, a touching, no-holds-barred adventure that shows it's never too late to live life to its fullest--The Bucket List. One man was smart enough to go to college, but has worked his entire life as a mechanic; the other owns the hospital in which they are both patients. But these two men with little time left and even less to lose, discover that life can be deeply moving and definitely hilarious.\", ']]>']\n{'Genre': 'Action & Adventure/Crime, Comedy, Mystery & Suspense/Crime, Action & Adventure', 'Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Contributor': 'Rowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob ReinerRowena King, Sean Hayes, Beverly Todd, Justin Zackham, Jeffrey Stott, Travis Knox, Rob Morrow, Jack Nicholson, Craig Zadan, Morgan Freeman, Alan Greisman, Alfonso Freeman, Neil Meron, Rob Reiner   See more', 'Language': 'Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 4.0), French (Dolby Digital 4.0)', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.75 inches; 0.01 Ounces', 'Item model number': 'WARD024013D', 'Director': 'Rob Reiner', 'Media Format': 'Multiple Formats, Color, Full Screen, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'June 10, 2008', 'Actors': 'Jack Nicholson, Morgan Freeman, Sean Hayes, Rob Morrow, Beverly Todd', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Jeffrey Stott, Craig Zadan, Travis Knox, Neil Meron, Alan Greisman', 'Studio': 'WarnerBrothers', 'Writers': 'Justin Zackham', 'Number of discs': '1'}\nGreat for Psychology Class\nFive Stars\nA Beautiful Mind (Widescreen)(2001)\nRussell Crowe  (Actor),     Jennifer Connelly  (Actor),     Ron Howard  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Winner of 4 Academy Awards, including Best Picture, A Beautiful Mind is directed by Academy Award winner Ron Howard and produced by long-time partner and collaborator, Academy Award winner Brian Grazer. A Beautiful Mind stars Russell Crowe in an astonishing performance as brilliant mathematician John Nash, on the brink of international acclaim when he becomes entangled in a mysterious conspiracy. Now only his devoted wife (Academy Award winner Jennifer Connelly) can help him in this powerful story of courage, passion and triumph.', 'Bonus Content:', 'Feature Commentary with Director Ron Howard', 'Feature Commentary with Director Ron Howard', 'Feature Commentary with Screenwriter Akiva Goldsman', 'Feature Commentary with Screenwriter Akiva Goldsman', \"Deleted Scenes with Director's Commentary\", \"Deleted Scenes with Director's Commentary\", 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features', 'DVD-ROM Features', ']]>']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Contributor': 'Mike Hill, Judd Hirsch, Austin Pendleton, Jason Gray-Stanford, Jennifer Connelly, Adam Goldberg, Josh Lucas, Christopher Plummer, Russell Crowe, Ron Howard, Dan Hanley, Akiva Goldsman, Ed Harris, Brian Grazer, Anthony Rapp, Paul BettanyMike Hill, Judd Hirsch, Austin Pendleton, Jason Gray-Stanford, Jennifer Connelly, Adam Goldberg, Josh Lucas, Christopher Plummer, Russell Crowe, Ron Howard, Dan Hanley, Akiva Goldsman, Ed Harris, Brian Grazer, Anthony Rapp, Paul Bettany  See more', 'Initial release date': '2006-08-22', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.56 x 5.31 x 0.67 inches; 2.4 Ounces', 'Item model number': '61030265', 'Director': 'Ron Howard', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen', 'Run time': '2 hours and 16 minutes', 'Release date': 'August 22, 2006', 'Actors': 'Russell Crowe, Jennifer Connelly, Ed Harris, Paul Bettany, Adam Goldberg', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Producers': 'Brian Grazer, Ron Howard', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Akiva Goldsman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPerfect for Psychology Class\nFive Stars\nGattaca\nEthan Hawke  (Actor),     Uma Thurman  (Actor),     Andrew Niccol  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Futuristic\n['Product Description', 'Ethan Hawke, Uma Thurman, Alan Arkin and Jude Law star in this engrossing sci-fi thriller about an all-too-human man who dares to defy a system obsessed with genetic perfection. Hawke stars as Vincent, an \"In-Valid\" who assumes the identity of a member of the genetic elite to pursue his goal of traveling into space with the Gattaca Aerospace Corporation. However, a week before his mission, a murder marks Vincent as a suspect. With a relentless investigator in pursuit and the colleague he has fallen in love with beginning to suspect his deception, Vincent\\'s dreams steadily unravel.', 'Amazon.com', 'Confidently conceived and brilliantly executed,', 'Gattaca', \"had a somewhat low profile release in 1997, but audiences and critics hailed the film's originality. It's since been recognized as one of the most intelligent science fiction films of the 1990s. Writer-director Andrew Niccol, the talented New Zealander who also wrote the acclaimed Jim Carrey vehicle\", 'The Truman Show', ', depicts a near-future society in which one\\'s personal and professional destiny is determined by one\\'s genes. In this society, \"Valids\" (genetically engineered) qualify for positions at prestigious corporations, such as Gattaca, which grooms its most qualified employees for space exploration. \"In-Valids\" (naturally born), such as the film\\'s protagonist, Vincent (Ethan Hawke), are deemed genetically flawed and subsequently fated to low-level occupations in a genetically caste society. With the help of a disabled \"Valid\" (Jude Law), Vincent subverts his society\\'s social and biological barriers to pursue his dream of space travel; any random mistake--and an ongoing murder investigation at Gattaca--could reveal his plot. Part thriller, part futuristic drama and cautionary tale,', 'Gattaca', 'establishes its social structure so convincingly that the entire scenario is chillingly believable. With Uma Thurman as the woman who loves Vincent and identifies with his struggle,', 'Gattaca', \"is both stylish and smart, while Jude Law's performance lends the film a note of tragic and heartfelt humanity.\", '--Jeff Shannon', 'Set Contains:', 'In addition to a superb widescreen transfer, the DVD edition of', 'Gattaca', \"includes several deleted scenes (and one humorous outtake), which further establish the story's social context and provide additional insight into the scientific and ethical issues explored in this extraordinary film.\", '--Jeff Shannon', 'See more']\n{'Genre': 'Sci-Fi, Suspense/Thriller', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Closed-captioned', 'Contributor': 'Columbia Pictures, Stacey Sher, Uma Thurman, Danny DeVito, Ethan Hawke, Loren Dean, Ernest Borgnine, Andrew Niccol, Jude Law, Michael Shamberg, Alan ArkinColumbia Pictures, Stacey Sher, Uma Thurman, Danny DeVito, Ethan Hawke, Loren Dean, Ernest Borgnine, Andrew Niccol, Jude Law, Michael Shamberg, Alan Arkin  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1)', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'MFR043396826496', 'Director': 'Andrew Niccol', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Closed-captioned', 'Run time': '2 hours and 11 minutes', 'Release date': 'June 30, 1998', 'Actors': 'Ethan Hawke, Uma Thurman, Alan Arkin, Jude Law, Loren Dean', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Danny DeVito, Stacey Sher, Michael Shamberg', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nKids in Psychology Class enjoyed trying to figure out what was going on.\nFive Stars\nMean Girls (2004)\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Mean Girls (DVD)', 'Raised in the African bush country by her zoologist parents, Cady Heron (Lindsay Lohan) thinks she knows about \"survival of the fitt est.\" But t he law of the jungle takes on a whole new meaning when the home-schooled 15-year-old enters public high school for the fi rst time and falls pre y to the psychological warfare and unwritten social rules that teenage g irls face today.', ']]>']\n{'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Runtime': '1 hour and 37 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '883929302475', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'September 21, 2004', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nPerfect for Behavioral Psychology\nFive Stars\nA Raisin in the Sun\nSean Combs  (Actor),     Sanaa Lathan  (Actor),     Kenny Leon  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Based on the play that inspired a generation, \"A Raisin in the Sun\" tells the story of a family living and struggling on Chicago\\'s South Side in the 1950s. A fiercely moving portrait of people whose hopes and dreams are constantly deferred, \"A Raisin in the Sun\" was the first play written by an African American woman to be produced on Broadway. The classic, still-relevant story now will be showcased in this totally new television movie adaptation. Sean Combs reprises the role which brought him critical acclaim in the highly anticipated, special three-hour television movie adaptation of the award-winning Broadway revival. Joining him is the cast of the award-winning production, including Emmy and Tony Award winner Phylicia Rashad, four-time Tony Award winner Audra McDonald, Tony Award nominee Sanaa Lathan, plus \"ER\" star John Stamos.', 'Amazon.com', 'Pride and poverty collide in this excellent television movie of the classic play', 'A Raisin in the Sun', '. When Walter Younger (Sean Combs, a.k.a. P. Diddy), his wife Ruth (Audra McDonald,', 'Private Practice', '), and his sister Beneatha (Sanaa Lathan,', 'Something New', ') learn that their deceased father has left their mother Lena (Phylicia Rashad,', 'The Cosby Show', \") with $10,000 in life insurance, their separate ideas of how to spend it threaten to pull the family apart. Lorraine Hansberry's passionate play ranks in the same tier as\", 'Death of a Salesman', 'and', \"Long Day's Journey Into Night\", '. This version is taken from an acclaimed stage production, but the actors have expertly re-pitched their performances for the intimacy of the camera and the script has been subtly but effectively opened up to allow scenes to take place at multiple locations. Lathan, McDonald, and Rashad all deliver rich, multilayered performances; the casting of rapper Combs could have been a mere stunt, but though he lacks the chops of the powerhouse women, he acquits himself decently. Excellent supporting performances from Bill Nunn (', 'Do the Right Thing', \") and John Stamos round out the cast. All in all, a rewarding adaptation of a play that continues to resonate with America's ongoing struggle with race.\", '--Bret Fetzer']\n{'Genre': 'TV Drama, Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Audra McDonald, John M. Eckert, Sanaa Lathan, Cliffwood Productions, Ltd.; Sony Pictures Television; Topanga Productions, Inc., Kenny Leon, Phylicia Rashad, Bill Nunn, Justin Martin, Ron Jones, David Oyelowo, John Stamos, Sean Thomas, Sean CombsAudra McDonald, John M. Eckert, Sanaa Lathan, Cliffwood Productions, Ltd.; Sony Pictures Television; Topanga Productions, Inc., Kenny Leon, Phylicia Rashad, Bill Nunn, Justin Martin, Ron Jones, David Oyelowo, John Stamos, Sean Thomas, Sean Combs   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 11 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'CTR24961DVD', 'Director': 'Kenny Leon', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'May 13, 2008', 'Actors': 'Sean Combs, Sanaa Lathan, Audra McDonald, Phylicia Rashad, Justin Martin', 'Subtitles': 'English, French', 'Producers': 'John M. Eckert', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this for Black History Month\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user continues to demonstrate a strong passion for films addressing essential social issues, emphasizing mental health and the complexities of adolescent experiences. Their commitment to storytelling as a transformative educational tool aligns with a focus on history and cultural narratives, further reflecting a dedication to advocacy through media.\n\n- **Engagement**: The recent acquisition showcases the user's strategy of using film in educational contexts, particularly in discussing historical and societal challenges relevant to diverse audiences. This reflects their intention to foster discussions that promote empathy and understanding among younger viewers.\n\n- **Media Format Preferences**: Their preference for DVD format persists, indicating a collector mentality aimed at curating a library of influential films, particularly those significant for cultural and educational discussions.\n\n- **Genres**: The user’s interests span drama, advocacy-themed narratives, and impactful historical narratives, reinforcing their aim to utilize multiple genres as tools for education and dialogue. They maintain a flexible approach, appreciating comedy when it serves educational purposes.\n\nOverall, the user's profile illustrates a steadfast commitment to utilizing film as a medium for advocacy and education, particularly in addressing significant societal topics and cultural history, enhancing learning experiences through thoughtful engagement with media.",
  "metrics": {
    "rouge1_f": 0.04078400316768958,
    "rouge2_f": 0.0027728263022380674,
    "rougeL_f": 0.02652940011878836,
    "meteor": 0.011164452383610584,
    "bleu1": 8.351740666609896e-13,
    "bleu2": 2.670784388707934e-13,
    "bleu3": 3.8169443277199496e-14,
    "bleu4": 1.4444302648073986e-14,
    "bertscore_precision": 0.32807400822639465,
    "bertscore_recall": 0.5045619010925293,
    "bertscore_f1": 0.397613525390625
  }
}