{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Mel Brooks Collection\nReview Date: 2014/08/28\nStore: Cleavon Little  (Actor),     Gene Wilder  (Actor)    Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['“Enjoy! Revel! Live!” as Mel says…and “have yourselves one sweetheart of a good time.” Presenting nine hugely popular films from one of cinema’s most celebrated, prolific and funniest filmmakers, Mel Brooks! The undisputed king of hilariously quotable films, Mel has delivered hit after hit after hit, each one as memorable as the next. This nine-disc Blu-rayTM collection includes some of the most sidesplitting, gut-busting, guffaw-inducing films ever made. It really is “good to be the king!”Contains the films Blazing Saddles, Spaceballs, Young Frankenstein, High Anxiety, History Of The World Part 1, Robin Hood: Men In Tights, Silent Movie, To Be Or Not To Be and The Twelve Chairs.']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.42 Pounds', 'Item model number': 'FOXS2281601BR', 'Director': 'Mel Brooks', 'Media Format': 'Blu-ray, NTSC, Color', 'Run time': '14 hours and 28 minutes', 'Release date': 'May 8, 2012', 'Actors': 'Cleavon Little, Gene Wilder, Slim Pickens, Harvey Korman, David Huddleston', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '9'}\nReview Text: Great movies\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Tales of the Gold Monkey: The Complete Series\nStephen Collins  (Actor),     Jeff MacKay  (Actor),     Virgil Vogel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Product Description', 'Broadcast on ABC in early 80s, the series became a massive hit following the success of Indiana Jones’s ‘Raiders of The Lost Ark’. This 22-hour long series is set in a backwater corner of the South Pacific a young American adventurer and his ragtag group of friends become involved in death-defying hi-jinx, transporting people-on-the-run in a well-worn Grumman Goose seaplane. Set in 1938, this series captures the ambiance and character of a mysterious romantic era. Directors: Harvey S Laidman, Virgil W Vogel, James Frawley, Winrich Kolbe, Ray Austin, James Fargo. Stars: Stephen Collins (', 'Private Practice', ',', '7th Heaven', ',', 'Blood Diamond', '), Caitlin O’Heaney, Roddy McDowall (', 'Planet of The Apes', '), Jeff Mackay (', 'JAG', ',', 'Magnum PI', ',', 'Black Sheep Squadron', '.) Show Created by: Donald P Bellisario (', 'Magnum', ',', 'Airwolf', ',', 'Quantum Leap', ',', 'JAG', ',', 'NCIS', ').', 'Amazon.com', 'Stephen Collins heroically tries to keep up with the (Indiana) Joneses as rakishly charming soldier of misfortune Jake Cutter, who works as a pilot for hire on the South Pacific island of Boragora in 1938. Comparisons with', 'Raiders of the Lost Ark', 'are inevitable, but according to the series retrospective included as a bonus feature on this six-disc set, producer Don Bellisario (', 'Quantum Leap', ',', 'Magnum P.I.', ', and', 'NCIS', ') pitched this to the networks before Indy ever cracked his whip. It was only after', 'Raiders', 'became such a colossal hit that ABC saw gold in', 'Monkey', \". Alas, this series never really took off, but nearly 30 years later, it's a grandly entertaining bit of escapist fare that packs old Hollywood Saturday matinee thrills and adventure into every episode. The colorful characters include Corky (Jeff Mackay), Jake's trusty (when he's not drunk) mechanic and sidekick; Bon Chance Louie (the peerless Roddy McDowall), the ethically questionable French liaison and governor, and owner of the disreputable hangout the Monkey Bar; and Sarah Stickney White (Caitlin O'Hearney), chanteuse and spy. Stealing nearly every scene he's in is Jack, Jake's one-eyed dog, always good for a comical cutaway. You can't beat the Nazis for villainy (check out John Hillerman's outrageous accent in the feature-length pilot episode), but\", 'Monkey', 'steps over the PC line with deadly dragon lady Koji (Marta Du Bois) and her samurai henchman. These', 'Tales', 'are told mostly tongue-in-cheek. Expensive for its day, the series nevertheless has a B-movie look, which enhances its hokey charms. In addition to the newly filmed interviews with cast and creators, the bonus features include five immersive audio commentaries, as well as detailed character bios and a series \"fact file.\" Virtually unseen since its original broadcast,', 'Tales of the Gold Monkey', 'is of more than nostalgic interest. Stephen Collins fans will surely be in--wait for it--', '7th Heaven', '.', '--Donald Liebenson']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Contributor': \"Caitlin O'Heaney, Les Jankey, John Calvin, John Fujioka, Stephen Collins, Conrad Bachmann, Roddy McDowall, Ahmed Kalane, Leo the Dog, Greg Elliot, Jeff MacKay, Marta DuBois, Virgil VogelCaitlin O'Heaney, Les Jankey, John Calvin, John Fujioka, Stephen Collins, Conrad Bachmann, Roddy McDowall, Ahmed Kalane, Leo the Dog, Greg Elliot, Jeff MacKay, Marta DuBois, Virgil Vogel  See more\", 'Language': 'Unqualified', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.6 Ounces', 'Item model number': '7305456', 'Director': 'Virgil Vogel', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Run time': '16 hours and 30 minutes', 'Release date': 'June 8, 2010', 'Actors': \"Stephen Collins, Jeff MacKay, Leo the Dog, Caitlin O'Heaney, Roddy McDowall\", 'Studio': 'Fabulous Films/Shout! Factory', 'Number of discs': '6'}\nGreat series\nFive Stars\nThe Mel Brooks Collection\nCleavon Little  (Actor),     Gene Wilder  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['“Enjoy! Revel! Live!” as Mel says…and “have yourselves one sweetheart of a good time.” Presenting nine hugely popular films from one of cinema’s most celebrated, prolific and funniest filmmakers, Mel Brooks! The undisputed king of hilariously quotable films, Mel has delivered hit after hit after hit, each one as memorable as the next. This nine-disc Blu-rayTM collection includes some of the most sidesplitting, gut-busting, guffaw-inducing films ever made. It really is “good to be the king!”Contains the films Blazing Saddles, Spaceballs, Young Frankenstein, High Anxiety, History Of The World Part 1, Robin Hood: Men In Tights, Silent Movie, To Be Or Not To Be and The Twelve Chairs.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.42 Pounds', 'Item model number': 'FOXS2281601BR', 'Director': 'Mel Brooks', 'Media Format': 'Blu-ray, NTSC, Color', 'Run time': '14 hours and 28 minutes', 'Release date': 'May 8, 2012', 'Actors': 'Cleavon Little, Gene Wilder, Slim Pickens, Harvey Korman, David Huddleston', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '9'}\nGreat movies\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user continues to express a strong appreciation for action and adventure genres, particularly in classic film and television. Their recent purchase showcases a fondness for iconic comedy, reinforcing their engagement with nostalgic, character-driven narratives that are both humorous and adventurous.\n\n- **Media Format**: The user shows a clear preference for comprehensive collections, now extending to Blu-ray formats. This suggests an ongoing enjoyment of binge-watching and a desire for high-quality viewing experiences.\n\n- **Nostalgia**: Their connection to older media is further solidified by an affinity for renowned filmmakers and classic comedic films, reflecting a love for retro entertainment that echoes the adventurous charm of earlier cinematic eras.\n\n- **Engagement**: The user actively engages by providing positive reviews, indicating willingness to share their enjoyment and insights, thus promoting beloved content to others.\n\n- **Ratings**: Continuing a trend of high ratings, the user demonstrates discerning taste and consistent satisfaction with their media choices, as evidenced by their five-star ratings for both nostalgic and comedic films.\n\n- **Character-Driven Stories**: Interest in well-defined characters and engaging plots is a hallmark of their media preferences, aligning with their recent focus on memorable films that combine humor with adventure.\n\nOverall, this user remains enthusiastic about classic action-adventure and comedy content, highlighting a preference for complete collections that deliver immersive and entertaining viewing experiences.",
  "metrics": {
    "rouge1_f": 0.17915904936014626,
    "rouge2_f": 0.01282051282051282,
    "rougeL_f": 0.07129798903107862,
    "meteor": 0.05268925982127803,
    "bleu1": 0.00899114104746325,
    "bleu2": 0.0026417884284885475,
    "bleu3": 0.0004080851467060142,
    "bleu4": 0.00016053503855770876,
    "bertscore_precision": 0.3480153977870941,
    "bertscore_recall": 0.45419809222221375,
    "bertscore_f1": 0.39407944679260254
  }
}