{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/01/29\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul W.S. Anderson'], 'Producers': ['Dennis Berardi', 'Jeremy Bolt', 'Ken Kamins', 'Robert Kulzer', 'Martin Moszkowicz'], 'Starring': ['Milla Jovovich', 'Ron Perlman', 'Tony Jaa']}\nReview Text: Fun movie to watch..I don't pick movies apart..I watch them for enjoyment. I was entertained.\nReview Title: Entertaining movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Tales of the Gold Monkey: The Complete Series\nStephen Collins  (Actor),     Jeff MacKay  (Actor),     Virgil Vogel  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Product Description', 'Broadcast on ABC in early 80s, the series became a massive hit following the success of Indiana Jones’s ‘Raiders of The Lost Ark’. This 22-hour long series is set in a backwater corner of the South Pacific a young American adventurer and his ragtag group of friends become involved in death-defying hi-jinx, transporting people-on-the-run in a well-worn Grumman Goose seaplane. Set in 1938, this series captures the ambiance and character of a mysterious romantic era. Directors: Harvey S Laidman, Virgil W Vogel, James Frawley, Winrich Kolbe, Ray Austin, James Fargo. Stars: Stephen Collins (', 'Private Practice', ',', '7th Heaven', ',', 'Blood Diamond', '), Caitlin O’Heaney, Roddy McDowall (', 'Planet of The Apes', '), Jeff Mackay (', 'JAG', ',', 'Magnum PI', ',', 'Black Sheep Squadron', '.) Show Created by: Donald P Bellisario (', 'Magnum', ',', 'Airwolf', ',', 'Quantum Leap', ',', 'JAG', ',', 'NCIS', ').', 'Amazon.com', 'Stephen Collins heroically tries to keep up with the (Indiana) Joneses as rakishly charming soldier of misfortune Jake Cutter, who works as a pilot for hire on the South Pacific island of Boragora in 1938. Comparisons with', 'Raiders of the Lost Ark', 'are inevitable, but according to the series retrospective included as a bonus feature on this six-disc set, producer Don Bellisario (', 'Quantum Leap', ',', 'Magnum P.I.', ', and', 'NCIS', ') pitched this to the networks before Indy ever cracked his whip. It was only after', 'Raiders', 'became such a colossal hit that ABC saw gold in', 'Monkey', \". Alas, this series never really took off, but nearly 30 years later, it's a grandly entertaining bit of escapist fare that packs old Hollywood Saturday matinee thrills and adventure into every episode. The colorful characters include Corky (Jeff Mackay), Jake's trusty (when he's not drunk) mechanic and sidekick; Bon Chance Louie (the peerless Roddy McDowall), the ethically questionable French liaison and governor, and owner of the disreputable hangout the Monkey Bar; and Sarah Stickney White (Caitlin O'Hearney), chanteuse and spy. Stealing nearly every scene he's in is Jack, Jake's one-eyed dog, always good for a comical cutaway. You can't beat the Nazis for villainy (check out John Hillerman's outrageous accent in the feature-length pilot episode), but\", 'Monkey', 'steps over the PC line with deadly dragon lady Koji (Marta Du Bois) and her samurai henchman. These', 'Tales', 'are told mostly tongue-in-cheek. Expensive for its day, the series nevertheless has a B-movie look, which enhances its hokey charms. In addition to the newly filmed interviews with cast and creators, the bonus features include five immersive audio commentaries, as well as detailed character bios and a series \"fact file.\" Virtually unseen since its original broadcast,', 'Tales of the Gold Monkey', 'is of more than nostalgic interest. Stephen Collins fans will surely be in--wait for it--', '7th Heaven', '.', '--Donald Liebenson']\n{'Genre': 'Action & Adventure/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Contributor': \"Caitlin O'Heaney, Les Jankey, John Calvin, John Fujioka, Stephen Collins, Conrad Bachmann, Roddy McDowall, Ahmed Kalane, Leo the Dog, Greg Elliot, Jeff MacKay, Marta DuBois, Virgil VogelCaitlin O'Heaney, Les Jankey, John Calvin, John Fujioka, Stephen Collins, Conrad Bachmann, Roddy McDowall, Ahmed Kalane, Leo the Dog, Greg Elliot, Jeff MacKay, Marta DuBois, Virgil Vogel  See more\", 'Language': 'Unqualified', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.6 Ounces', 'Item model number': '7305456', 'Director': 'Virgil Vogel', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC', 'Run time': '16 hours and 30 minutes', 'Release date': 'June 8, 2010', 'Actors': \"Stephen Collins, Jeff MacKay, Leo the Dog, Caitlin O'Heaney, Roddy McDowall\", 'Studio': 'Fabulous Films/Shout! Factory', 'Number of discs': '6'}\nGreat series\nFive Stars\nThe Mel Brooks Collection\nCleavon Little  (Actor),     Gene Wilder  (Actor)    Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['“Enjoy! Revel! Live!” as Mel says…and “have yourselves one sweetheart of a good time.” Presenting nine hugely popular films from one of cinema’s most celebrated, prolific and funniest filmmakers, Mel Brooks! The undisputed king of hilariously quotable films, Mel has delivered hit after hit after hit, each one as memorable as the next. This nine-disc Blu-rayTM collection includes some of the most sidesplitting, gut-busting, guffaw-inducing films ever made. It really is “good to be the king!”Contains the films Blazing Saddles, Spaceballs, Young Frankenstein, High Anxiety, History Of The World Part 1, Robin Hood: Men In Tights, Silent Movie, To Be Or Not To Be and The Twelve Chairs.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.42 Pounds', 'Item model number': 'FOXS2281601BR', 'Director': 'Mel Brooks', 'Media Format': 'Blu-ray, NTSC, Color', 'Run time': '14 hours and 28 minutes', 'Release date': 'May 8, 2012', 'Actors': 'Cleavon Little, Gene Wilder, Slim Pickens, Harvey Korman, David Huddleston', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '9'}\nGreat movies\nFive Stars\nEscape Room: Tournament of Champions [DVD]\nTaylor Russell  (Actor),     Logan Miller  (Actor),     Adam Robitel  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Escape Room: Tournament of Champions is the sequel to the box-office hit psychological thriller that terrified audiences around the world. In this installment, six people unwittingly find themselves locked in another series of escape rooms, slowly uncovering what they have in common to survive…and discovering they’ve all played the game before.']\n{'Genre': 'Horror, Thriller, Action/Adventure', 'Format': 'Subtitled, NTSC', 'Contributor': 'Taylor Russell, Indya Moore, Original Film, Logan Miller, Thomas Cocquerel, Deborah Woll, Holland Roden, Carlito Olivero, Adam Robitel, Neal MoritzTaylor Russell, Indya Moore, Original Film, Logan Miller, Thomas Cocquerel, Deborah Woll, Holland Roden, Carlito Olivero, Adam Robitel, Neal Moritz   See more', 'Language': 'English', 'Runtime': '1 hour and 28 minutes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '7.48 x 5.35 x 0.55 inches; 2.56 Ounces', 'Audio Description': 'English', 'Director': 'Adam Robitel', 'Media Format': 'Subtitled, NTSC', 'Run time': '1 hour and 28 minutes', 'Release date': 'October 5, 2021', 'Actors': 'Taylor Russell, Logan Miller, Deborah Woll, Indya Moore, Holland Roden', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Neal Moritz', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI watch movies to be entertained. Mission accomplished. Movie in good shape\nGood movie\nGhostbusters: Afterlife\nScience Fiction, Comedy, Fantasy, Adventure\n['When a single mom and her two kids arrive in a small town, they begin to discover their connection to the original Ghostbusters and the secret legacy their grandfather left behind.']\n{'Content advisory': ['Violence', 'frightening scenes', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jason Reitman'], 'Producers': ['Ivan Reitman'], 'Starring': ['Paul Rudd', 'Carrie Coon', 'Finn Wolfhard']}\nI watch movies to be entertained...this one did it.\nEntertaining\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Cassar', 'Karen Gaviola', 'Alex Graves', 'Nelson McCormick', 'Bryan Spicer'], 'Producers': ['Fox'], 'Studio': ['FOX']}\nMy type of series..wish it hadn't been cancelled so quickly.\nEnjoyable\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jaume Collet-Serra'], 'Producers': ['Dwayne Johnson', 'Hiram Garcia', 'Beau Flynn', 'John Fox'], 'Starring': ['Dwayne Johnson : Frank Wolff', 'Emily Blunt : Lily Houghton', 'Edgar Ramirez : Aguirre'], 'Studio': ['Disney']}\nVery enjoyable movie. The stars complimented each other very well. We really liked it.\nGood movie\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul W.S. Anderson'], 'Producers': ['Dennis Berardi', 'Jeremy Bolt', 'Ken Kamins', 'Robert Kulzer', 'Martin Moszkowicz'], 'Starring': ['Milla Jovovich', 'Ron Perlman', 'Tony Jaa']}\nFun movie to watch..I don't pick movies apart..I watch them for enjoyment. I was entertained.\nEntertaining movie",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user continues to favor action and adventure genres, alongside psychological thrillers and comedies. Their recent interaction emphasizes a preference for films that provide entertainment value, showcasing a tendency to appreciate engaging narratives and enjoyable viewing experiences.\n\n- **Media Format**: The user's loyalty to high-quality formats like Blu-ray persists, but their exploration of DVD formats illustrates an open-minded approach to diverse media options, particularly for captivating stories.\n\n- **Nostalgia**: A love for classic films is apparent, yet there’s an increasing fondness for contemporary releases that effectively blend nostalgic elements with humor and drama, indicating a willingness to embrace modern storytelling.\n\n- **Engagement**: The user remains highly enthusiastic about cinematic content, as reflected in their glowing five-star ratings and positive reviews. Their latest interaction highlights their enjoyment-focused perspective, emphasizing a desire for quality entertainment over critical analysis.\n\n- **Ratings**: A consistent commitment to thoughtful ratings is noted, with recent reviews showcasing appreciation for films that deliver fun and strong performances, even if they don't delve into detailed critiques.\n\nOverall, the user actively seeks immersive and entertaining viewing experiences across various genres and formats, while balancing a deep appreciation for classic films with an ongoing exploration of contemporary narratives that resonate with their evolving tastes.",
  "metrics": {
    "rouge1_f": 0.1222366710013004,
    "rouge2_f": 0.0078125,
    "rougeL_f": 0.052015604681404426,
    "meteor": 0.03260853650845531,
    "bleu1": 0.000330914632259647,
    "bleu2": 9.047493772453912e-05,
    "bleu3": 1.4266583461947224e-05,
    "bleu4": 5.670647031911385e-06,
    "bertscore_precision": 0.33193403482437134,
    "bertscore_recall": 0.46377891302108765,
    "bertscore_f1": 0.38693350553512573
  }
}