{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Pete's Dragon\nReview Date: 2020/10/06\nStore: Bryce Dallas Howard  (Actor),     Robert Redford  (Actor),     David Lowery  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: [\"When a mysterious 10-year-old boy, Pete, turns up, claiming to live in the woods with a giant green dragon, it's up to a forest ranger, Grace, and young Natalie to learn where the boy came from, where he belongs, and the truth about this magical dragon.\"]\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936851281', 'Director': 'David Lowery', 'Media Format': 'AC-3, Dolby, NTSC, Subtitled, Dubbed', 'Run time': '1 hour and 43 minutes', 'Release date': 'November 29, 2016', 'Actors': 'Bryce Dallas Howard, Robert Redford, Oakes Fegley, Wes Bentley, Karl Urban', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Walt Disney Studios', 'Writers': 'Screenplay By David Lowery & Toby Halbrooks, Based On A Screenplay By Malcolm Marmorstein', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Our whole family loved this magical boy meets dragon book.\nReview Title: One of the most charming movies ever.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Sing\nMatthew McConaughey  (Actor),     Reese Witherspoon  (Actor),     Garth Jennings  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"From Illumination Entertainment, the studio that brought you The Secret Life of Pets comes an animated comedy about finding the music that lives inside all of us. Sing stars Academy Award winner Matthew McConaughey as Buster Moon, an eternally optimistic koala who puts on the world's greatest singing competition to save his crumbling theater; Academy Award winner Reese Witherspoon as Rosita, an overworked and underappreciated mother of 25 piglets desperate to unleash her inner diva; Scarlett Johansson as Ash, a punk rock porcupine with a beautiful voice behind her prickly exterior; and Taron Egerton as Johnny, a young gangster gorilla looking to break free of his family's felonies. Sing is the musical comedy event of the year!Bonus Content:\", 'The Making of Sing', 'The Making of Sing', 'Finding the Rhythm: Editing Sing', 'Finding the Rhythm: Editing Sing', 'Character Profiles', 'Character Profiles', '\"Don\\'t You Worry \\'Bout a Thing\" Music Video', '\"Don\\'t You Worry \\'Bout a Thing\" Music Video', 'Making a Music Video with Tori Kelly', 'Making a Music Video with Tori Kelly', '\"Faith\" Music Video', '\"Faith\" Music Video', '\"Faith\" Lyric Video', '\"Faith\" Lyric Video', '\"Set\\xa0It All Free\" Lyric Video', '\"Set\\xa0It All Free\" Lyric Video', 'Sing & Dance! - \"Faith\"', 'Sing & Dance! - \"Faith\"', 'The Sing Network', 'The Sing Network', 'The Best of Gunter', 'The Best of Gunter', '\"Gunter Babysits\" Mini-Movie', '\"Gunter Babysits\" Mini-Movie', '\"Love At First Sight\" Mini-Movie', '\"Love At First Sight\" Mini-Movie', '\"Eddie\\'s Life Coach\" Mini Movie', '\"Eddie\\'s Life Coach\" Mini Movie', 'The Making of the Mini-Movies', 'The Making of the Mini-Movies']\n{'Genre': 'Musicals & Performing Arts, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Comedy, Sing MovieMusicals & Performing Arts, Kids & Family, DVD Movie, Animation, Blu-ray Movie, Comedy, Sing Movie   See more', 'Format': 'Color, NTSC, Animated, Subtitled, Special Edition, Widescreen', 'Contributor': 'Matthew McConaughey, Tori Kelly, Reese Witherspoon, Taron Egerton, Garth Jennings, Scarlett Johansson, Seth MacFarlaneMatthew McConaughey, Tori Kelly, Reese Witherspoon, Taron Egerton, Garth Jennings, Scarlett Johansson, Seth MacFarlane   See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.6 x 5.4 x 0.6 inches; 2.75 Ounces', 'Item model number': '0025192366635', 'Director': 'Garth Jennings', 'Media Format': 'Color, NTSC, Animated, Subtitled, Special Edition, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 21, 2017', 'Actors': 'Matthew McConaughey, Reese Witherspoon, Seth MacFarlane, Scarlett Johansson, Taron Egerton', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWatched it and had to get it. so much fun.\nSo much fun!\nThe Big Bang Theory: The Twelfth and Final Season [DVD]\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['The Big Bang Theory: The Twelfth and Final Season: Leonard and Sheldon are brilliant physicists – geniuses in the laboratory but socially challenged everywhere else. Enter beautiful, street-smart neighbor Penny, who aims to teach them a thing or two about life. Despite their on-again, off-again relationship in the past, Leonard and Penny have finally gotten married. Even Sheldon has found a female companion, entering into a “relationship agreement” with neurobiologist Amy Farrah Fowler, and he recently took their relationship to the next level by marrying her after a long courtship. In their free time, Leonard and Sheldon enjoy fantasy role-playing games with their ever-expanding universe of friends, including fellow scientists Raj, Howard and Howard’s adorable microbiologist wife, Bernadette, who is adjusting to life with their two children.']\n{'Genre': 'Comedy', 'Format': 'Subtitled, NTSC, DVD', 'Contributor': 'Steve Holland, Bill Prady, Maria Ferrari, Steve Hollander, Jim Parsons, Kunal Nayyar, Simon Helberg, Dave Goetsch, Johnny Galecki, Kaley Cuoco, Mayim Bialik, Melissa Rauch, Steven Molaro, Eric Kaplan, Chuck LorreSteve Holland, Bill Prady, Maria Ferrari, Steve Hollander, Jim Parsons, Kunal Nayyar, Simon Helberg, Dave Goetsch, Johnny Galecki, Kaley Cuoco, Mayim Bialik, Melissa Rauch, Steven Molaro, Eric Kaplan, Chuck Lorre  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.96 Ounces', 'Media Format': 'Subtitled, NTSC, DVD', 'Run time': '2 hours and 4 minutes', 'Release date': 'November 12, 2019', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar', 'Subtitles': 'English, French, Spanish', 'Producers': 'Chuck Lorre, Steven Molaro, Bill Prady, Steve Hollander, Steve Holland', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nThis show is a riot of fun and yet quite insightful often times. Love the characters!\nWitty and somewhat wacky comedy.\nThe Big Bang Theory: The Complete Tenth Season [DVD]\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['The Big Bang Theory: The Complete Tenth Season (DVD)', 'The universe of Drs. Leonard Hofstadter and Sheldon Cooper is endlessly complicated and hilarious as THE BIG BANG THEORY enters the tenth dimension! Last season, Leonard and Penny went from next-door neighbors to next-door newlyweds with a nuptial excursion to Vegas. This season, they find themselves in a repeating paradigm as they re-create their wedding – this time with family including Penny’s mother (Katey Sagal) and brother (Jack McBrayer) and Leonard’s parents (Christine Baranski & Judd Hirsch). Meanwhile, the Relationship Agreement between Sheldon and Amy added an entirely new subsection with their annual coitus clause. Also, gravitating in their universe, Howard and Bernadette prepare for the arrival of a little Wolowitz, while Raj finds himself juggling not one, but two girlfriends. Prepare to test a new hypothesis of inspired comedy that’s nothing short of genius in Season Ten!', ']]>']\n{'Genre': 'Comedy', 'Format': 'DVD, NTSC', 'Contributor': 'Steve Holland, Maria Ferrari, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Jim Reynolds, Dave Goetsch, Johnny Galecki, Kaley Cuoco, Mayim Bialik, Melissa Rauch, Steven Molaro, Eric Kaplan, Chuck LorreSteve Holland, Maria Ferrari, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Jim Reynolds, Dave Goetsch, Johnny Galecki, Kaley Cuoco, Mayim Bialik, Melissa Rauch, Steven Molaro, Eric Kaplan, Chuck Lorre  See more', 'Language': 'English', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Media Format': 'DVD, NTSC', 'Release date': 'September 12, 2017', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar', 'Dubbed': 'English', 'Subtitles': 'English, Spanish, French', 'Producers': 'Chuck Lorre, Steven Molaro, Bill Prady, Dave Goetsch, Eric Kaplan', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nWhat a bunch of both fun and interesting characters in this show about four nerds and the cute lively blonde gal who moves in next door.\nGreat off beat comedy.\nThat Thing You Do - Dir. Cut\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Tom Hanks writes, directs and co-stars in this refreshing, big-hearted comedy that captures the overnight triumph of an American rock band during the glory days of rock and roll.']\n{'Genre': 'Comedy', 'Format': 'NTSC', 'Language': 'Unqualified (DTS ES 6.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'NTSC', 'Studio': 'FOX'}\nFun and so real you will think it actually happened.\nGreat movie!\nConeheads\nSteve Barron  (Director),     Dan Aykroyd  (Actor, Writer),     Jane Curtin  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Coneheads (DVD)', \"The Coneheads were a sketch on the Saturday Night Live television show of the late '70s which were expanded to feature-length proportions with this film. The story concerns Beldar (Dan Aykroyd) and Prymaat (Jane Curtin), who leave the planet Remulak to prepare for an invasion of Planet Earth. But due to a malfunction, they find themselves plunged into the Hudson River and forced to take up residence in Paramus, New Jersey where Beldar gets work as an appliance salesman and makes a deal for a phony social security card. Before long, all thoughts of invading Earth are left behind as Beldar and Prymaat quickly adapt to suburban life — except for their coneheads and metallic-sounding voices, they become a typical middle-class suburban family.\", ']]>']\n{'Genre': 'Science Fiction & Fantasy, Comedy', 'Format': 'Multiple Formats, Color, Dolby, Widescreen, NTSC', 'Contributor': 'Kevin Marcy, Steve Barron, Dan Aykroyd, Terry Turner, Chris Farley, Lorne Michaels, Barnaby Thompson, Bonnie Turner, Tom Davis, Michael I. Rachmil, David Spade, Michelle Burke, Jane CurtinKevin Marcy, Steve Barron, Dan Aykroyd, Terry Turner, Chris Farley, Lorne Michaels, Barnaby Thompson, Bonnie Turner, Tom Davis, Michael I. Rachmil, David Spade, Michelle Burke, Jane Curtin  See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 26 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '883929303588', 'Director': 'Steve Barron', 'Media Format': 'Multiple Formats, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 26 minutes', 'Release date': 'April 17, 2001', 'Actors': 'Dan Aykroyd, Jane Curtin, Michelle Burke, Chris Farley, David Spade', 'Producers': 'Michael I. Rachmil, Kevin Marcy, Lorne Michaels, Barnaby Thompson', 'Studio': 'Warner Bros.', 'Writers': 'Tom Davis, Dan Aykroyd, Bonnie Turner, Terry Turner', 'Number of discs': '1'}\nReally enjoyed the plot excellent characters and fun!!!\nOne of the best alien comedies ever.\nFairytale - A True Story\nFlorence Hoath  (Actor),     Bob Peck  (Actor),     Charles Sturridge  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n[\"Do you believe? Young Frances and Elsie do. They say they've encountered the supernatural. They've met fairies. The photos the girls take of the winged beings put them at the center of a real-life controversy that sweeps England during World War I. Everyone is caught up in the excitement, including two of the era's most renowned men: Sherlock Holmes' author Sir Arthur Conan Doyle (Peter O'Toole) and master illusionist Harry Houdini (Harvey Keitel). Are the girls' photos real or a clever hoax? One thing is for sure: with enchantment, a sense of wonder and glorious special effects, FairyTale: A True Story is superb family entertainment. (English), Do you believe? Young Frances and Elsie do. They say they've encountered the supernatural. They've met fairies. The photos the girls take of the winged beings put them at the center of a real-life controversy that sweeps England during World War I. Everyone is caught up in the excitement, including two of the era's most renowned men: Sherlock Holmes' author Sir Arthur Conan Doyle (Peter O'Toole) and master illusionist Harry Houdini (Harvey Keitel). Are the girls' photos real or a clever hoax? One thing is for sure: with enchantment, a sense of wonder and glorious special effects, FairyTale: A True Story is superb family entertainment. (Spanish)\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'D59184079D', 'Director': 'Charles Sturridge', 'Media Format': 'AC-3, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'April 23, 2012', 'Actors': 'Florence Hoath, Bob Peck, Bill Nighy, Paul McGann, Harvey Keitel', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nThis based on real life movie and really captivated us all.\nTouching and magical movie for all the family.\nPete's Dragon\nBryce Dallas Howard  (Actor),     Robert Redford  (Actor),     David Lowery  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"When a mysterious 10-year-old boy, Pete, turns up, claiming to live in the woods with a giant green dragon, it's up to a forest ranger, Grace, and young Natalie to learn where the boy came from, where he belongs, and the truth about this magical dragon.\"]\n{'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '786936851281', 'Director': 'David Lowery', 'Media Format': 'AC-3, Dolby, NTSC, Subtitled, Dubbed', 'Run time': '1 hour and 43 minutes', 'Release date': 'November 29, 2016', 'Actors': 'Bryce Dallas Howard, Robert Redford, Oakes Fegley, Wes Bentley, Karl Urban', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Walt Disney Studios', 'Writers': 'Screenplay By David Lowery & Toby Halbrooks, Based On A Screenplay By Malcolm Marmorstein', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOur whole family loved this magical boy meets dragon book.\nOne of the most charming movies ever.",
  "profile": "**Updated User Profile Summary:**\n\n- **Main Interests:** Animated family movies, comedies, television shows, musicals, and performing arts, with a highlight on ensemble sitcoms and heartfelt comedies. The user has a strong admiration for narratives that evoke nostalgia and magic.\n\n- **Preferred Content:** Enjoys light-hearted, engaging stories that seamlessly blend humor with enchanting themes and relatable characters. Prioritizes family-friendly entertainment that fosters emotional connections through wonder and charm.\n\n- **Audience Engagement:** Actively seeks content that resonates across different age groups, emphasizing comedic elements that enhance shared family experiences, particularly those featuring magical elements.\n\n- **Rating Behavior:** Consistently provides high ratings (overall average of 4.8), favoring films and series that offer quality storytelling coupled with enchanting experiences. Recent interactions affirm this, especially with highly-rated magical narratives that deliver charm and uplifting themes.\n\n- **Purchase Patterns:** Shows a preference for acquiring products that promise enjoyable, socially enriching experiences, particularly within comedy and family narratives. The user's recent purchases continue to reflect an interest in magical and heartfelt stories.\n\n- **Community Engagement:** Engages deeply with content featuring acclaimed actors and respected production teams, highlighting a strong appreciation for talented individuals in the industry.\n\nThis user emphasizes a love for comedic, magical narratives that inspire joy and foster shared family experiences, reinforcing a commitment to high-quality entertainment that resonates with both children and adults.",
  "metrics": {
    "rouge1_f": 0.08350906790383805,
    "rouge2_f": 0.008442380751371886,
    "rougeL_f": 0.04217629692113032,
    "meteor": 0.02524541191912835,
    "bleu1": 1.3498921714718811e-05,
    "bleu2": 3.921905348716387e-06,
    "bleu3": 5.803142178339413e-07,
    "bleu4": 2.2342580664346032e-07,
    "bertscore_precision": 0.35481101274490356,
    "bertscore_recall": 0.49482348561286926,
    "bertscore_f1": 0.41328081488609314
  }
}