{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bio Ionic Universal Diffuser, 1 Count\nReview Date: 2016/09/02\nAverage Rating: 4.4\nProduct Details: {'Brand': 'BIO IONIC', 'Color': 'Black', 'Recommended Uses For Product': 'Salon', 'Special Feature': 'NanoIonic mineral hydrates dry, damaged hair. Smoothes fly-aways and controls frizz. Creates brilliance and shine.NanoIonic mineral hydrates dry, damaged hair. Smoothes fly-aways and controls frizz. Creates brilliance and shine.   See more', 'Auto Shutoff': 'No', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '19.69 x 19.69 x 11.02 inches; 7.76 Ounces', 'Item model number': 'Diffuse-5', 'UPC': '874822004269', 'Manufacturer': 'BIO IONIC'}\nReview Text: Several years ago I had purchased a blowdryer with a similar attachment. I absolutely adored that thing - you could use it on the top of your hair or the sides to give lift so your hair had volume without using any product or doing any backbrushing. The thing was a miracle worker!<br /><br />Then we entered the era of pin straight hair, and volume and body were out. Thank God, we seem to be passing that era, but hairstyling implements seem to be lagging behind. I was dying to try this diffuser to see if it emulated the gizmo from long ago, and it does. Well made hair styling tool that gives lift and volume to your hair, I love it. Well, kinda.<br /><br />I'm not sure how 'universal' this is. I tried it on my current blowdryer, and it didn't fit. I had to go digging around until I finally found a Conair dryer upon which it fit, and the funny thing is that it fit like it was MADE for the dryer. The odd thing is that the Conair looks to have the same kind of nozzle the other blowdryer had, so go figger.<br /><br />IF you have a blowdryer that marries this diffuser well, this is definitely something you're going to want in your hair arsenal. It'd almost be worth getting a new dryer just to use this, it's that good (one star off for the weirdess of the 'universal' claim.)\nReview Title: IF your blowdryer is a match for this diffuser, you are going to want it for lift and volume. Nothing else compares.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Decades of Fragrance 1920 by Besame Cosmetics for Women 1.7 oz Eau de Parfum with Atomizer Pump\nBESAME COSMETICS\n{'Brand': 'BESAME COSMETICS', 'Item Form': 'Stick', 'Item Volume': '1.7 Fluid Ounces', 'Age Range (Description)': 'Adult', 'Style': 'Modern', 'Product Dimensions': '4 x 6 x 1 inches; 1.6 Ounces', 'UPC': '185805000988 885277533730', 'Manufacturer': 'SFR Products'}\nWhen everyone was wearing clear or neutral glosses, I wasn't phased. I'm a red lipstick addict from way back, and I just toned down the red and added a little gloss to update it.<br /><br />Thank God, though, it looks like real, pure reds are making a comeback. I read about Besame's vintage cosmetics line, and as my MAC red was about gone, I figured I'd try one of their reds.<br /><br />My coloring is a brunette with a very fair complexion. Frankly, except for goth dark reds, I can wear pretty much any shade. I picked Besame Red since it seemed middle of the line in terms of color, and I wanted to get an idea how this cosmetics line worked.<br /><br />The first thing that surprised me is it comes on a card. This lipstick isn't cheap; you'd think the packaging would be a little nicer. (I get they're trying to do vintage cosmetics, but if you're going to make it look like Coty or Max Factor from the 40s, you probably don't want to charge a hefty price for it.)<br /><br />The other surprise is that the tube isn't heavy. Everyone raves about the metal container, but like so? It's lightweight. I've had some heavy lipstick containers from luxury lines that bragged about the lipstick containers being jewel-like, and they were.<br /><br />This container isn't.<br /><br />So now with my quibbles out of the way, let me say the lipstick itself is NICE. Some said the lipstick is small; it isn't. It seems about the size of most lipsticks with a double bevel to make putting it on easy.<br /><br />I always use a lipbrush (does away with lipliner and makes lipstick in the case last FOREVER. You'll get tired of the lipstick before it runs out.)<br /><br />The first surprise is the scent. I don't recall any lipstick except some glosses having a discernable scent. This one does, rather vanilla-y. It's pleasant.<br /><br />The lipstick texture in the tube is, surprisingly, moist. It goes on easily, but it's not so moisturizing that the color doesn't last.<br /><br />I put it on and did the old fashioned lip blotting with a piece of toilet paper. With a super slushy lipstick, this will almost take the entire thing off. Not so with Besame. The color is very saturated and stayed on my lips nicely.<br /><br />The lip blotting didn't get rid of the moisture. My lips still feel nice. The color lightened up a bit (which happens with blotting.) You're supposed to add another layer of lipstick after this, but I usually don't. The color was still very saturated, so there was no need for more.<br /><br />The staying power is excellent! It lasted all day, and my lips never dried out.<br /><br />If you love the color (and use a lipbrush), you'll get WAY more out of this true red to the point where you'll get tired of it before it runs out.<br /><br />I'm definitely going to be investigating more of the Besame line.<br /><br />N.B. One other trick that works if you want your lipstick to last into next week. Blot the first coat and put on a bit of powder with your finger - baby powder or compact powder does nicely. Blot again, and put on another coat of lipstick. It'll last through dinner and into next Christmas. :)\nPure retro red\nOZNaturals Retinol Serum\nOZ Naturals\n{'Skin Type': 'All', 'Product Benefits': 'Anti-Aging', 'Scent': 'Aloe', 'Brand': 'OZ Naturals', 'Item Form': 'Serum', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 1 inches; 2 Pounds', 'Item model number': 'RH-3IDU-H0P1', 'UPC': '755332410071 641020517316', 'Manufacturer': 'Oz Naturals'}\nI'm totally loving the OZ skin care line, and this retinol serum is an excellent addition! Works very gently but decisively in skimming off dead cells to reveal new, healthy skin. It absorbs quickly and isn't greasy. I added it to my nighttime regimen and within a week, my complexion was experiencing a really radiant, healthy glow, and all without redness or irritation.<br /><br />I'd also add that OZ products are, by and large, an excellent buy. This container was enormous and should easily last six months. I can't recommend this skin care line highly enough.<br /><br />**Product was provided for my honest review.\nCan't praise this enough!\nHOSL Flat Contour Brush Foundation Brush Makeup Brushes-1 PCS Silver and Black Color (Silver and Black)\nHOSL\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5 x 1.5 x 0.7 inches; 1.6 Ounces', 'UPC': '736950050429'}\nIn my younger days, I used to model, so I became an old hand at contouring, which seems to have been revived a la Kim Kardashian. One of my favorite brushes from then was a flat contouring brush that was angled. I absolutely adored it for adding the right shadow under my cheekbones to make them stand out.<br /><br />Since the contouring revival, I decided to give this a go again, but I couldn't find a reasonably priced brush that did what I wanted it to do (I refuse to spend a fortune on a brush for this, mostly because I do not see contouring lasting very long, but that's another review.) The HDSL brush came closest to what I was looking for: dense, flat and with a good handle.<br /><br />It kind of looks like a paint brush, but the hair is VERY nice. Very soft and dense, and a miracle for something that's less than six bucks. My contouring skills are such that I know not to buy an entire palette of colors that are way too orangey or warm. I use Kevyn Aucoin's contour powder which is way pricey (you can find something similar in color in Makeup Forever's eyeshadow line), but the Aucoin contour powder color was absolutely perfect.<br /><br />As I'm sure you know, contour is meant to mimic a shadow. It is NOT a bronzer (you cannot contour with anything with the slightest bit of shine); too orange and you look ridiculous. The color is a light matte taupe with zero hint of red in it. It should NOT be too dark, unless you are dark complected. Think of it as being two shades darker than your skin color, the way a shadow is cast on the hollows or low areas of your face.<br /><br />This brush picked up the powder like a champ and deposited it nicely. Does a great job fading the contour color out so it looks like a shadow and not like I have a swath of dirt on my face. My only hesitation with this so far is that I wish it was angled, but no matter. It's not that hard to use in such a way (well, what do you want for less than six bucks?)<br /><br />I'd definitely recommend this. You won't get anything better at anywhere near the price.\nWhat contouring is and isn't, and why this is a great brush to use for it\nBoo-Boo Cover-Up Healing Concealer, Medium, 0.13 Ounce\nBoo-Boo Cover-Up\n['Have a Boo-Boo on the Go? Skip the bandage and the shiny ointment. Look your best even while you heal with Baby Boo-Boo Cover-Up for the Face and Body. Our innovative formula offers great coverage for skin imperfections while containing ingredients known in nature to promote healing. Contains aloe, chamomile, green tea, tea tree oil and vitamin E Net Weight 0.13 oz / 4 mL']\n{'Item Form': 'Cream', 'Color': 'Medium', 'Package Information': 'Bottle', 'Brand': 'Boo-Boo Cover-Up', 'Coverage': 'Medium', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.5 x 2 x 1 inches; 0.8 Ounces', 'UPC': '723175846012'}\nI had a small bruise on my face from a cosmetic procedure, and it was driving me crazy that none of my concealers or foundations would cover it. Several friends had gotten the Boo-Boo concealer in a beauty box, and highly recommended it, so I grabbed it when I saw Amazon had it on sale.<br /><br />I'm very fair, so I got the light version. Ummm, I guess I'm not as fair as I thought; they aren't kidding when they say 'fair'! This is Caspar white!<br /><br />No matter. I mixed a bit of foundation in a more human shade in with the Boo-Boo, and my bruise was history (or at least until I washed my makeup off.) Very nice cover-up, no creasing, no caking, and it didn't move all day. The only issue I had, aside from how light the lightest shade was, is that it did such a good job of covering up the bruise it made the surrounding skin look naked (this is a VERY full coverage item.) Just be aware of that when you buy it.<br /><br />And take them at their word for the color! I'm probably somewhere between light and medium in the Boo-Boo universe. You can always add a drop or two of your foundation to make the color more your shade.\nExcellent concealer; just beware that when they say 'light', they mean LIGHT!\nNATURAL VEGAN Face Wash Cleanser 2PK | Natural Aloe Vitamin Rich Foaming Facial Skin Cleansing | BEST pH Balanced Facial Soap for Sensitive Skin, Oily, Dry | Fragrance Free Naturals for Women and Men\nThe Crown Choice\n{'Item Form': 'Foam', 'Skin Type': 'Acne prone,oily,combination,sensitive,all skin types', 'Brand': 'The Crown Choice', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Vegan', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5 x 2 x 2 inches; 0.35 Ounces', 'UPC': '687077990511'}\nI'm very big into skincare. Way before I got a Clarisonic, I used scrubbing sponges for daily exfoliation. This facial cleansing pad is a new one to my skincare arsenal. It seems to be a take on various Korean modes of skin cleansing that are currently popular.<br /><br />First off, let me say this sponge is very soft, much softer than anything I've ever used for exfoliating on my face. But while it's soft, it does a great job of getting rid of dead skin cells without stripping your skin raw. The outer surface feels almost silky, but when you put your fingers in and slightly stretch it to keep it on for use, the stretching opens up the cells in the surface and reveals a very effective, yet gentle, exfoliating mechanism.<br /><br />It's very easy to use, and very easy to clean - it comes with a silken loop to hang it for drying (it dries quickly.) All in all, I like this a lot. It's a nice change from daily Clarisonic use, one my skin truly appreciates. I'd definitely  put this on my 'must buy' list if you're serious about skincare.<br /><br />(I received a sample of this item to facilitate my honest and unbiased review.)\nPleasant change of pace from the Clarisonic\n[Etude House] Lip Perfume\nEtude House\n['Etude House Lip Perfume']\n{'Brand': 'Etude House', 'Skin Type': 'All', 'Item Form': 'Oil', 'Age Range (Description)': 'Adult', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.2 x 0.2 x 7.01 inches; 2.08 Ounces', 'Item model number': 'gunt-poo-hyu08-opd836', 'UPC': '885990043523 698798231234 887222098790 698798211250 889650108591 887222288733 887222101193 889650096355 889650059374 887222100394', 'Manufacturer': 'Etude House'}\nThis is going to sound really stupid, but I could never figure out why certain shades of pink lipstick never looked the same on my lips as they did in arm swatches. I really never connected the thing is that I have pigmented lips, and because they pull red, any color always has a reddish cast to it. And definitely no pink lipstick, especially anything lighter than medium, ever looked right.<br /><br />I started looking around to see if there was some product I could use, since foundation is just drying and causes flaking. I was told that MAC makes a good lip coverup, but it's $20 (why is everything at MAC $20 and up?) I don't have a problem spending the money, but since there's no freestanding MAC store near me, I thought I'd give this Etude House concealer a try.<br /><br />And it's good. Unlike plain foundation, it's very glossy when you first apply it. It truly blots out your real lip color; it's like lip White-Out. In a mirror, you look like you're looking at a photo negative!<br /><br />This stuff is way too glossy to put anything over it without blotting. The dry down takes forever without blotting, but I was pleasantly surprised to see that once I blotted, the white out effect was still very much there, just not glossy, and so, ready for lipstick. The one thing it does really well  is block out the red of my lips and give my lip products a much truer color payoff.<br /><br />I was very pleasantly surprised at how well it turned out. The only caution I'd say is you don't need to put on as much of this as I did; you'll just be wasting product, and there's no dry down when you overdo it!\nWhite-Out for lips; gives you the true color your lipstick was meant to be!\nBio Ionic Universal Diffuser, 1 Count\n{'Brand': 'BIO IONIC', 'Color': 'Black', 'Recommended Uses For Product': 'Salon', 'Special Feature': 'NanoIonic mineral hydrates dry, damaged hair. Smoothes fly-aways and controls frizz. Creates brilliance and shine.NanoIonic mineral hydrates dry, damaged hair. Smoothes fly-aways and controls frizz. Creates brilliance and shine.   See more', 'Auto Shutoff': 'No', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '19.69 x 19.69 x 11.02 inches; 7.76 Ounces', 'Item model number': 'Diffuse-5', 'UPC': '874822004269', 'Manufacturer': 'BIO IONIC'}\nSeveral years ago I had purchased a blowdryer with a similar attachment. I absolutely adored that thing - you could use it on the top of your hair or the sides to give lift so your hair had volume without using any product or doing any backbrushing. The thing was a miracle worker!<br /><br />Then we entered the era of pin straight hair, and volume and body were out. Thank God, we seem to be passing that era, but hairstyling implements seem to be lagging behind. I was dying to try this diffuser to see if it emulated the gizmo from long ago, and it does. Well made hair styling tool that gives lift and volume to your hair, I love it. Well, kinda.<br /><br />I'm not sure how 'universal' this is. I tried it on my current blowdryer, and it didn't fit. I had to go digging around until I finally found a Conair dryer upon which it fit, and the funny thing is that it fit like it was MADE for the dryer. The odd thing is that the Conair looks to have the same kind of nozzle the other blowdryer had, so go figger.<br /><br />IF you have a blowdryer that marries this diffuser well, this is definitely something you're going to want in your hair arsenal. It'd almost be worth getting a new dryer just to use this, it's that good (one star off for the weirdess of the 'universal' claim.)\nIF your blowdryer is a match for this diffuser, you are going to want it for lift and volume. Nothing else compares.",
  "actual_interaction": {
    "rating": 4.0,
    "title": "IF your blowdryer is a match for this diffuser, you are going to want it for lift and volume. Nothing else compares.",
    "text": "Several years ago I had purchased a blowdryer with a similar attachment. I absolutely adored that thing - you could use it on the top of your hair or the sides to give lift so your hair had volume without using any product or doing any backbrushing. The thing was a miracle worker!<br /><br />Then we entered the era of pin straight hair, and volume and body were out. Thank God, we seem to be passing that era, but hairstyling implements seem to be lagging behind. I was dying to try this diffuser to see if it emulated the gizmo from long ago, and it does. Well made hair styling tool that gives lift and volume to your hair, I love it. Well, kinda.<br /><br />I'm not sure how 'universal' this is. I tried it on my current blowdryer, and it didn't fit. I had to go digging around until I finally found a Conair dryer upon which it fit, and the funny thing is that it fit like it was MADE for the dryer. The odd thing is that the Conair looks to have the same kind of nozzle the other blowdryer had, so go figger.<br /><br />IF you have a blowdryer that marries this diffuser well, this is definitely something you're going to want in your hair arsenal. It'd almost be worth getting a new dryer just to use this, it's that good (one star off for the weirdess of the 'universal' claim.)",
    "images": [],
    "asin": "B00PM5QEX0",
    "parent_asin": "B00PM5QEX0",
    "user_id": "AH3KEDBPWJGL24RNC6VTJOJGYXSA",
    "timestamp": "2016-09-02 01:14:39",
    "helpful_vote": 2,
    "verified_purchase": false,
    "main_category": "Premium Beauty",
    "title_meta": "Bio Ionic Universal Diffuser, 1 Count",
    "average_rating": 4.4,
    "rating_number": 906,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41xFgL+a+TL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41xFgL+a+TL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71V0JLpzyVL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41UVQazfOGL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41UVQazfOGL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/810-UKyddcL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31eIAPsAlDL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/31eIAPsAlDL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/712wyUyBoQL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31taDFXp0LL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/31taDFXp0LL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71Uh4RTAUqL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31xab0Nv00L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/31xab0Nv00L.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71mWxgDX9JL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Does the infinitiPro hair dryer really saves time drying?",
        "url": "https://www.amazon.com/vdp/0e37651c36fa4b829b3c6bf39bf83c88?ref=dp_vse_rvc_0",
        "user_id": "/shop/mashavshelef"
      },
      {
        "title": "Our Point of View on The Curly Co Collapsible Hair Diffusers",
        "url": "https://www.amazon.com/vdp/0fd7082835d74e699b434b31d7a7b777?ref=dp_vse_rvc_1",
        "user_id": "/shop/influencer-20a38664"
      },
      {
        "title": "You need to know this before buying. Hair Diffuser   ",
        "url": "https://www.amazon.com/vdp/06bf9d66f05a4d6089753c5cb77b15bc?ref=dp_vse_rvc_2",
        "user_id": "/shop/influencer-87d93b16"
      },
      {
        "title": "Features And Tips With This Light Weight Hairdryer",
        "url": "https://www.amazon.com/vdp/0b7152534ad14e81b59cb7e2d5f72524?ref=dp_vse_rvc_3",
        "user_id": "/shop/kevinsmak27"
      },
      {
        "title": "This drier will blow you away",
        "url": "https://www.amazon.com/vdp/07b7b820830b4e9d8cab39fb088ef654?ref=dp_vse_rvc_4",
        "user_id": "/shop/thedirtycarnivore"
      },
      {
        "title": "INFINITIPRO BY CONAIR 1875 Watt Texture Styling Hair Dryer, Enhance Your Natural Curls and Waves",
        "url": "https://www.amazon.com/vdp/23ad701da0c94a22b32f6259f2b5a8a8?ref=dp_vse_rvc_5",
        "user_id": ""
      },
      {
        "title": "10 out of 10! Love this diffuser!",
        "url": "https://www.amazon.com/vdp/0a39557a0c494e5995e947499cad11ab?ref=dp_vse_rvc_6",
        "user_id": ""
      },
      {
        "title": "This is my new favorite product on amazon. Here's Why   ",
        "url": "https://www.amazon.com/vdp/074798b315c44317b125b0d3966bea28?ref=dp_vse_rvc_7",
        "user_id": "/shop/influencer-87d93b16"
      },
      {
        "title": "HONEST Review - BabylissPRO Titanium Hair Dryer & Diffuser",
        "url": "https://www.amazon.com/vdp/0d5b579d4f714344acbe470387e2c6ce?ref=dp_vse_rvc_8",
        "user_id": "/shop/totaltrend"
      },
      {
        "title": "Drybar Bouncer Diffuser",
        "url": "https://www.amazon.com/vdp/a2f5e2c517e44a298e148db61ca7dd23?ref=dp_vse_rvc_9",
        "user_id": ""
      }
    ],
    "store": null,
    "categories": [],
    "details": {
      "Brand": "BIO IONIC",
      "Color": "Black",
      "Recommended Uses For Product": "Salon",
      "Special Feature": "NanoIonic mineral hydrates dry, damaged hair. Smoothes fly-aways and controls frizz. Creates brilliance and shine.NanoIonic mineral hydrates dry, damaged hair. Smoothes fly-aways and controls frizz. Creates brilliance and shine.   See more",
      "Auto Shutoff": "No",
      "Is Discontinued By Manufacturer": "No",
      "Product Dimensions": "19.69 x 19.69 x 11.02 inches; 7.76 Ounces",
      "Item model number": "Diffuse-5",
      "UPC": "874822004269",
      "Manufacturer": "BIO IONIC"
    },
    "bought_together": null
  }
}