{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Halls Of Anger\nReview Date: 2014/11/06\nCategories: Drama\nProduct Description: ['When an African American ex-basketball player becomes vice principal at an inner city school in his hometown, he comes face to face with the challenging problems of desegregation.']\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['BogartPaul'], 'Producers': ['Herbert Hirschman', 'Walter Mirisch'], 'Starring': ['Calvin Lockhart', 'Janet MacLachlan', 'Jeff Bridges']}\nReview Text: Horrible behavior of American teenagers in the 1970's . The acting by all was fantastic, especially, Jeff Bridges and Rob Reiner.Remembered a bits and pieces of it on late night television in mid-seventies. I was too young to see it  the theaters. Just as well I was living it myself. Not in the US but in Toronto, Ontario, Canada--not as violent but the name calling was prevalent. Being a child that grew up in the 1970's it was just a terrible time as far as race relations.  Nevertheless, the film captured the  savagery and primitive  behavior of the time period of 1970 at the time of the US secondary school busing enactment.<br /><br />Didn't understand the point of why the black girls were ripping  the  white girl's close off? A very eerie scene!!! Probably a reaction to black men would possibly pay more attention to her for various reasons, coupled with black women's insecurity of the alleged notion of the western culture's standard of beauty is caucasian. Regardless the scene did it's job of capturing the viewer's emotions.<br /><br />Dare I say, and it still stands today, when a women who are clearly more attractive than a certain mass of women, the low self-esteem and/or not so attractive women get attention starved and feel angry and scared of being ostracized and, worse case, they believe, they'll die alone.<br /><br />Perhaps this film should be archived in the US National Film Registry.\nReview Title: Just an Ugly time for Black Americans in the early 1970's, and the film captured it.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Mystery Science Theater 3000 - Mitchell\nAshby, John  (Actor),     Baker, Joe Don  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Rare Mystery Science theater 3000 episode where Joel and the bots riff on the awful film \"Mitchell\" starring Joe Don Baker']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 20, 2001', 'Actors': 'Ashby, John, Baker, Joe Don, Balsam, Martin, Barnes, Rayford, Bass, Todd', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Rhino Theatrical', 'Number of discs': '1'}\nIt's obvious  that \"Mitchell\" was a copy of the Shaft movie and short-lived television series: his own man; rebel within law enforcement while sticking it to the man;sex machine (sort of); and willing to take changes regardless of the odds. BUT the cast of MST3000 rip it to shreds.  With the exception of Gypsy (extremely annoying), the cast has some good one liners: \"Mr Treveno has been hit again\" ; \"he just landed just short of the green\"; \"fresh panties all around\"; and  Tom Servo's obsession with Joe Don Baker's eating/farting. One of the best!!!\nYes One of the Best\nRoom 222: Season Two [DVD]\nLloyd Haynes  (Actor),     Denise Nicholas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n[\"A compelling series about life at a multiracial Los Angeles high school, Room 222 left an indelible mark on popular culture by using the half-hour form to explore socially relevant issues (more than a year before Norman Lear's other groundbreaking shows—All in the Family and Maude) and by starting the still-popular trend of high school television series. Created by the now-legendary James L. Brooks (The Mary Tyler Moore Show, Rhoda, The Simpsons), the program was praised for dealing realistically with such subjects as racism, sexism, illiteracy, guns in school and drugs. Pete Dixon (Lloyd Haynes) is a dedicated and popular history teacher who fights the good fight on the side of his students. Joining him in his idealistic approach to education are guidance counselor Liz McIntyre (Denise Nicholas) and student teacher Alice Johnson (Karen Valentine). Experienced and slightly world-weary principal Seymour Kaufman (Michael Constantine) provides a balance to the youthful idealism of the '60s cultural revolution—but at the end of the day, everyone is on the side of the students. Season Two guest stars include Richard Dreyfuss, Kurt Russell, Cindy Williams, Chuck Norris, Tim Matheson and Ed Begley, Jr.\", ']]>']\n{'Genre': 'Drama/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Lloyd Haynes, James L. Brooks, Michael Constantine, Karen Valentine, Denise Nicholas', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '10 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'DSF11387D', 'Media Format': 'Subtitled, NTSC', 'Run time': '10 hours and 30 minutes', 'Release date': 'April 28, 2020', 'Actors': 'Lloyd Haynes, Denise Nicholas, Michael Constantine, Karen Valentine', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nGreat show... a far cry from the predicable cookie cutter scrips of contemporary drama. It's interesting to view the students or rather the actors portraying the students' feelings of anxiety and despair in the society i.e., the assassinations, the riots, conscription  and how their views mirrored the militant/counter culture groups of that time period (e.g., The Black Panthers; The Weather Underground; Brothers of Internal Love, FLQ). And to watch the following actors in the early stages of their careers and how skinny they were was comical:  i.e. , Teri Garr; Glynn Turman- A Different World, The Wire; Rob Riener; Cindy Williams--Lavern and Shirley; Ed Bagley Jr. and Kurt Russell.\nWhat Memories of the Turbulent late 1960's\nMiami Vice: Season 4\nDon Johnson  (Actor),     Philip Michael Thomas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Hit the streets again with Don Johnson as James \"Sonny\" Crockett and Philip Michael Thomas as Ricardo Tubbs, two of the world\\'s slickest undercover cops, in Season Four of Miami Vice! Oscar-nominated director Michael Mann and Primetime Emmy Award-winning producer Dick Wolf bring you all 22 heart-pounding, fashion-forward episodes in this must-own 5-disc set. Joining the iconic detective duo in Miami\\'s steamy underworld is a powerful roster of guest stars, including James Brown, Julia Roberts, and Chris Rock. Miami Vice is an action-packed show whose \"influence is still evident\" (The New York Times).']\n{'Genre': 'Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Edward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael ThomasEdward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael Thomas  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.6 Ounces', 'Item model number': '61021031', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '17 hours and 34 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Don Johnson, Philip Michael Thomas, Edward James Olmos, Sheena Easton, Saundra Santiago', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nWon't be disappointed. However, there are not any behind the scenes interviews if one is to inquire. The quality of the pictures are quite good.\nClassic 1980's television\nBirdman and the Galaxy Trio: The Complete Series (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Birdman and the Galaxy Trio: The Complete Series (DVD)', 'Featuring the episodes in the three-segment form as they originally aired, these popular retro hits take the action around the world and into outer space! First, winged hero Birdman harnesses the power of the sun to fight criminal masterminds like Number One, Vulturo and Dr. Millenium. Then, cosmic crusaders Gravity Girl, Vapor Man and Meteor Man – better known as the Galaxy Trio –serve up justice in space as they travel the universe eradicating evil and procuring peace across the cosmos. And finally, it’s more Birdman with his trusty eagle Avenger and his namesake battle cry that strikes fear into the hearts of his enemies. Fly away with these favorite retro heroes as they deliver old-school justice in this 2-disc collector’s dream compilation.', ']]>']\n{'Genre': 'Animation, Action & Adventure', 'Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Contributor': 'Various', 'Language': 'English (Mono), Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.3 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Run time': '7 hours', 'Release date': 'July 17, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nUsed to watch the reruns in 1971-1972 on late Saturday afternoons on CBC television in Toronto. Had to wonder who i.e., Bill Hanna, Joe Barbera or Keith Andes, voice of Birdman, thought of the distinctive battle cry!!  Too bad the show was politically silent to the current events of time, i.e., 1967. Sadly Mr. Andes completed suicide in 2005 because of extreme ill heath (source: Internet movie data base).\nWhat imagination BillHanna and Joe Barbera had back in the late 19060's\nVietnam: The Ten Thousand Day War\nRichard Basehart  (Actor),     Alexander Haig  (Actor)    Format: DVD\nMovies & TV, Featured Categories, DVD, Military & War\n['Known as history s first \"living room war,\" The Vietnam conflict is presented on 4 DVDs with clarity, authority and insight in this nearly 10-hour documentary. Written by Pulitzer Prize-winning journalist Peter Arnett and narrated by Richard Basehart, our set covers the entire conflict, examining the shifting attitudes of the United States toward Vietnam from 1945, when the battleground was known as French Indochina, to 1975, when Saigon fell to the North Vietnamese.']\n{'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'John Ehrlichman, Alexander Haig, Richard Basehart, Doris Kearns Goodwin, Peter Arnett, William Colby', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '26401918', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '10 hours', 'Release date': 'April 2, 2013', 'Actors': 'Richard Basehart, Alexander Haig, John Ehrlichman, William Colby, Doris Kearns Goodwin', 'Studio': 'Time Life Entertainment / VSC', 'Writers': 'Peter Arnett', 'Number of discs': '1'}\nJust excellent file footage of the various battles and the anti-war protests. Would be a great source for anyone writing a college thesis.\nGreat Series from the 1980's. Great Interviews!!\nThreads [NON-USA FORMAT, PAL, Reg.2&4 Import - Great Britain]\nKaren Meagher  (Actor),     Reece Dinsdale  (Actor),     Mick Jackson  (Director, Producer)    &                   0                  more   Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Documentary-style account of a nuclear attack on Sheffield during the 1980s. Ruth Beckett (Karen Meagher) and Jimmy Kemp (Reece Dinsdale) live in Sheffield and are busy preparing for their upcoming marriage. When Russia invades Iran, hoping to bring the country under its influence, tension is increased throughout the West, and particularly at the local R.A.F. base. Blissfully unconcerned with world events, Ruth and Jimmy carry on with their wedding preparations. However, when two Russian ICBM's hit Sheffield, turning the landscape into a radioactive desert, Ruth and Jimmy are forced to face up to the harsh reality of life in the aftermath of a nuclear explosion.\"]\n{'Genre': 'Documentary', 'Format': 'Import, PAL', 'Contributor': 'June Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham MasseyJune Broughton, Harry Beety, Peter Wolfes, David Brierly, Nicholas Lane, Sylvia Stoker, Barry Hines, Paul Morris, Ashley Barker, Mick Jackson, Karen Meagher, Reece Dinsdale, Rita May, Andrew Dunn, Ruth Holden, Henry Moxon, Jane Hazlegrove, John Purdie, Graham Massey   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.48 x 5.35 x 0.63 inches; 2.82 Ounces', 'Director': 'Mick Jackson', 'Media Format': 'Import, PAL', 'Run time': '1 hour and 53 minutes', 'Actors': 'Karen Meagher, Reece Dinsdale, David Brierly, Rita May, Nicholas Lane', 'Subtitles': 'English', 'Producers': 'Graham Massey, John Purdie, Mick Jackson, Peter Wolfes', 'Studio': 'BBC', 'Writers': 'Barry Hines', 'Number of discs': '1'}\nThis film was released in the fall of 1984 a year later after ABC television's &#34;The Day After&#34;.<br />The producers absolutely did their homework: various levels of radiation; psychological behavior; martial law.The blips of the scientific, psychological,and biological information during the film personified the conditions the actors (outstanding job) were portraying. I wish the dvd had interviews of the cast. Note: the dvd format is non-US thus the dvd prompts you how many times you can watch it on their format.\nbest nuclear war movie during the cold war 1980s\nThe Weather Underground\nLili Taylor  (Actor),     Pamela Z  (Actor),     Sam Green  (Director),     Bill Siegel  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n['Product Description', 'Hello. I m going to read a declaration of a state of war...Within the next 14 days we will attack a symbol or institution of American injustice --Bernardine Dohrn', 'Thirty years ago, with these words, a group of young American radicals called The Weathermen announced their intention to overthrow the U.S. government. Fueled by outrage over the Vietnam War and racism in America, they went undergound during the 1970s, bombing targets across the country that they felt symbolized the real violence that the U.S. government and capitalist power were wreaking throughout the world. From pitched battles with police on Chicago s city streets, to bombing the U.S. Capitol building, to breaking acid-guru Timothy Leary out of prison, this carefully organized clandestine network attempted to incite a national revolution, while successfully evading one of the largest FBI manhunts in history.', 'One of the top documentaries of the year, this award-winning film interweaves extensive archival material with modern-day interviews to explore the incredible story of The Weather Underground. As former members reflect candidly about the idealistic passion that drove them to bring the war home, they paint a compelling portrait of troubled and revolutionary times, with unexpected and often striking connections to the current world situation.', 'Special Features:', 'Commentary From Former Weathermen Bernardine Dohrn and Bill Ayers; Filmmaker Commentary; Original Weathermen Audio Communiques; Bonus Film on Former Weatherman David Gilbert: A Lifetime of Struggle; Excerpt from Emile de Antonio film Underground; Filmmaker Biographies; Filmmaker Statement; Spanish Subtitles; Interactive Menus; Scene Selection', 'Amazon.com', \"The key players in the radical movement known as the Weather Underground are skillfully brought to life in this Oscar-nominated documentary. The Weathermen were born of sixties protest, but took their scheme to overthrow the U.S. government to especially violent extremes. Never a well-populated movement, the Underground petered out as its leaders aged during the seventies; by decade's end, weary of hiding, most of them had turned themselves over to the authorities. That journey, by which a fire-breathing revolutionary such as Bernadine Dohrn became a (still fiery) gray-haired wife and mother, is an intriguing one. This film, rich in period footage (and some unnecessary sensationalism) captures the era somewhat broadly. But the present-day interviews with the participants, contrasted with their radical selves, provides an exceptionally detailed look inside the organization itself. It's not a nostalgic look back, and the overall mood is sobering rather than celebratory. Lili Taylor provides the narration.\", '--Robert Horton', 'Review', '. . . Gripping . . . the filmmakers raise some disturbing and highly relevant questions into the psychopathology of terrorism. --The New York Times. . . a fascinating window into American political history --The Washington PostAn important historical document thats also riveting entertainment. --Time Out New York', 'See more']\n{'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Contributor': 'Sam Green, Pamela Z, Lili Taylor, Jim Lange, Bill Siegel', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 3.2 Ounces', 'Director': 'Sam Green, Bill Siegel', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Full Screen', 'Run time': '1 hour and 32 minutes', 'Release date': 'May 25, 2004', 'Actors': 'Lili Taylor, Pamela Z, Jim Lange', 'Subtitles': 'Spanish', 'Studio': 'Docurama', 'Number of discs': '1'}\nVery surprised no one had ever done documentary on this group until now. The film does not at all glorify them, the directors simply told a story of why these American college students simply wanted to stop the senseless armed conflict in Vietnam and their stance against oppression and racism in America. While I don't agree with their politics i.e., communism, and their unrealistic premise of the majority of Americans would violently revolt against the American government, their commitment ( by death if necessary) to the cause for social change, as told by the director, is very engaging!! I absolutely can't get enough of Weatherman Niomi Jaffee's quote early in the film: &#34; if you sit in your little white house and go to your little  white job and allow the country you live in to murder people, and you sit there and don't do anything about it that's violence&#34;...if one is not part of the solution they're part of the problem. In the director's commentary, the director said when he interviewed the group said that they didn't want to be &#34;good Germans&#34; (in relation to Jaffe's quote)---wow!!<br /><br />I was only five years old when the group went underground, officially,in 1970 after the townhouse explosion (I had my own problems with racism) but I had heard of the name around 1975 and in 1980 when most of charges (the many bombings the group committed)were dropped because of arrogant, stupid, and corrupt tactics of the FBI.<br /><br />Too bad these directors, although nominated, didn't win the academy award for best documentary film---and these directors were not born during that time!! Any unearthed story from the turbulent 1960s that would educate today's young adults in order to further civilize and clean up bad behavior is alright by me.  Great job fellas!!\nA story long over due. Great Job!!!!\nHalls Of Anger\nDrama\n['When an African American ex-basketball player becomes vice principal at an inner city school in his hometown, he comes face to face with the challenging problems of desegregation.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['BogartPaul'], 'Producers': ['Herbert Hirschman', 'Walter Mirisch'], 'Starring': ['Calvin Lockhart', 'Janet MacLachlan', 'Jeff Bridges']}\nHorrible behavior of American teenagers in the 1970's . The acting by all was fantastic, especially, Jeff Bridges and Rob Reiner.Remembered a bits and pieces of it on late night television in mid-seventies. I was too young to see it  the theaters. Just as well I was living it myself. Not in the US but in Toronto, Ontario, Canada--not as violent but the name calling was prevalent. Being a child that grew up in the 1970's it was just a terrible time as far as race relations.  Nevertheless, the film captured the  savagery and primitive  behavior of the time period of 1970 at the time of the US secondary school busing enactment.<br /><br />Didn't understand the point of why the black girls were ripping  the  white girl's close off? A very eerie scene!!! Probably a reaction to black men would possibly pay more attention to her for various reasons, coupled with black women's insecurity of the alleged notion of the western culture's standard of beauty is caucasian. Regardless the scene did it's job of capturing the viewer's emotions.<br /><br />Dare I say, and it still stands today, when a women who are clearly more attractive than a certain mass of women, the low self-esteem and/or not so attractive women get attention starved and feel angry and scared of being ostracized and, worse case, they believe, they'll die alone.<br /><br />Perhaps this film should be archived in the US National Film Registry.\nJust an Ugly time for Black Americans in the early 1970's, and the film captured it.",
  "profile": "**User Preferences Summary:**\n\nThe user has a strong passion for comedy within science fiction and fantasy, as well as a deep appreciation for classic dramas that explore socially relevant issues. Their recent engagement with historical documentaries continues to reflect an interest in narratives providing insightful commentary on significant societal events. This evolving focus is further emphasized by their latest purchase, showcasing a commitment to understanding the complexities of historical periods through films addressing the challenges of race relations and desegregation in the 1970s.\n\nThe user values sharp dialogue and character dynamics, preferring narratives that incorporate irony and parody, while also maintaining a keen interest in dramas that delve into social themes. They exhibit a preference for emotionally impactful stories that highlight the human experience, particularly those with multifaceted perspectives on societal actions.\n\nA strong affinity for physical media, especially DVDs, persists as part of their content collection aligned with their interests in both comedy and profound storytelling. Their active participation in film discussions and reviews illustrates their dedication to exploring thought-provoking and nostalgia-inducing content. Overall, the user exemplifies a thoughtful consumer who values narratives intertwining humor, historical significance, and educational exploration, continually seeking to enhance their understanding of complex social issues through a variety of genres and formats.",
  "metrics": {
    "rouge1_f": 0.07237422771403354,
    "rouge2_f": 0.008242566970856638,
    "rougeL_f": 0.03765813474551338,
    "meteor": 0.02022092741068488,
    "bleu1": 1.1073004235200908e-08,
    "bleu2": 4.323335289592228e-09,
    "bleu3": 1.550571538012605e-09,
    "bleu4": 7.817067145460347e-10,
    "bertscore_precision": 0.3242785930633545,
    "bertscore_recall": 0.4924478232860565,
    "bertscore_f1": 0.3910496234893799
  }
}