{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Miami Vice: Season 4\nReview Date: 2013/06/16\nStore: Don Johnson  (Actor),     Philip Michael Thomas  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Hit the streets again with Don Johnson as James \"Sonny\" Crockett and Philip Michael Thomas as Ricardo Tubbs, two of the world\\'s slickest undercover cops, in Season Four of Miami Vice! Oscar-nominated director Michael Mann and Primetime Emmy Award-winning producer Dick Wolf bring you all 22 heart-pounding, fashion-forward episodes in this must-own 5-disc set. Joining the iconic detective duo in Miami\\'s steamy underworld is a powerful roster of guest stars, including James Brown, Julia Roberts, and Chris Rock. Miami Vice is an action-packed show whose \"influence is still evident\" (The New York Times).']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Edward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael ThomasEdward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael Thomas  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.6 Ounces', 'Item model number': '61021031', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '17 hours and 34 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Don Johnson, Philip Michael Thomas, Edward James Olmos, Sheena Easton, Saundra Santiago', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Won't be disappointed. However, there are not any behind the scenes interviews if one is to inquire. The quality of the pictures are quite good.\nReview Title: Classic 1980's television\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mystery Science Theater 3000 - Mitchell\nAshby, John  (Actor),     Baker, Joe Don  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Rare Mystery Science theater 3000 episode where Joel and the bots riff on the awful film \"Mitchell\" starring Joe Don Baker']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 20, 2001', 'Actors': 'Ashby, John, Baker, Joe Don, Balsam, Martin, Barnes, Rayford, Bass, Todd', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Rhino Theatrical', 'Number of discs': '1'}\nIt's obvious  that \"Mitchell\" was a copy of the Shaft movie and short-lived television series: his own man; rebel within law enforcement while sticking it to the man;sex machine (sort of); and willing to take changes regardless of the odds. BUT the cast of MST3000 rip it to shreds.  With the exception of Gypsy (extremely annoying), the cast has some good one liners: \"Mr Treveno has been hit again\" ; \"he just landed just short of the green\"; \"fresh panties all around\"; and  Tom Servo's obsession with Joe Don Baker's eating/farting. One of the best!!!\nYes One of the Best\nRoom 222: Season Two [DVD]\nLloyd Haynes  (Actor),     Denise Nicholas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n[\"A compelling series about life at a multiracial Los Angeles high school, Room 222 left an indelible mark on popular culture by using the half-hour form to explore socially relevant issues (more than a year before Norman Lear's other groundbreaking shows—All in the Family and Maude) and by starting the still-popular trend of high school television series. Created by the now-legendary James L. Brooks (The Mary Tyler Moore Show, Rhoda, The Simpsons), the program was praised for dealing realistically with such subjects as racism, sexism, illiteracy, guns in school and drugs. Pete Dixon (Lloyd Haynes) is a dedicated and popular history teacher who fights the good fight on the side of his students. Joining him in his idealistic approach to education are guidance counselor Liz McIntyre (Denise Nicholas) and student teacher Alice Johnson (Karen Valentine). Experienced and slightly world-weary principal Seymour Kaufman (Michael Constantine) provides a balance to the youthful idealism of the '60s cultural revolution—but at the end of the day, everyone is on the side of the students. Season Two guest stars include Richard Dreyfuss, Kurt Russell, Cindy Williams, Chuck Norris, Tim Matheson and Ed Begley, Jr.\", ']]>']\n{'Genre': 'Drama/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Lloyd Haynes, James L. Brooks, Michael Constantine, Karen Valentine, Denise Nicholas', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '10 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'DSF11387D', 'Media Format': 'Subtitled, NTSC', 'Run time': '10 hours and 30 minutes', 'Release date': 'April 28, 2020', 'Actors': 'Lloyd Haynes, Denise Nicholas, Michael Constantine, Karen Valentine', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nGreat show... a far cry from the predicable cookie cutter scrips of contemporary drama. It's interesting to view the students or rather the actors portraying the students' feelings of anxiety and despair in the society i.e., the assassinations, the riots, conscription  and how their views mirrored the militant/counter culture groups of that time period (e.g., The Black Panthers; The Weather Underground; Brothers of Internal Love, FLQ). And to watch the following actors in the early stages of their careers and how skinny they were was comical:  i.e. , Teri Garr; Glynn Turman- A Different World, The Wire; Rob Riener; Cindy Williams--Lavern and Shirley; Ed Bagley Jr. and Kurt Russell.\nWhat Memories of the Turbulent late 1960's\nMiami Vice: Season 4\nDon Johnson  (Actor),     Philip Michael Thomas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Hit the streets again with Don Johnson as James \"Sonny\" Crockett and Philip Michael Thomas as Ricardo Tubbs, two of the world\\'s slickest undercover cops, in Season Four of Miami Vice! Oscar-nominated director Michael Mann and Primetime Emmy Award-winning producer Dick Wolf bring you all 22 heart-pounding, fashion-forward episodes in this must-own 5-disc set. Joining the iconic detective duo in Miami\\'s steamy underworld is a powerful roster of guest stars, including James Brown, Julia Roberts, and Chris Rock. Miami Vice is an action-packed show whose \"influence is still evident\" (The New York Times).']\n{'Genre': 'Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Edward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael ThomasEdward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael Thomas  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.6 Ounces', 'Item model number': '61021031', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '17 hours and 34 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Don Johnson, Philip Michael Thomas, Edward James Olmos, Sheena Easton, Saundra Santiago', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nWon't be disappointed. However, there are not any behind the scenes interviews if one is to inquire. The quality of the pictures are quite good.\nClassic 1980's television",
  "profile": "**User Preferences Summary:**\n\n- **Genres:** The user continues to favor comedy within science fiction and fantasy, while also appreciating classic dramas, particularly those that explore socially relevant issues through a nostalgic lens.\n- **Entertainment Style:** They enjoy humor that is rooted in satire and social commentary, particularly in narratives that break away from predictable scripts, emphasizing engaging character dynamics and historical contexts.\n- **Content Appreciation:** The user values sharp, witty dialogue and insightful character interactions, indicating a strong preference for narratives that adeptly blend humor with serious themes.\n- **Media Format:** A clear preference for physical media, especially DVDs, points to their passion for collecting tangible formats that permit an exploration of both comedic and classic television.\n- **Community Engagement:** They actively participate in discussions and reviews about films and television, desiring connections over nostalgic and impactful storytelling experiences.\n- **Specific Interests:** There is a marked interest in cult classic films and series that feature ironic or parody-driven content, alongside a continued attraction to groundbreaking series addressing timely societal issues. Recently, their engagement with notable 1980s television demonstrates an enduring appreciation for classic formats and storytelling.\n\nOverall, this user exemplifies a committed fan of comedic narratives, cherishing classic media formats while relishing thought-provoking content that resonates with both historical significance and meaningful social commentary.",
  "metrics": {
    "rouge1_f": 0.13166666666666665,
    "rouge2_f": 0.011686143572621035,
    "rougeL_f": 0.06333333333333332,
    "meteor": 0.047838025122209124,
    "bleu1": 0.005399749425181696,
    "bleu2": 0.0012968947280835865,
    "bleu3": 0.000594713216289062,
    "bleu4": 0.00033896698986500583,
    "bertscore_precision": 0.34592434763908386,
    "bertscore_recall": 0.46429499983787537,
    "bertscore_f1": 0.3964628577232361
  }
}