{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Vietnam: The Ten Thousand Day War\nReview Date: 2013/08/05\nStore: Richard Basehart  (Actor),     Alexander Haig  (Actor)    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Military & War\nProduct Description: ['Known as history s first \"living room war,\" The Vietnam conflict is presented on 4 DVDs with clarity, authority and insight in this nearly 10-hour documentary. Written by Pulitzer Prize-winning journalist Peter Arnett and narrated by Richard Basehart, our set covers the entire conflict, examining the shifting attitudes of the United States toward Vietnam from 1945, when the battleground was known as French Indochina, to 1975, when Saigon fell to the North Vietnamese.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'John Ehrlichman, Alexander Haig, Richard Basehart, Doris Kearns Goodwin, Peter Arnett, William Colby', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '26401918', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '10 hours', 'Release date': 'April 2, 2013', 'Actors': 'Richard Basehart, Alexander Haig, John Ehrlichman, William Colby, Doris Kearns Goodwin', 'Studio': 'Time Life Entertainment / VSC', 'Writers': 'Peter Arnett', 'Number of discs': '1'}\nReview Text: Just excellent file footage of the various battles and the anti-war protests. Would be a great source for anyone writing a college thesis.\nReview Title: Great Series from the 1980's. Great Interviews!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mystery Science Theater 3000 - Mitchell\nAshby, John  (Actor),     Baker, Joe Don  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Comedy\n['Rare Mystery Science theater 3000 episode where Joel and the bots riff on the awful film \"Mitchell\" starring Joe Don Baker']\n{'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8 x 5.5 x 0.5 inches; 4 Ounces', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 20, 2001', 'Actors': 'Ashby, John, Baker, Joe Don, Balsam, Martin, Barnes, Rayford, Bass, Todd', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Rhino Theatrical', 'Number of discs': '1'}\nIt's obvious  that \"Mitchell\" was a copy of the Shaft movie and short-lived television series: his own man; rebel within law enforcement while sticking it to the man;sex machine (sort of); and willing to take changes regardless of the odds. BUT the cast of MST3000 rip it to shreds.  With the exception of Gypsy (extremely annoying), the cast has some good one liners: \"Mr Treveno has been hit again\" ; \"he just landed just short of the green\"; \"fresh panties all around\"; and  Tom Servo's obsession with Joe Don Baker's eating/farting. One of the best!!!\nYes One of the Best\nRoom 222: Season Two [DVD]\nLloyd Haynes  (Actor),     Denise Nicholas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n[\"A compelling series about life at a multiracial Los Angeles high school, Room 222 left an indelible mark on popular culture by using the half-hour form to explore socially relevant issues (more than a year before Norman Lear's other groundbreaking shows—All in the Family and Maude) and by starting the still-popular trend of high school television series. Created by the now-legendary James L. Brooks (The Mary Tyler Moore Show, Rhoda, The Simpsons), the program was praised for dealing realistically with such subjects as racism, sexism, illiteracy, guns in school and drugs. Pete Dixon (Lloyd Haynes) is a dedicated and popular history teacher who fights the good fight on the side of his students. Joining him in his idealistic approach to education are guidance counselor Liz McIntyre (Denise Nicholas) and student teacher Alice Johnson (Karen Valentine). Experienced and slightly world-weary principal Seymour Kaufman (Michael Constantine) provides a balance to the youthful idealism of the '60s cultural revolution—but at the end of the day, everyone is on the side of the students. Season Two guest stars include Richard Dreyfuss, Kurt Russell, Cindy Williams, Chuck Norris, Tim Matheson and Ed Begley, Jr.\", ']]>']\n{'Genre': 'Drama/Television, Television', 'Format': 'Subtitled, NTSC', 'Contributor': 'Lloyd Haynes, James L. Brooks, Michael Constantine, Karen Valentine, Denise Nicholas', 'Language': 'English (Dolby Digital 2.0)', 'Runtime': '10 hours and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'DSF11387D', 'Media Format': 'Subtitled, NTSC', 'Run time': '10 hours and 30 minutes', 'Release date': 'April 28, 2020', 'Actors': 'Lloyd Haynes, Denise Nicholas, Michael Constantine, Karen Valentine', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nGreat show... a far cry from the predicable cookie cutter scrips of contemporary drama. It's interesting to view the students or rather the actors portraying the students' feelings of anxiety and despair in the society i.e., the assassinations, the riots, conscription  and how their views mirrored the militant/counter culture groups of that time period (e.g., The Black Panthers; The Weather Underground; Brothers of Internal Love, FLQ). And to watch the following actors in the early stages of their careers and how skinny they were was comical:  i.e. , Teri Garr; Glynn Turman- A Different World, The Wire; Rob Riener; Cindy Williams--Lavern and Shirley; Ed Bagley Jr. and Kurt Russell.\nWhat Memories of the Turbulent late 1960's\nMiami Vice: Season 4\nDon Johnson  (Actor),     Philip Michael Thomas  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Hit the streets again with Don Johnson as James \"Sonny\" Crockett and Philip Michael Thomas as Ricardo Tubbs, two of the world\\'s slickest undercover cops, in Season Four of Miami Vice! Oscar-nominated director Michael Mann and Primetime Emmy Award-winning producer Dick Wolf bring you all 22 heart-pounding, fashion-forward episodes in this must-own 5-disc set. Joining the iconic detective duo in Miami\\'s steamy underworld is a powerful roster of guest stars, including James Brown, Julia Roberts, and Chris Rock. Miami Vice is an action-packed show whose \"influence is still evident\" (The New York Times).']\n{'Genre': 'Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4Drama, Television, DVD Movie, Miami Vice: The Complete Fourth Season, Blu-ray Movie, Miami Vice: The Complete 4th Season, Action & Adventure, Miami Vice: Season 4  See more', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Edward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael ThomasEdward James Olmos, Sheena Easton, Don Johnson, Saundra Santiago, Michael Talbott, Olivia Brown, Philip Michael Thomas  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 9.6 Ounces', 'Item model number': '61021031', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '17 hours and 34 minutes', 'Release date': 'March 20, 2007', 'Actors': 'Don Johnson, Philip Michael Thomas, Edward James Olmos, Sheena Easton, Saundra Santiago', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nWon't be disappointed. However, there are not any behind the scenes interviews if one is to inquire. The quality of the pictures are quite good.\nClassic 1980's television\nBirdman and the Galaxy Trio: The Complete Series (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Birdman and the Galaxy Trio: The Complete Series (DVD)', 'Featuring the episodes in the three-segment form as they originally aired, these popular retro hits take the action around the world and into outer space! First, winged hero Birdman harnesses the power of the sun to fight criminal masterminds like Number One, Vulturo and Dr. Millenium. Then, cosmic crusaders Gravity Girl, Vapor Man and Meteor Man – better known as the Galaxy Trio –serve up justice in space as they travel the universe eradicating evil and procuring peace across the cosmos. And finally, it’s more Birdman with his trusty eagle Avenger and his namesake battle cry that strikes fear into the hearts of his enemies. Fly away with these favorite retro heroes as they deliver old-school justice in this 2-disc collector’s dream compilation.', ']]>']\n{'Genre': 'Animation, Action & Adventure', 'Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Contributor': 'Various', 'Language': 'English (Mono), Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.3 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'NTSC, Multiple Formats, Subtitled, Closed-captioned, Animated, Color', 'Run time': '7 hours', 'Release date': 'July 17, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nUsed to watch the reruns in 1971-1972 on late Saturday afternoons on CBC television in Toronto. Had to wonder who i.e., Bill Hanna, Joe Barbera or Keith Andes, voice of Birdman, thought of the distinctive battle cry!!  Too bad the show was politically silent to the current events of time, i.e., 1967. Sadly Mr. Andes completed suicide in 2005 because of extreme ill heath (source: Internet movie data base).\nWhat imagination BillHanna and Joe Barbera had back in the late 19060's\nVietnam: The Ten Thousand Day War\nRichard Basehart  (Actor),     Alexander Haig  (Actor)    Format: DVD\nMovies & TV, Featured Categories, DVD, Military & War\n['Known as history s first \"living room war,\" The Vietnam conflict is presented on 4 DVDs with clarity, authority and insight in this nearly 10-hour documentary. Written by Pulitzer Prize-winning journalist Peter Arnett and narrated by Richard Basehart, our set covers the entire conflict, examining the shifting attitudes of the United States toward Vietnam from 1945, when the battleground was known as French Indochina, to 1975, when Saigon fell to the North Vietnamese.']\n{'Genre': 'Military & War', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'John Ehrlichman, Alexander Haig, Richard Basehart, Doris Kearns Goodwin, Peter Arnett, William Colby', 'Language': 'English', 'Number Of Discs': '1', 'Product Dimensions': '7.75 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '26401918', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '10 hours', 'Release date': 'April 2, 2013', 'Actors': 'Richard Basehart, Alexander Haig, John Ehrlichman, William Colby, Doris Kearns Goodwin', 'Studio': 'Time Life Entertainment / VSC', 'Writers': 'Peter Arnett', 'Number of discs': '1'}\nJust excellent file footage of the various battles and the anti-war protests. Would be a great source for anyone writing a college thesis.\nGreat Series from the 1980's. Great Interviews!!",
  "profile": "**User Preferences Summary:**\n\nThe user maintains a strong preference for comedy within science fiction and fantasy, alongside classic dramas that tackle socially relevant issues through a nostalgic lens. Their recent interest in historical documentaries indicates a willingness to engage with serious themes and significant historical narratives. They enjoy humor that integrates satire and social commentary, particularly narratives that break from predictable scripts, highlighted by engaging character dynamics and historical references.\n\nA focus on sharp, witty dialogue and insightful character interactions continues to define their tastes, alongside a newfound appreciation for comprehensive documentaries that explore societal impacts, reflecting an inclination towards educational content. The user clearly prefers physical media, especially DVDs, showcasing a passion for collecting formats that quench their thirst for both comedic and classic storytelling.\n\nThey are actively involved in discussions and reviews related to films and television, seeking meaningful connections over nostalgic and impactful storytelling experiences. The consistent interest in cult classic films and series characterized by irony or parody remains alongside a sustained attraction to groundbreaking series addressing timely societal issues. Recent engagement with historical content further emphasizes their appreciation for classic formats and profound storytelling, merging entertainment with insightful discourse on societal matters. Overall, the user exemplifies a committed fan of comedic narratives, vintage media, and thought-provoking content that resonates with historical significance and social commentary.",
  "metrics": {
    "rouge1_f": 0.09447922595332954,
    "rouge2_f": 0.004558404558404559,
    "rougeL_f": 0.05008537279453614,
    "meteor": 0.030285666492038642,
    "bleu1": 0.00015202988624489713,
    "bleu2": 3.69475319139496e-05,
    "bleu3": 1.3502181031651469e-05,
    "bleu4": 4.594700819017442e-06,
    "bertscore_precision": 0.33076050877571106,
    "bertscore_recall": 0.4652639925479889,
    "bertscore_f1": 0.3866487741470337
  }
}