{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: HOME ALONE 2: LOST IN NEW YORK\nReview Date: 2013/01/25\nStore: Macaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\nProduct Description: ['Macaulay Culkin, Joe Pesci, Daniel Stern. The bad guys get it, and the little kid gives it to them-only this time in the colorful setting of New York City. 1992/color/102 min/PG/widescreen.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': \"Maureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie Bracken, Gerry Bamman, Chris ColumbusMaureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie B…  See more\", 'Language': 'Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.3 x 7.53 inches; 2.4 Ounces', 'Item model number': 'FOXS2289224DVD', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Devin Ratray', 'Studio': 'TWENTIETH CENTURY FOX', 'Number of discs': '1'}\nReview Text: The real reason why I wanted this film has everything to do with the ending. I know that seems weird but as a native New Yorker, I just love the scenes between a mom and her son in front of the most spectacular Christmas Tree in the world.  So, there it is.<br /><br />The movie isn't particularly bad or good.  Pretty much the same formula as the first movie with just a few more predictable changes.  But I don't mind sitting through it and going along for the ride.  I could do far worse.\nReview Title: Guilty Pleasure - okay movie\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "G.\nRichard Jones  (Actor),     Blair Underwood  (Actor),     Christopher Scott Cherot  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Richard T. Jones (Guess Who, TV\\'s \"The Wire\"), Blair Underwood (Madea\\'s Family Reunion, TV\\'s \"Fatherhood\"), Chenoa Maxwell (Doing Hard Time, Hav Plenty), Andre Royo (Shaft, TV\\'s \"The Wire\"), Andrew Lauren (Conspiracy Theory), Laz Alonzo (Jarhead, The Tenants) star in G, a tragedy-filled story of a young Great Gatsby-ish Hip-Hopper named Summer G who falls for a middle- to upper-class sistah while in college. After she rejects him for a fellow social climber, Summer G spends ten years building a Hip-Hop empire, and then moves to the Hamptons where he finds the object of his affections. Cinematic urban tastemaker movie which highlights an African-American aristocratic lifestyle.', 'Amazon.com', 'G.', 'is an engrossing update of', 'The Great Gatsby', \", set in the Hamptons and starring Richard T. Jones as Summer G., a self-made, millionaire head of a hip-hop label. Having risen from obscurity to make his fortune, Summer pines for just one thing: Sky (Chenoa Maxwell), the woman who dumped him back in college to marry the brutal, philandering Chip (Blair Underwood). Sky's feckless cousin, Tre (Andre Royer), a pop journalist, sets her up in an assignation with Summer, leading to predictable conflicts but with unexpected consequences. Co-written and directed by Christopher Scott Cherot,\", 'G.', 'is also an interesting portrait of American wealth, particularly the collision of old and new money in the form of a biracial aristocracy coming to terms with a hip-hop elite. Strong performances alone are enough to recommend this feature.', '--Tom Keogh']\n{'Genre': 'Drama', 'Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Contributor': 'Judd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard JonesJudd Landon, Andrew Lauren Productions; G Productions, Chenoa Maxwell, Christopher Scott Cherot, Andrew Lauren, Blair Underwood, Richard Jones   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 4.75 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396143951', 'Director': 'Christopher Scott Cherot', 'Media Format': 'Color, NTSC, Subtitled, Dolby, Multiple Formats, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'March 28, 2006', 'Actors': 'Richard Jones, Blair Underwood, Chenoa Maxwell', 'Subtitles': 'English, French', 'Producers': 'Andrew Lauren, Judd Landon', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis is a movie to watch when you want to see a bunch of beautiful actors, in an even more beautiful setting, entertaining the audience with a very engaging love story. It is sexy, it is hip, and it is addicting.<br /><br />My only and biggest complaint is that there is no place to find the music soundtrack.  In fact, it is the main reason why I bought this DVD.  Haunting and gorgous, I just wish it was available somewhere.\nGuilty Pleasure\nSpirited Away\nHayao Miyazaki  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Product Description', 'From one of the most celebrated filmmakers in the history of animated cinema comes the most acclaimed film of 2002. Hayao Miyazaki\\'s latest triumph, filled with astonishing animation and epic adventure, is a dazzling masterpiece for the ages. It\\'s a \"wonderfully welcoming work of art that\\'s as funny and entertaining as it is brilliant, beautiful, and deep\" (Joe Morgenstern, Wall Street Journal). SPIRITED AWAY is a wondrous fantasy about a young girl, Chihiro, trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free herself and return her family to the outside world. An unforgettable story brimming with creativity, SPIRITED AWAY will take you on a journey beyond your imagination. \"To enter the world of Hayao Miyazaki is to experience a kind of lighthearted enchantment that is unique to the world of animation\" (Roger Ebert, Chicago Sun-Times). It\\'s a fantastic tale the whole family will want to experience over and over again.~~(c) 2001 Nibariki -- GNDDTM', 'Set Contains:', 'The most interesting extra feature on the two-disc set is the Nippon Television Special on the making of', 'Spirited Away', ', not because it\\'s significantly different from American making-of programs, but because the camera crew was allowed to film Miyazaki at work. It\\'s fascinating to watch the visionary director explaining how individual movements should be animated, and even performing the little dance the frog-master does to welcome the No-Face to Yubaba\\'s bath house. (Old animators describe Walt Disney giving similar performances, but no comparable footage exists.) It\\'s also striking to see how intimate Studio Ghibli is, unencumbered by the tiers of management that burden American studios. The scene comparisons enable the viewer to study the storyboards for the film, which Miyazaki draws himself. These simple yet wonderfully vivid images capture the essence of a mood, a movement, an expression. \"Behind the Microphone\" offers a fairly standard behind-the-scenes look at the creation of the excellent English version of', 'Spirited Away', '.', '--Charles Solomon']\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Hayao Miyazaki', 'Language': 'French (Dolby Digital 2.0 Surround), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.3 x 7.52 inches; 4.32 Ounces', 'Item model number': 'UPC# 7869 3621 3843', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 15, 2003', 'Studio': 'Walt Disney Home Entertainment Presents A Studio Ghibli Film', 'Number of discs': '1'}\nTo try and describe this movie is kind of crazy.  I mean there's this little girl in a world inhabited by strange and curious spirits who must rescue her parents from a frightening and terrible fate. But the journey is so much more than a simple description.<br /><br />The animation is just gorgeous, the story is captivating and unique, and the musical score is so haunting and beautiful, you will find yourself remembering the themes long after the movie is over. Please give it a chance and allow yourself to be swept away by this special little film.\nA beautiful, thoughtful experience\nCode Name: Dancer [DVD]\nKate Capshaw  (Actor),     Jeroen Krabb  (Actor),     Buzz Kulik  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n{'Format': 'Color, DVD, Full Screen, NTSC', 'Contributor': 'Tracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robin Hudis, Andaluz Russell, Francisco Cuevas, Hilary Perez, Guillermo Ros, Valerie Mahaffey, Gregory SierraTracey Williams, Al Sapienza, Kate Capshaw, Cliff De Young, Corinne Bohrer, Helen Siff, Buzz Kulik, Jorge Martnez de Hoyos, Garette Ratliff Henson, Krzyztof Waliszewski, Kimberly Kulik, Honorato Magaloni, Jeroen Krabb, James Sloyan, Kurt Braunreiter, Jill Wagner-Porter, Robi…  See more', 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.16 Ounces', 'Director': 'Buzz Kulik', 'Media Format': 'Color, DVD, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'May 4, 2004', 'Actors': 'Kate Capshaw, Jeroen Krabb, Gregory Sierra, Valerie Mahaffey, James Sloyan', 'Studio': 'Trinity Home Ent', 'Number of discs': '1'}\nI, like others have written, only saw this movie once many years back - but it stuck with me. It's never been re- broadcast that I could tell and I just figured for the price why not buy it.<br /><br />There was nothing on tv worth watching so we popped the film in and had a really enjoyable time watching it. In fact it is eons better than some of the garbage currently on.<br /><br />Great love story, top notch actors and a pretty decent story. For a couple of hours I escaped into a very pleasant movie.<br /><br />If anyone out there has any influence, please get some network to give this film some air time. If even if its just on the Lifetime channel.  I'm certain the viewers would love it.\nFun movie - even if a tad bit dated\nHOME ALONE 2: LOST IN NEW YORK\nMacaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Kids & Family, Family Features\n['Macaulay Culkin, Joe Pesci, Daniel Stern. The bad guys get it, and the little kid gives it to them-only this time in the colorful setting of New York City. 1992/color/102 min/PG/widescreen.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': \"Maureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie Bracken, Gerry Bamman, Chris ColumbusMaureen Elisabeth Shay, Kieran Culkin, Anna Slotky, Tim Curry, Dana Ivey, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Brenda Fricker, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Hillary Wolf, Daiana Campeanu, Eddie B…  See more\", 'Language': 'Unqualified', 'Runtime': '2 hours', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.56 x 5.3 x 7.53 inches; 2.4 Ounces', 'Item model number': 'FOXS2289224DVD', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Devin Ratray', 'Studio': 'TWENTIETH CENTURY FOX', 'Number of discs': '1'}\nThe real reason why I wanted this film has everything to do with the ending. I know that seems weird but as a native New Yorker, I just love the scenes between a mom and her son in front of the most spectacular Christmas Tree in the world.  So, there it is.<br /><br />The movie isn't particularly bad or good.  Pretty much the same formula as the first movie with just a few more predictable changes.  But I don't mind sitting through it and going along for the ride.  I could do far worse.\nGuilty Pleasure - okay movie",
  "profile": "**Updated User Profile Summary**\n\n- **Media Type Preference**: The user continues to show a strong preference for movies, particularly drama and romance, while increasingly enjoying animated films that feature fantasy and deep emotional storytelling.\n\n- **Cinematic Interests**: They appreciate urban themes and cultural narratives that highlight African-American experiences and embrace diverse storytelling, including lighthearted family films.\n\n- **Emotional Engagement**: Strongly values films that evoke emotional responses, frequently identifying them as 'guilty pleasures.' Their nostalgic connection to specific scenes, particularly those emphasizing heartfelt family moments, showcases their appreciation for emotionally resonant storytelling.\n\n- **Aesthetic Appreciation**: The user consistently expresses interest in visual and auditory elements, praising stunning animation and engaging performances across both live-action and animated formats.\n\n- **Soundtrack Importance**: Recognizes the significance of music, feeling that soundtracks greatly enhance the movie-watching experience, especially in stories with emotional depth.\n\n- **Rating Behavior**: They have a tendency to rate films highly, reflecting their focus on quality, enjoyment, and emotional impact. They approach films with an open mind, willing to appreciate the experience regardless of predictability or formulaic elements.\n\nIn summary, this user enjoys aesthetically-driven and emotionally rich storytelling across diverse genres, with an evolving taste that embraces both nostalgic favorites and new cinematic adventures while actively seeking emotionally engaging narratives.",
  "metrics": {
    "rouge1_f": 0.10030090270812438,
    "rouge2_f": 0.006024096385542169,
    "rougeL_f": 0.048144433299899696,
    "meteor": 0.029604100388829973,
    "bleu1": 9.334164009292112e-05,
    "bleu2": 2.461946283922449e-05,
    "bleu3": 3.8358256807217565e-06,
    "bleu4": 1.5155123990808384e-06,
    "bertscore_precision": 0.34812527894973755,
    "bertscore_recall": 0.48129338026046753,
    "bertscore_f1": 0.4040188491344452
  }
}