{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Friendly Persuasion (DVD)\nReview Date: 2015/04/13\nStore: Gary Cooper  (Actor),     Dorothy McGuire  (Actor),     William Wyler  (Director, Producer)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: [\"For two years the Civil War has been elsewhere. Now Confederate forces are nearby, looting and burning. It is time to fight back, Jess Birdwell's neighbors insist. Yet Birdwell, a Quaker, knows there must be a better way to settle things.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Westerns', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Theodore Newton, John Smith, Edna Skinner, Jessamyn West, Dorothy McGuire, Richard Eyer, Walter Catlett, Robert Middleton, Michael Wilson, Gary Cooper, Richard Hale, Phyllis Love, Marjorie Main, Joel Fluellen, Marjorie Durant, William Wyler, Peter Mark Richman, Anthony Perkins, Frances FarwellTheodore Newton, John Smith, Edna Skinner, Jessamyn West, Dorothy McGuire, Richard Eyer, Walter Catlett, Robert Middleton, Michael Wilson, Gary Cooper, Richard Hale, Phyllis Love, Marjorie Main, Joel Fluellen, Marjorie Durant, William Wyler, Peter Mark Richman, Anthony…  See more', 'Initial release date': '2005-07-12', 'Language': 'English (Mono), Unqualified (DTS ES 6.1), French (Dolby Digital 1.0)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 137 min', 'Director': 'William Wyler', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 31 minutes', 'Release date': 'July 12, 2005', 'Actors': 'Gary Cooper, Dorothy McGuire, Anthony Perkins, Richard Eyer, Robert Middleton', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'William Wyler', 'Studio': 'Studio Distribution Services', 'Writers': 'Michael Wilson', 'Number of discs': '1'}\nReview Text: Bought it for a friend who said that this was her all time favorite movie.  Naturally, she was quite pleased.  You just can't go wrong with Gary Cooper.\nReview Title: ... friend who said that this was her all time favorite movie. Naturally\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Intouchables\nFrançois Cluzet  (Actor),     Omar Sy  (Actor),     Eric Toledano  (Director),     Olivier Nakache  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'When Driss, an ex-con from the projects, is hired to take care of an eccentric French aristocrat named Philippe, his newfound job quickly becomes an unpredictable adventure. Speeding a Maserati through Paris, seducing women and paragliding over the Alps is just the beginning, as Driss turns the often humorous world of upper-class Parisian society upside-down. As this unlikely duo overcome adversity of every flavor in this true story, they also shatter their preconceptions of love, life and each other. Based on the #1 international best-selling book, “You Changed My Life.”', 'Amazon.com', \"Driss (Omar Sy), a Senegalese man living in a Paris slum, applies for a job as caretaker to a wealthy quadriplegic, but all he wants is to get his paper stamped so he can get benefits. Despite his lack of qualifications, he lands the job because of his attitude: Philippe (François Cluzet), the quadriplegic, wants a caretaker who will look at him without pity. As Driss reluctantly learns to move, feed, and clean Philippe, the two men discover a blunt but vital humor that not only bridges the cultural and class divide between them, but gives Philippe a renewed joy in life. It's easy to see what made\", 'The Intouchables', \"such a massive success in France; the movie has the sweet sincerity and uplifting conclusion that make for a classic feel-good experience. The chemistry between the two leads is undeniable, and Sy--who won the French equivalent of the Oscar for his role--is a dynamic and charismatic performer, while Cluzet's understated performance conveys Philippe's frustrations. The movie doesn't dig too deeply into the struggles of life as a quadriplegic or the struggles of life among the inner-city poor, so when\", 'The Intouchables', \"ends it's not likely to leave a lasting impression, but that doesn't get in the way of its immediate charm and warmth.\", '--Bret Fetzer']\n{'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Omar Sy, François Cluzet, Cyril Mendy, Eric Toledano, Olivier Nakache, Anne Le Ny, Salimata Kamate, Joséphine de Meaux, Absa Diatou Toure, Dominique Daguier, Grégoire Oestermann, Audrey Fleurot, Clotilde Mollet, Alba Gaïa Kraghede BellugiOmar Sy, François Cluzet, Cyril Mendy, Eric Toledano, Olivier Nakache, Anne Le Ny, Salimata Kamate, Joséphine de Meaux, Absa Diatou Toure, Dominique Daguier, Grégoire Oestermann, Audrey Fleurot, Clotilde Mollet, Alba Gaïa Kraghede Bellugi  See more', 'Language': 'French (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '26256632', 'Director': 'Eric Toledano, Olivier Nakache', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'March 5, 2013', 'Actors': 'François Cluzet, Omar Sy, Anne Le Ny, Audrey Fleurot, Joséphine de Meaux', 'Subtitles': 'Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nOne of the absolutly best movies that I have ever seen.  Could have watched  Omar Sy dance for hours and hours  When I think that my like is difficult, all I have to do is watch a few minutes of this movie to feel truly blessed.\nWonderful, wonderful movie\nFriendly Persuasion (DVD)\nGary Cooper  (Actor),     Dorothy McGuire  (Actor),     William Wyler  (Director, Producer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n[\"For two years the Civil War has been elsewhere. Now Confederate forces are nearby, looting and burning. It is time to fight back, Jess Birdwell's neighbors insist. Yet Birdwell, a Quaker, knows there must be a better way to settle things.\"]\n{'Genre': 'Kids & Family, Westerns', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Theodore Newton, John Smith, Edna Skinner, Jessamyn West, Dorothy McGuire, Richard Eyer, Walter Catlett, Robert Middleton, Michael Wilson, Gary Cooper, Richard Hale, Phyllis Love, Marjorie Main, Joel Fluellen, Marjorie Durant, William Wyler, Peter Mark Richman, Anthony Perkins, Frances FarwellTheodore Newton, John Smith, Edna Skinner, Jessamyn West, Dorothy McGuire, Richard Eyer, Walter Catlett, Robert Middleton, Michael Wilson, Gary Cooper, Richard Hale, Phyllis Love, Marjorie Main, Joel Fluellen, Marjorie Durant, William Wyler, Peter Mark Richman, Anthony…  See more', 'Initial release date': '2005-07-12', 'Language': 'English (Mono), Unqualified (DTS ES 6.1), French (Dolby Digital 1.0)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 137 min', 'Director': 'William Wyler', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 31 minutes', 'Release date': 'July 12, 2005', 'Actors': 'Gary Cooper, Dorothy McGuire, Anthony Perkins, Richard Eyer, Robert Middleton', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'William Wyler', 'Studio': 'Studio Distribution Services', 'Writers': 'Michael Wilson', 'Number of discs': '1'}\nBought it for a friend who said that this was her all time favorite movie.  Naturally, she was quite pleased.  You just can't go wrong with Gary Cooper.\n... friend who said that this was her all time favorite movie. Naturally",
  "profile": "**User Profile Summary:**\n\nThe user has a strong affinity for heartfelt and uplifting films, particularly those that blend drama and comedy. They appreciate narratives that highlight deep emotional connections and the transformative power of friendship, as evidenced by their enthusiastic reviews of films featuring strong lead performances. The user values stories that challenge social norms and cultural divides, indicating a preference for personal growth and resilience.\n\nRecent interactions reflect a growing appreciation for classic cinematic experiences, particularly films featuring iconic actors, such as Gary Cooper. The user enjoys purchasing films that resonate with friends, showcasing their desire to share meaningful narratives with loved ones. This suggests an emphasis on community and connection in their viewing habits. \n\nKey trends include:\n- **Genre Preference:** Drama and comedy, especially feel-good narratives, including family and historical themes.\n- **Emotional Resonance:** Enjoyment of films that offer warmth, charm, and humor amidst adversity.\n- **Performance Appreciation:** A strong admiration for dynamic lead performances, especially from classic cinema.\n- **Personal Impact:** The user seeks films that provide perspective on life challenges, evoke gratitude, and foster connections with friends.\n\nOverall, the user finds joy in cinematic experiences that inspire personal reflection and a renewed appreciation for life while deepening relationships through shared stories.",
  "metrics": {
    "rouge1_f": 0.15398388540734112,
    "rouge2_f": 0.010762331838565021,
    "rougeL_f": 0.06266786034019696,
    "meteor": 0.05497692240626001,
    "bleu1": 0.0066653567368254694,
    "bleu2": 0.0022725206100620327,
    "bleu3": 0.00071478248327327,
    "bleu4": 0.00022564994656528955,
    "bertscore_precision": 0.33583706617355347,
    "bertscore_recall": 0.4736463725566864,
    "bertscore_f1": 0.3930111527442932
  }
}