{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2020/01/11\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Sandra Nettelbeck'], 'Producers': ['Christine Haebler', 'Judy Tossell'], 'Starring': ['Ashley Judd', 'Goran Visnjic', 'Lauren Lee Smith'], 'Studio': ['Insight Film Studios']}\nReview Text: Very good movie about mental illness.  Ashley Judd does a great job\nReview Title: Intense!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Intouchables\nFrançois Cluzet  (Actor),     Omar Sy  (Actor),     Eric Toledano  (Director),     Olivier Nakache  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'When Driss, an ex-con from the projects, is hired to take care of an eccentric French aristocrat named Philippe, his newfound job quickly becomes an unpredictable adventure. Speeding a Maserati through Paris, seducing women and paragliding over the Alps is just the beginning, as Driss turns the often humorous world of upper-class Parisian society upside-down. As this unlikely duo overcome adversity of every flavor in this true story, they also shatter their preconceptions of love, life and each other. Based on the #1 international best-selling book, “You Changed My Life.”', 'Amazon.com', \"Driss (Omar Sy), a Senegalese man living in a Paris slum, applies for a job as caretaker to a wealthy quadriplegic, but all he wants is to get his paper stamped so he can get benefits. Despite his lack of qualifications, he lands the job because of his attitude: Philippe (François Cluzet), the quadriplegic, wants a caretaker who will look at him without pity. As Driss reluctantly learns to move, feed, and clean Philippe, the two men discover a blunt but vital humor that not only bridges the cultural and class divide between them, but gives Philippe a renewed joy in life. It's easy to see what made\", 'The Intouchables', \"such a massive success in France; the movie has the sweet sincerity and uplifting conclusion that make for a classic feel-good experience. The chemistry between the two leads is undeniable, and Sy--who won the French equivalent of the Oscar for his role--is a dynamic and charismatic performer, while Cluzet's understated performance conveys Philippe's frustrations. The movie doesn't dig too deeply into the struggles of life as a quadriplegic or the struggles of life among the inner-city poor, so when\", 'The Intouchables', \"ends it's not likely to leave a lasting impression, but that doesn't get in the way of its immediate charm and warmth.\", '--Bret Fetzer']\n{'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Omar Sy, François Cluzet, Cyril Mendy, Eric Toledano, Olivier Nakache, Anne Le Ny, Salimata Kamate, Joséphine de Meaux, Absa Diatou Toure, Dominique Daguier, Grégoire Oestermann, Audrey Fleurot, Clotilde Mollet, Alba Gaïa Kraghede BellugiOmar Sy, François Cluzet, Cyril Mendy, Eric Toledano, Olivier Nakache, Anne Le Ny, Salimata Kamate, Joséphine de Meaux, Absa Diatou Toure, Dominique Daguier, Grégoire Oestermann, Audrey Fleurot, Clotilde Mollet, Alba Gaïa Kraghede Bellugi  See more', 'Language': 'French (Dolby Digital 5.1)', 'Runtime': '1 hour and 52 minutes', 'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '26256632', 'Director': 'Eric Toledano, Olivier Nakache', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'March 5, 2013', 'Actors': 'François Cluzet, Omar Sy, Anne Le Ny, Audrey Fleurot, Joséphine de Meaux', 'Subtitles': 'Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nOne of the absolutly best movies that I have ever seen.  Could have watched  Omar Sy dance for hours and hours  When I think that my like is difficult, all I have to do is watch a few minutes of this movie to feel truly blessed.\nWonderful, wonderful movie\nFriendly Persuasion (DVD)\nGary Cooper  (Actor),     Dorothy McGuire  (Actor),     William Wyler  (Director, Producer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n[\"For two years the Civil War has been elsewhere. Now Confederate forces are nearby, looting and burning. It is time to fight back, Jess Birdwell's neighbors insist. Yet Birdwell, a Quaker, knows there must be a better way to settle things.\"]\n{'Genre': 'Kids & Family, Westerns', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Theodore Newton, John Smith, Edna Skinner, Jessamyn West, Dorothy McGuire, Richard Eyer, Walter Catlett, Robert Middleton, Michael Wilson, Gary Cooper, Richard Hale, Phyllis Love, Marjorie Main, Joel Fluellen, Marjorie Durant, William Wyler, Peter Mark Richman, Anthony Perkins, Frances FarwellTheodore Newton, John Smith, Edna Skinner, Jessamyn West, Dorothy McGuire, Richard Eyer, Walter Catlett, Robert Middleton, Michael Wilson, Gary Cooper, Richard Hale, Phyllis Love, Marjorie Main, Joel Fluellen, Marjorie Durant, William Wyler, Peter Mark Richman, Anthony…  See more', 'Initial release date': '2005-07-12', 'Language': 'English (Mono), Unqualified (DTS ES 6.1), French (Dolby Digital 1.0)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'Relay Time: 137 min', 'Director': 'William Wyler', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 31 minutes', 'Release date': 'July 12, 2005', 'Actors': 'Gary Cooper, Dorothy McGuire, Anthony Perkins, Richard Eyer, Robert Middleton', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'William Wyler', 'Studio': 'Studio Distribution Services', 'Writers': 'Michael Wilson', 'Number of discs': '1'}\nBought it for a friend who said that this was her all time favorite movie.  Naturally, she was quite pleased.  You just can't go wrong with Gary Cooper.\n... friend who said that this was her all time favorite movie. Naturally\nPsycho: Complete 4-Movie Collection [DVD]\nAnthony Perkins  (Actor, Director),     Janet Leigh  (Actor),     Mick Garris  (Director),     Richard Franklin  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Check into the motel where guests never check out in the Psycho: Complete 4-Movie Collection, featuring all four thrillers starring Anthony Perkins as the notorious Norman Bates – including the iconic original directed by the Master of Suspense, Alfred Hitchcock. In Psycho, a secretary (Janet Leigh) checks into the remote Bates Motel run by a shy young man (Perkins) with what appears to be a domineering mother. In Psycho II, Norman returns to his family home after 22 years only to be haunted by his past. Old habits die hard when Norman falls for a former nun and angers his jealous mother in Psycho III. Finally, in Psycho IV: The Beginning, Norman calls in to a late-night radio show and shares disturbing memories of his childhood with Mother.', 'Bonus Content:', 'Disc 1 - Psycho (1960):', 'Theatrical Trailer', 'Theatrical Trailer', 'Re-Release Trailers', 'Re-Release Trailers', 'Newsreel Footage: The Release of Psycho', 'Newsreel Footage: The Release of Psycho', 'The Shower Scene', 'The Shower Scene', 'The Psycho Archives', 'The Psycho Archives', 'Production Photographs', 'Production Photographs', 'Behind-the-Scenes Photographs', 'Behind-the-Scenes Photographs', 'The Shower Scene: Storyboards by Saul Bass', 'The Shower Scene: Storyboards by Saul Bass', 'Lobby Cards', 'Lobby Cards', 'Posters and Psycho Ads', 'Posters and Psycho Ads', 'Production Notes', 'Production Notes', 'Disc 2 - Psycho II:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 3 - Psycho III:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Horror, Suspense', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Charles Edward Pogue, Meg Tilly, Olivia Hussey, Vera Miles, John Gavin, Martin Balsam, Janet Leigh, Jeff Fahey, Roberta Maxwell, Joseph Stefano, Robert Loggia, Richard Franklin, Alfred Hitchcock, Hilton A. Green, John L. Russell, Diana Scarwid, Tom Holland, Mick Garris, John McIntire, Anthony Perkins, Henry Thomas, Dennis FranzCharles Edward Pogue, Meg Tilly, Olivia Hussey, Vera Miles, John Gavin, Martin Balsam, Janet Leigh, Jeff Fahey, Roberta Maxwell, Joseph Stefano, Robert Loggia, Richard Franklin, Alfred Hitchcock, Hilton A. Green, John L. Russell, Diana Scarwid, Tom Holland, Mick Garris, John M…   See more', 'Initial release date': '2017-09-12', 'Language': 'English (Dolby Digital 4.0), English (Dolby Digital 2.0), Spanish (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Aspect Ratio': '1.78:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Director': 'Mick Garris, Anthony Perkins, Richard Franklin, Alfred Hitchcock', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '6 hours and 52 minutes', 'Release date': 'September 12, 2017', 'Actors': 'Anthony Perkins, Janet Leigh, Meg Tilly, Diana Scarwid, Henry Thomas', 'Subtitles': 'Spanish, French', 'Producers': 'Hilton A. Green, Alfred Hitchcock', 'Studio': 'Studio Distribution Services', 'Writers': 'Charles Edward Pogue, Tom Holland, Joseph Stefano', 'Country of Origin': 'USA', 'Number of discs': '3'}\nGiven as a gift to a fellow scary movie fan.  She loved them!\nGood  Collection of Scary Films\nThunderpants\nNed Beatty  (Actor),     Stephen Fry  (Actor),     Peter Hewitt  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"A nerdy schoolboy's exceptional farts propel him to improbable places in THUNDERPANTS, including, in the film's explosive finale, a rescue mission in outer space. Director Peter Hewitt Star Bruce Cook, Rupert Grint, Adam Godley Special Features: Full Frame Format.\"]\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Rupert Grint, Anna Popplewell, Victor McGuire, Paul Giamatti, Bronagh Gallagher, Simon Callow, Celia Imrie, Leslie Phillips, Ned Beatty, Robert Hardy, Peter Hewitt, Bruce Cook, Stephen Fry, Adam GodleyRupert Grint, Anna Popplewell, Victor McGuire, Paul Giamatti, Bronagh Gallagher, Simon Callow, Celia Imrie, Leslie Phillips, Ned Beatty, Robert Hardy, Peter Hewitt, Bruce Cook, Stephen Fry, Adam Godley   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 27 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.88 Ounces', 'Item model number': 'WENC80345DVD', 'Director': 'Peter Hewitt', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 27 minutes', 'Release date': 'July 10, 2007', 'Actors': 'Ned Beatty, Stephen Fry, Bronagh Gallagher, Paul Giamatti, Robert Hardy', 'Studio': 'The Weinstein Company', 'Number of discs': '1'}\nAwesomely funny movie starring the young Ron Weasley aka Rupert Grint.\nFunny, funny, funny\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Sandra Nettelbeck'], 'Producers': ['Christine Haebler', 'Judy Tossell'], 'Starring': ['Ashley Judd', 'Goran Visnjic', 'Lauren Lee Smith'], 'Studio': ['Insight Film Studios']}\nVery good movie about mental illness.  Ashley Judd does a great job\nIntense!",
  "profile": "**Updated User Profile Summary:**\n\nThe user has a pronounced affinity for heartfelt and uplifting films, particularly those that blend drama and comedy, emphasizing deep emotional connections and the transformative power of friendship. They value narratives that challenge social norms and inspire personal growth and resilience. Recent interactions reveal a growing appreciation for classic cinema and iconic performances, alongside a newfound interest in diverse genres, including horror and suspense.\n\nThe latest purchase, centered on a film addressing mental illness, highlights the user’s preference for narratives that explore complex emotional themes with depth and intensity. Their engagement with lighter, comedic films also reflects a love for humor and a playful narrative style—enjoying feel-good films that convey emotional appeal.\n\nThe user enjoys acquiring films that resonate with friends, indicating a desire for shared meaningful narratives and emphasizing community and connection in their viewing habits.\n\nKey trends include:\n- **Genre Preference:** Drama, comedy, with interests expanding into horror, suspense, and lighthearted family comedies.\n- **Emotional Resonance:** A consistent appreciation for films that evoke warmth, gratitude, and introspection on life's complexities.\n- **Performance Appreciation:** Admiration for dynamic lead performances, especially from classic actors.\n- **Personal Impact:** A focus on films that foster friendships while offering insights into resilience and personal challenges.\n\nOverall, the user finds joy in cinematic experiences that inspire reflection, strengthen relationships through shared stories, and cultivate a renewed appreciation for life.",
  "metrics": {
    "rouge1_f": 0.11227701993704091,
    "rouge2_f": 0.007352941176470588,
    "rougeL_f": 0.04826862539349423,
    "meteor": 0.03500854627018332,
    "bleu1": 0.0001900468190693558,
    "bleu2": 5.812646015834357e-05,
    "bleu3": 8.183161617336787e-06,
    "bleu4": 3.073097823357357e-06,
    "bertscore_precision": 0.34216755628585815,
    "bertscore_recall": 0.48529505729675293,
    "bertscore_f1": 0.40135282278060913
  }
}