{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Movo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#3 Medium beige)\nReview Date: 2021/06/08\nStore: Movo\nAverage Rating: 3.8\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 2.89 Ounces'}\nReview Text: It gives a good light to medium coverage, but I found that I could only use a little bit because it would make my skin look cakey and dry. It applies easily with the damp beauty blender and feels lightweight. I was able to apply blush and bronzer easily. It lasted all day and didn't settle in my fine lines and gives a smooth matte finish. One thing I really like is that it didn't irritate my skin  and cause a reaction like a lot of foundations do.\nReview Title: A little goes a long way\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Huxley Secret of Sahara Clay Mask Balanced Blend 4.23 fl. oz. | Korean Clay Mask to Refine Pores and Absorb Excess Oil and Sebum | Made with Moroccan Rhassoul Clay\nHuxley\n{'Brand': 'Huxley', 'Item Form': 'Clay', 'Skin Type': 'Sensitive', 'Special Feature': 'Hypoallergenic', 'Unit Count': '4.23 Fl Oz', 'Product Dimensions': '2.68 x 2.68 x 6.97 inches; 6.38 Ounces'}\nThis mask is one my favorite clay masks that I've tried. It so gentle on the skin and hardly any scent to it. It's not too thick and easily applied in a thin layer. It exfoliates well and leaves my face feeling clean and visibly brighter after the first use. I was also pleasantly surprised that my face didn't feel dry after and it actually felt moisturized. A little goes a long way and it's well worth the price. The packaging is beautiful and looks like a luxury item. This would make a great gift! Will absolutely be buying this again when this tube is finished.\nVisibly brightens my skin\nDEROL Eyeshadow Stick Sets 12 Colors，Long Lasting Glitter Eye Brightener Eyeliner Sticks,Cream to Powder Waterproof Eye Makeup,Eyeshadow Capsules Crayon,Shimmer Eye Shadow Pencils (12 Colors/Box)\nDEROL\n{'Brand': 'DEROL', 'Item Form': 'Crayon,Cream,Powder', 'Finish Type': 'Shimmery', 'Special Feature': 'Waterproof, Long lasting', 'Number of Items': '1', 'Product Dimensions': '2.2 x 2 x 2 inches; 1.45 Ounces', 'UPC': '715962598334'}\nI was really excited to receive these little eyeshadows. They are small and compact, which makes them easy to pack and travel with. The colors are pretty and while not super pigmented at to begin with they are buildable and blend well. I tried them with eye primer and with out and they lasted the same for me. I will say I have oily eyelids and noticed that they don't last more than a couple hours.<br />I think these would make a great gift for adults, teens, or even younger kids who want play makeup. My daughters who are 6 and 7 found them one day and loved using them. They especially loved the blue and purple that they said made them look like a mermaid.  They are super fun and priced fairly so I would say give them a try!\nCompact and easy application\n2Pcs Mascara Black Volume and Length 4D Natural and Long Lasting Lash Blast Mascara, 0.27 Fl Oz\nMarine Forest\n{'Brand': 'Marine Forest', 'Number of Items': '2', 'Item Volume': '0.27 Fluid Ounces', 'Package Information': 'Tube', 'Water Resistance Level': 'Waterproof', 'Package Dimensions': '4.84 x 2.01 x 0.98 inches; 3.17 Ounces', 'UPC': '729843907382'}\nThis mascara did not work for me. I tried it with a primer and without to see how it performed and both times it flaked with in 4 hours giving me raccoon eyes. I wanted to love it though because it is very pigmented and applied smoothly without clumps. Didn't work for me, but that doesn't mean it wont for others.\nPigmented but flaked\nMovo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#3 Medium beige)\nMovo\n{'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 2.89 Ounces'}\nIt gives a good light to medium coverage, but I found that I could only use a little bit because it would make my skin look cakey and dry. It applies easily with the damp beauty blender and feels lightweight. I was able to apply blush and bronzer easily. It lasted all day and didn't settle in my fine lines and gives a smooth matte finish. One thing I really like is that it didn't irritate my skin  and cause a reaction like a lot of foundations do.\nA little goes a long way",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Continues to favor skincare, particularly clay masks for gentle exfoliation and brightening effects, while also exploring eye makeup with a focus on vibrant options. The user has now ventured into foundations, emphasizing lightweight, natural finishes that align with their skin sensitivity concerns.\n\n- **Skin Type:** Sensitive skin, maintaining a strong preference for hypoallergenic and non-irritating formulations in skincare and makeup products. While the user has recently experimented with foundation designed for oily skin, they remain cautious about potential irritation.\n\n- **Key Features Valued:** Effective cleansing, moisturizing properties, and easy application are crucial. The user appreciates versatile, buildable makeup with aesthetically pleasing packaging that is suitable for gifting. Recent experiences underline the importance of avoiding products that can cause a cakey appearance or dryness.\n\n- **Consumer Behavior:** Shows a willingness to repurchase high-quality skincare items and is gradually refining their makeup selection by prioritizing performance and irritation potential. Exploration continues to focus on compact, travel-friendly items that offer a balance of fun and functionality.\n\n- **Satisfaction Level:** Generally high satisfaction with products that meet personal needs, though the user’s recent makeup experiences highlight the need for careful selection based on performance to prevent issues like flaking or irritation. The focus remains on achieving effective skincare rituals while enjoying playful makeup solutions that also feel safe on sensitive skin.\n\n**Trends:** A commitment to effective skincare routines is paired with a cautious yet evolving approach to makeup, emphasizing practicality and enjoyment while being mindful of skin sensitivity and product performance.",
  "metrics": {
    "rouge1_f": 0.2448087431693989,
    "rouge2_f": 0.028477546549835704,
    "rougeL_f": 0.0983606557377049,
    "meteor": 0.10871767384821623,
    "bleu1": 0.07403724717601938,
    "bleu2": 0.02074508661414793,
    "bleu3": 0.006533100319042458,
    "bleu4": 0.0020633358101005968,
    "bertscore_precision": 0.3831455707550049,
    "bertscore_recall": 0.46455931663513184,
    "bertscore_f1": 0.4199429452419281
  }
}