{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NOBLE Wigs for White Women Purple Lace Wigs for Black Women 27 Inch Long Curly Wavy Colored Wigs Middle Part Heat Resistant Synthetic Ombre Purple Wavy Wigs for Daily Party Cosplay Use\nReview Date: 2021/04/18\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.78 x 7.76 x 2.44 inches; 14.07 Ounces'}\nReview Text: The coloring looks really cool and pretty. I like that it's got the multiple colors, I personally haven't had many that do. The length and style combined with the colors is a lot of fun. It sheds a little. I try to be careful with the ends as they've been a little tangly but it's a costume wig so I often experience that with other costume wigs, especially with length and curls. Overall I really like it and think it looks good\nReview Title: Fun and pretty!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Gaming Headphones Chamvict Xbox One Headset with Stereo Sound Ps4 Headset with Mic Noise Canceling for PS4,PC,Laptop,Cell Phone,Xbox,Find Enemies Before They Find You\nChamvict\n['Why to choose us', \"1. 【Splendid stereo audio output】Bring you an immersive game experience with stereo sound.You can get clear sound and accurately judge the enemies’ direction especially in “Playerunknown's Battlegrounds” 2. 【360° Noise canceling mic】We adopt intelligent chip to cancel outside noise.Just enjoy your own game world.You can judge the enemies direction and shoot in time without any noise.Victory is yours!The mic is flexible and can be adjusted to different angle for 360° 3. 【Comfy for long time wearing】With an extreme light of 0.87pounds, it is professionally designed for long time wearing and relieve your tiredness.The earmuff is breathable and soft, which can give your ear a comfy touch with less stress and keep cool when gaming for long time 4. 【Skin-friendly earmuff】Made of superior PU leather material, the earmuff is friendly to your skin 5. 【Convenient volume and mic adjustment】You can adjust game sound volume via the pulley and turn on/off mic via the switch anytime when don’t use it\", 'Tips for PS4', '1. Plug 3.5mm cable into the console 2. Long press PS4 button and go to system setting 3. Go to “PERIPHERAL MACHINE”, ”ADJUST SOUND AND DEVICES”, choose “OUTPUT TO THE HEADPHONES”, select “ALL AUDIO”', 'Multiple platform compatibility', '★Play station 4 ★Nintendo switch/3DS ★Cell phone with 3.5mm audio interface ★Xbox one/360: It need a microsoft adapter(not included) when connect to old version xbox one ★Laptop/PC/macbook: Need a pc extension cord(included), plug mic and audio cord into your PC, laptop, macbook', 'Specification', '★Drive Diameter: 50mm ★Frequency: 20HZ-20KHZ ★Sensitivity: 102±3DB ★Mic Diameter: 4.0×1.5mm ★Mic Sensitivity: -38±3DB ★Cable Length: 6.6ft ★Size: 8.1×4.1×8.7inch ★N.W.: 0.873pounds ★G.W.: 1.12Pounds']\n{'Brand': 'Chamvict', 'Color': 'Black', 'Form Factor': 'Over Ear', 'Connectivity Technology': 'Wired', 'Special Feature': 'Noise Canceling, Microphone Included', 'Package Dimensions': '9.1 x 7.8 x 4.3 inches; 1.09 Pounds', 'Manufacturer': 'Dongguan Guanbiao Trading Co.,Ltd'}\nUsed this on a PS4 Pro and it worked great- clear sound from the game and in chatting. It's bulky but not heavy and comfortable to wear- even for hours at a time. The mic is a good length and able to bend a bit, if needed. The cord seems durable and connected well to the PS4 controller. The controls for the headset itself all work good. All around, a good headset 👍\nAll around, a good headset\nPadded Rhinestone Crystal Headband Bejewled Wide Velvet Hairband Statement Bridal Wedding Party Headwear Hair Hoop Hair Accessories (rainbow)\nJERTOCLE\n{'Color': 'Gold,Silver,Rainbow', 'Age Range (Description)': 'Adult', 'Material': 'Pearl, Cloth, Rhinestone, Crystal', 'Fabric Type': 'Velvet', 'Number of Items': '1', 'Package Dimensions': '6.2 x 5.4 x 1.85 inches; 5.61 Ounces', 'UPC': '783911261158'}\nThis is definitely a statement headband! For whatever you decide to use it for, it's big (thick/height wise), flashy and very noticeable…yet very pretty and has a lot of bling 🙌🏽 My 10 year old loves it too and says it's like a queen's headband. The soft lining underneath does help make it comfortable and it fits well!\nBling!\nHemp Lotion for Dry Skin - Soothing Rose Flower & Aloe Hydrate Your Complexion - Non-Greasy, Vegan, 7Oz, 250Mg Hemp, Fragrance & Paraben Free - Guayaquil By La La Leaf\nLA LA LEAF\n{'Brand': 'LA LA LEAF', 'Item Form': 'Lotion', 'Unit Count': '7.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Package Dimensions': '8.19 x 2.28 x 2.17 inches; 8.78 Ounces', 'UPC': '860002750125'}\nHaving health issues that causes very dry skin, I appreciate a lotion with better ingredients and moisturizing. This one isn't as thick as some but it's doing the job hydrating. It's a great size too!\nNice and great size\nAltaba Long Wavy Wigs Ombre gray Wig Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult', 'Material Feature': 'Heat Resistant', 'UPC': '788436507620'}\nSoft. Decent quality. Very pretty coloring with the black roots and silver-gray. The length and style look pretty, too. Fits good and is styled nicely. Looks good, overall like it!\nCute!\nHetianmei® Pink Rhinestone Headbands for Women，Jewel Headband，Bling Diamond Headbands Crystal Fashion Sparkly Jeweled Thick Headbands for Woman\nHetianmei\n{'Color': 'Pink', 'Age Range (Description)': 'Adult', 'Material': 'Crystal Rhinestone, Crystal', 'Fabric Type': 'Velvet', 'Number of Items': '1', 'Product Dimensions': '6.69 x 5.51 x 1.38 inches; 3.53 Ounces'}\nIt's really cute and sparkly. Quality is fine but feels slightly off compared to other similar headbands in this price range that I've tried. Hopefully it holds up well, if taken care of. Slightly narrow fit but not too uncomfortable. Liking the look and color!\nCute\nMAELYS VIRTUE Neck Firming Cream\n{'Brand': 'MAELYS', 'Item Form': 'Cream', 'Unit Count': '1.76 Ounce', 'Number of Items': '1', 'Use for': 'Face', 'Package Dimensions': '3.46 x 3.39 x 2.8 inches; 1.76 Ounces', 'Item model number': 'B07PBWVV5K', 'Manufacturer': 'B4Y LABORATORIES LTD'}\nThe skin on my neck has lost a lot of elasticity. I wouldn't say it's in bad shape but I feel it is for being in mid 30s. Having health stuff going on, former daily tanning machine user, former smoker and my weight goes up-and-down- all things that have contributed to my skin changes and my neck is no exception. This cream is soothing and leaves a lot of moisturize but not a lot of goop. I feel like my skin looks smoother, though I'm sure more consistent and long-term use will bring the most benefits and results. The texture of it is so creamy and thick and feels great on! Arrived sealed and packaged-up really well.\nLiking it\nAltaba Long Blonde Wavy Wigs for Women Ombre Blonde Middle Part Wigs Natural Looking Synthetic Wig Party Cosplay Wigs for Women Heat Resistant Fiber (Light Brown to Golden)\nAltaba\n{'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult', 'Special Feature': 'Glueless', 'Package Dimensions': '12.2 x 8.5 x 2.44 inches; 9.14 Ounces'}\nSoft and pretty. I really like the length and the ombre coloring looks good. Stays fastened pretty well on it's own, though, I use a wig-grip band and it keeps in place well. Great for cosplay, dress-up or just because🙌🏼\nLike the look\nNOBLE Wigs for White Women Purple Lace Wigs for Black Women 27 Inch Long Curly Wavy Colored Wigs Middle Part Heat Resistant Synthetic Ombre Purple Wavy Wigs for Daily Party Cosplay Use\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.78 x 7.76 x 2.44 inches; 14.07 Ounces'}\nThe coloring looks really cool and pretty. I like that it's got the multiple colors, I personally haven't had many that do. The length and style combined with the colors is a lot of fun. It sheds a little. I try to be careful with the ends as they've been a little tangly but it's a costume wig so I often experience that with other costume wigs, especially with length and curls. Overall I really like it and think it looks good\nFun and pretty!",
  "profile": "**Updated User Profile Summary:**\n\n- **Gaming Enthusiast**: Maintains a strong interest in immersive gaming experiences, particularly on consoles like PS4.\n- **Audio Quality Preference**: Values high-fidelity sound and clarity in gameplay and communication, focusing on stereo output.\n- **Comfort during Extended Use**: Prioritizes comfort for long gaming sessions, appreciating lightweight and breathable materials in gaming gear and accessories.\n- **Functionality & Durability**: Seeks products with reliable controls and durability, with positive experiences in adjustable microphones and sturdy connections.\n- **Multifunctionality**: Values devices that are compatible across various platforms, indicating a preference for versatility in gaming accessories.\n- **Ease of Use**: Favors equipment that is easy to set up and adjust, ensuring seamless integration into their gaming environment.\n- **Fashion Enthusiast**: Shows a growing passion for distinctive and stylish fashion items, particularly in accessories that enhance self-expression. Recent interest in vibrant, multi-colored hair reflects creativity and a desire for unique personal style, emphasizing both comfort and aesthetic appeal.\n- **Health-Conscious Consumer**: Demonstrates an interest in personal care products focused on quality and effectiveness, particularly in skincare that promotes hydration. Recent interactions reveal a commitment to long-term skin health and self-care.\n\nOverall, the user exhibits a consistent pattern of valuing comfort, audio performance, versatility, and stylish self-expression, alongside a growing emphasis on health and skincare that aligns with their lifestyle and interests.",
  "metrics": {
    "rouge1_f": 0.14804845222072677,
    "rouge2_f": 0.009433962264150943,
    "rougeL_f": 0.07133243606998654,
    "meteor": 0.0559560590456574,
    "bleu1": 0.0047348252264796465,
    "bleu2": 0.0008732537119214142,
    "bleu3": 0.0001455121722858126,
    "bleu4": 5.945044432031347e-05,
    "bertscore_precision": 0.3691205084323883,
    "bertscore_recall": 0.4987452030181885,
    "bertscore_f1": 0.4242524802684784
  }
}