{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Altaba Long Wavy Wigs Ombre gray Wig Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nReview Date: 2020/11/07\nStore: Altaba\nAverage Rating: 3.5\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult', 'Material Feature': 'Heat Resistant', 'UPC': '788436507620'}\nReview Text: Soft. Decent quality. Very pretty coloring with the black roots and silver-gray. The length and style look pretty, too. Fits good and is styled nicely. Looks good, overall like it!\nReview Title: Cute!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Gaming Headphones Chamvict Xbox One Headset with Stereo Sound Ps4 Headset with Mic Noise Canceling for PS4,PC,Laptop,Cell Phone,Xbox,Find Enemies Before They Find You\nChamvict\n['Why to choose us', \"1. 【Splendid stereo audio output】Bring you an immersive game experience with stereo sound.You can get clear sound and accurately judge the enemies’ direction especially in “Playerunknown's Battlegrounds” 2. 【360° Noise canceling mic】We adopt intelligent chip to cancel outside noise.Just enjoy your own game world.You can judge the enemies direction and shoot in time without any noise.Victory is yours!The mic is flexible and can be adjusted to different angle for 360° 3. 【Comfy for long time wearing】With an extreme light of 0.87pounds, it is professionally designed for long time wearing and relieve your tiredness.The earmuff is breathable and soft, which can give your ear a comfy touch with less stress and keep cool when gaming for long time 4. 【Skin-friendly earmuff】Made of superior PU leather material, the earmuff is friendly to your skin 5. 【Convenient volume and mic adjustment】You can adjust game sound volume via the pulley and turn on/off mic via the switch anytime when don’t use it\", 'Tips for PS4', '1. Plug 3.5mm cable into the console 2. Long press PS4 button and go to system setting 3. Go to “PERIPHERAL MACHINE”, ”ADJUST SOUND AND DEVICES”, choose “OUTPUT TO THE HEADPHONES”, select “ALL AUDIO”', 'Multiple platform compatibility', '★Play station 4 ★Nintendo switch/3DS ★Cell phone with 3.5mm audio interface ★Xbox one/360: It need a microsoft adapter(not included) when connect to old version xbox one ★Laptop/PC/macbook: Need a pc extension cord(included), plug mic and audio cord into your PC, laptop, macbook', 'Specification', '★Drive Diameter: 50mm ★Frequency: 20HZ-20KHZ ★Sensitivity: 102±3DB ★Mic Diameter: 4.0×1.5mm ★Mic Sensitivity: -38±3DB ★Cable Length: 6.6ft ★Size: 8.1×4.1×8.7inch ★N.W.: 0.873pounds ★G.W.: 1.12Pounds']\n{'Brand': 'Chamvict', 'Color': 'Black', 'Form Factor': 'Over Ear', 'Connectivity Technology': 'Wired', 'Special Feature': 'Noise Canceling, Microphone Included', 'Package Dimensions': '9.1 x 7.8 x 4.3 inches; 1.09 Pounds', 'Manufacturer': 'Dongguan Guanbiao Trading Co.,Ltd'}\nUsed this on a PS4 Pro and it worked great- clear sound from the game and in chatting. It's bulky but not heavy and comfortable to wear- even for hours at a time. The mic is a good length and able to bend a bit, if needed. The cord seems durable and connected well to the PS4 controller. The controls for the headset itself all work good. All around, a good headset 👍\nAll around, a good headset\nPadded Rhinestone Crystal Headband Bejewled Wide Velvet Hairband Statement Bridal Wedding Party Headwear Hair Hoop Hair Accessories (rainbow)\nJERTOCLE\n{'Color': 'Gold,Silver,Rainbow', 'Age Range (Description)': 'Adult', 'Material': 'Pearl, Cloth, Rhinestone, Crystal', 'Fabric Type': 'Velvet', 'Number of Items': '1', 'Package Dimensions': '6.2 x 5.4 x 1.85 inches; 5.61 Ounces', 'UPC': '783911261158'}\nThis is definitely a statement headband! For whatever you decide to use it for, it's big (thick/height wise), flashy and very noticeable…yet very pretty and has a lot of bling 🙌🏽 My 10 year old loves it too and says it's like a queen's headband. The soft lining underneath does help make it comfortable and it fits well!\nBling!\nHemp Lotion for Dry Skin - Soothing Rose Flower & Aloe Hydrate Your Complexion - Non-Greasy, Vegan, 7Oz, 250Mg Hemp, Fragrance & Paraben Free - Guayaquil By La La Leaf\nLA LA LEAF\n{'Brand': 'LA LA LEAF', 'Item Form': 'Lotion', 'Unit Count': '7.00 Fl Oz', 'Number of Items': '1', 'Use for': 'Whole Body', 'Package Dimensions': '8.19 x 2.28 x 2.17 inches; 8.78 Ounces', 'UPC': '860002750125'}\nHaving health issues that causes very dry skin, I appreciate a lotion with better ingredients and moisturizing. This one isn't as thick as some but it's doing the job hydrating. It's a great size too!\nNice and great size\nAltaba Long Wavy Wigs Ombre gray Wig Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult', 'Material Feature': 'Heat Resistant', 'UPC': '788436507620'}\nSoft. Decent quality. Very pretty coloring with the black roots and silver-gray. The length and style look pretty, too. Fits good and is styled nicely. Looks good, overall like it!\nCute!",
  "profile": "**Updated User Profile Summary:**\n\n- **Gaming Enthusiast**: Maintains a strong interest in immersive gaming experiences, particularly on consoles like PS4.\n- **Audio Quality Preference**: Values high-fidelity sound and clarity in gameplay and communication, focusing on stereo output.\n- **Comfort during Extended Use**: Prioritizes comfort for long gaming sessions; appreciates lightweight and breathable materials in gaming gear and accessories.\n- **Functionality & Durability**: Seeks products with reliable controls and durability, with positive experiences in adjustable microphones and sturdy connections.\n- **Multifunctionality**: Values devices that are compatible across various platforms, indicating a preference for versatility in gaming accessories.\n- **Ease of Use**: Favors equipment that is easy to set up and adjust, ensuring seamless integration into their gaming environment.\n- **Interest in Fashion Accessories**: Now expresses a growing interest in distinctive fashion items, valuing style, uniqueness, comfort, and fit. The user appreciates well-designed products that enhance their self-expression.\n- **Health-Conscious Consumer**: Showing increased interest in personal care products that prioritize quality ingredients and effectiveness, particularly for skin hydration, reflecting a holistic approach to self-care.\n\nOverall, the user exhibits a consistent pattern of valuing comfort, audio performance, and versatility while increasingly embracing unique fashion choices and health-conscious products that complement their lifestyle and interests.",
  "metrics": {
    "rouge1_f": 0.1733615221987315,
    "rouge2_f": 0.01271186440677966,
    "rougeL_f": 0.08879492600422834,
    "meteor": 0.07437070938215103,
    "bleu1": 0.02802568483363589,
    "bleu2": 0.006617938768420435,
    "bleu3": 0.0011117114400902833,
    "bleu4": 0.00045606958607487215,
    "bertscore_precision": 0.3750738799571991,
    "bertscore_recall": 0.4945372939109802,
    "bertscore_f1": 0.4265998899936676
  }
}