{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/02/03\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sydney Pollack'], 'Producers': ['Joe Wizan'], 'Starring': ['Robert Redford', 'Will Geer', 'Stefan Gierasch'], 'Studio': ['WARNER BROS.']}\nReview Text: Classic Redford movie.  A must watch for a fan of adventure and Redford.  It is the type of movie you watch several times and always see something new.\nReview Title: Classic!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Good Wife\nDrama\n['Pushing aside the betrayal and crushing public humiliation caused by her husband, Peter, Alicia Florrick starts over by pursuing her original career as a defense attorney.  As a junior associate at a prestigious Chicago law firm, she joins her longtime friend, former law school classmate and firm partner Will Gardner, who is interested in rekindling their former relationship.']\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick']}\nI just started this series and it it hard to stop watching it!  I love the main character Alicia.  My next  favorite is Zack, her son.  Both of them are so smart and yet, vulnerable.  Strong women will love this.  If you want to be a strong woman you will love it too.  If men would like to be better men, they can pick up a few pointers from this series as well.  Enjoy!\nVery good program\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bobby Quinn'], 'Starring': ['Johnny Carson', 'Ed McMahon', 'Bill Clinton'], 'Studio': ['Respond2 Entertainment']}\nCarson was a one of a kind, never to be duplicated.  I use to watch this program with my parents as a child.  Never a dull one.  You will like this video.\nGreat memories!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sydney Pollack'], 'Producers': ['Joe Wizan'], 'Starring': ['Robert Redford', 'Will Geer', 'Stefan Gierasch'], 'Studio': ['WARNER BROS.']}\nClassic Redford movie.  A must watch for a fan of adventure and Redford.  It is the type of movie you watch several times and always see something new.\nClassic!",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference:** Strong preference for drama series, particularly those exploring complex character dynamics and personal growth, alongside a nostalgic affinity for classic films that evoke positive memories.\n- **Character Focus:** Enjoys stories featuring strong, intelligent female leads and values vulnerability and resilience. Appreciates character development and family dynamics, with a fondness for classic programs and films that remind them of their childhood.\n- **Audience Insight:** Believes the content appeals broadly, resonating with women seeking empowerment and men looking for positive role models.\n- **Emotionally Engaged:** Reacts strongly to narratives showcasing struggle and strength, indicating a preference for emotional depth in storytelling. Enjoys revisiting classic content and films that evoke cherished memories.\n- **Viewing Behavior:** Tends to binge-watch compelling series and enjoys repeated viewings of classic films, suggesting a taste for engaging narratives that reveal new insights upon each watch.\n- **Social Commentary:** Values narratives providing insights into gender roles and relationships, indicating an interest in themes of empowerment and moral lessons. Shows an appreciation for entertainment that leaves a lasting impact, both personally and culturally.\n\nOverall, the user is enthusiastic about well-crafted dramas and classic films with complex characters and strong female protagonists, while cherishing content that reflects their personal history and life lessons, particularly works featuring iconic actors.",
  "metrics": {
    "rouge1_f": 0.192,
    "rouge2_f": 0.008032128514056224,
    "rougeL_f": 0.096,
    "meteor": 0.09710121526302372,
    "bleu1": 0.1193264142485054,
    "bleu2": 0.014943398107674706,
    "bleu3": 0.0034744877660876725,
    "bleu4": 0.0016769336070697812,
    "bertscore_precision": 0.3808130621910095,
    "bertscore_recall": 0.43802303075790405,
    "bertscore_f1": 0.40741950273513794
  }
}