{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/02/28\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick'], 'Studio': ['CBS']}\nReview Text: I always look forward to my special time watching this series.  The main character, Alicia, is smart, caring, and is wonderfully portrayed.  The supporting characters are all very dynamic and each have their own entertaining aspect.  The female actors in this series are the best I have seen I. A series.  Enjoy!\nReview Title: Excellent!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Good Wife\nDrama\n['Pushing aside the betrayal and crushing public humiliation caused by her husband, Peter, Alicia Florrick starts over by pursuing her original career as a defense attorney.  As a junior associate at a prestigious Chicago law firm, she joins her longtime friend, former law school classmate and firm partner Will Gardner, who is interested in rekindling their former relationship.']\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick']}\nI just started this series and it it hard to stop watching it!  I love the main character Alicia.  My next  favorite is Zack, her son.  Both of them are so smart and yet, vulnerable.  Strong women will love this.  If you want to be a strong woman you will love it too.  If men would like to be better men, they can pick up a few pointers from this series as well.  Enjoy!\nVery good program\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bobby Quinn'], 'Starring': ['Johnny Carson', 'Ed McMahon', 'Bill Clinton'], 'Studio': ['Respond2 Entertainment']}\nCarson was a one of a kind, never to be duplicated.  I use to watch this program with my parents as a child.  Never a dull one.  You will like this video.\nGreat memories!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Sydney Pollack'], 'Producers': ['Joe Wizan'], 'Starring': ['Robert Redford', 'Will Geer', 'Stefan Gierasch'], 'Studio': ['WARNER BROS.']}\nClassic Redford movie.  A must watch for a fan of adventure and Redford.  It is the type of movie you watch several times and always see something new.\nClassic!\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Joel Schumacher'], 'Producers': ['Andrew Lloyd Webber'], 'Starring': ['Gerard Butler', 'Emmy Rossum', 'Patrick Wilson'], 'Studio': ['Warner Bros.']}\nMy granddaughter and I have watched this together many times.  Such a bittersweet love story and beautiful music!  Love it!\nBest Musical!\nBreaking Bad\nSuspense, Drama\n['All bad things must come to an end.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Michelle MacLaren', 'Mark Johnson', 'Vince Gilligan']}\nThe first series we have watched entirely.  I had to purchase to finish!  I bought it for my husband really.  Great program but not for children!\nThe best!\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Rosemary Rodriguez', 'Michael Zinberg', 'Brooke Kennedy', 'James Whitmore Jr.', 'Félix Enríquez Alcalá', 'Jim McKay', 'Frederick E.O. Toye', 'Robert King', 'Matt Shakman', 'Nelson McCormick'], 'Studio': ['CBS']}\nI always look forward to my special time watching this series.  The main character, Alicia, is smart, caring, and is wonderfully portrayed.  The supporting characters are all very dynamic and each have their own entertaining aspect.  The female actors in this series are the best I have seen I. A series.  Enjoy!\nExcellent!",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference:** Exhibits a strong preference for drama series that delve into complex character dynamics and personal growth, maintaining a nostalgic connection to classic films while also appreciating suspenseful dramas. Recently developed a fondness for musicals that convey powerful emotional narratives.\n\n- **Character Focus:** Enjoys stories with strong, intelligent female leads, emphasizing vulnerability and resilience. Places a premium on character development and family dynamics, especially in content that can be shared with grandchildren.\n\n- **Audience Insight:** Recognizes the broad appeal of content, particularly resonating with women seeking empowerment and men in search of positive role models.\n\n- **Emotionally Engaged:** Reacts profoundly to narratives that portray struggle and strength, seeking emotional depth in storytelling. Finds joy in revisiting classic films and musicals that evoke cherished memories and highlight personal growth.\n\n- **Viewing Behavior:** Engages in binge-watching compelling series and relishes repeated viewings of films and musicals, indicating a taste for narratives rich in insights. Willing to invest in quality content for personal enjoyment and familial sharing.\n\n- **Social Commentary:** Values narratives that explore gender roles and relationships, expressing interest in themes of empowerment and moral lessons, particularly through familial experiences.\n\nOverall, the user remains enthusiastic about well-crafted dramas, musicals, and suspenseful series, eagerly embracing content that mirrors personal history and life lessons, particularly those emphasizing family connections and strong female characters.",
  "metrics": {
    "rouge1_f": 0.1791044776119403,
    "rouge2_f": 0.013605442176870746,
    "rougeL_f": 0.07869742198100406,
    "meteor": 0.06589581002113638,
    "bleu1": 0.036140478378596366,
    "bleu2": 0.007100198375990417,
    "bleu3": 0.0013299425922366228,
    "bleu4": 0.000576100739313502,
    "bertscore_precision": 0.3514269292354584,
    "bertscore_recall": 0.4275625944137573,
    "bertscore_f1": 0.3857741355895996
  }
}