{
  "user_id": "AHCCH4VZHW2HPLZ5MXGR73U5KZIA",
  "summary": "=== Purchase Information ===\nReview Date: 2013/03/20\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Hit Movies']}\nReview Text: When my Blu-Ray Disc from netflix wouldn't play I turned to streaming and grabbed this movie. The stream ran without any real buffering and I was happy with bitrate, picture and sound.<br />The movie itself, is enjoyable with good plot points and action<br />There are several plot holes and continuity errors- pretty standard for action movies and Tom Cruise's performance is not as good as it could be.<br />The script is tight but does not grab your emotions very firmly. The supporting cast is really what makes up for any lack you feel in the tug of the plot or main character.<br />Overall I enjoyed it. Not enough to want to own it or even watch it again unless it was on TV and the choice came down to it and Duck Dynasty.\nReview Title: Better than I expected\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/05/05\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Constantine Makris', 'Matt Earl Beesley', 'Jamie Babbit', 'Ed Bianchi', 'Stephen Hopkins'], 'Producers': ['Bob DeLaurentis', \"Peter O'Fallon\", 'Noah Hawley'], 'Studio': ['ABC Network']}\nReview Text: I had my doubts, but I loved the cast pretty much from the get go. The show has smart dialogue and crazy &#34;night court&#34; plot twists. The surprise of the show is while you are looking for humor and actionb you are getting emotion from the acting and situations. It's not melodrama as much as you start to care for the characters even the ones who have despicable pasts. I would highly recommend this show if you like The Glades, or The Finder\nReview Title: this is a fresh show filled with smart humor\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Inkheart (+ BD-Live) [Blu-ray]\nReview Date: 2013/10/29\nStore: Brendan Fraser  (Actor),     Paul Bettany  (Actor),     Iain Softley  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Inkheart (Blu-ray)', 'When Mo Folchart reads a story, the characters leap off the page. Literally. And that’s a problem. Mo must somehow use his special powers to send the interlopers back to their world…and save ours. If ever a task was easier read than done, this is it. Mo and his daughter Meggie, aided by friends real and fictional, plunge into a thrilling quest that pits them against diabolical villains, fantastic beasts and dangers at every turn. Brendan Fraser (The Mummy films, Journey to the Center of the Earth) leads a splendid cast (including Academy Award winners* Helen Mirren and Jim Broadbent) in an all-fun, all-family film of Cornelia Funke’s bestseller. Follow Mo and Meggie into adventure more exciting than any ever read. Because it’s adventure they’re going to live!', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Contributor': 'Rafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna GuilloryRafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna Guillory  See more', 'Language': 'German (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '6.7 x 5.3 x 0.5 inches; 3.2 Ounces', 'Director': 'Iain Softley', 'Media Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Run time': '1 hour and 46 minutes', 'Release date': 'June 23, 2009', 'Actors': 'Brendan Fraser, Paul Bettany, Helen Mirren, Jim Broadbent, Andy Serkis', 'Dubbed': 'English, German', 'Subtitles': 'English, Spanish, German', 'Studio': 'New Line Home Entertainment', 'Number of discs': '1'}\nReview Text: I watched this movie with some trepidation since Brandon Frazier has not had good reviews in a long time. What I got was a good cohesive story with enough mystery that if it had been a book I would have continued turning the pages until I learned all of its secrets. There were some scenes that just went to fast and I felt like there could have been more there. The Blu-ray has lots of features that make this worth owning, the menus are exquisite and painstakingly down, superb work.\nReview Title: A real surprise\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Moliere\nReview Date: 2015/06/18\nStore: Romain Duris  (Actor),     Fabrice Luchini  (Actor),     Laurent Tirard  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Bubbling with wit, stellar performances and lavish cinematography, MOLIÈRE stars multi-Cesar(r)-nominated French actor Romain Duris as Molière, a down-and-out actor-cum-playwright up to his ears in debt. When the wealthy Jourdain (Cesar(r)-winner Fabrice Luchini) offers to cover that debt (so that Molière's theatrical talents might help Jourdain win the heart of a certain widowed marquise), hilarity ensues. Disguised as a priest, Molière becomes a guest in Jourdain's palace on the pretext of teaching Jourdain the craft of the stage, which annoys his wife, Elmire. But, soon after, the confrontation between Elmire and Molière turns seductive. Too busy to notice, Jourdain enlists the aid of a well connected and scheming acquaintance, to help him pursue the young widow. Romantic yearning, human foibles and laughs galore all characterize MOLIÈRE, a delightful film that slyly captures your heart.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Contributor': 'Wild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain DurisWild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain Duris  See more', 'Language': 'Unqualified, French (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'CTR21465DVD', 'Director': 'Laurent Tirard', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'January 22, 2008', 'Actors': 'Romain Duris, Fabrice Luchini, Laura Morante, Edouard Baer, Ludivine Sagnier', 'Subtitles': 'English, Spanish', 'Producers': 'Marc Missonnier, Olivier Delbosc', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: best movie since Shakespeare in Love but with a more authentic feel and better performances. Also my mother loves it and what Mom loves must be perfect. If you have a Mother (who loves Moliere) than you will know why this is the second copy of the film I bought since I fear - er I mean Mom wants to borrow mine all the time....\nReview Title: Awesome Movie for Moms.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/07/24\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Baz Luhrmann'], 'Producers': ['Tristram Miall'], 'Starring': ['Paul Mercurio', 'Tara Morice', 'Bill Hunter'], 'Studio': ['Paramount Pictures']}\nReview Text: I have this listed in my top ten favorite movies. Everything so well plotted and executed with such perfect timing. The juxtaposition of fantasy over reality, love versus control, new versus old. youth versus experience. The overriding message of inclusiveness culminating in one spectacular and stunning dances sequences that brings me up to my feet every time I see the movie. After I saw this movie, I went out and bought ballroom dancing quality shoes- I never found a ballroom dancing class, however. These days it is another unrealized dream until I watch the movie again.\nReview Title: A must see, feel good movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter: Complete 8-Film Collection\nReview Date: 2016/08/04\nStore: Daniel Radcliffe  (Actor),     Rupert Grint  (Actor)    Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Harry Potter: The Complete 8-Film Collection (BD).', 'Amazon.com', \"Harry Potter and the Sorcerer's Stone\", \"Here's an event movie that holds up to being an event. This filmed version of\", \"Harry Potter and the Sorcerer's Stone\", \", adapted from the wildly popular book by J.K. Rowling, stunningly brings to life Harry Potter's world of Hogwarts, the school for young witches and wizards. The greatest strength of the film comes from its faithfulness to the novel, and this new cinematic world is filled with all the details of Rowling's imagination, thanks to exuberant sets, elaborate costumes, clever makeup and visual effects, and a crème de la crème cast, including Maggie Smith, Richard Harris, Alan Rickman, and more. Especially fine is the interplay between Harry (Daniel Radcliffe) and his schoolmates Ron (Rupert Grint) and Hermione (Emma Watson), as well as his protector, the looming Hagrid (Robbie Coltrane). The second-half adventure--involving the titular sorcerer's stone--doesn't translate perfectly from page to screen, ultimately because of the film's fidelity to the novel; this is a case of making a movie for the book's fans, as opposed to a transcending film. Writer Steve Kloves and director Chris Columbus keep the spooks in check, making this a true family film, and with its resourceful hero wide-eyed and ready, one can't wait for Harry's return. Ages 8 and up.\", '--Doug Thomas', 'Harry Potter and the Chamber of Secrets', 'First sequels are the true test of an enduring movie franchise, and', 'Harry Potter and the Chamber of Secrets', 'passes with flying colors. Expanding upon the lavish sets, special effects, and grand adventure of', \"Harry Potter and the Sorcerer's Stone\", \", Harry's second year at Hogwarts School of Witchcraft and Wizardry involves a darker, more malevolent tale (parents with younger children beware), beginning with the petrified bodies of several Hogwarts students and magical clues leading Harry (Daniel Radcliffe), Ron (Rupert Grint), and Hermione (Emma Watson) to a 50-year-old mystery in the monster-laden Chamber of Secrets. House elves, squealing mandrakes, giant spiders, and venomous serpents populate this loyal adaptation (by\", \"Sorcerer's Stone\", \"director Chris Columbus and screenwriter Steve Kloves), and Kenneth Branagh delightfully tops the supreme supporting cast as the vainglorious charlatan Gilderoy Lockhart (be sure to view past the credits for a visual punchline at Lockhart's expense). At 161 minutes, the film suffers from lack of depth and uneven pacing, and John Williams' score mostly reprises established themes. The young, fast-growing cast offers ample compensation, however, as does the late Richard Harris in his final screen appearance as Professor Albus Dumbledore. Brimming with cleverness, wonderment, and big-budget splendor,\", 'Chamber', \"honors the legacy of J.K. Rowling's novels.\", '--Jeff Shannon', 'Harry Potter and the Prisoner of Azkaban', 'Some movie-loving wizards must have cast a magic spell on', 'Harry Potter and the Prisoner of Azkaban', \", because it's another grand slam for the Harry Potter franchise. Demonstrating remarkable versatility after the arthouse success of\", 'Y Tu Mamá También', \", director Alfonso Cuarón proves a perfect choice to guide Harry, Hermione, and Ron into treacherous puberty as the now 13-year-old students at Hogwarts School of Witchcraft and Wizardry face a new and daunting challenge: Sirius Black (Gary Oldman) has escaped from Azkaban prison, and for reasons yet unknown (unless, of course, you've read J.K. Rowling's book, considered by many to be the best in the series), he's after Harry in a bid for revenge. This dark and dangerous mystery drives the action while Harry (the fast-growing Daniel Radcliffe) and his third-year Hogwarts classmates discover the flying hippogriff Buckbeak (a marvelous CGI creature), the benevolent but enigmatic Professor Lupin (David Thewlis), horrifying black-robed Dementors, sneaky Peter Pettigrew (Timothy Spall), and the wonderful advantage of having a Time-Turner just when you need one. The familiar Hogwarts staff returns in fine form (including the delightful Michael Gambon, replacing the late Richard Harris as Dumbledore, and Emma Thompson as the goggle-eyed Sybil Trelawney), and even Julie Christie joins this prestigious production for a brief but welcome cameo. Technically dazzling, fast-paced, and chock-full of Rowling's boundless imagination (loyally adapted by ace screenwriter Steve Kloves),\", 'The Prisoner of Azkaban', 'is a Potter-movie classic.', '--Jeff Shannon', 'Harry Potter and the Goblet of Fire', 'The latest entry in the', 'Harry Potter', 'saga could be retitled', 'Fast Times at Hogwarts', \", where finding a date to the winter ball is nearly as terrifying as worrying about Lord Voldemort's return. Thus, the young wizards' entry into puberty (and discovery of the opposite sex) opens up a rich mining field to balance out the dark content in the fourth movie (and the stories are only going to get darker). Mike Newell (\", 'Four Weddings and a Funeral', \") handily takes the directing reins and eases his young cast through awkward growth spurts into true young actors. Harry (Daniel Radcliffe, more sure of himself) has his first girl crush on fellow student Cho Chang (Katie Leung), and has his first big fight with best bud Ron (Rupert Grint). Meanwhile, Ron's underlying romantic tension with Hermione (Emma Watson) comes to a head over the winter ball, and when she makes one of those girl-into-woman Cinderella entrances, the boys' reactions indicate they've all crossed a threshold.\", \"But don't worry, there's plenty of wizardry and action in\", 'Goblet of Fire', '. When the deadly Triwizard Tournament is hosted by Hogwarts, Harry finds his name mysteriously submitted (and chosen) to compete against wizards from two neighboring academies, as well as another Hogwarts student. The competition scenes are magnificently shot, with much-improved CGI effects (particularly the underwater challenge). And the climactic confrontation with Lord Voldemort (Ralph Fiennes, in a brilliant bit of casting) is the most thrilling yet.', 'Goblet', \", the first installment to get a PG-13 rating, contains some violence as well as disturbing images for kids and some barely shrouded references at sexual awakening (Harry's bath scene in particular). The 2 1/2-hour film, lean considering it came from a 734-page book, trims out subplots about house-elves (they're not missed) and gives little screen time to the standard crew of the other\", 'Potter', \"films, but adds in more of Britain's finest actors to the cast, such as Brendan Gleeson as Mad-Eye Moody and Miranda Richardson as Rita Skeeter. Michael Gambon, in his second round as Professor Dumbledore, still hasn't brought audiences around to his interpretation of the role he took over after Richard Harris died, but it's a small smudge in an otherwise spotless adaptation.\", '--Ellen A. Kim', 'Harry Potter and the Order of the Phoenix', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.\", \"Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper\", 'The Daily Prophet', 'to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.', \"This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a\", 'good', 'movie.', '--Jordan Thompson', 'Harry Potter and the Half-Blood Prince', 'The sixth installment of the', 'Harry Potter', 'series begins right where', 'The Order of the Phoenix', 'left off. The wizarding world is rocked by the news that \"He Who Must Not Be Named\" has truly returned, and the audience finally knows that Harry is \"the Chosen One\"--the only wizard who can defeat Lord Voldemort in the end. Dark forces loom around every corner, and now regularly attempt to penetrate the protected walls of Hogwarts School. This is no longer the fun and fascinating world of magic from the first few books—it\\'s dark, dangerous, and scary.', \"Harry (Daniel Radcliffe) suspects Draco Malfoy (Tom Felton) to be a new Death Eater recruit on a special mission for the Dark Lord. In the meantime, Professor Dumbledore (Michael Gambon) seems to have finally removed the shroud of secrecy from Harry about the dark path that lies ahead, and instead provides private lessons to get him prepared. It's in these intriguing scenes that the dark past of Tom Riddle (a.k.a. Voldemort) is finally revealed. The actors cast as the different young versions of Riddle (Hero Fiennes-Tiffin and Frank Dillane) do an eerily fantastic job of portraying the villain as a child. While the previous movies' many new characters could be slightly overwhelming, only one new key character is introduced this time: Professor Horace Slughorn (with a spot-on performance by Jim Broadbent). Within his mind he holds a key secret in the battle to defeat the Dark Lord, and Harry is tasked by Dumbledore to uncover a memory about Voldemort's darkest weapon--the Horcrux. Despite the long list of distractions, Harry, Ron (Rupert Grint), and Hermione (Emma Watson) still try to focus on being teenagers, and audiences will enjoy the budding awkward romances. All of the actors have developed nicely, giving their most convincing performances to date.\", 'More dramatic and significant things go down in this movie than any of its predecessors, and the stakes are higher than ever. The creators have been tasked with a practically impossible challenge, as fans of the beloved J.K. Rowling book series desperately want the movies to capture the magic of the books as closely as possible. Alas, the point at which one accepts that these two mediums are very different is the point at which one can truly enjoy these brilliant adaptations.', 'Harry Potter and the Half-Blood Prince', 'is no exception: it may be the best film yet. For those who have not read the book, nail-biting entertainment is guaranteed. For those who have, the movie does it justice. The key dramatic scenes, including the cave and the shocking twist in the final chapter, are executed very well. It does a perfect job of setting up the two-part grand finale that is to follow.', '--Jordan Thompson', 'Harry Potter and the Deathly Hallows, Part I', 'Harry Potter and the Deathly Hallows, Part I', 'is a brooding, slower-paced film than its predecessors, the result of being just one half of the final story (the last book in the series was split into two movies, released in theaters eight months apart). Because the penultimate film is all buildup before the final showdown between the teen wizard and the evil Voldemort (which does not occur until', 'The Deathly Hallows, Part II', '),', 'Part I', \"is a road-trip movie, a heist film, a lot of exposition, and more weight on its three young leads, who up until now were sufficiently supported by a revolving door of British Thespis throughout the series. Now that all the action takes place outside Hogwarts--no more Potions classes, Gryffindor scarves, or Quidditch matches--Daniel Radcliffe (Harry), Emma Watson (Hermione), and Rupert Grint (Ron) shoulder the film almost entirely on their own. After a near-fatal ambush by Voldemort's Death Eaters, the three embark on a quest to find and destroy the remaining five horcruxes (objects that store pieces of Voldemort's soul). Fortunately, as the story gets more grave--and parents should be warned, there are some scenes too frightening or adult for young children--so does the intensity. David Yates, who directed the Harry Potter films\", 'Order of the Phoenix', 'and', 'The Half-Blood Prince', ', drags the second half a little, but right along with some of the slower moments are some touching surprises (Harry leading Hermione in a dance, the return of Dobby in a totally non-annoying way).', 'Deathly Hallows, Part I', \"will be the most confusing for those not familiar with the Potter lore, particularly in the shorthand way characters and terminology weave in and out. For the rest of us, though, watching these characters over the last decade and saying farewell to a few faces makes it all bittersweet that the end is near (indeed, an early scene in which Hermione casts a spell that makes her Muggle parents forget her existence, in case she doesn't return, is particularly emotional). Despite its challenges,\", 'Deathly Hallows, Part I', \"succeeds in what it's most meant to do: whet your appetite for the grand conclusion to the Harry Potter series. --\", 'Ellen A. Kim', 'Harry Potter and the Deathly Hallows, Part II', 'The Deathly Hallows: Part 2', \"is the film all Harry Potter fans have waited 10 years to see, and the good news is that it's worth the hype--visually stunning, action packed, faithful to the book, and mature not just in its themes and emotion but in the acting by its cast, some of whom had spent half their lives making Harry Potter movies. Part 2 cuts right to the chase: Voldemort (Ralph Fiennes) has stolen the Elder Wand, one of the three objects required to give someone power over death (a.k.a. the Deathly Hallows), with the intent to hunt and kill Harry. Meanwhile, Harry's quest to destroy the rest of the Horcruxes (each containing a bit of Voldemort's soul) leads him first to a thrilling (and hilarious--love that Polyjuice Potion!) trip to Gringotts Bank, then back to Hogwarts, where a spectacular battle pitting the young students and professors (a showcase of the British thesps who have stolen every scene of the series: Maggie Smith's McGonagall, Jim Broadbent's Slughorn, David Thewlis's Lupin) against a dark army of Dementors, ogres, and Bellatrix Lestrange (Helena Bonham Carter, with far less crazy eyes to make this round). As predicted all throughout the saga, Harry also has his final showdown with Voldemort--neither can live while the other survives--though the physics of that predicament might need a set of crib notes to explain. But while each installment has become progressively grimmer, this finale is the most balanced between light and dark (the dark is\", 'quite', \"dark--several familiar characters die, with one significant death particularly grisly); the humor is sprinkled in at the most welcome times, thanks to the deft adaptation by Steve Kloves (who scribed all but one of the films from J.K. Rowling's books) and direction by four-time Potter director David Yates. The climactic kiss between Ron (Rupert Grint) and Hermione (Emma Watson), capping off a decade of romantic tension, is perfectly tuned to their idiosyncratic relationship, and Daniel Radcliffe has, over the last decade, certainly proven he was the right kid for the job all along. As Prof. Snape, the most perfect of casting choices in the best-cast franchise of all time, Alan Rickman breaks your heart. Only the epilogue (and the lack of chemistry between Harry and love Ginny Weasley, barely present here) stand a little shaky, but no matter: the most lucrative franchise in movie history to date has just reached its conclusion, and it's done so without losing its soul. --\", 'Ellen A. Kim']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Rupert Grint, Daniel Radcliffe, Emma Watson', 'Initial release date': '2018-08-27', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.12 Ounces', 'Item model number': 'WHV1000189967BR', 'Media Format': 'NTSC', 'Run time': '19 hours and 24 minutes', 'Release date': 'August 27, 2018', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: This would be perfect save there is no real menu system on the discs, I mean when you insert them, they just start the movie- of course, could just be something the Xbox One does, but I had to top menu and search for even the most basic settings. Still, they all play nicely and you can't wrong if you love Hermoine Granger - I mean Harry Potter, of course. If I had to do it over again, I would have gotten the multiformat set instead as I would like to watch them in my van late at night with Allison and Ellie - although I could use the PS3 on the van's RCA interface. It's cozy and the screen in small but it's cozy and being locked in a van with the people you love sounds great until someone has to go to the bathroom.<br />Outside of the weird menu UI - it is more compact than juggling multiple cases and memorabilia- unless you like showing off your elder wand and butter beer stein between disks. Then,by all means, get robed up and go around exclaim spells and picking on house elfs...or not. Ellie says that we should make the elves polka-dot socks to wear- I suspect she knows that Allison is secretly annoyed by the idea of polka dots socks though. I assure them both Hermoine wouldn't hear of any such foolishness. I would have preferred that she and Harry could have had the relationship instead though but I respect that the story writes itself.\nReview Title: great set bad menu, expelliarmus stratagem or something!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/08/05\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Allison Abbate', 'Des McAnuff'], 'Starring': ['Jennifer Aniston', 'Harry Connick', 'Jr.', 'Vin Diesel'], 'Studio': ['WARNER BROS.']}\nReview Text: Yeah, Yeah, Fantasia is all that. but Vin Deisel give a spectacular performance and the story is more relatable then Disneys interpretation of a symphony with one little mouse version of the sorcerer's apprentice. I love the Iron Giant, so fight me.\nReview Title: One of the Best Animated Movie ever Made\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Legend (2-Disc Limited Edition) [Blu-ray]\nReview Date: 2021/12/02\nStore: Tom Cruise  (Actor),     Mia Sara  (Actor),     Ridley Scott  (Director)    &                   0                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'After changing the face of science fiction cinema forever with Alien and Blade Runner, director Ridley Scott turned his visionary eye to the fantasy genre, teaming with writer William Hjortsberg (Angel Heart) to create a breathtaking cinematic fairytale with one of the screen’s most astonishingly rendered depictions of Evil.', 'In an idyllic, sun-dappled forest, the pure-hearted Jack (Tom Cruise) takes his true love Princess Lili (Mia Sara) to see a pair of unicorns frolicking at the forest’s edge. Little do they know that the Lord of Darkness (Tim Curry, in a remarkable make-up designed by The Thing’s Rob Bottin) has dispatched his minions to capture the unicorns and sever their horns so that he may plunge the world into everlasting night. After Lili and the unicorns are taken prisoner, Jack must team with a group of forest creatures and descend into Darkness’ subterranean lair to face off against the devilish creature before it is too late.', \"Despite a troubled production in which the elaborate full-size forest set was accidentally incinerated and a lengthy post-production that resulted in multiple versions of the film (with competing music scores by Jerry Goldsmith and Tangerine Dream), Legend has since been restored to Scott's original cut and embraced by generations of film fans eager to see a master director’s unique vision of a world beyond our imagination.\", 'LIMITED EDITION CONTENTS', 'High Definition (1080p) Blu-ray presentations of the U.S. Theatrical Cut and the Director’s Cut', 'High Definition (1080p) Blu-ray presentations of the U.S. Theatrical Cut and the Director’s Cut', 'DTS-HD MA 5.1 and 2.0 stereo audio on both cuts', 'DTS-HD MA 5.1 and 2.0 stereo audio on both cuts', 'Optional English subtitles for the deaf and hard of hearing on both cuts', 'Optional English subtitles for the deaf and hard of hearing on both cuts', \"Illustrated perfect-bound book with new writing by Nicholas Clement and Kat Ellinger and archive materials including production notes and a 2002 interview with Charles de Lauzirika about the restoration of the Director's Cut\", \"Illustrated perfect-bound book with new writing by Nicholas Clement and Kat Ellinger and archive materials including production notes and a 2002 interview with Charles de Lauzirika about the restoration of the Director's Cut\", 'Large double-sided poster with newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Large double-sided poster with newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Glossy full-color portraits of the cast photographed by Annie Leibovitz', 'Glossy full-color portraits of the cast photographed by Annie Leibovitz', 'Six double-sided postcard-sized lobby card reproductions', 'Six double-sided postcard-sized lobby card reproductions', 'Reversible sleeve featuring newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Reversible sleeve featuring newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'DISC 1: US THEATRICAL CUT', 'New 2K restoration of the US Theatrical Cut from original materials including a 4K scan of the original negative', 'New 2K restoration of the US Theatrical Cut from original materials including a 4K scan of the original negative', 'New commentary by Paul M. Sammon author of Ridley Scott: The Making of His Movies', 'New commentary by Paul M. Sammon author of Ridley Scott: The Making of His Movies', '2002 Reconstructed isolated score by Tangerine Dream', '2002 Reconstructed isolated score by Tangerine Dream', 'Isolated music and effects track', 'Isolated music and effects track', 'A Fairytale in Pinewood, new featurette interviewing grip David Cadwalladr, costume designer Charles Knode, co-star Annabelle Lanyon, camera operator Peter MacDonald, set decorator Ann Mollo and draftsman John Ralph', 'A Fairytale in Pinewood, new featurette interviewing grip David Cadwalladr, costume designer Charles Knode, co-star Annabelle Lanyon, camera operator Peter MacDonald, set decorator Ann Mollo and draftsman John Ralph', 'Incarnations of a Legend, comparison featurette written and narrated by critic Travis Crawford', 'Incarnations of a Legend, comparison featurette written and narrated by critic Travis Crawford', 'The Directors: Ridley Scott, 2003 documentary where the director discusses his career, including Legend', 'The Directors: Ridley Scott, 2003 documentary where the director discusses his career, including Legend', '“Is Your Love Strong Enough?” music video by Bryan Ferry', '“Is Your Love Strong Enough?” music video by Bryan Ferry', 'DISC 2: DIRECTOR’S CUT', 'Commentary by Ridley Scott', 'Commentary by Ridley Scott', 'Creating A Myth: Memories of Legend, a 2002 documentary with interviews with Ridley Scott, William Hjortsberg, Mia Sara, Tim Curry, Rob Bottin and others', 'Creating A Myth: Memories of Legend, a 2002 documentary with interviews with Ridley Scott, William Hjortsberg, Mia Sara, Tim Curry, Rob Bottin and others', 'Original promotional featurette', 'Original promotional featurette', \"Alternate 'Four Goblins' opening and 'The Fairie Dance' deleted scene\", \"Alternate 'Four Goblins' opening and 'The Fairie Dance' deleted scene\", 'Storyboard galleries for three deleted scenes', 'Storyboard galleries for three deleted scenes', \"Two drafts of William Hjortsberg's screenplay\", \"Two drafts of William Hjortsberg's screenplay\", 'Alternate footage from the overseas release plus textless footage', 'Alternate footage from the overseas release plus textless footage', 'Trailers and TV spots', 'Trailers and TV spots', 'Still galleries', 'Still galleries', '*EXTRAS STILL IN PRODUCTION AND SUBJECT TO CHANGE*', 'Review', 'Legend is an impressive technical achievement. Scott is a perfectionist who takes infinite pains to make things look right.', 'Roger Ebert, Chicago Sun-Times', \"Legend is still so much fun to watch. It's a visual feast, a truly grim fairy tale.\", 'Jessica Mason, The Mary Sue', 'A sumptuous, richly colored feast', 'Kevin Thomas, Los Angeles Times', 'Tim Curry is magnificent!', 'Geoff Andrew, Time Out', 'Legend is a gothic fairy tale brought to life', 'Ed Gonzalez, Slant', \"The sets, makeup and photography in Ridley Scott's contribution to the fantasy cycle are awesome. --Sky Cinema\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action-Fantasy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Mia Sara, Alice Playten, Ridley Scott, Tim Curry, Billy Barty, Robert Picardo, Tom Cruise', 'Runtime': '1 hour and 34 minutes', 'Product Dimensions': '5.35 x 7.13 x 1.26 inches; 5.92 Ounces', 'Director': 'Ridley Scott', 'Media Format': 'NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 12, 2021', 'Actors': 'Tom Cruise, Mia Sara, Tim Curry, Billy Barty, Robert Picardo', 'Studio': 'Arrow Video', 'Number of discs': '2'}\nReview Text: Tim Curry in 4K, need I say more?<br />Tom is good too and Jennifer.<br />But the Devil's own in UHD wow\nReview Title: the Best made Better in 4K\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Dark Crystal [4K UHD + Blu-ray]\nReview Date: 2022/02/19\nStore: Jim Henson  (Actor, Director, Producer),     Kathryn Mullen  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: [\"In another time, The Dark Crystal - a source of Balance and Truth in the Universe - was shattered, dividing the world into two factions: the wicked Skeksis and the peaceful Mystics. Now, as the convergence of the three suns approaches, the Crystal must be healed, or darkness will reign forevermore! It's up to Jen - the last of his race - to fulfill the prophecy that a Gelfling will return the missing shard to the Crystal and destroy the Skeksis' evil Empire. But will young Jen's courage be any match for the unknown dangers that await him? Revisit this masterful fantasy epic from the brilliant imagination of Jim Henson.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Sci-Fi, Family', 'Format': 'Blu-ray, 4K', 'Contributor': 'Jim Henson, Kathryn Mullen, ITC Entertainment Group DBA Polygram, Frank Oz, Gary Kurtz', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Digital Copy Expiration Date': 'December 31, 2020', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'Frank Oz, Jim Henson', 'Media Format': 'Blu-ray, 4K', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 6, 2018', 'Actors': 'Jim Henson, Kathryn Mullen, Frank Oz', 'Dubbed': 'Italian, Hungarian, French, Spanish, Czech, Japanese, Portuguese, German', 'Subtitles': 'Dutch, Hungarian, Norwegian, Czech, Slovene, Korean, Thai, Mandarin Chinese, Icelandic, Finnish, German, Italian, Swedish, English, Danish, Portuguese, Japanese, Bulgarian, French, Croatian, Polish, Turkish, Spanish, Greek, Slovak, Hebrew', 'Producers': 'Jim Henson, Gary Kurtz', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: wonderful upgrade to a classic movie and yes the Skeksis wins, yessssssss\nReview Title: The Skeksis made me give this 5 stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2022/11/14\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lance Bangs', 'Adam Scott'], 'Producers': ['Adam Scott', 'Paul Scheer', 'Naomi Scott', 'Kara Scobey Brown', 'Hend Baghdady', 'Keith Crofford', 'Ollie Green', 'Justin Moritt', 'Liz Beebe'], 'Studio': ['[adult swim]']}\nReview Text: Show has Pythonesque aspirations, but fall a long way short of funny with only some chuckle some moments, many of the jokes fall short and are overdone.\nReview Title: Dull, tedious and kind of dumb\nRating: 3.0\n--------------------------------------------------",
  "reference": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Hit Movies']}\nWhen my Blu-Ray Disc from netflix wouldn't play I turned to streaming and grabbed this movie. The stream ran without any real buffering and I was happy with bitrate, picture and sound.<br />The movie itself, is enjoyable with good plot points and action<br />There are several plot holes and continuity errors- pretty standard for action movies and Tom Cruise's performance is not as good as it could be.<br />The script is tight but does not grab your emotions very firmly. The supporting cast is really what makes up for any lack you feel in the tug of the plot or main character.<br />Overall I enjoyed it. Not enough to want to own it or even watch it again unless it was on TV and the choice came down to it and Duck Dynasty.\nBetter than I expected\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Constantine Makris', 'Matt Earl Beesley', 'Jamie Babbit', 'Ed Bianchi', 'Stephen Hopkins'], 'Producers': ['Bob DeLaurentis', \"Peter O'Fallon\", 'Noah Hawley'], 'Studio': ['ABC Network']}\nI had my doubts, but I loved the cast pretty much from the get go. The show has smart dialogue and crazy &#34;night court&#34; plot twists. The surprise of the show is while you are looking for humor and actionb you are getting emotion from the acting and situations. It's not melodrama as much as you start to care for the characters even the ones who have despicable pasts. I would highly recommend this show if you like The Glades, or The Finder\nthis is a fresh show filled with smart humor\nInkheart (+ BD-Live) [Blu-ray]\nBrendan Fraser  (Actor),     Paul Bettany  (Actor),     Iain Softley  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Inkheart (Blu-ray)', 'When Mo Folchart reads a story, the characters leap off the page. Literally. And that’s a problem. Mo must somehow use his special powers to send the interlopers back to their world…and save ours. If ever a task was easier read than done, this is it. Mo and his daughter Meggie, aided by friends real and fictional, plunge into a thrilling quest that pits them against diabolical villains, fantastic beasts and dangers at every turn. Brendan Fraser (The Mummy films, Journey to the Center of the Earth) leads a splendid cast (including Academy Award winners* Helen Mirren and Jim Broadbent) in an all-fun, all-family film of Cornelia Funke’s bestseller. Follow Mo and Meggie into adventure more exciting than any ever read. Because it’s adventure they’re going to live!', ']]>']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Contributor': 'Rafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna GuilloryRafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna Guillory  See more', 'Language': 'German (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '6.7 x 5.3 x 0.5 inches; 3.2 Ounces', 'Director': 'Iain Softley', 'Media Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Run time': '1 hour and 46 minutes', 'Release date': 'June 23, 2009', 'Actors': 'Brendan Fraser, Paul Bettany, Helen Mirren, Jim Broadbent, Andy Serkis', 'Dubbed': 'English, German', 'Subtitles': 'English, Spanish, German', 'Studio': 'New Line Home Entertainment', 'Number of discs': '1'}\nI watched this movie with some trepidation since Brandon Frazier has not had good reviews in a long time. What I got was a good cohesive story with enough mystery that if it had been a book I would have continued turning the pages until I learned all of its secrets. There were some scenes that just went to fast and I felt like there could have been more there. The Blu-ray has lots of features that make this worth owning, the menus are exquisite and painstakingly down, superb work.\nA real surprise\nMoliere\nRomain Duris  (Actor),     Fabrice Luchini  (Actor),     Laurent Tirard  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Bubbling with wit, stellar performances and lavish cinematography, MOLIÈRE stars multi-Cesar(r)-nominated French actor Romain Duris as Molière, a down-and-out actor-cum-playwright up to his ears in debt. When the wealthy Jourdain (Cesar(r)-winner Fabrice Luchini) offers to cover that debt (so that Molière's theatrical talents might help Jourdain win the heart of a certain widowed marquise), hilarity ensues. Disguised as a priest, Molière becomes a guest in Jourdain's palace on the pretext of teaching Jourdain the craft of the stage, which annoys his wife, Elmire. But, soon after, the confrontation between Elmire and Molière turns seductive. Too busy to notice, Jourdain enlists the aid of a well connected and scheming acquaintance, to help him pursue the young widow. Romantic yearning, human foibles and laughs galore all characterize MOLIÈRE, a delightful film that slyly captures your heart.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Contributor': 'Wild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain DurisWild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain Duris  See more', 'Language': 'Unqualified, French (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'CTR21465DVD', 'Director': 'Laurent Tirard', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'January 22, 2008', 'Actors': 'Romain Duris, Fabrice Luchini, Laura Morante, Edouard Baer, Ludivine Sagnier', 'Subtitles': 'English, Spanish', 'Producers': 'Marc Missonnier, Olivier Delbosc', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nbest movie since Shakespeare in Love but with a more authentic feel and better performances. Also my mother loves it and what Mom loves must be perfect. If you have a Mother (who loves Moliere) than you will know why this is the second copy of the film I bought since I fear - er I mean Mom wants to borrow mine all the time....\nAwesome Movie for Moms.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Baz Luhrmann'], 'Producers': ['Tristram Miall'], 'Starring': ['Paul Mercurio', 'Tara Morice', 'Bill Hunter'], 'Studio': ['Paramount Pictures']}\nI have this listed in my top ten favorite movies. Everything so well plotted and executed with such perfect timing. The juxtaposition of fantasy over reality, love versus control, new versus old. youth versus experience. The overriding message of inclusiveness culminating in one spectacular and stunning dances sequences that brings me up to my feet every time I see the movie. After I saw this movie, I went out and bought ballroom dancing quality shoes- I never found a ballroom dancing class, however. These days it is another unrealized dream until I watch the movie again.\nA must see, feel good movie.\nHarry Potter: Complete 8-Film Collection\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Harry Potter: The Complete 8-Film Collection (BD).', 'Amazon.com', \"Harry Potter and the Sorcerer's Stone\", \"Here's an event movie that holds up to being an event. This filmed version of\", \"Harry Potter and the Sorcerer's Stone\", \", adapted from the wildly popular book by J.K. Rowling, stunningly brings to life Harry Potter's world of Hogwarts, the school for young witches and wizards. The greatest strength of the film comes from its faithfulness to the novel, and this new cinematic world is filled with all the details of Rowling's imagination, thanks to exuberant sets, elaborate costumes, clever makeup and visual effects, and a crème de la crème cast, including Maggie Smith, Richard Harris, Alan Rickman, and more. Especially fine is the interplay between Harry (Daniel Radcliffe) and his schoolmates Ron (Rupert Grint) and Hermione (Emma Watson), as well as his protector, the looming Hagrid (Robbie Coltrane). The second-half adventure--involving the titular sorcerer's stone--doesn't translate perfectly from page to screen, ultimately because of the film's fidelity to the novel; this is a case of making a movie for the book's fans, as opposed to a transcending film. Writer Steve Kloves and director Chris Columbus keep the spooks in check, making this a true family film, and with its resourceful hero wide-eyed and ready, one can't wait for Harry's return. Ages 8 and up.\", '--Doug Thomas', 'Harry Potter and the Chamber of Secrets', 'First sequels are the true test of an enduring movie franchise, and', 'Harry Potter and the Chamber of Secrets', 'passes with flying colors. Expanding upon the lavish sets, special effects, and grand adventure of', \"Harry Potter and the Sorcerer's Stone\", \", Harry's second year at Hogwarts School of Witchcraft and Wizardry involves a darker, more malevolent tale (parents with younger children beware), beginning with the petrified bodies of several Hogwarts students and magical clues leading Harry (Daniel Radcliffe), Ron (Rupert Grint), and Hermione (Emma Watson) to a 50-year-old mystery in the monster-laden Chamber of Secrets. House elves, squealing mandrakes, giant spiders, and venomous serpents populate this loyal adaptation (by\", \"Sorcerer's Stone\", \"director Chris Columbus and screenwriter Steve Kloves), and Kenneth Branagh delightfully tops the supreme supporting cast as the vainglorious charlatan Gilderoy Lockhart (be sure to view past the credits for a visual punchline at Lockhart's expense). At 161 minutes, the film suffers from lack of depth and uneven pacing, and John Williams' score mostly reprises established themes. The young, fast-growing cast offers ample compensation, however, as does the late Richard Harris in his final screen appearance as Professor Albus Dumbledore. Brimming with cleverness, wonderment, and big-budget splendor,\", 'Chamber', \"honors the legacy of J.K. Rowling's novels.\", '--Jeff Shannon', 'Harry Potter and the Prisoner of Azkaban', 'Some movie-loving wizards must have cast a magic spell on', 'Harry Potter and the Prisoner of Azkaban', \", because it's another grand slam for the Harry Potter franchise. Demonstrating remarkable versatility after the arthouse success of\", 'Y Tu Mamá También', \", director Alfonso Cuarón proves a perfect choice to guide Harry, Hermione, and Ron into treacherous puberty as the now 13-year-old students at Hogwarts School of Witchcraft and Wizardry face a new and daunting challenge: Sirius Black (Gary Oldman) has escaped from Azkaban prison, and for reasons yet unknown (unless, of course, you've read J.K. Rowling's book, considered by many to be the best in the series), he's after Harry in a bid for revenge. This dark and dangerous mystery drives the action while Harry (the fast-growing Daniel Radcliffe) and his third-year Hogwarts classmates discover the flying hippogriff Buckbeak (a marvelous CGI creature), the benevolent but enigmatic Professor Lupin (David Thewlis), horrifying black-robed Dementors, sneaky Peter Pettigrew (Timothy Spall), and the wonderful advantage of having a Time-Turner just when you need one. The familiar Hogwarts staff returns in fine form (including the delightful Michael Gambon, replacing the late Richard Harris as Dumbledore, and Emma Thompson as the goggle-eyed Sybil Trelawney), and even Julie Christie joins this prestigious production for a brief but welcome cameo. Technically dazzling, fast-paced, and chock-full of Rowling's boundless imagination (loyally adapted by ace screenwriter Steve Kloves),\", 'The Prisoner of Azkaban', 'is a Potter-movie classic.', '--Jeff Shannon', 'Harry Potter and the Goblet of Fire', 'The latest entry in the', 'Harry Potter', 'saga could be retitled', 'Fast Times at Hogwarts', \", where finding a date to the winter ball is nearly as terrifying as worrying about Lord Voldemort's return. Thus, the young wizards' entry into puberty (and discovery of the opposite sex) opens up a rich mining field to balance out the dark content in the fourth movie (and the stories are only going to get darker). Mike Newell (\", 'Four Weddings and a Funeral', \") handily takes the directing reins and eases his young cast through awkward growth spurts into true young actors. Harry (Daniel Radcliffe, more sure of himself) has his first girl crush on fellow student Cho Chang (Katie Leung), and has his first big fight with best bud Ron (Rupert Grint). Meanwhile, Ron's underlying romantic tension with Hermione (Emma Watson) comes to a head over the winter ball, and when she makes one of those girl-into-woman Cinderella entrances, the boys' reactions indicate they've all crossed a threshold.\", \"But don't worry, there's plenty of wizardry and action in\", 'Goblet of Fire', '. When the deadly Triwizard Tournament is hosted by Hogwarts, Harry finds his name mysteriously submitted (and chosen) to compete against wizards from two neighboring academies, as well as another Hogwarts student. The competition scenes are magnificently shot, with much-improved CGI effects (particularly the underwater challenge). And the climactic confrontation with Lord Voldemort (Ralph Fiennes, in a brilliant bit of casting) is the most thrilling yet.', 'Goblet', \", the first installment to get a PG-13 rating, contains some violence as well as disturbing images for kids and some barely shrouded references at sexual awakening (Harry's bath scene in particular). The 2 1/2-hour film, lean considering it came from a 734-page book, trims out subplots about house-elves (they're not missed) and gives little screen time to the standard crew of the other\", 'Potter', \"films, but adds in more of Britain's finest actors to the cast, such as Brendan Gleeson as Mad-Eye Moody and Miranda Richardson as Rita Skeeter. Michael Gambon, in his second round as Professor Dumbledore, still hasn't brought audiences around to his interpretation of the role he took over after Richard Harris died, but it's a small smudge in an otherwise spotless adaptation.\", '--Ellen A. Kim', 'Harry Potter and the Order of the Phoenix', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.\", \"Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper\", 'The Daily Prophet', 'to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.', \"This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a\", 'good', 'movie.', '--Jordan Thompson', 'Harry Potter and the Half-Blood Prince', 'The sixth installment of the', 'Harry Potter', 'series begins right where', 'The Order of the Phoenix', 'left off. The wizarding world is rocked by the news that \"He Who Must Not Be Named\" has truly returned, and the audience finally knows that Harry is \"the Chosen One\"--the only wizard who can defeat Lord Voldemort in the end. Dark forces loom around every corner, and now regularly attempt to penetrate the protected walls of Hogwarts School. This is no longer the fun and fascinating world of magic from the first few books—it\\'s dark, dangerous, and scary.', \"Harry (Daniel Radcliffe) suspects Draco Malfoy (Tom Felton) to be a new Death Eater recruit on a special mission for the Dark Lord. In the meantime, Professor Dumbledore (Michael Gambon) seems to have finally removed the shroud of secrecy from Harry about the dark path that lies ahead, and instead provides private lessons to get him prepared. It's in these intriguing scenes that the dark past of Tom Riddle (a.k.a. Voldemort) is finally revealed. The actors cast as the different young versions of Riddle (Hero Fiennes-Tiffin and Frank Dillane) do an eerily fantastic job of portraying the villain as a child. While the previous movies' many new characters could be slightly overwhelming, only one new key character is introduced this time: Professor Horace Slughorn (with a spot-on performance by Jim Broadbent). Within his mind he holds a key secret in the battle to defeat the Dark Lord, and Harry is tasked by Dumbledore to uncover a memory about Voldemort's darkest weapon--the Horcrux. Despite the long list of distractions, Harry, Ron (Rupert Grint), and Hermione (Emma Watson) still try to focus on being teenagers, and audiences will enjoy the budding awkward romances. All of the actors have developed nicely, giving their most convincing performances to date.\", 'More dramatic and significant things go down in this movie than any of its predecessors, and the stakes are higher than ever. The creators have been tasked with a practically impossible challenge, as fans of the beloved J.K. Rowling book series desperately want the movies to capture the magic of the books as closely as possible. Alas, the point at which one accepts that these two mediums are very different is the point at which one can truly enjoy these brilliant adaptations.', 'Harry Potter and the Half-Blood Prince', 'is no exception: it may be the best film yet. For those who have not read the book, nail-biting entertainment is guaranteed. For those who have, the movie does it justice. The key dramatic scenes, including the cave and the shocking twist in the final chapter, are executed very well. It does a perfect job of setting up the two-part grand finale that is to follow.', '--Jordan Thompson', 'Harry Potter and the Deathly Hallows, Part I', 'Harry Potter and the Deathly Hallows, Part I', 'is a brooding, slower-paced film than its predecessors, the result of being just one half of the final story (the last book in the series was split into two movies, released in theaters eight months apart). Because the penultimate film is all buildup before the final showdown between the teen wizard and the evil Voldemort (which does not occur until', 'The Deathly Hallows, Part II', '),', 'Part I', \"is a road-trip movie, a heist film, a lot of exposition, and more weight on its three young leads, who up until now were sufficiently supported by a revolving door of British Thespis throughout the series. Now that all the action takes place outside Hogwarts--no more Potions classes, Gryffindor scarves, or Quidditch matches--Daniel Radcliffe (Harry), Emma Watson (Hermione), and Rupert Grint (Ron) shoulder the film almost entirely on their own. After a near-fatal ambush by Voldemort's Death Eaters, the three embark on a quest to find and destroy the remaining five horcruxes (objects that store pieces of Voldemort's soul). Fortunately, as the story gets more grave--and parents should be warned, there are some scenes too frightening or adult for young children--so does the intensity. David Yates, who directed the Harry Potter films\", 'Order of the Phoenix', 'and', 'The Half-Blood Prince', ', drags the second half a little, but right along with some of the slower moments are some touching surprises (Harry leading Hermione in a dance, the return of Dobby in a totally non-annoying way).', 'Deathly Hallows, Part I', \"will be the most confusing for those not familiar with the Potter lore, particularly in the shorthand way characters and terminology weave in and out. For the rest of us, though, watching these characters over the last decade and saying farewell to a few faces makes it all bittersweet that the end is near (indeed, an early scene in which Hermione casts a spell that makes her Muggle parents forget her existence, in case she doesn't return, is particularly emotional). Despite its challenges,\", 'Deathly Hallows, Part I', \"succeeds in what it's most meant to do: whet your appetite for the grand conclusion to the Harry Potter series. --\", 'Ellen A. Kim', 'Harry Potter and the Deathly Hallows, Part II', 'The Deathly Hallows: Part 2', \"is the film all Harry Potter fans have waited 10 years to see, and the good news is that it's worth the hype--visually stunning, action packed, faithful to the book, and mature not just in its themes and emotion but in the acting by its cast, some of whom had spent half their lives making Harry Potter movies. Part 2 cuts right to the chase: Voldemort (Ralph Fiennes) has stolen the Elder Wand, one of the three objects required to give someone power over death (a.k.a. the Deathly Hallows), with the intent to hunt and kill Harry. Meanwhile, Harry's quest to destroy the rest of the Horcruxes (each containing a bit of Voldemort's soul) leads him first to a thrilling (and hilarious--love that Polyjuice Potion!) trip to Gringotts Bank, then back to Hogwarts, where a spectacular battle pitting the young students and professors (a showcase of the British thesps who have stolen every scene of the series: Maggie Smith's McGonagall, Jim Broadbent's Slughorn, David Thewlis's Lupin) against a dark army of Dementors, ogres, and Bellatrix Lestrange (Helena Bonham Carter, with far less crazy eyes to make this round). As predicted all throughout the saga, Harry also has his final showdown with Voldemort--neither can live while the other survives--though the physics of that predicament might need a set of crib notes to explain. But while each installment has become progressively grimmer, this finale is the most balanced between light and dark (the dark is\", 'quite', \"dark--several familiar characters die, with one significant death particularly grisly); the humor is sprinkled in at the most welcome times, thanks to the deft adaptation by Steve Kloves (who scribed all but one of the films from J.K. Rowling's books) and direction by four-time Potter director David Yates. The climactic kiss between Ron (Rupert Grint) and Hermione (Emma Watson), capping off a decade of romantic tension, is perfectly tuned to their idiosyncratic relationship, and Daniel Radcliffe has, over the last decade, certainly proven he was the right kid for the job all along. As Prof. Snape, the most perfect of casting choices in the best-cast franchise of all time, Alan Rickman breaks your heart. Only the epilogue (and the lack of chemistry between Harry and love Ginny Weasley, barely present here) stand a little shaky, but no matter: the most lucrative franchise in movie history to date has just reached its conclusion, and it's done so without losing its soul. --\", 'Ellen A. Kim']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Rupert Grint, Daniel Radcliffe, Emma Watson', 'Initial release date': '2018-08-27', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.12 Ounces', 'Item model number': 'WHV1000189967BR', 'Media Format': 'NTSC', 'Run time': '19 hours and 24 minutes', 'Release date': 'August 27, 2018', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nThis would be perfect save there is no real menu system on the discs, I mean when you insert them, they just start the movie- of course, could just be something the Xbox One does, but I had to top menu and search for even the most basic settings. Still, they all play nicely and you can't wrong if you love Hermoine Granger - I mean Harry Potter, of course. If I had to do it over again, I would have gotten the multiformat set instead as I would like to watch them in my van late at night with Allison and Ellie - although I could use the PS3 on the van's RCA interface. It's cozy and the screen in small but it's cozy and being locked in a van with the people you love sounds great until someone has to go to the bathroom.<br />Outside of the weird menu UI - it is more compact than juggling multiple cases and memorabilia- unless you like showing off your elder wand and butter beer stein between disks. Then,by all means, get robed up and go around exclaim spells and picking on house elfs...or not. Ellie says that we should make the elves polka-dot socks to wear- I suspect she knows that Allison is secretly annoyed by the idea of polka dots socks though. I assure them both Hermoine wouldn't hear of any such foolishness. I would have preferred that she and Harry could have had the relationship instead though but I respect that the story writes itself.\ngreat set bad menu, expelliarmus stratagem or something!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Allison Abbate', 'Des McAnuff'], 'Starring': ['Jennifer Aniston', 'Harry Connick', 'Jr.', 'Vin Diesel'], 'Studio': ['WARNER BROS.']}\nYeah, Yeah, Fantasia is all that. but Vin Deisel give a spectacular performance and the story is more relatable then Disneys interpretation of a symphony with one little mouse version of the sorcerer's apprentice. I love the Iron Giant, so fight me.\nOne of the Best Animated Movie ever Made\nLegend (2-Disc Limited Edition) [Blu-ray]\nTom Cruise  (Actor),     Mia Sara  (Actor),     Ridley Scott  (Director)    &                   0                  more   Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'After changing the face of science fiction cinema forever with Alien and Blade Runner, director Ridley Scott turned his visionary eye to the fantasy genre, teaming with writer William Hjortsberg (Angel Heart) to create a breathtaking cinematic fairytale with one of the screen’s most astonishingly rendered depictions of Evil.', 'In an idyllic, sun-dappled forest, the pure-hearted Jack (Tom Cruise) takes his true love Princess Lili (Mia Sara) to see a pair of unicorns frolicking at the forest’s edge. Little do they know that the Lord of Darkness (Tim Curry, in a remarkable make-up designed by The Thing’s Rob Bottin) has dispatched his minions to capture the unicorns and sever their horns so that he may plunge the world into everlasting night. After Lili and the unicorns are taken prisoner, Jack must team with a group of forest creatures and descend into Darkness’ subterranean lair to face off against the devilish creature before it is too late.', \"Despite a troubled production in which the elaborate full-size forest set was accidentally incinerated and a lengthy post-production that resulted in multiple versions of the film (with competing music scores by Jerry Goldsmith and Tangerine Dream), Legend has since been restored to Scott's original cut and embraced by generations of film fans eager to see a master director’s unique vision of a world beyond our imagination.\", 'LIMITED EDITION CONTENTS', 'High Definition (1080p) Blu-ray presentations of the U.S. Theatrical Cut and the Director’s Cut', 'High Definition (1080p) Blu-ray presentations of the U.S. Theatrical Cut and the Director’s Cut', 'DTS-HD MA 5.1 and 2.0 stereo audio on both cuts', 'DTS-HD MA 5.1 and 2.0 stereo audio on both cuts', 'Optional English subtitles for the deaf and hard of hearing on both cuts', 'Optional English subtitles for the deaf and hard of hearing on both cuts', \"Illustrated perfect-bound book with new writing by Nicholas Clement and Kat Ellinger and archive materials including production notes and a 2002 interview with Charles de Lauzirika about the restoration of the Director's Cut\", \"Illustrated perfect-bound book with new writing by Nicholas Clement and Kat Ellinger and archive materials including production notes and a 2002 interview with Charles de Lauzirika about the restoration of the Director's Cut\", 'Large double-sided poster with newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Large double-sided poster with newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Glossy full-color portraits of the cast photographed by Annie Leibovitz', 'Glossy full-color portraits of the cast photographed by Annie Leibovitz', 'Six double-sided postcard-sized lobby card reproductions', 'Six double-sided postcard-sized lobby card reproductions', 'Reversible sleeve featuring newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Reversible sleeve featuring newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'DISC 1: US THEATRICAL CUT', 'New 2K restoration of the US Theatrical Cut from original materials including a 4K scan of the original negative', 'New 2K restoration of the US Theatrical Cut from original materials including a 4K scan of the original negative', 'New commentary by Paul M. Sammon author of Ridley Scott: The Making of His Movies', 'New commentary by Paul M. Sammon author of Ridley Scott: The Making of His Movies', '2002 Reconstructed isolated score by Tangerine Dream', '2002 Reconstructed isolated score by Tangerine Dream', 'Isolated music and effects track', 'Isolated music and effects track', 'A Fairytale in Pinewood, new featurette interviewing grip David Cadwalladr, costume designer Charles Knode, co-star Annabelle Lanyon, camera operator Peter MacDonald, set decorator Ann Mollo and draftsman John Ralph', 'A Fairytale in Pinewood, new featurette interviewing grip David Cadwalladr, costume designer Charles Knode, co-star Annabelle Lanyon, camera operator Peter MacDonald, set decorator Ann Mollo and draftsman John Ralph', 'Incarnations of a Legend, comparison featurette written and narrated by critic Travis Crawford', 'Incarnations of a Legend, comparison featurette written and narrated by critic Travis Crawford', 'The Directors: Ridley Scott, 2003 documentary where the director discusses his career, including Legend', 'The Directors: Ridley Scott, 2003 documentary where the director discusses his career, including Legend', '“Is Your Love Strong Enough?” music video by Bryan Ferry', '“Is Your Love Strong Enough?” music video by Bryan Ferry', 'DISC 2: DIRECTOR’S CUT', 'Commentary by Ridley Scott', 'Commentary by Ridley Scott', 'Creating A Myth: Memories of Legend, a 2002 documentary with interviews with Ridley Scott, William Hjortsberg, Mia Sara, Tim Curry, Rob Bottin and others', 'Creating A Myth: Memories of Legend, a 2002 documentary with interviews with Ridley Scott, William Hjortsberg, Mia Sara, Tim Curry, Rob Bottin and others', 'Original promotional featurette', 'Original promotional featurette', \"Alternate 'Four Goblins' opening and 'The Fairie Dance' deleted scene\", \"Alternate 'Four Goblins' opening and 'The Fairie Dance' deleted scene\", 'Storyboard galleries for three deleted scenes', 'Storyboard galleries for three deleted scenes', \"Two drafts of William Hjortsberg's screenplay\", \"Two drafts of William Hjortsberg's screenplay\", 'Alternate footage from the overseas release plus textless footage', 'Alternate footage from the overseas release plus textless footage', 'Trailers and TV spots', 'Trailers and TV spots', 'Still galleries', 'Still galleries', '*EXTRAS STILL IN PRODUCTION AND SUBJECT TO CHANGE*', 'Review', 'Legend is an impressive technical achievement. Scott is a perfectionist who takes infinite pains to make things look right.', 'Roger Ebert, Chicago Sun-Times', \"Legend is still so much fun to watch. It's a visual feast, a truly grim fairy tale.\", 'Jessica Mason, The Mary Sue', 'A sumptuous, richly colored feast', 'Kevin Thomas, Los Angeles Times', 'Tim Curry is magnificent!', 'Geoff Andrew, Time Out', 'Legend is a gothic fairy tale brought to life', 'Ed Gonzalez, Slant', \"The sets, makeup and photography in Ridley Scott's contribution to the fantasy cycle are awesome. --Sky Cinema\"]\n{'Genre': 'Action-Fantasy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Mia Sara, Alice Playten, Ridley Scott, Tim Curry, Billy Barty, Robert Picardo, Tom Cruise', 'Runtime': '1 hour and 34 minutes', 'Product Dimensions': '5.35 x 7.13 x 1.26 inches; 5.92 Ounces', 'Director': 'Ridley Scott', 'Media Format': 'NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 12, 2021', 'Actors': 'Tom Cruise, Mia Sara, Tim Curry, Billy Barty, Robert Picardo', 'Studio': 'Arrow Video', 'Number of discs': '2'}\nTim Curry in 4K, need I say more?<br />Tom is good too and Jennifer.<br />But the Devil's own in UHD wow\nthe Best made Better in 4K\nThe Dark Crystal [4K UHD + Blu-ray]\nJim Henson  (Actor, Director, Producer),     Kathryn Mullen  (Actor)    Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n[\"In another time, The Dark Crystal - a source of Balance and Truth in the Universe - was shattered, dividing the world into two factions: the wicked Skeksis and the peaceful Mystics. Now, as the convergence of the three suns approaches, the Crystal must be healed, or darkness will reign forevermore! It's up to Jen - the last of his race - to fulfill the prophecy that a Gelfling will return the missing shard to the Crystal and destroy the Skeksis' evil Empire. But will young Jen's courage be any match for the unknown dangers that await him? Revisit this masterful fantasy epic from the brilliant imagination of Jim Henson.\"]\n{'Genre': 'Sci-Fi, Family', 'Format': 'Blu-ray, 4K', 'Contributor': 'Jim Henson, Kathryn Mullen, ITC Entertainment Group DBA Polygram, Frank Oz, Gary Kurtz', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Digital Copy Expiration Date': 'December 31, 2020', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'Frank Oz, Jim Henson', 'Media Format': 'Blu-ray, 4K', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 6, 2018', 'Actors': 'Jim Henson, Kathryn Mullen, Frank Oz', 'Dubbed': 'Italian, Hungarian, French, Spanish, Czech, Japanese, Portuguese, German', 'Subtitles': 'Dutch, Hungarian, Norwegian, Czech, Slovene, Korean, Thai, Mandarin Chinese, Icelandic, Finnish, German, Italian, Swedish, English, Danish, Portuguese, Japanese, Bulgarian, French, Croatian, Polish, Turkish, Spanish, Greek, Slovak, Hebrew', 'Producers': 'Jim Henson, Gary Kurtz', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nwonderful upgrade to a classic movie and yes the Skeksis wins, yessssssss\nThe Skeksis made me give this 5 stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lance Bangs', 'Adam Scott'], 'Producers': ['Adam Scott', 'Paul Scheer', 'Naomi Scott', 'Kara Scobey Brown', 'Hend Baghdady', 'Keith Crofford', 'Ollie Green', 'Justin Moritt', 'Liz Beebe'], 'Studio': ['[adult swim]']}\nShow has Pythonesque aspirations, but fall a long way short of funny with only some chuckle some moments, many of the jokes fall short and are overdone.\nDull, tedious and kind of dumb",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nReview Date: 2013/03/20\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Hit Movies']}\nReview Text: When my Blu-Ray Disc from netflix wouldn't play I turned to streaming and grabbed this movie. The stream ran without any real buffering and I was happy with bitrate, picture and sound.<br />The movie itself, is enjoyable with good plot points and action<br />There are several plot holes and continuity errors- pretty standard for action movies and Tom Cruise's performance is not as good as it could be.<br />The script is tight but does not grab your emotions very firmly. The supporting cast is really what makes up for any lack you feel in the tug of the plot or main character.<br />Overall I enjoyed it. Not enough to want to own it or even watch it again unless it was on TV and the choice came down to it and Duck Dynasty.\nReview Title: Better than I expected\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/05/05\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Constantine Makris', 'Matt Earl Beesley', 'Jamie Babbit', 'Ed Bianchi', 'Stephen Hopkins'], 'Producers': ['Bob DeLaurentis', \"Peter O'Fallon\", 'Noah Hawley'], 'Studio': ['ABC Network']}\nReview Text: I had my doubts, but I loved the cast pretty much from the get go. The show has smart dialogue and crazy &#34;night court&#34; plot twists. The surprise of the show is while you are looking for humor and actionb you are getting emotion from the acting and situations. It's not melodrama as much as you start to care for the characters even the ones who have despicable pasts. I would highly recommend this show if you like The Glades, or The Finder\nReview Title: this is a fresh show filled with smart humor\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Inkheart (+ BD-Live) [Blu-ray]\nReview Date: 2013/10/29\nStore: Brendan Fraser  (Actor),     Paul Bettany  (Actor),     Iain Softley  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Inkheart (Blu-ray)', 'When Mo Folchart reads a story, the characters leap off the page. Literally. And that’s a problem. Mo must somehow use his special powers to send the interlopers back to their world…and save ours. If ever a task was easier read than done, this is it. Mo and his daughter Meggie, aided by friends real and fictional, plunge into a thrilling quest that pits them against diabolical villains, fantastic beasts and dangers at every turn. Brendan Fraser (The Mummy films, Journey to the Center of the Earth) leads a splendid cast (including Academy Award winners* Helen Mirren and Jim Broadbent) in an all-fun, all-family film of Cornelia Funke’s bestseller. Follow Mo and Meggie into adventure more exciting than any ever read. Because it’s adventure they’re going to live!', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Contributor': 'Rafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna GuilloryRafi Gavron, Eliza Hope Bennett, Brendan Fraser, Andy Serkis, Jim Broadbent, Helen Mirren, Iain Softley, Paul Bettany, Sienna Guillory  See more', 'Language': 'German (Dolby Digital 5.1), English (Dolby Digital 5.1), English (Dolby TrueHD 5.1)', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Package Dimensions': '6.7 x 5.3 x 0.5 inches; 3.2 Ounces', 'Director': 'Iain Softley', 'Media Format': 'Multiple Formats, Blu-ray, Color, Dolby, Special Edition, Widescreen, Subtitled', 'Run time': '1 hour and 46 minutes', 'Release date': 'June 23, 2009', 'Actors': 'Brendan Fraser, Paul Bettany, Helen Mirren, Jim Broadbent, Andy Serkis', 'Dubbed': 'English, German', 'Subtitles': 'English, Spanish, German', 'Studio': 'New Line Home Entertainment', 'Number of discs': '1'}\nReview Text: I watched this movie with some trepidation since Brandon Frazier has not had good reviews in a long time. What I got was a good cohesive story with enough mystery that if it had been a book I would have continued turning the pages until I learned all of its secrets. There were some scenes that just went to fast and I felt like there could have been more there. The Blu-ray has lots of features that make this worth owning, the menus are exquisite and painstakingly down, superb work.\nReview Title: A real surprise\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Moliere\nReview Date: 2015/06/18\nStore: Romain Duris  (Actor),     Fabrice Luchini  (Actor),     Laurent Tirard  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Bubbling with wit, stellar performances and lavish cinematography, MOLIÈRE stars multi-Cesar(r)-nominated French actor Romain Duris as Molière, a down-and-out actor-cum-playwright up to his ears in debt. When the wealthy Jourdain (Cesar(r)-winner Fabrice Luchini) offers to cover that debt (so that Molière's theatrical talents might help Jourdain win the heart of a certain widowed marquise), hilarity ensues. Disguised as a priest, Molière becomes a guest in Jourdain's palace on the pretext of teaching Jourdain the craft of the stage, which annoys his wife, Elmire. But, soon after, the confrontation between Elmire and Molière turns seductive. Too busy to notice, Jourdain enlists the aid of a well connected and scheming acquaintance, to help him pursue the young widow. Romantic yearning, human foibles and laughs galore all characterize MOLIÈRE, a delightful film that slyly captures your heart.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Contributor': 'Wild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain DurisWild Bunch, Laurent Tirard, Ludivine Sagnier, Olivier Delbosc, Edouard Baer, Fabrice Luchini, Laura Morante, Marc Missonnier, Romain Duris  See more', 'Language': 'Unqualified, French (Dolby Digital 5.1)', 'Runtime': '2 hours and 1 minute', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': 'CTR21465DVD', 'Director': 'Laurent Tirard', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, AC-3, Dolby, Subtitled', 'Run time': '2 hours and 1 minute', 'Release date': 'January 22, 2008', 'Actors': 'Romain Duris, Fabrice Luchini, Laura Morante, Edouard Baer, Ludivine Sagnier', 'Subtitles': 'English, Spanish', 'Producers': 'Marc Missonnier, Olivier Delbosc', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: best movie since Shakespeare in Love but with a more authentic feel and better performances. Also my mother loves it and what Mom loves must be perfect. If you have a Mother (who loves Moliere) than you will know why this is the second copy of the film I bought since I fear - er I mean Mom wants to borrow mine all the time....\nReview Title: Awesome Movie for Moms.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/07/24\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Baz Luhrmann'], 'Producers': ['Tristram Miall'], 'Starring': ['Paul Mercurio', 'Tara Morice', 'Bill Hunter'], 'Studio': ['Paramount Pictures']}\nReview Text: I have this listed in my top ten favorite movies. Everything so well plotted and executed with such perfect timing. The juxtaposition of fantasy over reality, love versus control, new versus old. youth versus experience. The overriding message of inclusiveness culminating in one spectacular and stunning dances sequences that brings me up to my feet every time I see the movie. After I saw this movie, I went out and bought ballroom dancing quality shoes- I never found a ballroom dancing class, however. These days it is another unrealized dream until I watch the movie again.\nReview Title: A must see, feel good movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Harry Potter: Complete 8-Film Collection\nReview Date: 2016/08/04\nStore: Daniel Radcliffe  (Actor),     Rupert Grint  (Actor)    Rated:    PG-13    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Harry Potter: The Complete 8-Film Collection (BD).', 'Amazon.com', \"Harry Potter and the Sorcerer's Stone\", \"Here's an event movie that holds up to being an event. This filmed version of\", \"Harry Potter and the Sorcerer's Stone\", \", adapted from the wildly popular book by J.K. Rowling, stunningly brings to life Harry Potter's world of Hogwarts, the school for young witches and wizards. The greatest strength of the film comes from its faithfulness to the novel, and this new cinematic world is filled with all the details of Rowling's imagination, thanks to exuberant sets, elaborate costumes, clever makeup and visual effects, and a crème de la crème cast, including Maggie Smith, Richard Harris, Alan Rickman, and more. Especially fine is the interplay between Harry (Daniel Radcliffe) and his schoolmates Ron (Rupert Grint) and Hermione (Emma Watson), as well as his protector, the looming Hagrid (Robbie Coltrane). The second-half adventure--involving the titular sorcerer's stone--doesn't translate perfectly from page to screen, ultimately because of the film's fidelity to the novel; this is a case of making a movie for the book's fans, as opposed to a transcending film. Writer Steve Kloves and director Chris Columbus keep the spooks in check, making this a true family film, and with its resourceful hero wide-eyed and ready, one can't wait for Harry's return. Ages 8 and up.\", '--Doug Thomas', 'Harry Potter and the Chamber of Secrets', 'First sequels are the true test of an enduring movie franchise, and', 'Harry Potter and the Chamber of Secrets', 'passes with flying colors. Expanding upon the lavish sets, special effects, and grand adventure of', \"Harry Potter and the Sorcerer's Stone\", \", Harry's second year at Hogwarts School of Witchcraft and Wizardry involves a darker, more malevolent tale (parents with younger children beware), beginning with the petrified bodies of several Hogwarts students and magical clues leading Harry (Daniel Radcliffe), Ron (Rupert Grint), and Hermione (Emma Watson) to a 50-year-old mystery in the monster-laden Chamber of Secrets. House elves, squealing mandrakes, giant spiders, and venomous serpents populate this loyal adaptation (by\", \"Sorcerer's Stone\", \"director Chris Columbus and screenwriter Steve Kloves), and Kenneth Branagh delightfully tops the supreme supporting cast as the vainglorious charlatan Gilderoy Lockhart (be sure to view past the credits for a visual punchline at Lockhart's expense). At 161 minutes, the film suffers from lack of depth and uneven pacing, and John Williams' score mostly reprises established themes. The young, fast-growing cast offers ample compensation, however, as does the late Richard Harris in his final screen appearance as Professor Albus Dumbledore. Brimming with cleverness, wonderment, and big-budget splendor,\", 'Chamber', \"honors the legacy of J.K. Rowling's novels.\", '--Jeff Shannon', 'Harry Potter and the Prisoner of Azkaban', 'Some movie-loving wizards must have cast a magic spell on', 'Harry Potter and the Prisoner of Azkaban', \", because it's another grand slam for the Harry Potter franchise. Demonstrating remarkable versatility after the arthouse success of\", 'Y Tu Mamá También', \", director Alfonso Cuarón proves a perfect choice to guide Harry, Hermione, and Ron into treacherous puberty as the now 13-year-old students at Hogwarts School of Witchcraft and Wizardry face a new and daunting challenge: Sirius Black (Gary Oldman) has escaped from Azkaban prison, and for reasons yet unknown (unless, of course, you've read J.K. Rowling's book, considered by many to be the best in the series), he's after Harry in a bid for revenge. This dark and dangerous mystery drives the action while Harry (the fast-growing Daniel Radcliffe) and his third-year Hogwarts classmates discover the flying hippogriff Buckbeak (a marvelous CGI creature), the benevolent but enigmatic Professor Lupin (David Thewlis), horrifying black-robed Dementors, sneaky Peter Pettigrew (Timothy Spall), and the wonderful advantage of having a Time-Turner just when you need one. The familiar Hogwarts staff returns in fine form (including the delightful Michael Gambon, replacing the late Richard Harris as Dumbledore, and Emma Thompson as the goggle-eyed Sybil Trelawney), and even Julie Christie joins this prestigious production for a brief but welcome cameo. Technically dazzling, fast-paced, and chock-full of Rowling's boundless imagination (loyally adapted by ace screenwriter Steve Kloves),\", 'The Prisoner of Azkaban', 'is a Potter-movie classic.', '--Jeff Shannon', 'Harry Potter and the Goblet of Fire', 'The latest entry in the', 'Harry Potter', 'saga could be retitled', 'Fast Times at Hogwarts', \", where finding a date to the winter ball is nearly as terrifying as worrying about Lord Voldemort's return. Thus, the young wizards' entry into puberty (and discovery of the opposite sex) opens up a rich mining field to balance out the dark content in the fourth movie (and the stories are only going to get darker). Mike Newell (\", 'Four Weddings and a Funeral', \") handily takes the directing reins and eases his young cast through awkward growth spurts into true young actors. Harry (Daniel Radcliffe, more sure of himself) has his first girl crush on fellow student Cho Chang (Katie Leung), and has his first big fight with best bud Ron (Rupert Grint). Meanwhile, Ron's underlying romantic tension with Hermione (Emma Watson) comes to a head over the winter ball, and when she makes one of those girl-into-woman Cinderella entrances, the boys' reactions indicate they've all crossed a threshold.\", \"But don't worry, there's plenty of wizardry and action in\", 'Goblet of Fire', '. When the deadly Triwizard Tournament is hosted by Hogwarts, Harry finds his name mysteriously submitted (and chosen) to compete against wizards from two neighboring academies, as well as another Hogwarts student. The competition scenes are magnificently shot, with much-improved CGI effects (particularly the underwater challenge). And the climactic confrontation with Lord Voldemort (Ralph Fiennes, in a brilliant bit of casting) is the most thrilling yet.', 'Goblet', \", the first installment to get a PG-13 rating, contains some violence as well as disturbing images for kids and some barely shrouded references at sexual awakening (Harry's bath scene in particular). The 2 1/2-hour film, lean considering it came from a 734-page book, trims out subplots about house-elves (they're not missed) and gives little screen time to the standard crew of the other\", 'Potter', \"films, but adds in more of Britain's finest actors to the cast, such as Brendan Gleeson as Mad-Eye Moody and Miranda Richardson as Rita Skeeter. Michael Gambon, in his second round as Professor Dumbledore, still hasn't brought audiences around to his interpretation of the role he took over after Richard Harris died, but it's a small smudge in an otherwise spotless adaptation.\", '--Ellen A. Kim', 'Harry Potter and the Order of the Phoenix', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.\", \"Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper\", 'The Daily Prophet', 'to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.', \"This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a\", 'good', 'movie.', '--Jordan Thompson', 'Harry Potter and the Half-Blood Prince', 'The sixth installment of the', 'Harry Potter', 'series begins right where', 'The Order of the Phoenix', 'left off. The wizarding world is rocked by the news that \"He Who Must Not Be Named\" has truly returned, and the audience finally knows that Harry is \"the Chosen One\"--the only wizard who can defeat Lord Voldemort in the end. Dark forces loom around every corner, and now regularly attempt to penetrate the protected walls of Hogwarts School. This is no longer the fun and fascinating world of magic from the first few books—it\\'s dark, dangerous, and scary.', \"Harry (Daniel Radcliffe) suspects Draco Malfoy (Tom Felton) to be a new Death Eater recruit on a special mission for the Dark Lord. In the meantime, Professor Dumbledore (Michael Gambon) seems to have finally removed the shroud of secrecy from Harry about the dark path that lies ahead, and instead provides private lessons to get him prepared. It's in these intriguing scenes that the dark past of Tom Riddle (a.k.a. Voldemort) is finally revealed. The actors cast as the different young versions of Riddle (Hero Fiennes-Tiffin and Frank Dillane) do an eerily fantastic job of portraying the villain as a child. While the previous movies' many new characters could be slightly overwhelming, only one new key character is introduced this time: Professor Horace Slughorn (with a spot-on performance by Jim Broadbent). Within his mind he holds a key secret in the battle to defeat the Dark Lord, and Harry is tasked by Dumbledore to uncover a memory about Voldemort's darkest weapon--the Horcrux. Despite the long list of distractions, Harry, Ron (Rupert Grint), and Hermione (Emma Watson) still try to focus on being teenagers, and audiences will enjoy the budding awkward romances. All of the actors have developed nicely, giving their most convincing performances to date.\", 'More dramatic and significant things go down in this movie than any of its predecessors, and the stakes are higher than ever. The creators have been tasked with a practically impossible challenge, as fans of the beloved J.K. Rowling book series desperately want the movies to capture the magic of the books as closely as possible. Alas, the point at which one accepts that these two mediums are very different is the point at which one can truly enjoy these brilliant adaptations.', 'Harry Potter and the Half-Blood Prince', 'is no exception: it may be the best film yet. For those who have not read the book, nail-biting entertainment is guaranteed. For those who have, the movie does it justice. The key dramatic scenes, including the cave and the shocking twist in the final chapter, are executed very well. It does a perfect job of setting up the two-part grand finale that is to follow.', '--Jordan Thompson', 'Harry Potter and the Deathly Hallows, Part I', 'Harry Potter and the Deathly Hallows, Part I', 'is a brooding, slower-paced film than its predecessors, the result of being just one half of the final story (the last book in the series was split into two movies, released in theaters eight months apart). Because the penultimate film is all buildup before the final showdown between the teen wizard and the evil Voldemort (which does not occur until', 'The Deathly Hallows, Part II', '),', 'Part I', \"is a road-trip movie, a heist film, a lot of exposition, and more weight on its three young leads, who up until now were sufficiently supported by a revolving door of British Thespis throughout the series. Now that all the action takes place outside Hogwarts--no more Potions classes, Gryffindor scarves, or Quidditch matches--Daniel Radcliffe (Harry), Emma Watson (Hermione), and Rupert Grint (Ron) shoulder the film almost entirely on their own. After a near-fatal ambush by Voldemort's Death Eaters, the three embark on a quest to find and destroy the remaining five horcruxes (objects that store pieces of Voldemort's soul). Fortunately, as the story gets more grave--and parents should be warned, there are some scenes too frightening or adult for young children--so does the intensity. David Yates, who directed the Harry Potter films\", 'Order of the Phoenix', 'and', 'The Half-Blood Prince', ', drags the second half a little, but right along with some of the slower moments are some touching surprises (Harry leading Hermione in a dance, the return of Dobby in a totally non-annoying way).', 'Deathly Hallows, Part I', \"will be the most confusing for those not familiar with the Potter lore, particularly in the shorthand way characters and terminology weave in and out. For the rest of us, though, watching these characters over the last decade and saying farewell to a few faces makes it all bittersweet that the end is near (indeed, an early scene in which Hermione casts a spell that makes her Muggle parents forget her existence, in case she doesn't return, is particularly emotional). Despite its challenges,\", 'Deathly Hallows, Part I', \"succeeds in what it's most meant to do: whet your appetite for the grand conclusion to the Harry Potter series. --\", 'Ellen A. Kim', 'Harry Potter and the Deathly Hallows, Part II', 'The Deathly Hallows: Part 2', \"is the film all Harry Potter fans have waited 10 years to see, and the good news is that it's worth the hype--visually stunning, action packed, faithful to the book, and mature not just in its themes and emotion but in the acting by its cast, some of whom had spent half their lives making Harry Potter movies. Part 2 cuts right to the chase: Voldemort (Ralph Fiennes) has stolen the Elder Wand, one of the three objects required to give someone power over death (a.k.a. the Deathly Hallows), with the intent to hunt and kill Harry. Meanwhile, Harry's quest to destroy the rest of the Horcruxes (each containing a bit of Voldemort's soul) leads him first to a thrilling (and hilarious--love that Polyjuice Potion!) trip to Gringotts Bank, then back to Hogwarts, where a spectacular battle pitting the young students and professors (a showcase of the British thesps who have stolen every scene of the series: Maggie Smith's McGonagall, Jim Broadbent's Slughorn, David Thewlis's Lupin) against a dark army of Dementors, ogres, and Bellatrix Lestrange (Helena Bonham Carter, with far less crazy eyes to make this round). As predicted all throughout the saga, Harry also has his final showdown with Voldemort--neither can live while the other survives--though the physics of that predicament might need a set of crib notes to explain. But while each installment has become progressively grimmer, this finale is the most balanced between light and dark (the dark is\", 'quite', \"dark--several familiar characters die, with one significant death particularly grisly); the humor is sprinkled in at the most welcome times, thanks to the deft adaptation by Steve Kloves (who scribed all but one of the films from J.K. Rowling's books) and direction by four-time Potter director David Yates. The climactic kiss between Ron (Rupert Grint) and Hermione (Emma Watson), capping off a decade of romantic tension, is perfectly tuned to their idiosyncratic relationship, and Daniel Radcliffe has, over the last decade, certainly proven he was the right kid for the job all along. As Prof. Snape, the most perfect of casting choices in the best-cast franchise of all time, Alan Rickman breaks your heart. Only the epilogue (and the lack of chemistry between Harry and love Ginny Weasley, barely present here) stand a little shaky, but no matter: the most lucrative franchise in movie history to date has just reached its conclusion, and it's done so without losing its soul. --\", 'Ellen A. Kim']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Rupert Grint, Daniel Radcliffe, Emma Watson', 'Initial release date': '2018-08-27', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.12 Ounces', 'Item model number': 'WHV1000189967BR', 'Media Format': 'NTSC', 'Run time': '19 hours and 24 minutes', 'Release date': 'August 27, 2018', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nReview Text: This would be perfect save there is no real menu system on the discs, I mean when you insert them, they just start the movie- of course, could just be something the Xbox One does, but I had to top menu and search for even the most basic settings. Still, they all play nicely and you can't wrong if you love Hermoine Granger - I mean Harry Potter, of course. If I had to do it over again, I would have gotten the multiformat set instead as I would like to watch them in my van late at night with Allison and Ellie - although I could use the PS3 on the van's RCA interface. It's cozy and the screen in small but it's cozy and being locked in a van with the people you love sounds great until someone has to go to the bathroom.<br />Outside of the weird menu UI - it is more compact than juggling multiple cases and memorabilia- unless you like showing off your elder wand and butter beer stein between disks. Then,by all means, get robed up and go around exclaim spells and picking on house elfs...or not. Ellie says that we should make the elves polka-dot socks to wear- I suspect she knows that Allison is secretly annoyed by the idea of polka dots socks though. I assure them both Hermoine wouldn't hear of any such foolishness. I would have preferred that she and Harry could have had the relationship instead though but I respect that the story writes itself.\nReview Title: great set bad menu, expelliarmus stratagem or something!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2021/08/05\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Allison Abbate', 'Des McAnuff'], 'Starring': ['Jennifer Aniston', 'Harry Connick', 'Jr.', 'Vin Diesel'], 'Studio': ['WARNER BROS.']}\nReview Text: Yeah, Yeah, Fantasia is all that. but Vin Deisel give a spectacular performance and the story is more relatable then Disneys interpretation of a symphony with one little mouse version of the sorcerer's apprentice. I love the Iron Giant, so fight me.\nReview Title: One of the Best Animated Movie ever Made\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Legend (2-Disc Limited Edition) [Blu-ray]\nReview Date: 2021/12/02\nStore: Tom Cruise  (Actor),     Mia Sara  (Actor),     Ridley Scott  (Director)    &                   0                  more   Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'After changing the face of science fiction cinema forever with Alien and Blade Runner, director Ridley Scott turned his visionary eye to the fantasy genre, teaming with writer William Hjortsberg (Angel Heart) to create a breathtaking cinematic fairytale with one of the screen’s most astonishingly rendered depictions of Evil.', 'In an idyllic, sun-dappled forest, the pure-hearted Jack (Tom Cruise) takes his true love Princess Lili (Mia Sara) to see a pair of unicorns frolicking at the forest’s edge. Little do they know that the Lord of Darkness (Tim Curry, in a remarkable make-up designed by The Thing’s Rob Bottin) has dispatched his minions to capture the unicorns and sever their horns so that he may plunge the world into everlasting night. After Lili and the unicorns are taken prisoner, Jack must team with a group of forest creatures and descend into Darkness’ subterranean lair to face off against the devilish creature before it is too late.', \"Despite a troubled production in which the elaborate full-size forest set was accidentally incinerated and a lengthy post-production that resulted in multiple versions of the film (with competing music scores by Jerry Goldsmith and Tangerine Dream), Legend has since been restored to Scott's original cut and embraced by generations of film fans eager to see a master director’s unique vision of a world beyond our imagination.\", 'LIMITED EDITION CONTENTS', 'High Definition (1080p) Blu-ray presentations of the U.S. Theatrical Cut and the Director’s Cut', 'High Definition (1080p) Blu-ray presentations of the U.S. Theatrical Cut and the Director’s Cut', 'DTS-HD MA 5.1 and 2.0 stereo audio on both cuts', 'DTS-HD MA 5.1 and 2.0 stereo audio on both cuts', 'Optional English subtitles for the deaf and hard of hearing on both cuts', 'Optional English subtitles for the deaf and hard of hearing on both cuts', \"Illustrated perfect-bound book with new writing by Nicholas Clement and Kat Ellinger and archive materials including production notes and a 2002 interview with Charles de Lauzirika about the restoration of the Director's Cut\", \"Illustrated perfect-bound book with new writing by Nicholas Clement and Kat Ellinger and archive materials including production notes and a 2002 interview with Charles de Lauzirika about the restoration of the Director's Cut\", 'Large double-sided poster with newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Large double-sided poster with newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Glossy full-color portraits of the cast photographed by Annie Leibovitz', 'Glossy full-color portraits of the cast photographed by Annie Leibovitz', 'Six double-sided postcard-sized lobby card reproductions', 'Six double-sided postcard-sized lobby card reproductions', 'Reversible sleeve featuring newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'Reversible sleeve featuring newly commissioned artwork by Neil Davies and original theatrical artwork by John Alvin', 'DISC 1: US THEATRICAL CUT', 'New 2K restoration of the US Theatrical Cut from original materials including a 4K scan of the original negative', 'New 2K restoration of the US Theatrical Cut from original materials including a 4K scan of the original negative', 'New commentary by Paul M. Sammon author of Ridley Scott: The Making of His Movies', 'New commentary by Paul M. Sammon author of Ridley Scott: The Making of His Movies', '2002 Reconstructed isolated score by Tangerine Dream', '2002 Reconstructed isolated score by Tangerine Dream', 'Isolated music and effects track', 'Isolated music and effects track', 'A Fairytale in Pinewood, new featurette interviewing grip David Cadwalladr, costume designer Charles Knode, co-star Annabelle Lanyon, camera operator Peter MacDonald, set decorator Ann Mollo and draftsman John Ralph', 'A Fairytale in Pinewood, new featurette interviewing grip David Cadwalladr, costume designer Charles Knode, co-star Annabelle Lanyon, camera operator Peter MacDonald, set decorator Ann Mollo and draftsman John Ralph', 'Incarnations of a Legend, comparison featurette written and narrated by critic Travis Crawford', 'Incarnations of a Legend, comparison featurette written and narrated by critic Travis Crawford', 'The Directors: Ridley Scott, 2003 documentary where the director discusses his career, including Legend', 'The Directors: Ridley Scott, 2003 documentary where the director discusses his career, including Legend', '“Is Your Love Strong Enough?” music video by Bryan Ferry', '“Is Your Love Strong Enough?” music video by Bryan Ferry', 'DISC 2: DIRECTOR’S CUT', 'Commentary by Ridley Scott', 'Commentary by Ridley Scott', 'Creating A Myth: Memories of Legend, a 2002 documentary with interviews with Ridley Scott, William Hjortsberg, Mia Sara, Tim Curry, Rob Bottin and others', 'Creating A Myth: Memories of Legend, a 2002 documentary with interviews with Ridley Scott, William Hjortsberg, Mia Sara, Tim Curry, Rob Bottin and others', 'Original promotional featurette', 'Original promotional featurette', \"Alternate 'Four Goblins' opening and 'The Fairie Dance' deleted scene\", \"Alternate 'Four Goblins' opening and 'The Fairie Dance' deleted scene\", 'Storyboard galleries for three deleted scenes', 'Storyboard galleries for three deleted scenes', \"Two drafts of William Hjortsberg's screenplay\", \"Two drafts of William Hjortsberg's screenplay\", 'Alternate footage from the overseas release plus textless footage', 'Alternate footage from the overseas release plus textless footage', 'Trailers and TV spots', 'Trailers and TV spots', 'Still galleries', 'Still galleries', '*EXTRAS STILL IN PRODUCTION AND SUBJECT TO CHANGE*', 'Review', 'Legend is an impressive technical achievement. Scott is a perfectionist who takes infinite pains to make things look right.', 'Roger Ebert, Chicago Sun-Times', \"Legend is still so much fun to watch. It's a visual feast, a truly grim fairy tale.\", 'Jessica Mason, The Mary Sue', 'A sumptuous, richly colored feast', 'Kevin Thomas, Los Angeles Times', 'Tim Curry is magnificent!', 'Geoff Andrew, Time Out', 'Legend is a gothic fairy tale brought to life', 'Ed Gonzalez, Slant', \"The sets, makeup and photography in Ridley Scott's contribution to the fantasy cycle are awesome. --Sky Cinema\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action-Fantasy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Mia Sara, Alice Playten, Ridley Scott, Tim Curry, Billy Barty, Robert Picardo, Tom Cruise', 'Runtime': '1 hour and 34 minutes', 'Product Dimensions': '5.35 x 7.13 x 1.26 inches; 5.92 Ounces', 'Director': 'Ridley Scott', 'Media Format': 'NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 12, 2021', 'Actors': 'Tom Cruise, Mia Sara, Tim Curry, Billy Barty, Robert Picardo', 'Studio': 'Arrow Video', 'Number of discs': '2'}\nReview Text: Tim Curry in 4K, need I say more?<br />Tom is good too and Jennifer.<br />But the Devil's own in UHD wow\nReview Title: the Best made Better in 4K\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Dark Crystal [4K UHD + Blu-ray]\nReview Date: 2022/02/19\nStore: Jim Henson  (Actor, Director, Producer),     Kathryn Mullen  (Actor)    Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: [\"In another time, The Dark Crystal - a source of Balance and Truth in the Universe - was shattered, dividing the world into two factions: the wicked Skeksis and the peaceful Mystics. Now, as the convergence of the three suns approaches, the Crystal must be healed, or darkness will reign forevermore! It's up to Jen - the last of his race - to fulfill the prophecy that a Gelfling will return the missing shard to the Crystal and destroy the Skeksis' evil Empire. But will young Jen's courage be any match for the unknown dangers that await him? Revisit this masterful fantasy epic from the brilliant imagination of Jim Henson.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Sci-Fi, Family', 'Format': 'Blu-ray, 4K', 'Contributor': 'Jim Henson, Kathryn Mullen, ITC Entertainment Group DBA Polygram, Frank Oz, Gary Kurtz', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Digital Copy Expiration Date': 'December 31, 2020', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Director': 'Frank Oz, Jim Henson', 'Media Format': 'Blu-ray, 4K', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 6, 2018', 'Actors': 'Jim Henson, Kathryn Mullen, Frank Oz', 'Dubbed': 'Italian, Hungarian, French, Spanish, Czech, Japanese, Portuguese, German', 'Subtitles': 'Dutch, Hungarian, Norwegian, Czech, Slovene, Korean, Thai, Mandarin Chinese, Icelandic, Finnish, German, Italian, Swedish, English, Danish, Portuguese, Japanese, Bulgarian, French, Croatian, Polish, Turkish, Spanish, Greek, Slovak, Hebrew', 'Producers': 'Jim Henson, Gary Kurtz', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: wonderful upgrade to a classic movie and yes the Skeksis wins, yessssssss\nReview Title: The Skeksis made me give this 5 stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2022/11/14\nAverage Rating: 4.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lance Bangs', 'Adam Scott'], 'Producers': ['Adam Scott', 'Paul Scheer', 'Naomi Scott', 'Kara Scobey Brown', 'Hend Baghdady', 'Keith Crofford', 'Ollie Green', 'Justin Moritt', 'Liz Beebe'], 'Studio': ['[adult swim]']}\nReview Text: Show has Pythonesque aspirations, but fall a long way short of funny with only some chuckle some moments, many of the jokes fall short and are overdone.\nReview Title: Dull, tedious and kind of dumb\nRating: 3.0\n--------------------------------------------------",
  "raw_response": "**Preferences and Patterns Summary:**\n\n1. **Film Genre Preference**:\n   - Action-packed and adventurous narratives.\n   - Enjoyment of fantasy, with notable interest in well-crafted, imaginative storytelling.\n   - Appreciation for emotional engagement and character development.\n\n2. **Actor/Director Favorites**:\n   - Frequent engagement with films featuring well-known actors, particularly those from iconic blockbusters (e.g., performances by major stars).\n   - Consistent selections from directors renowned for visual and narrative creativity.\n\n3. **Media Format**:\n   - Strong preference for high-quality viewing experiences, such as Blu-ray and 4K UHD formats.\n   - Value for special editions with bonus materials, indicating a collector's mindset.\n\n4. **Content Evaluation**:\n   - Tendency to appreciate well-rated works (4.5+ average ratings).\n   - Critical yet positive engagement with content (notable for articulating both strengths and weaknesses of films).\n\n5. **Nostalgia and Sentimentality**:\n   - Strong emotional connections to films viewed in childhood or familial settings, highlighting films that resonate with personal and shared experiences.\n\n6. **Streaming vs. Physical Media**:\n   - A transition from streaming content to physical ownership, reflecting a desire for curated viewing options and archival fidelity.\n\n7. **Rating Consistency**:\n   - High average ratings in most interactions indicate a discerning yet satisfied viewer, often driven by heartfelt or meaningful connections to the material.\n\nOverall, the individual's purchasing history reflects a deep appreciation for action and fantasy films, strong allegiance to favored actors and directors, and a discerning taste for high-quality viewing experiences, all intertwined with personal nostalgia and emotional resonance.",
  "target_interaction": {
    "rating": 5.0,
    "title": "A worthy upgrade to a great movie",
    "text": "Since streaming 4k is a joke. And since Blu-Ray extras make it worth not googling it.<br />This is the best way to view this great movie that inspired Stranger Things (another great series that needs a full 4k release!)<br />you won't regret buying this, I mean if you have a 4k TV and 4k Blu-ray player it won't be, if you don't then there will be much regret.",
    "images": [],
    "asin": "B08XLCGCC2",
    "parent_asin": "B08XLCGCC2",
    "user_id": "AHCCH4VZHW2HPLZ5MXGR73U5KZIA",
    "timestamp": "2022-12-10 18:32:32.442000",
    "helpful_vote": 2,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Super 8 10th Anniversary Steelbook 4K UHD + Digital",
    "average_rating": 4.6,
    "rating_number": 6482,
    "features": [],
    "description": [
      "J.J. Abrams and Steven Spielberg join forces in this extraordinary tale of youth, mystery and adventure. Super 8 tells the story of six friends who witness a train wreck while making a super 8 movie, only to discover that something unimaginable escaped during the crash. They soon discover that the only thing more mysterious than what it is, is what it wants. Experience the film that critics rave is \"filled with unstoppable imagination and visual effects to spare. It will put a spell on you.\" – Peter Travers, Rolling Stone"
    ],
    "price": 26.72,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51--qH1VP7L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51--qH1VP7L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91MuNTJuRJL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51FRdNWAPAL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51FRdNWAPAL.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/81aGJ6IuINL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/414e15bqhFL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/414e15bqhFL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/712-63Br8JL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Elle Fanning  (Actor),     Kyle Chandler  (Actor),     J.J. Abrams  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Aspect Ratio": "1.78:1",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Package Dimensions": "6.69 x 5.39 x 0.59 inches; 5.93 Ounces",
      "Director": "J.J. Abrams",
      "Media Format": "4K, Subtitled, Digital_copy",
      "Run time": "1 hour and 52 minutes",
      "Release date": "May 25, 2021",
      "Actors": "Elle Fanning, Kyle Chandler",
      "Dubbed": "French",
      "Subtitles": "English, French",
      "Language": "English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)",
      "Studio": "PARAMOUNT",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}