{
  "user_id": "AEIVCLCJUSFUXSI2P2WYARU6ZOZQ",
  "summary": "=== Purchase Information ===\nProduct Title: Edge Throwback T-Shirt\nReview Date: 2015/11/14\nStore: WWE\nCategories: Movies & TV, Genre for Featured Categories, Sports\nProduct Description: ['Black. 100% cotton. Screen printed in the USA. Imported. \\xa0Please note: T-Shirts available in 3XL cost more. The price will reflect when you add that size to your shopping cart']\nAverage Rating: 4.3\nProduct Details: {'Item Package Dimensions L x W x H': '7.8 x 5.8 x 5.7 inches', 'Package Weight': '4.15 Pounds', 'Brand Name': 'WWE', 'Number of Items': '21', 'Manufacturer': 'WWE', 'Size': 'XX-Large', 'Best Sellers Rank': {'Movies & TV': 237198, 'Sports': 4939}, 'Date First Available': 'June 16, 2006', 'Genre': 'Sports', 'Format': 'Color, Closed-captioned, NTSC', 'Contributor': 'Jack Simon, Glenn Jacobs, Steven Anderson, George Scott, Kevin Dunn, Chyna, David J. Lagana, Steve Austin, Mike Tyson, Ed Koskey, Tom Horn, Paul Levesque, Owen Hart, Ken Shamrock, Vince McMahon, Shawn Michaels, Mick Foley, Mark Calaway, Dwayne JohnsonJack Simon, Glenn Jacobs, Steven Anderson, George Scott, Kevin Dunn, Chyna, David J. Lagana, Steve Austin, Mike Tyson, Ed Koskey, Tom Horn, Paul Levesque, Owen Hart,…  See more', 'Language': 'English', 'Runtime': '69 hours'}\nReview Text: Love this!!!!  Arrived in great shape  thanks\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hills Have Eyes 1/Hills Have Eyes 2\nReview Date: 2015/11/14\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Horror/Slasher Flicks', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'HILLS HAVE EYES 1 / HILLS HAVE EYES 2', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': 'FOXS2254525DVD', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 18 minutes', 'Release date': 'September 9, 2008', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: thank you\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Precious [DVD]\nReview Date: 2015/11/14\nStore: Gabourey Sidibe  (Actor),     Mo'Nique  (Actor),     Lee Daniels  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Set in Harlem in 1987, it is the story of Claireece “Precious” Jones, a sixteen-year-old African-American girl born into a life no one would want. She’s pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, a poisonously angry woman who abuses her emotionally and physically. School is a place of chaos, and Precious has reached the ninth grade with good marks and an awful secret: she can neither read nor write. Precious may sometimes be down, but she is never out. Beneath her impassive expression is a watchful, curious young woman with an inchoate but unshakeable sense that other possibilities exist for her. Threatened with expulsion, Precious is offered the chance to transfer to an alternative school, Each One/Teach One. Precious doesn’t know the meaning of “alternative,” but her instincts tell her this is the chance she has been waiting for. In the literacy workshop taught by the patient yet firm Ms. Rain, Precious begins a journey that', 'Amazon.com', 'Not every movie can survive the kind of hype--multiple awards at Sundance and other festivals, rapturous reviews, nominated for six Academy Awards and winner of two, for Best Supporting Actress and Best Screenplay--that greeted the release of', 'Precious: Based on the Novel \"Push\" by Sapphire', \", but this extraordinary piece of work is more than up to the task. What's particularly notable about the film's success and acclaim is that in the beginning, at least, it presents one of the grimmest scenarios imaginable. The scene is Harlem, New York, in 1987. Teenager Clarisse Precious Jones (played by newcomer Gabourey Sibide in an absolutely fearless performance) is dirt poor, morbidly obese, semiliterate, and pregnant for the second time--both courtesy of her own father (the first baby was born with Down syndrome). Her home life is several levels below Hell, as her bitter, vengeful welfare mother, Mary (Mo'Nique, in a role that has generated legitimate Oscar® buzz), abuses her both physically and otherwise (telling Precious she should have aborted her is only the worst of a relentless flood of insults and vitriol). Yet somehow, the young woman still has hopes and dreams (depicted in a series of delightful fantasy sequences). She enrolls in an alternative school, where a young teacher (Paula Patton) takes her under her wing and even into her home, and visits a social worker (an excellent Mariah Carey; fellow pop star Lenny Kravitz is also effective as a male nurse) who further helps bring Precious out of the darkness. Incredibly, Precious's circumstances deteriorate even more before showing the slightest sign of improvement, and a climactic confrontation with her mother is one of the more wrenching scenes in recent memory. But against all odds, director Lee Daniels, screenwriter Geoffrey Fletcher (working from Sapphire's novel), and especially the wondrously affecting Sibide have managed to make\", 'Precious', 'a film that will lift the viewer far higher up that one might ever have thought possible.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Lee Daniels, Mo'Nique, Gabourey Sidibe\", 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT27239DVD', 'Director': 'Lee Daniels', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'March 9, 2010', 'Actors': \"Gabourey Sidibe, Mo'Nique\", 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: skipped and locked up\nReview Title: Two Stars\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Quarantine 2: Terminal\nReview Date: 2016/11/13\nStore: Mercedes Masohn  (Actor),     Josh Cooke  (Actor),     John Pogue  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Earlier tonight, a bizarre disease was unleashed in a run-down Los Angeles tenement... and no one got out alive. Yet something escaped. Now, aboard Flight 318, the first symptoms begin to show. As the infection begins to takes root, innocent passengers suddenly transform into terrifying, bloodthirsty killers. Forced to land at an isolated terminal, and surrounded by armed government agents, the crew and passengers grow increasingly desperate. The only question now is how far they will go to survive.', 'Amazon.com', 'Picking up shortly after the harrowing events detailed in', 'Quarantine', '(2008), the American version of the Spanish thriller', '[Rec]', ', the 2011 thriller', 'Quarantine 2: Terminal', \"follows the effects of a lethal, rabies-like disease among the passengers of a plane. The confines of the location allow for some claustrophobic moments once the contagion begins to spread, but it's soon abandoned for a poorly lit, maze-like warehouse that creates more confusion than suspense. The homogenous characters also make it difficult to keep track of the story amidst all the screaming and spraying of bodily fluids; only Josh Cooke (\", 'Better with You', ') stands out as a kindergarten teacher with a suspicious carry-on filled with rodents. But perhaps the biggest error is the loss of the POV camerawork and real-time storytelling, which lent a palpable urgency to', 'Quarantine', 'and its Spanish predecessor, and was a clever way to use the periphery of the film frame as a hiding place for all manner of terrors. Here, the action unfolds in standard-issue fashion, which renders the film as just another zombie/outbreak chiller with only a few solid scares to recommend it. Viewers with an omnivorous and forgiving appetite for horror will most likely be the best audience for this second-tier sequel.', '--Paul Gaita']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror, Thriller', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Marc Bienstock, Beau Turpin, Jason Benjamin, Mattie Liptak, Roy Lee, Doug Davison, Phillip DeVona, Ignacio Serricchio, Noree Victoria, Sandra Lafferty, Julie Gribble, Lamar Stewart, George Back, Judd Lormond, Tom Thon, Josh Cooke, Neko Parham, Tyler Kunkle, John Pogue, John Curran, Mercedes Masohn, Andrew Benator, Erin Smith, Bre Blair, Lynn Cole, Mercedes Masöhn, RCR Media Group; Stage 6 Films; Third Street PicturesMarc Bienstock, Beau Turpin, Jason Benjamin, Mattie Liptak, Roy Lee, Doug Davison, Phillip DeVona, Ignacio Serricchio, Noree Victoria, Sandra Lafferty, Julie Gribble, Lamar Stewart, George Back, Judd Lormond, Tom Thon, Josh Cooke, Neko Parham, Tyler Kunkle, John Po…   See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Item model number': '17616160', 'Director': 'John Pogue', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'August 2, 2011', 'Actors': 'Mercedes Masohn, Josh Cooke, Bre Blair, Ignacio Serricchio, Mattie Liptak', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Marc Bienstock, Roy Lee, Doug Davison', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: thank you\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Night Flier\nReview Date: 2016/11/13\nStore: Miguel Ferrer  (Actor),     Julie Entwisle  (Actor),     Mark Pavia  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: ['Storyline Two investigative reporters for a tabloid magazine track down across country \"The Night Flier\", a serial killer who travels by private plane stalking victims in rural airports. One of the reporters, Richard Dees, begins to suspect that \"the Night Flier could perhaps be a vampire\". Written by Humberto Amador']\nAverage Rating: 4.5\nProduct Details: {'Format': 'NTSC', 'Contributor': \"Julie Entwisle, Miguel Ferrer, Rob Wilds, John Bennes, Alfredo Cuomo, Richard K. Olsen, J.R. Rodriguez, Robert Leon Casey, Mitchell Galin, Ashton Stewart, Dan Monahan, Michael H. Moss, Jack O'Donnell, David R. Kappes, Elizabeth McCormick, Mark Pavia, Stephen King, Beverly SkinnerJulie Entwisle, Miguel Ferrer, Rob Wilds, John Bennes, Alfredo Cuomo, Richard K. Olsen, J.R. Rodriguez, Robert Leon Casey, Mitchell Galin, Ashton Stewart, Dan Monahan, Michael H. Moss, Jack O'Donnell, David R. Kappes, Elizabeth McCormick, Mark Pavia, Stephen King, Bev…  See more\", 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Mark Pavia', 'Media Format': 'NTSC', 'Run time': '1 hour and 34 minutes', 'Actors': 'Miguel Ferrer, Julie Entwisle, Dan Monahan, Michael H. Moss, John Bennes', 'Producers': \"Alfredo Cuomo, David R. Kappes, Jack O'Donnell, Mitchell Galin\", 'Writers': \"Jack O'Donnell, Mark Pavia, Stephen King\", 'Number of discs': '1'}\nReview Text: classic\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Three Stooges, the - Ultimate Collection - Set\nReview Date: 2016/11/13\nStore: Moe Howard  (Actor),     Larry Fine  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Includes 25 years of the Three Stooges unique brand of humor with Moe as boss, Larry the middleman and Curly as their foil. Witness the rise of these comedy icons in this high-spirited collection, which has been re-mastered for the best quality picture and sound. You'll experience the eye-pokes, face slaps, hollow head knocks and knuckle cracks like you've never heard or seen them before.\"]\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy/Classic Comedies', 'Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Contributor': 'Larry Fine, Moe Howard, Shemp Howard, Joe Besser, Curly Howard', 'Number Of Discs': '20', 'Runtime': '58 hours and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.6 Pounds', 'Item model number': '509595404', 'Media Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Run time': '58 hours and 52 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Moe Howard, Larry Fine, Curly Howard, Shemp Howard, Joe Besser', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '20'}\nReview Text: perfect\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Casino / Carlito's Way Double Feature\nReview Date: 2016/11/13\nStore: Robert De Niro  (Actor),     Al Pacino  (Actor),     Martin Scorsese  (Director, Writer),     Brian De Palma  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"Casino: Robert De Niro, Sharon Stone and Joe Pesci star in director Martin Scorsese's riveting look at how blind ambition, white-hot passion and 24-karat greed toppled an empire. Las Vegas 1973 is the setting for this fact-based story about the Mob's multi-million dollar casino operation where fortunes and lives were made and lost with a roll of the dice. Carlito's Way: From the director of Scarface comes the critically acclaimed crime thriller Carlito's Way. Oscar® winner Al Pacino gives an electrifying performance as former drug kingpin Carlito Brigante, who is sprung from prison by his high-powered attorney (Academy Award® winner Sean Penn). He stuns the New York underworld by vowing to go straight from a history of violence, but his plans are undermined by misguided loyalties and an outmoded code of honor.\", 'Bonus Content:', 'Disc 1 - Casino:', 'Casino: The Story', 'Casino: The Story', 'Deleted Scenes', 'Deleted Scenes', 'Moments with Martin Scorsese, Sharon Stone, Nicholas Pileggi and More', 'Moments with Martin Scorsese, Sharon Stone, Nicholas Pileggi and More', \"Disc 2 - Carlito's Way:\", \"Making of Carlito's Way\", \"Making of Carlito's Way\", 'Photo Gallery', 'Photo Gallery', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'MHV61124253DVD', 'Director': 'Martin Scorsese, Brian De Palma', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 24 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Robert De Niro, Al Pacino, Sharon Stone, Sean Penn, Joe Pesci', 'Subtitles': 'Spanish, French', 'Producers': 'Barbara De Fina, Martin Bregman, Willi Baer, Michael Bregman', 'Language': 'Spanish (Dolby Digital 2.0), English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Martin Scorsese, Nicholas Pileggi, David Koepp', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: good movies\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: American Psycho (Uncut Version) (Killer Collector's Edition)\nReview Date: 2017/02/11\nStore: Christian Bale  (Actor),     Justin Theroux  (Actor),     Mary Harron  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"Patrick Bateman - a Wall Street yuppie obsessed with success, status and style - is also a serial killer who murders, rapes, and mutilates both strangers and acquaintances without reason. A police detective is on his trail as Bateman's mask of studied, distant cool begins to fall apart. Direction: Mary Harron Special Features: On-Set Interviews & Behind-The-Scenes Footage; Postcards from the 80s; Director / Writer Commentary; Cast & Crew Commentary. Year: 2000 Runtime: 102 minutes.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Contributor': 'Christian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt RossChristian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt Ross  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.37 x 7.53 inches; 0.01 Ounces', 'Item model number': 'MFR031398176374#VG', 'Director': 'Mary Harron', 'Media Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Run time': '1 hour and 42 minutes', 'Release date': 'June 21, 2005', 'Actors': 'Christian Bale, Justin Theroux, Josh Lucas, Bill Sage, Chloë Sevigny', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Didn't like the movie\nReview Title: Two Stars\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Southern Comfort (Bluray/DVD Combo) [Blu-ray]\nReview Date: 2017/03/20\nStore: Keith Carradine  (Actor),     Powers Boothe  (Actor),     Walter Hill  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['From the director of The Warriors and 48 Hrs. comes this gut-wrenching tale of backwoods terror that ’draws you into the eerily beautiful Louisiana bayou...then has you running for your life’ (Pauline Kael, New Yorker)! Keith Carradine (', 'The Duellists', ') and Powers Boothe (', 'Sin City, Deadwood', ') lead a ’first-rate ensemble’ (Newsweek) in this ’exciting, arresting and tautly told suspenser’ (Variety). Nine National Guardsmen enter the Louisiana swamp for routine training, but an error in judgment by one of the team incites an all-out war with some angry Cajuns who know the territory like the backs of their hands. Armed with a precious few bullets, and confused by the dimly lit, moss-covered maze into which they’ve stumbled, the guardsmen know they’ll be picked off one by one, until they come up with a solution using the only resources they have left...their wits. Also starring Fred Ward (', 'Tremors, 2 Guns', '), T.K. Carter (', 'The Thing', '), Peter Coyote (', 'Jagged Edge', ') and Brion James (', 'Blade Runner', ').']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, NTSC, Widescreen', 'Contributor': 'Fred Ward, Walter Hill, Powers Boothe, Keith Carradine, Brion James', 'Language': 'English', 'Runtime': '1 hour and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'SFY15070BR', 'Director': 'Walter Hill', 'Media Format': 'Multiple Formats, Blu-ray, Color, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'July 8, 2014', 'Actors': 'Keith Carradine, Powers Boothe, Fred Ward, Brion James', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Sum of All Fears (Special Collector's Edition)\nReview Date: 2017/06/11\nStore: James Cromwell  (Actor),     Alan Bates  (Actor),     Phil Alden Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Morgan Freeman, Alan Bates, James Cromwell, Liev Schreiber, Phil Alden Robinson, Ben Affleck', 'Language': 'English', 'Runtime': '2 hours and 4 minutes'}\nReview Text: Ok Movie\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------",
  "reference": "Edge Throwback T-Shirt\nWWE\nMovies & TV, Genre for Featured Categories, Sports\n['Black. 100% cotton. Screen printed in the USA. Imported. \\xa0Please note: T-Shirts available in 3XL cost more. The price will reflect when you add that size to your shopping cart']\n{'Item Package Dimensions L x W x H': '7.8 x 5.8 x 5.7 inches', 'Package Weight': '4.15 Pounds', 'Brand Name': 'WWE', 'Number of Items': '21', 'Manufacturer': 'WWE', 'Size': 'XX-Large', 'Best Sellers Rank': {'Movies & TV': 237198, 'Sports': 4939}, 'Date First Available': 'June 16, 2006', 'Genre': 'Sports', 'Format': 'Color, Closed-captioned, NTSC', 'Contributor': 'Jack Simon, Glenn Jacobs, Steven Anderson, George Scott, Kevin Dunn, Chyna, David J. Lagana, Steve Austin, Mike Tyson, Ed Koskey, Tom Horn, Paul Levesque, Owen Hart, Ken Shamrock, Vince McMahon, Shawn Michaels, Mick Foley, Mark Calaway, Dwayne JohnsonJack Simon, Glenn Jacobs, Steven Anderson, George Scott, Kevin Dunn, Chyna, David J. Lagana, Steve Austin, Mike Tyson, Ed Koskey, Tom Horn, Paul Levesque, Owen Hart,…  See more', 'Language': 'English', 'Runtime': '69 hours'}\nLove this!!!!  Arrived in great shape  thanks\nFour Stars\nThe Hills Have Eyes 1/Hills Have Eyes 2\nRated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n{'Genre': 'Horror/Slasher Flicks', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'HILLS HAVE EYES 1 / HILLS HAVE EYES 2', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': 'FOXS2254525DVD', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 18 minutes', 'Release date': 'September 9, 2008', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nthank you\nFour Stars\nPrecious [DVD]\nGabourey Sidibe  (Actor),     Mo'Nique  (Actor),     Lee Daniels  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Set in Harlem in 1987, it is the story of Claireece “Precious” Jones, a sixteen-year-old African-American girl born into a life no one would want. She’s pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, a poisonously angry woman who abuses her emotionally and physically. School is a place of chaos, and Precious has reached the ninth grade with good marks and an awful secret: she can neither read nor write. Precious may sometimes be down, but she is never out. Beneath her impassive expression is a watchful, curious young woman with an inchoate but unshakeable sense that other possibilities exist for her. Threatened with expulsion, Precious is offered the chance to transfer to an alternative school, Each One/Teach One. Precious doesn’t know the meaning of “alternative,” but her instincts tell her this is the chance she has been waiting for. In the literacy workshop taught by the patient yet firm Ms. Rain, Precious begins a journey that', 'Amazon.com', 'Not every movie can survive the kind of hype--multiple awards at Sundance and other festivals, rapturous reviews, nominated for six Academy Awards and winner of two, for Best Supporting Actress and Best Screenplay--that greeted the release of', 'Precious: Based on the Novel \"Push\" by Sapphire', \", but this extraordinary piece of work is more than up to the task. What's particularly notable about the film's success and acclaim is that in the beginning, at least, it presents one of the grimmest scenarios imaginable. The scene is Harlem, New York, in 1987. Teenager Clarisse Precious Jones (played by newcomer Gabourey Sibide in an absolutely fearless performance) is dirt poor, morbidly obese, semiliterate, and pregnant for the second time--both courtesy of her own father (the first baby was born with Down syndrome). Her home life is several levels below Hell, as her bitter, vengeful welfare mother, Mary (Mo'Nique, in a role that has generated legitimate Oscar® buzz), abuses her both physically and otherwise (telling Precious she should have aborted her is only the worst of a relentless flood of insults and vitriol). Yet somehow, the young woman still has hopes and dreams (depicted in a series of delightful fantasy sequences). She enrolls in an alternative school, where a young teacher (Paula Patton) takes her under her wing and even into her home, and visits a social worker (an excellent Mariah Carey; fellow pop star Lenny Kravitz is also effective as a male nurse) who further helps bring Precious out of the darkness. Incredibly, Precious's circumstances deteriorate even more before showing the slightest sign of improvement, and a climactic confrontation with her mother is one of the more wrenching scenes in recent memory. But against all odds, director Lee Daniels, screenwriter Geoffrey Fletcher (working from Sapphire's novel), and especially the wondrously affecting Sibide have managed to make\", 'Precious', 'a film that will lift the viewer far higher up that one might ever have thought possible.', '--Sam Graham']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Lee Daniels, Mo'Nique, Gabourey Sidibe\", 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT27239DVD', 'Director': 'Lee Daniels', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'March 9, 2010', 'Actors': \"Gabourey Sidibe, Mo'Nique\", 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nskipped and locked up\nTwo Stars\nQuarantine 2: Terminal\nMercedes Masohn  (Actor),     Josh Cooke  (Actor),     John Pogue  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Earlier tonight, a bizarre disease was unleashed in a run-down Los Angeles tenement... and no one got out alive. Yet something escaped. Now, aboard Flight 318, the first symptoms begin to show. As the infection begins to takes root, innocent passengers suddenly transform into terrifying, bloodthirsty killers. Forced to land at an isolated terminal, and surrounded by armed government agents, the crew and passengers grow increasingly desperate. The only question now is how far they will go to survive.', 'Amazon.com', 'Picking up shortly after the harrowing events detailed in', 'Quarantine', '(2008), the American version of the Spanish thriller', '[Rec]', ', the 2011 thriller', 'Quarantine 2: Terminal', \"follows the effects of a lethal, rabies-like disease among the passengers of a plane. The confines of the location allow for some claustrophobic moments once the contagion begins to spread, but it's soon abandoned for a poorly lit, maze-like warehouse that creates more confusion than suspense. The homogenous characters also make it difficult to keep track of the story amidst all the screaming and spraying of bodily fluids; only Josh Cooke (\", 'Better with You', ') stands out as a kindergarten teacher with a suspicious carry-on filled with rodents. But perhaps the biggest error is the loss of the POV camerawork and real-time storytelling, which lent a palpable urgency to', 'Quarantine', 'and its Spanish predecessor, and was a clever way to use the periphery of the film frame as a hiding place for all manner of terrors. Here, the action unfolds in standard-issue fashion, which renders the film as just another zombie/outbreak chiller with only a few solid scares to recommend it. Viewers with an omnivorous and forgiving appetite for horror will most likely be the best audience for this second-tier sequel.', '--Paul Gaita']\n{'Genre': 'Horror, Thriller', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Marc Bienstock, Beau Turpin, Jason Benjamin, Mattie Liptak, Roy Lee, Doug Davison, Phillip DeVona, Ignacio Serricchio, Noree Victoria, Sandra Lafferty, Julie Gribble, Lamar Stewart, George Back, Judd Lormond, Tom Thon, Josh Cooke, Neko Parham, Tyler Kunkle, John Pogue, John Curran, Mercedes Masohn, Andrew Benator, Erin Smith, Bre Blair, Lynn Cole, Mercedes Masöhn, RCR Media Group; Stage 6 Films; Third Street PicturesMarc Bienstock, Beau Turpin, Jason Benjamin, Mattie Liptak, Roy Lee, Doug Davison, Phillip DeVona, Ignacio Serricchio, Noree Victoria, Sandra Lafferty, Julie Gribble, Lamar Stewart, George Back, Judd Lormond, Tom Thon, Josh Cooke, Neko Parham, Tyler Kunkle, John Po…   See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Item model number': '17616160', 'Director': 'John Pogue', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'August 2, 2011', 'Actors': 'Mercedes Masohn, Josh Cooke, Bre Blair, Ignacio Serricchio, Mattie Liptak', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Marc Bienstock, Roy Lee, Doug Davison', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthank you\nFour Stars\nThe Night Flier\nMiguel Ferrer  (Actor),     Julie Entwisle  (Actor),     Mark Pavia  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['Storyline Two investigative reporters for a tabloid magazine track down across country \"The Night Flier\", a serial killer who travels by private plane stalking victims in rural airports. One of the reporters, Richard Dees, begins to suspect that \"the Night Flier could perhaps be a vampire\". Written by Humberto Amador']\n{'Format': 'NTSC', 'Contributor': \"Julie Entwisle, Miguel Ferrer, Rob Wilds, John Bennes, Alfredo Cuomo, Richard K. Olsen, J.R. Rodriguez, Robert Leon Casey, Mitchell Galin, Ashton Stewart, Dan Monahan, Michael H. Moss, Jack O'Donnell, David R. Kappes, Elizabeth McCormick, Mark Pavia, Stephen King, Beverly SkinnerJulie Entwisle, Miguel Ferrer, Rob Wilds, John Bennes, Alfredo Cuomo, Richard K. Olsen, J.R. Rodriguez, Robert Leon Casey, Mitchell Galin, Ashton Stewart, Dan Monahan, Michael H. Moss, Jack O'Donnell, David R. Kappes, Elizabeth McCormick, Mark Pavia, Stephen King, Bev…  See more\", 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Mark Pavia', 'Media Format': 'NTSC', 'Run time': '1 hour and 34 minutes', 'Actors': 'Miguel Ferrer, Julie Entwisle, Dan Monahan, Michael H. Moss, John Bennes', 'Producers': \"Alfredo Cuomo, David R. Kappes, Jack O'Donnell, Mitchell Galin\", 'Writers': \"Jack O'Donnell, Mark Pavia, Stephen King\", 'Number of discs': '1'}\nclassic\nFour Stars\nThree Stooges, the - Ultimate Collection - Set\nMoe Howard  (Actor),     Larry Fine  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Includes 25 years of the Three Stooges unique brand of humor with Moe as boss, Larry the middleman and Curly as their foil. Witness the rise of these comedy icons in this high-spirited collection, which has been re-mastered for the best quality picture and sound. You'll experience the eye-pokes, face slaps, hollow head knocks and knuckle cracks like you've never heard or seen them before.\"]\n{'Genre': 'Comedy/Classic Comedies', 'Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Contributor': 'Larry Fine, Moe Howard, Shemp Howard, Joe Besser, Curly Howard', 'Number Of Discs': '20', 'Runtime': '58 hours and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.6 Pounds', 'Item model number': '509595404', 'Media Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Run time': '58 hours and 52 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Moe Howard, Larry Fine, Curly Howard, Shemp Howard, Joe Besser', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '20'}\nperfect\nFive Stars\nCasino / Carlito's Way Double Feature\nRobert De Niro  (Actor),     Al Pacino  (Actor),     Martin Scorsese  (Director, Writer),     Brian De Palma  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Casino: Robert De Niro, Sharon Stone and Joe Pesci star in director Martin Scorsese's riveting look at how blind ambition, white-hot passion and 24-karat greed toppled an empire. Las Vegas 1973 is the setting for this fact-based story about the Mob's multi-million dollar casino operation where fortunes and lives were made and lost with a roll of the dice. Carlito's Way: From the director of Scarface comes the critically acclaimed crime thriller Carlito's Way. Oscar® winner Al Pacino gives an electrifying performance as former drug kingpin Carlito Brigante, who is sprung from prison by his high-powered attorney (Academy Award® winner Sean Penn). He stuns the New York underworld by vowing to go straight from a history of violence, but his plans are undermined by misguided loyalties and an outmoded code of honor.\", 'Bonus Content:', 'Disc 1 - Casino:', 'Casino: The Story', 'Casino: The Story', 'Deleted Scenes', 'Deleted Scenes', 'Moments with Martin Scorsese, Sharon Stone, Nicholas Pileggi and More', 'Moments with Martin Scorsese, Sharon Stone, Nicholas Pileggi and More', \"Disc 2 - Carlito's Way:\", \"Making of Carlito's Way\", \"Making of Carlito's Way\", 'Photo Gallery', 'Photo Gallery', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations', ']]>']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'MHV61124253DVD', 'Director': 'Martin Scorsese, Brian De Palma', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 24 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Robert De Niro, Al Pacino, Sharon Stone, Sean Penn, Joe Pesci', 'Subtitles': 'Spanish, French', 'Producers': 'Barbara De Fina, Martin Bregman, Willi Baer, Michael Bregman', 'Language': 'Spanish (Dolby Digital 2.0), English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Martin Scorsese, Nicholas Pileggi, David Koepp', 'Country of Origin': 'USA', 'Number of discs': '2'}\ngood movies\nFour Stars\nAmerican Psycho (Uncut Version) (Killer Collector's Edition)\nChristian Bale  (Actor),     Justin Theroux  (Actor),     Mary Harron  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"Patrick Bateman - a Wall Street yuppie obsessed with success, status and style - is also a serial killer who murders, rapes, and mutilates both strangers and acquaintances without reason. A police detective is on his trail as Bateman's mask of studied, distant cool begins to fall apart. Direction: Mary Harron Special Features: On-Set Interviews & Behind-The-Scenes Footage; Postcards from the 80s; Director / Writer Commentary; Cast & Crew Commentary. Year: 2000 Runtime: 102 minutes.\"]\n{'Genre': 'Mystery & Suspense', 'Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Contributor': 'Christian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt RossChristian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt Ross  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.37 x 7.53 inches; 0.01 Ounces', 'Item model number': 'MFR031398176374#VG', 'Director': 'Mary Harron', 'Media Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Run time': '1 hour and 42 minutes', 'Release date': 'June 21, 2005', 'Actors': 'Christian Bale, Justin Theroux, Josh Lucas, Bill Sage, Chloë Sevigny', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nDidn't like the movie\nTwo Stars\nSouthern Comfort (Bluray/DVD Combo) [Blu-ray]\nKeith Carradine  (Actor),     Powers Boothe  (Actor),     Walter Hill  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['From the director of The Warriors and 48 Hrs. comes this gut-wrenching tale of backwoods terror that ’draws you into the eerily beautiful Louisiana bayou...then has you running for your life’ (Pauline Kael, New Yorker)! Keith Carradine (', 'The Duellists', ') and Powers Boothe (', 'Sin City, Deadwood', ') lead a ’first-rate ensemble’ (Newsweek) in this ’exciting, arresting and tautly told suspenser’ (Variety). Nine National Guardsmen enter the Louisiana swamp for routine training, but an error in judgment by one of the team incites an all-out war with some angry Cajuns who know the territory like the backs of their hands. Armed with a precious few bullets, and confused by the dimly lit, moss-covered maze into which they’ve stumbled, the guardsmen know they’ll be picked off one by one, until they come up with a solution using the only resources they have left...their wits. Also starring Fred Ward (', 'Tremors, 2 Guns', '), T.K. Carter (', 'The Thing', '), Peter Coyote (', 'Jagged Edge', ') and Brion James (', 'Blade Runner', ').']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, NTSC, Widescreen', 'Contributor': 'Fred Ward, Walter Hill, Powers Boothe, Keith Carradine, Brion James', 'Language': 'English', 'Runtime': '1 hour and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'SFY15070BR', 'Director': 'Walter Hill', 'Media Format': 'Multiple Formats, Blu-ray, Color, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'July 8, 2014', 'Actors': 'Keith Carradine, Powers Boothe, Fred Ward, Brion James', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie\nFive Stars\nThe Sum of All Fears (Special Collector's Edition)\nJames Cromwell  (Actor),     Alan Bates  (Actor),     Phil Alden Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Morgan Freeman, Alan Bates, James Cromwell, Liev Schreiber, Phil Alden Robinson, Ben Affleck', 'Language': 'English', 'Runtime': '2 hours and 4 minutes'}\nOk Movie\nThree Stars",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Edge Throwback T-Shirt\nReview Date: 2015/11/14\nStore: WWE\nCategories: Movies & TV, Genre for Featured Categories, Sports\nProduct Description: ['Black. 100% cotton. Screen printed in the USA. Imported. \\xa0Please note: T-Shirts available in 3XL cost more. The price will reflect when you add that size to your shopping cart']\nAverage Rating: 4.3\nProduct Details: {'Item Package Dimensions L x W x H': '7.8 x 5.8 x 5.7 inches', 'Package Weight': '4.15 Pounds', 'Brand Name': 'WWE', 'Number of Items': '21', 'Manufacturer': 'WWE', 'Size': 'XX-Large', 'Best Sellers Rank': {'Movies & TV': 237198, 'Sports': 4939}, 'Date First Available': 'June 16, 2006', 'Genre': 'Sports', 'Format': 'Color, Closed-captioned, NTSC', 'Contributor': 'Jack Simon, Glenn Jacobs, Steven Anderson, George Scott, Kevin Dunn, Chyna, David J. Lagana, Steve Austin, Mike Tyson, Ed Koskey, Tom Horn, Paul Levesque, Owen Hart, Ken Shamrock, Vince McMahon, Shawn Michaels, Mick Foley, Mark Calaway, Dwayne JohnsonJack Simon, Glenn Jacobs, Steven Anderson, George Scott, Kevin Dunn, Chyna, David J. Lagana, Steve Austin, Mike Tyson, Ed Koskey, Tom Horn, Paul Levesque, Owen Hart,…  See more', 'Language': 'English', 'Runtime': '69 hours'}\nReview Text: Love this!!!!  Arrived in great shape  thanks\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hills Have Eyes 1/Hills Have Eyes 2\nReview Date: 2015/11/14\nStore: Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Horror/Slasher Flicks', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'HILLS HAVE EYES 1 / HILLS HAVE EYES 2', 'Language': 'English', 'Number Of Discs': '1', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': 'FOXS2254525DVD', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 18 minutes', 'Release date': 'September 9, 2008', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: thank you\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Precious [DVD]\nReview Date: 2015/11/14\nStore: Gabourey Sidibe  (Actor),     Mo'Nique  (Actor),     Lee Daniels  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'Set in Harlem in 1987, it is the story of Claireece “Precious” Jones, a sixteen-year-old African-American girl born into a life no one would want. She’s pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, a poisonously angry woman who abuses her emotionally and physically. School is a place of chaos, and Precious has reached the ninth grade with good marks and an awful secret: she can neither read nor write. Precious may sometimes be down, but she is never out. Beneath her impassive expression is a watchful, curious young woman with an inchoate but unshakeable sense that other possibilities exist for her. Threatened with expulsion, Precious is offered the chance to transfer to an alternative school, Each One/Teach One. Precious doesn’t know the meaning of “alternative,” but her instincts tell her this is the chance she has been waiting for. In the literacy workshop taught by the patient yet firm Ms. Rain, Precious begins a journey that', 'Amazon.com', 'Not every movie can survive the kind of hype--multiple awards at Sundance and other festivals, rapturous reviews, nominated for six Academy Awards and winner of two, for Best Supporting Actress and Best Screenplay--that greeted the release of', 'Precious: Based on the Novel \"Push\" by Sapphire', \", but this extraordinary piece of work is more than up to the task. What's particularly notable about the film's success and acclaim is that in the beginning, at least, it presents one of the grimmest scenarios imaginable. The scene is Harlem, New York, in 1987. Teenager Clarisse Precious Jones (played by newcomer Gabourey Sibide in an absolutely fearless performance) is dirt poor, morbidly obese, semiliterate, and pregnant for the second time--both courtesy of her own father (the first baby was born with Down syndrome). Her home life is several levels below Hell, as her bitter, vengeful welfare mother, Mary (Mo'Nique, in a role that has generated legitimate Oscar® buzz), abuses her both physically and otherwise (telling Precious she should have aborted her is only the worst of a relentless flood of insults and vitriol). Yet somehow, the young woman still has hopes and dreams (depicted in a series of delightful fantasy sequences). She enrolls in an alternative school, where a young teacher (Paula Patton) takes her under her wing and even into her home, and visits a social worker (an excellent Mariah Carey; fellow pop star Lenny Kravitz is also effective as a male nurse) who further helps bring Precious out of the darkness. Incredibly, Precious's circumstances deteriorate even more before showing the slightest sign of improvement, and a climactic confrontation with her mother is one of the more wrenching scenes in recent memory. But against all odds, director Lee Daniels, screenwriter Geoffrey Fletcher (working from Sapphire's novel), and especially the wondrously affecting Sibide have managed to make\", 'Precious', 'a film that will lift the viewer far higher up that one might ever have thought possible.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Lee Daniels, Mo'Nique, Gabourey Sidibe\", 'Language': 'English', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT27239DVD', 'Director': 'Lee Daniels', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'March 9, 2010', 'Actors': \"Gabourey Sidibe, Mo'Nique\", 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: skipped and locked up\nReview Title: Two Stars\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Quarantine 2: Terminal\nReview Date: 2016/11/13\nStore: Mercedes Masohn  (Actor),     Josh Cooke  (Actor),     John Pogue  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'Earlier tonight, a bizarre disease was unleashed in a run-down Los Angeles tenement... and no one got out alive. Yet something escaped. Now, aboard Flight 318, the first symptoms begin to show. As the infection begins to takes root, innocent passengers suddenly transform into terrifying, bloodthirsty killers. Forced to land at an isolated terminal, and surrounded by armed government agents, the crew and passengers grow increasingly desperate. The only question now is how far they will go to survive.', 'Amazon.com', 'Picking up shortly after the harrowing events detailed in', 'Quarantine', '(2008), the American version of the Spanish thriller', '[Rec]', ', the 2011 thriller', 'Quarantine 2: Terminal', \"follows the effects of a lethal, rabies-like disease among the passengers of a plane. The confines of the location allow for some claustrophobic moments once the contagion begins to spread, but it's soon abandoned for a poorly lit, maze-like warehouse that creates more confusion than suspense. The homogenous characters also make it difficult to keep track of the story amidst all the screaming and spraying of bodily fluids; only Josh Cooke (\", 'Better with You', ') stands out as a kindergarten teacher with a suspicious carry-on filled with rodents. But perhaps the biggest error is the loss of the POV camerawork and real-time storytelling, which lent a palpable urgency to', 'Quarantine', 'and its Spanish predecessor, and was a clever way to use the periphery of the film frame as a hiding place for all manner of terrors. Here, the action unfolds in standard-issue fashion, which renders the film as just another zombie/outbreak chiller with only a few solid scares to recommend it. Viewers with an omnivorous and forgiving appetite for horror will most likely be the best audience for this second-tier sequel.', '--Paul Gaita']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror, Thriller', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Marc Bienstock, Beau Turpin, Jason Benjamin, Mattie Liptak, Roy Lee, Doug Davison, Phillip DeVona, Ignacio Serricchio, Noree Victoria, Sandra Lafferty, Julie Gribble, Lamar Stewart, George Back, Judd Lormond, Tom Thon, Josh Cooke, Neko Parham, Tyler Kunkle, John Pogue, John Curran, Mercedes Masohn, Andrew Benator, Erin Smith, Bre Blair, Lynn Cole, Mercedes Masöhn, RCR Media Group; Stage 6 Films; Third Street PicturesMarc Bienstock, Beau Turpin, Jason Benjamin, Mattie Liptak, Roy Lee, Doug Davison, Phillip DeVona, Ignacio Serricchio, Noree Victoria, Sandra Lafferty, Julie Gribble, Lamar Stewart, George Back, Judd Lormond, Tom Thon, Josh Cooke, Neko Parham, Tyler Kunkle, John Po…   See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Item model number': '17616160', 'Director': 'John Pogue', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 26 minutes', 'Release date': 'August 2, 2011', 'Actors': 'Mercedes Masohn, Josh Cooke, Bre Blair, Ignacio Serricchio, Mattie Liptak', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Marc Bienstock, Roy Lee, Doug Davison', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: thank you\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Night Flier\nReview Date: 2016/11/13\nStore: Miguel Ferrer  (Actor),     Julie Entwisle  (Actor),     Mark Pavia  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: ['Storyline Two investigative reporters for a tabloid magazine track down across country \"The Night Flier\", a serial killer who travels by private plane stalking victims in rural airports. One of the reporters, Richard Dees, begins to suspect that \"the Night Flier could perhaps be a vampire\". Written by Humberto Amador']\nAverage Rating: 4.5\nProduct Details: {'Format': 'NTSC', 'Contributor': \"Julie Entwisle, Miguel Ferrer, Rob Wilds, John Bennes, Alfredo Cuomo, Richard K. Olsen, J.R. Rodriguez, Robert Leon Casey, Mitchell Galin, Ashton Stewart, Dan Monahan, Michael H. Moss, Jack O'Donnell, David R. Kappes, Elizabeth McCormick, Mark Pavia, Stephen King, Beverly SkinnerJulie Entwisle, Miguel Ferrer, Rob Wilds, John Bennes, Alfredo Cuomo, Richard K. Olsen, J.R. Rodriguez, Robert Leon Casey, Mitchell Galin, Ashton Stewart, Dan Monahan, Michael H. Moss, Jack O'Donnell, David R. Kappes, Elizabeth McCormick, Mark Pavia, Stephen King, Bev…  See more\", 'Language': 'English', 'Runtime': '1 hour and 34 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Mark Pavia', 'Media Format': 'NTSC', 'Run time': '1 hour and 34 minutes', 'Actors': 'Miguel Ferrer, Julie Entwisle, Dan Monahan, Michael H. Moss, John Bennes', 'Producers': \"Alfredo Cuomo, David R. Kappes, Jack O'Donnell, Mitchell Galin\", 'Writers': \"Jack O'Donnell, Mark Pavia, Stephen King\", 'Number of discs': '1'}\nReview Text: classic\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Three Stooges, the - Ultimate Collection - Set\nReview Date: 2016/11/13\nStore: Moe Howard  (Actor),     Larry Fine  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: [\"Includes 25 years of the Three Stooges unique brand of humor with Moe as boss, Larry the middleman and Curly as their foil. Witness the rise of these comedy icons in this high-spirited collection, which has been re-mastered for the best quality picture and sound. You'll experience the eye-pokes, face slaps, hollow head knocks and knuckle cracks like you've never heard or seen them before.\"]\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Comedy/Classic Comedies', 'Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Contributor': 'Larry Fine, Moe Howard, Shemp Howard, Joe Besser, Curly Howard', 'Number Of Discs': '20', 'Runtime': '58 hours and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.6 Pounds', 'Item model number': '509595404', 'Media Format': 'Box set, Closed-captioned, Black & White, Subtitled, NTSC', 'Run time': '58 hours and 52 minutes', 'Release date': 'June 5, 2012', 'Actors': 'Moe Howard, Larry Fine, Curly Howard, Shemp Howard, Joe Besser', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '20'}\nReview Text: perfect\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Casino / Carlito's Way Double Feature\nReview Date: 2016/11/13\nStore: Robert De Niro  (Actor),     Al Pacino  (Actor),     Martin Scorsese  (Director, Writer),     Brian De Palma  (Director)    &                   1                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"Casino: Robert De Niro, Sharon Stone and Joe Pesci star in director Martin Scorsese's riveting look at how blind ambition, white-hot passion and 24-karat greed toppled an empire. Las Vegas 1973 is the setting for this fact-based story about the Mob's multi-million dollar casino operation where fortunes and lives were made and lost with a roll of the dice. Carlito's Way: From the director of Scarface comes the critically acclaimed crime thriller Carlito's Way. Oscar® winner Al Pacino gives an electrifying performance as former drug kingpin Carlito Brigante, who is sprung from prison by his high-powered attorney (Academy Award® winner Sean Penn). He stuns the New York underworld by vowing to go straight from a history of violence, but his plans are undermined by misguided loyalties and an outmoded code of honor.\", 'Bonus Content:', 'Disc 1 - Casino:', 'Casino: The Story', 'Casino: The Story', 'Deleted Scenes', 'Deleted Scenes', 'Moments with Martin Scorsese, Sharon Stone, Nicholas Pileggi and More', 'Moments with Martin Scorsese, Sharon Stone, Nicholas Pileggi and More', \"Disc 2 - Carlito's Way:\", \"Making of Carlito's Way\", \"Making of Carlito's Way\", 'Photo Gallery', 'Photo Gallery', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': 'MHV61124253DVD', 'Director': 'Martin Scorsese, Brian De Palma', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 24 minutes', 'Release date': 'October 9, 2012', 'Actors': 'Robert De Niro, Al Pacino, Sharon Stone, Sean Penn, Joe Pesci', 'Subtitles': 'Spanish, French', 'Producers': 'Barbara De Fina, Martin Bregman, Willi Baer, Michael Bregman', 'Language': 'Spanish (Dolby Digital 2.0), English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Martin Scorsese, Nicholas Pileggi, David Koepp', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: good movies\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: American Psycho (Uncut Version) (Killer Collector's Edition)\nReview Date: 2017/02/11\nStore: Christian Bale  (Actor),     Justin Theroux  (Actor),     Mary Harron  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"Patrick Bateman - a Wall Street yuppie obsessed with success, status and style - is also a serial killer who murders, rapes, and mutilates both strangers and acquaintances without reason. A police detective is on his trail as Bateman's mask of studied, distant cool begins to fall apart. Direction: Mary Harron Special Features: On-Set Interviews & Behind-The-Scenes Footage; Postcards from the 80s; Director / Writer Commentary; Cast & Crew Commentary. Year: 2000 Runtime: 102 minutes.\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Suspense', 'Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Contributor': 'Christian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt RossChristian Bale, Justin Theroux, Reese Witherspoon, Mary Harron, Josh Lucas, Willem Dafoe, Bill Sage, Jared Leto, Guinevere Turner, Samantha Mathis, Cara Seymour, Chloë Sevigny, Matt Ross  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.57 x 5.37 x 7.53 inches; 0.01 Ounces', 'Item model number': 'MFR031398176374#VG', 'Director': 'Mary Harron', 'Media Format': \"Multiple Formats, Closed-captioned, Color, Collector's Edition, NTSC\", 'Run time': '1 hour and 42 minutes', 'Release date': 'June 21, 2005', 'Actors': 'Christian Bale, Justin Theroux, Josh Lucas, Bill Sage, Chloë Sevigny', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Didn't like the movie\nReview Title: Two Stars\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Southern Comfort (Bluray/DVD Combo) [Blu-ray]\nReview Date: 2017/03/20\nStore: Keith Carradine  (Actor),     Powers Boothe  (Actor),     Walter Hill  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['From the director of The Warriors and 48 Hrs. comes this gut-wrenching tale of backwoods terror that ’draws you into the eerily beautiful Louisiana bayou...then has you running for your life’ (Pauline Kael, New Yorker)! Keith Carradine (', 'The Duellists', ') and Powers Boothe (', 'Sin City, Deadwood', ') lead a ’first-rate ensemble’ (Newsweek) in this ’exciting, arresting and tautly told suspenser’ (Variety). Nine National Guardsmen enter the Louisiana swamp for routine training, but an error in judgment by one of the team incites an all-out war with some angry Cajuns who know the territory like the backs of their hands. Armed with a precious few bullets, and confused by the dimly lit, moss-covered maze into which they’ve stumbled, the guardsmen know they’ll be picked off one by one, until they come up with a solution using the only resources they have left...their wits. Also starring Fred Ward (', 'Tremors, 2 Guns', '), T.K. Carter (', 'The Thing', '), Peter Coyote (', 'Jagged Edge', ') and Brion James (', 'Blade Runner', ').']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Blu-ray, Color, NTSC, Widescreen', 'Contributor': 'Fred Ward, Walter Hill, Powers Boothe, Keith Carradine, Brion James', 'Language': 'English', 'Runtime': '1 hour and 45 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'SFY15070BR', 'Director': 'Walter Hill', 'Media Format': 'Multiple Formats, Blu-ray, Color, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'July 8, 2014', 'Actors': 'Keith Carradine, Powers Boothe, Fred Ward, Brion James', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Sum of All Fears (Special Collector's Edition)\nReview Date: 2017/06/11\nStore: James Cromwell  (Actor),     Alan Bates  (Actor),     Phil Alden Robinson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Morgan Freeman, Alan Bates, James Cromwell, Liev Schreiber, Phil Alden Robinson, Ben Affleck', 'Language': 'English', 'Runtime': '2 hours and 4 minutes'}\nReview Text: Ok Movie\nReview Title: Three Stars\nRating: 3.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n- **Movies & TV Focus**: Strong preference for films across various genres including sports, horror, drama, action, and classic comedies.\n- **Genres**: A notable inclination towards horror and thriller movies, often engaging with both mainstream and cult classics.\n- **Favorite Elements**: Enjoys character-driven plots, especially those involving complex or dark themes, as seen in purchases related to horror and psychological drama.\n- **Classic Comedians**: Purchases reveal an appreciation for classic comedy with a specific emphasis on iconic groups, indicating nostalgia and humor preference.\n- **High Ratings**: Engaged mainly with well-reviewed titles (average ratings above 4.0), suggesting a critical selection process where quality is prioritized.\n- **Purchase Consistency**: Evidence of consistent purchasing habits within entertainment categories, highlighting loyalty to certain genres and brands (like WWE).\n- **Collector Mindset**: Interest in special editions and comprehensive collections, denoting a tendency towards collecting and enjoying media in depth.\n- **Varying Engagement**: Mixed reviews reflect a discerning viewer, capable of appreciating well-executed films but also critical when expectations aren't met.\n\nOverall, the individual's purchasing behavior indicates a invested consumer with diverse interests primarily in horror, action, and comedic genres, favoring high-quality cinematic experiences.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Loving the old sci fi’s",
    "text": "Love it. Thank you",
    "images": [],
    "asin": "B079Z26Q4G",
    "parent_asin": "B079Z26Q4G",
    "user_id": "AEIVCLCJUSFUXSI2P2WYARU6ZOZQ",
    "timestamp": "2018-08-14 13:37:47.069000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The Black Scorpion (1957) [Blu-ray]",
    "average_rating": 4.6,
    "rating_number": 621,
    "features": [],
    "description": [
      "They’re big. They’re bad. They scuttle along in caverns miles beneath the Earth – until an earthquake opens paths to the surface. Now, these monsters of genus Arachnida are invading our world with deadly force! With top special effects co-designed by King Kong’s Willis O’Brien, The Black Scorpion is horror with a sting more lethal than the king-sized ants that overran Los Angeles’ sewers in the classic Them! Can humankind survive these invincible juggernauts? That fate rests on the shoulders of Hank Scott (1950s monster-movie stalwart Richard Denning) as the creatures rip a train from its track, snatch a helicopter from the sky and, in the film’s most gripping sequence, battle each other in their subterranean lair. Watch out!"
    ],
    "price": 19.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41rXeiW3rkL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41rXeiW3rkL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Richard Denning  (Actor),     Mara Corday  (Actor),     Edward Ludwig  (Director)    &                   0                  more   Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Genre": "Horror/Things That Go Bump/Monsters, Science Fiction & Fantasy/Classic Sci-Fi",
      "Format": "Blu-ray",
      "Contributor": "Edward Ludwig, Pascual Garcia Peña, Mara Corday, Carlos Rivas, Carlos Muzquiz, Fanny Schiller, Pedro Galvan, Arturo Martinez, Richard Denning, Mario NavarroEdward Ludwig, Pascual Garcia Peña, Mara Corday, Carlos Rivas, Carlos Muzquiz, Fanny Schiller, Pedro Galvan, Arturo Martinez, Richard Denning, Mario Navarro  See more",
      "Language": "English",
      "Runtime": "1 hour and 28 minutes",
      "Product Dimensions": "7.5 x 5.5 x 0.5 inches; 2.93 Ounces",
      "Director": "Edward Ludwig",
      "Media Format": "Blu-ray",
      "Run time": "1 hour and 28 minutes",
      "Release date": "March 20, 2018",
      "Actors": "Richard Denning, Mara Corday, Carlos Rivas, Mario Navarro, Carlos Muzquiz",
      "Studio": "Warner Archives",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}