{
  "user_id": "AHQOQ4WS2SHPYJK7TFQ5S7TVXAZA",
  "summary": "=== Purchase Information ===\nProduct Title: The Electric Horseman\nReview Date: 2017/04/01\nStore: Robert Redford  (Actor),     Jane Fonda  (Actor),     Sydney Pollack  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"Robert Redford plays an ex-world champion cowboy, reduced to huckstering breakfast food in a suit studded with flashing lights. Jane Fonda is a chic, sharp member of the electronic media, a TV newswoman who'll do anything to get a good story. When Redford rides out of a Las Vegas casino into the desert astride his sponsor's living symbol, a multi-million dollar racehorse, Jane is determined to discover why. She does, one step ahead of a posse of pursuing police. But by the time they reach a remote rendezvous high in the Utah mountains, she is in love with both the cowboy and his convictions.Bonus Content:\", 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Contributor': 'Tasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry Sheehan Adair, James Novak, Will Hare, Valerie Perrine, Wilford Brimley, Sarah Harris, Sydney Pollack, Michele Heyeden, Frank Speiser, Richard Perlmutter, John Saxon, Lois Hamilton, Quinn K. RedekerTasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry She…  See more', 'Initial release date': '2003-05-06', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '1022748', 'Director': 'Sydney Pollack', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '2 hours and 2 minutes', 'Release date': 'May 6, 2003', 'Actors': 'Robert Redford, Jane Fonda, Valerie Perrine, Willie Nelson, John Saxon', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Perfect feel-good movie. Redford and Fonda have amazing chemistry. Beautiful scenery as they journey to free the horse. You won't be disappointed.\nReview Title: Great!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Child's Play [DVD]\nReview Date: 2019/07/05\nStore: Catherine Hicks  (Actor),     Chris Sarandon  (Actor),     Tom Holland  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['The \"chills come thick and fast\" (Los Angeles Times) as voodoo and terror meet within an innocent-looking doll inhabited by the soul of a serial killer who isn\\'t ready to die. From the Director of Fright Night comes a \"clever, playful\" (The New York Times) and stylish thriller with \"excellent special effects\" (Leonard Maltin) and heart-pounding suspense guaranteed to scare! After 6-year-old Andy Barclay\\'s (Alex Vincent) babysitter is violently pushed out of a window to her death, nobody believes him when he says that \"Chucky,\" his new birthday doll, did it! Untilthings start going terribly wrong dead wrong. And when an ensuing rampage of gruesome murders lead a detective (Chris Sarandon) back to the same toy, he discovers that the real terror has just begun\\'the deranged doll has plans to transfer his evil spirit into a living human beingyoung Andy!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Contributor': 'Brad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil GiuntoliBrad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil Giuntoli  See more', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Tom Holland', 'Media Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Run time': '1 hour and 27 minutes', 'Release date': 'September 28, 1999', 'Actors': 'Catherine Hicks, Chris Sarandon, Alex Vincent, Brad Dourif, Dinah Manoff', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Don Mancini, John Lafia, Tom Holland', 'Number of discs': '1'}\nReview Text: Kind of confused because I ordered the movie Child's Play, but received it as part of a three part movie disc with Amityville Horror and Carrie. I guess it was ok, but I only wanted Child's Play. So, not sure what anyone else will get.\nReview Title: You get the movie, but.........\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Nightmare on Elm Street 1-4 (A Nightmare on Elm Street, Nightmare on Elm Street 2: Freddie's Revenge, Nightmare on Elm Street 3: Dream Warriors, Nightmare on Elm Street 4: The Dream Master)\nReview Date: 2019/07/12\nStore: Robert Englund  (Actor),     Johnny Depp  (Actor),     Wes Craven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Product Description', \"Titles include: A Nightmare On Elmstreet, A Nightmare On Elmstreet 2: Freddy's Revenge, A Nightmare On Elmstreet 3: Dream Warriors, A Nightmare On Elmstreet 4: The Dream Master\", 'Amazon.com', \"In the trinity of modern horror films, there's the father (Michael Myers of Halloween), the son (Jason of Friday the13th fame, a knockoff), and the unholy spirit, Freddy Krueger of the Nightmare on Elm Street films. The spectral man who haunted the nightmares of unsuspecting teenagers with deadly consequences, Freddy (as played by Robert Englund) was a truly frightening bogeyman and icon for the '80s. Unlike the hockey-masked Jason, who dispatched horny teenagers with mechanical and monotonous ease (he never talked, never took off his mask), Freddy was a truly creative and diabolical villain, with a sadistic and blackly funny personality. The hallmarks of the Nightmare on Elm Street series were imaginatively gruesome suspense pieces, set in the overactive imaginations of the teen victims. The first film of the series, Wes Craven's truly intelligent and scary film, was so hugely successful it begat not one, not two, but six more sequels, each pretty much diluting the originality and horror of its predecesor. (Horror fans will fondly remember Drew Barrymore's assertion in Scream that the first Nightmare film was great but all the rest sucked.) Still, there's fun to be had in the remaining films in the series, seeing as a number of aspiring filmmakers cut their teeth on the continuing saga of Freddy. Frank Darabont (The Shawshank Redemption) and Chuck Russell (The Mask) worked on the third installment, Dream Warriors (starring a young Patricia Arquette), and Renny Harlin (Die Hard 2) came to prominence with the ingeniously macabre fourth film, The Dream Master, coscripted by Brian Helgeland (L.A. Confidential). Craven and original star Heather Langenkamp did return for the last film, New Nightmare, which presaged the tongue-in-cheek postmodernism of the Scream films and resharpened Freddy's ability to scare. --Mark Englehart\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Contributor': 'Patricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark PattonPatricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark Patton   See more', 'Initial release date': '2008-10-14', 'Language': 'English', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '5.39 x 7.48 x 0.63 inches; 3.03 Ounces', 'Item model number': 'WARD042244D', 'Director': 'Wes Craven', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Run time': '6 hours and 14 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Robert Englund, Johnny Depp, Patricia Arquette, Mark Patton, Kim Myers', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nReview Text: Collecting the entire Nightmare series and this was an inexpensive way to begin.\nReview Title: 4 movies for one price!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Nightmare on Elm Street 5-8 (Freddy vs Jason, Freddy's Dead: The Final Nightmare, Nightmare on Elm Street 5: The Dream Child, Wes Craven's New Nightmare)\nReview Date: 2019/07/12\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['4 Film Favorites: Nightmare on Elm Street 5-8 (DVD)', \"Titles include: A Nightmare On Elmstreet 5: The Dream Child, Freddy's Dead The Final Nightmare, Wes Craven's New Nightmare, Freddy Vs. Jason\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'NEWL1000042232DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours and 15 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: Own the the first four in the series, now my collection is complete!\nReview Title: Completed my collection!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jason Goes to Hell\nReview Date: 2019/07/12\nStore: Adam Marcus  (Director),     John D. LeMay  (Actor),     Kari Keegan  (Actor)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Product Description', 'Jason Goes to Hell (DVD)', \"Jason Voorhees, the living, breathing essence of evil, is back for onefierce, final fling! Tracked down and blown to bits by a special FBItask force, everyone now assumes that he's finally dead. But everybodyassumes wrong. Jason has been reborn with the bone-chilling ability toassume the identity of anyone he touches. The terrifying truth is thathe could be anywhere, or anybody. In this shocking, blood-soaked finaleto Jason's carnage-ridden reign of terror, the horrible secret of hisunstoppable killing instinct is finally revealed. And once you know thechilling facts, you'll see him in your nightmares!\", ']]>', 'Amazon.com', \"Blow mad killer Jason Voorhees to smithereens in the opening sequence of the movie? Sorry, folks, you have to do better than that. Jason's evil spirit finds its way into a series of host bodies, thus continuing the carnage at Crystal Lake, in\", 'Jason Goes to Hell: The Final Friday', '. Naturally, part 9 is not the final', 'Friday the 13th', \"movie (no big deal: part 4, you'll recall, was titled\", 'The Final Chapter', '). Jason confronts a long-lost sister at the lake, while the usual assortment of naked teens are dispatched. This one tries to vary the formula a bit but ends up with a story line every bit as nonsensical as those that came before. The final sequence tries to put Jason away for keeps and calls upon the demons of hell for support. The last shot is an outrageous joke, which is perhaps what this franchise deserves.', '--Robert Horton', 'Set Contains:', \"The DVD contains both the R-rated and unrated versions of the picture, plus a commentary track with director Adam Marcus and screenwriter Dean Lorey, during which the two friends chortle frequently about the movie. Among the revelations: series producer Sean S. Cunningham asked them to get rid of Jason's hockey mask once and for all.\", '--Robert Horton', 'See more']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Horror', 'Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Contributor': 'Erin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven CulpErin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven Culp   See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.5 x 0.4 inches; 2.4 Ounces', 'Item model number': 'MFR794043562624#VG', 'Director': 'Adam Marcus', 'Media Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 27, 2005', 'Actors': 'John D. LeMay, Kari Keegan, Erin Gray, Allison Smith, Steven Culp', 'Subtitles': 'English', 'Producers': 'Sean S. Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Dean Lorey, Jay Hoguely', 'Number of discs': '1'}\nReview Text: Finished my Friday the 13th collection! Not by any means the best movie in the series, but I am a big horror fan and am trying to collect classic horror series.\nReview Title: My collection is complete!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Return of the Living Dead (Collector's Edition)\nReview Date: 2019/09/07\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Return of the Living Dead: Specil Edition (RPKG/FP/DVD)', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Horror/Things That Go Bump/Monsters', 'Format': 'Multiple Formats, Special Edition, Widescreen, Color, Subtitled, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS108547DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Special Edition, Widescreen, Color, Subtitled, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this crazy movie! A must for goofy horror fans!\nReview Title: Crazy horror!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: John Wick: Chapter 3 – Parabellum\nReview Date: 2019/12/25\nStore: Keanu Reeves  (Actor),     Ian McShane  (Actor),     Chad Stahelski  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"Super assassin John Wick is on the run after killing a member of the international assassin's guild, and with a $14 million price tag on his head he is the target of hit men and women everywhere.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action', 'Format': 'NTSC, Subtitled', 'Contributor': 'Basil Iwanyk, Chad Stahelski, Halle Berry, David Leitch, Lance Reddick, Ian McShane, Keanu Reeves, Summit Entertainment, Laurence FishburneBasil Iwanyk, Chad Stahelski, Halle Berry, David Leitch, Lance Reddick, Ian McShane, Keanu Reeves, Summit Entertainment, Laurence Fishburne  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': 'B07QLB71HL', 'Director': 'Chad Stahelski', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 11 minutes', 'Release date': 'September 10, 2019', 'Actors': 'Keanu Reeves, Ian McShane, Halle Berry, Lance Reddick, Laurence Fishburne', 'Producers': 'Basil Iwanyk, David Leitch', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Have John Wick and John Wick 2. Had to get the third one. Great series!\nReview Title: Great series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Howl\nReview Date: 2020/07/22\nStore: Ed Speelers  (Actor),     Sean Pertwee  (Actor),     Paul Hyett  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: [\"On a dark and stormy night the last train out of London comes to a sudden halt deep in the middle of a forest. After the driver ventures out to investigate and never returns, the passengers are in a state of panic - particularly after seeing the driver's mutilated body outside the carriage. Realizing there's something dangerous lurking in the forest, a ticket-collector, Joe (Ed Speleers), tells the passengers to make barricades to secure themselves in the carriage, but soon the deadly creature is stalking the besieged train and smashing through their defenses, picking them off one-by-one. Joe rallies his pack of passengers to fight back. During a vicious battle they manage to kill the creature, revealing it to be a hideous mutated fusion of human and wild animal - a werewolf. However, celebrations are cut short when they hear more howls coming from the forest...\"]\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Ed Speelers, Sean Pertwee, Shauna McDonald, Paul Hyett, Elliot Cowan', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Paul Hyett', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 12, 2016', 'Actors': 'Ed Speelers, Sean Pertwee, Shauna McDonald, Elliot Cowan', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nReview Text: Big horror fan and this one delivers! You come to care about the characters also which is important to me. Being on the train is claustrophobic and adds to the scariness. Werewolves are super cool!\nReview Title: Great werewolf movie!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hellfighters [DVD]\nReview Date: 2020/09/26\nStore: John Wayne  (Actor),     Katharine Ross  (Actor),     Andrew V. McLaglen  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, John Wayne Store, All Titles\nProduct Description: ['Product Description', 'Screen legend John Wayne pays tribute to oil field legend \"Red\" Adair, as Wayne plays Chance Buckman, a colorful Texan who tames out-of-control infernos in exotic locations around the world. He\\'s joined by a crew that includes Jack Lomax (Jay C. Flippen), Joe Horn (Bruce Cabot), and his assistant, Greg Parker (Jim Hutton). Between blazes Chance \"carries the torch\" for Madelyn, the wife who left him 20 years earlier because of his dangerous lifestyle, and Greg has his hands full at the poker table and in the bedroom with Chance\\'s spunky daughter, Tish (Katharine Ross).Directed by action veteran, Andrew V. McLaglen, this film features spectacular special effects and exciting locations in Texas and Wyoming. As the Duke said, \"I\\'ve made a lot of action movies, but never one as exciting as Hellfighters.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', ']]>', 'Amazon.com', 'Fans of', 'Armageddon', 'might see one or two resemblances between that 1998 box office hit and', 'Hellfighters', \", a 1968 action film by Andrew V. McLaglen, one of John Wayne's favorite directors in his late career. (Their joint ventures included\", 'Chisum', ',', 'Cahill: United States Marshal', ', and', 'McLintock!', \") Wayne plays an oil well firefighter in the mold of Red Adair, turning up anywhere in the world where a geyser of fire is shooting up from a once-profitable gusher. His right-hand man (Jim Hutton) has questionable judgment about safety matters and is a scoundrel with the ladies--and neither fact is lost on Wayne when Hutton's character marries his long-lost daughter (Katharine Ross, a mere year after\", 'The Graduate', \"). The film is an early entry in the disaster-meets-soap-opera genre that flourished in the '70s with such titles as\", 'The Towering Inferno', 'and', 'The Poseidon Adventure', '. McClaglen gets a lot of crackle out of his action scenes (many of the firefighting sequences are still startling in their intensity) and turns twin love stories (Hutton and Ross, Wayne and Vera Miles) into frothy studies of adult manners, with equal hints of Howard Hawks and Sidney Sheldon. The widescreen image on DVD offers viewers a chance to see what was then a developing vogue for gratuitous breadth and scope in all its goofy, self-congratulatory glory. (Is it necessary to look at a golf course the way one might look at an African veldt?', 'Hellfighters', 'says yes!) The DVD also includes production notes and written bios on the stars, plus optional French and Spanish subtitles and an optional Spanish soundtrack. The cast and sundry thrills make this film highly enjoyable, and easily forgivable for indulging in such inanities as a subplot concerning--hold on--Venezuelan terrorists! The Duke lives!', '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Contributor': 'John Wayne, Jay C. Flippen, Bruce Cabot, Robert Arthur, Katharine Ross, Jim Hutton, Andrew V. McLaglen, Vera Miles, Clair HuffakerJohn Wayne, Jay C. Flippen, Bruce Cabot, Robert Arthur, Katharine Ross, Jim Hutton, Andrew V. McLaglen, Vera Miles, Clair Huffaker  See more', 'Initial release date': '2003-09-02', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 122 min', 'Director': 'Andrew V. McLaglen', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 2 minutes', 'Release date': 'September 2, 2003', 'Actors': 'John Wayne, Katharine Ross, Jim Hutton, Vera Miles, Jay C. Flippen', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Robert Arthur', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Clair Huffaker', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great old movie! Not really a big John Wayne fan, but the supporting players make it for me.! Jim Hutton and Katherine Ross have great chemistry. She brings feminist ideas to a man's world of oil fire fighting. The fire fighting scenes are very exciting! Highly recommend!\nReview Title: Exciting and great acting!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tarantula\nReview Date: 2022/06/15\nStore: Jack Arnold  (Director),     John Agar  (Actor),     Mara Corday  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['You can run and you can hide but there is no escaping the sci-fi classic Tarantula about a science experiment gone horribly wrong! When biochemist Leo Carroll (John Agar) decides to feed the world by using a special growth formula on plants and animals, he instead creates a spider of mammoth proportions with an appetite to match. Escaping from the laboratory and feeding off cattle and humans, this towering tarantula has the people of Desert Rock, Arizona, running for their lives. Can this horrible creature be stopped or will the world succumb to this oversized arachnid?']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Horror', 'Format': 'Black & White, NTSC', 'Contributor': 'John Agar, Mara Corday, Ross Elliott, Steve Darrell, Bert Holland, Nestor Paiva, Martin Berkeley, Hank Patterson, Edwin Rand, Raymond Bailey, Jack Arnold, Leo G. Carroll, Robert M. Fresco, William AllandJohn Agar, Mara Corday, Ross Elliott, Steve Darrell, Bert Holland, Nestor Paiva, Martin Berkeley, Hank Patterson, Edwin Rand, Raymond Bailey, Jack Arnold, Leo G. Carroll, Robert M. Fresco, William Alland  See more', 'Language': 'English', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.61 Ounces', 'Item model number': 'AVMDU96839D', 'Director': 'Jack Arnold', 'Media Format': 'Black & White, NTSC', 'Run time': '1 hour and 21 minutes', 'Release date': 'July 27, 2011', 'Actors': 'John Agar, Mara Corday, Leo G. Carroll, Nestor Paiva, Ross Elliott', 'Producers': 'William Alland', 'Studio': 'Universal Studios', 'Writers': 'Robert M. Fresco, Martin Berkeley', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I was so excited to get this movie because I remembered watching it as a child. The disc said Tarantula on it, but when I put it in to play it was an old western movie. Somehow this movie was mislabeled or something.  Am returning and just be aware you may not get the correct movie!\nReview Title: Not the right movie!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Classic Sci-fi Ultimate Collection (Tarantula / The Mole People / The Incredible Shrinking Man / The Monolith Monsters / Monster on the Campus)\nReview Date: 2022/06/17\nStore: John Agar  (Actor),     Grant Williams  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', \"There's nowhere to run and nowhere to hide with The Classic Sci-Fi Ultimate Collection! This fascinating collection will shock, terrify and captivate you with five film favorites from the golden age of Hollywood—Tarantula, The Mole People, The Incredible Shrinking Man, The Monolith Monsters and Monster on the Campus. Featuring amazing, groundbreaking special effects, these classics set the standard for all sci-fi terror to come!\", 'Bonus Content:', 'Disc 1 - Tarantula:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 1 - The Mole People:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - The Incredible Shrinking Man:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - The Monolith Monsters:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 3 - Monster on the Campus:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"A quintet of fun '50s science-fiction thrillers from the Universal vaults make their DVD debut in this three-disc set that's sure to please fans of vintage creature features. Arguably, the best of the lot is\", 'The Incredible Shrinking Man', '(1957), with Grant Williams as a businessman whose exposure to a radioactive cloud causes him to decrease in size exponentially until he is literally microscopic. Based on a novel by legendary fantasy writer Richard Matheson, director Jack (', 'Creature from the Black Lagoon', \") Arnold's balance of suspense (Williams' battles with a house cat and common spider) and pathos (the effect his condition has on his marriage) make it one of the most memorable science-fiction films of the decade, and a favorite even of those with only a passing interest in the genre. On the entirely other end of the spectrum is\", 'The Mole People', '(1956), a loopy pulp adventure with John Agar and Hugh (', 'Leave It to Beaver', ') Beaumont as intrepid adventurers who discover a lost city and the title creatures at a top of a Middle Eastern mountain. Campy to a fault, with a logic-straining script and ridiculous monsters,', 'The Mole People', \"is also a goofy good time for B-movie mavens. Agar, whose faded star power forced him to seek work in low-budget films during the '50s and '60s, also turns up in the effective\", 'Tarantula', '(1955), a fast-paced \"big bug\" creepshow modeled after', 'Them!.', '(1954), and featuring a cameo by Clint Eastwood as a jet pilot; the rest of the set is rounded out by the truly wacky', 'Monster on the Campus', '(1958), with Arthur Franz as a college professor whose exposure to a prehistoric fish turns him into a rampaging Neanderthal, and', 'The Monolith Monsters', '(1957), about fragments of a meteor that grow to colossal heights when exposed to water and threaten a small desert community. For TV babies that grew up on a steady diet of Saturday afternoon monster movies,', 'The Classic Sci-Fi Ultimate Collection', 'offers a nostalgic trip back to those cathode-soaked days, but without the barrage of commercials. The set offers trailers for each film by way of extras, as well as an anamorphic presentation of', 'The Incredible Shrinking Man', '; the rest of the titles are presented in full screen.', '-- Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Suspense, Science Fiction', 'Format': 'Black & White, NTSC', 'Contributor': 'John Agar, Grant Williams, Joanna Moore', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Media Format': 'Black & White, NTSC', 'Run time': '6 hours and 35 minutes', 'Release date': 'February 16, 2016', 'Actors': 'John Agar, Grant Williams, Joanna Moore', 'Subtitles': 'English', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I bought this for Tarantula, after the last DVD I bought of it was mislabeled and turned out to be some old western! This is perfect, very good quality picture and sound! Haven't watched the others yet, but I'm sure I will enjoy them! Reminds me of watching Creature Features with my brother when  we were kids!\nReview Title: Great old monster movies!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Universal Classic Monsters Collection\nReview Date: 2022/10/13\nStore: Bela Lugosi  (Actor),     Boris Karloff  (Actor),     Tod Browning  (Director, Producer),     Karl Freund  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Classics\nProduct Description: ['From the era of silent movies through present day, Universal Pictures has been regarded as the home of the monsters. The Universal Classic Monsters Collection showcases 6 of the most iconic monsters in motion picture history including Dracula, Frankenstein, The Mummy, The Invisible Man, The Bride of Frankenstein and The Wolf Man. Starring Bela Lugosi, Boris Karloff, Lon Chaney Jr., Claude Rains and Elsa Lanchester in the roles that they made famous, these original films set the standard for a new horror genre with revolutionary makeup, mood-altering cinematography and groundbreaking special effects. Featuring over 10 hours of revealing bonus features, each film has been digitally remastered for an unforgettable classic monster experience.Bonus Content:', 'Disc 1 - Dracula (1931):', 'The Road to Dracula', 'The Road to Dracula', 'Lugosi: The Dark Prince', 'Lugosi: The Dark Prince', 'Dracula Archives', 'Dracula Archives', 'Theatrical Trailer', 'Theatrical Trailer', 'Alternate Score by Phillip Glass Performed by the Kronos Quartet', 'Alternate Score by Phillip Glass Performed by the Kronos Quartet', 'Feature Commentary with Film Historian David J. Skal', 'Feature Commentary with Film Historian David J. Skal', 'Feature Commentary with Steve Haberman, Screenwriter of Dracula: Dead and Loving It', 'Feature Commentary with Steve Haberman, Screenwriter of Dracula: Dead and Loving It', 'Disc 2 - Frankenstein:', 'The Frankenstein Files: How Hollywood Made a Monster', 'The Frankenstein Files: How Hollywood Made a Monster', 'Karloff: The Gentle Monster', 'Karloff: The Gentle Monster', 'Frankenstein Archives', 'Frankenstein Archives', 'Boo! A Short Film', 'Boo! A Short Film', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Historian Sir Christopher Frayling', 'Feature Commentary with Historian Sir Christopher Frayling', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 3 - The Bride of Frankenstein:', \"She's Alive! Creating The Bride of Frankenstein\", \"She's Alive! Creating The Bride of Frankenstein\", 'The Bride of Frankenstein Archives', 'The Bride of Frankenstein Archives', 'Feature Commentary with Scott MacQueen', 'Feature Commentary with Scott MacQueen', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 4 - The Wolf Man:', 'Monster by Moonlight: An Original Documentary', 'Monster by Moonlight: An Original Documentary', 'The Wolf Man: From Ancient Curse to Modern Myth', 'The Wolf Man: From Ancient Curse to Modern Myth', 'Pure in Heart: the Life and Legacy of Lon Chaney, Jr.', 'Pure in Heart: the Life and Legacy of Lon Chaney, Jr.', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'The Wolf Man Archives', 'The Wolf Man Archives', 'Feature Commentary with Film Historian Tom Weaver', 'Feature Commentary with Film Historian Tom Weaver', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 5 - The Invisible Man (1933):', 'Now You See Him: The Invisble Man Revealed', 'Now You See Him: The Invisble Man Revealed', 'Production Photographs', 'Production Photographs', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Film Historian Rudy Behlmer', 'Disc 6 - The Mummy (1932):', 'Mummy Dearest: A Horror Tradition Unearthed', 'Mummy Dearest: A Horror Tradition Unearthed', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'Unraveling The Legacy Of The Mummy', 'Unraveling The Legacy Of The Mummy', 'The Mummy Archives', 'The Mummy Archives', 'Feature Commentary By Rick Baker, Scott Essman, Steve Haberman, Bob Burns, And Brent Armstrong [On/Off]', 'Feature Commentary By Rick Baker, Scott Essman, Steve Haberman, Bob Burns, And Brent Armstrong [On/Off]', 'Feature Commentary By Film Historian Paul M. Jensen.', 'Feature Commentary By Film Historian Paul M. Jensen.', 'Theatrical Trailer', 'Theatrical Trailer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Horror, Suspense', 'Format': 'Multiple Formats, Box set, Black & White, NTSC', 'Contributor': \"Maria Ouspenskaya, Gavin Gordon, Gloria Stuart, James Whale, Gilbert Kurland, John Boles, Carl Laemmle, Jr., David Manners, Una O'Connor, Frederic Kerr, Bramwell Fletcher, Evelyn Ankers, Ralph Bellamy, R.C. Sherriff, William Hurlbut, Valerie Hobson, Mae Clarke, Boris Karloff, Forrester Harvey, Claude Rains, Zita Johann, Dwight Frye, Elsa Lanchester, Helen Chandler, O.P. Heggie, Karl Freund, Dudley Digges, Edward Van Sloan, Henry Travers, Lon Chaney, Jr., Colin Clive, Ernest Thesiger, William Harrigan, Arthur Byron, Tod Browning, John L. Balderston, George Waggner, Douglas Walton, Francis Edwards Faragoh, Bela Lugosi, Frances Dade, Warren William, Garrett Fort, Patric Knowles, Curt SiodmakMaria Ouspenskaya, Gavin Gordon, Gloria Stuart, James Whale, Gilbert Kurland, John Boles, Carl Laemmle, Jr., David Manners, Una O'Connor, Frederic Kerr, Bramwell Fletcher, Evelyn Ankers, Ralph Bellamy, R.C. Sherriff, William Hurlbut, Valerie Hobson, Mae Clarke, Boris Karl…   See more\", 'Initial release date': '2015-09-08', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '34272131', 'Director': 'Tod Browning, Karl Freund, James Whale, George Waggner', 'Media Format': 'Multiple Formats, Box set, Black & White, NTSC', 'Run time': '7 hours and 17 minutes', 'Release date': 'September 8, 2015', 'Actors': 'Bela Lugosi, Boris Karloff, Lon Chaney, Jr., Claude Rains, David Manners', 'Subtitles': 'French, Spanish', 'Producers': 'Carl Laemmle, Jr., Tod Browning, George Waggner', 'Studio': 'Studio Distribution Services', 'Writers': 'John L. Balderston, Garrett Fort, R.C. Sherriff, Francis Edwards Faragoh, Curt Siodmak', 'Number of discs': '6'}\nReview Text: I watched these all on TV as a child in the 60's and I am happy to own them today! Still give me chills! Great collection!\nReview Title: Classic monster movies!\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Electric Horseman\nRobert Redford  (Actor),     Jane Fonda  (Actor),     Sydney Pollack  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Robert Redford plays an ex-world champion cowboy, reduced to huckstering breakfast food in a suit studded with flashing lights. Jane Fonda is a chic, sharp member of the electronic media, a TV newswoman who'll do anything to get a good story. When Redford rides out of a Las Vegas casino into the desert astride his sponsor's living symbol, a multi-million dollar racehorse, Jane is determined to discover why. She does, one step ahead of a posse of pursuing police. But by the time they reach a remote rendezvous high in the Utah mountains, she is in love with both the cowboy and his convictions.Bonus Content:\", 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\n{'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Contributor': 'Tasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry Sheehan Adair, James Novak, Will Hare, Valerie Perrine, Wilford Brimley, Sarah Harris, Sydney Pollack, Michele Heyeden, Frank Speiser, Richard Perlmutter, John Saxon, Lois Hamilton, Quinn K. RedekerTasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry She…  See more', 'Initial release date': '2003-05-06', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '1022748', 'Director': 'Sydney Pollack', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '2 hours and 2 minutes', 'Release date': 'May 6, 2003', 'Actors': 'Robert Redford, Jane Fonda, Valerie Perrine, Willie Nelson, John Saxon', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPerfect feel-good movie. Redford and Fonda have amazing chemistry. Beautiful scenery as they journey to free the horse. You won't be disappointed.\nGreat!\nChild's Play [DVD]\nCatherine Hicks  (Actor),     Chris Sarandon  (Actor),     Tom Holland  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['The \"chills come thick and fast\" (Los Angeles Times) as voodoo and terror meet within an innocent-looking doll inhabited by the soul of a serial killer who isn\\'t ready to die. From the Director of Fright Night comes a \"clever, playful\" (The New York Times) and stylish thriller with \"excellent special effects\" (Leonard Maltin) and heart-pounding suspense guaranteed to scare! After 6-year-old Andy Barclay\\'s (Alex Vincent) babysitter is violently pushed out of a window to her death, nobody believes him when he says that \"Chucky,\" his new birthday doll, did it! Untilthings start going terribly wrong dead wrong. And when an ensuing rampage of gruesome murders lead a detective (Chris Sarandon) back to the same toy, he discovers that the real terror has just begun\\'the deranged doll has plans to transfer his evil spirit into a living human beingyoung Andy!']\n{'Genre': 'Mystery & Thrillers', 'Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Contributor': 'Brad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil GiuntoliBrad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil Giuntoli  See more', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Tom Holland', 'Media Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Run time': '1 hour and 27 minutes', 'Release date': 'September 28, 1999', 'Actors': 'Catherine Hicks, Chris Sarandon, Alex Vincent, Brad Dourif, Dinah Manoff', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Don Mancini, John Lafia, Tom Holland', 'Number of discs': '1'}\nKind of confused because I ordered the movie Child's Play, but received it as part of a three part movie disc with Amityville Horror and Carrie. I guess it was ok, but I only wanted Child's Play. So, not sure what anyone else will get.\nYou get the movie, but.........\n4 Film Favorites: Nightmare on Elm Street 1-4 (A Nightmare on Elm Street, Nightmare on Elm Street 2: Freddie's Revenge, Nightmare on Elm Street 3: Dream Warriors, Nightmare on Elm Street 4: The Dream Master)\nRobert Englund  (Actor),     Johnny Depp  (Actor),     Wes Craven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Product Description', \"Titles include: A Nightmare On Elmstreet, A Nightmare On Elmstreet 2: Freddy's Revenge, A Nightmare On Elmstreet 3: Dream Warriors, A Nightmare On Elmstreet 4: The Dream Master\", 'Amazon.com', \"In the trinity of modern horror films, there's the father (Michael Myers of Halloween), the son (Jason of Friday the13th fame, a knockoff), and the unholy spirit, Freddy Krueger of the Nightmare on Elm Street films. The spectral man who haunted the nightmares of unsuspecting teenagers with deadly consequences, Freddy (as played by Robert Englund) was a truly frightening bogeyman and icon for the '80s. Unlike the hockey-masked Jason, who dispatched horny teenagers with mechanical and monotonous ease (he never talked, never took off his mask), Freddy was a truly creative and diabolical villain, with a sadistic and blackly funny personality. The hallmarks of the Nightmare on Elm Street series were imaginatively gruesome suspense pieces, set in the overactive imaginations of the teen victims. The first film of the series, Wes Craven's truly intelligent and scary film, was so hugely successful it begat not one, not two, but six more sequels, each pretty much diluting the originality and horror of its predecesor. (Horror fans will fondly remember Drew Barrymore's assertion in Scream that the first Nightmare film was great but all the rest sucked.) Still, there's fun to be had in the remaining films in the series, seeing as a number of aspiring filmmakers cut their teeth on the continuing saga of Freddy. Frank Darabont (The Shawshank Redemption) and Chuck Russell (The Mask) worked on the third installment, Dream Warriors (starring a young Patricia Arquette), and Renny Harlin (Die Hard 2) came to prominence with the ingeniously macabre fourth film, The Dream Master, coscripted by Brian Helgeland (L.A. Confidential). Craven and original star Heather Langenkamp did return for the last film, New Nightmare, which presaged the tongue-in-cheek postmodernism of the Scream films and resharpened Freddy's ability to scare. --Mark Englehart\"]\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Contributor': 'Patricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark PattonPatricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark Patton   See more', 'Initial release date': '2008-10-14', 'Language': 'English', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '5.39 x 7.48 x 0.63 inches; 3.03 Ounces', 'Item model number': 'WARD042244D', 'Director': 'Wes Craven', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Run time': '6 hours and 14 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Robert Englund, Johnny Depp, Patricia Arquette, Mark Patton, Kim Myers', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nCollecting the entire Nightmare series and this was an inexpensive way to begin.\n4 movies for one price!\n4 Film Favorites: Nightmare on Elm Street 5-8 (Freddy vs Jason, Freddy's Dead: The Final Nightmare, Nightmare on Elm Street 5: The Dream Child, Wes Craven's New Nightmare)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['4 Film Favorites: Nightmare on Elm Street 5-8 (DVD)', \"Titles include: A Nightmare On Elmstreet 5: The Dream Child, Freddy's Dead The Final Nightmare, Wes Craven's New Nightmare, Freddy Vs. Jason\", ']]>']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'NEWL1000042232DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours and 15 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nOwn the the first four in the series, now my collection is complete!\nCompleted my collection!\nJason Goes to Hell\nAdam Marcus  (Director),     John D. LeMay  (Actor),     Kari Keegan  (Actor)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Product Description', 'Jason Goes to Hell (DVD)', \"Jason Voorhees, the living, breathing essence of evil, is back for onefierce, final fling! Tracked down and blown to bits by a special FBItask force, everyone now assumes that he's finally dead. But everybodyassumes wrong. Jason has been reborn with the bone-chilling ability toassume the identity of anyone he touches. The terrifying truth is thathe could be anywhere, or anybody. In this shocking, blood-soaked finaleto Jason's carnage-ridden reign of terror, the horrible secret of hisunstoppable killing instinct is finally revealed. And once you know thechilling facts, you'll see him in your nightmares!\", ']]>', 'Amazon.com', \"Blow mad killer Jason Voorhees to smithereens in the opening sequence of the movie? Sorry, folks, you have to do better than that. Jason's evil spirit finds its way into a series of host bodies, thus continuing the carnage at Crystal Lake, in\", 'Jason Goes to Hell: The Final Friday', '. Naturally, part 9 is not the final', 'Friday the 13th', \"movie (no big deal: part 4, you'll recall, was titled\", 'The Final Chapter', '). Jason confronts a long-lost sister at the lake, while the usual assortment of naked teens are dispatched. This one tries to vary the formula a bit but ends up with a story line every bit as nonsensical as those that came before. The final sequence tries to put Jason away for keeps and calls upon the demons of hell for support. The last shot is an outrageous joke, which is perhaps what this franchise deserves.', '--Robert Horton', 'Set Contains:', \"The DVD contains both the R-rated and unrated versions of the picture, plus a commentary track with director Adam Marcus and screenwriter Dean Lorey, during which the two friends chortle frequently about the movie. Among the revelations: series producer Sean S. Cunningham asked them to get rid of Jason's hockey mask once and for all.\", '--Robert Horton', 'See more']\n{'Genre': 'Horror', 'Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Contributor': 'Erin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven CulpErin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven Culp   See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.5 x 0.4 inches; 2.4 Ounces', 'Item model number': 'MFR794043562624#VG', 'Director': 'Adam Marcus', 'Media Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 27, 2005', 'Actors': 'John D. LeMay, Kari Keegan, Erin Gray, Allison Smith, Steven Culp', 'Subtitles': 'English', 'Producers': 'Sean S. Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Dean Lorey, Jay Hoguely', 'Number of discs': '1'}\nFinished my Friday the 13th collection! Not by any means the best movie in the series, but I am a big horror fan and am trying to collect classic horror series.\nMy collection is complete!\nThe Return of the Living Dead (Collector's Edition)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Return of the Living Dead: Specil Edition (RPKG/FP/DVD)', ']]>']\n{'Genre': 'Horror/Things That Go Bump/Monsters', 'Format': 'Multiple Formats, Special Edition, Widescreen, Color, Subtitled, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS108547DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Special Edition, Widescreen, Color, Subtitled, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this crazy movie! A must for goofy horror fans!\nCrazy horror!\nJohn Wick: Chapter 3 – Parabellum\nKeanu Reeves  (Actor),     Ian McShane  (Actor),     Chad Stahelski  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n[\"Super assassin John Wick is on the run after killing a member of the international assassin's guild, and with a $14 million price tag on his head he is the target of hit men and women everywhere.\"]\n{'Genre': 'Action', 'Format': 'NTSC, Subtitled', 'Contributor': 'Basil Iwanyk, Chad Stahelski, Halle Berry, David Leitch, Lance Reddick, Ian McShane, Keanu Reeves, Summit Entertainment, Laurence FishburneBasil Iwanyk, Chad Stahelski, Halle Berry, David Leitch, Lance Reddick, Ian McShane, Keanu Reeves, Summit Entertainment, Laurence Fishburne  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': 'B07QLB71HL', 'Director': 'Chad Stahelski', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 11 minutes', 'Release date': 'September 10, 2019', 'Actors': 'Keanu Reeves, Ian McShane, Halle Berry, Lance Reddick, Laurence Fishburne', 'Producers': 'Basil Iwanyk, David Leitch', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nHave John Wick and John Wick 2. Had to get the third one. Great series!\nGreat series\nHowl\nEd Speelers  (Actor),     Sean Pertwee  (Actor),     Paul Hyett  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"On a dark and stormy night the last train out of London comes to a sudden halt deep in the middle of a forest. After the driver ventures out to investigate and never returns, the passengers are in a state of panic - particularly after seeing the driver's mutilated body outside the carriage. Realizing there's something dangerous lurking in the forest, a ticket-collector, Joe (Ed Speleers), tells the passengers to make barricades to secure themselves in the carriage, but soon the deadly creature is stalking the besieged train and smashing through their defenses, picking them off one-by-one. Joe rallies his pack of passengers to fight back. During a vicious battle they manage to kill the creature, revealing it to be a hideous mutated fusion of human and wild animal - a werewolf. However, celebrations are cut short when they hear more howls coming from the forest...\"]\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Ed Speelers, Sean Pertwee, Shauna McDonald, Paul Hyett, Elliot Cowan', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Paul Hyett', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 12, 2016', 'Actors': 'Ed Speelers, Sean Pertwee, Shauna McDonald, Elliot Cowan', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nBig horror fan and this one delivers! You come to care about the characters also which is important to me. Being on the train is claustrophobic and adds to the scariness. Werewolves are super cool!\nGreat werewolf movie!\nHellfighters [DVD]\nJohn Wayne  (Actor),     Katharine Ross  (Actor),     Andrew V. McLaglen  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, John Wayne Store, All Titles\n['Product Description', 'Screen legend John Wayne pays tribute to oil field legend \"Red\" Adair, as Wayne plays Chance Buckman, a colorful Texan who tames out-of-control infernos in exotic locations around the world. He\\'s joined by a crew that includes Jack Lomax (Jay C. Flippen), Joe Horn (Bruce Cabot), and his assistant, Greg Parker (Jim Hutton). Between blazes Chance \"carries the torch\" for Madelyn, the wife who left him 20 years earlier because of his dangerous lifestyle, and Greg has his hands full at the poker table and in the bedroom with Chance\\'s spunky daughter, Tish (Katharine Ross).Directed by action veteran, Andrew V. McLaglen, this film features spectacular special effects and exciting locations in Texas and Wyoming. As the Duke said, \"I\\'ve made a lot of action movies, but never one as exciting as Hellfighters.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', ']]>', 'Amazon.com', 'Fans of', 'Armageddon', 'might see one or two resemblances between that 1998 box office hit and', 'Hellfighters', \", a 1968 action film by Andrew V. McLaglen, one of John Wayne's favorite directors in his late career. (Their joint ventures included\", 'Chisum', ',', 'Cahill: United States Marshal', ', and', 'McLintock!', \") Wayne plays an oil well firefighter in the mold of Red Adair, turning up anywhere in the world where a geyser of fire is shooting up from a once-profitable gusher. His right-hand man (Jim Hutton) has questionable judgment about safety matters and is a scoundrel with the ladies--and neither fact is lost on Wayne when Hutton's character marries his long-lost daughter (Katharine Ross, a mere year after\", 'The Graduate', \"). The film is an early entry in the disaster-meets-soap-opera genre that flourished in the '70s with such titles as\", 'The Towering Inferno', 'and', 'The Poseidon Adventure', '. McClaglen gets a lot of crackle out of his action scenes (many of the firefighting sequences are still startling in their intensity) and turns twin love stories (Hutton and Ross, Wayne and Vera Miles) into frothy studies of adult manners, with equal hints of Howard Hawks and Sidney Sheldon. The widescreen image on DVD offers viewers a chance to see what was then a developing vogue for gratuitous breadth and scope in all its goofy, self-congratulatory glory. (Is it necessary to look at a golf course the way one might look at an African veldt?', 'Hellfighters', 'says yes!) The DVD also includes production notes and written bios on the stars, plus optional French and Spanish subtitles and an optional Spanish soundtrack. The cast and sundry thrills make this film highly enjoyable, and easily forgivable for indulging in such inanities as a subplot concerning--hold on--Venezuelan terrorists! The Duke lives!', '--Tom Keogh']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Contributor': 'John Wayne, Jay C. Flippen, Bruce Cabot, Robert Arthur, Katharine Ross, Jim Hutton, Andrew V. McLaglen, Vera Miles, Clair HuffakerJohn Wayne, Jay C. Flippen, Bruce Cabot, Robert Arthur, Katharine Ross, Jim Hutton, Andrew V. McLaglen, Vera Miles, Clair Huffaker  See more', 'Initial release date': '2003-09-02', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 122 min', 'Director': 'Andrew V. McLaglen', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 2 minutes', 'Release date': 'September 2, 2003', 'Actors': 'John Wayne, Katharine Ross, Jim Hutton, Vera Miles, Jay C. Flippen', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Robert Arthur', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Clair Huffaker', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat old movie! Not really a big John Wayne fan, but the supporting players make it for me.! Jim Hutton and Katherine Ross have great chemistry. She brings feminist ideas to a man's world of oil fire fighting. The fire fighting scenes are very exciting! Highly recommend!\nExciting and great acting!\nTarantula\nJack Arnold  (Director),     John Agar  (Actor),     Mara Corday  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['You can run and you can hide but there is no escaping the sci-fi classic Tarantula about a science experiment gone horribly wrong! When biochemist Leo Carroll (John Agar) decides to feed the world by using a special growth formula on plants and animals, he instead creates a spider of mammoth proportions with an appetite to match. Escaping from the laboratory and feeding off cattle and humans, this towering tarantula has the people of Desert Rock, Arizona, running for their lives. Can this horrible creature be stopped or will the world succumb to this oversized arachnid?']\n{'Genre': 'Science Fiction & Fantasy, Horror', 'Format': 'Black & White, NTSC', 'Contributor': 'John Agar, Mara Corday, Ross Elliott, Steve Darrell, Bert Holland, Nestor Paiva, Martin Berkeley, Hank Patterson, Edwin Rand, Raymond Bailey, Jack Arnold, Leo G. Carroll, Robert M. Fresco, William AllandJohn Agar, Mara Corday, Ross Elliott, Steve Darrell, Bert Holland, Nestor Paiva, Martin Berkeley, Hank Patterson, Edwin Rand, Raymond Bailey, Jack Arnold, Leo G. Carroll, Robert M. Fresco, William Alland  See more', 'Language': 'English', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.61 Ounces', 'Item model number': 'AVMDU96839D', 'Director': 'Jack Arnold', 'Media Format': 'Black & White, NTSC', 'Run time': '1 hour and 21 minutes', 'Release date': 'July 27, 2011', 'Actors': 'John Agar, Mara Corday, Leo G. Carroll, Nestor Paiva, Ross Elliott', 'Producers': 'William Alland', 'Studio': 'Universal Studios', 'Writers': 'Robert M. Fresco, Martin Berkeley', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI was so excited to get this movie because I remembered watching it as a child. The disc said Tarantula on it, but when I put it in to play it was an old western movie. Somehow this movie was mislabeled or something.  Am returning and just be aware you may not get the correct movie!\nNot the right movie!\nThe Classic Sci-fi Ultimate Collection (Tarantula / The Mole People / The Incredible Shrinking Man / The Monolith Monsters / Monster on the Campus)\nJohn Agar  (Actor),     Grant Williams  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', \"There's nowhere to run and nowhere to hide with The Classic Sci-Fi Ultimate Collection! This fascinating collection will shock, terrify and captivate you with five film favorites from the golden age of Hollywood—Tarantula, The Mole People, The Incredible Shrinking Man, The Monolith Monsters and Monster on the Campus. Featuring amazing, groundbreaking special effects, these classics set the standard for all sci-fi terror to come!\", 'Bonus Content:', 'Disc 1 - Tarantula:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 1 - The Mole People:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - The Incredible Shrinking Man:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - The Monolith Monsters:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 3 - Monster on the Campus:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"A quintet of fun '50s science-fiction thrillers from the Universal vaults make their DVD debut in this three-disc set that's sure to please fans of vintage creature features. Arguably, the best of the lot is\", 'The Incredible Shrinking Man', '(1957), with Grant Williams as a businessman whose exposure to a radioactive cloud causes him to decrease in size exponentially until he is literally microscopic. Based on a novel by legendary fantasy writer Richard Matheson, director Jack (', 'Creature from the Black Lagoon', \") Arnold's balance of suspense (Williams' battles with a house cat and common spider) and pathos (the effect his condition has on his marriage) make it one of the most memorable science-fiction films of the decade, and a favorite even of those with only a passing interest in the genre. On the entirely other end of the spectrum is\", 'The Mole People', '(1956), a loopy pulp adventure with John Agar and Hugh (', 'Leave It to Beaver', ') Beaumont as intrepid adventurers who discover a lost city and the title creatures at a top of a Middle Eastern mountain. Campy to a fault, with a logic-straining script and ridiculous monsters,', 'The Mole People', \"is also a goofy good time for B-movie mavens. Agar, whose faded star power forced him to seek work in low-budget films during the '50s and '60s, also turns up in the effective\", 'Tarantula', '(1955), a fast-paced \"big bug\" creepshow modeled after', 'Them!.', '(1954), and featuring a cameo by Clint Eastwood as a jet pilot; the rest of the set is rounded out by the truly wacky', 'Monster on the Campus', '(1958), with Arthur Franz as a college professor whose exposure to a prehistoric fish turns him into a rampaging Neanderthal, and', 'The Monolith Monsters', '(1957), about fragments of a meteor that grow to colossal heights when exposed to water and threaten a small desert community. For TV babies that grew up on a steady diet of Saturday afternoon monster movies,', 'The Classic Sci-Fi Ultimate Collection', 'offers a nostalgic trip back to those cathode-soaked days, but without the barrage of commercials. The set offers trailers for each film by way of extras, as well as an anamorphic presentation of', 'The Incredible Shrinking Man', '; the rest of the titles are presented in full screen.', '-- Paul Gaita']\n{'Genre': 'Drama, Suspense, Science Fiction', 'Format': 'Black & White, NTSC', 'Contributor': 'John Agar, Grant Williams, Joanna Moore', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Media Format': 'Black & White, NTSC', 'Run time': '6 hours and 35 minutes', 'Release date': 'February 16, 2016', 'Actors': 'John Agar, Grant Williams, Joanna Moore', 'Subtitles': 'English', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI bought this for Tarantula, after the last DVD I bought of it was mislabeled and turned out to be some old western! This is perfect, very good quality picture and sound! Haven't watched the others yet, but I'm sure I will enjoy them! Reminds me of watching Creature Features with my brother when  we were kids!\nGreat old monster movies!\nUniversal Classic Monsters Collection\nBela Lugosi  (Actor),     Boris Karloff  (Actor),     Tod Browning  (Director, Producer),     Karl Freund  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Classics\n['From the era of silent movies through present day, Universal Pictures has been regarded as the home of the monsters. The Universal Classic Monsters Collection showcases 6 of the most iconic monsters in motion picture history including Dracula, Frankenstein, The Mummy, The Invisible Man, The Bride of Frankenstein and The Wolf Man. Starring Bela Lugosi, Boris Karloff, Lon Chaney Jr., Claude Rains and Elsa Lanchester in the roles that they made famous, these original films set the standard for a new horror genre with revolutionary makeup, mood-altering cinematography and groundbreaking special effects. Featuring over 10 hours of revealing bonus features, each film has been digitally remastered for an unforgettable classic monster experience.Bonus Content:', 'Disc 1 - Dracula (1931):', 'The Road to Dracula', 'The Road to Dracula', 'Lugosi: The Dark Prince', 'Lugosi: The Dark Prince', 'Dracula Archives', 'Dracula Archives', 'Theatrical Trailer', 'Theatrical Trailer', 'Alternate Score by Phillip Glass Performed by the Kronos Quartet', 'Alternate Score by Phillip Glass Performed by the Kronos Quartet', 'Feature Commentary with Film Historian David J. Skal', 'Feature Commentary with Film Historian David J. Skal', 'Feature Commentary with Steve Haberman, Screenwriter of Dracula: Dead and Loving It', 'Feature Commentary with Steve Haberman, Screenwriter of Dracula: Dead and Loving It', 'Disc 2 - Frankenstein:', 'The Frankenstein Files: How Hollywood Made a Monster', 'The Frankenstein Files: How Hollywood Made a Monster', 'Karloff: The Gentle Monster', 'Karloff: The Gentle Monster', 'Frankenstein Archives', 'Frankenstein Archives', 'Boo! A Short Film', 'Boo! A Short Film', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Historian Sir Christopher Frayling', 'Feature Commentary with Historian Sir Christopher Frayling', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 3 - The Bride of Frankenstein:', \"She's Alive! Creating The Bride of Frankenstein\", \"She's Alive! Creating The Bride of Frankenstein\", 'The Bride of Frankenstein Archives', 'The Bride of Frankenstein Archives', 'Feature Commentary with Scott MacQueen', 'Feature Commentary with Scott MacQueen', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 4 - The Wolf Man:', 'Monster by Moonlight: An Original Documentary', 'Monster by Moonlight: An Original Documentary', 'The Wolf Man: From Ancient Curse to Modern Myth', 'The Wolf Man: From Ancient Curse to Modern Myth', 'Pure in Heart: the Life and Legacy of Lon Chaney, Jr.', 'Pure in Heart: the Life and Legacy of Lon Chaney, Jr.', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'The Wolf Man Archives', 'The Wolf Man Archives', 'Feature Commentary with Film Historian Tom Weaver', 'Feature Commentary with Film Historian Tom Weaver', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 5 - The Invisible Man (1933):', 'Now You See Him: The Invisble Man Revealed', 'Now You See Him: The Invisble Man Revealed', 'Production Photographs', 'Production Photographs', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Film Historian Rudy Behlmer', 'Disc 6 - The Mummy (1932):', 'Mummy Dearest: A Horror Tradition Unearthed', 'Mummy Dearest: A Horror Tradition Unearthed', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'Unraveling The Legacy Of The Mummy', 'Unraveling The Legacy Of The Mummy', 'The Mummy Archives', 'The Mummy Archives', 'Feature Commentary By Rick Baker, Scott Essman, Steve Haberman, Bob Burns, And Brent Armstrong [On/Off]', 'Feature Commentary By Rick Baker, Scott Essman, Steve Haberman, Bob Burns, And Brent Armstrong [On/Off]', 'Feature Commentary By Film Historian Paul M. Jensen.', 'Feature Commentary By Film Historian Paul M. Jensen.', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Drama, Horror, Suspense', 'Format': 'Multiple Formats, Box set, Black & White, NTSC', 'Contributor': \"Maria Ouspenskaya, Gavin Gordon, Gloria Stuart, James Whale, Gilbert Kurland, John Boles, Carl Laemmle, Jr., David Manners, Una O'Connor, Frederic Kerr, Bramwell Fletcher, Evelyn Ankers, Ralph Bellamy, R.C. Sherriff, William Hurlbut, Valerie Hobson, Mae Clarke, Boris Karloff, Forrester Harvey, Claude Rains, Zita Johann, Dwight Frye, Elsa Lanchester, Helen Chandler, O.P. Heggie, Karl Freund, Dudley Digges, Edward Van Sloan, Henry Travers, Lon Chaney, Jr., Colin Clive, Ernest Thesiger, William Harrigan, Arthur Byron, Tod Browning, John L. Balderston, George Waggner, Douglas Walton, Francis Edwards Faragoh, Bela Lugosi, Frances Dade, Warren William, Garrett Fort, Patric Knowles, Curt SiodmakMaria Ouspenskaya, Gavin Gordon, Gloria Stuart, James Whale, Gilbert Kurland, John Boles, Carl Laemmle, Jr., David Manners, Una O'Connor, Frederic Kerr, Bramwell Fletcher, Evelyn Ankers, Ralph Bellamy, R.C. Sherriff, William Hurlbut, Valerie Hobson, Mae Clarke, Boris Karl…   See more\", 'Initial release date': '2015-09-08', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '34272131', 'Director': 'Tod Browning, Karl Freund, James Whale, George Waggner', 'Media Format': 'Multiple Formats, Box set, Black & White, NTSC', 'Run time': '7 hours and 17 minutes', 'Release date': 'September 8, 2015', 'Actors': 'Bela Lugosi, Boris Karloff, Lon Chaney, Jr., Claude Rains, David Manners', 'Subtitles': 'French, Spanish', 'Producers': 'Carl Laemmle, Jr., Tod Browning, George Waggner', 'Studio': 'Studio Distribution Services', 'Writers': 'John L. Balderston, Garrett Fort, R.C. Sherriff, Francis Edwards Faragoh, Curt Siodmak', 'Number of discs': '6'}\nI watched these all on TV as a child in the 60's and I am happy to own them today! Still give me chills! Great collection!\nClassic monster movies!",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: The Electric Horseman\nReview Date: 2017/04/01\nStore: Robert Redford  (Actor),     Jane Fonda  (Actor),     Sydney Pollack  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"Robert Redford plays an ex-world champion cowboy, reduced to huckstering breakfast food in a suit studded with flashing lights. Jane Fonda is a chic, sharp member of the electronic media, a TV newswoman who'll do anything to get a good story. When Redford rides out of a Las Vegas casino into the desert astride his sponsor's living symbol, a multi-million dollar racehorse, Jane is determined to discover why. She does, one step ahead of a posse of pursuing police. But by the time they reach a remote rendezvous high in the Utah mountains, she is in love with both the cowboy and his convictions.Bonus Content:\", 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Contributor': 'Tasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry Sheehan Adair, James Novak, Will Hare, Valerie Perrine, Wilford Brimley, Sarah Harris, Sydney Pollack, Michele Heyeden, Frank Speiser, Richard Perlmutter, John Saxon, Lois Hamilton, Quinn K. RedekerTasha Zemrus, Gary M. Fox, Basil Hoffman, Willie Nelson, Debra L. Maxwell, Patricia Blair, Sarge Allen, Timothy Scott, Theresa Ann Dent, Robin Timm, Carol Eileen Montgomery, Jane Fonda, James Sikking, James Kline, Nicolas Coster, Robert Redford, Allan Arbus, Perry She…  See more', 'Initial release date': '2003-05-06', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '1022748', 'Director': 'Sydney Pollack', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned', 'Run time': '2 hours and 2 minutes', 'Release date': 'May 6, 2003', 'Actors': 'Robert Redford, Jane Fonda, Valerie Perrine, Willie Nelson, John Saxon', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Perfect feel-good movie. Redford and Fonda have amazing chemistry. Beautiful scenery as they journey to free the horse. You won't be disappointed.\nReview Title: Great!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Child's Play [DVD]\nReview Date: 2019/07/05\nStore: Catherine Hicks  (Actor),     Chris Sarandon  (Actor),     Tom Holland  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['The \"chills come thick and fast\" (Los Angeles Times) as voodoo and terror meet within an innocent-looking doll inhabited by the soul of a serial killer who isn\\'t ready to die. From the Director of Fright Night comes a \"clever, playful\" (The New York Times) and stylish thriller with \"excellent special effects\" (Leonard Maltin) and heart-pounding suspense guaranteed to scare! After 6-year-old Andy Barclay\\'s (Alex Vincent) babysitter is violently pushed out of a window to her death, nobody believes him when he says that \"Chucky,\" his new birthday doll, did it! Untilthings start going terribly wrong dead wrong. And when an ensuing rampage of gruesome murders lead a detective (Chris Sarandon) back to the same toy, he discovers that the real terror has just begun\\'the deranged doll has plans to transfer his evil spirit into a living human beingyoung Andy!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Mystery & Thrillers', 'Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Contributor': 'Brad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil GiuntoliBrad Dourif, Raymond Oliver, Alex Vincent, Juan Ramrez, Alan Wilder, Dinah Manoff, Chris Sarandon, Tommy Swerdlow, Catherine Hicks, John Lafia, Jack Colvin, Tom Holland, Richard Baird, Don Mancini, Neil Giuntoli  See more', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 27 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Tom Holland', 'Media Format': 'Closed-captioned, DVD, NTSC, Color, Full Screen', 'Run time': '1 hour and 27 minutes', 'Release date': 'September 28, 1999', 'Actors': 'Catherine Hicks, Chris Sarandon, Alex Vincent, Brad Dourif, Dinah Manoff', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Don Mancini, John Lafia, Tom Holland', 'Number of discs': '1'}\nReview Text: Kind of confused because I ordered the movie Child's Play, but received it as part of a three part movie disc with Amityville Horror and Carrie. I guess it was ok, but I only wanted Child's Play. So, not sure what anyone else will get.\nReview Title: You get the movie, but.........\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Nightmare on Elm Street 1-4 (A Nightmare on Elm Street, Nightmare on Elm Street 2: Freddie's Revenge, Nightmare on Elm Street 3: Dream Warriors, Nightmare on Elm Street 4: The Dream Master)\nReview Date: 2019/07/12\nStore: Robert Englund  (Actor),     Johnny Depp  (Actor),     Wes Craven  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Product Description', \"Titles include: A Nightmare On Elmstreet, A Nightmare On Elmstreet 2: Freddy's Revenge, A Nightmare On Elmstreet 3: Dream Warriors, A Nightmare On Elmstreet 4: The Dream Master\", 'Amazon.com', \"In the trinity of modern horror films, there's the father (Michael Myers of Halloween), the son (Jason of Friday the13th fame, a knockoff), and the unholy spirit, Freddy Krueger of the Nightmare on Elm Street films. The spectral man who haunted the nightmares of unsuspecting teenagers with deadly consequences, Freddy (as played by Robert Englund) was a truly frightening bogeyman and icon for the '80s. Unlike the hockey-masked Jason, who dispatched horny teenagers with mechanical and monotonous ease (he never talked, never took off his mask), Freddy was a truly creative and diabolical villain, with a sadistic and blackly funny personality. The hallmarks of the Nightmare on Elm Street series were imaginatively gruesome suspense pieces, set in the overactive imaginations of the teen victims. The first film of the series, Wes Craven's truly intelligent and scary film, was so hugely successful it begat not one, not two, but six more sequels, each pretty much diluting the originality and horror of its predecesor. (Horror fans will fondly remember Drew Barrymore's assertion in Scream that the first Nightmare film was great but all the rest sucked.) Still, there's fun to be had in the remaining films in the series, seeing as a number of aspiring filmmakers cut their teeth on the continuing saga of Freddy. Frank Darabont (The Shawshank Redemption) and Chuck Russell (The Mask) worked on the third installment, Dream Warriors (starring a young Patricia Arquette), and Renny Harlin (Die Hard 2) came to prominence with the ingeniously macabre fourth film, The Dream Master, coscripted by Brian Helgeland (L.A. Confidential). Craven and original star Heather Langenkamp did return for the last film, New Nightmare, which presaged the tongue-in-cheek postmodernism of the Scream films and resharpened Freddy's ability to scare. --Mark Englehart\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Contributor': 'Patricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark PattonPatricia Arquette, Wes Craven, Johnny Depp, Kim Myers, Ken Sagoes, Tuesday Knight, Robert Englund, Mark Patton   See more', 'Initial release date': '2008-10-14', 'Language': 'English', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '5.39 x 7.48 x 0.63 inches; 3.03 Ounces', 'Item model number': 'WARD042244D', 'Director': 'Wes Craven', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Box set', 'Run time': '6 hours and 14 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Robert Englund, Johnny Depp, Patricia Arquette, Mark Patton, Kim Myers', 'Studio': 'Studio Distribution Services', 'Number of discs': '2'}\nReview Text: Collecting the entire Nightmare series and this was an inexpensive way to begin.\nReview Title: 4 movies for one price!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4 Film Favorites: Nightmare on Elm Street 5-8 (Freddy vs Jason, Freddy's Dead: The Final Nightmare, Nightmare on Elm Street 5: The Dream Child, Wes Craven's New Nightmare)\nReview Date: 2019/07/12\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['4 Film Favorites: Nightmare on Elm Street 5-8 (DVD)', \"Titles include: A Nightmare On Elmstreet 5: The Dream Child, Freddy's Dead The Final Nightmare, Wes Craven's New Nightmare, Freddy Vs. Jason\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Item model number': 'NEWL1000042232DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '6 hours and 15 minutes', 'Release date': 'October 14, 2008', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: Own the the first four in the series, now my collection is complete!\nReview Title: Completed my collection!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Jason Goes to Hell\nReview Date: 2019/07/12\nStore: Adam Marcus  (Director),     John D. LeMay  (Actor),     Kari Keegan  (Actor)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Horror\nProduct Description: ['Product Description', 'Jason Goes to Hell (DVD)', \"Jason Voorhees, the living, breathing essence of evil, is back for onefierce, final fling! Tracked down and blown to bits by a special FBItask force, everyone now assumes that he's finally dead. But everybodyassumes wrong. Jason has been reborn with the bone-chilling ability toassume the identity of anyone he touches. The terrifying truth is thathe could be anywhere, or anybody. In this shocking, blood-soaked finaleto Jason's carnage-ridden reign of terror, the horrible secret of hisunstoppable killing instinct is finally revealed. And once you know thechilling facts, you'll see him in your nightmares!\", ']]>', 'Amazon.com', \"Blow mad killer Jason Voorhees to smithereens in the opening sequence of the movie? Sorry, folks, you have to do better than that. Jason's evil spirit finds its way into a series of host bodies, thus continuing the carnage at Crystal Lake, in\", 'Jason Goes to Hell: The Final Friday', '. Naturally, part 9 is not the final', 'Friday the 13th', \"movie (no big deal: part 4, you'll recall, was titled\", 'The Final Chapter', '). Jason confronts a long-lost sister at the lake, while the usual assortment of naked teens are dispatched. This one tries to vary the formula a bit but ends up with a story line every bit as nonsensical as those that came before. The final sequence tries to put Jason away for keeps and calls upon the demons of hell for support. The last shot is an outrageous joke, which is perhaps what this franchise deserves.', '--Robert Horton', 'Set Contains:', \"The DVD contains both the R-rated and unrated versions of the picture, plus a commentary track with director Adam Marcus and screenwriter Dean Lorey, during which the two friends chortle frequently about the movie. Among the revelations: series producer Sean S. Cunningham asked them to get rid of Jason's hockey mask once and for all.\", '--Robert Horton', 'See more']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Horror', 'Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Contributor': 'Erin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven CulpErin Gray, Allison Smith, Jay Hoguely, Steven Williams, Kane Hodder, Sean S. Cunningham, Kari Keegan, John D. LeMay, Adam Marcus, Dean Lorey, Steven Culp   See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.5 x 0.4 inches; 2.4 Ounces', 'Item model number': 'MFR794043562624#VG', 'Director': 'Adam Marcus', 'Media Format': 'Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen, Dolby, DTS Surround Sound', 'Run time': '1 hour and 28 minutes', 'Release date': 'September 27, 2005', 'Actors': 'John D. LeMay, Kari Keegan, Erin Gray, Allison Smith, Steven Culp', 'Subtitles': 'English', 'Producers': 'Sean S. Cunningham', 'Studio': 'WarnerBrothers', 'Writers': 'Dean Lorey, Jay Hoguely', 'Number of discs': '1'}\nReview Text: Finished my Friday the 13th collection! Not by any means the best movie in the series, but I am a big horror fan and am trying to collect classic horror series.\nReview Title: My collection is complete!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Return of the Living Dead (Collector's Edition)\nReview Date: 2019/09/07\nStore: Various  (Actor, Director)    Rated:    R    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Return of the Living Dead: Specil Edition (RPKG/FP/DVD)', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Horror/Things That Go Bump/Monsters', 'Format': 'Multiple Formats, Special Edition, Widescreen, Color, Subtitled, NTSC', 'Contributor': 'Various', 'Language': 'Unqualified', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS108547DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Special Edition, Widescreen, Color, Subtitled, NTSC', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love this crazy movie! A must for goofy horror fans!\nReview Title: Crazy horror!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: John Wick: Chapter 3 – Parabellum\nReview Date: 2019/12/25\nStore: Keanu Reeves  (Actor),     Ian McShane  (Actor),     Chad Stahelski  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: [\"Super assassin John Wick is on the run after killing a member of the international assassin's guild, and with a $14 million price tag on his head he is the target of hit men and women everywhere.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action', 'Format': 'NTSC, Subtitled', 'Contributor': 'Basil Iwanyk, Chad Stahelski, Halle Berry, David Leitch, Lance Reddick, Ian McShane, Keanu Reeves, Summit Entertainment, Laurence FishburneBasil Iwanyk, Chad Stahelski, Halle Berry, David Leitch, Lance Reddick, Ian McShane, Keanu Reeves, Summit Entertainment, Laurence Fishburne  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 0.01 Ounces', 'Item model number': 'B07QLB71HL', 'Director': 'Chad Stahelski', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 11 minutes', 'Release date': 'September 10, 2019', 'Actors': 'Keanu Reeves, Ian McShane, Halle Berry, Lance Reddick, Laurence Fishburne', 'Producers': 'Basil Iwanyk, David Leitch', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Have John Wick and John Wick 2. Had to get the third one. Great series!\nReview Title: Great series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Howl\nReview Date: 2020/07/22\nStore: Ed Speelers  (Actor),     Sean Pertwee  (Actor),     Paul Hyett  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: [\"On a dark and stormy night the last train out of London comes to a sudden halt deep in the middle of a forest. After the driver ventures out to investigate and never returns, the passengers are in a state of panic - particularly after seeing the driver's mutilated body outside the carriage. Realizing there's something dangerous lurking in the forest, a ticket-collector, Joe (Ed Speleers), tells the passengers to make barricades to secure themselves in the carriage, but soon the deadly creature is stalking the besieged train and smashing through their defenses, picking them off one-by-one. Joe rallies his pack of passengers to fight back. During a vicious battle they manage to kill the creature, revealing it to be a hideous mutated fusion of human and wild animal - a werewolf. However, celebrations are cut short when they hear more howls coming from the forest...\"]\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Horror', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Ed Speelers, Sean Pertwee, Shauna McDonald, Paul Hyett, Elliot Cowan', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Paul Hyett', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'January 12, 2016', 'Actors': 'Ed Speelers, Sean Pertwee, Shauna McDonald, Elliot Cowan', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nReview Text: Big horror fan and this one delivers! You come to care about the characters also which is important to me. Being on the train is claustrophobic and adds to the scariness. Werewolves are super cool!\nReview Title: Great werewolf movie!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hellfighters [DVD]\nReview Date: 2020/09/26\nStore: John Wayne  (Actor),     Katharine Ross  (Actor),     Andrew V. McLaglen  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, John Wayne Store, All Titles\nProduct Description: ['Product Description', 'Screen legend John Wayne pays tribute to oil field legend \"Red\" Adair, as Wayne plays Chance Buckman, a colorful Texan who tames out-of-control infernos in exotic locations around the world. He\\'s joined by a crew that includes Jack Lomax (Jay C. Flippen), Joe Horn (Bruce Cabot), and his assistant, Greg Parker (Jim Hutton). Between blazes Chance \"carries the torch\" for Madelyn, the wife who left him 20 years earlier because of his dangerous lifestyle, and Greg has his hands full at the poker table and in the bedroom with Chance\\'s spunky daughter, Tish (Katharine Ross).Directed by action veteran, Andrew V. McLaglen, this film features spectacular special effects and exciting locations in Texas and Wyoming. As the Duke said, \"I\\'ve made a lot of action movies, but never one as exciting as Hellfighters.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', ']]>', 'Amazon.com', 'Fans of', 'Armageddon', 'might see one or two resemblances between that 1998 box office hit and', 'Hellfighters', \", a 1968 action film by Andrew V. McLaglen, one of John Wayne's favorite directors in his late career. (Their joint ventures included\", 'Chisum', ',', 'Cahill: United States Marshal', ', and', 'McLintock!', \") Wayne plays an oil well firefighter in the mold of Red Adair, turning up anywhere in the world where a geyser of fire is shooting up from a once-profitable gusher. His right-hand man (Jim Hutton) has questionable judgment about safety matters and is a scoundrel with the ladies--and neither fact is lost on Wayne when Hutton's character marries his long-lost daughter (Katharine Ross, a mere year after\", 'The Graduate', \"). The film is an early entry in the disaster-meets-soap-opera genre that flourished in the '70s with such titles as\", 'The Towering Inferno', 'and', 'The Poseidon Adventure', '. McClaglen gets a lot of crackle out of his action scenes (many of the firefighting sequences are still startling in their intensity) and turns twin love stories (Hutton and Ross, Wayne and Vera Miles) into frothy studies of adult manners, with equal hints of Howard Hawks and Sidney Sheldon. The widescreen image on DVD offers viewers a chance to see what was then a developing vogue for gratuitous breadth and scope in all its goofy, self-congratulatory glory. (Is it necessary to look at a golf course the way one might look at an African veldt?', 'Hellfighters', 'says yes!) The DVD also includes production notes and written bios on the stars, plus optional French and Spanish subtitles and an optional Spanish soundtrack. The cast and sundry thrills make this film highly enjoyable, and easily forgivable for indulging in such inanities as a subplot concerning--hold on--Venezuelan terrorists! The Duke lives!', '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Contributor': 'John Wayne, Jay C. Flippen, Bruce Cabot, Robert Arthur, Katharine Ross, Jim Hutton, Andrew V. McLaglen, Vera Miles, Clair HuffakerJohn Wayne, Jay C. Flippen, Bruce Cabot, Robert Arthur, Katharine Ross, Jim Hutton, Andrew V. McLaglen, Vera Miles, Clair Huffaker  See more', 'Initial release date': '2003-09-02', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': 'Relay Time: 122 min', 'Director': 'Andrew V. McLaglen', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 2 minutes', 'Release date': 'September 2, 2003', 'Actors': 'John Wayne, Katharine Ross, Jim Hutton, Vera Miles, Jay C. Flippen', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Robert Arthur', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Clair Huffaker', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great old movie! Not really a big John Wayne fan, but the supporting players make it for me.! Jim Hutton and Katherine Ross have great chemistry. She brings feminist ideas to a man's world of oil fire fighting. The fire fighting scenes are very exciting! Highly recommend!\nReview Title: Exciting and great acting!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tarantula\nReview Date: 2022/06/15\nStore: Jack Arnold  (Director),     John Agar  (Actor),     Mara Corday  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['You can run and you can hide but there is no escaping the sci-fi classic Tarantula about a science experiment gone horribly wrong! When biochemist Leo Carroll (John Agar) decides to feed the world by using a special growth formula on plants and animals, he instead creates a spider of mammoth proportions with an appetite to match. Escaping from the laboratory and feeding off cattle and humans, this towering tarantula has the people of Desert Rock, Arizona, running for their lives. Can this horrible creature be stopped or will the world succumb to this oversized arachnid?']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Horror', 'Format': 'Black & White, NTSC', 'Contributor': 'John Agar, Mara Corday, Ross Elliott, Steve Darrell, Bert Holland, Nestor Paiva, Martin Berkeley, Hank Patterson, Edwin Rand, Raymond Bailey, Jack Arnold, Leo G. Carroll, Robert M. Fresco, William AllandJohn Agar, Mara Corday, Ross Elliott, Steve Darrell, Bert Holland, Nestor Paiva, Martin Berkeley, Hank Patterson, Edwin Rand, Raymond Bailey, Jack Arnold, Leo G. Carroll, Robert M. Fresco, William Alland  See more', 'Language': 'English', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.61 Ounces', 'Item model number': 'AVMDU96839D', 'Director': 'Jack Arnold', 'Media Format': 'Black & White, NTSC', 'Run time': '1 hour and 21 minutes', 'Release date': 'July 27, 2011', 'Actors': 'John Agar, Mara Corday, Leo G. Carroll, Nestor Paiva, Ross Elliott', 'Producers': 'William Alland', 'Studio': 'Universal Studios', 'Writers': 'Robert M. Fresco, Martin Berkeley', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I was so excited to get this movie because I remembered watching it as a child. The disc said Tarantula on it, but when I put it in to play it was an old western movie. Somehow this movie was mislabeled or something.  Am returning and just be aware you may not get the correct movie!\nReview Title: Not the right movie!\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Classic Sci-fi Ultimate Collection (Tarantula / The Mole People / The Incredible Shrinking Man / The Monolith Monsters / Monster on the Campus)\nReview Date: 2022/06/17\nStore: John Agar  (Actor),     Grant Williams  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', \"There's nowhere to run and nowhere to hide with The Classic Sci-Fi Ultimate Collection! This fascinating collection will shock, terrify and captivate you with five film favorites from the golden age of Hollywood—Tarantula, The Mole People, The Incredible Shrinking Man, The Monolith Monsters and Monster on the Campus. Featuring amazing, groundbreaking special effects, these classics set the standard for all sci-fi terror to come!\", 'Bonus Content:', 'Disc 1 - Tarantula:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 1 - The Mole People:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - The Incredible Shrinking Man:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - The Monolith Monsters:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 3 - Monster on the Campus:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"A quintet of fun '50s science-fiction thrillers from the Universal vaults make their DVD debut in this three-disc set that's sure to please fans of vintage creature features. Arguably, the best of the lot is\", 'The Incredible Shrinking Man', '(1957), with Grant Williams as a businessman whose exposure to a radioactive cloud causes him to decrease in size exponentially until he is literally microscopic. Based on a novel by legendary fantasy writer Richard Matheson, director Jack (', 'Creature from the Black Lagoon', \") Arnold's balance of suspense (Williams' battles with a house cat and common spider) and pathos (the effect his condition has on his marriage) make it one of the most memorable science-fiction films of the decade, and a favorite even of those with only a passing interest in the genre. On the entirely other end of the spectrum is\", 'The Mole People', '(1956), a loopy pulp adventure with John Agar and Hugh (', 'Leave It to Beaver', ') Beaumont as intrepid adventurers who discover a lost city and the title creatures at a top of a Middle Eastern mountain. Campy to a fault, with a logic-straining script and ridiculous monsters,', 'The Mole People', \"is also a goofy good time for B-movie mavens. Agar, whose faded star power forced him to seek work in low-budget films during the '50s and '60s, also turns up in the effective\", 'Tarantula', '(1955), a fast-paced \"big bug\" creepshow modeled after', 'Them!.', '(1954), and featuring a cameo by Clint Eastwood as a jet pilot; the rest of the set is rounded out by the truly wacky', 'Monster on the Campus', '(1958), with Arthur Franz as a college professor whose exposure to a prehistoric fish turns him into a rampaging Neanderthal, and', 'The Monolith Monsters', '(1957), about fragments of a meteor that grow to colossal heights when exposed to water and threaten a small desert community. For TV babies that grew up on a steady diet of Saturday afternoon monster movies,', 'The Classic Sci-Fi Ultimate Collection', 'offers a nostalgic trip back to those cathode-soaked days, but without the barrage of commercials. The set offers trailers for each film by way of extras, as well as an anamorphic presentation of', 'The Incredible Shrinking Man', '; the rest of the titles are presented in full screen.', '-- Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Suspense, Science Fiction', 'Format': 'Black & White, NTSC', 'Contributor': 'John Agar, Grant Williams, Joanna Moore', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.84 Ounces', 'Media Format': 'Black & White, NTSC', 'Run time': '6 hours and 35 minutes', 'Release date': 'February 16, 2016', 'Actors': 'John Agar, Grant Williams, Joanna Moore', 'Subtitles': 'English', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: I bought this for Tarantula, after the last DVD I bought of it was mislabeled and turned out to be some old western! This is perfect, very good quality picture and sound! Haven't watched the others yet, but I'm sure I will enjoy them! Reminds me of watching Creature Features with my brother when  we were kids!\nReview Title: Great old monster movies!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Universal Classic Monsters Collection\nReview Date: 2022/10/13\nStore: Bela Lugosi  (Actor),     Boris Karloff  (Actor),     Tod Browning  (Director, Producer),     Karl Freund  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Classics\nProduct Description: ['From the era of silent movies through present day, Universal Pictures has been regarded as the home of the monsters. The Universal Classic Monsters Collection showcases 6 of the most iconic monsters in motion picture history including Dracula, Frankenstein, The Mummy, The Invisible Man, The Bride of Frankenstein and The Wolf Man. Starring Bela Lugosi, Boris Karloff, Lon Chaney Jr., Claude Rains and Elsa Lanchester in the roles that they made famous, these original films set the standard for a new horror genre with revolutionary makeup, mood-altering cinematography and groundbreaking special effects. Featuring over 10 hours of revealing bonus features, each film has been digitally remastered for an unforgettable classic monster experience.Bonus Content:', 'Disc 1 - Dracula (1931):', 'The Road to Dracula', 'The Road to Dracula', 'Lugosi: The Dark Prince', 'Lugosi: The Dark Prince', 'Dracula Archives', 'Dracula Archives', 'Theatrical Trailer', 'Theatrical Trailer', 'Alternate Score by Phillip Glass Performed by the Kronos Quartet', 'Alternate Score by Phillip Glass Performed by the Kronos Quartet', 'Feature Commentary with Film Historian David J. Skal', 'Feature Commentary with Film Historian David J. Skal', 'Feature Commentary with Steve Haberman, Screenwriter of Dracula: Dead and Loving It', 'Feature Commentary with Steve Haberman, Screenwriter of Dracula: Dead and Loving It', 'Disc 2 - Frankenstein:', 'The Frankenstein Files: How Hollywood Made a Monster', 'The Frankenstein Files: How Hollywood Made a Monster', 'Karloff: The Gentle Monster', 'Karloff: The Gentle Monster', 'Frankenstein Archives', 'Frankenstein Archives', 'Boo! A Short Film', 'Boo! A Short Film', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Historian Sir Christopher Frayling', 'Feature Commentary with Historian Sir Christopher Frayling', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 3 - The Bride of Frankenstein:', \"She's Alive! Creating The Bride of Frankenstein\", \"She's Alive! Creating The Bride of Frankenstein\", 'The Bride of Frankenstein Archives', 'The Bride of Frankenstein Archives', 'Feature Commentary with Scott MacQueen', 'Feature Commentary with Scott MacQueen', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 4 - The Wolf Man:', 'Monster by Moonlight: An Original Documentary', 'Monster by Moonlight: An Original Documentary', 'The Wolf Man: From Ancient Curse to Modern Myth', 'The Wolf Man: From Ancient Curse to Modern Myth', 'Pure in Heart: the Life and Legacy of Lon Chaney, Jr.', 'Pure in Heart: the Life and Legacy of Lon Chaney, Jr.', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'The Wolf Man Archives', 'The Wolf Man Archives', 'Feature Commentary with Film Historian Tom Weaver', 'Feature Commentary with Film Historian Tom Weaver', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 5 - The Invisible Man (1933):', 'Now You See Him: The Invisble Man Revealed', 'Now You See Him: The Invisble Man Revealed', 'Production Photographs', 'Production Photographs', 'Feature Commentary with Film Historian Rudy Behlmer', 'Feature Commentary with Film Historian Rudy Behlmer', 'Disc 6 - The Mummy (1932):', 'Mummy Dearest: A Horror Tradition Unearthed', 'Mummy Dearest: A Horror Tradition Unearthed', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'He Who Made Monsters: The Life and Art of Jack Pierce', 'Unraveling The Legacy Of The Mummy', 'Unraveling The Legacy Of The Mummy', 'The Mummy Archives', 'The Mummy Archives', 'Feature Commentary By Rick Baker, Scott Essman, Steve Haberman, Bob Burns, And Brent Armstrong [On/Off]', 'Feature Commentary By Rick Baker, Scott Essman, Steve Haberman, Bob Burns, And Brent Armstrong [On/Off]', 'Feature Commentary By Film Historian Paul M. Jensen.', 'Feature Commentary By Film Historian Paul M. Jensen.', 'Theatrical Trailer', 'Theatrical Trailer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Horror, Suspense', 'Format': 'Multiple Formats, Box set, Black & White, NTSC', 'Contributor': \"Maria Ouspenskaya, Gavin Gordon, Gloria Stuart, James Whale, Gilbert Kurland, John Boles, Carl Laemmle, Jr., David Manners, Una O'Connor, Frederic Kerr, Bramwell Fletcher, Evelyn Ankers, Ralph Bellamy, R.C. Sherriff, William Hurlbut, Valerie Hobson, Mae Clarke, Boris Karloff, Forrester Harvey, Claude Rains, Zita Johann, Dwight Frye, Elsa Lanchester, Helen Chandler, O.P. Heggie, Karl Freund, Dudley Digges, Edward Van Sloan, Henry Travers, Lon Chaney, Jr., Colin Clive, Ernest Thesiger, William Harrigan, Arthur Byron, Tod Browning, John L. Balderston, George Waggner, Douglas Walton, Francis Edwards Faragoh, Bela Lugosi, Frances Dade, Warren William, Garrett Fort, Patric Knowles, Curt SiodmakMaria Ouspenskaya, Gavin Gordon, Gloria Stuart, James Whale, Gilbert Kurland, John Boles, Carl Laemmle, Jr., David Manners, Una O'Connor, Frederic Kerr, Bramwell Fletcher, Evelyn Ankers, Ralph Bellamy, R.C. Sherriff, William Hurlbut, Valerie Hobson, Mae Clarke, Boris Karl…   See more\", 'Initial release date': '2015-09-08', 'Language': 'English (Dolby Digital 2.0 Stereo), English (Dolby Digital 2.0 Mono)', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '34272131', 'Director': 'Tod Browning, Karl Freund, James Whale, George Waggner', 'Media Format': 'Multiple Formats, Box set, Black & White, NTSC', 'Run time': '7 hours and 17 minutes', 'Release date': 'September 8, 2015', 'Actors': 'Bela Lugosi, Boris Karloff, Lon Chaney, Jr., Claude Rains, David Manners', 'Subtitles': 'French, Spanish', 'Producers': 'Carl Laemmle, Jr., Tod Browning, George Waggner', 'Studio': 'Studio Distribution Services', 'Writers': 'John L. Balderston, Garrett Fort, R.C. Sherriff, Francis Edwards Faragoh, Curt Siodmak', 'Number of discs': '6'}\nReview Text: I watched these all on TV as a child in the 60's and I am happy to own them today! Still give me chills! Great collection!\nReview Title: Classic monster movies!\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n1. **Film Genre Preferences:**\n   - Strong inclination towards **horror** and **thriller** films, demonstrated by multiple purchases from renowned horror franchises (e.g., serial killer and supernatural themes).\n   - Enjoyment of **action-adventure** movies, notably highlighted through a specific interest in the **John Wick** series.\n\n2. **Classic Movie Appreciation:**\n   - Nostalgia for **classic monster movies** and science fiction, evident from the purchase of collections that include iconic titles from early cinema.\n\n3. **Collecting Behavior:**\n   - Frequent buyer of **film collections** and **box sets**, indicating a desire to complete series and collections (e.g., \"Nightmare on Elm Street,\" \"Classic Sci-fi Ultimate Collection\").\n   - Patterns of purchasing sequels or related titles showcase an interest in comprehensive ownership of franchises.\n\n4. **Viewing Preferences:**\n   - High ratings provided for films suggest a discerning taste in quality, favoring ones with strong character development and emotional engagement (e.g., attachment to character arcs in horror).\n\n5. **Reviewer Feedback:**\n   - Reviews emphasize **nostalgic connections** and emotional responses to viewing experiences, underscoring a sentimental approach to film selection and leisure activities.\n\nOverall, this person exhibits a notable enthusiasm for niche horror genres, classic films, and collection-building, reflecting both a passion for the art of cinema and a nostalgic connection to their viewing history.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Classic horror!",
    "text": "Have seen this movie for years on TV, but never really appreciated it until this blu-ray. The copy is so crystal clear! The transformation scenes are incredible! Highly recommend for any horror fan!",
    "images": [],
    "asin": "B00BNAE2AU",
    "parent_asin": "B00BNAE2AU",
    "user_id": "AHQOQ4WS2SHPYJK7TFQ5S7TVXAZA",
    "timestamp": "2022-10-26 23:32:32.164000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "The Howling (Collector's Edition) [Blu-ray]",
    "average_rating": 4.6,
    "rating_number": 4600,
    "features": [],
    "description": [
      "Product Description",
      "Severely traumatized by a near-fatal encounter with a serial killer, TV newscaster Karen White (Dee Wallace) takes time off at a secluded retreat called the Colony. But when, after nights of being tormented by bestial, bloodcurdling cries, Karen ventures into the woods seeking answers, she makes a terrifying discovery. Now she must fight not only for her life but for her soul!",
      "Set Contains:",
      "Shout Factory's Blu-ray/DVD presentation of",
      "The Howling",
      "is a fan-pleasing combination of original supplemental features produced exclusively for the two-disc set and extras ported over from previous DVD releases. The new material includes a commentary track with author Gary Brandner, who penned the 1977 novel on which the film is based, and Blu-ray producer Michael Felsher. Since the picture bears little resemblance to Brandner's source material, the track focuses largely on Brandner's prolific career as a horror novelist, with only occasional discussion of Joe Dante's movie. There are also recently recorded interviews with executive producer Steven Lane, editor Mark Goldblatt, and screenwriter Terrence Winkless, whose script was later reworked by John Sayles. All three are informative, with Goldblatt offering the most interesting anecdotes on his work with both Dante and Roger Corman, as well as his appreciation of the horror genre. The last new extra is a breezy tour of the film's locations in Hollywood and Mendocino, California, with",
      "Horror Hound",
      "magazine's Sean Clark, who provides some amusing production stories for each stop. The rest of the supplemental material is culled from the MGM Special Edition DVD from 2003 and New Line's Laserdisc version from 1995. The latter provides a commentary track with Dante and actors Dee Wallace, her late husband Christopher Stone, and longtime collaborator Robert Picardo, who offer warm and frequently funny recollections about their famous costars and the film's breakneck production schedule, as well as a collection of deleted scenes with optional commentary by Dante and a seven-minute blooper reel. Content from the MGM disc includes the excellent making-of documentary",
      "Unleashing the Beast--The Making of The Howling",
      ", which includes input from Sayles and producer Mike Finnell. The red-band theatrical trailer and a gallery of promotional and production stills round out the disc content, while the reversible cover gives purchasers the option of viewing the original poster or eye-popping new artwork.",
      "--Paul Gaita"
    ],
    "price": 16.29,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/61Swywo54NL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61Swywo54NL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "The Howling (Collector's Edition)",
        "url": "https://www.amazon.com/vdp/bca2b7e2555440409eda2250e22922e8?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Dee Wallace Stone  (Actor),     Patrick Macnee  (Actor),     Joe Dante  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "Movies"
    ],
    "details": {
      "Genre": "Horror/Things That Go Bump/Monsters",
      "Format": "Multiple Formats, Blu-ray, NTSC, Widescreen, Anamorphic, Subtitled",
      "Contributor": "Joe Dante, Dennis Dugan, Belinda Belaski, Kevin McCarthy, Christopher Stone, Dee Wallace Stone, Patrick MacneeJoe Dante, Dennis Dugan, Belinda Belaski, Kevin McCarthy, Christopher Stone, Dee Wallace Stone, Patrick Macnee  See more",
      "Language": "English",
      "Runtime": "1 hour and 31 minutes",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 3.2 Ounces",
      "Director": "Joe Dante",
      "Media Format": "Multiple Formats, Blu-ray, NTSC, Widescreen, Anamorphic, Subtitled",
      "Run time": "1 hour and 31 minutes",
      "Release date": "June 18, 2013",
      "Actors": "Dee Wallace Stone, Patrick Macnee, Dennis Dugan, Christopher Stone, Belinda Belaski",
      "Subtitles": "English",
      "Studio": "Shout Factory",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}