{
  "user_id": "AG5VBCXQND3AWHLMO6Y3AZ5G7SRA",
  "summary": "=== Purchase Information ===\nProduct Title: The Umbrellas of Cherbourg [Korean Import]\nReview Date: 2013/12/11\nStore: Catherine deneuve  (Actor),     Nino Castelnuovo  (Actor),     Jacques Demy  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Movies\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Jacques Demy', 'Media Format': 'NTSC', 'Run time': '1 hour and 31 minutes', 'Actors': 'Catherine deneuve, Nino Castelnuovo', 'Subtitles': 'English, Korean', 'Language': 'Unqualified (Dolby Digital 2.0 Surround)'}\nReview Text: Get the British/European disc with the colored stripes on the cover, not the Korean one which is fullscreen and of bootleggy quality. The Special Edition is widescreen and of good quality like 'The Girls of Rochefort' also available on Amazon.\nReview Title: Get Special Edition, not Korean disc.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Car\nReview Date: 2014/10/11\nStore: James Brolin  (Actor),     Elliot Silverstein  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: ['Fasten your seatbelts for the terrifying thrill ride that has become a cult classic - The Car! The peaceful tranquility of a small Western town is disturbed when a murderous car wreaks havoc by viciously mowing down innocent victims. New sheriff, Wade Parent (James Brolin), may be the only one who can stop this menace in its tracks until he realizes that the driver of this indestructible vehicle is far more dangerous than any man… it is driven by pure evil. With a digitally remastered picture, The Car has never been more thrilling, more chilling or more explosively entertaining!Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror, Suspense, Arthouse', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'James Brolin, Elliot Silverstein', 'Initial release date': '2008-05-06', 'Language': 'French (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1103503', 'Director': 'Elliot Silverstein', 'Media Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'May 6, 2008', 'Actors': 'James Brolin', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a review about this version of the disc, not the movie. This 'new' disc sold by Amazon, with no DVD security features on the packaging, has numerous glitches; I suspect it's on all copies of this edition, I bought it new. It pauses momentarily, perhaps makes a sound, and continues. It's done this several times already having started the movie (it's on as I speak). It's widescreen and the picture quality is okay, but my roommate pointed out to me that it's overdubbed, that is the sound isn't always matching the lips; I checked the listing, and sure enough, it says \"dubbed\". I haven't tried the French-language soundtrack. I already purchased a used copy of a more expensive edition of this film by Anchor Bay. I'll be returning this one. I'm surprised at Amazon for selling an inferior version as new.<br /><br />--<br /><br />I received and am playing the disk I referred to [[ASIN:6305511861 The Car]] and when trying to review the Amazon system informed me I have already reviewed the product, being the other disk of inferior condition that wouldn't play. This, of course, is ridiculous. This disk, as I have anticipated, is superior and is playing without a single glitch. It was professionally produced with packaging as a DVD should be. So, definitely get this (ASIN 6305511861) rather than the cheaper disk on Amazon which began this review. Both are Region 1. I bought a used disk which is in better condition than the \"new\" one sold by Amazon. Neither Region 1 DVD disk of this movie has subtitles. I'm happy with the widescreen version included on the ASIN mentioned. The single caveat of this edition is that the packaging has a definite flaw:  the ring that holds the disk continues in a full circle even past the finger indentations, making it impossible to remove the disk easily even when holding down the middle button. You could scratch the disk trying to get it out, I had to hold it upside down and dig with the \"button finger\". I won't return it to the case. But the disk itself is great, and the one I recommend (Anchor Bay). Too bad it's out of print.\nReview Title: Glitched. Dubbed. New??\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Amanda\nReview Date: 2014/10/22\nStore: Randy Ryan  (Actor),     Steve Marra  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Joe is a 40-year-old womanizer until he meets Amanda. It's love at first sight and a match made in heaven. They enjoy a storybook romance and decide to get married, much to the dismay of Joe's quirky but loving parents. It's marital bliss until Joe discovers that Amanda was born a man and had a sex change at age 18! Devastated by Amanda's shocking admission, Joe sends her out the door. After much thought, however, Joe comes to his senses and realizes that Amanda was the best thing that ever happened to him. In his quest to find Amanda and rekindle their relationship, he discovers the real truth about love. This charming romantic comedy features Randy Ryan (Public Enemies) and Ariana Dubynin (The List) in a film that identifies true love and explores gender identity.\"]\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Romance', 'Format': 'NTSC, Dolby', 'Contributor': 'Steve Marra, Randy Ryan', 'Language': 'Unqualified', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Steve Marra', 'Media Format': 'NTSC, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'August 13, 2015', 'Actors': 'Randy Ryan', 'Studio': 'osiris Entertainment', 'Number of discs': '1'}\nReview Text: I like the movie because there aren't that many transgender-themed movies, and for the twist at the end. It had humorous moments, and raunchy references, but not a competitor for mainstream-LGBT hybrid comedy-romances (see Kissing Jessica Stein [[ASIN: B000QUCQXS]], Puccini for Beginners [[ASIN: B000N2H8XC]], Gray Matters [[ASIN: B000O76ZO4]], and Out At The Wedding [[ASIN: B001MVWMIY]] for spectacular examples).\nReview Title: Okay, but I want more on this theme.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gray Matters\nReview Date: 2014/10/22\nStore: Heather Graham  (Actor),     Thomas Cavanagh  (Actor),     Sue Kramer  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'They finish each other\\'s sentences, dance like Fred and Ginger, and share the same downtown loft--the perfect couple? Not exactly. Gray and Sam (Heather Graham and Tom Cavanagh), are a sister and brother so compatible and inseparable that people actually assume they are dating. Mortified, they both agree they must branch out and start searching for love. He\\'ll look for a guy for her and she\\'ll look for a gal for him. But when Sam finds his perfect mate in Charlie (Bridget Moynahan) Gray\\'s life turns inside out. A romantic comedy that sets sibling rivalry on its head, \"Gray Matters\" gives a whole new meaning to love... and destiny.', 'Amazon.com', 'Gray Matters', 'has one of the most adorable casts of any movie in recent years--the combined sweetness of Heather Graham (', 'Austin Powers: The Spy Who Shagged Me', '), Bridget Moynahan (', 'Lord of War', '), Molly Shannon (', 'Year of the Dog', '), Thomas Cavanagh (', 'Ed', '), Alan Cumming (', 'X-Men 2', '), and Sissy Spacek (', 'Carrie', ',', 'In the Bedroom', \") narrowly avoids being diabetes-inducing. Gray (Graham) and her brother Sam (Cavanagh) have been best friends forever--so close that they find it hard to date. Gray pushes Sam into asking out Charlie (Moynahan), but when Sam and Charlie hit it off so well they spontaneously decide to get married, Gray finds herself unexpectedly dismayed... but not as dismayed as she is when, on a girls' night out before the ceremony, she and Charlie share a drunken kiss that sets Gray's body tingling.\", 'Gray Matters', \"juggles a lot of emotional issues; the sibling interconnectedness problem doesn't flow smoothly into the coming-out story of the movie's second half. But sprinkled throughout are charming scenes and wonderfully deft moments that make the story's clumsy missteps all the more baffling. There's no question that Graham is a star who just can't seem to find the right vehicle;\", 'Gray Matters', \"won't be her breakthrough, but it's further evidence of her significant appeal.\", '--Bret Fetzer']\nAverage Rating: 4.1\nProduct Details: {'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.38 x 7.44 inches; 2.72 Ounces', 'Item model number': '2243466', 'Director': 'Sue Kramer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 19, 2007', 'Actors': 'Heather Graham, Thomas Cavanagh, Bridget Moynahan, Molly Shannon, Alan Cumming', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: If you enjoy such &#34;LGBT for a mainstream audience&#34; films as Kissing Jessica Stein and Puccini For Beginners, you'll probably like this entry into the genre. Another film you may enjoy is &#34;Out At The Wedding&#34;.\nReview Title: I love this genre!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/10/22\nAverage Rating: 3.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Moira Armstrong'], 'Producers': ['Jane Wellesley'], 'Starring': ['Sophie Ward', 'Kerry Fox', 'Nathaniel Parker'], 'Studio': ['Acorn Media']}\nReview Text: I love lesbian romances that aren't too youthful or edgy (or political), and this fits the bill plus I liked the English village setting. The ending was unexpected but probably realistic. I also love LGBT-for-a-straight-mainstream-audience and Christmas romances, so let's see -- the perfect movie:  A New York City-based lesbian Christmas comedy-romance for a mainstream audience! ... is it out there??\nReview Title: Addicted To Romance\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Truth About Spring\nReview Date: 2015/01/12\nStore: Richard Thorpe  (Director),     Hayley Mills, John Mills, James MacArthur  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Real-life father and daughter John and Hayley Mills star in the swashbuckling romp The Truth About Spring. Tommy Tyler (John Mills), an easy-going Caribbean sailor, is searching for sunken treasure with his tomboy daughter, Spring (Hayley Mills). Things get complicated in their houseboat when a young, wealthy lawyer (James MacArthur) sets sail with them in search of adventure, riches and maybe even love.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Richard Thorpe, Hayley Mills, John Mills, James MacArthur', 'Language': 'English', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '9224314', 'Director': 'Richard Thorpe', 'Media Format': 'NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'August 28, 2014', 'Actors': 'Hayley Mills, John Mills, James MacArthur', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I am a lifelong Haley Mills fan, I grew up with her classic 1960's and Disney films, and this is a missing gem! Too bad it's not available for streaming. I loved it! I'd say one of her most enjoyable movies. She's older (middle-older teen) in this, and it only offers more depth and romantic escapades for her fans! The setting (modern day pirate's boat & cove) and adventure, with her relationship with her old salt dad, and her budding interest in a handsome, young modern man from the city, is refreshing, the 60's appeal is fun, and her character is a rough & tumble tomboy that you'd better not mess with! However, she's feeling soft new feelings she hasn't experienced before, and the coming-of-age conflict is portrayed very well and really fun to watch. This is now one of my very favorite films of hers (along with Gypsy Girl). :) I had never seen this one before, so glad it's available on DVD at least!\nReview Title: Now one of my very favorite Haley Mills films :)\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ken Kwapis'], 'Producers': ['Howard W. Koch', 'Todd Graff'], 'Starring': ['Fran Drescher', 'Timothy Dalton', 'Ian McNeice'], 'Studio': ['Paramount Pictures Corp.']}\nReview Text: Frankly, it was a lot more cornball and slapstick than I remembered, but with superb character portrayal by Fran Drescher I remembered how fun this movie was the first time I saw it and loved it, and I still do! Timothy Dalton's character is completely over the top and tv-sitcom unbelievable, he barks, shouts, and doesn't seem real at all; however Fran is so likeable, warm, and believable in her role that it is still enjoyable for light, funny, romantic fare including children. The contrast between her New York City apartment life and family (her mother is also well-portrayed and hilarious!), and the setting in the Eastern bloc ... castle... is great and Fran's character is spontaneous, outrageous, and make you laugh outloud. You'll identify with her easily. I love this theme, even in silly comedies.\nReview Title: Silly, laugh out loud comedy, but Fran Drescher's portrayal is simply superb. Fun!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Craig Pryce'], 'Producers': ['Ian McDougall'], 'Starring': ['Catherine Bell', 'Chris Potter', 'Catherine Disher'], 'Studio': ['Living Arts']}\nReview Text: Even if you don't intend to view the whole (so far) 5-part movie series, (I purchased them all), you will enjoy the first entry with the following elements:  black-sheep girl trying to get a new start, befuddled leading man with children, nosy and hostile neighbors, small town, mystery, romance, lack of all the elements we don't want to see, and witchery on Christmas! A young couple's romance, family friendly. Our mystery woman arrives unseen in a small town where everyone knows everyone and mainstreet is still open. We learn she has inhereted the large, abandoned mansion. Catherine Bell is at once mysterious, spunky, a rebel, sweet, moral, kind-hearted, intimidating, cute, wise, vulnerable, tough, and all-around absolutely adorable and lovable. She produces the series, and I don't grow tired of the story. See why this is a much beloved modern tv-movie series for years.\nReview Title: I love this movie & series! Family Halloween meets Christmas Romance!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['WilderBilly'], 'Producers': ['Billy Wilder'], 'Starring': ['Humphrey Bogart', 'Audrey Hepburn', 'William Holden'], 'Studio': ['Classics']}\nReview Text: I love the beginning set-up of this movie, with the narration performed by Audrey's character. I could watch the start again and again. Whole movie is enjoyable, and the Cinderella story and surprise twists are standard and enjoyable romance fare.\nReview Title: My favorite Audrey Hepburn film.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['George Seaton'], 'Producers': ['William Perlberg'], 'Starring': [\"Maureen O'Hara\", 'John Payne', 'Edmund Gwenn'], 'Studio': ['20th Century Fox']}\nReview Text: This movie never gets old and I watch it with delight every year. The final scene with the postal workers visiting the courtroom never fails to tickle me.\nReview Title: Every-year favorite.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Wendkos'], 'Producers': ['Lewis J. Rachmil'], 'Starring': ['Sandra Dee', 'James Darren', 'Cliff Robertson'], 'Studio': ['Columbia Pictures']}\nReview Text: Another classic favorite I never tire of watching many years later. Sandra Dee is simply superb in her character, and James Darren is about the most handsome man that ever lived! ;)\nReview Title: Love the 60's!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: You Are Not Alone\nReview Date: 2015/07/21\nStore: Anders Agensø  (Actor),     Peter Bjerg  (Actor),     Ernst Johansen  (Director),     Lasse Nielsen  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: [\"Unflinchingly honest and boundlessly lyrical, the exploration of sexual awakening in You Are Not Alone was a turning point in world cinema. At a Danish boy's boarding school in the late 1970s, Bo and Kim are naive young classmates, whose friendship blossoms into a childlike love affair. When their friend is expelled for a prank involving lewd posters, the student body bands together to strike against the school and its authoritarian headmaster. Lasse Nielsen and Ernst Johansen's classic film is a groundbreaking meditation on innocence, rebellion and love.  Special Features:\", 'Stills Gallery', 'Stills Gallery', 'TLA Releasing Trailers', 'TLA Releasing Trailers']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Restored', 'Contributor': 'Lasse Nielsen, Peter Bjerg, John Hahn-Petersen, Ove Sprogøe, Ole Meyer, Hugo Herrestrup, Elin Reimer, Anders Agensø, Merete Axelberg, Jørn Faurschou, Jan Jørgensen, Aske Jacoby, Beatrice Palner, Ernst JohansenLasse Nielsen, Peter Bjerg, John Hahn-Petersen, Ove Sprogøe, Ole Meyer, Hugo Herrestrup, Elin Reimer, Anders Agensø, Merete Axelberg, Jørn Faurschou, Jan Jørgensen, Aske Jacoby, Beatrice Palner, Ernst Johansen  See more', 'Language': 'Unqualified (Dolby Digital 2.0 Stereo), Danish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'Ernst Johansen, Lasse Nielsen', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Restored', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Anders Agensø, Peter Bjerg, Ove Sprogøe, Elin Reimer, Jan Jørgensen', 'Subtitles': 'English', 'Studio': 'Tla', 'Number of discs': '1'}\nReview Text: Disc is fine, I'm reviewing the film. I mistook this movie for &#34;Lakki...the Boy Who Could Fly ...&#34;, which I had barely remembered from years ago, and bought this by mistake. I do remember the original theatre-house trailers, my impression is that this film was more promoted than many others of the genre, the title alone obtaining &#34;classic&#34; status. I ended up enjoying this clean, uncomplicated script as much as the discombobulated movie I eventually found. Nothing too dramatic here, except for one extended bullying scene, retaining a light-hearted romantic-comedy 80's teen feel throughout. The primary relationship seems spontaneous and naturalistic, not..., er.... scripted. There's little dialogue between our young heroes. I was a bit bored throughout. However my heart was glad to see our protagonists together naturally in an easy, romantic embrace in the same school filmroom as a heterosexual couple doing the same behavior among the class of students, and all accepting smiles as if it was natural and commonplace, which, of course, it was (and should be) in the last scene. Ending sort of made up for the uneventful film, almost.\nReview Title: light-hearted feel-good teenage romance, (slight spoiler last scene alert)\nRating: 4.0\n--------------------------------------------------",
  "reference": "The Umbrellas of Cherbourg [Korean Import]\nCatherine deneuve  (Actor),     Nino Castelnuovo  (Actor),     Jacques Demy  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Jacques Demy', 'Media Format': 'NTSC', 'Run time': '1 hour and 31 minutes', 'Actors': 'Catherine deneuve, Nino Castelnuovo', 'Subtitles': 'English, Korean', 'Language': 'Unqualified (Dolby Digital 2.0 Surround)'}\nGet the British/European disc with the colored stripes on the cover, not the Korean one which is fullscreen and of bootleggy quality. The Special Edition is widescreen and of good quality like 'The Girls of Rochefort' also available on Amazon.\nGet Special Edition, not Korean disc.\nThe Car\nJames Brolin  (Actor),     Elliot Silverstein  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n['Fasten your seatbelts for the terrifying thrill ride that has become a cult classic - The Car! The peaceful tranquility of a small Western town is disturbed when a murderous car wreaks havoc by viciously mowing down innocent victims. New sheriff, Wade Parent (James Brolin), may be the only one who can stop this menace in its tracks until he realizes that the driver of this indestructible vehicle is far more dangerous than any man… it is driven by pure evil. With a digitally remastered picture, The Car has never been more thrilling, more chilling or more explosively entertaining!Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Horror, Suspense, Arthouse', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'James Brolin, Elliot Silverstein', 'Initial release date': '2008-05-06', 'Language': 'French (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1103503', 'Director': 'Elliot Silverstein', 'Media Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'May 6, 2008', 'Actors': 'James Brolin', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a review about this version of the disc, not the movie. This 'new' disc sold by Amazon, with no DVD security features on the packaging, has numerous glitches; I suspect it's on all copies of this edition, I bought it new. It pauses momentarily, perhaps makes a sound, and continues. It's done this several times already having started the movie (it's on as I speak). It's widescreen and the picture quality is okay, but my roommate pointed out to me that it's overdubbed, that is the sound isn't always matching the lips; I checked the listing, and sure enough, it says \"dubbed\". I haven't tried the French-language soundtrack. I already purchased a used copy of a more expensive edition of this film by Anchor Bay. I'll be returning this one. I'm surprised at Amazon for selling an inferior version as new.<br /><br />--<br /><br />I received and am playing the disk I referred to [[ASIN:6305511861 The Car]] and when trying to review the Amazon system informed me I have already reviewed the product, being the other disk of inferior condition that wouldn't play. This, of course, is ridiculous. This disk, as I have anticipated, is superior and is playing without a single glitch. It was professionally produced with packaging as a DVD should be. So, definitely get this (ASIN 6305511861) rather than the cheaper disk on Amazon which began this review. Both are Region 1. I bought a used disk which is in better condition than the \"new\" one sold by Amazon. Neither Region 1 DVD disk of this movie has subtitles. I'm happy with the widescreen version included on the ASIN mentioned. The single caveat of this edition is that the packaging has a definite flaw:  the ring that holds the disk continues in a full circle even past the finger indentations, making it impossible to remove the disk easily even when holding down the middle button. You could scratch the disk trying to get it out, I had to hold it upside down and dig with the \"button finger\". I won't return it to the case. But the disk itself is great, and the one I recommend (Anchor Bay). Too bad it's out of print.\nGlitched. Dubbed. New??\nAmanda\nRandy Ryan  (Actor),     Steve Marra  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Joe is a 40-year-old womanizer until he meets Amanda. It's love at first sight and a match made in heaven. They enjoy a storybook romance and decide to get married, much to the dismay of Joe's quirky but loving parents. It's marital bliss until Joe discovers that Amanda was born a man and had a sex change at age 18! Devastated by Amanda's shocking admission, Joe sends her out the door. After much thought, however, Joe comes to his senses and realizes that Amanda was the best thing that ever happened to him. In his quest to find Amanda and rekindle their relationship, he discovers the real truth about love. This charming romantic comedy features Randy Ryan (Public Enemies) and Ariana Dubynin (The List) in a film that identifies true love and explores gender identity.\"]\n{'Genre': 'Romance', 'Format': 'NTSC, Dolby', 'Contributor': 'Steve Marra, Randy Ryan', 'Language': 'Unqualified', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Steve Marra', 'Media Format': 'NTSC, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'August 13, 2015', 'Actors': 'Randy Ryan', 'Studio': 'osiris Entertainment', 'Number of discs': '1'}\nI like the movie because there aren't that many transgender-themed movies, and for the twist at the end. It had humorous moments, and raunchy references, but not a competitor for mainstream-LGBT hybrid comedy-romances (see Kissing Jessica Stein [[ASIN: B000QUCQXS]], Puccini for Beginners [[ASIN: B000N2H8XC]], Gray Matters [[ASIN: B000O76ZO4]], and Out At The Wedding [[ASIN: B001MVWMIY]] for spectacular examples).\nOkay, but I want more on this theme.\nGray Matters\nHeather Graham  (Actor),     Thomas Cavanagh  (Actor),     Sue Kramer  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'They finish each other\\'s sentences, dance like Fred and Ginger, and share the same downtown loft--the perfect couple? Not exactly. Gray and Sam (Heather Graham and Tom Cavanagh), are a sister and brother so compatible and inseparable that people actually assume they are dating. Mortified, they both agree they must branch out and start searching for love. He\\'ll look for a guy for her and she\\'ll look for a gal for him. But when Sam finds his perfect mate in Charlie (Bridget Moynahan) Gray\\'s life turns inside out. A romantic comedy that sets sibling rivalry on its head, \"Gray Matters\" gives a whole new meaning to love... and destiny.', 'Amazon.com', 'Gray Matters', 'has one of the most adorable casts of any movie in recent years--the combined sweetness of Heather Graham (', 'Austin Powers: The Spy Who Shagged Me', '), Bridget Moynahan (', 'Lord of War', '), Molly Shannon (', 'Year of the Dog', '), Thomas Cavanagh (', 'Ed', '), Alan Cumming (', 'X-Men 2', '), and Sissy Spacek (', 'Carrie', ',', 'In the Bedroom', \") narrowly avoids being diabetes-inducing. Gray (Graham) and her brother Sam (Cavanagh) have been best friends forever--so close that they find it hard to date. Gray pushes Sam into asking out Charlie (Moynahan), but when Sam and Charlie hit it off so well they spontaneously decide to get married, Gray finds herself unexpectedly dismayed... but not as dismayed as she is when, on a girls' night out before the ceremony, she and Charlie share a drunken kiss that sets Gray's body tingling.\", 'Gray Matters', \"juggles a lot of emotional issues; the sibling interconnectedness problem doesn't flow smoothly into the coming-out story of the movie's second half. But sprinkled throughout are charming scenes and wonderfully deft moments that make the story's clumsy missteps all the more baffling. There's no question that Graham is a star who just can't seem to find the right vehicle;\", 'Gray Matters', \"won't be her breakthrough, but it's further evidence of her significant appeal.\", '--Bret Fetzer']\n{'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.38 x 7.44 inches; 2.72 Ounces', 'Item model number': '2243466', 'Director': 'Sue Kramer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 19, 2007', 'Actors': 'Heather Graham, Thomas Cavanagh, Bridget Moynahan, Molly Shannon, Alan Cumming', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nIf you enjoy such &#34;LGBT for a mainstream audience&#34; films as Kissing Jessica Stein and Puccini For Beginners, you'll probably like this entry into the genre. Another film you may enjoy is &#34;Out At The Wedding&#34;.\nI love this genre!\n{'Subtitles': ['None available'], 'Directors': ['Moira Armstrong'], 'Producers': ['Jane Wellesley'], 'Starring': ['Sophie Ward', 'Kerry Fox', 'Nathaniel Parker'], 'Studio': ['Acorn Media']}\nI love lesbian romances that aren't too youthful or edgy (or political), and this fits the bill plus I liked the English village setting. The ending was unexpected but probably realistic. I also love LGBT-for-a-straight-mainstream-audience and Christmas romances, so let's see -- the perfect movie:  A New York City-based lesbian Christmas comedy-romance for a mainstream audience! ... is it out there??\nAddicted To Romance\nTruth About Spring\nRichard Thorpe  (Director),     Hayley Mills, John Mills, James MacArthur  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Real-life father and daughter John and Hayley Mills star in the swashbuckling romp The Truth About Spring. Tommy Tyler (John Mills), an easy-going Caribbean sailor, is searching for sunken treasure with his tomboy daughter, Spring (Hayley Mills). Things get complicated in their houseboat when a young, wealthy lawyer (James MacArthur) sets sail with them in search of adventure, riches and maybe even love.']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Richard Thorpe, Hayley Mills, John Mills, James MacArthur', 'Language': 'English', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '9224314', 'Director': 'Richard Thorpe', 'Media Format': 'NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'August 28, 2014', 'Actors': 'Hayley Mills, John Mills, James MacArthur', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI am a lifelong Haley Mills fan, I grew up with her classic 1960's and Disney films, and this is a missing gem! Too bad it's not available for streaming. I loved it! I'd say one of her most enjoyable movies. She's older (middle-older teen) in this, and it only offers more depth and romantic escapades for her fans! The setting (modern day pirate's boat & cove) and adventure, with her relationship with her old salt dad, and her budding interest in a handsome, young modern man from the city, is refreshing, the 60's appeal is fun, and her character is a rough & tumble tomboy that you'd better not mess with! However, she's feeling soft new feelings she hasn't experienced before, and the coming-of-age conflict is portrayed very well and really fun to watch. This is now one of my very favorite films of hers (along with Gypsy Girl). :) I had never seen this one before, so glad it's available on DVD at least!\nNow one of my very favorite Haley Mills films :)\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ken Kwapis'], 'Producers': ['Howard W. Koch', 'Todd Graff'], 'Starring': ['Fran Drescher', 'Timothy Dalton', 'Ian McNeice'], 'Studio': ['Paramount Pictures Corp.']}\nFrankly, it was a lot more cornball and slapstick than I remembered, but with superb character portrayal by Fran Drescher I remembered how fun this movie was the first time I saw it and loved it, and I still do! Timothy Dalton's character is completely over the top and tv-sitcom unbelievable, he barks, shouts, and doesn't seem real at all; however Fran is so likeable, warm, and believable in her role that it is still enjoyable for light, funny, romantic fare including children. The contrast between her New York City apartment life and family (her mother is also well-portrayed and hilarious!), and the setting in the Eastern bloc ... castle... is great and Fran's character is spontaneous, outrageous, and make you laugh outloud. You'll identify with her easily. I love this theme, even in silly comedies.\nSilly, laugh out loud comedy, but Fran Drescher's portrayal is simply superb. Fun!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Craig Pryce'], 'Producers': ['Ian McDougall'], 'Starring': ['Catherine Bell', 'Chris Potter', 'Catherine Disher'], 'Studio': ['Living Arts']}\nEven if you don't intend to view the whole (so far) 5-part movie series, (I purchased them all), you will enjoy the first entry with the following elements:  black-sheep girl trying to get a new start, befuddled leading man with children, nosy and hostile neighbors, small town, mystery, romance, lack of all the elements we don't want to see, and witchery on Christmas! A young couple's romance, family friendly. Our mystery woman arrives unseen in a small town where everyone knows everyone and mainstreet is still open. We learn she has inhereted the large, abandoned mansion. Catherine Bell is at once mysterious, spunky, a rebel, sweet, moral, kind-hearted, intimidating, cute, wise, vulnerable, tough, and all-around absolutely adorable and lovable. She produces the series, and I don't grow tired of the story. See why this is a much beloved modern tv-movie series for years.\nI love this movie & series! Family Halloween meets Christmas Romance!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['WilderBilly'], 'Producers': ['Billy Wilder'], 'Starring': ['Humphrey Bogart', 'Audrey Hepburn', 'William Holden'], 'Studio': ['Classics']}\nI love the beginning set-up of this movie, with the narration performed by Audrey's character. I could watch the start again and again. Whole movie is enjoyable, and the Cinderella story and surprise twists are standard and enjoyable romance fare.\nMy favorite Audrey Hepburn film.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['George Seaton'], 'Producers': ['William Perlberg'], 'Starring': [\"Maureen O'Hara\", 'John Payne', 'Edmund Gwenn'], 'Studio': ['20th Century Fox']}\nThis movie never gets old and I watch it with delight every year. The final scene with the postal workers visiting the courtroom never fails to tickle me.\nEvery-year favorite.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Wendkos'], 'Producers': ['Lewis J. Rachmil'], 'Starring': ['Sandra Dee', 'James Darren', 'Cliff Robertson'], 'Studio': ['Columbia Pictures']}\nAnother classic favorite I never tire of watching many years later. Sandra Dee is simply superb in her character, and James Darren is about the most handsome man that ever lived! ;)\nLove the 60's!\nYou Are Not Alone\nAnders Agensø  (Actor),     Peter Bjerg  (Actor),     Ernst Johansen  (Director),     Lasse Nielsen  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Independently Distributed, Drama\n[\"Unflinchingly honest and boundlessly lyrical, the exploration of sexual awakening in You Are Not Alone was a turning point in world cinema. At a Danish boy's boarding school in the late 1970s, Bo and Kim are naive young classmates, whose friendship blossoms into a childlike love affair. When their friend is expelled for a prank involving lewd posters, the student body bands together to strike against the school and its authoritarian headmaster. Lasse Nielsen and Ernst Johansen's classic film is a groundbreaking meditation on innocence, rebellion and love.  Special Features:\", 'Stills Gallery', 'Stills Gallery', 'TLA Releasing Trailers', 'TLA Releasing Trailers']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Restored', 'Contributor': 'Lasse Nielsen, Peter Bjerg, John Hahn-Petersen, Ove Sprogøe, Ole Meyer, Hugo Herrestrup, Elin Reimer, Anders Agensø, Merete Axelberg, Jørn Faurschou, Jan Jørgensen, Aske Jacoby, Beatrice Palner, Ernst JohansenLasse Nielsen, Peter Bjerg, John Hahn-Petersen, Ove Sprogøe, Ole Meyer, Hugo Herrestrup, Elin Reimer, Anders Agensø, Merete Axelberg, Jørn Faurschou, Jan Jørgensen, Aske Jacoby, Beatrice Palner, Ernst Johansen  See more', 'Language': 'Unqualified (Dolby Digital 2.0 Stereo), Danish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'Ernst Johansen, Lasse Nielsen', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Restored', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Anders Agensø, Peter Bjerg, Ove Sprogøe, Elin Reimer, Jan Jørgensen', 'Subtitles': 'English', 'Studio': 'Tla', 'Number of discs': '1'}\nDisc is fine, I'm reviewing the film. I mistook this movie for &#34;Lakki...the Boy Who Could Fly ...&#34;, which I had barely remembered from years ago, and bought this by mistake. I do remember the original theatre-house trailers, my impression is that this film was more promoted than many others of the genre, the title alone obtaining &#34;classic&#34; status. I ended up enjoying this clean, uncomplicated script as much as the discombobulated movie I eventually found. Nothing too dramatic here, except for one extended bullying scene, retaining a light-hearted romantic-comedy 80's teen feel throughout. The primary relationship seems spontaneous and naturalistic, not..., er.... scripted. There's little dialogue between our young heroes. I was a bit bored throughout. However my heart was glad to see our protagonists together naturally in an easy, romantic embrace in the same school filmroom as a heterosexual couple doing the same behavior among the class of students, and all accepting smiles as if it was natural and commonplace, which, of course, it was (and should be) in the last scene. Ending sort of made up for the uneventful film, almost.\nlight-hearted feel-good teenage romance, (slight spoiler last scene alert)",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: The Umbrellas of Cherbourg [Korean Import]\nReview Date: 2013/12/11\nStore: Catherine deneuve  (Actor),     Nino Castelnuovo  (Actor),     Jacques Demy  (Director)    &                   0                  more   Format: DVD\nCategories: Movies & TV, Movies\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Jacques Demy', 'Media Format': 'NTSC', 'Run time': '1 hour and 31 minutes', 'Actors': 'Catherine deneuve, Nino Castelnuovo', 'Subtitles': 'English, Korean', 'Language': 'Unqualified (Dolby Digital 2.0 Surround)'}\nReview Text: Get the British/European disc with the colored stripes on the cover, not the Korean one which is fullscreen and of bootleggy quality. The Special Edition is widescreen and of good quality like 'The Girls of Rochefort' also available on Amazon.\nReview Title: Get Special Edition, not Korean disc.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Car\nReview Date: 2014/10/11\nStore: James Brolin  (Actor),     Elliot Silverstein  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Horror\nProduct Description: ['Fasten your seatbelts for the terrifying thrill ride that has become a cult classic - The Car! The peaceful tranquility of a small Western town is disturbed when a murderous car wreaks havoc by viciously mowing down innocent victims. New sheriff, Wade Parent (James Brolin), may be the only one who can stop this menace in its tracks until he realizes that the driver of this indestructible vehicle is far more dangerous than any man… it is driven by pure evil. With a digitally remastered picture, The Car has never been more thrilling, more chilling or more explosively entertaining!Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Horror, Suspense, Arthouse', 'Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'James Brolin, Elliot Silverstein', 'Initial release date': '2008-05-06', 'Language': 'French (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1103503', 'Director': 'Elliot Silverstein', 'Media Format': 'Multiple Formats, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'May 6, 2008', 'Actors': 'James Brolin', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a review about this version of the disc, not the movie. This 'new' disc sold by Amazon, with no DVD security features on the packaging, has numerous glitches; I suspect it's on all copies of this edition, I bought it new. It pauses momentarily, perhaps makes a sound, and continues. It's done this several times already having started the movie (it's on as I speak). It's widescreen and the picture quality is okay, but my roommate pointed out to me that it's overdubbed, that is the sound isn't always matching the lips; I checked the listing, and sure enough, it says \"dubbed\". I haven't tried the French-language soundtrack. I already purchased a used copy of a more expensive edition of this film by Anchor Bay. I'll be returning this one. I'm surprised at Amazon for selling an inferior version as new.<br /><br />--<br /><br />I received and am playing the disk I referred to [[ASIN:6305511861 The Car]] and when trying to review the Amazon system informed me I have already reviewed the product, being the other disk of inferior condition that wouldn't play. This, of course, is ridiculous. This disk, as I have anticipated, is superior and is playing without a single glitch. It was professionally produced with packaging as a DVD should be. So, definitely get this (ASIN 6305511861) rather than the cheaper disk on Amazon which began this review. Both are Region 1. I bought a used disk which is in better condition than the \"new\" one sold by Amazon. Neither Region 1 DVD disk of this movie has subtitles. I'm happy with the widescreen version included on the ASIN mentioned. The single caveat of this edition is that the packaging has a definite flaw:  the ring that holds the disk continues in a full circle even past the finger indentations, making it impossible to remove the disk easily even when holding down the middle button. You could scratch the disk trying to get it out, I had to hold it upside down and dig with the \"button finger\". I won't return it to the case. But the disk itself is great, and the one I recommend (Anchor Bay). Too bad it's out of print.\nReview Title: Glitched. Dubbed. New??\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Amanda\nReview Date: 2014/10/22\nStore: Randy Ryan  (Actor),     Steve Marra  (Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Joe is a 40-year-old womanizer until he meets Amanda. It's love at first sight and a match made in heaven. They enjoy a storybook romance and decide to get married, much to the dismay of Joe's quirky but loving parents. It's marital bliss until Joe discovers that Amanda was born a man and had a sex change at age 18! Devastated by Amanda's shocking admission, Joe sends her out the door. After much thought, however, Joe comes to his senses and realizes that Amanda was the best thing that ever happened to him. In his quest to find Amanda and rekindle their relationship, he discovers the real truth about love. This charming romantic comedy features Randy Ryan (Public Enemies) and Ariana Dubynin (The List) in a film that identifies true love and explores gender identity.\"]\nAverage Rating: 3.9\nProduct Details: {'Genre': 'Romance', 'Format': 'NTSC, Dolby', 'Contributor': 'Steve Marra, Randy Ryan', 'Language': 'Unqualified', 'Runtime': '1 hour and 25 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Director': 'Steve Marra', 'Media Format': 'NTSC, Dolby', 'Run time': '1 hour and 25 minutes', 'Release date': 'August 13, 2015', 'Actors': 'Randy Ryan', 'Studio': 'osiris Entertainment', 'Number of discs': '1'}\nReview Text: I like the movie because there aren't that many transgender-themed movies, and for the twist at the end. It had humorous moments, and raunchy references, but not a competitor for mainstream-LGBT hybrid comedy-romances (see Kissing Jessica Stein [[ASIN: B000QUCQXS]], Puccini for Beginners [[ASIN: B000N2H8XC]], Gray Matters [[ASIN: B000O76ZO4]], and Out At The Wedding [[ASIN: B001MVWMIY]] for spectacular examples).\nReview Title: Okay, but I want more on this theme.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gray Matters\nReview Date: 2014/10/22\nStore: Heather Graham  (Actor),     Thomas Cavanagh  (Actor),     Sue Kramer  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['Product Description', 'They finish each other\\'s sentences, dance like Fred and Ginger, and share the same downtown loft--the perfect couple? Not exactly. Gray and Sam (Heather Graham and Tom Cavanagh), are a sister and brother so compatible and inseparable that people actually assume they are dating. Mortified, they both agree they must branch out and start searching for love. He\\'ll look for a guy for her and she\\'ll look for a gal for him. But when Sam finds his perfect mate in Charlie (Bridget Moynahan) Gray\\'s life turns inside out. A romantic comedy that sets sibling rivalry on its head, \"Gray Matters\" gives a whole new meaning to love... and destiny.', 'Amazon.com', 'Gray Matters', 'has one of the most adorable casts of any movie in recent years--the combined sweetness of Heather Graham (', 'Austin Powers: The Spy Who Shagged Me', '), Bridget Moynahan (', 'Lord of War', '), Molly Shannon (', 'Year of the Dog', '), Thomas Cavanagh (', 'Ed', '), Alan Cumming (', 'X-Men 2', '), and Sissy Spacek (', 'Carrie', ',', 'In the Bedroom', \") narrowly avoids being diabetes-inducing. Gray (Graham) and her brother Sam (Cavanagh) have been best friends forever--so close that they find it hard to date. Gray pushes Sam into asking out Charlie (Moynahan), but when Sam and Charlie hit it off so well they spontaneously decide to get married, Gray finds herself unexpectedly dismayed... but not as dismayed as she is when, on a girls' night out before the ceremony, she and Charlie share a drunken kiss that sets Gray's body tingling.\", 'Gray Matters', \"juggles a lot of emotional issues; the sibling interconnectedness problem doesn't flow smoothly into the coming-out story of the movie's second half. But sprinkled throughout are charming scenes and wonderfully deft moments that make the story's clumsy missteps all the more baffling. There's no question that Graham is a star who just can't seem to find the right vehicle;\", 'Gray Matters', \"won't be her breakthrough, but it's further evidence of her significant appeal.\", '--Bret Fetzer']\nAverage Rating: 4.1\nProduct Details: {'Aspect Ratio': '1.33:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.38 x 7.44 inches; 2.72 Ounces', 'Item model number': '2243466', 'Director': 'Sue Kramer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 19, 2007', 'Actors': 'Heather Graham, Thomas Cavanagh, Bridget Moynahan, Molly Shannon, Alan Cumming', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '1'}\nReview Text: If you enjoy such &#34;LGBT for a mainstream audience&#34; films as Kissing Jessica Stein and Puccini For Beginners, you'll probably like this entry into the genre. Another film you may enjoy is &#34;Out At The Wedding&#34;.\nReview Title: I love this genre!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2014/10/22\nAverage Rating: 3.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Moira Armstrong'], 'Producers': ['Jane Wellesley'], 'Starring': ['Sophie Ward', 'Kerry Fox', 'Nathaniel Parker'], 'Studio': ['Acorn Media']}\nReview Text: I love lesbian romances that aren't too youthful or edgy (or political), and this fits the bill plus I liked the English village setting. The ending was unexpected but probably realistic. I also love LGBT-for-a-straight-mainstream-audience and Christmas romances, so let's see -- the perfect movie:  A New York City-based lesbian Christmas comedy-romance for a mainstream audience! ... is it out there??\nReview Title: Addicted To Romance\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Truth About Spring\nReview Date: 2015/01/12\nStore: Richard Thorpe  (Director),     Hayley Mills, John Mills, James MacArthur  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Real-life father and daughter John and Hayley Mills star in the swashbuckling romp The Truth About Spring. Tommy Tyler (John Mills), an easy-going Caribbean sailor, is searching for sunken treasure with his tomboy daughter, Spring (Hayley Mills). Things get complicated in their houseboat when a young, wealthy lawyer (James MacArthur) sets sail with them in search of adventure, riches and maybe even love.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'NTSC', 'Contributor': 'Richard Thorpe, Hayley Mills, John Mills, James MacArthur', 'Language': 'English', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.78:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Item model number': '9224314', 'Director': 'Richard Thorpe', 'Media Format': 'NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'August 28, 2014', 'Actors': 'Hayley Mills, John Mills, James MacArthur', 'Studio': 'Universal', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I am a lifelong Haley Mills fan, I grew up with her classic 1960's and Disney films, and this is a missing gem! Too bad it's not available for streaming. I loved it! I'd say one of her most enjoyable movies. She's older (middle-older teen) in this, and it only offers more depth and romantic escapades for her fans! The setting (modern day pirate's boat & cove) and adventure, with her relationship with her old salt dad, and her budding interest in a handsome, young modern man from the city, is refreshing, the 60's appeal is fun, and her character is a rough & tumble tomboy that you'd better not mess with! However, she's feeling soft new feelings she hasn't experienced before, and the coming-of-age conflict is portrayed very well and really fun to watch. This is now one of my very favorite films of hers (along with Gypsy Girl). :) I had never seen this one before, so glad it's available on DVD at least!\nReview Title: Now one of my very favorite Haley Mills films :)\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ken Kwapis'], 'Producers': ['Howard W. Koch', 'Todd Graff'], 'Starring': ['Fran Drescher', 'Timothy Dalton', 'Ian McNeice'], 'Studio': ['Paramount Pictures Corp.']}\nReview Text: Frankly, it was a lot more cornball and slapstick than I remembered, but with superb character portrayal by Fran Drescher I remembered how fun this movie was the first time I saw it and loved it, and I still do! Timothy Dalton's character is completely over the top and tv-sitcom unbelievable, he barks, shouts, and doesn't seem real at all; however Fran is so likeable, warm, and believable in her role that it is still enjoyable for light, funny, romantic fare including children. The contrast between her New York City apartment life and family (her mother is also well-portrayed and hilarious!), and the setting in the Eastern bloc ... castle... is great and Fran's character is spontaneous, outrageous, and make you laugh outloud. You'll identify with her easily. I love this theme, even in silly comedies.\nReview Title: Silly, laugh out loud comedy, but Fran Drescher's portrayal is simply superb. Fun!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Craig Pryce'], 'Producers': ['Ian McDougall'], 'Starring': ['Catherine Bell', 'Chris Potter', 'Catherine Disher'], 'Studio': ['Living Arts']}\nReview Text: Even if you don't intend to view the whole (so far) 5-part movie series, (I purchased them all), you will enjoy the first entry with the following elements:  black-sheep girl trying to get a new start, befuddled leading man with children, nosy and hostile neighbors, small town, mystery, romance, lack of all the elements we don't want to see, and witchery on Christmas! A young couple's romance, family friendly. Our mystery woman arrives unseen in a small town where everyone knows everyone and mainstreet is still open. We learn she has inhereted the large, abandoned mansion. Catherine Bell is at once mysterious, spunky, a rebel, sweet, moral, kind-hearted, intimidating, cute, wise, vulnerable, tough, and all-around absolutely adorable and lovable. She produces the series, and I don't grow tired of the story. See why this is a much beloved modern tv-movie series for years.\nReview Title: I love this movie & series! Family Halloween meets Christmas Romance!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['WilderBilly'], 'Producers': ['Billy Wilder'], 'Starring': ['Humphrey Bogart', 'Audrey Hepburn', 'William Holden'], 'Studio': ['Classics']}\nReview Text: I love the beginning set-up of this movie, with the narration performed by Audrey's character. I could watch the start again and again. Whole movie is enjoyable, and the Cinderella story and surprise twists are standard and enjoyable romance fare.\nReview Title: My favorite Audrey Hepburn film.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['George Seaton'], 'Producers': ['William Perlberg'], 'Starring': [\"Maureen O'Hara\", 'John Payne', 'Edmund Gwenn'], 'Studio': ['20th Century Fox']}\nReview Text: This movie never gets old and I watch it with delight every year. The final scene with the postal workers visiting the courtroom never fails to tickle me.\nReview Title: Every-year favorite.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/01/12\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paul Wendkos'], 'Producers': ['Lewis J. Rachmil'], 'Starring': ['Sandra Dee', 'James Darren', 'Cliff Robertson'], 'Studio': ['Columbia Pictures']}\nReview Text: Another classic favorite I never tire of watching many years later. Sandra Dee is simply superb in her character, and James Darren is about the most handsome man that ever lived! ;)\nReview Title: Love the 60's!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: You Are Not Alone\nReview Date: 2015/07/21\nStore: Anders Agensø  (Actor),     Peter Bjerg  (Actor),     Ernst Johansen  (Director),     Lasse Nielsen  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: [\"Unflinchingly honest and boundlessly lyrical, the exploration of sexual awakening in You Are Not Alone was a turning point in world cinema. At a Danish boy's boarding school in the late 1970s, Bo and Kim are naive young classmates, whose friendship blossoms into a childlike love affair. When their friend is expelled for a prank involving lewd posters, the student body bands together to strike against the school and its authoritarian headmaster. Lasse Nielsen and Ernst Johansen's classic film is a groundbreaking meditation on innocence, rebellion and love.  Special Features:\", 'Stills Gallery', 'Stills Gallery', 'TLA Releasing Trailers', 'TLA Releasing Trailers']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Restored', 'Contributor': 'Lasse Nielsen, Peter Bjerg, John Hahn-Petersen, Ove Sprogøe, Ole Meyer, Hugo Herrestrup, Elin Reimer, Anders Agensø, Merete Axelberg, Jørn Faurschou, Jan Jørgensen, Aske Jacoby, Beatrice Palner, Ernst JohansenLasse Nielsen, Peter Bjerg, John Hahn-Petersen, Ove Sprogøe, Ole Meyer, Hugo Herrestrup, Elin Reimer, Anders Agensø, Merete Axelberg, Jørn Faurschou, Jan Jørgensen, Aske Jacoby, Beatrice Palner, Ernst Johansen  See more', 'Language': 'Unqualified (Dolby Digital 2.0 Stereo), Danish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'Ernst Johansen, Lasse Nielsen', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Restored', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 27, 2006', 'Actors': 'Anders Agensø, Peter Bjerg, Ove Sprogøe, Elin Reimer, Jan Jørgensen', 'Subtitles': 'English', 'Studio': 'Tla', 'Number of discs': '1'}\nReview Text: Disc is fine, I'm reviewing the film. I mistook this movie for &#34;Lakki...the Boy Who Could Fly ...&#34;, which I had barely remembered from years ago, and bought this by mistake. I do remember the original theatre-house trailers, my impression is that this film was more promoted than many others of the genre, the title alone obtaining &#34;classic&#34; status. I ended up enjoying this clean, uncomplicated script as much as the discombobulated movie I eventually found. Nothing too dramatic here, except for one extended bullying scene, retaining a light-hearted romantic-comedy 80's teen feel throughout. The primary relationship seems spontaneous and naturalistic, not..., er.... scripted. There's little dialogue between our young heroes. I was a bit bored throughout. However my heart was glad to see our protagonists together naturally in an easy, romantic embrace in the same school filmroom as a heterosexual couple doing the same behavior among the class of students, and all accepting smiles as if it was natural and commonplace, which, of course, it was (and should be) in the last scene. Ending sort of made up for the uneventful film, almost.\nReview Title: light-hearted feel-good teenage romance, (slight spoiler last scene alert)\nRating: 4.0\n--------------------------------------------------",
  "raw_response": "**Keywords & Trends Summary:**\n\n- **Movie Preferences:** Predominantly enjoys classic and independent films, with a strong inclination towards romance, drama, and comedies that explore gender identity and LGBTQ+ themes.\n- **Genres:** High interest in LGBTQ+ romantic comedies, traditional romantic narratives, horror, and nostalgic classics from the 1960s and 1970s.\n- **Quality Over Format:** Prefers high-quality, special or restored editions over standard or poorly produced versions, particularly in DVDs.\n- **Reviews:** Detailed and critical of packaging and production quality, indicating a strong desire for high standards; appreciates humorous and relatable character portrayals.\n- **Favorite Themes:** Enjoys stories that integrate romance with personal growth, unexpected character twists, and progressive gender narratives; also has a penchant for holiday-themed films.\n- **Actor Affinity:** Favors performances by actresses with a notable presence in classic cinema, particularly those with charm and depth.\n- **Recurring Interests:** Expresses love for light-hearted storytelling that challenges societal norms and emphasizes inclusive narratives; frequently references an appreciation for LGBTQ films made for mainstream audiences.\n- **Experience-Oriented:** Tends to seek films that evoke strong emotional responses, conveying personal connections to the stories and characters.",
  "target_interaction": {
    "rating": 4.0,
    "title": "5 for the movie... wrong aspect ratio",
    "text": "5 for the movie,  3 for the streaming version.  Amazon is streaming the movie in the wrong aspect. You have to switch your tv to 4:3 to get a correct picture ratio. I love the movie!",
    "images": [],
    "asin": "B000H0YK2C",
    "parent_asin": "B000H0YK2C",
    "user_id": "AG5VBCXQND3AWHLMO6Y3AZ5G7SRA",
    "timestamp": "2021-04-11 06:28:21.250000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": "Curse of the Cat People",
    "average_rating": 4.4,
    "rating_number": 203,
    "features": [
      "IMDb 6.7",
      "1 h 9 min",
      "1944",
      "ALL"
    ],
    "description": [
      "Sequel to the classic horror film \"Cat People\" about a lonely child who creates an imaginary playmate with surprisingly dangerous results."
    ],
    "price": 9.99,
    "images_meta": [
      {
        "360w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX360_FMwebp_.jpg",
        "480w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX480_FMwebp_.jpg",
        "720w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX720_FMwebp_.jpg",
        "1080w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1080_FMwebp_.jpg",
        "1440w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1440_FMwebp_.jpg",
        "1920w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": [
      "Suspense",
      "Horror",
      "Drama",
      "Fantasy"
    ],
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Robert Wise",
        "Gunther von Fritsch"
      ],
      "Producers": [
        "Val Lewton"
      ],
      "Starring": [
        "Simone Simon",
        "Kent Smith",
        "Jane Randolph"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}