{
  "user_id": "AGIFTJN3ZPLCLP247OUNGV27CASQ",
  "summary": "=== Purchase Information ===\nReview Date: 2018/03/28\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greta Gerwig'], 'Producers': ['Eli Bush', \"Evelyn O'Neill\", 'Scott Rudin', 'Jason Sack', 'Alex G. Scott', 'Lila Yacoub'], 'Starring': ['Ronan', 'Saoirse', 'Laurie Metcalf'], 'Studio': ['A24 Distribution LLC']}\nReview Text: I don't quite understand why this movie got the Oscar buzz it did. I feel like there are so many EXCELLENT and AMAZING under the radar teen movies that deserve Oscar credit than this mediocre film like Edge of Seventeen or even more recently Love, Simon.<br />Lady Bird tries to do much in one movie without a general vision. The character meanders and is often awful. I hate the relationship she has with her mom and her best friend. She treats everyone horribly.<br /><br />SPOILER ALERT:<br /><br />At the end, there is no life lessons learned by the main character; however, she becomes lonely and instead cow-tows to her mom, who was verbally abusive to her in the entire movie. That is a horrible lesson for any teen or any one else to take away from this movie. This character should have dropped her mom like it is hot and realized that she is better off without her belittling her all of the time and yelling in her face and demeaning her. I don't understand why this movie got so much buzz when the Edge of Seventeen deals with the tension between a mother and daughter in a much more mature and well-developed way. This movie leaves a lot to be desired.\nReview Title: Why the Oscar Buzz? You can do much better for a movie tonight!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scream 4\nReview Date: 2018/05/06\nCategories: Comedy, Horror, Eerie, Ominous\nProduct Description: ['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nReview Text: I really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nReview Title: Retro Tale of Love, Loss, and Murder\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/11\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Hutchings'], 'Producers': ['Victoria Bousis', 'Wendy Cox', 'Brice Dal Farra', 'Claude Dal Farra', 'Glenn W. Garland', 'Brian Keady', 'Kathleen E. Kearney', 'Christian Mercuri', 'Lauren Munsch'], 'Starring': ['Eden Sher', 'Victoria Justice', 'Peyton List'], 'Studio': ['Vision Films']}\nReview Text: I LOVE Eden Sher, Sue Sue Heck, from The Middle, which I will miss so much once it stops airing later this year. I am also a fan of the other actors/actresses in the movie, but this movie doesn't do their talent justice (pun intended, given Victoria Justice is one of the leads). The movie cops to a lot of teen geek chick romance ploys and plot points and doesn't serve to stir up any new thought provoking ideas about bullies, nerds, and kids that are often forgotten. I have seen movies that cleverly discuss these ideals like Before I Fall, The DUFF, and Prom. I like this movie. It is forgettable, but good for a Sunday night movie popcorn theater at home. It is just not memorable, but does the trick in the moment.\nReview Title: Forgettable Geek Chic, but You Can Do Better...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/17\nAverage Rating: 4.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Andy Devonshire'], 'Producers': ['Anna Beattie', 'Mark Drake', 'Anna Driver', 'Hannah Griffiths', 'Jake Senior', 'Samantha Beddoes', 'Helen Cawley'], 'Starring': ['Mel Giedroyc', 'Sue Perkins', 'Mary Berry'], 'Studio': ['PBS']}\nReview Text: For anyone who likes cooking and baking competitions, this one is slightly different for a few reasons:<br />1) it is set in England<br />2) all of the deserts are things that I had never heard of before and very unique to watch being made from start to scratch (pun, intended)<br />3) The hosts are all engaging, except one<br />4) The contestants are not super competitive or mean with each other and help each other out when things go poorly. I love that in competitive shows.<br />5) This is great fun for anyone with an interest in food.\nReview Title: Great British Introduction to Unusual Foods Across the Pond\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/23\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Mysak', 'Michael Fitzpatrick Lawrence Jr.', 'Nick Petrie'], 'Producers': ['John Dufresne-Williams', 'Montré Burton', 'Chris Lauer', 'Chris Coelen', 'Karrie Wolfe', 'Kimberly Goodman', 'Jason Sands'], 'Starring': ['Neil Bowlus', 'Joseph Cilona', 'Ashley Doherty']}\nReview Text: Married at First Sight is a reality tv show where couples that have never met before are matched by professionals- a psychologist, a sexologist, and a sociologist- in an arranged marriage and see if they can make it work for 6 weeks- some couples survive, some don’t. You learn a TON about why people do the things they do and why relationships don’t work and some do work. I love it and learned a lot of great tips on how to improve my own relationships and provide guidance with others struggling in their own relationships.\nReview Title: Excellent Reality TV with Real World Applications\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bletchley Circle: Cracking a Killer's Code\nReview Date: 2018/05/23\nStore: .  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Mystery & Thrillers\nProduct Description: ['Product Description', 'Four women who worked as codebreakers at Bletchley Park have taken up civilian lives. Susan, has collated data about a series of murders. She tries to convince the police she knows where another body is, but they are unable to locate it and dismiss her. She turns to her three friends and they work out where the next victim will be taken, find the body, then decide they are the only ones who can track down the killer.', 'Amazon.com', 'After her days cracking Nazi codes at Bletchley Park during World War II, Susan Gray (Anna Maxwell Martin) finds life as a housewife lacking. When she perceives patterns in a series of killings, she approaches the police, only to be rebuffed. Horrified by the prospect of more women being murdered, Susan gathers three of her Bletchley cohorts--outspoken, independent Millie (Rachael Stirling,', 'Tipping the Velvet', '); Jean (Julie Graham), an administrator at Bletchley who still has connections in the British bureaucracy; and Lucy (Sophie Rundle), whose eidetic memory makes her a living computer. Their complementary skills allow them to deconstruct these grisly crimes, predicting where the killer may strike next and gradually unraveling where he came from… which brings them closer to the murderer than they ever expected.', \"The Bletchley Circle: Cracking a Killer's Code\", \"cunningly mixes a gripping mystery with understated commentary on women's roles in society (or lack thereof). The social critique actually compounds the tension; the patronizing and dismissive attitude of the police and other men makes the serial killer's actions seem less like a derangement and more like the logical extreme of sexism. The writing, performances, and production are all top-notch; this is a smart, multilayered thriller. --\", 'Bret Fetzer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '7018838', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 15 minutes', 'Release date': 'May 14, 2013', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war.  It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nReview Title: MUST WATCH SERIES!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bletchley Circle: Season 2\nReview Date: 2018/05/23\nStore: Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: ['Watch two new code-breaking thrillers in The Bletchley Circle, Season 2. The series is based on the lives of four extraordinary and brilliant women who worked at top-secret HQ Bletchley Park during World War II.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'PBSDBLEC600DVD', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '3 hours', 'Release date': 'April 15, 2014', 'Actors': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '2'}\nReview Text: I saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war. It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nReview Title: MUST WATCH SERIES!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/24\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Fields', 'Jason Bloom', 'Dan Etheridge', 'Michael Wale', 'Mairzee Almas', 'John T. Kretchmer', 'Viet Nguyen', 'Tessa Blake', 'Zetna Fuentes', 'Mark Piznarski'], 'Producers': ['Not Specified'], 'Starring': ['Rose McIver', 'Malcolm Goodwin', 'Rahul Kohli']}\nReview Text: iZombie is probably one of the most underrated shows on television. Liv and her friends have amazing adventures akin to Veronica Mars with murder, treason, mayhem, and a little bit of humor thrown in. As the medical examiner, Liv eats the brain of her dead victim and takes on attributes of their personality, which lead to some of the most amusing acting that I have seen in recent years. No episode is the same and every episode each character grows and changes as they develop a new part of themselves by eating the brains of the newly departed. With romance abound and meta- commentary everywhere, iZombie really is so entertaining and makes for an amazing series that will surely be missed after it ends next season (season 4).\nReview Title: How to Liv as a Zombie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/28\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lauren Belfer', 'Amy Rhodin', 'Tony Shaff', 'Alexis Charizopoulos', 'Allison Berg', 'Leslie Appleyard', 'Joe Stramowski', 'Brian Campbell', 'Amy Bonezzi', 'Kristen Schylinski']}\nReview Text: I was addicted to Teen Mom 2 and their drama, but now it is just the same old same old from each girl. Chelsea is the only one who has her act together. The rest are just a mess with drugs, cheating, lying, and jail over and over. It is time to grow up and move on from this series.\nReview Title: Time to Move on From Teen Mom 2\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/29\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin McDonagh'], 'Producers': ['Graham Broadbent', 'Pete Czernin', 'Martin McDonagh'], 'Starring': ['Frances McDormand', 'Woody Harrelson', 'Sam Rockwell'], 'Studio': ['Searchlight']}\nReview Text: I watched this movie last night and really didn't know what to expect, but that it had a lot of Oscar buzz around it. The performances were solid, the plot was ok, but it was not darkly comedic at all- only a sad portrayal of a small town that is full of only curse words to me. There is more profanity in this movie than I have heard in quite some time. I also think the money spent on those billboards could be best spent on a private investigator or other means of finding out whodunnit than pointing fingers. I won't be watching it again or recommending it.\nReview Title: Too Many Swear Words for Its Own Good\nRating: 3.0\n--------------------------------------------------",
  "reference": "{'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greta Gerwig'], 'Producers': ['Eli Bush', \"Evelyn O'Neill\", 'Scott Rudin', 'Jason Sack', 'Alex G. Scott', 'Lila Yacoub'], 'Starring': ['Ronan', 'Saoirse', 'Laurie Metcalf'], 'Studio': ['A24 Distribution LLC']}\nI don't quite understand why this movie got the Oscar buzz it did. I feel like there are so many EXCELLENT and AMAZING under the radar teen movies that deserve Oscar credit than this mediocre film like Edge of Seventeen or even more recently Love, Simon.<br />Lady Bird tries to do much in one movie without a general vision. The character meanders and is often awful. I hate the relationship she has with her mom and her best friend. She treats everyone horribly.<br /><br />SPOILER ALERT:<br /><br />At the end, there is no life lessons learned by the main character; however, she becomes lonely and instead cow-tows to her mom, who was verbally abusive to her in the entire movie. That is a horrible lesson for any teen or any one else to take away from this movie. This character should have dropped her mom like it is hot and realized that she is better off without her belittling her all of the time and yelling in her face and demeaning her. I don't understand why this movie got so much buzz when the Edge of Seventeen deals with the tension between a mother and daughter in a much more mature and well-developed way. This movie leaves a lot to be desired.\nWhy the Oscar Buzz? You can do much better for a movie tonight!\nScream 4\nComedy, Horror, Eerie, Ominous\n['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nI really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nRetro Tale of Love, Loss, and Murder\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Hutchings'], 'Producers': ['Victoria Bousis', 'Wendy Cox', 'Brice Dal Farra', 'Claude Dal Farra', 'Glenn W. Garland', 'Brian Keady', 'Kathleen E. Kearney', 'Christian Mercuri', 'Lauren Munsch'], 'Starring': ['Eden Sher', 'Victoria Justice', 'Peyton List'], 'Studio': ['Vision Films']}\nI LOVE Eden Sher, Sue Sue Heck, from The Middle, which I will miss so much once it stops airing later this year. I am also a fan of the other actors/actresses in the movie, but this movie doesn't do their talent justice (pun intended, given Victoria Justice is one of the leads). The movie cops to a lot of teen geek chick romance ploys and plot points and doesn't serve to stir up any new thought provoking ideas about bullies, nerds, and kids that are often forgotten. I have seen movies that cleverly discuss these ideals like Before I Fall, The DUFF, and Prom. I like this movie. It is forgettable, but good for a Sunday night movie popcorn theater at home. It is just not memorable, but does the trick in the moment.\nForgettable Geek Chic, but You Can Do Better...\n{'Subtitles': ['None available'], 'Directors': ['Andy Devonshire'], 'Producers': ['Anna Beattie', 'Mark Drake', 'Anna Driver', 'Hannah Griffiths', 'Jake Senior', 'Samantha Beddoes', 'Helen Cawley'], 'Starring': ['Mel Giedroyc', 'Sue Perkins', 'Mary Berry'], 'Studio': ['PBS']}\nFor anyone who likes cooking and baking competitions, this one is slightly different for a few reasons:<br />1) it is set in England<br />2) all of the deserts are things that I had never heard of before and very unique to watch being made from start to scratch (pun, intended)<br />3) The hosts are all engaging, except one<br />4) The contestants are not super competitive or mean with each other and help each other out when things go poorly. I love that in competitive shows.<br />5) This is great fun for anyone with an interest in food.\nGreat British Introduction to Unusual Foods Across the Pond\n{'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Mysak', 'Michael Fitzpatrick Lawrence Jr.', 'Nick Petrie'], 'Producers': ['John Dufresne-Williams', 'Montré Burton', 'Chris Lauer', 'Chris Coelen', 'Karrie Wolfe', 'Kimberly Goodman', 'Jason Sands'], 'Starring': ['Neil Bowlus', 'Joseph Cilona', 'Ashley Doherty']}\nMarried at First Sight is a reality tv show where couples that have never met before are matched by professionals- a psychologist, a sexologist, and a sociologist- in an arranged marriage and see if they can make it work for 6 weeks- some couples survive, some don’t. You learn a TON about why people do the things they do and why relationships don’t work and some do work. I love it and learned a lot of great tips on how to improve my own relationships and provide guidance with others struggling in their own relationships.\nExcellent Reality TV with Real World Applications\nThe Bletchley Circle: Cracking a Killer's Code\n.  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Mystery & Thrillers\n['Product Description', 'Four women who worked as codebreakers at Bletchley Park have taken up civilian lives. Susan, has collated data about a series of murders. She tries to convince the police she knows where another body is, but they are unable to locate it and dismiss her. She turns to her three friends and they work out where the next victim will be taken, find the body, then decide they are the only ones who can track down the killer.', 'Amazon.com', 'After her days cracking Nazi codes at Bletchley Park during World War II, Susan Gray (Anna Maxwell Martin) finds life as a housewife lacking. When she perceives patterns in a series of killings, she approaches the police, only to be rebuffed. Horrified by the prospect of more women being murdered, Susan gathers three of her Bletchley cohorts--outspoken, independent Millie (Rachael Stirling,', 'Tipping the Velvet', '); Jean (Julie Graham), an administrator at Bletchley who still has connections in the British bureaucracy; and Lucy (Sophie Rundle), whose eidetic memory makes her a living computer. Their complementary skills allow them to deconstruct these grisly crimes, predicting where the killer may strike next and gradually unraveling where he came from… which brings them closer to the murderer than they ever expected.', \"The Bletchley Circle: Cracking a Killer's Code\", \"cunningly mixes a gripping mystery with understated commentary on women's roles in society (or lack thereof). The social critique actually compounds the tension; the patronizing and dismissive attitude of the police and other men makes the serial killer's actions seem less like a derangement and more like the logical extreme of sexism. The writing, performances, and production are all top-notch; this is a smart, multilayered thriller. --\", 'Bret Fetzer']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '7018838', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 15 minutes', 'Release date': 'May 14, 2013', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\nI saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war.  It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nMUST WATCH SERIES!!!!\nBletchley Circle: Season 2\nAnna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Independently Distributed, Drama\n['Watch two new code-breaking thrillers in The Bletchley Circle, Season 2. The series is based on the lives of four extraordinary and brilliant women who worked at top-secret HQ Bletchley Park during World War II.']\n{'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'PBSDBLEC600DVD', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '3 hours', 'Release date': 'April 15, 2014', 'Actors': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '2'}\nI saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war. It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nMUST WATCH SERIES!!!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Fields', 'Jason Bloom', 'Dan Etheridge', 'Michael Wale', 'Mairzee Almas', 'John T. Kretchmer', 'Viet Nguyen', 'Tessa Blake', 'Zetna Fuentes', 'Mark Piznarski'], 'Producers': ['Not Specified'], 'Starring': ['Rose McIver', 'Malcolm Goodwin', 'Rahul Kohli']}\niZombie is probably one of the most underrated shows on television. Liv and her friends have amazing adventures akin to Veronica Mars with murder, treason, mayhem, and a little bit of humor thrown in. As the medical examiner, Liv eats the brain of her dead victim and takes on attributes of their personality, which lead to some of the most amusing acting that I have seen in recent years. No episode is the same and every episode each character grows and changes as they develop a new part of themselves by eating the brains of the newly departed. With romance abound and meta- commentary everywhere, iZombie really is so entertaining and makes for an amazing series that will surely be missed after it ends next season (season 4).\nHow to Liv as a Zombie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lauren Belfer', 'Amy Rhodin', 'Tony Shaff', 'Alexis Charizopoulos', 'Allison Berg', 'Leslie Appleyard', 'Joe Stramowski', 'Brian Campbell', 'Amy Bonezzi', 'Kristen Schylinski']}\nI was addicted to Teen Mom 2 and their drama, but now it is just the same old same old from each girl. Chelsea is the only one who has her act together. The rest are just a mess with drugs, cheating, lying, and jail over and over. It is time to grow up and move on from this series.\nTime to Move on From Teen Mom 2\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin McDonagh'], 'Producers': ['Graham Broadbent', 'Pete Czernin', 'Martin McDonagh'], 'Starring': ['Frances McDormand', 'Woody Harrelson', 'Sam Rockwell'], 'Studio': ['Searchlight']}\nI watched this movie last night and really didn't know what to expect, but that it had a lot of Oscar buzz around it. The performances were solid, the plot was ok, but it was not darkly comedic at all- only a sad portrayal of a small town that is full of only curse words to me. There is more profanity in this movie than I have heard in quite some time. I also think the money spent on those billboards could be best spent on a private investigator or other means of finding out whodunnit than pointing fingers. I won't be watching it again or recommending it.\nToo Many Swear Words for Its Own Good",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nReview Date: 2018/03/28\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greta Gerwig'], 'Producers': ['Eli Bush', \"Evelyn O'Neill\", 'Scott Rudin', 'Jason Sack', 'Alex G. Scott', 'Lila Yacoub'], 'Starring': ['Ronan', 'Saoirse', 'Laurie Metcalf'], 'Studio': ['A24 Distribution LLC']}\nReview Text: I don't quite understand why this movie got the Oscar buzz it did. I feel like there are so many EXCELLENT and AMAZING under the radar teen movies that deserve Oscar credit than this mediocre film like Edge of Seventeen or even more recently Love, Simon.<br />Lady Bird tries to do much in one movie without a general vision. The character meanders and is often awful. I hate the relationship she has with her mom and her best friend. She treats everyone horribly.<br /><br />SPOILER ALERT:<br /><br />At the end, there is no life lessons learned by the main character; however, she becomes lonely and instead cow-tows to her mom, who was verbally abusive to her in the entire movie. That is a horrible lesson for any teen or any one else to take away from this movie. This character should have dropped her mom like it is hot and realized that she is better off without her belittling her all of the time and yelling in her face and demeaning her. I don't understand why this movie got so much buzz when the Edge of Seventeen deals with the tension between a mother and daughter in a much more mature and well-developed way. This movie leaves a lot to be desired.\nReview Title: Why the Oscar Buzz? You can do much better for a movie tonight!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scream 4\nReview Date: 2018/05/06\nCategories: Comedy, Horror, Eerie, Ominous\nProduct Description: ['Ten years have passed, and Sidney Prescott, who has put herself back together thanks in part to her writing, is visited by the Ghostface Killer.']\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Wes Craven'], 'Producers': ['Wes Craven', 'Kevin Williamson', 'Iya Labunka'], 'Starring': ['Courteney Cox', 'David Arquette', 'Neve Campbell']}\nReview Text: I really think the Scream series is entirely under-rated. I recently watched all 4 of them with my husband and we enjoyed them so much! They were a bit gory, but they have a ton of continuity between each movie, which was really a great thrill to watch unfold as you see the final killer in this movie. The movies do a great job of being campy, but having a seamless story to tell between each of the movies that is both epically horrific, but not so scary that I couldn't tolerate it. Their is love, loss, humor, and a few jump out of your seat moments to keep you at the edge of your seats. I highly recommend people re-watch the Scream movies because they are way better than the cheap horror movies that currently play in theaters.\nReview Title: Retro Tale of Love, Loss, and Murder\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/11\nAverage Rating: 4.1\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Peter Hutchings'], 'Producers': ['Victoria Bousis', 'Wendy Cox', 'Brice Dal Farra', 'Claude Dal Farra', 'Glenn W. Garland', 'Brian Keady', 'Kathleen E. Kearney', 'Christian Mercuri', 'Lauren Munsch'], 'Starring': ['Eden Sher', 'Victoria Justice', 'Peyton List'], 'Studio': ['Vision Films']}\nReview Text: I LOVE Eden Sher, Sue Sue Heck, from The Middle, which I will miss so much once it stops airing later this year. I am also a fan of the other actors/actresses in the movie, but this movie doesn't do their talent justice (pun intended, given Victoria Justice is one of the leads). The movie cops to a lot of teen geek chick romance ploys and plot points and doesn't serve to stir up any new thought provoking ideas about bullies, nerds, and kids that are often forgotten. I have seen movies that cleverly discuss these ideals like Before I Fall, The DUFF, and Prom. I like this movie. It is forgettable, but good for a Sunday night movie popcorn theater at home. It is just not memorable, but does the trick in the moment.\nReview Title: Forgettable Geek Chic, but You Can Do Better...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/17\nAverage Rating: 4.8\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Andy Devonshire'], 'Producers': ['Anna Beattie', 'Mark Drake', 'Anna Driver', 'Hannah Griffiths', 'Jake Senior', 'Samantha Beddoes', 'Helen Cawley'], 'Starring': ['Mel Giedroyc', 'Sue Perkins', 'Mary Berry'], 'Studio': ['PBS']}\nReview Text: For anyone who likes cooking and baking competitions, this one is slightly different for a few reasons:<br />1) it is set in England<br />2) all of the deserts are things that I had never heard of before and very unique to watch being made from start to scratch (pun, intended)<br />3) The hosts are all engaging, except one<br />4) The contestants are not super competitive or mean with each other and help each other out when things go poorly. I love that in competitive shows.<br />5) This is great fun for anyone with an interest in food.\nReview Title: Great British Introduction to Unusual Foods Across the Pond\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/23\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Alcohol use', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charlie Mysak', 'Michael Fitzpatrick Lawrence Jr.', 'Nick Petrie'], 'Producers': ['John Dufresne-Williams', 'Montré Burton', 'Chris Lauer', 'Chris Coelen', 'Karrie Wolfe', 'Kimberly Goodman', 'Jason Sands'], 'Starring': ['Neil Bowlus', 'Joseph Cilona', 'Ashley Doherty']}\nReview Text: Married at First Sight is a reality tv show where couples that have never met before are matched by professionals- a psychologist, a sexologist, and a sociologist- in an arranged marriage and see if they can make it work for 6 weeks- some couples survive, some don’t. You learn a TON about why people do the things they do and why relationships don’t work and some do work. I love it and learned a lot of great tips on how to improve my own relationships and provide guidance with others struggling in their own relationships.\nReview Title: Excellent Reality TV with Real World Applications\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Bletchley Circle: Cracking a Killer's Code\nReview Date: 2018/05/23\nStore: .  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Mystery & Thrillers\nProduct Description: ['Product Description', 'Four women who worked as codebreakers at Bletchley Park have taken up civilian lives. Susan, has collated data about a series of murders. She tries to convince the police she knows where another body is, but they are unable to locate it and dismiss her. She turns to her three friends and they work out where the next victim will be taken, find the body, then decide they are the only ones who can track down the killer.', 'Amazon.com', 'After her days cracking Nazi codes at Bletchley Park during World War II, Susan Gray (Anna Maxwell Martin) finds life as a housewife lacking. When she perceives patterns in a series of killings, she approaches the police, only to be rebuffed. Horrified by the prospect of more women being murdered, Susan gathers three of her Bletchley cohorts--outspoken, independent Millie (Rachael Stirling,', 'Tipping the Velvet', '); Jean (Julie Graham), an administrator at Bletchley who still has connections in the British bureaucracy; and Lucy (Sophie Rundle), whose eidetic memory makes her a living computer. Their complementary skills allow them to deconstruct these grisly crimes, predicting where the killer may strike next and gradually unraveling where he came from… which brings them closer to the murderer than they ever expected.', \"The Bletchley Circle: Cracking a Killer's Code\", \"cunningly mixes a gripping mystery with understated commentary on women's roles in society (or lack thereof). The social critique actually compounds the tension; the patronizing and dismissive attitude of the police and other men makes the serial killer's actions seem less like a derangement and more like the logical extreme of sexism. The writing, performances, and production are all top-notch; this is a smart, multilayered thriller. --\", 'Bret Fetzer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, NTSC', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '2 hours and 15 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '7018838', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 15 minutes', 'Release date': 'May 14, 2013', 'Subtitles': 'English', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: I saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war.  It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nReview Title: MUST WATCH SERIES!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bletchley Circle: Season 2\nReview Date: 2018/05/23\nStore: Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: ['Watch two new code-breaking thrillers in The Bletchley Circle, Season 2. The series is based on the lives of four extraordinary and brilliant women who worked at top-secret HQ Bletchley Park during World War II.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Mystery & Suspense/British Mystery Theater, Television/Crime', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Language': 'English', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.52 Ounces', 'Item model number': 'PBSDBLEC600DVD', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '3 hours', 'Release date': 'April 15, 2014', 'Actors': 'Anna Maxwell Martin, Hattie Morahan, Rachael Stirling, Sophie Rundle, Julie Graham', 'Subtitles': 'English', 'Studio': 'PBS (Direct)', 'Number of discs': '2'}\nReview Text: I saw Bletchley Circle last year and binge-watched them all within one week. They were so compelling, especially to know that there was a real Bletchley Circle back in the war. It was so addicting and you really want to know who the killer is in each season. I also want to mention there will be a Season 4 coming out soon!\nReview Title: MUST WATCH SERIES!!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/24\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Fields', 'Jason Bloom', 'Dan Etheridge', 'Michael Wale', 'Mairzee Almas', 'John T. Kretchmer', 'Viet Nguyen', 'Tessa Blake', 'Zetna Fuentes', 'Mark Piznarski'], 'Producers': ['Not Specified'], 'Starring': ['Rose McIver', 'Malcolm Goodwin', 'Rahul Kohli']}\nReview Text: iZombie is probably one of the most underrated shows on television. Liv and her friends have amazing adventures akin to Veronica Mars with murder, treason, mayhem, and a little bit of humor thrown in. As the medical examiner, Liv eats the brain of her dead victim and takes on attributes of their personality, which lead to some of the most amusing acting that I have seen in recent years. No episode is the same and every episode each character grows and changes as they develop a new part of themselves by eating the brains of the newly departed. With romance abound and meta- commentary everywhere, iZombie really is so entertaining and makes for an amazing series that will surely be missed after it ends next season (season 4).\nReview Title: How to Liv as a Zombie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/28\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lauren Belfer', 'Amy Rhodin', 'Tony Shaff', 'Alexis Charizopoulos', 'Allison Berg', 'Leslie Appleyard', 'Joe Stramowski', 'Brian Campbell', 'Amy Bonezzi', 'Kristen Schylinski']}\nReview Text: I was addicted to Teen Mom 2 and their drama, but now it is just the same old same old from each girl. Chelsea is the only one who has her act together. The rest are just a mess with drugs, cheating, lying, and jail over and over. It is time to grow up and move on from this series.\nReview Title: Time to Move on From Teen Mom 2\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/05/29\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin McDonagh'], 'Producers': ['Graham Broadbent', 'Pete Czernin', 'Martin McDonagh'], 'Starring': ['Frances McDormand', 'Woody Harrelson', 'Sam Rockwell'], 'Studio': ['Searchlight']}\nReview Text: I watched this movie last night and really didn't know what to expect, but that it had a lot of Oscar buzz around it. The performances were solid, the plot was ok, but it was not darkly comedic at all- only a sad portrayal of a small town that is full of only curse words to me. There is more profanity in this movie than I have heard in quite some time. I also think the money spent on those billboards could be best spent on a private investigator or other means of finding out whodunnit than pointing fingers. I won't be watching it again or recommending it.\nReview Title: Too Many Swear Words for Its Own Good\nRating: 3.0\n--------------------------------------------------",
  "raw_response": "**Shopping Behavior Summary**\n\n- **Movie Preferences:** Strong preference for drama, mystery, and coming-of-age narratives.\n- **Critical Viewpoint:** Discerning consumer; often critiques films for lack of depth or quality, particularly regarding character development and storytelling.\n- **Underrated Works:** Advocates for underappreciated films and series, often mentioning the superiority of lesser-known titles compared to mainstream hits.\n- **Genre Enjoyment:** Enjoys horror-comedy hybrids and thrillers, appreciating clever writing and continuity.\n- **Reality TV Interest:** Finds value in reality shows that offer relationship insights and practical life lessons, showing engagement with personal development content.\n- **Binge-Watching Behavior:** Enthusiastic about series that prioritize character arcs and compelling plots, exemplified by binge-watching and excitement for new seasons.\n- **Culinary Interests:** Shows interest in cooking competitions, especially those with unique cultural elements and a less competitive atmosphere.\n- **TV Shows Over Movies:** Favors serialized television over films for deeper character exploration and narrative complexity.\n- **Engagement with Social Issues:** Appreciates narrative resolutions that address societal themes, particularly those surrounding gender roles and personal growth. \n\nOverall, the consumer demonstrates a preference for quality storytelling, nuanced relationships, and character-driven narratives across various genres.",
  "target_interaction": {
    "rating": 1.0,
    "title": "Turned OFF!!!!",
    "text": "I turned the movie off half way through because it was confusing, boring, and never gained clarity. The beginning was very confusing with a lot of characters and names to keep in mind, but it wasn't really made clear to the viewer who these people were and why they were important. The movie felt like a waste of time, energy, and talent, especially from beloved actors like Hanks and Streep. I really have to say that The Post pales in comparison to Spotlight, which was engaging, clear, and important to tell from the get-go.",
    "images": [],
    "asin": "B078XMV6WJ",
    "parent_asin": "B078XMV6WJ",
    "user_id": "AGIFTJN3ZPLCLP247OUNGV27CASQ",
    "timestamp": "2018-06-03 23:05:05.273000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.6,
    "rating_number": 6795,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/5d389cd207fd4df9c07ad6035357ac254b4e58a6f2e452cdd11c650b86bdfaf5._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/5d389cd207fd4df9c07ad6035357ac254b4e58a6f2e452cdd11c650b86bdfaf5._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/5d389cd207fd4df9c07ad6035357ac254b4e58a6f2e452cdd11c650b86bdfaf5._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/5d389cd207fd4df9c07ad6035357ac254b4e58a6f2e452cdd11c650b86bdfaf5._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/5d389cd207fd4df9c07ad6035357ac254b4e58a6f2e452cdd11c650b86bdfaf5._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/5d389cd207fd4df9c07ad6035357ac254b4e58a6f2e452cdd11c650b86bdfaf5._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English Dialogue Boost: High",
        "English",
        "English Dialogue Boost: Medium"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Steven Spielberg"
      ],
      "Producers": [
        "Steven Spielberg",
        "Amy Pascal",
        "Kristie Macosko Krieger"
      ],
      "Starring": [
        "Meryl Streep",
        "Tom Hanks",
        "Sarah Paulson"
      ],
      "Studio": [
        "20th Century Fox"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}