{
  "user_id": "AEFZM4DYLUZEUHB3WEND5KSEGWUQ",
  "summary": "=== Purchase Information ===\nProduct Title: Ponyo\nReview Date: 2014/01/29\nStore: Noah Lindsey Cyrus  (Actor),     Frankie Jonas  (Actor),     Hayao Miyazaki  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', \"Welcome to a world where anything is possible! Academy Award(R)-winning director Hayao Miyazaki (2002, Best Animated Feature, SPIRITED AWAY) and legendary filmmaker John Lasseter together with Disney bring to life a heartwarming and imaginative telling of Hans Christian Andersen's classic fairy tale THE LITTLE MERMAID. A young boy named Sosuke rescues a goldfish named Ponyo, and they embark on a fantastic journey of friendship and discovery before Ponyo's father, a powerful sorcerer, forces her to return to her home in the sea. In her quest to become human and reunite with Sosuke, Ponyo stumbles upon and releases her father's magical Water of Life and triggers a gigantic storm. Now balance must be restored to the world they all cherish. PONYO will delight your family with its magnificent animation and timeless story. (C) 2009 Nibariki-GNDHDDT(C)2008 Nibariki-(C) Disney\", 'Amazon.com', 'Ponyo', 'confirms Academy Award®-winning director Hayao Miyazaki\\'s reputation as one of the most imaginative filmmakers working today. Loosely based on Hans Christian Anderson\\'s \"The Little Mermaid,\"', 'Ponyo', \"is a magical celebration of innocent love and the fragile beauty of the natural world. The daughter of the sea goddess Gran Mamare (voiced by Cate Blanchett) and the alchemist Fujimoto (Liam Neeson), Ponyo (Noah Cyrus) begins life as an adventurous little goldfish. Chafing at her father's restrictions, she goes in search of adventure and meets Sosuke (Frankie Jonas), a good-natured 5-year-old who lives by the sea. Sosuke adopts Ponyo and quickly wins her heart. Fujimoto uses magic to bring her back, but Ponyo's love for Sosuke proves stronger than his elixirs. She transforms herself into a human girl and returns to him during a spectacular storm at sea, but her metamorphosis upsets the balance of nature, precipitating a crisis only Gran Mamare can resolve.\", 'Ponyo', 'contains fantastic moments that suggest dreams-- and reassert the power of hand-drawn animation to create memorable fantasies: No effects-laden Hollywood feature can match the wonder of Ponyo running along the tops of crashing waves on her way back to Sosuke.', 'Ponyo', 'is closer in tone to', 'My Neighbor Totoro', 'than', 'Spirited Away', 'or', \"Howl's Moving Castle\", ', and will appeal to audiences of all ages, including small children. The #1 film in Japan in 2008,', 'Ponyo', 'earned more than ¥14.9 billion (over US$155 million) to become the 8th highest grossing film in Japanese history. (Rated G: A few scary moments, alcohol use) --', 'Charles Solomon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Multiple Formats, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Matt Damon, Hayao Miyazaki, Cate Blanchett, Liam Neeson, Lily Tomlin, Noah Lindsey Cyrus, Frankie Jonas, Cloris Leachman, Betty White, Tina FeyMatt Damon, Hayao Miyazaki, Cate Blanchett, Liam Neeson, Lily Tomlin, Noah Lindsey Cyrus, Frankie Jonas, Cloris Leachman, Betty White, Tina Fey  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.57 x 5.33 x 7.49 inches; 4.16 Ounces', 'Item model number': '10185400', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'March 2, 2010', 'Actors': 'Noah Lindsey Cyrus, Frankie Jonas, Cate Blanchett, Liam Neeson, Tina Fey', 'Dubbed': 'English, French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Disney Presents Studio Ghibli', 'Number of discs': '1'}\nReview Text: My daughter loves this story.  She showed the movie to my little neice...and she loved it too!  She couldn't take her eyes off the screen.\nReview Title: cute\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hunger Games [DVD]\nReview Date: 2014/01/29\nStore: Jennifer Lawrence (Actor),  Josh Hutcherson (Actor),  Liam Hemsworth (Actor),  Woody Harrelson (Actor),  Elizabeth Banks (Actor),  Stanley Tucci (Actor),  Wes Bentley (Actor),  Lenny Kravitz (Actor),  Amandla Stenberg (Actor),  Donald Sutherland (Actor),  Gary Ross (Director, Writer),  Suzanne Collins (Writer),  Billy Ray (Writer)\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Amazon.com', 'Building on her performance as a take-no-prisoners teenager in', \"Winter's Bone\", ', Jennifer Lawrence portrays heroine Katniss Everdeen in Gary Ross\\'s action-oriented adaptation of author-screenwriter Suzanne Collins\\'s young adult bestseller. Set in a dystopian future in which the income gap is greater than ever, 24 underprivileged youth fight to the death every year in a televised spectacle designed to entertain the rich and give the poor enough hope to quell any further unrest--but not too much, warns Panem president Snow (Donald Sutherland), because that would be \"dangerous.\" Hailing from the same mining town, 16-year-olds Katniss and Peeta (Josh Hutcherson,', 'The Kids Are All Right', \") represent District 12 with the help of escort Effie (an unrecognizable Elizabeth Banks) and mentor Haymitch (a scene-stealing Woody Harrelson). At first they're adversaries, but a wary partnership eventually develops, though the rules stipulate that only one contestant can win. For those who haven't read the book, the conclusion is likely to come as a surprise. Before it arrives, Ross (\", 'Pleasantville', \") depicts a society in which the Haves appear to have stepped out of a Dr. Seuss book and the Have-Nots look like refugees from the WPA photographs of Walker Evans. It's an odd mix, made odder still by frenetic fight scenes where it's hard to tell who's doing what to whom. Fortunately, Lawrence and Hutcherson prove a sympathetic match in this crazy, mixed-up combination of\", 'Survivor', ',', 'Lost', ', and the collected works of George Orwell.', '--Kathleen C. Fennessy', 'Synopsis', 'Every year in the ruins of what was once North America, the Capitol of the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games. A twisted punishment for a past uprising and an ongoing government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains. Sixteen-year-old Katniss Everdeen volunteers in her younger sister’s place to enter the games, and is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy when she’s pitted against highly-trained Tributes who have prepared for these Games their entire lives. If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love.', 'About the Author', 'SUZANNE COLLINS', 'first made her mark in children’s literature with the New York Times bestselling', 'Underland Chronicles', 'for middle grade readers. Her debut for readers aged 12 and up,', 'The Hunger Games', 'was an instant bestseller, appealing to both teen readers and adults. It has appeared on the New York Times bestseller list for more than 180 consecutive weeks/more than three consecutive years since publication. Suzanne Collins also had a successful and prolific career writing for children’s television. In 2010 Collins was named to the TIME 100 list as well as the Entertainment Weekly Entertainers of the Year list. In 2011 Fast Company named her to their 100 Most Creative People in Business.', 'Meet the Characters', 'Katniss Everdeen', 'The Tribute who becomes a heroine when she volunteers to take her sister’s place in the Hunger Games.', 'Peeta Mellark', 'The male Tribute from District 12, who has long harbored secret feelings for Katniss.', 'Gale Hawthorne', 'Katniss’s fellow hunter, rebel and best friend, who is heartbroken when she volunteers and departs for the Games.', 'Haymitch Abernathy', 'Victor of the 50th Hunger Games, now the rarely sober mentor for Katniss and Peeta.', 'Effie Trinket', 'Katniss’s elaborately-coiffed escort and PR handler for the Games.', 'Cinna', 'Katniss’s personal Stylist for the Games who becomes her unexpected confidante and supporter.']\nAverage Rating: 4.7\nProduct Details: {}\nReview Text: Great movie, however I purchased it because it says with digital copy.  Well, that was not the case.  The offer expired about a year ago AND, it skipped in the middle.  Unfortunately this was a gift and I had been saving it for about 2 months.  By the time the recipient opened the gift, it was too late to return.\nReview Title: deceptive\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spirited Away\nReview Date: 2015/01/12\nStore: Hayao Miyazaki  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', 'From one of the most celebrated filmmakers in the history of animated cinema comes the most acclaimed film of 2002. Hayao Miyazaki\\'s latest triumph, filled with astonishing animation and epic adventure, is a dazzling masterpiece for the ages. It\\'s a \"wonderfully welcoming work of art that\\'s as funny and entertaining as it is brilliant, beautiful, and deep\" (Joe Morgenstern, Wall Street Journal). SPIRITED AWAY is a wondrous fantasy about a young girl, Chihiro, trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free herself and return her family to the outside world. An unforgettable story brimming with creativity, SPIRITED AWAY will take you on a journey beyond your imagination. \"To enter the world of Hayao Miyazaki is to experience a kind of lighthearted enchantment that is unique to the world of animation\" (Roger Ebert, Chicago Sun-Times). It\\'s a fantastic tale the whole family will want to experience over and over again.~~(c) 2001 Nibariki -- GNDDTM', 'Set Contains:', 'The most interesting extra feature on the two-disc set is the Nippon Television Special on the making of', 'Spirited Away', ', not because it\\'s significantly different from American making-of programs, but because the camera crew was allowed to film Miyazaki at work. It\\'s fascinating to watch the visionary director explaining how individual movements should be animated, and even performing the little dance the frog-master does to welcome the No-Face to Yubaba\\'s bath house. (Old animators describe Walt Disney giving similar performances, but no comparable footage exists.) It\\'s also striking to see how intimate Studio Ghibli is, unencumbered by the tiers of management that burden American studios. The scene comparisons enable the viewer to study the storyboards for the film, which Miyazaki draws himself. These simple yet wonderfully vivid images capture the essence of a mood, a movement, an expression. \"Behind the Microphone\" offers a fairly standard behind-the-scenes look at the creation of the excellent English version of', 'Spirited Away', '.', '--Charles Solomon']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Fantasy', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Hayao Miyazaki', 'Language': 'French (Dolby Digital 2.0 Surround), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.3 x 7.52 inches; 4.32 Ounces', 'Item model number': 'UPC# 7869 3621 3843', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 15, 2003', 'Studio': 'Walt Disney Home Entertainment Presents A Studio Ghibli Film', 'Number of discs': '1'}\nReview Text: Really beautiful and interesting graphics.  My daughter loved it.\nReview Title: good movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: My Bodyguard (Widescreen Edition)\nReview Date: 2015/01/12\nStore: Chris Makepeace  (Actor),     Adam Baldwin  (Actor),     Tony Bill  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['A shrimpy Chicago teen hires a big, brooding classmate to protect him from bullies.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Tony Bill, Matt Dillon, Adam Baldwin, Alan Ormsby, Tom Rielly, Hank Salas, Chris Makepeace, Denise Baske, Vicky Nelson, Joan Cusack, Tim Reyna, Paul Quandt, Richard Bradley, Dean R. MillerTony Bill, Matt Dillon, Adam Baldwin, Alan Ormsby, Tom Rielly, Hank Salas, Chris Makepeace, Denise Baske, Vicky Nelson, Joan Cusack, Tim Reyna, Paul Quandt, Richard Bradley, Dean R. Miller   See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'FOXS2283436DVD', 'Director': 'Tony Bill', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'January 29, 2002', 'Actors': 'Chris Makepeace, Adam Baldwin, Matt Dillon, Paul Quandt, Hank Salas', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Studio': '20th Century Fox', 'Writers': 'Alan Ormsby', 'Number of discs': '1'}\nReview Text: Love this old flick.  Good packaging.\nReview Title: good old movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Baytown Outlaws [DVD]\nReview Date: 2016/09/10\nStore: Billy Bob Thornton  (Actor),     Eva Longoria  (Actor),     Barry Battles  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, DTS\nProduct Description: [\"After her ex-husband shoots Celeste three times in the gut and kidnaps her godson, it's time to play dirty. She hires three outlawed, redneck brothers to bring him back to her. What begins as a small rescue mission rises to a Southern battle royale.\", ']]>']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Suspense, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'Paul Wesley, Andre Braugher, Travis Fimmel, Robert Teitel, William O. Perkins III, Eva Longoria, Griffin Hood, Daniel Cudmore, Billy Bob Thornton, Barry BattlesPaul Wesley, Andre Braugher, Travis Fimmel, Robert Teitel, William O. Perkins III, Eva Longoria, Griffin Hood, Daniel Cudmore, Billy Bob Thornton, Barry Battles  See more', 'Initial release date': '2014-04-29', 'Language': 'English', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'PRC61739DVD', 'Director': 'Barry Battles', 'Media Format': 'Multiple Formats, AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'April 29, 2014', 'Actors': 'Billy Bob Thornton, Eva Longoria, Andre Braugher, Daniel Cudmore, Travis Fimmel', 'Producers': 'William O. Perkins III, Robert Teitel', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Barry Battles, Griffin Hood', 'Number of discs': '1'}\nReview Text: Love this movie.  Fun with awesome cliche ending!  I enjoyed it.\nReview Title: Love this\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stick Man\nReview Date: 2018/01/26\nStore: n/a  (Actor, Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['From the makers of The Gruffalo and Room on the Broom, and based on the beloved children s classic written by Julia Donaldson and illustrated by Axel Scheffler, this beautifully animated film tells the tale of Stick Man and his epic adventure across the seasons. He gets thrown into a river, escapes from a swan s nest, and even ends up on top of a fire. Will he ever get back to his family tree in time for Christmas?']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35645086', 'Media Format': 'NTSC, Widescreen', 'Run time': '30 minutes', 'Release date': 'November 8, 2016', 'Dubbed': 'English', 'Language': 'English (Stereo)', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: Adorable story!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Right [DVD]\nReview Date: 2022/10/03\nStore: Sam Rockwell  (Actor),     Anna Kendrick  (Actor),     Paco Cabezas  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"The road to true love is paved with knives and bullets in this killer comedy starring Anna Kendrick and Sam Rockwell. Unlucky in love and with terrible taste in men, Martha (Kendrick) bumps into Francis (Rockwell) and finally meets the man of her dreams. Sweet and charming, he seems the perfect match until Martha discovers Francis is a world-class assassin whose enemies are trying to kill him and can't quite decide as body counts rise whether to join in the mayhem or dump him. Also starring Tim Roth, Anson Mount and the Wu-Tang Clan's RZA, Mr. Right is a rollicking romp bursting with action and laughs!\", 'Bonus Content:', 'A Sweet Couple', 'A Sweet Couple', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure, Arthouse', 'Format': 'NTSC, Subtitled', 'Contributor': 'Tim Roth, Lawrence Mattis, James Ransone, Michael Eklund, Anson Mount, Max Landis, Sam Rockwell, Paco Cabezas, Anna Kendrick, Bradley Gallo, RZA, Michael A. Helfant, Rick JacobsTim Roth, Lawrence Mattis, James Ransone, Michael Eklund, Anson Mount, Max Landis, Sam Rockwell, Paco Cabezas, Anna Kendrick, Bradley Gallo, RZA, Michael A. Helfant, Rick Jacobs  See more', 'Initial release date': '2016-06-07', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35396444', 'Director': 'Paco Cabezas', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 7, 2016', 'Actors': 'Sam Rockwell, Anna Kendrick, Tim Roth, James Ransone, Anson Mount', 'Subtitles': 'French, Spanish', 'Producers': 'Michael A. Helfant, Bradley Gallo, Rick Jacobs, Lawrence Mattis', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Max Landis', 'Number of discs': '1'}\nReview Text: Movie came in great condition!\nReview Title: Came perfectly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Handmaid's Tale: Season 2 [DVD]\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"Handmaid's Tale, The: Season 2 (DVD)\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television/Fox TV', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English (DTS 5.1), French (DTS 5.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.64 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '1 hour and 59 minutes', 'Release date': 'December 4, 2018', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Handmaid's Tale, The: Fourth Season (DVD)\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"In season four of The Handmaid's Tale, June strikes back against Gilead as a fierce rebel leader, but the risks she takes bring unexpected and dangerous new challenges. Her quest for justice and revenge threatens to consume her and destroy her most cherished relationships.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'NTSC', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '3', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.6 x 5.47 x 0.67 inches; 4.16 Ounces', 'Director': 'Various', 'Media Format': 'NTSC', 'Release date': 'April 5, 2022', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Handmaid's Tale, The: Season 3 [DVD]\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['With her plan in place, June reaches the point of no return on her bold strike against Gilead; Serena Joy and Commander Waterford attempt to find their way forward in their new lives.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '4', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 5.44 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '634 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Handmaid's Tale: Season 1 [DVD]\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Based on Margaret Atwood’s award-winning, best-selling novel, The Handmaid’s Tale is the story of life in the dystopia of Gilead, a totalitarian society in what was formerly the United States. Facing environmental disasters and a plunging birthrate, Gilead is ruled by a twisted fundamentalism in its militarized “return to traditional values.” As one of the few remaining fertile women, Offred (Elisabeth Moss) is a Handmaid in the Commander’s household, belonging to the caste of women forced into sexual servitude as a last desperate attempt to repopulate the world. In this terrifying society, Offred must navigate between Commanders, their cruel Wives, domestic Marthas, and her fellow Handmaids – where anyone could be a spy for Gilead – with one goal: to survive and find the daughter who was taken from her. Also featuring Yvonne Strahovski and Samira Wiley.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television/Fox TV', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '8 hours and 45 minutes', 'Release date': 'March 13, 2018', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stage Mother [DVD]\nReview Date: 2022/10/03\nStore: Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, LGBT\nProduct Description: ['A conservative church choir director from rural Texas named Maybelline Metcalf (Jacki Weaver) inherits her drag queen son s drag/transgender nightclub after he dies, and surprises everyone, including herself, by moving to San Francisco to try to save it from bankruptcy.', \"Maybelline embarks on a kaleidoscopic journey of discovery as she befriends the colourful performers at the nightclub, but butts heads with her bitter gay son-in-law (Adrian Grenier) who feels he deserves to own the club. She moves in with her son's best friend, a free-spirited single mother (Lucy Liu), and becomes de facto den mother to the club's flamboyant performers, until her past and per present worlds collide.\"]\nAverage Rating: 4.4\nProduct Details: {'Package Dimensions': '7.52 x 5.35 x 0.63 inches; 2.47 Ounces', 'Media Format': 'PAL, Dolby', 'Release date': 'November 16, 2020', 'Studio': 'Altitude Film Distribution', 'Number of discs': '1'}\nReview Text: Came in perfect condition\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Men [DVD]\nReview Date: 2022/11/06\nStore: Jessie Buckley  (Actor),     Rory Kinnear  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['In the aftermath of a personal tragedy, Harper (Jessie Buckley) retreats alone to the beautiful English countryside, hoping to have found a place to heal.']\nAverage Rating: 3.7\nProduct Details: {'Genre': 'Drama', 'Format': 'DVD, Subtitled, NTSC', 'Contributor': 'Rory Kinnear, Jessie Buckley', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.6 x 5.31 x 0.67 inches; 2.72 Ounces', 'Audio Description': 'English', 'Media Format': 'DVD, Subtitled, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'August 9, 2022', 'Actors': 'Jessie Buckley, Rory Kinnear', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I liked this movie.  The end was very telling.  Children having children (men can be children).  Men manipulating and the power of the V.\nReview Title: Misunderstood\nRating: 5.0\n--------------------------------------------------",
  "reference": "Ponyo\nNoah Lindsey Cyrus  (Actor),     Frankie Jonas  (Actor),     Hayao Miyazaki  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Product Description', \"Welcome to a world where anything is possible! Academy Award(R)-winning director Hayao Miyazaki (2002, Best Animated Feature, SPIRITED AWAY) and legendary filmmaker John Lasseter together with Disney bring to life a heartwarming and imaginative telling of Hans Christian Andersen's classic fairy tale THE LITTLE MERMAID. A young boy named Sosuke rescues a goldfish named Ponyo, and they embark on a fantastic journey of friendship and discovery before Ponyo's father, a powerful sorcerer, forces her to return to her home in the sea. In her quest to become human and reunite with Sosuke, Ponyo stumbles upon and releases her father's magical Water of Life and triggers a gigantic storm. Now balance must be restored to the world they all cherish. PONYO will delight your family with its magnificent animation and timeless story. (C) 2009 Nibariki-GNDHDDT(C)2008 Nibariki-(C) Disney\", 'Amazon.com', 'Ponyo', 'confirms Academy Award®-winning director Hayao Miyazaki\\'s reputation as one of the most imaginative filmmakers working today. Loosely based on Hans Christian Anderson\\'s \"The Little Mermaid,\"', 'Ponyo', \"is a magical celebration of innocent love and the fragile beauty of the natural world. The daughter of the sea goddess Gran Mamare (voiced by Cate Blanchett) and the alchemist Fujimoto (Liam Neeson), Ponyo (Noah Cyrus) begins life as an adventurous little goldfish. Chafing at her father's restrictions, she goes in search of adventure and meets Sosuke (Frankie Jonas), a good-natured 5-year-old who lives by the sea. Sosuke adopts Ponyo and quickly wins her heart. Fujimoto uses magic to bring her back, but Ponyo's love for Sosuke proves stronger than his elixirs. She transforms herself into a human girl and returns to him during a spectacular storm at sea, but her metamorphosis upsets the balance of nature, precipitating a crisis only Gran Mamare can resolve.\", 'Ponyo', 'contains fantastic moments that suggest dreams-- and reassert the power of hand-drawn animation to create memorable fantasies: No effects-laden Hollywood feature can match the wonder of Ponyo running along the tops of crashing waves on her way back to Sosuke.', 'Ponyo', 'is closer in tone to', 'My Neighbor Totoro', 'than', 'Spirited Away', 'or', \"Howl's Moving Castle\", ', and will appeal to audiences of all ages, including small children. The #1 film in Japan in 2008,', 'Ponyo', 'earned more than ¥14.9 billion (over US$155 million) to become the 8th highest grossing film in Japanese history. (Rated G: A few scary moments, alcohol use) --', 'Charles Solomon']\n{'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Multiple Formats, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Matt Damon, Hayao Miyazaki, Cate Blanchett, Liam Neeson, Lily Tomlin, Noah Lindsey Cyrus, Frankie Jonas, Cloris Leachman, Betty White, Tina FeyMatt Damon, Hayao Miyazaki, Cate Blanchett, Liam Neeson, Lily Tomlin, Noah Lindsey Cyrus, Frankie Jonas, Cloris Leachman, Betty White, Tina Fey  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.57 x 5.33 x 7.49 inches; 4.16 Ounces', 'Item model number': '10185400', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'March 2, 2010', 'Actors': 'Noah Lindsey Cyrus, Frankie Jonas, Cate Blanchett, Liam Neeson, Tina Fey', 'Dubbed': 'English, French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Disney Presents Studio Ghibli', 'Number of discs': '1'}\nMy daughter loves this story.  She showed the movie to my little neice...and she loved it too!  She couldn't take her eyes off the screen.\ncute\nThe Hunger Games [DVD]\nJennifer Lawrence (Actor),  Josh Hutcherson (Actor),  Liam Hemsworth (Actor),  Woody Harrelson (Actor),  Elizabeth Banks (Actor),  Stanley Tucci (Actor),  Wes Bentley (Actor),  Lenny Kravitz (Actor),  Amandla Stenberg (Actor),  Donald Sutherland (Actor),  Gary Ross (Director, Writer),  Suzanne Collins (Writer),  Billy Ray (Writer)\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Amazon.com', 'Building on her performance as a take-no-prisoners teenager in', \"Winter's Bone\", ', Jennifer Lawrence portrays heroine Katniss Everdeen in Gary Ross\\'s action-oriented adaptation of author-screenwriter Suzanne Collins\\'s young adult bestseller. Set in a dystopian future in which the income gap is greater than ever, 24 underprivileged youth fight to the death every year in a televised spectacle designed to entertain the rich and give the poor enough hope to quell any further unrest--but not too much, warns Panem president Snow (Donald Sutherland), because that would be \"dangerous.\" Hailing from the same mining town, 16-year-olds Katniss and Peeta (Josh Hutcherson,', 'The Kids Are All Right', \") represent District 12 with the help of escort Effie (an unrecognizable Elizabeth Banks) and mentor Haymitch (a scene-stealing Woody Harrelson). At first they're adversaries, but a wary partnership eventually develops, though the rules stipulate that only one contestant can win. For those who haven't read the book, the conclusion is likely to come as a surprise. Before it arrives, Ross (\", 'Pleasantville', \") depicts a society in which the Haves appear to have stepped out of a Dr. Seuss book and the Have-Nots look like refugees from the WPA photographs of Walker Evans. It's an odd mix, made odder still by frenetic fight scenes where it's hard to tell who's doing what to whom. Fortunately, Lawrence and Hutcherson prove a sympathetic match in this crazy, mixed-up combination of\", 'Survivor', ',', 'Lost', ', and the collected works of George Orwell.', '--Kathleen C. Fennessy', 'Synopsis', 'Every year in the ruins of what was once North America, the Capitol of the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games. A twisted punishment for a past uprising and an ongoing government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains. Sixteen-year-old Katniss Everdeen volunteers in her younger sister’s place to enter the games, and is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy when she’s pitted against highly-trained Tributes who have prepared for these Games their entire lives. If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love.', 'About the Author', 'SUZANNE COLLINS', 'first made her mark in children’s literature with the New York Times bestselling', 'Underland Chronicles', 'for middle grade readers. Her debut for readers aged 12 and up,', 'The Hunger Games', 'was an instant bestseller, appealing to both teen readers and adults. It has appeared on the New York Times bestseller list for more than 180 consecutive weeks/more than three consecutive years since publication. Suzanne Collins also had a successful and prolific career writing for children’s television. In 2010 Collins was named to the TIME 100 list as well as the Entertainment Weekly Entertainers of the Year list. In 2011 Fast Company named her to their 100 Most Creative People in Business.', 'Meet the Characters', 'Katniss Everdeen', 'The Tribute who becomes a heroine when she volunteers to take her sister’s place in the Hunger Games.', 'Peeta Mellark', 'The male Tribute from District 12, who has long harbored secret feelings for Katniss.', 'Gale Hawthorne', 'Katniss’s fellow hunter, rebel and best friend, who is heartbroken when she volunteers and departs for the Games.', 'Haymitch Abernathy', 'Victor of the 50th Hunger Games, now the rarely sober mentor for Katniss and Peeta.', 'Effie Trinket', 'Katniss’s elaborately-coiffed escort and PR handler for the Games.', 'Cinna', 'Katniss’s personal Stylist for the Games who becomes her unexpected confidante and supporter.']\n{}\nGreat movie, however I purchased it because it says with digital copy.  Well, that was not the case.  The offer expired about a year ago AND, it skipped in the middle.  Unfortunately this was a gift and I had been saving it for about 2 months.  By the time the recipient opened the gift, it was too late to return.\ndeceptive\nSpirited Away\nHayao Miyazaki  (Director)    Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Product Description', 'From one of the most celebrated filmmakers in the history of animated cinema comes the most acclaimed film of 2002. Hayao Miyazaki\\'s latest triumph, filled with astonishing animation and epic adventure, is a dazzling masterpiece for the ages. It\\'s a \"wonderfully welcoming work of art that\\'s as funny and entertaining as it is brilliant, beautiful, and deep\" (Joe Morgenstern, Wall Street Journal). SPIRITED AWAY is a wondrous fantasy about a young girl, Chihiro, trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free herself and return her family to the outside world. An unforgettable story brimming with creativity, SPIRITED AWAY will take you on a journey beyond your imagination. \"To enter the world of Hayao Miyazaki is to experience a kind of lighthearted enchantment that is unique to the world of animation\" (Roger Ebert, Chicago Sun-Times). It\\'s a fantastic tale the whole family will want to experience over and over again.~~(c) 2001 Nibariki -- GNDDTM', 'Set Contains:', 'The most interesting extra feature on the two-disc set is the Nippon Television Special on the making of', 'Spirited Away', ', not because it\\'s significantly different from American making-of programs, but because the camera crew was allowed to film Miyazaki at work. It\\'s fascinating to watch the visionary director explaining how individual movements should be animated, and even performing the little dance the frog-master does to welcome the No-Face to Yubaba\\'s bath house. (Old animators describe Walt Disney giving similar performances, but no comparable footage exists.) It\\'s also striking to see how intimate Studio Ghibli is, unencumbered by the tiers of management that burden American studios. The scene comparisons enable the viewer to study the storyboards for the film, which Miyazaki draws himself. These simple yet wonderfully vivid images capture the essence of a mood, a movement, an expression. \"Behind the Microphone\" offers a fairly standard behind-the-scenes look at the creation of the excellent English version of', 'Spirited Away', '.', '--Charles Solomon']\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Hayao Miyazaki', 'Language': 'French (Dolby Digital 2.0 Surround), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.3 x 7.52 inches; 4.32 Ounces', 'Item model number': 'UPC# 7869 3621 3843', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 15, 2003', 'Studio': 'Walt Disney Home Entertainment Presents A Studio Ghibli Film', 'Number of discs': '1'}\nReally beautiful and interesting graphics.  My daughter loved it.\ngood movie\nMy Bodyguard (Widescreen Edition)\nChris Makepeace  (Actor),     Adam Baldwin  (Actor),     Tony Bill  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['A shrimpy Chicago teen hires a big, brooding classmate to protect him from bullies.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Tony Bill, Matt Dillon, Adam Baldwin, Alan Ormsby, Tom Rielly, Hank Salas, Chris Makepeace, Denise Baske, Vicky Nelson, Joan Cusack, Tim Reyna, Paul Quandt, Richard Bradley, Dean R. MillerTony Bill, Matt Dillon, Adam Baldwin, Alan Ormsby, Tom Rielly, Hank Salas, Chris Makepeace, Denise Baske, Vicky Nelson, Joan Cusack, Tim Reyna, Paul Quandt, Richard Bradley, Dean R. Miller   See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'FOXS2283436DVD', 'Director': 'Tony Bill', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'January 29, 2002', 'Actors': 'Chris Makepeace, Adam Baldwin, Matt Dillon, Paul Quandt, Hank Salas', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Studio': '20th Century Fox', 'Writers': 'Alan Ormsby', 'Number of discs': '1'}\nLove this old flick.  Good packaging.\ngood old movie\nThe Baytown Outlaws [DVD]\nBilly Bob Thornton  (Actor),     Eva Longoria  (Actor),     Barry Battles  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n[\"After her ex-husband shoots Celeste three times in the gut and kidnaps her godson, it's time to play dirty. She hires three outlawed, redneck brothers to bring him back to her. What begins as a small rescue mission rises to a Southern battle royale.\", ']]>']\n{'Genre': 'Suspense, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'Paul Wesley, Andre Braugher, Travis Fimmel, Robert Teitel, William O. Perkins III, Eva Longoria, Griffin Hood, Daniel Cudmore, Billy Bob Thornton, Barry BattlesPaul Wesley, Andre Braugher, Travis Fimmel, Robert Teitel, William O. Perkins III, Eva Longoria, Griffin Hood, Daniel Cudmore, Billy Bob Thornton, Barry Battles  See more', 'Initial release date': '2014-04-29', 'Language': 'English', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'PRC61739DVD', 'Director': 'Barry Battles', 'Media Format': 'Multiple Formats, AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'April 29, 2014', 'Actors': 'Billy Bob Thornton, Eva Longoria, Andre Braugher, Daniel Cudmore, Travis Fimmel', 'Producers': 'William O. Perkins III, Robert Teitel', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Barry Battles, Griffin Hood', 'Number of discs': '1'}\nLove this movie.  Fun with awesome cliche ending!  I enjoyed it.\nLove this\nStick Man\nn/a  (Actor, Director)    Rated:    G    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['From the makers of The Gruffalo and Room on the Broom, and based on the beloved children s classic written by Julia Donaldson and illustrated by Axel Scheffler, this beautifully animated film tells the tale of Stick Man and his epic adventure across the seasons. He gets thrown into a river, escapes from a swan s nest, and even ends up on top of a fire. Will he ever get back to his family tree in time for Christmas?']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35645086', 'Media Format': 'NTSC, Widescreen', 'Run time': '30 minutes', 'Release date': 'November 8, 2016', 'Dubbed': 'English', 'Language': 'English (Stereo)', 'Studio': 'PBS', 'Number of discs': '1'}\nAdorable story!\nFive Stars\nMr. Right [DVD]\nSam Rockwell  (Actor),     Anna Kendrick  (Actor),     Paco Cabezas  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"The road to true love is paved with knives and bullets in this killer comedy starring Anna Kendrick and Sam Rockwell. Unlucky in love and with terrible taste in men, Martha (Kendrick) bumps into Francis (Rockwell) and finally meets the man of her dreams. Sweet and charming, he seems the perfect match until Martha discovers Francis is a world-class assassin whose enemies are trying to kill him and can't quite decide as body counts rise whether to join in the mayhem or dump him. Also starring Tim Roth, Anson Mount and the Wu-Tang Clan's RZA, Mr. Right is a rollicking romp bursting with action and laughs!\", 'Bonus Content:', 'A Sweet Couple', 'A Sweet Couple', ']]>']\n{'Genre': 'Comedy, Action & Adventure, Arthouse', 'Format': 'NTSC, Subtitled', 'Contributor': 'Tim Roth, Lawrence Mattis, James Ransone, Michael Eklund, Anson Mount, Max Landis, Sam Rockwell, Paco Cabezas, Anna Kendrick, Bradley Gallo, RZA, Michael A. Helfant, Rick JacobsTim Roth, Lawrence Mattis, James Ransone, Michael Eklund, Anson Mount, Max Landis, Sam Rockwell, Paco Cabezas, Anna Kendrick, Bradley Gallo, RZA, Michael A. Helfant, Rick Jacobs  See more', 'Initial release date': '2016-06-07', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35396444', 'Director': 'Paco Cabezas', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 7, 2016', 'Actors': 'Sam Rockwell, Anna Kendrick, Tim Roth, James Ransone, Anson Mount', 'Subtitles': 'French, Spanish', 'Producers': 'Michael A. Helfant, Bradley Gallo, Rick Jacobs, Lawrence Mattis', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Max Landis', 'Number of discs': '1'}\nMovie came in great condition!\nCame perfectly\nThe Handmaid's Tale: Season 2 [DVD]\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n[\"Handmaid's Tale, The: Season 2 (DVD)\", ']]>']\n{'Genre': 'Television/Fox TV', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English (DTS 5.1), French (DTS 5.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.64 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '1 hour and 59 minutes', 'Release date': 'December 4, 2018', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nLove it!\nGood quality\nHandmaid's Tale, The: Fourth Season (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"In season four of The Handmaid's Tale, June strikes back against Gilead as a fierce rebel leader, but the risks she takes bring unexpected and dangerous new challenges. Her quest for justice and revenge threatens to consume her and destroy her most cherished relationships.\", ']]>']\n{'Genre': 'Drama/Television, Television', 'Format': 'NTSC', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '3', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.6 x 5.47 x 0.67 inches; 4.16 Ounces', 'Director': 'Various', 'Media Format': 'NTSC', 'Release date': 'April 5, 2022', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '3'}\nLove it!\nGood quality\nHandmaid's Tale, The: Season 3 [DVD]\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['With her plan in place, June reaches the point of no return on her bold strike against Gilead; Serena Joy and Commander Waterford attempt to find their way forward in their new lives.']\n{'Genre': 'Drama/Television, Television', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '4', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 5.44 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '634 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nLove it!\nGood quality\nThe Handmaid's Tale: Season 1 [DVD]\nVarious  (Actor, Director)    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Based on Margaret Atwood’s award-winning, best-selling novel, The Handmaid’s Tale is the story of life in the dystopia of Gilead, a totalitarian society in what was formerly the United States. Facing environmental disasters and a plunging birthrate, Gilead is ruled by a twisted fundamentalism in its militarized “return to traditional values.” As one of the few remaining fertile women, Offred (Elisabeth Moss) is a Handmaid in the Commander’s household, belonging to the caste of women forced into sexual servitude as a last desperate attempt to repopulate the world. In this terrifying society, Offred must navigate between Commanders, their cruel Wives, domestic Marthas, and her fellow Handmaids – where anyone could be a spy for Gilead – with one goal: to survive and find the daughter who was taken from her. Also featuring Yvonne Strahovski and Samira Wiley.']\n{'Genre': 'Television/Fox TV', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '8 hours and 45 minutes', 'Release date': 'March 13, 2018', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '3'}\nLove it!\nGood quality\nStage Mother [DVD]\nFormat: DVD\nMovies & TV, Featured Categories, DVD, LGBT\n['A conservative church choir director from rural Texas named Maybelline Metcalf (Jacki Weaver) inherits her drag queen son s drag/transgender nightclub after he dies, and surprises everyone, including herself, by moving to San Francisco to try to save it from bankruptcy.', \"Maybelline embarks on a kaleidoscopic journey of discovery as she befriends the colourful performers at the nightclub, but butts heads with her bitter gay son-in-law (Adrian Grenier) who feels he deserves to own the club. She moves in with her son's best friend, a free-spirited single mother (Lucy Liu), and becomes de facto den mother to the club's flamboyant performers, until her past and per present worlds collide.\"]\n{'Package Dimensions': '7.52 x 5.35 x 0.63 inches; 2.47 Ounces', 'Media Format': 'PAL, Dolby', 'Release date': 'November 16, 2020', 'Studio': 'Altitude Film Distribution', 'Number of discs': '1'}\nCame in perfect condition\nGood quality\nMen [DVD]\nJessie Buckley  (Actor),     Rory Kinnear  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['In the aftermath of a personal tragedy, Harper (Jessie Buckley) retreats alone to the beautiful English countryside, hoping to have found a place to heal.']\n{'Genre': 'Drama', 'Format': 'DVD, Subtitled, NTSC', 'Contributor': 'Rory Kinnear, Jessie Buckley', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.6 x 5.31 x 0.67 inches; 2.72 Ounces', 'Audio Description': 'English', 'Media Format': 'DVD, Subtitled, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'August 9, 2022', 'Actors': 'Jessie Buckley, Rory Kinnear', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI liked this movie.  The end was very telling.  Children having children (men can be children).  Men manipulating and the power of the V.\nMisunderstood",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Ponyo\nReview Date: 2014/01/29\nStore: Noah Lindsey Cyrus  (Actor),     Frankie Jonas  (Actor),     Hayao Miyazaki  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', \"Welcome to a world where anything is possible! Academy Award(R)-winning director Hayao Miyazaki (2002, Best Animated Feature, SPIRITED AWAY) and legendary filmmaker John Lasseter together with Disney bring to life a heartwarming and imaginative telling of Hans Christian Andersen's classic fairy tale THE LITTLE MERMAID. A young boy named Sosuke rescues a goldfish named Ponyo, and they embark on a fantastic journey of friendship and discovery before Ponyo's father, a powerful sorcerer, forces her to return to her home in the sea. In her quest to become human and reunite with Sosuke, Ponyo stumbles upon and releases her father's magical Water of Life and triggers a gigantic storm. Now balance must be restored to the world they all cherish. PONYO will delight your family with its magnificent animation and timeless story. (C) 2009 Nibariki-GNDHDDT(C)2008 Nibariki-(C) Disney\", 'Amazon.com', 'Ponyo', 'confirms Academy Award®-winning director Hayao Miyazaki\\'s reputation as one of the most imaginative filmmakers working today. Loosely based on Hans Christian Anderson\\'s \"The Little Mermaid,\"', 'Ponyo', \"is a magical celebration of innocent love and the fragile beauty of the natural world. The daughter of the sea goddess Gran Mamare (voiced by Cate Blanchett) and the alchemist Fujimoto (Liam Neeson), Ponyo (Noah Cyrus) begins life as an adventurous little goldfish. Chafing at her father's restrictions, she goes in search of adventure and meets Sosuke (Frankie Jonas), a good-natured 5-year-old who lives by the sea. Sosuke adopts Ponyo and quickly wins her heart. Fujimoto uses magic to bring her back, but Ponyo's love for Sosuke proves stronger than his elixirs. She transforms herself into a human girl and returns to him during a spectacular storm at sea, but her metamorphosis upsets the balance of nature, precipitating a crisis only Gran Mamare can resolve.\", 'Ponyo', 'contains fantastic moments that suggest dreams-- and reassert the power of hand-drawn animation to create memorable fantasies: No effects-laden Hollywood feature can match the wonder of Ponyo running along the tops of crashing waves on her way back to Sosuke.', 'Ponyo', 'is closer in tone to', 'My Neighbor Totoro', 'than', 'Spirited Away', 'or', \"Howl's Moving Castle\", ', and will appeal to audiences of all ages, including small children. The #1 film in Japan in 2008,', 'Ponyo', 'earned more than ¥14.9 billion (over US$155 million) to become the 8th highest grossing film in Japanese history. (Rated G: A few scary moments, alcohol use) --', 'Charles Solomon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Anime & Manga', 'Format': 'Multiple Formats, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Matt Damon, Hayao Miyazaki, Cate Blanchett, Liam Neeson, Lily Tomlin, Noah Lindsey Cyrus, Frankie Jonas, Cloris Leachman, Betty White, Tina FeyMatt Damon, Hayao Miyazaki, Cate Blanchett, Liam Neeson, Lily Tomlin, Noah Lindsey Cyrus, Frankie Jonas, Cloris Leachman, Betty White, Tina Fey  See more', 'Language': 'Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), French, Unqualified', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.57 x 5.33 x 7.49 inches; 4.16 Ounces', 'Item model number': '10185400', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'March 2, 2010', 'Actors': 'Noah Lindsey Cyrus, Frankie Jonas, Cate Blanchett, Liam Neeson, Tina Fey', 'Dubbed': 'English, French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Disney Presents Studio Ghibli', 'Number of discs': '1'}\nReview Text: My daughter loves this story.  She showed the movie to my little neice...and she loved it too!  She couldn't take her eyes off the screen.\nReview Title: cute\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Hunger Games [DVD]\nReview Date: 2014/01/29\nStore: Jennifer Lawrence (Actor),  Josh Hutcherson (Actor),  Liam Hemsworth (Actor),  Woody Harrelson (Actor),  Elizabeth Banks (Actor),  Stanley Tucci (Actor),  Wes Bentley (Actor),  Lenny Kravitz (Actor),  Amandla Stenberg (Actor),  Donald Sutherland (Actor),  Gary Ross (Director, Writer),  Suzanne Collins (Writer),  Billy Ray (Writer)\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Amazon.com', 'Building on her performance as a take-no-prisoners teenager in', \"Winter's Bone\", ', Jennifer Lawrence portrays heroine Katniss Everdeen in Gary Ross\\'s action-oriented adaptation of author-screenwriter Suzanne Collins\\'s young adult bestseller. Set in a dystopian future in which the income gap is greater than ever, 24 underprivileged youth fight to the death every year in a televised spectacle designed to entertain the rich and give the poor enough hope to quell any further unrest--but not too much, warns Panem president Snow (Donald Sutherland), because that would be \"dangerous.\" Hailing from the same mining town, 16-year-olds Katniss and Peeta (Josh Hutcherson,', 'The Kids Are All Right', \") represent District 12 with the help of escort Effie (an unrecognizable Elizabeth Banks) and mentor Haymitch (a scene-stealing Woody Harrelson). At first they're adversaries, but a wary partnership eventually develops, though the rules stipulate that only one contestant can win. For those who haven't read the book, the conclusion is likely to come as a surprise. Before it arrives, Ross (\", 'Pleasantville', \") depicts a society in which the Haves appear to have stepped out of a Dr. Seuss book and the Have-Nots look like refugees from the WPA photographs of Walker Evans. It's an odd mix, made odder still by frenetic fight scenes where it's hard to tell who's doing what to whom. Fortunately, Lawrence and Hutcherson prove a sympathetic match in this crazy, mixed-up combination of\", 'Survivor', ',', 'Lost', ', and the collected works of George Orwell.', '--Kathleen C. Fennessy', 'Synopsis', 'Every year in the ruins of what was once North America, the Capitol of the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games. A twisted punishment for a past uprising and an ongoing government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains. Sixteen-year-old Katniss Everdeen volunteers in her younger sister’s place to enter the games, and is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy when she’s pitted against highly-trained Tributes who have prepared for these Games their entire lives. If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love.', 'About the Author', 'SUZANNE COLLINS', 'first made her mark in children’s literature with the New York Times bestselling', 'Underland Chronicles', 'for middle grade readers. Her debut for readers aged 12 and up,', 'The Hunger Games', 'was an instant bestseller, appealing to both teen readers and adults. It has appeared on the New York Times bestseller list for more than 180 consecutive weeks/more than three consecutive years since publication. Suzanne Collins also had a successful and prolific career writing for children’s television. In 2010 Collins was named to the TIME 100 list as well as the Entertainment Weekly Entertainers of the Year list. In 2011 Fast Company named her to their 100 Most Creative People in Business.', 'Meet the Characters', 'Katniss Everdeen', 'The Tribute who becomes a heroine when she volunteers to take her sister’s place in the Hunger Games.', 'Peeta Mellark', 'The male Tribute from District 12, who has long harbored secret feelings for Katniss.', 'Gale Hawthorne', 'Katniss’s fellow hunter, rebel and best friend, who is heartbroken when she volunteers and departs for the Games.', 'Haymitch Abernathy', 'Victor of the 50th Hunger Games, now the rarely sober mentor for Katniss and Peeta.', 'Effie Trinket', 'Katniss’s elaborately-coiffed escort and PR handler for the Games.', 'Cinna', 'Katniss’s personal Stylist for the Games who becomes her unexpected confidante and supporter.']\nAverage Rating: 4.7\nProduct Details: {}\nReview Text: Great movie, however I purchased it because it says with digital copy.  Well, that was not the case.  The offer expired about a year ago AND, it skipped in the middle.  Unfortunately this was a gift and I had been saving it for about 2 months.  By the time the recipient opened the gift, it was too late to return.\nReview Title: deceptive\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spirited Away\nReview Date: 2015/01/12\nStore: Hayao Miyazaki  (Director)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Animation\nProduct Description: ['Product Description', 'From one of the most celebrated filmmakers in the history of animated cinema comes the most acclaimed film of 2002. Hayao Miyazaki\\'s latest triumph, filled with astonishing animation and epic adventure, is a dazzling masterpiece for the ages. It\\'s a \"wonderfully welcoming work of art that\\'s as funny and entertaining as it is brilliant, beautiful, and deep\" (Joe Morgenstern, Wall Street Journal). SPIRITED AWAY is a wondrous fantasy about a young girl, Chihiro, trapped in a strange new world of spirits. When her parents undergo a mysterious transformation, she must call upon the courage she never knew she had to free herself and return her family to the outside world. An unforgettable story brimming with creativity, SPIRITED AWAY will take you on a journey beyond your imagination. \"To enter the world of Hayao Miyazaki is to experience a kind of lighthearted enchantment that is unique to the world of animation\" (Roger Ebert, Chicago Sun-Times). It\\'s a fantastic tale the whole family will want to experience over and over again.~~(c) 2001 Nibariki -- GNDDTM', 'Set Contains:', 'The most interesting extra feature on the two-disc set is the Nippon Television Special on the making of', 'Spirited Away', ', not because it\\'s significantly different from American making-of programs, but because the camera crew was allowed to film Miyazaki at work. It\\'s fascinating to watch the visionary director explaining how individual movements should be animated, and even performing the little dance the frog-master does to welcome the No-Face to Yubaba\\'s bath house. (Old animators describe Walt Disney giving similar performances, but no comparable footage exists.) It\\'s also striking to see how intimate Studio Ghibli is, unencumbered by the tiers of management that burden American studios. The scene comparisons enable the viewer to study the storyboards for the film, which Miyazaki draws himself. These simple yet wonderfully vivid images capture the essence of a mood, a movement, an expression. \"Behind the Microphone\" offers a fairly standard behind-the-scenes look at the creation of the excellent English version of', 'Spirited Away', '.', '--Charles Solomon']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Fantasy', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Hayao Miyazaki', 'Language': 'French (Dolby Digital 2.0 Surround), Japanese (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 5 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.57 x 5.3 x 7.52 inches; 4.32 Ounces', 'Item model number': 'UPC# 7869 3621 3843', 'Director': 'Hayao Miyazaki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 15, 2003', 'Studio': 'Walt Disney Home Entertainment Presents A Studio Ghibli Film', 'Number of discs': '1'}\nReview Text: Really beautiful and interesting graphics.  My daughter loved it.\nReview Title: good movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: My Bodyguard (Widescreen Edition)\nReview Date: 2015/01/12\nStore: Chris Makepeace  (Actor),     Adam Baldwin  (Actor),     Tony Bill  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['A shrimpy Chicago teen hires a big, brooding classmate to protect him from bullies.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Tony Bill, Matt Dillon, Adam Baldwin, Alan Ormsby, Tom Rielly, Hank Salas, Chris Makepeace, Denise Baske, Vicky Nelson, Joan Cusack, Tim Reyna, Paul Quandt, Richard Bradley, Dean R. MillerTony Bill, Matt Dillon, Adam Baldwin, Alan Ormsby, Tom Rielly, Hank Salas, Chris Makepeace, Denise Baske, Vicky Nelson, Joan Cusack, Tim Reyna, Paul Quandt, Richard Bradley, Dean R. Miller   See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'FOXS2283436DVD', 'Director': 'Tony Bill', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'January 29, 2002', 'Actors': 'Chris Makepeace, Adam Baldwin, Matt Dillon, Paul Quandt, Hank Salas', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish', 'Studio': '20th Century Fox', 'Writers': 'Alan Ormsby', 'Number of discs': '1'}\nReview Text: Love this old flick.  Good packaging.\nReview Title: good old movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Baytown Outlaws [DVD]\nReview Date: 2016/09/10\nStore: Billy Bob Thornton  (Actor),     Eva Longoria  (Actor),     Barry Battles  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, DTS\nProduct Description: [\"After her ex-husband shoots Celeste three times in the gut and kidnaps her godson, it's time to play dirty. She hires three outlawed, redneck brothers to bring him back to her. What begins as a small rescue mission rises to a Southern battle royale.\", ']]>']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Suspense, Action & Adventure', 'Format': 'Multiple Formats, AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Contributor': 'Paul Wesley, Andre Braugher, Travis Fimmel, Robert Teitel, William O. Perkins III, Eva Longoria, Griffin Hood, Daniel Cudmore, Billy Bob Thornton, Barry BattlesPaul Wesley, Andre Braugher, Travis Fimmel, Robert Teitel, William O. Perkins III, Eva Longoria, Griffin Hood, Daniel Cudmore, Billy Bob Thornton, Barry Battles  See more', 'Initial release date': '2014-04-29', 'Language': 'English', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': 'PRC61739DVD', 'Director': 'Barry Battles', 'Media Format': 'Multiple Formats, AC-3, Dolby, DTS Surround Sound, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'April 29, 2014', 'Actors': 'Billy Bob Thornton, Eva Longoria, Andre Braugher, Daniel Cudmore, Travis Fimmel', 'Producers': 'William O. Perkins III, Robert Teitel', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Barry Battles, Griffin Hood', 'Number of discs': '1'}\nReview Text: Love this movie.  Fun with awesome cliche ending!  I enjoyed it.\nReview Title: Love this\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stick Man\nReview Date: 2018/01/26\nStore: n/a  (Actor, Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['From the makers of The Gruffalo and Room on the Broom, and based on the beloved children s classic written by Julia Donaldson and illustrated by Axel Scheffler, this beautifully animated film tells the tale of Stick Man and his epic adventure across the seasons. He gets thrown into a river, escapes from a swan s nest, and even ends up on top of a fire. Will he ever get back to his family tree in time for Christmas?']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35645086', 'Media Format': 'NTSC, Widescreen', 'Run time': '30 minutes', 'Release date': 'November 8, 2016', 'Dubbed': 'English', 'Language': 'English (Stereo)', 'Studio': 'PBS', 'Number of discs': '1'}\nReview Text: Adorable story!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Right [DVD]\nReview Date: 2022/10/03\nStore: Sam Rockwell  (Actor),     Anna Kendrick  (Actor),     Paco Cabezas  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"The road to true love is paved with knives and bullets in this killer comedy starring Anna Kendrick and Sam Rockwell. Unlucky in love and with terrible taste in men, Martha (Kendrick) bumps into Francis (Rockwell) and finally meets the man of her dreams. Sweet and charming, he seems the perfect match until Martha discovers Francis is a world-class assassin whose enemies are trying to kill him and can't quite decide as body counts rise whether to join in the mayhem or dump him. Also starring Tim Roth, Anson Mount and the Wu-Tang Clan's RZA, Mr. Right is a rollicking romp bursting with action and laughs!\", 'Bonus Content:', 'A Sweet Couple', 'A Sweet Couple', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy, Action & Adventure, Arthouse', 'Format': 'NTSC, Subtitled', 'Contributor': 'Tim Roth, Lawrence Mattis, James Ransone, Michael Eklund, Anson Mount, Max Landis, Sam Rockwell, Paco Cabezas, Anna Kendrick, Bradley Gallo, RZA, Michael A. Helfant, Rick JacobsTim Roth, Lawrence Mattis, James Ransone, Michael Eklund, Anson Mount, Max Landis, Sam Rockwell, Paco Cabezas, Anna Kendrick, Bradley Gallo, RZA, Michael A. Helfant, Rick Jacobs  See more', 'Initial release date': '2016-06-07', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35396444', 'Director': 'Paco Cabezas', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 36 minutes', 'Release date': 'June 7, 2016', 'Actors': 'Sam Rockwell, Anna Kendrick, Tim Roth, James Ransone, Anson Mount', 'Subtitles': 'French, Spanish', 'Producers': 'Michael A. Helfant, Bradley Gallo, Rick Jacobs, Lawrence Mattis', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Max Landis', 'Number of discs': '1'}\nReview Text: Movie came in great condition!\nReview Title: Came perfectly\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Handmaid's Tale: Season 2 [DVD]\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"Handmaid's Tale, The: Season 2 (DVD)\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television/Fox TV', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English (DTS 5.1), French (DTS 5.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.64 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '1 hour and 59 minutes', 'Release date': 'December 4, 2018', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Handmaid's Tale, The: Fourth Season (DVD)\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"In season four of The Handmaid's Tale, June strikes back against Gilead as a fierce rebel leader, but the risks she takes bring unexpected and dangerous new challenges. Her quest for justice and revenge threatens to consume her and destroy her most cherished relationships.\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'NTSC', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '3', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.6 x 5.47 x 0.67 inches; 4.16 Ounces', 'Director': 'Various', 'Media Format': 'NTSC', 'Release date': 'April 5, 2022', 'Actors': 'Various', 'Studio': 'Warner Bros.', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Handmaid's Tale, The: Season 3 [DVD]\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['With her plan in place, June reaches the point of no return on her bold strike against Gilead; Serena Joy and Commander Waterford attempt to find their way forward in their new lives.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Television, Television', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '4', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 5.44 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '634 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Handmaid's Tale: Season 1 [DVD]\nReview Date: 2022/10/03\nStore: Various  (Actor, Director)    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: ['Based on Margaret Atwood’s award-winning, best-selling novel, The Handmaid’s Tale is the story of life in the dystopia of Gilead, a totalitarian society in what was formerly the United States. Facing environmental disasters and a plunging birthrate, Gilead is ruled by a twisted fundamentalism in its militarized “return to traditional values.” As one of the few remaining fertile women, Offred (Elisabeth Moss) is a Handmaid in the Commander’s household, belonging to the caste of women forced into sexual servitude as a last desperate attempt to repopulate the world. In this terrifying society, Offred must navigate between Commanders, their cruel Wives, domestic Marthas, and her fellow Handmaids – where anyone could be a spy for Gilead – with one goal: to survive and find the daughter who was taken from her. Also featuring Yvonne Strahovski and Samira Wiley.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Television/Fox TV', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.6 x 5.3 x 7.4 inches; 4 Ounces', 'Director': 'Various', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '8 hours and 45 minutes', 'Release date': 'March 13, 2018', 'Actors': 'Various', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: Love it!\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Stage Mother [DVD]\nReview Date: 2022/10/03\nStore: Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, LGBT\nProduct Description: ['A conservative church choir director from rural Texas named Maybelline Metcalf (Jacki Weaver) inherits her drag queen son s drag/transgender nightclub after he dies, and surprises everyone, including herself, by moving to San Francisco to try to save it from bankruptcy.', \"Maybelline embarks on a kaleidoscopic journey of discovery as she befriends the colourful performers at the nightclub, but butts heads with her bitter gay son-in-law (Adrian Grenier) who feels he deserves to own the club. She moves in with her son's best friend, a free-spirited single mother (Lucy Liu), and becomes de facto den mother to the club's flamboyant performers, until her past and per present worlds collide.\"]\nAverage Rating: 4.4\nProduct Details: {'Package Dimensions': '7.52 x 5.35 x 0.63 inches; 2.47 Ounces', 'Media Format': 'PAL, Dolby', 'Release date': 'November 16, 2020', 'Studio': 'Altitude Film Distribution', 'Number of discs': '1'}\nReview Text: Came in perfect condition\nReview Title: Good quality\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Men [DVD]\nReview Date: 2022/11/06\nStore: Jessie Buckley  (Actor),     Rory Kinnear  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['In the aftermath of a personal tragedy, Harper (Jessie Buckley) retreats alone to the beautiful English countryside, hoping to have found a place to heal.']\nAverage Rating: 3.7\nProduct Details: {'Genre': 'Drama', 'Format': 'DVD, Subtitled, NTSC', 'Contributor': 'Rory Kinnear, Jessie Buckley', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.6 x 5.31 x 0.67 inches; 2.72 Ounces', 'Audio Description': 'English', 'Media Format': 'DVD, Subtitled, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'August 9, 2022', 'Actors': 'Jessie Buckley, Rory Kinnear', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I liked this movie.  The end was very telling.  Children having children (men can be children).  Men manipulating and the power of the V.\nReview Title: Misunderstood\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns**\n\n- **Genre Preference**: Strong inclination towards animated features, science fiction, fantasy, and family-oriented films, particularly those by celebrated directors like Miyazaki.\n- **Audience Focus**: Primarily purchases suitable for children and family, indicating a preference for wholesome content (G and PG-rated films).\n- **Favorable Series**: Exhibits strong interest in series with continuity, as evidenced by multiple purchases from \"The Handmaid’s Tale.\"\n- **Purchase Experience**: Positive feedback on product quality and condition, often rating items highly (mostly 4-5 stars). \n- **Gift-Giving**: Occasionally buys DVDs as gifts, emphasizing the importance of presentation and packaging.\n- **Nostalgia**: Enjoys classic and older films, showing appreciation for timeless cinema.\n- **Diversity in Content**: Some engagement with adult-themed films, as shown by the purchase of mixed-genre titles.\n- **Textual Engagement**: Interactions tend to include commenting on visual quality and emotional resonance, particularly for animated purchases. \n\nOverall, this individual values high-quality, imaginative storytelling and films that can be enjoyed by diverse audiences, with a strong focus on family-friendly content and classic narratives.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Meh",
    "text": "I didn't realize it was a made for TV mini series.  It was a bit boring.",
    "images": [],
    "asin": "B07GGRJWQY",
    "parent_asin": "B07GGRJWQY",
    "user_id": "AEFZM4DYLUZEUHB3WEND5KSEGWUQ",
    "timestamp": "2023-03-08 04:09:09.239000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Picnic at Hanging Rock",
    "average_rating": 4.2,
    "rating_number": 387,
    "features": [],
    "description": [],
    "price": 20.66,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/5136L8craHL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/5136L8craHL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71oSSPOd9eL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Dormer, Natalie  (Actor),     Hany, Don  (Actor)    Format: DVD",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "DVD"
    ],
    "details": {},
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}