{
  "user_id": "AHVZ5DAFBNQRU3JE6OXUOCXFSM6A",
  "summary": "=== Purchase Information ===\nProduct Title: Columbo - The Complete Second Season\nReview Date: 2012/02/16\nStore: Peter Falk  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', '\"Oh, there\\'s just one more thing….\" Everyone\\'s favorite cigar-chomping, trenchcoat-wearing Police Lieutenant is back on DVD asking all the right questions in all 8 thrilling episodes of the Complete Second Season of Columbo. Join five-time Emmy winner Peter Falk as wry and ruffled Lieutenant Columbo as he solves L.A.\\'s most puzzling crimes with his trademark wit and style. Along for the chase are a dazzling lineup of Hollywood\\'s brightest stars including Robert Culp, Valerie Harper, Dean Stockwell, Leonard Nimoy, Martin Landau, Marc Singer and more. In the smart, funny and exciting Second Season of Columbo, it\\'s no mystery to see why this is the DVD series that mystery lovers have been waiting for!', ']]>', 'Amazon.com', 'Armchair sleuths, get out your trenchcoats: Universal has released the sophomore season (1972-73) of the classic detective series', 'Columbo', \", starring Peter Falk as the sage but rumpled police lieutenant. As with the first season, there's plenty of star power in front of and behind the camera to abet Falk in these eight 90- and 120-minute episodes: John Cassavetes stars in the season premiere,\", 'Etude in Black', ', as a philandering symphony conductor, with Blythe Danner and Hollywood legend Myrna Loy in support; Oscar winner Ray Milland is a scheming orchid grower in \"The Greenhouse Jungle,\" co-starring Bradford Dillman and William Smith; Robert Culp and Dean Stockwell are a football team manager and owner, respectively, whose disagreements blossom into murder in \"The Most Crucial Game\"; and Jeanette Nolan offers stellar comic relief in \"Double Shock,\" which features Martin Landau as identical twins--one of whom has murdered their uncle. Performances by Richard Basehart, Laurence Harvey, Leonard Nimoy, Anne Francis, Anne Baxter, and Mel Ferrer also highlight the season; direction by small-screen stalwarts like Boris Sagal, Jeremy Paul Kagan, and Nicholas Colasanto (\"Coach\" on', 'Cheers', ') and scripts by Stephen Bochco also bring quality and style to the proceedings. Sadly, no extras are available in this five-disc set, but the stellar image and sound quality (and lack of commercials) should appeal to series fans and newcomers alike.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Peter Falk', 'Language': 'Unqualified, Unknown (Dolby Digital 2.0), English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 6 x 1 inches; 1.6 Ounces', 'Item model number': '2220369', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '10 hours and 41 minutes', 'Release date': 'March 8, 2005', 'Actors': 'Peter Falk', 'Subtitles': 'English, Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '4'}\nReview Text: To start off I love colu.mbo,and my dvd even though used it looked new and played great.overall a-1.this is one of my favo.rite seasons of columbo\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Airwolf: Season 2\nReview Date: 2012/08/10\nStore: Jan-Michael Vincent  (Actor),     Ernest Borgnine  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Product Description', \"Get ready to take off for action and adventure as all 22 one-hour episodes of Airwolf Season Two soar on to a spectacular five-disc DVD set for the first time ever! Cruise the skies once again with Airwolf, the cutting-edge, high-tech surveillance and defense helicopter of the future, and Stringfellow Hawke (Jan-Michael Vincent), its reclusive renegade pilot, as they touch down on dangerous secret missions from Afghanistan to the jungles of Central America. From drug runners to dambreakers to demented businessmen, there's no one who can hide from the Airwolf team's high-tech gadgetry and fighting power. Co-starring Ernest Borgnine and Alex Cord, this suspenseful and daring Emmy-nominated series from TV producer Donald P. Bellisario (Magnum P.I., Quantum Leap) is sure to be a thrill-ride fans won't want to leave!\", 'Amazon.com', 'Jan-Michael Vincent stars in', 'Airwolf', \"as Stringfellow Hawke, who, with trusty sidekick Dominic Santini (Ernest Borgnine), embarks on perilous missions for a top secret agency known as The Firm, which in turn allows him fairly free rein as he searches for his long lost brother. Vincent, then 40 years old, was still a year or two away from ruining his career with substance abuse problems, but his work here is hardly of Emmy-winning caliber; indeed, it's a lazy performance pretty much devoid of emotional resonance. Borgnine, on the other hand, is always reliable, but even the former Oscar winner (in 1955, for\", 'Marty', \") can't overcome\", 'Airwolf', \"'s procession of cardboard characters (especially the villains) and credulity-challenging scripts, which find our heroes traveling to a Laotian prison camp, battling nuclear terrorists in California, rescuing the president of a South American banana republic, investigating a religious cult, fending off jungle cats kept on a Texas hunting ranch, and saving a country singer from the nefarious machinations of her manager-husband, among other silliness. In fairness, creator-executive producer Donald Bellisario (who also brought us\", 'Magnum, P.I.', ',', 'Quantum Leap', ', and', 'JAG', ') and his team make an effort to inject a human element; there\\'s an episode in which Dominic is arrested for murdering his faithless wife, and a couple that find the guilt-ridden Hawke searching for his brother, Saint John (pronounced \"Sinjin\"), who was presumed lost during the Vietnam War when Stringfellow left him in the jungle. What\\'s more, considering its relatively ancient pedigree, technology-wise, the effects work isn\\'t bad, and there are some cool moments when the Airwolf helicopter does what it does best (i.e., blow stuff up).', \"It's unlikely that anyone will fondly look back at\", 'Airwolf', \"as one of television's finest moments. That doesn't mean that this five-disc set containing all 22 episodes from the series' second season (1984-85) won't find an audience eager to re-live the adventures of a super high-tech helicopter and the renegade flyboy who pilots it (heck, even\", 'Knight Rider', \", featuring David Hasselhoff and his talking car, has its adherents). Nonetheless, low expectations are definitely in order for anyone who wasn't, say, ten years old when the show was on the air.But overall, the show lacks a strong vibe, a recognizable sense of style and pace to draw viewers in and make believers out of us. Not terrible, not terrific,\", 'Airwolf', 'is just sort of there.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Contributor': 'Jan-Michael Vincent, Ernest Borgnine', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '17 hours and 42 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 10.4 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Run time': '17 hours and 42 minutes', 'Release date': 'December 26, 2006', 'Actors': 'Jan-Michael Vincent, Ernest Borgnine', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Well I liked airwolf way back then,and I still like it even now.and I think adding jean bruce scott was a plus for the show.overall a very good show cannot say the same for season 4 when it had a new cast and network.thanks\nReview Title: great\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Haywire\nReview Date: 2012/10/14\nStore: Carano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Directed by Oscar® winner* Steven Soderbergh (', 'Contagion', '), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,', 'HAYWIRE', 'is explosive movie entertainment.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'MFR031398152156#VG', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: When I rented movie I was thinking maybe I wasted my money.but after I started watching it ,wow was I wrong.gina carano was smoking hot and acting was not that bad.very good fight scenes.plot a little weak,but still a good flick.\nReview Title: Worth watching\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Men at Work [DVD]\nReview Date: 2013/03/20\nStore: Charlie Sheen  (Actor),     Emilio Estevez  (Actor, Director, Writer)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"It's up to a pair of trash-hauling heroes to clean up the city in this action-comedy starring real-life brothers Charlie Sheen and Emilio Estevez. Garbage men James (Estevez) and Carl (Sheen) dream of opening a surf shop, but often land in hot water due to their practical jokes. When they discover the body of a murdered politician on their route, they attempt to sniff out the killer themselves a bad idea that rapidly ensnares them in a toxic waste scandal. Soon, they're thrown headlong into a manic escapade involving a deranged veteran, an attractive campaign manager, a kidnapped pizza deliveryman and a greedy polluter who wants them hauledoff to a landfill for good!\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Contributor': 'Hawk Wolinski, Charlie Sheen, Keith David, Emilio Estevez, John Getz, John Lavachielli, Leslie Hope, Tommy Hinkley, John Putch, Geoffrey Blake, Dean Cameron, Cameron DyeHawk Wolinski, Charlie Sheen, Keith David, Emilio Estevez, John Getz, John Lavachielli, Leslie Hope, Tommy Hinkley, John Putch, Geoffrey Blake, Dean Cameron, Cameron Dye  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Director': 'Emilio Estevez', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'June 4, 2002', 'Actors': 'Charlie Sheen, Emilio Estevez, Leslie Hope, Keith David, Dean Cameron', 'Subtitles': 'English, Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Emilio Estevez', 'Number of discs': '1'}\nReview Text: Ok this movie would not win a oscar,but it is a very funny movie that will make a bad day not so bad after all.the two brothers deliver good laughs,but the real scene stealer was keith.\nReview Title: Great\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Vampire Diaries: Season 5\nReview Date: 2014/10/18\nStore: Nina Dobrev  (Actor),     Paul Wesley  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Mystery & Suspense\nProduct Description: ['The Vampire Diaries: The Complete Fifth Season (DVD)', 'Get ready for more epic suspense, romance and a bloody good thrill ride as hit series The Vampire Diaries continues for a fifth season. In the shocking season four finale, Elena (Nina Dobrev) forced the cure to vampirism down the throat of her doppelganger, Katherine Pierce (also played by Dobrev), effectively turning her back into a human. Elena, free of her sire bond to Damon (Ian Somerhalder), professes her true love to him with no strings attached … as her first love in Mystic Falls, Stefan (Paul Wesley), listened in the next room. Stefan’s plans for the immortal Silas took an unexpected turn when Silas reappeared in his true form — as Stefan’s doppelganger — stabbing the real Stefan in the stomach and throwing him into the quarry to suffer for eternity. The hit series enters its fifth season with some characters headed off to college, Katherine trying to survive as a human and a shocking Salvatore secret.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Contributor': 'Kevin Williamson, Paul Wesley, Leslie Morgenstein, L.J. Smith, Julie Plec, Ian Somerhalder, Michael Trevino, Joseph Morgan, Zach Roerig, Caroline Dries, Steven R. McQueen, Candice King, Nina Dobrev, Kat GrahamKevin Williamson, Paul Wesley, Leslie Morgenstein, L.J. Smith, Julie Plec, Ian Somerhalder, Michael Trevino, Joseph Morgan, Zach Roerig, Caroline Dries, Steven R. McQueen, Candice King, Nina Dobrev, Kat Graham  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 7.04 Ounces', 'Item model number': '29094288', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'September 9, 2014', 'Actors': 'Nina Dobrev, Paul Wesley, Ian Somerhalder, Steven R. McQueen, Kat Graham', 'Subtitles': 'Portuguese, Spanish, Thai, French', 'Producers': 'Kevin Williamson, Julie Plec, Leslie Morgenstein, Caroline Dries', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nReview Text: I enjoyed season 5 so much I ordered the dvd.\nReview Title: very good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pretty Little Liars: Season 4\nReview Date: 2015/01/16\nStore: Troian Bellisario  (Actor),     Ashley Benson  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Pretty Little Liars: The Complete Fourth Season (DVD)', 'Season four begins in moments following the shocking season three finale & the girls strive to make sense of the mysterious \"Red Coat\" & what plans he or she may have in store for them.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Troian Bellisario, Leslie Morgenstein, Joseph Dougherty, Shay Mitchell, Laura Leighton, Janel Parrish, Lucy Hale, Ashley Benson, Sasha Pieterse, Tyler Blackburn, Ian Harding, Sara Shepard, Oliver Goldstick, I. Marlene KingTroian Bellisario, Leslie Morgenstein, Joseph Dougherty, Shay Mitchell, Laura Leighton, Janel Parrish, Lucy Hale, Ashley Benson, Sasha Pieterse, Tyler Blackburn, Ian Harding, Sara Shepard, Oliver Goldstick, I. Marlene King   See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 7.2 Ounces', 'Item model number': 'D435546D', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '16 hours and 3 minutes', 'Release date': 'June 3, 2014', 'Actors': 'Troian Bellisario, Ashley Benson, Tyler Blackburn, Lucy Hale, Ian Harding', 'Producers': 'I. Marlene King, Oliver Goldstick, Leslie Morgenstein, Joseph Dougherty', 'Studio': 'Studio Distribution Services', 'Number of discs': '5'}\nReview Text: Started watching casually season 3 next thing you know I am hooked on the show keeps you thinking you got everything figured out. Then maybe not\nReview Title: hooked\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Christmas Caper\nReview Date: 2016/10/07\nStore: Shannen Doherty  (Actor),     Ty Olsen  (Actor),     David Winkler  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['After a heist goes bad, professional thief Cate Dove (Shannen Doherty) hides out in her hometown of Comfort, Connecticut when her sister, stuck on an island by a tropical storm, asks her to take care of her two children Parker and Annie until she can get back for Christmas. Not the most nurturing or sentimental of people, Cate spends most of her time scouting out the cozy suburban neighborhood with plans for another big score, as well as planning on how to get back at her deceitful partner Clive (Conrad Coates). As Christmas gets closer, however, Cate gets used to small town life, and she begins to realize her family, friends, and hunky local sheriff Hank (Ty Olsson) are making her rethink her priorities, and a crime-free Christmas in Comfort might be just what she needs this year.']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FLP-12469', 'Director': 'David Winkler', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Shannen Doherty, Ty Olsen', 'Subtitles': 'Spanish', 'Language': 'Unqualified', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nReview Text: Cute Christmas movie.but not a lot different than others. I just liked the premise of the movie, also I like  shannen doherty.\nReview Title: Cute\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/11/14\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Roach'], 'Producers': ['Jane Rosenthal', 'Nancy Tenenbaum', 'Jay Roach', 'Robert De Niro'], 'Starring': ['Robert De Niro', 'Ben Stiller', 'Blythe Danner'], 'Studio': ['DREAMWORKS SKG']}\nReview Text: Well I am bias I love this film very good film great cast funny overall a 4 star...\nReview Title: Love it\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 400 Days\nReview Date: 2016/11/14\nStore: Brandon Routh  (Actor),     Caity Lotz  (Actor),     Matt Osterman  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Mystery & Thrillers\nProduct Description: [\"400 Days is a sci-fi thriller centering on four astronauts who are sent on a simulated mission to a distant planet to test the psychological effects of deep space travel. Locked away for 400 days, the crew's mental state begins to deteriorate when they lose all communication with the outside world. Forced to exit the ship, they discover that this mission may not have been a simulation after all. The film stars Brandon Routh (Superman Returns), Caity Lotz (The Machine, Arrow), Dane Cook (My Best Friend's Girl, Mr. Brooks), Ben Feldman (Cloverfield, Friday the 13th), Tom Cavanagh (Ed, The Flash), and Grant Bowler (Defiance).\", ']]>']\nAverage Rating: 3.6\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35302756', 'Director': 'Matt Osterman', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 31 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Brandon Routh, Caity Lotz, Ben Feldman, Grant Bowler, Tom Cavanagh', 'Producers': 'Gabriel Cowan, John Suits', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Matt Osterman', 'Number of discs': '1'}\nReview Text: Started with promise but about half way thru dissolved into one mired mess of a movie with no clear ending to movie.\nReview Title: Started with promise\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/12/09\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Nolan'], 'Producers': ['Emma Thomas', 'Christopher Nolan', 'Lynda Obst', 'Jordan Goldberg', 'Jake Myers', 'Kip Thorne', 'Thomas Tull'], 'Starring': ['Matthew McConaughey', 'Anne Hathaway', 'Jessica Chastain']}\nReview Text: The movie started out very good, then somewhere along the way got bogged down and ended up being a way to long of a movie.  ..  .  Boring and hard to watch. .\nReview Title: To long\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/01/07\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Duncan McNeill', 'Allan Kroeker', 'Patrick R. Norris', 'Peter Lauer', 'Jay Chandrasekhar', 'Frederick E.O. Toye', 'Jeremiah S. Chechik', 'Jason Ensler', 'Norman Buckley', 'Zachary Levi'], 'Producers': ['Not Specified'], 'Starring': ['Zachary Levi', 'Yvonne Strahovski', 'Joshua Gomez']}\nReview Text: Ok so I'm a little bias.but season one in my opinion was the best .there's chuck  buy more geek with no clue,then's there's casey the no nonsense spy all around tough guy. And last but not least Sarah yvonne strahovski super sexy tough and sweet at the same time  and she can also kick ass.\nReview Title: Yvonne strahovski\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/12/18\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nReview Text: Ok so I bias, but t I love this movie one laugh after another.And who can forget eddie and his rv.overall a funny funny movie.\nReview Title: Love this movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/06/30\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paolo Barzman', 'John Bell', 'Ian Toynton', 'Terry Ingram', 'Clay Borris', 'Milan Cheylov', 'Steve DiMarco', 'Ken Girotti', 'Julian Grant'], 'Producers': ['John Ryan'], 'Starring': ['Tia Carrere', 'Christien Anholt', 'Lindy Booth'], 'Studio': ['Lionsgate']}\nReview Text: Love  the show..tia carrere is great\nReview Title: Love the show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Relic Hunter\nReview Date: 2018/06/30\nCategories: Science Fiction, Fantasy, Adventure, Action\nProduct Description: ['History Professor Sydney Fox (Tia Carrere) moonlights as an intrepid explorer, crisscrossing the globe in pursuit of lost icons - from the four-thousand-year-old bowl of Siddhartha to a 1946 baseball glove with magical powers.']\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paolo Barzman', 'John Bell', 'Ian Toynton', 'Terry Ingram', 'Clay Borris', 'Milan Cheylov', 'Steve DiMarco', 'Ken Girotti', 'Julian Grant'], 'Producers': ['John Ryan'], 'Starring': ['Tia Carrere', 'Christien Anholt', 'Lindy Booth']}\nReview Text: I like season 1 a little better. Still great\nReview Title: Love the show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bionic Woman\nReview Date: 2018/08/18\nCategories: Suspense, Drama, Action, Science Fiction\nProduct Description: [\"Struggling as a bartender and surrogate mom to her teenage sister, Jaime Sommers (Michelle Ryan, EastEnders) didn't think life could get much harder.  But when a devastating car accident leaves her at death's door, Jaime's only hope for survival is a cutting-edge, top-secret technology that comes at a hefty price.  With a whole new existence and a debt to re-pay, Jaime must figure out how to use her extraordinary abilities for good -- while weighing the personal sacrifices she will have to make.\"]\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Dinner', 'David Boyd', 'Steve Boyum', 'Alex Chapple', 'Gwyneth Horder-Payton', 'Tim Matheson', 'Jonas Pate', 'Paul Shapiro'], 'Producers': ['David Eick', 'Jason Smilovic']}\nReview Text: Like the show the short time it was on the air.\nReview Title: Liked the show\nRating: 5.0\n--------------------------------------------------",
  "reference": "Columbo - The Complete Second Season\nPeter Falk  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', '\"Oh, there\\'s just one more thing….\" Everyone\\'s favorite cigar-chomping, trenchcoat-wearing Police Lieutenant is back on DVD asking all the right questions in all 8 thrilling episodes of the Complete Second Season of Columbo. Join five-time Emmy winner Peter Falk as wry and ruffled Lieutenant Columbo as he solves L.A.\\'s most puzzling crimes with his trademark wit and style. Along for the chase are a dazzling lineup of Hollywood\\'s brightest stars including Robert Culp, Valerie Harper, Dean Stockwell, Leonard Nimoy, Martin Landau, Marc Singer and more. In the smart, funny and exciting Second Season of Columbo, it\\'s no mystery to see why this is the DVD series that mystery lovers have been waiting for!', ']]>', 'Amazon.com', 'Armchair sleuths, get out your trenchcoats: Universal has released the sophomore season (1972-73) of the classic detective series', 'Columbo', \", starring Peter Falk as the sage but rumpled police lieutenant. As with the first season, there's plenty of star power in front of and behind the camera to abet Falk in these eight 90- and 120-minute episodes: John Cassavetes stars in the season premiere,\", 'Etude in Black', ', as a philandering symphony conductor, with Blythe Danner and Hollywood legend Myrna Loy in support; Oscar winner Ray Milland is a scheming orchid grower in \"The Greenhouse Jungle,\" co-starring Bradford Dillman and William Smith; Robert Culp and Dean Stockwell are a football team manager and owner, respectively, whose disagreements blossom into murder in \"The Most Crucial Game\"; and Jeanette Nolan offers stellar comic relief in \"Double Shock,\" which features Martin Landau as identical twins--one of whom has murdered their uncle. Performances by Richard Basehart, Laurence Harvey, Leonard Nimoy, Anne Francis, Anne Baxter, and Mel Ferrer also highlight the season; direction by small-screen stalwarts like Boris Sagal, Jeremy Paul Kagan, and Nicholas Colasanto (\"Coach\" on', 'Cheers', ') and scripts by Stephen Bochco also bring quality and style to the proceedings. Sadly, no extras are available in this five-disc set, but the stellar image and sound quality (and lack of commercials) should appeal to series fans and newcomers alike.', '--Paul Gaita']\n{'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Peter Falk', 'Language': 'Unqualified, Unknown (Dolby Digital 2.0), English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 6 x 1 inches; 1.6 Ounces', 'Item model number': '2220369', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '10 hours and 41 minutes', 'Release date': 'March 8, 2005', 'Actors': 'Peter Falk', 'Subtitles': 'English, Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '4'}\nTo start off I love colu.mbo,and my dvd even though used it looked new and played great.overall a-1.this is one of my favo.rite seasons of columbo\nGreat\nAirwolf: Season 2\nJan-Michael Vincent  (Actor),     Ernest Borgnine  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['Product Description', \"Get ready to take off for action and adventure as all 22 one-hour episodes of Airwolf Season Two soar on to a spectacular five-disc DVD set for the first time ever! Cruise the skies once again with Airwolf, the cutting-edge, high-tech surveillance and defense helicopter of the future, and Stringfellow Hawke (Jan-Michael Vincent), its reclusive renegade pilot, as they touch down on dangerous secret missions from Afghanistan to the jungles of Central America. From drug runners to dambreakers to demented businessmen, there's no one who can hide from the Airwolf team's high-tech gadgetry and fighting power. Co-starring Ernest Borgnine and Alex Cord, this suspenseful and daring Emmy-nominated series from TV producer Donald P. Bellisario (Magnum P.I., Quantum Leap) is sure to be a thrill-ride fans won't want to leave!\", 'Amazon.com', 'Jan-Michael Vincent stars in', 'Airwolf', \"as Stringfellow Hawke, who, with trusty sidekick Dominic Santini (Ernest Borgnine), embarks on perilous missions for a top secret agency known as The Firm, which in turn allows him fairly free rein as he searches for his long lost brother. Vincent, then 40 years old, was still a year or two away from ruining his career with substance abuse problems, but his work here is hardly of Emmy-winning caliber; indeed, it's a lazy performance pretty much devoid of emotional resonance. Borgnine, on the other hand, is always reliable, but even the former Oscar winner (in 1955, for\", 'Marty', \") can't overcome\", 'Airwolf', \"'s procession of cardboard characters (especially the villains) and credulity-challenging scripts, which find our heroes traveling to a Laotian prison camp, battling nuclear terrorists in California, rescuing the president of a South American banana republic, investigating a religious cult, fending off jungle cats kept on a Texas hunting ranch, and saving a country singer from the nefarious machinations of her manager-husband, among other silliness. In fairness, creator-executive producer Donald Bellisario (who also brought us\", 'Magnum, P.I.', ',', 'Quantum Leap', ', and', 'JAG', ') and his team make an effort to inject a human element; there\\'s an episode in which Dominic is arrested for murdering his faithless wife, and a couple that find the guilt-ridden Hawke searching for his brother, Saint John (pronounced \"Sinjin\"), who was presumed lost during the Vietnam War when Stringfellow left him in the jungle. What\\'s more, considering its relatively ancient pedigree, technology-wise, the effects work isn\\'t bad, and there are some cool moments when the Airwolf helicopter does what it does best (i.e., blow stuff up).', \"It's unlikely that anyone will fondly look back at\", 'Airwolf', \"as one of television's finest moments. That doesn't mean that this five-disc set containing all 22 episodes from the series' second season (1984-85) won't find an audience eager to re-live the adventures of a super high-tech helicopter and the renegade flyboy who pilots it (heck, even\", 'Knight Rider', \", featuring David Hasselhoff and his talking car, has its adherents). Nonetheless, low expectations are definitely in order for anyone who wasn't, say, ten years old when the show was on the air.But overall, the show lacks a strong vibe, a recognizable sense of style and pace to draw viewers in and make believers out of us. Not terrible, not terrific,\", 'Airwolf', 'is just sort of there.', '--Sam Graham']\n{'Genre': 'Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Contributor': 'Jan-Michael Vincent, Ernest Borgnine', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '17 hours and 42 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 10.4 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Run time': '17 hours and 42 minutes', 'Release date': 'December 26, 2006', 'Actors': 'Jan-Michael Vincent, Ernest Borgnine', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nWell I liked airwolf way back then,and I still like it even now.and I think adding jean bruce scott was a plus for the show.overall a very good show cannot say the same for season 4 when it had a new cast and network.thanks\ngreat\nHaywire\nCarano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Directed by Oscar® winner* Steven Soderbergh (', 'Contagion', '), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,', 'HAYWIRE', 'is explosive movie entertainment.']\n{'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'MFR031398152156#VG', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhen I rented movie I was thinking maybe I wasted my money.but after I started watching it ,wow was I wrong.gina carano was smoking hot and acting was not that bad.very good fight scenes.plot a little weak,but still a good flick.\nWorth watching\nMen at Work [DVD]\nCharlie Sheen  (Actor),     Emilio Estevez  (Actor, Director, Writer)    Rated:    PG-13    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n[\"It's up to a pair of trash-hauling heroes to clean up the city in this action-comedy starring real-life brothers Charlie Sheen and Emilio Estevez. Garbage men James (Estevez) and Carl (Sheen) dream of opening a surf shop, but often land in hot water due to their practical jokes. When they discover the body of a murdered politician on their route, they attempt to sniff out the killer themselves a bad idea that rapidly ensnares them in a toxic waste scandal. Soon, they're thrown headlong into a manic escapade involving a deranged veteran, an attractive campaign manager, a kidnapped pizza deliveryman and a greedy polluter who wants them hauledoff to a landfill for good!\"]\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Contributor': 'Hawk Wolinski, Charlie Sheen, Keith David, Emilio Estevez, John Getz, John Lavachielli, Leslie Hope, Tommy Hinkley, John Putch, Geoffrey Blake, Dean Cameron, Cameron DyeHawk Wolinski, Charlie Sheen, Keith David, Emilio Estevez, John Getz, John Lavachielli, Leslie Hope, Tommy Hinkley, John Putch, Geoffrey Blake, Dean Cameron, Cameron Dye  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Director': 'Emilio Estevez', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'June 4, 2002', 'Actors': 'Charlie Sheen, Emilio Estevez, Leslie Hope, Keith David, Dean Cameron', 'Subtitles': 'English, Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Emilio Estevez', 'Number of discs': '1'}\nOk this movie would not win a oscar,but it is a very funny movie that will make a bad day not so bad after all.the two brothers deliver good laughs,but the real scene stealer was keith.\nGreat\nThe Vampire Diaries: Season 5\nNina Dobrev  (Actor),     Paul Wesley  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Mystery & Suspense\n['The Vampire Diaries: The Complete Fifth Season (DVD)', 'Get ready for more epic suspense, romance and a bloody good thrill ride as hit series The Vampire Diaries continues for a fifth season. In the shocking season four finale, Elena (Nina Dobrev) forced the cure to vampirism down the throat of her doppelganger, Katherine Pierce (also played by Dobrev), effectively turning her back into a human. Elena, free of her sire bond to Damon (Ian Somerhalder), professes her true love to him with no strings attached … as her first love in Mystic Falls, Stefan (Paul Wesley), listened in the next room. Stefan’s plans for the immortal Silas took an unexpected turn when Silas reappeared in his true form — as Stefan’s doppelganger — stabbing the real Stefan in the stomach and throwing him into the quarry to suffer for eternity. The hit series enters its fifth season with some characters headed off to college, Katherine trying to survive as a human and a shocking Salvatore secret.', ']]>']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Contributor': 'Kevin Williamson, Paul Wesley, Leslie Morgenstein, L.J. Smith, Julie Plec, Ian Somerhalder, Michael Trevino, Joseph Morgan, Zach Roerig, Caroline Dries, Steven R. McQueen, Candice King, Nina Dobrev, Kat GrahamKevin Williamson, Paul Wesley, Leslie Morgenstein, L.J. Smith, Julie Plec, Ian Somerhalder, Michael Trevino, Joseph Morgan, Zach Roerig, Caroline Dries, Steven R. McQueen, Candice King, Nina Dobrev, Kat Graham  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 7.04 Ounces', 'Item model number': '29094288', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'September 9, 2014', 'Actors': 'Nina Dobrev, Paul Wesley, Ian Somerhalder, Steven R. McQueen, Kat Graham', 'Subtitles': 'Portuguese, Spanish, Thai, French', 'Producers': 'Kevin Williamson, Julie Plec, Leslie Morgenstein, Caroline Dries', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nI enjoyed season 5 so much I ordered the dvd.\nvery good\nPretty Little Liars: Season 4\nTroian Bellisario  (Actor),     Ashley Benson  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Pretty Little Liars: The Complete Fourth Season (DVD)', 'Season four begins in moments following the shocking season three finale & the girls strive to make sense of the mysterious \"Red Coat\" & what plans he or she may have in store for them.', ']]>']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Troian Bellisario, Leslie Morgenstein, Joseph Dougherty, Shay Mitchell, Laura Leighton, Janel Parrish, Lucy Hale, Ashley Benson, Sasha Pieterse, Tyler Blackburn, Ian Harding, Sara Shepard, Oliver Goldstick, I. Marlene KingTroian Bellisario, Leslie Morgenstein, Joseph Dougherty, Shay Mitchell, Laura Leighton, Janel Parrish, Lucy Hale, Ashley Benson, Sasha Pieterse, Tyler Blackburn, Ian Harding, Sara Shepard, Oliver Goldstick, I. Marlene King   See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 7.2 Ounces', 'Item model number': 'D435546D', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '16 hours and 3 minutes', 'Release date': 'June 3, 2014', 'Actors': 'Troian Bellisario, Ashley Benson, Tyler Blackburn, Lucy Hale, Ian Harding', 'Producers': 'I. Marlene King, Oliver Goldstick, Leslie Morgenstein, Joseph Dougherty', 'Studio': 'Studio Distribution Services', 'Number of discs': '5'}\nStarted watching casually season 3 next thing you know I am hooked on the show keeps you thinking you got everything figured out. Then maybe not\nhooked\nChristmas Caper\nShannen Doherty  (Actor),     Ty Olsen  (Actor),     David Winkler  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['After a heist goes bad, professional thief Cate Dove (Shannen Doherty) hides out in her hometown of Comfort, Connecticut when her sister, stuck on an island by a tropical storm, asks her to take care of her two children Parker and Annie until she can get back for Christmas. Not the most nurturing or sentimental of people, Cate spends most of her time scouting out the cozy suburban neighborhood with plans for another big score, as well as planning on how to get back at her deceitful partner Clive (Conrad Coates). As Christmas gets closer, however, Cate gets used to small town life, and she begins to realize her family, friends, and hunky local sheriff Hank (Ty Olsson) are making her rethink her priorities, and a crime-free Christmas in Comfort might be just what she needs this year.']\n{'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FLP-12469', 'Director': 'David Winkler', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Shannen Doherty, Ty Olsen', 'Subtitles': 'Spanish', 'Language': 'Unqualified', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nCute Christmas movie.but not a lot different than others. I just liked the premise of the movie, also I like  shannen doherty.\nCute\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Roach'], 'Producers': ['Jane Rosenthal', 'Nancy Tenenbaum', 'Jay Roach', 'Robert De Niro'], 'Starring': ['Robert De Niro', 'Ben Stiller', 'Blythe Danner'], 'Studio': ['DREAMWORKS SKG']}\nWell I am bias I love this film very good film great cast funny overall a 4 star...\nLove it\n400 Days\nBrandon Routh  (Actor),     Caity Lotz  (Actor),     Matt Osterman  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Mystery & Thrillers\n[\"400 Days is a sci-fi thriller centering on four astronauts who are sent on a simulated mission to a distant planet to test the psychological effects of deep space travel. Locked away for 400 days, the crew's mental state begins to deteriorate when they lose all communication with the outside world. Forced to exit the ship, they discover that this mission may not have been a simulation after all. The film stars Brandon Routh (Superman Returns), Caity Lotz (The Machine, Arrow), Dane Cook (My Best Friend's Girl, Mr. Brooks), Ben Feldman (Cloverfield, Friday the 13th), Tom Cavanagh (Ed, The Flash), and Grant Bowler (Defiance).\", ']]>']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35302756', 'Director': 'Matt Osterman', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 31 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Brandon Routh, Caity Lotz, Ben Feldman, Grant Bowler, Tom Cavanagh', 'Producers': 'Gabriel Cowan, John Suits', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Matt Osterman', 'Number of discs': '1'}\nStarted with promise but about half way thru dissolved into one mired mess of a movie with no clear ending to movie.\nStarted with promise\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Nolan'], 'Producers': ['Emma Thomas', 'Christopher Nolan', 'Lynda Obst', 'Jordan Goldberg', 'Jake Myers', 'Kip Thorne', 'Thomas Tull'], 'Starring': ['Matthew McConaughey', 'Anne Hathaway', 'Jessica Chastain']}\nThe movie started out very good, then somewhere along the way got bogged down and ended up being a way to long of a movie.  ..  .  Boring and hard to watch. .\nTo long\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Duncan McNeill', 'Allan Kroeker', 'Patrick R. Norris', 'Peter Lauer', 'Jay Chandrasekhar', 'Frederick E.O. Toye', 'Jeremiah S. Chechik', 'Jason Ensler', 'Norman Buckley', 'Zachary Levi'], 'Producers': ['Not Specified'], 'Starring': ['Zachary Levi', 'Yvonne Strahovski', 'Joshua Gomez']}\nOk so I'm a little bias.but season one in my opinion was the best .there's chuck  buy more geek with no clue,then's there's casey the no nonsense spy all around tough guy. And last but not least Sarah yvonne strahovski super sexy tough and sweet at the same time  and she can also kick ass.\nYvonne strahovski\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nOk so I bias, but t I love this movie one laugh after another.And who can forget eddie and his rv.overall a funny funny movie.\nLove this movie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paolo Barzman', 'John Bell', 'Ian Toynton', 'Terry Ingram', 'Clay Borris', 'Milan Cheylov', 'Steve DiMarco', 'Ken Girotti', 'Julian Grant'], 'Producers': ['John Ryan'], 'Starring': ['Tia Carrere', 'Christien Anholt', 'Lindy Booth'], 'Studio': ['Lionsgate']}\nLove  the show..tia carrere is great\nLove the show\nRelic Hunter\nScience Fiction, Fantasy, Adventure, Action\n['History Professor Sydney Fox (Tia Carrere) moonlights as an intrepid explorer, crisscrossing the globe in pursuit of lost icons - from the four-thousand-year-old bowl of Siddhartha to a 1946 baseball glove with magical powers.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paolo Barzman', 'John Bell', 'Ian Toynton', 'Terry Ingram', 'Clay Borris', 'Milan Cheylov', 'Steve DiMarco', 'Ken Girotti', 'Julian Grant'], 'Producers': ['John Ryan'], 'Starring': ['Tia Carrere', 'Christien Anholt', 'Lindy Booth']}\nI like season 1 a little better. Still great\nLove the show\nBionic Woman\nSuspense, Drama, Action, Science Fiction\n[\"Struggling as a bartender and surrogate mom to her teenage sister, Jaime Sommers (Michelle Ryan, EastEnders) didn't think life could get much harder.  But when a devastating car accident leaves her at death's door, Jaime's only hope for survival is a cutting-edge, top-secret technology that comes at a hefty price.  With a whole new existence and a debt to re-pay, Jaime must figure out how to use her extraordinary abilities for good -- while weighing the personal sacrifices she will have to make.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Dinner', 'David Boyd', 'Steve Boyum', 'Alex Chapple', 'Gwyneth Horder-Payton', 'Tim Matheson', 'Jonas Pate', 'Paul Shapiro'], 'Producers': ['David Eick', 'Jason Smilovic']}\nLike the show the short time it was on the air.\nLiked the show",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Columbo - The Complete Second Season\nReview Date: 2012/02/16\nStore: Peter Falk  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', '\"Oh, there\\'s just one more thing….\" Everyone\\'s favorite cigar-chomping, trenchcoat-wearing Police Lieutenant is back on DVD asking all the right questions in all 8 thrilling episodes of the Complete Second Season of Columbo. Join five-time Emmy winner Peter Falk as wry and ruffled Lieutenant Columbo as he solves L.A.\\'s most puzzling crimes with his trademark wit and style. Along for the chase are a dazzling lineup of Hollywood\\'s brightest stars including Robert Culp, Valerie Harper, Dean Stockwell, Leonard Nimoy, Martin Landau, Marc Singer and more. In the smart, funny and exciting Second Season of Columbo, it\\'s no mystery to see why this is the DVD series that mystery lovers have been waiting for!', ']]>', 'Amazon.com', 'Armchair sleuths, get out your trenchcoats: Universal has released the sophomore season (1972-73) of the classic detective series', 'Columbo', \", starring Peter Falk as the sage but rumpled police lieutenant. As with the first season, there's plenty of star power in front of and behind the camera to abet Falk in these eight 90- and 120-minute episodes: John Cassavetes stars in the season premiere,\", 'Etude in Black', ', as a philandering symphony conductor, with Blythe Danner and Hollywood legend Myrna Loy in support; Oscar winner Ray Milland is a scheming orchid grower in \"The Greenhouse Jungle,\" co-starring Bradford Dillman and William Smith; Robert Culp and Dean Stockwell are a football team manager and owner, respectively, whose disagreements blossom into murder in \"The Most Crucial Game\"; and Jeanette Nolan offers stellar comic relief in \"Double Shock,\" which features Martin Landau as identical twins--one of whom has murdered their uncle. Performances by Richard Basehart, Laurence Harvey, Leonard Nimoy, Anne Francis, Anne Baxter, and Mel Ferrer also highlight the season; direction by small-screen stalwarts like Boris Sagal, Jeremy Paul Kagan, and Nicholas Colasanto (\"Coach\" on', 'Cheers', ') and scripts by Stephen Bochco also bring quality and style to the proceedings. Sadly, no extras are available in this five-disc set, but the stellar image and sound quality (and lack of commercials) should appeal to series fans and newcomers alike.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Mystery & Suspense', 'Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': 'Peter Falk', 'Language': 'Unqualified, Unknown (Dolby Digital 2.0), English (Dolby Digital 2.0 Mono)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 6 x 1 inches; 1.6 Ounces', 'Item model number': '2220369', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '10 hours and 41 minutes', 'Release date': 'March 8, 2005', 'Actors': 'Peter Falk', 'Subtitles': 'English, Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '4'}\nReview Text: To start off I love colu.mbo,and my dvd even though used it looked new and played great.overall a-1.this is one of my favo.rite seasons of columbo\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Airwolf: Season 2\nReview Date: 2012/08/10\nStore: Jan-Michael Vincent  (Actor),     Ernest Borgnine  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['Product Description', \"Get ready to take off for action and adventure as all 22 one-hour episodes of Airwolf Season Two soar on to a spectacular five-disc DVD set for the first time ever! Cruise the skies once again with Airwolf, the cutting-edge, high-tech surveillance and defense helicopter of the future, and Stringfellow Hawke (Jan-Michael Vincent), its reclusive renegade pilot, as they touch down on dangerous secret missions from Afghanistan to the jungles of Central America. From drug runners to dambreakers to demented businessmen, there's no one who can hide from the Airwolf team's high-tech gadgetry and fighting power. Co-starring Ernest Borgnine and Alex Cord, this suspenseful and daring Emmy-nominated series from TV producer Donald P. Bellisario (Magnum P.I., Quantum Leap) is sure to be a thrill-ride fans won't want to leave!\", 'Amazon.com', 'Jan-Michael Vincent stars in', 'Airwolf', \"as Stringfellow Hawke, who, with trusty sidekick Dominic Santini (Ernest Borgnine), embarks on perilous missions for a top secret agency known as The Firm, which in turn allows him fairly free rein as he searches for his long lost brother. Vincent, then 40 years old, was still a year or two away from ruining his career with substance abuse problems, but his work here is hardly of Emmy-winning caliber; indeed, it's a lazy performance pretty much devoid of emotional resonance. Borgnine, on the other hand, is always reliable, but even the former Oscar winner (in 1955, for\", 'Marty', \") can't overcome\", 'Airwolf', \"'s procession of cardboard characters (especially the villains) and credulity-challenging scripts, which find our heroes traveling to a Laotian prison camp, battling nuclear terrorists in California, rescuing the president of a South American banana republic, investigating a religious cult, fending off jungle cats kept on a Texas hunting ranch, and saving a country singer from the nefarious machinations of her manager-husband, among other silliness. In fairness, creator-executive producer Donald Bellisario (who also brought us\", 'Magnum, P.I.', ',', 'Quantum Leap', ', and', 'JAG', ') and his team make an effort to inject a human element; there\\'s an episode in which Dominic is arrested for murdering his faithless wife, and a couple that find the guilt-ridden Hawke searching for his brother, Saint John (pronounced \"Sinjin\"), who was presumed lost during the Vietnam War when Stringfellow left him in the jungle. What\\'s more, considering its relatively ancient pedigree, technology-wise, the effects work isn\\'t bad, and there are some cool moments when the Airwolf helicopter does what it does best (i.e., blow stuff up).', \"It's unlikely that anyone will fondly look back at\", 'Airwolf', \"as one of television's finest moments. That doesn't mean that this five-disc set containing all 22 episodes from the series' second season (1984-85) won't find an audience eager to re-live the adventures of a super high-tech helicopter and the renegade flyboy who pilots it (heck, even\", 'Knight Rider', \", featuring David Hasselhoff and his talking car, has its adherents). Nonetheless, low expectations are definitely in order for anyone who wasn't, say, ten years old when the show was on the air.But overall, the show lacks a strong vibe, a recognizable sense of style and pace to draw viewers in and make believers out of us. Not terrible, not terrific,\", 'Airwolf', 'is just sort of there.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Contributor': 'Jan-Michael Vincent, Ernest Borgnine', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified', 'Runtime': '17 hours and 42 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 1 inches; 10.4 Ounces', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Full Screen, Subtitled', 'Run time': '17 hours and 42 minutes', 'Release date': 'December 26, 2006', 'Actors': 'Jan-Michael Vincent, Ernest Borgnine', 'Subtitles': 'English', 'Studio': 'Universal Studios Home Entertainment', 'Number of discs': '5'}\nReview Text: Well I liked airwolf way back then,and I still like it even now.and I think adding jean bruce scott was a plus for the show.overall a very good show cannot say the same for season 4 when it had a new cast and network.thanks\nReview Title: great\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Haywire\nReview Date: 2012/10/14\nStore: Carano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Directed by Oscar® winner* Steven Soderbergh (', 'Contagion', '), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,', 'HAYWIRE', 'is explosive movie entertainment.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'MFR031398152156#VG', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: When I rented movie I was thinking maybe I wasted my money.but after I started watching it ,wow was I wrong.gina carano was smoking hot and acting was not that bad.very good fight scenes.plot a little weak,but still a good flick.\nReview Title: Worth watching\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Men at Work [DVD]\nReview Date: 2013/03/20\nStore: Charlie Sheen  (Actor),     Emilio Estevez  (Actor, Director, Writer)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, MGM Home Entertainment, All MGM Titles\nProduct Description: [\"It's up to a pair of trash-hauling heroes to clean up the city in this action-comedy starring real-life brothers Charlie Sheen and Emilio Estevez. Garbage men James (Estevez) and Carl (Sheen) dream of opening a surf shop, but often land in hot water due to their practical jokes. When they discover the body of a murdered politician on their route, they attempt to sniff out the killer themselves a bad idea that rapidly ensnares them in a toxic waste scandal. Soon, they're thrown headlong into a manic escapade involving a deranged veteran, an attractive campaign manager, a kidnapped pizza deliveryman and a greedy polluter who wants them hauledoff to a landfill for good!\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Contributor': 'Hawk Wolinski, Charlie Sheen, Keith David, Emilio Estevez, John Getz, John Lavachielli, Leslie Hope, Tommy Hinkley, John Putch, Geoffrey Blake, Dean Cameron, Cameron DyeHawk Wolinski, Charlie Sheen, Keith David, Emilio Estevez, John Getz, John Lavachielli, Leslie Hope, Tommy Hinkley, John Putch, Geoffrey Blake, Dean Cameron, Cameron Dye  See more', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Director': 'Emilio Estevez', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'June 4, 2002', 'Actors': 'Charlie Sheen, Emilio Estevez, Leslie Hope, Keith David, Dean Cameron', 'Subtitles': 'English, Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Emilio Estevez', 'Number of discs': '1'}\nReview Text: Ok this movie would not win a oscar,but it is a very funny movie that will make a bad day not so bad after all.the two brothers deliver good laughs,but the real scene stealer was keith.\nReview Title: Great\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Vampire Diaries: Season 5\nReview Date: 2014/10/18\nStore: Nina Dobrev  (Actor),     Paul Wesley  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Mystery & Suspense\nProduct Description: ['The Vampire Diaries: The Complete Fifth Season (DVD)', 'Get ready for more epic suspense, romance and a bloody good thrill ride as hit series The Vampire Diaries continues for a fifth season. In the shocking season four finale, Elena (Nina Dobrev) forced the cure to vampirism down the throat of her doppelganger, Katherine Pierce (also played by Dobrev), effectively turning her back into a human. Elena, free of her sire bond to Damon (Ian Somerhalder), professes her true love to him with no strings attached … as her first love in Mystic Falls, Stefan (Paul Wesley), listened in the next room. Stefan’s plans for the immortal Silas took an unexpected turn when Silas reappeared in his true form — as Stefan’s doppelganger — stabbing the real Stefan in the stomach and throwing him into the quarry to suffer for eternity. The hit series enters its fifth season with some characters headed off to college, Katherine trying to survive as a human and a shocking Salvatore secret.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Contributor': 'Kevin Williamson, Paul Wesley, Leslie Morgenstein, L.J. Smith, Julie Plec, Ian Somerhalder, Michael Trevino, Joseph Morgan, Zach Roerig, Caroline Dries, Steven R. McQueen, Candice King, Nina Dobrev, Kat GrahamKevin Williamson, Paul Wesley, Leslie Morgenstein, L.J. Smith, Julie Plec, Ian Somerhalder, Michael Trevino, Joseph Morgan, Zach Roerig, Caroline Dries, Steven R. McQueen, Candice King, Nina Dobrev, Kat Graham  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 7.04 Ounces', 'Item model number': '29094288', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'September 9, 2014', 'Actors': 'Nina Dobrev, Paul Wesley, Ian Somerhalder, Steven R. McQueen, Kat Graham', 'Subtitles': 'Portuguese, Spanish, Thai, French', 'Producers': 'Kevin Williamson, Julie Plec, Leslie Morgenstein, Caroline Dries', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '5'}\nReview Text: I enjoyed season 5 so much I ordered the dvd.\nReview Title: very good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pretty Little Liars: Season 4\nReview Date: 2015/01/16\nStore: Troian Bellisario  (Actor),     Ashley Benson  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Pretty Little Liars: The Complete Fourth Season (DVD)', 'Season four begins in moments following the shocking season three finale & the girls strive to make sense of the mysterious \"Red Coat\" & what plans he or she may have in store for them.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Troian Bellisario, Leslie Morgenstein, Joseph Dougherty, Shay Mitchell, Laura Leighton, Janel Parrish, Lucy Hale, Ashley Benson, Sasha Pieterse, Tyler Blackburn, Ian Harding, Sara Shepard, Oliver Goldstick, I. Marlene KingTroian Bellisario, Leslie Morgenstein, Joseph Dougherty, Shay Mitchell, Laura Leighton, Janel Parrish, Lucy Hale, Ashley Benson, Sasha Pieterse, Tyler Blackburn, Ian Harding, Sara Shepard, Oliver Goldstick, I. Marlene King   See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 7.2 Ounces', 'Item model number': 'D435546D', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '16 hours and 3 minutes', 'Release date': 'June 3, 2014', 'Actors': 'Troian Bellisario, Ashley Benson, Tyler Blackburn, Lucy Hale, Ian Harding', 'Producers': 'I. Marlene King, Oliver Goldstick, Leslie Morgenstein, Joseph Dougherty', 'Studio': 'Studio Distribution Services', 'Number of discs': '5'}\nReview Text: Started watching casually season 3 next thing you know I am hooked on the show keeps you thinking you got everything figured out. Then maybe not\nReview Title: hooked\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Christmas Caper\nReview Date: 2016/10/07\nStore: Shannen Doherty  (Actor),     Ty Olsen  (Actor),     David Winkler  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['After a heist goes bad, professional thief Cate Dove (Shannen Doherty) hides out in her hometown of Comfort, Connecticut when her sister, stuck on an island by a tropical storm, asks her to take care of her two children Parker and Annie until she can get back for Christmas. Not the most nurturing or sentimental of people, Cate spends most of her time scouting out the cozy suburban neighborhood with plans for another big score, as well as planning on how to get back at her deceitful partner Clive (Conrad Coates). As Christmas gets closer, however, Cate gets used to small town life, and she begins to realize her family, friends, and hunky local sheriff Hank (Ty Olsson) are making her rethink her priorities, and a crime-free Christmas in Comfort might be just what she needs this year.']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.75:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FLP-12469', 'Director': 'David Winkler', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 28 minutes', 'Release date': 'October 28, 2008', 'Actors': 'Shannen Doherty, Ty Olsen', 'Subtitles': 'Spanish', 'Language': 'Unqualified', 'Studio': 'Alchemy / Millennium', 'Number of discs': '1'}\nReview Text: Cute Christmas movie.but not a lot different than others. I just liked the premise of the movie, also I like  shannen doherty.\nReview Title: Cute\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/11/14\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jay Roach'], 'Producers': ['Jane Rosenthal', 'Nancy Tenenbaum', 'Jay Roach', 'Robert De Niro'], 'Starring': ['Robert De Niro', 'Ben Stiller', 'Blythe Danner'], 'Studio': ['DREAMWORKS SKG']}\nReview Text: Well I am bias I love this film very good film great cast funny overall a 4 star...\nReview Title: Love it\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 400 Days\nReview Date: 2016/11/14\nStore: Brandon Routh  (Actor),     Caity Lotz  (Actor),     Matt Osterman  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Mystery & Thrillers\nProduct Description: [\"400 Days is a sci-fi thriller centering on four astronauts who are sent on a simulated mission to a distant planet to test the psychological effects of deep space travel. Locked away for 400 days, the crew's mental state begins to deteriorate when they lose all communication with the outside world. Forced to exit the ship, they discover that this mission may not have been a simulation after all. The film stars Brandon Routh (Superman Returns), Caity Lotz (The Machine, Arrow), Dane Cook (My Best Friend's Girl, Mr. Brooks), Ben Feldman (Cloverfield, Friday the 13th), Tom Cavanagh (Ed, The Flash), and Grant Bowler (Defiance).\", ']]>']\nAverage Rating: 3.6\nProduct Details: {'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35302756', 'Director': 'Matt Osterman', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 31 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Brandon Routh, Caity Lotz, Ben Feldman, Grant Bowler, Tom Cavanagh', 'Producers': 'Gabriel Cowan, John Suits', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Matt Osterman', 'Number of discs': '1'}\nReview Text: Started with promise but about half way thru dissolved into one mired mess of a movie with no clear ending to movie.\nReview Title: Started with promise\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/12/09\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Nolan'], 'Producers': ['Emma Thomas', 'Christopher Nolan', 'Lynda Obst', 'Jordan Goldberg', 'Jake Myers', 'Kip Thorne', 'Thomas Tull'], 'Starring': ['Matthew McConaughey', 'Anne Hathaway', 'Jessica Chastain']}\nReview Text: The movie started out very good, then somewhere along the way got bogged down and ended up being a way to long of a movie.  ..  .  Boring and hard to watch. .\nReview Title: To long\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/01/07\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Duncan McNeill', 'Allan Kroeker', 'Patrick R. Norris', 'Peter Lauer', 'Jay Chandrasekhar', 'Frederick E.O. Toye', 'Jeremiah S. Chechik', 'Jason Ensler', 'Norman Buckley', 'Zachary Levi'], 'Producers': ['Not Specified'], 'Starring': ['Zachary Levi', 'Yvonne Strahovski', 'Joshua Gomez']}\nReview Text: Ok so I'm a little bias.but season one in my opinion was the best .there's chuck  buy more geek with no clue,then's there's casey the no nonsense spy all around tough guy. And last but not least Sarah yvonne strahovski super sexy tough and sweet at the same time  and she can also kick ass.\nReview Title: Yvonne strahovski\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/12/18\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nReview Text: Ok so I bias, but t I love this movie one laugh after another.And who can forget eddie and his rv.overall a funny funny movie.\nReview Title: Love this movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/06/30\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paolo Barzman', 'John Bell', 'Ian Toynton', 'Terry Ingram', 'Clay Borris', 'Milan Cheylov', 'Steve DiMarco', 'Ken Girotti', 'Julian Grant'], 'Producers': ['John Ryan'], 'Starring': ['Tia Carrere', 'Christien Anholt', 'Lindy Booth'], 'Studio': ['Lionsgate']}\nReview Text: Love  the show..tia carrere is great\nReview Title: Love the show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Relic Hunter\nReview Date: 2018/06/30\nCategories: Science Fiction, Fantasy, Adventure, Action\nProduct Description: ['History Professor Sydney Fox (Tia Carrere) moonlights as an intrepid explorer, crisscrossing the globe in pursuit of lost icons - from the four-thousand-year-old bowl of Siddhartha to a 1946 baseball glove with magical powers.']\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Paolo Barzman', 'John Bell', 'Ian Toynton', 'Terry Ingram', 'Clay Borris', 'Milan Cheylov', 'Steve DiMarco', 'Ken Girotti', 'Julian Grant'], 'Producers': ['John Ryan'], 'Starring': ['Tia Carrere', 'Christien Anholt', 'Lindy Booth']}\nReview Text: I like season 1 a little better. Still great\nReview Title: Love the show\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bionic Woman\nReview Date: 2018/08/18\nCategories: Suspense, Drama, Action, Science Fiction\nProduct Description: [\"Struggling as a bartender and surrogate mom to her teenage sister, Jaime Sommers (Michelle Ryan, EastEnders) didn't think life could get much harder.  But when a devastating car accident leaves her at death's door, Jaime's only hope for survival is a cutting-edge, top-secret technology that comes at a hefty price.  With a whole new existence and a debt to re-pay, Jaime must figure out how to use her extraordinary abilities for good -- while weighing the personal sacrifices she will have to make.\"]\nAverage Rating: 4.3\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Dinner', 'David Boyd', 'Steve Boyum', 'Alex Chapple', 'Gwyneth Horder-Payton', 'Tim Matheson', 'Jonas Pate', 'Paul Shapiro'], 'Producers': ['David Eick', 'Jason Smilovic']}\nReview Text: Like the show the short time it was on the air.\nReview Title: Liked the show\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Purchase Preferences and Patterns:**\n\n- **Genre Preferences:** Strong inclination towards action, adventure, and mystery genres, with significant purchases of series and movies featuring strong lead characters and thrillers.\n  \n- **TV Series Enthusiast:** Frequent purchases of complete seasons (notably crime and adventure series) showcasing a preference for engaging TV narratives with suspenseful plots and character-driven storytelling.\n\n- **Actor Affinity:** Regular purchases feature notable actors in lead roles, particularly those associated with classic and cult series, signaling a preference for both established and nostalgic favorites.\n\n- **Quality Rating:** Consistently high ratings (4.0 and above) suggest a discerning taste in entertainment, favoring well-reviewed titles that engage both emotionally and intellectually.\n\n- **Seasonal Viewing:** Engagement with holiday-themed titles aligns with occasional festive viewing habits, particularly during winter months.\n\n- **Rental to Purchase Transition:** Notable shift from rentals to purchasing DVDs signifies growing investment in particular series and titles that resonate strongly, indicating a desire to curate a personal collection.\n\n- **Nostalgic Appeal:** Revisiting classic or popular older series demonstrates a preference for familiar stories and characters, reflecting a mix of nostalgia and continued interest in quality storytelling.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Love the avengers",
    "text": "Always have loved the avengers.",
    "images": [],
    "asin": "B01HOQ3EJG",
    "parent_asin": "B01HOQ3EJG",
    "user_id": "AHVZ5DAFBNQRU3JE6OXUOCXFSM6A",
    "timestamp": "2019-06-18 18:16:21.080000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 804,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/36c8eb76ef9f84551b95d3b0d8368e7265fa31df5739b62e33d23236dda2f345._RI_SX360_FMwebp_.png",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/36c8eb76ef9f84551b95d3b0d8368e7265fa31df5739b62e33d23236dda2f345._RI_SX480_FMwebp_.png",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/36c8eb76ef9f84551b95d3b0d8368e7265fa31df5739b62e33d23236dda2f345._RI_SX720_FMwebp_.png",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/36c8eb76ef9f84551b95d3b0d8368e7265fa31df5739b62e33d23236dda2f345._RI_SX1080_FMwebp_.png",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/36c8eb76ef9f84551b95d3b0d8368e7265fa31df5739b62e33d23236dda2f345._RI_SX1440_FMwebp_.png",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/36c8eb76ef9f84551b95d3b0d8368e7265fa31df5739b62e33d23236dda2f345._RI_SX1920_FMwebp_.png",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "alcohol use",
        "smoking"
      ],
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Roy Baker"
      ],
      "Producers": [
        "Albert Fennell",
        "Brian Clemens",
        "Julian Wintle"
      ],
      "Starring": [
        "Patrick Macnee",
        "Diana Rigg"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}