{
  "user_id": "AE62UN4Q5JNY6V3J6BOXSW4XC3KA",
  "summary": "=== Purchase Information ===\nProduct Title: Singin' in the Rain\nReview Date: 2014/11/16\nStore: Gene Kelly  (Actor, Director),     Donald O'Connor  (Actor),     Stanley Donen  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: [\"Silent movies are giving way to talking pictures - and a hoofer-turned-matinee idol (Gene Kelly) is caught in the bumpy transition, as are his buddy (Donald, O'Connor), a prospective ladylove (Debbie Reynolds) and shrewish costar (Jean Hagen). Rediscover the musical masterpiece, Singin' In The Rain, in dazzling, restored high definition, featuring an all-new documentary special feature that salutes not just this all-time favorite but also the musical legacy of its producer, songwriter Arthur Freed.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Special Edition', 'Contributor': \"Rita Moreno, Gene Kelly, Jean Hagen, Adolph Green, Millard Mitchell, Stanley Donen, Arthur Freed, Donald O'Connor, Betty Comden, Cyd Charisse, Debbie ReynoldsRita Moreno, Gene Kelly, Jean Hagen, Adolph Green, Millard Mitchell, Stanley Donen, Arthur Freed, Donald O'Connor, Betty Comden, Cyd Charisse, Debbie Reynolds  See more\", 'Language': 'English', 'Runtime': '1 hour and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '883929266777', 'Director': 'Stanley Donen, Gene Kelly', 'Media Format': 'Multiple Formats, Color, NTSC, Special Edition', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 2, 2012', 'Actors': \"Gene Kelly, Donald O'Connor, Debbie Reynolds, Jean Hagen, Millard Mitchell\", 'Producers': 'Arthur Freed', 'Studio': 'WarnerBrothers', 'Writers': 'Betty Comden, Adolph Green', 'Number of discs': '2'}\nReview Text: Great product!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Carol\nReview Date: 2015/06/05\nStore: George C. Scott  (Actor),     David Warner  (Actor),     Clive Donner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: ['Christmas elicits nothing more than \"Bah, humbug!\" from Ebenezer Scrooge (Scott), a miser whose sole pursuit of financial success has left him a bitter and lonely old man. But a Christmas Eve visit from the Ghosts of Christmas Past, Present and Future ultimately teaches him to open his heart to the spirit of Christmas and to the joys of friends and family.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family Entertainment', 'Format': 'Color, NTSC', 'Contributor': 'Angela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy GutteridgeAngela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy Gutteridge   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '24543027201', 'Director': 'Clive Donner', 'Media Format': 'Color, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 5, 1999', 'Actors': 'George C. Scott, David Warner, Susannah York, Anthony Walters, Frank Finlay', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': '20TH CENTURY STUDIOS', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Our favorite Christmas movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: It's a Wonderful Life [Blu-ray]\nReview Date: 2015/06/05\nStore: James Stewart  (Actor),     Donna Reed  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Ruined by a miser on Christmas Eve, a suicidal family man sees life anew thanks to his guardian angel.', 'Amazon.com', \"It's a Wonderful Life\", 'Now perhaps the most beloved American film,', \"It's a Wonderful Life\", \"was largely forgotten for years, due to a copyright quirk. Only in the late 1970s did it find its audience through repeated TV showings. Frank Capra's masterwork deserves its status as a feel-good communal event, but it is also one of the most fascinating films in the American cinema, a multilayered work of Dickensian density. George Bailey (played superbly by James Stewart) grows up in the small town of Bedford Falls, dreaming dreams of adventure and travel, but circumstances conspire to keep him enslaved to his home turf. Frustrated by his life, and haunted by an impending scandal, George prepares to commit suicide on Christmas Eve. A heavenly messenger (Henry Travers) arrives to show him a vision: what the world would have been like if George had never been born. The sequence is a vivid depiction of the American Dream gone bad, and probably the wildest thing Capra ever shot (the director's optimistic vision may have darkened during his experiences making military films in World War II). Capra's triumph is to acknowledge the difficulties and disappointments of life, while affirming--in the teary-eyed final reel--his cherished values of friendship and individual achievement.\", \"It's a Wonderful Life\", 'was not a big hit on its initial release, and it won no Oscars (Capra and Stewart were nominated); but it continues to weave a special magic.', '--Robert Horton']\nAverage Rating: 4.9\nProduct Details: {'Format': 'Blu-ray, Black & White, Color, Original recording remastered, Subtitled, Dubbed', 'Contributor': 'Donna Reed, Henry Travers, Gloria Grahame, Frank Capra, Ward Bond, Lionel Barrymore, Thomas Mitchell, James StewartDonna Reed, Henry Travers, Gloria Grahame, Frank Capra, Ward Bond, Lionel Barrymore, Thomas Mitchell, James Stewart  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '97360720945', 'Director': 'Frank Capra', 'Media Format': 'Blu-ray, Black & White, Color, Original recording remastered, Subtitled, Dubbed', 'Run time': '2 hours and 11 minutes', 'Release date': 'June 28, 2016', 'Actors': 'James Stewart, Donna Reed, Henry Travers, Gloria Grahame, Lionel Barrymore', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nReview Text: We watch it every year!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Searchers [Blu-ray]\nReview Date: 2015/06/05\nStore: John Wayne  (Actor),     Ward Bond  (Actor)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Westerns\nProduct Description: ['Product Description', 'Searchers, The (BD)', ']]>', 'Amazon.com', \"A favorite film of some of the world's greatest filmmakers, including Martin Scorsese and Steven Spielberg, John Ford's\", 'The Searchers', \"has earned its place in the legacy of great American films for a variety of reasons. Perhaps most notably, it's the definitive role for John Wayne as an icon of the classic Western--the hero (or antihero) who must stand alone according to the unwritten code of the West. The story takes place in Texas in 1868; Wayne plays Ethan Edwards, a Confederate veteran who visits his brother and sister-in-law at their ranch and is horrified when they are killed by marauding Comanches. Ethan's search for a surviving niece (played by young Natalie Wood) becomes an all-consuming obsession. With the help of a family friend (Jeffrey Hunter) who is himself part Cherokee, Ethan hits the trail on a five-year quest for revenge. At the peak of his masterful talent, director Ford crafts this classic tale as an embittered examination of racism and blind hatred, provoking Wayne to give one of the best performances of his career. As with many of Ford's classic Westerns,\", 'The Searchers', 'must contend with revisionism in its stereotypical treatment of \"savage\" Native Americans, and the film\\'s visual beauty (the final shot is one of the great images in all of Western culture) is compromised by some uneven performances and stilted dialogue. Still, this is undeniably one of the greatest Westerns ever made.', '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Westerns', 'Format': 'Color, NTSC, Subtitled, Widescreen, Blu-ray, Dubbed, Closed-captioned', 'Contributor': 'Harry Carey Jr., Nacho Galindo, Winton Hoch, Ward Bond, Peter Mamakos, Mae Marsh, Dorothy Jordan, Walter Coy, Robert Lyden, Henry Brandon, Vera Miles, Antonio Moreno, Ken Curtis, John Qualen, John Wayne, Chief Thundercloud, Jeffrey Hunter, Stan Jones, Cliff Lyons, Olive Carey, Ruth CliffordHarry Carey Jr., Nacho Galindo, Winton Hoch, Ward Bond, Peter Mamakos, Mae Marsh, Dorothy Jordan, Walter Coy, Robert Lyden, Henry Brandon, Vera Miles, Antonio Moreno, Ken Curtis, John Qualen, John Wayne, Chief Thundercloud, Jeffrey Hunter, Stan Jones, Cliff Lyons, Oli…   See more', 'Initial release date': '2006-10-31', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.5 x 5.25 x 0.3 inches; 1.6 Ounces', 'Item model number': '111532', 'Media Format': 'Color, NTSC, Subtitled, Widescreen, Blu-ray, Dubbed, Closed-captioned', 'Run time': '1 hour and 59 minutes', 'Release date': 'October 31, 2006', 'Actors': 'John Wayne, Ward Bond, Jeffrey Hunter, Henry Brandon, Harry Carey Jr.', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My favorite western.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Sky [DVD]\nReview Date: 2015/06/05\nStore: Jessica Lange  (Actor),     Tommy Lee Jones  (Actor),     Tony Richardson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"It was a time when blond bombshells splashed Life covers and A-bomb tests mushroomed in the desert. The older generation believed in their government, while younger people protested against it. And Blue Sky captures it all! Politically charged and erotically explosive, this highly combustible film features powerful performances by Jessica Lange (Rob Roy) in an Academy AwardÂ(r)-winning* role, and dynamic OscarÂ(r) winner** Tommy Lee Jones (Men in Black). Hard-working, mild-tempered Army scientist Hank Marshall (Jones) has his hands full with explosive nuclear reactors and the equally volatile Carly (Lange), his beautifully spirited and emotionally vulnerable wife. While he's conducting tests in Nevada, she succumbs to the advances of his superior officer! But her infidelity is not the only dilemma the Marshalls have to face. When a deadly military cover-up puts Hank in jeopardy, it's up to Carly to muster the courage and strength tosave the man she loves! *1994: Actress **1993: Supporting Actor, The Fugitive\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Military & War', 'Format': 'Closed-captioned, Color, Anamorphic, Widescreen, NTSC, DVD', 'Contributor': \"Annie Ross, Tony Richardson, Jessica Lange, Mitch Ryan, Anthony Rene Jones, Dale Dye, Timothy Scott, Amy Locane, Jerry Leichtling, Rama Laurie Stagner, Powers Boothe, Carrie Snodgress, Tommy Lee Jones, Anna Klemp, Chris O'Donnell, Arlene SarnerAnnie Ross, Tony Richardson, Jessica Lange, Mitch Ryan, Anthony Rene Jones, Dale Dye, Timothy Scott, Amy Locane, Jerry Leichtling, Rama Laurie Stagner, Powers Boothe, Carrie Snodgress, Tommy Lee Jones, Anna Klemp, Chris O'Donnell, Arlene Sarner   See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Tony Richardson', 'Media Format': 'Closed-captioned, Color, Anamorphic, Widescreen, NTSC, DVD', 'Run time': '1 hour and 41 minutes', 'Release date': 'February 6, 2001', 'Actors': 'Jessica Lange, Tommy Lee Jones, Powers Boothe, Carrie Snodgress, Amy Locane', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Arlene Sarner, Jerry Leichtling, Rama Laurie Stagner', 'Number of discs': '1'}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sister Act\nReview Date: 2015/06/05\nStore: Whoopi Goldberg  (Actor),     Maggie Smith  (Actor),     Adam Greenberg  (Director),     Emile Ardolino  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\nProduct Description: [\"Relive all the fun, laughter, and irresistible music of SISTER ACT -- the inspired comedy hit that packed pews everywhere! Whoopi Goldberg stars as a sassy, low-rent lounge singer forced to hide out from the mob in the last place on earth anyone would look for her -- a convent. While she's there, her irreverent behavior attracts a flock of faithful followers and turns the nuns' tone-deaf choir into a soulful chorus of swingin', singin' sisters. But when the group earns rave reviews, her sudden celebrity jeopardizes her hidden identity. Harvey Keitel and Kathy Najimy join a heavenly cast in this habit-forming comedy bursting with '60s Motown hits.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Closed-captioned, Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Richard Portnow, Joseph Maher, Adam Greenberg, Jim Beaver, Charlotte Crossley, Joseph Howard, Rose Parenti, Maggie Smith, Whoopi Goldberg, Kathy Najimy, Jenifer Lewis, Robert Miranda, Bill Nunn, Wendy Makkena, Mary Wickes, Harvey Keitel, Emile Ardolino, Ellen AlbertiniRichard Portnow, Joseph Maher, Adam Greenberg, Jim Beaver, Charlotte Crossley, Joseph Howard, Rose Parenti, Maggie Smith, Whoopi Goldberg, Kathy Najimy, Jenifer Lewis, Robert Miranda, Bill Nunn, Wendy Makkena, Mary Wickes, Harvey Keitel, Emile Ardolino, Ellen Alber…   See more', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2259169', 'Director': 'Adam Greenberg, Emile Ardolino', 'Media Format': 'Closed-captioned, Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'November 6, 2001', 'Actors': 'Whoopi Goldberg, Maggie Smith, Kathy Najimy, Wendy Makkena, Mary Wickes', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Joseph Howard', 'Number of discs': '1'}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Waltons: Season 1\nReview Date: 2015/06/05\nStore: Richard Thomas  (Actor),     Ralph Waite  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Waltons, The: The Complete First Season (Repackage/Stack Hub)', 'From the dire days of the Great Depression through the trying times of World War II, an American family living in Virginia’s Blue Ridge Mountains struggles to remain together in the wholesome saga The Waltons, based on the life of series creator Earl Hamner Jr. (Falcon Crest). First released in 1972, this inspiring series is seen through the eyes of John-Boy (Richard Thomas), the eldest of seven children in a clan that ekes out a meager existence from the family lumber mill. In season one, John-Boy saves his father’s life, a wandering minstrel almost corrupts young Mary Ellen, beloved mother Olivia copes with polio and the strong Walton family endures a variety of other trials. Among the guest stars in the first season of this acclaimed drama series are Ned Beatty, Sissy Spacek, Denver Pyle, John Ritter and Gregory Sierra.', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Lee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard ThomasLee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard Thomas  See more', 'Language': 'English (Mono)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '1.1 x 5.3 x 7.5 inches; 5.6 Ounces', 'Item model number': '8.83929E+11', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '20 hours and 49 minutes', 'Release date': 'April 3, 2012', 'Actors': 'Richard Thomas, Ralph Waite, Michael Learned, Will Geer, Ellen Corby', 'Subtitles': 'French', 'Producers': 'Lee Rich', 'Studio': 'Studio Distribution Services', 'Number of discs': '5'}\nReview Text: My daughter loved it!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Uncle Buck : Widescreen Edition\nReview Date: 2015/06/05\nStore: John Candy  (Actor),     Jean Louisa Kelly  (Actor),     John Hughes  (Director, Producer, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'John Candy stars in Uncle Buck, the outrageous comedy written and directed by John Hughes (The Breakfast Club). As an idle, good-natured bachelor, Uncle Buck is the last person you would think of to watch the kids. However, during a family crisis, he is suddenly left in charge of his nephew and nieces. Unaccustomed to suburban life, fun-loving Uncle Buck soon charms his younger relatives Miles and Maizy with his hefty cooking and his new way of doing the laundry. His carefree style does not impress everyone though - especially his rebellious teenage niece, Tia, and his impatient girlfriend, Chanice. With a little bit of luck and a lot of love, Uncle Buck manages to surprise everyone in this heartwarming family comedy.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Set Contains:', 'The DVD release has a widescreen presentation, production notes, biographies, Dolby sound, optional Spanish and French soundtracks.', '--Tom KeoghM']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Jay Underwood, Garrett M. Brown, Jean Louisa Kelly, Macaulay Culkin, Amy Madigan, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, Gaby HoffmanJay Underwood, Garrett M. Brown, Jean Louisa Kelly, Macaulay Culkin, Amy Madigan, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, Gaby Hoffman  See more', 'Initial release date': '1998-06-30', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': '61020317', 'Director': 'John Hughes', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 30, 1998', 'Actors': 'John Candy, Jean Louisa Kelly, Macaulay Culkin, Gaby Hoffman, Amy Madigan', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'John Hughes, Tom Jacobson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr. Quinn, Medicine Woman: Season 1 [DVD]\nReview Date: 2015/06/05\nStore: Jane Seymour  (Actor),     Joe Lando  (Actor),     A&E Entertainment  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, A&E Home Video, All A&E Titles\nProduct Description: ['From the moment that Dr. Michaela \"Mike\" Quinn (Jane Seymour) first stepped from the stagecoach into the mud of Colorado Springs, TV audiences had a new destination on Saturday nights. DR. QUINN, MEDICINE WOMAN won popular and critical acclaim including five Emmy® Awards with its tales of courage, conviction and romance on the American frontier.This family-favorite set includes all 17 episodes from the first season, plus exclusive bonus content. Old fans will delight in revisiting favorite moments, like Dr. Mike\\'s first kiss from Sully (Joe Lando) and General Custer\\'s visit to town, while newcomers will be captivated by the gripping, family-friendly stories and painstaking authenticity.Return to Colorado Springs for the unforgettable first year of DR. QUINN, MEDICINE WOMAN.BONUS FEATURES: Jane Seymour: Hollywood s English Rose Episode of A&E s Award-Winning Series Biography; Interactive Tour of 19th Century Colorado Springs; Series Awards and Honors; Cast Biographies and Filmographies; Photo Gallery']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Joe Lando, Jane Seymour, A&E Entertainment', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1 x 5.4 x 7.5 inches; 6.4 Ounces', 'Item model number': '16100054', 'Director': 'A&E Entertainment', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '14 hours', 'Release date': 'March 29, 2011', 'Actors': 'Jane Seymour, Joe Lando', 'Studio': 'A&E Home Video', 'Number of discs': '5'}\nReview Text: My daughter loved it!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Homecoming: A Christmas Story\nReview Date: 2015/06/05\nStore: Patricia Neal  (Actor),     Richard Thomas  (Actor),     Fielder Cook  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: ['Product Description', 'Set on a Depression Christmas Eve in 1933, this heart-tugging story centers around the Walton. They’re a rural American family preparing to celebrate Christmas together. Though times are tough, love and sharing are abundant in this family. An inspiring tale of love, hope and spirit, this deeply moving story goes far beyond the boundaries of time and place to reach out and touch everyone, everywhere.', 'Amazon.com', 'A true television classic,', 'The Homecoming', \"was the second movie (after 1963's\", \"Spencer's Mountain\", \") based on Earl Hamner's autobiographical writings about love, pride, faith, and survival in rural America during the Great Depression.\", 'The Homecoming', \"introduced the Walton family, a 1930s mountain clan living a hardscrabble existence that forces patriarch John Walton (Andrew Duggan) to seek work, far from home, in the city. When John fails to return home, as promised, on Christmas Eve, his iron-willed wife Olivia (Patricia Neal) keeps a lid on their children's worry. Oldest son John-Boy (Richard Thomas), who privately dreams of becoming a writer but worries about disappointing his parents, is dispatched to find his dad. Graceful yet harder-edged than the subsequent TV series\", 'The Waltons', '(which recast several characters and ran for nine years),', 'The Homecoming', 'reveals, albeit understatedly, much about the pain of poverty even as the family draws strength and closeness through endurance.', '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled, Full Screen', 'Contributor': 'Lee Rich, Marjorie Fowler, Robert L. Jacks, Ellen Corby, Edgar Bergen, Cleavon Little, Judy Norton, Woodrow Parfrey, Mary Beth McDonough, Gene Fowler Jr., Fielder Cook, Merv Adelson, Andrew Duggan, Earl Rath, William Windom, Earl Hamner Jr., Patricia Neal, Dorothy Stickney, Josephine Hutchinson, Richard ThomasLee Rich, Marjorie Fowler, Robert L. Jacks, Ellen Corby, Edgar Bergen, Cleavon Little, Judy Norton, Woodrow Parfrey, Mary Beth McDonough, Gene Fowler Jr., Fielder Cook, Merv Adelson, Andrew Duggan, Earl Rath, William Windom, Earl Hamner Jr., Patricia Neal, Doroth…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.71 inches; 1.69 Ounces', 'Item model number': 'D843304D', 'Director': 'Fielder Cook', 'Media Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 23, 2003', 'Actors': 'Patricia Neal, Richard Thomas, Edgar Bergen, Ellen Corby, Cleavon Little', 'Producers': 'Lee Rich, Merv Adelson, Robert L. Jacks', 'Studio': 'Paramount', 'Writers': 'Earl Hamner Jr.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My daughter loved it!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/06/05\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Davis'], 'Producers': ['Arnold Kopelson', 'Peter Macgregor-Scott'], 'Starring': ['Harrison Ford', 'Tommy Lee Jones', 'Sela Ward'], 'Studio': ['Warner Bros. Domestic Televisi']}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Rocketeer\nReview Date: 2016/08/07\nStore: Alan Arkin  (Actor),     Bill Campbell  (Actor),     Hiro Narita  (Director),     Joe Johnston  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['The discovery of a top-secret jetpack hurls test pilot Cliff Secord into a daring adventure of mystery, suspense, and intrigue! Cliff encounters an assortment of ruthless villains, led by a Hollywood screen star who\\'s a secret Nazi spy (Timothy Dalton). With the help of his actress girlfriend, the young pilot battles enormous odds to defeat his foes who are anxious to use the device in an evil plan to rule the world! The dangerous mission transforms the ordinary young man into an extraordinary hero!|The pilots\\' hangout in the film, the Bulldog Cafe, is based on an actual 1920\\'s Los Angeles restaurant.|Timothy Dalton\\'s character, Neville Sinclair, is loosely based on actor Errol Flynn, who was rumored to be a Nazi spy.|In 1938 a young air racing pilot, Cliff Secord, and his partner, Peevy, discover a secret rocket pack that enables a man to fly. They quickly become entangled in international intrigue in their attempts to keep the device away from Nazi spies and other villains, including Hollywood matinee idol Neville Sinclair. With the help of his actress girlfriend, Cliff, dubbed \"The Rocketeer\" by the press, embarks on a mission that could alter the course of history and hmake him a true hero.|The movie was based on a comic character created by Dave Stevens.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'ACTION, Action/Adventure, LIVE', 'Format': 'Color, Dolby, NTSC, Closed-captioned, Widescreen, Letterboxed, Multiple Formats', 'Contributor': \"William Sanderson, Hiro Narita, Jennifer Connelly, Paul DeMeo, Jon Polito, Danny Bilson, Don Pugsley, William Dear, Ed Lauter, Bill Campbell, Nada Despotovich, Robert Guy Miranda, Terry O'Quinn, Timothy Dalton, Eddie Jones, Joe Johnston, James Handy, Alan Arkin, Paul SorvinoWilliam Sanderson, Hiro Narita, Jennifer Connelly, Paul DeMeo, Jon Polito, Danny Bilson, Don Pugsley, William Dear, Ed Lauter, Bill Campbell, Nada Despotovich, Robert Guy Miranda, Terry O'Quinn, Timothy Dalton, Eddie Jones, Joe Johnston, James Handy, Alan Arkin, Paul Sorvino  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1750100', 'Director': 'Hiro Narita, Joe Johnston', 'Media Format': 'Color, Dolby, NTSC, Closed-captioned, Widescreen, Letterboxed, Multiple Formats', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 17, 1999', 'Actors': 'Alan Arkin, Bill Campbell, Jennifer Connelly, Timothy Dalton, Nada Despotovich', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Danny Bilson, Paul DeMeo, William Dear', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Still a wonderful, fun movie!\nReview Title: Movie review\nRating: 5.0\n--------------------------------------------------",
  "reference": "Singin' in the Rain\nGene Kelly  (Actor, Director),     Donald O'Connor  (Actor),     Stanley Donen  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n[\"Silent movies are giving way to talking pictures - and a hoofer-turned-matinee idol (Gene Kelly) is caught in the bumpy transition, as are his buddy (Donald, O'Connor), a prospective ladylove (Debbie Reynolds) and shrewish costar (Jean Hagen). Rediscover the musical masterpiece, Singin' In The Rain, in dazzling, restored high definition, featuring an all-new documentary special feature that salutes not just this all-time favorite but also the musical legacy of its producer, songwriter Arthur Freed.\"]\n{'Genre': 'Musicals & Performing Arts/Musicals, Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Special Edition', 'Contributor': \"Rita Moreno, Gene Kelly, Jean Hagen, Adolph Green, Millard Mitchell, Stanley Donen, Arthur Freed, Donald O'Connor, Betty Comden, Cyd Charisse, Debbie ReynoldsRita Moreno, Gene Kelly, Jean Hagen, Adolph Green, Millard Mitchell, Stanley Donen, Arthur Freed, Donald O'Connor, Betty Comden, Cyd Charisse, Debbie Reynolds  See more\", 'Language': 'English', 'Runtime': '1 hour and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '883929266777', 'Director': 'Stanley Donen, Gene Kelly', 'Media Format': 'Multiple Formats, Color, NTSC, Special Edition', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 2, 2012', 'Actors': \"Gene Kelly, Donald O'Connor, Debbie Reynolds, Jean Hagen, Millard Mitchell\", 'Producers': 'Arthur Freed', 'Studio': 'WarnerBrothers', 'Writers': 'Betty Comden, Adolph Green', 'Number of discs': '2'}\nGreat product!\nFive Stars\nA Christmas Carol\nGeorge C. Scott  (Actor),     David Warner  (Actor),     Clive Donner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n['Christmas elicits nothing more than \"Bah, humbug!\" from Ebenezer Scrooge (Scott), a miser whose sole pursuit of financial success has left him a bitter and lonely old man. But a Christmas Eve visit from the Ghosts of Christmas Past, Present and Future ultimately teaches him to open his heart to the spirit of Christmas and to the joys of friends and family.']\n{'Genre': 'Family Entertainment', 'Format': 'Color, NTSC', 'Contributor': 'Angela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy GutteridgeAngela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy Gutteridge   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '24543027201', 'Director': 'Clive Donner', 'Media Format': 'Color, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 5, 1999', 'Actors': 'George C. Scott, David Warner, Susannah York, Anthony Walters, Frank Finlay', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': '20TH CENTURY STUDIOS', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOur favorite Christmas movie!\nFive Stars\nIt's a Wonderful Life [Blu-ray]\nJames Stewart  (Actor),     Donna Reed  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Ruined by a miser on Christmas Eve, a suicidal family man sees life anew thanks to his guardian angel.', 'Amazon.com', \"It's a Wonderful Life\", 'Now perhaps the most beloved American film,', \"It's a Wonderful Life\", \"was largely forgotten for years, due to a copyright quirk. Only in the late 1970s did it find its audience through repeated TV showings. Frank Capra's masterwork deserves its status as a feel-good communal event, but it is also one of the most fascinating films in the American cinema, a multilayered work of Dickensian density. George Bailey (played superbly by James Stewart) grows up in the small town of Bedford Falls, dreaming dreams of adventure and travel, but circumstances conspire to keep him enslaved to his home turf. Frustrated by his life, and haunted by an impending scandal, George prepares to commit suicide on Christmas Eve. A heavenly messenger (Henry Travers) arrives to show him a vision: what the world would have been like if George had never been born. The sequence is a vivid depiction of the American Dream gone bad, and probably the wildest thing Capra ever shot (the director's optimistic vision may have darkened during his experiences making military films in World War II). Capra's triumph is to acknowledge the difficulties and disappointments of life, while affirming--in the teary-eyed final reel--his cherished values of friendship and individual achievement.\", \"It's a Wonderful Life\", 'was not a big hit on its initial release, and it won no Oscars (Capra and Stewart were nominated); but it continues to weave a special magic.', '--Robert Horton']\n{'Format': 'Blu-ray, Black & White, Color, Original recording remastered, Subtitled, Dubbed', 'Contributor': 'Donna Reed, Henry Travers, Gloria Grahame, Frank Capra, Ward Bond, Lionel Barrymore, Thomas Mitchell, James StewartDonna Reed, Henry Travers, Gloria Grahame, Frank Capra, Ward Bond, Lionel Barrymore, Thomas Mitchell, James Stewart  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '97360720945', 'Director': 'Frank Capra', 'Media Format': 'Blu-ray, Black & White, Color, Original recording remastered, Subtitled, Dubbed', 'Run time': '2 hours and 11 minutes', 'Release date': 'June 28, 2016', 'Actors': 'James Stewart, Donna Reed, Henry Travers, Gloria Grahame, Lionel Barrymore', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nWe watch it every year!\nFive Stars\nThe Searchers [Blu-ray]\nJohn Wayne  (Actor),     Ward Bond  (Actor)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Westerns\n['Product Description', 'Searchers, The (BD)', ']]>', 'Amazon.com', \"A favorite film of some of the world's greatest filmmakers, including Martin Scorsese and Steven Spielberg, John Ford's\", 'The Searchers', \"has earned its place in the legacy of great American films for a variety of reasons. Perhaps most notably, it's the definitive role for John Wayne as an icon of the classic Western--the hero (or antihero) who must stand alone according to the unwritten code of the West. The story takes place in Texas in 1868; Wayne plays Ethan Edwards, a Confederate veteran who visits his brother and sister-in-law at their ranch and is horrified when they are killed by marauding Comanches. Ethan's search for a surviving niece (played by young Natalie Wood) becomes an all-consuming obsession. With the help of a family friend (Jeffrey Hunter) who is himself part Cherokee, Ethan hits the trail on a five-year quest for revenge. At the peak of his masterful talent, director Ford crafts this classic tale as an embittered examination of racism and blind hatred, provoking Wayne to give one of the best performances of his career. As with many of Ford's classic Westerns,\", 'The Searchers', 'must contend with revisionism in its stereotypical treatment of \"savage\" Native Americans, and the film\\'s visual beauty (the final shot is one of the great images in all of Western culture) is compromised by some uneven performances and stilted dialogue. Still, this is undeniably one of the greatest Westerns ever made.', '--Jeff Shannon']\n{'Genre': 'Westerns', 'Format': 'Color, NTSC, Subtitled, Widescreen, Blu-ray, Dubbed, Closed-captioned', 'Contributor': 'Harry Carey Jr., Nacho Galindo, Winton Hoch, Ward Bond, Peter Mamakos, Mae Marsh, Dorothy Jordan, Walter Coy, Robert Lyden, Henry Brandon, Vera Miles, Antonio Moreno, Ken Curtis, John Qualen, John Wayne, Chief Thundercloud, Jeffrey Hunter, Stan Jones, Cliff Lyons, Olive Carey, Ruth CliffordHarry Carey Jr., Nacho Galindo, Winton Hoch, Ward Bond, Peter Mamakos, Mae Marsh, Dorothy Jordan, Walter Coy, Robert Lyden, Henry Brandon, Vera Miles, Antonio Moreno, Ken Curtis, John Qualen, John Wayne, Chief Thundercloud, Jeffrey Hunter, Stan Jones, Cliff Lyons, Oli…   See more', 'Initial release date': '2006-10-31', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.5 x 5.25 x 0.3 inches; 1.6 Ounces', 'Item model number': '111532', 'Media Format': 'Color, NTSC, Subtitled, Widescreen, Blu-ray, Dubbed, Closed-captioned', 'Run time': '1 hour and 59 minutes', 'Release date': 'October 31, 2006', 'Actors': 'John Wayne, Ward Bond, Jeffrey Hunter, Henry Brandon, Harry Carey Jr.', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy favorite western.\nFive Stars\nBlue Sky [DVD]\nJessica Lange  (Actor),     Tommy Lee Jones  (Actor),     Tony Richardson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"It was a time when blond bombshells splashed Life covers and A-bomb tests mushroomed in the desert. The older generation believed in their government, while younger people protested against it. And Blue Sky captures it all! Politically charged and erotically explosive, this highly combustible film features powerful performances by Jessica Lange (Rob Roy) in an Academy AwardÂ(r)-winning* role, and dynamic OscarÂ(r) winner** Tommy Lee Jones (Men in Black). Hard-working, mild-tempered Army scientist Hank Marshall (Jones) has his hands full with explosive nuclear reactors and the equally volatile Carly (Lange), his beautifully spirited and emotionally vulnerable wife. While he's conducting tests in Nevada, she succumbs to the advances of his superior officer! But her infidelity is not the only dilemma the Marshalls have to face. When a deadly military cover-up puts Hank in jeopardy, it's up to Carly to muster the courage and strength tosave the man she loves! *1994: Actress **1993: Supporting Actor, The Fugitive\"]\n{'Genre': 'Military & War', 'Format': 'Closed-captioned, Color, Anamorphic, Widescreen, NTSC, DVD', 'Contributor': \"Annie Ross, Tony Richardson, Jessica Lange, Mitch Ryan, Anthony Rene Jones, Dale Dye, Timothy Scott, Amy Locane, Jerry Leichtling, Rama Laurie Stagner, Powers Boothe, Carrie Snodgress, Tommy Lee Jones, Anna Klemp, Chris O'Donnell, Arlene SarnerAnnie Ross, Tony Richardson, Jessica Lange, Mitch Ryan, Anthony Rene Jones, Dale Dye, Timothy Scott, Amy Locane, Jerry Leichtling, Rama Laurie Stagner, Powers Boothe, Carrie Snodgress, Tommy Lee Jones, Anna Klemp, Chris O'Donnell, Arlene Sarner   See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Tony Richardson', 'Media Format': 'Closed-captioned, Color, Anamorphic, Widescreen, NTSC, DVD', 'Run time': '1 hour and 41 minutes', 'Release date': 'February 6, 2001', 'Actors': 'Jessica Lange, Tommy Lee Jones, Powers Boothe, Carrie Snodgress, Amy Locane', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Arlene Sarner, Jerry Leichtling, Rama Laurie Stagner', 'Number of discs': '1'}\nMy wife's favorite movie!\nFive Stars\nSister Act\nWhoopi Goldberg  (Actor),     Maggie Smith  (Actor),     Adam Greenberg  (Director),     Emile Ardolino  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n[\"Relive all the fun, laughter, and irresistible music of SISTER ACT -- the inspired comedy hit that packed pews everywhere! Whoopi Goldberg stars as a sassy, low-rent lounge singer forced to hide out from the mob in the last place on earth anyone would look for her -- a convent. While she's there, her irreverent behavior attracts a flock of faithful followers and turns the nuns' tone-deaf choir into a soulful chorus of swingin', singin' sisters. But when the group earns rave reviews, her sudden celebrity jeopardizes her hidden identity. Harvey Keitel and Kathy Najimy join a heavenly cast in this habit-forming comedy bursting with '60s Motown hits.\"]\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Closed-captioned, Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Richard Portnow, Joseph Maher, Adam Greenberg, Jim Beaver, Charlotte Crossley, Joseph Howard, Rose Parenti, Maggie Smith, Whoopi Goldberg, Kathy Najimy, Jenifer Lewis, Robert Miranda, Bill Nunn, Wendy Makkena, Mary Wickes, Harvey Keitel, Emile Ardolino, Ellen AlbertiniRichard Portnow, Joseph Maher, Adam Greenberg, Jim Beaver, Charlotte Crossley, Joseph Howard, Rose Parenti, Maggie Smith, Whoopi Goldberg, Kathy Najimy, Jenifer Lewis, Robert Miranda, Bill Nunn, Wendy Makkena, Mary Wickes, Harvey Keitel, Emile Ardolino, Ellen Alber…   See more', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2259169', 'Director': 'Adam Greenberg, Emile Ardolino', 'Media Format': 'Closed-captioned, Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'November 6, 2001', 'Actors': 'Whoopi Goldberg, Maggie Smith, Kathy Najimy, Wendy Makkena, Mary Wickes', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Joseph Howard', 'Number of discs': '1'}\nMy wife's favorite movie!\nFive Stars\nWaltons: Season 1\nRichard Thomas  (Actor),     Ralph Waite  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Waltons, The: The Complete First Season (Repackage/Stack Hub)', 'From the dire days of the Great Depression through the trying times of World War II, an American family living in Virginia’s Blue Ridge Mountains struggles to remain together in the wholesome saga The Waltons, based on the life of series creator Earl Hamner Jr. (Falcon Crest). First released in 1972, this inspiring series is seen through the eyes of John-Boy (Richard Thomas), the eldest of seven children in a clan that ekes out a meager existence from the family lumber mill. In season one, John-Boy saves his father’s life, a wandering minstrel almost corrupts young Mary Ellen, beloved mother Olivia copes with polio and the strong Walton family endures a variety of other trials. Among the guest stars in the first season of this acclaimed drama series are Ned Beatty, Sissy Spacek, Denver Pyle, John Ritter and Gregory Sierra.', ']]>']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Lee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard ThomasLee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard Thomas  See more', 'Language': 'English (Mono)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '1.1 x 5.3 x 7.5 inches; 5.6 Ounces', 'Item model number': '8.83929E+11', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '20 hours and 49 minutes', 'Release date': 'April 3, 2012', 'Actors': 'Richard Thomas, Ralph Waite, Michael Learned, Will Geer, Ellen Corby', 'Subtitles': 'French', 'Producers': 'Lee Rich', 'Studio': 'Studio Distribution Services', 'Number of discs': '5'}\nMy daughter loved it!\nFive Stars\nUncle Buck : Widescreen Edition\nJohn Candy  (Actor),     Jean Louisa Kelly  (Actor),     John Hughes  (Director, Producer, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'John Candy stars in Uncle Buck, the outrageous comedy written and directed by John Hughes (The Breakfast Club). As an idle, good-natured bachelor, Uncle Buck is the last person you would think of to watch the kids. However, during a family crisis, he is suddenly left in charge of his nephew and nieces. Unaccustomed to suburban life, fun-loving Uncle Buck soon charms his younger relatives Miles and Maizy with his hefty cooking and his new way of doing the laundry. His carefree style does not impress everyone though - especially his rebellious teenage niece, Tia, and his impatient girlfriend, Chanice. With a little bit of luck and a lot of love, Uncle Buck manages to surprise everyone in this heartwarming family comedy.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Set Contains:', 'The DVD release has a widescreen presentation, production notes, biographies, Dolby sound, optional Spanish and French soundtracks.', '--Tom KeoghM']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Jay Underwood, Garrett M. Brown, Jean Louisa Kelly, Macaulay Culkin, Amy Madigan, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, Gaby HoffmanJay Underwood, Garrett M. Brown, Jean Louisa Kelly, Macaulay Culkin, Amy Madigan, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, Gaby Hoffman  See more', 'Initial release date': '1998-06-30', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': '61020317', 'Director': 'John Hughes', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 30, 1998', 'Actors': 'John Candy, Jean Louisa Kelly, Macaulay Culkin, Gaby Hoffman, Amy Madigan', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'John Hughes, Tom Jacobson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy wife's favorite movie!\nFive Stars\nDr. Quinn, Medicine Woman: Season 1 [DVD]\nJane Seymour  (Actor),     Joe Lando  (Actor),     A&E Entertainment  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, A&E Home Video, All A&E Titles\n['From the moment that Dr. Michaela \"Mike\" Quinn (Jane Seymour) first stepped from the stagecoach into the mud of Colorado Springs, TV audiences had a new destination on Saturday nights. DR. QUINN, MEDICINE WOMAN won popular and critical acclaim including five Emmy® Awards with its tales of courage, conviction and romance on the American frontier.This family-favorite set includes all 17 episodes from the first season, plus exclusive bonus content. Old fans will delight in revisiting favorite moments, like Dr. Mike\\'s first kiss from Sully (Joe Lando) and General Custer\\'s visit to town, while newcomers will be captivated by the gripping, family-friendly stories and painstaking authenticity.Return to Colorado Springs for the unforgettable first year of DR. QUINN, MEDICINE WOMAN.BONUS FEATURES: Jane Seymour: Hollywood s English Rose Episode of A&E s Award-Winning Series Biography; Interactive Tour of 19th Century Colorado Springs; Series Awards and Honors; Cast Biographies and Filmographies; Photo Gallery']\n{'Genre': 'Kids & Family/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Joe Lando, Jane Seymour, A&E Entertainment', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1 x 5.4 x 7.5 inches; 6.4 Ounces', 'Item model number': '16100054', 'Director': 'A&E Entertainment', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '14 hours', 'Release date': 'March 29, 2011', 'Actors': 'Jane Seymour, Joe Lando', 'Studio': 'A&E Home Video', 'Number of discs': '5'}\nMy daughter loved it!\nFive Stars\nThe Homecoming: A Christmas Story\nPatricia Neal  (Actor),     Richard Thomas  (Actor),     Fielder Cook  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['Product Description', 'Set on a Depression Christmas Eve in 1933, this heart-tugging story centers around the Walton. They’re a rural American family preparing to celebrate Christmas together. Though times are tough, love and sharing are abundant in this family. An inspiring tale of love, hope and spirit, this deeply moving story goes far beyond the boundaries of time and place to reach out and touch everyone, everywhere.', 'Amazon.com', 'A true television classic,', 'The Homecoming', \"was the second movie (after 1963's\", \"Spencer's Mountain\", \") based on Earl Hamner's autobiographical writings about love, pride, faith, and survival in rural America during the Great Depression.\", 'The Homecoming', \"introduced the Walton family, a 1930s mountain clan living a hardscrabble existence that forces patriarch John Walton (Andrew Duggan) to seek work, far from home, in the city. When John fails to return home, as promised, on Christmas Eve, his iron-willed wife Olivia (Patricia Neal) keeps a lid on their children's worry. Oldest son John-Boy (Richard Thomas), who privately dreams of becoming a writer but worries about disappointing his parents, is dispatched to find his dad. Graceful yet harder-edged than the subsequent TV series\", 'The Waltons', '(which recast several characters and ran for nine years),', 'The Homecoming', 'reveals, albeit understatedly, much about the pain of poverty even as the family draws strength and closeness through endurance.', '--Tom Keogh']\n{'Genre': 'Drama', 'Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled, Full Screen', 'Contributor': 'Lee Rich, Marjorie Fowler, Robert L. Jacks, Ellen Corby, Edgar Bergen, Cleavon Little, Judy Norton, Woodrow Parfrey, Mary Beth McDonough, Gene Fowler Jr., Fielder Cook, Merv Adelson, Andrew Duggan, Earl Rath, William Windom, Earl Hamner Jr., Patricia Neal, Dorothy Stickney, Josephine Hutchinson, Richard ThomasLee Rich, Marjorie Fowler, Robert L. Jacks, Ellen Corby, Edgar Bergen, Cleavon Little, Judy Norton, Woodrow Parfrey, Mary Beth McDonough, Gene Fowler Jr., Fielder Cook, Merv Adelson, Andrew Duggan, Earl Rath, William Windom, Earl Hamner Jr., Patricia Neal, Doroth…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.71 inches; 1.69 Ounces', 'Item model number': 'D843304D', 'Director': 'Fielder Cook', 'Media Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 23, 2003', 'Actors': 'Patricia Neal, Richard Thomas, Edgar Bergen, Ellen Corby, Cleavon Little', 'Producers': 'Lee Rich, Merv Adelson, Robert L. Jacks', 'Studio': 'Paramount', 'Writers': 'Earl Hamner Jr.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMy daughter loved it!\nFive Stars\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Davis'], 'Producers': ['Arnold Kopelson', 'Peter Macgregor-Scott'], 'Starring': ['Harrison Ford', 'Tommy Lee Jones', 'Sela Ward'], 'Studio': ['Warner Bros. Domestic Televisi']}\nMy wife's favorite movie!\nFive Stars\nThe Rocketeer\nAlan Arkin  (Actor),     Bill Campbell  (Actor),     Hiro Narita  (Director),     Joe Johnston  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['The discovery of a top-secret jetpack hurls test pilot Cliff Secord into a daring adventure of mystery, suspense, and intrigue! Cliff encounters an assortment of ruthless villains, led by a Hollywood screen star who\\'s a secret Nazi spy (Timothy Dalton). With the help of his actress girlfriend, the young pilot battles enormous odds to defeat his foes who are anxious to use the device in an evil plan to rule the world! The dangerous mission transforms the ordinary young man into an extraordinary hero!|The pilots\\' hangout in the film, the Bulldog Cafe, is based on an actual 1920\\'s Los Angeles restaurant.|Timothy Dalton\\'s character, Neville Sinclair, is loosely based on actor Errol Flynn, who was rumored to be a Nazi spy.|In 1938 a young air racing pilot, Cliff Secord, and his partner, Peevy, discover a secret rocket pack that enables a man to fly. They quickly become entangled in international intrigue in their attempts to keep the device away from Nazi spies and other villains, including Hollywood matinee idol Neville Sinclair. With the help of his actress girlfriend, Cliff, dubbed \"The Rocketeer\" by the press, embarks on a mission that could alter the course of history and hmake him a true hero.|The movie was based on a comic character created by Dave Stevens.']\n{'Genre': 'ACTION, Action/Adventure, LIVE', 'Format': 'Color, Dolby, NTSC, Closed-captioned, Widescreen, Letterboxed, Multiple Formats', 'Contributor': \"William Sanderson, Hiro Narita, Jennifer Connelly, Paul DeMeo, Jon Polito, Danny Bilson, Don Pugsley, William Dear, Ed Lauter, Bill Campbell, Nada Despotovich, Robert Guy Miranda, Terry O'Quinn, Timothy Dalton, Eddie Jones, Joe Johnston, James Handy, Alan Arkin, Paul SorvinoWilliam Sanderson, Hiro Narita, Jennifer Connelly, Paul DeMeo, Jon Polito, Danny Bilson, Don Pugsley, William Dear, Ed Lauter, Bill Campbell, Nada Despotovich, Robert Guy Miranda, Terry O'Quinn, Timothy Dalton, Eddie Jones, Joe Johnston, James Handy, Alan Arkin, Paul Sorvino  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1750100', 'Director': 'Hiro Narita, Joe Johnston', 'Media Format': 'Color, Dolby, NTSC, Closed-captioned, Widescreen, Letterboxed, Multiple Formats', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 17, 1999', 'Actors': 'Alan Arkin, Bill Campbell, Jennifer Connelly, Timothy Dalton, Nada Despotovich', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Danny Bilson, Paul DeMeo, William Dear', 'Country of Origin': 'USA', 'Number of discs': '1'}\nStill a wonderful, fun movie!\nMovie review",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Singin' in the Rain\nReview Date: 2014/11/16\nStore: Gene Kelly  (Actor, Director),     Donald O'Connor  (Actor),     Stanley Donen  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: [\"Silent movies are giving way to talking pictures - and a hoofer-turned-matinee idol (Gene Kelly) is caught in the bumpy transition, as are his buddy (Donald, O'Connor), a prospective ladylove (Debbie Reynolds) and shrewish costar (Jean Hagen). Rediscover the musical masterpiece, Singin' In The Rain, in dazzling, restored high definition, featuring an all-new documentary special feature that salutes not just this all-time favorite but also the musical legacy of its producer, songwriter Arthur Freed.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Drama/Love & Romance, Comedy', 'Format': 'Multiple Formats, Color, NTSC, Special Edition', 'Contributor': \"Rita Moreno, Gene Kelly, Jean Hagen, Adolph Green, Millard Mitchell, Stanley Donen, Arthur Freed, Donald O'Connor, Betty Comden, Cyd Charisse, Debbie ReynoldsRita Moreno, Gene Kelly, Jean Hagen, Adolph Green, Millard Mitchell, Stanley Donen, Arthur Freed, Donald O'Connor, Betty Comden, Cyd Charisse, Debbie Reynolds  See more\", 'Language': 'English', 'Runtime': '1 hour and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '883929266777', 'Director': 'Stanley Donen, Gene Kelly', 'Media Format': 'Multiple Formats, Color, NTSC, Special Edition', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 2, 2012', 'Actors': \"Gene Kelly, Donald O'Connor, Debbie Reynolds, Jean Hagen, Millard Mitchell\", 'Producers': 'Arthur Freed', 'Studio': 'WarnerBrothers', 'Writers': 'Betty Comden, Adolph Green', 'Number of discs': '2'}\nReview Text: Great product!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: A Christmas Carol\nReview Date: 2015/06/05\nStore: George C. Scott  (Actor),     David Warner  (Actor),     Clive Donner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: ['Christmas elicits nothing more than \"Bah, humbug!\" from Ebenezer Scrooge (Scott), a miser whose sole pursuit of financial success has left him a bitter and lonely old man. But a Christmas Eve visit from the Ghosts of Christmas Past, Present and Future ultimately teaches him to open his heart to the spirit of Christmas and to the joys of friends and family.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Family Entertainment', 'Format': 'Color, NTSC', 'Contributor': 'Angela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy GutteridgeAngela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy Gutteridge   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '24543027201', 'Director': 'Clive Donner', 'Media Format': 'Color, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 5, 1999', 'Actors': 'George C. Scott, David Warner, Susannah York, Anthony Walters, Frank Finlay', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': '20TH CENTURY STUDIOS', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Our favorite Christmas movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: It's a Wonderful Life [Blu-ray]\nReview Date: 2015/06/05\nStore: James Stewart  (Actor),     Donna Reed  (Actor),     Frank Capra  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'Ruined by a miser on Christmas Eve, a suicidal family man sees life anew thanks to his guardian angel.', 'Amazon.com', \"It's a Wonderful Life\", 'Now perhaps the most beloved American film,', \"It's a Wonderful Life\", \"was largely forgotten for years, due to a copyright quirk. Only in the late 1970s did it find its audience through repeated TV showings. Frank Capra's masterwork deserves its status as a feel-good communal event, but it is also one of the most fascinating films in the American cinema, a multilayered work of Dickensian density. George Bailey (played superbly by James Stewart) grows up in the small town of Bedford Falls, dreaming dreams of adventure and travel, but circumstances conspire to keep him enslaved to his home turf. Frustrated by his life, and haunted by an impending scandal, George prepares to commit suicide on Christmas Eve. A heavenly messenger (Henry Travers) arrives to show him a vision: what the world would have been like if George had never been born. The sequence is a vivid depiction of the American Dream gone bad, and probably the wildest thing Capra ever shot (the director's optimistic vision may have darkened during his experiences making military films in World War II). Capra's triumph is to acknowledge the difficulties and disappointments of life, while affirming--in the teary-eyed final reel--his cherished values of friendship and individual achievement.\", \"It's a Wonderful Life\", 'was not a big hit on its initial release, and it won no Oscars (Capra and Stewart were nominated); but it continues to weave a special magic.', '--Robert Horton']\nAverage Rating: 4.9\nProduct Details: {'Format': 'Blu-ray, Black & White, Color, Original recording remastered, Subtitled, Dubbed', 'Contributor': 'Donna Reed, Henry Travers, Gloria Grahame, Frank Capra, Ward Bond, Lionel Barrymore, Thomas Mitchell, James StewartDonna Reed, Henry Travers, Gloria Grahame, Frank Capra, Ward Bond, Lionel Barrymore, Thomas Mitchell, James Stewart  See more', 'Language': 'English', 'Runtime': '2 hours and 11 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '97360720945', 'Director': 'Frank Capra', 'Media Format': 'Blu-ray, Black & White, Color, Original recording remastered, Subtitled, Dubbed', 'Run time': '2 hours and 11 minutes', 'Release date': 'June 28, 2016', 'Actors': 'James Stewart, Donna Reed, Henry Travers, Gloria Grahame, Lionel Barrymore', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nReview Text: We watch it every year!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Searchers [Blu-ray]\nReview Date: 2015/06/05\nStore: John Wayne  (Actor),     Ward Bond  (Actor)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Westerns\nProduct Description: ['Product Description', 'Searchers, The (BD)', ']]>', 'Amazon.com', \"A favorite film of some of the world's greatest filmmakers, including Martin Scorsese and Steven Spielberg, John Ford's\", 'The Searchers', \"has earned its place in the legacy of great American films for a variety of reasons. Perhaps most notably, it's the definitive role for John Wayne as an icon of the classic Western--the hero (or antihero) who must stand alone according to the unwritten code of the West. The story takes place in Texas in 1868; Wayne plays Ethan Edwards, a Confederate veteran who visits his brother and sister-in-law at their ranch and is horrified when they are killed by marauding Comanches. Ethan's search for a surviving niece (played by young Natalie Wood) becomes an all-consuming obsession. With the help of a family friend (Jeffrey Hunter) who is himself part Cherokee, Ethan hits the trail on a five-year quest for revenge. At the peak of his masterful talent, director Ford crafts this classic tale as an embittered examination of racism and blind hatred, provoking Wayne to give one of the best performances of his career. As with many of Ford's classic Westerns,\", 'The Searchers', 'must contend with revisionism in its stereotypical treatment of \"savage\" Native Americans, and the film\\'s visual beauty (the final shot is one of the great images in all of Western culture) is compromised by some uneven performances and stilted dialogue. Still, this is undeniably one of the greatest Westerns ever made.', '--Jeff Shannon']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Westerns', 'Format': 'Color, NTSC, Subtitled, Widescreen, Blu-ray, Dubbed, Closed-captioned', 'Contributor': 'Harry Carey Jr., Nacho Galindo, Winton Hoch, Ward Bond, Peter Mamakos, Mae Marsh, Dorothy Jordan, Walter Coy, Robert Lyden, Henry Brandon, Vera Miles, Antonio Moreno, Ken Curtis, John Qualen, John Wayne, Chief Thundercloud, Jeffrey Hunter, Stan Jones, Cliff Lyons, Olive Carey, Ruth CliffordHarry Carey Jr., Nacho Galindo, Winton Hoch, Ward Bond, Peter Mamakos, Mae Marsh, Dorothy Jordan, Walter Coy, Robert Lyden, Henry Brandon, Vera Miles, Antonio Moreno, Ken Curtis, John Qualen, John Wayne, Chief Thundercloud, Jeffrey Hunter, Stan Jones, Cliff Lyons, Oli…   See more', 'Initial release date': '2006-10-31', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '6.5 x 5.25 x 0.3 inches; 1.6 Ounces', 'Item model number': '111532', 'Media Format': 'Color, NTSC, Subtitled, Widescreen, Blu-ray, Dubbed, Closed-captioned', 'Run time': '1 hour and 59 minutes', 'Release date': 'October 31, 2006', 'Actors': 'John Wayne, Ward Bond, Jeffrey Hunter, Henry Brandon, Harry Carey Jr.', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My favorite western.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blue Sky [DVD]\nReview Date: 2015/06/05\nStore: Jessica Lange  (Actor),     Tommy Lee Jones  (Actor),     Tony Richardson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"It was a time when blond bombshells splashed Life covers and A-bomb tests mushroomed in the desert. The older generation believed in their government, while younger people protested against it. And Blue Sky captures it all! Politically charged and erotically explosive, this highly combustible film features powerful performances by Jessica Lange (Rob Roy) in an Academy AwardÂ(r)-winning* role, and dynamic OscarÂ(r) winner** Tommy Lee Jones (Men in Black). Hard-working, mild-tempered Army scientist Hank Marshall (Jones) has his hands full with explosive nuclear reactors and the equally volatile Carly (Lange), his beautifully spirited and emotionally vulnerable wife. While he's conducting tests in Nevada, she succumbs to the advances of his superior officer! But her infidelity is not the only dilemma the Marshalls have to face. When a deadly military cover-up puts Hank in jeopardy, it's up to Carly to muster the courage and strength tosave the man she loves! *1994: Actress **1993: Supporting Actor, The Fugitive\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Military & War', 'Format': 'Closed-captioned, Color, Anamorphic, Widescreen, NTSC, DVD', 'Contributor': \"Annie Ross, Tony Richardson, Jessica Lange, Mitch Ryan, Anthony Rene Jones, Dale Dye, Timothy Scott, Amy Locane, Jerry Leichtling, Rama Laurie Stagner, Powers Boothe, Carrie Snodgress, Tommy Lee Jones, Anna Klemp, Chris O'Donnell, Arlene SarnerAnnie Ross, Tony Richardson, Jessica Lange, Mitch Ryan, Anthony Rene Jones, Dale Dye, Timothy Scott, Amy Locane, Jerry Leichtling, Rama Laurie Stagner, Powers Boothe, Carrie Snodgress, Tommy Lee Jones, Anna Klemp, Chris O'Donnell, Arlene Sarner   See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Tony Richardson', 'Media Format': 'Closed-captioned, Color, Anamorphic, Widescreen, NTSC, DVD', 'Run time': '1 hour and 41 minutes', 'Release date': 'February 6, 2001', 'Actors': 'Jessica Lange, Tommy Lee Jones, Powers Boothe, Carrie Snodgress, Amy Locane', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Arlene Sarner, Jerry Leichtling, Rama Laurie Stagner', 'Number of discs': '1'}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sister Act\nReview Date: 2015/06/05\nStore: Whoopi Goldberg  (Actor),     Maggie Smith  (Actor),     Adam Greenberg  (Director),     Emile Ardolino  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\nProduct Description: [\"Relive all the fun, laughter, and irresistible music of SISTER ACT -- the inspired comedy hit that packed pews everywhere! Whoopi Goldberg stars as a sassy, low-rent lounge singer forced to hide out from the mob in the last place on earth anyone would look for her -- a convent. While she's there, her irreverent behavior attracts a flock of faithful followers and turns the nuns' tone-deaf choir into a soulful chorus of swingin', singin' sisters. But when the group earns rave reviews, her sudden celebrity jeopardizes her hidden identity. Harvey Keitel and Kathy Najimy join a heavenly cast in this habit-forming comedy bursting with '60s Motown hits.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Closed-captioned, Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Richard Portnow, Joseph Maher, Adam Greenberg, Jim Beaver, Charlotte Crossley, Joseph Howard, Rose Parenti, Maggie Smith, Whoopi Goldberg, Kathy Najimy, Jenifer Lewis, Robert Miranda, Bill Nunn, Wendy Makkena, Mary Wickes, Harvey Keitel, Emile Ardolino, Ellen AlbertiniRichard Portnow, Joseph Maher, Adam Greenberg, Jim Beaver, Charlotte Crossley, Joseph Howard, Rose Parenti, Maggie Smith, Whoopi Goldberg, Kathy Najimy, Jenifer Lewis, Robert Miranda, Bill Nunn, Wendy Makkena, Mary Wickes, Harvey Keitel, Emile Ardolino, Ellen Alber…   See more', 'Language': 'French (Dolby Digital 5.1), English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Item model number': '2259169', 'Director': 'Adam Greenberg, Emile Ardolino', 'Media Format': 'Closed-captioned, Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'November 6, 2001', 'Actors': 'Whoopi Goldberg, Maggie Smith, Kathy Najimy, Wendy Makkena, Mary Wickes', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Joseph Howard', 'Number of discs': '1'}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Waltons: Season 1\nReview Date: 2015/06/05\nStore: Richard Thomas  (Actor),     Ralph Waite  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Waltons, The: The Complete First Season (Repackage/Stack Hub)', 'From the dire days of the Great Depression through the trying times of World War II, an American family living in Virginia’s Blue Ridge Mountains struggles to remain together in the wholesome saga The Waltons, based on the life of series creator Earl Hamner Jr. (Falcon Crest). First released in 1972, this inspiring series is seen through the eyes of John-Boy (Richard Thomas), the eldest of seven children in a clan that ekes out a meager existence from the family lumber mill. In season one, John-Boy saves his father’s life, a wandering minstrel almost corrupts young Mary Ellen, beloved mother Olivia copes with polio and the strong Walton family endures a variety of other trials. Among the guest stars in the first season of this acclaimed drama series are Ned Beatty, Sissy Spacek, Denver Pyle, John Ritter and Gregory Sierra.', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Drama', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Lee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard ThomasLee Rich, Mary Elizabeth McDonough, Eric Scott, Ellen Corby, Judy Norton, Jon Walmsley, Ralph Waite, Will Geer, Joe Conley, Michael Learned, David W. Harper, Kami Cotler, Richard Thomas  See more', 'Language': 'English (Mono)', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '1.1 x 5.3 x 7.5 inches; 5.6 Ounces', 'Item model number': '8.83929E+11', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Run time': '20 hours and 49 minutes', 'Release date': 'April 3, 2012', 'Actors': 'Richard Thomas, Ralph Waite, Michael Learned, Will Geer, Ellen Corby', 'Subtitles': 'French', 'Producers': 'Lee Rich', 'Studio': 'Studio Distribution Services', 'Number of discs': '5'}\nReview Text: My daughter loved it!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Uncle Buck : Widescreen Edition\nReview Date: 2015/06/05\nStore: John Candy  (Actor),     Jean Louisa Kelly  (Actor),     John Hughes  (Director, Producer, Writer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'John Candy stars in Uncle Buck, the outrageous comedy written and directed by John Hughes (The Breakfast Club). As an idle, good-natured bachelor, Uncle Buck is the last person you would think of to watch the kids. However, during a family crisis, he is suddenly left in charge of his nephew and nieces. Unaccustomed to suburban life, fun-loving Uncle Buck soon charms his younger relatives Miles and Maizy with his hefty cooking and his new way of doing the laundry. His carefree style does not impress everyone though - especially his rebellious teenage niece, Tia, and his impatient girlfriend, Chanice. With a little bit of luck and a lot of love, Uncle Buck manages to surprise everyone in this heartwarming family comedy.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Set Contains:', 'The DVD release has a widescreen presentation, production notes, biographies, Dolby sound, optional Spanish and French soundtracks.', '--Tom KeoghM']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Jay Underwood, Garrett M. Brown, Jean Louisa Kelly, Macaulay Culkin, Amy Madigan, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, Gaby HoffmanJay Underwood, Garrett M. Brown, Jean Louisa Kelly, Macaulay Culkin, Amy Madigan, Tom Jacobson, Laurie Metcalf, John Hughes, John Candy, Elaine Bromka, Gaby Hoffman  See more', 'Initial release date': '1998-06-30', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Item model number': '61020317', 'Director': 'John Hughes', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 30, 1998', 'Actors': 'John Candy, Jean Louisa Kelly, Macaulay Culkin, Gaby Hoffman, Amy Madigan', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'John Hughes, Tom Jacobson', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr. Quinn, Medicine Woman: Season 1 [DVD]\nReview Date: 2015/06/05\nStore: Jane Seymour  (Actor),     Joe Lando  (Actor),     A&E Entertainment  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, A&E Home Video, All A&E Titles\nProduct Description: ['From the moment that Dr. Michaela \"Mike\" Quinn (Jane Seymour) first stepped from the stagecoach into the mud of Colorado Springs, TV audiences had a new destination on Saturday nights. DR. QUINN, MEDICINE WOMAN won popular and critical acclaim including five Emmy® Awards with its tales of courage, conviction and romance on the American frontier.This family-favorite set includes all 17 episodes from the first season, plus exclusive bonus content. Old fans will delight in revisiting favorite moments, like Dr. Mike\\'s first kiss from Sully (Joe Lando) and General Custer\\'s visit to town, while newcomers will be captivated by the gripping, family-friendly stories and painstaking authenticity.Return to Colorado Springs for the unforgettable first year of DR. QUINN, MEDICINE WOMAN.BONUS FEATURES: Jane Seymour: Hollywood s English Rose Episode of A&E s Award-Winning Series Biography; Interactive Tour of 19th Century Colorado Springs; Series Awards and Honors; Cast Biographies and Filmographies; Photo Gallery']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Kids & Family/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Joe Lando, Jane Seymour, A&E Entertainment', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1 x 5.4 x 7.5 inches; 6.4 Ounces', 'Item model number': '16100054', 'Director': 'A&E Entertainment', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '14 hours', 'Release date': 'March 29, 2011', 'Actors': 'Jane Seymour, Joe Lando', 'Studio': 'A&E Home Video', 'Number of discs': '5'}\nReview Text: My daughter loved it!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Homecoming: A Christmas Story\nReview Date: 2015/06/05\nStore: Patricia Neal  (Actor),     Richard Thomas  (Actor),     Fielder Cook  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: ['Product Description', 'Set on a Depression Christmas Eve in 1933, this heart-tugging story centers around the Walton. They’re a rural American family preparing to celebrate Christmas together. Though times are tough, love and sharing are abundant in this family. An inspiring tale of love, hope and spirit, this deeply moving story goes far beyond the boundaries of time and place to reach out and touch everyone, everywhere.', 'Amazon.com', 'A true television classic,', 'The Homecoming', \"was the second movie (after 1963's\", \"Spencer's Mountain\", \") based on Earl Hamner's autobiographical writings about love, pride, faith, and survival in rural America during the Great Depression.\", 'The Homecoming', \"introduced the Walton family, a 1930s mountain clan living a hardscrabble existence that forces patriarch John Walton (Andrew Duggan) to seek work, far from home, in the city. When John fails to return home, as promised, on Christmas Eve, his iron-willed wife Olivia (Patricia Neal) keeps a lid on their children's worry. Oldest son John-Boy (Richard Thomas), who privately dreams of becoming a writer but worries about disappointing his parents, is dispatched to find his dad. Graceful yet harder-edged than the subsequent TV series\", 'The Waltons', '(which recast several characters and ran for nine years),', 'The Homecoming', 'reveals, albeit understatedly, much about the pain of poverty even as the family draws strength and closeness through endurance.', '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled, Full Screen', 'Contributor': 'Lee Rich, Marjorie Fowler, Robert L. Jacks, Ellen Corby, Edgar Bergen, Cleavon Little, Judy Norton, Woodrow Parfrey, Mary Beth McDonough, Gene Fowler Jr., Fielder Cook, Merv Adelson, Andrew Duggan, Earl Rath, William Windom, Earl Hamner Jr., Patricia Neal, Dorothy Stickney, Josephine Hutchinson, Richard ThomasLee Rich, Marjorie Fowler, Robert L. Jacks, Ellen Corby, Edgar Bergen, Cleavon Little, Judy Norton, Woodrow Parfrey, Mary Beth McDonough, Gene Fowler Jr., Fielder Cook, Merv Adelson, Andrew Duggan, Earl Rath, William Windom, Earl Hamner Jr., Patricia Neal, Doroth…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.71 inches; 1.69 Ounces', 'Item model number': 'D843304D', 'Director': 'Fielder Cook', 'Media Format': 'Closed-captioned, Color, Multiple Formats, NTSC, Subtitled, Full Screen', 'Run time': '1 hour and 40 minutes', 'Release date': 'September 23, 2003', 'Actors': 'Patricia Neal, Richard Thomas, Edgar Bergen, Ellen Corby, Cleavon Little', 'Producers': 'Lee Rich, Merv Adelson, Robert L. Jacks', 'Studio': 'Paramount', 'Writers': 'Earl Hamner Jr.', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: My daughter loved it!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/06/05\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Davis'], 'Producers': ['Arnold Kopelson', 'Peter Macgregor-Scott'], 'Starring': ['Harrison Ford', 'Tommy Lee Jones', 'Sela Ward'], 'Studio': ['Warner Bros. Domestic Televisi']}\nReview Text: My wife's favorite movie!\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Rocketeer\nReview Date: 2016/08/07\nStore: Alan Arkin  (Actor),     Bill Campbell  (Actor),     Hiro Narita  (Director),     Joe Johnston  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['The discovery of a top-secret jetpack hurls test pilot Cliff Secord into a daring adventure of mystery, suspense, and intrigue! Cliff encounters an assortment of ruthless villains, led by a Hollywood screen star who\\'s a secret Nazi spy (Timothy Dalton). With the help of his actress girlfriend, the young pilot battles enormous odds to defeat his foes who are anxious to use the device in an evil plan to rule the world! The dangerous mission transforms the ordinary young man into an extraordinary hero!|The pilots\\' hangout in the film, the Bulldog Cafe, is based on an actual 1920\\'s Los Angeles restaurant.|Timothy Dalton\\'s character, Neville Sinclair, is loosely based on actor Errol Flynn, who was rumored to be a Nazi spy.|In 1938 a young air racing pilot, Cliff Secord, and his partner, Peevy, discover a secret rocket pack that enables a man to fly. They quickly become entangled in international intrigue in their attempts to keep the device away from Nazi spies and other villains, including Hollywood matinee idol Neville Sinclair. With the help of his actress girlfriend, Cliff, dubbed \"The Rocketeer\" by the press, embarks on a mission that could alter the course of history and hmake him a true hero.|The movie was based on a comic character created by Dave Stevens.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'ACTION, Action/Adventure, LIVE', 'Format': 'Color, Dolby, NTSC, Closed-captioned, Widescreen, Letterboxed, Multiple Formats', 'Contributor': \"William Sanderson, Hiro Narita, Jennifer Connelly, Paul DeMeo, Jon Polito, Danny Bilson, Don Pugsley, William Dear, Ed Lauter, Bill Campbell, Nada Despotovich, Robert Guy Miranda, Terry O'Quinn, Timothy Dalton, Eddie Jones, Joe Johnston, James Handy, Alan Arkin, Paul SorvinoWilliam Sanderson, Hiro Narita, Jennifer Connelly, Paul DeMeo, Jon Polito, Danny Bilson, Don Pugsley, William Dear, Ed Lauter, Bill Campbell, Nada Despotovich, Robert Guy Miranda, Terry O'Quinn, Timothy Dalton, Eddie Jones, Joe Johnston, James Handy, Alan Arkin, Paul Sorvino  See more\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '1750100', 'Director': 'Hiro Narita, Joe Johnston', 'Media Format': 'Color, Dolby, NTSC, Closed-captioned, Widescreen, Letterboxed, Multiple Formats', 'Run time': '1 hour and 48 minutes', 'Release date': 'August 17, 1999', 'Actors': 'Alan Arkin, Bill Campbell, Jennifer Connelly, Timothy Dalton, Nada Despotovich', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Danny Bilson, Paul DeMeo, William Dear', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Still a wonderful, fun movie!\nReview Title: Movie review\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Key Preferences and Trends:**\n\n1. **Genres:** Predominantly enjoys *family-friendly films*, *comedies*, and *classic musicals*.\n2. **Movie Formats:** Values *DVDs* and *Blu-rays*, indicating a preference for physical media.\n3. **Seasonal Films:** Frequently purchases *holiday-themed movies*, particularly those centered around *Christmas*.\n4. **Ratings:** Consistently favors highly-rated films (average rating of 4.5 or higher).\n5. **Ensemble Casts:** Shows a preference for films featuring **ensemble casts** and well-known actors, particularly from classic Hollywood.\n6. **Strong Emotional Themes:** Enjoys heartwarming and feel-good storylines that explore themes of *love*, *family*, and *redemption*.\n7. **Rewatchability:** Purchases movies that are described as favorites or are traditionally watched annually, suggesting a preference for nostalgia and comfort in familiar narratives.\n8. **Genres of Interest:** Shows curiosity in *Westerns* and *historical dramas*, indicating a versatile taste that extends beyond comedy and musicals.\n9. **Family-Centric Choices:** Records several purchases motivated by *family viewing*, especially movies that children and spouses enjoy.\n\nOverall, this individual embraces a *nostalgic and family-oriented viewing experience*, focusing on high-quality, entertaining films suitable for home enjoyment.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Four Stars",
    "text": "Great movie",
    "images": [],
    "asin": "B00274FG4C",
    "parent_asin": "B00274FG4C",
    "user_id": "AE62UN4Q5JNY6V3J6BOXSW4XC3KA",
    "timestamp": "2017-10-25 21:34:27.119000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.5,
    "rating_number": 652,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/2e3ca3b6510e0359bdf686b90985e4700e968f2a0983fe39ff1563be58e863d2._RI_SX360_FMwebp_.png",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/2e3ca3b6510e0359bdf686b90985e4700e968f2a0983fe39ff1563be58e863d2._RI_SX480_FMwebp_.png",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/2e3ca3b6510e0359bdf686b90985e4700e968f2a0983fe39ff1563be58e863d2._RI_SX720_FMwebp_.png",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/2e3ca3b6510e0359bdf686b90985e4700e968f2a0983fe39ff1563be58e863d2._RI_SX1080_FMwebp_.png",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/2e3ca3b6510e0359bdf686b90985e4700e968f2a0983fe39ff1563be58e863d2._RI_SX1440_FMwebp_.png",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/2e3ca3b6510e0359bdf686b90985e4700e968f2a0983fe39ff1563be58e863d2._RI_SX1920_FMwebp_.png",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Henry Koster"
      ],
      "Producers": [
        "Nunnally Johnson"
      ],
      "Starring": [
        "Olivia de Havilland",
        "Richard Burton",
        "Audrey Dalton"
      ],
      "Studio": [
        "20th Century Fox"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}