{
  "user_id": "AFM3BTFQFZAZBNEWWTTUW4ZJRBVA",
  "summary": "=== Purchase Information ===\nProduct Title: Stretch, Turn-out, & Extension\nReview Date: 2013/03/24\nStore: Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Ballet & Dance\nProduct Description: ['In this new video, Finis Jhung has created 17 exercises especially designed to show you how to stretch safely and correctly so that you will strengthen and improve your turnout and extension. Finis shows and explains each exercise step-by-step, and then it is demonstrated by Isabella Boylston of The American Ballet Theater. The floor exercises are done both sitting up as well as lying down, which allows you to stretch without stress or strain on your muscles and joints. Each barre exercise includes detailed instructions and demonstrations on how to bring your floor stretches to a standing position while displaying your maximum turnout and extension with balance and control. Teaching in New York City since 1972, Finis Jhung has enabled thousands of dancers to become their personal best. As you will see, the secrets to success can be yours. FLOOR EXERCISES 1. Half split stretch 2. Full split stretch 3. Plié stretch with feet apart 4. Plié stretch with feet together 5. Développé to the front: on your side 6. Développé to the front: on your back 7. Développé to the side: on your back 8. Arabesque roll-ups BARRE EXERCISES 9. Strengthen your turn-out in plié 10. Rond de jambe à terre, en l’air, grand rond de jambe 11. Battement, fondu, développé to the front & side 12. Développé, battement fondu to the front & side 13. Arabesque stretch, penchée 14. Grand battement to the front, tombé, stretch 15. Grand battement to the back, stretch 16. Grand battement to the side 17. Adagio with grand rond de jambe']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.9 Ounces', 'Media Format': 'NTSC, DVD, Color', 'Run time': '1 hour and 30 minutes', 'Producers': 'Finis Jhung', 'Studio': 'Ballet Dynamics, Inc.', 'Number of discs': '1'}\nReview Text: This is the best stretch video ever!! Using this video will get me back in shape in no time. Not even painful.\nReview Title: Ballet Essentials\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/03/24\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['RZA'], 'Producers': ['Marc Abraham', 'Eric Newman', 'Eli Roth'], 'Starring': ['Russell Crowe', 'Cung Le', 'Lucy Liu'], 'Studio': ['Universal Pictures']}\nReview Text: Fantastic!! Thought I purchased the DVD but love the movie. Can view this movie over and over again. It's a keeper.\nReview Title: Karate Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tyler Perry's Aunt Bam's Place (The Play)\nReview Date: 2013/08/16\nStore: Cassi Davis  (Actor),     Jeffrey Lewis  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: ['Product Description', \"One weekend, Aunt Bam's nephew-in-law Stewart is granted a court-ordered visitation with his children. Although his new, much-younger wife Mona is a bundle of nerves, Stewart seizes the opportunity to reconnect with his children, whom he loves dearly. Then their mother, his ex-wife Gloria, shows up drunk. It will take Madea's partner-in-crime, Bam, to tame this situation and set a few things straight.\", 'Amazon.com', 'Her silver bouffant towering a foot above her head, Aunt Bam (Cassi Davis,', 'House of Payne', \") solves her family's problems with a sharp tongue and tough love. Stewart (Maurice Lauchner), divorced and remarried to a much younger wife, Mona (Taral Hicks), must fight to have access to his children (Paris Bennett and Jeffery Lewis). But he doesn't know just how angry his ex-wife Gloria (Melonie Daniels) is, and the lengths to which she'll go to turn his son against him. Can Aunt Bam save this family? Well, really, there's not much doubt, but\", \"Aunt Bam's Place\", \"glides along smoothly with snappy comedy, heartfelt Christian sentiment, and gospel songs (every character gets his or her own showstopping number). The play was filmed in front of a live audience at an Atlanta theater, giving it the look of a standard sitcom. Its greatest strength--besides Aunt Bam's crowd-pleasing wisecracks--is that it extends compassion to every character. Gloria, demonized though she is, has her own song wailing out her personal pain.\", \"Aunt Bam's Place\", 'is straight-ahead Tyler Perry (creator of Madea, director of', 'Diary of a Mad Black Woman', 'and', 'I Can Do Bad All by Myself', \"). Anyone who doesn't already like his work, where lives and souls are saved by song, prayer, and sass, will not be converted here. But anyone who appreciates this hard-working auteur's movies and TV shows will enjoy this play.\", '--Bret Fetzer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romantic Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Melonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris BennettMelonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris Bennett   See more', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT32422DVD', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'June 12, 2012', 'Actors': 'Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Taral Hicks, Melonie Daniels', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Producers': 'Eric Fellner, Mark E. Swinton, Tyler Perry, Nira Park, Tim Bevan', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nReview Title: Tyler Perry Fan\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tyler Perry's I Don't Want to Do Wrong - The Play\nReview Date: 2013/08/16\nStore: Kislyck \"Kissy\" Halsey  (Actor),     Alexis Jones  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Palmer Williams Jr.. and Patrice Lovely anchor a powerhouse cast portraying an American family facing the challenge of having a loved-one in the armed forces and many of the hilarious and outrageous obstacles that come with it.', 'Amazon.com', 'Tyler Perry is one of the most prolific writers in American film--and for the American stage.', \"I Don't Want to Do Wrong\", \"is one of Perry's musical plays, with the signature uplifting Tyler Perry message, delivered in a heartfelt way by very talented actors. There's no Madea in\", \"I Don't Want to Do Wrong\", \", but the hilarious Patrice Lovely takes the place of the matriarch who keeps things on track, with sass and attitude. The story is a simple one, centering on what happens when a marriage is strained by distance. A young woman, Yolanda (Alexis Jones), is tempted by an extramarital affair when her husband is deployed to Iraq. She moves in with her wacky parents, Reverend Wallace (Palmer Williams Jr.) and Hattie (Lovely)--who seem to be deeply in love after many years of marriage--but are they? The story is simple, the ending uplifting, and the journey one of smiles and crude laughter, and just a little heart-tugging. If you're a Tyler Perry fan, and you don't want to do wrong, you can't go wrong by watching\", \"I Don't Want to Do Wrong\", '. --', 'A.T. Hurley']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Black Comedy', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Contributor': 'Tony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne WeinertTony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne Weinert  See more', 'Language': 'English', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '33044', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Kislyck \"Kissy\" Halsey, Alexis Jones, Andre Pitre, Tony Hightower, Palmer Williams, Jr.', 'Subtitles': 'Spanish, English', 'Producers': 'Suzanne Weinert, Tanner Beard, Tyler Perry, Jay Michaelson', 'Studio': 'Lionsgate Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nReview Title: Tyler Perry Fan\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Gods Of The Arena - The Complete Collection [DVD]\nReview Date: 2013/08/16\nStore: John Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection.\nReview Title: A Keeper\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Vengeance: Season 2\nReview Date: 2013/08/16\nStore: Liam McIntyre  (Actor),     Katrina Law  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['10-episode sequel to “Spartacus: Blood & Sand.” On the heels of the bloody escape from the House of Batiatus that concluded “Spartacus: Blood and Sand,” the gladiator rebellion continues and begins to strike fear into the heart of the Roman Republic in “Spartacus: Vengeance.” Gaius Claudius Glaber and his Roman troops are sent to Capua to crush the growing band of freed slaves that Spartacus leads before it can inflict further damage. Spartacus is presented the choice of satisfying his personal need for vengeance against the man who condemned his wife to slavery and eventual death or making the larger sacrifices necessary to keep his budding army from breaking apart. Containing all of the blood-soaked action, exotic sexuality, and villainy and heroism that has come to distinguish the series, the tale of Spartacus resumes in epic fashion. Includes tons of never-before-seen bonus features including featurettes, extended scenes and Content Too Risqué for CABLE TV.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Rob Tapert, Sam Raimi, Peter Mensah, Steven S. DeKnight, Joshua Donen, Manu Bennett, Katrina Law, Lucy Lawless, Liam McIntyre, Dustin ClareRob Tapert, Sam Raimi, Peter Mensah, Steven S. DeKnight, Joshua Donen, Manu Bennett, Katrina Law, Lucy Lawless, Liam McIntyre, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.7 x 7.5 inches; 2.72 Ounces', 'Item model number': '540948195', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '9 hours and 16 minutes', 'Release date': 'September 11, 2012', 'Actors': 'Liam McIntyre, Katrina Law, Dustin Clare, Lucy Lawless, Manu Bennett', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Steven S. DeKnight, Sam Raimi, Joshua Donen', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '3'}\nReview Text: I got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection. Learned that the actor who played Spartacus actually died in real life...a great loss.\nReview Title: A Keeper\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Blood and Sand: Season 1\nReview Date: 2013/08/16\nStore: Andy Whitfield  (Actor),     John Hannah  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Betrayed by the Romans. Forced into slavery. Reborn as a Gladiator. The classic tale of the Republic’s most infamous rebel comes alive in the graphic and visceral new series,', 'Spartacus: Blood and Sand', '. Torn from his homeland and the woman he loves, Spartacus is condemned to the brutal world of the arena where blood and death are primetime entertainment. But not all battles are fought upon the sands. Treachery, corruption, and the allure of sensual pleasures will constantly test Spartacus. To survive, he must become more than a man. More than a gladiator. He must become a legend.', 'Amazon.com', 'The \"sword and sandals\" genre isn\\'t exactly known for its subtlety and restraint, but even by those standards,', 'Spartacus: Blood and Sand', 'is deliriously, delightfully over the top. Viewers familiar with the 1960 film starring Kirk Douglas and directed by Stanley Kubrick, the best-known version of the Spartacus tale, will recognize the basic outline of the story: a Thracian warrior with a beautiful, loving wife is betrayed by his Roman \"allies\" and forced into slavery, whereupon he distinguishes himself as a gladiator nonpareil and, after enduring countless indignities, leads his brethren and others in a rebellion against their oppressors. But there\\'s a lot more', 'Caligula', 'than Kubrick in the 13 first-season episodes (each a bit less than an hour long) of this Starz television series, which stars Andy Whitfield in the title role and also features Lucy Lawless (', 'Xena: Warrior Princess', \") as the wicked wife of Spartacus's owner. The fight scenes are highly stylized (the entire production seems to have taken a cue from the surreal, painterly look of\", '300', \") but extraordinarily brutal, featuring multiple dismemberments and decapitations amidst seas of slow-motion, CGI-generated blood; a gladiatorial battle in episode 5 pitting Spartacus and his rival-turned-ally Crixus (Manu Bennett) against a monster named Theokoles is definitely not for the squeamish, but that's only one of many such scenes. There's also ample sex and nudity, as the couplings involving various studly gladiators and lustful Roman noblewomen are like salacious combat between Chippendales dancers and Victoria's Secret models. Meanwhile, the personal relationships are the stuff of soap operas, with the Romans in particular depicted as relentlessly decadent, duplicitous, and power-hungry.\", 'If this all sounds outrageously entertaining, it is, though perhaps not for everyone. And although the future of the show (which was executive produced by', 'Spider-Man', 'director Sam Raimi) is in doubt due to Whitfield\\'s ongoing battle with cancer, we\\'ll always have this season to revel in. Bonus material in the four-disc set includes audio commentary on a variety of episodes and a batch of featurettes, most prominently a 15-minute \"making of\" documentary.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, John Hannah, Siaosi Fonua, Jai Courtney, Rob Tapert, Lesley-Ann Brandt, Steven S. DeKnight, Andy Whitfield, Joshua Donen, David Austin, Craig Walsh Wrightson, Viva Bianca, Nick Tarabay, Lucy LawlessSam Raimi, Peter Mensah, John Hannah, Siaosi Fonua, Jai Courtney, Rob Tapert, Lesley-Ann Brandt, Steven S. DeKnight, Andy Whitfield, Joshua Donen, David Austin, Craig Walsh Wrightson, Viva Bianca, Nick Tarabay, Lucy Lawless  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'Spartacus 1', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '11 hours and 32 minutes', 'Release date': 'February 7, 2012', 'Actors': 'Andy Whitfield, John Hannah, Peter Mensah, Lucy Lawless, Nick Tarabay', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection. Learned that the actor who played Spartacus actually died in real life...a great loss.\nReview Title: A Keeper\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/17\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Todd Haynes'], 'Producers': ['Ilene S. Landress'], 'Starring': ['Kate Winslet', 'Guy Pearce', 'James Le Gros'], 'Studio': ['HBO']}\nReview Text: This was a good spin on the original Mildred Pierce, with I believe Joan Crawford.\nReview Title: A Good Spin-off of the Original\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/24\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lesli Linka Glatter', 'Clark Johnson', 'Michael Offer', 'Adam Arkin', 'Paris Barclay', 'Jean de Segonzac', 'Guy Ferland', 'Billy Gierhart', 'Charles McDougall', \"Terrence O'Hara\"], 'Studio': ['FOX']}\nReview Text: a really good show\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/24\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['José Padilha'], 'Producers': ['Gary Barber', 'Roger Birnbaum'], 'Starring': ['Jay Baruchel', 'Abbie Cornish'], 'Studio': ['MGM']}\nReview Text: Some remakes of movies are not so good. but...this is a good remake.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Bernstein', 'Alex Zakrzewski', 'Nick Gomez', 'Jean de Segonzac', 'Darnell Martin', 'Keith Samples', 'J. Miller Tobin', 'Leslie Libman', 'Alan Taylor', 'Terry Kinney'], 'Starring': ['Ernie Hudson', 'Terry Kinney', 'Rita Moreno'], 'Studio': ['HBO']}\nReview Text: as good as the previous seasons\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/28\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Beth McCarthy-Miller'], 'Producers': ['Liz Stanton', 'Wanda Sykes'], 'Starring': ['Wanda Sykes'], 'Studio': ['HBO']}\nReview Text: love this woman.....\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/10\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Fleming'], 'Producers': ['Douglas Wick'], 'Starring': ['Robin Tunney', 'Fairuza Balk', 'Neve Campbell'], 'Studio': ['Sony Pictures']}\nReview Text: cool movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference": "Stretch, Turn-out, & Extension\nFormat: DVD\nMovies & TV, Musicals & Performing Arts, Ballet & Dance\n['In this new video, Finis Jhung has created 17 exercises especially designed to show you how to stretch safely and correctly so that you will strengthen and improve your turnout and extension. Finis shows and explains each exercise step-by-step, and then it is demonstrated by Isabella Boylston of The American Ballet Theater. The floor exercises are done both sitting up as well as lying down, which allows you to stretch without stress or strain on your muscles and joints. Each barre exercise includes detailed instructions and demonstrations on how to bring your floor stretches to a standing position while displaying your maximum turnout and extension with balance and control. Teaching in New York City since 1972, Finis Jhung has enabled thousands of dancers to become their personal best. As you will see, the secrets to success can be yours. FLOOR EXERCISES 1. Half split stretch 2. Full split stretch 3. Plié stretch with feet apart 4. Plié stretch with feet together 5. Développé to the front: on your side 6. Développé to the front: on your back 7. Développé to the side: on your back 8. Arabesque roll-ups BARRE EXERCISES 9. Strengthen your turn-out in plié 10. Rond de jambe à terre, en l’air, grand rond de jambe 11. Battement, fondu, développé to the front & side 12. Développé, battement fondu to the front & side 13. Arabesque stretch, penchée 14. Grand battement to the front, tombé, stretch 15. Grand battement to the back, stretch 16. Grand battement to the side 17. Adagio with grand rond de jambe']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.9 Ounces', 'Media Format': 'NTSC, DVD, Color', 'Run time': '1 hour and 30 minutes', 'Producers': 'Finis Jhung', 'Studio': 'Ballet Dynamics, Inc.', 'Number of discs': '1'}\nThis is the best stretch video ever!! Using this video will get me back in shape in no time. Not even painful.\nBallet Essentials\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['RZA'], 'Producers': ['Marc Abraham', 'Eric Newman', 'Eli Roth'], 'Starring': ['Russell Crowe', 'Cung Le', 'Lucy Liu'], 'Studio': ['Universal Pictures']}\nFantastic!! Thought I purchased the DVD but love the movie. Can view this movie over and over again. It's a keeper.\nKarate Movie\nTyler Perry's Aunt Bam's Place (The Play)\nCassi Davis  (Actor),     Jeffrey Lewis  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product Description', \"One weekend, Aunt Bam's nephew-in-law Stewart is granted a court-ordered visitation with his children. Although his new, much-younger wife Mona is a bundle of nerves, Stewart seizes the opportunity to reconnect with his children, whom he loves dearly. Then their mother, his ex-wife Gloria, shows up drunk. It will take Madea's partner-in-crime, Bam, to tame this situation and set a few things straight.\", 'Amazon.com', 'Her silver bouffant towering a foot above her head, Aunt Bam (Cassi Davis,', 'House of Payne', \") solves her family's problems with a sharp tongue and tough love. Stewart (Maurice Lauchner), divorced and remarried to a much younger wife, Mona (Taral Hicks), must fight to have access to his children (Paris Bennett and Jeffery Lewis). But he doesn't know just how angry his ex-wife Gloria (Melonie Daniels) is, and the lengths to which she'll go to turn his son against him. Can Aunt Bam save this family? Well, really, there's not much doubt, but\", \"Aunt Bam's Place\", \"glides along smoothly with snappy comedy, heartfelt Christian sentiment, and gospel songs (every character gets his or her own showstopping number). The play was filmed in front of a live audience at an Atlanta theater, giving it the look of a standard sitcom. Its greatest strength--besides Aunt Bam's crowd-pleasing wisecracks--is that it extends compassion to every character. Gloria, demonized though she is, has her own song wailing out her personal pain.\", \"Aunt Bam's Place\", 'is straight-ahead Tyler Perry (creator of Madea, director of', 'Diary of a Mad Black Woman', 'and', 'I Can Do Bad All by Myself', \"). Anyone who doesn't already like his work, where lives and souls are saved by song, prayer, and sass, will not be converted here. But anyone who appreciates this hard-working auteur's movies and TV shows will enjoy this play.\", '--Bret Fetzer']\n{'Genre': 'Romantic Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Melonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris BennettMelonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris Bennett   See more', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT32422DVD', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'June 12, 2012', 'Actors': 'Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Taral Hicks, Melonie Daniels', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Producers': 'Eric Fellner, Mark E. Swinton, Tyler Perry, Nira Park, Tim Bevan', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nTyler Perry Fan\nTyler Perry's I Don't Want to Do Wrong - The Play\nKislyck \"Kissy\" Halsey  (Actor),     Alexis Jones  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Product Description', 'Palmer Williams Jr.. and Patrice Lovely anchor a powerhouse cast portraying an American family facing the challenge of having a loved-one in the armed forces and many of the hilarious and outrageous obstacles that come with it.', 'Amazon.com', 'Tyler Perry is one of the most prolific writers in American film--and for the American stage.', \"I Don't Want to Do Wrong\", \"is one of Perry's musical plays, with the signature uplifting Tyler Perry message, delivered in a heartfelt way by very talented actors. There's no Madea in\", \"I Don't Want to Do Wrong\", \", but the hilarious Patrice Lovely takes the place of the matriarch who keeps things on track, with sass and attitude. The story is a simple one, centering on what happens when a marriage is strained by distance. A young woman, Yolanda (Alexis Jones), is tempted by an extramarital affair when her husband is deployed to Iraq. She moves in with her wacky parents, Reverend Wallace (Palmer Williams Jr.) and Hattie (Lovely)--who seem to be deeply in love after many years of marriage--but are they? The story is simple, the ending uplifting, and the journey one of smiles and crude laughter, and just a little heart-tugging. If you're a Tyler Perry fan, and you don't want to do wrong, you can't go wrong by watching\", \"I Don't Want to Do Wrong\", '. --', 'A.T. Hurley']\n{'Genre': 'Black Comedy', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Contributor': 'Tony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne WeinertTony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne Weinert  See more', 'Language': 'English', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '33044', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Kislyck \"Kissy\" Halsey, Alexis Jones, Andre Pitre, Tony Hightower, Palmer Williams, Jr.', 'Subtitles': 'Spanish, English', 'Producers': 'Suzanne Weinert, Tanner Beard, Tyler Perry, Jay Michaelson', 'Studio': 'Lionsgate Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nTyler Perry Fan\nSpartacus: Gods Of The Arena - The Complete Collection [DVD]\nJohn Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Movies\n['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\n{'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection.\nA Keeper\nSpartacus: Vengeance: Season 2\nLiam McIntyre  (Actor),     Katrina Law  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['10-episode sequel to “Spartacus: Blood & Sand.” On the heels of the bloody escape from the House of Batiatus that concluded “Spartacus: Blood and Sand,” the gladiator rebellion continues and begins to strike fear into the heart of the Roman Republic in “Spartacus: Vengeance.” Gaius Claudius Glaber and his Roman troops are sent to Capua to crush the growing band of freed slaves that Spartacus leads before it can inflict further damage. Spartacus is presented the choice of satisfying his personal need for vengeance against the man who condemned his wife to slavery and eventual death or making the larger sacrifices necessary to keep his budding army from breaking apart. Containing all of the blood-soaked action, exotic sexuality, and villainy and heroism that has come to distinguish the series, the tale of Spartacus resumes in epic fashion. Includes tons of never-before-seen bonus features including featurettes, extended scenes and Content Too Risqué for CABLE TV.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Rob Tapert, Sam Raimi, Peter Mensah, Steven S. DeKnight, Joshua Donen, Manu Bennett, Katrina Law, Lucy Lawless, Liam McIntyre, Dustin ClareRob Tapert, Sam Raimi, Peter Mensah, Steven S. DeKnight, Joshua Donen, Manu Bennett, Katrina Law, Lucy Lawless, Liam McIntyre, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.7 x 7.5 inches; 2.72 Ounces', 'Item model number': '540948195', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '9 hours and 16 minutes', 'Release date': 'September 11, 2012', 'Actors': 'Liam McIntyre, Katrina Law, Dustin Clare, Lucy Lawless, Manu Bennett', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Steven S. DeKnight, Sam Raimi, Joshua Donen', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '3'}\nI got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection. Learned that the actor who played Spartacus actually died in real life...a great loss.\nA Keeper\nSpartacus: Blood and Sand: Season 1\nAndy Whitfield  (Actor),     John Hannah  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Betrayed by the Romans. Forced into slavery. Reborn as a Gladiator. The classic tale of the Republic’s most infamous rebel comes alive in the graphic and visceral new series,', 'Spartacus: Blood and Sand', '. Torn from his homeland and the woman he loves, Spartacus is condemned to the brutal world of the arena where blood and death are primetime entertainment. But not all battles are fought upon the sands. Treachery, corruption, and the allure of sensual pleasures will constantly test Spartacus. To survive, he must become more than a man. More than a gladiator. He must become a legend.', 'Amazon.com', 'The \"sword and sandals\" genre isn\\'t exactly known for its subtlety and restraint, but even by those standards,', 'Spartacus: Blood and Sand', 'is deliriously, delightfully over the top. Viewers familiar with the 1960 film starring Kirk Douglas and directed by Stanley Kubrick, the best-known version of the Spartacus tale, will recognize the basic outline of the story: a Thracian warrior with a beautiful, loving wife is betrayed by his Roman \"allies\" and forced into slavery, whereupon he distinguishes himself as a gladiator nonpareil and, after enduring countless indignities, leads his brethren and others in a rebellion against their oppressors. But there\\'s a lot more', 'Caligula', 'than Kubrick in the 13 first-season episodes (each a bit less than an hour long) of this Starz television series, which stars Andy Whitfield in the title role and also features Lucy Lawless (', 'Xena: Warrior Princess', \") as the wicked wife of Spartacus's owner. The fight scenes are highly stylized (the entire production seems to have taken a cue from the surreal, painterly look of\", '300', \") but extraordinarily brutal, featuring multiple dismemberments and decapitations amidst seas of slow-motion, CGI-generated blood; a gladiatorial battle in episode 5 pitting Spartacus and his rival-turned-ally Crixus (Manu Bennett) against a monster named Theokoles is definitely not for the squeamish, but that's only one of many such scenes. There's also ample sex and nudity, as the couplings involving various studly gladiators and lustful Roman noblewomen are like salacious combat between Chippendales dancers and Victoria's Secret models. Meanwhile, the personal relationships are the stuff of soap operas, with the Romans in particular depicted as relentlessly decadent, duplicitous, and power-hungry.\", 'If this all sounds outrageously entertaining, it is, though perhaps not for everyone. And although the future of the show (which was executive produced by', 'Spider-Man', 'director Sam Raimi) is in doubt due to Whitfield\\'s ongoing battle with cancer, we\\'ll always have this season to revel in. Bonus material in the four-disc set includes audio commentary on a variety of episodes and a batch of featurettes, most prominently a 15-minute \"making of\" documentary.', '--Sam Graham']\n{'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, John Hannah, Siaosi Fonua, Jai Courtney, Rob Tapert, Lesley-Ann Brandt, Steven S. DeKnight, Andy Whitfield, Joshua Donen, David Austin, Craig Walsh Wrightson, Viva Bianca, Nick Tarabay, Lucy LawlessSam Raimi, Peter Mensah, John Hannah, Siaosi Fonua, Jai Courtney, Rob Tapert, Lesley-Ann Brandt, Steven S. DeKnight, Andy Whitfield, Joshua Donen, David Austin, Craig Walsh Wrightson, Viva Bianca, Nick Tarabay, Lucy Lawless  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'Spartacus 1', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '11 hours and 32 minutes', 'Release date': 'February 7, 2012', 'Actors': 'Andy Whitfield, John Hannah, Peter Mensah, Lucy Lawless, Nick Tarabay', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '4'}\nI got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection. Learned that the actor who played Spartacus actually died in real life...a great loss.\nA Keeper\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Todd Haynes'], 'Producers': ['Ilene S. Landress'], 'Starring': ['Kate Winslet', 'Guy Pearce', 'James Le Gros'], 'Studio': ['HBO']}\nThis was a good spin on the original Mildred Pierce, with I believe Joan Crawford.\nA Good Spin-off of the Original\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lesli Linka Glatter', 'Clark Johnson', 'Michael Offer', 'Adam Arkin', 'Paris Barclay', 'Jean de Segonzac', 'Guy Ferland', 'Billy Gierhart', 'Charles McDougall', \"Terrence O'Hara\"], 'Studio': ['FOX']}\na really good show\nFive Stars\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['José Padilha'], 'Producers': ['Gary Barber', 'Roger Birnbaum'], 'Starring': ['Jay Baruchel', 'Abbie Cornish'], 'Studio': ['MGM']}\nSome remakes of movies are not so good. but...this is a good remake.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Bernstein', 'Alex Zakrzewski', 'Nick Gomez', 'Jean de Segonzac', 'Darnell Martin', 'Keith Samples', 'J. Miller Tobin', 'Leslie Libman', 'Alan Taylor', 'Terry Kinney'], 'Starring': ['Ernie Hudson', 'Terry Kinney', 'Rita Moreno'], 'Studio': ['HBO']}\nas good as the previous seasons\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Beth McCarthy-Miller'], 'Producers': ['Liz Stanton', 'Wanda Sykes'], 'Starring': ['Wanda Sykes'], 'Studio': ['HBO']}\nlove this woman.....\nFive Stars\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Fleming'], 'Producers': ['Douglas Wick'], 'Starring': ['Robin Tunney', 'Fairuza Balk', 'Neve Campbell'], 'Studio': ['Sony Pictures']}\ncool movie\nFive Stars",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Stretch, Turn-out, & Extension\nReview Date: 2013/03/24\nStore: Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Ballet & Dance\nProduct Description: ['In this new video, Finis Jhung has created 17 exercises especially designed to show you how to stretch safely and correctly so that you will strengthen and improve your turnout and extension. Finis shows and explains each exercise step-by-step, and then it is demonstrated by Isabella Boylston of The American Ballet Theater. The floor exercises are done both sitting up as well as lying down, which allows you to stretch without stress or strain on your muscles and joints. Each barre exercise includes detailed instructions and demonstrations on how to bring your floor stretches to a standing position while displaying your maximum turnout and extension with balance and control. Teaching in New York City since 1972, Finis Jhung has enabled thousands of dancers to become their personal best. As you will see, the secrets to success can be yours. FLOOR EXERCISES 1. Half split stretch 2. Full split stretch 3. Plié stretch with feet apart 4. Plié stretch with feet together 5. Développé to the front: on your side 6. Développé to the front: on your back 7. Développé to the side: on your back 8. Arabesque roll-ups BARRE EXERCISES 9. Strengthen your turn-out in plié 10. Rond de jambe à terre, en l’air, grand rond de jambe 11. Battement, fondu, développé to the front & side 12. Développé, battement fondu to the front & side 13. Arabesque stretch, penchée 14. Grand battement to the front, tombé, stretch 15. Grand battement to the back, stretch 16. Grand battement to the side 17. Adagio with grand rond de jambe']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.9 Ounces', 'Media Format': 'NTSC, DVD, Color', 'Run time': '1 hour and 30 minutes', 'Producers': 'Finis Jhung', 'Studio': 'Ballet Dynamics, Inc.', 'Number of discs': '1'}\nReview Text: This is the best stretch video ever!! Using this video will get me back in shape in no time. Not even painful.\nReview Title: Ballet Essentials\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/03/24\nAverage Rating: 4.4\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['RZA'], 'Producers': ['Marc Abraham', 'Eric Newman', 'Eli Roth'], 'Starring': ['Russell Crowe', 'Cung Le', 'Lucy Liu'], 'Studio': ['Universal Pictures']}\nReview Text: Fantastic!! Thought I purchased the DVD but love the movie. Can view this movie over and over again. It's a keeper.\nReview Title: Karate Movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tyler Perry's Aunt Bam's Place (The Play)\nReview Date: 2013/08/16\nStore: Cassi Davis  (Actor),     Jeffrey Lewis  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: ['Product Description', \"One weekend, Aunt Bam's nephew-in-law Stewart is granted a court-ordered visitation with his children. Although his new, much-younger wife Mona is a bundle of nerves, Stewart seizes the opportunity to reconnect with his children, whom he loves dearly. Then their mother, his ex-wife Gloria, shows up drunk. It will take Madea's partner-in-crime, Bam, to tame this situation and set a few things straight.\", 'Amazon.com', 'Her silver bouffant towering a foot above her head, Aunt Bam (Cassi Davis,', 'House of Payne', \") solves her family's problems with a sharp tongue and tough love. Stewart (Maurice Lauchner), divorced and remarried to a much younger wife, Mona (Taral Hicks), must fight to have access to his children (Paris Bennett and Jeffery Lewis). But he doesn't know just how angry his ex-wife Gloria (Melonie Daniels) is, and the lengths to which she'll go to turn his son against him. Can Aunt Bam save this family? Well, really, there's not much doubt, but\", \"Aunt Bam's Place\", \"glides along smoothly with snappy comedy, heartfelt Christian sentiment, and gospel songs (every character gets his or her own showstopping number). The play was filmed in front of a live audience at an Atlanta theater, giving it the look of a standard sitcom. Its greatest strength--besides Aunt Bam's crowd-pleasing wisecracks--is that it extends compassion to every character. Gloria, demonized though she is, has her own song wailing out her personal pain.\", \"Aunt Bam's Place\", 'is straight-ahead Tyler Perry (creator of Madea, director of', 'Diary of a Mad Black Woman', 'and', 'I Can Do Bad All by Myself', \"). Anyone who doesn't already like his work, where lives and souls are saved by song, prayer, and sass, will not be converted here. But anyone who appreciates this hard-working auteur's movies and TV shows will enjoy this play.\", '--Bret Fetzer']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Romantic Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Melonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris BennettMelonie Daniels, Mark E. Swinton, Cassie Davis, Eric Fellner, Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Nira Park, Taral Hicks, Tyler Perry, Derrick Doose, Tim Bevan, Melanie Daniels, Paris Bennett   See more', 'Language': 'English', 'Runtime': '1 hour and 44 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT32422DVD', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'June 12, 2012', 'Actors': 'Cassi Davis, Jeffrey Lewis, Maurice C. Lauchner, Taral Hicks, Melonie Daniels', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, English', 'Producers': 'Eric Fellner, Mark E. Swinton, Tyler Perry, Nira Park, Tim Bevan', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nReview Title: Tyler Perry Fan\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tyler Perry's I Don't Want to Do Wrong - The Play\nReview Date: 2013/08/16\nStore: Kislyck \"Kissy\" Halsey  (Actor),     Alexis Jones  (Actor),     Tyler Perry  (Director, Producer),     Derrick Doose  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Product Description', 'Palmer Williams Jr.. and Patrice Lovely anchor a powerhouse cast portraying an American family facing the challenge of having a loved-one in the armed forces and many of the hilarious and outrageous obstacles that come with it.', 'Amazon.com', 'Tyler Perry is one of the most prolific writers in American film--and for the American stage.', \"I Don't Want to Do Wrong\", \"is one of Perry's musical plays, with the signature uplifting Tyler Perry message, delivered in a heartfelt way by very talented actors. There's no Madea in\", \"I Don't Want to Do Wrong\", \", but the hilarious Patrice Lovely takes the place of the matriarch who keeps things on track, with sass and attitude. The story is a simple one, centering on what happens when a marriage is strained by distance. A young woman, Yolanda (Alexis Jones), is tempted by an extramarital affair when her husband is deployed to Iraq. She moves in with her wacky parents, Reverend Wallace (Palmer Williams Jr.) and Hattie (Lovely)--who seem to be deeply in love after many years of marriage--but are they? The story is simple, the ending uplifting, and the journey one of smiles and crude laughter, and just a little heart-tugging. If you're a Tyler Perry fan, and you don't want to do wrong, you can't go wrong by watching\", \"I Don't Want to Do Wrong\", '. --', 'A.T. Hurley']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Black Comedy', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Contributor': 'Tony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne WeinertTony Hightower, Patrice Lovely, Alexis Jones, Andre Pitre, Kislyck \"Kissy\" Halsey, Palmer Williams Jr., Jay Michaelson, Tyler Perry, Derrick Doose, Palmer Williams, Jr., Tanner Beard, Suzanne Weinert  See more', 'Language': 'English', 'Runtime': '1 hour and 53 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '33044', 'Director': 'Tyler Perry, Derrick Doose', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 23, 2012', 'Actors': 'Kislyck \"Kissy\" Halsey, Alexis Jones, Andre Pitre, Tony Hightower, Palmer Williams, Jr.', 'Subtitles': 'Spanish, English', 'Producers': 'Suzanne Weinert, Tanner Beard, Tyler Perry, Jay Michaelson', 'Studio': 'Lionsgate Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I missed this dvd in his collection. The price was reasonable. I recommend this product to any fan who loves T.P.'s work.\nReview Title: Tyler Perry Fan\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Gods Of The Arena - The Complete Collection [DVD]\nReview Date: 2013/08/16\nStore: John Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection.\nReview Title: A Keeper\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Vengeance: Season 2\nReview Date: 2013/08/16\nStore: Liam McIntyre  (Actor),     Katrina Law  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['10-episode sequel to “Spartacus: Blood & Sand.” On the heels of the bloody escape from the House of Batiatus that concluded “Spartacus: Blood and Sand,” the gladiator rebellion continues and begins to strike fear into the heart of the Roman Republic in “Spartacus: Vengeance.” Gaius Claudius Glaber and his Roman troops are sent to Capua to crush the growing band of freed slaves that Spartacus leads before it can inflict further damage. Spartacus is presented the choice of satisfying his personal need for vengeance against the man who condemned his wife to slavery and eventual death or making the larger sacrifices necessary to keep his budding army from breaking apart. Containing all of the blood-soaked action, exotic sexuality, and villainy and heroism that has come to distinguish the series, the tale of Spartacus resumes in epic fashion. Includes tons of never-before-seen bonus features including featurettes, extended scenes and Content Too Risqué for CABLE TV.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Rob Tapert, Sam Raimi, Peter Mensah, Steven S. DeKnight, Joshua Donen, Manu Bennett, Katrina Law, Lucy Lawless, Liam McIntyre, Dustin ClareRob Tapert, Sam Raimi, Peter Mensah, Steven S. DeKnight, Joshua Donen, Manu Bennett, Katrina Law, Lucy Lawless, Liam McIntyre, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.7 x 7.5 inches; 2.72 Ounces', 'Item model number': '540948195', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '9 hours and 16 minutes', 'Release date': 'September 11, 2012', 'Actors': 'Liam McIntyre, Katrina Law, Dustin Clare, Lucy Lawless, Manu Bennett', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Steven S. DeKnight, Sam Raimi, Joshua Donen', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '3'}\nReview Text: I got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection. Learned that the actor who played Spartacus actually died in real life...a great loss.\nReview Title: A Keeper\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Blood and Sand: Season 1\nReview Date: 2013/08/16\nStore: Andy Whitfield  (Actor),     John Hannah  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Betrayed by the Romans. Forced into slavery. Reborn as a Gladiator. The classic tale of the Republic’s most infamous rebel comes alive in the graphic and visceral new series,', 'Spartacus: Blood and Sand', '. Torn from his homeland and the woman he loves, Spartacus is condemned to the brutal world of the arena where blood and death are primetime entertainment. But not all battles are fought upon the sands. Treachery, corruption, and the allure of sensual pleasures will constantly test Spartacus. To survive, he must become more than a man. More than a gladiator. He must become a legend.', 'Amazon.com', 'The \"sword and sandals\" genre isn\\'t exactly known for its subtlety and restraint, but even by those standards,', 'Spartacus: Blood and Sand', 'is deliriously, delightfully over the top. Viewers familiar with the 1960 film starring Kirk Douglas and directed by Stanley Kubrick, the best-known version of the Spartacus tale, will recognize the basic outline of the story: a Thracian warrior with a beautiful, loving wife is betrayed by his Roman \"allies\" and forced into slavery, whereupon he distinguishes himself as a gladiator nonpareil and, after enduring countless indignities, leads his brethren and others in a rebellion against their oppressors. But there\\'s a lot more', 'Caligula', 'than Kubrick in the 13 first-season episodes (each a bit less than an hour long) of this Starz television series, which stars Andy Whitfield in the title role and also features Lucy Lawless (', 'Xena: Warrior Princess', \") as the wicked wife of Spartacus's owner. The fight scenes are highly stylized (the entire production seems to have taken a cue from the surreal, painterly look of\", '300', \") but extraordinarily brutal, featuring multiple dismemberments and decapitations amidst seas of slow-motion, CGI-generated blood; a gladiatorial battle in episode 5 pitting Spartacus and his rival-turned-ally Crixus (Manu Bennett) against a monster named Theokoles is definitely not for the squeamish, but that's only one of many such scenes. There's also ample sex and nudity, as the couplings involving various studly gladiators and lustful Roman noblewomen are like salacious combat between Chippendales dancers and Victoria's Secret models. Meanwhile, the personal relationships are the stuff of soap operas, with the Romans in particular depicted as relentlessly decadent, duplicitous, and power-hungry.\", 'If this all sounds outrageously entertaining, it is, though perhaps not for everyone. And although the future of the show (which was executive produced by', 'Spider-Man', 'director Sam Raimi) is in doubt due to Whitfield\\'s ongoing battle with cancer, we\\'ll always have this season to revel in. Bonus material in the four-disc set includes audio commentary on a variety of episodes and a batch of featurettes, most prominently a 15-minute \"making of\" documentary.', '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, John Hannah, Siaosi Fonua, Jai Courtney, Rob Tapert, Lesley-Ann Brandt, Steven S. DeKnight, Andy Whitfield, Joshua Donen, David Austin, Craig Walsh Wrightson, Viva Bianca, Nick Tarabay, Lucy LawlessSam Raimi, Peter Mensah, John Hannah, Siaosi Fonua, Jai Courtney, Rob Tapert, Lesley-Ann Brandt, Steven S. DeKnight, Andy Whitfield, Joshua Donen, David Austin, Craig Walsh Wrightson, Viva Bianca, Nick Tarabay, Lucy Lawless  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'Spartacus 1', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '11 hours and 32 minutes', 'Release date': 'February 7, 2012', 'Actors': 'Andy Whitfield, John Hannah, Peter Mensah, Lucy Lawless, Nick Tarabay', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '4'}\nReview Text: I got interested in this series after watching the last episodes in this epic collection. I had to own the entire collection. The theme of this movie has made me want to know all the players from beginning to end. Glad I have it to add to my collection. I recommend the entire collection. Learned that the actor who played Spartacus actually died in real life...a great loss.\nReview Title: A Keeper\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/17\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Todd Haynes'], 'Producers': ['Ilene S. Landress'], 'Starring': ['Kate Winslet', 'Guy Pearce', 'James Le Gros'], 'Studio': ['HBO']}\nReview Text: This was a good spin on the original Mildred Pierce, with I believe Joan Crawford.\nReview Title: A Good Spin-off of the Original\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/24\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Lesli Linka Glatter', 'Clark Johnson', 'Michael Offer', 'Adam Arkin', 'Paris Barclay', 'Jean de Segonzac', 'Guy Ferland', 'Billy Gierhart', 'Charles McDougall', \"Terrence O'Hara\"], 'Studio': ['FOX']}\nReview Text: a really good show\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/24\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['José Padilha'], 'Producers': ['Gary Barber', 'Roger Birnbaum'], 'Starring': ['Jay Baruchel', 'Abbie Cornish'], 'Studio': ['MGM']}\nReview Text: Some remakes of movies are not so good. but...this is a good remake.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Bernstein', 'Alex Zakrzewski', 'Nick Gomez', 'Jean de Segonzac', 'Darnell Martin', 'Keith Samples', 'J. Miller Tobin', 'Leslie Libman', 'Alan Taylor', 'Terry Kinney'], 'Starring': ['Ernie Hudson', 'Terry Kinney', 'Rita Moreno'], 'Studio': ['HBO']}\nReview Text: as good as the previous seasons\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/28\nAverage Rating: 4.7\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Beth McCarthy-Miller'], 'Producers': ['Liz Stanton', 'Wanda Sykes'], 'Starring': ['Wanda Sykes'], 'Studio': ['HBO']}\nReview Text: love this woman.....\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/06/10\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Andrew Fleming'], 'Producers': ['Douglas Wick'], 'Starring': ['Robin Tunney', 'Fairuza Balk', 'Neve Campbell'], 'Studio': ['Sony Pictures']}\nReview Text: cool movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n1. **Entertainment Focus**: Strong interest in musicals, dramas, and comedies, particularly those related to dance and theater.\n\n2. **Ballet & Dance**: Consistent purchases in resources that enhance dance skills, revealing a commitment to personal development in this area.\n\n3. **Tyler Perry Productions**: Multiple purchases of plays and films by Tyler Perry suggest a strong affinity for his storytelling style and themes of family and resilience.\n\n4. **Action & Adventure**: A preference for intense storytelling is highlighted by interest in epic series featuring themes like rebellion and personal vendettas.\n\n5. **Viewer Engagement**: High ratings and positive feedback indicate a tendency to seek out quality content, often reflecting enjoyment of storytelling that combines humor and deeper family or relationship issues.\n\n6. **Rewatch Value**: Selection of films that can be viewed multiple times suggests loyalty to favorite genres and a desire for content that provides comfort and familiarity.\n\n7. **Overall Satisfaction**: Reviews commonly express excitement and appreciation for the value and quality of products, indicating discerning taste and engagement with purchased content.\n\n8. **Open to Remakes**: General acceptance and positive feedback on remakes of classic films, suggesting a willingness to explore new interpretations of traditional stories.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Five Stars",
    "text": "The truth",
    "images": [],
    "asin": "B00BSEJR9C",
    "parent_asin": "B00BSEJR9C",
    "user_id": "AFM3BTFQFZAZBNEWWTTUW4ZJRBVA",
    "timestamp": "2016-08-09 18:34:38",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.6,
    "rating_number": 14682,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/ac467704ecf362f35fa32a3753f924e8dde1dc20b10ef8e1a3e7b71abbd90914._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/ac467704ecf362f35fa32a3753f924e8dde1dc20b10ef8e1a3e7b71abbd90914._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/ac467704ecf362f35fa32a3753f924e8dde1dc20b10ef8e1a3e7b71abbd90914._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/ac467704ecf362f35fa32a3753f924e8dde1dc20b10ef8e1a3e7b71abbd90914._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/ac467704ecf362f35fa32a3753f924e8dde1dc20b10ef8e1a3e7b71abbd90914._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/ac467704ecf362f35fa32a3753f924e8dde1dc20b10ef8e1a3e7b71abbd90914._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "substance use",
        "alcohol use",
        "smoking",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Joe Chappelle",
        "Ernest R. Dickerson",
        "Clark Johnson",
        "Ed Bianchi",
        "Steve Shill",
        "Daniel Attias",
        "Timothy Van Patten",
        "Agnieszka Holland",
        "Brad Anderson",
        "Clement Virgo"
      ],
      "Producers": [
        "David Simon",
        "Robert F. Colesberry",
        "Nina Kostroff Noble"
      ],
      "Starring": [
        "Dominic West",
        "Sonja Sohn",
        "Lance Reddick"
      ],
      "Studio": [
        "HBO"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}