{
  "user_id": "AH3OG6QD6EDJGZRVCFKV4B66VWNQ",
  "summary": "=== Purchase Information ===\nProduct Title: David Leadbetter From Beginner to Winner\nReview Date: 2009/08/11\nStore: David Leadbetter  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Special Interests\nProduct Description: ['David Leadbetter, renowned for working with the world\\x92s top golfers including Michelle Wie, Ernie Els and Nick Price has designed a DVD aimed at improving a novice\\x92s game. Computer graphics have been combined with footage taken from all the key angles, to give the clearest possible understanding of the golf swing and how to correct common faults. Also covered are the essential components of the swing set-up, grip, posture, and alignment. By teaching you the fine art of pitching, chipping, bunker play and putting, Leadbetter instructs you on how to cut shots off your score when you are close to the green. Good course tactics are imperative to playing good golf. Key areas covered include developing a routine, picking strategic targets, club selection and \"swing thoughts\".']\nAverage Rating: 4.3\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'David Leadbetter', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.56 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 25, 2005', 'Actors': 'David Leadbetter', 'Studio': 'Well Go USA', 'Number of discs': '1'}\nReview Text: I never golfed and it helped me alot, I still watch it after 3 months, very helpful tips.\nReview Title: DVD Golf for Beginners\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rome - The Complete First Two Seasons\nReview Date: 2009/09/01\nStore: Kevin McKidd  (Actor),     Ray Stevenson  (Actor),     Adam Davidson  (Director),     Alan Poul  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product description', 'A generously budgeted show jointly produced by HBO and the BBC ROME takes viewers back to 52 B.C. for a chance to relive the reign of Julius Caesar. Details have been painstakingly researched to ensure accuracy so both history buffs and viewers less versed in the ways of Caesar should find something to enjoy here. The show also contains intricately woven plots fine acting and stunning recreations of the ancient city. This release contains the first two seasons of the show.Format: DVD MOVIE Genre: TELEVISION/SERIES & SEQUELS Rating: NR UPC: 026359795527 Manufacturer No: 97955', 'Amazon.com', \"Family dysfunction. Treachery. Betrayal. Coarse profanity. Brutal violence. Graphic (and sometimes brutal) sex. No, it's not\", 'The Sopranos', \", it's\", 'Rome', \", HBO's madly ambitious series that bloodily splatters the glory of Rome just as savagely as Monty\", 'Python and the Holy Grail', 'soiled the good name of Camelot (but with far fewer laughs; very few funny things happen on the way to this forum). Set in 52 B.C. (Before Cable),', 'Rome', 'charts the dramatic shifts in the balance of power between former friends Pompey Magnus (Kenneth Cranham), leader of the Senate, and Julius Caesar (Ciaran Hinds), whose imminent return after eight years to Rome after conquering the Gauls, has the ruling class up in arms. At the heart of Rome is the odd couple friendship between two soldiers who fortuitously become heroes of the people. Lucius Vorenus (Kevin McKidd) is married, honorable, and steadfast. Titus Pullo (Ray Stevenson) is an amoral rogue whose philosophy is best summed up, \"I kill my enemies, take their gold, and enjoy their women.\" Among', 'Rome', \"'s most compelling subplots is Lucius's strained relationship with his wife, Niobe (Indira Varma), who is surprised to see her husband alive (but not as surprised as he is to find her upon his homecoming with a newborn baby in her arms!) Any viewer befuddlement over\", 'Rome', \"'s intrigues and machinations, and determining who is hero and who is foe, disappears the minute Golden Globe-nominee Polly Walker appears as Atia, Caesar's formidable niece and a villainess for the ages. In the first hour alone, she offers her already married daughter as a bride to the recently widowed Pompey.\", 'Rome', 'is a painstakingly mounted production that earned eight well-deserved Emmy nominations in such categories as costumes, set design, and art direction. Michael Apted (', \"Coal Miner's Daughter\", ') was honored with a Director\\'s Guild Award for the first episode, \"The Stolen Eagle.\" But artistic considerations aside, instantly addicted viewers will agree with Atia, who notes at one point, \"I adore the secrecy, the intrigue. It\\'s most thrilling.\"', 'Season 2 begins in the wake of Julius Caesar\\'s assassination, and charts the power struggle to fill his sandals between \"vulgar beast\" Mark Antony (James Purefoy) and \"clever boy\" Octavian (Simon Woods), who is surprisingly named Caesar\\'s sole heir. The series\\' most compelling relationship is between fellow soldiers and unlikely friends, the honorable Lucius Vorenus (Kevin McKidd) and Titus \"Violence is the only trade I know\" Pullo (Ray Stevenson), who somewhat reverse roles when Vorenus is overcome with grief in the wake of his wife\\'s suicide. Season 2 considerably ups the ante in the rivalry between Atia (an Emmy-worthy Polly Walker), who is Antony\\'s mistress, and Servilia (Lindsay Duncan) with attempted poisonings and sickening torture. Another gripping subplot is Vorenus\\'s estrangement from his children, who, at the climax of the season opener are presumed slaughtered, but whose true fate may be even more devastating to the father who cursed them.', 'Rome', '\\'s second season does not scrimp on the series\\' sex and violence, in both cases exceedingly brutal. But in this cauldron of treachery and betrayal, words, too, are vicious, as when a defiant Atia ominously tells Octavian\\'s new wife, Livia, \"Far better women that you have sworn to [destroy me]. Go look for them now.\" In writing', 'Rome', \"'s epitaph, we come to praise this series, not to bury it. Although two seasons was not enough to establish a\", 'Rome', \"empire, it stands as one of HBO's crowning achievements.\", '--Donald Liebenson']\nAverage Rating: 4.7\nProduct Details: {'Format': 'NTSC, Widescreen, Color, Closed-captioned, Anamorphic', 'Contributor': 'Polly Walker, Indira Varma, Alan Taylor, Max Pirkis, Jeremy Podeswa, Kenneth Cranham, Kevin McKidd, Karl Johnson, David Bamber, Alan Poul, Alik Sakharov, John Maybury, Adam Davidson, Kerry Condon, Allen Coulter, Lindsay Duncan, Lee Boardman, Ray Stevenson, Tobias Menzies, Carl FranklinPolly Walker, Indira Varma, Alan Taylor, Max Pirkis, Jeremy Podeswa, Kenneth Cranham, Kevin McKidd, Karl Johnson, David Bamber, Alan Poul, Alik Sakharov, John Maybury, Adam Davidson, Kerry Condon, Allen Coulter, Lindsay Duncan, Lee Boardman, Ray Stevenson, To…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '11', 'Runtime': '22 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.7 x 5.9 x 3.2 inches; 1 Pounds', 'Item model number': '97955', 'Director': 'Adam Davidson, Alan Poul, Alan Taylor, Alik Sakharov, Allen Coulter', 'Media Format': 'NTSC, Widescreen, Color, Closed-captioned, Anamorphic', 'Run time': '22 hours', 'Release date': 'August 7, 2007', 'Actors': 'Kevin McKidd, Ray Stevenson, Polly Walker, Kenneth Cranham, Lindsay Duncan', 'Subtitles': 'English, French, Spanish', 'Studio': 'Hbo Home Video', 'Number of discs': '11'}\nReview Text: Loved the movies, but did not know it should have be rated more than R. Personal I do not like X sex in movies, but it really showd how people used to live und the Story ist fantastic, you really see how the Military and the soldier plus the rich and poor, how they suffered and triumpfed.  I would recommend for Adults not for Teenagers or children even the History and the Stories are excellent.\nReview Title: Rome -Complete First Two Seasons\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 24: Season 2\nReview Date: 2009/09/25\nStore: Kiefer Sutherland  (Actor),     Carlos Bernard  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['Product Description', 'Various', 'Amazon.com', 'Jack Bauer is having another one of his \"very bad days\" in the second season of the groundbreaking real-time thriller', '24', \". Once again the hours are ticking by with more guaranteed cliffhangers than a convention of mountain climbers. Holed up in a Los Angeles condo and estranged from his daughter, Jack is no longer on the government payroll; unfortunately for him, this small fact doesn't seem to matter to President David Palmer and the NSA, who call him back in to the CTU and give him 24 hours to infiltrate a terrorist organization that is planning to detonate a dirty bomb in the city of angels. All Jack wants is to get his daughter out of the city, unfortunately Kim's new employer, the abusive father of the child she is nannying, has other ideas.\", 'Fans of the', 'original', \"won't be disappointed, as there are more than enough shock moments in the first few hours to hint at the climactic build-up to come, while newcomers can quickly get involved in the lives of Jack and his family. There are some new characters to bolster the veteran cast and, interestingly (although not surprisingly), Jack's character has taken an altogether darker, more psychopathic turn. The danger the characters find themselves in also has a much more global, not to mention topical, impetus, grounded as it is in the war against terrorism. Although the territory is more familiar this time around, this second season is just as much a high-tension, taut, adrenalin-fuelled ride as the first, and one that will have you glued to your TV for the next 24 hours.\", '--Kristen Bowditch']\nAverage Rating: 4.8\nProduct Details: {'Format': \"Box set, Closed-captioned, Collector's Edition, Dolby, Dubbed, Subtitled, NTSC\", 'Contributor': 'Reiko Aylesworth, Carlos Bernard, Kiefer Sutherland, Penny Johnson Jerald, Xander Berkeley, Elisha Cuthbert, Sarah Wynter, Dennis HaysbertReiko Aylesworth, Carlos Bernard, Kiefer Sutherland, Penny Johnson Jerald, Xander Berkeley, Elisha Cuthbert, Sarah Wynter, Dennis Haysbert  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Number Of Discs': '7', 'Runtime': '17 hours and 44 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.97 x 5.72 x 7.56 inches; 1.15 Pounds', 'Media Format': \"Box set, Closed-captioned, Collector's Edition, Dolby, Dubbed, Subtitled, NTSC\", 'Run time': '17 hours and 44 minutes', 'Release date': 'September 9, 2003', 'Actors': 'Kiefer Sutherland, Carlos Bernard, Reiko Aylesworth, Sarah Wynter, Dennis Haysbert', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Network', 'Number of discs': '7'}\nReview Text: I started watching 24 and I noticed I missed a season. The Disc were high Qaulity und I really enjoyed them\nReview Title: TV show 24\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 24: Season 1\nReview Date: 2010/06/05\nStore: Kiefer Sutherland  (Actor),     Leslie Hope  (Actor),     Bryan Spicer  (Director),     Davis Guggenheim  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['The clock is ticking... Midnight. Jack Bauer, head of the Los Angeles Counter Terrorist Unit (CTU), is suddenly thrust into a chaotic and exhausting 24-hour marathon of death, deception and terror as he struggles to prevent the assassination of a presidential candidate, find the traitor within his own organization, and save his kidnapped wife and daughter.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Vicellous Reon Shannon, Bryan Spicer, Eric Balfour, Michael Bryan French, Davis Guggenheim, Paul Shapiro, Jude Ciccolella, Kiefer Sutherland, Leslie Hope, Elisha Cuthbert, Silas Weir Mitchell, Sarah Clarke, Stephen Hopkins, Michael Massee, Jon Cassar, Karina Arroyave, Winrich Kolbe, Dennis Haysbert, Frederick King Keller, Andrea NewmanVicellous Reon Shannon, Bryan Spicer, Eric Balfour, Michael Bryan French, Davis Guggenheim, Paul Shapiro, Jude Ciccolella, Kiefer Sutherland, Leslie Hope, Elisha Cuthbert, Silas Weir Mitchell, Sarah Clarke, Stephen Hopkins, Michael Massee, Jon Cassar, Karina Arroyave, Winri…  See more', 'Language': 'Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.44 x 7.71 inches; 8 Ounces', 'Item model number': '9980844855', 'Director': 'Bryan Spicer, Davis Guggenheim, Frederick King Keller, Jon Cassar, Paul Shapiro', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '19 hours and 12 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Kiefer Sutherland, Leslie Hope, Sarah Clarke, Elisha Cuthbert, Dennis Haysbert', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Andrea Newman', 'Number of discs': '6'}\nReview Text: I love buying this product, do not have time to watch my favorite show, I buy it once a year and can watch it all at once like a movie. Best thing they ever inventet DVD after TV seasons.  Inge Coffman[[ASIN:B002ZCY7SW 24: Season Eight]]\nReview Title: 24 Tv Series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/03/25\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Johan Renck'], 'Producers': ['Michael Hirst', \"Morgan O'Sullivan\", 'John Weber', 'James Flynn', 'Sherry Marsh', 'Alan Gasmer', 'Shelia Hockin', 'Steve Wakefield', 'Keith Thompson'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Gabriel Byrne', 'Clive Standen', 'Gustaf Skarsgard', 'George Blagden'], 'Studio': ['History']}\nReview Text: I would not gotten involved in this, but the first 2 seasons where OK. Than it looked like distorted, I come from EU and know about Vikings, this shows many truth about the culture, but I thing the producers used pot or something. No way did Vikings shave their hair, or looked like crazed tattooed dope addicts. It also showed them like blood crazed animals. Yes they blundered, raped, but usually they were sure the males were in wars or otherwise busy int the countries they blundered. This show after the 3rd season, is horrible, crazed, bloody beyond believe, What rally bothered me, not true the way Vikings looked all painted and nuts. One thing is true the females could be fighting and working with males. I would never allow my children to watch such a untrue brutal show.\nReview Title: Than it looked like distorted, I come from EU and know about ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/03/27\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]'], 'Directors': ['Ed Bazalgette', 'William McGregor'], 'Producers': ['Eliza Mellor'], 'Starring': ['Eleanor Tomlinson', 'Aidan Turner', 'Phil Davis'], 'Studio': ['Mammoth Screen']}\nReview Text: Just wonderful.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/14\nAverage Rating: 4.1\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Wang Jun'], 'Starring': ['Tanaka Yuko', 'Yu Shao Qun', 'Zhou Yi Wei'], 'Studio': ['Asian Crush']}\nReview Text: I never watched any foreign movies, because I had to read to much. Watched last week my first series, I loved the costumes and the actors, now this is my second movie &quot; The Queen and the Eunuch&quot; just great movies. I can not wait every night to watch it. Thank you Amazon.\nReview Title: I loved the costumes and the actors\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/24\nAverage Rating: 3.5\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['Русский'], 'Subtitles': ['English [CC]'], 'Directors': ['Maksim Bespalyi'], 'Producers': ['Valeriy Babich', 'Vlad Ryashin', 'Konstantin Ernst', 'Sergey Titinkov'], 'Starring': ['Ludmila Gamureac', 'Andrej Bestuzhev', 'Cyril Istratov'], 'Studio': ['Janson Media']}\nReview Text: I love these movies, but the subtitles are not long enough on the screen. I am a history major and know alot about history, a novice will not get the story no one can read fast enough. These countries have to do a better job with timing. I love also the Chinese movies, the English are longer on the screen.  I want to thank Amazon for having these history movies available. Thank  You.\nReview Title: Love the History\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/24\nAverage Rating: 3.9\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Marc Riviere'], 'Starring': ['Philippe Torreton', 'Alessandra Martines', 'Marc Citti'], 'Studio': ['Yuyu']}\nReview Text: A Wonderfull historical movie about the sun king of France. I love history, above the English subtitles stayed long enough to read, which is lacking in many Chinese and Russian movies. I still watch them, because I know history and love the colorful costumes.\nReview Title: Wonderfull acting\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/25\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Christian Twente', 'Christian Feyerabend']}\nReview Text: I love history and many of us are German descent, very educational. loved it.\nReview Title: Great History about a hero.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Secret File of Marco Polo\nReview Date: 2017/10/02\nCategories: Documentary, Cerebral, Stunning, Understated\nProduct Description: ['Did Marco Polo, the most illustrious traveler in history, ever go to China? A debate continues as to whether the Venetian’s book is a personal account of China’s 13th-century the Middle Kingdom and its marvels.']\nAverage Rating: 4.0\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabriele Wengler'], 'Producers': ['ECO Media TV-Produktion', 'ZDF', 'arte'], 'Starring': ['Ben Braun']}\nReview Text: I took History in college, been to Venice at the home of Marco. This video should be shown in schools. Verry interesting to anyone. Sad Americans do not teach their children. I loved the history of China and what a great culture these people had.\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Last Train Home (English Subtitled)\nReview Date: 2017/10/04\nCategories: Drama, International, Documentary\nProduct Description: [\"Working over several years in classic verité style, filmmaker Lixin Fan chronicles the mass exodus of 130 million Chinese migrant workers as they trek from the city to their home villages for the New Year's holiday. LAST TRAIN HOME's intimate observation of one fractured family sheds light on the human cost of China's ascendance as an economic superpower.\"]\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Lixin Fan'], 'Producers': ['Zhao Qi', 'Mila Aung-Thwin', 'Daniel Cross'], 'Starring': ['Qin Zhang', 'Suqin Chen', 'Yang Zhang']}\nReview Text: Tells me as a German-born immigrant to America, how blessed I have been to be raised in a Northern European culture and living in America which was made great by Northern Europeans the great founders of America.  Love my culture. I  wanted to go and visit China, God help me,  now I understand why they need the Americans and Europeans to invest in factories. The work like slaves.\nReview Title: The true China wow.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/11/22\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Evans', 'Robert Del Mastro', 'Joss Agnew', 'Lawrence Till', 'Dominic Barlow', 'Andrew Davies'], 'Producers': ['Kate Brooke'], 'Studio': ['ITV']}\nReview Text: great actor.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/01/10\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['Русский'], 'Subtitles': ['English [CC]'], 'Directors': ['Alexei Andrianov'], 'Producers': ['Kinokompaniya Moskino'], 'Starring': ['Mariya Andreeva', 'Eugeniy Tsiganov', 'Vilen Babichev']}\nReview Text: Beautiful movie, my eyes hurt from the reading, but it is fast passed and a great movie, never knew Russia made such grand movies, no expense was spared, loved the clothing and settings. Learned a lot about Russian history and how they got all these states around them, especially Mongolia. I have been in Moscow, enjoyed the history of the most magnificent buildings in Moscow.  Actually the Russians in that time period, where not as advanced as the rest of Europe. Italians thought the Russians how to build.\nReview Title: Beautiful movie, my eyes hurt from the reading\nRating: 5.0\n--------------------------------------------------",
  "reference": "David Leadbetter From Beginner to Winner\nDavid Leadbetter  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Independently Distributed, Special Interests\n['David Leadbetter, renowned for working with the world\\x92s top golfers including Michelle Wie, Ernie Els and Nick Price has designed a DVD aimed at improving a novice\\x92s game. Computer graphics have been combined with footage taken from all the key angles, to give the clearest possible understanding of the golf swing and how to correct common faults. Also covered are the essential components of the swing set-up, grip, posture, and alignment. By teaching you the fine art of pitching, chipping, bunker play and putting, Leadbetter instructs you on how to cut shots off your score when you are close to the green. Good course tactics are imperative to playing good golf. Key areas covered include developing a routine, picking strategic targets, club selection and \"swing thoughts\".']\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'David Leadbetter', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.56 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 25, 2005', 'Actors': 'David Leadbetter', 'Studio': 'Well Go USA', 'Number of discs': '1'}\nI never golfed and it helped me alot, I still watch it after 3 months, very helpful tips.\nDVD Golf for Beginners\nRome - The Complete First Two Seasons\nKevin McKidd  (Actor),     Ray Stevenson  (Actor),     Adam Davidson  (Director),     Alan Poul  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product description', 'A generously budgeted show jointly produced by HBO and the BBC ROME takes viewers back to 52 B.C. for a chance to relive the reign of Julius Caesar. Details have been painstakingly researched to ensure accuracy so both history buffs and viewers less versed in the ways of Caesar should find something to enjoy here. The show also contains intricately woven plots fine acting and stunning recreations of the ancient city. This release contains the first two seasons of the show.Format: DVD MOVIE Genre: TELEVISION/SERIES & SEQUELS Rating: NR UPC: 026359795527 Manufacturer No: 97955', 'Amazon.com', \"Family dysfunction. Treachery. Betrayal. Coarse profanity. Brutal violence. Graphic (and sometimes brutal) sex. No, it's not\", 'The Sopranos', \", it's\", 'Rome', \", HBO's madly ambitious series that bloodily splatters the glory of Rome just as savagely as Monty\", 'Python and the Holy Grail', 'soiled the good name of Camelot (but with far fewer laughs; very few funny things happen on the way to this forum). Set in 52 B.C. (Before Cable),', 'Rome', 'charts the dramatic shifts in the balance of power between former friends Pompey Magnus (Kenneth Cranham), leader of the Senate, and Julius Caesar (Ciaran Hinds), whose imminent return after eight years to Rome after conquering the Gauls, has the ruling class up in arms. At the heart of Rome is the odd couple friendship between two soldiers who fortuitously become heroes of the people. Lucius Vorenus (Kevin McKidd) is married, honorable, and steadfast. Titus Pullo (Ray Stevenson) is an amoral rogue whose philosophy is best summed up, \"I kill my enemies, take their gold, and enjoy their women.\" Among', 'Rome', \"'s most compelling subplots is Lucius's strained relationship with his wife, Niobe (Indira Varma), who is surprised to see her husband alive (but not as surprised as he is to find her upon his homecoming with a newborn baby in her arms!) Any viewer befuddlement over\", 'Rome', \"'s intrigues and machinations, and determining who is hero and who is foe, disappears the minute Golden Globe-nominee Polly Walker appears as Atia, Caesar's formidable niece and a villainess for the ages. In the first hour alone, she offers her already married daughter as a bride to the recently widowed Pompey.\", 'Rome', 'is a painstakingly mounted production that earned eight well-deserved Emmy nominations in such categories as costumes, set design, and art direction. Michael Apted (', \"Coal Miner's Daughter\", ') was honored with a Director\\'s Guild Award for the first episode, \"The Stolen Eagle.\" But artistic considerations aside, instantly addicted viewers will agree with Atia, who notes at one point, \"I adore the secrecy, the intrigue. It\\'s most thrilling.\"', 'Season 2 begins in the wake of Julius Caesar\\'s assassination, and charts the power struggle to fill his sandals between \"vulgar beast\" Mark Antony (James Purefoy) and \"clever boy\" Octavian (Simon Woods), who is surprisingly named Caesar\\'s sole heir. The series\\' most compelling relationship is between fellow soldiers and unlikely friends, the honorable Lucius Vorenus (Kevin McKidd) and Titus \"Violence is the only trade I know\" Pullo (Ray Stevenson), who somewhat reverse roles when Vorenus is overcome with grief in the wake of his wife\\'s suicide. Season 2 considerably ups the ante in the rivalry between Atia (an Emmy-worthy Polly Walker), who is Antony\\'s mistress, and Servilia (Lindsay Duncan) with attempted poisonings and sickening torture. Another gripping subplot is Vorenus\\'s estrangement from his children, who, at the climax of the season opener are presumed slaughtered, but whose true fate may be even more devastating to the father who cursed them.', 'Rome', '\\'s second season does not scrimp on the series\\' sex and violence, in both cases exceedingly brutal. But in this cauldron of treachery and betrayal, words, too, are vicious, as when a defiant Atia ominously tells Octavian\\'s new wife, Livia, \"Far better women that you have sworn to [destroy me]. Go look for them now.\" In writing', 'Rome', \"'s epitaph, we come to praise this series, not to bury it. Although two seasons was not enough to establish a\", 'Rome', \"empire, it stands as one of HBO's crowning achievements.\", '--Donald Liebenson']\n{'Format': 'NTSC, Widescreen, Color, Closed-captioned, Anamorphic', 'Contributor': 'Polly Walker, Indira Varma, Alan Taylor, Max Pirkis, Jeremy Podeswa, Kenneth Cranham, Kevin McKidd, Karl Johnson, David Bamber, Alan Poul, Alik Sakharov, John Maybury, Adam Davidson, Kerry Condon, Allen Coulter, Lindsay Duncan, Lee Boardman, Ray Stevenson, Tobias Menzies, Carl FranklinPolly Walker, Indira Varma, Alan Taylor, Max Pirkis, Jeremy Podeswa, Kenneth Cranham, Kevin McKidd, Karl Johnson, David Bamber, Alan Poul, Alik Sakharov, John Maybury, Adam Davidson, Kerry Condon, Allen Coulter, Lindsay Duncan, Lee Boardman, Ray Stevenson, To…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '11', 'Runtime': '22 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.7 x 5.9 x 3.2 inches; 1 Pounds', 'Item model number': '97955', 'Director': 'Adam Davidson, Alan Poul, Alan Taylor, Alik Sakharov, Allen Coulter', 'Media Format': 'NTSC, Widescreen, Color, Closed-captioned, Anamorphic', 'Run time': '22 hours', 'Release date': 'August 7, 2007', 'Actors': 'Kevin McKidd, Ray Stevenson, Polly Walker, Kenneth Cranham, Lindsay Duncan', 'Subtitles': 'English, French, Spanish', 'Studio': 'Hbo Home Video', 'Number of discs': '11'}\nLoved the movies, but did not know it should have be rated more than R. Personal I do not like X sex in movies, but it really showd how people used to live und the Story ist fantastic, you really see how the Military and the soldier plus the rich and poor, how they suffered and triumpfed.  I would recommend for Adults not for Teenagers or children even the History and the Stories are excellent.\nRome -Complete First Two Seasons\n24: Season 2\nKiefer Sutherland  (Actor),     Carlos Bernard  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n['Product Description', 'Various', 'Amazon.com', 'Jack Bauer is having another one of his \"very bad days\" in the second season of the groundbreaking real-time thriller', '24', \". Once again the hours are ticking by with more guaranteed cliffhangers than a convention of mountain climbers. Holed up in a Los Angeles condo and estranged from his daughter, Jack is no longer on the government payroll; unfortunately for him, this small fact doesn't seem to matter to President David Palmer and the NSA, who call him back in to the CTU and give him 24 hours to infiltrate a terrorist organization that is planning to detonate a dirty bomb in the city of angels. All Jack wants is to get his daughter out of the city, unfortunately Kim's new employer, the abusive father of the child she is nannying, has other ideas.\", 'Fans of the', 'original', \"won't be disappointed, as there are more than enough shock moments in the first few hours to hint at the climactic build-up to come, while newcomers can quickly get involved in the lives of Jack and his family. There are some new characters to bolster the veteran cast and, interestingly (although not surprisingly), Jack's character has taken an altogether darker, more psychopathic turn. The danger the characters find themselves in also has a much more global, not to mention topical, impetus, grounded as it is in the war against terrorism. Although the territory is more familiar this time around, this second season is just as much a high-tension, taut, adrenalin-fuelled ride as the first, and one that will have you glued to your TV for the next 24 hours.\", '--Kristen Bowditch']\n{'Format': \"Box set, Closed-captioned, Collector's Edition, Dolby, Dubbed, Subtitled, NTSC\", 'Contributor': 'Reiko Aylesworth, Carlos Bernard, Kiefer Sutherland, Penny Johnson Jerald, Xander Berkeley, Elisha Cuthbert, Sarah Wynter, Dennis HaysbertReiko Aylesworth, Carlos Bernard, Kiefer Sutherland, Penny Johnson Jerald, Xander Berkeley, Elisha Cuthbert, Sarah Wynter, Dennis Haysbert  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Number Of Discs': '7', 'Runtime': '17 hours and 44 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.97 x 5.72 x 7.56 inches; 1.15 Pounds', 'Media Format': \"Box set, Closed-captioned, Collector's Edition, Dolby, Dubbed, Subtitled, NTSC\", 'Run time': '17 hours and 44 minutes', 'Release date': 'September 9, 2003', 'Actors': 'Kiefer Sutherland, Carlos Bernard, Reiko Aylesworth, Sarah Wynter, Dennis Haysbert', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Network', 'Number of discs': '7'}\nI started watching 24 and I noticed I missed a season. The Disc were high Qaulity und I really enjoyed them\nTV show 24\n24: Season 1\nKiefer Sutherland  (Actor),     Leslie Hope  (Actor),     Bryan Spicer  (Director),     Davis Guggenheim  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['The clock is ticking... Midnight. Jack Bauer, head of the Los Angeles Counter Terrorist Unit (CTU), is suddenly thrust into a chaotic and exhausting 24-hour marathon of death, deception and terror as he struggles to prevent the assassination of a presidential candidate, find the traitor within his own organization, and save his kidnapped wife and daughter.']\n{'Genre': 'Action & Adventure/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Vicellous Reon Shannon, Bryan Spicer, Eric Balfour, Michael Bryan French, Davis Guggenheim, Paul Shapiro, Jude Ciccolella, Kiefer Sutherland, Leslie Hope, Elisha Cuthbert, Silas Weir Mitchell, Sarah Clarke, Stephen Hopkins, Michael Massee, Jon Cassar, Karina Arroyave, Winrich Kolbe, Dennis Haysbert, Frederick King Keller, Andrea NewmanVicellous Reon Shannon, Bryan Spicer, Eric Balfour, Michael Bryan French, Davis Guggenheim, Paul Shapiro, Jude Ciccolella, Kiefer Sutherland, Leslie Hope, Elisha Cuthbert, Silas Weir Mitchell, Sarah Clarke, Stephen Hopkins, Michael Massee, Jon Cassar, Karina Arroyave, Winri…  See more', 'Language': 'Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.44 x 7.71 inches; 8 Ounces', 'Item model number': '9980844855', 'Director': 'Bryan Spicer, Davis Guggenheim, Frederick King Keller, Jon Cassar, Paul Shapiro', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '19 hours and 12 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Kiefer Sutherland, Leslie Hope, Sarah Clarke, Elisha Cuthbert, Dennis Haysbert', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Andrea Newman', 'Number of discs': '6'}\nI love buying this product, do not have time to watch my favorite show, I buy it once a year and can watch it all at once like a movie. Best thing they ever inventet DVD after TV seasons.  Inge Coffman[[ASIN:B002ZCY7SW 24: Season Eight]]\n24 Tv Series\n{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Johan Renck'], 'Producers': ['Michael Hirst', \"Morgan O'Sullivan\", 'John Weber', 'James Flynn', 'Sherry Marsh', 'Alan Gasmer', 'Shelia Hockin', 'Steve Wakefield', 'Keith Thompson'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Gabriel Byrne', 'Clive Standen', 'Gustaf Skarsgard', 'George Blagden'], 'Studio': ['History']}\nI would not gotten involved in this, but the first 2 seasons where OK. Than it looked like distorted, I come from EU and know about Vikings, this shows many truth about the culture, but I thing the producers used pot or something. No way did Vikings shave their hair, or looked like crazed tattooed dope addicts. It also showed them like blood crazed animals. Yes they blundered, raped, but usually they were sure the males were in wars or otherwise busy int the countries they blundered. This show after the 3rd season, is horrible, crazed, bloody beyond believe, What rally bothered me, not true the way Vikings looked all painted and nuts. One thing is true the females could be fighting and working with males. I would never allow my children to watch such a untrue brutal show.\nThan it looked like distorted, I come from EU and know about ...\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]'], 'Directors': ['Ed Bazalgette', 'William McGregor'], 'Producers': ['Eliza Mellor'], 'Starring': ['Eleanor Tomlinson', 'Aidan Turner', 'Phil Davis'], 'Studio': ['Mammoth Screen']}\nJust wonderful.\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Wang Jun'], 'Starring': ['Tanaka Yuko', 'Yu Shao Qun', 'Zhou Yi Wei'], 'Studio': ['Asian Crush']}\nI never watched any foreign movies, because I had to read to much. Watched last week my first series, I loved the costumes and the actors, now this is my second movie &quot; The Queen and the Eunuch&quot; just great movies. I can not wait every night to watch it. Thank you Amazon.\nI loved the costumes and the actors\n{'Content advisory': ['Violence'], 'Audio languages': ['Русский'], 'Subtitles': ['English [CC]'], 'Directors': ['Maksim Bespalyi'], 'Producers': ['Valeriy Babich', 'Vlad Ryashin', 'Konstantin Ernst', 'Sergey Titinkov'], 'Starring': ['Ludmila Gamureac', 'Andrej Bestuzhev', 'Cyril Istratov'], 'Studio': ['Janson Media']}\nI love these movies, but the subtitles are not long enough on the screen. I am a history major and know alot about history, a novice will not get the story no one can read fast enough. These countries have to do a better job with timing. I love also the Chinese movies, the English are longer on the screen.  I want to thank Amazon for having these history movies available. Thank  You.\nLove the History\n{'Subtitles': ['None available'], 'Directors': ['Marc Riviere'], 'Starring': ['Philippe Torreton', 'Alessandra Martines', 'Marc Citti'], 'Studio': ['Yuyu']}\nA Wonderfull historical movie about the sun king of France. I love history, above the English subtitles stayed long enough to read, which is lacking in many Chinese and Russian movies. I still watch them, because I know history and love the colorful costumes.\nWonderfull acting\n{'Subtitles': ['None available'], 'Directors': ['Christian Twente', 'Christian Feyerabend']}\nI love history and many of us are German descent, very educational. loved it.\nGreat History about a hero.\nThe Secret File of Marco Polo\nDocumentary, Cerebral, Stunning, Understated\n['Did Marco Polo, the most illustrious traveler in history, ever go to China? A debate continues as to whether the Venetian’s book is a personal account of China’s 13th-century the Middle Kingdom and its marvels.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabriele Wengler'], 'Producers': ['ECO Media TV-Produktion', 'ZDF', 'arte'], 'Starring': ['Ben Braun']}\nI took History in college, been to Venice at the home of Marco. This video should be shown in schools. Verry interesting to anyone. Sad Americans do not teach their children. I loved the history of China and what a great culture these people had.\nGreat\nLast Train Home (English Subtitled)\nDrama, International, Documentary\n[\"Working over several years in classic verité style, filmmaker Lixin Fan chronicles the mass exodus of 130 million Chinese migrant workers as they trek from the city to their home villages for the New Year's holiday. LAST TRAIN HOME's intimate observation of one fractured family sheds light on the human cost of China's ascendance as an economic superpower.\"]\n{'Subtitles': ['None available'], 'Directors': ['Lixin Fan'], 'Producers': ['Zhao Qi', 'Mila Aung-Thwin', 'Daniel Cross'], 'Starring': ['Qin Zhang', 'Suqin Chen', 'Yang Zhang']}\nTells me as a German-born immigrant to America, how blessed I have been to be raised in a Northern European culture and living in America which was made great by Northern Europeans the great founders of America.  Love my culture. I  wanted to go and visit China, God help me,  now I understand why they need the Americans and Europeans to invest in factories. The work like slaves.\nThe true China wow.\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Evans', 'Robert Del Mastro', 'Joss Agnew', 'Lawrence Till', 'Dominic Barlow', 'Andrew Davies'], 'Producers': ['Kate Brooke'], 'Studio': ['ITV']}\ngreat actor.\nFive Stars\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['Русский'], 'Subtitles': ['English [CC]'], 'Directors': ['Alexei Andrianov'], 'Producers': ['Kinokompaniya Moskino'], 'Starring': ['Mariya Andreeva', 'Eugeniy Tsiganov', 'Vilen Babichev']}\nBeautiful movie, my eyes hurt from the reading, but it is fast passed and a great movie, never knew Russia made such grand movies, no expense was spared, loved the clothing and settings. Learned a lot about Russian history and how they got all these states around them, especially Mongolia. I have been in Moscow, enjoyed the history of the most magnificent buildings in Moscow.  Actually the Russians in that time period, where not as advanced as the rest of Europe. Italians thought the Russians how to build.\nBeautiful movie, my eyes hurt from the reading",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: David Leadbetter From Beginner to Winner\nReview Date: 2009/08/11\nStore: David Leadbetter  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Special Interests\nProduct Description: ['David Leadbetter, renowned for working with the world\\x92s top golfers including Michelle Wie, Ernie Els and Nick Price has designed a DVD aimed at improving a novice\\x92s game. Computer graphics have been combined with footage taken from all the key angles, to give the clearest possible understanding of the golf swing and how to correct common faults. Also covered are the essential components of the swing set-up, grip, posture, and alignment. By teaching you the fine art of pitching, chipping, bunker play and putting, Leadbetter instructs you on how to cut shots off your score when you are close to the green. Good course tactics are imperative to playing good golf. Key areas covered include developing a routine, picking strategic targets, club selection and \"swing thoughts\".']\nAverage Rating: 4.3\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'David Leadbetter', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.56 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'October 25, 2005', 'Actors': 'David Leadbetter', 'Studio': 'Well Go USA', 'Number of discs': '1'}\nReview Text: I never golfed and it helped me alot, I still watch it after 3 months, very helpful tips.\nReview Title: DVD Golf for Beginners\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rome - The Complete First Two Seasons\nReview Date: 2009/09/01\nStore: Kevin McKidd  (Actor),     Ray Stevenson  (Actor),     Adam Davidson  (Director),     Alan Poul  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product description', 'A generously budgeted show jointly produced by HBO and the BBC ROME takes viewers back to 52 B.C. for a chance to relive the reign of Julius Caesar. Details have been painstakingly researched to ensure accuracy so both history buffs and viewers less versed in the ways of Caesar should find something to enjoy here. The show also contains intricately woven plots fine acting and stunning recreations of the ancient city. This release contains the first two seasons of the show.Format: DVD MOVIE Genre: TELEVISION/SERIES & SEQUELS Rating: NR UPC: 026359795527 Manufacturer No: 97955', 'Amazon.com', \"Family dysfunction. Treachery. Betrayal. Coarse profanity. Brutal violence. Graphic (and sometimes brutal) sex. No, it's not\", 'The Sopranos', \", it's\", 'Rome', \", HBO's madly ambitious series that bloodily splatters the glory of Rome just as savagely as Monty\", 'Python and the Holy Grail', 'soiled the good name of Camelot (but with far fewer laughs; very few funny things happen on the way to this forum). Set in 52 B.C. (Before Cable),', 'Rome', 'charts the dramatic shifts in the balance of power between former friends Pompey Magnus (Kenneth Cranham), leader of the Senate, and Julius Caesar (Ciaran Hinds), whose imminent return after eight years to Rome after conquering the Gauls, has the ruling class up in arms. At the heart of Rome is the odd couple friendship between two soldiers who fortuitously become heroes of the people. Lucius Vorenus (Kevin McKidd) is married, honorable, and steadfast. Titus Pullo (Ray Stevenson) is an amoral rogue whose philosophy is best summed up, \"I kill my enemies, take their gold, and enjoy their women.\" Among', 'Rome', \"'s most compelling subplots is Lucius's strained relationship with his wife, Niobe (Indira Varma), who is surprised to see her husband alive (but not as surprised as he is to find her upon his homecoming with a newborn baby in her arms!) Any viewer befuddlement over\", 'Rome', \"'s intrigues and machinations, and determining who is hero and who is foe, disappears the minute Golden Globe-nominee Polly Walker appears as Atia, Caesar's formidable niece and a villainess for the ages. In the first hour alone, she offers her already married daughter as a bride to the recently widowed Pompey.\", 'Rome', 'is a painstakingly mounted production that earned eight well-deserved Emmy nominations in such categories as costumes, set design, and art direction. Michael Apted (', \"Coal Miner's Daughter\", ') was honored with a Director\\'s Guild Award for the first episode, \"The Stolen Eagle.\" But artistic considerations aside, instantly addicted viewers will agree with Atia, who notes at one point, \"I adore the secrecy, the intrigue. It\\'s most thrilling.\"', 'Season 2 begins in the wake of Julius Caesar\\'s assassination, and charts the power struggle to fill his sandals between \"vulgar beast\" Mark Antony (James Purefoy) and \"clever boy\" Octavian (Simon Woods), who is surprisingly named Caesar\\'s sole heir. The series\\' most compelling relationship is between fellow soldiers and unlikely friends, the honorable Lucius Vorenus (Kevin McKidd) and Titus \"Violence is the only trade I know\" Pullo (Ray Stevenson), who somewhat reverse roles when Vorenus is overcome with grief in the wake of his wife\\'s suicide. Season 2 considerably ups the ante in the rivalry between Atia (an Emmy-worthy Polly Walker), who is Antony\\'s mistress, and Servilia (Lindsay Duncan) with attempted poisonings and sickening torture. Another gripping subplot is Vorenus\\'s estrangement from his children, who, at the climax of the season opener are presumed slaughtered, but whose true fate may be even more devastating to the father who cursed them.', 'Rome', '\\'s second season does not scrimp on the series\\' sex and violence, in both cases exceedingly brutal. But in this cauldron of treachery and betrayal, words, too, are vicious, as when a defiant Atia ominously tells Octavian\\'s new wife, Livia, \"Far better women that you have sworn to [destroy me]. Go look for them now.\" In writing', 'Rome', \"'s epitaph, we come to praise this series, not to bury it. Although two seasons was not enough to establish a\", 'Rome', \"empire, it stands as one of HBO's crowning achievements.\", '--Donald Liebenson']\nAverage Rating: 4.7\nProduct Details: {'Format': 'NTSC, Widescreen, Color, Closed-captioned, Anamorphic', 'Contributor': 'Polly Walker, Indira Varma, Alan Taylor, Max Pirkis, Jeremy Podeswa, Kenneth Cranham, Kevin McKidd, Karl Johnson, David Bamber, Alan Poul, Alik Sakharov, John Maybury, Adam Davidson, Kerry Condon, Allen Coulter, Lindsay Duncan, Lee Boardman, Ray Stevenson, Tobias Menzies, Carl FranklinPolly Walker, Indira Varma, Alan Taylor, Max Pirkis, Jeremy Podeswa, Kenneth Cranham, Kevin McKidd, Karl Johnson, David Bamber, Alan Poul, Alik Sakharov, John Maybury, Adam Davidson, Kerry Condon, Allen Coulter, Lindsay Duncan, Lee Boardman, Ray Stevenson, To…  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '11', 'Runtime': '22 hours', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.7 x 5.9 x 3.2 inches; 1 Pounds', 'Item model number': '97955', 'Director': 'Adam Davidson, Alan Poul, Alan Taylor, Alik Sakharov, Allen Coulter', 'Media Format': 'NTSC, Widescreen, Color, Closed-captioned, Anamorphic', 'Run time': '22 hours', 'Release date': 'August 7, 2007', 'Actors': 'Kevin McKidd, Ray Stevenson, Polly Walker, Kenneth Cranham, Lindsay Duncan', 'Subtitles': 'English, French, Spanish', 'Studio': 'Hbo Home Video', 'Number of discs': '11'}\nReview Text: Loved the movies, but did not know it should have be rated more than R. Personal I do not like X sex in movies, but it really showd how people used to live und the Story ist fantastic, you really see how the Military and the soldier plus the rich and poor, how they suffered and triumpfed.  I would recommend for Adults not for Teenagers or children even the History and the Stories are excellent.\nReview Title: Rome -Complete First Two Seasons\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 24: Season 2\nReview Date: 2009/09/25\nStore: Kiefer Sutherland  (Actor),     Carlos Bernard  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Action & Adventure\nProduct Description: ['Product Description', 'Various', 'Amazon.com', 'Jack Bauer is having another one of his \"very bad days\" in the second season of the groundbreaking real-time thriller', '24', \". Once again the hours are ticking by with more guaranteed cliffhangers than a convention of mountain climbers. Holed up in a Los Angeles condo and estranged from his daughter, Jack is no longer on the government payroll; unfortunately for him, this small fact doesn't seem to matter to President David Palmer and the NSA, who call him back in to the CTU and give him 24 hours to infiltrate a terrorist organization that is planning to detonate a dirty bomb in the city of angels. All Jack wants is to get his daughter out of the city, unfortunately Kim's new employer, the abusive father of the child she is nannying, has other ideas.\", 'Fans of the', 'original', \"won't be disappointed, as there are more than enough shock moments in the first few hours to hint at the climactic build-up to come, while newcomers can quickly get involved in the lives of Jack and his family. There are some new characters to bolster the veteran cast and, interestingly (although not surprisingly), Jack's character has taken an altogether darker, more psychopathic turn. The danger the characters find themselves in also has a much more global, not to mention topical, impetus, grounded as it is in the war against terrorism. Although the territory is more familiar this time around, this second season is just as much a high-tension, taut, adrenalin-fuelled ride as the first, and one that will have you glued to your TV for the next 24 hours.\", '--Kristen Bowditch']\nAverage Rating: 4.8\nProduct Details: {'Format': \"Box set, Closed-captioned, Collector's Edition, Dolby, Dubbed, Subtitled, NTSC\", 'Contributor': 'Reiko Aylesworth, Carlos Bernard, Kiefer Sutherland, Penny Johnson Jerald, Xander Berkeley, Elisha Cuthbert, Sarah Wynter, Dennis HaysbertReiko Aylesworth, Carlos Bernard, Kiefer Sutherland, Penny Johnson Jerald, Xander Berkeley, Elisha Cuthbert, Sarah Wynter, Dennis Haysbert  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround)', 'Number Of Discs': '7', 'Runtime': '17 hours and 44 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '1.97 x 5.72 x 7.56 inches; 1.15 Pounds', 'Media Format': \"Box set, Closed-captioned, Collector's Edition, Dolby, Dubbed, Subtitled, NTSC\", 'Run time': '17 hours and 44 minutes', 'Release date': 'September 9, 2003', 'Actors': 'Kiefer Sutherland, Carlos Bernard, Reiko Aylesworth, Sarah Wynter, Dennis Haysbert', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Network', 'Number of discs': '7'}\nReview Text: I started watching 24 and I noticed I missed a season. The Disc were high Qaulity und I really enjoyed them\nReview Title: TV show 24\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 24: Season 1\nReview Date: 2010/06/05\nStore: Kiefer Sutherland  (Actor),     Leslie Hope  (Actor),     Bryan Spicer  (Director),     Davis Guggenheim  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['The clock is ticking... Midnight. Jack Bauer, head of the Los Angeles Counter Terrorist Unit (CTU), is suddenly thrust into a chaotic and exhausting 24-hour marathon of death, deception and terror as he struggles to prevent the assassination of a presidential candidate, find the traitor within his own organization, and save his kidnapped wife and daughter.']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure/Television', 'Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Vicellous Reon Shannon, Bryan Spicer, Eric Balfour, Michael Bryan French, Davis Guggenheim, Paul Shapiro, Jude Ciccolella, Kiefer Sutherland, Leslie Hope, Elisha Cuthbert, Silas Weir Mitchell, Sarah Clarke, Stephen Hopkins, Michael Massee, Jon Cassar, Karina Arroyave, Winrich Kolbe, Dennis Haysbert, Frederick King Keller, Andrea NewmanVicellous Reon Shannon, Bryan Spicer, Eric Balfour, Michael Bryan French, Davis Guggenheim, Paul Shapiro, Jude Ciccolella, Kiefer Sutherland, Leslie Hope, Elisha Cuthbert, Silas Weir Mitchell, Sarah Clarke, Stephen Hopkins, Michael Massee, Jon Cassar, Karina Arroyave, Winri…  See more', 'Language': 'Unqualified', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.44 x 7.71 inches; 8 Ounces', 'Item model number': '9980844855', 'Director': 'Bryan Spicer, Davis Guggenheim, Frederick King Keller, Jon Cassar, Paul Shapiro', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Subtitled, Widescreen', 'Run time': '19 hours and 12 minutes', 'Release date': 'May 22, 2007', 'Actors': 'Kiefer Sutherland, Leslie Hope, Sarah Clarke, Elisha Cuthbert, Dennis Haysbert', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Andrea Newman', 'Number of discs': '6'}\nReview Text: I love buying this product, do not have time to watch my favorite show, I buy it once a year and can watch it all at once like a movie. Best thing they ever inventet DVD after TV seasons.  Inge Coffman[[ASIN:B002ZCY7SW 24: Season Eight]]\nReview Title: 24 Tv Series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/03/25\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Johan Renck'], 'Producers': ['Michael Hirst', \"Morgan O'Sullivan\", 'John Weber', 'James Flynn', 'Sherry Marsh', 'Alan Gasmer', 'Shelia Hockin', 'Steve Wakefield', 'Keith Thompson'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Gabriel Byrne', 'Clive Standen', 'Gustaf Skarsgard', 'George Blagden'], 'Studio': ['History']}\nReview Text: I would not gotten involved in this, but the first 2 seasons where OK. Than it looked like distorted, I come from EU and know about Vikings, this shows many truth about the culture, but I thing the producers used pot or something. No way did Vikings shave their hair, or looked like crazed tattooed dope addicts. It also showed them like blood crazed animals. Yes they blundered, raped, but usually they were sure the males were in wars or otherwise busy int the countries they blundered. This show after the 3rd season, is horrible, crazed, bloody beyond believe, What rally bothered me, not true the way Vikings looked all painted and nuts. One thing is true the females could be fighting and working with males. I would never allow my children to watch such a untrue brutal show.\nReview Title: Than it looked like distorted, I come from EU and know about ...\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/03/27\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English (UK) [CC]', 'English (US) [CC]'], 'Directors': ['Ed Bazalgette', 'William McGregor'], 'Producers': ['Eliza Mellor'], 'Starring': ['Eleanor Tomlinson', 'Aidan Turner', 'Phil Davis'], 'Studio': ['Mammoth Screen']}\nReview Text: Just wonderful.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/14\nAverage Rating: 4.1\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Wang Jun'], 'Starring': ['Tanaka Yuko', 'Yu Shao Qun', 'Zhou Yi Wei'], 'Studio': ['Asian Crush']}\nReview Text: I never watched any foreign movies, because I had to read to much. Watched last week my first series, I loved the costumes and the actors, now this is my second movie &quot; The Queen and the Eunuch&quot; just great movies. I can not wait every night to watch it. Thank you Amazon.\nReview Title: I loved the costumes and the actors\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/24\nAverage Rating: 3.5\nProduct Details: {'Content advisory': ['Violence'], 'Audio languages': ['Русский'], 'Subtitles': ['English [CC]'], 'Directors': ['Maksim Bespalyi'], 'Producers': ['Valeriy Babich', 'Vlad Ryashin', 'Konstantin Ernst', 'Sergey Titinkov'], 'Starring': ['Ludmila Gamureac', 'Andrej Bestuzhev', 'Cyril Istratov'], 'Studio': ['Janson Media']}\nReview Text: I love these movies, but the subtitles are not long enough on the screen. I am a history major and know alot about history, a novice will not get the story no one can read fast enough. These countries have to do a better job with timing. I love also the Chinese movies, the English are longer on the screen.  I want to thank Amazon for having these history movies available. Thank  You.\nReview Title: Love the History\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/24\nAverage Rating: 3.9\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Marc Riviere'], 'Starring': ['Philippe Torreton', 'Alessandra Martines', 'Marc Citti'], 'Studio': ['Yuyu']}\nReview Text: A Wonderfull historical movie about the sun king of France. I love history, above the English subtitles stayed long enough to read, which is lacking in many Chinese and Russian movies. I still watch them, because I know history and love the colorful costumes.\nReview Title: Wonderfull acting\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/09/25\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Christian Twente', 'Christian Feyerabend']}\nReview Text: I love history and many of us are German descent, very educational. loved it.\nReview Title: Great History about a hero.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Secret File of Marco Polo\nReview Date: 2017/10/02\nCategories: Documentary, Cerebral, Stunning, Understated\nProduct Description: ['Did Marco Polo, the most illustrious traveler in history, ever go to China? A debate continues as to whether the Venetian’s book is a personal account of China’s 13th-century the Middle Kingdom and its marvels.']\nAverage Rating: 4.0\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabriele Wengler'], 'Producers': ['ECO Media TV-Produktion', 'ZDF', 'arte'], 'Starring': ['Ben Braun']}\nReview Text: I took History in college, been to Venice at the home of Marco. This video should be shown in schools. Verry interesting to anyone. Sad Americans do not teach their children. I loved the history of China and what a great culture these people had.\nReview Title: Great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Last Train Home (English Subtitled)\nReview Date: 2017/10/04\nCategories: Drama, International, Documentary\nProduct Description: [\"Working over several years in classic verité style, filmmaker Lixin Fan chronicles the mass exodus of 130 million Chinese migrant workers as they trek from the city to their home villages for the New Year's holiday. LAST TRAIN HOME's intimate observation of one fractured family sheds light on the human cost of China's ascendance as an economic superpower.\"]\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Lixin Fan'], 'Producers': ['Zhao Qi', 'Mila Aung-Thwin', 'Daniel Cross'], 'Starring': ['Qin Zhang', 'Suqin Chen', 'Yang Zhang']}\nReview Text: Tells me as a German-born immigrant to America, how blessed I have been to be raised in a Northern European culture and living in America which was made great by Northern Europeans the great founders of America.  Love my culture. I  wanted to go and visit China, God help me,  now I understand why they need the Americans and Europeans to invest in factories. The work like slaves.\nReview Title: The true China wow.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2017/11/22\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Rob Evans', 'Robert Del Mastro', 'Joss Agnew', 'Lawrence Till', 'Dominic Barlow', 'Andrew Davies'], 'Producers': ['Kate Brooke'], 'Studio': ['ITV']}\nReview Text: great actor.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2018/01/10\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['Русский'], 'Subtitles': ['English [CC]'], 'Directors': ['Alexei Andrianov'], 'Producers': ['Kinokompaniya Moskino'], 'Starring': ['Mariya Andreeva', 'Eugeniy Tsiganov', 'Vilen Babichev']}\nReview Text: Beautiful movie, my eyes hurt from the reading, but it is fast passed and a great movie, never knew Russia made such grand movies, no expense was spared, loved the clothing and settings. Learned a lot about Russian history and how they got all these states around them, especially Mongolia. I have been in Moscow, enjoyed the history of the most magnificent buildings in Moscow.  Actually the Russians in that time period, where not as advanced as the rest of Europe. Italians thought the Russians how to build.\nReview Title: Beautiful movie, my eyes hurt from the reading\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n- **Interest in Historical Content**: Engages with movies and TV shows that depict historical narratives, indicating a strong preference for educational and factual entertainment.\n- **Genres**: Enjoys drama, action-adventure, and special interest films, particularly those with a historical context or character-driven plots.\n- **Format Preference**: Favors DVDs and boxed sets, suggesting a preference for collecting complete seasons or series.\n- **Quality and Detailed Storytelling**: Appreciates high production value, detailed storytelling, and accurate depictions of historical events, as reflected in reviews praising the depth and realism of character portrayals.\n- **Educational Engagement**: Displays a keen interest in cultural documentaries, particularly those that provide insights into different societies and historical contexts (e.g., Chinese and Russian histories).\n- **Skepticism of Accuracy**: Often critiques the authenticity in historical portrayals, expressing dissatisfaction when inaccuracies arise, particularly in costume and character representation.\n- **Recurring Themes**: Frequently references love for intricate costumes, meaningful stories, and the cultural richness found within historical narratives.\n\nThis individual is a discerning consumer of media, prioritizing educational value alongside entertainment. Preferences lean towards thoughtful, well-crafted historical representations, with specific dissatisfaction regarding inaccuracies in storytelling.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Great acting",
    "text": "I watched this movie because of the great actors in this movie, it did not disappoint excellent actors. Film is clean and anyone can watch it. Great suspense. Liked it.",
    "images": [],
    "asin": "B000I9W2H2",
    "parent_asin": "B000I9W2H2",
    "user_id": "AH3OG6QD6EDJGZRVCFKV4B66VWNQ",
    "timestamp": "2019-08-24 17:37:03.309000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.5,
    "rating_number": 4167,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f6659947272a2d3d71c945e7266ee0c96240f3dadcff1471bb60ceddea26ced3._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f6659947272a2d3d71c945e7266ee0c96240f3dadcff1471bb60ceddea26ced3._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f6659947272a2d3d71c945e7266ee0c96240f3dadcff1471bb60ceddea26ced3._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f6659947272a2d3d71c945e7266ee0c96240f3dadcff1471bb60ceddea26ced3._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f6659947272a2d3d71c945e7266ee0c96240f3dadcff1471bb60ceddea26ced3._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/f6659947272a2d3d71c945e7266ee0c96240f3dadcff1471bb60ceddea26ced3._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Nudity",
        "violence",
        "frightening scenes",
        "alcohol use",
        "smoking",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Sam Raimi"
      ],
      "Producers": [
        "Tom Rosenberg",
        "James Jacks",
        "Gary Lucchesi",
        "Robert G. Tapert",
        "Rob Tapert"
      ],
      "Starring": [
        "Keanu Reeves",
        "Cate Blanchett",
        "Hilary Swank"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}