{
  "user_id": "AG6O4ZXUWRZSOAHFVPCLYDIEH4VQ",
  "summary": "=== Purchase Information ===\nProduct Title: Woman in Berlin\nReview Date: 2010/08/21\nStore: Nina Hoss  (Actor),     Evgeny Sidikhin  (Actor),     Max Faerberboeck  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Directed by Max Ferberbrock (Aimee & Jaguar) and based on an international bestselling diary. Berlin, 1945, women become the victims of the Red Army invasion. One of them, Anonyma, decides to look for an officer who can protect her. A complex symbiotic relationship develops between her and a Russian officer that will force them to remain enemies until the bitter end. In German and Russian with English subtitles.']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.37 x 7.57 inches; 4 Ounces', 'Item model number': 'STDV2904DVD', 'Director': 'Max Faerberboeck', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Nina Hoss, Evgeny Sidikhin, Irm Hermann, Rudiger Vogler, Ulrike Krumbiegel', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Strand Home Video', 'Number of discs': '1'}\nReview Text: this was a great movie. i had read the book already twice, both in german and english. the movie is more enjoyable if you can at least understand german. but the english subtitles were sufficiant. the story is a true account of what happend to the city of Berlin at the end of WWII. my grandmother and her sisters and my mother and her mom expierienced the end of the war in Berlin and their story were similar. the book though also touches on the end how Berlin was rebuild out of ashes and roubles. there is even a man made mountain of rubble in Berlin which has a statue of a woman to honor the women of Berlin who helped rebuild the city. too bad that the movie does not portrait that part of the book.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hallmark The Courageous Heart of Irena Sendler Hall of Fame War\nReview Date: 2010/08/27\nStore: Rated:    PG    Format: Unknown Binding\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['The Courageous Heart of Irena Sendler Hallmar']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Media Format': \"DVD, Collector's Edition\", 'Studio': 'Hallmark'}\nReview Text: the Irena Sendler movie was definately worth purchasing. i am a great fan of Goran Visnjic and enjoyed his role in the movie. i had never heard of this ladies story and i was surprised that students in Kansas discovered her story. unbelievable the way Miss Sendler risked her life to rescue many Jewish children in the Warsaw Ghetto. it was wonderful to see that there were people courageous enough to risk their lives for the Jewish population. and i did love the happy ending even though Miss Sendler was sick from her imprisonment.\nReview Title: This Hallmark movie was great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Grey Zone\nReview Date: 2010/10/26\nStore: David Arquette  (Actor),     Velizar Binev  (Actor),     Tim Blake Nelson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Product description', \"Based on the real-life events and featuring a first-rate ensemble cast, this compelling and harrowing film chronicles a unit of Auschwitz's Sonderkommando, a special squad of Jewish prisoners, who staged the only armed revolt that would ever take place at Auschwitz.\", 'Amazon.com', 'The title of Tim Blake Nelson\\'s harrowing drama of Jewish death camp prisoners who rise up against their captors to \"destroy the machinery\" refers as much to the compromise and cloudy morality of collaboration as to the gray world coated in the smoke and ash of the crematoriums. Inspired by real-life events at the Auschwitz death camp,', 'The Grey Zone', \"stars David Arquette as a soul-deadened laborer whose being fiercely jolts to life when he finds a young girl alive among the gassed corpses. He's the heart and soul of an outstanding cast that includes Steve Buscemi and Daniel Benzali as revolt leaders, Allan Corduner as the shunned camp doctor, and Harvey Keitel as the commandant. Nelson's rapid pacing, intimate shooting, and terse, jagged dialogue give the moral debate a discomforting immediacy as it races a deadline. When doom hangs in the air, sure death creates unique priorities.\", '--Sean Axmaker']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'David Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael StuhlbargDavid Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael Stuhlbarg  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.25 x 0.75 inches; 2.4 Ounces', 'Item model number': '2223629', 'Director': 'Tim Blake Nelson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 17, 2003', 'Actors': 'David Arquette, Velizar Binev, David Chandler, Michael Stuhlbarg, George Zlatarev', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lions Gate', 'Writers': 'Miklos Nyiszli, Tim Blake Nelson', 'Number of discs': '1'}\nReview Text: I found the movie interesting but it won't be a movie a will watch over and over. it told the story of the crematorium worker who planned a rebellion. also it told the story of the girls who worked in the amunition factory and smuggled the explosives. the story about the little girl they found alive after a gassing was a bit strange. especially on the end where the SS shoots her. all in all they subject was well, but i just didn't enjoy the movie as much as i should have.\nReview Title: Interesting\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hidden in Silence\nReview Date: 2011/04/09\nStore: Tom Radcliffe  (Actor),     Kellie Martin  (Actor),     Richard A. Colla  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Przemysl, Poland, WWII. Germany emerges victorious over the Russians, and the city comes under Nazi control. The Jewish are sent to the ghettos. While some stand silent, Catholic teenager Stefania Podgorska (portrayed by', \"ER's\", 'Kellie Martin', \"as Fusia) chooses the role of a savior and sneaks 13 Jews into her attic. Every day, she risks detection--and immediate execution--by smuggling food and water to the silent group living above her. And when two German nurses are assigned to her living quarters, the chances of discovery become dangerously high. This is the true story of a young woman's selfless commitment and unwavering resolve in the face of war.\"]\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.5 x 7.4 inches; 2.56 Ounces', 'Director': 'Richard A. Colla', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Tom Radcliffe, Kellie Martin', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nReview Text: I watched the movie once on TV and I had to buy it to watch it from time to time. I like the main actress a lot. the story is a true story about a polish girl who helps her best friends family during the time of Nazi occupation. Her sister and her hide over 10 Jews in her addict for a long time. she goes to work every day to provide all the hidden Jews with food. She has to work very hard to find food for her friends. on the end of the movie her house will be for a short time a Wehrmacht head quarter and she still manages to keep her friends hidden and save. after the war she ends up marrying her childhood sweetheart's brother. great story about the courage of a young girl.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Gods Of The Arena - The Complete Collection [DVD]\nReview Date: 2012/02/13\nStore: John Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: You either love this Starz series or you hate it. I happend to love this prequel. I like the actors and I have watched the first season as well. Too bad that Andy Whitfield died of cancer because he was a great Spartacus. The prequel is about Crixus and Ganicus. I can't wair for season 2 to come out on DVD.\nReview Title: Spartacus\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sophie's Choice\nReview Date: 2013/02/22\nStore: Meryl Streep  (Actor),     Kevin Kline  (Actor),     Alan J. Pakula  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['EMOTIONAL TALE OF A YOUNG WRITER AND A WORLD WAR II SURVIVOR WHICH WHOM HE IS OBSESSED.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Feature', 'Format': 'Color, Dolby, Letterboxed, NTSC, Widescreen', 'Contributor': 'Stephen D. Newman, Rita Karin, Moishe Rosenfeld, Meryl Streep, Eugene Lipinski, Alan J. Pakula, William Styron, Marcell Rosenblatt, Greta Turken, Peter MacNicol, John Rothman, Josh Mostel, Kevin Kline, Robin BartlettStephen D. Newman, Rita Karin, Moishe Rosenfeld, Meryl Streep, Eugene Lipinski, Alan J. Pakula, William Styron, Marcell Rosenblatt, Greta Turken, Peter MacNicol, John Rothman, Josh Mostel, Kevin Kline, Robin Bartlett   See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': '60487', 'Director': 'Alan J. Pakula', 'Media Format': 'Color, Dolby, Letterboxed, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'November 10, 1998', 'Actors': 'Meryl Streep, Kevin Kline, Peter MacNicol, Rita Karin, Stephen D. Newman', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Studio': 'Lions Gate', 'Writers': 'Alan J. Pakula, William Styron', 'Number of discs': '1'}\nReview Text: Even though I really like the two main actors I didn't even finish watching the movie. Sorry, and I really like Holocaust themed books and movies.\nReview Title: I didn't like the movie\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Band of Brothers\nReview Date: 2013/03/12\nStore: Damian Lewis  (Actor),     Ron Livingston  (Actor),     David Frankel  (Director),     Tom Hanks  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Product Description', 'Band of Brothers (DVD)', \"They were ordinary men, swept up in the most extraordinary conflict in history. But with the eyes of the world upon them, they found their greatest source of strength in each other. Tom Hanks, Steven Spielberg and HBO present the story of Easy Company, an elite team of U.S. paratroopers whose World War II exploits are as incredible as they are true. This landmark ten-part miniseries based on Stephen E. Ambrose's non-fiction best-seller recounts the remarkable achievements of a volunteer rifle company that parachuted into France on D-Day, spearheaded the Market-Garden and Rhine offensives, fought the Nazis in Bastogne and the Bulge and captured Hitler's 'impenetrable' Eagle's Nest at Berchtesgaden in 1945.\", ']]>', 'Review', \"An extraordinary 10-part series, Band of Brothers masters its greatest challenge: it balances the ideal of heroism with the violence and terror of battle, reflecting what is both civilized and savage about war. --Caryn James of the New York TimesIt is doubtful that any war movie on the large or small screen has captured the varied experiences of ordinary soldiers better than Band of Brothers. Whether it's the sheer terror of facing an unseen enemy or the momentary joy following a successful mission, the mini eschews the typical movie cliches while revealing and reveling in the humanity within each member of Easy Company. --Barry Garron of The Hollywood Reporter\", 'Set Contains:', 'HBO\\'s impressive miniseries may have the most handsome DVD packaging to date: a tin container enclosing the accordion sleeves holding six discs. The extras on the set are just as classy. Besides the rudimentary 30-minute making-of, there\\'s an hour\\'s worth of video diaries by actor Ron Livingston (who portrays Lewis Nixon) detailing the tough \"actors\\' boot camp.\" The first-person recollections of the real Easy Company soldiers that begin each episode are expanded in the 80-minute documentary', 'We Stand Alone Together', '. The real footage and heartfelt recollections complement the series, but viewers may want more interaction between the lifelong friends. The documentary is better in the final minutes, when the veterans are not talking about the specific incidents depicted in the film. Another big help in this set is the \"field guide,\" a dossier of maps, glossary, definitions of ranks, a timeline, and a who\\'s who for each episode.', '--Doug Thomas', 'See more']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'James Madio, Shane Taylor, Peter McCabe, David Frankel, David Schwimmer, Rick Gomez, Damian Lewis, Ross McCall, Ron Livingston, Kirk Acevedo, Neal McDonough, Scott Grimes, Dexter Fletcher, Tom Hanks, Eion Bailey, Michael Cudlitz, Frank John Hughes, Matthew Leitch, Richard Speight Jr., Marc Warren, Donnie Wahlberg, Robin LaingJames Madio, Shane Taylor, Peter McCabe, David Frankel, David Schwimmer, Rick Gomez, Damian Lewis, Ross McCall, Ron Livingston, Kirk Acevedo, Neal McDonough, Scott Grimes, Dexter Fletcher, Tom Hanks, Eion Bailey, Michael Cudlitz, Frank John Hughes, Matthew Leit…  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), English (DTS 5.1), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '11 hours and 45 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8.25 x 5.75 x 2 inches; 12.8 Ounces', 'Item model number': '2221460', 'Director': 'David Frankel, Tom Hanks', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '11 hours and 45 minutes', 'Release date': 'June 6, 2006', 'Actors': 'Damian Lewis, Ron Livingston, Donnie Wahlberg, Frank John Hughes, Neal McDonough', 'Subtitles': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '6'}\nReview Text: I have seen Band of Brothers once before on TV but I really like this mini series and enjoyed watching it again. I do really like the bonus material this DVD set offers.\nReview Title: WWII HBO series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dresden\nReview Date: 2014/02/07\nStore: Felicitas Woll  (Actor),     John Light  (Actor),     Roland Suso Richter  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'January, 1945. In the uncertain days leading up to the Allied bombings of Dresden, Anna (Felicitas Woll) discovers Robert Newman (John Light), an injured British pilot, hiding in a hospital cellar. Torn between loyalty and desire, the young nurse risks everything to help him recover. As Anna struggles to keep his true identity a secret and Robert battles to survive behind enemy lines, a catastrophic fate descends upon the city.', 'DVD Extras:Making-of Featurette, Archival Military Footage of the Dresden bombings', 'Amazon.com', 'A love story set amidst the chaos and horror of World War II,', 'Dresden', \"tells the tale of a beautiful young German nurse who falls in love with an injured British pilot. Anna (Felicitas Woll) is engaged to a wealthy doctor, but she wants more than the bland certainty he can offer her. While on her rounds at the hospital, she discovers Robert (John Light), who is in hiding. Anna knows little about him and is initially unaware that he is a British soldier, and therefore her enemy. What starts as a quiet, private romance escalates into an affair that the couple has a difficult time containing. Woll and Light make beautiful leads, but it's the supporting characters who stand out. Dr. Carl Mauth (Heiner Lauterbach), Anna's father, is a complicated and compelling man who will resort to stealing morphine if his patients are in need. Watching his emotive face, viewers understand his intent without having to hear him speak.\", 'Dresden', \"'s filmmakers do a formidable job of presenting both the Brits and the Germans as flawed people who aren't sure what is right and wrong. Set in January, 1945, prior to the Allied bombings of Dresden, the German production team does a fine job of meshing soap opera type melodrama with feverish action. There are some scenes that are horrific and gruesome to watch. But more often than not, they succinctly set the tone for the violence that accompanies war. Though the three-hour miniseries (which offers both English and German with English subtitles) has been favorably compared with the epic love story portrayed in\", 'Titanic', ', it also shares some of the sweet aspects of', 'Summer of My German Soldier', ', a 1978 made-for-TV movie that depicts the unlikely friendship between a young Jewish girl and a German POW. As with war, there sometimes is no explanation for love. It just happens.', '--Jae-Ha Kim']\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Director': 'Roland Suso Richter', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'February 5, 2008', 'Actors': 'Felicitas Woll, John Light, Benjamin Sadler, Heiner Lauterbach, Katharina Mainecke', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Koch Vision', 'Number of discs': '2'}\nReview Text: Great movie. I speak English and German but there were under titles for the non German speaker. I loved the story line and they really nicely added original footing into the movie. I thought the end a bit sad because there wasn't a true happy end, but this is a movie I will for sure watch again.\nReview Title: Great WWII themed movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: In Tranzit\nReview Date: 2014/02/07\nStore: Thomas Kretschmann  (Actor),     Vera Farmiga  (Actor),     Tom Roberts  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['In the chaotic aftermath of WWII, a group of German POWs are accidentally sent to a female-run Soviet prison camp. When the guards are given the task of weeding out the SS officers, they play a bitter game of cat and mouse with the prisoners. Each group slowly learns that situations are not what they seem; prejudices are sometimes unjustly held; and love can be found in even the harshest places.']\nAverage Rating: 3.7\nProduct Details: {'Genre': 'Drama, History', 'Format': 'Multiple Formats, AC-3, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'John Lynch, Thomas Kretschmann, John Malkovich, Tom Roberts, Vera Farmiga', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5075300', 'Director': 'Tom Roberts', 'Media Format': 'Multiple Formats, AC-3, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 40 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Thomas Kretschmann, Vera Farmiga, John Malkovich, John Lynch', 'Subtitles': 'Spanish, English', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Even though this was a true story I still found it a bit weird. I did like the movie to watch it again. It did show nicely how harsh the Russians were with their POW and civilian prisoners and also towards their own.\nReview Title: WWII movie\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: War of the Damned: Season 3\nReview Date: 2014/02/07\nStore: Liam McIntyre  (Actor),     Dustin Clare  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Gaius Claudius Glaber is dead. Many months have passed since his defeat, and the rebel army, led by Spartacus and his generals Crixus, Gannicus and Agron, continue to amass victories over Rome. With the rebel numbers swelling to thousands of freed slaves, Spartacus is more determined than ever to bring down the entire Roman Republic. Following Ashur’s death, Naevia and Crixus fight as one. Together, the rebels engage in one bloody skirmish after another and prepare for the inevitable: a full out war with Rome. The Roman Senate turns to Marcus Crassus, a wealthy, strategic politician, for aid. He respects his opponent and refuses to make the same mistakes Glaber and his predecessors have. With a young and fiercely competitive Julius Caesar as an ally, Crassus is determined to crush Spartacus and his rebellion.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '27460994', 'Media Format': 'NTSC, Multiple Formats, Widescreen', 'Run time': '7 hours and 20 minutes', 'Release date': 'September 3, 2013', 'Actors': 'Liam McIntyre, Dustin Clare, Manu Bennett, Dan Feuerriegel', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Steven S. DeKnight, Sam Raimi, Joshua Donen', 'Studio': 'Anchor Bay', 'Writers': 'Steven S. DeKnight', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: This last season I have not enjoyed as much as the others. It is okay to watch. I enjoyed the previous seasons more.\nReview Title: Last Spartacus\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Colditz: The Complete 2-Part Miniseries\nReview Date: 2015/09/03\nStore: Jason Priestley  (Actor),     Timothy West  (Actor),     Stuart Orme  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Tom Hardy, Sophia Myles, Damian Lewis. A group of Allied escape artists band together to hatch the ultimate break-out from the impregnable walls of the notorious German POW camp at Colditz Castle. 2005/color/3 hrs., 4 min/NR/widescreen.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Military & War/World War II, Military & War/Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, Full Screen, NTSC, Surround Sound, THX, HiFi Sound', 'Contributor': 'Sophia Myles, Damian Lewis, Jason Priestley, Stuart Orme, Tom Hardy, Laurence Fox, James Fox, Timothy WestSophia Myles, Damian Lewis, Jason Priestley, Stuart Orme, Tom Hardy, Laurence Fox, James Fox, Timothy West   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '3711183', 'Director': 'Stuart Orme', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, Full Screen, NTSC, Surround Sound, THX, HiFi Sound', 'Run time': '3 hours and 4 minutes', 'Release date': 'June 5, 2007', 'Actors': 'Jason Priestley, Timothy West, James Fox, Sophia Myles, Damian Lewis', 'Studio': 'Shout! Factory / Timeless Media', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The movie is a bit boring but I guess otherwise it is ok.\nReview Title: WWII movie\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rome: The Complete Series (RPKG/DVD)\nReview Date: 2016/06/27\nStore: Kevin McKidd  (Actor),     Ray Stevenson  (Actor)    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Every city has its secrets. This epic series follows generals and soldiers, masters and slaves, husbands and wives--all entwined in the furious historical events that saw the death of a republic and the birth of the Roman empire. The ensemble cast includes Kevin McKidd, Ray Stevenson, Kenneth Cranham and Ciaran Hinds.', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, DTS Surround Sound, AC-3, NTSC, Subtitled, Widescreen', 'Contributor': 'William J. MacDonald, Kevin McKidd, Enzo Cilenti, Roberto Purvis, Anna Fausta Primiano, Anne Thomopoulos, Frank Doelger, Kerry Condon, Ciarán Hinds, Vincenzo Nicoli, Nicholas Woodeson, Tobias Menzies, Jim Dyer, Polly Walker, Bruno Heller, Indira Varma, Max Pirkis, Chiara Mastalli, John Milius, Fabio Carfora, Karl Johnson, David Bamber, Esther Hall, Lee Boardman, Anna Francolini, Lyndsey Marshal, Kenneth Cranham, Ted Rusoff, Coral Amiga, Simon Woods, Richard Katz, Eugene Kelly, Lindsay Duncan, Haydn Gwynne, Paul Jesson, Rick Warden, Ray Stevenson, Marco Valerio Pugini, James Purefoy, Lydia Leonard, Maggie McCarthy, Lidia Biondi, Lucy Richer, Anna Patrick, Manfredi Aliquo, Lorcan Cranitch, John Melfi, Francesca Romana Coluzzi, Suzanne BertishWilliam J. MacDonald, Kevin McKidd, Enzo Cilenti, Roberto Purvis, Anna Fausta Primiano, Anne Thomopoulos, Frank Doelger, Kerry Condon, Ciarán Hinds, Vincenzo Nicoli, Nicholas Woodeson, Tobias Menzies, Jim Dyer, Polly Walker, Bruno Heller, Indira Varma, Max Pirkis,…  See more', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Number Of Discs': '11', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 13.26 Ounces', 'Item model number': '28941093', 'Media Format': 'Multiple Formats, Box set, Color, DTS Surround Sound, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '20 hours and 29 minutes', 'Release date': 'October 21, 2014', 'Actors': 'Kevin McKidd, Ray Stevenson, Kenneth Cranham, Polly Walker, James Purefoy', 'Subtitles': 'English, French, Dutch, Spanish, Portuguese', 'Producers': 'Bruno Heller, Lucy Richer, William J. MacDonald, Marco Valerio Pugini, John Milius', 'Studio': 'Studio Distribution Services', 'Number of discs': '11'}\nReview Text: Like the series. I wished they had made more than just 2 seasons.\nReview Title: 2 Seasons of Rome\nRating: 5.0\n--------------------------------------------------",
  "reference": "Woman in Berlin\nNina Hoss  (Actor),     Evgeny Sidikhin  (Actor),     Max Faerberboeck  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Directed by Max Ferberbrock (Aimee & Jaguar) and based on an international bestselling diary. Berlin, 1945, women become the victims of the Red Army invasion. One of them, Anonyma, decides to look for an officer who can protect her. A complex symbiotic relationship develops between her and a Russian officer that will force them to remain enemies until the bitter end. In German and Russian with English subtitles.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.37 x 7.57 inches; 4 Ounces', 'Item model number': 'STDV2904DVD', 'Director': 'Max Faerberboeck', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Nina Hoss, Evgeny Sidikhin, Irm Hermann, Rudiger Vogler, Ulrike Krumbiegel', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Strand Home Video', 'Number of discs': '1'}\nthis was a great movie. i had read the book already twice, both in german and english. the movie is more enjoyable if you can at least understand german. but the english subtitles were sufficiant. the story is a true account of what happend to the city of Berlin at the end of WWII. my grandmother and her sisters and my mother and her mom expierienced the end of the war in Berlin and their story were similar. the book though also touches on the end how Berlin was rebuild out of ashes and roubles. there is even a man made mountain of rubble in Berlin which has a statue of a woman to honor the women of Berlin who helped rebuild the city. too bad that the movie does not portrait that part of the book.\ngreat movie\nHallmark The Courageous Heart of Irena Sendler Hall of Fame War\nRated:    PG    Format: Unknown Binding\nMovies & TV, Genre for Featured Categories, Kids & Family\n['The Courageous Heart of Irena Sendler Hallmar']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Media Format': \"DVD, Collector's Edition\", 'Studio': 'Hallmark'}\nthe Irena Sendler movie was definately worth purchasing. i am a great fan of Goran Visnjic and enjoyed his role in the movie. i had never heard of this ladies story and i was surprised that students in Kansas discovered her story. unbelievable the way Miss Sendler risked her life to rescue many Jewish children in the Warsaw Ghetto. it was wonderful to see that there were people courageous enough to risk their lives for the Jewish population. and i did love the happy ending even though Miss Sendler was sick from her imprisonment.\nThis Hallmark movie was great\nThe Grey Zone\nDavid Arquette  (Actor),     Velizar Binev  (Actor),     Tim Blake Nelson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['Product description', \"Based on the real-life events and featuring a first-rate ensemble cast, this compelling and harrowing film chronicles a unit of Auschwitz's Sonderkommando, a special squad of Jewish prisoners, who staged the only armed revolt that would ever take place at Auschwitz.\", 'Amazon.com', 'The title of Tim Blake Nelson\\'s harrowing drama of Jewish death camp prisoners who rise up against their captors to \"destroy the machinery\" refers as much to the compromise and cloudy morality of collaboration as to the gray world coated in the smoke and ash of the crematoriums. Inspired by real-life events at the Auschwitz death camp,', 'The Grey Zone', \"stars David Arquette as a soul-deadened laborer whose being fiercely jolts to life when he finds a young girl alive among the gassed corpses. He's the heart and soul of an outstanding cast that includes Steve Buscemi and Daniel Benzali as revolt leaders, Allan Corduner as the shunned camp doctor, and Harvey Keitel as the commandant. Nelson's rapid pacing, intimate shooting, and terse, jagged dialogue give the moral debate a discomforting immediacy as it races a deadline. When doom hangs in the air, sure death creates unique priorities.\", '--Sean Axmaker']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'David Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael StuhlbargDavid Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael Stuhlbarg  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.25 x 0.75 inches; 2.4 Ounces', 'Item model number': '2223629', 'Director': 'Tim Blake Nelson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 17, 2003', 'Actors': 'David Arquette, Velizar Binev, David Chandler, Michael Stuhlbarg, George Zlatarev', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lions Gate', 'Writers': 'Miklos Nyiszli, Tim Blake Nelson', 'Number of discs': '1'}\nI found the movie interesting but it won't be a movie a will watch over and over. it told the story of the crematorium worker who planned a rebellion. also it told the story of the girls who worked in the amunition factory and smuggled the explosives. the story about the little girl they found alive after a gassing was a bit strange. especially on the end where the SS shoots her. all in all they subject was well, but i just didn't enjoy the movie as much as i should have.\nInteresting\nHidden in Silence\nTom Radcliffe  (Actor),     Kellie Martin  (Actor),     Richard A. Colla  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Przemysl, Poland, WWII. Germany emerges victorious over the Russians, and the city comes under Nazi control. The Jewish are sent to the ghettos. While some stand silent, Catholic teenager Stefania Podgorska (portrayed by', \"ER's\", 'Kellie Martin', \"as Fusia) chooses the role of a savior and sneaks 13 Jews into her attic. Every day, she risks detection--and immediate execution--by smuggling food and water to the silent group living above her. And when two German nurses are assigned to her living quarters, the chances of discovery become dangerously high. This is the true story of a young woman's selfless commitment and unwavering resolve in the face of war.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.5 x 7.4 inches; 2.56 Ounces', 'Director': 'Richard A. Colla', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Tom Radcliffe, Kellie Martin', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nI watched the movie once on TV and I had to buy it to watch it from time to time. I like the main actress a lot. the story is a true story about a polish girl who helps her best friends family during the time of Nazi occupation. Her sister and her hide over 10 Jews in her addict for a long time. she goes to work every day to provide all the hidden Jews with food. She has to work very hard to find food for her friends. on the end of the movie her house will be for a short time a Wehrmacht head quarter and she still manages to keep her friends hidden and save. after the war she ends up marrying her childhood sweetheart's brother. great story about the courage of a young girl.\ngreat movie\nSpartacus: Gods Of The Arena - The Complete Collection [DVD]\nJohn Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Movies\n['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\n{'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nYou either love this Starz series or you hate it. I happend to love this prequel. I like the actors and I have watched the first season as well. Too bad that Andy Whitfield died of cancer because he was a great Spartacus. The prequel is about Crixus and Ganicus. I can't wair for season 2 to come out on DVD.\nSpartacus\nSophie's Choice\nMeryl Streep  (Actor),     Kevin Kline  (Actor),     Alan J. Pakula  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['EMOTIONAL TALE OF A YOUNG WRITER AND A WORLD WAR II SURVIVOR WHICH WHOM HE IS OBSESSED.']\n{'Genre': 'Feature', 'Format': 'Color, Dolby, Letterboxed, NTSC, Widescreen', 'Contributor': 'Stephen D. Newman, Rita Karin, Moishe Rosenfeld, Meryl Streep, Eugene Lipinski, Alan J. Pakula, William Styron, Marcell Rosenblatt, Greta Turken, Peter MacNicol, John Rothman, Josh Mostel, Kevin Kline, Robin BartlettStephen D. Newman, Rita Karin, Moishe Rosenfeld, Meryl Streep, Eugene Lipinski, Alan J. Pakula, William Styron, Marcell Rosenblatt, Greta Turken, Peter MacNicol, John Rothman, Josh Mostel, Kevin Kline, Robin Bartlett   See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': '60487', 'Director': 'Alan J. Pakula', 'Media Format': 'Color, Dolby, Letterboxed, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'November 10, 1998', 'Actors': 'Meryl Streep, Kevin Kline, Peter MacNicol, Rita Karin, Stephen D. Newman', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Studio': 'Lions Gate', 'Writers': 'Alan J. Pakula, William Styron', 'Number of discs': '1'}\nEven though I really like the two main actors I didn't even finish watching the movie. Sorry, and I really like Holocaust themed books and movies.\nI didn't like the movie\nBand of Brothers\nDamian Lewis  (Actor),     Ron Livingston  (Actor),     David Frankel  (Director),     Tom Hanks  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Product Description', 'Band of Brothers (DVD)', \"They were ordinary men, swept up in the most extraordinary conflict in history. But with the eyes of the world upon them, they found their greatest source of strength in each other. Tom Hanks, Steven Spielberg and HBO present the story of Easy Company, an elite team of U.S. paratroopers whose World War II exploits are as incredible as they are true. This landmark ten-part miniseries based on Stephen E. Ambrose's non-fiction best-seller recounts the remarkable achievements of a volunteer rifle company that parachuted into France on D-Day, spearheaded the Market-Garden and Rhine offensives, fought the Nazis in Bastogne and the Bulge and captured Hitler's 'impenetrable' Eagle's Nest at Berchtesgaden in 1945.\", ']]>', 'Review', \"An extraordinary 10-part series, Band of Brothers masters its greatest challenge: it balances the ideal of heroism with the violence and terror of battle, reflecting what is both civilized and savage about war. --Caryn James of the New York TimesIt is doubtful that any war movie on the large or small screen has captured the varied experiences of ordinary soldiers better than Band of Brothers. Whether it's the sheer terror of facing an unseen enemy or the momentary joy following a successful mission, the mini eschews the typical movie cliches while revealing and reveling in the humanity within each member of Easy Company. --Barry Garron of The Hollywood Reporter\", 'Set Contains:', 'HBO\\'s impressive miniseries may have the most handsome DVD packaging to date: a tin container enclosing the accordion sleeves holding six discs. The extras on the set are just as classy. Besides the rudimentary 30-minute making-of, there\\'s an hour\\'s worth of video diaries by actor Ron Livingston (who portrays Lewis Nixon) detailing the tough \"actors\\' boot camp.\" The first-person recollections of the real Easy Company soldiers that begin each episode are expanded in the 80-minute documentary', 'We Stand Alone Together', '. The real footage and heartfelt recollections complement the series, but viewers may want more interaction between the lifelong friends. The documentary is better in the final minutes, when the veterans are not talking about the specific incidents depicted in the film. Another big help in this set is the \"field guide,\" a dossier of maps, glossary, definitions of ranks, a timeline, and a who\\'s who for each episode.', '--Doug Thomas', 'See more']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'James Madio, Shane Taylor, Peter McCabe, David Frankel, David Schwimmer, Rick Gomez, Damian Lewis, Ross McCall, Ron Livingston, Kirk Acevedo, Neal McDonough, Scott Grimes, Dexter Fletcher, Tom Hanks, Eion Bailey, Michael Cudlitz, Frank John Hughes, Matthew Leitch, Richard Speight Jr., Marc Warren, Donnie Wahlberg, Robin LaingJames Madio, Shane Taylor, Peter McCabe, David Frankel, David Schwimmer, Rick Gomez, Damian Lewis, Ross McCall, Ron Livingston, Kirk Acevedo, Neal McDonough, Scott Grimes, Dexter Fletcher, Tom Hanks, Eion Bailey, Michael Cudlitz, Frank John Hughes, Matthew Leit…  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), English (DTS 5.1), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '11 hours and 45 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8.25 x 5.75 x 2 inches; 12.8 Ounces', 'Item model number': '2221460', 'Director': 'David Frankel, Tom Hanks', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '11 hours and 45 minutes', 'Release date': 'June 6, 2006', 'Actors': 'Damian Lewis, Ron Livingston, Donnie Wahlberg, Frank John Hughes, Neal McDonough', 'Subtitles': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '6'}\nI have seen Band of Brothers once before on TV but I really like this mini series and enjoyed watching it again. I do really like the bonus material this DVD set offers.\nWWII HBO series\nDresden\nFelicitas Woll  (Actor),     John Light  (Actor),     Roland Suso Richter  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'January, 1945. In the uncertain days leading up to the Allied bombings of Dresden, Anna (Felicitas Woll) discovers Robert Newman (John Light), an injured British pilot, hiding in a hospital cellar. Torn between loyalty and desire, the young nurse risks everything to help him recover. As Anna struggles to keep his true identity a secret and Robert battles to survive behind enemy lines, a catastrophic fate descends upon the city.', 'DVD Extras:Making-of Featurette, Archival Military Footage of the Dresden bombings', 'Amazon.com', 'A love story set amidst the chaos and horror of World War II,', 'Dresden', \"tells the tale of a beautiful young German nurse who falls in love with an injured British pilot. Anna (Felicitas Woll) is engaged to a wealthy doctor, but she wants more than the bland certainty he can offer her. While on her rounds at the hospital, she discovers Robert (John Light), who is in hiding. Anna knows little about him and is initially unaware that he is a British soldier, and therefore her enemy. What starts as a quiet, private romance escalates into an affair that the couple has a difficult time containing. Woll and Light make beautiful leads, but it's the supporting characters who stand out. Dr. Carl Mauth (Heiner Lauterbach), Anna's father, is a complicated and compelling man who will resort to stealing morphine if his patients are in need. Watching his emotive face, viewers understand his intent without having to hear him speak.\", 'Dresden', \"'s filmmakers do a formidable job of presenting both the Brits and the Germans as flawed people who aren't sure what is right and wrong. Set in January, 1945, prior to the Allied bombings of Dresden, the German production team does a fine job of meshing soap opera type melodrama with feverish action. There are some scenes that are horrific and gruesome to watch. But more often than not, they succinctly set the tone for the violence that accompanies war. Though the three-hour miniseries (which offers both English and German with English subtitles) has been favorably compared with the epic love story portrayed in\", 'Titanic', ', it also shares some of the sweet aspects of', 'Summer of My German Soldier', ', a 1978 made-for-TV movie that depicts the unlikely friendship between a young Jewish girl and a German POW. As with war, there sometimes is no explanation for love. It just happens.', '--Jae-Ha Kim']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Director': 'Roland Suso Richter', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'February 5, 2008', 'Actors': 'Felicitas Woll, John Light, Benjamin Sadler, Heiner Lauterbach, Katharina Mainecke', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Koch Vision', 'Number of discs': '2'}\nGreat movie. I speak English and German but there were under titles for the non German speaker. I loved the story line and they really nicely added original footing into the movie. I thought the end a bit sad because there wasn't a true happy end, but this is a movie I will for sure watch again.\nGreat WWII themed movie\nIn Tranzit\nThomas Kretschmann  (Actor),     Vera Farmiga  (Actor),     Tom Roberts  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['In the chaotic aftermath of WWII, a group of German POWs are accidentally sent to a female-run Soviet prison camp. When the guards are given the task of weeding out the SS officers, they play a bitter game of cat and mouse with the prisoners. Each group slowly learns that situations are not what they seem; prejudices are sometimes unjustly held; and love can be found in even the harshest places.']\n{'Genre': 'Drama, History', 'Format': 'Multiple Formats, AC-3, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'John Lynch, Thomas Kretschmann, John Malkovich, Tom Roberts, Vera Farmiga', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5075300', 'Director': 'Tom Roberts', 'Media Format': 'Multiple Formats, AC-3, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 40 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Thomas Kretschmann, Vera Farmiga, John Malkovich, John Lynch', 'Subtitles': 'Spanish, English', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nEven though this was a true story I still found it a bit weird. I did like the movie to watch it again. It did show nicely how harsh the Russians were with their POW and civilian prisoners and also towards their own.\nWWII movie\nSpartacus: War of the Damned: Season 3\nLiam McIntyre  (Actor),     Dustin Clare  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Gaius Claudius Glaber is dead. Many months have passed since his defeat, and the rebel army, led by Spartacus and his generals Crixus, Gannicus and Agron, continue to amass victories over Rome. With the rebel numbers swelling to thousands of freed slaves, Spartacus is more determined than ever to bring down the entire Roman Republic. Following Ashur’s death, Naevia and Crixus fight as one. Together, the rebels engage in one bloody skirmish after another and prepare for the inevitable: a full out war with Rome. The Roman Senate turns to Marcus Crassus, a wealthy, strategic politician, for aid. He respects his opponent and refuses to make the same mistakes Glaber and his predecessors have. With a young and fiercely competitive Julius Caesar as an ally, Crassus is determined to crush Spartacus and his rebellion.']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '27460994', 'Media Format': 'NTSC, Multiple Formats, Widescreen', 'Run time': '7 hours and 20 minutes', 'Release date': 'September 3, 2013', 'Actors': 'Liam McIntyre, Dustin Clare, Manu Bennett, Dan Feuerriegel', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Steven S. DeKnight, Sam Raimi, Joshua Donen', 'Studio': 'Anchor Bay', 'Writers': 'Steven S. DeKnight', 'Country of Origin': 'USA', 'Number of discs': '3'}\nThis last season I have not enjoyed as much as the others. It is okay to watch. I enjoyed the previous seasons more.\nLast Spartacus\nColditz: The Complete 2-Part Miniseries\nJason Priestley  (Actor),     Timothy West  (Actor),     Stuart Orme  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Tom Hardy, Sophia Myles, Damian Lewis. A group of Allied escape artists band together to hatch the ultimate break-out from the impregnable walls of the notorious German POW camp at Colditz Castle. 2005/color/3 hrs., 4 min/NR/widescreen.']\n{'Genre': 'Military & War/World War II, Military & War/Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, Full Screen, NTSC, Surround Sound, THX, HiFi Sound', 'Contributor': 'Sophia Myles, Damian Lewis, Jason Priestley, Stuart Orme, Tom Hardy, Laurence Fox, James Fox, Timothy WestSophia Myles, Damian Lewis, Jason Priestley, Stuart Orme, Tom Hardy, Laurence Fox, James Fox, Timothy West   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '3711183', 'Director': 'Stuart Orme', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, Full Screen, NTSC, Surround Sound, THX, HiFi Sound', 'Run time': '3 hours and 4 minutes', 'Release date': 'June 5, 2007', 'Actors': 'Jason Priestley, Timothy West, James Fox, Sophia Myles, Damian Lewis', 'Studio': 'Shout! Factory / Timeless Media', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThe movie is a bit boring but I guess otherwise it is ok.\nWWII movie\nRome: The Complete Series (RPKG/DVD)\nKevin McKidd  (Actor),     Ray Stevenson  (Actor)    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Every city has its secrets. This epic series follows generals and soldiers, masters and slaves, husbands and wives--all entwined in the furious historical events that saw the death of a republic and the birth of the Roman empire. The ensemble cast includes Kevin McKidd, Ray Stevenson, Kenneth Cranham and Ciaran Hinds.', ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, DTS Surround Sound, AC-3, NTSC, Subtitled, Widescreen', 'Contributor': 'William J. MacDonald, Kevin McKidd, Enzo Cilenti, Roberto Purvis, Anna Fausta Primiano, Anne Thomopoulos, Frank Doelger, Kerry Condon, Ciarán Hinds, Vincenzo Nicoli, Nicholas Woodeson, Tobias Menzies, Jim Dyer, Polly Walker, Bruno Heller, Indira Varma, Max Pirkis, Chiara Mastalli, John Milius, Fabio Carfora, Karl Johnson, David Bamber, Esther Hall, Lee Boardman, Anna Francolini, Lyndsey Marshal, Kenneth Cranham, Ted Rusoff, Coral Amiga, Simon Woods, Richard Katz, Eugene Kelly, Lindsay Duncan, Haydn Gwynne, Paul Jesson, Rick Warden, Ray Stevenson, Marco Valerio Pugini, James Purefoy, Lydia Leonard, Maggie McCarthy, Lidia Biondi, Lucy Richer, Anna Patrick, Manfredi Aliquo, Lorcan Cranitch, John Melfi, Francesca Romana Coluzzi, Suzanne BertishWilliam J. MacDonald, Kevin McKidd, Enzo Cilenti, Roberto Purvis, Anna Fausta Primiano, Anne Thomopoulos, Frank Doelger, Kerry Condon, Ciarán Hinds, Vincenzo Nicoli, Nicholas Woodeson, Tobias Menzies, Jim Dyer, Polly Walker, Bruno Heller, Indira Varma, Max Pirkis,…  See more', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Number Of Discs': '11', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 13.26 Ounces', 'Item model number': '28941093', 'Media Format': 'Multiple Formats, Box set, Color, DTS Surround Sound, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '20 hours and 29 minutes', 'Release date': 'October 21, 2014', 'Actors': 'Kevin McKidd, Ray Stevenson, Kenneth Cranham, Polly Walker, James Purefoy', 'Subtitles': 'English, French, Dutch, Spanish, Portuguese', 'Producers': 'Bruno Heller, Lucy Richer, William J. MacDonald, Marco Valerio Pugini, John Milius', 'Studio': 'Studio Distribution Services', 'Number of discs': '11'}\nLike the series. I wished they had made more than just 2 seasons.\n2 Seasons of Rome",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Woman in Berlin\nReview Date: 2010/08/21\nStore: Nina Hoss  (Actor),     Evgeny Sidikhin  (Actor),     Max Faerberboeck  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Directed by Max Ferberbrock (Aimee & Jaguar) and based on an international bestselling diary. Berlin, 1945, women become the victims of the Red Army invasion. One of them, Anonyma, decides to look for an officer who can protect her. A complex symbiotic relationship develops between her and a Russian officer that will force them to remain enemies until the bitter end. In German and Russian with English subtitles.']\nAverage Rating: 4.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.54 x 5.37 x 7.57 inches; 4 Ounces', 'Item model number': 'STDV2904DVD', 'Director': 'Max Faerberboeck', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 10, 2009', 'Actors': 'Nina Hoss, Evgeny Sidikhin, Irm Hermann, Rudiger Vogler, Ulrike Krumbiegel', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Strand Home Video', 'Number of discs': '1'}\nReview Text: this was a great movie. i had read the book already twice, both in german and english. the movie is more enjoyable if you can at least understand german. but the english subtitles were sufficiant. the story is a true account of what happend to the city of Berlin at the end of WWII. my grandmother and her sisters and my mother and her mom expierienced the end of the war in Berlin and their story were similar. the book though also touches on the end how Berlin was rebuild out of ashes and roubles. there is even a man made mountain of rubble in Berlin which has a statue of a woman to honor the women of Berlin who helped rebuild the city. too bad that the movie does not portrait that part of the book.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hallmark The Courageous Heart of Irena Sendler Hall of Fame War\nReview Date: 2010/08/27\nStore: Rated:    PG    Format: Unknown Binding\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['The Courageous Heart of Irena Sendler Hallmar']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Media Format': \"DVD, Collector's Edition\", 'Studio': 'Hallmark'}\nReview Text: the Irena Sendler movie was definately worth purchasing. i am a great fan of Goran Visnjic and enjoyed his role in the movie. i had never heard of this ladies story and i was surprised that students in Kansas discovered her story. unbelievable the way Miss Sendler risked her life to rescue many Jewish children in the Warsaw Ghetto. it was wonderful to see that there were people courageous enough to risk their lives for the Jewish population. and i did love the happy ending even though Miss Sendler was sick from her imprisonment.\nReview Title: This Hallmark movie was great\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Grey Zone\nReview Date: 2010/10/26\nStore: David Arquette  (Actor),     Velizar Binev  (Actor),     Tim Blake Nelson  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['Product description', \"Based on the real-life events and featuring a first-rate ensemble cast, this compelling and harrowing film chronicles a unit of Auschwitz's Sonderkommando, a special squad of Jewish prisoners, who staged the only armed revolt that would ever take place at Auschwitz.\", 'Amazon.com', 'The title of Tim Blake Nelson\\'s harrowing drama of Jewish death camp prisoners who rise up against their captors to \"destroy the machinery\" refers as much to the compromise and cloudy morality of collaboration as to the gray world coated in the smoke and ash of the crematoriums. Inspired by real-life events at the Auschwitz death camp,', 'The Grey Zone', \"stars David Arquette as a soul-deadened laborer whose being fiercely jolts to life when he finds a young girl alive among the gassed corpses. He's the heart and soul of an outstanding cast that includes Steve Buscemi and Daniel Benzali as revolt leaders, Allan Corduner as the shunned camp doctor, and Harvey Keitel as the commandant. Nelson's rapid pacing, intimate shooting, and terse, jagged dialogue give the moral debate a discomforting immediacy as it races a deadline. When doom hangs in the air, sure death creates unique priorities.\", '--Sean Axmaker']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'David Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael StuhlbargDavid Arquette, Dimitar Ivanov, David Chandler, Daniel Benzali, Steve Buscemi, Miklos Nyiszli, Velizar Binev, Tim Blake Nelson, Harvey Keitel, Kamelia Grigorova, Allan Corduner, George Zlatarev, Henry Stram, Michael Stuhlbarg  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.25 x 0.75 inches; 2.4 Ounces', 'Item model number': '2223629', 'Director': 'Tim Blake Nelson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 17, 2003', 'Actors': 'David Arquette, Velizar Binev, David Chandler, Michael Stuhlbarg, George Zlatarev', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lions Gate', 'Writers': 'Miklos Nyiszli, Tim Blake Nelson', 'Number of discs': '1'}\nReview Text: I found the movie interesting but it won't be a movie a will watch over and over. it told the story of the crematorium worker who planned a rebellion. also it told the story of the girls who worked in the amunition factory and smuggled the explosives. the story about the little girl they found alive after a gassing was a bit strange. especially on the end where the SS shoots her. all in all they subject was well, but i just didn't enjoy the movie as much as i should have.\nReview Title: Interesting\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hidden in Silence\nReview Date: 2011/04/09\nStore: Tom Radcliffe  (Actor),     Kellie Martin  (Actor),     Richard A. Colla  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Przemysl, Poland, WWII. Germany emerges victorious over the Russians, and the city comes under Nazi control. The Jewish are sent to the ghettos. While some stand silent, Catholic teenager Stefania Podgorska (portrayed by', \"ER's\", 'Kellie Martin', \"as Fusia) chooses the role of a savior and sneaks 13 Jews into her attic. Every day, she risks detection--and immediate execution--by smuggling food and water to the silent group living above her. And when two German nurses are assigned to her living quarters, the chances of discovery become dangerously high. This is the true story of a young woman's selfless commitment and unwavering resolve in the face of war.\"]\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.4 x 0.5 x 7.4 inches; 2.56 Ounces', 'Director': 'Richard A. Colla', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Tom Radcliffe, Kellie Martin', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nReview Text: I watched the movie once on TV and I had to buy it to watch it from time to time. I like the main actress a lot. the story is a true story about a polish girl who helps her best friends family during the time of Nazi occupation. Her sister and her hide over 10 Jews in her addict for a long time. she goes to work every day to provide all the hidden Jews with food. She has to work very hard to find food for her friends. on the end of the movie her house will be for a short time a Wehrmacht head quarter and she still manages to keep her friends hidden and save. after the war she ends up marrying her childhood sweetheart's brother. great story about the courage of a young girl.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: Gods Of The Arena - The Complete Collection [DVD]\nReview Date: 2012/02/13\nStore: John Hannah  (Actor),     Lucy Lawless  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Product Description', 'The House of Batiatus has towered above the city of Capua for many years.', 'Spartacus: Gods of the Arena', 'will explore its deadly history before the arrival of Spartacus, and the death he carried with him. Loyalties will be tested, lives shattered, and battles waged in this thrilling prequel to', 'Spartacus: Blood and Sand', '.', 'Amazon.com', 'The title is misleading--there is no Spartacus to be found here--but little matter, as', 'Gods of the Arena', 'is a prime example of making lemonade from lemons. Faced with the unavailability of Andy Whitfield, star of', 'Spartacus: Blood and Sand', ', due to a recurrence of cancer, the folks at Starz chose to go ahead without him and create a prequel, a resourceful way of buying some time until a new Spartacus could be found while employing several actors already under contract. The focus throughout these six episodes is on the house of Batiatus. It is there that gladiators hone their skills as they prepare for glory and/or death in the arena under the evil eye of Quintus Batiatus (John Hannah), whom', 'Blood and Sand', 'viewers will recognize as the principal villain of that series. The younger Batiatus, already blindly ambitious, wants to make his mark in the gladiator biz, aided by his sexy, scheming wife, Lucretia (Lucy Lawless), and her licentious friend Gaia (Jaime Murray)--and they have just the warrior to do it with in Gannicus (Dustin Clare), a preening stud described by one show exec as \"Han Solo meets Achilles.\" There are, of course, numerous obstacles, ranging from Batiatus\\'s own father to various rival gladiatorial operations. But really, who cares about plotting when a show has as much sex and violence, usually directly juxtaposed, as this one? True to the', 'Blood and Sand', \"precedent, every episode offers a steady parade of gratuitous, risibly over-the-top beheadings and other mayhem, much of it lovingly shot in slow motion, along with ample nudity (some of it full-frontal) and sex (all of it soft-core). With drugs, torture, and constant profanity also in the mix (who knew the ancient Romans dropped so many F-bombs?), this is definitely not a program for the young and impressionable. Nor is it one that's big on nuance; almost without exception, Batiatus and his ilk are depicted as frivolous, depraved, and conniving, while the gladiators and slaves are lowly but noble (not to mention as gloriously muscled and sweaty as your average Chippendales dancer). But this isn't a documentary--it's entertainment, and on that level,\", 'Gods of the Arena', 'totally works.', '--Sam Graham']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Sam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin ClareSam Raimi, Peter Mensah, Robert Tapert, Steven S. DeKnight, Joshua Donen, John Hannah, Marisa Ramirez, Jaime Murray, Lucy Lawless, Dustin Clare  See more', 'Language': 'English', 'Number Of Discs': '2', 'Runtime': '5 hours and 35 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.7 x 0.6 x 7.6 inches; 6.4 Ounces', 'Item model number': '54098998098', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '5 hours and 35 minutes', 'Release date': 'September 13, 2011', 'Actors': 'John Hannah, Lucy Lawless, Dustin Clare, Peter Mensah, Jaime Murray', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert, Sam Raimi, Steven S. DeKnight, Joshua Donen', 'Studio': 'Anchor Bay Entertainment', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: You either love this Starz series or you hate it. I happend to love this prequel. I like the actors and I have watched the first season as well. Too bad that Andy Whitfield died of cancer because he was a great Spartacus. The prequel is about Crixus and Ganicus. I can't wair for season 2 to come out on DVD.\nReview Title: Spartacus\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sophie's Choice\nReview Date: 2013/02/22\nStore: Meryl Streep  (Actor),     Kevin Kline  (Actor),     Alan J. Pakula  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\nProduct Description: ['EMOTIONAL TALE OF A YOUNG WRITER AND A WORLD WAR II SURVIVOR WHICH WHOM HE IS OBSESSED.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Feature', 'Format': 'Color, Dolby, Letterboxed, NTSC, Widescreen', 'Contributor': 'Stephen D. Newman, Rita Karin, Moishe Rosenfeld, Meryl Streep, Eugene Lipinski, Alan J. Pakula, William Styron, Marcell Rosenblatt, Greta Turken, Peter MacNicol, John Rothman, Josh Mostel, Kevin Kline, Robin BartlettStephen D. Newman, Rita Karin, Moishe Rosenfeld, Meryl Streep, Eugene Lipinski, Alan J. Pakula, William Styron, Marcell Rosenblatt, Greta Turken, Peter MacNicol, John Rothman, Josh Mostel, Kevin Kline, Robin Bartlett   See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': '60487', 'Director': 'Alan J. Pakula', 'Media Format': 'Color, Dolby, Letterboxed, NTSC, Widescreen', 'Run time': '2 hours and 30 minutes', 'Release date': 'November 10, 1998', 'Actors': 'Meryl Streep, Kevin Kline, Peter MacNicol, Rita Karin, Stephen D. Newman', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Studio': 'Lions Gate', 'Writers': 'Alan J. Pakula, William Styron', 'Number of discs': '1'}\nReview Text: Even though I really like the two main actors I didn't even finish watching the movie. Sorry, and I really like Holocaust themed books and movies.\nReview Title: I didn't like the movie\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Band of Brothers\nReview Date: 2013/03/12\nStore: Damian Lewis  (Actor),     Ron Livingston  (Actor),     David Frankel  (Director),     Tom Hanks  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Product Description', 'Band of Brothers (DVD)', \"They were ordinary men, swept up in the most extraordinary conflict in history. But with the eyes of the world upon them, they found their greatest source of strength in each other. Tom Hanks, Steven Spielberg and HBO present the story of Easy Company, an elite team of U.S. paratroopers whose World War II exploits are as incredible as they are true. This landmark ten-part miniseries based on Stephen E. Ambrose's non-fiction best-seller recounts the remarkable achievements of a volunteer rifle company that parachuted into France on D-Day, spearheaded the Market-Garden and Rhine offensives, fought the Nazis in Bastogne and the Bulge and captured Hitler's 'impenetrable' Eagle's Nest at Berchtesgaden in 1945.\", ']]>', 'Review', \"An extraordinary 10-part series, Band of Brothers masters its greatest challenge: it balances the ideal of heroism with the violence and terror of battle, reflecting what is both civilized and savage about war. --Caryn James of the New York TimesIt is doubtful that any war movie on the large or small screen has captured the varied experiences of ordinary soldiers better than Band of Brothers. Whether it's the sheer terror of facing an unseen enemy or the momentary joy following a successful mission, the mini eschews the typical movie cliches while revealing and reveling in the humanity within each member of Easy Company. --Barry Garron of The Hollywood Reporter\", 'Set Contains:', 'HBO\\'s impressive miniseries may have the most handsome DVD packaging to date: a tin container enclosing the accordion sleeves holding six discs. The extras on the set are just as classy. Besides the rudimentary 30-minute making-of, there\\'s an hour\\'s worth of video diaries by actor Ron Livingston (who portrays Lewis Nixon) detailing the tough \"actors\\' boot camp.\" The first-person recollections of the real Easy Company soldiers that begin each episode are expanded in the 80-minute documentary', 'We Stand Alone Together', '. The real footage and heartfelt recollections complement the series, but viewers may want more interaction between the lifelong friends. The documentary is better in the final minutes, when the veterans are not talking about the specific incidents depicted in the film. Another big help in this set is the \"field guide,\" a dossier of maps, glossary, definitions of ranks, a timeline, and a who\\'s who for each episode.', '--Doug Thomas', 'See more']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'James Madio, Shane Taylor, Peter McCabe, David Frankel, David Schwimmer, Rick Gomez, Damian Lewis, Ross McCall, Ron Livingston, Kirk Acevedo, Neal McDonough, Scott Grimes, Dexter Fletcher, Tom Hanks, Eion Bailey, Michael Cudlitz, Frank John Hughes, Matthew Leitch, Richard Speight Jr., Marc Warren, Donnie Wahlberg, Robin LaingJames Madio, Shane Taylor, Peter McCabe, David Frankel, David Schwimmer, Rick Gomez, Damian Lewis, Ross McCall, Ron Livingston, Kirk Acevedo, Neal McDonough, Scott Grimes, Dexter Fletcher, Tom Hanks, Eion Bailey, Michael Cudlitz, Frank John Hughes, Matthew Leit…  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), English (DTS 5.1), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '11 hours and 45 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '8.25 x 5.75 x 2 inches; 12.8 Ounces', 'Item model number': '2221460', 'Director': 'David Frankel, Tom Hanks', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '11 hours and 45 minutes', 'Release date': 'June 6, 2006', 'Actors': 'Damian Lewis, Ron Livingston, Donnie Wahlberg, Frank John Hughes, Neal McDonough', 'Subtitles': 'Spanish', 'Studio': 'HBO Studios', 'Number of discs': '6'}\nReview Text: I have seen Band of Brothers once before on TV but I really like this mini series and enjoyed watching it again. I do really like the bonus material this DVD set offers.\nReview Title: WWII HBO series\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dresden\nReview Date: 2014/02/07\nStore: Felicitas Woll  (Actor),     John Light  (Actor),     Roland Suso Richter  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Product Description', 'January, 1945. In the uncertain days leading up to the Allied bombings of Dresden, Anna (Felicitas Woll) discovers Robert Newman (John Light), an injured British pilot, hiding in a hospital cellar. Torn between loyalty and desire, the young nurse risks everything to help him recover. As Anna struggles to keep his true identity a secret and Robert battles to survive behind enemy lines, a catastrophic fate descends upon the city.', 'DVD Extras:Making-of Featurette, Archival Military Footage of the Dresden bombings', 'Amazon.com', 'A love story set amidst the chaos and horror of World War II,', 'Dresden', \"tells the tale of a beautiful young German nurse who falls in love with an injured British pilot. Anna (Felicitas Woll) is engaged to a wealthy doctor, but she wants more than the bland certainty he can offer her. While on her rounds at the hospital, she discovers Robert (John Light), who is in hiding. Anna knows little about him and is initially unaware that he is a British soldier, and therefore her enemy. What starts as a quiet, private romance escalates into an affair that the couple has a difficult time containing. Woll and Light make beautiful leads, but it's the supporting characters who stand out. Dr. Carl Mauth (Heiner Lauterbach), Anna's father, is a complicated and compelling man who will resort to stealing morphine if his patients are in need. Watching his emotive face, viewers understand his intent without having to hear him speak.\", 'Dresden', \"'s filmmakers do a formidable job of presenting both the Brits and the Germans as flawed people who aren't sure what is right and wrong. Set in January, 1945, prior to the Allied bombings of Dresden, the German production team does a fine job of meshing soap opera type melodrama with feverish action. There are some scenes that are horrific and gruesome to watch. But more often than not, they succinctly set the tone for the violence that accompanies war. Though the three-hour miniseries (which offers both English and German with English subtitles) has been favorably compared with the epic love story portrayed in\", 'Titanic', ', it also shares some of the sweet aspects of', 'Summer of My German Soldier', ', a 1978 made-for-TV movie that depicts the unlikely friendship between a young Jewish girl and a German POW. As with war, there sometimes is no explanation for love. It just happens.', '--Jae-Ha Kim']\nAverage Rating: 4.3\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 4 Ounces', 'Director': 'Roland Suso Richter', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 56 minutes', 'Release date': 'February 5, 2008', 'Actors': 'Felicitas Woll, John Light, Benjamin Sadler, Heiner Lauterbach, Katharina Mainecke', 'Subtitles': 'English', 'Language': 'Unqualified', 'Studio': 'Koch Vision', 'Number of discs': '2'}\nReview Text: Great movie. I speak English and German but there were under titles for the non German speaker. I loved the story line and they really nicely added original footing into the movie. I thought the end a bit sad because there wasn't a true happy end, but this is a movie I will for sure watch again.\nReview Title: Great WWII themed movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: In Tranzit\nReview Date: 2014/02/07\nStore: Thomas Kretschmann  (Actor),     Vera Farmiga  (Actor),     Tom Roberts  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['In the chaotic aftermath of WWII, a group of German POWs are accidentally sent to a female-run Soviet prison camp. When the guards are given the task of weeding out the SS officers, they play a bitter game of cat and mouse with the prisoners. Each group slowly learns that situations are not what they seem; prejudices are sometimes unjustly held; and love can be found in even the harshest places.']\nAverage Rating: 3.7\nProduct Details: {'Genre': 'Drama, History', 'Format': 'Multiple Formats, AC-3, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'John Lynch, Thomas Kretschmann, John Malkovich, Tom Roberts, Vera Farmiga', 'Language': 'English', 'Runtime': '1 hour and 40 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5075300', 'Director': 'Tom Roberts', 'Media Format': 'Multiple Formats, AC-3, Color, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 40 minutes', 'Release date': 'July 1, 2016', 'Actors': 'Thomas Kretschmann, Vera Farmiga, John Malkovich, John Lynch', 'Subtitles': 'Spanish, English', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nReview Text: Even though this was a true story I still found it a bit weird. I did like the movie to watch it again. It did show nicely how harsh the Russians were with their POW and civilian prisoners and also towards their own.\nReview Title: WWII movie\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spartacus: War of the Damned: Season 3\nReview Date: 2014/02/07\nStore: Liam McIntyre  (Actor),     Dustin Clare  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: ['Gaius Claudius Glaber is dead. Many months have passed since his defeat, and the rebel army, led by Spartacus and his generals Crixus, Gannicus and Agron, continue to amass victories over Rome. With the rebel numbers swelling to thousands of freed slaves, Spartacus is more determined than ever to bring down the entire Roman Republic. Following Ashur’s death, Naevia and Crixus fight as one. Together, the rebels engage in one bloody skirmish after another and prepare for the inevitable: a full out war with Rome. The Roman Senate turns to Marcus Crassus, a wealthy, strategic politician, for aid. He respects his opponent and refuses to make the same mistakes Glaber and his predecessors have. With a young and fiercely competitive Julius Caesar as an ally, Crassus is determined to crush Spartacus and his rebellion.']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '27460994', 'Media Format': 'NTSC, Multiple Formats, Widescreen', 'Run time': '7 hours and 20 minutes', 'Release date': 'September 3, 2013', 'Actors': 'Liam McIntyre, Dustin Clare, Manu Bennett, Dan Feuerriegel', 'Subtitles': 'English, Spanish', 'Producers': 'Rob Tapert, Steven S. DeKnight, Sam Raimi, Joshua Donen', 'Studio': 'Anchor Bay', 'Writers': 'Steven S. DeKnight', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: This last season I have not enjoyed as much as the others. It is okay to watch. I enjoyed the previous seasons more.\nReview Title: Last Spartacus\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Colditz: The Complete 2-Part Miniseries\nReview Date: 2015/09/03\nStore: Jason Priestley  (Actor),     Timothy West  (Actor),     Stuart Orme  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Tom Hardy, Sophia Myles, Damian Lewis. A group of Allied escape artists band together to hatch the ultimate break-out from the impregnable walls of the notorious German POW camp at Colditz Castle. 2005/color/3 hrs., 4 min/NR/widescreen.']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Military & War/World War II, Military & War/Drama', 'Format': 'Multiple Formats, Anamorphic, Color, Dolby, Full Screen, NTSC, Surround Sound, THX, HiFi Sound', 'Contributor': 'Sophia Myles, Damian Lewis, Jason Priestley, Stuart Orme, Tom Hardy, Laurence Fox, James Fox, Timothy WestSophia Myles, Damian Lewis, Jason Priestley, Stuart Orme, Tom Hardy, Laurence Fox, James Fox, Timothy West   See more', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.47 Ounces', 'Item model number': '3711183', 'Director': 'Stuart Orme', 'Media Format': 'Multiple Formats, Anamorphic, Color, Dolby, Full Screen, NTSC, Surround Sound, THX, HiFi Sound', 'Run time': '3 hours and 4 minutes', 'Release date': 'June 5, 2007', 'Actors': 'Jason Priestley, Timothy West, James Fox, Sophia Myles, Damian Lewis', 'Studio': 'Shout! Factory / Timeless Media', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: The movie is a bit boring but I guess otherwise it is ok.\nReview Title: WWII movie\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Rome: The Complete Series (RPKG/DVD)\nReview Date: 2016/06/27\nStore: Kevin McKidd  (Actor),     Ray Stevenson  (Actor)    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Every city has its secrets. This epic series follows generals and soldiers, masters and slaves, husbands and wives--all entwined in the furious historical events that saw the death of a republic and the birth of the Roman empire. The ensemble cast includes Kevin McKidd, Ray Stevenson, Kenneth Cranham and Ciaran Hinds.', ']]>']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, DTS Surround Sound, AC-3, NTSC, Subtitled, Widescreen', 'Contributor': 'William J. MacDonald, Kevin McKidd, Enzo Cilenti, Roberto Purvis, Anna Fausta Primiano, Anne Thomopoulos, Frank Doelger, Kerry Condon, Ciarán Hinds, Vincenzo Nicoli, Nicholas Woodeson, Tobias Menzies, Jim Dyer, Polly Walker, Bruno Heller, Indira Varma, Max Pirkis, Chiara Mastalli, John Milius, Fabio Carfora, Karl Johnson, David Bamber, Esther Hall, Lee Boardman, Anna Francolini, Lyndsey Marshal, Kenneth Cranham, Ted Rusoff, Coral Amiga, Simon Woods, Richard Katz, Eugene Kelly, Lindsay Duncan, Haydn Gwynne, Paul Jesson, Rick Warden, Ray Stevenson, Marco Valerio Pugini, James Purefoy, Lydia Leonard, Maggie McCarthy, Lidia Biondi, Lucy Richer, Anna Patrick, Manfredi Aliquo, Lorcan Cranitch, John Melfi, Francesca Romana Coluzzi, Suzanne BertishWilliam J. MacDonald, Kevin McKidd, Enzo Cilenti, Roberto Purvis, Anna Fausta Primiano, Anne Thomopoulos, Frank Doelger, Kerry Condon, Ciarán Hinds, Vincenzo Nicoli, Nicholas Woodeson, Tobias Menzies, Jim Dyer, Polly Walker, Bruno Heller, Indira Varma, Max Pirkis,…  See more', 'Language': 'English (DTS-HD Master Audio 5.1)', 'Number Of Discs': '11', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 13.26 Ounces', 'Item model number': '28941093', 'Media Format': 'Multiple Formats, Box set, Color, DTS Surround Sound, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '20 hours and 29 minutes', 'Release date': 'October 21, 2014', 'Actors': 'Kevin McKidd, Ray Stevenson, Kenneth Cranham, Polly Walker, James Purefoy', 'Subtitles': 'English, French, Dutch, Spanish, Portuguese', 'Producers': 'Bruno Heller, Lucy Richer, William J. MacDonald, Marco Valerio Pugini, John Milius', 'Studio': 'Studio Distribution Services', 'Number of discs': '11'}\nReview Text: Like the series. I wished they had made more than just 2 seasons.\nReview Title: 2 Seasons of Rome\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "This individual exhibits a distinct preference for dramatic and historical films, particularly those set during World War II and involving moral complexities or heroic narratives. Common themes include:\n\n- **Holocaust and War**: A consistent interest in Holocaust narratives, evident from multiple purchases dealing with themes of survival, resistance, and moral dilemmas under Nazi rule.\n- **Emotional Engagement**: Strong emotional connection to stories that highlight courage, sacrifice, and human resilience during tumultuous times.\n- **Language Preference**: Favoring films available in multiple languages, particularly German and English, as they appreciate authenticity and often seek English subtitles for non-native content.\n- **High Ratings**: Frequently gives high ratings to films that align with historical accuracy and impactful storytelling while showing less favorable opinions for those that miss these marks, indicating discernment in quality.\n- **Genres**: Inclination towards drama and historical fiction, with a notable interest in documentaries or biographical accounts portraying genuine historical events and figures.\n- **Actor Recognition**: Preferences also include specific actors, with some previous familiarity leading to favorable reviews and repeat purchases of their work.\n\nOverall, the data indicates a thoughtful consumer who values poignant storytelling that reflects on human experiences in the context of significant historical events.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Season 1 the Vikings",
    "text": "This was a gift, but I have watched every season of the Vikings so far and I love the show. Hopefully they are making many more to come.",
    "images": [],
    "asin": "B00EZJZQRE",
    "parent_asin": "B00EZJZQRE",
    "user_id": "AG6O4ZXUWRZSOAHFVPCLYDIEH4VQ",
    "timestamp": "2016-06-27 17:45:56",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Vikings - Season 1 [Blu-ray] [2013]",
    "average_rating": 4.6,
    "rating_number": 985,
    "features": [],
    "description": [
      "Journey to a thrilling ancient world in this epic new series about history’s bravest and most brutally fearsome warriors... Vikings. Ragnar, a would-be Viking chieftain, longs to fulfil his destiny as an explorer and conqueror, alongside his ambitious brother Rollo and loyal wife Lagertha. But as Ragnar leads daring raids in distant realms across the ocean, treacherous forces in his Norse homeland conspire against him. Faced with shocking betrayals and the temptations of a mysterious seductress, Ragnar must wage war on the battlefield – and within himself – to protect his freedom, family and life."
    ],
    "price": 14.04,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51nefFD7cSL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51nefFD7cSL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Rated:    Unrated    Format: Blu-ray",
    "categories": [
      "Movies & TV",
      "Blu-ray",
      "TV"
    ],
    "details": {
      "Genre": "Action & Adventure",
      "Language": "English",
      "Number Of Discs": "2",
      "Runtime": "6 hours and 38 minutes",
      "Publication Date": "February 3, 2014",
      "Aspect Ratio": "Unknown",
      "MPAA rating": "Unrated (Not Rated)",
      "Product Dimensions": "5.31 x 0.59 x 6.77 inches; 0.01 Ounces",
      "Run time": "6 hours and 38 minutes",
      "Release date": "February 3, 2014",
      "Studio": "20th Century Fox Home Entertainment",
      "Number of discs": "2"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}