{
  "user_id": "AG3JDMAFA6HDGDKX4HQJDMKUNEEA",
  "summary": "=== Purchase Information ===\nProduct Title: It Might Get Loud\nReview Date: 2010/08/12\nStore: Jimmy Page  (Actor),     The Edge  (Actor),     Davis Guggenheim  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'A documentary on the electric guitar from the point of view of three significant rock musicians: The Edge, Jimmy Page, and Jack White. Starring: Jimmy Page, The Edge, Jack White', 'Amazon.com', 'Three generations of rock guitarists come together for', 'It Might Get Loud', ', a 2009 documentary directed by Davis Guggenheim (', 'An Inconvenient Truth', '). These are not just your garden-variety guitar gods: Jimmy Page, in his mid-\\'60s at the time of the film, founded Led Zeppelin, who dominated the 1970s following the breakup of the Beatles. As a member of U2, 48-year-old David Evans, better known as the Edge, created one of the most distinctive and influential sounds of the past quarter century. And 34-year-old Jack White (of the White Stripes, the Raconteurs, and the Dead Weather) was described by one music publication as \"the most significant rock \\'n\\' roll figure of the past ten years.\" Guggenheim, who followed the three around for the better part of a year, takes us into their individual lives, past and present. There are shots of Page as a young London session musician, with the Yardbirds and Zeppelin, at Headley Grange (the estate where much of the fourth Zep album was made), and at home with his record collection. The Edge takes us to the Dublin classroom where U2 first rehearsed, as well as to the practice room he uses now (never a virtuoso soloist, he developed a style based on texture and a mind-boggling array of effects); and White, whose insistence on authenticity is admirable but perhaps a tad self-conscious, constructs a \"guitar\" from a plank of wood, a piece of wire, and a Coke bottle (he also plays a recording by the primitive bluesman Son House, featuring just voice and handclaps, that White says is still his biggest inspiration). The three also converge on a Hollywood sound stage, where they chat and a do a little jamming on Zep\\'s \"In My Time of Dying\" (with all three playing slide guitar) and the Band\\'s \"The Weight.\" It\\'s hard to say if the film\\'s appeal will extend beyond guitar freaks and fans of these particular bands, but at the very least,', 'It Might Get Loud', \"offers some interesting insight into the soul and inspiration behind some of pop's best and most popular music.\", '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Documentary, Musical', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Bono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas TullBono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas Tull   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.3 x 0.7 inches; 0.32 Ounces', 'Item model number': '6524754', 'Director': 'Davis Guggenheim', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'December 22, 2009', 'Actors': 'Jimmy Page, The Edge, Jack White, Bono, The  Edge', 'Producers': 'Thomas Tull, Davis Guggenheim, Lesley Chilcott, Peter Afterman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I watched this because seeing Pagey in this kind of detail is rare.<br />One has to put up with Jack White (as white as they come, good name) and Dull Edge (incongruous seeing him on stage--or the same planet--with Jimmy Page) but overall is is worth it. I did have to go to \"mute\" on several occasions, when I could not stand it.\nReview Title: Seeing Pagey here is worth putting up with the other two\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Cabin in the Woods\nReview Date: 2013/01/16\nCategories: Suspense, Comedy, Harrowing, Terrifying\nProduct Description: ['A rambunctious group of five college friends steal away for a weekend of debauchery in an isolated country cabin, only to be attacked by horrific supernatural creatures in a night of endless terror and bloodshed.']\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Drew Goddard'], 'Producers': ['Joss Whedon'], 'Starring': ['Kristen Connolly', 'Chris Hemsworth', 'Anna Hutchison']}\nReview Text: This is not your typical horror movie<br />If you liked \"Cube\" you will probably like this.<br /><br />Very entertaining.<br />I enjoyed the mix of folklore and technology<br />Pretty good surprise ending\nReview Title: Not your typical horror movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Justin Bieber's Believe\nReview Date: 2014/05/20\nCategories: Music Videos and Concerts, Documentary, Charming, Cheerful\nProduct Description: [\"Experience Justin Bieber's real story in this compelling documentary featuring thrilling never-before-seen concert footage, behind-the-scenes access and special appearances.\"]\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon M. Chu'], 'Producers': ['Justin Bieber', 'Scooter Braun', \"Bill O'Dowd\", 'Usher Raymond IV', 'Garrett Grant'], 'Starring': ['Justin Bieber', 'will.i.am', 'Ellen DeGeneres']}\nReview Text: OK, what happened to his pants????<br />Really not much more to say here<br />Except...what happened to his pants????<br />Is this Dysgenics or drugs?<br />Both?\nReview Title: OK, what happened to his pants????\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/26\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['John H. Radulovic', 'Lou Fusaro'], 'Starring': ['Xander Berkeley', 'Sarah Clarke', 'Jenni Blong'], 'Studio': ['Vuguru']}\nReview Text: This is a great idea for a movie, or two or three...<br />I love Xander Berkeley, he has been one of my favorite character actors for many years.<br />He was great in 24<br />One wonders if the ultimate question &#34;Is he Satan?&#34; will ever be answered?<br />In the second one, which I have not finished yet (so don't ruin it for me!) it seems that Xander's character actually could have an enemy or at least an antagonist...he may FEAR someone, which makes it more complex..and interesting\nReview Title: Love the idea for this movie and Xander is the best character actor for it\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/06/16\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti', 'Steve Saint Leger', 'Jeff Woolnough', 'Helen Shaver', 'Daniel Grou', 'David Frazee', 'Joshua Zimmerman', 'David Wellington', 'Johan Renck'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Clive Standen'], 'Studio': ['History']}\nReview Text: Good show that needed to be written<br />The Vikings did amazing things<br />History would not be the same without them\nReview Title: Very good history. Fun stories\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/06/16\nAverage Rating: 4.9\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nReview Text: The first and second seasons were better<br />This is pretty good<br />They need to go back to the original idea\nReview Title: I like Timothy Oliphant, but they should go back to the original idea of the series\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Guitar World -- Jimi Hendrix Playing Secrets: The Ultimate Guide!\nReview Date: 2015/12/22\nStore: Hendrix, Jimi  (Actor)    Format: DVD\nCategories: Movies & TV, Music Artists, Hendrix, Jimi\nProduct Description: [\"Learn all of Jimi Hendrix's essential rhythm and lead guitar techniques, including his go-to soloing patterns, extended pentatonic and blues-scale positions, signature phrasing and articulations, string bending, vibrato and whammy bar usage, strummed octa\"]\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '56-44653', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 1, 2015', 'Actors': 'Hendrix, Jimi', 'Studio': 'Alfred Music', 'Number of discs': '1'}\nReview Text: Won't play on any DVD player or computer\nReview Title: One Star\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bottleneck Slide Guitar for Beginners\nReview Date: 2016/09/30\nStore: Tom Feldmann  (Actor, Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Product Description', \"There is nothing like the feel of a bottleneck sliding across your strings nor the sound that comes forth as it screams, growls and moans. What other tool can create the sweat or raw emotion of the human voice? But some believe that there is a sort of mystery behind the use of a bottleneck slide, but the reality is, anyone can learn to do it.In this lesson Tom Feldmann teaches you the very basics of how to play with a bottleneck slide. Starting with the most important step, producing a single note, Tom then takes you through many simple exercises getting you comfortable sliding on single, double and multiple strings. Starting in Open D (Vestapol) tuning, Tom uses Bukka White's Jitterbug Swing for the single string slide exercise, Robert Wilkins' I Wished I Was In Heaven for double string exercise, an Elmore James style shuffle for a multiple string exercise and closes with Guitar Rag by Sylvester Weaver which brings together all of the elements in one wonderful instrumental.Since the basics were covered in Open D, the lesson closes with two songs in Open G (Spanish) tuning; Charley Patton's I'm Going Home and Bobby Grant's Nappy Headed Blues. These two songs will give you a solid foundation for single, double and multiple string slide in Open G tuning.Vibrato, left and right hand dampening, as well as alternating and monotonic bass are discussed in detail and used throughout the lesson. A detailed tab/music booklet is included as a PDF file on the DVD. In addition the original recordings of all the tunes are included.115 minutes - Level 1/2 - Detailed tab/music PDF file on the DVD DVD is region 0, playable worldwide.\", 'Review', \"The cool mystique of slide guitar is as old as the amazing sleight-of-hand itself. Ever since uncredited inventors discovered that mundane household objects (jackknives, glass bottlenecks, steel bars, beef bones, you name it) possess the magical power to summon otherworldly utterances when raked over strings, spectators have thrilled at the sound. And have wanted to make guitars mystically speak in those strange tongues with their own hands. Anyone similarly spellbound-but unsure how and where to begin - meet Tom Feldmann, your personal revelator. Vanquishing technical mysteries, his easygoing but comprehensive Bottleneck Slide Guitar For Beginners is the perfect how-to encyclopedia for early-starters as well as nonstarters who've never taken a slide for a glide before. Issues with making those first moves all get addressed, from choosing slides and strings to conquering subtle-yet befuddling-nuances like correct bottleneck placement, adjusting pressure and angles of attack, achieving clean single notes, then mastering vibrato. Even those unwanted squeaks and rattles get diagnosed. But, wisely, the walkaway goal of this DVDs two hours of step-by-step instruction isn't being able to ape an isolated song or two. Instead, Robert Wilkins' s I Wished I Was In Heaven and other vintage masterpieces get patiently dissected on split-screen (simultaneously viewing right and left hands) to illustrate techniques that build a foundation. Knowing your way around both Vestapol and Spanish tunings confers versatility. Combined with knowing single, double and multi-string sliding - now that's powerful independence. (Pocketing buzzing chunks of Bukka White's Jitterbug Swing, a cold shot of Charley Patton and Elmore's killer broom dusting in the process is just plain cool. Bluesrag/Dennis Rozanski --Bluesrag/Dennis RozanskiHere's a teaching DVD for those just wanting to get started on bottleneck style guitar. Feldmann starts out by talking about his equipment, including an acoustic and a resonator guitar, different types of slides, fingerpicks, and then he introduces the open D tuning he uses for the first few lessons. He talks quite slowly, and teaches very simple pieces first playing the piece, then breaking down each part of the song, and at the end playing it through slowly in split screen, with a different camera on each hand on the guitar. In open D you'll learn Bukka White's Jitterbug Swing,, Robert Wilkins' I Wished I Was In Heaven Sitting Down, and Sylvester Weaver's Guitar Rag (same song known as Steel Guitar Rag in Western Swing). Charley Patton's I'm Going Home and Bobby Grant's Nappy Headed Blues are taught in open G, which is of course explained first. The latter is a little more advanced. The DVD also has a PDF file with the tablature for what is taught, and the original recordings of the songs are featured as well. The video portion of the program ends with a clip of Son House playing Levee Camp Blues from what looks like one of the American Folk Blues tours to England and Europe. Marc Bristol/Blue Suede News --Marc Bristol/Blue Suede News\"]\nAverage Rating: 4.5\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Tom Feldmann', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 55 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.48 x 5.31 x 0.59 inches; 2.96 Ounces', 'Item model number': 'SGGW1004', 'Director': 'Tom Feldmann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 19, 2012', 'Actors': 'Tom Feldmann', 'Studio': \"Grossman's Guitar Workshop\", 'Number of discs': '1'}\nReview Text: Great introductory book<br />This guy is a teacher as well as a performer<br />No show off none sense<br />In PDF file of tab, all that he shows is tabbed out\nReview Title: Great introductory book\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/04\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Troy Miller'], 'Starring': ['Brian Regan'], 'Studio': ['COMEDY CENTRAL']}\nReview Text: Funny, clean humor<br />I get the idea that the guy is a Christian, because of the complete lack of filthy words in his routines<br />Bravo for him, and God bless him<br />I'm sick of nasty comedians\nReview Title: Funny, clean humor I get the idea that the ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Search For The Gods (1975)\nReview Date: 2019/01/16\nStore: Stephen McHattie  (Actor),     Ralph Bellamy  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"From an era when publications and talk shows speculated that space aliens had long ago come to Earth and left evidence of their visit comes Search for the Gods, a tale about three adventurers who come into possession of a mysterious medallion-like relic believed to be some of that evidence. Metallurgical tests show that the artifact is made of an unknown alloy. When a museum curator opines it is an interlocking piece to a larger item, the trio sets out in hopes of finding another relic. Meanwhile, others seek to buy the medallion - or kill for it. Stephen McHattie (Watchmen's Hollis Mason, aka Nite Owl) plays a drifter who receives the artifact from a Native American holy man. Top-billed Kurt Russell (six years before his iconic role as Snake Plissken in Escape from New York) plays the Taos, New Mexico townie who teams up with the drifter. And Victoria Racimo (Falcon Crest) rounds out the film's key trio.\"]\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'NTSC', 'Contributor': 'Raymond St. Jacques, Victoria Racimo, John War Eagle, Ralph Bellamy, Albert Paulsen, Joe David Marcus, Larry Blake, Jud Taylor, Kurt Russell, Carmen Argenziano, Jackson D Kane, Stephen McHattie, Joe Marcus Jr., Wilfred Lloyd BaumesRaymond St. Jacques, Victoria Racimo, John War Eagle, Ralph Bellamy, Albert Paulsen, Joe David Marcus, Larry Blake, Jud Taylor, Kurt Russell, Carmen Argenziano, Jackson D Kane, Stephen McHattie, Joe Marcus Jr., Wilfred Lloyd Baumes  See more', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 25, 2014', 'Actors': 'Stephen McHattie, Ralph Bellamy, Victoria Racimo, Albert Paulsen, Carmen Argenziano', 'Producers': 'Wilfred Lloyd Baumes', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I saw this in the early/mid seventies<br />Awesome ancient astronauts show<br />Very early<br />Good copy<br />Not blurry at all\nReview Title: Rare! Been looking for 30 years\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/11/25\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['한국어'], 'Subtitles': ['None available'], 'Directors': ['Joon Ho Bong'], 'Producers': ['Joon Ho Bong', 'Sin Ae Kwak', 'Yang Kwon Moon', 'Young Hwan Jang'], 'Starring': ['Kang Ho Song', 'Sun Kyun Lee', 'Yeo Jeong Cho'], 'Studio': ['NEON']}\nReview Text: I’ve seen this movie a few times<br />It is one of the funniest films ever made\nReview Title: Amazing\nRating: 5.0\n--------------------------------------------------",
  "reference": "It Might Get Loud\nJimmy Page  (Actor),     The Edge  (Actor),     Davis Guggenheim  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'A documentary on the electric guitar from the point of view of three significant rock musicians: The Edge, Jimmy Page, and Jack White. Starring: Jimmy Page, The Edge, Jack White', 'Amazon.com', 'Three generations of rock guitarists come together for', 'It Might Get Loud', ', a 2009 documentary directed by Davis Guggenheim (', 'An Inconvenient Truth', '). These are not just your garden-variety guitar gods: Jimmy Page, in his mid-\\'60s at the time of the film, founded Led Zeppelin, who dominated the 1970s following the breakup of the Beatles. As a member of U2, 48-year-old David Evans, better known as the Edge, created one of the most distinctive and influential sounds of the past quarter century. And 34-year-old Jack White (of the White Stripes, the Raconteurs, and the Dead Weather) was described by one music publication as \"the most significant rock \\'n\\' roll figure of the past ten years.\" Guggenheim, who followed the three around for the better part of a year, takes us into their individual lives, past and present. There are shots of Page as a young London session musician, with the Yardbirds and Zeppelin, at Headley Grange (the estate where much of the fourth Zep album was made), and at home with his record collection. The Edge takes us to the Dublin classroom where U2 first rehearsed, as well as to the practice room he uses now (never a virtuoso soloist, he developed a style based on texture and a mind-boggling array of effects); and White, whose insistence on authenticity is admirable but perhaps a tad self-conscious, constructs a \"guitar\" from a plank of wood, a piece of wire, and a Coke bottle (he also plays a recording by the primitive bluesman Son House, featuring just voice and handclaps, that White says is still his biggest inspiration). The three also converge on a Hollywood sound stage, where they chat and a do a little jamming on Zep\\'s \"In My Time of Dying\" (with all three playing slide guitar) and the Band\\'s \"The Weight.\" It\\'s hard to say if the film\\'s appeal will extend beyond guitar freaks and fans of these particular bands, but at the very least,', 'It Might Get Loud', \"offers some interesting insight into the soul and inspiration behind some of pop's best and most popular music.\", '--Sam Graham']\n{'Genre': 'Documentary, Musical', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Bono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas TullBono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas Tull   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.3 x 0.7 inches; 0.32 Ounces', 'Item model number': '6524754', 'Director': 'Davis Guggenheim', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'December 22, 2009', 'Actors': 'Jimmy Page, The Edge, Jack White, Bono, The  Edge', 'Producers': 'Thomas Tull, Davis Guggenheim, Lesley Chilcott, Peter Afterman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI watched this because seeing Pagey in this kind of detail is rare.<br />One has to put up with Jack White (as white as they come, good name) and Dull Edge (incongruous seeing him on stage--or the same planet--with Jimmy Page) but overall is is worth it. I did have to go to \"mute\" on several occasions, when I could not stand it.\nSeeing Pagey here is worth putting up with the other two\nThe Cabin in the Woods\nSuspense, Comedy, Harrowing, Terrifying\n['A rambunctious group of five college friends steal away for a weekend of debauchery in an isolated country cabin, only to be attacked by horrific supernatural creatures in a night of endless terror and bloodshed.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Drew Goddard'], 'Producers': ['Joss Whedon'], 'Starring': ['Kristen Connolly', 'Chris Hemsworth', 'Anna Hutchison']}\nThis is not your typical horror movie<br />If you liked \"Cube\" you will probably like this.<br /><br />Very entertaining.<br />I enjoyed the mix of folklore and technology<br />Pretty good surprise ending\nNot your typical horror movie\nJustin Bieber's Believe\nMusic Videos and Concerts, Documentary, Charming, Cheerful\n[\"Experience Justin Bieber's real story in this compelling documentary featuring thrilling never-before-seen concert footage, behind-the-scenes access and special appearances.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon M. Chu'], 'Producers': ['Justin Bieber', 'Scooter Braun', \"Bill O'Dowd\", 'Usher Raymond IV', 'Garrett Grant'], 'Starring': ['Justin Bieber', 'will.i.am', 'Ellen DeGeneres']}\nOK, what happened to his pants????<br />Really not much more to say here<br />Except...what happened to his pants????<br />Is this Dysgenics or drugs?<br />Both?\nOK, what happened to his pants????\n{'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['John H. Radulovic', 'Lou Fusaro'], 'Starring': ['Xander Berkeley', 'Sarah Clarke', 'Jenni Blong'], 'Studio': ['Vuguru']}\nThis is a great idea for a movie, or two or three...<br />I love Xander Berkeley, he has been one of my favorite character actors for many years.<br />He was great in 24<br />One wonders if the ultimate question &#34;Is he Satan?&#34; will ever be answered?<br />In the second one, which I have not finished yet (so don't ruin it for me!) it seems that Xander's character actually could have an enemy or at least an antagonist...he may FEAR someone, which makes it more complex..and interesting\nLove the idea for this movie and Xander is the best character actor for it\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti', 'Steve Saint Leger', 'Jeff Woolnough', 'Helen Shaver', 'Daniel Grou', 'David Frazee', 'Joshua Zimmerman', 'David Wellington', 'Johan Renck'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Clive Standen'], 'Studio': ['History']}\nGood show that needed to be written<br />The Vikings did amazing things<br />History would not be the same without them\nVery good history. Fun stories\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nThe first and second seasons were better<br />This is pretty good<br />They need to go back to the original idea\nI like Timothy Oliphant, but they should go back to the original idea of the series\nGuitar World -- Jimi Hendrix Playing Secrets: The Ultimate Guide!\nHendrix, Jimi  (Actor)    Format: DVD\nMovies & TV, Music Artists, Hendrix, Jimi\n[\"Learn all of Jimi Hendrix's essential rhythm and lead guitar techniques, including his go-to soloing patterns, extended pentatonic and blues-scale positions, signature phrasing and articulations, string bending, vibrato and whammy bar usage, strummed octa\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '56-44653', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 1, 2015', 'Actors': 'Hendrix, Jimi', 'Studio': 'Alfred Music', 'Number of discs': '1'}\nWon't play on any DVD player or computer\nOne Star\nBottleneck Slide Guitar for Beginners\nTom Feldmann  (Actor, Director)    Rated:    G    Format: DVD\nMovies & TV, Movies\n['Product Description', \"There is nothing like the feel of a bottleneck sliding across your strings nor the sound that comes forth as it screams, growls and moans. What other tool can create the sweat or raw emotion of the human voice? But some believe that there is a sort of mystery behind the use of a bottleneck slide, but the reality is, anyone can learn to do it.In this lesson Tom Feldmann teaches you the very basics of how to play with a bottleneck slide. Starting with the most important step, producing a single note, Tom then takes you through many simple exercises getting you comfortable sliding on single, double and multiple strings. Starting in Open D (Vestapol) tuning, Tom uses Bukka White's Jitterbug Swing for the single string slide exercise, Robert Wilkins' I Wished I Was In Heaven for double string exercise, an Elmore James style shuffle for a multiple string exercise and closes with Guitar Rag by Sylvester Weaver which brings together all of the elements in one wonderful instrumental.Since the basics were covered in Open D, the lesson closes with two songs in Open G (Spanish) tuning; Charley Patton's I'm Going Home and Bobby Grant's Nappy Headed Blues. These two songs will give you a solid foundation for single, double and multiple string slide in Open G tuning.Vibrato, left and right hand dampening, as well as alternating and monotonic bass are discussed in detail and used throughout the lesson. A detailed tab/music booklet is included as a PDF file on the DVD. In addition the original recordings of all the tunes are included.115 minutes - Level 1/2 - Detailed tab/music PDF file on the DVD DVD is region 0, playable worldwide.\", 'Review', \"The cool mystique of slide guitar is as old as the amazing sleight-of-hand itself. Ever since uncredited inventors discovered that mundane household objects (jackknives, glass bottlenecks, steel bars, beef bones, you name it) possess the magical power to summon otherworldly utterances when raked over strings, spectators have thrilled at the sound. And have wanted to make guitars mystically speak in those strange tongues with their own hands. Anyone similarly spellbound-but unsure how and where to begin - meet Tom Feldmann, your personal revelator. Vanquishing technical mysteries, his easygoing but comprehensive Bottleneck Slide Guitar For Beginners is the perfect how-to encyclopedia for early-starters as well as nonstarters who've never taken a slide for a glide before. Issues with making those first moves all get addressed, from choosing slides and strings to conquering subtle-yet befuddling-nuances like correct bottleneck placement, adjusting pressure and angles of attack, achieving clean single notes, then mastering vibrato. Even those unwanted squeaks and rattles get diagnosed. But, wisely, the walkaway goal of this DVDs two hours of step-by-step instruction isn't being able to ape an isolated song or two. Instead, Robert Wilkins' s I Wished I Was In Heaven and other vintage masterpieces get patiently dissected on split-screen (simultaneously viewing right and left hands) to illustrate techniques that build a foundation. Knowing your way around both Vestapol and Spanish tunings confers versatility. Combined with knowing single, double and multi-string sliding - now that's powerful independence. (Pocketing buzzing chunks of Bukka White's Jitterbug Swing, a cold shot of Charley Patton and Elmore's killer broom dusting in the process is just plain cool. Bluesrag/Dennis Rozanski --Bluesrag/Dennis RozanskiHere's a teaching DVD for those just wanting to get started on bottleneck style guitar. Feldmann starts out by talking about his equipment, including an acoustic and a resonator guitar, different types of slides, fingerpicks, and then he introduces the open D tuning he uses for the first few lessons. He talks quite slowly, and teaches very simple pieces first playing the piece, then breaking down each part of the song, and at the end playing it through slowly in split screen, with a different camera on each hand on the guitar. In open D you'll learn Bukka White's Jitterbug Swing,, Robert Wilkins' I Wished I Was In Heaven Sitting Down, and Sylvester Weaver's Guitar Rag (same song known as Steel Guitar Rag in Western Swing). Charley Patton's I'm Going Home and Bobby Grant's Nappy Headed Blues are taught in open G, which is of course explained first. The latter is a little more advanced. The DVD also has a PDF file with the tablature for what is taught, and the original recordings of the songs are featured as well. The video portion of the program ends with a clip of Son House playing Levee Camp Blues from what looks like one of the American Folk Blues tours to England and Europe. Marc Bristol/Blue Suede News --Marc Bristol/Blue Suede News\"]\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Tom Feldmann', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 55 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.48 x 5.31 x 0.59 inches; 2.96 Ounces', 'Item model number': 'SGGW1004', 'Director': 'Tom Feldmann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 19, 2012', 'Actors': 'Tom Feldmann', 'Studio': \"Grossman's Guitar Workshop\", 'Number of discs': '1'}\nGreat introductory book<br />This guy is a teacher as well as a performer<br />No show off none sense<br />In PDF file of tab, all that he shows is tabbed out\nGreat introductory book\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Troy Miller'], 'Starring': ['Brian Regan'], 'Studio': ['COMEDY CENTRAL']}\nFunny, clean humor<br />I get the idea that the guy is a Christian, because of the complete lack of filthy words in his routines<br />Bravo for him, and God bless him<br />I'm sick of nasty comedians\nFunny, clean humor I get the idea that the ...\nSearch For The Gods (1975)\nStephen McHattie  (Actor),     Ralph Bellamy  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"From an era when publications and talk shows speculated that space aliens had long ago come to Earth and left evidence of their visit comes Search for the Gods, a tale about three adventurers who come into possession of a mysterious medallion-like relic believed to be some of that evidence. Metallurgical tests show that the artifact is made of an unknown alloy. When a museum curator opines it is an interlocking piece to a larger item, the trio sets out in hopes of finding another relic. Meanwhile, others seek to buy the medallion - or kill for it. Stephen McHattie (Watchmen's Hollis Mason, aka Nite Owl) plays a drifter who receives the artifact from a Native American holy man. Top-billed Kurt Russell (six years before his iconic role as Snake Plissken in Escape from New York) plays the Taos, New Mexico townie who teams up with the drifter. And Victoria Racimo (Falcon Crest) rounds out the film's key trio.\"]\n{'Genre': 'Science Fiction & Fantasy', 'Format': 'NTSC', 'Contributor': 'Raymond St. Jacques, Victoria Racimo, John War Eagle, Ralph Bellamy, Albert Paulsen, Joe David Marcus, Larry Blake, Jud Taylor, Kurt Russell, Carmen Argenziano, Jackson D Kane, Stephen McHattie, Joe Marcus Jr., Wilfred Lloyd BaumesRaymond St. Jacques, Victoria Racimo, John War Eagle, Ralph Bellamy, Albert Paulsen, Joe David Marcus, Larry Blake, Jud Taylor, Kurt Russell, Carmen Argenziano, Jackson D Kane, Stephen McHattie, Joe Marcus Jr., Wilfred Lloyd Baumes  See more', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 25, 2014', 'Actors': 'Stephen McHattie, Ralph Bellamy, Victoria Racimo, Albert Paulsen, Carmen Argenziano', 'Producers': 'Wilfred Lloyd Baumes', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI saw this in the early/mid seventies<br />Awesome ancient astronauts show<br />Very early<br />Good copy<br />Not blurry at all\nRare! Been looking for 30 years\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['한국어'], 'Subtitles': ['None available'], 'Directors': ['Joon Ho Bong'], 'Producers': ['Joon Ho Bong', 'Sin Ae Kwak', 'Yang Kwon Moon', 'Young Hwan Jang'], 'Starring': ['Kang Ho Song', 'Sun Kyun Lee', 'Yeo Jeong Cho'], 'Studio': ['NEON']}\nI’ve seen this movie a few times<br />It is one of the funniest films ever made\nAmazing",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: It Might Get Loud\nReview Date: 2010/08/12\nStore: Jimmy Page  (Actor),     The Edge  (Actor),     Davis Guggenheim  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', 'A documentary on the electric guitar from the point of view of three significant rock musicians: The Edge, Jimmy Page, and Jack White. Starring: Jimmy Page, The Edge, Jack White', 'Amazon.com', 'Three generations of rock guitarists come together for', 'It Might Get Loud', ', a 2009 documentary directed by Davis Guggenheim (', 'An Inconvenient Truth', '). These are not just your garden-variety guitar gods: Jimmy Page, in his mid-\\'60s at the time of the film, founded Led Zeppelin, who dominated the 1970s following the breakup of the Beatles. As a member of U2, 48-year-old David Evans, better known as the Edge, created one of the most distinctive and influential sounds of the past quarter century. And 34-year-old Jack White (of the White Stripes, the Raconteurs, and the Dead Weather) was described by one music publication as \"the most significant rock \\'n\\' roll figure of the past ten years.\" Guggenheim, who followed the three around for the better part of a year, takes us into their individual lives, past and present. There are shots of Page as a young London session musician, with the Yardbirds and Zeppelin, at Headley Grange (the estate where much of the fourth Zep album was made), and at home with his record collection. The Edge takes us to the Dublin classroom where U2 first rehearsed, as well as to the practice room he uses now (never a virtuoso soloist, he developed a style based on texture and a mind-boggling array of effects); and White, whose insistence on authenticity is admirable but perhaps a tad self-conscious, constructs a \"guitar\" from a plank of wood, a piece of wire, and a Coke bottle (he also plays a recording by the primitive bluesman Son House, featuring just voice and handclaps, that White says is still his biggest inspiration). The three also converge on a Hollywood sound stage, where they chat and a do a little jamming on Zep\\'s \"In My Time of Dying\" (with all three playing slide guitar) and the Band\\'s \"The Weight.\" It\\'s hard to say if the film\\'s appeal will extend beyond guitar freaks and fans of these particular bands, but at the very least,', 'It Might Get Loud', \"offers some interesting insight into the soul and inspiration behind some of pop's best and most popular music.\", '--Sam Graham']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Documentary, Musical', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Bono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas TullBono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas Tull   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.3 x 0.7 inches; 0.32 Ounces', 'Item model number': '6524754', 'Director': 'Davis Guggenheim', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'December 22, 2009', 'Actors': 'Jimmy Page, The Edge, Jack White, Bono, The  Edge', 'Producers': 'Thomas Tull, Davis Guggenheim, Lesley Chilcott, Peter Afterman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I watched this because seeing Pagey in this kind of detail is rare.<br />One has to put up with Jack White (as white as they come, good name) and Dull Edge (incongruous seeing him on stage--or the same planet--with Jimmy Page) but overall is is worth it. I did have to go to \"mute\" on several occasions, when I could not stand it.\nReview Title: Seeing Pagey here is worth putting up with the other two\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Cabin in the Woods\nReview Date: 2013/01/16\nCategories: Suspense, Comedy, Harrowing, Terrifying\nProduct Description: ['A rambunctious group of five college friends steal away for a weekend of debauchery in an isolated country cabin, only to be attacked by horrific supernatural creatures in a night of endless terror and bloodshed.']\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Drew Goddard'], 'Producers': ['Joss Whedon'], 'Starring': ['Kristen Connolly', 'Chris Hemsworth', 'Anna Hutchison']}\nReview Text: This is not your typical horror movie<br />If you liked \"Cube\" you will probably like this.<br /><br />Very entertaining.<br />I enjoyed the mix of folklore and technology<br />Pretty good surprise ending\nReview Title: Not your typical horror movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Justin Bieber's Believe\nReview Date: 2014/05/20\nCategories: Music Videos and Concerts, Documentary, Charming, Cheerful\nProduct Description: [\"Experience Justin Bieber's real story in this compelling documentary featuring thrilling never-before-seen concert footage, behind-the-scenes access and special appearances.\"]\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon M. Chu'], 'Producers': ['Justin Bieber', 'Scooter Braun', \"Bill O'Dowd\", 'Usher Raymond IV', 'Garrett Grant'], 'Starring': ['Justin Bieber', 'will.i.am', 'Ellen DeGeneres']}\nReview Text: OK, what happened to his pants????<br />Really not much more to say here<br />Except...what happened to his pants????<br />Is this Dysgenics or drugs?<br />Both?\nReview Title: OK, what happened to his pants????\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/03/26\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['John H. Radulovic', 'Lou Fusaro'], 'Starring': ['Xander Berkeley', 'Sarah Clarke', 'Jenni Blong'], 'Studio': ['Vuguru']}\nReview Text: This is a great idea for a movie, or two or three...<br />I love Xander Berkeley, he has been one of my favorite character actors for many years.<br />He was great in 24<br />One wonders if the ultimate question &#34;Is he Satan?&#34; will ever be answered?<br />In the second one, which I have not finished yet (so don't ruin it for me!) it seems that Xander's character actually could have an enemy or at least an antagonist...he may FEAR someone, which makes it more complex..and interesting\nReview Title: Love the idea for this movie and Xander is the best character actor for it\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/06/16\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti', 'Steve Saint Leger', 'Jeff Woolnough', 'Helen Shaver', 'Daniel Grou', 'David Frazee', 'Joshua Zimmerman', 'David Wellington', 'Johan Renck'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Clive Standen'], 'Studio': ['History']}\nReview Text: Good show that needed to be written<br />The Vikings did amazing things<br />History would not be the same without them\nReview Title: Very good history. Fun stories\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/06/16\nAverage Rating: 4.9\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nReview Text: The first and second seasons were better<br />This is pretty good<br />They need to go back to the original idea\nReview Title: I like Timothy Oliphant, but they should go back to the original idea of the series\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Guitar World -- Jimi Hendrix Playing Secrets: The Ultimate Guide!\nReview Date: 2015/12/22\nStore: Hendrix, Jimi  (Actor)    Format: DVD\nCategories: Movies & TV, Music Artists, Hendrix, Jimi\nProduct Description: [\"Learn all of Jimi Hendrix's essential rhythm and lead guitar techniques, including his go-to soloing patterns, extended pentatonic and blues-scale positions, signature phrasing and articulations, string bending, vibrato and whammy bar usage, strummed octa\"]\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '56-44653', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'April 1, 2015', 'Actors': 'Hendrix, Jimi', 'Studio': 'Alfred Music', 'Number of discs': '1'}\nReview Text: Won't play on any DVD player or computer\nReview Title: One Star\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bottleneck Slide Guitar for Beginners\nReview Date: 2016/09/30\nStore: Tom Feldmann  (Actor, Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Movies\nProduct Description: ['Product Description', \"There is nothing like the feel of a bottleneck sliding across your strings nor the sound that comes forth as it screams, growls and moans. What other tool can create the sweat or raw emotion of the human voice? But some believe that there is a sort of mystery behind the use of a bottleneck slide, but the reality is, anyone can learn to do it.In this lesson Tom Feldmann teaches you the very basics of how to play with a bottleneck slide. Starting with the most important step, producing a single note, Tom then takes you through many simple exercises getting you comfortable sliding on single, double and multiple strings. Starting in Open D (Vestapol) tuning, Tom uses Bukka White's Jitterbug Swing for the single string slide exercise, Robert Wilkins' I Wished I Was In Heaven for double string exercise, an Elmore James style shuffle for a multiple string exercise and closes with Guitar Rag by Sylvester Weaver which brings together all of the elements in one wonderful instrumental.Since the basics were covered in Open D, the lesson closes with two songs in Open G (Spanish) tuning; Charley Patton's I'm Going Home and Bobby Grant's Nappy Headed Blues. These two songs will give you a solid foundation for single, double and multiple string slide in Open G tuning.Vibrato, left and right hand dampening, as well as alternating and monotonic bass are discussed in detail and used throughout the lesson. A detailed tab/music booklet is included as a PDF file on the DVD. In addition the original recordings of all the tunes are included.115 minutes - Level 1/2 - Detailed tab/music PDF file on the DVD DVD is region 0, playable worldwide.\", 'Review', \"The cool mystique of slide guitar is as old as the amazing sleight-of-hand itself. Ever since uncredited inventors discovered that mundane household objects (jackknives, glass bottlenecks, steel bars, beef bones, you name it) possess the magical power to summon otherworldly utterances when raked over strings, spectators have thrilled at the sound. And have wanted to make guitars mystically speak in those strange tongues with their own hands. Anyone similarly spellbound-but unsure how and where to begin - meet Tom Feldmann, your personal revelator. Vanquishing technical mysteries, his easygoing but comprehensive Bottleneck Slide Guitar For Beginners is the perfect how-to encyclopedia for early-starters as well as nonstarters who've never taken a slide for a glide before. Issues with making those first moves all get addressed, from choosing slides and strings to conquering subtle-yet befuddling-nuances like correct bottleneck placement, adjusting pressure and angles of attack, achieving clean single notes, then mastering vibrato. Even those unwanted squeaks and rattles get diagnosed. But, wisely, the walkaway goal of this DVDs two hours of step-by-step instruction isn't being able to ape an isolated song or two. Instead, Robert Wilkins' s I Wished I Was In Heaven and other vintage masterpieces get patiently dissected on split-screen (simultaneously viewing right and left hands) to illustrate techniques that build a foundation. Knowing your way around both Vestapol and Spanish tunings confers versatility. Combined with knowing single, double and multi-string sliding - now that's powerful independence. (Pocketing buzzing chunks of Bukka White's Jitterbug Swing, a cold shot of Charley Patton and Elmore's killer broom dusting in the process is just plain cool. Bluesrag/Dennis Rozanski --Bluesrag/Dennis RozanskiHere's a teaching DVD for those just wanting to get started on bottleneck style guitar. Feldmann starts out by talking about his equipment, including an acoustic and a resonator guitar, different types of slides, fingerpicks, and then he introduces the open D tuning he uses for the first few lessons. He talks quite slowly, and teaches very simple pieces first playing the piece, then breaking down each part of the song, and at the end playing it through slowly in split screen, with a different camera on each hand on the guitar. In open D you'll learn Bukka White's Jitterbug Swing,, Robert Wilkins' I Wished I Was In Heaven Sitting Down, and Sylvester Weaver's Guitar Rag (same song known as Steel Guitar Rag in Western Swing). Charley Patton's I'm Going Home and Bobby Grant's Nappy Headed Blues are taught in open G, which is of course explained first. The latter is a little more advanced. The DVD also has a PDF file with the tablature for what is taught, and the original recordings of the songs are featured as well. The video portion of the program ends with a clip of Son House playing Levee Camp Blues from what looks like one of the American Folk Blues tours to England and Europe. Marc Bristol/Blue Suede News --Marc Bristol/Blue Suede News\"]\nAverage Rating: 4.5\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Tom Feldmann', 'Language': 'English', 'Number Of Discs': '1', 'Runtime': '1 hour and 55 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.48 x 5.31 x 0.59 inches; 2.96 Ounces', 'Item model number': 'SGGW1004', 'Director': 'Tom Feldmann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 19, 2012', 'Actors': 'Tom Feldmann', 'Studio': \"Grossman's Guitar Workshop\", 'Number of discs': '1'}\nReview Text: Great introductory book<br />This guy is a teacher as well as a performer<br />No show off none sense<br />In PDF file of tab, all that he shows is tabbed out\nReview Title: Great introductory book\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/04\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Troy Miller'], 'Starring': ['Brian Regan'], 'Studio': ['COMEDY CENTRAL']}\nReview Text: Funny, clean humor<br />I get the idea that the guy is a Christian, because of the complete lack of filthy words in his routines<br />Bravo for him, and God bless him<br />I'm sick of nasty comedians\nReview Title: Funny, clean humor I get the idea that the ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Search For The Gods (1975)\nReview Date: 2019/01/16\nStore: Stephen McHattie  (Actor),     Ralph Bellamy  (Actor),     Jud Taylor  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"From an era when publications and talk shows speculated that space aliens had long ago come to Earth and left evidence of their visit comes Search for the Gods, a tale about three adventurers who come into possession of a mysterious medallion-like relic believed to be some of that evidence. Metallurgical tests show that the artifact is made of an unknown alloy. When a museum curator opines it is an interlocking piece to a larger item, the trio sets out in hopes of finding another relic. Meanwhile, others seek to buy the medallion - or kill for it. Stephen McHattie (Watchmen's Hollis Mason, aka Nite Owl) plays a drifter who receives the artifact from a Native American holy man. Top-billed Kurt Russell (six years before his iconic role as Snake Plissken in Escape from New York) plays the Taos, New Mexico townie who teams up with the drifter. And Victoria Racimo (Falcon Crest) rounds out the film's key trio.\"]\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Science Fiction & Fantasy', 'Format': 'NTSC', 'Contributor': 'Raymond St. Jacques, Victoria Racimo, John War Eagle, Ralph Bellamy, Albert Paulsen, Joe David Marcus, Larry Blake, Jud Taylor, Kurt Russell, Carmen Argenziano, Jackson D Kane, Stephen McHattie, Joe Marcus Jr., Wilfred Lloyd BaumesRaymond St. Jacques, Victoria Racimo, John War Eagle, Ralph Bellamy, Albert Paulsen, Joe David Marcus, Larry Blake, Jud Taylor, Kurt Russell, Carmen Argenziano, Jackson D Kane, Stephen McHattie, Joe Marcus Jr., Wilfred Lloyd Baumes  See more', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Jud Taylor', 'Media Format': 'NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'March 25, 2014', 'Actors': 'Stephen McHattie, Ralph Bellamy, Victoria Racimo, Albert Paulsen, Carmen Argenziano', 'Producers': 'Wilfred Lloyd Baumes', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I saw this in the early/mid seventies<br />Awesome ancient astronauts show<br />Very early<br />Good copy<br />Not blurry at all\nReview Title: Rare! Been looking for 30 years\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/11/25\nAverage Rating: 4.5\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['한국어'], 'Subtitles': ['None available'], 'Directors': ['Joon Ho Bong'], 'Producers': ['Joon Ho Bong', 'Sin Ae Kwak', 'Yang Kwon Moon', 'Young Hwan Jang'], 'Starring': ['Kang Ho Song', 'Sun Kyun Lee', 'Yeo Jeong Cho'], 'Studio': ['NEON']}\nReview Text: I’ve seen this movie a few times<br />It is one of the funniest films ever made\nReview Title: Amazing\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n1. **Music and Documentary Enthusiast**: Strong preference for documentaries, particularly focused on music and influential artists, showcasing a deep appreciation for rock, guitar techniques, and historical context.\n\n2. **Horror and Comedy Viewer**: Enjoyment of unconventional horror films that blend comedy and suspense, indicating an interest in genre-bending narratives.\n\n3. **Discerning Taste in Media**: Generally high ratings (~4.5 average) suggest a selective and critical viewing approach towards films and documentaries.\n\n4. **Interest in Character Actors**: Favorable mentions of specific actors attribute value to character-driven narratives and performances, often influenced by the actors' past works.\n\n5. **Educational Content Preference**: Engagement with instructional content, particularly related to music and guitar playing, indicating a desire to learn and improve musicianship.\n\n6. **Cultural Commentary**: Reviews reflect a keen awareness of cultural issues, often considering themes of authenticity and social commentary within the media consumed.\n\n7. **Search for Genuine Experience**: Reviews often highlight a quest for both emotional and personal connection with the content, favoring authenticity over mainstream appeal. \n\nIn essence, this individual exhibits a diverse yet focused taste, spanning music documentaries, innovative horror-comedies, character-driven narratives, educational resources, and culturally nuanced commentary.",
  "target_interaction": {
    "rating": 1.0,
    "title": "Do not buy—not letterbox",
    "text": "Won’t play in letterbox<br />On any tv or computer<br />And don’t tell me that this pic I’ve provided **IS** letterbox as I can see the bands on all sides!!!<br />Samsung TV<br />Samsung BR player<br /><br />Garbage Disc",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71hc3dzU+kL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71hc3dzU+kL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71hc3dzU+kL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "6305037280",
    "parent_asin": "6305037280",
    "user_id": "AG3JDMAFA6HDGDKX4HQJDMKUNEEA",
    "timestamp": "2022-04-05 18:35:10.230000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Movies & TV",
    "title_meta": "Stalingrad [DVD]",
    "average_rating": 4.1,
    "rating_number": 3996,
    "features": [],
    "description": [
      "Product Description",
      "There are no heroes or villains in this stark German-made film about a WWII battle that claimed nearly one and half million lives. Instead, it reveals the humanity and vulnerability of both Russian defenders and German invaders caught in an epic winter siege. Without preaching, it unflinchingly conveys the insanity of war. 1992; 2-1/2 hours.",
      "Amazon.com",
      "It's tempting to call this harrowing picture a World War II version of",
      "All Quiet on the Western Front",
      ": both films take the perspective of ordinary German soldiers at ground level.",
      "Stalingrad",
      "surveys the misery of the battle of Stalingrad, the winter siege that cost the lives of almost one and a half million people, Russian defenders and German invaders alike. Not unlike Spielberg's approach to",
      "Saving Private Ryan,",
      "German director Joseph Vilsmaier rarely steps outside the action to comment on the higher purpose of the war, assuming the audience is aware of the evil of the Nazi regime. Instead, we simply follow a group of soldiers as they endure a series of gut-wrenching episodes, events which have the tang of authenticity and horror. Vilsmaier has a taste for symbolism and surreal touches, which only add to the unsettling sense of insanity this movie conjures up so well.",
      "--Robert Horton"
    ],
    "price": 32.89,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51JJ0GWJD9L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51JJ0GWJD9L.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Dominique Horwitz  (Actor),     Thomas Kretschmann  (Actor),     Joseph Vilsmaier  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Foreign Films"
    ],
    "details": {
      "Genre": "Westerns",
      "Format": "Color, Dolby, DVD, Subtitled, Widescreen, NTSC, Letterboxed",
      "Contributor": "Heinz Emigholz, Johannes Heide, Karel Hermnek, Joseph Vilsmaier, Sylvester Groth, Christoph Fromm, Thomas Kretschmann, Jochen Nickel, Jrgen Bscher, Dana Vvrov, Martin Benrath, Dieter Okras, Sebastian Rudolph, Oliver Broumis, Ferdinand Schuster, Dominique HorwitzHeinz Emigholz, Johannes Heide, Karel Hermnek, Joseph Vilsmaier, Sylvester Groth, Christoph Fromm, Thomas Kretschmann, Jochen Nickel, Jrgen Bscher, Dana Vvrov, Martin Benrath, Dieter Okras, Sebastian Rudolph, Oliver Broumis, Ferdinand Schuster, Dominique…  See more",
      "Language": "German (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround)",
      "Runtime": "2 hours and 14 minutes",
      "Aspect Ratio": "1.66:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "Unrated (Not Rated)",
      "Product Dimensions": "7.5 x 5.38 x 0.6 inches; 3 Ounces",
      "Director": "Joseph Vilsmaier",
      "Media Format": "Color, Dolby, DVD, Subtitled, Widescreen, NTSC, Letterboxed",
      "Run time": "2 hours and 14 minutes",
      "Release date": "November 3, 1998",
      "Actors": "Dominique Horwitz, Thomas Kretschmann, Sebastian Rudolph, Dana Vvrov, Jochen Nickel",
      "Dubbed": "German",
      "Subtitles": "English",
      "Studio": "Fox Lorber",
      "Writers": "Christoph Fromm, Johannes Heide, Joseph Vilsmaier, Jrgen Bscher",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}