{
  "user_id": "AEEA7GWY5ELEMEGUXULT5OBCACTQ",
  "summary": "=== Purchase Information ===\nProduct Title: Remington Steele: Season 1\nReview Date: 2005/05/02\nStore: Stephanie Zimbalist  (Actor),     Pierce Brosnan  (Actor),     Burt Brinckerhoff  (Director),     Don Weis  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'Before he was Bond... he was Remington Steele...Private eye Laura Holt (Stephanie Zimbalist) grudgingly accepts a new partner when a mystery man (Pierce Brosnan) assumes the identity of her fictitious boss, Remington Steele. Together, the two battle crime as as their feelings for each other.', 'Amazon.com', 'Remington Steele', \"'s fusion of whodunit mystery and screwball comedy burst onto television in 1982. After struggling to get clients to hire a female detective, Laura Holt (sultry Stephanie Zimbalist) invents a fictional boss named Remington Steele, whose dashing manly name draws in work. But while protecting some South African jewels, Holt runs across a mysterious thief and con-man (an elfin, baby-faced Pierce Brosnan) whom her client assumes is the nonexistent Steele--and when the case is resolved, the accidental detective decides he likes the work and sticks around, infuriating Holt with his arrogant ways and tantalizing her with his dashing good looks. Murders may occur at a winery, an island sex club, or a college reunion, but just about every episode plunders plot elements from classic movies like\", 'Bringing Up Baby', ',', 'The Third Man', ', and', 'The Trouble with Harry', \"(even the theme song was written by film composer Henry Mancini). The writers openly acknowledge this influence by having Steele use ideas he's lifted from movies to solve crimes. The constant allusions to old films should be annoying, but the show demonstrates such a rich affection for the classics that these tips of the hat actually mesh with\", 'Remington Steele', \"'s world.\", 'Remington Steele', \"has become best known as Brosnan's launching pad (he later become James Bond in\", 'GoldenEye', \"and its sequels), but Zimbalist was every bit as crucial to the show's success; her mixture of glamor and toughness gives the show a distinctly adult sexiness and grounds Brosnan's boyish charm. The dialogue sometimes slipped from arch camp to sheer cheese, but even at its most ridiculous (say, a scene where Holt and Steele question homeless bums while dressed in formal evening wear)\", 'Remington Steele', \"remains an eminently watchable show, thanks to zippy plotting and the chemistry between Zimbalist and Brosnan. Some episodes clearly implied that the pair had become intimate, yet that didn't defuse their attraction. Even when the stories became a bit silly, the mutual respect and desire between Holt and Steele never lost its sophistication.\", '--Bret Fetzer']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 6.4 Ounces', 'Director': 'Burt Brinckerhoff, Don Weis, Jeff Bleckner, Larry Elikann, Leo Penn', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '17 hours and 58 minutes', 'Release date': 'July 26, 2005', 'Actors': 'Stephanie Zimbalist, Pierce Brosnan, James Read, Janet DeMay, Carlene Watkins', 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nReview Text: WHAT IS WITH THE COVER??  Shouldn't this be a black background with lip print, gun and such. (As in the beginning of later episodes)  Stephanie Zimbalist was excellent in this series.  Why is she ignored?  Worse yet, what is with the \"Bond\" reference. If \"she\" didn't have a deep dark secret would Brosnan be necessary?????<br /><br />Hey, don't get me wrong. I watched it for ...his blue eyes and mysterious past....\nReview Title: Another deep dark secret.........\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Working Girl\nReview Date: 2006/06/06\nStore: Melanie Griffith  (Actor),     Harrison Ford  (Actor),     Mike Nichols  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: [\"Nominated for 6 Academy Awards; director Mike Nichols' witty, romantic look at life in the corporate jungle stars Melanie Griffith as Tess McGill, an ambitious secretary with a unique approach for climbing the ladder to success. When her classy, but villainous boss (Sigourneey Weaver) Breaks a leg skiing, Tess simply takes over her office, her apartment, even her wardrobe. She then creates a deal with a handsome investment banker (Harrison Ford) that will either take her straight to the top - or finish her off for good.\"]\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.08 Ounces', 'Director': 'Mike Nichols', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 17, 2001', 'Actors': 'Melanie Griffith, Harrison Ford, Sigourney Weaver, Alec Baldwin, Joan Cusack', 'Subtitles': 'English, Spanish', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), English (Dolby Digital 3.0)', 'Studio': '20th Century Fox', 'Writers': 'Kevin Wade', 'Number of discs': '1'}\nReview Text: For a general review of this fun movie please read other excellent reviews.  I would love to own the DVD.  But where can I purchase a cut version?  I prefer NOT to watch Alec Baldwin \"bopping\" Doreen. Or Kevin Spacey attempting \"seduction??\" by showing a porn film to Griffith.  Nor listen to Griffith remind herself not to F--- Up repeatedly.  Classy lady with foul mouth moves up the corporate ladder.  Nichols attempt to seek a R rating is just plain stupid.  This otherwise wonderful film is ruined by this mess.  To enjoy Working Girl at its best I will watch the TV version.\nReview Title: Gratuitous nudity, foul language & vulgarities\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bee Gees: In Our Own Time [Blu-ray]\nReview Date: 2011/03/14\nStore: Bee Gees  (Actor),     n/a  (Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: [\"Blu-ray pressing. In Our Own Time is the compelling story of the Bee Gees career. From their roots in the North West of England, through their early career in Australia, their return to England and international breakthrough in the late '60s and then on to global superstardom with Saturday Night Fever and beyond. Alongside the success there is the heartache of the tragically early deaths of first their younger brother Andy and then later Maurice. The story is told in their own words through in depth new interviews with Barry and Robin Gibb and through extensive interviews with Maurice filmed shortly before his death in January 2003. These are lavishly illustrated by live performances, TV and film clips and home movies of their early days.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Pop, Music Video & Concerts', 'Format': 'Dolby', 'Contributor': 'n/a, Bee Gees', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '1333729', 'Media Format': 'Dolby', 'Run time': '1 hour and 56 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have always enjoyed the Bee Gees songs, but had not followed their career very closely.  I caught the end of this program on A&E's Biography.  I set the DVR for a repeat of this two hour show.  Watched it and immediately purchased the DVD.  I knew these guys were talented, but the detailed account of their rise to stardom, the damage done by disco, which they DID NOT invent.  And where they have gone from there is just amazing.<br /><br />The bit where they demonstrate their three part harmony, singing Lollipop acapella, caused my 22 year old daughter to exclaim, \"That it crazy good!\"  She is so right.<br /><br />I would recommend this to anyone who has enjoyed the Bee Gees.  I am sure the diehard fans already have their copies.[[ASIN:B0043E8YAM Bee Gees: In Our Own Time [Blu-ray]]]\nReview Title: Excellent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Above Suspicion\nReview Date: 2011/08/05\nStore: Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Above Suspicion is a British TV series based on Lynda La Plante's novels Above Suspicion, The Red Dahlia, Deadly Intent and Silent Scream. It stars Kelly Reilly and Ciarán Hinds, and features the career of La Plante's latest heroine DC Anna Travis.\"]\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '9 x 5.5 x 0.53 inches; 4 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'August 28, 2001', 'Actors': 'Bakula, Sciorra, Gentile, Asner, B', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Polygram USA Video', 'Number of discs': '1'}\nReview Text: Interesting storyline.  Writing is not the best.  Scott Bakula's acting can make much more out of mediocre material. I did enjoy the movie.\nReview Title: Scott Bakula\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Now Voyager\nReview Date: 2011/08/05\nStore: Barry Gibb  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Music Videos & Concerts\nProduct Description: ['Barry Gibb ,Now Voyager, DVD 2005, Collectors item,Deleted edition ,Hard to find.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Music Videos & Concerts', 'Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Contributor': 'Barry Gibb', 'Language': 'English (PCM Stereo), English (DTS 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.51 x 0.39 x 7.87 inches; 3.88 Ounces', 'Media Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Run time': '1 hour and 45 minutes', 'Actors': 'Barry Gibb', 'Subtitles': 'English', 'Studio': 'universal', 'Number of discs': '1'}\nReview Text: Barry Gibb, can that be bad?  Several well written and well performed songs.  Barry without a beard (which he hates).\nReview Title: Music Video\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Men of a Certain Age: Season 2\nReview Date: 2011/11/08\nStore: Ray Romano  (Actor),     Scott Bakula  (Actor),     David Boyd  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Product Description', 'Men of a Certain Age: The Complete Second Season', 'MEN OF A CERTAIN AGE returns for a second season, with all three men facing a number of roadblocks on their continuing journeys through midlife. They know they can always rely on their friends to see them through. Joe (Romano) is a divorced, slightly neurotic father of two who runs a party store and recently overcame a gambling problem. He’s now decided to rekindle his dream of becoming a professional golfer, training for a spot on the senior tour. Owen (Braugher) the married one of the group, is finally asserting himself at his family’s car dealership, but is struggling with being the boss. Terry (Bakula) the relaxed, handsome actor continues to search for stability after disastrous attempts at managing an apartment complex and reviving his acting career.', ']]>', 'Amazon.com', \"It's an overused term, but few words seem more apt than\", 'bittersweet', 'to describe the second and final season of the critically acclaimed comedy/drama', 'Men of a Certain Age', ': bitter in that the show was brought to a close far too soon for fans and many critics, but also sweet in that the series, created by Ray Romano and Mike Royce, ended on the same notes of honesty, poignancy, and sheer creative quality that marked its beginning. The sophomore season of', 'Certain Age', 'also found the show escaping from the short-sightedness that painted it as a series about \"guys in midlife crisis\" to become a program about the second chances and minor miracles that were also part of the lives of its trio of protagonists: party-store owner Joe (Romano) shakes off the torpor of his divorce to finally pursue his dream of professional golf, while married man Owen (Andre Braugher) takes hold of his long-delayed destiny as owner of his father\\'s car dealership. And while the transition of Terry (Scott Bakula) from lothario and would-be actor to a man committed to romance and a realistic future takes the occasional back seat to his friends\\' storylines, his struggles never lack for intimacy while also showcasing some of the show\\'s most cringe-worthy moments as he attempts to shake off a lifetime of half-steps and fruitless relationships. In each of their stories, as well as in those of the people who orbit their lives, from Joe\\'s children (Braeden Lemasters and Brittany Curran) to Owen\\'s wife (Lisa Gay Hamilton) and coworkers and Terry\\'s supremely patient girlfriend (Melinda McGraw), there is not a false note in regard to the operation of the human heart as how it truly works and not as depicted in network notes or audience demographic research. The writing in the second season (by several veterans of', 'Everybody Loves Raymond', \", among others) achieves a sort of literary level in its best moments, a gorgeous opaqueness that reveals such depths of richness and truth behind the veil of ordinary life. That high-water mark is met by the direction as well as the exceptional cast, from Romano, who continues to prove himself a remarkably subtle dramatic actor, and Braugher and Bakula, down to supporting players like Hamilton, McGraw, Richard Gant (as Braugher's prideful father), Alanna Ubach, Sarah Clarke (the\", 'Twilight', 'series), Matt Price, and Brian White. However, the season is again stolen by Jon Manfrellotti (', 'Mad Men', \") as Joe's bookie, Manfro, whose cancer diagnosis peels away his Runyonesque exterior to reveal a vinegary sagacity in his uncomfortable dealings with Joe.\", 'The three-disc presentation of', 'Men of a Certain Age', \"'s second season is anchored by commentaries by the show's key players on all 12 episodes. Romano and Royce are the dominant voices, and the humor that they and fellow writers Bridget Bedard, Lew Schneider, and Tucker Cawley provide also allows for glimpses into the show's production as well as what might have happened in its third season. Romano, Royce, Bedard, and Schneider additionally appear on a solid featurette that discusses the tone and direction of the series in fine detail. There is also a brace of deleted scenes from both seasons, as well as a frequently funny gag reel, all of which should appeal to the show's small but dedicated cadre of fans. But more significantly, what those viewers can take away from this final season is not just the excellence of the episodes, but also the fact that\", 'Men of a Certain Age', 'belongs in the ranks of such extraordinary works as', 'Freaks and Geeks', ',', 'Deadwood', ',', 'Sports Night', ',', 'Arrested Development', ',', 'Veronica Mars', ', and other series that slipped the surly bonds of the medium and truly defined the phrase', 'too good for television', '.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '883929174317', 'Director': 'David Boyd', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 48 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Ray Romano, Scott Bakula, Andre Braugher, Lisa Gay Hamilton, Matt Price', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'TNT', 'Number of discs': '3'}\nReview Text: What else can be said?  We don't need or want another CSI. Do we have to know how people in Jersey or the Kardasian's behave.  I do enjoy the occasional reality show but Bachelor Pad, really?  A Dallas remake? It seemed that there were no more ideas for good shows. Then Mike Royce and Ray Romano write this incredible show. A fresh idea, excellent writing, wonderful acting, Peabody award winner. What were we thinking to enjoy such a show.  Thank you Mike Royce, Ray Romano, Scott Bakula and Andre Braugher for offering a glimpse into the lives of these guys. It is so sad that we will only have two seasons of this fabulous show.\nReview Title: Excellent writing, excellent acting. Critically acclaimed\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scarecrow & Mrs. King: Season 4\nReview Date: 2013/10/26\nStore: Kate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nReview Text: This video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas.\nReview Title: Fun show\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scarecrow and Mrs. King: Season 3\nReview Date: 2013/10/26\nStore: Kate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Color, Multiple Formats, NTSC, Box set', 'Contributor': 'Kate Jackson, Bruce Boxleitner', 'Language': 'English', 'Number Of Discs': '5'}\nReview Text: This video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas. My review is the same for all seasons.\nReview Title: Pleasant show, nice to revisit.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: QUANTUM LEAP THE CS DVD FF\nReview Date: 2014/08/13\nStore: Scott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Get ready for an adventure of many lifetimes with the ground-breaking sci-fi classic, Quantum Leap. With the complete series box set, you can now leap through all 95 thrilling episodes over 5 seasons of this Primetime Emmy Award-winning series back-to-back and uninterrupted! Join Dr. Sam Beckett (Scott Bakula), a time traveler lost in time, who temporarily leaps into the bodies and lives of other people to \"put right what once went wrong.\" Accompanied by Al (Dean Stockwell), a wise-cracking holograph that only Sam can see and hear, Sam twists the hands of fate with each heart-pounding, action-packed adventure in the hopes that he can someday complete the mission that will take him home.Bonus Content:', 'Quantum Leap: Season One:', 'A Kiss with History', 'A Kiss with History', 'Quantum Knowledge', 'Quantum Knowledge', 'Quantum Leap: Season Four:', 'Season 5 Episode: Liberation', 'Season 5 Episode: Liberation', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Quantum Leap: Season Five:', 'Blueprints', 'Blueprints']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Runtime': '76 hours and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.95 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '76 hours and 38 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '27'}\nReview Text: All Universal Studios Home Entertainment is doing is re-packaging the original disks with grainy footage, techno-music, and probably the same double sided disks that separate and are ruined. These are a complete waste of time and money except for those who are replacing their already defective discs.<br />Quantum Leap Fans: Protest!!! Let Universal know that we want the original music, cleaned up footage and blu ray. Obviously their goal based on response below is NOT to provide the highest standard in product quality or customer care.<br /><br />Give us what we have asked for Universal.  We are willing to pay more for the corrected series.<br /><br />I contacted Universal Studios Home Entertainment. Their response:<br /><br />Thank you for contacting us. Please note that the release you are referring to has the same content as the previous release in a downsized package.<br />Our goal is to provide the highest standard in product quality and customer care, and we value input from our customers.<br />Your comments regarding Quantum Leap music will be forwarded to the appropriate department.<br />We hope you will enjoy future Universal releases.<br /><br />Sincerely,<br /><br />Consumer Relations<br />UNIVERSAL STUDIOS HOME ENTERTAINMENT\nReview Title: An amazing, excellent and still relevant show destroyed by Universal\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Here Come The Brides: Season 2\nReview Date: 2014/09/15\nStore: Robert Brown  (Actor),     Mark Lenard  (Actor),     Paul Junger Witt  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: [\"Set in the mid-nineteenth century, this classic TV series revolves around The Bolt brothers (Brown, Sherman and Soul) who own a mountain and logging camp in the rugged landscape of Seattle. As the area's only employer, the brothers borrow money and head east to bring back a shipload of lovely ladies to boost morale. But if any of the women leave Seattle within a year, the Bolts lose their mountain to the man that lent them the money.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Robert Brown, Paul Junger Witt, David Soul, Bobby Sherman, Mark Lenard', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'unknown', 'Director': 'Paul Junger Witt', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '22 hours and 20 minutes', 'Release date': 'February 28, 2012', 'Actors': 'Robert Brown, Mark Lenard, Bobby Sherman, David Soul', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: Pleasant show with good values.\nReview Title: Great memories\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mysterious Cities of Gold [DVD]\nReview Date: 2014/09/15\nStore: Jean Chalopin  (Actor),     Bernard Deyries  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Anime\nProduct Description: [\"It is 1532 and Esteban, a Spanish orphan, is on a quest to find his father. He joins a party of Spaniards as they search for one of The Seven Cities of Gold in The New World. Zia, An Incan girl named Zia, and Tao, the last descendant of the sunken empire of Hiva, help Estaban on his search. On their journey, the three of them discover many lost technological wonders of the Mayans, Inca, and Olmecs including The Golden Condor, a huge solar-powered airship, capable of traveling considerable distances under the sun's power alone. They are constantly pursued by antagonists Gomez and Gaspard, who are also in search of the Cities of Gold.\"]\nAverage Rating: 4.6\nProduct Details: {'Format': 'Color, NTSC, Animated, Box set, DVD', 'Contributor': 'Jean Chalopin, Bernard Deyries', 'Language': 'English', 'Number Of Discs': '6', 'Runtime': '19 hours and 20 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1 inches; 10.4 Ounces', 'Director': 'Bernard Deyries', 'Media Format': 'Color, NTSC, Animated, Box set, DVD', 'Run time': '19 hours and 20 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Jean Chalopin', 'Studio': 'Virgil Films', 'Number of discs': '6'}\nReview Text: Excellent cartoon series. Well written. We enjoyed it with our young children when it aired on Nickelodeon.  We have enjoyed watching the series again with our now grown children.\nReview Title: Excellent series - So happy it was made available on DVD.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mercy Mission/Nowhere to Land [DVD]\nReview Date: 2014/09/15\nStore: Scott Bakula  (Actor),     Robert Loggia  (Actor),     Roger Young  (Director),     Armand Mastroianni  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Nowhere to Land, A pilot must safely land a 747 on which deadly nerve gas has been planted. Mercy Mission: The Rescue of Flight 771, This is the story of a brave single-engine aircraft pilot lost over stormy seas and the veteran commercial airline captain who, along with a plane full of passengers, guides him to safety.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Color, DVD, Widescreen, NTSC', 'Contributor': 'Scott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand MastroianniScott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand Mastroianni  See more', 'Language': 'English', 'Runtime': '3 hours and 3 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 1 Pounds', 'Director': 'Roger Young, Armand Mastroianni', 'Media Format': 'Color, DVD, Widescreen, NTSC', 'Run time': '3 hours and 3 minutes', 'Release date': 'August 28, 2007', 'Actors': 'Scott Bakula, Robert Loggia, Rebecca Rigg, Jack Wagner, Christine Elise', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nReview Text: Mercy Mission - very good, based on a true story about a pilot flying a crop duster from the U.S. to Australia with several strategic stops for fuel. The plane is blown off course during a storm and instrumentation is defective. A passenger jet pilot is determined to help find the crop duster and guide him to a safe landing with even as the small plane is out of fuel. Well acted by Scott Bakula and Robert Loggia.\nReview Title: Mercy Mission - Very good, based on true story.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Quantum Leap: Season 4\nReview Date: 2014/09/15\nStore: Scott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Take a trip through time with the daring Dr. Sam Beckett (Scott Bakula) and his hilarious hologram guide, Al (Dean Stockwell), in all 22 extraordinary, groundbreaking episodes of Quantum Leap: The Complete Fourth Season. It\\'s adventure like you\\'ve never seen, with each amazing episode from this eight-time Emmy-nominated season now digitally remastered for incredible picture quality. Journey back as Sam and Al survive a hurricane, trail a murderer, make a monkey out of themselves and even switch roles! With each \"leap\" into another identity, Sam hopes to find some insight into the jump that will finally take him home. And now, fans can spend more time with Sam and Al with an exclusive bonus episode from the Fifth Season. You won\\'t want to miss a minute of the adventure!Bonus Content:', 'Disc 3:', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Bonus Episode: Quantum Leap \"Liberation\"', 'Bonus Episode: Quantum Leap \"Liberation\"']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, Dolby, NTSC, Subtitled', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1 inches; 8.8 Ounces', 'Item model number': '29229', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, Dolby, NTSC, Subtitled', 'Run time': '17 hours and 10 minutes', 'Release date': 'March 28, 2006', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'English, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: So sad that Universal was too cheap to purchase original music rights to these episodes. Sam Beckett is leaping around to different points in time. Each leap has coordinating music which is integral to the plot. Quantum Leap fans would have paid more for their DVD sets if Universal had cleaned up the video and kept the original musical score.\nReview Title: Original music score replaced with Techno music.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Richest Cat in the World\nReview Date: 2014/09/30\nStore: Format: DVD\nCategories: Movies & TV, Disc on Demand\nAverage Rating: 4.7\nProduct Details: {'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Item model number': '43258-41624', 'Media Format': 'NTSC', 'Number of discs': '1'}\nReview Text: A fun & entertaining family movie!  This adorable show was a favorite of our family. We had &#34;taped&#34; it and literally wore out the VHS tape. I have been waiting twenty some years for this to be available in some form.  Disney please release more of these shows.\nReview Title: Even better than I remember.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Conviction: The Complete Series\nReview Date: 2015/11/03\nStore: Reiko Aylesworth  (Actor),     Eric Balfour  (Actor),     Norberto Barba  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Reiko Aylesworth, Eric Balfour, J. August Richards, Anson Mount, Jordan Bridges, Catrina Ganey, Julianne Nicholson, Norberto Barba, Milena Govich, Stephanie MarchReiko Aylesworth, Eric Balfour, J. August Richards, Anson Mount, Jordan Bridges, Catrina Ganey, Julianne Nicholson, Norberto Barba, Milena Govich, Stephanie March  See more', 'Language': 'English', 'Number Of Discs': '3'}\nReview Text: Well written, excellent acting. A must for Anson Mount fans. I also thought Jordan Bridges acted his part very well. Wish it had been given a chance to develop further.  But such is the way with many good shows.\nReview Title: excellent acting. A must for Anson Mount fans\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tully\nReview Date: 2015/11/19\nStore: Glenn Fitzgerald  (Actor),     Anson Mount  (Actor),     Hilary Birmingham  (Director),     Amy K. Barrett  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: ['Tully']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Bob Burrus, Aaron Zavitz, Glenn Fitzgerald, Catherine Kellner, John Durbin, David Wain, Hilary Birmingham, Amy K. Barrett, Andi Prastowo, Richard Hansen (II), Julianne Nicholson, Laura Walker (III), Sarah Clarke, Neil Jain, John Diehl, Sandra Bernhard, Delaney Driscoll, Justin Hyde, Harry Gibbs, Christina Kirk, Michael McCormack, Mellisa Bryson, Anson Mount, Zoe Edmonds, Xander Berkeley, Kathryn Gayner, Vivek Kumar (II), David Soderlund Jr., Natalie Canerday, Joe Smalley, Kristopher Kling, Mary Louise Wilson, Federico del Moral, Andy Signore, Tim Driscoll, V. Craig HeidenreichBob Burrus, Aaron Zavitz, Glenn Fitzgerald, Catherine Kellner, John Durbin, David Wain, Hilary Birmingham, Amy K. Barrett, Andi Prastowo, Richard Hansen (II), Julianne Nicholson, Laura Walker (III), Sarah Clarke, Neil Jain, John Diehl, Sandra Bernhard, Delaney Driscoll, Justin Hy…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': 'Relay Time: 102 min', 'Director': 'Hilary Birmingham, Amy K. Barrett', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'June 17, 2003', 'Actors': 'Glenn Fitzgerald, Anson Mount, Bob Burrus, Julianne Nicholson, Laura Walker (III)', 'Studio': 'Virgil Films', 'Number of discs': '1'}\nReview Text: Read the five star reviews. The majority are far more eloquent than I. Granted, I came looking for Anson Mount after seeing him in Hell on Wheels. While his performance is amazing, this movie is way more than Mr. Mount. All the actors portray their characters brilliantly.  The story is about family and all that can mean. Excellent!!\nReview Title: Read the five star reviews...........\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/08/28\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gordon Wiles'], 'Producers': ['Ernest Chambers', 'Saul Ilson', 'Frank Gertz'], 'Starring': ['Bobby Darin'], 'Studio': ['MPI Media Group']}\nReview Text: I watched this show when it originally aired and was delighted to find it for purchase.  Amazon now claims I didn't purchase despite the invoice on my account page.  Not the usual customer service I expect of Amazon. Oh well, cancelling Prime.\nReview Title: Bobby Darin a consummate entertainer\nRating: 5.0\n--------------------------------------------------",
  "reference": "Remington Steele: Season 1\nStephanie Zimbalist  (Actor),     Pierce Brosnan  (Actor),     Burt Brinckerhoff  (Director),     Don Weis  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'Before he was Bond... he was Remington Steele...Private eye Laura Holt (Stephanie Zimbalist) grudgingly accepts a new partner when a mystery man (Pierce Brosnan) assumes the identity of her fictitious boss, Remington Steele. Together, the two battle crime as as their feelings for each other.', 'Amazon.com', 'Remington Steele', \"'s fusion of whodunit mystery and screwball comedy burst onto television in 1982. After struggling to get clients to hire a female detective, Laura Holt (sultry Stephanie Zimbalist) invents a fictional boss named Remington Steele, whose dashing manly name draws in work. But while protecting some South African jewels, Holt runs across a mysterious thief and con-man (an elfin, baby-faced Pierce Brosnan) whom her client assumes is the nonexistent Steele--and when the case is resolved, the accidental detective decides he likes the work and sticks around, infuriating Holt with his arrogant ways and tantalizing her with his dashing good looks. Murders may occur at a winery, an island sex club, or a college reunion, but just about every episode plunders plot elements from classic movies like\", 'Bringing Up Baby', ',', 'The Third Man', ', and', 'The Trouble with Harry', \"(even the theme song was written by film composer Henry Mancini). The writers openly acknowledge this influence by having Steele use ideas he's lifted from movies to solve crimes. The constant allusions to old films should be annoying, but the show demonstrates such a rich affection for the classics that these tips of the hat actually mesh with\", 'Remington Steele', \"'s world.\", 'Remington Steele', \"has become best known as Brosnan's launching pad (he later become James Bond in\", 'GoldenEye', \"and its sequels), but Zimbalist was every bit as crucial to the show's success; her mixture of glamor and toughness gives the show a distinctly adult sexiness and grounds Brosnan's boyish charm. The dialogue sometimes slipped from arch camp to sheer cheese, but even at its most ridiculous (say, a scene where Holt and Steele question homeless bums while dressed in formal evening wear)\", 'Remington Steele', \"remains an eminently watchable show, thanks to zippy plotting and the chemistry between Zimbalist and Brosnan. Some episodes clearly implied that the pair had become intimate, yet that didn't defuse their attraction. Even when the stories became a bit silly, the mutual respect and desire between Holt and Steele never lost its sophistication.\", '--Bret Fetzer']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 6.4 Ounces', 'Director': 'Burt Brinckerhoff, Don Weis, Jeff Bleckner, Larry Elikann, Leo Penn', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '17 hours and 58 minutes', 'Release date': 'July 26, 2005', 'Actors': 'Stephanie Zimbalist, Pierce Brosnan, James Read, Janet DeMay, Carlene Watkins', 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nWHAT IS WITH THE COVER??  Shouldn't this be a black background with lip print, gun and such. (As in the beginning of later episodes)  Stephanie Zimbalist was excellent in this series.  Why is she ignored?  Worse yet, what is with the \"Bond\" reference. If \"she\" didn't have a deep dark secret would Brosnan be necessary?????<br /><br />Hey, don't get me wrong. I watched it for ...his blue eyes and mysterious past....\nAnother deep dark secret.........\nWorking Girl\nMelanie Griffith  (Actor),     Harrison Ford  (Actor),     Mike Nichols  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Nominated for 6 Academy Awards; director Mike Nichols' witty, romantic look at life in the corporate jungle stars Melanie Griffith as Tess McGill, an ambitious secretary with a unique approach for climbing the ladder to success. When her classy, but villainous boss (Sigourneey Weaver) Breaks a leg skiing, Tess simply takes over her office, her apartment, even her wardrobe. She then creates a deal with a handsome investment banker (Harrison Ford) that will either take her straight to the top - or finish her off for good.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.08 Ounces', 'Director': 'Mike Nichols', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 17, 2001', 'Actors': 'Melanie Griffith, Harrison Ford, Sigourney Weaver, Alec Baldwin, Joan Cusack', 'Subtitles': 'English, Spanish', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), English (Dolby Digital 3.0)', 'Studio': '20th Century Fox', 'Writers': 'Kevin Wade', 'Number of discs': '1'}\nFor a general review of this fun movie please read other excellent reviews.  I would love to own the DVD.  But where can I purchase a cut version?  I prefer NOT to watch Alec Baldwin \"bopping\" Doreen. Or Kevin Spacey attempting \"seduction??\" by showing a porn film to Griffith.  Nor listen to Griffith remind herself not to F--- Up repeatedly.  Classy lady with foul mouth moves up the corporate ladder.  Nichols attempt to seek a R rating is just plain stupid.  This otherwise wonderful film is ruined by this mess.  To enjoy Working Girl at its best I will watch the TV version.\nGratuitous nudity, foul language & vulgarities\nBee Gees: In Our Own Time [Blu-ray]\nBee Gees  (Actor),     n/a  (Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n[\"Blu-ray pressing. In Our Own Time is the compelling story of the Bee Gees career. From their roots in the North West of England, through their early career in Australia, their return to England and international breakthrough in the late '60s and then on to global superstardom with Saturday Night Fever and beyond. Alongside the success there is the heartache of the tragically early deaths of first their younger brother Andy and then later Maurice. The story is told in their own words through in depth new interviews with Barry and Robin Gibb and through extensive interviews with Maurice filmed shortly before his death in January 2003. These are lavishly illustrated by live performances, TV and film clips and home movies of their early days.\"]\n{'Genre': 'Pop, Music Video & Concerts', 'Format': 'Dolby', 'Contributor': 'n/a, Bee Gees', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '1333729', 'Media Format': 'Dolby', 'Run time': '1 hour and 56 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have always enjoyed the Bee Gees songs, but had not followed their career very closely.  I caught the end of this program on A&E's Biography.  I set the DVR for a repeat of this two hour show.  Watched it and immediately purchased the DVD.  I knew these guys were talented, but the detailed account of their rise to stardom, the damage done by disco, which they DID NOT invent.  And where they have gone from there is just amazing.<br /><br />The bit where they demonstrate their three part harmony, singing Lollipop acapella, caused my 22 year old daughter to exclaim, \"That it crazy good!\"  She is so right.<br /><br />I would recommend this to anyone who has enjoyed the Bee Gees.  I am sure the diehard fans already have their copies.[[ASIN:B0043E8YAM Bee Gees: In Our Own Time [Blu-ray]]]\nExcellent\nAbove Suspicion\nRated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Above Suspicion is a British TV series based on Lynda La Plante's novels Above Suspicion, The Red Dahlia, Deadly Intent and Silent Scream. It stars Kelly Reilly and Ciarán Hinds, and features the career of La Plante's latest heroine DC Anna Travis.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '9 x 5.5 x 0.53 inches; 4 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'August 28, 2001', 'Actors': 'Bakula, Sciorra, Gentile, Asner, B', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Polygram USA Video', 'Number of discs': '1'}\nInteresting storyline.  Writing is not the best.  Scott Bakula's acting can make much more out of mediocre material. I did enjoy the movie.\nScott Bakula\nNow Voyager\nBarry Gibb  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['Barry Gibb ,Now Voyager, DVD 2005, Collectors item,Deleted edition ,Hard to find.']\n{'Genre': 'Music Videos & Concerts', 'Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Contributor': 'Barry Gibb', 'Language': 'English (PCM Stereo), English (DTS 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.51 x 0.39 x 7.87 inches; 3.88 Ounces', 'Media Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Run time': '1 hour and 45 minutes', 'Actors': 'Barry Gibb', 'Subtitles': 'English', 'Studio': 'universal', 'Number of discs': '1'}\nBarry Gibb, can that be bad?  Several well written and well performed songs.  Barry without a beard (which he hates).\nMusic Video\nMen of a Certain Age: Season 2\nRay Romano  (Actor),     Scott Bakula  (Actor),     David Boyd  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Men of a Certain Age: The Complete Second Season', 'MEN OF A CERTAIN AGE returns for a second season, with all three men facing a number of roadblocks on their continuing journeys through midlife. They know they can always rely on their friends to see them through. Joe (Romano) is a divorced, slightly neurotic father of two who runs a party store and recently overcame a gambling problem. He’s now decided to rekindle his dream of becoming a professional golfer, training for a spot on the senior tour. Owen (Braugher) the married one of the group, is finally asserting himself at his family’s car dealership, but is struggling with being the boss. Terry (Bakula) the relaxed, handsome actor continues to search for stability after disastrous attempts at managing an apartment complex and reviving his acting career.', ']]>', 'Amazon.com', \"It's an overused term, but few words seem more apt than\", 'bittersweet', 'to describe the second and final season of the critically acclaimed comedy/drama', 'Men of a Certain Age', ': bitter in that the show was brought to a close far too soon for fans and many critics, but also sweet in that the series, created by Ray Romano and Mike Royce, ended on the same notes of honesty, poignancy, and sheer creative quality that marked its beginning. The sophomore season of', 'Certain Age', 'also found the show escaping from the short-sightedness that painted it as a series about \"guys in midlife crisis\" to become a program about the second chances and minor miracles that were also part of the lives of its trio of protagonists: party-store owner Joe (Romano) shakes off the torpor of his divorce to finally pursue his dream of professional golf, while married man Owen (Andre Braugher) takes hold of his long-delayed destiny as owner of his father\\'s car dealership. And while the transition of Terry (Scott Bakula) from lothario and would-be actor to a man committed to romance and a realistic future takes the occasional back seat to his friends\\' storylines, his struggles never lack for intimacy while also showcasing some of the show\\'s most cringe-worthy moments as he attempts to shake off a lifetime of half-steps and fruitless relationships. In each of their stories, as well as in those of the people who orbit their lives, from Joe\\'s children (Braeden Lemasters and Brittany Curran) to Owen\\'s wife (Lisa Gay Hamilton) and coworkers and Terry\\'s supremely patient girlfriend (Melinda McGraw), there is not a false note in regard to the operation of the human heart as how it truly works and not as depicted in network notes or audience demographic research. The writing in the second season (by several veterans of', 'Everybody Loves Raymond', \", among others) achieves a sort of literary level in its best moments, a gorgeous opaqueness that reveals such depths of richness and truth behind the veil of ordinary life. That high-water mark is met by the direction as well as the exceptional cast, from Romano, who continues to prove himself a remarkably subtle dramatic actor, and Braugher and Bakula, down to supporting players like Hamilton, McGraw, Richard Gant (as Braugher's prideful father), Alanna Ubach, Sarah Clarke (the\", 'Twilight', 'series), Matt Price, and Brian White. However, the season is again stolen by Jon Manfrellotti (', 'Mad Men', \") as Joe's bookie, Manfro, whose cancer diagnosis peels away his Runyonesque exterior to reveal a vinegary sagacity in his uncomfortable dealings with Joe.\", 'The three-disc presentation of', 'Men of a Certain Age', \"'s second season is anchored by commentaries by the show's key players on all 12 episodes. Romano and Royce are the dominant voices, and the humor that they and fellow writers Bridget Bedard, Lew Schneider, and Tucker Cawley provide also allows for glimpses into the show's production as well as what might have happened in its third season. Romano, Royce, Bedard, and Schneider additionally appear on a solid featurette that discusses the tone and direction of the series in fine detail. There is also a brace of deleted scenes from both seasons, as well as a frequently funny gag reel, all of which should appeal to the show's small but dedicated cadre of fans. But more significantly, what those viewers can take away from this final season is not just the excellence of the episodes, but also the fact that\", 'Men of a Certain Age', 'belongs in the ranks of such extraordinary works as', 'Freaks and Geeks', ',', 'Deadwood', ',', 'Sports Night', ',', 'Arrested Development', ',', 'Veronica Mars', ', and other series that slipped the surly bonds of the medium and truly defined the phrase', 'too good for television', '.', '--Paul Gaita']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '883929174317', 'Director': 'David Boyd', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 48 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Ray Romano, Scott Bakula, Andre Braugher, Lisa Gay Hamilton, Matt Price', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'TNT', 'Number of discs': '3'}\nWhat else can be said?  We don't need or want another CSI. Do we have to know how people in Jersey or the Kardasian's behave.  I do enjoy the occasional reality show but Bachelor Pad, really?  A Dallas remake? It seemed that there were no more ideas for good shows. Then Mike Royce and Ray Romano write this incredible show. A fresh idea, excellent writing, wonderful acting, Peabody award winner. What were we thinking to enjoy such a show.  Thank you Mike Royce, Ray Romano, Scott Bakula and Andre Braugher for offering a glimpse into the lives of these guys. It is so sad that we will only have two seasons of this fabulous show.\nExcellent writing, excellent acting. Critically acclaimed\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nThis video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas.\nFun show\nScarecrow and Mrs. King: Season 3\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n{'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Color, Multiple Formats, NTSC, Box set', 'Contributor': 'Kate Jackson, Bruce Boxleitner', 'Language': 'English', 'Number Of Discs': '5'}\nThis video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas. My review is the same for all seasons.\nPleasant show, nice to revisit.\nQUANTUM LEAP THE CS DVD FF\nScott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Get ready for an adventure of many lifetimes with the ground-breaking sci-fi classic, Quantum Leap. With the complete series box set, you can now leap through all 95 thrilling episodes over 5 seasons of this Primetime Emmy Award-winning series back-to-back and uninterrupted! Join Dr. Sam Beckett (Scott Bakula), a time traveler lost in time, who temporarily leaps into the bodies and lives of other people to \"put right what once went wrong.\" Accompanied by Al (Dean Stockwell), a wise-cracking holograph that only Sam can see and hear, Sam twists the hands of fate with each heart-pounding, action-packed adventure in the hopes that he can someday complete the mission that will take him home.Bonus Content:', 'Quantum Leap: Season One:', 'A Kiss with History', 'A Kiss with History', 'Quantum Knowledge', 'Quantum Knowledge', 'Quantum Leap: Season Four:', 'Season 5 Episode: Liberation', 'Season 5 Episode: Liberation', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Quantum Leap: Season Five:', 'Blueprints', 'Blueprints']\n{'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Runtime': '76 hours and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.95 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '76 hours and 38 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '27'}\nAll Universal Studios Home Entertainment is doing is re-packaging the original disks with grainy footage, techno-music, and probably the same double sided disks that separate and are ruined. These are a complete waste of time and money except for those who are replacing their already defective discs.<br />Quantum Leap Fans: Protest!!! Let Universal know that we want the original music, cleaned up footage and blu ray. Obviously their goal based on response below is NOT to provide the highest standard in product quality or customer care.<br /><br />Give us what we have asked for Universal.  We are willing to pay more for the corrected series.<br /><br />I contacted Universal Studios Home Entertainment. Their response:<br /><br />Thank you for contacting us. Please note that the release you are referring to has the same content as the previous release in a downsized package.<br />Our goal is to provide the highest standard in product quality and customer care, and we value input from our customers.<br />Your comments regarding Quantum Leap music will be forwarded to the appropriate department.<br />We hope you will enjoy future Universal releases.<br /><br />Sincerely,<br /><br />Consumer Relations<br />UNIVERSAL STUDIOS HOME ENTERTAINMENT\nAn amazing, excellent and still relevant show destroyed by Universal\nHere Come The Brides: Season 2\nRobert Brown  (Actor),     Mark Lenard  (Actor),     Paul Junger Witt  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Boxed Sets, Television\n[\"Set in the mid-nineteenth century, this classic TV series revolves around The Bolt brothers (Brown, Sherman and Soul) who own a mountain and logging camp in the rugged landscape of Seattle. As the area's only employer, the brothers borrow money and head east to bring back a shipload of lovely ladies to boost morale. But if any of the women leave Seattle within a year, the Bolts lose their mountain to the man that lent them the money.\"]\n{'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Robert Brown, Paul Junger Witt, David Soul, Bobby Sherman, Mark Lenard', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'unknown', 'Director': 'Paul Junger Witt', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '22 hours and 20 minutes', 'Release date': 'February 28, 2012', 'Actors': 'Robert Brown, Mark Lenard, Bobby Sherman, David Soul', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '6'}\nPleasant show with good values.\nGreat memories\nMysterious Cities of Gold [DVD]\nJean Chalopin  (Actor),     Bernard Deyries  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Anime\n[\"It is 1532 and Esteban, a Spanish orphan, is on a quest to find his father. He joins a party of Spaniards as they search for one of The Seven Cities of Gold in The New World. Zia, An Incan girl named Zia, and Tao, the last descendant of the sunken empire of Hiva, help Estaban on his search. On their journey, the three of them discover many lost technological wonders of the Mayans, Inca, and Olmecs including The Golden Condor, a huge solar-powered airship, capable of traveling considerable distances under the sun's power alone. They are constantly pursued by antagonists Gomez and Gaspard, who are also in search of the Cities of Gold.\"]\n{'Format': 'Color, NTSC, Animated, Box set, DVD', 'Contributor': 'Jean Chalopin, Bernard Deyries', 'Language': 'English', 'Number Of Discs': '6', 'Runtime': '19 hours and 20 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1 inches; 10.4 Ounces', 'Director': 'Bernard Deyries', 'Media Format': 'Color, NTSC, Animated, Box set, DVD', 'Run time': '19 hours and 20 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Jean Chalopin', 'Studio': 'Virgil Films', 'Number of discs': '6'}\nExcellent cartoon series. Well written. We enjoyed it with our young children when it aired on Nickelodeon.  We have enjoyed watching the series again with our now grown children.\nExcellent series - So happy it was made available on DVD.\nMercy Mission/Nowhere to Land [DVD]\nScott Bakula  (Actor),     Robert Loggia  (Actor),     Roger Young  (Director),     Armand Mastroianni  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Nowhere to Land, A pilot must safely land a 747 on which deadly nerve gas has been planted. Mercy Mission: The Rescue of Flight 771, This is the story of a brave single-engine aircraft pilot lost over stormy seas and the veteran commercial airline captain who, along with a plane full of passengers, guides him to safety.']\n{'Genre': 'Action & Adventure', 'Format': 'Color, DVD, Widescreen, NTSC', 'Contributor': 'Scott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand MastroianniScott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand Mastroianni  See more', 'Language': 'English', 'Runtime': '3 hours and 3 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 1 Pounds', 'Director': 'Roger Young, Armand Mastroianni', 'Media Format': 'Color, DVD, Widescreen, NTSC', 'Run time': '3 hours and 3 minutes', 'Release date': 'August 28, 2007', 'Actors': 'Scott Bakula, Robert Loggia, Rebecca Rigg, Jack Wagner, Christine Elise', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nMercy Mission - very good, based on a true story about a pilot flying a crop duster from the U.S. to Australia with several strategic stops for fuel. The plane is blown off course during a storm and instrumentation is defective. A passenger jet pilot is determined to help find the crop duster and guide him to a safe landing with even as the small plane is out of fuel. Well acted by Scott Bakula and Robert Loggia.\nMercy Mission - Very good, based on true story.\nQuantum Leap: Season 4\nScott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Take a trip through time with the daring Dr. Sam Beckett (Scott Bakula) and his hilarious hologram guide, Al (Dean Stockwell), in all 22 extraordinary, groundbreaking episodes of Quantum Leap: The Complete Fourth Season. It\\'s adventure like you\\'ve never seen, with each amazing episode from this eight-time Emmy-nominated season now digitally remastered for incredible picture quality. Journey back as Sam and Al survive a hurricane, trail a murderer, make a monkey out of themselves and even switch roles! With each \"leap\" into another identity, Sam hopes to find some insight into the jump that will finally take him home. And now, fans can spend more time with Sam and Al with an exclusive bonus episode from the Fifth Season. You won\\'t want to miss a minute of the adventure!Bonus Content:', 'Disc 3:', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Bonus Episode: Quantum Leap \"Liberation\"', 'Bonus Episode: Quantum Leap \"Liberation\"']\n{'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, Dolby, NTSC, Subtitled', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1 inches; 8.8 Ounces', 'Item model number': '29229', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, Dolby, NTSC, Subtitled', 'Run time': '17 hours and 10 minutes', 'Release date': 'March 28, 2006', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'English, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nSo sad that Universal was too cheap to purchase original music rights to these episodes. Sam Beckett is leaping around to different points in time. Each leap has coordinating music which is integral to the plot. Quantum Leap fans would have paid more for their DVD sets if Universal had cleaned up the video and kept the original musical score.\nOriginal music score replaced with Techno music.\nThe Richest Cat in the World\nFormat: DVD\nMovies & TV, Disc on Demand\n{'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Item model number': '43258-41624', 'Media Format': 'NTSC', 'Number of discs': '1'}\nA fun & entertaining family movie!  This adorable show was a favorite of our family. We had &#34;taped&#34; it and literally wore out the VHS tape. I have been waiting twenty some years for this to be available in some form.  Disney please release more of these shows.\nEven better than I remember.\nConviction: The Complete Series\nReiko Aylesworth  (Actor),     Eric Balfour  (Actor),     Norberto Barba  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Reiko Aylesworth, Eric Balfour, J. August Richards, Anson Mount, Jordan Bridges, Catrina Ganey, Julianne Nicholson, Norberto Barba, Milena Govich, Stephanie MarchReiko Aylesworth, Eric Balfour, J. August Richards, Anson Mount, Jordan Bridges, Catrina Ganey, Julianne Nicholson, Norberto Barba, Milena Govich, Stephanie March  See more', 'Language': 'English', 'Number Of Discs': '3'}\nWell written, excellent acting. A must for Anson Mount fans. I also thought Jordan Bridges acted his part very well. Wish it had been given a chance to develop further.  But such is the way with many good shows.\nexcellent acting. A must for Anson Mount fans\nTully\nGlenn Fitzgerald  (Actor),     Anson Mount  (Actor),     Hilary Birmingham  (Director),     Amy K. Barrett  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Independently Distributed, Drama\n['Tully']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Bob Burrus, Aaron Zavitz, Glenn Fitzgerald, Catherine Kellner, John Durbin, David Wain, Hilary Birmingham, Amy K. Barrett, Andi Prastowo, Richard Hansen (II), Julianne Nicholson, Laura Walker (III), Sarah Clarke, Neil Jain, John Diehl, Sandra Bernhard, Delaney Driscoll, Justin Hyde, Harry Gibbs, Christina Kirk, Michael McCormack, Mellisa Bryson, Anson Mount, Zoe Edmonds, Xander Berkeley, Kathryn Gayner, Vivek Kumar (II), David Soderlund Jr., Natalie Canerday, Joe Smalley, Kristopher Kling, Mary Louise Wilson, Federico del Moral, Andy Signore, Tim Driscoll, V. Craig HeidenreichBob Burrus, Aaron Zavitz, Glenn Fitzgerald, Catherine Kellner, John Durbin, David Wain, Hilary Birmingham, Amy K. Barrett, Andi Prastowo, Richard Hansen (II), Julianne Nicholson, Laura Walker (III), Sarah Clarke, Neil Jain, John Diehl, Sandra Bernhard, Delaney Driscoll, Justin Hy…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': 'Relay Time: 102 min', 'Director': 'Hilary Birmingham, Amy K. Barrett', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'June 17, 2003', 'Actors': 'Glenn Fitzgerald, Anson Mount, Bob Burrus, Julianne Nicholson, Laura Walker (III)', 'Studio': 'Virgil Films', 'Number of discs': '1'}\nRead the five star reviews. The majority are far more eloquent than I. Granted, I came looking for Anson Mount after seeing him in Hell on Wheels. While his performance is amazing, this movie is way more than Mr. Mount. All the actors portray their characters brilliantly.  The story is about family and all that can mean. Excellent!!\nRead the five star reviews...........\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gordon Wiles'], 'Producers': ['Ernest Chambers', 'Saul Ilson', 'Frank Gertz'], 'Starring': ['Bobby Darin'], 'Studio': ['MPI Media Group']}\nI watched this show when it originally aired and was delighted to find it for purchase.  Amazon now claims I didn't purchase despite the invoice on my account page.  Not the usual customer service I expect of Amazon. Oh well, cancelling Prime.\nBobby Darin a consummate entertainer",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: Remington Steele: Season 1\nReview Date: 2005/05/02\nStore: Stephanie Zimbalist  (Actor),     Pierce Brosnan  (Actor),     Burt Brinckerhoff  (Director),     Don Weis  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['Product Description', 'Before he was Bond... he was Remington Steele...Private eye Laura Holt (Stephanie Zimbalist) grudgingly accepts a new partner when a mystery man (Pierce Brosnan) assumes the identity of her fictitious boss, Remington Steele. Together, the two battle crime as as their feelings for each other.', 'Amazon.com', 'Remington Steele', \"'s fusion of whodunit mystery and screwball comedy burst onto television in 1982. After struggling to get clients to hire a female detective, Laura Holt (sultry Stephanie Zimbalist) invents a fictional boss named Remington Steele, whose dashing manly name draws in work. But while protecting some South African jewels, Holt runs across a mysterious thief and con-man (an elfin, baby-faced Pierce Brosnan) whom her client assumes is the nonexistent Steele--and when the case is resolved, the accidental detective decides he likes the work and sticks around, infuriating Holt with his arrogant ways and tantalizing her with his dashing good looks. Murders may occur at a winery, an island sex club, or a college reunion, but just about every episode plunders plot elements from classic movies like\", 'Bringing Up Baby', ',', 'The Third Man', ', and', 'The Trouble with Harry', \"(even the theme song was written by film composer Henry Mancini). The writers openly acknowledge this influence by having Steele use ideas he's lifted from movies to solve crimes. The constant allusions to old films should be annoying, but the show demonstrates such a rich affection for the classics that these tips of the hat actually mesh with\", 'Remington Steele', \"'s world.\", 'Remington Steele', \"has become best known as Brosnan's launching pad (he later become James Bond in\", 'GoldenEye', \"and its sequels), but Zimbalist was every bit as crucial to the show's success; her mixture of glamor and toughness gives the show a distinctly adult sexiness and grounds Brosnan's boyish charm. The dialogue sometimes slipped from arch camp to sheer cheese, but even at its most ridiculous (say, a scene where Holt and Steele question homeless bums while dressed in formal evening wear)\", 'Remington Steele', \"remains an eminently watchable show, thanks to zippy plotting and the chemistry between Zimbalist and Brosnan. Some episodes clearly implied that the pair had become intimate, yet that didn't defuse their attraction. Even when the stories became a bit silly, the mutual respect and desire between Holt and Steele never lost its sophistication.\", '--Bret Fetzer']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 6.4 Ounces', 'Director': 'Burt Brinckerhoff, Don Weis, Jeff Bleckner, Larry Elikann, Leo Penn', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '17 hours and 58 minutes', 'Release date': 'July 26, 2005', 'Actors': 'Stephanie Zimbalist, Pierce Brosnan, James Read, Janet DeMay, Carlene Watkins', 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nReview Text: WHAT IS WITH THE COVER??  Shouldn't this be a black background with lip print, gun and such. (As in the beginning of later episodes)  Stephanie Zimbalist was excellent in this series.  Why is she ignored?  Worse yet, what is with the \"Bond\" reference. If \"she\" didn't have a deep dark secret would Brosnan be necessary?????<br /><br />Hey, don't get me wrong. I watched it for ...his blue eyes and mysterious past....\nReview Title: Another deep dark secret.........\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Working Girl\nReview Date: 2006/06/06\nStore: Melanie Griffith  (Actor),     Harrison Ford  (Actor),     Mike Nichols  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: [\"Nominated for 6 Academy Awards; director Mike Nichols' witty, romantic look at life in the corporate jungle stars Melanie Griffith as Tess McGill, an ambitious secretary with a unique approach for climbing the ladder to success. When her classy, but villainous boss (Sigourneey Weaver) Breaks a leg skiing, Tess simply takes over her office, her apartment, even her wardrobe. She then creates a deal with a handsome investment banker (Harrison Ford) that will either take her straight to the top - or finish her off for good.\"]\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.08 Ounces', 'Director': 'Mike Nichols', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 17, 2001', 'Actors': 'Melanie Griffith, Harrison Ford, Sigourney Weaver, Alec Baldwin, Joan Cusack', 'Subtitles': 'English, Spanish', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), English (Dolby Digital 3.0)', 'Studio': '20th Century Fox', 'Writers': 'Kevin Wade', 'Number of discs': '1'}\nReview Text: For a general review of this fun movie please read other excellent reviews.  I would love to own the DVD.  But where can I purchase a cut version?  I prefer NOT to watch Alec Baldwin \"bopping\" Doreen. Or Kevin Spacey attempting \"seduction??\" by showing a porn film to Griffith.  Nor listen to Griffith remind herself not to F--- Up repeatedly.  Classy lady with foul mouth moves up the corporate ladder.  Nichols attempt to seek a R rating is just plain stupid.  This otherwise wonderful film is ruined by this mess.  To enjoy Working Girl at its best I will watch the TV version.\nReview Title: Gratuitous nudity, foul language & vulgarities\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bee Gees: In Our Own Time [Blu-ray]\nReview Date: 2011/03/14\nStore: Bee Gees  (Actor),     n/a  (Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: [\"Blu-ray pressing. In Our Own Time is the compelling story of the Bee Gees career. From their roots in the North West of England, through their early career in Australia, their return to England and international breakthrough in the late '60s and then on to global superstardom with Saturday Night Fever and beyond. Alongside the success there is the heartache of the tragically early deaths of first their younger brother Andy and then later Maurice. The story is told in their own words through in depth new interviews with Barry and Robin Gibb and through extensive interviews with Maurice filmed shortly before his death in January 2003. These are lavishly illustrated by live performances, TV and film clips and home movies of their early days.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Pop, Music Video & Concerts', 'Format': 'Dolby', 'Contributor': 'n/a, Bee Gees', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '1333729', 'Media Format': 'Dolby', 'Run time': '1 hour and 56 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have always enjoyed the Bee Gees songs, but had not followed their career very closely.  I caught the end of this program on A&E's Biography.  I set the DVR for a repeat of this two hour show.  Watched it and immediately purchased the DVD.  I knew these guys were talented, but the detailed account of their rise to stardom, the damage done by disco, which they DID NOT invent.  And where they have gone from there is just amazing.<br /><br />The bit where they demonstrate their three part harmony, singing Lollipop acapella, caused my 22 year old daughter to exclaim, \"That it crazy good!\"  She is so right.<br /><br />I would recommend this to anyone who has enjoyed the Bee Gees.  I am sure the diehard fans already have their copies.[[ASIN:B0043E8YAM Bee Gees: In Our Own Time [Blu-ray]]]\nReview Title: Excellent\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Above Suspicion\nReview Date: 2011/08/05\nStore: Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: [\"Above Suspicion is a British TV series based on Lynda La Plante's novels Above Suspicion, The Red Dahlia, Deadly Intent and Silent Scream. It stars Kelly Reilly and Ciarán Hinds, and features the career of La Plante's latest heroine DC Anna Travis.\"]\nAverage Rating: 4.9\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '9 x 5.5 x 0.53 inches; 4 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'August 28, 2001', 'Actors': 'Bakula, Sciorra, Gentile, Asner, B', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Polygram USA Video', 'Number of discs': '1'}\nReview Text: Interesting storyline.  Writing is not the best.  Scott Bakula's acting can make much more out of mediocre material. I did enjoy the movie.\nReview Title: Scott Bakula\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Now Voyager\nReview Date: 2011/08/05\nStore: Barry Gibb  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Music Videos & Concerts\nProduct Description: ['Barry Gibb ,Now Voyager, DVD 2005, Collectors item,Deleted edition ,Hard to find.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Music Videos & Concerts', 'Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Contributor': 'Barry Gibb', 'Language': 'English (PCM Stereo), English (DTS 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.51 x 0.39 x 7.87 inches; 3.88 Ounces', 'Media Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Run time': '1 hour and 45 minutes', 'Actors': 'Barry Gibb', 'Subtitles': 'English', 'Studio': 'universal', 'Number of discs': '1'}\nReview Text: Barry Gibb, can that be bad?  Several well written and well performed songs.  Barry without a beard (which he hates).\nReview Title: Music Video\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Men of a Certain Age: Season 2\nReview Date: 2011/11/08\nStore: Ray Romano  (Actor),     Scott Bakula  (Actor),     David Boyd  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Product Description', 'Men of a Certain Age: The Complete Second Season', 'MEN OF A CERTAIN AGE returns for a second season, with all three men facing a number of roadblocks on their continuing journeys through midlife. They know they can always rely on their friends to see them through. Joe (Romano) is a divorced, slightly neurotic father of two who runs a party store and recently overcame a gambling problem. He’s now decided to rekindle his dream of becoming a professional golfer, training for a spot on the senior tour. Owen (Braugher) the married one of the group, is finally asserting himself at his family’s car dealership, but is struggling with being the boss. Terry (Bakula) the relaxed, handsome actor continues to search for stability after disastrous attempts at managing an apartment complex and reviving his acting career.', ']]>', 'Amazon.com', \"It's an overused term, but few words seem more apt than\", 'bittersweet', 'to describe the second and final season of the critically acclaimed comedy/drama', 'Men of a Certain Age', ': bitter in that the show was brought to a close far too soon for fans and many critics, but also sweet in that the series, created by Ray Romano and Mike Royce, ended on the same notes of honesty, poignancy, and sheer creative quality that marked its beginning. The sophomore season of', 'Certain Age', 'also found the show escaping from the short-sightedness that painted it as a series about \"guys in midlife crisis\" to become a program about the second chances and minor miracles that were also part of the lives of its trio of protagonists: party-store owner Joe (Romano) shakes off the torpor of his divorce to finally pursue his dream of professional golf, while married man Owen (Andre Braugher) takes hold of his long-delayed destiny as owner of his father\\'s car dealership. And while the transition of Terry (Scott Bakula) from lothario and would-be actor to a man committed to romance and a realistic future takes the occasional back seat to his friends\\' storylines, his struggles never lack for intimacy while also showcasing some of the show\\'s most cringe-worthy moments as he attempts to shake off a lifetime of half-steps and fruitless relationships. In each of their stories, as well as in those of the people who orbit their lives, from Joe\\'s children (Braeden Lemasters and Brittany Curran) to Owen\\'s wife (Lisa Gay Hamilton) and coworkers and Terry\\'s supremely patient girlfriend (Melinda McGraw), there is not a false note in regard to the operation of the human heart as how it truly works and not as depicted in network notes or audience demographic research. The writing in the second season (by several veterans of', 'Everybody Loves Raymond', \", among others) achieves a sort of literary level in its best moments, a gorgeous opaqueness that reveals such depths of richness and truth behind the veil of ordinary life. That high-water mark is met by the direction as well as the exceptional cast, from Romano, who continues to prove himself a remarkably subtle dramatic actor, and Braugher and Bakula, down to supporting players like Hamilton, McGraw, Richard Gant (as Braugher's prideful father), Alanna Ubach, Sarah Clarke (the\", 'Twilight', 'series), Matt Price, and Brian White. However, the season is again stolen by Jon Manfrellotti (', 'Mad Men', \") as Joe's bookie, Manfro, whose cancer diagnosis peels away his Runyonesque exterior to reveal a vinegary sagacity in his uncomfortable dealings with Joe.\", 'The three-disc presentation of', 'Men of a Certain Age', \"'s second season is anchored by commentaries by the show's key players on all 12 episodes. Romano and Royce are the dominant voices, and the humor that they and fellow writers Bridget Bedard, Lew Schneider, and Tucker Cawley provide also allows for glimpses into the show's production as well as what might have happened in its third season. Romano, Royce, Bedard, and Schneider additionally appear on a solid featurette that discusses the tone and direction of the series in fine detail. There is also a brace of deleted scenes from both seasons, as well as a frequently funny gag reel, all of which should appeal to the show's small but dedicated cadre of fans. But more significantly, what those viewers can take away from this final season is not just the excellence of the episodes, but also the fact that\", 'Men of a Certain Age', 'belongs in the ranks of such extraordinary works as', 'Freaks and Geeks', ',', 'Deadwood', ',', 'Sports Night', ',', 'Arrested Development', ',', 'Veronica Mars', ', and other series that slipped the surly bonds of the medium and truly defined the phrase', 'too good for television', '.', '--Paul Gaita']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '883929174317', 'Director': 'David Boyd', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 48 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Ray Romano, Scott Bakula, Andre Braugher, Lisa Gay Hamilton, Matt Price', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'TNT', 'Number of discs': '3'}\nReview Text: What else can be said?  We don't need or want another CSI. Do we have to know how people in Jersey or the Kardasian's behave.  I do enjoy the occasional reality show but Bachelor Pad, really?  A Dallas remake? It seemed that there were no more ideas for good shows. Then Mike Royce and Ray Romano write this incredible show. A fresh idea, excellent writing, wonderful acting, Peabody award winner. What were we thinking to enjoy such a show.  Thank you Mike Royce, Ray Romano, Scott Bakula and Andre Braugher for offering a glimpse into the lives of these guys. It is so sad that we will only have two seasons of this fabulous show.\nReview Title: Excellent writing, excellent acting. Critically acclaimed\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scarecrow & Mrs. King: Season 4\nReview Date: 2013/10/26\nStore: Kate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nReview Text: This video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas.\nReview Title: Fun show\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Scarecrow and Mrs. King: Season 3\nReview Date: 2013/10/26\nStore: Kate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Color, Multiple Formats, NTSC, Box set', 'Contributor': 'Kate Jackson, Bruce Boxleitner', 'Language': 'English', 'Number Of Discs': '5'}\nReview Text: This video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas. My review is the same for all seasons.\nReview Title: Pleasant show, nice to revisit.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: QUANTUM LEAP THE CS DVD FF\nReview Date: 2014/08/13\nStore: Scott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Get ready for an adventure of many lifetimes with the ground-breaking sci-fi classic, Quantum Leap. With the complete series box set, you can now leap through all 95 thrilling episodes over 5 seasons of this Primetime Emmy Award-winning series back-to-back and uninterrupted! Join Dr. Sam Beckett (Scott Bakula), a time traveler lost in time, who temporarily leaps into the bodies and lives of other people to \"put right what once went wrong.\" Accompanied by Al (Dean Stockwell), a wise-cracking holograph that only Sam can see and hear, Sam twists the hands of fate with each heart-pounding, action-packed adventure in the hopes that he can someday complete the mission that will take him home.Bonus Content:', 'Quantum Leap: Season One:', 'A Kiss with History', 'A Kiss with History', 'Quantum Knowledge', 'Quantum Knowledge', 'Quantum Leap: Season Four:', 'Season 5 Episode: Liberation', 'Season 5 Episode: Liberation', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Quantum Leap: Season Five:', 'Blueprints', 'Blueprints']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Runtime': '76 hours and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.95 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '76 hours and 38 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '27'}\nReview Text: All Universal Studios Home Entertainment is doing is re-packaging the original disks with grainy footage, techno-music, and probably the same double sided disks that separate and are ruined. These are a complete waste of time and money except for those who are replacing their already defective discs.<br />Quantum Leap Fans: Protest!!! Let Universal know that we want the original music, cleaned up footage and blu ray. Obviously their goal based on response below is NOT to provide the highest standard in product quality or customer care.<br /><br />Give us what we have asked for Universal.  We are willing to pay more for the corrected series.<br /><br />I contacted Universal Studios Home Entertainment. Their response:<br /><br />Thank you for contacting us. Please note that the release you are referring to has the same content as the previous release in a downsized package.<br />Our goal is to provide the highest standard in product quality and customer care, and we value input from our customers.<br />Your comments regarding Quantum Leap music will be forwarded to the appropriate department.<br />We hope you will enjoy future Universal releases.<br /><br />Sincerely,<br /><br />Consumer Relations<br />UNIVERSAL STUDIOS HOME ENTERTAINMENT\nReview Title: An amazing, excellent and still relevant show destroyed by Universal\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Here Come The Brides: Season 2\nReview Date: 2014/09/15\nStore: Robert Brown  (Actor),     Mark Lenard  (Actor),     Paul Junger Witt  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nProduct Description: [\"Set in the mid-nineteenth century, this classic TV series revolves around The Bolt brothers (Brown, Sherman and Soul) who own a mountain and logging camp in the rugged landscape of Seattle. As the area's only employer, the brothers borrow money and head east to bring back a shipload of lovely ladies to boost morale. But if any of the women leave Seattle within a year, the Bolts lose their mountain to the man that lent them the money.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Television, Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': 'Robert Brown, Paul Junger Witt, David Soul, Bobby Sherman, Mark Lenard', 'Language': 'English', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.2 Ounces', 'Item model number': 'unknown', 'Director': 'Paul Junger Witt', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Run time': '22 hours and 20 minutes', 'Release date': 'February 28, 2012', 'Actors': 'Robert Brown, Mark Lenard, Bobby Sherman, David Soul', 'Studio': 'Shout Factory', 'Country of Origin': 'USA', 'Number of discs': '6'}\nReview Text: Pleasant show with good values.\nReview Title: Great memories\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mysterious Cities of Gold [DVD]\nReview Date: 2014/09/15\nStore: Jean Chalopin  (Actor),     Bernard Deyries  (Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Anime\nProduct Description: [\"It is 1532 and Esteban, a Spanish orphan, is on a quest to find his father. He joins a party of Spaniards as they search for one of The Seven Cities of Gold in The New World. Zia, An Incan girl named Zia, and Tao, the last descendant of the sunken empire of Hiva, help Estaban on his search. On their journey, the three of them discover many lost technological wonders of the Mayans, Inca, and Olmecs including The Golden Condor, a huge solar-powered airship, capable of traveling considerable distances under the sun's power alone. They are constantly pursued by antagonists Gomez and Gaspard, who are also in search of the Cities of Gold.\"]\nAverage Rating: 4.6\nProduct Details: {'Format': 'Color, NTSC, Animated, Box set, DVD', 'Contributor': 'Jean Chalopin, Bernard Deyries', 'Language': 'English', 'Number Of Discs': '6', 'Runtime': '19 hours and 20 minutes', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1 inches; 10.4 Ounces', 'Director': 'Bernard Deyries', 'Media Format': 'Color, NTSC, Animated, Box set, DVD', 'Run time': '19 hours and 20 minutes', 'Release date': 'April 7, 2009', 'Actors': 'Jean Chalopin', 'Studio': 'Virgil Films', 'Number of discs': '6'}\nReview Text: Excellent cartoon series. Well written. We enjoyed it with our young children when it aired on Nickelodeon.  We have enjoyed watching the series again with our now grown children.\nReview Title: Excellent series - So happy it was made available on DVD.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mercy Mission/Nowhere to Land [DVD]\nReview Date: 2014/09/15\nStore: Scott Bakula  (Actor),     Robert Loggia  (Actor),     Roger Young  (Director),     Armand Mastroianni  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Nowhere to Land, A pilot must safely land a 747 on which deadly nerve gas has been planted. Mercy Mission: The Rescue of Flight 771, This is the story of a brave single-engine aircraft pilot lost over stormy seas and the veteran commercial airline captain who, along with a plane full of passengers, guides him to safety.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Color, DVD, Widescreen, NTSC', 'Contributor': 'Scott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand MastroianniScott Bakula, Robert Loggia, Christine Elise, Rebecca Rigg, Jack Wagner, Roger Young, Armand Mastroianni  See more', 'Language': 'English', 'Runtime': '3 hours and 3 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 1 Pounds', 'Director': 'Roger Young, Armand Mastroianni', 'Media Format': 'Color, DVD, Widescreen, NTSC', 'Run time': '3 hours and 3 minutes', 'Release date': 'August 28, 2007', 'Actors': 'Scott Bakula, Robert Loggia, Rebecca Rigg, Jack Wagner, Christine Elise', 'Studio': 'Rhi Entertainment', 'Number of discs': '2'}\nReview Text: Mercy Mission - very good, based on a true story about a pilot flying a crop duster from the U.S. to Australia with several strategic stops for fuel. The plane is blown off course during a storm and instrumentation is defective. A passenger jet pilot is determined to help find the crop duster and guide him to a safe landing with even as the small plane is out of fuel. Well acted by Scott Bakula and Robert Loggia.\nReview Title: Mercy Mission - Very good, based on true story.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Quantum Leap: Season 4\nReview Date: 2014/09/15\nStore: Scott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Take a trip through time with the daring Dr. Sam Beckett (Scott Bakula) and his hilarious hologram guide, Al (Dean Stockwell), in all 22 extraordinary, groundbreaking episodes of Quantum Leap: The Complete Fourth Season. It\\'s adventure like you\\'ve never seen, with each amazing episode from this eight-time Emmy-nominated season now digitally remastered for incredible picture quality. Journey back as Sam and Al survive a hurricane, trail a murderer, make a monkey out of themselves and even switch roles! With each \"leap\" into another identity, Sam hopes to find some insight into the jump that will finally take him home. And now, fans can spend more time with Sam and Al with an exclusive bonus episode from the Fifth Season. You won\\'t want to miss a minute of the adventure!Bonus Content:', 'Disc 3:', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Bonus Episode: Quantum Leap \"Liberation\"', 'Bonus Episode: Quantum Leap \"Liberation\"']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, Dolby, NTSC, Subtitled', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 1 inches; 8.8 Ounces', 'Item model number': '29229', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, Full Screen, Dolby, NTSC, Subtitled', 'Run time': '17 hours and 10 minutes', 'Release date': 'March 28, 2006', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'English, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: So sad that Universal was too cheap to purchase original music rights to these episodes. Sam Beckett is leaping around to different points in time. Each leap has coordinating music which is integral to the plot. Quantum Leap fans would have paid more for their DVD sets if Universal had cleaned up the video and kept the original musical score.\nReview Title: Original music score replaced with Techno music.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Richest Cat in the World\nReview Date: 2014/09/30\nStore: Format: DVD\nCategories: Movies & TV, Disc on Demand\nAverage Rating: 4.7\nProduct Details: {'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.93 Ounces', 'Item model number': '43258-41624', 'Media Format': 'NTSC', 'Number of discs': '1'}\nReview Text: A fun & entertaining family movie!  This adorable show was a favorite of our family. We had &#34;taped&#34; it and literally wore out the VHS tape. I have been waiting twenty some years for this to be available in some form.  Disney please release more of these shows.\nReview Title: Even better than I remember.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Conviction: The Complete Series\nReview Date: 2015/11/03\nStore: Reiko Aylesworth  (Actor),     Eric Balfour  (Actor),     Norberto Barba  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Television\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Reiko Aylesworth, Eric Balfour, J. August Richards, Anson Mount, Jordan Bridges, Catrina Ganey, Julianne Nicholson, Norberto Barba, Milena Govich, Stephanie MarchReiko Aylesworth, Eric Balfour, J. August Richards, Anson Mount, Jordan Bridges, Catrina Ganey, Julianne Nicholson, Norberto Barba, Milena Govich, Stephanie March  See more', 'Language': 'English', 'Number Of Discs': '3'}\nReview Text: Well written, excellent acting. A must for Anson Mount fans. I also thought Jordan Bridges acted his part very well. Wish it had been given a chance to develop further.  But such is the way with many good shows.\nReview Title: excellent acting. A must for Anson Mount fans\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tully\nReview Date: 2015/11/19\nStore: Glenn Fitzgerald  (Actor),     Anson Mount  (Actor),     Hilary Birmingham  (Director),     Amy K. Barrett  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Independently Distributed, Drama\nProduct Description: ['Tully']\nAverage Rating: 4.1\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Bob Burrus, Aaron Zavitz, Glenn Fitzgerald, Catherine Kellner, John Durbin, David Wain, Hilary Birmingham, Amy K. Barrett, Andi Prastowo, Richard Hansen (II), Julianne Nicholson, Laura Walker (III), Sarah Clarke, Neil Jain, John Diehl, Sandra Bernhard, Delaney Driscoll, Justin Hyde, Harry Gibbs, Christina Kirk, Michael McCormack, Mellisa Bryson, Anson Mount, Zoe Edmonds, Xander Berkeley, Kathryn Gayner, Vivek Kumar (II), David Soderlund Jr., Natalie Canerday, Joe Smalley, Kristopher Kling, Mary Louise Wilson, Federico del Moral, Andy Signore, Tim Driscoll, V. Craig HeidenreichBob Burrus, Aaron Zavitz, Glenn Fitzgerald, Catherine Kellner, John Durbin, David Wain, Hilary Birmingham, Amy K. Barrett, Andi Prastowo, Richard Hansen (II), Julianne Nicholson, Laura Walker (III), Sarah Clarke, Neil Jain, John Diehl, Sandra Bernhard, Delaney Driscoll, Justin Hy…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 42 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.84 Ounces', 'Item model number': 'Relay Time: 102 min', 'Director': 'Hilary Birmingham, Amy K. Barrett', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'June 17, 2003', 'Actors': 'Glenn Fitzgerald, Anson Mount, Bob Burrus, Julianne Nicholson, Laura Walker (III)', 'Studio': 'Virgil Films', 'Number of discs': '1'}\nReview Text: Read the five star reviews. The majority are far more eloquent than I. Granted, I came looking for Anson Mount after seeing him in Hell on Wheels. While his performance is amazing, this movie is way more than Mr. Mount. All the actors portray their characters brilliantly.  The story is about family and all that can mean. Excellent!!\nReview Title: Read the five star reviews...........\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2020/08/28\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gordon Wiles'], 'Producers': ['Ernest Chambers', 'Saul Ilson', 'Frank Gertz'], 'Starring': ['Bobby Darin'], 'Studio': ['MPI Media Group']}\nReview Text: I watched this show when it originally aired and was delighted to find it for purchase.  Amazon now claims I didn't purchase despite the invoice on my account page.  Not the usual customer service I expect of Amazon. Oh well, cancelling Prime.\nReview Title: Bobby Darin a consummate entertainer\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Shopping Preferences Overview:**\n\n- **Genre Preference:** Strong inclination towards classic television series and movies, particularly with elements of mystery, crime, and romantic comedy.\n- **Actors of Interest:** Consistently purchases works featuring specific actors like Scott Bakula, Stephanie Zimbalist, and Pierce Brosnan, suggesting a preference for their performances.\n- **Formats Preferred:** Primarily DVDs and Blu-rays, indicating value placed on physical media, possibly for nostalgia or collectors' purposes.\n- **Content Type:** Exhibits a preference for well-written narratives, highlighting his interest in character-driven plots and relatable themes (e.g., midlife crises, romance).\n- **Viewership Trends:** Shows a nostalgic attachment to shows from past decades, including family-friendly and wholesome content. A notable appreciation for cultural classics (e.g., music documentaries).\n- **Ratings:** Product ratings often reflect high satisfaction (4.6+ average), indicating a discerning taste and enjoyment of quality storytelling.\n- **Critical Views:** Expresses concerns about modern adaptations and remakes, showing a preference for original content and storytelling integrity.\n- **Collectibility:** Purchases reflect ongoing engagement with series and film collections, seeking rare or harder-to-find releases, further emphasizing a collector's mindset.\n\nThis individual demonstrates a passion for classic cinema and television, particularly favoring compelling narratives involving beloved actors, while valuing historical authenticity in content.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Bobby Sherman guest stars",
    "text": "1970's musical variety shows were wonderful.  Barbara has a beautiful voice.  Best of all Bobby Sherman, very rarely filmed live, sings three songs, one is a duet with Barbara of Never My Love.  Proving he was not just a Teen Idol, but a talented singer and musician.",
    "images": [],
    "asin": "B00US68X28",
    "parent_asin": "B00US68X28",
    "user_id": "AEEA7GWY5ELEMEGUXULT5OBCACTQ",
    "timestamp": "2021-03-06 04:50:25.324000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": null,
    "title_meta": "Barbara McNair Box Set",
    "average_rating": 4.5,
    "rating_number": 31,
    "features": [],
    "description": [
      "The talented Barbara McNair was one of the country's most popular headliners in the 1950s and '60s. She was a favorite guest on TV variety shows, such as 'The Steve Allen Show,' and created headlines with her role in the gritty film If He Hollers, Let Him Go in 1968. But in 1969, Barbara McNair made history as the first African- American woman to host her own TV variety show with 'The Barbara McNair Show,' featuring an all- star guest cast of some of the best singers and performers of the time, including B.B. King, Johnny Mathis, the Righteous Brothers and Della Reese. Sit back and enjoy over 12 hours of Barbara's beautiful voice, charming personality and the performances of her many talented guests in this never-before-released collection of the best episodes of 'The Barbara McNair Show!'"
    ],
    "price": 11.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/515qFz+uuOL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/515qFz+uuOL.jpg",
        "variant": "MAIN",
        "hi_res": null
      }
    ],
    "videos": [],
    "store": "Barbara McNair  (Actor),     Johnny Mathis  (Actor),     Various  (Director)    &                   0                  more   Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "DVD",
      "Comedy"
    ],
    "details": {
      "Genre": "Television",
      "Format": "Multiple Formats, Box set, Color, NTSC",
      "Contributor": "Johnny Mathis, The Rascals, Kenny Rogers, Irish Rovers, Lou Rawls, Righteous Brothers, Rich Little, Barbara McNair, Debbie Reynolds, VariousJohnny Mathis, The Rascals, Kenny Rogers, Irish Rovers, Lou Rawls, Righteous Brothers, Rich Little, Barbara McNair, Debbie Reynolds, Various   See more",
      "Language": "English",
      "Runtime": "12 hours and 35 minutes",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.93 Ounces",
      "Director": "Various",
      "Media Format": "Multiple Formats, Box set, Color, NTSC",
      "Run time": "12 hours and 35 minutes",
      "Release date": "May 5, 2015",
      "Actors": "Barbara McNair, Johnny Mathis, Righteous Brothers, Kenny Rogers, The Rascals",
      "Studio": "Synergy Ent",
      "Country of Origin": "USA",
      "Number of discs": "4"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}