{
  "user_id": "AFWLJDVTUEIZ2CGL7LSV2ZIFNQDA",
  "summary": "=== Purchase Information ===\nProduct Title: The Young in Heart\nReview Date: 2018/09/02\nStore: Janet Gaynor  (Actor),     Douglas Fairbanks Jr.  (Actor),     Richard Wallace  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Having been given the bum's rush at Monte Carlo, a clan of polished grifters (Janet Gaynor, Douglas Fairbanks, Jr., Roland Young, Billie Burke) make the fortuitous acquaintance of a wealthy and lonely old widow (Minnie Dupree) during a cross-continent train trip. Their plans to insinuate themselves in her life and sponge off of her wind up crashing on shoals of unaccustomed conscience, in this winning and warm comedy. Paulette Goddard, Richard Carlson, Henry Stephenson also star. 90 min. Standard; Soundtrack: English Dolby Digital mono; Subtitles: English; theatrical trailer.\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy', 'Format': 'Anamorphic, NTSC, Subtitled', 'Contributor': 'Roland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard WallaceRoland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard Wallace  See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Richard Wallace', 'Media Format': 'Anamorphic, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 9, 2018', 'Actors': 'Janet Gaynor, Douglas Fairbanks Jr., Paulette Goddard, Roland Young, Billie Burke', 'Subtitles': 'English', 'Studio': 'Kl Studio Classics', 'Number of discs': '1'}\nReview Text: A precious old movie! Love the transformation that occurs in the con artist family. Optimistic story with positive, uplifting outcome.\nReview Title: Precious story, great stars!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Romancing The Stone + The Jewel Of The Nile Set\nReview Date: 2018/09/02\nStore: Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Romance\nProduct Description: ['Actors: Michael Douglas, Kathleen Turner Directors: Danny DeVito Format: AC-3, Color Subtitles: French, Spanish Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.75 x 0.3 x 6 inches; 2.88 Ounces', 'Media Format': 'DVD', 'Subtitles': 'English'}\nReview Text: Two of my favorite movies. I like that both are on one DVD.\nReview Title: Two Favorites\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Twins\nReview Date: 2018/09/02\nStore: Arnold Schwarzenegger  (Actor),     Danny DeVito  (Actor),     Ivan Reitman  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Monthly Deals\nProduct Description: ['Superstars Arnold Schwarzenegger and Danny DeVito team up for twice the laughs in this hilarious box-office blockbuster from director Ivan Reitman (Ghostbusters). An ambitious genetic experiment takes the wrong turn when two twins - who look nothing alike - are born and then separated. Years later, the unlikely siblings meet: Julius, a highly educated but sheltered giant with a big heart, and Vincent, a pint-sized hustler with an insatiable lust for women and money. With girlfriends in tow and a hitman on their tail, the newfound brothers set off on a wild, cross-country misadventure to find their mother - but end up finding out more about themselves.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Schwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & AdventureSchwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & Adventure  See more', 'Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Contributor': 'Trey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan ReitmanTrey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan Reitman  See more', 'Language': 'Spanish (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.33 Ounces', 'Item model number': 'Relay Time: 107 min', 'Director': 'Ivan Reitman', 'Media Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Run time': '1 hour and 47 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Arnold Schwarzenegger, Danny DeVito, Kelly Preston, Chloe Webb, Bonnie Bartlett', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Davies, William Osborne, Timothy Harris, Herschel Weingrod', 'Number of discs': '1'}\nReview Text: Still a fun watch!\nReview Title: Fun Watch!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The American President / Dave\nReview Date: 2018/09/02\nStore: Michael Douglas  (Actor),     Annette Bening  (Actor),     Frank Langella  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, Warner Sale\nProduct Description: ['American President/Dave (DVD) (DBFE) (Multi-Title)', \"Michael Douglas and Kevin Kline are both President and accounted for in two hit comedies about the nation's Oval Office. Rob Reiner directs The American President [Side A], starring Douglas as a widower chief executive whose poll numbers plummet when he falls for an environmental lobbyist (Annette Bening). Martin Sheen, Michael J. Fox, Richard Dreyfuss and more top talents co-star in this nimble exploration of private romance in a public Presidency. And in a land where anybody can become President, anybody just did! Kline and Sigourney Weaver star in Dave [Side B], the wry Ivan Reitman-directed story of a lookalike who becomes a stand-in for the country's actual President. From coast to coast the votes are in:this double feature is a winner by a landslide!\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Love & Romance', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Annette Bening, Frank Langella, Martin Sheen, Kevin Kline, Sigourney Weaver, Michael Douglas', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Item model number': 'WHV83767DVD', 'Director': 'Frank Langella', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'January 2, 2007', 'Actors': 'Michael Douglas, Annette Bening, Kevin Kline, Sigourney Weaver, Martin Sheen', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Two favorites, one dvd! Chances are if you like one you're going to like the other!\nReview Title: Good buy\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Crocodile Dundee / Crocodile Dundee II Double Feature\nReview Date: 2018/09/02\nStore: Paul Hogan  (Actor),     Linda Kozlowski  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: ['A free spirited Australian croc hunter leaves the out back to visit America\\'s Big Apple and quickly finds a girlfriend accompanied by a huge pack of trouble waiting for him as \"down under\" takes on a whole new meaning in these two block busters.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Paul Hogan, Linda Kozlowski', 'Language': 'English', 'Runtime': '3 hours and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Item model number': '170164', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 28 minutes', 'Release date': 'March 5, 2013', 'Actors': 'Paul Hogan, Linda Kozlowski', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: Still fun features. Two on one dvd. Yay!\nReview Title: Two on one dvd\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Housesitter [DVD]\nReview Date: 2018/09/02\nStore: Steve Martin  (Actor),     Goldie Hawn  (Actor),     Frank Oz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Steve Martin and Goldie Hawn star in this hilarious romantic comedy about the consequences of \"stretching\" the truth. When architect Newton Davis\\' girlfriend Becky (Dana Delany) turns down his marriage proposal, his newly-built dream house suddenly becomes nothing more than an empty monument to her rejection. That is, until a chance encounter with Gwen (Hawn) turns his life upside-down. Intrigued by Newton\\'s story, Gwen visits the house and decides to move in on her own. Resourceful and creative, Gwen is soon fixing up the house and charming Newton\\'s family and neighbors—and all the while passing herself off as his new wife! Gwen even befriends Becky, who begins to see a Newton she never knew existed. Horrified at the deception yet unable to stop it, Newton finds himself playing along with her preposterous stories, her attempts at reconciling differences within the family and her campaign for his promotion at work. Finally, he convinces Gwen to fabricate their \"divorce\" so he can still get married to Becky—until he has a change of heart. It\\'s a delightful, warmhearted and intelligent comedy from director Frank Oz.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Contributor': 'Goldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel CroninGoldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel Cronin   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Surround)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 102 min', 'Director': 'Frank Oz', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Steve Martin, Goldie Hawn, Dana Delany, Julie Harris, Donald Moffat', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Brian Grazer', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Mark Stein', 'Number of discs': '1'}\nReview Text: A fun favorite! As only two masterful comedians can deliver!\nReview Title: A fun favorite!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wag the dog\nReview Date: 2018/09/02\nStore: Dustin Hoffman  (Actor),     Robert De Niro  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'Wag The Dog (DVD)', 'Academy Award winners Robert De Niro and Dustin Hoffman star in a tale of politics, power and Hollywood so outrageous it could be true! Two weeks before re-election, the President of the United States (Michael Belson) is accused of accosting a girl scout. Before the news reaches the media, his advisors call in a political consultant (De Nireo) specializing in image rescues. What to do? Hire a Hollywood producer (Hoffman) to create a war--distracting public attention from the scandal and rallying Americans to their President in surge of patriotic ferver.', ']]>', 'Amazon.com', 'Not only was Barry Levinson\\'s comedy shot in a relatively fast period of 29 days, the satire of politics and show business feels as if it were made yesterday. There\\'s a fresh spin quite evident here, a nervy satire of a presidential crisis and the people who whitewash the facts. The main players are a mysterious Mr. Fix-It (Robert De Niro), veteran Hollywood producer (Dustin Hoffman), and a White House aide (Anne Heche). Can the president\\'s molesting of a young girl be buried in the two weeks before an election? A war in Albania just might do the trick. In the good old days, the president would just invade. With modern technology, it\\'s even cleaner. The hungry press looks for any lead, convenient misinformation is created by the latest Hollywood fakery (\"all developed by the new James Cameron film\") creating images and merchandise all instantly packaged. And it must be real, because it\\'s on TV. David Mamet\\'s script never questions the morals or the absolute secrecy needed to pull this thing off. He and director Barry Levinson have enough truth in the story to make you wonder what is real news and what is just promotion the next time you see CNN. Many of the supporting players impact the story with mere presence: Denis Leary as a quote man, Willie Nelson as a songwriter. The three leads are magnificent. With the similarities between history and this film,', 'Wag', 'will forever linked to the Monica Lewinsky saga. This video version contains a new minidocumentary focusing on the parallels of the film with the Bill Clinton scandal, including comments from director Barry Levinson and hosted by newsman Tom Brokaw.', '--Doug Thomas']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4908852', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 15, 2005', 'Actors': 'Dustin Hoffman, Robert De Niro, Anne Heche, Denis Leary, Willie Nelson', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'New Line', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Explains perfectly what's going on with the media and political manipulation of this country. Intended as satire, it's a little too close to the truth for comfort! Amusing and effective in its storytelling. Masterful execution of a plot that should make you shudder. Will get you to thinking for sure!\nReview Title: More Bite Than Bark\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Guarding Tess\nReview Date: 2018/09/02\nStore: Nicolas Cage  (Actor),     Shirley MacLaine  (Actor),     Hugh Wilson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['What do you do with a former First Lady who\\'s unpredictable, ornery and impossible to please? Anything she wants! Shirley MacLaine and Nicolas Cage star in this comic, compassionate look at life after the White House for two former Washington insiders: First Lady Tess Carlisle and Secret Service agent Doug Chesnic. As uproarious as it is uplifting, GUARDING TESS is \"a grand mixture of laughter and tears.\" Gary Franklin, KCOP-TV']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 95 min', 'Director': 'Hugh Wilson', 'Media Format': 'Color, Multiple Formats, NTSC, Closed-captioned, Full Screen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 7, 1998', 'Actors': 'Nicolas Cage, Shirley MacLaine, Austin Pendleton, Edward Albert, James Redhorn', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Nancy Tanen, Ned Tanen', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Still one of the greats. Representing some of the best acting from two Hollywood icons. Great storytelling!\nReview Title: Great! Masterful Storytelling!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Davy Crockett -Two Movie Set\nReview Date: 2018/09/02\nStore: Fess Parker  (Actor),     Buddy Ebsen  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: [\"Put on your coonskin cap and get set to travel back to the days when the nation was young and its roads were paved with nothing but action and adventure! It was a big country -- full of bold dreams, larger-than-life characters and an untamed frontier that stretched farther than the eye could see. And now, for the first time ever, a legend comes to life as Davy Crockett makes his Blu-ray debut in two of Disney's best-loved classics: DAVY CROCKETT, KING OF THE WILD FRONTIER and DAVE CROCKETT AND THE RIVER PIRATES. Celebrate the 60th Anniversary of the tales that~introduced America to one of its most fearless folk heroes.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Jeff York, Fess Parker, Buddy Ebsen', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '2 hours and 54 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': '786936232110', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 54 minutes', 'Release date': 'September 7, 2004', 'Actors': 'Fess Parker, Buddy Ebsen, Jeff York', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Still holds up well. Disney charm. Family viewing. Delightful!\nReview Title: Delightful and Charming\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Phenomenon\nReview Date: 2018/09/02\nStore: John Travolta  (Actor),     Kyra Sedgwick  (Actor),     Jon Turteltaub  (Director),     Phedon Papamichael  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"Hollywood favorite John Travolta (SWORDFISH, PULP FICTION) stars in this acclaimed, uplifting story of an ordinary man transformed by extraordinary events! On the night of his 37th birthday, George Malley (Travolta) is knocked to the ground by a mysterious, blinding light and suddenly develops amazing mental abilities! With his newfound knowledge, George astounds everyone in town. But when his incredible powers cause even his oldest friends to turn away, George comes to realize that his wondrous experience has changed him and the lives of everyone around him forever. With an outstanding supporting cast featuring Robert Duvall (SOMETHING TO TALK ABOUT), Forest Whitaker (SPECIES), and Kyra Sedgwick (SINGLES) -- don't miss this must-see motion picture event!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'TRAVOLTA, Drama, JOHN', 'Format': 'NTSC, Subtitled, Multiple Formats, Widescreen, Closed-captioned, Letterboxed, Dolby, Color', 'Contributor': \"Kyra Sedgwick, Tony Genaro, Forest Whitaker, Robert Duvall, Brent Spiner, Michael Milhoan, Jon Turteltaub, Bruce A. Young, Vyto Ruginis, Jeffrey Demunn, Richard Kiley, Gerald DiPego, Phedon Papamichael, Sean O'Bryan, Ashley Buccille, Troy Evans, David Gallagher, John TravoltaKyra Sedgwick, Tony Genaro, Forest Whitaker, Robert Duvall, Brent Spiner, Michael Milhoan, Jon Turteltaub, Bruce A. Young, Vyto Ruginis, Jeffrey Demunn, Richard Kiley, Gerald DiPego, Phedon Papamichael, Sean O'Bryan, Ashley Buccille, Troy Evans, David Gallagher, John Trav…   See more\", 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '1308100', 'Director': 'Jon Turteltaub, Phedon Papamichael', 'Media Format': 'NTSC, Subtitled, Multiple Formats, Widescreen, Closed-captioned, Letterboxed, Dolby, Color', 'Run time': '2 hours and 3 minutes', 'Release date': 'December 3, 1997', 'Actors': 'John Travolta, Kyra Sedgwick, Forest Whitaker, Robert Duvall, Jeffrey Demunn', 'Subtitles': 'Spanish', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Gerald DiPego', 'Number of discs': '1'}\nReview Text: Still one of the greats in filmmaking! Two exceptional stars in performances of a lifetime.\nReview Title: Exceptional!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: True Lies\nReview Date: 2018/09/02\nStore: Arnold Schwarzenegger  (Actor),     Jamie Lee Curtis  (Actor),     James Cameron  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['A Washington wife discovers her computer-salesman husband is a spy out to stop nuclear terrorists.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Charlton Heston, Art Malik, Eliza Dushku, Tia Carrere, Bill Paxton, Grant Heslov, Tom Arnold, Jamie Lee Curtis, Marshall Manesh, Simon Michal, Dieter Rauter, Arnold Schwarzenegger, Claude Zidi, Didier Kaminka, James Allen, James CameronCharlton Heston, Art Malik, Eliza Dushku, Tia Carrere, Bill Paxton, Grant Heslov, Tom Arnold, Jamie Lee Curtis, Marshall Manesh, Simon Michal, Dieter Rauter, Arnold Schwarzenegger, Claude Zidi, Didier Kaminka, James Allen, James Cameron   See more', 'Language': 'English (Dolby Surround), French (Dolby Surround), Spanish (Dolby Surround), Unqualified', 'Runtime': '2 hours and 21 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4116268', 'Director': 'James Cameron', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 21 minutes', 'Release date': 'January 1, 2012', 'Actors': 'Arnold Schwarzenegger, Jamie Lee Curtis, Tom Arnold, Bill Paxton, Tia Carrere', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Claude Zidi, Didier Kaminka, James Cameron, Simon Michal', 'Number of discs': '1'}\nReview Text: Fun viewing!\nReview Title: Fun viewing!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Money Pit\nReview Date: 2018/09/02\nStore: Tom Hanks  (Actor),     Shelley Long  (Actor),     Richard Benjamin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, DTS\nProduct Description: ['Two-time Oscar winner Tom Hanks stars with Shelley Long in this devastatingly hilarious comedy romp from executive producer Steven Spielberg. Evicted from their Manhattan apartment, Walter and Anna (Hanks and Long) buy what looks like the home of their dreams – only to find themselves saddled with a bank-account-draining nightmare. Struggling to keep their relationship together as their rambling mansion falls to pieces around them, the two hapless homeowners watch in hilarious horror as everything – including the kitchen sink – disappears into The Money Pit. It’s an outrageously entertaining comedy for everyone who’s ever been deeply in love…or deeply in debt.Bonus Content:', 'The Making of The Money Pit', 'The Making of The Money Pit', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Romance, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, Dubbed', 'Contributor': 'Art Levinson, Richard Benjamin, Philip Bosco, Joe Mantegna, Steven Spielberg, Frank Marshall, Tom Hanks, Alexander Godunov, David Giler, Kathleen Kennedy, Shelley Long, Josh Mostel, Yakov Smirnoff, Maureen StapletonArt Levinson, Richard Benjamin, Philip Bosco, Joe Mantegna, Steven Spielberg, Frank Marshall, Tom Hanks, Alexander Godunov, David Giler, Kathleen Kennedy, Shelley Long, Josh Mostel, Yakov Smirnoff, Maureen Stapleton  See more', 'Initial release date': '2003-02-04', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), English (DTS 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '1020537', 'Director': 'Richard Benjamin', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, Dubbed', 'Run time': '1 hour and 31 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Tom Hanks, Shelley Long, Alexander Godunov, Maureen Stapleton, Joe Mantegna', 'Dubbed': 'Spanish, French', 'Producers': 'Frank Marshall, Kathleen Kennedy, Art Levinson, Steven Spielberg', 'Studio': 'Studio Distribution Services', 'Writers': 'David Giler', 'Number of discs': '1'}\nReview Text: The comedy classic that made \"Money Pit\" a household word when referring to house buying/remodeling trials that are the true test of any relationship.\nReview Title: True Test\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Adventures In Babysitting\nReview Date: 2018/09/02\nStore: Elisabeth Shue  (Actor),     Penelope Ann Miller  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', 'Chris Parker (Elisabeth Shue, THE KARATE KID, CALL TO GLORY) agrees to babysit after her \"dream\" date stands her up. Expecting a dull evening, Chris settles down with three kids for a night of TV ... and boredom. But when her frantic friend Brenda calls and pleads to be rescued from the bus station in downtown Chicago, the evening soon explodes into an endless whirl of hair-raising adventures! Babysitter and kids leave their safe suburban surroundings and head for the heart of the big city, never imagining how terrifyingly funny their expedition will become!', 'Amazon.com', 'Way', 'before she grabbed an Oscar nomination for her searing performance as a world-weary prostitute in', 'Leaving Las Vegas', \", Elisabeth Shue was known as one of the squeaky-clean actresses of the '80s. Having made a splash in\", 'The Karate Kid', \"and the '60s-nostalgia TV series\", 'Call to Glory', ', Shue cemented her good-girl reputation with the charming but badly titled', 'Adventures in Babysitting', \". Set in the John Hughes-style suburbs of Chicago, the titular adventures follow babysitter Chris (Shue), who agrees to watch the Anderson kids (Keith Coogan and Maia Brewton) when her boyfriend cancels their anniversary date. All is quiet on the home front until Chris is called upon to rescue her best friend (Penelope Ann Miller, also doing good-girl duty) from the seedy downtown bus station. She can't leave the kids, and she can't leave her friend alone in the big bad city, so she packs everyone in the station wagon and heads into Chicago. Screwball craziness begins as they encounter car thieves, knife-wielding gangs, gun-toting truck drivers, and, worst of all, Chris's duplicitous boyfriend. It's hardly mature entertainment, but Shue makes it work; when she wins over the audience at a blues club with her improv singing, you'll be won over, too. In his directorial debut, Chris Columbus (who later went on to helm the sap-fests\", 'Mrs. Doubtfire', 'and', 'Home Alone', \") gently skewers the suburbia white-bread mindset of the main characters, and plays up the comedy over the schmaltz with a subtlety of which he now seems incapable; the near romance between Shue and Coogan is played lightly and adorably. Look for brief appearances by art-house faves Lolita Davidovich as a college party girl and Vincent D'Onofrio as an unlikely savior.\", '--Mark Englehart']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Widescreen, Color, Dolby, NTSC, Closed-captioned', 'Contributor': \"Keith Coogan, George Newbern, Calvin Levels, David Simkins, Penelope Ann Miller, Lolita Davidovitch, Elisabeth Shue, Ron Canada, Maia Brewton, Allen Aarons, Bradley Whitford, Vincent  D'Onofrio, John Ford Noonan, John Chandler, Daniel Ziskie, Chris Columbus, Anthony RappKeith Coogan, George Newbern, Calvin Levels, David Simkins, Penelope Ann Miller, Lolita Davidovitch, Elisabeth Shue, Ron Canada, Maia Brewton, Allen Aarons, Bradley Whitford, Vincent  D'Onofrio, John Ford Noonan, John Chandler, Daniel Ziskie, Chris Columbus, Antho…   See more\", 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': 'MFR717951003300#VG', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Widescreen, Color, Dolby, NTSC, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'January 18, 2000', 'Actors': \"Elisabeth Shue, Penelope Ann Miller, Vincent  D'Onofrio, John Chandler, Keith Coogan\", 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'David Simkins', 'Number of discs': '1'}\nReview Text: Deceptively simple premise delivers loads of laughs in this light-hearted misadventure!\nReview Title: Entertaining Misadventure!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Death Becomes Her\nReview Date: 2018/09/02\nStore: Goldie Hawn  (Actor),     Bruce Willis  (Actor),     Robert Zemeckis  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Oscar®-winning actress Meryl Streep and Goldie Hawn star with Bruce Willis in Robert Zemeckis\\' outrageously entertaining comedy about greed, vanity, sex, immortality, life…and death. Isabella Rossellini is a beautiful enchantress who changes their lives—and deaths—forever in this hilarious dark comedy with ground-breaking special effects that the Chicago Tribune calls \"diabolically inventive.\"', 'Bonus Content:', 'Behind-the-Scenes', 'Behind-the-Scenes', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 103 min', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Full Screen', 'Run time': '1 hour and 43 minutes', 'Release date': 'February 27, 2007', 'Actors': 'Goldie Hawn, Bruce Willis, Meryl Streep, Isabella Rossellini', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Zemeckis, Steve Starkey', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Martin Donovan (I), David Koepp', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Two stellar ladies of Hollywood's A-List deliver such a truthful bit of black comedy that you will be both enthralled and appalled. Too true to be entirely funny, but hilarious at the same time.\nReview Title: Deliciously Dark Comedy\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: As Good As It Gets\nReview Date: 2018/09/02\nStore: Jack Nicholson  (Actor),     Helen Hunt  (Actor),     James L. Brooks  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Jack Nicholson, Helen Hunt, Greg Kinnear and Cuba Gooding, Jr., star in James L. Brooks' hit comedy,\", 'As Good as it Gets', \". Nicholson gives a show-stopping performance as Melvin Udall, an obsessive-compulsive novelist with Manhattan's meanest mouth. But when his neighbor Simon is hospitalized, Melvin is forced to babysit Simon's dog. And that unexpected act of kindness, along with waitress Carol Connelly, helps put Melvin back in the human race.\", 'Amazon.com', 'For all of its conventional plotting about an obsessive-compulsive curmudgeon (Jack Nicholson) who improves his personality at the urging of his gay neighbor (Greg Kinnear) and a waitress (Helen Hunt) who inspires his best behavior, this is one of the sharpest Hollywood comedies of the 1990s. Nicholson could play his role in his sleep (the Oscar he won should have gone to Robert Duvall for', 'The Apostle', \"), but his mischievous persona is precisely necessary to give heart to his seemingly heartless character, who is of all things a successful romance novelist. As a single mom with a chronically asthmatic young son, Hunt gives the film its conscience and integrity (along with plenty of wry humor), and she also won an Oscar for her wonderful performance. Greg Kinnear had to settle for an Oscar nomination (while cowriter-director James L. Brooks was inexplicably snubbed by Oscar that year), but his work was also singled out in the film's near-unanimous chorus of critical praise. It's questionable whether a romance between Hunt and the much older Nicholson is entirely believable, but this movie's smart enough--and charmingly funny enough--to make it seem endearingly possible.\", '--Jeff Shannon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, AnamorphicMultiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, Anamorphic   See more', 'Contributor': 'Greg Kinnear, Jesse James, Cuba Gooding Jr., Shirley Knight, Jack Nicholson, Helen Hunt, Harold Ramis, Old Friends Productions, Inc./Gracie, James L. Brooks, Bridget Johnson, Kristi Zea, Lupe Ontiveros, Skeet UlrichGreg Kinnear, Jesse James, Cuba Gooding Jr., Shirley Knight, Jack Nicholson, Helen Hunt, Harold Ramis, Old Friends Productions, Inc./Gracie, James L. Brooks, Bridget Johnson, Kristi Zea, Lupe Ontiveros, Skeet Ulrich   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 18 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396217096', 'Director': 'James L. Brooks', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, Anamorphic', 'Run time': '2 hours and 18 minutes', 'Release date': 'May 19, 1998', 'Actors': 'Jack Nicholson, Helen Hunt, Greg Kinnear, Cuba Gooding Jr., Skeet Ulrich', 'Subtitles': 'English, Spanish, French', 'Producers': 'Bridget Johnson, Kristi Zea, James L. Brooks', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: How is it possible that Jack Nicholson can be so disgusting and so winning at the same time!!? This truly is a movie that's hard to beat.\nReview Title: Hard to Beat\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The African Queen (Commemorative Box Set) [DVD]\nReview Date: 2018/09/02\nStore: Theodore Bikel  (Actor),     Humphrey Bogart  (Actor),     John Huston  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nAverage Rating: 4.8\nProduct Details: {'Format': 'Color, DVD, NTSC', 'Contributor': 'Peter Swanwick, Theodore Bikel, Katharine Hepburn, Humphrey Bogart, Gerald Onn, Richard Marner, Robert Morley, Walter Gotell, Peter Bull, John HustonPeter Swanwick, Theodore Bikel, Katharine Hepburn, Humphrey Bogart, Gerald Onn, Richard Marner, Robert Morley, Walter Gotell, Peter Bull, John Huston  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 45 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.6 x 5.6 x 1.1 inches; 13.6 Ounces', 'Director': 'John Huston', 'Media Format': 'Color, DVD, NTSC', 'Run time': '1 hour and 45 minutes', 'Actors': 'Theodore Bikel, Humphrey Bogart, Walter Gotell, Katharine Hepburn, Richard Marner', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nReview Text: No one's movie viewing is ever complete without having watched African Queen at least once! It's been a family favorite of ours through three or four generations now. Hollywood at its best when movies were truly classic.\nReview Title: An All-Time Winner\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Young in Heart\nJanet Gaynor  (Actor),     Douglas Fairbanks Jr.  (Actor),     Richard Wallace  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"Having been given the bum's rush at Monte Carlo, a clan of polished grifters (Janet Gaynor, Douglas Fairbanks, Jr., Roland Young, Billie Burke) make the fortuitous acquaintance of a wealthy and lonely old widow (Minnie Dupree) during a cross-continent train trip. Their plans to insinuate themselves in her life and sponge off of her wind up crashing on shoals of unaccustomed conscience, in this winning and warm comedy. Paulette Goddard, Richard Carlson, Henry Stephenson also star. 90 min. Standard; Soundtrack: English Dolby Digital mono; Subtitles: English; theatrical trailer.\"]\n{'Genre': 'Comedy', 'Format': 'Anamorphic, NTSC, Subtitled', 'Contributor': 'Roland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard WallaceRoland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard Wallace  See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Richard Wallace', 'Media Format': 'Anamorphic, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 9, 2018', 'Actors': 'Janet Gaynor, Douglas Fairbanks Jr., Paulette Goddard, Roland Young, Billie Burke', 'Subtitles': 'English', 'Studio': 'Kl Studio Classics', 'Number of discs': '1'}\nA precious old movie! Love the transformation that occurs in the con artist family. Optimistic story with positive, uplifting outcome.\nPrecious story, great stars!\nRomancing The Stone + The Jewel Of The Nile Set\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Romance\n['Actors: Michael Douglas, Kathleen Turner Directors: Danny DeVito Format: AC-3, Color Subtitles: French, Spanish Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.75 x 0.3 x 6 inches; 2.88 Ounces', 'Media Format': 'DVD', 'Subtitles': 'English'}\nTwo of my favorite movies. I like that both are on one DVD.\nTwo Favorites\nTwins\nArnold Schwarzenegger  (Actor),     Danny DeVito  (Actor),     Ivan Reitman  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Monthly Deals\n['Superstars Arnold Schwarzenegger and Danny DeVito team up for twice the laughs in this hilarious box-office blockbuster from director Ivan Reitman (Ghostbusters). An ambitious genetic experiment takes the wrong turn when two twins - who look nothing alike - are born and then separated. Years later, the unlikely siblings meet: Julius, a highly educated but sheltered giant with a big heart, and Vincent, a pint-sized hustler with an insatiable lust for women and money. With girlfriends in tow and a hitman on their tail, the newfound brothers set off on a wild, cross-country misadventure to find their mother - but end up finding out more about themselves.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Genre': 'Schwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & AdventureSchwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & Adventure  See more', 'Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Contributor': 'Trey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan ReitmanTrey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan Reitman  See more', 'Language': 'Spanish (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.33 Ounces', 'Item model number': 'Relay Time: 107 min', 'Director': 'Ivan Reitman', 'Media Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Run time': '1 hour and 47 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Arnold Schwarzenegger, Danny DeVito, Kelly Preston, Chloe Webb, Bonnie Bartlett', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Davies, William Osborne, Timothy Harris, Herschel Weingrod', 'Number of discs': '1'}\nStill a fun watch!\nFun Watch!\nThe American President / Dave\nMichael Douglas  (Actor),     Annette Bening  (Actor),     Frank Langella  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, Warner Sale\n['American President/Dave (DVD) (DBFE) (Multi-Title)', \"Michael Douglas and Kevin Kline are both President and accounted for in two hit comedies about the nation's Oval Office. Rob Reiner directs The American President [Side A], starring Douglas as a widower chief executive whose poll numbers plummet when he falls for an environmental lobbyist (Annette Bening). Martin Sheen, Michael J. Fox, Richard Dreyfuss and more top talents co-star in this nimble exploration of private romance in a public Presidency. And in a land where anybody can become President, anybody just did! Kline and Sigourney Weaver star in Dave [Side B], the wry Ivan Reitman-directed story of a lookalike who becomes a stand-in for the country's actual President. From coast to coast the votes are in:this double feature is a winner by a landslide!\", ']]>']\n{'Genre': 'Drama/Love & Romance', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Annette Bening, Frank Langella, Martin Sheen, Kevin Kline, Sigourney Weaver, Michael Douglas', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Item model number': 'WHV83767DVD', 'Director': 'Frank Langella', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'January 2, 2007', 'Actors': 'Michael Douglas, Annette Bening, Kevin Kline, Sigourney Weaver, Martin Sheen', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nTwo favorites, one dvd! Chances are if you like one you're going to like the other!\nGood buy\nCrocodile Dundee / Crocodile Dundee II Double Feature\nPaul Hogan  (Actor),     Linda Kozlowski  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n['A free spirited Australian croc hunter leaves the out back to visit America\\'s Big Apple and quickly finds a girlfriend accompanied by a huge pack of trouble waiting for him as \"down under\" takes on a whole new meaning in these two block busters.']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Paul Hogan, Linda Kozlowski', 'Language': 'English', 'Runtime': '3 hours and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Item model number': '170164', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 28 minutes', 'Release date': 'March 5, 2013', 'Actors': 'Paul Hogan, Linda Kozlowski', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '2'}\nStill fun features. Two on one dvd. Yay!\nTwo on one dvd\nHousesitter [DVD]\nSteve Martin  (Actor),     Goldie Hawn  (Actor),     Frank Oz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Steve Martin and Goldie Hawn star in this hilarious romantic comedy about the consequences of \"stretching\" the truth. When architect Newton Davis\\' girlfriend Becky (Dana Delany) turns down his marriage proposal, his newly-built dream house suddenly becomes nothing more than an empty monument to her rejection. That is, until a chance encounter with Gwen (Hawn) turns his life upside-down. Intrigued by Newton\\'s story, Gwen visits the house and decides to move in on her own. Resourceful and creative, Gwen is soon fixing up the house and charming Newton\\'s family and neighbors—and all the while passing herself off as his new wife! Gwen even befriends Becky, who begins to see a Newton she never knew existed. Horrified at the deception yet unable to stop it, Newton finds himself playing along with her preposterous stories, her attempts at reconciling differences within the family and her campaign for his promotion at work. Finally, he convinces Gwen to fabricate their \"divorce\" so he can still get married to Becky—until he has a change of heart. It\\'s a delightful, warmhearted and intelligent comedy from director Frank Oz.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Contributor': 'Goldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel CroninGoldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel Cronin   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Surround)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 102 min', 'Director': 'Frank Oz', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Steve Martin, Goldie Hawn, Dana Delany, Julie Harris, Donald Moffat', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Brian Grazer', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Mark Stein', 'Number of discs': '1'}\nA fun favorite! As only two masterful comedians can deliver!\nA fun favorite!\nWag the dog\nDustin Hoffman  (Actor),     Robert De Niro  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Wag The Dog (DVD)', 'Academy Award winners Robert De Niro and Dustin Hoffman star in a tale of politics, power and Hollywood so outrageous it could be true! Two weeks before re-election, the President of the United States (Michael Belson) is accused of accosting a girl scout. Before the news reaches the media, his advisors call in a political consultant (De Nireo) specializing in image rescues. What to do? Hire a Hollywood producer (Hoffman) to create a war--distracting public attention from the scandal and rallying Americans to their President in surge of patriotic ferver.', ']]>', 'Amazon.com', 'Not only was Barry Levinson\\'s comedy shot in a relatively fast period of 29 days, the satire of politics and show business feels as if it were made yesterday. There\\'s a fresh spin quite evident here, a nervy satire of a presidential crisis and the people who whitewash the facts. The main players are a mysterious Mr. Fix-It (Robert De Niro), veteran Hollywood producer (Dustin Hoffman), and a White House aide (Anne Heche). Can the president\\'s molesting of a young girl be buried in the two weeks before an election? A war in Albania just might do the trick. In the good old days, the president would just invade. With modern technology, it\\'s even cleaner. The hungry press looks for any lead, convenient misinformation is created by the latest Hollywood fakery (\"all developed by the new James Cameron film\") creating images and merchandise all instantly packaged. And it must be real, because it\\'s on TV. David Mamet\\'s script never questions the morals or the absolute secrecy needed to pull this thing off. He and director Barry Levinson have enough truth in the story to make you wonder what is real news and what is just promotion the next time you see CNN. Many of the supporting players impact the story with mere presence: Denis Leary as a quote man, Willie Nelson as a songwriter. The three leads are magnificent. With the similarities between history and this film,', 'Wag', 'will forever linked to the Monica Lewinsky saga. This video version contains a new minidocumentary focusing on the parallels of the film with the Bill Clinton scandal, including comments from director Barry Levinson and hosted by newsman Tom Brokaw.', '--Doug Thomas']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4908852', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 15, 2005', 'Actors': 'Dustin Hoffman, Robert De Niro, Anne Heche, Denis Leary, Willie Nelson', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'New Line', 'Country of Origin': 'USA', 'Number of discs': '1'}\nExplains perfectly what's going on with the media and political manipulation of this country. Intended as satire, it's a little too close to the truth for comfort! Amusing and effective in its storytelling. Masterful execution of a plot that should make you shudder. Will get you to thinking for sure!\nMore Bite Than Bark\nGuarding Tess\nNicolas Cage  (Actor),     Shirley MacLaine  (Actor),     Hugh Wilson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['What do you do with a former First Lady who\\'s unpredictable, ornery and impossible to please? Anything she wants! Shirley MacLaine and Nicolas Cage star in this comic, compassionate look at life after the White House for two former Washington insiders: First Lady Tess Carlisle and Secret Service agent Doug Chesnic. As uproarious as it is uplifting, GUARDING TESS is \"a grand mixture of laughter and tears.\" Gary Franklin, KCOP-TV']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 95 min', 'Director': 'Hugh Wilson', 'Media Format': 'Color, Multiple Formats, NTSC, Closed-captioned, Full Screen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 7, 1998', 'Actors': 'Nicolas Cage, Shirley MacLaine, Austin Pendleton, Edward Albert, James Redhorn', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Nancy Tanen, Ned Tanen', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nStill one of the greats. Representing some of the best acting from two Hollywood icons. Great storytelling!\nGreat! Masterful Storytelling!\nDavy Crockett -Two Movie Set\nFess Parker  (Actor),     Buddy Ebsen  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n[\"Put on your coonskin cap and get set to travel back to the days when the nation was young and its roads were paved with nothing but action and adventure! It was a big country -- full of bold dreams, larger-than-life characters and an untamed frontier that stretched farther than the eye could see. And now, for the first time ever, a legend comes to life as Davy Crockett makes his Blu-ray debut in two of Disney's best-loved classics: DAVY CROCKETT, KING OF THE WILD FRONTIER and DAVE CROCKETT AND THE RIVER PIRATES. Celebrate the 60th Anniversary of the tales that~introduced America to one of its most fearless folk heroes.\"]\n{'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Jeff York, Fess Parker, Buddy Ebsen', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '2 hours and 54 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': '786936232110', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 54 minutes', 'Release date': 'September 7, 2004', 'Actors': 'Fess Parker, Buddy Ebsen, Jeff York', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nStill holds up well. Disney charm. Family viewing. Delightful!\nDelightful and Charming\nPhenomenon\nJohn Travolta  (Actor),     Kyra Sedgwick  (Actor),     Jon Turteltaub  (Director),     Phedon Papamichael  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Hollywood favorite John Travolta (SWORDFISH, PULP FICTION) stars in this acclaimed, uplifting story of an ordinary man transformed by extraordinary events! On the night of his 37th birthday, George Malley (Travolta) is knocked to the ground by a mysterious, blinding light and suddenly develops amazing mental abilities! With his newfound knowledge, George astounds everyone in town. But when his incredible powers cause even his oldest friends to turn away, George comes to realize that his wondrous experience has changed him and the lives of everyone around him forever. With an outstanding supporting cast featuring Robert Duvall (SOMETHING TO TALK ABOUT), Forest Whitaker (SPECIES), and Kyra Sedgwick (SINGLES) -- don't miss this must-see motion picture event!\"]\n{'Genre': 'TRAVOLTA, Drama, JOHN', 'Format': 'NTSC, Subtitled, Multiple Formats, Widescreen, Closed-captioned, Letterboxed, Dolby, Color', 'Contributor': \"Kyra Sedgwick, Tony Genaro, Forest Whitaker, Robert Duvall, Brent Spiner, Michael Milhoan, Jon Turteltaub, Bruce A. Young, Vyto Ruginis, Jeffrey Demunn, Richard Kiley, Gerald DiPego, Phedon Papamichael, Sean O'Bryan, Ashley Buccille, Troy Evans, David Gallagher, John TravoltaKyra Sedgwick, Tony Genaro, Forest Whitaker, Robert Duvall, Brent Spiner, Michael Milhoan, Jon Turteltaub, Bruce A. Young, Vyto Ruginis, Jeffrey Demunn, Richard Kiley, Gerald DiPego, Phedon Papamichael, Sean O'Bryan, Ashley Buccille, Troy Evans, David Gallagher, John Trav…   See more\", 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '1308100', 'Director': 'Jon Turteltaub, Phedon Papamichael', 'Media Format': 'NTSC, Subtitled, Multiple Formats, Widescreen, Closed-captioned, Letterboxed, Dolby, Color', 'Run time': '2 hours and 3 minutes', 'Release date': 'December 3, 1997', 'Actors': 'John Travolta, Kyra Sedgwick, Forest Whitaker, Robert Duvall, Jeffrey Demunn', 'Subtitles': 'Spanish', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Gerald DiPego', 'Number of discs': '1'}\nStill one of the greats in filmmaking! Two exceptional stars in performances of a lifetime.\nExceptional!\nTrue Lies\nArnold Schwarzenegger  (Actor),     Jamie Lee Curtis  (Actor),     James Cameron  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['A Washington wife discovers her computer-salesman husband is a spy out to stop nuclear terrorists.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Charlton Heston, Art Malik, Eliza Dushku, Tia Carrere, Bill Paxton, Grant Heslov, Tom Arnold, Jamie Lee Curtis, Marshall Manesh, Simon Michal, Dieter Rauter, Arnold Schwarzenegger, Claude Zidi, Didier Kaminka, James Allen, James CameronCharlton Heston, Art Malik, Eliza Dushku, Tia Carrere, Bill Paxton, Grant Heslov, Tom Arnold, Jamie Lee Curtis, Marshall Manesh, Simon Michal, Dieter Rauter, Arnold Schwarzenegger, Claude Zidi, Didier Kaminka, James Allen, James Cameron   See more', 'Language': 'English (Dolby Surround), French (Dolby Surround), Spanish (Dolby Surround), Unqualified', 'Runtime': '2 hours and 21 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4116268', 'Director': 'James Cameron', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 21 minutes', 'Release date': 'January 1, 2012', 'Actors': 'Arnold Schwarzenegger, Jamie Lee Curtis, Tom Arnold, Bill Paxton, Tia Carrere', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Claude Zidi, Didier Kaminka, James Cameron, Simon Michal', 'Number of discs': '1'}\nFun viewing!\nFun viewing!\nThe Money Pit\nTom Hanks  (Actor),     Shelley Long  (Actor),     Richard Benjamin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Two-time Oscar winner Tom Hanks stars with Shelley Long in this devastatingly hilarious comedy romp from executive producer Steven Spielberg. Evicted from their Manhattan apartment, Walter and Anna (Hanks and Long) buy what looks like the home of their dreams – only to find themselves saddled with a bank-account-draining nightmare. Struggling to keep their relationship together as their rambling mansion falls to pieces around them, the two hapless homeowners watch in hilarious horror as everything – including the kitchen sink – disappears into The Money Pit. It’s an outrageously entertaining comedy for everyone who’s ever been deeply in love…or deeply in debt.Bonus Content:', 'The Making of The Money Pit', 'The Making of The Money Pit', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\n{'Genre': 'Kids & Family, Romance, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, Dubbed', 'Contributor': 'Art Levinson, Richard Benjamin, Philip Bosco, Joe Mantegna, Steven Spielberg, Frank Marshall, Tom Hanks, Alexander Godunov, David Giler, Kathleen Kennedy, Shelley Long, Josh Mostel, Yakov Smirnoff, Maureen StapletonArt Levinson, Richard Benjamin, Philip Bosco, Joe Mantegna, Steven Spielberg, Frank Marshall, Tom Hanks, Alexander Godunov, David Giler, Kathleen Kennedy, Shelley Long, Josh Mostel, Yakov Smirnoff, Maureen Stapleton  See more', 'Initial release date': '2003-02-04', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), English (DTS 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '1020537', 'Director': 'Richard Benjamin', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, Dubbed', 'Run time': '1 hour and 31 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Tom Hanks, Shelley Long, Alexander Godunov, Maureen Stapleton, Joe Mantegna', 'Dubbed': 'Spanish, French', 'Producers': 'Frank Marshall, Kathleen Kennedy, Art Levinson, Steven Spielberg', 'Studio': 'Studio Distribution Services', 'Writers': 'David Giler', 'Number of discs': '1'}\nThe comedy classic that made \"Money Pit\" a household word when referring to house buying/remodeling trials that are the true test of any relationship.\nTrue Test\nAdventures In Babysitting\nElisabeth Shue  (Actor),     Penelope Ann Miller  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', 'Chris Parker (Elisabeth Shue, THE KARATE KID, CALL TO GLORY) agrees to babysit after her \"dream\" date stands her up. Expecting a dull evening, Chris settles down with three kids for a night of TV ... and boredom. But when her frantic friend Brenda calls and pleads to be rescued from the bus station in downtown Chicago, the evening soon explodes into an endless whirl of hair-raising adventures! Babysitter and kids leave their safe suburban surroundings and head for the heart of the big city, never imagining how terrifyingly funny their expedition will become!', 'Amazon.com', 'Way', 'before she grabbed an Oscar nomination for her searing performance as a world-weary prostitute in', 'Leaving Las Vegas', \", Elisabeth Shue was known as one of the squeaky-clean actresses of the '80s. Having made a splash in\", 'The Karate Kid', \"and the '60s-nostalgia TV series\", 'Call to Glory', ', Shue cemented her good-girl reputation with the charming but badly titled', 'Adventures in Babysitting', \". Set in the John Hughes-style suburbs of Chicago, the titular adventures follow babysitter Chris (Shue), who agrees to watch the Anderson kids (Keith Coogan and Maia Brewton) when her boyfriend cancels their anniversary date. All is quiet on the home front until Chris is called upon to rescue her best friend (Penelope Ann Miller, also doing good-girl duty) from the seedy downtown bus station. She can't leave the kids, and she can't leave her friend alone in the big bad city, so she packs everyone in the station wagon and heads into Chicago. Screwball craziness begins as they encounter car thieves, knife-wielding gangs, gun-toting truck drivers, and, worst of all, Chris's duplicitous boyfriend. It's hardly mature entertainment, but Shue makes it work; when she wins over the audience at a blues club with her improv singing, you'll be won over, too. In his directorial debut, Chris Columbus (who later went on to helm the sap-fests\", 'Mrs. Doubtfire', 'and', 'Home Alone', \") gently skewers the suburbia white-bread mindset of the main characters, and plays up the comedy over the schmaltz with a subtlety of which he now seems incapable; the near romance between Shue and Coogan is played lightly and adorably. Look for brief appearances by art-house faves Lolita Davidovich as a college party girl and Vincent D'Onofrio as an unlikely savior.\", '--Mark Englehart']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Widescreen, Color, Dolby, NTSC, Closed-captioned', 'Contributor': \"Keith Coogan, George Newbern, Calvin Levels, David Simkins, Penelope Ann Miller, Lolita Davidovitch, Elisabeth Shue, Ron Canada, Maia Brewton, Allen Aarons, Bradley Whitford, Vincent  D'Onofrio, John Ford Noonan, John Chandler, Daniel Ziskie, Chris Columbus, Anthony RappKeith Coogan, George Newbern, Calvin Levels, David Simkins, Penelope Ann Miller, Lolita Davidovitch, Elisabeth Shue, Ron Canada, Maia Brewton, Allen Aarons, Bradley Whitford, Vincent  D'Onofrio, John Ford Noonan, John Chandler, Daniel Ziskie, Chris Columbus, Antho…   See more\", 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': 'MFR717951003300#VG', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Widescreen, Color, Dolby, NTSC, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'January 18, 2000', 'Actors': \"Elisabeth Shue, Penelope Ann Miller, Vincent  D'Onofrio, John Chandler, Keith Coogan\", 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'David Simkins', 'Number of discs': '1'}\nDeceptively simple premise delivers loads of laughs in this light-hearted misadventure!\nEntertaining Misadventure!\nDeath Becomes Her\nGoldie Hawn  (Actor),     Bruce Willis  (Actor),     Robert Zemeckis  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Oscar®-winning actress Meryl Streep and Goldie Hawn star with Bruce Willis in Robert Zemeckis\\' outrageously entertaining comedy about greed, vanity, sex, immortality, life…and death. Isabella Rossellini is a beautiful enchantress who changes their lives—and deaths—forever in this hilarious dark comedy with ground-breaking special effects that the Chicago Tribune calls \"diabolically inventive.\"', 'Bonus Content:', 'Behind-the-Scenes', 'Behind-the-Scenes', ']]>']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 103 min', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Full Screen', 'Run time': '1 hour and 43 minutes', 'Release date': 'February 27, 2007', 'Actors': 'Goldie Hawn, Bruce Willis, Meryl Streep, Isabella Rossellini', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Zemeckis, Steve Starkey', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Martin Donovan (I), David Koepp', 'Country of Origin': 'USA', 'Number of discs': '1'}\nTwo stellar ladies of Hollywood's A-List deliver such a truthful bit of black comedy that you will be both enthralled and appalled. Too true to be entirely funny, but hilarious at the same time.\nDeliciously Dark Comedy\nAs Good As It Gets\nJack Nicholson  (Actor),     Helen Hunt  (Actor),     James L. Brooks  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Jack Nicholson, Helen Hunt, Greg Kinnear and Cuba Gooding, Jr., star in James L. Brooks' hit comedy,\", 'As Good as it Gets', \". Nicholson gives a show-stopping performance as Melvin Udall, an obsessive-compulsive novelist with Manhattan's meanest mouth. But when his neighbor Simon is hospitalized, Melvin is forced to babysit Simon's dog. And that unexpected act of kindness, along with waitress Carol Connelly, helps put Melvin back in the human race.\", 'Amazon.com', 'For all of its conventional plotting about an obsessive-compulsive curmudgeon (Jack Nicholson) who improves his personality at the urging of his gay neighbor (Greg Kinnear) and a waitress (Helen Hunt) who inspires his best behavior, this is one of the sharpest Hollywood comedies of the 1990s. Nicholson could play his role in his sleep (the Oscar he won should have gone to Robert Duvall for', 'The Apostle', \"), but his mischievous persona is precisely necessary to give heart to his seemingly heartless character, who is of all things a successful romance novelist. As a single mom with a chronically asthmatic young son, Hunt gives the film its conscience and integrity (along with plenty of wry humor), and she also won an Oscar for her wonderful performance. Greg Kinnear had to settle for an Oscar nomination (while cowriter-director James L. Brooks was inexplicably snubbed by Oscar that year), but his work was also singled out in the film's near-unanimous chorus of critical praise. It's questionable whether a romance between Hunt and the much older Nicholson is entirely believable, but this movie's smart enough--and charmingly funny enough--to make it seem endearingly possible.\", '--Jeff Shannon']\n{'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, AnamorphicMultiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, Anamorphic   See more', 'Contributor': 'Greg Kinnear, Jesse James, Cuba Gooding Jr., Shirley Knight, Jack Nicholson, Helen Hunt, Harold Ramis, Old Friends Productions, Inc./Gracie, James L. Brooks, Bridget Johnson, Kristi Zea, Lupe Ontiveros, Skeet UlrichGreg Kinnear, Jesse James, Cuba Gooding Jr., Shirley Knight, Jack Nicholson, Helen Hunt, Harold Ramis, Old Friends Productions, Inc./Gracie, James L. Brooks, Bridget Johnson, Kristi Zea, Lupe Ontiveros, Skeet Ulrich   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 18 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396217096', 'Director': 'James L. Brooks', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, Anamorphic', 'Run time': '2 hours and 18 minutes', 'Release date': 'May 19, 1998', 'Actors': 'Jack Nicholson, Helen Hunt, Greg Kinnear, Cuba Gooding Jr., Skeet Ulrich', 'Subtitles': 'English, Spanish, French', 'Producers': 'Bridget Johnson, Kristi Zea, James L. Brooks', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nHow is it possible that Jack Nicholson can be so disgusting and so winning at the same time!!? This truly is a movie that's hard to beat.\nHard to Beat\nThe African Queen (Commemorative Box Set) [DVD]\nTheodore Bikel  (Actor),     Humphrey Bogart  (Actor),     John Huston  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Action & Adventure\n{'Format': 'Color, DVD, NTSC', 'Contributor': 'Peter Swanwick, Theodore Bikel, Katharine Hepburn, Humphrey Bogart, Gerald Onn, Richard Marner, Robert Morley, Walter Gotell, Peter Bull, John HustonPeter Swanwick, Theodore Bikel, Katharine Hepburn, Humphrey Bogart, Gerald Onn, Richard Marner, Robert Morley, Walter Gotell, Peter Bull, John Huston  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 45 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.6 x 5.6 x 1.1 inches; 13.6 Ounces', 'Director': 'John Huston', 'Media Format': 'Color, DVD, NTSC', 'Run time': '1 hour and 45 minutes', 'Actors': 'Theodore Bikel, Humphrey Bogart, Walter Gotell, Katharine Hepburn, Richard Marner', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nNo one's movie viewing is ever complete without having watched African Queen at least once! It's been a family favorite of ours through three or four generations now. Hollywood at its best when movies were truly classic.\nAn All-Time Winner",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: The Young in Heart\nReview Date: 2018/09/02\nStore: Janet Gaynor  (Actor),     Douglas Fairbanks Jr.  (Actor),     Richard Wallace  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: [\"Having been given the bum's rush at Monte Carlo, a clan of polished grifters (Janet Gaynor, Douglas Fairbanks, Jr., Roland Young, Billie Burke) make the fortuitous acquaintance of a wealthy and lonely old widow (Minnie Dupree) during a cross-continent train trip. Their plans to insinuate themselves in her life and sponge off of her wind up crashing on shoals of unaccustomed conscience, in this winning and warm comedy. Paulette Goddard, Richard Carlson, Henry Stephenson also star. 90 min. Standard; Soundtrack: English Dolby Digital mono; Subtitles: English; theatrical trailer.\"]\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Comedy', 'Format': 'Anamorphic, NTSC, Subtitled', 'Contributor': 'Roland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard WallaceRoland Young, Douglas Fairbanks Jr., Billie Burke, Richard Carlson, Paulette Goddard, Janet Gaynor, Richard Wallace  See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Richard Wallace', 'Media Format': 'Anamorphic, NTSC, Subtitled', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 9, 2018', 'Actors': 'Janet Gaynor, Douglas Fairbanks Jr., Paulette Goddard, Roland Young, Billie Burke', 'Subtitles': 'English', 'Studio': 'Kl Studio Classics', 'Number of discs': '1'}\nReview Text: A precious old movie! Love the transformation that occurs in the con artist family. Optimistic story with positive, uplifting outcome.\nReview Title: Precious story, great stars!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Romancing The Stone + The Jewel Of The Nile Set\nReview Date: 2018/09/02\nStore: Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Romance\nProduct Description: ['Actors: Michael Douglas, Kathleen Turner Directors: Danny DeVito Format: AC-3, Color Subtitles: French, Spanish Region: Region 1 (U.S. and Canada only. Read more about DVD formats.)']\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.75 x 0.3 x 6 inches; 2.88 Ounces', 'Media Format': 'DVD', 'Subtitles': 'English'}\nReview Text: Two of my favorite movies. I like that both are on one DVD.\nReview Title: Two Favorites\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Twins\nReview Date: 2018/09/02\nStore: Arnold Schwarzenegger  (Actor),     Danny DeVito  (Actor),     Ivan Reitman  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Monthly Deals\nProduct Description: ['Superstars Arnold Schwarzenegger and Danny DeVito team up for twice the laughs in this hilarious box-office blockbuster from director Ivan Reitman (Ghostbusters). An ambitious genetic experiment takes the wrong turn when two twins - who look nothing alike - are born and then separated. Years later, the unlikely siblings meet: Julius, a highly educated but sheltered giant with a big heart, and Vincent, a pint-sized hustler with an insatiable lust for women and money. With girlfriends in tow and a hitman on their tail, the newfound brothers set off on a wild, cross-country misadventure to find their mother - but end up finding out more about themselves.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Schwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & AdventureSchwarzenegger comedy, DVD Movie, Arnold Schwarzenegger Danny Devito movie, Blu-ray Movie, Comedy, Action & Adventure  See more', 'Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Contributor': 'Trey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan ReitmanTrey Wilson, Herschel Weingrod, David Caruso, Marshall Bell, Bonnie Bartlett, Kelly Preston, Chloe Webb, William Davies, Arnold Schwarzenegger, Timothy Harris, William Osborne, Danny DeVito, Ivan Reitman  See more', 'Language': 'Spanish (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 47 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.33 Ounces', 'Item model number': 'Relay Time: 107 min', 'Director': 'Ivan Reitman', 'Media Format': 'Color, Dolby, Full Screen, NTSC, Multiple Formats', 'Run time': '1 hour and 47 minutes', 'Release date': 'July 6, 2010', 'Actors': 'Arnold Schwarzenegger, Danny DeVito, Kelly Preston, Chloe Webb, Bonnie Bartlett', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Davies, William Osborne, Timothy Harris, Herschel Weingrod', 'Number of discs': '1'}\nReview Text: Still a fun watch!\nReview Title: Fun Watch!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The American President / Dave\nReview Date: 2018/09/02\nStore: Michael Douglas  (Actor),     Annette Bening  (Actor),     Frank Langella  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, Warner Sale\nProduct Description: ['American President/Dave (DVD) (DBFE) (Multi-Title)', \"Michael Douglas and Kevin Kline are both President and accounted for in two hit comedies about the nation's Oval Office. Rob Reiner directs The American President [Side A], starring Douglas as a widower chief executive whose poll numbers plummet when he falls for an environmental lobbyist (Annette Bening). Martin Sheen, Michael J. Fox, Richard Dreyfuss and more top talents co-star in this nimble exploration of private romance in a public Presidency. And in a land where anybody can become President, anybody just did! Kline and Sigourney Weaver star in Dave [Side B], the wry Ivan Reitman-directed story of a lookalike who becomes a stand-in for the country's actual President. From coast to coast the votes are in:this double feature is a winner by a landslide!\", ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama/Love & Romance', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Annette Bening, Frank Langella, Martin Sheen, Kevin Kline, Sigourney Weaver, Michael Douglas', 'Language': 'English (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.40:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.71 Ounces', 'Item model number': 'WHV83767DVD', 'Director': 'Frank Langella', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'January 2, 2007', 'Actors': 'Michael Douglas, Annette Bening, Kevin Kline, Sigourney Weaver, Martin Sheen', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: Two favorites, one dvd! Chances are if you like one you're going to like the other!\nReview Title: Good buy\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Crocodile Dundee / Crocodile Dundee II Double Feature\nReview Date: 2018/09/02\nStore: Paul Hogan  (Actor),     Linda Kozlowski  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nProduct Description: ['A free spirited Australian croc hunter leaves the out back to visit America\\'s Big Apple and quickly finds a girlfriend accompanied by a huge pack of trouble waiting for him as \"down under\" takes on a whole new meaning in these two block busters.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy, Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Paul Hogan, Linda Kozlowski', 'Language': 'English', 'Runtime': '3 hours and 28 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.96 Ounces', 'Item model number': '170164', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '3 hours and 28 minutes', 'Release date': 'March 5, 2013', 'Actors': 'Paul Hogan, Linda Kozlowski', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '2'}\nReview Text: Still fun features. Two on one dvd. Yay!\nReview Title: Two on one dvd\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Housesitter [DVD]\nReview Date: 2018/09/02\nStore: Steve Martin  (Actor),     Goldie Hawn  (Actor),     Frank Oz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Comedy\nProduct Description: ['Steve Martin and Goldie Hawn star in this hilarious romantic comedy about the consequences of \"stretching\" the truth. When architect Newton Davis\\' girlfriend Becky (Dana Delany) turns down his marriage proposal, his newly-built dream house suddenly becomes nothing more than an empty monument to her rejection. That is, until a chance encounter with Gwen (Hawn) turns his life upside-down. Intrigued by Newton\\'s story, Gwen visits the house and decides to move in on her own. Resourceful and creative, Gwen is soon fixing up the house and charming Newton\\'s family and neighbors—and all the while passing herself off as his new wife! Gwen even befriends Becky, who begins to see a Newton she never knew existed. Horrified at the deception yet unable to stop it, Newton finds himself playing along with her preposterous stories, her attempts at reconciling differences within the family and her campaign for his promotion at work. Finally, he convinces Gwen to fabricate their \"divorce\" so he can still get married to Becky—until he has a change of heart. It\\'s a delightful, warmhearted and intelligent comedy from director Frank Oz.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Contributor': 'Goldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel CroninGoldie Hawn, Julie Harris, Richard B. Shull, Roy Cooper, Frank Oz, Donald Moffat, Peter MacNicol, Steve Martin, Brian Grazer, Dana Delany, Mark Stein, Laurel Cronin   See more', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Surround)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 102 min', 'Director': 'Frank Oz', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Anamorphic, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Steve Martin, Goldie Hawn, Dana Delany, Julie Harris, Donald Moffat', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Brian Grazer', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Mark Stein', 'Number of discs': '1'}\nReview Text: A fun favorite! As only two masterful comedians can deliver!\nReview Title: A fun favorite!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wag the dog\nReview Date: 2018/09/02\nStore: Dustin Hoffman  (Actor),     Robert De Niro  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'Wag The Dog (DVD)', 'Academy Award winners Robert De Niro and Dustin Hoffman star in a tale of politics, power and Hollywood so outrageous it could be true! Two weeks before re-election, the President of the United States (Michael Belson) is accused of accosting a girl scout. Before the news reaches the media, his advisors call in a political consultant (De Nireo) specializing in image rescues. What to do? Hire a Hollywood producer (Hoffman) to create a war--distracting public attention from the scandal and rallying Americans to their President in surge of patriotic ferver.', ']]>', 'Amazon.com', 'Not only was Barry Levinson\\'s comedy shot in a relatively fast period of 29 days, the satire of politics and show business feels as if it were made yesterday. There\\'s a fresh spin quite evident here, a nervy satire of a presidential crisis and the people who whitewash the facts. The main players are a mysterious Mr. Fix-It (Robert De Niro), veteran Hollywood producer (Dustin Hoffman), and a White House aide (Anne Heche). Can the president\\'s molesting of a young girl be buried in the two weeks before an election? A war in Albania just might do the trick. In the good old days, the president would just invade. With modern technology, it\\'s even cleaner. The hungry press looks for any lead, convenient misinformation is created by the latest Hollywood fakery (\"all developed by the new James Cameron film\") creating images and merchandise all instantly packaged. And it must be real, because it\\'s on TV. David Mamet\\'s script never questions the morals or the absolute secrecy needed to pull this thing off. He and director Barry Levinson have enough truth in the story to make you wonder what is real news and what is just promotion the next time you see CNN. Many of the supporting players impact the story with mere presence: Denis Leary as a quote man, Willie Nelson as a songwriter. The three leads are magnificent. With the similarities between history and this film,', 'Wag', 'will forever linked to the Monica Lewinsky saga. This video version contains a new minidocumentary focusing on the parallels of the film with the Bill Clinton scandal, including comments from director Barry Levinson and hosted by newsman Tom Brokaw.', '--Doug Thomas']\nAverage Rating: 4.5\nProduct Details: {'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4908852', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 15, 2005', 'Actors': 'Dustin Hoffman, Robert De Niro, Anne Heche, Denis Leary, Willie Nelson', 'Dubbed': 'French', 'Subtitles': 'French, English, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Studio': 'New Line', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Explains perfectly what's going on with the media and political manipulation of this country. Intended as satire, it's a little too close to the truth for comfort! Amusing and effective in its storytelling. Masterful execution of a plot that should make you shudder. Will get you to thinking for sure!\nReview Title: More Bite Than Bark\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Guarding Tess\nReview Date: 2018/09/02\nStore: Nicolas Cage  (Actor),     Shirley MacLaine  (Actor),     Hugh Wilson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['What do you do with a former First Lady who\\'s unpredictable, ornery and impossible to please? Anything she wants! Shirley MacLaine and Nicolas Cage star in this comic, compassionate look at life after the White House for two former Washington insiders: First Lady Tess Carlisle and Secret Service agent Doug Chesnic. As uproarious as it is uplifting, GUARDING TESS is \"a grand mixture of laughter and tears.\" Gary Franklin, KCOP-TV']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 95 min', 'Director': 'Hugh Wilson', 'Media Format': 'Color, Multiple Formats, NTSC, Closed-captioned, Full Screen', 'Run time': '1 hour and 35 minutes', 'Release date': 'April 7, 1998', 'Actors': 'Nicolas Cage, Shirley MacLaine, Austin Pendleton, Edward Albert, James Redhorn', 'Dubbed': 'Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Nancy Tanen, Ned Tanen', 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 2.0 Stereo), English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Still one of the greats. Representing some of the best acting from two Hollywood icons. Great storytelling!\nReview Title: Great! Masterful Storytelling!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Davy Crockett -Two Movie Set\nReview Date: 2018/09/02\nStore: Fess Parker  (Actor),     Buddy Ebsen  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\nProduct Description: [\"Put on your coonskin cap and get set to travel back to the days when the nation was young and its roads were paved with nothing but action and adventure! It was a big country -- full of bold dreams, larger-than-life characters and an untamed frontier that stretched farther than the eye could see. And now, for the first time ever, a legend comes to life as Davy Crockett makes his Blu-ray debut in two of Disney's best-loved classics: DAVY CROCKETT, KING OF THE WILD FRONTIER and DAVE CROCKETT AND THE RIVER PIRATES. Celebrate the 60th Anniversary of the tales that~introduced America to one of its most fearless folk heroes.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action/Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Jeff York, Fess Parker, Buddy Ebsen', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '2 hours and 54 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': '786936232110', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '2 hours and 54 minutes', 'Release date': 'September 7, 2004', 'Actors': 'Fess Parker, Buddy Ebsen, Jeff York', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Still holds up well. Disney charm. Family viewing. Delightful!\nReview Title: Delightful and Charming\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Phenomenon\nReview Date: 2018/09/02\nStore: John Travolta  (Actor),     Kyra Sedgwick  (Actor),     Jon Turteltaub  (Director),     Phedon Papamichael  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Drama\nProduct Description: [\"Hollywood favorite John Travolta (SWORDFISH, PULP FICTION) stars in this acclaimed, uplifting story of an ordinary man transformed by extraordinary events! On the night of his 37th birthday, George Malley (Travolta) is knocked to the ground by a mysterious, blinding light and suddenly develops amazing mental abilities! With his newfound knowledge, George astounds everyone in town. But when his incredible powers cause even his oldest friends to turn away, George comes to realize that his wondrous experience has changed him and the lives of everyone around him forever. With an outstanding supporting cast featuring Robert Duvall (SOMETHING TO TALK ABOUT), Forest Whitaker (SPECIES), and Kyra Sedgwick (SINGLES) -- don't miss this must-see motion picture event!\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'TRAVOLTA, Drama, JOHN', 'Format': 'NTSC, Subtitled, Multiple Formats, Widescreen, Closed-captioned, Letterboxed, Dolby, Color', 'Contributor': \"Kyra Sedgwick, Tony Genaro, Forest Whitaker, Robert Duvall, Brent Spiner, Michael Milhoan, Jon Turteltaub, Bruce A. Young, Vyto Ruginis, Jeffrey Demunn, Richard Kiley, Gerald DiPego, Phedon Papamichael, Sean O'Bryan, Ashley Buccille, Troy Evans, David Gallagher, John TravoltaKyra Sedgwick, Tony Genaro, Forest Whitaker, Robert Duvall, Brent Spiner, Michael Milhoan, Jon Turteltaub, Bruce A. Young, Vyto Ruginis, Jeffrey Demunn, Richard Kiley, Gerald DiPego, Phedon Papamichael, Sean O'Bryan, Ashley Buccille, Troy Evans, David Gallagher, John Trav…   See more\", 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': '1308100', 'Director': 'Jon Turteltaub, Phedon Papamichael', 'Media Format': 'NTSC, Subtitled, Multiple Formats, Widescreen, Closed-captioned, Letterboxed, Dolby, Color', 'Run time': '2 hours and 3 minutes', 'Release date': 'December 3, 1997', 'Actors': 'John Travolta, Kyra Sedgwick, Forest Whitaker, Robert Duvall, Jeffrey Demunn', 'Subtitles': 'Spanish', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Gerald DiPego', 'Number of discs': '1'}\nReview Text: Still one of the greats in filmmaking! Two exceptional stars in performances of a lifetime.\nReview Title: Exceptional!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: True Lies\nReview Date: 2018/09/02\nStore: Arnold Schwarzenegger  (Actor),     Jamie Lee Curtis  (Actor),     James Cameron  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['A Washington wife discovers her computer-salesman husband is a spy out to stop nuclear terrorists.']\nAverage Rating: 4.5\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Charlton Heston, Art Malik, Eliza Dushku, Tia Carrere, Bill Paxton, Grant Heslov, Tom Arnold, Jamie Lee Curtis, Marshall Manesh, Simon Michal, Dieter Rauter, Arnold Schwarzenegger, Claude Zidi, Didier Kaminka, James Allen, James CameronCharlton Heston, Art Malik, Eliza Dushku, Tia Carrere, Bill Paxton, Grant Heslov, Tom Arnold, Jamie Lee Curtis, Marshall Manesh, Simon Michal, Dieter Rauter, Arnold Schwarzenegger, Claude Zidi, Didier Kaminka, James Allen, James Cameron   See more', 'Language': 'English (Dolby Surround), French (Dolby Surround), Spanish (Dolby Surround), Unqualified', 'Runtime': '2 hours and 21 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '4116268', 'Director': 'James Cameron', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 21 minutes', 'Release date': 'January 1, 2012', 'Actors': 'Arnold Schwarzenegger, Jamie Lee Curtis, Tom Arnold, Bill Paxton, Tia Carrere', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Claude Zidi, Didier Kaminka, James Cameron, Simon Michal', 'Number of discs': '1'}\nReview Text: Fun viewing!\nReview Title: Fun viewing!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Money Pit\nReview Date: 2018/09/02\nStore: Tom Hanks  (Actor),     Shelley Long  (Actor),     Richard Benjamin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, DTS\nProduct Description: ['Two-time Oscar winner Tom Hanks stars with Shelley Long in this devastatingly hilarious comedy romp from executive producer Steven Spielberg. Evicted from their Manhattan apartment, Walter and Anna (Hanks and Long) buy what looks like the home of their dreams – only to find themselves saddled with a bank-account-draining nightmare. Struggling to keep their relationship together as their rambling mansion falls to pieces around them, the two hapless homeowners watch in hilarious horror as everything – including the kitchen sink – disappears into The Money Pit. It’s an outrageously entertaining comedy for everyone who’s ever been deeply in love…or deeply in debt.Bonus Content:', 'The Making of The Money Pit', 'The Making of The Money Pit', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Kids & Family, Romance, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, Dubbed', 'Contributor': 'Art Levinson, Richard Benjamin, Philip Bosco, Joe Mantegna, Steven Spielberg, Frank Marshall, Tom Hanks, Alexander Godunov, David Giler, Kathleen Kennedy, Shelley Long, Josh Mostel, Yakov Smirnoff, Maureen StapletonArt Levinson, Richard Benjamin, Philip Bosco, Joe Mantegna, Steven Spielberg, Frank Marshall, Tom Hanks, Alexander Godunov, David Giler, Kathleen Kennedy, Shelley Long, Josh Mostel, Yakov Smirnoff, Maureen Stapleton  See more', 'Initial release date': '2003-02-04', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), English (DTS 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '1020537', 'Director': 'Richard Benjamin', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, Dubbed', 'Run time': '1 hour and 31 minutes', 'Release date': 'February 4, 2003', 'Actors': 'Tom Hanks, Shelley Long, Alexander Godunov, Maureen Stapleton, Joe Mantegna', 'Dubbed': 'Spanish, French', 'Producers': 'Frank Marshall, Kathleen Kennedy, Art Levinson, Steven Spielberg', 'Studio': 'Studio Distribution Services', 'Writers': 'David Giler', 'Number of discs': '1'}\nReview Text: The comedy classic that made \"Money Pit\" a household word when referring to house buying/remodeling trials that are the true test of any relationship.\nReview Title: True Test\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Adventures In Babysitting\nReview Date: 2018/09/02\nStore: Elisabeth Shue  (Actor),     Penelope Ann Miller  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', 'Chris Parker (Elisabeth Shue, THE KARATE KID, CALL TO GLORY) agrees to babysit after her \"dream\" date stands her up. Expecting a dull evening, Chris settles down with three kids for a night of TV ... and boredom. But when her frantic friend Brenda calls and pleads to be rescued from the bus station in downtown Chicago, the evening soon explodes into an endless whirl of hair-raising adventures! Babysitter and kids leave their safe suburban surroundings and head for the heart of the big city, never imagining how terrifyingly funny their expedition will become!', 'Amazon.com', 'Way', 'before she grabbed an Oscar nomination for her searing performance as a world-weary prostitute in', 'Leaving Las Vegas', \", Elisabeth Shue was known as one of the squeaky-clean actresses of the '80s. Having made a splash in\", 'The Karate Kid', \"and the '60s-nostalgia TV series\", 'Call to Glory', ', Shue cemented her good-girl reputation with the charming but badly titled', 'Adventures in Babysitting', \". Set in the John Hughes-style suburbs of Chicago, the titular adventures follow babysitter Chris (Shue), who agrees to watch the Anderson kids (Keith Coogan and Maia Brewton) when her boyfriend cancels their anniversary date. All is quiet on the home front until Chris is called upon to rescue her best friend (Penelope Ann Miller, also doing good-girl duty) from the seedy downtown bus station. She can't leave the kids, and she can't leave her friend alone in the big bad city, so she packs everyone in the station wagon and heads into Chicago. Screwball craziness begins as they encounter car thieves, knife-wielding gangs, gun-toting truck drivers, and, worst of all, Chris's duplicitous boyfriend. It's hardly mature entertainment, but Shue makes it work; when she wins over the audience at a blues club with her improv singing, you'll be won over, too. In his directorial debut, Chris Columbus (who later went on to helm the sap-fests\", 'Mrs. Doubtfire', 'and', 'Home Alone', \") gently skewers the suburbia white-bread mindset of the main characters, and plays up the comedy over the schmaltz with a subtlety of which he now seems incapable; the near romance between Shue and Coogan is played lightly and adorably. Look for brief appearances by art-house faves Lolita Davidovich as a college party girl and Vincent D'Onofrio as an unlikely savior.\", '--Mark Englehart']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Widescreen, Color, Dolby, NTSC, Closed-captioned', 'Contributor': \"Keith Coogan, George Newbern, Calvin Levels, David Simkins, Penelope Ann Miller, Lolita Davidovitch, Elisabeth Shue, Ron Canada, Maia Brewton, Allen Aarons, Bradley Whitford, Vincent  D'Onofrio, John Ford Noonan, John Chandler, Daniel Ziskie, Chris Columbus, Anthony RappKeith Coogan, George Newbern, Calvin Levels, David Simkins, Penelope Ann Miller, Lolita Davidovitch, Elisabeth Shue, Ron Canada, Maia Brewton, Allen Aarons, Bradley Whitford, Vincent  D'Onofrio, John Ford Noonan, John Chandler, Daniel Ziskie, Chris Columbus, Antho…   See more\", 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': 'MFR717951003300#VG', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Widescreen, Color, Dolby, NTSC, Closed-captioned', 'Run time': '1 hour and 42 minutes', 'Release date': 'January 18, 2000', 'Actors': \"Elisabeth Shue, Penelope Ann Miller, Vincent  D'Onofrio, John Chandler, Keith Coogan\", 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'David Simkins', 'Number of discs': '1'}\nReview Text: Deceptively simple premise delivers loads of laughs in this light-hearted misadventure!\nReview Title: Entertaining Misadventure!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Death Becomes Her\nReview Date: 2018/09/02\nStore: Goldie Hawn  (Actor),     Bruce Willis  (Actor),     Robert Zemeckis  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['Oscar®-winning actress Meryl Streep and Goldie Hawn star with Bruce Willis in Robert Zemeckis\\' outrageously entertaining comedy about greed, vanity, sex, immortality, life…and death. Isabella Rossellini is a beautiful enchantress who changes their lives—and deaths—forever in this hilarious dark comedy with ground-breaking special effects that the Chicago Tribune calls \"diabolically inventive.\"', 'Bonus Content:', 'Behind-the-Scenes', 'Behind-the-Scenes', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 103 min', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Full Screen', 'Run time': '1 hour and 43 minutes', 'Release date': 'February 27, 2007', 'Actors': 'Goldie Hawn, Bruce Willis, Meryl Streep, Isabella Rossellini', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Zemeckis, Steve Starkey', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Martin Donovan (I), David Koepp', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Two stellar ladies of Hollywood's A-List deliver such a truthful bit of black comedy that you will be both enthralled and appalled. Too true to be entirely funny, but hilarious at the same time.\nReview Title: Deliciously Dark Comedy\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: As Good As It Gets\nReview Date: 2018/09/02\nStore: Jack Nicholson  (Actor),     Helen Hunt  (Actor),     James L. Brooks  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Product Description', \"Jack Nicholson, Helen Hunt, Greg Kinnear and Cuba Gooding, Jr., star in James L. Brooks' hit comedy,\", 'As Good as it Gets', \". Nicholson gives a show-stopping performance as Melvin Udall, an obsessive-compulsive novelist with Manhattan's meanest mouth. But when his neighbor Simon is hospitalized, Melvin is forced to babysit Simon's dog. And that unexpected act of kindness, along with waitress Carol Connelly, helps put Melvin back in the human race.\", 'Amazon.com', 'For all of its conventional plotting about an obsessive-compulsive curmudgeon (Jack Nicholson) who improves his personality at the urging of his gay neighbor (Greg Kinnear) and a waitress (Helen Hunt) who inspires his best behavior, this is one of the sharpest Hollywood comedies of the 1990s. Nicholson could play his role in his sleep (the Oscar he won should have gone to Robert Duvall for', 'The Apostle', \"), but his mischievous persona is precisely necessary to give heart to his seemingly heartless character, who is of all things a successful romance novelist. As a single mom with a chronically asthmatic young son, Hunt gives the film its conscience and integrity (along with plenty of wry humor), and she also won an Oscar for her wonderful performance. Greg Kinnear had to settle for an Oscar nomination (while cowriter-director James L. Brooks was inexplicably snubbed by Oscar that year), but his work was also singled out in the film's near-unanimous chorus of critical praise. It's questionable whether a romance between Hunt and the much older Nicholson is entirely believable, but this movie's smart enough--and charmingly funny enough--to make it seem endearingly possible.\", '--Jeff Shannon']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Romance, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, AnamorphicMultiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, Anamorphic   See more', 'Contributor': 'Greg Kinnear, Jesse James, Cuba Gooding Jr., Shirley Knight, Jack Nicholson, Helen Hunt, Harold Ramis, Old Friends Productions, Inc./Gracie, James L. Brooks, Bridget Johnson, Kristi Zea, Lupe Ontiveros, Skeet UlrichGreg Kinnear, Jesse James, Cuba Gooding Jr., Shirley Knight, Jack Nicholson, Helen Hunt, Harold Ramis, Old Friends Productions, Inc./Gracie, James L. Brooks, Bridget Johnson, Kristi Zea, Lupe Ontiveros, Skeet Ulrich   See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 18 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '043396217096', 'Director': 'James L. Brooks', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen, Anamorphic', 'Run time': '2 hours and 18 minutes', 'Release date': 'May 19, 1998', 'Actors': 'Jack Nicholson, Helen Hunt, Greg Kinnear, Cuba Gooding Jr., Skeet Ulrich', 'Subtitles': 'English, Spanish, French', 'Producers': 'Bridget Johnson, Kristi Zea, James L. Brooks', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: How is it possible that Jack Nicholson can be so disgusting and so winning at the same time!!? This truly is a movie that's hard to beat.\nReview Title: Hard to Beat\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The African Queen (Commemorative Box Set) [DVD]\nReview Date: 2018/09/02\nStore: Theodore Bikel  (Actor),     Humphrey Bogart  (Actor),     John Huston  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Action & Adventure\nAverage Rating: 4.8\nProduct Details: {'Format': 'Color, DVD, NTSC', 'Contributor': 'Peter Swanwick, Theodore Bikel, Katharine Hepburn, Humphrey Bogart, Gerald Onn, Richard Marner, Robert Morley, Walter Gotell, Peter Bull, John HustonPeter Swanwick, Theodore Bikel, Katharine Hepburn, Humphrey Bogart, Gerald Onn, Richard Marner, Robert Morley, Walter Gotell, Peter Bull, John Huston  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 45 minutes', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.6 x 5.6 x 1.1 inches; 13.6 Ounces', 'Director': 'John Huston', 'Media Format': 'Color, DVD, NTSC', 'Run time': '1 hour and 45 minutes', 'Actors': 'Theodore Bikel, Humphrey Bogart, Walter Gotell, Katharine Hepburn, Richard Marner', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'Paramount', 'Number of discs': '2'}\nReview Text: No one's movie viewing is ever complete without having watched African Queen at least once! It's been a family favorite of ours through three or four generations now. Hollywood at its best when movies were truly classic.\nReview Title: An All-Time Winner\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Preferences and Patterns Summary:**\n\n- **Genre Focus:** Strong preference for comedy and romantic comedies, with notable interest in action-adventure themes.  \n- **Format Preference:** Predominantly purchases DVDs and Blu-rays, indicating a favor towards physical media for film enjoyment.  \n- **Actor Affinity:** Frequent purchases featuring iconic actors like Arnold Schwarzenegger, Goldie Hawn, Jack Nicholson, and Michael Douglas, suggesting admiration for established Hollywood talent.  \n- **Mood and Themes:** Enjoys light-hearted, uplifting narratives with themes of transformation, family, humor, and romance, seen in multiple selections.  \n- **Multiple Titles:** Often buys collections or double features, indicating a preference for acquiring multiple films at once.  \n- **High Ratings:** Consistently rates films highly (4.5+) suggesting a discerning taste for quality cinema, favoring impactful storytelling and strong performances.  \n- **Classic Appreciation:** Shows an inclination towards classic films, with many purchases from the mid-20th century and family favorites spanning generations.  \n- **Satirical Humor:** Appears to appreciate films that incorporate a satirical or socially reflective angle, especially regarding politics and society.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Uplifting, worthwhile, even if a bit oversold.",
    "text": "Very little actual history here, but uplifting portrayal of a truly remarkable woman. A little oversold on “superfying” her story, when the straight truth is remarkable enough! This woman’s heroism should be told, and this is an entertaining first step.",
    "images": [],
    "asin": "B07Z89XNW4",
    "parent_asin": "B07Z89XNW4",
    "user_id": "AFWLJDVTUEIZ2CGL7LSV2ZIFNQDA",
    "timestamp": "2021-06-02 23:18:12.966000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 45043,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/30fc60111865ffd17bd357c2c087db9604b7c3792475af37e18d59e12a70e4b3._RI_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/30fc60111865ffd17bd357c2c087db9604b7c3792475af37e18d59e12a70e4b3._RI_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/30fc60111865ffd17bd357c2c087db9604b7c3792475af37e18d59e12a70e4b3._RI_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/30fc60111865ffd17bd357c2c087db9604b7c3792475af37e18d59e12a70e4b3._RI_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/30fc60111865ffd17bd357c2c087db9604b7c3792475af37e18d59e12a70e4b3._RI_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/30fc60111865ffd17bd357c2c087db9604b7c3792475af37e18d59e12a70e4b3._RI_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Violence",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English",
        "English [Audio Description]"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Kasi Lemmons"
      ],
      "Producers": [
        "Debra Martin Chase",
        "Daniela Taplin Lundberg",
        "Gregory Allen Howard"
      ],
      "Starring": [
        "Cynthia Erivo",
        "Jr.",
        "Leslie Odom",
        "Janelle Monae"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}