{
  "user_id": "AGIK5W45UYI3CJRVZODRGSEPJG7A",
  "summary": "=== Purchase Information ===\nProduct Title: ER: The Complete Seasons 1-15 [DVD]\nReview Date: 2013/08/12\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['ER:The Complete Seasons One-Fifteen (15pk/GFT/DVD)', \"ER explores the inner workings of an urban teaching hospital and critical issues faced by the dedicated physicians and staff of its emergency room. The pulse-pounding drama features new challenges each season, from exploring personal problems outside of Chicago's County General Hospital to the political issues being raised inside. Each season features new additions, including chief resident Kerry Weaver, Alex Kingston as British surgeon Elizabeth Corday, Paul McCrane as abrasive Dr. Robert Romano, and Lucy Knight (Kellie Martin), a third-year medical student starting her rotation. It’s always rush hour at Chicago’s County General where every day brings triumphs and losses. As Dr. Greene fights his final battle, his former student, John Carter, must step in as Chief Resident to lead the group of healers. Meanwhile, Kovac’s wild ways begin to affect his job performance, Susan Lewis gets married, and Weaver gets promoted. Plus, Carter and Kovac return from their time in Africa.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Television', 'Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '90', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.05 Pounds', 'Item model number': '883929221660', 'Director': 'Various', 'Media Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Release date': 'September 13, 2011', 'Actors': 'Various', 'Dubbed': 'Portuguese', 'Studio': 'WarnerBrothers', 'Number of discs': '90'}\nReview Text: Loved the show when it was on TV and I still love it.  I am hearing impaired and missed a lot of dialog when it was on so I was looking forward to watching these with the captioning.  Many of the seasons do not have this option.  It's great to watch without commercials!  With so little to watch on TV these days, this has been a real treat for me.  I just wish the captioning wasn't missing on so many seasons.\nReview Title: Captions for Hearing Impaired are missing on some.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/12/13\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Daniel Petrie'], 'Producers': ['David W. Rintels'], 'Starring': ['Jeff Fahey', 'Morgan Freeman', 'Laurie Metcalf'], 'Studio': ['Fisher Klingenstein Films']}\nReview Text: This was a very good movie, however I found it a bit slow moving in parts.  The acting was very good and I'm a huge fan of Morgan Freeman.  His part in this movie didn't seem to be awesome; it wasn't him - it was the part!  Not enough punch for me.  He's capable of so much more but the opportunity to give more wasn't there.\nReview Title: OK, but I expected more.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Ghost and the Darkness\nReview Date: 2015/03/20\nStore: Michael Douglas  (Actor),     Val Kilmer  (Actor),     Stephen Hopkins  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', \"Only the most incredible parts of the story are true. Michael Douglas and Val Kilmer star in this tense, terrific and true adventure set in 1896 East Africa. There, two lions on man-eating rampage have shut down the construction of a railway. The beasts hunt together, showing no fear of man or fire. What's more, they're killing for sport rather than for food-and they have an almost supernatural knack for knowing what traps await them. Big-game hunter Remington (Douglas) and construction engineer Patterson (Kilmer) set out to stop these unstoppable monsters. But, in this astonishing tale of man against beast, the hunters become the hunted.\", 'Amazon.com', \"Val Kilmer stars as Lt. Col. John Patterson, a 19th-century Irish engineer drafted by Britain's railroad bosses to build a trestle bridge over an African river, thus expanding the empire a tiny bit more. In Tsavo, Patterson is instantly hailed for killing a man-eating lion that had been making life hell for native workers. But morale sinks when a pair of unstoppable big cats devour more men and destroy the project. Along comes an Ahab-like, expatriate American hunter (Michael Douglas) to help Patterson face the almost preternatural powers of the two killers. The script by William Goldman (\", 'Butch Cassidy and the Sundance Kid', ') is based on fact, though the film owes more to Spielberg (specifically to', 'Jaws', ') than history. There are also suggestive echoes of Kipling and Conrad in the material and characters, and there are hints of emotional complexity and psychological nuance that make one wish this could have been a great film instead of a merely fun one.', '--Tom Keogh']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Contributor': 'Kurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily MortimerKurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily Mortimer   See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 4 Ounces', 'Director': 'Stephen Hopkins', 'Media Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 1, 1998', 'Actors': 'Michael Douglas, Val Kilmer, Tom Wilkinson, John Kani, Bernard Hill', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'William Goldman', 'Number of discs': '1'}\nReview Text: Great (older) movie.  Great effects for the time it was made.  Beautiful country in the background.\nReview Title: A must see movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ramón Menéndez'], 'Producers': ['Tom Musca'], 'Starring': ['Edward James Olmos', 'Lou Diamond Phillips', 'Rosanna DeSoto'], 'Studio': ['Warner Bros. Domestic Televisi']}\nReview Text: Great movie - especially for it's time.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Martin Smith'], 'Producers': ['Andrew A. Kosove', 'Broderick Johnson', 'Richard Ingber'], 'Starring': ['Harry Connick', 'Jr.', 'Ashley Judd', 'Nathan Gamble']}\nReview Text: Good family movie.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Marty Callner'], 'Producers': ['Marty Callner', 'David Steinberg', 'Randall Gladstein'], 'Starring': ['Robin Williams'], 'Studio': ['HBO']}\nReview Text: Not the best work I've seen from Robin Williams.  I tried to laugh but it just didn't work for me.\nReview Title: Not the best work I've seen from Robin Williams\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/31\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Jason Moore'], 'Producers': ['Paul Brooks', 'Elizabeth Banks', 'Max Handelman'], 'Starring': ['Anna Kendrick', 'Skylar Astin', 'Rebel Wilson'], 'Studio': ['Universal Pictures']}\nReview Text: Entertaining enough.  Good music.  I liked Pitch Perfect 2 better.\nReview Title: Entertaining\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/23\nAverage Rating: 3.0\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duke', 'Daryl'], 'Producers': ['Georgia Jeffries'], 'Starring': ['Shelley Long', 'Dean Stockwell'], 'Studio': ['Deep Cuts']}\nReview Text: Although this is an older movie, it is relevant and done well.  Shelly Long is quite good in the roll of the adult woman who begins to remember tragic events involving her father.  It takes a very strong woman to do what this character did.  It makes me wonder how many children's lives were damaged in the interim time period.\nReview Title: Courage at it's best.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Norma Rae: 35th Anniversary\nReview Date: 2016/06/06\nStore: Sally Field  (Actor),     Beau Bridges  (Actor),     Martin Ritt  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['A union organizer from up North recruits a divorced cotton-mill worker down South. Directed by Martin Ritt. Best actress Oscar for Field.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': 'FOXS2289377BR', 'Director': 'Martin Ritt', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 1, 2014', 'Actors': 'Sally Field, Beau Bridges, Ron Leibman, Pat Hingle, Barbara Baxley', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Tamara Asseyev, Alexandra Rose', 'Studio': '20th Century Fox', 'Writers': 'Irving Ravetch, Harriet Frank Jr.', 'Number of discs': '1'}\nReview Text: LOVE this movie.  I'm planning to have my granddaughters watch it.  Sally Field is great and the story is inspirational for women.\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monk: The Complete Series\nReview Date: 2016/06/06\nStore: Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['He’s obsessive. He’s compulsive. He’s Monk, “TV’s most original sleuth ever” (Howard Rosenberg, Los Angeles Times). Primetime Emmy and Golden Globe winner Tony Shalhoub cleans up crime and grime galore in the beloved series that critics hailed as “fresh, exciting and utterly original” (Chicago Tribune). Once upon a time Adrian Monk was a rising star with the San Francisco Police Department, but he lost his nerve, his mind and then his badge. Now, this obsessive-compulsive detective is determined to get back on the force by solving one crime at a time in “the best detective show to come along in decades” (New York Post). Featuring hilarious guest stars, including Stanley Tucci, John Turturro and Sarah Silverman, this 32-disc collection includes every episode from all 8 seasons with hours of behind-the-scenes bonus features, making Monk: The Complete Series a compulsively essential addition to any DVD obsessive’s collection.']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 8.5 x 7 inches; 2.6 Pounds', 'Media Format': 'NTSC', 'Studio': 'Universal Studios Home Entertainment'}\nReview Text: I LOVE Monk!\nReview Title: I love Monk\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sybil (Two-Disc Special Edition)\nReview Date: 2016/06/06\nStore: Sally Field  (Actor),     Joanne Woodward  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Product Description', 'Sybil (1976) (DVD)', 'Based on a true story, this telefilm debut in 1976 to extraordinary response. Sally Field - in an Emmy Award winning and career-turning performance - portrays Sybil, a woman suffering from multiple personality disorder who develops over 16 distinct personalities in order to cope and escape haunting memories of her harrowing childhood. Joanne Woodward plays the understanding and compassionate psychiatrist that helps Sybil confront her horrific past and eliminate her demons.', ']]>', 'Amazon.com', 'The word \"landmark\" is fairly used in the case of', 'Sybil', \": this 1976 TV movie brought new frankness to television, it raised the quality bar for the made-for-television movie, and it utterly changed the career of a future Oscar-winning actress. The film was based on the bestselling nonfiction book about a multiple-personality patient and her exhaustive therapy. It opens with a brilliant series of scenes that suggest how a young woman named Sybil (Sally Field) experiences unexplained blackouts, which brings her to the attention of a psychiatrist, Dr. Wilbur (Joanne Woodward). The film unfolds around the searching therapy sessions, laced with flashbacks to Sybil's toxic childhood. There's also a tentative romance between the lonely Sybil and a manchild (Brad Davis) who lives across the alley. Most notably, of course, there are the appearances of Sybil's alternate personalities, who express her strangled emotional life. Stewart Stern's sensitive script seems to flow organically from one scene to the next, and director Daniel Petrie frequently allows the camera to observe the acting acrobatics in long, challenging takes.\", 'Woodward, who won an Oscar for playing a multiple-personality patient in', 'The Three Faces of Eve', ', is all nurturing warmth as the steadfast doctor. But really this film was a sober coming-out party for Sally Field, who astonished viewers at the time by erasing all memories of', 'Gidget', 'and', 'The Flying Nun', \", the bubblegum roles she'd mostly been known for. Field's work is anguished but non-actor-y, and despite the character's hidden personalities, she seems as clear as day in her performance. The production won four Emmys, not surprisingly including nods for Field, Stern, and Outstanding Special (Drama).\", 'The 187-minute movie takes up one disc; the second disc has informative featurettes about the making of the film.', 'Examining Sybil', \"is an absorbing hour-long documentary with comments from Field and Woodward, as well as executive producer Peter Dunne. It is dominated by the spellbinding storytelling of Stewart Stern, who developed the screenplay by spending time with the real Dr. Wilbur and listening to tapes of her sessions with Sybil. His tale of Sally Field's unlikely audition triumph is a small movie in itself.\", 'The Paintings of Sybil', 'presents a generous selection of paintings by the real Sybil (who became a professor of art), along with recollections by one of her friends. Something listed on the DVD cover as \"Sybil Therapy Session\" is misleadingly titled, suggesting some kind of actual footage or transcript of the real Sybil and her treatment; in fact, it\\'s Stewart Stern describing the harrowing process of listening to the doctor\\'s tapes. The real Sybil (now deceased) remains protected, as she should.', '--Robert Horton']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Documentary/Biography', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Daniel Petrie, Flora Rheta Schreiber, Sally Field, Brad Davis, Jacqueline Babbin, Joanne Woodward', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '3 hours and 6 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.04 Ounces', 'Item model number': '70145', 'Director': 'Daniel Petrie', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '3 hours and 6 minutes', 'Release date': 'July 18, 2006', 'Actors': 'Sally Field, Joanne Woodward, Brad Davis', 'Subtitles': 'French, Spanish', 'Producers': 'Jacqueline Babbin', 'Studio': 'WarnerBrothers', 'Writers': 'Flora Rheta Schreiber', 'Number of discs': '2'}\nReview Text: One of the best movies ever made and Sally Field is outstanding!  I've watched this movie many times and never tire of it.\nReview Title: Outstanding movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: To Kill a Mockingbird [Blu-ray]\nReview Date: 2016/06/06\nStore: Gregory Peck  (Actor),     Mary Badham  (Actor),     Robert Mulligan  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, DVD Movie, Harper Lee, Blu-ray Movie, Atticus Finch', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Russell Harlan, Brock Peters, Frank Overton, James Anderson, Robert Duvall, Mary Badham, Alan J. Pakula, Phillip Alford, Horton Foote, Robert Mulligan, Collin Wilcox, John Megna, Gregory Peck, Rosemary MurphyRussell Harlan, Brock Peters, Frank Overton, James Anderson, Robert Duvall, Mary Badham, Alan J. Pakula, Phillip Alford, Horton Foote, Robert Mulligan, Collin Wilcox, John Megna, Gregory Peck, Rosemary Murphy   See more', 'Language': 'English (DTS-HD 2.0), French (DTS-HD 2.0), English (DTS-HD Master Audio 5.1)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.08 Ounces', 'Item model number': '33732455', 'Director': 'Robert Mulligan', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'May 26, 2015', 'Actors': 'Gregory Peck, Mary Badham, Phillip Alford, John Megna, Frank Overton', 'Subtitles': 'French, Spanish', 'Producers': 'Alan J. Pakula', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Horton Foote', 'Number of discs': '1'}\nReview Text: Can't say enough about this classic.  Highly recommended - even my 7-year-old granddaughter liked this (even though it's not in color!).\nReview Title: A Classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Judy Moody and the NOT Bummer Summer\nReview Date: 2016/06/06\nStore: Heather Graham  (Actor),     Jordana Beatty  (Actor),     John Schultz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Get ready to score extra thrill points and mega-laughs with this irresistible family comedy based on the best-selling book series! Feisty, fearless Judy Moody is looking forward to the most super-duper, double-rare summer vacation ever. The trouble is, her parents are called out of town and her BFFs are going away with their own families. That leaves Judy trapped at home with her pesky brother Stink under the watchful eye of Aunt Opal (Heather Graham). But with a little playful planning - and a lot of imagination - Judy turns a snoresville summer into the way-not-boring adventure of a lifetime!', 'Amazon.com', 'Based on the Judy Moody books by Megan McDonald,', 'Judy Moody and the Not Bummer Summer', \"is about a third-grade girl with big ideas for an exciting summer full of dares, scares, and thrills with her three best friends. Judy's carefully crafted plans for a summer-long thrill contest are quickly dashed when she discovers that two of her friends, Rocky and Amy, are going away for the summer, and she'll be left at home with second-best friend Frank Pearl and her brother Stink. Things get even worse when her parents inform her that they're headed to California and are leaving her and Stink under the care of their Aunt Opal, whom Judy's never even met. It turns out that Aunt Opal is far from your average aunt; she's actually pretty cool and she's full of surprises that, when mixed with Judy's natural passion for adventure and action, might just yield some very unexpected results. The film does a good job of preserving the feel and attitude of the Judy Moody character with her frequent flights of fancy, but its brief segments of animation, presumably intended to mirror the cartoonish illustrations that pepper the books, seem somewhat abrupt and awkward. Kids ages 7 to 10 will find laughs and adventure in this 91-minute film, but it's definitely not aimed at older kids or adults, who will find it simply adequate.\", '--Tami Horiuchi']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jordana Beatty, Heather Graham, John Schultz', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'FOXS2281293DVD', 'Director': 'John Schultz', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'October 11, 2011', 'Actors': 'Heather Graham, Jordana Beatty', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Relativity Media', 'Number of discs': '1'}\nReview Text: My granddaughter loves these books and reads them faster than we can buy them.\nReview Title: Great books\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/09/17\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Producers': ['David Bartis', 'Gene Klein', 'Aaron Korsh', 'Doug Liman', 'Nathan Perkins', 'Daniel Arkin', 'Rick Muirragui', 'Jonathan Hackett', 'Patrick J. Adams', 'Gabriel Macht', 'Genevieve Sparling', 'Ethan Drogin', 'Jon Cowan', 'Anton Cropper', 'Lilla Zuckerman', 'Nora Zuckerman', 'Gavin Barclay', 'Kevin Bray', 'Silver Tree', 'Desmond Paes', 'Chris Downey', 'Ryan Kennedy', 'Paul Redford', 'Sean Jablonski', 'Steve Wakefield', 'Mark Winemaker', 'Chevy Chen', 'Igor Srubshchik', 'Kyle Long', 'Natalie Urquhart', 'Jonathan Starch'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Rick Hoffman'], 'Studio': ['USA']}\nReview Text: This show was recommended to me and I was surprised to find it very intriguing.  The main characters have great chemistry and it's fun to watch them twist and bend things to win their cases while keeping a huge secret between themselves.  I also love being able to watch episode after episode without interruption when the rest of television has crap on!\nReview Title: This will keep you guessing!  Great Show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/11\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Gina Torres']}\nReview Text: My friend turned me on to this show and it is excellent.  I love the cast of characters and the twists and turns of the cases.  I am so hooked!  Match and Adams are top notch in their roles.  You really have to pay attention to keep things straight.\nReview Title: Excellent Show!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/11\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Rick Hoffman'], 'Studio': ['USA']}\nReview Text: Match and Adams are top notch in their roles.  You really have to pay attention to keep things straight.  This is not a show to watch while falling asleep in the evening - you'll miss too much.  The guest stars are also top notch.  The writers for this show deserve awards for this!\nReview Title: Don't fall asleep during this excellent show.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/11\nAverage Rating: 3.1\nProduct Details: {'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語', 'Português'], 'Directors': ['Woody Allen'], 'Producers': ['Erika Aronson', 'Helen Robin'], 'Starring': ['Woody Allen', 'Miley Cyrus', 'Elaine May']}\nReview Text: So far I've only watched one episode.  I'm trying to ready myself for episode two.  I was disappointed in this show.  I'm not a fan of the way it is filmed and it seemed to be a bit dry.  The humor wasn't that good and the jokes are far and few between (or I'm missing something).  I always try to watch two or three episodes before making a decision on a series, but I'm finding it hard to get to the second episode of this one.\nReview Title: Disappointed in first episode.\nRating: 2.0\n--------------------------------------------------",
  "reference": "ER: The Complete Seasons 1-15 [DVD]\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['ER:The Complete Seasons One-Fifteen (15pk/GFT/DVD)', \"ER explores the inner workings of an urban teaching hospital and critical issues faced by the dedicated physicians and staff of its emergency room. The pulse-pounding drama features new challenges each season, from exploring personal problems outside of Chicago's County General Hospital to the political issues being raised inside. Each season features new additions, including chief resident Kerry Weaver, Alex Kingston as British surgeon Elizabeth Corday, Paul McCrane as abrasive Dr. Robert Romano, and Lucy Knight (Kellie Martin), a third-year medical student starting her rotation. It’s always rush hour at Chicago’s County General where every day brings triumphs and losses. As Dr. Greene fights his final battle, his former student, John Carter, must step in as Chief Resident to lead the group of healers. Meanwhile, Kovac’s wild ways begin to affect his job performance, Susan Lewis gets married, and Weaver gets promoted. Plus, Carter and Kovac return from their time in Africa.\", ']]>']\n{'Genre': 'Drama, Television', 'Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '90', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.05 Pounds', 'Item model number': '883929221660', 'Director': 'Various', 'Media Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Release date': 'September 13, 2011', 'Actors': 'Various', 'Dubbed': 'Portuguese', 'Studio': 'WarnerBrothers', 'Number of discs': '90'}\nLoved the show when it was on TV and I still love it.  I am hearing impaired and missed a lot of dialog when it was on so I was looking forward to watching these with the captioning.  Many of the seasons do not have this option.  It's great to watch without commercials!  With so little to watch on TV these days, this has been a real treat for me.  I just wish the captioning wasn't missing on so many seasons.\nCaptions for Hearing Impaired are missing on some.\n{'Subtitles': ['None available'], 'Directors': ['Daniel Petrie'], 'Producers': ['David W. Rintels'], 'Starring': ['Jeff Fahey', 'Morgan Freeman', 'Laurie Metcalf'], 'Studio': ['Fisher Klingenstein Films']}\nThis was a very good movie, however I found it a bit slow moving in parts.  The acting was very good and I'm a huge fan of Morgan Freeman.  His part in this movie didn't seem to be awesome; it wasn't him - it was the part!  Not enough punch for me.  He's capable of so much more but the opportunity to give more wasn't there.\nOK, but I expected more.\nThe Ghost and the Darkness\nMichael Douglas  (Actor),     Val Kilmer  (Actor),     Stephen Hopkins  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', \"Only the most incredible parts of the story are true. Michael Douglas and Val Kilmer star in this tense, terrific and true adventure set in 1896 East Africa. There, two lions on man-eating rampage have shut down the construction of a railway. The beasts hunt together, showing no fear of man or fire. What's more, they're killing for sport rather than for food-and they have an almost supernatural knack for knowing what traps await them. Big-game hunter Remington (Douglas) and construction engineer Patterson (Kilmer) set out to stop these unstoppable monsters. But, in this astonishing tale of man against beast, the hunters become the hunted.\", 'Amazon.com', \"Val Kilmer stars as Lt. Col. John Patterson, a 19th-century Irish engineer drafted by Britain's railroad bosses to build a trestle bridge over an African river, thus expanding the empire a tiny bit more. In Tsavo, Patterson is instantly hailed for killing a man-eating lion that had been making life hell for native workers. But morale sinks when a pair of unstoppable big cats devour more men and destroy the project. Along comes an Ahab-like, expatriate American hunter (Michael Douglas) to help Patterson face the almost preternatural powers of the two killers. The script by William Goldman (\", 'Butch Cassidy and the Sundance Kid', ') is based on fact, though the film owes more to Spielberg (specifically to', 'Jaws', ') than history. There are also suggestive echoes of Kipling and Conrad in the material and characters, and there are hints of emotional complexity and psychological nuance that make one wish this could have been a great film instead of a merely fun one.', '--Tom Keogh']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Contributor': 'Kurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily MortimerKurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily Mortimer   See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 4 Ounces', 'Director': 'Stephen Hopkins', 'Media Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 1, 1998', 'Actors': 'Michael Douglas, Val Kilmer, Tom Wilkinson, John Kani, Bernard Hill', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'William Goldman', 'Number of discs': '1'}\nGreat (older) movie.  Great effects for the time it was made.  Beautiful country in the background.\nA must see movie.\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ramón Menéndez'], 'Producers': ['Tom Musca'], 'Starring': ['Edward James Olmos', 'Lou Diamond Phillips', 'Rosanna DeSoto'], 'Studio': ['Warner Bros. Domestic Televisi']}\nGreat movie - especially for it's time.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Martin Smith'], 'Producers': ['Andrew A. Kosove', 'Broderick Johnson', 'Richard Ingber'], 'Starring': ['Harry Connick', 'Jr.', 'Ashley Judd', 'Nathan Gamble']}\nGood family movie.\nFive Stars\n{'Subtitles': ['None available'], 'Directors': ['Marty Callner'], 'Producers': ['Marty Callner', 'David Steinberg', 'Randall Gladstein'], 'Starring': ['Robin Williams'], 'Studio': ['HBO']}\nNot the best work I've seen from Robin Williams.  I tried to laugh but it just didn't work for me.\nNot the best work I've seen from Robin Williams\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Jason Moore'], 'Producers': ['Paul Brooks', 'Elizabeth Banks', 'Max Handelman'], 'Starring': ['Anna Kendrick', 'Skylar Astin', 'Rebel Wilson'], 'Studio': ['Universal Pictures']}\nEntertaining enough.  Good music.  I liked Pitch Perfect 2 better.\nEntertaining\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duke', 'Daryl'], 'Producers': ['Georgia Jeffries'], 'Starring': ['Shelley Long', 'Dean Stockwell'], 'Studio': ['Deep Cuts']}\nAlthough this is an older movie, it is relevant and done well.  Shelly Long is quite good in the roll of the adult woman who begins to remember tragic events involving her father.  It takes a very strong woman to do what this character did.  It makes me wonder how many children's lives were damaged in the interim time period.\nCourage at it's best.\nNorma Rae: 35th Anniversary\nSally Field  (Actor),     Beau Bridges  (Actor),     Martin Ritt  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n['A union organizer from up North recruits a divorced cotton-mill worker down South. Directed by Martin Ritt. Best actress Oscar for Field.']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': 'FOXS2289377BR', 'Director': 'Martin Ritt', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 1, 2014', 'Actors': 'Sally Field, Beau Bridges, Ron Leibman, Pat Hingle, Barbara Baxley', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Tamara Asseyev, Alexandra Rose', 'Studio': '20th Century Fox', 'Writers': 'Irving Ravetch, Harriet Frank Jr.', 'Number of discs': '1'}\nLOVE this movie.  I'm planning to have my granddaughters watch it.  Sally Field is great and the story is inspirational for women.\nGreat movie\nMonk: The Complete Series\nFormat: DVD\nMovies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\n['He’s obsessive. He’s compulsive. He’s Monk, “TV’s most original sleuth ever” (Howard Rosenberg, Los Angeles Times). Primetime Emmy and Golden Globe winner Tony Shalhoub cleans up crime and grime galore in the beloved series that critics hailed as “fresh, exciting and utterly original” (Chicago Tribune). Once upon a time Adrian Monk was a rising star with the San Francisco Police Department, but he lost his nerve, his mind and then his badge. Now, this obsessive-compulsive detective is determined to get back on the force by solving one crime at a time in “the best detective show to come along in decades” (New York Post). Featuring hilarious guest stars, including Stanley Tucci, John Turturro and Sarah Silverman, this 32-disc collection includes every episode from all 8 seasons with hours of behind-the-scenes bonus features, making Monk: The Complete Series a compulsively essential addition to any DVD obsessive’s collection.']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 8.5 x 7 inches; 2.6 Pounds', 'Media Format': 'NTSC', 'Studio': 'Universal Studios Home Entertainment'}\nI LOVE Monk!\nI love Monk\nSybil (Two-Disc Special Edition)\nSally Field  (Actor),     Joanne Woodward  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n['Product Description', 'Sybil (1976) (DVD)', 'Based on a true story, this telefilm debut in 1976 to extraordinary response. Sally Field - in an Emmy Award winning and career-turning performance - portrays Sybil, a woman suffering from multiple personality disorder who develops over 16 distinct personalities in order to cope and escape haunting memories of her harrowing childhood. Joanne Woodward plays the understanding and compassionate psychiatrist that helps Sybil confront her horrific past and eliminate her demons.', ']]>', 'Amazon.com', 'The word \"landmark\" is fairly used in the case of', 'Sybil', \": this 1976 TV movie brought new frankness to television, it raised the quality bar for the made-for-television movie, and it utterly changed the career of a future Oscar-winning actress. The film was based on the bestselling nonfiction book about a multiple-personality patient and her exhaustive therapy. It opens with a brilliant series of scenes that suggest how a young woman named Sybil (Sally Field) experiences unexplained blackouts, which brings her to the attention of a psychiatrist, Dr. Wilbur (Joanne Woodward). The film unfolds around the searching therapy sessions, laced with flashbacks to Sybil's toxic childhood. There's also a tentative romance between the lonely Sybil and a manchild (Brad Davis) who lives across the alley. Most notably, of course, there are the appearances of Sybil's alternate personalities, who express her strangled emotional life. Stewart Stern's sensitive script seems to flow organically from one scene to the next, and director Daniel Petrie frequently allows the camera to observe the acting acrobatics in long, challenging takes.\", 'Woodward, who won an Oscar for playing a multiple-personality patient in', 'The Three Faces of Eve', ', is all nurturing warmth as the steadfast doctor. But really this film was a sober coming-out party for Sally Field, who astonished viewers at the time by erasing all memories of', 'Gidget', 'and', 'The Flying Nun', \", the bubblegum roles she'd mostly been known for. Field's work is anguished but non-actor-y, and despite the character's hidden personalities, she seems as clear as day in her performance. The production won four Emmys, not surprisingly including nods for Field, Stern, and Outstanding Special (Drama).\", 'The 187-minute movie takes up one disc; the second disc has informative featurettes about the making of the film.', 'Examining Sybil', \"is an absorbing hour-long documentary with comments from Field and Woodward, as well as executive producer Peter Dunne. It is dominated by the spellbinding storytelling of Stewart Stern, who developed the screenplay by spending time with the real Dr. Wilbur and listening to tapes of her sessions with Sybil. His tale of Sally Field's unlikely audition triumph is a small movie in itself.\", 'The Paintings of Sybil', 'presents a generous selection of paintings by the real Sybil (who became a professor of art), along with recollections by one of her friends. Something listed on the DVD cover as \"Sybil Therapy Session\" is misleadingly titled, suggesting some kind of actual footage or transcript of the real Sybil and her treatment; in fact, it\\'s Stewart Stern describing the harrowing process of listening to the doctor\\'s tapes. The real Sybil (now deceased) remains protected, as she should.', '--Robert Horton']\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Daniel Petrie, Flora Rheta Schreiber, Sally Field, Brad Davis, Jacqueline Babbin, Joanne Woodward', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '3 hours and 6 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.04 Ounces', 'Item model number': '70145', 'Director': 'Daniel Petrie', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '3 hours and 6 minutes', 'Release date': 'July 18, 2006', 'Actors': 'Sally Field, Joanne Woodward, Brad Davis', 'Subtitles': 'French, Spanish', 'Producers': 'Jacqueline Babbin', 'Studio': 'WarnerBrothers', 'Writers': 'Flora Rheta Schreiber', 'Number of discs': '2'}\nOne of the best movies ever made and Sally Field is outstanding!  I've watched this movie many times and never tire of it.\nOutstanding movie.\nTo Kill a Mockingbird [Blu-ray]\nGregory Peck  (Actor),     Mary Badham  (Actor),     Robert Mulligan  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Drama\n{'Genre': 'Drama, DVD Movie, Harper Lee, Blu-ray Movie, Atticus Finch', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Russell Harlan, Brock Peters, Frank Overton, James Anderson, Robert Duvall, Mary Badham, Alan J. Pakula, Phillip Alford, Horton Foote, Robert Mulligan, Collin Wilcox, John Megna, Gregory Peck, Rosemary MurphyRussell Harlan, Brock Peters, Frank Overton, James Anderson, Robert Duvall, Mary Badham, Alan J. Pakula, Phillip Alford, Horton Foote, Robert Mulligan, Collin Wilcox, John Megna, Gregory Peck, Rosemary Murphy   See more', 'Language': 'English (DTS-HD 2.0), French (DTS-HD 2.0), English (DTS-HD Master Audio 5.1)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.08 Ounces', 'Item model number': '33732455', 'Director': 'Robert Mulligan', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'May 26, 2015', 'Actors': 'Gregory Peck, Mary Badham, Phillip Alford, John Megna, Frank Overton', 'Subtitles': 'French, Spanish', 'Producers': 'Alan J. Pakula', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Horton Foote', 'Number of discs': '1'}\nCan't say enough about this classic.  Highly recommended - even my 7-year-old granddaughter liked this (even though it's not in color!).\nA Classic\nJudy Moody and the NOT Bummer Summer\nHeather Graham  (Actor),     Jordana Beatty  (Actor),     John Schultz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product Description', 'Get ready to score extra thrill points and mega-laughs with this irresistible family comedy based on the best-selling book series! Feisty, fearless Judy Moody is looking forward to the most super-duper, double-rare summer vacation ever. The trouble is, her parents are called out of town and her BFFs are going away with their own families. That leaves Judy trapped at home with her pesky brother Stink under the watchful eye of Aunt Opal (Heather Graham). But with a little playful planning - and a lot of imagination - Judy turns a snoresville summer into the way-not-boring adventure of a lifetime!', 'Amazon.com', 'Based on the Judy Moody books by Megan McDonald,', 'Judy Moody and the Not Bummer Summer', \"is about a third-grade girl with big ideas for an exciting summer full of dares, scares, and thrills with her three best friends. Judy's carefully crafted plans for a summer-long thrill contest are quickly dashed when she discovers that two of her friends, Rocky and Amy, are going away for the summer, and she'll be left at home with second-best friend Frank Pearl and her brother Stink. Things get even worse when her parents inform her that they're headed to California and are leaving her and Stink under the care of their Aunt Opal, whom Judy's never even met. It turns out that Aunt Opal is far from your average aunt; she's actually pretty cool and she's full of surprises that, when mixed with Judy's natural passion for adventure and action, might just yield some very unexpected results. The film does a good job of preserving the feel and attitude of the Judy Moody character with her frequent flights of fancy, but its brief segments of animation, presumably intended to mirror the cartoonish illustrations that pepper the books, seem somewhat abrupt and awkward. Kids ages 7 to 10 will find laughs and adventure in this 91-minute film, but it's definitely not aimed at older kids or adults, who will find it simply adequate.\", '--Tami Horiuchi']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jordana Beatty, Heather Graham, John Schultz', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'FOXS2281293DVD', 'Director': 'John Schultz', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'October 11, 2011', 'Actors': 'Heather Graham, Jordana Beatty', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Relativity Media', 'Number of discs': '1'}\nMy granddaughter loves these books and reads them faster than we can buy them.\nGreat books\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Producers': ['David Bartis', 'Gene Klein', 'Aaron Korsh', 'Doug Liman', 'Nathan Perkins', 'Daniel Arkin', 'Rick Muirragui', 'Jonathan Hackett', 'Patrick J. Adams', 'Gabriel Macht', 'Genevieve Sparling', 'Ethan Drogin', 'Jon Cowan', 'Anton Cropper', 'Lilla Zuckerman', 'Nora Zuckerman', 'Gavin Barclay', 'Kevin Bray', 'Silver Tree', 'Desmond Paes', 'Chris Downey', 'Ryan Kennedy', 'Paul Redford', 'Sean Jablonski', 'Steve Wakefield', 'Mark Winemaker', 'Chevy Chen', 'Igor Srubshchik', 'Kyle Long', 'Natalie Urquhart', 'Jonathan Starch'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Rick Hoffman'], 'Studio': ['USA']}\nThis show was recommended to me and I was surprised to find it very intriguing.  The main characters have great chemistry and it's fun to watch them twist and bend things to win their cases while keeping a huge secret between themselves.  I also love being able to watch episode after episode without interruption when the rest of television has crap on!\nThis will keep you guessing!  Great Show!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Gina Torres']}\nMy friend turned me on to this show and it is excellent.  I love the cast of characters and the twists and turns of the cases.  I am so hooked!  Match and Adams are top notch in their roles.  You really have to pay attention to keep things straight.\nExcellent Show!!!\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Rick Hoffman'], 'Studio': ['USA']}\nMatch and Adams are top notch in their roles.  You really have to pay attention to keep things straight.  This is not a show to watch while falling asleep in the evening - you'll miss too much.  The guest stars are also top notch.  The writers for this show deserve awards for this!\nDon't fall asleep during this excellent show.\n{'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語', 'Português'], 'Directors': ['Woody Allen'], 'Producers': ['Erika Aronson', 'Helen Robin'], 'Starring': ['Woody Allen', 'Miley Cyrus', 'Elaine May']}\nSo far I've only watched one episode.  I'm trying to ready myself for episode two.  I was disappointed in this show.  I'm not a fan of the way it is filmed and it seemed to be a bit dry.  The humor wasn't that good and the jokes are far and few between (or I'm missing something).  I always try to watch two or three episodes before making a decision on a series, but I'm finding it hard to get to the second episode of this one.\nDisappointed in first episode.",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: ER: The Complete Seasons 1-15 [DVD]\nReview Date: 2013/08/12\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['ER:The Complete Seasons One-Fifteen (15pk/GFT/DVD)', \"ER explores the inner workings of an urban teaching hospital and critical issues faced by the dedicated physicians and staff of its emergency room. The pulse-pounding drama features new challenges each season, from exploring personal problems outside of Chicago's County General Hospital to the political issues being raised inside. Each season features new additions, including chief resident Kerry Weaver, Alex Kingston as British surgeon Elizabeth Corday, Paul McCrane as abrasive Dr. Robert Romano, and Lucy Knight (Kellie Martin), a third-year medical student starting her rotation. It’s always rush hour at Chicago’s County General where every day brings triumphs and losses. As Dr. Greene fights his final battle, his former student, John Carter, must step in as Chief Resident to lead the group of healers. Meanwhile, Kovac’s wild ways begin to affect his job performance, Susan Lewis gets married, and Weaver gets promoted. Plus, Carter and Kovac return from their time in Africa.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Television', 'Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '90', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 9.05 Pounds', 'Item model number': '883929221660', 'Director': 'Various', 'Media Format': 'Box set, AC-3, Color, Dolby, Dubbed, DVD, NTSC, Widescreen', 'Release date': 'September 13, 2011', 'Actors': 'Various', 'Dubbed': 'Portuguese', 'Studio': 'WarnerBrothers', 'Number of discs': '90'}\nReview Text: Loved the show when it was on TV and I still love it.  I am hearing impaired and missed a lot of dialog when it was on so I was looking forward to watching these with the captioning.  Many of the seasons do not have this option.  It's great to watch without commercials!  With so little to watch on TV these days, this has been a real treat for me.  I just wish the captioning wasn't missing on so many seasons.\nReview Title: Captions for Hearing Impaired are missing on some.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2013/12/13\nAverage Rating: 4.0\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Daniel Petrie'], 'Producers': ['David W. Rintels'], 'Starring': ['Jeff Fahey', 'Morgan Freeman', 'Laurie Metcalf'], 'Studio': ['Fisher Klingenstein Films']}\nReview Text: This was a very good movie, however I found it a bit slow moving in parts.  The acting was very good and I'm a huge fan of Morgan Freeman.  His part in this movie didn't seem to be awesome; it wasn't him - it was the part!  Not enough punch for me.  He's capable of so much more but the opportunity to give more wasn't there.\nReview Title: OK, but I expected more.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Ghost and the Darkness\nReview Date: 2015/03/20\nStore: Michael Douglas  (Actor),     Val Kilmer  (Actor),     Stephen Hopkins  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Product Description', \"Only the most incredible parts of the story are true. Michael Douglas and Val Kilmer star in this tense, terrific and true adventure set in 1896 East Africa. There, two lions on man-eating rampage have shut down the construction of a railway. The beasts hunt together, showing no fear of man or fire. What's more, they're killing for sport rather than for food-and they have an almost supernatural knack for knowing what traps await them. Big-game hunter Remington (Douglas) and construction engineer Patterson (Kilmer) set out to stop these unstoppable monsters. But, in this astonishing tale of man against beast, the hunters become the hunted.\", 'Amazon.com', \"Val Kilmer stars as Lt. Col. John Patterson, a 19th-century Irish engineer drafted by Britain's railroad bosses to build a trestle bridge over an African river, thus expanding the empire a tiny bit more. In Tsavo, Patterson is instantly hailed for killing a man-eating lion that had been making life hell for native workers. But morale sinks when a pair of unstoppable big cats devour more men and destroy the project. Along comes an Ahab-like, expatriate American hunter (Michael Douglas) to help Patterson face the almost preternatural powers of the two killers. The script by William Goldman (\", 'Butch Cassidy and the Sundance Kid', ') is based on fact, though the film owes more to Spielberg (specifically to', 'Jaws', ') than history. There are also suggestive echoes of Kipling and Conrad in the material and characters, and there are hints of emotional complexity and psychological nuance that make one wish this could have been a great film instead of a merely fun one.', '--Tom Keogh']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Contributor': 'Kurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily MortimerKurt Egelhof, John Kani, Bernard Hill, Om Puri, Tom Wilkinson, William Goldman, Michael Douglas, Henry Cele, Brian McCardie, Satchu Annamalai, Stephen Hopkins, Teddy Reddy, Val Kilmer, Emily Mortimer   See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 49 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 4 Ounces', 'Director': 'Stephen Hopkins', 'Media Format': 'Multiple Formats, Color, Letterboxed, AC-3, Closed-captioned, NTSC, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 1, 1998', 'Actors': 'Michael Douglas, Val Kilmer, Tom Wilkinson, John Kani, Bernard Hill', 'Subtitles': 'Spanish', 'Studio': 'Paramount', 'Writers': 'William Goldman', 'Number of discs': '1'}\nReview Text: Great (older) movie.  Great effects for the time it was made.  Beautiful country in the background.\nReview Title: A must see movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ramón Menéndez'], 'Producers': ['Tom Musca'], 'Starring': ['Edward James Olmos', 'Lou Diamond Phillips', 'Rosanna DeSoto'], 'Studio': ['Warner Bros. Domestic Televisi']}\nReview Text: Great movie - especially for it's time.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Martin Smith'], 'Producers': ['Andrew A. Kosove', 'Broderick Johnson', 'Richard Ingber'], 'Starring': ['Harry Connick', 'Jr.', 'Ashley Judd', 'Nathan Gamble']}\nReview Text: Good family movie.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/11\nAverage Rating: 4.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Marty Callner'], 'Producers': ['Marty Callner', 'David Steinberg', 'Randall Gladstein'], 'Starring': ['Robin Williams'], 'Studio': ['HBO']}\nReview Text: Not the best work I've seen from Robin Williams.  I tried to laugh but it just didn't work for me.\nReview Title: Not the best work I've seen from Robin Williams\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/05/31\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Jason Moore'], 'Producers': ['Paul Brooks', 'Elizabeth Banks', 'Max Handelman'], 'Starring': ['Anna Kendrick', 'Skylar Astin', 'Rebel Wilson'], 'Studio': ['Universal Pictures']}\nReview Text: Entertaining enough.  Good music.  I liked Pitch Perfect 2 better.\nReview Title: Entertaining\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2015/08/23\nAverage Rating: 3.0\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Duke', 'Daryl'], 'Producers': ['Georgia Jeffries'], 'Starring': ['Shelley Long', 'Dean Stockwell'], 'Studio': ['Deep Cuts']}\nReview Text: Although this is an older movie, it is relevant and done well.  Shelly Long is quite good in the roll of the adult woman who begins to remember tragic events involving her father.  It takes a very strong woman to do what this character did.  It makes me wonder how many children's lives were damaged in the interim time period.\nReview Title: Courage at it's best.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Norma Rae: 35th Anniversary\nReview Date: 2016/06/06\nStore: Sally Field  (Actor),     Beau Bridges  (Actor),     Martin Ritt  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nProduct Description: ['A union organizer from up North recruits a divorced cotton-mill worker down South. Directed by Martin Ritt. Best actress Oscar for Field.']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': 'FOXS2289377BR', 'Director': 'Martin Ritt', 'Media Format': 'Multiple Formats, Blu-ray, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '2 hours and 5 minutes', 'Release date': 'April 1, 2014', 'Actors': 'Sally Field, Beau Bridges, Ron Leibman, Pat Hingle, Barbara Baxley', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Producers': 'Tamara Asseyev, Alexandra Rose', 'Studio': '20th Century Fox', 'Writers': 'Irving Ravetch, Harriet Frank Jr.', 'Number of discs': '1'}\nReview Text: LOVE this movie.  I'm planning to have my granddaughters watch it.  Sally Field is great and the story is inspirational for women.\nReview Title: Great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Monk: The Complete Series\nReview Date: 2016/06/06\nStore: Format: DVD\nCategories: Movies & TV, Studio Specials, Universal Studios Home Entertainment, All Universal Studios Titles\nProduct Description: ['He’s obsessive. He’s compulsive. He’s Monk, “TV’s most original sleuth ever” (Howard Rosenberg, Los Angeles Times). Primetime Emmy and Golden Globe winner Tony Shalhoub cleans up crime and grime galore in the beloved series that critics hailed as “fresh, exciting and utterly original” (Chicago Tribune). Once upon a time Adrian Monk was a rising star with the San Francisco Police Department, but he lost his nerve, his mind and then his badge. Now, this obsessive-compulsive detective is determined to get back on the force by solving one crime at a time in “the best detective show to come along in decades” (New York Post). Featuring hilarious guest stars, including Stanley Tucci, John Turturro and Sarah Silverman, this 32-disc collection includes every episode from all 8 seasons with hours of behind-the-scenes bonus features, making Monk: The Complete Series a compulsively essential addition to any DVD obsessive’s collection.']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.5 x 8.5 x 7 inches; 2.6 Pounds', 'Media Format': 'NTSC', 'Studio': 'Universal Studios Home Entertainment'}\nReview Text: I LOVE Monk!\nReview Title: I love Monk\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sybil (Two-Disc Special Edition)\nReview Date: 2016/06/06\nStore: Sally Field  (Actor),     Joanne Woodward  (Actor),     Daniel Petrie  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\nProduct Description: ['Product Description', 'Sybil (1976) (DVD)', 'Based on a true story, this telefilm debut in 1976 to extraordinary response. Sally Field - in an Emmy Award winning and career-turning performance - portrays Sybil, a woman suffering from multiple personality disorder who develops over 16 distinct personalities in order to cope and escape haunting memories of her harrowing childhood. Joanne Woodward plays the understanding and compassionate psychiatrist that helps Sybil confront her horrific past and eliminate her demons.', ']]>', 'Amazon.com', 'The word \"landmark\" is fairly used in the case of', 'Sybil', \": this 1976 TV movie brought new frankness to television, it raised the quality bar for the made-for-television movie, and it utterly changed the career of a future Oscar-winning actress. The film was based on the bestselling nonfiction book about a multiple-personality patient and her exhaustive therapy. It opens with a brilliant series of scenes that suggest how a young woman named Sybil (Sally Field) experiences unexplained blackouts, which brings her to the attention of a psychiatrist, Dr. Wilbur (Joanne Woodward). The film unfolds around the searching therapy sessions, laced with flashbacks to Sybil's toxic childhood. There's also a tentative romance between the lonely Sybil and a manchild (Brad Davis) who lives across the alley. Most notably, of course, there are the appearances of Sybil's alternate personalities, who express her strangled emotional life. Stewart Stern's sensitive script seems to flow organically from one scene to the next, and director Daniel Petrie frequently allows the camera to observe the acting acrobatics in long, challenging takes.\", 'Woodward, who won an Oscar for playing a multiple-personality patient in', 'The Three Faces of Eve', ', is all nurturing warmth as the steadfast doctor. But really this film was a sober coming-out party for Sally Field, who astonished viewers at the time by erasing all memories of', 'Gidget', 'and', 'The Flying Nun', \", the bubblegum roles she'd mostly been known for. Field's work is anguished but non-actor-y, and despite the character's hidden personalities, she seems as clear as day in her performance. The production won four Emmys, not surprisingly including nods for Field, Stern, and Outstanding Special (Drama).\", 'The 187-minute movie takes up one disc; the second disc has informative featurettes about the making of the film.', 'Examining Sybil', \"is an absorbing hour-long documentary with comments from Field and Woodward, as well as executive producer Peter Dunne. It is dominated by the spellbinding storytelling of Stewart Stern, who developed the screenplay by spending time with the real Dr. Wilbur and listening to tapes of her sessions with Sybil. His tale of Sally Field's unlikely audition triumph is a small movie in itself.\", 'The Paintings of Sybil', 'presents a generous selection of paintings by the real Sybil (who became a professor of art), along with recollections by one of her friends. Something listed on the DVD cover as \"Sybil Therapy Session\" is misleadingly titled, suggesting some kind of actual footage or transcript of the real Sybil and her treatment; in fact, it\\'s Stewart Stern describing the harrowing process of listening to the doctor\\'s tapes. The real Sybil (now deceased) remains protected, as she should.', '--Robert Horton']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Documentary/Biography', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Daniel Petrie, Flora Rheta Schreiber, Sally Field, Brad Davis, Jacqueline Babbin, Joanne Woodward', 'Language': 'Unqualified, English (Dolby Digital 2.0 Surround)', 'Runtime': '3 hours and 6 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.04 Ounces', 'Item model number': '70145', 'Director': 'Daniel Petrie', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '3 hours and 6 minutes', 'Release date': 'July 18, 2006', 'Actors': 'Sally Field, Joanne Woodward, Brad Davis', 'Subtitles': 'French, Spanish', 'Producers': 'Jacqueline Babbin', 'Studio': 'WarnerBrothers', 'Writers': 'Flora Rheta Schreiber', 'Number of discs': '2'}\nReview Text: One of the best movies ever made and Sally Field is outstanding!  I've watched this movie many times and never tire of it.\nReview Title: Outstanding movie.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: To Kill a Mockingbird [Blu-ray]\nReview Date: 2016/06/06\nStore: Gregory Peck  (Actor),     Mary Badham  (Actor),     Robert Mulligan  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray, Drama\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, DVD Movie, Harper Lee, Blu-ray Movie, Atticus Finch', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Russell Harlan, Brock Peters, Frank Overton, James Anderson, Robert Duvall, Mary Badham, Alan J. Pakula, Phillip Alford, Horton Foote, Robert Mulligan, Collin Wilcox, John Megna, Gregory Peck, Rosemary MurphyRussell Harlan, Brock Peters, Frank Overton, James Anderson, Robert Duvall, Mary Badham, Alan J. Pakula, Phillip Alford, Horton Foote, Robert Mulligan, Collin Wilcox, John Megna, Gregory Peck, Rosemary Murphy   See more', 'Language': 'English (DTS-HD 2.0), French (DTS-HD 2.0), English (DTS-HD Master Audio 5.1)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '6.75 x 5.5 x 0.5 inches; 2.08 Ounces', 'Item model number': '33732455', 'Director': 'Robert Mulligan', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'May 26, 2015', 'Actors': 'Gregory Peck, Mary Badham, Phillip Alford, John Megna, Frank Overton', 'Subtitles': 'French, Spanish', 'Producers': 'Alan J. Pakula', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Horton Foote', 'Number of discs': '1'}\nReview Text: Can't say enough about this classic.  Highly recommended - even my 7-year-old granddaughter liked this (even though it's not in color!).\nReview Title: A Classic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Judy Moody and the NOT Bummer Summer\nReview Date: 2016/06/06\nStore: Heather Graham  (Actor),     Jordana Beatty  (Actor),     John Schultz  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Kids & Family\nProduct Description: ['Product Description', 'Get ready to score extra thrill points and mega-laughs with this irresistible family comedy based on the best-selling book series! Feisty, fearless Judy Moody is looking forward to the most super-duper, double-rare summer vacation ever. The trouble is, her parents are called out of town and her BFFs are going away with their own families. That leaves Judy trapped at home with her pesky brother Stink under the watchful eye of Aunt Opal (Heather Graham). But with a little playful planning - and a lot of imagination - Judy turns a snoresville summer into the way-not-boring adventure of a lifetime!', 'Amazon.com', 'Based on the Judy Moody books by Megan McDonald,', 'Judy Moody and the Not Bummer Summer', \"is about a third-grade girl with big ideas for an exciting summer full of dares, scares, and thrills with her three best friends. Judy's carefully crafted plans for a summer-long thrill contest are quickly dashed when she discovers that two of her friends, Rocky and Amy, are going away for the summer, and she'll be left at home with second-best friend Frank Pearl and her brother Stink. Things get even worse when her parents inform her that they're headed to California and are leaving her and Stink under the care of their Aunt Opal, whom Judy's never even met. It turns out that Aunt Opal is far from your average aunt; she's actually pretty cool and she's full of surprises that, when mixed with Judy's natural passion for adventure and action, might just yield some very unexpected results. The film does a good job of preserving the feel and attitude of the Judy Moody character with her frequent flights of fancy, but its brief segments of animation, presumably intended to mirror the cartoonish illustrations that pepper the books, seem somewhat abrupt and awkward. Kids ages 7 to 10 will find laughs and adventure in this 91-minute film, but it's definitely not aimed at older kids or adults, who will find it simply adequate.\", '--Tami Horiuchi']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Jordana Beatty, Heather Graham, John Schultz', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'FOXS2281293DVD', 'Director': 'John Schultz', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'October 11, 2011', 'Actors': 'Heather Graham, Jordana Beatty', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Studio': 'Relativity Media', 'Number of discs': '1'}\nReview Text: My granddaughter loves these books and reads them faster than we can buy them.\nReview Title: Great books\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/09/17\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Producers': ['David Bartis', 'Gene Klein', 'Aaron Korsh', 'Doug Liman', 'Nathan Perkins', 'Daniel Arkin', 'Rick Muirragui', 'Jonathan Hackett', 'Patrick J. Adams', 'Gabriel Macht', 'Genevieve Sparling', 'Ethan Drogin', 'Jon Cowan', 'Anton Cropper', 'Lilla Zuckerman', 'Nora Zuckerman', 'Gavin Barclay', 'Kevin Bray', 'Silver Tree', 'Desmond Paes', 'Chris Downey', 'Ryan Kennedy', 'Paul Redford', 'Sean Jablonski', 'Steve Wakefield', 'Mark Winemaker', 'Chevy Chen', 'Igor Srubshchik', 'Kyle Long', 'Natalie Urquhart', 'Jonathan Starch'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Rick Hoffman'], 'Studio': ['USA']}\nReview Text: This show was recommended to me and I was surprised to find it very intriguing.  The main characters have great chemistry and it's fun to watch them twist and bend things to win their cases while keeping a huge secret between themselves.  I also love being able to watch episode after episode without interruption when the rest of television has crap on!\nReview Title: This will keep you guessing!  Great Show!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/11\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Gina Torres']}\nReview Text: My friend turned me on to this show and it is excellent.  I love the cast of characters and the twists and turns of the cases.  I am so hooked!  Match and Adams are top notch in their roles.  You really have to pay attention to keep things straight.\nReview Title: Excellent Show!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/11\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Michael Smith', 'Anton Cropper', 'Christopher Misiano', 'Kevin Bray', 'Roger Kumble', 'Silver Tree', 'John Scott', 'Cherie Nowlan', 'Gabriel Macht', 'Patrick J. Adams'], 'Starring': ['Gabriel Macht', 'Patrick J. Adams', 'Rick Hoffman'], 'Studio': ['USA']}\nReview Text: Match and Adams are top notch in their roles.  You really have to pay attention to keep things straight.  This is not a show to watch while falling asleep in the evening - you'll miss too much.  The guest stars are also top notch.  The writers for this show deserve awards for this!\nReview Title: Don't fall asleep during this excellent show.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nReview Date: 2016/10/11\nAverage Rating: 3.1\nProduct Details: {'Content advisory': ['Violence', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: Low', 'English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', '日本語', 'Português', 'Deutsch', 'Français'], 'Subtitles': ['English [CC]', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'Italiano', '日本語', 'Português'], 'Directors': ['Woody Allen'], 'Producers': ['Erika Aronson', 'Helen Robin'], 'Starring': ['Woody Allen', 'Miley Cyrus', 'Elaine May']}\nReview Text: So far I've only watched one episode.  I'm trying to ready myself for episode two.  I was disappointed in this show.  I'm not a fan of the way it is filmed and it seemed to be a bit dry.  The humor wasn't that good and the jokes are far and few between (or I'm missing something).  I always try to watch two or three episodes before making a decision on a series, but I'm finding it hard to get to the second episode of this one.\nReview Title: Disappointed in first episode.\nRating: 2.0\n--------------------------------------------------",
  "raw_response": "**Genuine Preferences and Patterns:**\n\n- **Media Format:** Strong preference for DVDs and Blu-rays, especially boxed sets.\n- **Genres:** Favors drama and action-adventure genres, particularly those with deep narratives and character development.\n- **Show Themes:** Enjoys medical dramas, mysteries, and poignant stories highlighting personal struggles and social issues.\n- **Rating Tendencies:** Generally positive ratings (4.7+ average), indicating satisfaction with purchases; shows high appreciation for compelling performances and storytelling.\n- **Actor Affinity:** Exhibits admiration for actors like Sally Field and Morgan Freeman, suggesting a preference for films featuring strong performances from notable talent.\n- **Family-Friendly Content:** Shows interest in family films, indicating a preference for content that can be enjoyed with younger viewers (children/grandchildren).\n- **Critique Sensitivity:** Sensitive to accessibility features (like captioning for hearing impairment) and expresses disappointment when these are lacking. \n- **Nostalgia for Classic TV:** Engages with classic and older films/shows, indicating a fondness for nostalgia and established storytelling.\n- **High Rewatch Value:** Enjoys rewatching content, particularly well-crafted narratives and character-driven plots that provide depth. \n\nOverall, this individual exhibits a strong inclination towards quality dramas and engaging stories across various formats, valuing both emotional impact and accessibility.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Grab a blanket and popcorn and go potty first!",
    "text": "This was a very good movie with excellent acting and very scenic throughout.  It takes place in the cold - which made me feel cold while watching.  My only con is that it is a long movie, so get your popcorn ready and go potty before you start.",
    "images": [],
    "asin": "B01AB7GJ4M",
    "parent_asin": "B01AB7GJ4M",
    "user_id": "AGIK5W45UYI3CJRVZODRGSEPJG7A",
    "timestamp": "2017-01-31 14:33:21",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 4.7,
    "rating_number": 40274,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/289324fe4891294d383ed45f242d60d3737f127d01bf3314b334376e752c3896._RI_TTW_SX360_FMwebp_.jpg",
        "480w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/289324fe4891294d383ed45f242d60d3737f127d01bf3314b334376e752c3896._RI_TTW_SX480_FMwebp_.jpg",
        "720w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/289324fe4891294d383ed45f242d60d3737f127d01bf3314b334376e752c3896._RI_TTW_SX720_FMwebp_.jpg",
        "1080w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/289324fe4891294d383ed45f242d60d3737f127d01bf3314b334376e752c3896._RI_TTW_SX1080_FMwebp_.jpg",
        "1440w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/289324fe4891294d383ed45f242d60d3737f127d01bf3314b334376e752c3896._RI_TTW_SX1440_FMwebp_.jpg",
        "1920w": "https://images-na.ssl-images-amazon.com/images/S/pv-target-images/289324fe4891294d383ed45f242d60d3737f127d01bf3314b334376e752c3896._RI_TTW_SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Content advisory": [
        "Nudity",
        "violence",
        "alcohol use",
        "smoking",
        "foul language",
        "sexual content"
      ],
      "Audio languages": [
        "English Dialogue Boost: High",
        "English",
        "English Dialogue Boost: Medium"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Alejandro G. Iñárritu"
      ],
      "Producers": [
        "Arnon Milchan",
        "Steve Golin",
        "Alejandro G. Iñárritu",
        "Mary Parent",
        "Keith Redmon"
      ],
      "Starring": [
        "Leonardo DiCaprio",
        "Tom Hardy",
        "Domhnall Gleeson"
      ],
      "Studio": [
        "New Regency / Anonymous Content / M Productions / Appian Way"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}