{
  "user_id": "AE26N5BRXPJ6PH2RXRAZFSMUJ2HQ",
  "summary": "=== Purchase Information ===\nProduct Title: The Most Wonderful Time of the Year\nReview Date: 2015/05/25\nStore: Henry Winkler  (Actor),     Brooke Burns  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Romantic\nProduct Description: ['Five-time Emmy nominee and Golden Globe winner Henry Winkler stars in The Most Wonderful Time of the Year, the story of what happens when you open your heart to the power of Christmas. Disenchanted single mom Jennifer Cullen (Brooke Burns) is a Scroogette when it comes to anything Christmas. In fact, even her six-year-old son, Brian, is having trouble believing in Santa Claus. But when her Uncle Ralph (Henry Winkler) visits and brings a fellow passenger from his flight named Morgan Derby (Warren Christie), Jennifer s dubious heart awakens to the possibility that perhaps Christmas really does hold miracles. It s uplifting and laugh-packed and a story that will inspire the whole family to believe.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Henry Winkler, Brooke Burns', 'Language': 'Unqualified', 'Runtime': '1 hour and 27 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '782580', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 27 minutes', 'Release date': 'October 13, 2009', 'Actors': 'Henry Winkler, Brooke Burns', 'Studio': 'CINEDIGM', 'Number of discs': '1'}\nReview Text: watch this movie over and over again, just love it.\nReview Title: just love it.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Christmas Card (Hallmark)\nReview Date: 2015/05/25\nStore: Edward Asner  (Actor),     Brian Robinson (XV)  (Actor),     Stephen Bridgewater  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['Once in a while; a movie comes along that reminds us how powerful love can be. In the midst of war in Afghanistan; Captain Codey Cullen (John Newton; \"Desperate Housewives\") is touched by a lovely card sent by Faith Spelman (\"The Chris Isaak Show\") from the small picturesque town of Nevada City; California. As months pass; the card never leaves his side; giving him the strength to survive and setting him on a mission to find her. When Cody returns to the States; he finds himself coincidentally welcomed by her family and friends; but he remains hesitant to reveal the fateful connection that brought him to her. As a new Christmas approaches; Cody has one last opportunity to prove his courage - by taking a chance on love and finding the woman; the home; and the life he\\'s always wanted.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Rachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice Evans, Lois Nettleton, Nick Hodaly, Kelly Stringfellow, John Newton (II), Lisa CornelisonRachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.51 x 7.56 inches; 2.4 Ounces', 'Item model number': '80598', 'Director': 'Stephen Bridgewater', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '1 hour and 24 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Edward Asner, Brian Robinson (XV), John Newton (II), Alice Evans, Lois Nettleton', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nReview Text: My favorite Christmas type movie.. I just love it. It's not even just a Christmas movie, but a good family type movie to watch anytime.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Butcher's Wife [DVD]\nReview Date: 2018/02/20\nStore: Demi Moore  (Actor),     Jeff Daniels  (Actor),     Terry Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: [\"The Butcher's Wife (Widescreen) (Bilingual)\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Demi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson Baker, Stephanie Laurence, Sam Menning, Helen Hanft, Steve Love, Frank Tidy, Luis Avalos, Miriam Margolyes, Margaret Colin, Max Perlich, Barry NeikrugDemi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson…  See more', 'Language': 'English, French', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Terry Hughes', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'October 23, 2001', 'Actors': 'Demi Moore, Jeff Daniels, George Dzundza, Mary Steenburgen, Frances McDormand', 'Dubbed': 'English, French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: one of my favorite movies, had to have it, so glad you had it in your inventory.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mask\nReview Date: 2018/02/20\nStore: Cher  (Actor),     Eric Stoltz  (Actor),     Peter Bogdanovich  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, DTS\nProduct Description: ['Acclaimed filmmaker Peter Bogdanovich directed this heartwarming and inspirational film based on the real-life story of Rocky Dennis (Eric Stoltz), a terribly disfigured but highly sensitive and intelligent teenager. Motivated by his loving mother, Rusty (Cher), and her boyfriend, Gar (Sam Elliott), Rocky ultimately overcomes pain, loneliness and prejudice to become a role model to his classmates and teachers alike.Bonus Content:', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, DVD Movie, Blu-ray Movie', 'Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more\", 'Contributor': 'Peter Bogdanovich, Cher, Eric Stoltz, Sam Elliott', 'Language': 'Unqualified, English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), English (DTS 5.1)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '1022788', 'Director': 'Peter Bogdanovich', 'Media Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen\", 'Run time': '2 hours and 7 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Cher, Eric Stoltz, Sam Elliott', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: another of my favorite movies. glad you had it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: By the Light of the Silvery Moon\nReview Date: 2018/02/20\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['Product Description', 'By the Light of the Silvery Moon (DVD)', '\"On Moonlight Bay\" stars Doris Day and Gordon MacRae are back together in top tune-crooning form for the further adventures of a small-town family turning the corner from World War I into the Roaring \\'20s. Year: 1953 Director: David Butler Starring: Doris Day, Gordon MacRae, Billy Gray', ']]>', 'Amazon.com', 'The huge popularity of the nostalgic', 'On Moonlight Bay', 'prompted this 1953 sequel, which recaptures the first film\\'s small-town, post-WWI spirit. Because young lovers Doris Day and Gordon MacRae are already together, the movie needs some sort of trumped-up conflict to separate them for a while; it comes with MacRae\\'s decision to postpone their wedding until he gets his financial legs. Yawn. But don\\'t worry, the subplots abound, including younger brother Billy Gray pilfering a prize Thanksgiving turkey, and dad Leon Ames suspected of romancing a visiting French music-hall star. Naturally there are vintage songs, including umpteen renderings of the classic title song (you won\\'t need the bouncing ball to sing along) and Day and MacRae casually bopping out new lyrics to \"Ain\\'t We Got Fun.\" Also returning for the sequel are Rosemary DeCamp as the patient mother and shameless scene-stealer Mary Wickes as the bossy maid. And check it out: future talk-show host Merv Griffin cheerleading during the finale at an outdoor ice rink. Day and MacRae twinkle so aggressively that they sometimes resemble salesmen for a particular kind of Hollywood backlot America that probably never existed, but the whole thing is almost impossible to resist.', '--Robert Horton']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Various', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.72 Ounces', 'Item model number': '2231834', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 41 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: love old Doris day movies, glad you had it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: On Moonlight Bay\nReview Date: 2018/02/20\nStore: Doris Day  (Actor),     Gordon MacRae  (Actor),     Roy Del Ruth  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['Product Description', 'On Moonlight Bay (DVD)', \"A happy screenful of sun-kissed melody and kiss-by-moonlight romance! After moving to Indiana, young Marjorie Winfield begins a relationship with William Sherman, who lives across the street. Marjorie is a tom-boy, and her father has traditional views not shared by William. Marjorie is forced to learn to dance, despite her and Williams' shared love for baseball. Starring Doris Day and Gordon MacRae.\", ']]>', 'Amazon.com', \"America's love affair with clean-cut, tomboyish, freckle-faced Doris Day got a boost with\", 'On Moonlight Bay', \", a period piece from 1951. The film's masterstroke: put Doris in an old-timey musical full of small-town family values and vintage songs. Another inspiration: pair off Doris again with that chesty-voiced man's man and future Rodgers and Hammerstein stalwart, Gordon MacRae (they'd already made\", 'Tea for Two', 'and', 'The West Point Story', \"). The story is drawn from Booth Tarkington's Penrod tales, although the movie is also under the sway of\", 'Meet Me in St. Louis', '. The WWI-era family is anchored by parents Leon Ames (the pop from', 'St. Louis', ') and Rosemary De Camp, with echt-Fifties boy Billy Gray (later of', 'Father Knows Best', \") as Day's bratty younger brother. Mary Wickes, cinema's eternal sassy housekeeper, provides comic relief. So does radio crooner Jack Smith, who would later host\", 'You Asked for It', \"on TV for many years, as Day's maladroit suitor (he's really funny--too bad Preston Sturges never got a hold of him). The material is so relentlessly wholesome you might have to pinch yourself that anybody really believed it, but audiences sure wanted to. The film's popularity prompted a sequel,\", 'By the Light of the Silvery Moon', ', with most of the cast intact.', '--Robert Horton']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Leon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del RuthLeon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del Ruth  See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.88 Ounces', 'Item model number': '2231837', 'Director': 'Roy Del Ruth', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Doris Day, Gordon MacRae, Jack Smith, Leon Ames, Rosemary DeCamp', 'Subtitles': 'English, Spanish', 'Producers': 'William Jacobs', 'Studio': 'WarnerBrothers', 'Writers': 'Booth Tarkington, Jack Rose', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Message in a Bottle (Keepcase)\nReview Date: 2018/02/20\nStore: Robin Wright  (Actor),     John Savage  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Message in a Bottle (DVD)', 'Grieving widower Garret Blake builds boats for a living. Theresa Osborne, a lonely divorcee and researcher for the Chicago Tribune, tracks down Garret after finding a message he wrote inside a bottle on a Cape Code beach and profoundly touched her heart.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama/Love & Romance, Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Denise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis MandokiDenise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis Mandoki  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 11 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000112599DVD', 'Director': 'Luis Mandoki', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Kevin Costner, Robin Wright, John Savage, Illeana Douglas, Robbie Coltrane', 'Subtitles': 'English', 'Producers': 'Denise Di Novi, Jim Wilson, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Gerald DiPego', 'Number of discs': '1'}\nReview Text: this movie is a classic, love your inventory.\nReview Title: love your inventory\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Once Around [DVD]\nReview Date: 2018/07/07\nStore: Richard Dreyfuss  (Actor),     Holly Hunter  (Actor),     Lasse Hallstrom  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Richard Dreyfuss and Holly Hunter lead an all-star cast in this critically acclaimed tale of life, love and chance. Jilted by her boyfriend, Renata (Hunter), the oldest daughter of a close-knit Italian-American family, falls in love with Sam (Dreyfuss), an abrasive and forcefully charming businessman.But neither her spirited sister (Laura San Giacomo), her down-to-earth father (Danny Aiello), or her supportive mother (Gena Rowlands) can tolerate Sam's often obnoxious intrusion into their family circle.Aggressive and overwhelmingly generous, Sam proceeds - with only the best intentions - to disrupt and nearly demolish Renata's family. Love, humor and forgiveness go once more around as the Bellas try to balance Renata's happiness with their family's survival in this funny and often touching story, directed by Lasse Hallström.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Contributor': 'Laura San Giacomo, Lasse Hallstrom, Danny Aiello, Gena Rowlands, Richard Dreyfuss, Holly Hunter', 'Initial release date': '2010-06-01', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '25192422027', 'Director': 'Lasse Hallstrom', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Richard Dreyfuss, Holly Hunter, Gena Rowlands, Danny Aiello, Laura San Giacomo', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: didn't watch yet, but bought cuz I love this movie.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Postman (Keep Case Packaging)\nReview Date: 2018/07/07\nStore: Will Patton  (Actor),     Larenz Tate  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\nProduct Description: ['Postman, The (DVD)', \"Academy Award-winner Kevin Costner directs and stars in this post-apocalyptic thriller. In 2013 anarchy reigns, until a solitary wanderer discovers a postman's uniform, delivers letters ... and rekindles a spirit of revolution.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Tom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz TateTom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz Tate  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5822703', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 57 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Kevin Costner, Will Patton, Larenz Tate, Olivia Williams, Scott Bairstow', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, English', 'Producers': 'Jim Wilson, Steve Tisch, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Eric Roth, Brian Helgeland', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: this. is a great movie, but have not watched this dvd yet\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dances With Wolves\nReview Date: 2018/07/07\nStore: Mary McDonnell  (Actor),     Graham Greene  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Dances Wolves 25 Anniversary (RPKG/DVD)', 'Set in 1863, a solitary U.S. cavalryman outposted in the remote frontier learns the ways of the Sioux. Though his misconceptions about them are quickly dispelled, he must protect them from the ravages of his fellow cavalrymen, come to \"civilize\" the far frontier.', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 5 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant, Floyd Red Crow Westerman', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Jake Eberts, Kevin Costner, Jim Wilson', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Blake', 'Number of discs': '1'}\nReview Text: I just watched this on tv, first time in years, I love it, but have not watched this dvd yet.\nReview Title: fabulous movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Always [DVD]\nReview Date: 2018/07/07\nStore: Richard Dreyfuss  (Actor),     Holly Hunter  (Actor),     Steven Spielberg  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', 'Steven Spielberg directs this heartwarming romantic adventure USA Today calls \"a winner.\" Pete Sandich (Richard Dreyfuss) is a legendary pilot with a passion for daredevil firefighting. However Dorinda (Holly Hunter), the woman he loves, and Al (John Goodman), Pete\\'s best friend, know that legends can\\'t take risks forever. After sacrificing himself to save Al, the ace pilot faces his most challenging mission: helping Dorinda move on with her life. Breathtaking cinematography and exhilarating aerial choreography highlight this compelling adventure that co-stars Brad Johnson and features a special appearance by Audrey Hepburn.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"Considered by many to represent a low point in Steven Spielberg's career, 1990's\", 'Always', \"did suggest something of a temporary drift in the director's sensibility. A remake of the classic Spencer Tracy film\", 'A Guy Named Joe', ',', 'Always', \"stars Richard Dreyfuss as a Forest Service pilot who takes great risks with his own life to douse wildfires from a plane. After promising his frightened fiancée (Holly Hunter) to keep his feet on the ground and go into teaching, Dreyfuss's character is killed during one last flight. But his spirit wanders restlessly, hopelessly attached to and possessive of Hunter, who can't see or hear him. Then the real conflict begins: a trainee pilot (Brad Johnson), a likable doofus, begins wooing a not-unappreciative Hunter--and it becomes Dreyfuss's heavenly mandate to accept, and even assist in, their budding romance. The trouble with the film is a certain airlessness, a hyper-inventiveness in every scene and sequence that screams of Spielberg's self-education in Hollywood classicism. Unlike the masters he is constantly quoting and emulating in\", 'Always', \", he forgets to back off and let the movie breathe on its own sometimes, which would better serve his clockwork orchestration of suspense and comedy elsewhere. Still, there are lovely passages in this film, such as the unforgettable look on Dreyfuss's face a half-second before fate claims him. John Goodman contributes good supporting work, and Audrey Hepburn makes her final screen appearance as an angel.\", '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Romance', 'Format': 'Multiple Formats, Color, Letterboxed, Widescreen, NTSC', 'Contributor': 'Audrey Hepburn, Brad Johnson, Steven Spielberg, Frank Marshall, Jerry Belson, Keith David, Marg Helgenberger, Kathleen Kennedy, Roberts Blossom, John Goodman, Ed Van Nuys, Richard Dreyfuss, Holly HunterAudrey Hepburn, Brad Johnson, Steven Spielberg, Frank Marshall, Jerry Belson, Keith David, Marg Helgenberger, Kathleen Kennedy, Roberts Blossom, John Goodman, Ed Van Nuys, Richard Dreyfuss, Holly Hunter  See more', 'Initial release date': '1999-07-20', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 4.1), French (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.05 Ounces', 'Item model number': '1020556', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, Color, Letterboxed, Widescreen, NTSC', 'Run time': '2 hours and 3 minutes', 'Release date': 'July 20, 1999', 'Actors': 'Richard Dreyfuss, Holly Hunter, John Goodman, Audrey Hepburn, Brad Johnson', 'Subtitles': 'English', 'Producers': 'Steven Spielberg, Frank Marshall, Kathleen Kennedy', 'Studio': 'Studio Distribution Services', 'Writers': 'Jerry Belson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a wonderful movie I have not seen in years, and have not watched the dvd yet.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mamma Mia! The Movie\nReview Date: 2018/09/15\nStore: Meryl Streep  (Actor),     Pierce Brosnan  (Actor),     Phyllida Lloyd  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: ['Product Description', \"Sophie has just one wish to make her wedding perfect: to have her father walk her down the aisle. Now she just has to find out who he is. Join the music, laughter and fun of the irresistibly charming Mamma Mia! The Movie. Academy Award-winner Meryl Streep leads an all-star cast, including Pierce Brosnan and Colin Firth—as well as up-and-comers Amanda Seyfried and Dominic Cooper—in this musical celebration of mothers, daughters and fathers, and true loves lost and new ones found. Based on the Broadway smash-hit and filled with the ABBA songs you know and love, it's the feel-good experience that will have you singing and dancing over and over again.Bonus Content:\", 'Sing-Along', 'Sing-Along', 'Deleted Musical Number: \"The Name of the Game\"', 'Deleted Musical Number: \"The Name of the Game\"', 'Feature Commentary with Director Phyllida LLoyd', 'Feature Commentary with Director Phyllida LLoyd', 'Amazon.com', 'The delirious sight of Meryl Streep leading a river of multigenerational women singing \"Dancing Queen\" is one of the high points of', 'Mamma Mia!', ', the musical built around the songs of the hugely popular pop group ABBA. The plot sets in motion when Sophie (Amanda Seyfried,', 'Mean Girls', \"), daughter of Donna (Streep), sends a letter to three men, inviting them to her wedding--because after reading her mother's diary, she suspects that one of them is her father. When all three arrive at the Greek island where Donna runs a hotel, Donna flips out and finds that passions she thought she'd laid aside are coming back to life. But let's face it, the plot is not the point--it's a ridiculous contrivance that provides an excuse for the characters to sing the massive hits of ABBA. Regrettably, first-time film director Phyllida Lloyd (who directed the original stage production) has drawn over-the-top performances from everyone involved, even Streep; every production number hammers its exuberance into your eyeballs. Which is too bad, because\", 'Mamma Mia!', \"is a rarity: A middle-aged love story. The kids start things off, but the story is really about Streep and the three guys (former James Bond Pierce Brosnan, former Mr. Darcy Colin Firth, and Swedish star Stellan Skarsgard), as well as Donna's best friends (Christine Baranski, best known from the TV show\", 'Cybill', ', and Julie Walters,', 'Calendar Girls', \"). It's a romantic comedy aimed at the people who were around when all these songs were new, and that's an age group Hollywood largely ignores. For that alone,\", 'Mamma Mia!', 'deserves to find an audience. --', 'Bret Fetzer', 'Stills from', 'Mamma Mia!', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals, Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Chris Jarvis, Meryl Streep, Amanda Seyfried, Christine Baranski, Ricardo Montez, Phyllida Lloyd, Colin Firth, Julie Walters, Mia Soteriou, Philip Michael, Ashley Lilley, Nancy Baldwin, Dominic Cooper, Pierce Brosnan, Enzo Squillino Jr., Stellan Skarsgård, Rachel McDowallChris Jarvis, Meryl Streep, Amanda Seyfried, Christine Baranski, Ricardo Montez, Phyllida Lloyd, Colin Firth, Julie Walters, Mia Soteriou, Philip Michael, Ashley Lilley, Nancy Baldwin, Dominic Cooper, Pierce Brosnan, Enzo Squillino Jr., Stellan Skarsgård, Rachel McDowall  See more', 'Initial release date': '2008-12-16', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.55 x 5.31 x 7.53 inches; 2.47 Ounces', 'Item model number': 'MFR025195015882#VG', 'Director': 'Phyllida Lloyd', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 16, 2008', 'Actors': 'Meryl Streep, Pierce Brosnan, Colin Firth, Amanda Seyfried, Christine Baranski', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: this is a great movie. this one was bought as a gift.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mamma Mia! Here We Go Again\nReview Date: 2020/01/19\nStore: Christine Baranski  (Actor),     Pierce Brosnan  (Actor),     Ol Parker  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: [\"Join the celebration, sing and dance, and discover how it all began! Ten years after Mamma Mia! The Movie premiered, you're invited back to the magical Greek island of Kalokairi in an all-new musical sequel based on the songs of ABBA. Sophie (Amanda Seyfried) is now pregnant, and like her mother Donna (Meryl Streep), she'll need to take risks. The film's original cast returns, with new additions including Lily James as a young Donna, Andy Garcia and Oscar winner Cher.Bonus Content:\", 'Play with Sing-Along', 'Play with Sing-Along', 'Deleted Songs and Scenes with Commentary by Director/Screenplay Writer Ol Parker', 'Deleted Songs and Scenes with Commentary by Director/Screenplay Writer Ol Parker', 'Enhanced Sing-Alongs', 'Enhanced Sing-Alongs', 'The Story', 'The Story', 'Mamma Mia! Reunited', 'Mamma Mia! Reunited', 'Playing Donna', 'Playing Donna', 'Meeting Cher', 'Meeting Cher', 'Costumes and The Dynamos', 'Costumes and The Dynamos', 'Curtain Call', 'Curtain Call', 'Today Interview with Cher & Judy Craymer', 'Today Interview with Cher & Judy Craymer', 'Feature Commentary with Director/Screenplay Writer Ol Parker', 'Feature Commentary with Director/Screenplay Writer Ol Parker', 'Feature Commentary with Producer Judy Craymer', 'Feature Commentary with Producer Judy Craymer']\nAverage Rating: 4.7\nProduct Details: {'Genre': \"Musicals & Performing Arts, Mamma Mia Sequel, Mamma Mia 2, DVD Movie, Comedy/Love & Romance, Mamma Mia: Here We Go Again, Blu-ray Movie, Comedy, Mamma Mia: C'est reparti, Mamma Mia Here We Go AgainMusicals & Performing Arts, Mamma Mia Sequel, Mamma Mia 2, DVD Movie, Comedy/Love & Romance, Mamma Mia: Here We Go Again, Blu-ray Movie, Comedy, Mamma Mia: C'est reparti, Mamma Mia Here We Go Again  See more\", 'Format': 'Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Christine Baranski, Andy Garcia, Amanda Seyfried, Meryl Streep, Lily James, Gary Goetzman, Colin Firth, Stellan Skarsgard, Julie Walters, Ol Parker, Dominic Cooper, Cher, Pierce Brosnan, Judy CraymerChristine Baranski, Andy Garcia, Amanda Seyfried, Meryl Streep, Lily James, Gary Goetzman, Colin Firth, Stellan Skarsgard, Julie Walters, Ol Parker, Dominic Cooper, Cher, Pierce Brosnan, Judy Craymer  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.6 x 5.4 x 0.6 inches; 3.2 Ounces', 'Item model number': 'D61193668D', 'Director': 'Ol Parker', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 23, 2018', 'Actors': 'Christine Baranski, Pierce Brosnan, Dominic Cooper, Colin Firth, Andy Garcia', 'Subtitles': 'French, Spanish', 'Producers': 'Judy Craymer, Gary Goetzman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Ol Parker', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I loved this movie and wanted to own it.  very happy with price.\nReview Title: dvd\nRating: 5.0\n--------------------------------------------------",
  "reference": "The Most Wonderful Time of the Year\nHenry Winkler  (Actor),     Brooke Burns  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Romantic\n['Five-time Emmy nominee and Golden Globe winner Henry Winkler stars in The Most Wonderful Time of the Year, the story of what happens when you open your heart to the power of Christmas. Disenchanted single mom Jennifer Cullen (Brooke Burns) is a Scroogette when it comes to anything Christmas. In fact, even her six-year-old son, Brian, is having trouble believing in Santa Claus. But when her Uncle Ralph (Henry Winkler) visits and brings a fellow passenger from his flight named Morgan Derby (Warren Christie), Jennifer s dubious heart awakens to the possibility that perhaps Christmas really does hold miracles. It s uplifting and laugh-packed and a story that will inspire the whole family to believe.']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Henry Winkler, Brooke Burns', 'Language': 'Unqualified', 'Runtime': '1 hour and 27 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '782580', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 27 minutes', 'Release date': 'October 13, 2009', 'Actors': 'Henry Winkler, Brooke Burns', 'Studio': 'CINEDIGM', 'Number of discs': '1'}\nwatch this movie over and over again, just love it.\njust love it.\nThe Christmas Card (Hallmark)\nEdward Asner  (Actor),     Brian Robinson (XV)  (Actor),     Stephen Bridgewater  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['Once in a while; a movie comes along that reminds us how powerful love can be. In the midst of war in Afghanistan; Captain Codey Cullen (John Newton; \"Desperate Housewives\") is touched by a lovely card sent by Faith Spelman (\"The Chris Isaak Show\") from the small picturesque town of Nevada City; California. As months pass; the card never leaves his side; giving him the strength to survive and setting him on a mission to find her. When Cody returns to the States; he finds himself coincidentally welcomed by her family and friends; but he remains hesitant to reveal the fateful connection that brought him to her. As a new Christmas approaches; Cody has one last opportunity to prove his courage - by taking a chance on love and finding the woman; the home; and the life he\\'s always wanted.']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Rachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice Evans, Lois Nettleton, Nick Hodaly, Kelly Stringfellow, John Newton (II), Lisa CornelisonRachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.51 x 7.56 inches; 2.4 Ounces', 'Item model number': '80598', 'Director': 'Stephen Bridgewater', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '1 hour and 24 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Edward Asner, Brian Robinson (XV), John Newton (II), Alice Evans, Lois Nettleton', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nMy favorite Christmas type movie.. I just love it. It's not even just a Christmas movie, but a good family type movie to watch anytime.\nFive Stars\nThe Butcher's Wife [DVD]\nDemi Moore  (Actor),     Jeff Daniels  (Actor),     Terry Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n[\"The Butcher's Wife (Widescreen) (Bilingual)\"]\n{'Genre': 'Kids & Family', 'Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Demi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson Baker, Stephanie Laurence, Sam Menning, Helen Hanft, Steve Love, Frank Tidy, Luis Avalos, Miriam Margolyes, Margaret Colin, Max Perlich, Barry NeikrugDemi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson…  See more', 'Language': 'English, French', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Terry Hughes', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'October 23, 2001', 'Actors': 'Demi Moore, Jeff Daniels, George Dzundza, Mary Steenburgen, Frances McDormand', 'Dubbed': 'English, French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\none of my favorite movies, had to have it, so glad you had it in your inventory.\nFive Stars\nMask\nCher  (Actor),     Eric Stoltz  (Actor),     Peter Bogdanovich  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Acclaimed filmmaker Peter Bogdanovich directed this heartwarming and inspirational film based on the real-life story of Rocky Dennis (Eric Stoltz), a terribly disfigured but highly sensitive and intelligent teenager. Motivated by his loving mother, Rusty (Cher), and her boyfriend, Gar (Sam Elliott), Rocky ultimately overcomes pain, loneliness and prejudice to become a role model to his classmates and teachers alike.Bonus Content:', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich']\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie', 'Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more\", 'Contributor': 'Peter Bogdanovich, Cher, Eric Stoltz, Sam Elliott', 'Language': 'Unqualified, English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), English (DTS 5.1)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '1022788', 'Director': 'Peter Bogdanovich', 'Media Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen\", 'Run time': '2 hours and 7 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Cher, Eric Stoltz, Sam Elliott', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nanother of my favorite movies. glad you had it.\nFive Stars\nBy the Light of the Silvery Moon\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Product Description', 'By the Light of the Silvery Moon (DVD)', '\"On Moonlight Bay\" stars Doris Day and Gordon MacRae are back together in top tune-crooning form for the further adventures of a small-town family turning the corner from World War I into the Roaring \\'20s. Year: 1953 Director: David Butler Starring: Doris Day, Gordon MacRae, Billy Gray', ']]>', 'Amazon.com', 'The huge popularity of the nostalgic', 'On Moonlight Bay', 'prompted this 1953 sequel, which recaptures the first film\\'s small-town, post-WWI spirit. Because young lovers Doris Day and Gordon MacRae are already together, the movie needs some sort of trumped-up conflict to separate them for a while; it comes with MacRae\\'s decision to postpone their wedding until he gets his financial legs. Yawn. But don\\'t worry, the subplots abound, including younger brother Billy Gray pilfering a prize Thanksgiving turkey, and dad Leon Ames suspected of romancing a visiting French music-hall star. Naturally there are vintage songs, including umpteen renderings of the classic title song (you won\\'t need the bouncing ball to sing along) and Day and MacRae casually bopping out new lyrics to \"Ain\\'t We Got Fun.\" Also returning for the sequel are Rosemary DeCamp as the patient mother and shameless scene-stealer Mary Wickes as the bossy maid. And check it out: future talk-show host Merv Griffin cheerleading during the finale at an outdoor ice rink. Day and MacRae twinkle so aggressively that they sometimes resemble salesmen for a particular kind of Hollywood backlot America that probably never existed, but the whole thing is almost impossible to resist.', '--Robert Horton']\n{'Genre': 'Musicals & Performing Arts/Musicals', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Various', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.72 Ounces', 'Item model number': '2231834', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 41 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nlove old Doris day movies, glad you had it.\nFive Stars\nOn Moonlight Bay\nDoris Day  (Actor),     Gordon MacRae  (Actor),     Roy Del Ruth  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Product Description', 'On Moonlight Bay (DVD)', \"A happy screenful of sun-kissed melody and kiss-by-moonlight romance! After moving to Indiana, young Marjorie Winfield begins a relationship with William Sherman, who lives across the street. Marjorie is a tom-boy, and her father has traditional views not shared by William. Marjorie is forced to learn to dance, despite her and Williams' shared love for baseball. Starring Doris Day and Gordon MacRae.\", ']]>', 'Amazon.com', \"America's love affair with clean-cut, tomboyish, freckle-faced Doris Day got a boost with\", 'On Moonlight Bay', \", a period piece from 1951. The film's masterstroke: put Doris in an old-timey musical full of small-town family values and vintage songs. Another inspiration: pair off Doris again with that chesty-voiced man's man and future Rodgers and Hammerstein stalwart, Gordon MacRae (they'd already made\", 'Tea for Two', 'and', 'The West Point Story', \"). The story is drawn from Booth Tarkington's Penrod tales, although the movie is also under the sway of\", 'Meet Me in St. Louis', '. The WWI-era family is anchored by parents Leon Ames (the pop from', 'St. Louis', ') and Rosemary De Camp, with echt-Fifties boy Billy Gray (later of', 'Father Knows Best', \") as Day's bratty younger brother. Mary Wickes, cinema's eternal sassy housekeeper, provides comic relief. So does radio crooner Jack Smith, who would later host\", 'You Asked for It', \"on TV for many years, as Day's maladroit suitor (he's really funny--too bad Preston Sturges never got a hold of him). The material is so relentlessly wholesome you might have to pinch yourself that anybody really believed it, but audiences sure wanted to. The film's popularity prompted a sequel,\", 'By the Light of the Silvery Moon', ', with most of the cast intact.', '--Robert Horton']\n{'Genre': 'Musicals & Performing Arts/Musicals, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Leon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del RuthLeon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del Ruth  See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.88 Ounces', 'Item model number': '2231837', 'Director': 'Roy Del Ruth', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Doris Day, Gordon MacRae, Jack Smith, Leon Ames, Rosemary DeCamp', 'Subtitles': 'English, Spanish', 'Producers': 'William Jacobs', 'Studio': 'WarnerBrothers', 'Writers': 'Booth Tarkington, Jack Rose', 'Number of discs': '1'}\nLove it\nFive Stars\nMessage in a Bottle (Keepcase)\nRobin Wright  (Actor),     John Savage  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Message in a Bottle (DVD)', 'Grieving widower Garret Blake builds boats for a living. Theresa Osborne, a lonely divorcee and researcher for the Chicago Tribune, tracks down Garret after finding a message he wrote inside a bottle on a Cape Code beach and profoundly touched her heart.', ']]>']\n{'Genre': 'Drama/Love & Romance, Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Denise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis MandokiDenise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis Mandoki  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 11 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000112599DVD', 'Director': 'Luis Mandoki', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Kevin Costner, Robin Wright, John Savage, Illeana Douglas, Robbie Coltrane', 'Subtitles': 'English', 'Producers': 'Denise Di Novi, Jim Wilson, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Gerald DiPego', 'Number of discs': '1'}\nthis movie is a classic, love your inventory.\nlove your inventory\nOnce Around [DVD]\nRichard Dreyfuss  (Actor),     Holly Hunter  (Actor),     Lasse Hallstrom  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Richard Dreyfuss and Holly Hunter lead an all-star cast in this critically acclaimed tale of life, love and chance. Jilted by her boyfriend, Renata (Hunter), the oldest daughter of a close-knit Italian-American family, falls in love with Sam (Dreyfuss), an abrasive and forcefully charming businessman.But neither her spirited sister (Laura San Giacomo), her down-to-earth father (Danny Aiello), or her supportive mother (Gena Rowlands) can tolerate Sam's often obnoxious intrusion into their family circle.Aggressive and overwhelmingly generous, Sam proceeds - with only the best intentions - to disrupt and nearly demolish Renata's family. Love, humor and forgiveness go once more around as the Bellas try to balance Renata's happiness with their family's survival in this funny and often touching story, directed by Lasse Hallström.\", ']]>']\n{'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Contributor': 'Laura San Giacomo, Lasse Hallstrom, Danny Aiello, Gena Rowlands, Richard Dreyfuss, Holly Hunter', 'Initial release date': '2010-06-01', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '25192422027', 'Director': 'Lasse Hallstrom', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Richard Dreyfuss, Holly Hunter, Gena Rowlands, Danny Aiello, Laura San Giacomo', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\ndidn't watch yet, but bought cuz I love this movie.\ngreat movie\nThe Postman (Keep Case Packaging)\nWill Patton  (Actor),     Larenz Tate  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\n['Postman, The (DVD)', \"Academy Award-winner Kevin Costner directs and stars in this post-apocalyptic thriller. In 2013 anarchy reigns, until a solitary wanderer discovers a postman's uniform, delivers letters ... and rekindles a spirit of revolution.\", ']]>']\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Tom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz TateTom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz Tate  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5822703', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 57 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Kevin Costner, Will Patton, Larenz Tate, Olivia Williams, Scott Bairstow', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, English', 'Producers': 'Jim Wilson, Steve Tisch, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Eric Roth, Brian Helgeland', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthis. is a great movie, but have not watched this dvd yet\ngreat movie\nDances With Wolves\nMary McDonnell  (Actor),     Graham Greene  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Dances Wolves 25 Anniversary (RPKG/DVD)', 'Set in 1863, a solitary U.S. cavalryman outposted in the remote frontier learns the ways of the Sioux. Though his misconceptions about them are quickly dispelled, he must protect them from the ravages of his fellow cavalrymen, come to \"civilize\" the far frontier.', ']]>']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 5 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant, Floyd Red Crow Westerman', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Jake Eberts, Kevin Costner, Jim Wilson', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Blake', 'Number of discs': '1'}\nI just watched this on tv, first time in years, I love it, but have not watched this dvd yet.\nfabulous movie\nAlways [DVD]\nRichard Dreyfuss  (Actor),     Holly Hunter  (Actor),     Steven Spielberg  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Product Description', 'Steven Spielberg directs this heartwarming romantic adventure USA Today calls \"a winner.\" Pete Sandich (Richard Dreyfuss) is a legendary pilot with a passion for daredevil firefighting. However Dorinda (Holly Hunter), the woman he loves, and Al (John Goodman), Pete\\'s best friend, know that legends can\\'t take risks forever. After sacrificing himself to save Al, the ace pilot faces his most challenging mission: helping Dorinda move on with her life. Breathtaking cinematography and exhilarating aerial choreography highlight this compelling adventure that co-stars Brad Johnson and features a special appearance by Audrey Hepburn.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"Considered by many to represent a low point in Steven Spielberg's career, 1990's\", 'Always', \"did suggest something of a temporary drift in the director's sensibility. A remake of the classic Spencer Tracy film\", 'A Guy Named Joe', ',', 'Always', \"stars Richard Dreyfuss as a Forest Service pilot who takes great risks with his own life to douse wildfires from a plane. After promising his frightened fiancée (Holly Hunter) to keep his feet on the ground and go into teaching, Dreyfuss's character is killed during one last flight. But his spirit wanders restlessly, hopelessly attached to and possessive of Hunter, who can't see or hear him. Then the real conflict begins: a trainee pilot (Brad Johnson), a likable doofus, begins wooing a not-unappreciative Hunter--and it becomes Dreyfuss's heavenly mandate to accept, and even assist in, their budding romance. The trouble with the film is a certain airlessness, a hyper-inventiveness in every scene and sequence that screams of Spielberg's self-education in Hollywood classicism. Unlike the masters he is constantly quoting and emulating in\", 'Always', \", he forgets to back off and let the movie breathe on its own sometimes, which would better serve his clockwork orchestration of suspense and comedy elsewhere. Still, there are lovely passages in this film, such as the unforgettable look on Dreyfuss's face a half-second before fate claims him. John Goodman contributes good supporting work, and Audrey Hepburn makes her final screen appearance as an angel.\", '--Tom Keogh']\n{'Genre': 'Drama, Romance', 'Format': 'Multiple Formats, Color, Letterboxed, Widescreen, NTSC', 'Contributor': 'Audrey Hepburn, Brad Johnson, Steven Spielberg, Frank Marshall, Jerry Belson, Keith David, Marg Helgenberger, Kathleen Kennedy, Roberts Blossom, John Goodman, Ed Van Nuys, Richard Dreyfuss, Holly HunterAudrey Hepburn, Brad Johnson, Steven Spielberg, Frank Marshall, Jerry Belson, Keith David, Marg Helgenberger, Kathleen Kennedy, Roberts Blossom, John Goodman, Ed Van Nuys, Richard Dreyfuss, Holly Hunter  See more', 'Initial release date': '1999-07-20', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 4.1), French (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.05 Ounces', 'Item model number': '1020556', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, Color, Letterboxed, Widescreen, NTSC', 'Run time': '2 hours and 3 minutes', 'Release date': 'July 20, 1999', 'Actors': 'Richard Dreyfuss, Holly Hunter, John Goodman, Audrey Hepburn, Brad Johnson', 'Subtitles': 'English', 'Producers': 'Steven Spielberg, Frank Marshall, Kathleen Kennedy', 'Studio': 'Studio Distribution Services', 'Writers': 'Jerry Belson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a wonderful movie I have not seen in years, and have not watched the dvd yet.\ngreat movie\nMamma Mia! The Movie\nMeryl Streep  (Actor),     Pierce Brosnan  (Actor),     Phyllida Lloyd  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', \"Sophie has just one wish to make her wedding perfect: to have her father walk her down the aisle. Now she just has to find out who he is. Join the music, laughter and fun of the irresistibly charming Mamma Mia! The Movie. Academy Award-winner Meryl Streep leads an all-star cast, including Pierce Brosnan and Colin Firth—as well as up-and-comers Amanda Seyfried and Dominic Cooper—in this musical celebration of mothers, daughters and fathers, and true loves lost and new ones found. Based on the Broadway smash-hit and filled with the ABBA songs you know and love, it's the feel-good experience that will have you singing and dancing over and over again.Bonus Content:\", 'Sing-Along', 'Sing-Along', 'Deleted Musical Number: \"The Name of the Game\"', 'Deleted Musical Number: \"The Name of the Game\"', 'Feature Commentary with Director Phyllida LLoyd', 'Feature Commentary with Director Phyllida LLoyd', 'Amazon.com', 'The delirious sight of Meryl Streep leading a river of multigenerational women singing \"Dancing Queen\" is one of the high points of', 'Mamma Mia!', ', the musical built around the songs of the hugely popular pop group ABBA. The plot sets in motion when Sophie (Amanda Seyfried,', 'Mean Girls', \"), daughter of Donna (Streep), sends a letter to three men, inviting them to her wedding--because after reading her mother's diary, she suspects that one of them is her father. When all three arrive at the Greek island where Donna runs a hotel, Donna flips out and finds that passions she thought she'd laid aside are coming back to life. But let's face it, the plot is not the point--it's a ridiculous contrivance that provides an excuse for the characters to sing the massive hits of ABBA. Regrettably, first-time film director Phyllida Lloyd (who directed the original stage production) has drawn over-the-top performances from everyone involved, even Streep; every production number hammers its exuberance into your eyeballs. Which is too bad, because\", 'Mamma Mia!', \"is a rarity: A middle-aged love story. The kids start things off, but the story is really about Streep and the three guys (former James Bond Pierce Brosnan, former Mr. Darcy Colin Firth, and Swedish star Stellan Skarsgard), as well as Donna's best friends (Christine Baranski, best known from the TV show\", 'Cybill', ', and Julie Walters,', 'Calendar Girls', \"). It's a romantic comedy aimed at the people who were around when all these songs were new, and that's an age group Hollywood largely ignores. For that alone,\", 'Mamma Mia!', 'deserves to find an audience. --', 'Bret Fetzer', 'Stills from', 'Mamma Mia!', '(Click for larger image)']\n{'Genre': 'Musicals, Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Chris Jarvis, Meryl Streep, Amanda Seyfried, Christine Baranski, Ricardo Montez, Phyllida Lloyd, Colin Firth, Julie Walters, Mia Soteriou, Philip Michael, Ashley Lilley, Nancy Baldwin, Dominic Cooper, Pierce Brosnan, Enzo Squillino Jr., Stellan Skarsgård, Rachel McDowallChris Jarvis, Meryl Streep, Amanda Seyfried, Christine Baranski, Ricardo Montez, Phyllida Lloyd, Colin Firth, Julie Walters, Mia Soteriou, Philip Michael, Ashley Lilley, Nancy Baldwin, Dominic Cooper, Pierce Brosnan, Enzo Squillino Jr., Stellan Skarsgård, Rachel McDowall  See more', 'Initial release date': '2008-12-16', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.55 x 5.31 x 7.53 inches; 2.47 Ounces', 'Item model number': 'MFR025195015882#VG', 'Director': 'Phyllida Lloyd', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 16, 2008', 'Actors': 'Meryl Streep, Pierce Brosnan, Colin Firth, Amanda Seyfried, Christine Baranski', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nthis is a great movie. this one was bought as a gift.\ngreat movie\nMamma Mia! Here We Go Again\nChristine Baranski  (Actor),     Pierce Brosnan  (Actor),     Ol Parker  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n[\"Join the celebration, sing and dance, and discover how it all began! Ten years after Mamma Mia! The Movie premiered, you're invited back to the magical Greek island of Kalokairi in an all-new musical sequel based on the songs of ABBA. Sophie (Amanda Seyfried) is now pregnant, and like her mother Donna (Meryl Streep), she'll need to take risks. The film's original cast returns, with new additions including Lily James as a young Donna, Andy Garcia and Oscar winner Cher.Bonus Content:\", 'Play with Sing-Along', 'Play with Sing-Along', 'Deleted Songs and Scenes with Commentary by Director/Screenplay Writer Ol Parker', 'Deleted Songs and Scenes with Commentary by Director/Screenplay Writer Ol Parker', 'Enhanced Sing-Alongs', 'Enhanced Sing-Alongs', 'The Story', 'The Story', 'Mamma Mia! Reunited', 'Mamma Mia! Reunited', 'Playing Donna', 'Playing Donna', 'Meeting Cher', 'Meeting Cher', 'Costumes and The Dynamos', 'Costumes and The Dynamos', 'Curtain Call', 'Curtain Call', 'Today Interview with Cher & Judy Craymer', 'Today Interview with Cher & Judy Craymer', 'Feature Commentary with Director/Screenplay Writer Ol Parker', 'Feature Commentary with Director/Screenplay Writer Ol Parker', 'Feature Commentary with Producer Judy Craymer', 'Feature Commentary with Producer Judy Craymer']\n{'Genre': \"Musicals & Performing Arts, Mamma Mia Sequel, Mamma Mia 2, DVD Movie, Comedy/Love & Romance, Mamma Mia: Here We Go Again, Blu-ray Movie, Comedy, Mamma Mia: C'est reparti, Mamma Mia Here We Go AgainMusicals & Performing Arts, Mamma Mia Sequel, Mamma Mia 2, DVD Movie, Comedy/Love & Romance, Mamma Mia: Here We Go Again, Blu-ray Movie, Comedy, Mamma Mia: C'est reparti, Mamma Mia Here We Go Again  See more\", 'Format': 'Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Christine Baranski, Andy Garcia, Amanda Seyfried, Meryl Streep, Lily James, Gary Goetzman, Colin Firth, Stellan Skarsgard, Julie Walters, Ol Parker, Dominic Cooper, Cher, Pierce Brosnan, Judy CraymerChristine Baranski, Andy Garcia, Amanda Seyfried, Meryl Streep, Lily James, Gary Goetzman, Colin Firth, Stellan Skarsgard, Julie Walters, Ol Parker, Dominic Cooper, Cher, Pierce Brosnan, Judy Craymer  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.6 x 5.4 x 0.6 inches; 3.2 Ounces', 'Item model number': 'D61193668D', 'Director': 'Ol Parker', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 23, 2018', 'Actors': 'Christine Baranski, Pierce Brosnan, Dominic Cooper, Colin Firth, Andy Garcia', 'Subtitles': 'French, Spanish', 'Producers': 'Judy Craymer, Gary Goetzman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Ol Parker', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI loved this movie and wanted to own it.  very happy with price.\ndvd",
  "prompt": "Based on this purchase history, summarize this person's genuine preferences and \n        patterns in under 256 words. Focus only on keywords and clear trends supported by multiple interactions. \n        Do not repeat specific product names or details.\n\nHere's the purchase data:\n\n=== Purchase Information ===\nProduct Title: The Most Wonderful Time of the Year\nReview Date: 2015/05/25\nStore: Henry Winkler  (Actor),     Brooke Burns  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Romantic\nProduct Description: ['Five-time Emmy nominee and Golden Globe winner Henry Winkler stars in The Most Wonderful Time of the Year, the story of what happens when you open your heart to the power of Christmas. Disenchanted single mom Jennifer Cullen (Brooke Burns) is a Scroogette when it comes to anything Christmas. In fact, even her six-year-old son, Brian, is having trouble believing in Santa Claus. But when her Uncle Ralph (Henry Winkler) visits and brings a fellow passenger from his flight named Morgan Derby (Warren Christie), Jennifer s dubious heart awakens to the possibility that perhaps Christmas really does hold miracles. It s uplifting and laugh-packed and a story that will inspire the whole family to believe.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Henry Winkler, Brooke Burns', 'Language': 'Unqualified', 'Runtime': '1 hour and 27 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '782580', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 27 minutes', 'Release date': 'October 13, 2009', 'Actors': 'Henry Winkler, Brooke Burns', 'Studio': 'CINEDIGM', 'Number of discs': '1'}\nReview Text: watch this movie over and over again, just love it.\nReview Title: just love it.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Christmas Card (Hallmark)\nReview Date: 2015/05/25\nStore: Edward Asner  (Actor),     Brian Robinson (XV)  (Actor),     Stephen Bridgewater  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas\nProduct Description: ['Once in a while; a movie comes along that reminds us how powerful love can be. In the midst of war in Afghanistan; Captain Codey Cullen (John Newton; \"Desperate Housewives\") is touched by a lovely card sent by Faith Spelman (\"The Chris Isaak Show\") from the small picturesque town of Nevada City; California. As months pass; the card never leaves his side; giving him the strength to survive and setting him on a mission to find her. When Cody returns to the States; he finds himself coincidentally welcomed by her family and friends; but he remains hesitant to reveal the fateful connection that brought him to her. As a new Christmas approaches; Cody has one last opportunity to prove his courage - by taking a chance on love and finding the woman; the home; and the life he\\'s always wanted.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Rachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice Evans, Lois Nettleton, Nick Hodaly, Kelly Stringfellow, John Newton (II), Lisa CornelisonRachel Songer, Kurt Johnson, Robert Granados, Edward Asner, Charlie Holliday, Stephen Bridgewater, Peter Jason, Chad Collins (II), Brandon Duckett, Leslie Goodman, Juli Marialani Johnston, Brian Robinson (XV), Nick Ballard (II), Judita Wignall, Ben Weber, Karyn Dahl, Alice…  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 24 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.51 x 7.56 inches; 2.4 Ounces', 'Item model number': '80598', 'Director': 'Stephen Bridgewater', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '1 hour and 24 minutes', 'Release date': 'October 23, 2007', 'Actors': 'Edward Asner, Brian Robinson (XV), John Newton (II), Alice Evans, Lois Nettleton', 'Studio': 'Rhi Entertainment', 'Number of discs': '1'}\nReview Text: My favorite Christmas type movie.. I just love it. It's not even just a Christmas movie, but a good family type movie to watch anytime.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Butcher's Wife [DVD]\nReview Date: 2018/02/20\nStore: Demi Moore  (Actor),     Jeff Daniels  (Actor),     Terry Hughes  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Comedy\nProduct Description: [\"The Butcher's Wife (Widescreen) (Bilingual)\"]\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Kids & Family', 'Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Demi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson Baker, Stephanie Laurence, Sam Menning, Helen Hanft, Steve Love, Frank Tidy, Luis Avalos, Miriam Margolyes, Margaret Colin, Max Perlich, Barry NeikrugDemi Moore, Jeff Daniels, Cameron Milzer, Sara Noel Herring, Ken Fritz, Elizabeth Lawrence, Terry Hughes, Charles Pierce, Diane Salinger, Mary Steenburgen, Ed Kenney, George Dzundza, Christopher Durang, Frances McDormand, Thomas Mikal Ford, Scott Thompson…  See more', 'Language': 'English, French', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4 Ounces', 'Director': 'Terry Hughes', 'Media Format': 'Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 44 minutes', 'Release date': 'October 23, 2001', 'Actors': 'Demi Moore, Jeff Daniels, George Dzundza, Mary Steenburgen, Frances McDormand', 'Dubbed': 'English, French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '1'}\nReview Text: one of my favorite movies, had to have it, so glad you had it in your inventory.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mask\nReview Date: 2018/02/20\nStore: Cher  (Actor),     Eric Stoltz  (Actor),     Peter Bogdanovich  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Fully Loaded DVDs, DTS\nProduct Description: ['Acclaimed filmmaker Peter Bogdanovich directed this heartwarming and inspirational film based on the real-life story of Rocky Dennis (Eric Stoltz), a terribly disfigured but highly sensitive and intelligent teenager. Motivated by his loving mother, Rusty (Cher), and her boyfriend, Gar (Sam Elliott), Rocky ultimately overcomes pain, loneliness and prejudice to become a role model to his classmates and teachers alike.Bonus Content:', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Mask Revealed: A Conversation with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich', 'Feature Commentary with Director Peter Bogdanovich']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, DVD Movie, Blu-ray Movie', 'Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen  See more\", 'Contributor': 'Peter Bogdanovich, Cher, Eric Stoltz, Sam Elliott', 'Language': 'Unqualified, English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Mono), English (DTS 5.1)', 'Runtime': '2 hours and 7 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 0.01 Ounces', 'Item model number': '1022788', 'Director': 'Peter Bogdanovich', 'Media Format': \"Multiple Formats, AC-3, Anamorphic, Color, Director's Cut, Dolby, DTS Surround Sound, NTSC, Special Edition, Subtitled, Widescreen\", 'Run time': '2 hours and 7 minutes', 'Release date': 'August 30, 2009', 'Actors': 'Cher, Eric Stoltz, Sam Elliott', 'Subtitles': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: another of my favorite movies. glad you had it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: By the Light of the Silvery Moon\nReview Date: 2018/02/20\nStore: Various  (Actor, Director)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['Product Description', 'By the Light of the Silvery Moon (DVD)', '\"On Moonlight Bay\" stars Doris Day and Gordon MacRae are back together in top tune-crooning form for the further adventures of a small-town family turning the corner from World War I into the Roaring \\'20s. Year: 1953 Director: David Butler Starring: Doris Day, Gordon MacRae, Billy Gray', ']]>', 'Amazon.com', 'The huge popularity of the nostalgic', 'On Moonlight Bay', 'prompted this 1953 sequel, which recaptures the first film\\'s small-town, post-WWI spirit. Because young lovers Doris Day and Gordon MacRae are already together, the movie needs some sort of trumped-up conflict to separate them for a while; it comes with MacRae\\'s decision to postpone their wedding until he gets his financial legs. Yawn. But don\\'t worry, the subplots abound, including younger brother Billy Gray pilfering a prize Thanksgiving turkey, and dad Leon Ames suspected of romancing a visiting French music-hall star. Naturally there are vintage songs, including umpteen renderings of the classic title song (you won\\'t need the bouncing ball to sing along) and Day and MacRae casually bopping out new lyrics to \"Ain\\'t We Got Fun.\" Also returning for the sequel are Rosemary DeCamp as the patient mother and shameless scene-stealer Mary Wickes as the bossy maid. And check it out: future talk-show host Merv Griffin cheerleading during the finale at an outdoor ice rink. Day and MacRae twinkle so aggressively that they sometimes resemble salesmen for a particular kind of Hollywood backlot America that probably never existed, but the whole thing is almost impossible to resist.', '--Robert Horton']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Various', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.72 Ounces', 'Item model number': '2231834', 'Director': 'Various', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 41 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Various', 'Subtitles': 'English', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: love old Doris day movies, glad you had it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: On Moonlight Bay\nReview Date: 2018/02/20\nStore: Doris Day  (Actor),     Gordon MacRae  (Actor),     Roy Del Ruth  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\nProduct Description: ['Product Description', 'On Moonlight Bay (DVD)', \"A happy screenful of sun-kissed melody and kiss-by-moonlight romance! After moving to Indiana, young Marjorie Winfield begins a relationship with William Sherman, who lives across the street. Marjorie is a tom-boy, and her father has traditional views not shared by William. Marjorie is forced to learn to dance, despite her and Williams' shared love for baseball. Starring Doris Day and Gordon MacRae.\", ']]>', 'Amazon.com', \"America's love affair with clean-cut, tomboyish, freckle-faced Doris Day got a boost with\", 'On Moonlight Bay', \", a period piece from 1951. The film's masterstroke: put Doris in an old-timey musical full of small-town family values and vintage songs. Another inspiration: pair off Doris again with that chesty-voiced man's man and future Rodgers and Hammerstein stalwart, Gordon MacRae (they'd already made\", 'Tea for Two', 'and', 'The West Point Story', \"). The story is drawn from Booth Tarkington's Penrod tales, although the movie is also under the sway of\", 'Meet Me in St. Louis', '. The WWI-era family is anchored by parents Leon Ames (the pop from', 'St. Louis', ') and Rosemary De Camp, with echt-Fifties boy Billy Gray (later of', 'Father Knows Best', \") as Day's bratty younger brother. Mary Wickes, cinema's eternal sassy housekeeper, provides comic relief. So does radio crooner Jack Smith, who would later host\", 'You Asked for It', \"on TV for many years, as Day's maladroit suitor (he's really funny--too bad Preston Sturges never got a hold of him). The material is so relentlessly wholesome you might have to pinch yourself that anybody really believed it, but audiences sure wanted to. The film's popularity prompted a sequel,\", 'By the Light of the Silvery Moon', ', with most of the cast intact.', '--Robert Horton']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Musicals & Performing Arts/Musicals, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Contributor': 'Leon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del RuthLeon Ames, Jack Rose, Jack Smith, Mary Wickes, Rosemary DeCamp, Ellen Corby, William Jacobs, Doris Day, Gordon MacRae, Booth Tarkington, Roy Del Ruth  See more', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.88 Ounces', 'Item model number': '2231837', 'Director': 'Roy Del Ruth', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Subtitled, NTSC, Full Screen', 'Run time': '1 hour and 34 minutes', 'Release date': 'April 10, 2007', 'Actors': 'Doris Day, Gordon MacRae, Jack Smith, Leon Ames, Rosemary DeCamp', 'Subtitles': 'English, Spanish', 'Producers': 'William Jacobs', 'Studio': 'WarnerBrothers', 'Writers': 'Booth Tarkington, Jack Rose', 'Number of discs': '1'}\nReview Text: Love it\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Message in a Bottle (Keepcase)\nReview Date: 2018/02/20\nStore: Robin Wright  (Actor),     John Savage  (Actor),     Luis Mandoki  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Message in a Bottle (DVD)', 'Grieving widower Garret Blake builds boats for a living. Theresa Osborne, a lonely divorcee and researcher for the Chicago Tribune, tracks down Garret after finding a message he wrote inside a bottle on a Cape Code beach and profoundly touched her heart.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama/Love & Romance, Drama', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Denise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis MandokiDenise Di Novi, Nicholas Sparks, John Savage, Illeana Douglas, Jesse James, Gerald DiPego, Robbie Coltrane, Jim Wilson, Kevin Costner, Paul Newman, Robin Wright, Luis Mandoki  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 11 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000112599DVD', 'Director': 'Luis Mandoki', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 11 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Kevin Costner, Robin Wright, John Savage, Illeana Douglas, Robbie Coltrane', 'Subtitles': 'English', 'Producers': 'Denise Di Novi, Jim Wilson, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Gerald DiPego', 'Number of discs': '1'}\nReview Text: this movie is a classic, love your inventory.\nReview Title: love your inventory\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Once Around [DVD]\nReview Date: 2018/07/07\nStore: Richard Dreyfuss  (Actor),     Holly Hunter  (Actor),     Lasse Hallstrom  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Richard Dreyfuss and Holly Hunter lead an all-star cast in this critically acclaimed tale of life, love and chance. Jilted by her boyfriend, Renata (Hunter), the oldest daughter of a close-knit Italian-American family, falls in love with Sam (Dreyfuss), an abrasive and forcefully charming businessman.But neither her spirited sister (Laura San Giacomo), her down-to-earth father (Danny Aiello), or her supportive mother (Gena Rowlands) can tolerate Sam's often obnoxious intrusion into their family circle.Aggressive and overwhelmingly generous, Sam proceeds - with only the best intentions - to disrupt and nearly demolish Renata's family. Love, humor and forgiveness go once more around as the Bellas try to balance Renata's happiness with their family's survival in this funny and often touching story, directed by Lasse Hallström.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Comedy/Romantic Comedies, Comedy', 'Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Contributor': 'Laura San Giacomo, Lasse Hallstrom, Danny Aiello, Gena Rowlands, Richard Dreyfuss, Holly Hunter', 'Initial release date': '2010-06-01', 'Language': 'English (Dolby Digital 2.0), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '25192422027', 'Director': 'Lasse Hallstrom', 'Media Format': 'Multiple Formats, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Richard Dreyfuss, Holly Hunter, Gena Rowlands, Danny Aiello, Laura San Giacomo', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: didn't watch yet, but bought cuz I love this movie.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: The Postman (Keep Case Packaging)\nReview Date: 2018/07/07\nStore: Will Patton  (Actor),     Larenz Tate  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\nProduct Description: ['Postman, The (DVD)', \"Academy Award-winner Kevin Costner directs and stars in this post-apocalyptic thriller. In 2013 anarchy reigns, until a solitary wanderer discovers a postman's uniform, delivers letters ... and rekindles a spirit of revolution.\", ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Tom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz TateTom Petty, Kevin Costner, Peggy Lipton, Jim Wilson, Giovanni Ribisi, Brian Helgeland, Steve Tisch, Will Patton, David Brin, Eric Roth, Olivia Williams, Scott Bairstow, Larenz Tate  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '5822703', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '2 hours and 57 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Kevin Costner, Will Patton, Larenz Tate, Olivia Williams, Scott Bairstow', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, English', 'Producers': 'Jim Wilson, Steve Tisch, Kevin Costner', 'Studio': 'WarnerBrothers', 'Writers': 'Eric Roth, Brian Helgeland', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: this. is a great movie, but have not watched this dvd yet\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dances With Wolves\nReview Date: 2018/07/07\nStore: Mary McDonnell  (Actor),     Graham Greene  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: ['Dances Wolves 25 Anniversary (RPKG/DVD)', 'Set in 1863, a solitary U.S. cavalryman outposted in the remote frontier learns the ways of the Sioux. Though his misconceptions about them are quickly dispelled, he must protect them from the ravages of his fellow cavalrymen, come to \"civilize\" the far frontier.', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'unknown', 'Director': 'Kevin Costner', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 5 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Kevin Costner, Mary McDonnell, Graham Greene, Rodney A. Grant, Floyd Red Crow Westerman', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Jake Eberts, Kevin Costner, Jim Wilson', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Blake', 'Number of discs': '1'}\nReview Text: I just watched this on tv, first time in years, I love it, but have not watched this dvd yet.\nReview Title: fabulous movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Always [DVD]\nReview Date: 2018/07/07\nStore: Richard Dreyfuss  (Actor),     Holly Hunter  (Actor),     Steven Spielberg  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Science Fiction & Fantasy, Fantasy\nProduct Description: ['Product Description', 'Steven Spielberg directs this heartwarming romantic adventure USA Today calls \"a winner.\" Pete Sandich (Richard Dreyfuss) is a legendary pilot with a passion for daredevil firefighting. However Dorinda (Holly Hunter), the woman he loves, and Al (John Goodman), Pete\\'s best friend, know that legends can\\'t take risks forever. After sacrificing himself to save Al, the ace pilot faces his most challenging mission: helping Dorinda move on with her life. Breathtaking cinematography and exhilarating aerial choreography highlight this compelling adventure that co-stars Brad Johnson and features a special appearance by Audrey Hepburn.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"Considered by many to represent a low point in Steven Spielberg's career, 1990's\", 'Always', \"did suggest something of a temporary drift in the director's sensibility. A remake of the classic Spencer Tracy film\", 'A Guy Named Joe', ',', 'Always', \"stars Richard Dreyfuss as a Forest Service pilot who takes great risks with his own life to douse wildfires from a plane. After promising his frightened fiancée (Holly Hunter) to keep his feet on the ground and go into teaching, Dreyfuss's character is killed during one last flight. But his spirit wanders restlessly, hopelessly attached to and possessive of Hunter, who can't see or hear him. Then the real conflict begins: a trainee pilot (Brad Johnson), a likable doofus, begins wooing a not-unappreciative Hunter--and it becomes Dreyfuss's heavenly mandate to accept, and even assist in, their budding romance. The trouble with the film is a certain airlessness, a hyper-inventiveness in every scene and sequence that screams of Spielberg's self-education in Hollywood classicism. Unlike the masters he is constantly quoting and emulating in\", 'Always', \", he forgets to back off and let the movie breathe on its own sometimes, which would better serve his clockwork orchestration of suspense and comedy elsewhere. Still, there are lovely passages in this film, such as the unforgettable look on Dreyfuss's face a half-second before fate claims him. John Goodman contributes good supporting work, and Audrey Hepburn makes her final screen appearance as an angel.\", '--Tom Keogh']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama, Romance', 'Format': 'Multiple Formats, Color, Letterboxed, Widescreen, NTSC', 'Contributor': 'Audrey Hepburn, Brad Johnson, Steven Spielberg, Frank Marshall, Jerry Belson, Keith David, Marg Helgenberger, Kathleen Kennedy, Roberts Blossom, John Goodman, Ed Van Nuys, Richard Dreyfuss, Holly HunterAudrey Hepburn, Brad Johnson, Steven Spielberg, Frank Marshall, Jerry Belson, Keith David, Marg Helgenberger, Kathleen Kennedy, Roberts Blossom, John Goodman, Ed Van Nuys, Richard Dreyfuss, Holly Hunter  See more', 'Initial release date': '1999-07-20', 'Language': 'Unqualified (DTS ES 6.1), English (Dolby Digital 4.1), French (Dolby Digital 2.0 Surround)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.05 Ounces', 'Item model number': '1020556', 'Director': 'Steven Spielberg', 'Media Format': 'Multiple Formats, Color, Letterboxed, Widescreen, NTSC', 'Run time': '2 hours and 3 minutes', 'Release date': 'July 20, 1999', 'Actors': 'Richard Dreyfuss, Holly Hunter, John Goodman, Audrey Hepburn, Brad Johnson', 'Subtitles': 'English', 'Producers': 'Steven Spielberg, Frank Marshall, Kathleen Kennedy', 'Studio': 'Studio Distribution Services', 'Writers': 'Jerry Belson', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: This is a wonderful movie I have not seen in years, and have not watched the dvd yet.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mamma Mia! The Movie\nReview Date: 2018/09/15\nStore: Meryl Streep  (Actor),     Pierce Brosnan  (Actor),     Phyllida Lloyd  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: ['Product Description', \"Sophie has just one wish to make her wedding perfect: to have her father walk her down the aisle. Now she just has to find out who he is. Join the music, laughter and fun of the irresistibly charming Mamma Mia! The Movie. Academy Award-winner Meryl Streep leads an all-star cast, including Pierce Brosnan and Colin Firth—as well as up-and-comers Amanda Seyfried and Dominic Cooper—in this musical celebration of mothers, daughters and fathers, and true loves lost and new ones found. Based on the Broadway smash-hit and filled with the ABBA songs you know and love, it's the feel-good experience that will have you singing and dancing over and over again.Bonus Content:\", 'Sing-Along', 'Sing-Along', 'Deleted Musical Number: \"The Name of the Game\"', 'Deleted Musical Number: \"The Name of the Game\"', 'Feature Commentary with Director Phyllida LLoyd', 'Feature Commentary with Director Phyllida LLoyd', 'Amazon.com', 'The delirious sight of Meryl Streep leading a river of multigenerational women singing \"Dancing Queen\" is one of the high points of', 'Mamma Mia!', ', the musical built around the songs of the hugely popular pop group ABBA. The plot sets in motion when Sophie (Amanda Seyfried,', 'Mean Girls', \"), daughter of Donna (Streep), sends a letter to three men, inviting them to her wedding--because after reading her mother's diary, she suspects that one of them is her father. When all three arrive at the Greek island where Donna runs a hotel, Donna flips out and finds that passions she thought she'd laid aside are coming back to life. But let's face it, the plot is not the point--it's a ridiculous contrivance that provides an excuse for the characters to sing the massive hits of ABBA. Regrettably, first-time film director Phyllida Lloyd (who directed the original stage production) has drawn over-the-top performances from everyone involved, even Streep; every production number hammers its exuberance into your eyeballs. Which is too bad, because\", 'Mamma Mia!', \"is a rarity: A middle-aged love story. The kids start things off, but the story is really about Streep and the three guys (former James Bond Pierce Brosnan, former Mr. Darcy Colin Firth, and Swedish star Stellan Skarsgard), as well as Donna's best friends (Christine Baranski, best known from the TV show\", 'Cybill', ', and Julie Walters,', 'Calendar Girls', \"). It's a romantic comedy aimed at the people who were around when all these songs were new, and that's an age group Hollywood largely ignores. For that alone,\", 'Mamma Mia!', 'deserves to find an audience. --', 'Bret Fetzer', 'Stills from', 'Mamma Mia!', '(Click for larger image)']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals, Romance, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Chris Jarvis, Meryl Streep, Amanda Seyfried, Christine Baranski, Ricardo Montez, Phyllida Lloyd, Colin Firth, Julie Walters, Mia Soteriou, Philip Michael, Ashley Lilley, Nancy Baldwin, Dominic Cooper, Pierce Brosnan, Enzo Squillino Jr., Stellan Skarsgård, Rachel McDowallChris Jarvis, Meryl Streep, Amanda Seyfried, Christine Baranski, Ricardo Montez, Phyllida Lloyd, Colin Firth, Julie Walters, Mia Soteriou, Philip Michael, Ashley Lilley, Nancy Baldwin, Dominic Cooper, Pierce Brosnan, Enzo Squillino Jr., Stellan Skarsgård, Rachel McDowall  See more', 'Initial release date': '2008-12-16', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified (DTS ES 6.1)', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.55 x 5.31 x 7.53 inches; 2.47 Ounces', 'Item model number': 'MFR025195015882#VG', 'Director': 'Phyllida Lloyd', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 49 minutes', 'Release date': 'December 16, 2008', 'Actors': 'Meryl Streep, Pierce Brosnan, Colin Firth, Amanda Seyfried, Christine Baranski', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Studio Distribution Services', 'Number of discs': '1'}\nReview Text: this is a great movie. this one was bought as a gift.\nReview Title: great movie\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mamma Mia! Here We Go Again\nReview Date: 2020/01/19\nStore: Christine Baranski  (Actor),     Pierce Brosnan  (Actor),     Ol Parker  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Musicals & Performing Arts, Musicals\nProduct Description: [\"Join the celebration, sing and dance, and discover how it all began! Ten years after Mamma Mia! The Movie premiered, you're invited back to the magical Greek island of Kalokairi in an all-new musical sequel based on the songs of ABBA. Sophie (Amanda Seyfried) is now pregnant, and like her mother Donna (Meryl Streep), she'll need to take risks. The film's original cast returns, with new additions including Lily James as a young Donna, Andy Garcia and Oscar winner Cher.Bonus Content:\", 'Play with Sing-Along', 'Play with Sing-Along', 'Deleted Songs and Scenes with Commentary by Director/Screenplay Writer Ol Parker', 'Deleted Songs and Scenes with Commentary by Director/Screenplay Writer Ol Parker', 'Enhanced Sing-Alongs', 'Enhanced Sing-Alongs', 'The Story', 'The Story', 'Mamma Mia! Reunited', 'Mamma Mia! Reunited', 'Playing Donna', 'Playing Donna', 'Meeting Cher', 'Meeting Cher', 'Costumes and The Dynamos', 'Costumes and The Dynamos', 'Curtain Call', 'Curtain Call', 'Today Interview with Cher & Judy Craymer', 'Today Interview with Cher & Judy Craymer', 'Feature Commentary with Director/Screenplay Writer Ol Parker', 'Feature Commentary with Director/Screenplay Writer Ol Parker', 'Feature Commentary with Producer Judy Craymer', 'Feature Commentary with Producer Judy Craymer']\nAverage Rating: 4.7\nProduct Details: {'Genre': \"Musicals & Performing Arts, Mamma Mia Sequel, Mamma Mia 2, DVD Movie, Comedy/Love & Romance, Mamma Mia: Here We Go Again, Blu-ray Movie, Comedy, Mamma Mia: C'est reparti, Mamma Mia Here We Go AgainMusicals & Performing Arts, Mamma Mia Sequel, Mamma Mia 2, DVD Movie, Comedy/Love & Romance, Mamma Mia: Here We Go Again, Blu-ray Movie, Comedy, Mamma Mia: C'est reparti, Mamma Mia Here We Go Again  See more\", 'Format': 'Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Christine Baranski, Andy Garcia, Amanda Seyfried, Meryl Streep, Lily James, Gary Goetzman, Colin Firth, Stellan Skarsgard, Julie Walters, Ol Parker, Dominic Cooper, Cher, Pierce Brosnan, Judy CraymerChristine Baranski, Andy Garcia, Amanda Seyfried, Meryl Streep, Lily James, Gary Goetzman, Colin Firth, Stellan Skarsgard, Julie Walters, Ol Parker, Dominic Cooper, Cher, Pierce Brosnan, Judy Craymer  See more', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), French Canadian (Dolby Digital 5.1)', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.6 x 5.4 x 0.6 inches; 3.2 Ounces', 'Item model number': 'D61193668D', 'Director': 'Ol Parker', 'Media Format': 'Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 23, 2018', 'Actors': 'Christine Baranski, Pierce Brosnan, Dominic Cooper, Colin Firth, Andy Garcia', 'Subtitles': 'French, Spanish', 'Producers': 'Judy Craymer, Gary Goetzman', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Ol Parker', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I loved this movie and wanted to own it.  very happy with price.\nReview Title: dvd\nRating: 5.0\n--------------------------------------------------",
  "raw_response": "**Summary of Preferences and Patterns:**\n\n- **Holiday Theme**: Strong preference for holiday and Christmas-themed movies, frequently purchasing titles that evoke festive feelings.\n  \n- **Romantic Elements**: A consistent lean towards romantic narratives, especially in family-friendly settings, often featuring heartfelt connections and emotional journeys.\n\n- **High Ratings**: All purchased movies received 4.6 to 5.0 ratings, suggesting a keen eye for quality entertainment.\n\n- **Nostalgic Appeal**: A notable affinity for classic and older films, especially musicals and performances featuring iconic actors such as Doris Day and Meryl Streep.\n\n- **Multiple Formats**: Preference for DVDs with special features, and formats that include both color and subtitled versions.\n\n- **Family-Centric**: Movies purchased are often framed as good family entertainment, appropriate for all ages.\n\n- **Repeat Viewings**: Expressed enjoyment of rewatching beloved titles repeatedly, highlighting a desire for comfort and familiarity in their viewing choices.\n\n- **Positive Engagement**: Frequent five-star ratings and enthusiastic reviews indicate a passion for the film genre, reinforcing the trend of appreciating sentimental and uplifting stories. \n\nOverall, the individual's purchasing behavior illustrates a strong appreciation for heartwarming, romantic, and nostalgic films, predominantly centered around holiday cheer and family themes.",
  "target_interaction": {
    "rating": 5.0,
    "title": "dvd",
    "text": "love and wanted this movie, very well priced",
    "images": [],
    "asin": "B0001CNRBG",
    "parent_asin": "B0001CNRBG",
    "user_id": "AE26N5BRXPJ6PH2RXRAZFSMUJ2HQ",
    "timestamp": "2020-01-19 21:14:13.970000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Same Time, Next Year",
    "average_rating": 4.8,
    "rating_number": 2296,
    "features": [],
    "description": [
      "Oscar®-winner Ellen Burstyn and the ever-popular Alan Alda star in this sweet romantic comedy tracing the unique 26-year relationship between two people—who happen to be married to other people. When Doris (Burstyn), a young housewife from Oakland, and George (Alda), an accountant from New Jersey, meet by chance at a rural California inn, they embark on an affair that brings them together on the same weekend, in the same place, for the next 26 years. As time passes, events in their personal lives impact their special once-a-year romance in this heartwarming comedy.",
      "Bonus Content:",
      "Theatrical Trailer",
      "Theatrical Trailer",
      "]]>"
    ],
    "price": 8.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41PqS0AuKfL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41PqS0AuKfL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61FH3yUALHL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41LYqMoJ59L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41LYqMoJ59L.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/71i2dvbgLkL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41X1icOGBbL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41X1icOGBbL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/818+x65vjkL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Ellen Burstyn  (Actor),     Alan Alda  (Actor),     Robert Mulligan  (Director)    &                   0                  more   Rated:    PG    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Comedy"
    ],
    "details": {
      "Aspect Ratio": "1.85:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG (Parental Guidance Suggested)",
      "Product Dimensions": "7.75 x 5.5 x 0.5 inches; 2.61 Ounces",
      "Item model number": "1024191",
      "Director": "Robert Mulligan",
      "Media Format": "Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen",
      "Run time": "1 hour and 59 minutes",
      "Release date": "April 6, 2004",
      "Actors": "Ellen Burstyn, Alan Alda",
      "Subtitles": "Spanish, French",
      "Producers": "Walter Mirisch, Morton Gottlieb",
      "Language": "English (Dolby Digital 2.0), Unqualified",
      "Studio": "Studio Distribution Services",
      "Writers": "Bernard Slade",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}