{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Ice Bridge: Mackinac Island's Hidden Season\nReview Date: 2013/02/15\nStore: Jenifer Silvernale (Actor),  Mark Rensel (Writer)\nCategories: Movies & TV, Genre for Featured Categories, Documentary\nAverage Rating: 4.6\nProduct Details: {'Publisher': 'Icebridgemovie (January 1, 2008)', 'Item Weight': '2.93 ounces'}\nReview Text: this dvd brings back the wonders of Mackinac Island and shows how beautiful and unique it is even in the dead of winter\nReview Title: enjoyed\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Sleepy Hollow\nJohnny Depp  (Actor),     Christina Ricci  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Horror\n['Master storyteller Tim Burton (', 'Batman', ',', 'Edward Scissorhands', ') weaves an eerie, enchanting version of this classic tale of horror. Johnny Depp is Ichabod Crane, an eccentric investigator determined to stop the murderous Headless Horseman. Christina Ricci is Katrina Van Tassel, the beautiful and mysterious girl with secret ties to the supernatural terror.']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': 'MFR097363296249#VG', 'Director': 'Tim Burton', 'Media Format': 'Multiple Formats, NTSC, Anamorphic, Closed-captioned, Color, Dolby, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 23, 2000', 'Actors': 'Johnny Depp, Christina Ricci, Miranda Richardson, Michael Gambon, Casper Van Dien', 'Dubbed': 'French', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Studio': 'Paramount', 'Writers': 'Andrew Kevin Walker, Kevin Yagher, Washington Irving', 'Number of discs': '1'}\neveryone should own this dvd and watch every Thanksgiving, as we have for years. Johnny Depp is marvelous and quirky\nA Classic\nHome Alone\nMacaulay Culkin  (Actor),     Joe Pesci  (Actor),     Chris Columbus  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Accidentally left by his Paris-bound family, an 8-year-old makes mincemeat of two burglars in the house.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': \"Kieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts Blossom, Larry Hankin, Gerry Bamman, Chris ColumbusKieran Culkin, Anna Slotky, Kristin Minter, Catherine O'Hara, Jedidiah Cohen, Daniel Stern, John Heard, Senta Moses, Devin Ratray, Michael C. Maronna, Terrie Snell, Macaulay Culkin, Joe Pesci, Angela Goethals, Hillary Wolf, Daiana Campeanu, John Hughes, John Candy, Roberts…  See more\", 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.52 x 5.29 x 7.43 inches; 1.6 Ounces', 'Item model number': '24543027188', 'Director': 'Chris Columbus', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'October 5, 1999', 'Actors': 'Macaulay Culkin, Joe Pesci, Daniel Stern, John Heard, Roberts Blossom', 'Studio': '20TH CENTURY STUDIOS', 'Writers': 'John Hughes', 'Country of Origin': 'USA', 'Number of discs': '1'}\nChristmas means a viewing of &#34;Home Alone&#34; for my family every year and we always enjoy it as much as the 1st time. This purchase was a gift.\nClassic Movie\nWhite Christmas\nBing Crosby  (Actor),     Danny Kaye  (Actor),     Michael Curtiz  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Two talented son-and-dance men (Bing Crosby and Danny Kaye) team up after the war to become one of the hottest acts in show business.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.64 x 5.39 x 7.65 inches; 4.48 Ounces', 'Director': 'Michael Curtiz', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Original recording remastered, Subtitled, Widescreen, Restored', 'Run time': '2 hours', 'Release date': 'November 3, 2009', 'Actors': 'Bing Crosby, Danny Kaye, Rosemary Clooney, Vera Ellen, Dean Jagger', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Language': 'Unqualified', 'Studio': 'Paramount', 'Writers': 'Norman Krasna, Norman Panama, Melvin Frank', 'Number of discs': '2'}\nClassic doesn't even begin to describe this perennial favorite. Who could ever get tired of Bing Crosby, Danny Kaye and Rosemary Clooney-singing and Dancing? wonderful escapism\nHave ALways Loved It\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeremiah Chechik'], 'Producers': ['William S. Beasley', 'Mauri Syd Gayton', 'Daniel Grodnik', 'John Hughes', 'Tom Jacobson', 'Matty Simmons', 'Ramey E. Ward'], 'Starring': ['Chevy Chase', \"Beverly D'Angelo\", 'Juliette Lewis'], 'Studio': ['Warner Bros.']}\nI always buy my videos and cds from AMazon-top quality-quick ship. Best source for the best products you can buy\nquick ship/great quality\nThe Triplets of Belleville\nSylvain Chomet  (Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, Sony Pictures Classics, Comedy\n[\"You've never seen anything like\", 'The Triplets of Belleville', ', a wildly inventive and highly original animated feature crowded with colorful characters and fantastic imagery. Kidnapped by mysterious, square-shouldered henchmen, a Tour de France cyclist named Champion is spirited across the ocean to the teeming metropolis of Belleville. His grandmother and faithful dog follow his trail and are taken in by a trio of eccentric jazz-era divas. The motley sleuths follow the clues to an Underground betting parlor and now the chase is on! Richly imagined, wildly inventive and acclaimed as one of the best films of the year, \"', 'Triplets', 'is terrific!\" - Richard Corliss, TIME MAGAZINE.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Contributor': 'Didier Brunner, Les Armateurs, Viviane Vanfleteren, Sylvain Chomet', 'Language': 'English (Dolby Digital 5.1), Unqualified, Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 21 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 8 Ounces', 'Item model number': '03231', 'Director': 'Sylvain Chomet', 'Media Format': 'Multiple Formats, Anamorphic, Animated, Color, Dolby, DTS Surround Sound, Dubbed, NTSC, Widescreen', 'Run time': '1 hour and 21 minutes', 'Release date': 'May 4, 2004', 'Dubbed': 'English, Spanish', 'Producers': 'Didier Brunner, Viviane Vanfleteren', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nThis dvd is enchanting and hysterically funny while at the same time being charming and a great deal of entertainment\nfunny dvd\nIce Bridge: Mackinac Island's Hidden Season\nJenifer Silvernale (Actor),  Mark Rensel (Writer)\nMovies & TV, Genre for Featured Categories, Documentary\n{'Publisher': 'Icebridgemovie (January 1, 2008)', 'Item Weight': '2.93 ounces'}\nthis dvd brings back the wonders of Mackinac Island and shows how beautiful and unique it is even in the dead of winter\nenjoyed",
  "profile": "**User Summary:**\n\nThis user maintains a strong preference for classic horror films, particularly those with a unique stylistic touch from renowned directors like Tim Burton. Their fondness for Johnny Depp reflects an appreciation for eclectic performances alongside quality storytelling that blends fantasy and horror elements. Recently, they have expanded their cinematic interests to include family-friendly holiday films, cherishing the tradition of watching seasonal movies, especially during Christmas, which highlights their love for feel-good classics that evoke joy and nostalgia.\n\nIn their latest interaction, the user demonstrated an interest in documentaries that showcase unique aspects of locations and seasons, indicating a broadening of interests beyond traditional genres. This marks a growing openness to diverse cinematic experiences while still valuing inventive storytelling. Their admiration for iconic performances and films that capture the spirit of various holidays remains evident, enriching their cinematic journey.\n\nThe user's consistent feedback on purchasing experiences reveals a commitment to high-quality films and quick delivery services, affirming their intention to build a personal collection of beloved titles. Overall, while their primary focus remains within the horror genre, the user embraces a variety of cinematic experiences that resonate with cherished memories and familial connections, illustrating a well-rounded appreciation for film across multiple genres.",
  "metrics": {
    "rouge1_f": 0.13419563459983833,
    "rouge2_f": 0.0032388663967611335,
    "rougeL_f": 0.06305578011317704,
    "meteor": 0.03577924506921422,
    "bleu1": 0.0007939342101148945,
    "bleu2": 0.00021927893489443034,
    "bleu3": 3.653033250489646e-05,
    "bleu4": 1.4926615158003288e-05,
    "bertscore_precision": 0.30745506286621094,
    "bertscore_recall": 0.4412665069103241,
    "bertscore_f1": 0.36240339279174805
  }
}