{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Vegan Mia - USDA Organic Radiance Superfruit Cleansing Oil and Make-up Remover, Oil Cleanser and Makeup Remover Oil for Dry Skin and Other Skin Types, Loaded with Moisturizer Essential Fatty Acids, Rich in Antioxidants, Truly Natural Skincare, (With No Added Fragrance) 3.4 fl oz\nReview Date: 2022/04/04\nStore: Vegan Mia\nAverage Rating: 4.3\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'Vegan Mia', 'Scent': 'Natural aroma of fruit oils - No fragrance added', 'Material Feature': 'Natural, Cruelty Free, Vegan', 'Package Dimensions': '6.34 x 1.77 x 1.73 inches; 9.14 Ounces', 'UPC': '762530483363', 'Manufacturer': 'Vegan Mia'}\nReview Text: This Vegan, Superfruit oil works well as a makeup remover and also helps hydrate my dry skin. Lately I’ve been using superfruit oils and I’ve found they keep my skin moisturized longer than using other serums.  It is pricey compared to other products in the market but the natural ingredients may be worth the extra money!<br /><br />Thank you for taking the time to read my review and photos of this product. I hope it has been helpful in providing you with more information.\nReview Title: Pricey But Works Well\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Bath Brush, Bamboo Bath Brush for Back Scrubber ESARORA Soft Natural Bristles Back Brush with Long Handle for Exfoliating Skin & Wood Beads for Massage - Use Wet or Dry - Suitable for Men and Women\nEsarora\n{'Material': 'Boar bristle, Bamboo', 'Brand': 'Esarora', 'Color': 'Yellow, Bath Brush', 'Item Dimensions LxWxH': '16.14 x 2.2 x 3.15 inches', 'Product Benefits': 'Softening,Massage,Promote Blood Circulation,Pores,Exfoliating,Blood Flow,Blood Circulation,Dirt', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16.14 x 2.2 x 3.15 inches; 8.43 Ounces', 'Item model number': 'A1', 'UPC': '759218239978', 'Manufacturer': 'ESARORA'}\nBrush has bee great after 2 months of usage.\nFive Stars\nOULAC Shine to Shine Moisture Shine Lipstick, Glossy Finish, Vegan Friendly, 2.2 grams / 0.07 ounces, # (09)\nOulac\n{'Brand': 'Oulac', 'Skin Type': 'All', 'Item Form': 'Stick', 'Finish Type': 'Glossy', 'Product Benefits': 'Nourishing,Moisturizing', 'Product Dimensions': '3.84 x 0.59 x 0.59 inches; 1.23 Ounces', 'Item model number': 'moistureshine-lipstick-09'}\nThis lipstick goes on sheer and very shiny, but the color still shows vibrant. I also like that it moisturizes your lips.<br /><br />Thank you for taking the time to read my review and photos of this product.  I hope it has been helpful in providing you with more information.\nSheer and Shiny Lipstick\n21Pcs Dip Powder Nail Kit - Aubss 10 Colors Dip Nail Kit, Neutral Skin Tone Dipping Powder Colors Kit, Dip Powder for French Nail Art Nail Manicure Kit Salon DIY Home, No Nail Lamp Needed\nAUBSS\n{'Material': 'Acrylic', 'Brand': 'AUBSS', 'Included Components': 'Dip Powder', 'Item Form': 'Powder', 'Product Dimensions': '8.94 x 8.23 x 1.73 inches; 1.29 Pounds'}\nThis dip power set is a great idea for gifting this holiday season. It comes with everything you’d need to learn how to use dip powder, even brings cuticle oil! The blue set brings a nice variety of colors, from pink to blue and some glittery one too. Highly recommended!<br /><br />Thank you for taking the time to read my review and photos of this product.  I hope it has been helpful in providing you with more information.\nNice Starter Kit\nVeda Tinda Gel Nail Polish Kit 20 Colors Fall Winter Modern Stage Soak off UV/LED Lamp Nail Polish Set with Glossy & Matte Top Coat and Base Coat Christmas\nveda Tinda\n{'Brand': 'veda Tinda', 'Item Form': 'Gel', 'Type': 'base', 'Finish Type': 'Glossy, Matte', 'Material Feature': 'Cruelty Free', 'Unit Count': '3.50 Fl Oz', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '10.63 x 3.98 x 3.94 inches; 1.81 Pounds'}\nThis set brings a great selection of colors that work well for special occasions since it has neutral pinks, mauve, burgundies, blues and many shades of grays/silver. It’s my go-to set for when I need to glam up for a wedding or nighttime party.<br /><br />Thank you for taking the time to read my review and photos of this product.  I hope it has been helpful in providing you with more information.\nGlamorous Nail Colors\nAubss 20Pcs Colors Gel Nail Polish Kit with Glossy & Matte Top Coat and 2Pcs Base Coat, Rainbow Colors Skin Tones Yellow Red Gel Polish for All Reason, Gel Nail Kit for Women Girls Christmas Gift\nAUBSS\n{'Brand': 'AUBSS', 'Item Form': 'Gel', 'Color': '003', 'Type': 'Gel', 'Finish Type': 'Matte,Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Count', 'Number of Items': '25', 'Item Dimensions LxWxH': '7.87 x 5.51 x 2.76 inches', 'Product Dimensions': '7.87 x 5.51 x 2.76 inches; 2.08 Ounces', 'Manufacturer': 'AUBSS'}\nThis gel nail polish set contains a great selection of 20 colors, and includes the base and glossy & matte top coats. I used the red polish on my toenails and so far they have lasted over 2 weeks without issues. However (at least with the red polish), the color goes on a bit transparent so you would definitely need 2 coats of color. Overall, it’s highly recommended!<br /><br />Thank you for taking the time to read my review and photos of this product.  I hope it has been helpful in providing you with more information.\nAffordable Selection of Gel Colors\nAIFAIFA 9Pcs Gel Nail Polish Set, Burgundy Nail Polish Kits Red Colors Soak Off UV/LED Nail Polish Set, Gel Polish with Base Coat & Glossy & Matte Top All-Season Salon Manicure Art Design Red\nAIFAIFA\n{'Brand': 'AIFAIFA', 'Item Form': 'Gel', 'Color': 'Burgundy,Red', 'Type': 'Gel', 'Finish Type': 'Glossy, Matte', 'Special Feature': 'Long Lasting', 'Material Feature': 'Non-Toxic', 'Unit Count': '9.00 Count', 'Number of Items': '9', 'Package Dimensions': '7.99 x 4.21 x 2.83 inches; 11.99 Ounces'}\nThis small set is perfect to add more shades of reds to your collection of gel polishes. Two coats and the color looks rich and vibrant. I also appreciate that it comes with glossy and matte top coats to change it up. I cure the base, color and top coats for 60 seconds each in my UV/LED lamp and it’s lasted for a week without chipping.<br /><br />Thank you for taking the time to read my review and photos of this product.  I hope it has been helpful in providing you with more information.\nGreat Selection of Reds\nSolflower SPF 30 Sunscreen Lotion - Broad Spectrum, UVA/UVB Protection - PABA-Free, Oil-Free - 3.36 Fl Oz\nSolflower\n{'Scent': 'Aloe Vera', 'Sun Protection Factor': '30 Sun Protection Factor (SPF)', 'Unit Count': '3.36 Fl Oz', 'Skin Type': 'All', 'Brand': 'Solflower', 'Package Dimensions': '5.08 x 1.93 x 1.89 inches; 5.93 Ounces', 'Item model number': '860006763404', 'UPC': '860006763404'}\nI use this sunscreen when I go out walking during my 1.5 hour exercise routine and it is sweat resistant and oil free. The product works well and has protected my face from a rosacea outbreak.<br /><br />Thank you for taking the time to read my review and photos of this product. I hope it has been helpful in providing you with more information.\nOil Free Sunscreen\nVegan Mia - USDA Organic Radiance Superfruit Cleansing Oil and Make-up Remover, Oil Cleanser and Makeup Remover Oil for Dry Skin and Other Skin Types, Loaded with Moisturizer Essential Fatty Acids, Rich in Antioxidants, Truly Natural Skincare, (With No Added Fragrance) 3.4 fl oz\nVegan Mia\n{'Item Form': 'Oil', 'Skin Type': 'All', 'Brand': 'Vegan Mia', 'Scent': 'Natural aroma of fruit oils - No fragrance added', 'Material Feature': 'Natural, Cruelty Free, Vegan', 'Package Dimensions': '6.34 x 1.77 x 1.73 inches; 9.14 Ounces', 'UPC': '762530483363', 'Manufacturer': 'Vegan Mia'}\nThis Vegan, Superfruit oil works well as a makeup remover and also helps hydrate my dry skin. Lately I’ve been using superfruit oils and I’ve found they keep my skin moisturized longer than using other serums.  It is pricey compared to other products in the market but the natural ingredients may be worth the extra money!<br /><br />Thank you for taking the time to read my review and photos of this product. I hope it has been helpful in providing you with more information.\nPricey But Works Well",
  "profile": "User Summary:\n\nThe user continues to cultivate their personal care collection with an emphasis on effective sun protection and high-quality, multifunctional items that align with their holistic beauty approach. Their recent purchase reflects a commitment to natural, eco-conscious, and cruelty-free products rich in nourishing ingredients, showcasing their dedication to sustainability.\n\nWith a preference for user-friendly solutions that facilitate creativity, the user seeks products that balance practicality and aesthetics, particularly suitable for outdoor activities. Their positive reception of highly-rated items influences their purchasing trends, ensuring alignment with established values of quality, efficacy, and mindful consumption.\n\nThe user values sharing effective beauty experiences, often gifting products that resonate with their principles, reinforcing their community-oriented mindset and dedication to self-care. They appreciate innovative solutions that enhance self-expression while remaining functionally stylish. Their impact-driven approach emphasizes integrating effective, eco-friendly beauty solutions into their routine, as they continue to expand their collection by prioritizing items that hydrate and nourish their skin without compromising on quality or ethics. Overall, the user maintains a strong focus on balancing practicality, performance, and sustainability in their personal care journey.",
  "metrics": {
    "rouge1_f": 0.09523809523809522,
    "rouge2_f": 0.005780346820809248,
    "rougeL_f": 0.053391053391053385,
    "meteor": 0.03352748713082242,
    "bleu1": 0.0004442576339619668,
    "bleu2": 0.00011422862579790761,
    "bleu3": 4.254772512013725e-05,
    "bleu4": 1.4620533097684798e-05,
    "bertscore_precision": 0.32268959283828735,
    "bertscore_recall": 0.44658857583999634,
    "bertscore_f1": 0.3746615946292877
  }
}