{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Jackass Presents: Bad Grandpa Extended Version\nReview Date: 2014/10/10\nCategories: Comedy, Feel-good, Outrageous, Fun\nProduct Description: ['Johnny Knoxville reprises his Jackass role as 86-year-old Irving Zisman in the story of a crotchety old man unexpectedly saddled with the care of his 8-year-old grandson Billy (Jackson Nicoll). Extended Version']\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeff Tremaine'], 'Producers': ['Johnny Knoxville', 'Spike Jonze', 'Jeff Tremaine', 'Derek Freda', 'Trip Taylor'], 'Starring': ['Johnny Knoxville']}\nReview Text: I would give it a minus 5 if there was a star for that. This is meant for the twenty something guy crowd. It was disgusting and embarrassing. The reviews said it was about a boy and his grandfather.  I never even got that far, it was so horrid.  I am too embarrassed to say how the movie even begins. My husband stared at me in disbelief. It is definitely not a family movie.  I guess I should have turned it off as soon as I saw &#34;Jackass Presents...&#34; I am in the dark, but not anymore.  Leave this for the guys and their immature minds.\nReview Title: It was disgusting and embarrassing\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'Andy Goddard', 'Jeremy Webb', 'David Evans'], 'Producers': ['Liz Trubridge', 'Gareth Neame', 'Julian Fellowes', 'Rebecca Eaton'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nI am late in watching this show. Now, I can't wait to watch the next episode. I love the acting, the scenery the costumes and the in-depth story line. It is a mastery piece of work!\nMastery\nJackass Presents: Bad Grandpa Extended Version\nComedy, Feel-good, Outrageous, Fun\n['Johnny Knoxville reprises his Jackass role as 86-year-old Irving Zisman in the story of a crotchety old man unexpectedly saddled with the care of his 8-year-old grandson Billy (Jackson Nicoll). Extended Version']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeff Tremaine'], 'Producers': ['Johnny Knoxville', 'Spike Jonze', 'Jeff Tremaine', 'Derek Freda', 'Trip Taylor'], 'Starring': ['Johnny Knoxville']}\nI would give it a minus 5 if there was a star for that. This is meant for the twenty something guy crowd. It was disgusting and embarrassing. The reviews said it was about a boy and his grandfather.  I never even got that far, it was so horrid.  I am too embarrassed to say how the movie even begins. My husband stared at me in disbelief. It is definitely not a family movie.  I guess I should have turned it off as soon as I saw &#34;Jackass Presents...&#34; I am in the dark, but not anymore.  Leave this for the guys and their immature minds.\nIt was disgusting and embarrassing",
  "profile": "User Summary:\n\nThe user demonstrates a discerning taste in entertainment, favoring high-quality content characterized by in-depth storytelling, strong performances, and aesthetically appealing visuals. Their previous engagement with complex narratives and character development reflects a preference for productions that offer nuanced themes and rich characterization. This is evident in their high ratings for thoughtful works despite their exposure to potentially controversial subject matter.\n\nHowever, the user recently expressed strong disappointment with a comedic film that they found to be distasteful and unappealing, suggesting that their appreciation for artistic craftsmanship does not extend to films that prioritize shock value over substance. Their review highlighted that they felt the content was not suitable for a broader audience, revealing a preference for works that maintain a level of artistic integrity and emotional resonance.\n\nOverall, while the user continues to value high-quality narratives and skilled performances, this recent interaction indicates a clear aversion to crude humor and content that lacks depth, emphasizing a desire for productions that resonate on an emotional level rather than those aimed at lower-brow comedy.",
  "metrics": {
    "rouge1_f": 0.18708240534521156,
    "rouge2_f": 0.00894854586129754,
    "rougeL_f": 0.09799554565701558,
    "meteor": 0.08223684210526315,
    "bleu1": 0.08243210010228688,
    "bleu2": 0.01985186066469371,
    "bleu3": 0.008578876247025675,
    "bleu4": 0.0031755872974698718,
    "bertscore_precision": 0.3458017408847809,
    "bertscore_recall": 0.4079248309135437,
    "bertscore_f1": 0.3743031322956085
  }
}