{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/08/24\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kirk Jones'], 'Producers': ['Rita Wilson', 'Tom Hanks', 'Gary Goetzman', 'Paul Brooks', 'Scott Niemeyer', 'Steven Shareshian', 'Nia Vardalos'], 'Starring': ['Nia Vardalos', 'John Corbett', 'Lainie Kazan'], 'Studio': ['Universal Pictures']}\nReview Text: We are still laughing after watching this delightful movie. It is so nice to see a movie that does not include intimate scenes or foul language. It is a wonderful family movie, filled with delight.  May you enjoy it as much as we did!\nReview Title: Still Laughing\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'Andy Goddard', 'Jeremy Webb', 'David Evans'], 'Producers': ['Liz Trubridge', 'Gareth Neame', 'Julian Fellowes', 'Rebecca Eaton'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nI am late in watching this show. Now, I can't wait to watch the next episode. I love the acting, the scenery the costumes and the in-depth story line. It is a mastery piece of work!\nMastery\nJackass Presents: Bad Grandpa Extended Version\nComedy, Feel-good, Outrageous, Fun\n['Johnny Knoxville reprises his Jackass role as 86-year-old Irving Zisman in the story of a crotchety old man unexpectedly saddled with the care of his 8-year-old grandson Billy (Jackson Nicoll). Extended Version']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeff Tremaine'], 'Producers': ['Johnny Knoxville', 'Spike Jonze', 'Jeff Tremaine', 'Derek Freda', 'Trip Taylor'], 'Starring': ['Johnny Knoxville']}\nI would give it a minus 5 if there was a star for that. This is meant for the twenty something guy crowd. It was disgusting and embarrassing. The reviews said it was about a boy and his grandfather.  I never even got that far, it was so horrid.  I am too embarrassed to say how the movie even begins. My husband stared at me in disbelief. It is definitely not a family movie.  I guess I should have turned it off as soon as I saw &#34;Jackass Presents...&#34; I am in the dark, but not anymore.  Leave this for the guys and their immature minds.\nIt was disgusting and embarrassing\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Nancy Meyers'], 'Producers': ['Nancy Meyers', 'Suzanne Farwell', 'Scott Rudin'], 'Starring': ['Robert De Niro', 'Anne Hathaway', 'Rene Russo']}\nWhat a sweet and loving movie.  Our daughter called us to say we had to watch this, that we would love it.  Indeed we did!\nPRECIOUS\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kirk Jones'], 'Producers': ['Rita Wilson', 'Tom Hanks', 'Gary Goetzman', 'Paul Brooks', 'Scott Niemeyer', 'Steven Shareshian', 'Nia Vardalos'], 'Starring': ['Nia Vardalos', 'John Corbett', 'Lainie Kazan'], 'Studio': ['Universal Pictures']}\nWe are still laughing after watching this delightful movie. It is so nice to see a movie that does not include intimate scenes or foul language. It is a wonderful family movie, filled with delight.  May you enjoy it as much as we did!\nStill Laughing",
  "profile": "User Summary:\n\nThe user continues to showcase a refined taste in entertainment, emphasizing high-quality narratives and notable performances that deliver emotional resonance and depth. Their recent interaction reflects a strong appreciation for family-oriented films that prioritize wholesome content, as they expressed delight in a delightful movie that resonated with them and offered a lighthearted yet meaningful viewing experience. This reinforces their preference for productions that abstain from intimate scenes and vulgarity, instead opting for narratives that promote joy and inclusivity.\n\nThe user's previous disappointment with shock-value comedic films is further underscored by their enthusiasm for projects that maintain artistic integrity while providing emotional uplift. Their engagement with narratives rich in character development and nuance reveals a consistent desire for storytelling that fosters connection and reflection. \n\nOverall, the user remains committed to enjoying well-crafted cinematic endeavors that offer clarity, richness, and substance, prioritizing films that create a positive atmosphere free from crudeness. Their inclination towards emotionally engaging content ensures they continue to seek productions that resonate on a personal level, further solidifying their passion for thoughtfully executed storytelling that entertains and uplifts.",
  "metrics": {
    "rouge1_f": 0.15025041736227043,
    "rouge2_f": 0.010050251256281407,
    "rougeL_f": 0.08681135225375627,
    "meteor": 0.05844629749661124,
    "bleu1": 0.025106972005945756,
    "bleu2": 0.008166425749639048,
    "bleu3": 0.0014370246317703616,
    "bleu4": 0.0006035811590037035,
    "bertscore_precision": 0.31573283672332764,
    "bertscore_recall": 0.3951675295829773,
    "bertscore_f1": 0.3510122299194336
  }
}