{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/02/28\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Nancy Meyers'], 'Producers': ['Nancy Meyers', 'Suzanne Farwell', 'Scott Rudin'], 'Starring': ['Robert De Niro', 'Anne Hathaway', 'Rene Russo']}\nReview Text: What a sweet and loving movie.  Our daughter called us to say we had to watch this, that we would love it.  Indeed we did!\nReview Title: PRECIOUS\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'Andy Goddard', 'Jeremy Webb', 'David Evans'], 'Producers': ['Liz Trubridge', 'Gareth Neame', 'Julian Fellowes', 'Rebecca Eaton'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nI am late in watching this show. Now, I can't wait to watch the next episode. I love the acting, the scenery the costumes and the in-depth story line. It is a mastery piece of work!\nMastery\nJackass Presents: Bad Grandpa Extended Version\nComedy, Feel-good, Outrageous, Fun\n['Johnny Knoxville reprises his Jackass role as 86-year-old Irving Zisman in the story of a crotchety old man unexpectedly saddled with the care of his 8-year-old grandson Billy (Jackson Nicoll). Extended Version']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeff Tremaine'], 'Producers': ['Johnny Knoxville', 'Spike Jonze', 'Jeff Tremaine', 'Derek Freda', 'Trip Taylor'], 'Starring': ['Johnny Knoxville']}\nI would give it a minus 5 if there was a star for that. This is meant for the twenty something guy crowd. It was disgusting and embarrassing. The reviews said it was about a boy and his grandfather.  I never even got that far, it was so horrid.  I am too embarrassed to say how the movie even begins. My husband stared at me in disbelief. It is definitely not a family movie.  I guess I should have turned it off as soon as I saw &#34;Jackass Presents...&#34; I am in the dark, but not anymore.  Leave this for the guys and their immature minds.\nIt was disgusting and embarrassing\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Nancy Meyers'], 'Producers': ['Nancy Meyers', 'Suzanne Farwell', 'Scott Rudin'], 'Starring': ['Robert De Niro', 'Anne Hathaway', 'Rene Russo']}\nWhat a sweet and loving movie.  Our daughter called us to say we had to watch this, that we would love it.  Indeed we did!\nPRECIOUS",
  "profile": "User Summary:\n\nThe user continues to exhibit a refined taste in entertainment, prioritizing high-quality narratives and notable performances that offer emotional resonance and depth. Their engagement with complex storytelling reflects a consistent preference for productions that delve into nuanced themes and character development. This is underscored by their recent purchase, in which they expressed delight in a sweet and loving film, emphasizing its heartwarming qualities that resonated with them on a personal level. \n\nWhile their previous disappointment with a comedic film reveals a distinct aversion to shock-value content lacking substance, this new interaction reinforces their appreciation for works that balance artistic integrity with emotional impact, regardless of the content advisory. The user is drawn to films that offer clarity and richness in their storytelling, showcasing their desire for narratives that engage and uplift rather than those that rely on crudeness for humor. Overall, they remain committed to enjoying productions that are well-crafted and offer a meaningful viewing experience, sustaining their inclination towards emotionally rich and thoughtfully executed cinematic endeavors.",
  "metrics": {
    "rouge1_f": 0.17425742574257425,
    "rouge2_f": 0.019880715705765408,
    "rougeL_f": 0.08316831683168316,
    "meteor": 0.07124480506629725,
    "bleu1": 0.04372647792557307,
    "bleu2": 0.014351902508885043,
    "bleu3": 0.00787192661988714,
    "bleu4": 0.004435930236238613,
    "bertscore_precision": 0.31749457120895386,
    "bertscore_recall": 0.3973880708217621,
    "bertscore_f1": 0.3529769778251648
  }
}