{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/12/25\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Steve Starkey', 'Robert Zemeckis', 'Gary Goetzman', 'William Teitler'], 'Starring': ['Tom Hanks', 'Michael Jeter', 'Nona Gaye'], 'Studio': ['WARNER HOME VIDEO']}\nReview Text: As a Christmas Eve tradition, we watch The Polar Express. Though our family has watched it yearly  since it first came out, we never tire of it, all of our emotions as if we were watching it for the first time. It is an excellent movie. Tom Hanks is extraordinary as the conductor, and the children are marvelous in their parts. The artistry and creativity of this film is magnificent. Place it in your video library, beside \"It's A Wonderful Life\" and \"Miracle on 34th Street,\" movies that will please you and future viewers in all of the years to come.\nReview Title: A Tradition\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Percival', 'Andy Goddard', 'Jeremy Webb', 'David Evans'], 'Producers': ['Liz Trubridge', 'Gareth Neame', 'Julian Fellowes', 'Rebecca Eaton'], 'Starring': ['Huge Bonneville', 'Michelle Dockery', 'Maggie Smith'], 'Studio': ['BritBox']}\nI am late in watching this show. Now, I can't wait to watch the next episode. I love the acting, the scenery the costumes and the in-depth story line. It is a mastery piece of work!\nMastery\nJackass Presents: Bad Grandpa Extended Version\nComedy, Feel-good, Outrageous, Fun\n['Johnny Knoxville reprises his Jackass role as 86-year-old Irving Zisman in the story of a crotchety old man unexpectedly saddled with the care of his 8-year-old grandson Billy (Jackson Nicoll). Extended Version']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jeff Tremaine'], 'Producers': ['Johnny Knoxville', 'Spike Jonze', 'Jeff Tremaine', 'Derek Freda', 'Trip Taylor'], 'Starring': ['Johnny Knoxville']}\nI would give it a minus 5 if there was a star for that. This is meant for the twenty something guy crowd. It was disgusting and embarrassing. The reviews said it was about a boy and his grandfather.  I never even got that far, it was so horrid.  I am too embarrassed to say how the movie even begins. My husband stared at me in disbelief. It is definitely not a family movie.  I guess I should have turned it off as soon as I saw &#34;Jackass Presents...&#34; I am in the dark, but not anymore.  Leave this for the guys and their immature minds.\nIt was disgusting and embarrassing\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Nancy Meyers'], 'Producers': ['Nancy Meyers', 'Suzanne Farwell', 'Scott Rudin'], 'Starring': ['Robert De Niro', 'Anne Hathaway', 'Rene Russo']}\nWhat a sweet and loving movie.  Our daughter called us to say we had to watch this, that we would love it.  Indeed we did!\nPRECIOUS\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kirk Jones'], 'Producers': ['Rita Wilson', 'Tom Hanks', 'Gary Goetzman', 'Paul Brooks', 'Scott Niemeyer', 'Steven Shareshian', 'Nia Vardalos'], 'Starring': ['Nia Vardalos', 'John Corbett', 'Lainie Kazan'], 'Studio': ['Universal Pictures']}\nWe are still laughing after watching this delightful movie. It is so nice to see a movie that does not include intimate scenes or foul language. It is a wonderful family movie, filled with delight.  May you enjoy it as much as we did!\nStill Laughing\nThe Age Of Adaline\nFantasy, Drama, Beautiful, Gentle\n['Blake Lively and Harrison Ford star in this stirring romantic drama about a 29-year-old woman who has stopped aging - and the timeless power of love.']\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Lee Toland Krieger'], 'Producers': ['Sidney Kimmel', 'Tom Rosenberg', 'Gary Lucchesi'], 'Starring': ['Blake Lively', 'Michiel Huisman']}\nThis is the best movie we have seen a a long, long time. It was beautifully done. There was so much emotion in it, shared through the screen, giving us the same sorrows, laughter, tears and joy. We are still talking about it, days later!\nLong, long time\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Steve Starkey', 'Robert Zemeckis', 'Gary Goetzman', 'William Teitler'], 'Starring': ['Tom Hanks', 'Michael Jeter', 'Nona Gaye'], 'Studio': ['WARNER HOME VIDEO']}\nAs a Christmas Eve tradition, we watch The Polar Express. Though our family has watched it yearly  since it first came out, we never tire of it, all of our emotions as if we were watching it for the first time. It is an excellent movie. Tom Hanks is extraordinary as the conductor, and the children are marvelous in their parts. The artistry and creativity of this film is magnificent. Place it in your video library, beside \"It's A Wonderful Life\" and \"Miracle on 34th Street,\" movies that will please you and future viewers in all of the years to come.\nA Tradition",
  "profile": "User Summary:\n\nThe user continues to showcase a refined taste in entertainment, emphasizing high-quality narratives and outstanding performances that resonate emotionally. Their latest interaction reveals a strong appreciation for films that embody wholesome storytelling and strong character development, reinforcing their dedication to narratives that foster connection and reflection. Their commitment to exploring uplifting and inspiring content is evident in their enjoyment of a beloved holiday classic, which they celebrate as a yearly family tradition.\n\nThis recent engagement highlights the user’s preference for cinematic experiences that evoke nostalgia and warmth while avoiding excessive vulgarity or intimate scenes. They seek productions that not only entertain but also enrich personal connections and promote joy and inclusivity. Their enthusiasm for visually and emotionally captivating storytelling further solidifies their alignment with family-friendly films that offer emotional depth and substance.\n\nOverall, the user remains devoted to thoughtfully crafted cinematic experiences, consistently prioritizing films that inspire positivity and deliver clarity and richness in their narratives. Their inclination toward timeless classics and modern productions alike reflects a deep appreciation for artistic integrity and the emotional impact of storytelling that uplifts both viewers and future generations.",
  "metrics": {
    "rouge1_f": 0.15492957746478872,
    "rouge2_f": 0.01411764705882353,
    "rougeL_f": 0.07511737089201877,
    "meteor": 0.0459868355394017,
    "bleu1": 0.005199463977989547,
    "bleu2": 0.0016140556259260305,
    "bleu3": 0.00026561803732095234,
    "bleu4": 0.00010788687444197658,
    "bertscore_precision": 0.32286834716796875,
    "bertscore_recall": 0.4739992022514343,
    "bertscore_f1": 0.38410231471061707
  }
}