{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Empty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nReview Date: 2020/09/07\nStore: Cherry\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nReview Text: Ive been ordering glass bottles and moving my products into them. I get refill size and transfer.  These 2 spray bottles were a little thinne not bad, but still sturdy enough and the spray top where the sprayer is spins loosely 360 degrees.  ?? I just filled it with my gallon of orange cleaner and I had to take off the sprayer and toss it in the garbage!  The flaw is the spinning sprayer that allowed my expensive orange cleaner to pour out of the top all around the nozzle.  cheaply made  but all in all a good glass bottle with a terrible srayer . If you just need a bottle with a screw top your good. If you have a different sprayer you can take off a plastic bottle great. Thats what I did. I took the label off my orange cleaner and stuck it on this bottle and it looks so nice. So my sprayer and label made a great usable bottle.\nReview Title: Needs a different sprayer that works\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "IQ:Natural Eco-Smart Formula Mineral Fair 2 Foundation 12g (MED BEIGE)\niQ Natural\n{'Item Form': 'Powder', 'Finish Type': 'Natural', 'Package Information': 'Bottle', 'Brand': 'IQ Natural', 'Skin Tone': 'Medium', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.8 x 4.1 x 1.2 inches; 0.42 Ounces'}\nthe color of this make is so unreal I couldnt believe it. the price was good so I ordered it, I went back and looked at all of the shades and none of them look real also really light I am a light blonde and I still looked like the bride of frankenstien not worth the money to send back they need to fix the colors to human shades the mineral veil is nice will buy again sorry\norange yikes\nGreenIVe - Anti-Age Hemp Extract Cream - Lift, Revitalize, Heal - Exclusively on Amazon (300mg)\nGreenIVe\n{'Brand': 'GreenIVe', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '6.1 x 2.1 x 1.7 inches; 4.8 Ounces', 'UPC': '810017842063'}\nFeels very nice , the scent is a bit earthy which I much prefer to perfumy\nSmooth\nStrixaderm Lash Advance Eyelash Conditioner - Hypo Allergenic Eyebrow Enhancer Serum & Primer Mascara For Natural Eye Brow Growth & Thick Long Lashes\nSTRIXADERM-MD\n{'Package Dimensions': '4.4 x 1.4 x 1.3 inches; 0.81 Ounces', 'UPC': '096563380000'}\nSo far I havent seen a change. Sometimes I feel rush when ask for a review for skin or haircare. Takes time to see growth or reduced wrinkles. Please dont rush us . If I see results in the future I will edit my review. Thanks\nNothing so far\nHair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nKapelli Hair\n{}\nI like this product a lot.  Good color and blends right into my hair. It even colors my greys ,it rubs color into them that was a surprise to me . Ive had an inch of grey and when Ive been hiding a bald spot or thinning spots it just deposits color right into my hair. Woohoo . these products are a little itchy when they get on your scalp.\nCovers and  colors thinning and greying hair\nGlass spray bottle-16 ounce empty bottle ounce refillable container 2 packs, suitable for essential oils, cleaning products, aromatherapy, water mist plants with mist and air flow settings\nDS DOODLE SABBATH\n{'Brand': 'DS DOODLE SABBATH', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Item Dimensions LxWxH': '2.76 x 2.76 x 8.27 inches', 'Special Feature': 'Adjustable Nozzle', 'Product Dimensions': '2.76 x 2.76 x 8.27 inches; 1.4 Pounds', 'UPC': '619011520959'}\nI'm replacing all my pump and spray bottles with these beautiful cobalt blue<br />glass bottles. The sprayer version is easy to hold and spray.  The sprayer is top notch even better than I was expecting . I filled one with my zero odor and I get a great fine mist . No drips or wet floor. I took the sticker off the plastic bottle and put it on my glass bottle. It came with a chalkboard type label, but I wanted my lable on this one.\nFine mist out of pretty bottle\nEmpty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nIve been ordering glass bottles and moving my products into them. I get refill size and transfer.  These 2 spray bottles were a little thinne not bad, but still sturdy enough and the spray top where the sprayer is spins loosely 360 degrees.  ?? I just filled it with my gallon of orange cleaner and I had to take off the sprayer and toss it in the garbage!  The flaw is the spinning sprayer that allowed my expensive orange cleaner to pour out of the top all around the nozzle.  cheaply made  but all in all a good glass bottle with a terrible srayer . If you just need a bottle with a screw top your good. If you have a different sprayer you can take off a plastic bottle great. Thats what I did. I took the label off my orange cleaner and stuck it on this bottle and it looks so nice. So my sprayer and label made a great usable bottle.\nNeeds a different sprayer that works",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user maintains a strong interest in mineral makeup, particularly foundations, while exploring skincare with anti-aging properties and eyebrow enhancements. Recently, they have begun using hair products tailored for thinning hair and greys. Additionally, they show a consistent preference for aesthetically pleasing and functional utility products, such as glass spray bottles, demonstrating a focus on both design and practicality.\n\n- **Skin Tone Consideration:** Emphasizes selecting shades appropriate for medium to fair skin, prioritizing accurate color matching and desirable finishes.\n\n- **Feedback on Color Accuracy:** The user is particularly sensitive to color representation and has expressed frustration with unflattering colors, although they have had positive experiences with hair product color matching.\n\n- **Value and Sensitivity Analysis:** They seek cost-effective yet quality products across cosmetics and hair care. Their patience with skincare results indicates a preference for gradual progress.\n\n- **Mixed Experiences:** The user appreciates good texture and natural scents but remains cautious about repeat purchases due to past experiences. They report satisfaction with blending and coverage, despite minor discomfort.\n\n- **Scent Preference:** Favors earthy fragrances over heavy perfumes, showing a sensitivity to scent.\n\n- **Overall Attitude:** Displays a discerning approach to reviews, prioritizing product efficacy before making conclusions. Their recent feedback on utility products reflects a preference for functionality, although they encountered issues with a specific component, leading to a thoughtful assessment of overall quality.",
  "metrics": {
    "rouge1_f": 0.19076305220883535,
    "rouge2_f": 0.018108651911468814,
    "rougeL_f": 0.08433734939759037,
    "meteor": 0.08525114363833519,
    "bleu1": 0.042129846614378304,
    "bleu2": 0.006845937456843077,
    "bleu3": 0.0012036450123433348,
    "bleu4": 0.0005051275952083519,
    "bertscore_precision": 0.37480586767196655,
    "bertscore_recall": 0.45958611369132996,
    "bertscore_f1": 0.41288888454437256
  }
}