{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Make-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nReview Date: 2020/11/30\nStore: LOMANTOWN\nAverage Rating: 4.1\nProduct Details: {'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\nReview Text: This is a very nice case, as you can see in the picture it holds  full size items. I haven't decided what all I want to put in it but when I do it holds plenty. It could be used for different purposes.\nReview Title: Well made ,multi uses\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "IQ:Natural Eco-Smart Formula Mineral Fair 2 Foundation 12g (MED BEIGE)\niQ Natural\n{'Item Form': 'Powder', 'Finish Type': 'Natural', 'Package Information': 'Bottle', 'Brand': 'IQ Natural', 'Skin Tone': 'Medium', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.8 x 4.1 x 1.2 inches; 0.42 Ounces'}\nthe color of this make is so unreal I couldnt believe it. the price was good so I ordered it, I went back and looked at all of the shades and none of them look real also really light I am a light blonde and I still looked like the bride of frankenstien not worth the money to send back they need to fix the colors to human shades the mineral veil is nice will buy again sorry\norange yikes\nGreenIVe - Anti-Age Hemp Extract Cream - Lift, Revitalize, Heal - Exclusively on Amazon (300mg)\nGreenIVe\n{'Brand': 'GreenIVe', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '6.1 x 2.1 x 1.7 inches; 4.8 Ounces', 'UPC': '810017842063'}\nFeels very nice , the scent is a bit earthy which I much prefer to perfumy\nSmooth\nStrixaderm Lash Advance Eyelash Conditioner - Hypo Allergenic Eyebrow Enhancer Serum & Primer Mascara For Natural Eye Brow Growth & Thick Long Lashes\nSTRIXADERM-MD\n{'Package Dimensions': '4.4 x 1.4 x 1.3 inches; 0.81 Ounces', 'UPC': '096563380000'}\nSo far I havent seen a change. Sometimes I feel rush when ask for a review for skin or haircare. Takes time to see growth or reduced wrinkles. Please dont rush us . If I see results in the future I will edit my review. Thanks\nNothing so far\nHair Fibers for Thinning Hair - 100% Undetectable Natural Formula - Completely Conceals Hair Loss in 15 Seconds - 27.5 Grams (Medium Brown)\nKapelli Hair\n{}\nI like this product a lot.  Good color and blends right into my hair. It even colors my greys ,it rubs color into them that was a surprise to me . Ive had an inch of grey and when Ive been hiding a bald spot or thinning spots it just deposits color right into my hair. Woohoo . these products are a little itchy when they get on your scalp.\nCovers and  colors thinning and greying hair\nGlass spray bottle-16 ounce empty bottle ounce refillable container 2 packs, suitable for essential oils, cleaning products, aromatherapy, water mist plants with mist and air flow settings\nDS DOODLE SABBATH\n{'Brand': 'DS DOODLE SABBATH', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Item Dimensions LxWxH': '2.76 x 2.76 x 8.27 inches', 'Special Feature': 'Adjustable Nozzle', 'Product Dimensions': '2.76 x 2.76 x 8.27 inches; 1.4 Pounds', 'UPC': '619011520959'}\nI'm replacing all my pump and spray bottles with these beautiful cobalt blue<br />glass bottles. The sprayer version is easy to hold and spray.  The sprayer is top notch even better than I was expecting . I filled one with my zero odor and I get a great fine mist . No drips or wet floor. I took the sticker off the plastic bottle and put it on my glass bottle. It came with a chalkboard type label, but I wanted my lable on this one.\nFine mist out of pretty bottle\nEmpty Brown Glass Spray Bottles2-Pack, Refillable 16 oz Containers for Essential Oils, Cleaning Products, Aromatherapy, Misting Plants, or Cooking - Reliable Sprayer with Mist and Stream Settings\nCherry\n{'Brand': 'Cherry', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '2', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.09 x 6.46 x 3.35 inches; 4.94 Ounces', 'UPC': '791523234187'}\nIve been ordering glass bottles and moving my products into them. I get refill size and transfer.  These 2 spray bottles were a little thinne not bad, but still sturdy enough and the spray top where the sprayer is spins loosely 360 degrees.  ?? I just filled it with my gallon of orange cleaner and I had to take off the sprayer and toss it in the garbage!  The flaw is the spinning sprayer that allowed my expensive orange cleaner to pour out of the top all around the nozzle.  cheaply made  but all in all a good glass bottle with a terrible srayer . If you just need a bottle with a screw top your good. If you have a different sprayer you can take off a plastic bottle great. Thats what I did. I took the label off my orange cleaner and stuck it on this bottle and it looks so nice. So my sprayer and label made a great usable bottle.\nNeeds a different sprayer that works\n[Marshique] Patented Eyelash Dryer - Extension & Lift/Perm Care Mascara Dry No Damage Curl USB Rechargeable\nMarshique\n{'Brand': 'Marshique', 'Handle Type': 'Massage Handle', 'Operation Mode': 'Automatic'}\nI love that this handy dandy eyelash dryer is rechargeable. So when I received this I was sceptical.  So I put my mascara on put this at the base of my lash and turned it on while pushing my eyelash up gently.  Warm air gently dried them curled up. It shut off when finished.  No hard squeeze with an eyelash curler needed ! This tool gently does the job. I love this tool. Easy to hold and use.\nIt's  rechargeable , gently dries and curls lashes\nMake-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nLOMANTOWN\n{'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\nThis is a very nice case, as you can see in the picture it holds  full size items. I haven't decided what all I want to put in it but when I do it holds plenty. It could be used for different purposes.\nWell made ,multi uses",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user remains dedicated to mineral makeup, particularly foundations, and has expanded their interest to skincare with anti-aging benefits, eyebrow enhancements, and hair products for thinning hair and greys. They continue valuing aesthetically pleasing and functional utility items.\n\n- **Organization Enthusiasm:** Recently, the user purchased a cosmetic organizer, highlighting their preference for practical storage solutions that blend style and functionality. This aligns with their overall appreciation for systematic product organization.\n\n- **Skin Tone Consideration:** They prioritize accurate shade selection for medium to fair skin, with a strong emphasis on color matching and appealing finishes.\n\n- **Feedback on Color Accuracy:** While they are sensitive to color representation in cosmetics and experienced frustration in the past, positive outcomes in hair product color matching have been noted.\n\n- **Value and Sensitivity Analysis:** The user seeks cost-effective, high-quality products in cosmetics and hair care, demonstrating patience with gradual skincare results. They value texture and natural scents, showing caution based on past experiences with purchases.\n\n- **Scent Preference:** Earthy fragrances are favored over heavy perfumes, reflecting their sensitivity to strong scents.\n\n- **Overall Attitude:** The user takes a discerning approach to reviews, focusing on product efficacy and practical solutions, as evidenced by their satisfaction with innovative beauty tools and storage solutions.",
  "metrics": {
    "rouge1_f": 0.17326732673267325,
    "rouge2_f": 0.01487603305785124,
    "rougeL_f": 0.07095709570957096,
    "meteor": 0.07012707044355777,
    "bleu1": 0.011435368031266966,
    "bleu2": 0.002476444521483648,
    "bleu3": 0.00040416330789254536,
    "bleu4": 0.00016342427096838942,
    "bertscore_precision": 0.36582425236701965,
    "bertscore_recall": 0.4621707797050476,
    "bertscore_f1": 0.4083920121192932
  }
}