{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nReview Date: 2021/04/21\nStore: Marine Forest\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Package Dimensions': '6.42 x 2.28 x 0.94 inches; 2.24 Ounces', 'UPC': '729843697955'}\nReview Text: I tried each one of these lip liners and they are not true to the colors on the pencils. I like how vibrant the colors are and how smoothly the liner goes on. Paired with a lipstick, they look really nice and work well. I just wish that the color was accurate. Other than that, great product!\nReview Title: Pretty colors, not accurate\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "DeepDream Portable Electric Nail Drill - Professional Efile Nail Drill Kit For Acrylic, Gel Nails, Manicure Pedicure Polishing Shape Tools with 11Pcs Nail Drill Bits and 36 Sanding Bands\nDeep Dream\n{'Brand': 'Deep Dream', 'Power Source': 'Battery Powered', 'Maximum Rotational Speed': '20000 RPM', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8 x 4 x 2.6 inches; 10.41 Ounces', 'UPC': '191762584966', 'Manufacturer': 'Deep Dream'}\nJust used the deep dream electric nail drill.  Love it, I will not use nail files again! Loved that it has a speed control where it can be slow to very fast for acrylic nails. It worked great on my natural nails. Will definitely keep using it!\nWorks fantastic! No more nail file for me!\nVOOADA Electric for Face, Arm, Waist, Belly, Leg, Hip\nVOOADA\n{'Package Dimensions': '9.69 x 7.87 x 2.05 inches; 1.37 Pounds', 'UPC': '699936288523'}\nGreat nail set! At first I thought it didn't come with any attachments, but they're actually on the bottom!\nEasy to use!\nFog-free Dental Mirror and 4 Pieces of Stainless Steel Dental Pick Professional Oral Care Kit for Family including Dogs Oral Care\nSunrise glow\n{'Package Dimensions': '8.15 x 2.4 x 1.3 inches; 4.23 Ounces'}\nThe tools are exactly what you'd expect. I really just wanted this pack for the mirror. Well, I got it and now I realize I need to make a dental appointment! In all seriousness, the mirror works okay but after I pulled the protective plastic cover off it started to scratch badly. Don't know why.\nOkay\nPlant Therapy Natural Acetone Free Nail Polish Remover 6 fl oz One Touch Dispensing Bottle with Flip Top Cap Tropical Flower Scent\nPlant Therapy\n{'Brand': 'Plant Therapy', 'Item Form': 'Liquid', 'Item Weight': '6.24 Ounces', 'Number of Items': '1', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '5.1 x 2.2 x 2.2 inches; 6.24 Ounces', 'UPC': '680912056168'}\nSmells great and works! Doesn't burn like regular nail polish does\nWorks well!\nOval Large Makeup Brushes Fast Application Liquid Cream Powder Foundation (Rose Gold 1)\nLAMJAD\n{'Brand': 'LAMJAD', 'Material': 'synthetic', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Skin Tone': 'All', 'Package Dimensions': '8.23 x 3.07 x 1.61 inches; 0.71 Ounces', 'UPC': '714403137835'}\nI didn't even get to use this brush I was so disappointed. As I was trying to remove the tape around the plastic covering the handle snapped in half.\nBroke immediately\nBlue Sage De-Puffing Caffeine Eye Serum | Natural Anti-Aging Eye Treatment with Probiotics, Green Tea + Hyaluronic Acid Serum for Face to Tighten and Hydrate under Eye Skin, and Brighten Dark Circles\nBlue Sage\n{'Package Dimensions': '6.06 x 1.65 x 1.42 inches; 4.69 Ounces', 'UPC': '860004070450', 'Manufacturer': 'Blue Sage Skin Co'}\nI couldn't use this product at all. Any time I tried to apply to my under eye it would burn really badly. I would have to immediately wipe it off. I always used a clean face when I applied this and it still burned.\nBurned and I couldn't use\nBlack Wolf - Men’s Ultra Hydrating Moisturizer - 1.7 Fl Oz – Soothe Dry, Patchy & Flaky Areas on your Skin - Fast Absorbing Formula Won't Feel Heavy or Greasy - Sulfate Free for Dry Skin\nBlack Wolf\n{'Brand': 'Black Wolf', 'Item Form': 'Lotion', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Dry', 'Package Dimensions': '5.39 x 3.15 x 1.46 inches; 2.4 Ounces', 'Item model number': 'BLKWLF_MOIST_DRY', 'UPC': '850021340087'}\nI like to use this moisturizer after I use the Black Wolf charcoal mask. It helps moisturize my skin and calm it afterwards. It's not greasy and moisturizes really well. It has a light scent that isn't too strong. I've been using this moisturizer for a while now and it hasn't caused any breakouts or dry spots. Really good product!\nSmells nice, moisturizes, works well after black mask use\nLip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nMarine Forest\n{'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Package Dimensions': '6.42 x 2.28 x 0.94 inches; 2.24 Ounces', 'UPC': '729843697955'}\nI tried each one of these lip liners and they are not true to the colors on the pencils. I like how vibrant the colors are and how smoothly the liner goes on. Paired with a lipstick, they look really nice and work well. I just wish that the color was accurate. Other than that, great product!\nPretty colors, not accurate",
  "profile": "User Profile Summary:\n\n- **Nail, Oral, Skincare, and Makeup Enthusiast**: The user is dedicated to high-quality grooming, now including a growing interest in makeup tools, particularly lip liners, alongside their focus on nail care, oral hygiene, and skincare.\n\n- **Preference for Efficiency and Performance**: They seek tools that streamline their routines, favoring technology that enhances usability across diverse applications. The user appreciates products with fast-absorbing formulas and lightweight, non-greasy textures.\n\n- **Quality Assurance with Sensitivity Considerations**: High performance and usability remain paramount, with sensitivity to product quality. They value gentle formulations, vibrant colors, and pleasant scents that enhance the grooming experience, showing critical feedback regarding color accuracy in makeup products.\n\n- **Positive Experience with Versatility**: The user maintains a toolkit of multifunctional products that address various grooming and makeup needs, ensuring seamless applications across their personal care routine.\n\n- **Consistent Use and Integration**: They actively incorporate products into their regular routines, demonstrating dedication to sustained care, including new makeup finds that complement their overall grooming practices.\n\n- **Critical Feedback with Constructive Insight**: The user offers balanced critiques, showing thoughtful engagement with product effectiveness. Their recent experiences highlight a desire for accurate color representation in makeup while maintaining high standards for quality and performance.\n\nOverall, the user prioritizes high-quality, versatile grooming tools, incorporating skincare and makeup into their routine while remaining discerning about product effectiveness.",
  "metrics": {
    "rouge1_f": 0.15338645418326693,
    "rouge2_f": 0.007984031936127744,
    "rougeL_f": 0.06772908366533864,
    "meteor": 0.0719429700749393,
    "bleu1": 0.02669945433114479,
    "bleu2": 0.00545955633027184,
    "bleu3": 0.0009415958073762035,
    "bleu4": 0.0003913822040181973,
    "bertscore_precision": 0.36722928285598755,
    "bertscore_recall": 0.46108123660087585,
    "bertscore_f1": 0.40883833169937134
  }
}