{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: AISI BEAUTY Yaki Ponytail Extension Kinky Straight Ponytail for Black Women Magic Paste Synthetic Ponytail Clip on Hairpieces for Women(24inch,4#)\nReview Date: 2021/05/13\nStore: AISI BEAUTY\nAverage Rating: 3.4\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Wavy, Curly', 'Style': 'Straight', 'Brand': 'AISI BEAUTY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9 x 7 x 2 inches; 3.21 Ounces'}\nReview Text: This ponytail is thin&more straight than kinky so it does not blend with my hair.\nReview Title: 👎\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "PrettyDiva Winged Eyeliner Stamp - Waterproof Long Lasting Liquid Eyeliner Pen Smudgeproof Eye Makeup Seal Stamp Tool for Wing or Cat Eye - Black\nPretty Diva\n{'Brand': 'Pretty Diva', 'Special Feature': 'Waterproof', 'Product Benefits': 'Long Lasting', 'Unit Count': '1.00 Count', 'Coverage': 'Light', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.2 x 0.7 x 0.7 inches; 0.64 Ounces'}\nPen is dried out\nOne Star\nAWAYTR Feather Headband Indian Headpiece - Bohemian Tassels Hair Band Headwear For Women Girls (All black)\nAWAYTR\n{'Age Range (Description)': 'Adult', 'Material': 'Feather', 'Number of Items': '1', 'Brand': 'AWAYTR', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '22 x 2.5 x 0.7 inches; 1.59 Ounces', 'UPC': '799670075714'}\nLooks much more costume like than the pic.\nGood for costume only\nPEACOCO Yaki Straight Ponytail for Black Women, 26\" Long Wrap Drawstring Kinky Straight Clip in Pony Tail Extensions, Afro Puff Kinky Straight Drawstring Ponytail for African American Women (4#)\nPEACOCO\n{'Material': 'synthetic', 'Hair Type': 'Curly, Coily', 'Brand': 'PEACOCO', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13 x 3.5 x 2 inches; 4.8 Ounces', 'Item model number': 'yaki-26-4#'}\nThis ponytail's texture is straight. It does not blend with my 4c kinky hair texture.\nNot kinky as advertised\nAISI BEAUTY Yaki Ponytail Extension Kinky Straight Ponytail for Black Women Magic Paste Synthetic Ponytail Clip on Hairpieces for Women(24inch,4#)\nAISI BEAUTY\n{'Material': 'Human Hair', 'Hair Type': 'Wavy, Curly', 'Style': 'Straight', 'Brand': 'AISI BEAUTY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9 x 7 x 2 inches; 3.21 Ounces'}\nThis ponytail is thin&more straight than kinky so it does not blend with my hair.\n👎",
  "profile": "**User Profile Summary:**\n\n- **Product Usage:** The user continues to focus on makeup products, particularly eye makeup, while also showing a keen interest in hair accessories that align with their personal style.\n- **Preference for Quality:** The user's unwavering commitment to quality is underscored by recent interactions, particularly dissatisfaction with a hair accessory that failed to blend seamlessly with their natural texture. This highlights a consistent expectation for durability and authenticity across beauty and fashion products.\n- **Rating Behavior:** The user maintains a critical and precise evaluation approach, recently giving a one-star rating for a subpar hairpiece, reinforcing their pattern of prioritizing performance and true representation of products.\n- **Expectations:** The user seeks reliability, such as waterproof and long-lasting features, particularly in eye makeup and hair accessories that complement their aesthetic. Their discerning taste underscores the importance of authenticity and functionality.\n- **Feedback Engagement:** The user remains active in providing constructive feedback and detailed reviews, demonstrating a commitment to sharing personal experiences that influence product quality. They express disappointment when products do not meet their high standards, reflecting a consistent pattern of engagement in both beauty and fashion sectors.\n\nOverall, the user exhibits a discerning purchasing behavior, emphasizing quality and authenticity while actively advocating for higher product standards through their feedback.",
  "metrics": {
    "rouge1_f": 0.14373716632443534,
    "rouge2_f": 0.012371134020618556,
    "rougeL_f": 0.06570841889117043,
    "meteor": 0.07539582809751193,
    "bleu1": 0.0922290367368682,
    "bleu2": 0.014091714540478384,
    "bleu3": 0.0035012109509892425,
    "bleu4": 0.0017468833068206614,
    "bertscore_precision": 0.3443183898925781,
    "bertscore_recall": 0.37150105834007263,
    "bertscore_f1": 0.3573935925960541
  }
}