{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Aisiade Long Kinky Straight U Part Wigs for Black Women Half Wig Yaki Straight U Part Wigs Clip in Hair Extension Middle Part Wig Synthetic Black Straight Wigs Natural Hair Full Head\nReview Date: 2021/08/15\nStore: Aisaide\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Aisaide', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.4 x 7.1 x 2.7 inches; 10.41 Ounces'}\nReview Text: This wig is not kinky it's just straight which means it will not blend with my hair.Also one clip arrived broken which left me with three clips verses four.\nReview Title: False advertising\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "PrettyDiva Winged Eyeliner Stamp - Waterproof Long Lasting Liquid Eyeliner Pen Smudgeproof Eye Makeup Seal Stamp Tool for Wing or Cat Eye - Black\nPretty Diva\n{'Brand': 'Pretty Diva', 'Special Feature': 'Waterproof', 'Product Benefits': 'Long Lasting', 'Unit Count': '1.00 Count', 'Coverage': 'Light', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.2 x 0.7 x 0.7 inches; 0.64 Ounces'}\nPen is dried out\nOne Star\nAWAYTR Feather Headband Indian Headpiece - Bohemian Tassels Hair Band Headwear For Women Girls (All black)\nAWAYTR\n{'Age Range (Description)': 'Adult', 'Material': 'Feather', 'Number of Items': '1', 'Brand': 'AWAYTR', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '22 x 2.5 x 0.7 inches; 1.59 Ounces', 'UPC': '799670075714'}\nLooks much more costume like than the pic.\nGood for costume only\nPEACOCO Yaki Straight Ponytail for Black Women, 26\" Long Wrap Drawstring Kinky Straight Clip in Pony Tail Extensions, Afro Puff Kinky Straight Drawstring Ponytail for African American Women (4#)\nPEACOCO\n{'Material': 'synthetic', 'Hair Type': 'Curly, Coily', 'Brand': 'PEACOCO', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13 x 3.5 x 2 inches; 4.8 Ounces', 'Item model number': 'yaki-26-4#'}\nThis ponytail's texture is straight. It does not blend with my 4c kinky hair texture.\nNot kinky as advertised\nAISI BEAUTY Yaki Ponytail Extension Kinky Straight Ponytail for Black Women Magic Paste Synthetic Ponytail Clip on Hairpieces for Women(24inch,4#)\nAISI BEAUTY\n{'Material': 'Human Hair', 'Hair Type': 'Wavy, Curly', 'Style': 'Straight', 'Brand': 'AISI BEAUTY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9 x 7 x 2 inches; 3.21 Ounces'}\nThis ponytail is thin&more straight than kinky so it does not blend with my hair.\n👎\n5 Pieces Exfoliating Face and Body Wash Cloths Towel Soft Weave Bath Cloth Exfoliating Scrub Cloth Massage Bath Cloth for Women and Men (Beige with Gray)\nTatuo\n{'Material': 'Nylon', 'Brand': 'Tatuo', 'Style': 'Pad', 'Number of Pieces': '5', 'Unit Count': '1.00 Count', 'Package Dimensions': '12.44 x 10.12 x 0.87 inches; 4.59 Ounces', 'Manufacturer': 'Tatuo'}\nIf it's possible to b in love with a washcloth then this is the real thing. It lathers so much&so quick that i am able to use half the bodywash i used to use. The soft side is silky smooth&the rough side is rough enough that u no longer have to scub your skin u can just gently rub the cloth all over. It's literally 2 wash cloths in one.\n😍\nAisiade Long Kinky Straight U Part Wigs for Black Women Half Wig Yaki Straight U Part Wigs Clip in Hair Extension Middle Part Wig Synthetic Black Straight Wigs Natural Hair Full Head\nAisaide\n{'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'Aisaide', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.4 x 7.1 x 2.7 inches; 10.41 Ounces'}\nThis wig is not kinky it's just straight which means it will not blend with my hair.Also one clip arrived broken which left me with three clips verses four.\nFalse advertising",
  "profile": "**Updated User Profile Summary:**\n\nThe user remains dedicated to makeup, particularly eye products, and has a notable interest in hair accessories and body care, specifically exfoliating cloths that enhance their bathing experience. Their focus on quality is evident; they recently expressed satisfaction with a new body care item while maintaining a critical approach toward other products. \n\nThe user has demonstrated high standards in their evaluations, having previously awarded a one-star rating for a disappointing hair accessory. Their latest experience with a synthetic wig, which they rated one star due to misrepresentation and product defects, reinforces their expectation for authenticity and performance across their purchases. \n\nThey actively seek reliable products that enhance usability, such as efficiency in lathering for body care items and durability in makeup and hair accessories. Their engagement in providing detailed, constructive feedback shows their commitment to influencing product quality while expressing clear preferences. Overall, the user exemplifies discerning purchasing behavior, emphasizing quality, performance, and authenticity in beauty and personal care products.",
  "metrics": {
    "rouge1_f": 0.13213213213213215,
    "rouge2_f": 0.012048192771084338,
    "rougeL_f": 0.06306306306306306,
    "meteor": 0.051353874883286646,
    "bleu1": 0.0180142280948004,
    "bleu2": 0.0036490901505768633,
    "bleu3": 0.0007909268521037482,
    "bleu4": 0.00036871800852713595,
    "bertscore_precision": 0.29309606552124023,
    "bertscore_recall": 0.350290447473526,
    "bertscore_f1": 0.3191511034965515
  }
}