{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lucifer: The Complete Third Season\nReview Date: 2020/08/29\nStore: Ellis, Tom  (Actor),     German, Lauren  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, TV\nProduct Description: ['DVD Lucifer 4']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Feature', 'Format': 'NTSC', 'Contributor': 'German, Lauren, Alejandro, Kevin, Ellis, Tom', 'Number Of Discs': '5', 'Runtime': '1051 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.72 Ounces', 'Media Format': 'NTSC', 'Run time': '1051 minutes', 'Actors': 'Ellis, Tom, German, Lauren, Alejandro, Kevin', 'Studio': 'NTSC', 'Number of discs': '5'}\nReview Text: love he tv series and the actors\nReview Title: Lucifer\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Witless Protection (Widescreen Edition)\nLarry the Cable Guy  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['During a routine day spent patrolling his small town, sheriff Larry witnesses a beautiful, high-class woman, Madeleine, being held against her will by four mysterious, black-suited men. Recognizing the opportunity to save the day, Larry \"kidnaps\" her, only to learn that Madeleine is actually a key witness in a high-stakes Chicago crime case and her captors are FBI agents assigned to protect her. Madeleine is furious. But Larry, who rightly suspects the agents are crooked and Madeleine is in danger, forces her on a harebrained trip to Chicago to solve the case himself. Together, the mismatched duo must grapple with angry FBI agents, quack doctors and Chicago high society.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Larry the Cable Guy', 'Language': 'Unqualified', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'LGT24082DVD', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'June 10, 2008', 'Actors': 'Larry the Cable Guy', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love Larry the cable guy\nfunny\nDelta Farce (Full Screen Edition)\nMichael Edward Rose  (Actor),     Glenn Morshower  (Actor),     C.B. Harding  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Down on his luck after losing his job and his girlfriend on the same day, Larry decides to join his neighbor, Bill, and his combat-happy buddy, Everett, for a relaxing weekend of drinking and target practice. But when the three hapless guys are mistaken for Army Reservists by the hard-nosed Sergeant Kilgrove, they're loaded onto an army plane headed for Fallujah, Iraq--and mistakenly ejected in a Humvee somewhere over Mexico. Convinced they're actually in the Middle East, the clueless wannabe soldiers save a rural village from a siege of bandits and become local heroes. But when Carlos Santana, a ruthless, karaoke-loving warlord, strikes back, Larry, Bill and Everett have to lay down their beers and take up their arms--and prove they just might be real soldiers after all.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': \"McKinley Freeman, Parker Goris, Matt Riedy, Lisa Lampanelli, J.P. Williams, Michael Edward Rose, Luis Chávez, DJ Qualls, Tony Perez, Esteban Cueto, Glenn Morshower, Lance Smith, Keith David, Michael Papajohn, Alan Blomquist, Tom Rosales, Nicholas Guilak, Jeff Dunham, Craig Susser, Ed O'Ross, C.B. Harding, P.J. Walsh, Bill Doyle, Emilio Rivera, Joseph Nunez, Larry the Cable Guy, Danielle Hartnett, Christina Moore, Jimmy Ortega, Joel McKinnon Miller, Parallel Entertaiment; Samwilla; Shaler Entertainment, David DeSantos, Lorna Scott, Bill Engvall, Shelly Desai, Rolando Molina, Carlos Moreno Jr., Chris Spencer, Marisol Nichols, Toby Holguin, Danny Trejo, Amy Powell, Alejandro Patino, Albert SantosMcKinley Freeman, Parker Goris, Matt Riedy, Lisa Lampanelli, J.P. Williams, Michael Edward Rose, Luis Chávez, DJ Qualls, Tony Perez, Esteban Cueto, Glenn Morshower, Lance Smith, Keith David, Michael Papajohn, Alan Blomquist, Tom Rosales, Nicholas Guilak, Jeff Dunham,…  See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT23801DVD', 'Director': 'C.B. Harding', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 29 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Michael Edward Rose, Glenn Morshower, Larry the Cable Guy, Christina Moore, Lorna Scott', 'Subtitles': 'English, Spanish', 'Producers': 'J.P. Williams, Alan Blomquist', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '1'}\nLove all the movies that Larry the cable guy makes\nlove it\nPolice Academy 7-Film Collection (DVD)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Police Academy 7-Film Collection (DVD)', 'The complete collection of all seven movies in the law and disorder series. Includes Police Academy, Police Academy 2: Their First Assignment, Police Academy 3: Back In Training, Police Academy 4: Citizens on Patrol, Police Academy 5: Assignment Miami Beach, Police Academy 6: City Under Siege, and Police Academy 7: Mission to Moscow.', ']]>']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Various', 'Initial release date': '2018-05-29', 'Runtime': '607 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.28 Ounces', 'Item model number': 'B07CLRYJS4', 'Director': 'Various', 'Media Format': 'DVD, NTSC', 'Run time': '607 minutes', 'Release date': 'May 29, 2018', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nseries 1-4 is hilarious.\nso many laughs\nLucifer: Season 4 (DVD)\nTom Ellis  (Actor),     Lauren German  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Lucifer: The Complete Fourth Season (DVD)', 'Entering its fourth season, the story of the original fallen angel continues, with the charming, charismatic and devilishly handsome Lord of Hell, Lucifer Morningstar (series star TOM ELLIS), helping LAPD detective Chloe Decker (series star LAUREN GERMAN) take down criminals. Reeling from the aftermath of Chloe seeing his devil face in the season three finale, Lucifer faces a new challenge: Eve (new series star INBAR LAVI), the original sinner herself, is back. Does she want revenge for when he tempted her out of Eden oh so many years ago? Or something else entirely?', ']]>']\n{'Genre': 'Drama, Suspense, Science Fiction', 'Format': 'DVD, NTSC', 'Contributor': 'Rachael Harris, Aimee Garcia, Tom Welling, Inbar Lavi, Jerry Bruckheimer, Tricia Helfer, Scarlett Estevez, Joe Henderson, Lauren German, DB Woodside, Lesley-Ann Brandt, Jonathan Littman, Sheri Elwood, KristieAnne Reed, Tom Ellis, Jason Ning, Kevin Alejandro, Ildy ModrovichRachael Harris, Aimee Garcia, Tom Welling, Inbar Lavi, Jerry Bruckheimer, Tricia Helfer, Scarlett Estevez, Joe Henderson, Lauren German, DB Woodside, Lesley-Ann Brandt, Jonathan Littman, Sheri Elwood, KristieAnne Reed, Tom Ellis, Jason Ning, Kevin Alejandro,…  See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'D750322D', 'Media Format': 'DVD, NTSC', 'Run time': '479 minutes', 'Release date': 'May 12, 2020', 'Actors': 'Tom Ellis, Lauren German, Kevin Alejandro, DB Woodside, Lesley-Ann Brandt', 'Producers': 'Jerry Bruckheimer, Jonathan Littman, Joe Henderson, Ildy Modrovich, Sheri Elwood', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nlove the program and the actor\nLucifer\nLucifer: The Complete Third Season\nEllis, Tom  (Actor),     German, Lauren  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n['DVD Lucifer 4']\n{'Genre': 'Feature', 'Format': 'NTSC', 'Contributor': 'German, Lauren, Alejandro, Kevin, Ellis, Tom', 'Number Of Discs': '5', 'Runtime': '1051 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.72 Ounces', 'Media Format': 'NTSC', 'Run time': '1051 minutes', 'Actors': 'Ellis, Tom, German, Lauren, Alejandro, Kevin', 'Studio': 'NTSC', 'Number of discs': '5'}\nlove he tv series and the actors\nLucifer",
  "profile": "**Updated User Profile Summary:**\n\nThis user has a pronounced preference for comedy films, particularly those with lighthearted humor and engaging narratives, showcasing a fondness for Larry the Cable Guy. Their recent review of a classic comedy collection highlights their enjoyment of humorous content, earning a strong rating of 4.0. \n\nIn a notable shift, the user rated the series \"Lucifer\" a perfect 5.0, illustrating their appreciation for characters with charm and charisma. While this series is more aligned with drama and suspense, it reflects their willingness to explore diverse genres, especially those that incorporate humorous elements.\n\nThe user has also recently purchased a season of \"Lucifer,\" further emphasizing their enthusiasm for the series and its compelling cast. This acquisition aligns with their overall high average rating of 4.5 for family-friendly, humor-driven content, particularly PG-13 films featuring familiar comedic actors.\n\nOverall, while the user primarily gravitates towards lighthearted narratives, their engagement with \"Lucifer\" indicates an openness to narratives blending humor with other thematic elements. This diversification within their viewing habits solidifies their connection to comedic entertainment while showcasing their evolving interests in related genres.",
  "metrics": {
    "rouge1_f": 0.11079545454545454,
    "rouge2_f": 0.008534850640113799,
    "rougeL_f": 0.05397727272727273,
    "meteor": 0.033377168618470524,
    "bleu1": 0.0001673074761598305,
    "bleu2": 4.0436447647572124e-05,
    "bleu3": 1.8587886443256523e-05,
    "bleu4": 1.0610034823566045e-05,
    "bertscore_precision": 0.315531849861145,
    "bertscore_recall": 0.44899922609329224,
    "bertscore_f1": 0.37061554193496704
  }
}