{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Play Misty for Me\nReview Date: 2021/04/01\nStore: Clint Eastwood  (Actor, Director),     Jessica Walter  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['Clint Eastwood made his directorial debut with this contemporary thriller about psychotic obsession. Eastwood also takes the lead in the starring role as Dave Garver, a popular radio disc jockey who repeatedly receives on-air phone requests from a sexy female fan to \"play Misty for me\". When the woman, Evelyn Draper (Jessica Walter), orchestrates a rendezvous with Dave at his favorite nightspot, the two begin a torrid affair. But when Dave decides to end the relationship, Evelyn\\'s obsession turns to violence. Soon everything and everyone in Dave\\'s life becomes a target for Evelyn\\'s increasingly deadly campaign of terror. Beautifully photographed on location in Eastwood\\'s hometown of Carmel, California, Play Misty for Me continues to be considered one of the great modern-day thrillers.Bonus Content:', 'Play It Again... A Look Back at Play Misty For Me', 'Play It Again... A Look Back at Play Misty For Me', 'The Beguiled, Misty, Don and Clint', 'The Beguiled, Misty, Don and Clint', 'Clint Eastwood on DVD', 'Clint Eastwood on DVD', 'Photograph Montage', 'Photograph Montage', 'Clint Eastwood Directs and Acts', 'Clint Eastwood Directs and Acts', 'The Evolution of a Poster', 'The Evolution of a Poster', 'Theatrical Trailer', 'Theatrical Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features', 'DVD-ROM Features', 'Recommendations', 'Recommendations']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Mystery & Suspense', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Jack Ging, Irene Hervey, Otis Kadani, Clarice Taylor, Duke Everts, Tim Frawley, Clint Eastwood, James McEachin, Brit Lind, Donna Mills, John Larch, Donald Siegel, Jessica Walter, Mervin W. Frates, George Fargo, Jo HeimsJack Ging, Irene Hervey, Otis Kadani, Clarice Taylor, Duke Everts, Tim Frawley, Clint Eastwood, James McEachin, Brit Lind, Donna Mills, John Larch, Donald Siegel, Jessica Walter, Mervin W. Frates, George Fargo, Jo Heims  See more', 'Language': 'English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.05 Ounces', 'Item model number': '2219826', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'September 18, 2001', 'Actors': 'Clint Eastwood, Jessica Walter, Donna Mills, John Larch, Jack Ging', 'Dubbed': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Jo Heims', 'Number of discs': '1'}\nReview Text: my husband wanted this and he has never seen it before. Loves Eastwood movies\nReview Title: old movie\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Witless Protection (Widescreen Edition)\nLarry the Cable Guy  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['During a routine day spent patrolling his small town, sheriff Larry witnesses a beautiful, high-class woman, Madeleine, being held against her will by four mysterious, black-suited men. Recognizing the opportunity to save the day, Larry \"kidnaps\" her, only to learn that Madeleine is actually a key witness in a high-stakes Chicago crime case and her captors are FBI agents assigned to protect her. Madeleine is furious. But Larry, who rightly suspects the agents are crooked and Madeleine is in danger, forces her on a harebrained trip to Chicago to solve the case himself. Together, the mismatched duo must grapple with angry FBI agents, quack doctors and Chicago high society.']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Larry the Cable Guy', 'Language': 'Unqualified', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'LGT24082DVD', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 37 minutes', 'Release date': 'June 10, 2008', 'Actors': 'Larry the Cable Guy', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love Larry the cable guy\nfunny\nDelta Farce (Full Screen Edition)\nMichael Edward Rose  (Actor),     Glenn Morshower  (Actor),     C.B. Harding  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Down on his luck after losing his job and his girlfriend on the same day, Larry decides to join his neighbor, Bill, and his combat-happy buddy, Everett, for a relaxing weekend of drinking and target practice. But when the three hapless guys are mistaken for Army Reservists by the hard-nosed Sergeant Kilgrove, they're loaded onto an army plane headed for Fallujah, Iraq--and mistakenly ejected in a Humvee somewhere over Mexico. Convinced they're actually in the Middle East, the clueless wannabe soldiers save a rural village from a siege of bandits and become local heroes. But when Carlos Santana, a ruthless, karaoke-loving warlord, strikes back, Larry, Bill and Everett have to lay down their beers and take up their arms--and prove they just might be real soldiers after all.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled', 'Contributor': \"McKinley Freeman, Parker Goris, Matt Riedy, Lisa Lampanelli, J.P. Williams, Michael Edward Rose, Luis Chávez, DJ Qualls, Tony Perez, Esteban Cueto, Glenn Morshower, Lance Smith, Keith David, Michael Papajohn, Alan Blomquist, Tom Rosales, Nicholas Guilak, Jeff Dunham, Craig Susser, Ed O'Ross, C.B. Harding, P.J. Walsh, Bill Doyle, Emilio Rivera, Joseph Nunez, Larry the Cable Guy, Danielle Hartnett, Christina Moore, Jimmy Ortega, Joel McKinnon Miller, Parallel Entertaiment; Samwilla; Shaler Entertainment, David DeSantos, Lorna Scott, Bill Engvall, Shelly Desai, Rolando Molina, Carlos Moreno Jr., Chris Spencer, Marisol Nichols, Toby Holguin, Danny Trejo, Amy Powell, Alejandro Patino, Albert SantosMcKinley Freeman, Parker Goris, Matt Riedy, Lisa Lampanelli, J.P. Williams, Michael Edward Rose, Luis Chávez, DJ Qualls, Tony Perez, Esteban Cueto, Glenn Morshower, Lance Smith, Keith David, Michael Papajohn, Alan Blomquist, Tom Rosales, Nicholas Guilak, Jeff Dunham,…  See more\", 'Language': 'Unqualified', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT23801DVD', 'Director': 'C.B. Harding', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Full Screen, NTSC, Subtitled', 'Run time': '1 hour and 29 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Michael Edward Rose, Glenn Morshower, Larry the Cable Guy, Christina Moore, Lorna Scott', 'Subtitles': 'English, Spanish', 'Producers': 'J.P. Williams, Alan Blomquist', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '1'}\nLove all the movies that Larry the cable guy makes\nlove it\nPolice Academy 7-Film Collection (DVD)\nVarious  (Actor, Director)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Police Academy 7-Film Collection (DVD)', 'The complete collection of all seven movies in the law and disorder series. Includes Police Academy, Police Academy 2: Their First Assignment, Police Academy 3: Back In Training, Police Academy 4: Citizens on Patrol, Police Academy 5: Assignment Miami Beach, Police Academy 6: City Under Siege, and Police Academy 7: Mission to Moscow.', ']]>']\n{'Genre': 'Comedy, Action & Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Various', 'Initial release date': '2018-05-29', 'Runtime': '607 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.28 Ounces', 'Item model number': 'B07CLRYJS4', 'Director': 'Various', 'Media Format': 'DVD, NTSC', 'Run time': '607 minutes', 'Release date': 'May 29, 2018', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '4'}\nseries 1-4 is hilarious.\nso many laughs\nLucifer: Season 4 (DVD)\nTom Ellis  (Actor),     Lauren German  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Lucifer: The Complete Fourth Season (DVD)', 'Entering its fourth season, the story of the original fallen angel continues, with the charming, charismatic and devilishly handsome Lord of Hell, Lucifer Morningstar (series star TOM ELLIS), helping LAPD detective Chloe Decker (series star LAUREN GERMAN) take down criminals. Reeling from the aftermath of Chloe seeing his devil face in the season three finale, Lucifer faces a new challenge: Eve (new series star INBAR LAVI), the original sinner herself, is back. Does she want revenge for when he tempted her out of Eden oh so many years ago? Or something else entirely?', ']]>']\n{'Genre': 'Drama, Suspense, Science Fiction', 'Format': 'DVD, NTSC', 'Contributor': 'Rachael Harris, Aimee Garcia, Tom Welling, Inbar Lavi, Jerry Bruckheimer, Tricia Helfer, Scarlett Estevez, Joe Henderson, Lauren German, DB Woodside, Lesley-Ann Brandt, Jonathan Littman, Sheri Elwood, KristieAnne Reed, Tom Ellis, Jason Ning, Kevin Alejandro, Ildy ModrovichRachael Harris, Aimee Garcia, Tom Welling, Inbar Lavi, Jerry Bruckheimer, Tricia Helfer, Scarlett Estevez, Joe Henderson, Lauren German, DB Woodside, Lesley-Ann Brandt, Jonathan Littman, Sheri Elwood, KristieAnne Reed, Tom Ellis, Jason Ning, Kevin Alejandro,…  See more', 'Language': 'English', 'Number Of Discs': '2', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': 'D750322D', 'Media Format': 'DVD, NTSC', 'Run time': '479 minutes', 'Release date': 'May 12, 2020', 'Actors': 'Tom Ellis, Lauren German, Kevin Alejandro, DB Woodside, Lesley-Ann Brandt', 'Producers': 'Jerry Bruckheimer, Jonathan Littman, Joe Henderson, Ildy Modrovich, Sheri Elwood', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '2'}\nlove the program and the actor\nLucifer\nLucifer: The Complete Third Season\nEllis, Tom  (Actor),     German, Lauren  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, TV\n['DVD Lucifer 4']\n{'Genre': 'Feature', 'Format': 'NTSC', 'Contributor': 'German, Lauren, Alejandro, Kevin, Ellis, Tom', 'Number Of Discs': '5', 'Runtime': '1051 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.72 Ounces', 'Media Format': 'NTSC', 'Run time': '1051 minutes', 'Actors': 'Ellis, Tom, German, Lauren, Alejandro, Kevin', 'Studio': 'NTSC', 'Number of discs': '5'}\nlove he tv series and the actors\nLucifer\nEvolution\nDavid Duchovny  (Actor),     Julianne Moore  (Actor),     Ivan Reitman  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n{'Genre': 'Science Fiction & Fantasy, Comedy', 'Format': 'Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, NTSC, Dubbed', 'Contributor': 'Ty Burrell, Orlando Jones, Pat Kilbane, Dan Aykroyd, David Duchovny, Julianne Moore, Seann William Scott, Michael Bower, Ted Levine, Ivan Reitman, Ethan SupleeTy Burrell, Orlando Jones, Pat Kilbane, Dan Aykroyd, David Duchovny, Julianne Moore, Seann William Scott, Michael Bower, Ted Levine, Ivan Reitman, Ethan Suplee  See more', 'Language': 'English', 'Studio': 'Paramount', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.95 Ounces', 'Item model number': 'evolution', 'Director': 'Ivan Reitman', 'Media Format': 'Dolby, AC-3, DTS Surround Sound, Subtitled, Widescreen, NTSC, Dubbed', 'Release date': 'September 26, 2017', 'Actors': 'David Duchovny, Julianne Moore, Orlando Jones, Seann William Scott, Ted Levine', 'Dubbed': 'Spanish, French', 'Subtitles': 'Spanish, French, English', 'Number of discs': '1'}\nMy husband watches this dvd so many times\nlove it\nHouse, M.D.: The Complete Series\nHugh Laurie  (Actor),     Robert Sean Leonard  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Every baffling case. Every brilliant diagnosis. Every brutal insult. They\\'re all here in all eight seasons of House, M.D., the compelling medical drama that critics proclaimed \"one of the smartest and intellectually bravest shows on television\" (Jennifer Arrow, E! Online). Two-time Golden Globe winner Hugh Laurie is Dr. Gregory House, Princeton-Plainsboro Teaching Hospital\\'s Chief of Diagnostic Medicine whose astounding intellect is matched only by his frightening bedside manner. Relive every captivating moment as House and his team of doctors solve complex medical mysteries, push professional boundaries, and face their own demons. Gripping, witty, and intelligent, satisfy your House addiction in this must-own 41-disc collection, featuring all 176 episodes of this Primetime Emmy and Golden Globe-winning television phenomenon.']\n{'Genre': 'House: Season Three, House: Season One, Drama, DVD Movie, House: Season Six, House: Season Five, House: Season Two, Blu-ray Movie, House: Season Eight, House: Season Four, House: Season SevenHouse: Season Three, House: Season One, Drama, DVD Movie, House: Season Six, House: Season Five, House: Season Two, Blu-ray Movie, House: Season Eight, House: Season Four, House: Season Seven   See more', 'Format': 'Box set, NTSC, Subtitled, Widescreen', 'Contributor': 'David Morse, Steve Valentine, Lisa Edelstein, Mira Sorvino, Jesse Spencer, Anne Dudek, Hugh Laurie, Robert Sean Leonard, Jennifer Morrison, Peter Jacobson, Kal Penn, Omar Epps, Olivia WildeDavid Morse, Steve Valentine, Lisa Edelstein, Mira Sorvino, Jesse Spencer, Anne Dudek, Hugh Laurie, Robert Sean Leonard, Jennifer Morrison, Peter Jacobson, Kal Penn, Omar Epps, Olivia Wilde   See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '41', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '4.8 x 5.5 x 7.7 inches; 3.2 Pounds', 'Item model number': '26192925', 'Media Format': 'Box set, NTSC, Subtitled, Widescreen', 'Run time': '129 hours and 23 minutes', 'Release date': 'October 2, 2012', 'Actors': 'Hugh Laurie, Robert Sean Leonard, Lisa Edelstein, Omar Epps, Jesse Spencer', 'Subtitles': 'Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '41'}\nlove the series\nlove the series\nThe Big Bang Theory: The Twelfth and Final Season [DVD]\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['The Big Bang Theory: The Twelfth and Final Season: Leonard and Sheldon are brilliant physicists – geniuses in the laboratory but socially challenged everywhere else. Enter beautiful, street-smart neighbor Penny, who aims to teach them a thing or two about life. Despite their on-again, off-again relationship in the past, Leonard and Penny have finally gotten married. Even Sheldon has found a female companion, entering into a “relationship agreement” with neurobiologist Amy Farrah Fowler, and he recently took their relationship to the next level by marrying her after a long courtship. In their free time, Leonard and Sheldon enjoy fantasy role-playing games with their ever-expanding universe of friends, including fellow scientists Raj, Howard and Howard’s adorable microbiologist wife, Bernadette, who is adjusting to life with their two children.']\n{'Genre': 'Comedy', 'Format': 'Subtitled, NTSC, DVD', 'Contributor': 'Steve Holland, Bill Prady, Maria Ferrari, Steve Hollander, Jim Parsons, Kunal Nayyar, Simon Helberg, Dave Goetsch, Johnny Galecki, Kaley Cuoco, Mayim Bialik, Melissa Rauch, Steven Molaro, Eric Kaplan, Chuck LorreSteve Holland, Bill Prady, Maria Ferrari, Steve Hollander, Jim Parsons, Kunal Nayyar, Simon Helberg, Dave Goetsch, Johnny Galecki, Kaley Cuoco, Mayim Bialik, Melissa Rauch, Steven Molaro, Eric Kaplan, Chuck Lorre  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.96 Ounces', 'Media Format': 'Subtitled, NTSC, DVD', 'Run time': '2 hours and 4 minutes', 'Release date': 'November 12, 2019', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar', 'Subtitles': 'English, French, Spanish', 'Producers': 'Chuck Lorre, Steven Molaro, Bill Prady, Steve Hollander, Steve Holland', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nNeeded the final to complete the whole series\nseries\nThe War: A Ken Burns Film\nn/a  (Actor),     Ken Burns  (Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Boxed Sets, Documentary\n['The Emmy® award-winning documentary THE WAR explores the history and horror of World War II from an American perspective by following so-called ordinary men and women who became caught up in one of the greatest cataclysms in history. This epic film focuses on the stories of citizens from four American towns taking the viewer through their personal and harrowing journeys, painting vivid portraits of how the war altered their lives.']\n{'Aspect Ratio': '1.78:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 14.72 Ounces', 'Item model number': '0841887019477', 'Director': 'Ken Burns', 'Media Format': 'Multiple Formats, Box set, Color, Dolby, Widescreen, NTSC', 'Run time': '15 hours', 'Release date': 'October 20, 2017', 'Dubbed': 'English', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'PBS (Direct)', 'Number of discs': '6'}\nMy husband is a history buff and missed this on television. He was only able to watch one episode. Now he can watch it at his leisure.\ngreat for history buffs\nPlay Misty for Me\nClint Eastwood  (Actor, Director),     Jessica Walter  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Clint Eastwood made his directorial debut with this contemporary thriller about psychotic obsession. Eastwood also takes the lead in the starring role as Dave Garver, a popular radio disc jockey who repeatedly receives on-air phone requests from a sexy female fan to \"play Misty for me\". When the woman, Evelyn Draper (Jessica Walter), orchestrates a rendezvous with Dave at his favorite nightspot, the two begin a torrid affair. But when Dave decides to end the relationship, Evelyn\\'s obsession turns to violence. Soon everything and everyone in Dave\\'s life becomes a target for Evelyn\\'s increasingly deadly campaign of terror. Beautifully photographed on location in Eastwood\\'s hometown of Carmel, California, Play Misty for Me continues to be considered one of the great modern-day thrillers.Bonus Content:', 'Play It Again... A Look Back at Play Misty For Me', 'Play It Again... A Look Back at Play Misty For Me', 'The Beguiled, Misty, Don and Clint', 'The Beguiled, Misty, Don and Clint', 'Clint Eastwood on DVD', 'Clint Eastwood on DVD', 'Photograph Montage', 'Photograph Montage', 'Clint Eastwood Directs and Acts', 'Clint Eastwood Directs and Acts', 'The Evolution of a Poster', 'The Evolution of a Poster', 'Theatrical Trailer', 'Theatrical Trailer', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'DVD-ROM Features', 'DVD-ROM Features', 'Recommendations', 'Recommendations']\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Mystery & Suspense', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Jack Ging, Irene Hervey, Otis Kadani, Clarice Taylor, Duke Everts, Tim Frawley, Clint Eastwood, James McEachin, Brit Lind, Donna Mills, John Larch, Donald Siegel, Jessica Walter, Mervin W. Frates, George Fargo, Jo HeimsJack Ging, Irene Hervey, Otis Kadani, Clarice Taylor, Duke Everts, Tim Frawley, Clint Eastwood, James McEachin, Brit Lind, Donna Mills, John Larch, Donald Siegel, Jessica Walter, Mervin W. Frates, George Fargo, Jo Heims  See more', 'Language': 'English (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1), French (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.05 Ounces', 'Item model number': '2219826', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'September 18, 2001', 'Actors': 'Clint Eastwood, Jessica Walter, Donna Mills, John Larch, Jack Ging', 'Dubbed': 'Spanish, French', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Jo Heims', 'Number of discs': '1'}\nmy husband wanted this and he has never seen it before. Loves Eastwood movies\nold movie",
  "profile": "**Updated User Profile Summary:**\n\nThe user continues to exhibit a strong affinity for comedy films, favoring lighthearted humor and engaging narratives, with a particular admiration for charismatic performances. Their progression towards a broader film appreciation is evident, as illustrated by a recent purchase reflecting an interest in classic thrillers, showcasing an evolving taste that now includes drama and suspense.\n\nThis user maintains a solid average rating of 4.5 for PG-13 films featuring familiar comedic actors and expresses a fondness for character-driven stories. The 5.0 rating for a sci-fi comedy demonstrates their growing interest in humor across various genres. They also show an openness to historical content, as evidenced by acquiring a highly-rated documentary.\n\nRecent interactions indicate a commitment to timeless classics, with a new purchase of a well-regarded thriller from Clint Eastwood's directorial debut, suggesting a curiosity for engaging narratives beyond their usual comedic preferences. This variety complements their existing love for lighthearted family-friendly entertainment, combining humor with occasional thought-provoking themes.\n\nOverall, the user embraces a diverse cinematic landscape while remaining grounded in their comedic roots, highlighting their appreciation for enriching storytelling experiences across genres.",
  "metrics": {
    "rouge1_f": 0.06726149622512012,
    "rouge2_f": 0.00618131868131868,
    "rougeL_f": 0.035003431708991076,
    "meteor": 0.017039858765632295,
    "bleu1": 3.946626730105813e-09,
    "bleu2": 1.2306861383379528e-09,
    "bleu3": 1.8652536036035894e-10,
    "bleu4": 7.270410931095781e-11,
    "bertscore_precision": 0.3061830699443817,
    "bertscore_recall": 0.47748154401779175,
    "bertscore_f1": 0.3731105625629425
  }
}