{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2021/10/12\nAverage Rating: 4.1\nProduct Details: {'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Darren Lynn Bousman'], 'Producers': ['Oren Koules', 'Mark Burg'], 'Starring': ['Chris Rock', 'Max Minghella', 'Samuel L. Jackson'], 'Studio': ['LIONSGATE']}\nReview Text: This movie was wicked stupid! Nothing like the saw movies. It’s a waste of time.i highly recommend Skipping this one and save your money.<br />The acting is horrible too, especially Chris Rock. Even though he’s usually in comedies, He’s always been a great actor. I don’t think this is his fault. It’s whoever the director was….\nReview Title: This movie was stupid!\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Closer (Superbit Edition)\nJulia Roberts  (Actor),     Jude Law  (Actor),     Mike Nichols  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['A witty, romantic, and very dangerous love story about chance meetings, instant attractions, and casual betrayals. CLOSER is director Mike Nichols\\' critically acclaimed look at four strangers - Julia Roberts, Jude Law, Natalie Portman and Clive Owen - with one thing in common: each other. Adaptedby Patrick Marber from his award-winning stage play, CLOSER \"VIBRATES WITH EROTICISM, BRUISING LAUGHS, AND DYNAMIC PERFORMANCES. CLOSER IS A TRIUMPH!\" - Peter Travers, ROLLING STONE']\n{'Genre': 'Drama', 'Format': 'AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, DTS Surround Sound, Subtitled, Widescreen', 'Contributor': 'John Calley, Carey Brokaw, Cocksure Entertainment; Columbia Pictures Industries, Inc., Julia Roberts, Clive Owen, Mike Nichols, Natalie Portman, Jude LawJohn Calley, Carey Brokaw, Cocksure Entertainment; Columbia Pictures Industries, Inc., Julia Roberts, Clive Owen, Mike Nichols, Natalie Portman, Jude Law  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified, French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 1.6 Ounces', 'Item model number': '043396048478', 'Director': 'Mike Nichols', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, DTS Surround Sound, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'March 29, 2005', 'Actors': 'Julia Roberts, Jude Law, Natalie Portman, Clive Owen', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Mike Nichols, John Calley, Carey Brokaw', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI love this movie! I only bought it for 1 cent. Yes that's right 1 cent! And paid a few bucks for shipping and handling. It was in great condition, no scratches, it didn't skip at all. Love amazon. I highly recommend buying items on here. Never had a problem with anything I purchased.\nGina\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Twohy'], 'Producers': ['Ryan Kavanaugh', 'Mark Canton', 'Tucker Tooley', 'Robbie Brenner'], 'Starring': ['Timothy Olyphant', 'Steve Zahn', 'Milla Jovovich'], 'Studio': ['Rogue Pictures']}\nLoved this movie. I seen it years ago and decided to rent it and stream it. It was $1.99. I think it should be cheaper or free  since it's a older movie. You only have it for 24 hours. I was confused when I 1st rented it. It said I had it for 30 days then the next day I watched the rest of it bc I fell asleep the 1st time, it then said I had 16 hours left to watch it. Maybe they're was a glitch in the system.. I think if your renting it you should have it available longer than 24 hours. If played well. No interruptions.\nGood\nAlvin and the Chipmunks: The Chipmunk Adventure\nRated:    G    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['ALVIN AND THE CHIPMUNKS:CHIPMUNK ADVE - DVD Movie']\n{'Format': 'NTSC, Full Screen', 'Contributor': 'Alvin & The Chipmunks', 'Language': 'Unqualified (DTS ES 6.1)', 'Publication Date': 'March 23, 2010', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Media Format': 'NTSC, Full Screen', 'Release date': 'March 23, 2010', 'Actors': 'Alvin & The Chipmunks', 'Studio': 'Paramount'}\nLoved this movie when I was a kid! One day I remembered this movie and decided to look for it on amazon and of corse I found it. I watched it once then gave it to my nieces and nephew. It is now their favorite movie. It arrived in a timely manor. Played good without interruptions. I would recommend this buyer\nAwesome!\nWall-E (Three-Disc Special Edition)\nBen Burtt  (Actor),     Elissa Knight  (Actor),     Andrew Stanton  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Characters & Series, Wall-E\n['Product Description', \"The highly acclaimed director of FINDING NEMO and the creative storytellers behind CARS and RATATOUILLE transport you to a galaxy not so far away for a new cosmic comedy adventure about a determined robot named WALL-E. After hundreds of lonely years of doing what he was built for, the curious and lovable WALL-E discovers a new purpose in life when he meets a sleek search robot named EVE. Join them and a hilarious cast of characters on a fantastic journey across the universe. Transport yourself to a fascinating new world with Disney-Pixar's latest adventure, now even more astonishing on DVD and Blu-ray(TM) and loaded with bonus features, including the exclusive animated short film BURN-E. WALL-E is a film your family will want to enjoy over and over again.\", 'Amazon.com', 'Pixar genius reigns in this funny romantic comedy, which stars a robot who says absolutely nothing for a full 25 minutes yet somehow completely transfixes and endears himself to the audience within the first few minutes of the film. As the last robot left on earth, Wall-E (voiced by Ben Burtt) is one small robot--with a big, big heart--who holds the future of earth and mankind squarely in the palm of his metal hand. He\\'s outlasted all the \"Waste Allocation Load Lifter Earth-Class\" robots that were assigned some 700 years ago to clean up the environmental mess that man made of earth while man vacationed aboard the luxury spaceship Axiom. Wall-E has dutifully gone about his job compacting trash, the extreme solitude broken only by his pet cockroach, but he\\'s developed some oddly human habits and ideas. When the Axiom sends its regularly scheduled robotic EVE probe (Elissa Knight) to earth, Wall-E is instantly smitten and proceeds to try to impress EVE with his collection of human memorabilia. EVE\\'s directive compels her to bring Wall-E\\'s newly collected plant sprout to the captain of the Axiom and Wall-E follows in hot pursuit. Suddenly, the human world is turned upside down and the Captain (Jeff Garlin) joins forces with Wall-E and a cast of other misfit robots to lead the now lethargic people back home to earth.', 'Wall-E', 'is a great family film with the most impressive aspect being the depth of emotion conveyed by a simple robot--a machine typically considered devoid of emotion, but made so absolutely touching by the magic of Pixar animation. Also well-worth admiring are the sweeping views from space, the creative yet disturbing vision of what strange luxuries a future space vacation might offer, and the innovative use of trash in a future cityscape. Underneath the slapstick comedy and touching love story is a poignant message about the folly of human greed and its potential effects on earth and the entire human race.', 'Wall-E', 'is preceded in theaters by the comical short', 'Presto', \"in which a magician's rabbit, unfed one too many times takes his revenge against the egotistical magician. (Ages 3 and older)\", '--Tami Horiuchi', '>', 'Stills from', 'Wall-E', '(Click for larger image)', 'Review', 'Golden Globes 2009 Winner Best Animated Feature Film', 'Boston Society of Film Critics Awards 2008 Winner Best Animated Film', 'Chicago Film Critics Association Awards 2008 Winner Best Animated Feature', 'Chicago Film Critics Association Awards 2008 Winner Best Original Score', 'Chicago Film Critics Association Awards 2008 Winner Best Picture', 'Chicago Film Critics Association Awards 2008 Winner Best Screenplay, Original', 'Hollywood Film Festival 2008 Winner Animation of the Year', 'Los Angeles Film Critics Association Awards 2008 Winner Best Picture', 'National Board of Review, USA 2008 Winner Best Animated Feature', 'National Movie Awards, UK 2008 Winner Best Family Film', 'New York Film Critics Circle Awards 2008 Winner Best Animated Film', 'Southeastern Film Critics Association Awards 2008 Winner Best Animated Film', 'Toronto Film Critics Association Awards 2008 Winner Best Animated Feature', 'World Soundtrack Awards 2008 Winner Best Original Song Written Directly for FilmMusic by Thomas Newman, Music by, lyrics by, performed by Peter Gabriel Down To Earth --imdb.com', 'Set Contains:', 'The', 'Special Edition', 'comes laden with extras, notably \"Presto,\" the hilarious homage to the great Warner Bros. and MGM cartoons that played with', 'Wall-E', 'in theaters. A second short, \"Burn-E,\" feels more like an alternate version of a sequence from the feature than an separate film. In addition to the usual commentaries and making-of featurettes, the Bonus Disc includes director Andrew Stanton\\'s cogent thoughts on several deleted scenes, four video games, fly-throughs of the film\\'s major sets, and a children\\'s storybook, \"Lots of Bots.\" Watching all these features in one sitting or even one day would exhaust even a dedicated fan. One of the most critically acclaimed films of recent years', 'Wall-E', 'lives up to its hype. (Rated G, General audiences: minor violence and potentially scary imagery)', '--Charles Solomon', 'See more']\n{'Genre': 'Action & Adventure', 'Format': \"Multiple Formats, AC-3, Box set, Color, NTSC, Widescreen, Dolby, Collector's Edition\", 'Contributor': 'Kathy Najimy, Elissa Knight, Macintalk, Jeff Garlin, Ben Burtt, Fred Willard, John Ratzenberger, Andrew Stanton, Sigourney Weaver, Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim ReardonKathy Najimy, Elissa Knight, Macintalk, Jeff Garlin, Ben Burtt, Fred Willard, John Ratzenberger, Andrew Stanton, Sigourney Weaver, Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim Reardon  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 38 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '6.27 x 0.54 x 6.81 inches; 0.01 Ounces', 'Director': 'Andrew Stanton', 'Media Format': \"Multiple Formats, AC-3, Box set, Color, NTSC, Widescreen, Dolby, Collector's Edition\", 'Run time': '1 hour and 38 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Ben Burtt, Elissa Knight, Jeff Garlin, Fred Willard, Macintalk', 'Studio': 'Disney-Pixar', 'Writers': 'Original Story By Andrew Stanton And Pete Docter, Screenplay By Andrew Stanton And Jim Reardon', 'Number of discs': '1'}\nAlready wrote a review awhile back.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Gray', 'Michael Apted', 'Joshua Butler', 'Jan Eliasberg', 'Coky Giedroyc', 'Catherine Hardwicke', 'Eric Laneuville', 'Edward Ornelas', 'Ian Sander', 'Stephen Surjik'], 'Studio': ['CBS']}\nThis is a great show. However I will never pay to watch each episode. That's insane! Maybe I would pay $3 for the entire season but not one episode. Besides it's on demand for free with my cable subscribed.\nGreat show but not worth paying for each episode on here.\nFlubber\nRobin Williams  (Actor),     Marcia Gay Harden  (Actor),     Dean Cundey  (Director),     Les Mayfield  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['Product Description', 'Packed with unmistakable Disney magic, FLUBBER explodes on the screen, fusing adventure, eye-popping visual effects, and the gravity-defying comic genius of Robin Williams. The resulting concoction is a hilarious adventure for all ages. Brilliant but befuddled Professor Phillip Brainard (Williams) is on the brink of inventing a revolutionary energy source and missing his wedding to fiancee Dr. Sara Jean Reynolds (Marcia Gay Harden) -- president of financially challenged Medfield College -- for the third time! When Phillip experiments with his own big bang theory, a miraculous elastic good -- Flubber -- emerges, leaving him ecstatic, but unmarried! Phillip and his flying cyber sidekick, Weebo, soon discover that Flubber, applied to anything, enables it to bounce super high and fast. However, many questions remain. Is Flubber good enough to win Sara back, save Medfield from its financial problems, and slip through the hands of the evil financier who is bankrolling the college? FLUBBER slips, slides, giggles, glides, flips, and flies -- the stuff of surefire family entertainment. Now you can bring home Disney\\'s box office hit that\\'s two parts innovation, three parts imagination, and \"100% pure fun!\" (CNN)|Many of the film\\'s special effects were produced in huge Building Three at the Treasure Island Naval Base off San Francisco. With 90,000 square feet of space, the producers were able to create the professor\\'s basement laboratory, the interior of the team\\'s locker room, and a 2,500-seat basketball stadium, all under one roof at one time.|Differing from the original film (THE ABSENT-MINDED PROFESSOR), this time Flubber is given a personality of its own. Mischievous and uncontrollable, it creates havoc everywhere.', 'Amazon.com', \"Disney couldn't resist the temptation to remake 1961's popular comedy\", 'The Absent Minded Professor', ', so they cast Robin Williams as Professor Philip Brainard (a role vaguely related to the character originated by Fred MacMurray), and the result is a comedy that, frankly, doesn\\'t fully deserve its modest success. It\\'s admittedly clever to a point, and certainly the digitally \"flubberized\" special effects provide the kind of movie magic that\\'s entertaining for kids and parents alike. The professor can\\'t even remember his own wedding day (much to the chagrin of his fiancée, played by Marcia Gay Harden), and now his academic rival (Christopher McDonald) is trying to steal his latest and purely accidental invention--flying rubber, or ... flubber. The green goo magnifies energy and can be used as an amazing source of power, but in the hands of screenwriter John Hughes it becomes just another excuse to recycle a lot of', 'Home Alone', \"-style slapstick humor involving a pair of bumbling would-be flubber thieves. There's also a floating robot named Weebo and some catchy music by Danny Elfman to accompany dancing globs of flubber, but the story's too thin to add up to anything special. Lightweight fun, but, given the title, it lacks a certain bounce. Of course, that didn't stop Disney's marketing wizards from turning it into a home-video hit.\", '--Jeff Shannon']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, Live, NTSC, Letterboxed, Widescreen', 'Contributor': 'Leslie Stefanson, Malcolm Brownson, Dean Cundey, Edie McClurg, Jodie Benson, Clancy Brown, Samuel W. Taylor, Bill Walsh, Robin Williams, Wil Wheaton, Scott Michael Campbell, John Hughes, Samuel Lloyd, Raymond J. Barry, Les Mayfield, Ted Levine, Marcia Gay Harden, Christopher McDonaldLeslie Stefanson, Malcolm Brownson, Dean Cundey, Edie McClurg, Jodie Benson, Clancy Brown, Samuel W. Taylor, Bill Walsh, Robin Williams, Wil Wheaton, Scott Michael Campbell, John Hughes, Samuel Lloyd, Raymond J. Barry, Les Mayfield, Ted Levine, Marcia Gay Harde…   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.8 Ounces', 'Item model number': 'MFR717951000309#VG', 'Director': 'Dean Cundey, Les Mayfield', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Live, NTSC, Letterboxed, Widescreen', 'Run time': '1 hour and 34 minutes', 'Release date': 'June 16, 1998', 'Actors': 'Robin Williams, Marcia Gay Harden, Clancy Brown, Scott Michael Campbell, Raymond J. Barry', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Samuel W. Taylor, John Hughes, Bill Walsh', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAlready wrote a review awhile back.\nFive Stars\n{'Audio languages': ['English', 'English [Audio Description]', 'Español', 'Português'], 'Subtitles': ['English [CC]', 'Español', 'Português'], 'Directors': ['Gary Halvorson', 'Kevin Bright', 'Michael Lembeck', 'James Burrows', 'Gail Mancuso', 'Peter Bonerz', 'David Schwimmer', 'Ben Weiss', 'Robby Benson', 'Shelley Jensen'], 'Producers': ['Not Specified'], 'Starring': ['Jennifer Aniston', 'Courteney Cox', 'Matthew Perry']}\nI LOVE THIS SHOW!!! I’m so excited that amazon offers all of the seasons and for just $10 each. It’s way cheaper the wasting money on yet another streaming app ( HBOMAX that’ll be coming out in a May. I refuse and I mean refuse to buy another app. It’s not worth it or affordable especially that one. They want $15 a month. No thanks!!!<br />I used to watch friends on Netflix whenever I wanted and it was wonderful. But it left in January 2020. It’s always on nick at night but I like to watch it without commercials.<br /><br />Anyways I’ve been watching this show since the 90s when it first aired and have been a huge fan since ( if you couldn’t tell already lol)<br />I’ve seen each episodes probably hundreds of times but I never ever get sick of them. Plus there’s a handful of episodes that aren’t aired as much. I laugh my butt off every time I watch it. I know almost every line from each episode. I’m not joking when I say I’m obsessed!<br /><br />One of the best things about it offered on amazon is that we can literally watch it anywhere and on anything. Phone, tablet, smart TV, chromcast or roku stock and probably amazon fire and other devices. This is way better then buying the box set of dvds since you have only one way to watch. Anyways if your a fan of this show then I recommend buying all the seasons. I’ve bought the first 7 already and will continue to purchase the rest when I have the extra money. I just hope the price stays at $10 and not go up once it’s available on HBOMAX.<br /><br />I want to add that even if you cancel your amazon prime, you’ll still have access to whatever you buy for movies or shows. You don’t need to worry about losing anything or think your wasting money. Your definitely not. And you never have to worry about returning it bc it doesn’t work like a dvd. Who buys those nowadays anyways?! Do they still make dvds players? Lol\nLOVE this show! Wicked funny! #1 fan right here!!\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Castille Landon'], 'Producers': ['Dori A. Rath', 'Joseph J. Restaino', 'Robert Molloy', 'Joe Riley'], 'Starring': ['Katherine Heigl', 'Madison Iseman', 'Israel Broussard'], 'Studio': ['Lionsgate']}\nOk movie. Dragged on for a bit. But overall good.\nOk\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Danielle Winter'], 'Producers': ['Brian Aabech', 'Dana Webber'], 'Starring': ['Jennifer Aniston', 'Sharon Feingold'], 'Studio': ['Legacy Distribution']}\nI’m not sure where all the negative reviews are coming from. This is your typical documentary. It tells us about her success, ups and downs like any other documentary.<br />If you’re a fan of Jen Aniston then I’m pretty sure you’ll like this. Give it shot! It’s only an hour. But I wish it was longer. I’ve been a huge fan of hers since the movie leprechaun. Then to see her on friends was wicked awesome! I was glad she continued with an acting career. I still watch friends till this day. Not just because of her but because they’re all great in their own way. I know gave my boyfriend clapping in the introduction of the song! It’s hysterical. Anyways he now loves the show as much as I do. This does talk about it quite a lot.<br />Anyways, enjoy!<br /><br />By the way, if anyone is wondering how to leave a review on prime movies, you can’t do it from the app. You have to go to your web browser on your smart phone and type in Amazon, then pull up the movie/show or use a computer. I had to research it since it’s been awhile since I rated something to watch.\nLoved this!\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Darren Lynn Bousman'], 'Producers': ['Oren Koules', 'Mark Burg'], 'Starring': ['Chris Rock', 'Max Minghella', 'Samuel L. Jackson'], 'Studio': ['LIONSGATE']}\nThis movie was wicked stupid! Nothing like the saw movies. It’s a waste of time.i highly recommend Skipping this one and save your money.<br />The acting is horrible too, especially Chris Rock. Even though he’s usually in comedies, He’s always been a great actor. I don’t think this is his fault. It’s whoever the director was….\nThis movie was stupid!",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user maintains a robust interest in movies and shows, particularly those with dramatic narratives and intricate relationships. Their enthusiasm for family-friendly and animated films continues, reflecting a preference for content that balances light-hearted adventures with emotionally rich storytelling.\n\n- **Viewing Preferences:** They are drawn to engaging character interactions and performances by well-known actors, with a notable fondness for nostalgic narratives. However, recent engagement highlights a critical viewpoint towards certain films, revealing a willingness to express disappointment in projects that do not meet their standards, particularly when they feature beloved actors in roles that fall short.\n\n- **Purchasing Behavior:** The user remains value-conscious and seeks cost-effective viewing options. Their recent experiences indicate a strong emphasis on quality, leading to critical reviews of underwhelming content. They prioritize clear rental policies and pricing, reinforcing their commitment to informed entertainment choices.\n\n- **Recommendations and Insights:** They exhibit loyalty to cherished shows and classic humor, advocating for complete seasons for better value. The critical tone in their latest review illustrates that they expect high-quality performances and narratives, especially when favorite actors are involved.\n\n- **Overall Experience:** The user retains an optimistic approach to their purchasing decisions while actively seeking quality content that aligns with their established viewing habits and interests, especially those invoking nostalgia, though they are unafraid to voice discontent when expectations are unmet.\n\n**Keywords:** Movies, Drama, Family, Animation, Quality, Value-conscious, Nostalgia, Critical feedback, Recommendations, Optimistic yet discerning, Classic humor.",
  "metrics": {
    "rouge1_f": 0.0727476217123671,
    "rouge2_f": 0.00335946248600224,
    "rougeL_f": 0.035254616675993285,
    "meteor": 0.022729459303444294,
    "bleu1": 4.668380595133395e-07,
    "bleu2": 1.1382658646333708e-07,
    "bleu3": 3.5593765928482764e-08,
    "bleu4": 1.120188203510912e-08,
    "bertscore_precision": 0.36243802309036255,
    "bertscore_recall": 0.4955509305000305,
    "bertscore_f1": 0.41866856813430786
  }
}