{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/07/08\nAverage Rating: 4.5\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Twohy'], 'Producers': ['Ryan Kavanaugh', 'Mark Canton', 'Tucker Tooley', 'Robbie Brenner'], 'Starring': ['Timothy Olyphant', 'Steve Zahn', 'Milla Jovovich'], 'Studio': ['Rogue Pictures']}\nReview Text: Loved this movie. I seen it years ago and decided to rent it and stream it. It was $1.99. I think it should be cheaper or free  since it's a older movie. You only have it for 24 hours. I was confused when I 1st rented it. It said I had it for 30 days then the next day I watched the rest of it bc I fell asleep the 1st time, it then said I had 16 hours left to watch it. Maybe they're was a glitch in the system.. I think if your renting it you should have it available longer than 24 hours. If played well. No interruptions.\nReview Title: Good\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Closer (Superbit Edition)\nJulia Roberts  (Actor),     Jude Law  (Actor),     Mike Nichols  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['A witty, romantic, and very dangerous love story about chance meetings, instant attractions, and casual betrayals. CLOSER is director Mike Nichols\\' critically acclaimed look at four strangers - Julia Roberts, Jude Law, Natalie Portman and Clive Owen - with one thing in common: each other. Adaptedby Patrick Marber from his award-winning stage play, CLOSER \"VIBRATES WITH EROTICISM, BRUISING LAUGHS, AND DYNAMIC PERFORMANCES. CLOSER IS A TRIUMPH!\" - Peter Travers, ROLLING STONE']\n{'Genre': 'Drama', 'Format': 'AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, DTS Surround Sound, Subtitled, Widescreen', 'Contributor': 'John Calley, Carey Brokaw, Cocksure Entertainment; Columbia Pictures Industries, Inc., Julia Roberts, Clive Owen, Mike Nichols, Natalie Portman, Jude LawJohn Calley, Carey Brokaw, Cocksure Entertainment; Columbia Pictures Industries, Inc., Julia Roberts, Clive Owen, Mike Nichols, Natalie Portman, Jude Law  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), Unqualified, French (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.5 x 5.3 x 0.6 inches; 1.6 Ounces', 'Item model number': '043396048478', 'Director': 'Mike Nichols', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, DTS Surround Sound, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'March 29, 2005', 'Actors': 'Julia Roberts, Jude Law, Natalie Portman, Clive Owen', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Mike Nichols, John Calley, Carey Brokaw', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI love this movie! I only bought it for 1 cent. Yes that's right 1 cent! And paid a few bucks for shipping and handling. It was in great condition, no scratches, it didn't skip at all. Love amazon. I highly recommend buying items on here. Never had a problem with anything I purchased.\nGina\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Twohy'], 'Producers': ['Ryan Kavanaugh', 'Mark Canton', 'Tucker Tooley', 'Robbie Brenner'], 'Starring': ['Timothy Olyphant', 'Steve Zahn', 'Milla Jovovich'], 'Studio': ['Rogue Pictures']}\nLoved this movie. I seen it years ago and decided to rent it and stream it. It was $1.99. I think it should be cheaper or free  since it's a older movie. You only have it for 24 hours. I was confused when I 1st rented it. It said I had it for 30 days then the next day I watched the rest of it bc I fell asleep the 1st time, it then said I had 16 hours left to watch it. Maybe they're was a glitch in the system.. I think if your renting it you should have it available longer than 24 hours. If played well. No interruptions.\nGood",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user maintains a strong preference for movies, particularly those with dramatic narratives that delve into complex relationships and emotional dynamics. Their engagement with romantic dramas suggests a continued affinity for storylines that explore themes of attraction and betrayal.\n\n- **Viewing Preferences:** They enjoy films that feature engaging character interactions and performances by prominent actors, further emphasizing their appreciation for high-quality productions, particularly those with both critical acclaim and skilled directors.\n\n- **Purchasing Behavior:** The user embodies value-conscious shopping habits. They have expressed mixed feelings about rental costs, indicating a desire for more favorable pricing on older films. Their experience with rental terms shows a level of dissatisfaction regarding the limited viewing period, which may influence future purchasing decisions.\n\n- **Recommendation Habits:** The user is inclined to recommend products based on positive experiences, reinforcing the importance of quality and reliability in their purchases.\n\n- **Overall Experience:** Despite a recent experience with confusion over rental terms, the overall tone of their feedback remains optimistic. They continue to trust the shopping platform, although they exhibit a preference for clearer policies and greater value in rental services.\n\n**Keywords:** Movies, Drama, Romantic, Relationships, Quality, Value-conscious, Rental Experience, Recommendations, Optimistic outlook.",
  "metrics": {
    "rouge1_f": 0.1575037147102526,
    "rouge2_f": 0.005961251862891207,
    "rougeL_f": 0.07726597325408618,
    "meteor": 0.07782215199049994,
    "bleu1": 0.05015078021846728,
    "bleu2": 0.001859702575177563,
    "bleu3": 0.0006209438831967103,
    "bleu4": 0.00035914810026176807,
    "bertscore_precision": 0.33643922209739685,
    "bertscore_recall": 0.39391666650772095,
    "bertscore_f1": 0.3629162907600403
  }
}