{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dynasty: Season 5 Two Pack\nReview Date: 2014/02/14\nStore: Heather Locklear  (Actor),     Jack Coleman  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Drama\nProduct Description: ['This hugely popular prime-time soap opera follows the exploits of the Carringtons and Colbys, both \"oilrich\" family dynasties in Denver, CO, as they accrue and manipulate power and wealth.']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Joan Collins, John Forsythe, Jack Coleman, John James, Heather Locklear, Pamela Bellwood, Linda EvansJoan Collins, John Forsythe, Jack Coleman, John James, Heather Locklear, Pamela Bellwood, Linda Evans  See more', 'Language': 'English', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.48 Ounces', 'Item model number': '17521974', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Release date': 'August 4, 2015', 'Actors': 'Heather Locklear, Jack Coleman, Joan Collins, John Forsythe, Pamela Bellwood', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '8'}\nReview Text: This is one of the many reviews I have written here about this series.  If you were a fan of Dynasty or still are, then purchase the series in its entirety. There is nothing disappointing about this show and it leaves you always looking for more after each episode.The Dynasty cast and show bring you into their world of intrigue, plots, schemes and behind the scenes deceptions and not so above board cut throat business deals. The wardrobes of the cast are of days gone by, but nevertheless you can relive all of the glamour and story lines by just watching it again and again.\nReview Title: Dynasty-The Title says it all!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Verdi: La Traviata\nRenee Fleming  (Actor),     Joseph Calleja  (Actor),     Richard Eyre  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n[\"Verdi's best-loved work, is performed here by a star cast in a revival of Richard Eyre's highly acclaimed 1994 production. Music Director Antonio Pappano conducts La traviata for the first time at Covent Garden. American oprano Renée Fleming returns to Covent Garden to sing Violetta for the first time with The Royal Opera. La traviata was first performed at the Teatro La Fenice, Venice in March 1853.\", 'Press Reviews', '\"Antonio Pappano takes charge of this revival, searching out the meaning of Verdi\\'s score in a supple, sentient reading that sweeps you along.\"', '(The Guardian', ')', '\"At the age of 50, [Fleming] still looks very good in the role of the doomed courtesan...[she] sounds good, too, singing with consistent skill...There\\'s a sincerity to Maltese tenor Joseph Calleja\\'s portrayal of Alfredo which gives it more spontaneity than his American colleagues supply...Stronger than the vocals is the conducting of Antonio Pappano, which possesses a natural stylishness and fluency. \"', '(BBC Music Magazine', '★★★)', '\"I was sniffy about her first night but this DVD comes from later in the run, by which time she had found an uncharacteristic emotional freedom. She is still the prima donna playing the part, but the beautiful sounds she makes, especially in the Act One finale and the Act Two party, are well worth hearing, and the high-quality film-work puts us right at the heart of the action. \"', '(The Financial Times', '★★★★)', '\"... this is a sensible, believable, attractive presentation that is more in line with Verdi than with the idiocies of Regietheater...Vocally, [Fleming] is on good form at almost every turn... Calleja must sound authentic enough as an Italianate tenor for anyone...I always have the impression that [Pappano] works with the singers rather than challenging them to a duel. The chorus and orchestra respond fittingly to his direction. \"', '(International Record Review', ')', 'Cast', 'Renée Fleming', '(Violetta)', 'Joseph Calleja', '(Alfredo)', 'Thomas Hampson', '(Germont)', 'The Orchestra of the Royal Opera House; Antonio Pappano', 'Production', 'Company:', 'The Royal Opera', 'Stage Director:', 'Richard Eyre', 'Disc Information', 'Catalogue Number:', 'OA1040D', 'Date of Performance:', '2009', 'Running Time:', '135 minutes', 'Sound:', '2.0LPCM + 5.1(5.0) DTS', 'Aspect Ratio:', '16:9 Anamorphic', 'Subtitles:', 'EN, FR, DE, ES, IT', 'Label:', 'Opus Arte']\n{'Genre': 'Music Video & Concerts, Classical / Opera & Vocal', 'Format': 'Multiple Formats, Color, NTSC, Widescreen, Classical', 'Contributor': 'Thomas Hampson, Richard Wiegold, Antonio Pappano, Joseph Calleja, Richard Eyre, Eddie Wade, Kostas Smoriginas, Renee Fleming, Royal Opera Chorus, Orchestra of the Royal Opera House, Monika-Evelin LiivThomas Hampson, Richard Wiegold, Antonio Pappano, Joseph Calleja, Richard Eyre, Eddie Wade, Kostas Smoriginas, Renee Fleming, Royal Opera Chorus, Orchestra of the Royal Opera House, Monika-Evelin Liiv  See more', 'Language': 'Italian', 'Number Of Discs': '1', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'BOPU1040DVD', 'Director': 'Richard Eyre', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen, Classical', 'Run time': '2 hours and 34 minutes', 'Release date': 'May 31, 2011', 'Actors': 'Renee Fleming, Joseph Calleja, Thomas Hampson, Monika-Evelin Liiv, Eddie Wade', 'Subtitles': 'English, French, German, Spanish, Italian', 'Studio': 'Opus Arte', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPurchased as a gift for a birthday and she loved it.  Has watched it several times and music and clarity of musical display is superb.\nLa Traviata DVD\nIl Volo\nIl Volo  (Actor),     Ron de Moraes  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Music Videos & Concerts\n[\"Italian heartthrobs Il Volo, the three Teenage Tenors filmed their October 27th live show at Detroit's famed Opera House. The show was produced by famed Grammy producer Ken Ehrlich and Il Volo's managers, Michele Torpedine (who discovered Andrea Bocelli) and Steve Leber are executive producers. Il Volo's PBS Special IL VOLO TAKES FLIGHT LIVE FROM THE DETROIT OPERA HOUSE had it's initial airing in Detroit on Dec. 7th. The response has been extremely positive, with over 26 markets confirmed to date that will be airing the special 3/3-3/14.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '24203166', 'Director': 'Ron de Moraes', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour', 'Release date': 'February 28, 2012', 'Actors': 'Il Volo', 'Studio': 'Geffen Records', 'Number of discs': '1'}\nThese 3 young boys who started singing together at inception have developed into an accomplished singing trio of 3 young men. Their musical delivery in everything they sing reflects their God given gifts and the magnitude of their talent. I cannot say enough and when I first heard them live, a few years back I went out purchased everything they had put on cd and dvd. So close your eyes and listen to the miracle of song and singing that these three young men deliver and be enveloped by it all.\nGreat Style, singing and powerful musical talent!\nDynasty: Season 6\nJack Coleman  (Actor),     Joan Collins  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['This hugely popular prime-time soap opera follows the exploits of the Carringtons and Colbys, both \"oilrich\" family dynasties in Denver, CO, as they accrue and manipulate power and wealth.']\n{'Genre': 'Drama/Television', 'Format': 'Box set, Multiple Formats, Color, NTSC', 'Contributor': 'Joan Collins, John Forsythe, Jack Coleman, John James, Heather Locklear, Pamela Bellwood, Linda EvansJoan Collins, John Forsythe, Jack Coleman, John James, Heather Locklear, Pamela Bellwood, Linda Evans  See more', 'Language': 'English', 'Number Of Discs': '8', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 10.4 Ounces', 'Item model number': '25297443', 'Media Format': 'Box set, Multiple Formats, Color, NTSC', 'Release date': 'August 4, 2015', 'Actors': 'Jack Coleman, Joan Collins, Pamela Bellwood, Linda Evans, Heather Locklear', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '8'}\nI loved the Dynasty series then and I have not lost my zest for it now either.  Great show then and still great now.  I enjoy going back in time and I just love everything about the entire cast and series.  What more is there to say?\nExcellent digitally remastered series\nDynasty: Season 7, Vol. 1 & 2 (2-Pack)\nKaren Cellini  (Actor),     Joan Collins  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['This hugely popular prime-time soap opera follows the exploits of the Carringtons and Colbys, both \"oilrich\" family dynasties in Denver, CO, as they accrue and manipulate power and wealth.']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Contributor': \"Joan Collins, John Forsythe, Gordon Thomson, Karen Cellini, Kate O'Mara, Dynasty, Linda Evans\", 'Language': 'English', 'Number Of Discs': '7', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 6.4 Ounces', 'Item model number': '26920426', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC', 'Release date': 'August 4, 2015', 'Actors': \"Karen Cellini, Joan Collins, Linda Evans, Kate O'Mara, John Forsythe\", 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '7'}\nI loved the series Dynasty then and I have not lost my zeal for it now.  I enjoy going back to all the lavishness and the story lines and the entire cast leaves you aching for more regardless of how many times you see it over and over. I am a die hard fan of the Dynasty series and Knots Landing series that have fallen into days gone by. Owning them all brings them back and if your a fan too you will not be disappointed.\nWonderfully digitally remastered series...\nDynasty: Season 5 Two Pack\nHeather Locklear  (Actor),     Jack Coleman  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['This hugely popular prime-time soap opera follows the exploits of the Carringtons and Colbys, both \"oilrich\" family dynasties in Denver, CO, as they accrue and manipulate power and wealth.']\n{'Genre': 'Drama/Television', 'Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Contributor': 'Joan Collins, John Forsythe, Jack Coleman, John James, Heather Locklear, Pamela Bellwood, Linda EvansJoan Collins, John Forsythe, Jack Coleman, John James, Heather Locklear, Pamela Bellwood, Linda Evans  See more', 'Language': 'English', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 12.48 Ounces', 'Item model number': '17521974', 'Media Format': 'Multiple Formats, Box set, Color, Full Screen, NTSC, Subtitled', 'Release date': 'August 4, 2015', 'Actors': 'Heather Locklear, Jack Coleman, Joan Collins, John Forsythe, Pamela Bellwood', 'Subtitles': 'English', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '8'}\nThis is one of the many reviews I have written here about this series.  If you were a fan of Dynasty or still are, then purchase the series in its entirety. There is nothing disappointing about this show and it leaves you always looking for more after each episode.The Dynasty cast and show bring you into their world of intrigue, plots, schemes and behind the scenes deceptions and not so above board cut throat business deals. The wardrobes of the cast are of days gone by, but nevertheless you can relive all of the glamour and story lines by just watching it again and again.\nDynasty-The Title says it all!",
  "profile": "The user continues to exemplify a profound appreciation for the arts, particularly music and performance, with a strong dedication to classical genres such as opera. Their enthusiasm for high-quality artistry is reflected in five-star reviews of exceptional vocal talent. Recently, they've expressed a deep fondness for dramatic television series, revealing a broader engagement with storytelling that evokes nostalgia and emotional resonance, as indicated by their positive feedback on classic soap operas.\n\nTheir latest activity showcases a strong affinity for revisiting beloved soap operas, emphasizing the lavish storytelling and complex character development that these series offer. In their reviews, they highlight an enduring connection to the drama and intrigue of these narratives, appreciating the glamorous portrayals and rich storylines that invite repeated viewings.\n\nThis consistent behavior illustrates their discerning taste and the significance they place on emotional connection through both music and drama. The user embodies a dedicated connoisseur of quality storytelling and performance, consistently seeking enriching experiences that resonate deeply. They actively engage with content that reflects their affection for nostalgic and poignant artistic endeavors, enjoying the complexities and character-driven plots of classic series.",
  "metrics": {
    "rouge1_f": 0.11612175873731681,
    "rouge2_f": 0.01128668171557562,
    "rougeL_f": 0.05975197294250281,
    "meteor": 0.031163102886182764,
    "bleu1": 1.5984137723658007e-05,
    "bleu2": 5.635939247855681e-06,
    "bleu3": 8.085682583235878e-07,
    "bleu4": 3.0664324104112165e-07,
    "bertscore_precision": 0.31002071499824524,
    "bertscore_recall": 0.46579426527023315,
    "bertscore_f1": 0.37226882576942444
  }
}