{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Cute Fairy Tape In Human Hair Extensions Full Cuticle Seamless Straight Tape Hair Extensions 40g 20Pcs/Pac Dark Brown Highlight with Caramel Blonde Hair Extensions Human Hair 20 inches\nReview Date: 2020/12/21\nStore: cute fairy\nAverage Rating: 1.0\nProduct Details: {'Brand': 'Cute fairy', 'Color': 'Brown, Caramel blonde', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 3.5 x 0.5 inches; 2.4 Ounces', 'UPC': '791261180159'}\nReview Text: I ordered 5 bundles and they only sent 4. Then when I mentioned it they refunded me for one instead of sending it. The hair also arrived several days after it was supposed to. I waited until I had the hair installed for at least 2 weeks before leaving this review. The hair is super thin. It thankfully feels thicker once you wash it but I have only washed it twice and it’s already a horrible mess. I don’t use heat on it AT ALL!!! I have slept with it in braids on a silk pillow case since day one.I only use hair extensions approved shampoo and conditioner as well as special leave in oils for moisture. It feels more like heat safe synthetic than human hair.  In my opinion it is not worth the.money at all. The only good thing about the hair is that the tapes have held up beautifully. Other than that I would say a big No to purchasing again. I would return them if I could. Very disappointed. Now I have to celebrate Christmas with a ratty nest on my head because my hair dresser is out of town until after New Years. Save your troubles and money. Go with a different brand.\nReview Title: Don’t do it. I want my money back :(\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Brown & Blonde Highlight Tape in Human Hair Extensions Long Straight Seamless Skin Weft Hair Invisible Double Sided Tape 20pcs 30g+10pcs Extra Tapes Medium Brown mixed Dark Blonde #4-27 18inch\nBenehair\n{'Brand': 'Benehair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.5 x 7 x 0.6 inches; 3.2 Ounces', 'UPC': '765951854224'}\nThe hair is really itchy. It does not feel like human hair. Gave me a horrible rash on my face and neck\nNot human\nUmillars 384pc Matte Pure Color Coffin False Nails Artificial Fake nails Full Cover Fingernails 16 Colors & 12 Sizes Nail Tips Kit with One Crystal Nail File for Nail Art Salon DIY Decoration\nUmillars\n{'Size': '385 Piece Set', 'Material': 'crystal', 'Brand': 'Umillars', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '9 x 3 x 3 inches; 3.99 Ounces'}\nThere thin so I double them up. Add clear coat gel polish and they don’t chip or fade. Lastss up to 2 weeks for me once the top coat is added. Great deal and lost of pretty colors to choose from.\nGreat price\nCute Fairy Tape In Human Hair Extensions Full Cuticle Seamless Straight Tape Hair Extensions 40g 20Pcs/Pac Dark Brown Highlight with Caramel Blonde Hair Extensions Human Hair 20 inches\ncute fairy\n{'Brand': 'Cute fairy', 'Color': 'Brown, Caramel blonde', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 3.5 x 0.5 inches; 2.4 Ounces', 'UPC': '791261180159'}\nI ordered 5 bundles and they only sent 4. Then when I mentioned it they refunded me for one instead of sending it. The hair also arrived several days after it was supposed to. I waited until I had the hair installed for at least 2 weeks before leaving this review. The hair is super thin. It thankfully feels thicker once you wash it but I have only washed it twice and it’s already a horrible mess. I don’t use heat on it AT ALL!!! I have slept with it in braids on a silk pillow case since day one.I only use hair extensions approved shampoo and conditioner as well as special leave in oils for moisture. It feels more like heat safe synthetic than human hair.  In my opinion it is not worth the.money at all. The only good thing about the hair is that the tapes have held up beautifully. Other than that I would say a big No to purchasing again. I would return them if I could. Very disappointed. Now I have to celebrate Christmas with a ratty nest on my head because my hair dresser is out of town until after New Years. Save your troubles and money. Go with a different brand.\nDon’t do it. I want my money back :(",
  "profile": "**User Profile Summary:**\n\n- **Product Type**: Primarily prefers hair extensions, especially tape-in styles, while showing interest in false nails for nail art and DIY decoration.\n- **Material Sensitivity**: Strongly favors genuine human hair in extensions; recent nail purchase indicates some flexibility in material choice, provided the product performs well.\n- **Quality Expectations**: Expects high quality and a natural feel in hair extensions; recent dissatisfaction highlights a need for consistent durability and performance in products.\n- **Length Preference**: Continues to show a preference for longer extensions, previously indicated by an interest in 18-inch styles.\n- **Comfort Level**: Values comfort and wearability in extensions due to past experiences; current interactions suggest a persistent focus on achieving quality results even when comfort is compromised.\n- **Overall Satisfaction**: Recently experienced significant disappointment with a hair extension purchase, affecting future buying behavior, while having had a favorable experience with nail products earlier.\n- **Rating Trends**: Strongly negative ratings and reviews for extensions when expectations are unmet, contrasting with previously positive feedback on nail products, signaling caution and a reactive approach to hair extension purchases.\n\nThis profile emphasizes the user’s ongoing pursuit of high-quality, comfortable hair extensions, while maintaining a growing interest in other beauty products contingent upon quality and performance outcomes.",
  "metrics": {
    "rouge1_f": 0.23615160349854228,
    "rouge2_f": 0.04093567251461989,
    "rougeL_f": 0.10495626822157433,
    "meteor": 0.10036373206693933,
    "bleu1": 0.08548073324220343,
    "bleu2": 0.019270519907731466,
    "bleu3": 0.0034336525209536805,
    "bleu4": 0.0014507587719503829,
    "bertscore_precision": 0.3516004681587219,
    "bertscore_recall": 0.4015744924545288,
    "bertscore_f1": 0.3749295473098755
  }
}