{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Umillars 384pc Matte Pure Color Coffin False Nails Artificial Fake nails Full Cover Fingernails 16 Colors & 12 Sizes Nail Tips Kit with One Crystal Nail File for Nail Art Salon DIY Decoration\nReview Date: 2020/10/28\nStore: Umillars\nAverage Rating: 3.8\nProduct Details: {'Size': '385 Piece Set', 'Material': 'crystal', 'Brand': 'Umillars', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '9 x 3 x 3 inches; 3.99 Ounces'}\nReview Text: There thin so I double them up. Add clear coat gel polish and they don’t chip or fade. Lastss up to 2 weeks for me once the top coat is added. Great deal and lost of pretty colors to choose from.\nReview Title: Great price\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Brown & Blonde Highlight Tape in Human Hair Extensions Long Straight Seamless Skin Weft Hair Invisible Double Sided Tape 20pcs 30g+10pcs Extra Tapes Medium Brown mixed Dark Blonde #4-27 18inch\nBenehair\n{'Brand': 'Benehair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.5 x 7 x 0.6 inches; 3.2 Ounces', 'UPC': '765951854224'}\nThe hair is really itchy. It does not feel like human hair. Gave me a horrible rash on my face and neck\nNot human\nUmillars 384pc Matte Pure Color Coffin False Nails Artificial Fake nails Full Cover Fingernails 16 Colors & 12 Sizes Nail Tips Kit with One Crystal Nail File for Nail Art Salon DIY Decoration\nUmillars\n{'Size': '385 Piece Set', 'Material': 'crystal', 'Brand': 'Umillars', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '9 x 3 x 3 inches; 3.99 Ounces'}\nThere thin so I double them up. Add clear coat gel polish and they don’t chip or fade. Lastss up to 2 weeks for me once the top coat is added. Great deal and lost of pretty colors to choose from.\nGreat price",
  "profile": "**User Profile Summary:**\n\n- **Product Type**: Prefers hair extensions, particularly tape-in styles, but has also shown interest in false nails for nail art and DIY decoration.\n- **Material Sensitivity**: Strong preference for genuine human hair in extensions, indicating a sensitivity to material authenticity; recent purchase of artificial nails suggests a varied acceptance depending on the product type.\n- **Quality Expectations**: Expects high quality and natural feel in hair extensions; appreciates durability in nail products, as evidenced by a review highlighting effective performance with added coating.\n- **Length Preference**: Indicates a preference for 18-inch extensions, reflecting an interest in longer styles.\n- **Comfort Level**: Values comfort and wearability in extensions due to past reactions; recent interaction with nails suggests flexibility in comfort expectations if overall quality is met.\n- **Overall Satisfaction**: Experienced dissatisfaction with prior hair extension purchases, leading to cautious future buying behaviors; however, recent nail product review reflects a more positive experience and satisfaction.\n- **Rating Trends**: Prior ratings suggest lower satisfaction when expectations for hair extensions are not met, while a recent high rating for the nail product indicates a more favorable reception under different product categories. \n\nThis profile underscores a customer primarily seeking high-quality, comfortable hair extensions, with emerging interests in other beauty products, provided their quality and performance align with expectations.",
  "metrics": {
    "rouge1_f": 0.24691358024691357,
    "rouge2_f": 0.044665012406947896,
    "rougeL_f": 0.09876543209876543,
    "meteor": 0.1460751764654936,
    "bleu1": 0.1834532374100719,
    "bleu2": 0.02573491899408328,
    "bleu3": 0.006214108659304063,
    "bleu4": 0.003056335027921234,
    "bertscore_precision": 0.3956865966320038,
    "bertscore_recall": 0.4158468246459961,
    "bertscore_f1": 0.40551629662513733
  }
}