{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: SEGO Nano Ring Hair Extensions Human Hair Balayage Nano Beads Pre-bonded Seamless Hairpieces Loop Hand Tied Nano Tip Remy Hair Highlight Hair for Women 1g/strand 50g/pack -24 Inch -2 Dark Brown\nReview Date: 2022/01/08\nStore: SEGO\nAverage Rating: 2.0\nProduct Details: {'Brand': 'SEGO', 'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '13.5 x 7.68 x 0.71 inches; 2.89 Ounces'}\nReview Text: It’s hard to see from the photo but the hair after 1 wash keeps getting matted underneath really bad. I followed all care instructors correctly. I can brush them out and they will be ok for a half hour or so and then right back to tangled and matted. Disappointed. I bought 5 bundles and spent a lot of money. So itchy too. Ugh. I need to stop buying cheaper hair.also very thin. Second Photo is the ends of 5 bundles installed. Very thin ends.\nReview Title: Bad quality after first wash\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Brown & Blonde Highlight Tape in Human Hair Extensions Long Straight Seamless Skin Weft Hair Invisible Double Sided Tape 20pcs 30g+10pcs Extra Tapes Medium Brown mixed Dark Blonde #4-27 18inch\nBenehair\n{'Brand': 'Benehair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.5 x 7 x 0.6 inches; 3.2 Ounces', 'UPC': '765951854224'}\nThe hair is really itchy. It does not feel like human hair. Gave me a horrible rash on my face and neck\nNot human\nUmillars 384pc Matte Pure Color Coffin False Nails Artificial Fake nails Full Cover Fingernails 16 Colors & 12 Sizes Nail Tips Kit with One Crystal Nail File for Nail Art Salon DIY Decoration\nUmillars\n{'Size': '385 Piece Set', 'Material': 'crystal', 'Brand': 'Umillars', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '9 x 3 x 3 inches; 3.99 Ounces'}\nThere thin so I double them up. Add clear coat gel polish and they don’t chip or fade. Lastss up to 2 weeks for me once the top coat is added. Great deal and lost of pretty colors to choose from.\nGreat price\nCute Fairy Tape In Human Hair Extensions Full Cuticle Seamless Straight Tape Hair Extensions 40g 20Pcs/Pac Dark Brown Highlight with Caramel Blonde Hair Extensions Human Hair 20 inches\ncute fairy\n{'Brand': 'Cute fairy', 'Color': 'Brown, Caramel blonde', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 3.5 x 0.5 inches; 2.4 Ounces', 'UPC': '791261180159'}\nI ordered 5 bundles and they only sent 4. Then when I mentioned it they refunded me for one instead of sending it. The hair also arrived several days after it was supposed to. I waited until I had the hair installed for at least 2 weeks before leaving this review. The hair is super thin. It thankfully feels thicker once you wash it but I have only washed it twice and it’s already a horrible mess. I don’t use heat on it AT ALL!!! I have slept with it in braids on a silk pillow case since day one.I only use hair extensions approved shampoo and conditioner as well as special leave in oils for moisture. It feels more like heat safe synthetic than human hair.  In my opinion it is not worth the.money at all. The only good thing about the hair is that the tapes have held up beautifully. Other than that I would say a big No to purchasing again. I would return them if I could. Very disappointed. Now I have to celebrate Christmas with a ratty nest on my head because my hair dresser is out of town until after New Years. Save your troubles and money. Go with a different brand.\nDon’t do it. I want my money back :(\nSEGO Nano Ring Hair Extensions Human Hair Balayage Nano Beads Pre-bonded Seamless Hairpieces Loop Hand Tied Nano Tip Remy Hair Highlight Hair for Women 1g/strand 50g/pack -24 Inch -2 Dark Brown\nSEGO\n{'Brand': 'SEGO', 'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '13.5 x 7.68 x 0.71 inches; 2.89 Ounces'}\nIt’s hard to see from the photo but the hair after 1 wash keeps getting matted underneath really bad. I followed all care instructors correctly. I can brush them out and they will be ok for a half hour or so and then right back to tangled and matted. Disappointed. I bought 5 bundles and spent a lot of money. So itchy too. Ugh. I need to stop buying cheaper hair.also very thin. Second Photo is the ends of 5 bundles installed. Very thin ends.\nBad quality after first wash",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Type**: The user remains focused on hair extensions, particularly interested in tape-in styles, but faces persistent dissatisfaction with recent purchases. Additionally, the user shows a strong inclination toward false nails for nail art and DIY decoration.\n- **Material Sensitivity**: While there was a preference for genuine human hair, the latest purchase has highlighted the user's increasing frustration with quality, indicating a potential reevaluation of this preference.\n- **Quality Expectations**: The latest experience has further emphasized the user's expectation for high quality in hair extensions, particularly concerning durability and the tendency to tangle. The disappointment reflects a significant impact on their trust in the performance of these products.\n- **Length Preference**: The user continues to prefer longer extensions, maintaining interest in styles exceeding 18 inches.\n- **Comfort Level**: Despite prioritizing comfort and wearability, the recent experience has revealed that the user is struggling with itchy textures and thinness in extensions, which undermines wearability.\n- **Overall Satisfaction**: The user is currently experiencing heightened dissatisfaction with hair extensions, causing a reconsideration of future purchases, while still showing a positive history with nail products.\n- **Rating Trends**: The recent very low ratings for extensions underline a cautious approach, with a noticeable shift towards a reactive stance regarding hair purchases, contrasting with previously favorable reviews on nail products.\n\nThis profile reflects the user’s ongoing quest for high-quality, comfortable hair extensions, while maintaining an interest in beauty products based on consistent quality and performance.",
  "metrics": {
    "rouge1_f": 0.22701475595913737,
    "rouge2_f": 0.03185437997724687,
    "rougeL_f": 0.10442678774120316,
    "meteor": 0.0999394334852727,
    "bleu1": 0.07260973240746674,
    "bleu2": 0.017552812788349217,
    "bleu3": 0.002796050432734358,
    "bleu4": 0.0011168473401398946,
    "bertscore_precision": 0.35688507556915283,
    "bertscore_recall": 0.4109804928302765,
    "bertscore_f1": 0.3820272982120514
  }
}