{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Anihiho Tape in Hair Extensions Human Hair Straight Hair Extensions Tape in Real Human Hair Tape in Hair Extensions for Women (14 Inch 30g , Jet Black)\nReview Date: 2022/04/11\nStore: Anihiho\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Anihiho', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Package Dimensions': '6.97 x 4.69 x 0.63 inches; 2.08 Ounces'}\nReview Text: I have been wearing tape extensions for years. I have tried so many brands on Amazon and eBay and up until now, have never been satisfied. I have had these installed for 2 weeks and I must say, the hair is amazing. I have washed it and it still feels so good. It doesn’t tangle at all so far. It’s not itchy either. And the color matches my hair perfectly. My only issue I have had so far is the tapes are horrible. I had them professionally installed and after 4 days I went to wash my hair and as soon as my hair was soaked they all started sliding out. I hadn’t even used any product yet. The tapes basically Disintegrated because there wasn’t even any residue left in my hair. I have never had that happen before. So you might want to retape before applying them. I retaped them and put them back in and have had no issues thus far. Definitely recommend them. The tapes may suck but the hair is amazing. I will only order from this brand from now on.\nReview Title: Best extensions on Amazon but tapes suck\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Brown & Blonde Highlight Tape in Human Hair Extensions Long Straight Seamless Skin Weft Hair Invisible Double Sided Tape 20pcs 30g+10pcs Extra Tapes Medium Brown mixed Dark Blonde #4-27 18inch\nBenehair\n{'Brand': 'Benehair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.5 x 7 x 0.6 inches; 3.2 Ounces', 'UPC': '765951854224'}\nThe hair is really itchy. It does not feel like human hair. Gave me a horrible rash on my face and neck\nNot human\nUmillars 384pc Matte Pure Color Coffin False Nails Artificial Fake nails Full Cover Fingernails 16 Colors & 12 Sizes Nail Tips Kit with One Crystal Nail File for Nail Art Salon DIY Decoration\nUmillars\n{'Size': '385 Piece Set', 'Material': 'crystal', 'Brand': 'Umillars', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '9 x 3 x 3 inches; 3.99 Ounces'}\nThere thin so I double them up. Add clear coat gel polish and they don’t chip or fade. Lastss up to 2 weeks for me once the top coat is added. Great deal and lost of pretty colors to choose from.\nGreat price\nCute Fairy Tape In Human Hair Extensions Full Cuticle Seamless Straight Tape Hair Extensions 40g 20Pcs/Pac Dark Brown Highlight with Caramel Blonde Hair Extensions Human Hair 20 inches\ncute fairy\n{'Brand': 'Cute fairy', 'Color': 'Brown, Caramel blonde', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 3.5 x 0.5 inches; 2.4 Ounces', 'UPC': '791261180159'}\nI ordered 5 bundles and they only sent 4. Then when I mentioned it they refunded me for one instead of sending it. The hair also arrived several days after it was supposed to. I waited until I had the hair installed for at least 2 weeks before leaving this review. The hair is super thin. It thankfully feels thicker once you wash it but I have only washed it twice and it’s already a horrible mess. I don’t use heat on it AT ALL!!! I have slept with it in braids on a silk pillow case since day one.I only use hair extensions approved shampoo and conditioner as well as special leave in oils for moisture. It feels more like heat safe synthetic than human hair.  In my opinion it is not worth the.money at all. The only good thing about the hair is that the tapes have held up beautifully. Other than that I would say a big No to purchasing again. I would return them if I could. Very disappointed. Now I have to celebrate Christmas with a ratty nest on my head because my hair dresser is out of town until after New Years. Save your troubles and money. Go with a different brand.\nDon’t do it. I want my money back :(\nSEGO Nano Ring Hair Extensions Human Hair Balayage Nano Beads Pre-bonded Seamless Hairpieces Loop Hand Tied Nano Tip Remy Hair Highlight Hair for Women 1g/strand 50g/pack -24 Inch -2 Dark Brown\nSEGO\n{'Brand': 'SEGO', 'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '13.5 x 7.68 x 0.71 inches; 2.89 Ounces'}\nIt’s hard to see from the photo but the hair after 1 wash keeps getting matted underneath really bad. I followed all care instructors correctly. I can brush them out and they will be ok for a half hour or so and then right back to tangled and matted. Disappointed. I bought 5 bundles and spent a lot of money. So itchy too. Ugh. I need to stop buying cheaper hair.also very thin. Second Photo is the ends of 5 bundles installed. Very thin ends.\nBad quality after first wash\nAnihiho Tape in Hair Extensions Human Hair Straight Hair Extensions Tape in Real Human Hair Tape in Hair Extensions for Women (14 Inch 30g , Jet Black)\nAnihiho\n{'Brand': 'Anihiho', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Package Dimensions': '6.97 x 4.69 x 0.63 inches; 2.08 Ounces'}\nI have been wearing tape extensions for years. I have tried so many brands on Amazon and eBay and up until now, have never been satisfied. I have had these installed for 2 weeks and I must say, the hair is amazing. I have washed it and it still feels so good. It doesn’t tangle at all so far. It’s not itchy either. And the color matches my hair perfectly. My only issue I have had so far is the tapes are horrible. I had them professionally installed and after 4 days I went to wash my hair and as soon as my hair was soaked they all started sliding out. I hadn’t even used any product yet. The tapes basically Disintegrated because there wasn’t even any residue left in my hair. I have never had that happen before. So you might want to retape before applying them. I retaped them and put them back in and have had no issues thus far. Definitely recommend them. The tapes may suck but the hair is amazing. I will only order from this brand from now on.\nBest extensions on Amazon but tapes suck",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Type**: The user continues to focus on hair extensions, specifically tape-in styles, showing some optimism with a recent purchase that received a favorable review despite earlier frustrations. The user maintains a strong interest in false nails for nail art and DIY decoration.\n- **Material Sensitivity**: There is an ongoing preference for genuine human hair, but recent experiences suggest the user is increasingly critical of quality, leading to a re-evaluation of expectations.\n- **Quality Expectations**: The latest review confirms the user’s emphasis on high-quality hair extensions regarding durability and minimal tangling. However, there remains concern about the effectiveness of tape-in applications.\n- **Length Preference**: The user continues to favor longer extensions, particularly those exceeding 18 inches.\n- **Comfort Level**: Although comfort is a priority, the user has reported issues with itchy textures and thinness in previous extensions. The latest purchase, however, did not elicit these complaints.\n- **Overall Satisfaction**: The user appears to be experiencing a moderating satisfaction with hair extensions due to mixed experiences, alongside a consistent positive outlook on nail products.\n- **Rating Trends**: The user's cautious purchasing behavior persists, reflected in a balanced rating trend with some positive notes on recent acquisitions, particularly in light of their overall dissatisfaction with previous hair products.\n\nThis profile outlines the user's ongoing pursuit of quality and comfort in hair extensions while highlighting a positive engagement with nail products based on consistency and performance.",
  "metrics": {
    "rouge1_f": 0.1929203539823009,
    "rouge2_f": 0.02659574468085106,
    "rougeL_f": 0.09557522123893807,
    "meteor": 0.07483137162147681,
    "bleu1": 0.029285697802796037,
    "bleu2": 0.007703439983029632,
    "bleu3": 0.0011467658065445906,
    "bleu4": 0.00044282147294443484,
    "bertscore_precision": 0.3871949017047882,
    "bertscore_recall": 0.46391695737838745,
    "bertscore_f1": 0.42209795117378235
  }
}