{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Celleanser Vegan Clean Serum100% Vegan Ingredients Quick Relief and Repair Hypoallergic Tested Hydrating Panthenol Silky Texture Made in Korea 30ml 1.01 fl. oz.\nReview Date: 2022/09/30\nStore: Celleanser\nAverage Rating: 4.4\nProduct Details: {'Package Dimensions': '5.83 x 1.26 x 1.26 inches; 2.89 Ounces'}\nReview Text: This stuff works great at relieving dry and worn skin. it doesnt bother my skin at all and i really like the way it makes my skin feel.\nReview Title: love this product\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Brown & Blonde Highlight Tape in Human Hair Extensions Long Straight Seamless Skin Weft Hair Invisible Double Sided Tape 20pcs 30g+10pcs Extra Tapes Medium Brown mixed Dark Blonde #4-27 18inch\nBenehair\n{'Brand': 'Benehair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.5 x 7 x 0.6 inches; 3.2 Ounces', 'UPC': '765951854224'}\nThe hair is really itchy. It does not feel like human hair. Gave me a horrible rash on my face and neck\nNot human\nUmillars 384pc Matte Pure Color Coffin False Nails Artificial Fake nails Full Cover Fingernails 16 Colors & 12 Sizes Nail Tips Kit with One Crystal Nail File for Nail Art Salon DIY Decoration\nUmillars\n{'Size': '385 Piece Set', 'Material': 'crystal', 'Brand': 'Umillars', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '9 x 3 x 3 inches; 3.99 Ounces'}\nThere thin so I double them up. Add clear coat gel polish and they don’t chip or fade. Lastss up to 2 weeks for me once the top coat is added. Great deal and lost of pretty colors to choose from.\nGreat price\nCute Fairy Tape In Human Hair Extensions Full Cuticle Seamless Straight Tape Hair Extensions 40g 20Pcs/Pac Dark Brown Highlight with Caramel Blonde Hair Extensions Human Hair 20 inches\ncute fairy\n{'Brand': 'Cute fairy', 'Color': 'Brown, Caramel blonde', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 3.5 x 0.5 inches; 2.4 Ounces', 'UPC': '791261180159'}\nI ordered 5 bundles and they only sent 4. Then when I mentioned it they refunded me for one instead of sending it. The hair also arrived several days after it was supposed to. I waited until I had the hair installed for at least 2 weeks before leaving this review. The hair is super thin. It thankfully feels thicker once you wash it but I have only washed it twice and it’s already a horrible mess. I don’t use heat on it AT ALL!!! I have slept with it in braids on a silk pillow case since day one.I only use hair extensions approved shampoo and conditioner as well as special leave in oils for moisture. It feels more like heat safe synthetic than human hair.  In my opinion it is not worth the.money at all. The only good thing about the hair is that the tapes have held up beautifully. Other than that I would say a big No to purchasing again. I would return them if I could. Very disappointed. Now I have to celebrate Christmas with a ratty nest on my head because my hair dresser is out of town until after New Years. Save your troubles and money. Go with a different brand.\nDon’t do it. I want my money back :(\nSEGO Nano Ring Hair Extensions Human Hair Balayage Nano Beads Pre-bonded Seamless Hairpieces Loop Hand Tied Nano Tip Remy Hair Highlight Hair for Women 1g/strand 50g/pack -24 Inch -2 Dark Brown\nSEGO\n{'Brand': 'SEGO', 'Material': 'Human Hair', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '13.5 x 7.68 x 0.71 inches; 2.89 Ounces'}\nIt’s hard to see from the photo but the hair after 1 wash keeps getting matted underneath really bad. I followed all care instructors correctly. I can brush them out and they will be ok for a half hour or so and then right back to tangled and matted. Disappointed. I bought 5 bundles and spent a lot of money. So itchy too. Ugh. I need to stop buying cheaper hair.also very thin. Second Photo is the ends of 5 bundles installed. Very thin ends.\nBad quality after first wash\nAnihiho Tape in Hair Extensions Human Hair Straight Hair Extensions Tape in Real Human Hair Tape in Hair Extensions for Women (14 Inch 30g , Jet Black)\nAnihiho\n{'Brand': 'Anihiho', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Package Dimensions': '6.97 x 4.69 x 0.63 inches; 2.08 Ounces'}\nI have been wearing tape extensions for years. I have tried so many brands on Amazon and eBay and up until now, have never been satisfied. I have had these installed for 2 weeks and I must say, the hair is amazing. I have washed it and it still feels so good. It doesn’t tangle at all so far. It’s not itchy either. And the color matches my hair perfectly. My only issue I have had so far is the tapes are horrible. I had them professionally installed and after 4 days I went to wash my hair and as soon as my hair was soaked they all started sliding out. I hadn’t even used any product yet. The tapes basically Disintegrated because there wasn’t even any residue left in my hair. I have never had that happen before. So you might want to retape before applying them. I retaped them and put them back in and have had no issues thus far. Definitely recommend them. The tapes may suck but the hair is amazing. I will only order from this brand from now on.\nBest extensions on Amazon but tapes suck\nHAIRCUBE Long Straight Blonde Wigs for Women Ombre Wigs Mid-partition Heat Resistance Synthetic Hair Natural Looking for Daily Party Use(Ash Blonde)\nHAIRCUBE\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'HAIRCUBE', 'Package Dimensions': '10.91 x 8.54 x 2.01 inches; 12.31 Ounces', 'Item model number': 'LC462'}\nThis wig isn’t the worst i have had but its also not the best. Don’t get me wrong it will work good for cosplay or dress up fun but I can’t see myself using it outside of the house. The wig is unrealistic at the roots and front and it feels similar to costume wigs for Halloween. It is pretty but you can get better synthetic wigs on amazon.\nIt’s ok for coslay or dress u, not so much for daily use\nGlitter Eyeliner Liquid, Liquid Eyeliner Colorful Set, 10 Colors Liquid Glitter Eyeliner, Glitter Liquid Eyeshadow Set, Shimmer Sparkling Neon Eye liners for Women, Glitter Eyeliner Pencil\nReddhoon\n{'Package Dimensions': '8.03 x 3.86 x 0.67 inches; 4.66 Ounces'}\nThese are really fun to play around with and use but you do have to do a few layers to get the look. They don’t smell weird but my eyelids did get a little itchy afterwards.\nFun the use but really have to layer it on\nSYMEIW Shoulder Length Bob Wigs Ombre Blonde Straight Bob Wig Full Bangs Middle Part wigs Heat Resistant Fiber Synthetic Cosplay Party Wigs for Women 14 inches (Ombre blonde)\nSYMEIW\n{'Material': 'Synthetic', 'Style': 'Modern', 'Special Feature': 'Tangle Free', 'Brand': 'SYMEIW', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8.03 x 6.3 x 2.09 inches; 8.15 Ounces'}\nThis is a good synthetic wig. It’s easy to brush through and it looks natural. The coloring is a little weird though\nGood synthetic wig\nCelleanser Vegan Clean Serum100% Vegan Ingredients Quick Relief and Repair Hypoallergic Tested Hydrating Panthenol Silky Texture Made in Korea 30ml 1.01 fl. oz.\nCelleanser\n{'Package Dimensions': '5.83 x 1.26 x 1.26 inches; 2.89 Ounces'}\nThis stuff works great at relieving dry and worn skin. it doesnt bother my skin at all and i really like the way it makes my skin feel.\nlove this product",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Focus**: The user continues to prioritize hair extensions, particularly tape-in styles, while exploring synthetic wigs with mixed feelings. Interest in false nails for nail art and DIY decoration remains strong, alongside a growing curiosity for colorful makeup products and skin care items.\n- **Material Sensitivity**: The user maintains a strong preference for genuine human hair extensions, ensuring high quality after recent experiences with inferior synthetic products. They have mild sensitivity to specific eye products but recently found a skin care serum that did not irritate their skin, indicating a positive shift in their tolerance for certain formulations.\n- **Quality Expectations**: High-quality hair extensions are crucial, with an emphasis on durability and minimal tangling. This discerning view extends to makeup and skincare, where the user favors products that provide effective results while ensuring comfortable wear.\n- **Length Preference**: Preference for longer extensions remains, typically over 18 inches, enhancing their overall look.\n- **Comfort Level**: Comfort is essential, with previous texture issues in hair products. Recent purchases have improved the comfort found in hair products, though some eye products still cause irritation.\n- **Overall Satisfaction**: Satisfaction with hair extensions is moderate, with critical views on synthetic options. Positive sentiments towards nail products and skin care have emerged, marking a cautious yet exploratory stance towards makeup and dermatological products.\n- **Rating Trends**: Their careful purchasing behavior is reflected in their ratings, showcasing a discerning approach to hair, makeup, and skincare products based on varied experiences.",
  "metrics": {
    "rouge1_f": 0.14370468029004616,
    "rouge2_f": 0.019801980198019802,
    "rougeL_f": 0.07251153592617007,
    "meteor": 0.0566645111701074,
    "bleu1": 0.007701977762127973,
    "bleu2": 0.0017107487629241622,
    "bleu3": 0.0002649257125856831,
    "bleu4": 0.00010433724787292714,
    "bertscore_precision": 0.37236863374710083,
    "bertscore_recall": 0.46043694019317627,
    "bertscore_f1": 0.41174620389938354
  }
}