{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Cayanmydery 30Pcs Compressed Facial Mask Dry Sheet Mask Paper DIY Skin Care Natural Face Cotton Mask\nReview Date: 2020/05/01\nStore: Cayanmydery\nProduct Description: ['How to use: 1. Soak the compressed facil mask in a liquid. Suitable liquid includes milk, egg, syrup or any other facial product. Let the membrane slowly open. 2.Well cleanse your face.  3.Apply the membrane on your face based on the position of eyes. 4. Take it off in about 10-15 minutes. (Depends on the dryness of the facil mask) 5.Wash your face with clean wate Features - Material: Natural cotton fleece. - Having facial skin care by yourself, better than to do facial care in beauty salon. Easy and simple to use. - Compressed facial membrane in original sealed package. It starts as a coin compact. After putting into a toner or lotion it becomes a face membrane easily. - Apply on any skin type.']\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Cayanmydery', 'Item Form': 'Sheet', 'Product Benefits': 'Moisturizing', 'Scent': 'Honey, Banana', 'Skin Type': 'Dry', 'Package Dimensions': '5.3 x 3.6 x 1.5 inches; 0.63 Ounces', 'UPC': '788000769416', 'Manufacturer': 'Cayanmydery'}\nReview Text: At first I was a bit surprised when these little round things came in the mail. But when I realized how to use them, and then I tried them I realized this was going to be my source for a nice facial.\nReview Title: Very nice to use for a facial.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Women 4D Silk Fibre Mascara Eyelash Waterproof Extension Volume Long Lasting for women Mascara (Black)\njumpjisper\n{'Special Feature': 'Waterproof', 'Brand': 'Jumpjisper', 'Unit Count': '1 Count', 'Package Information': 'Tube', 'Water Resistance Level': 'Water Resistant', 'Is Discontinued By Manufacturer': 'No', 'UPC': '715002653979'}\nThis mascara is nice. It lengthens and holds all day.\nVolume\n3D Microcurrent Face Massager Roller Electric Rechargeable Face Lift Beauty Roller Face Body Massage Tightening Lifting for Anti Aging Wrinkles\nAugoog\n{'Brand': 'Augoog', 'Style': 'Modern', 'Included Components': 'Face Massager', 'Package Dimensions': '7.5 x 4.75 x 1.95 inches; 2.4 Ounces', 'Item model number': 'Testo-1', 'UPC': '728458420705'}\nJust received it and tried it today. 1. The manufacturer didn't tell consumers in the instruction leaflet that the charging cord is a phone cord, needing to be hooked up via an adapter! 2. It works extremely quietly, in fact, were it not for the indicator lights, you'd think it wasn't working! 3. The \"charge\" feels very prickly..almost like a mild stinging sensation. It takes getting used to. I'll keep it up maybe once/day for a few...see what happens! My review may change...we'll see.\nWe'll see!\nCayanmydery 30Pcs Compressed Facial Mask Dry Sheet Mask Paper DIY Skin Care Natural Face Cotton Mask\nCayanmydery\n['How to use: 1. Soak the compressed facil mask in a liquid. Suitable liquid includes milk, egg, syrup or any other facial product. Let the membrane slowly open. 2.Well cleanse your face.  3.Apply the membrane on your face based on the position of eyes. 4. Take it off in about 10-15 minutes. (Depends on the dryness of the facil mask) 5.Wash your face with clean wate Features - Material: Natural cotton fleece. - Having facial skin care by yourself, better than to do facial care in beauty salon. Easy and simple to use. - Compressed facial membrane in original sealed package. It starts as a coin compact. After putting into a toner or lotion it becomes a face membrane easily. - Apply on any skin type.']\n{'Brand': 'Cayanmydery', 'Item Form': 'Sheet', 'Product Benefits': 'Moisturizing', 'Scent': 'Honey, Banana', 'Skin Type': 'Dry', 'Package Dimensions': '5.3 x 3.6 x 1.5 inches; 0.63 Ounces', 'UPC': '788000769416', 'Manufacturer': 'Cayanmydery'}\nAt first I was a bit surprised when these little round things came in the mail. But when I realized how to use them, and then I tried them I realized this was going to be my source for a nice facial.\nVery nice to use for a facial.",
  "profile": "**User Profile Summary:**\n\nThe user has a strong preference for cosmetic products, particularly eye makeup, focusing on waterproof formulas for long-lasting wear. Their appreciation for high-quality items is evidenced by positive reviews of effective mascaras, indicating a trend towards practicality and performance. User-friendly packaging and brands that deliver reliability are significant to their buying decisions.\n\nRecently, the user explored a beauty device for skincare and anti-aging, showcasing an ongoing interest in products that enhance both makeup and skincare routines. Their mixed experience with the device reflects a cautious approach to new beauty innovations, as they prioritize long-term effectiveness and reliability.\n\nIn a recent interaction, the user purchased DIY facial sheet masks, demonstrating a growing enthusiasm for at-home skincare solutions. Their 5-star review highlights an appreciation for simplicity and effectiveness, suggesting a shift towards products that offer moisturizing benefits for a more rejuvenated appearance. \n\nOverall, the user’s profile indicates a balanced pursuit of both cosmetic enhancement and skincare solutions, with a focus on products that are easy to use, yield tangible results, and align with their established standards of quality and performance.",
  "metrics": {
    "rouge1_f": 0.21967213114754097,
    "rouge2_f": 0.01973684210526316,
    "rougeL_f": 0.11147540983606559,
    "meteor": 0.08518312091850865,
    "bleu1": 0.05974013058705489,
    "bleu2": 0.012767218845148918,
    "bleu3": 0.002460539035928031,
    "bleu4": 0.0010814912723113698,
    "bertscore_precision": 0.3333572745323181,
    "bertscore_recall": 0.4136207103729248,
    "bertscore_f1": 0.36917680501937866
  }
}