{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Hyaluronic Acid Serum for face - 11% Low molecules Anti-aging Hydrating Booster Serum 100% Pure Hyaluronic Acid\nReview Date: 2020/09/26\nStore: MEAROSA DESIGN\nAverage Rating: 4.4\nProduct Details: {'Skin Type': 'Dry', 'Scent': 'Aloe', 'Brand': 'MEAROSA DESIGN', 'Unit Count': '1.00 Fl Oz', 'Product Dimensions': '1.77 x 1.77 x 3.94 inches; 4.3 Ounces', 'UPC': '628504326121'}\nReview Text: I really like this hyaluronic acid serum. It absorbs easily and leaves your skin feeling moisturized and tight. I also like the pump as opposed to eye dropper for application. If you need a good serum at a good price, this is a great choice.\nReview Title: Highly recommend.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mr. Pristine Organic Beard Shampoo with Natural Essential Oils for Moisturizing Skin & Hair, 8.5 oz.\nMr. Pristine\n{'Brand': 'Mr. Pristine', 'Item Form': 'Liquid', 'Hair Type': 'Color Treated', 'Scent': 'Peppermint', 'Age Range (Description)': 'Adult', 'Package Dimensions': '5.21 x 2.8 x 2.3 inches; 7.76 Ounces', 'UPC': '627843801832', 'Manufacturer': 'Mr. Pristine'}\nThis is a really nice shampoo specifically designed for your beard. It has a nice minty smell that doesn't over power and leaves your beard and skin feeling soft and smelling good. Also,grab their conditioner. I recommend this to anyone with a beard. Notable upgrade from traditional soap or shampoo.\nGreat stuff for your beard.\nMr. Pristine Organic Beard Conditioner to Grow, Thicken, Moisturize and Protect Your Beard, 8.5 oz.\nMr. Pristine\n{'Brand': 'Mr. Pristine', 'Material Feature': 'Natural', 'Hair Type': 'Dry', 'Age Range (Description)': 'Adult', 'Unit Count': '8.5 Fl Oz', 'Package Dimensions': '3.1 x 2.5 x 2.36 inches; 7.76 Ounces', 'UPC': '627843801825', 'Manufacturer': 'Mr. Pristine'}\nThis is a really nice conditioner specifically designed for your beard. I recommend starting with Mr.. Pristine's shampoo first. It has a nice minty smell that doesn't over power and leaves your beard and skin feeling soft and smelling good. I recommend this to anyone with a beard.\nHighly recommend. Buy their shampoo as well.\nHyaluronic Acid Serum for face - 11% Low molecules Anti-aging Hydrating Booster Serum 100% Pure Hyaluronic Acid\nMEAROSA DESIGN\n{'Skin Type': 'Dry', 'Scent': 'Aloe', 'Brand': 'MEAROSA DESIGN', 'Unit Count': '1.00 Fl Oz', 'Product Dimensions': '1.77 x 1.77 x 3.94 inches; 4.3 Ounces', 'UPC': '628504326121'}\nI really like this hyaluronic acid serum. It absorbs easily and leaves your skin feeling moisturized and tight. I also like the pump as opposed to eye dropper for application. If you need a good serum at a good price, this is a great choice.\nHighly recommend.",
  "profile": "User Summary:\n\nThis user is dedicated to grooming products that enhance beard care, with a strong preference for organic and natural formulations. They consistently seek out items with moisturizing properties promoting both skin and hair health, indicating a deep awareness of ingredient quality. Their appreciation for products with pleasant and subtle scents continues, particularly enjoying mint fragrances that provide a refreshing experience without being overpowering. Recent interactions emphasize their focus on high-quality beard conditioners and shampoos, showcasing their belief in the synergy of using complementary products for optimal care.\n\nIn addition to their beard care routine, the user recently explored facial care, highlighting a commitment to overall skin health. They have shown interest in hydrating serums that absorb easily and provide a firming effect, with a preference for convenient application methods. Their satisfaction with these products reflects their desire for effective skincare solutions that align with their grooming priorities. Notably, they express enthusiasm for recommending grooming and skincare solutions to others, demonstrating both contentment with their purchases and a commitment to sharing positive experiences.\n\nOverall, this user values effective, scented, and skin-friendly grooming products that enhance both their beard care regimen and skincare routine, advocating for solutions that align with their priorities for quality and performance.",
  "metrics": {
    "rouge1_f": 0.23529411764705882,
    "rouge2_f": 0.022857142857142857,
    "rougeL_f": 0.11005692599620494,
    "meteor": 0.10761441310912488,
    "bleu1": 0.12043488245968972,
    "bleu2": 0.02906083315512936,
    "bleu3": 0.005297971892547533,
    "bleu4": 0.0022645911137619515,
    "bertscore_precision": 0.3610849678516388,
    "bertscore_recall": 0.44569581747055054,
    "bertscore_f1": 0.3989536166191101
  }
}