{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nReview Date: 2020/07/27\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nReview Text: This Mascara is so esthetically pleasing :) so beautiful packaging and big. I can’t get over how full they make my eyelashes look! Order it now!\nReview Title: Esthetically Pleasing !!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "9A Body wave bundles with closure Brazilian human hair 4 bundles with lace closure Unprocessed Brazilian body wave virgin hair bundles with closure 4X4 Lace Middle Part (22 24 26 28+20)\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '12 x 6.1 x 2.2 inches; 1.2 Pounds', 'UPC': '699747934107'}\nI paid $189.99 for this hair that I had to take off 1 week after install. It's PURE GARBAGE. NOT human hair, NOT 9A grade. My hair burned when I tried to flat iron it at 250 degrees!. Tangled like crazy and shedded like a cat. I contacted the seller to tell them this hair was no good and they offered me a 30% refund IF I give them a GOOD (LYING) REVIEW. What a joke. Any other amazon seller would apologize for the inconvenience and offer you a replacement or refund to keep you happy. $189.99 dollars I will never see again. What a disappointment, trowed the whole bundles in the garbage and was forced to buy a wig.<br /><br />DO NOT, I repeat DO NOT waste your money on this. Look for another amazon vendor and READ all 1 star reviews, those are the ones that really tell you how it is.\nHAIR IS GARBAGE DON'T WASTE YOUR MONEY\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nThis Mascara is so esthetically pleasing :) so beautiful packaging and big. I can’t get over how full they make my eyelashes look! Order it now!\nEsthetically Pleasing !!!",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** Strong preference for high-quality hair products, particularly human hair. Recently expressed appreciation for cosmetics that enhance aesthetics, such as mascara that delivers a dramatic effect.\n- **Value for Money:** Discontent with overpriced products that do not meet quality expectations; values transparency in pricing and product description.\n- **Experience with Vendors:** Skeptical of vendor integrity, particularly regarding refund policies and customer service; prefers sellers who prioritize customer satisfaction.\n- **Sentiment Towards Reviews:** Heavily relies on detailed reviews, especially negative ones, to inform purchasing decisions; perceives negative reviews as more credible. Recent positive experience suggests a potential openness to changing perspectives if quality meets expectations.\n- **Feedback and Resolution:** Expects effective resolutions from sellers when products do not meet standards; likely to reject products that result in dissatisfaction, leading to a potential search for alternatives.\n- **Overall Attitude:** Disappointed with misleading quality claims; seeks honest recommendations and actively warns others about unreliable products. The recent positive review indicates a willingness to engage positively with products that genuinely impress. \n\nThis updated profile reflects the user's evolving perspectives while maintaining consistent themes of quality and transparency in their buying behavior.",
  "metrics": {
    "rouge1_f": 0.2056451612903226,
    "rouge2_f": 0.012145748987854251,
    "rougeL_f": 0.0846774193548387,
    "meteor": 0.1201796090861067,
    "bleu1": 0.13514302900831604,
    "bleu2": 0.024723323665669063,
    "bleu3": 0.005177492761131402,
    "bleu4": 0.0023717356677483187,
    "bertscore_precision": 0.3609546422958374,
    "bertscore_recall": 0.41530799865722656,
    "bertscore_f1": 0.38622844219207764
  }
}