{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: BesTby Acrylic Nail Kit - Clear Acrylic Powder and Monomer Set Nail Art\nReview Date: 2022/04/14\nStore: BesTby\nAverage Rating: 3.1\nProduct Details: {'Material': 'Acrylic', 'Brand': 'BesTby', 'Item Form': 'Powder', 'Package Dimensions': '5.98 x 4.02 x 1.69 inches; 8.64 Ounces'}\nReview Text: OK so I think this kit is OK, it is good if you are trying to learn and don't want to pay a ton for a kit.  I think it is a small kit, learn and move on to better quality products, is my opinion.  It does work, takes practice, my nails came out OK, but clearly not salon quality, they are the experts.  but you could try it and see if you like it and the more you do it the better you can get.  the smell is super strong on this kit.  that kinda stinks (literally) LOL.  it comes with what you need, but not a lot of it.\nReview Title: small kit\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Crest Whitestrips Dental Whitening System, 56 Strips\nCrest\n['Crest Whitestrips are the easy way to get whiter teeth in just 2 weeks. These thin, flexible strips conform to the shape of your teeth, and are coated with a gel that contains hydrogen peroxide, the same enamel-safe ingredient used by dentists for teeth whitening. Wear Crest Whitestrips just 30 minutes, twice a day. Simply place the gel side of each strip against your front teeth and fold the rest of the strip behind your teeth to keep it in place. In two weeks you will have noticeably whiter teeth. New clinical results prove whiter teeth for 12 months. Each box contains 56 strips: 28 for upper teeth, 28 for lower teeth. The secret to a whiter smile is in the strip - Guaranteed.']\n{'Brand': 'Crest', 'Item Form': 'Strip', 'Number of Items': '1', 'Included Components': 'Whitening Strip', 'Item Dimensions LxWxH': '4.9 x 4.8 x 2 inches', 'Is Discontinued By Manufacturer': 'Yes', 'Product Dimensions': '4.9 x 4.8 x 2 inches; 2.4 Ounces', 'Item model number': '36367', 'UPC': '037000416616 037000339472 037000404347 037000363675 037000394990', 'Manufacturer': 'Crest Whitestrips'}\nI love this product. It is true what other say about the sensitivity. I would recommend using sensitivity toothpaste while you are using the strips, it helped for me. It made my teeth noticeably whiter. I would suggest you take a picture of yourself smiling before and after. I noticed the whiteness of my teeth when I saw a picture taken recently and I couldn't believe how nice they looked. I just had to dig up an old picture to compare and it was a big difference. After I have noticed this in the new picture, I love smiling for pictures now and showing my teeth. I was alway self conscious about it before.  That alone makes it worth the price.<br /><br />I was very satisfied with my results. Make sure to read all the instructions before using.<br /><br />It just became a part of my bedtime routine, not a bother at all. I just put one on while I was watching my evening TV programs and just kept an eye on the clock.<br /><br />Also, I recommend that after you have finished your pack that you use the Crest whitening toothpaste.  It really helps to keep your teeth staying white.<br /><br />Great product and it was recommended to me by my dentist.\nGreat product\nBraun Silk Epil Female Epilator Se7921spa 1 Count\nBraun\n['View larger', 'Braun Silk-épil 7921 SkinSpa Epilator', \"It's the best 2-in-1 epilation and exfoliation system. Offering two advanced treatments for twice the performance, the Braun Silk-épil Female Epilator brings you efficient epilation with visible skin refinement. Designed for use in the bath or shower for extra comfort and a more soothing experience, this all-in-one Braun epilator saves both time and your skin.\", 'At A Glance', 'Removes hair as short as a grain of sand', 'Removes hair as short as a grain of sand', 'Actively stimulates your skin for extra-gentle epilation', 'Actively stimulates your skin for extra-gentle epilation', 'Smoothly adapts to your body’s contours', 'Smoothly adapts to your body’s contours', 'Can be used in the bath or shower', 'Can be used in the bath or shower', 'View larger', \"What's In The Box?\", 'Silk-épil SkinSpa 7921', 'Silk-épil SkinSpa 7921', 'Exfoliation Brush Head With Protection Cap', 'Exfoliation Brush Head With Protection Cap', 'Pouch', 'Pouch', 'Cleaning Brush', 'Cleaning Brush', 'Electrical Cord', 'Electrical Cord', 'View larger', 'Accessories For This Epilator', 'Braun Silk-épil SkinSpa Exfoliation Brush Refill', 'Main Product Features', 'View larger', 'Wet & Dry Performance', 'Ready for use in the bath or shower for added versatility and comfort.', 'View larger', 'Close-Grip Technology', 'Removes hair as short as a grain of sand.', 'View larger', 'High-Frequency Massage Rollers', 'Actively stimulate your skin for extra-gentle epilation.', 'View larger', 'Pivoting Head', 'Smoothly adapts to your body’s natural contours.', 'View larger', 'Smartlight', 'Reveals even the finest hairs for extra-thorough removal.', 'View larger', 'High-Density Brush', '10,000 fine bristles gently sweep away dead skin cells, stimulating the regeneration of the skin’s surface.', 'View larger', 'Ergonomic Angle', 'Allows for efficient epilation on all body areas.', 'View larger', 'Pulsonic Exfoliation Technology', 'Over 3,000 massaging microvibrations per minute exfoliate your skin 4X more effectively than manually scrubbing.', 'Product Comparison Chart', 'Silk-épil 7 7921 SkinSpa(This Product) Legs, Body & Face 7681 Legs & Body 7181 Legs & Body 5280 Legs & Body 5185 Legs & Body 3170', 'Wet & Dry Performance', '✓ ✓ ✓', 'Close-Grip Technology', '✓ ✓ ✓ ✓ ✓', 'High-Frequency Massage System', '✓ ✓ ✓ ✓ ✓', 'Massage Rollers', '✓ ✓ ✓', 'Pivoting Head', '✓ ✓ ✓ ✓', 'Smartlight', '✓ ✓ ✓ ✓ ✓', 'High-Density Brush', '✓', 'Ergonomic Angle', '✓', 'Pulsonic Exfoliation', '✓', 'Frequently Asked Questions', 'What is epilation?', \"Epilation is a more effective hair removal method for women than shaving or waxing. Epilators gently remove hair at the root, rather than at the surface like shaving, and can remove much shorter hair than waxing so you don't have to wait until hair becomes visible to remove it. After epilation, legs stay smooth for up to four weeks and hair grows back at different rates, meaning you will typically have less hair to remove each time you epilate.\", 'What is the benefit of epilation versus using a traditional razor, cream, or foam?', \"Unlike shaving, cream, or foam - which only cut or dissolve hair at the skin surface - epilators remove hair at the root. Because it takes a while for the hair to grow back to the skin surface, your skin will stay smooth for up to four weeks. As the hair grows back from the root, the tip of the hair will not be blunt, but instead look thinner and finer. As a result, you'll no longer have the feeling of coarse stubble.\", 'What is the benefit of epilation versus waxing (Agda or Halawa)?', \"Wax does remove hair from the root just like epilators. However, when it comes to removing shortest hair, wax performs quite poorly. As wax basically sticks on the hair to remove it, hair needs to be a certain length for this process to take place. Therefore, there is a hair-growth waiting period for those who use wax. With epilators, there is no such waiting and therefore no need to cover legs up. Using wax is also a hassle. The preparation process (for self-made wax, Adga, or Halawa) is long, messy, and tiresome. What's even worse, using wax (Agda or Halawa) is a more painful process compared to epilators.\", 'Does epilation hurt?', 'Most women trying epilation for the first time find the process much less painful than they had anticipated. As hair is removed at the root, however, there might be some discomfort. In the beginning, the pulling sensation is stronger, but this subsides as your skin adjusts to the process. Over time, after successive epilations, there is also less hair to be removed. Studies show that epilating more frequently can reduce pain significantly. Silk-épil Xpressive also features three ways to help women minimize discomfort - Olay pre-epilation wipes prepare the skin for epilation, a new massage system stimulates the skin before epilation and helps reduce the pain, and a beginner cap helps new users get used to epilation.', 'How long does my hair have to be for epilation?', 'Silk-épil can remove hair that is 0.5-mm in length. This hair length occurs after approximately two days of not shaving.', 'Will my hair grow back after epilation?', 'Yes. However, the hairs will grow back more tapered and fine than they do from shaving. Hair that is removed with a razor is cut at skin level, so that the edge grows back blunt and coarse, causing razor stubble.', 'Does hair grow back thicker and stronger after epilation?', 'No, dermatologists have confirmed that epilation has no negative impact on the thickness of regrowing hair. In addition, because hairs are removed at the root, the hairs that do grow back have softer, narrower tips than hairs removed with a razor, so they feel softer and finer to the touch. The reason why this question arises every now and then is that hair removal is more frequent (and also more in focus) in summer. And this is also the time when hair growth itself changes. Due to the higher ambient temperatures the blood circulation is better, leading to a better supply of nutrition to hair roots so that hair growth in general is stronger.']\n{'Brand': 'Braun', 'Water Resistance Level': 'Not Water Resistant', 'Included Components': 'Cleaning Brush', 'Unit Count': '1 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10.24 x 2.76 x 7.76 inches; 1.25 Pounds', 'Item model number': 'SE7921SPA', 'UPC': '069055866856 883207546034', 'Manufacturer': 'P & G'}\nI have owned several Braun Epilators and this new one, tops them all.  I was surprised that they could actually improve what they had, but the addition of the exfoliating brush is a great thing.<br /><br />PROS:<br />* Less pain than other brands<br />* Nice color<br />* Can be used wet/dry<br />* The light really makes a difference to see hairs<br />* exfoliating brush makes your legs really smooth.  It can also be used for rough heals, elbows, or dry winter skin.<br />* Epilating in general - Your hair grows back softer and with few hairs.  Over time, very little grows back.<br /><br />CONS:<br />* Not as gentle on underarms as other epilators I use<br />* Epilating in general can take some time, along with the exfoliating after to prevent ingrown hairs. (but with epilating, once you do it on a regular basis, you don't have to do it as often as shaving)<br /><br />Great job Braun!  Another great epilator.\nBest one so far!\nReal Techniques Bold Metals: Diamond Sponge, Create Shadow or Highlighting, Multi Surfaced for Variety of Application, Synthetic Materials, Latex Free\nReal Techniques\n['Real Techniques Bold Metals: Diamond Sponge, Create Shadow or Highlighting, Multi Surfaced for Variety of Application, Synthetic Materials, Latex Free']\n{'Brand': 'Real Techniques', 'Color': 'Diamond', 'Material': 'Rubber', 'Item Dimensions LxWxH': '2.35 x 2 x 5.12 inches', 'Recommended Uses For Product': 'For Highlighting', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.35 x 2 x 5.12 inches; 0.48 Ounces', 'Item model number': '1552', 'UPC': '079625915525', 'Manufacturer': 'Paris Presents Incorporated'}\nI just love how these sponges work.  I am converted.  wet sponge application is perfect for the times when you have already flawless skin and want to apply a light foundation or concealer.  It works well for under eye application as well.  I reach for a brush when I have a blemish to cover, because I like the thicker coverage.  These work well, just need to be cleaned once a week or so, depending on how often you use them.  Very happy with this product.  the shape of this sponge allows you to get into small creases and angles of the face.  Very cool.\nlove it\nVanity Planet Glowspin Spa Facial Brush Cleaning System - Gentle Exfoliator, Water-resistant - Suited for Sensitive Skin, Bombshell Blue\nVanity Planet\n['The Vanity Planet Glowspin is a two-speed spin brush that gently cleanses and exfoliates your complexion to help reveal your skin’s natural glow. With three attachable brush heads—Daily Cleansing Facial Brush, Exfoliating Facial Brush, and Silicone Facial Brush—this skincare wonder takes care of all your needs, keeping your face clean and healthy. Plus, it comes with an awesome travel case for easy storage on-the-go and is water-resistant and can be used in the shower.', 'With two speed settings, you can use the lower speed for a gentle, everyday cleanse, or the higher speed for deeper exfoliation. Get ready to step up your beauty game!', 'How to Use', 'To start, use a wipe or your favorite remover to get rid of any makeup on your face before using your spin brush. This will improve your cleansing experience and extend the life of your brush heads.', 'To start, use a wipe or your favorite remover to get rid of any makeup on your face before using your spin brush. This will improve your cleansing experience and extend the life of your brush heads.', 'Pick your brush head and attach to your device handle.', 'Pick your brush head and attach to your device handle.', 'Wet your face and your brush head with warm water. Apply a dollop of cleanser to the brush, then turn on the device and gently move the brush head in circular motions around your face.', 'Wet your face and your brush head with warm water. Apply a dollop of cleanser to the brush, then turn on the device and gently move the brush head in circular motions around your face.', 'Choose your preferred speed. One for gentle everyday cleansing, two for deeper exfoliation.', 'Choose your preferred speed. One for gentle everyday cleansing, two for deeper exfoliation.', 'Once you’re done cleansing, turn off the device and rinse your face. Before storing, rinse off the brush head with water and let dry in open air to keep your brushes in tip top condition.', 'Once you’re done cleansing, turn off the device and rinse your face. Before storing, rinse off the brush head with water and let dry in open air to keep your brushes in tip top condition.', 'Caring for the Vanity Planet Glowspin Facial Cleansing Brush', 'Rinse the detachable brush head thoroughly after each use. If it is discolored from makeup or debris, clean with warm, soapy water and allow to dry. Clean the base and handle once a week with a slightly damp cloth.']\n{'Material': 'Silicone', 'Brand': 'Vanity Planet', 'Color': 'Bombshell Blue', 'Power Source': 'Battery Powered', 'Item Dimensions LxWxH': '3 x 5.5 x 8.1 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 5.5 x 8.1 inches; 1.25 Pounds', 'Item model number': 'VP33251-4000', 'UPC': '812485024996', 'Manufacturer': 'Dastmalchi LLC US'}\nThis is a nice facial cleansing brush, it works well and comes in a nice case.  This one comes with a variety of brush heads.  A lot less expensive then the Clairsonic ones but works just as well.  This one is pink and it does come in a few other colors.  case is great for travel or storage.  You will want to let the brush air dry so that bacteria or mold doesn't grow on it.  replacement brushes can be purchased and should be changed periodically.  Works well to clean skin and remove dead skin cells.\nWorks great\nBeautyBio GloPRO Regeneration Tools\n{'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nI am happy with this new tool.  I like that it actually does work and is easy to use at home.  the problem I have is finding the time to do it or remembering to do it.  It doesn't hurt at all, you feel it, but it isn't painful.  worth the benefits and the science behind it makes sense.  I don't know if it is as good as what you get at the doctors, because I have never had this procedure, but my understanding is that at the doctors it goes deeper.\nworks well\nThe Beachwaver Co. S1.25 Dual Voltage, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 15.2 Ounces', 'Item model number': '4354716121', 'UPC': '817741020620 817741022730', 'Manufacturer': 'AmazonUs/SB10T'}\nThis is a nice hair curler.  It took me a little bit to get used to it. It is a new style, but works well.  It leaves very nice beach curls in your hair.  You have to be careful using this, it is very hot. I use gloves made for this type of curling and that way you don’t accidentally burn your hands.  It seems like it is made well.  Great temperature as well.\nWorks great\nNatural Solution Himalayan Pink Salt Body Scrub with Natural Honey,Ultra Hydrating and Exfoliating Scrub for Nourishing Essential Body Care - 12.3 oz\nNatural Solution\n['Formulated using unique and natural ingredients of Himalayan Pink Salt and honey. The abrasive material like salt, sugar, rice bran, jojoba beads that rubs away the dead skin cells on the surface, revealing the softer, younger cells. Carefully hand blended with organic essential oils, skin smoothing enhancers and the undeniable exfoliating power of pure, fine grain Dead Sea Salts. Nothing artificial, no chemicals.']\n{'Brand': 'Natural Solution', 'Item Form': 'Cream', 'Skin Type': 'All', 'Product Benefits': 'Moisturizing, Nourishing, Cleansing', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.75 x 3.75 x 3.6 inches; 11.22 Ounces', 'Item model number': '8246A', 'UPC': '818581019805', 'Manufacturer': 'Natural Solution'}\nI like this body scrub, it works great and smells nice too.  It works great in the winter to get rid of that dry dull skin.  It left my skin feeling soft and smooth.  easy to use and left my skin feeling great.  A lot of things in one scrub.  very happy with it.\nworks great\nPolish Due nails | Stretchable Real Nail Polish Strips| Gloss Solid Color, Ombre , French, Pattern, Glitter Finish 16Pcs | Inlcudes Nail Wipe, Nail File, Instructional Brochure 16Pcs( (Modern Royalty)\nPOLISHDUE\n{'Brand': 'POLISHDUE', 'Item Form': 'Strip', 'Color': 'Clear', 'Finish Type': 'Shimmery', 'Material Feature': 'Formaldehyde free, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.66 x 2.84 x 0.16 inches; 0.63 Ounces'}\nThese are very cool, I would def do this again.  I love how easy they were to use and the options for colors.  I am not usually good at painting my nails, but these were so  much easier I thought.  I really like them, and they seemed to help let nails grow and not break.  they stayed on well also.\nvery cool\nBEPHOLAN Fake Eyelashes, 3 Pairs Split Tips Flat 3D False Eyelashes, Natural Cat-Eye Look, Full Volume Effect, More Softer And Lighter, XMZ237\nBEPHOLAN\n{'Brand': 'BEPHOLAN', 'Item Dimensions LxWxH': '63.36 x 59.04 x 5.64 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '63.36 x 59.04 x 5.64 inches; 0.71 Ounces'}\nThese are great lashes, my daughter wears them all the time.  they work great for dance competition make up as well.  they are  made well, can be reused.  I think they stay on well also, but that is more about the type of glue you use.  they look very nice on, very dramatic, not a natural look, more extreme.\nGreat lashes\nLashes Mink Natural Look Same Styles 10 Pairs Reusable Lash Pack With Individual Glitter Portable Boxes, 10 Styles Fake Eyelashes are Shipped Randomly, #5D01, #5D04, #5D05, #5D06, #5D07, 3D31, 3D29, 3D26, 3D03, 3D01\nBQAN\n{'Brand': 'BQAN', 'Material': 'Mink Fur', 'Item Dimensions LxWxH': '10.43 x 4.72 x 1.18 inches', 'Material Feature': 'Latex Free', 'Item Form': 'Pairs Pair', 'Product Dimensions': '10.43 x 4.72 x 1.18 inches; 12.63 Ounces'}\nthis is a great set of 10 reusable lashes, they will last a long time.  they work well and look nice on.  Made well and a variety of styles.  I am very happy with the set.  Use glue to put them on.  they stayed on. My daughter has smaller eyes and has had to cut some of them to fit, but that is very easy to do.  Works great and looks great.\nGreat set/variety\nEyebrow Stamp and Eyebrow Shaper Kit,One Step Brow Stamp Shaping Kit - Professional Eyebrow Powder Stamp Makeup with 24 Eyebrow Stencils 4 Eyebrow Makeup Brushes\nZDU\n{'Brand': 'ZDU', 'Item Form': 'Powder', 'Material Feature': 'Natural', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '4.8 x 3.62 x 1.34 inches; 1.76 Ounces'}\nI wasn't expecting much from this, but it is surprisingly good. it has a ton of choices and I found one that works well for me.  the color of the stamp was great for me.  this kit comes with everything and it works well.  I am very happy with it.  it looks great.\nsurprisingly good\nDolicer 12 Colors Face Body Paint Set, Safe Non-Toxic Face Body Paint Oil with 10 Artist Brushes Face Painting Kit for Kids & Adults Birthday Party, Christmas, Carnival, Easter Cosplay\nDolicer\n{'Brand': 'Dolicer', 'Package Information': 'Palette', 'Package Type': 'Palette', 'Specialty': 'Non Toxic', 'Package Dimensions': '8.15 x 2.68 x 0.94 inches; 5.93 Ounces'}\nthis is a great set of face and body paint, perfect for halloween or a kids party.  It was easy to use and works well.  it comes with the brushes, which is nice.  Non-toxic is important for this type of make up so that is great.  It works well.  great color selection.\nGreat set\nBesTby Acrylic Nail Kit - Clear Acrylic Powder and Monomer Set Nail Art\nBesTby\n{'Material': 'Acrylic', 'Brand': 'BesTby', 'Item Form': 'Powder', 'Package Dimensions': '5.98 x 4.02 x 1.69 inches; 8.64 Ounces'}\nOK so I think this kit is OK, it is good if you are trying to learn and don't want to pay a ton for a kit.  I think it is a small kit, learn and move on to better quality products, is my opinion.  It does work, takes practice, my nails came out OK, but clearly not salon quality, they are the experts.  but you could try it and see if you like it and the more you do it the better you can get.  the smell is super strong on this kit.  that kinda stinks (literally) LOL.  it comes with what you need, but not a lot of it.\nsmall kit",
  "actual_interaction": {
    "rating": 3.0,
    "title": "small kit",
    "text": "OK so I think this kit is OK, it is good if you are trying to learn and don't want to pay a ton for a kit.  I think it is a small kit, learn and move on to better quality products, is my opinion.  It does work, takes practice, my nails came out OK, but clearly not salon quality, they are the experts.  but you could try it and see if you like it and the more you do it the better you can get.  the smell is super strong on this kit.  that kinda stinks (literally) LOL.  it comes with what you need, but not a lot of it.",
    "images": [],
    "asin": "B098KB1FS9",
    "parent_asin": "B098KB1FS9",
    "user_id": "AHNSZCP3JIOZZVYXFJRGQEKRSTFA",
    "timestamp": "2022-04-14 12:50:24.172000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "BesTby Acrylic Nail Kit - Clear Acrylic Powder and Monomer Set Nail Art",
    "average_rating": 3.1,
    "rating_number": 38,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51VWcMTbHXL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51VWcMTbHXL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71IhlNp3PFL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51OhVS9OWyL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51OhVS9OWyL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71avzqv1wbL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41-5cCGswnL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41-5cCGswnL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/717GNm7W5xL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Z8WxYmrSL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Z8WxYmrSL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71qDYt90JML._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51i8RY42XzL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51i8RY42XzL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71FpFWzABYL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51WEa4sMviL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51WEa4sMviL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81W6bTIZtdL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51jCeYRL2sL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51jCeYRL2sL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/712QfIodipL._SL1200_.jpg"
      }
    ],
    "videos": [],
    "store": "BesTby",
    "categories": [],
    "details": {
      "Material": "Acrylic",
      "Brand": "BesTby",
      "Item Form": "Powder",
      "Package Dimensions": "5.98 x 4.02 x 1.69 inches; 8.64 Ounces"
    },
    "bought_together": null
  }
}