{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Eyelash Extensions 0.15mm D Curl Individual Eyelash Extension Supplies Mixed Tray Faux Mink Premium Single & Classic Lash Extensions Mix | 8mm | 9mm | 10mm | 11mm | 12mm | 13mm | 14mm | 15mm (D Curl)\nReview Date: 2020/07/17\nStore: Sam&Helen\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Sam&Helen', 'Material': 'Silk, Faux Mink, Polybutylene Terephthalate Fiber', 'Item Dimensions LxWxH': '4.6 x 2.6 x 0.63 inches', 'Material Feature': 'Natural', 'Item Form': 'Individual', 'Product Dimensions': '4.6 x 2.6 x 0.63 inches; 0.81 Ounces'}\nReview Text: My wife tried these lash and it was super rough and hard. It didn’t felt soft like all the other brands she purchase. The lashes was easy to comes off the strip.\nReview Title: Lashes were super rough\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "The Beachwaver Co. Dual Voltage, S1, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nHeats up super fast, adjustable heat and no more needing to twist, it does it automatically with a push of a button.  It takes much lesser time to curl with the automatic curling.\nAuto rolling, and so easy to use.\n9 Pack Headbands Set -Messen Fashion Velvet Wide Hairband with Pearl Knitted Floral Fabric Cute Elegant Vintage Cross Knot Turban Elastic Hair Hoop Headwrap for Women Girls Hair Accessories\nMessen\n{'Package Dimensions': '10.8 x 6.6 x 2.1 inches; 14.07 Ounces'}\nCute and decorative headband that fits my daughter head. She is 10 years old and have a small head. It comes in different sizes. I've try couples and it just slide off my head but i love the colors and style. The end of headband kinda hurts a little but I've ask my daughter and she said it fits good and doesn't hurt her head.\nGreat headband but small for me\nNewcally False Eyelashes 3D Thick Volume Faux Mink Lashes 5 Pairs Multipack\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.5 x 3.8 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372145'}\nSuper soft and looks dramatic. These are great to use on a daily wear. It looks very natural and doesn't look fake or stiff.\nSoo soft\nLINGSFIRE Electric Foot File Callus Remover for Feet Speed Adjustable Professional Foot Polisher with 60Pcs Replacement Sandpaper Discs for Men Women Dry Dead Hard Cracked Skin or Calluses (Grey)\nLINGSFIRE\n{'Brand': 'LINGSFIRE', 'Material': 'Aluminum', 'Item Weight': '0.37 Pounds', 'Is Electric': 'Yes', 'Item Form': 'Filer', 'Package Dimensions': '8.94 x 5.24 x 2.4 inches; 5.92 Ounces', 'Item model number': 'QZ-XF6DPP-201012-1551'}\nFor the size it could be wireless.  Its not that powerful also.  Speed is controlled on the wire.\nNot wireless\nMaynice Soft Nature 3D Mink Stripe Lashes WIth Package 1 pair Y50\nMaynice\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.72 x 2.17 x 0.59 inches; 1.06 Ounces', 'UPC': '743811077808'}\nLove these falsies. If i decide to get extension i would want it to look like these. Easy to apply , and the edges are just a little too long so all you have to do is just trim it.\nSuper soft\nGents of London Design Paste Matt Firm Hold Professional Hair Styling Wax (3 oz)\nGENTS OF LONDON\n{'Hair Type': 'All', 'Scent': 'Aloe', 'Liquid Volume': '3 Fluid Ounces', 'Item Form': 'Wax', 'Brand': 'GENTS OF LONDON'}\nDefinitely has a gentleman’s scent. The wax last almost entire day for me since i have short hair.\nHolds well and smelling good\nNOBLE Long Curly Lace Front Wigs 38 inch Light-weight Afro Kinky Curly Wigs Ombre Orange Blonde Synthetic Lace Front Wigs for Daily Party Cosplay Costume Wigs\nNOBLE\n{'Material': 'Synthetic', 'Hair Type': 'dry, Curly, Coily', 'Brand': 'NOBLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.1 x 7.9 x 2.6 inches; 15.2 Ounces', 'UPC': '727780533329'}\nI was the hair and the hair feels rough. I would wear this for fun but not to actually wear for daily use.\nfeels rough\nEyelash Extensions 0.15mm D Curl Individual Eyelash Extension Supplies Mixed Tray Faux Mink Premium Single & Classic Lash Extensions Mix | 8mm | 9mm | 10mm | 11mm | 12mm | 13mm | 14mm | 15mm (D Curl)\nSam&Helen\n{'Brand': 'Sam&Helen', 'Material': 'Silk, Faux Mink, Polybutylene Terephthalate Fiber', 'Item Dimensions LxWxH': '4.6 x 2.6 x 0.63 inches', 'Material Feature': 'Natural', 'Item Form': 'Individual', 'Product Dimensions': '4.6 x 2.6 x 0.63 inches; 0.81 Ounces'}\nMy wife tried these lash and it was super rough and hard. It didn’t felt soft like all the other brands she purchase. The lashes was easy to comes off the strip.\nLashes were super rough",
  "profile": "**Updated User Summary:**\n\n- **Product Type Preference:** The user continues to explore a range of beauty accessories, with a focus on false lashes, hairstyling tools, and synthetic wigs for special occasions. \n- **Quality Focus:** The commitment to high-quality materials remains strong, yet recent experiences have made the user more discerning about wearability and softness in beauty products.\n- **Heat Management and Versatility:** Appreciates adjustable settings in hairstyling tools, seeking versatile products for various styles.\n- **Time Efficiency:** Prioritizes beauty tools that enhance efficiency in application processes, reflecting a commitment to convenience and practicality.\n- **Material Preference:** While maintaining a focus on high-quality craftsmanship, the user is now increasingly sensitive to texture, impacting their selection of beauty accessories.\n- **Simplicity in Design:** Attracted to user-friendly features that improve enjoyment and effectiveness, emphasizing items that streamline beauty routines.\n- **Family-Oriented:** Evaluates beauty and personal care products for family use, advocating for shared benefits and overall well-being.\n\nRecent feedback indicates a challenging experience with a purchased eyelash product, specifically noting issues with texture and comfort, which may influence future purchasing decisions. The user remains committed to advancements in beauty technology that enhance their lifestyle while being cautious about new products that may not meet their established standards.",
  "metrics": {
    "rouge1_f": 0.15876515986769568,
    "rouge2_f": 0.00441988950276243,
    "rougeL_f": 0.07276736493936053,
    "meteor": 0.06054664975204706,
    "bleu1": 0.023575451448579414,
    "bleu2": 0.004632274824421834,
    "bleu3": 0.000867790167648277,
    "bleu4": 0.0003759573184372422,
    "bertscore_precision": 0.3578544855117798,
    "bertscore_recall": 0.45004045963287354,
    "bertscore_f1": 0.3986879587173462
  }
}