{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Newcally False Eyelashes 3D Thick Volume Faux Mink Lashes 5 Pairs Multipack\nReview Date: 2020/02/05\nStore: Newcally\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Newcally', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.5 x 3.8 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372145'}\nReview Text: Super soft and looks dramatic. These are great to use on a daily wear. It looks very natural and doesn't look fake or stiff.\nReview Title: Soo soft\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Beachwaver Co. Dual Voltage, S1, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nHeats up super fast, adjustable heat and no more needing to twist, it does it automatically with a push of a button.  It takes much lesser time to curl with the automatic curling.\nAuto rolling, and so easy to use.\n9 Pack Headbands Set -Messen Fashion Velvet Wide Hairband with Pearl Knitted Floral Fabric Cute Elegant Vintage Cross Knot Turban Elastic Hair Hoop Headwrap for Women Girls Hair Accessories\nMessen\n{'Package Dimensions': '10.8 x 6.6 x 2.1 inches; 14.07 Ounces'}\nCute and decorative headband that fits my daughter head. She is 10 years old and have a small head. It comes in different sizes. I've try couples and it just slide off my head but i love the colors and style. The end of headband kinda hurts a little but I've ask my daughter and she said it fits good and doesn't hurt her head.\nGreat headband but small for me\nNewcally False Eyelashes 3D Thick Volume Faux Mink Lashes 5 Pairs Multipack\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.5 x 3.8 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372145'}\nSuper soft and looks dramatic. These are great to use on a daily wear. It looks very natural and doesn't look fake or stiff.\nSoo soft",
  "profile": "**User Summary:**\n\n- **Product Type Preference:** Favors innovative hair styling tools that simplify the curling process and has recently shown an interest in cosmetic accessories, particularly false eyelashes.\n- **Quality Focus:** Prioritizes efficiency and ease of use in products, valuing automatic functions for hairstyling, while also appreciating aesthetic and functional quality in accessories like eyelashes that offer a natural yet dramatic appearance.\n- **Heat Management:** Values adjustable heat settings for optimal styling, indicating a commitment to hair care and versatility in styling techniques. \n- **Time Efficiency:** Looks for tools and accessories that minimize the time required for hairstyling and makeup application, underscoring a preference for convenience in daily routines.\n- **Material Preference:** Favors ceramic materials in tools for their heat distribution benefits and is interested in cruelty-free materials for cosmetics, reflecting a shift towards ethical considerations.\n- **Versatility:** Interested in products suitable for various hair types and sizes, and now also for diverse makeup looks, reflecting a broad appeal in styling options and accessory practicality.\n- **Simplicity in Design:** Attracted to products with automated functions to reduce manual effort, and appreciates style and comfort in accessories, valuing soft and natural designs.\n- **Family-Oriented:** Shows consideration for product suitability for children, indicating a family-focused perspective in purchasing choices, extending to cosmetic products for everyday use.\n\nThis user embodies a practical individual who appreciates advances in beauty technology, stylish accessories, and ethical considerations that enhance user experience while maintaining health and comfort for themselves and their family.",
  "metrics": {
    "rouge1_f": 0.25,
    "rouge2_f": 0.019011406844106463,
    "rougeL_f": 0.10984848484848486,
    "meteor": 0.1298350013524479,
    "bleu1": 0.20376817688757645,
    "bleu2": 0.04621829560395291,
    "bleu3": 0.008250580749980594,
    "bleu4": 0.003488747108858406,
    "bertscore_precision": 0.4068123698234558,
    "bertscore_recall": 0.4514870047569275,
    "bertscore_f1": 0.4279870092868805
  }
}