{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: LINGSFIRE Electric Foot File Callus Remover for Feet Speed Adjustable Professional Foot Polisher with 60Pcs Replacement Sandpaper Discs for Men Women Dry Dead Hard Cracked Skin or Calluses (Grey)\nReview Date: 2020/02/07\nStore: LINGSFIRE\nAverage Rating: 4.3\nProduct Details: {'Brand': 'LINGSFIRE', 'Material': 'Aluminum', 'Item Weight': '0.37 Pounds', 'Is Electric': 'Yes', 'Item Form': 'Filer', 'Package Dimensions': '8.94 x 5.24 x 2.4 inches; 5.92 Ounces', 'Item model number': 'QZ-XF6DPP-201012-1551'}\nReview Text: For the size it could be wireless.  Its not that powerful also.  Speed is controlled on the wire.\nReview Title: Not wireless\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "The Beachwaver Co. Dual Voltage, S1, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nHeats up super fast, adjustable heat and no more needing to twist, it does it automatically with a push of a button.  It takes much lesser time to curl with the automatic curling.\nAuto rolling, and so easy to use.\n9 Pack Headbands Set -Messen Fashion Velvet Wide Hairband with Pearl Knitted Floral Fabric Cute Elegant Vintage Cross Knot Turban Elastic Hair Hoop Headwrap for Women Girls Hair Accessories\nMessen\n{'Package Dimensions': '10.8 x 6.6 x 2.1 inches; 14.07 Ounces'}\nCute and decorative headband that fits my daughter head. She is 10 years old and have a small head. It comes in different sizes. I've try couples and it just slide off my head but i love the colors and style. The end of headband kinda hurts a little but I've ask my daughter and she said it fits good and doesn't hurt her head.\nGreat headband but small for me\nNewcally False Eyelashes 3D Thick Volume Faux Mink Lashes 5 Pairs Multipack\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.5 x 3.8 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372145'}\nSuper soft and looks dramatic. These are great to use on a daily wear. It looks very natural and doesn't look fake or stiff.\nSoo soft\nLINGSFIRE Electric Foot File Callus Remover for Feet Speed Adjustable Professional Foot Polisher with 60Pcs Replacement Sandpaper Discs for Men Women Dry Dead Hard Cracked Skin or Calluses (Grey)\nLINGSFIRE\n{'Brand': 'LINGSFIRE', 'Material': 'Aluminum', 'Item Weight': '0.37 Pounds', 'Is Electric': 'Yes', 'Item Form': 'Filer', 'Package Dimensions': '8.94 x 5.24 x 2.4 inches; 5.92 Ounces', 'Item model number': 'QZ-XF6DPP-201012-1551'}\nFor the size it could be wireless.  Its not that powerful also.  Speed is controlled on the wire.\nNot wireless",
  "profile": "**User Summary:**\n\n- **Product Type Preference:** Favors innovative hair styling tools that simplify the curling process and has shown an expanding interest in personal care products, such as foot care devices.\n- **Quality Focus:** Prioritizes efficiency and ease of use in products, valuing automatic functions while seeking functionality and aesthetic appeal across a range of accessories, including those for feet.\n- **Heat Management and Versatility:** Values adjustable heat settings in hairstyling tools, showcasing a commitment to hair care and the need for versatility in styling techniques. This adaptability extends to their interest in products suitable for various body areas, such as feet.\n- **Time Efficiency:** Looks for tools and accessories that minimize the time required for hair and personal care routines, emphasizing convenience and practicality in daily use.\n- **Material Preference:** Continues to favor high-quality materials that improve functionality, reflecting a broader concern for the design and effectiveness of personal care items.\n- **Simplicity in Design:** Attracted to products with user-friendly features to reduce manual effort, and appreciates comfort and usability in all personal care solutions.\n- **Family-Oriented:** Considers product suitability for family members, highlighting a focus on general well-being and practicality in personal care choices.\n\nThis user exemplifies a practical individual who values advancements in both beauty and personal care technology, stylish and effective accessories, and ethical considerations that enhance their family’s routine while ensuring comfort and health.",
  "metrics": {
    "rouge1_f": 0.22296173044925127,
    "rouge2_f": 0.01001669449081803,
    "rougeL_f": 0.09650582362728785,
    "meteor": 0.10084925690021232,
    "bleu1": 0.12616697519273254,
    "bleu2": 0.02562078216435809,
    "bleu3": 0.004852150336949186,
    "bleu4": 0.0021133991059192423,
    "bertscore_precision": 0.377048134803772,
    "bertscore_recall": 0.440978467464447,
    "bertscore_f1": 0.4065151512622833
  }
}