{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: NOBLE Long Curly Lace Front Wigs 38 inch Light-weight Afro Kinky Curly Wigs Ombre Orange Blonde Synthetic Lace Front Wigs for Daily Party Cosplay Costume Wigs\nReview Date: 2020/04/08\nStore: NOBLE\nAverage Rating: 4.4\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'dry, Curly, Coily', 'Brand': 'NOBLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.1 x 7.9 x 2.6 inches; 15.2 Ounces', 'UPC': '727780533329'}\nReview Text: I was the hair and the hair feels rough. I would wear this for fun but not to actually wear for daily use.\nReview Title: feels rough\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "The Beachwaver Co. Dual Voltage, S1, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nHeats up super fast, adjustable heat and no more needing to twist, it does it automatically with a push of a button.  It takes much lesser time to curl with the automatic curling.\nAuto rolling, and so easy to use.\n9 Pack Headbands Set -Messen Fashion Velvet Wide Hairband with Pearl Knitted Floral Fabric Cute Elegant Vintage Cross Knot Turban Elastic Hair Hoop Headwrap for Women Girls Hair Accessories\nMessen\n{'Package Dimensions': '10.8 x 6.6 x 2.1 inches; 14.07 Ounces'}\nCute and decorative headband that fits my daughter head. She is 10 years old and have a small head. It comes in different sizes. I've try couples and it just slide off my head but i love the colors and style. The end of headband kinda hurts a little but I've ask my daughter and she said it fits good and doesn't hurt her head.\nGreat headband but small for me\nNewcally False Eyelashes 3D Thick Volume Faux Mink Lashes 5 Pairs Multipack\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.5 x 3.8 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372145'}\nSuper soft and looks dramatic. These are great to use on a daily wear. It looks very natural and doesn't look fake or stiff.\nSoo soft\nLINGSFIRE Electric Foot File Callus Remover for Feet Speed Adjustable Professional Foot Polisher with 60Pcs Replacement Sandpaper Discs for Men Women Dry Dead Hard Cracked Skin or Calluses (Grey)\nLINGSFIRE\n{'Brand': 'LINGSFIRE', 'Material': 'Aluminum', 'Item Weight': '0.37 Pounds', 'Is Electric': 'Yes', 'Item Form': 'Filer', 'Package Dimensions': '8.94 x 5.24 x 2.4 inches; 5.92 Ounces', 'Item model number': 'QZ-XF6DPP-201012-1551'}\nFor the size it could be wireless.  Its not that powerful also.  Speed is controlled on the wire.\nNot wireless\nMaynice Soft Nature 3D Mink Stripe Lashes WIth Package 1 pair Y50\nMaynice\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.72 x 2.17 x 0.59 inches; 1.06 Ounces', 'UPC': '743811077808'}\nLove these falsies. If i decide to get extension i would want it to look like these. Easy to apply , and the edges are just a little too long so all you have to do is just trim it.\nSuper soft\nGents of London Design Paste Matt Firm Hold Professional Hair Styling Wax (3 oz)\nGENTS OF LONDON\n{'Hair Type': 'All', 'Scent': 'Aloe', 'Liquid Volume': '3 Fluid Ounces', 'Item Form': 'Wax', 'Brand': 'GENTS OF LONDON'}\nDefinitely has a gentleman’s scent. The wax last almost entire day for me since i have short hair.\nHolds well and smelling good\nNOBLE Long Curly Lace Front Wigs 38 inch Light-weight Afro Kinky Curly Wigs Ombre Orange Blonde Synthetic Lace Front Wigs for Daily Party Cosplay Costume Wigs\nNOBLE\n{'Material': 'Synthetic', 'Hair Type': 'dry, Curly, Coily', 'Brand': 'NOBLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.1 x 7.9 x 2.6 inches; 15.2 Ounces', 'UPC': '727780533329'}\nI was the hair and the hair feels rough. I would wear this for fun but not to actually wear for daily use.\nfeels rough",
  "profile": "**Updated User Summary:**\n\n- **Product Type Preference:** The user continues to explore a variety of beauty accessories, particularly focusing on false lashes, hairstyling tools, and now includes synthetic wigs as a playful addition to their collection, considering them for special occasions rather than daily wear.\n- **Quality Focus:** Upholding a commitment to high-quality materials and functional design, the user values products that meet performance expectations and cater to both individual and family needs.\n- **Heat Management and Versatility:** Appreciates adjustable settings in hairstyling tools and seeks versatile beauty products that can accommodate different uses and styles.\n- **Time Efficiency:** Prioritizes beauty tools that streamline application processes, demonstrating an ongoing dedication to convenience and practicality.\n- **Material Preference:** Maintains a focus on high-quality craftsmanship, now with a growing awareness of comfort since their recent experience with texture in hair products.\n- **Simplicity in Design:** Attracted to user-friendly features that enhance enjoyment and effectiveness in beauty applications, with a continued emphasis on items that simplify the beauty routine.\n- **Family-Oriented:** Continues to evaluate the practicality of beauty and personal care items for family use, promoting overall well-being and shared benefits.\n\nRecent feedback indicates a mixed experience with new products, highlighting the user’s sensitivity to texture and wearability, thus influencing their approach to selecting beauty accessories and tools. The user remains committed to advancements in beauty technology that elevate their lifestyle.",
  "metrics": {
    "rouge1_f": 0.19975639464068212,
    "rouge2_f": 0.007326007326007325,
    "rougeL_f": 0.08769792935444581,
    "meteor": 0.08165970053479041,
    "bleu1": 0.055871949137202226,
    "bleu2": 0.014531970975188857,
    "bleu3": 0.005110767485000316,
    "bleu4": 0.001705864657803089,
    "bertscore_precision": 0.35815826058387756,
    "bertscore_recall": 0.4455830454826355,
    "bertscore_f1": 0.39711594581604004
  }
}