{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Maynice Soft Nature 3D Mink Stripe Lashes WIth Package 1 pair Y50\nReview Date: 2020/02/23\nStore: Maynice\nAverage Rating: 4.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.72 x 2.17 x 0.59 inches; 1.06 Ounces', 'UPC': '743811077808'}\nReview Text: Love these falsies. If i decide to get extension i would want it to look like these. Easy to apply , and the edges are just a little too long so all you have to do is just trim it.\nReview Title: Super soft\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Beachwaver Co. Dual Voltage, S1, White\n{'Product Benefits': 'This ceramic, rotating curling iron provides easy, quality waves in minutes!', 'Shape': 'Barrel', 'Brand': 'The Beachwaver Co.', 'Hair Type': 'All', 'Material': 'Ceramic', 'Product Dimensions': '15.75 x 1.75 x 2 inches; 14.4 Ounces', 'Item model number': '1', 'UPC': '817741020613', 'Manufacturer': 'AmazonUs/SB10T', 'Country of Origin': 'China'}\nHeats up super fast, adjustable heat and no more needing to twist, it does it automatically with a push of a button.  It takes much lesser time to curl with the automatic curling.\nAuto rolling, and so easy to use.\n9 Pack Headbands Set -Messen Fashion Velvet Wide Hairband with Pearl Knitted Floral Fabric Cute Elegant Vintage Cross Knot Turban Elastic Hair Hoop Headwrap for Women Girls Hair Accessories\nMessen\n{'Package Dimensions': '10.8 x 6.6 x 2.1 inches; 14.07 Ounces'}\nCute and decorative headband that fits my daughter head. She is 10 years old and have a small head. It comes in different sizes. I've try couples and it just slide off my head but i love the colors and style. The end of headband kinda hurts a little but I've ask my daughter and she said it fits good and doesn't hurt her head.\nGreat headband but small for me\nNewcally False Eyelashes 3D Thick Volume Faux Mink Lashes 5 Pairs Multipack\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink, Cotton', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.5 x 3.8 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372145'}\nSuper soft and looks dramatic. These are great to use on a daily wear. It looks very natural and doesn't look fake or stiff.\nSoo soft\nLINGSFIRE Electric Foot File Callus Remover for Feet Speed Adjustable Professional Foot Polisher with 60Pcs Replacement Sandpaper Discs for Men Women Dry Dead Hard Cracked Skin or Calluses (Grey)\nLINGSFIRE\n{'Brand': 'LINGSFIRE', 'Material': 'Aluminum', 'Item Weight': '0.37 Pounds', 'Is Electric': 'Yes', 'Item Form': 'Filer', 'Package Dimensions': '8.94 x 5.24 x 2.4 inches; 5.92 Ounces', 'Item model number': 'QZ-XF6DPP-201012-1551'}\nFor the size it could be wireless.  Its not that powerful also.  Speed is controlled on the wire.\nNot wireless\nMaynice Soft Nature 3D Mink Stripe Lashes WIth Package 1 pair Y50\nMaynice\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.72 x 2.17 x 0.59 inches; 1.06 Ounces', 'UPC': '743811077808'}\nLove these falsies. If i decide to get extension i would want it to look like these. Easy to apply , and the edges are just a little too long so all you have to do is just trim it.\nSuper soft",
  "profile": "**User Summary:**\n\n- **Product Type Preference:** Now includes a growing interest in beauty accessories, specifically false lashes, alongside innovative hair styling tools and personal care devices for foot care. \n- **Quality Focus:** Continues to prioritize efficiency and ease of use, with a strong preference for products that offer automatic functions and aesthetic appeal, extending this interest to makeup and beauty applications.\n- **Heat Management and Versatility:** Values adjustable settings in hairstyling tools while also appreciating the versatility in beauty products, indicating a holistic approach to personal care and styling.\n- **Time Efficiency:** Looks for beauty tools and accessories that simplify application processes, emphasizing convenience and practicality in enhancing overall beauty routines.\n- **Material Preference:** Maintains a focus on high-quality materials, reflecting a broader concern for design effectiveness across all personal and beauty care items.\n- **Simplicity in Design:** Attracted to user-friendly features that reduce manual effort, appreciated in both beauty products and personal care solutions, ensuring an enjoyable experience.\n- **Family-Oriented:** Considers the suitability of beauty and personal care products for family use, showcasing a focus on general well-being and practicality for all members.\n\nThis user reflects a practical individual who values advancements in beauty and personal care technology, stylish and effective accessories, alongside ethical considerations enhancing their family's daily routine while ensuring comfort and health.",
  "metrics": {
    "rouge1_f": 0.19607843137254902,
    "rouge2_f": 0.006051437216338881,
    "rougeL_f": 0.08446455505279034,
    "meteor": 0.08899382491827097,
    "bleu1": 0.08674137303705487,
    "bleu2": 0.010241071249515706,
    "bleu3": 0.0023347688055617363,
    "bleu4": 0.0011158059222718699,
    "bertscore_precision": 0.36469191312789917,
    "bertscore_recall": 0.441424161195755,
    "bertscore_f1": 0.3994060158729553
  }
}