{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Makeup Brush Mini 4 in 1 Kit for Travel Cosmetic Applicator Foundation Sponges Brushes Valentine's Day Gift, Blending Eyeshadow Concealer Eyeliner Eyebrow\nReview Date: 2019/12/31\nStore: Seencool\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Seencool', 'Recommended Uses For Product': 'Face Makeup', 'Color': 'Golden', 'Material': 'Latex', 'Skin Type': 'Sensitive', 'Item Form': 'Wand', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '5.2 x 1.6 x 1.1 inches; 1.59 Ounces', 'UPC': '783710114471'}\nReview Text: I really like this mini brush kit it saves me from having to take all my other brushes because it has all the brushes I need in this easy to pack set so instead of having to take a handful of other brushes I can just throw this in my bag it saves space in my bag and I don't have to hunt for a different brush because it is all right there\nReview Title: Saves space\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Makeup Brush Cleaner Sponge for Quick Color Removal – Remove Shadow Color from Makeup Brushes\nZenda Naturals\n{'Brand': 'Zenda Naturals', 'Skin Type': 'All', 'Item Form': 'Wand', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.9 x 2.7 x 1.1 inches; 0.63 Ounces', 'UPC': '850772008236'}\nThe brush cleaner is great for the first couple of days then you clean it and it only works for a day then it needs to be cleaned again\nNeed to wash frequently\nDouble-Ended Professional Foundation &Contour Makeup Blending Brush | Soft Bristles Highlighting makeup brush |Travel makeup brush | Eco-Friendly & Cruelty-free| Powder setting brush\nEVE'S\n{'Brand': \"EVE'S\", 'Recommended Uses For Product': 'Contour, For Foundation, For Highlighting', 'Material': 'Wood', 'Item Form': 'Wand', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Handle Material': 'Wood', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 3.7 x 1.34 inches; 2.12 Ounces', 'UPC': '782290927471'}\nThis brush is very soft but it doesn't work as well as I expected it to.\nSoft brush\nNude Gel Polish 6 Colors Gel Nail Polish Set with Gift Box, Soak Off UV LED Gel Polish Kit\nFULLSEXY\n{'Brand': 'FULLSEXY', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1.62 Fl Oz', 'Number of Items': '6', 'Package Dimensions': '7.4 x 3 x 1 inches; 8.01 Ounces'}\nI was kind of disappointed in this purchase the polishes aren't very pigmented so I had to do 4 coats to get it to really show the way I wanted it to and having to do that many coats uses up a LOT of the product so it isn't very cost effective not to mention very time consuming because after each coat you have to cure them under the lamp so it takes up a lot of your time\nNot very cost effective.\nMakeup Brush Mini 4 in 1 Kit for Travel Cosmetic Applicator Foundation Sponges Brushes Valentine's Day Gift, Blending Eyeshadow Concealer Eyeliner Eyebrow\nSeencool\n{'Brand': 'Seencool', 'Recommended Uses For Product': 'Face Makeup', 'Color': 'Golden', 'Material': 'Latex', 'Skin Type': 'Sensitive', 'Item Form': 'Wand', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '5.2 x 1.6 x 1.1 inches; 1.59 Ounces', 'UPC': '783710114471'}\nI really like this mini brush kit it saves me from having to take all my other brushes because it has all the brushes I need in this easy to pack set so instead of having to take a handful of other brushes I can just throw this in my bag it saves space in my bag and I don't have to hunt for a different brush because it is all right there\nSaves space",
  "profile": "**User Summary:**\n\nThe user exhibits a strong preference for beauty and makeup tools that prioritize convenience, efficiency, and quality. Their recent interactions reflect a discerning evaluation of product performance, marked by a critical stance when items do not meet their high standards, especially regarding effectiveness and longevity. A recent purchase highlights a shift towards appreciating practical solutions, as the user expressed satisfaction with a compact brush kit that simplifies their makeup routine and minimizes packing hassle. \n\nDespite previous dissatisfaction with various products, this new interaction showcases their willingness to embrace tools that effectively enhance functionality and ease of use. The user’s previous average rating remains low, underscoring their stringent expectations. They have demonstrated a clear preference for products that not only fulfill their intended purpose but are also time-efficient and economical. \n\nThe user continues to seek beauty tools that balance aesthetics with practicality, emphasizing durability alongside efficiency. Their latest review indicates a potential readiness to reconsider their evaluations when products deliver on convenience and quality. Overall, the user remains committed to making informed choices in their beauty arsenal, advocating for reliable items that meet their rigorous standards while being open to discovering improvements that align with their needs.",
  "metrics": {
    "rouge1_f": 0.16248153618906944,
    "rouge2_f": 0.005925925925925926,
    "rougeL_f": 0.07385524372230429,
    "meteor": 0.05973813420621931,
    "bleu1": 0.03404591615070504,
    "bleu2": 0.004731893168527841,
    "bleu3": 0.0011393982004046942,
    "bleu4": 0.0005597395617755434,
    "bertscore_precision": 0.3105156421661377,
    "bertscore_recall": 0.3688853085041046,
    "bertscore_f1": 0.3371931314468384
  }
}