{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Youluv Under Eye Patches - Collagen Eye Mask Gel\nReview Date: 2020/01/12\nStore: YOULUV\nAverage Rating: 3.6\nProduct Details: {'Product Dimensions': '7 x 3.2 x 1.15 inches; 3.21 Ounces', 'Item model number': 'YL', 'UPC': '790492337899'}\nReview Text: These under eye patches don't work very well they don't stay on and honestly they really didn't do anything for my under eyes and when me and my daughter did our facials she said it didn't do anything for hers either so not a very good product\nReview Title: Doesn't really do anything and doesn't stay on\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Makeup Brush Cleaner Sponge for Quick Color Removal – Remove Shadow Color from Makeup Brushes\nZenda Naturals\n{'Brand': 'Zenda Naturals', 'Skin Type': 'All', 'Item Form': 'Wand', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.9 x 2.7 x 1.1 inches; 0.63 Ounces', 'UPC': '850772008236'}\nThe brush cleaner is great for the first couple of days then you clean it and it only works for a day then it needs to be cleaned again\nNeed to wash frequently\nDouble-Ended Professional Foundation &Contour Makeup Blending Brush | Soft Bristles Highlighting makeup brush |Travel makeup brush | Eco-Friendly & Cruelty-free| Powder setting brush\nEVE'S\n{'Brand': \"EVE'S\", 'Recommended Uses For Product': 'Contour, For Foundation, For Highlighting', 'Material': 'Wood', 'Item Form': 'Wand', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Handle Material': 'Wood', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 3.7 x 1.34 inches; 2.12 Ounces', 'UPC': '782290927471'}\nThis brush is very soft but it doesn't work as well as I expected it to.\nSoft brush\nNude Gel Polish 6 Colors Gel Nail Polish Set with Gift Box, Soak Off UV LED Gel Polish Kit\nFULLSEXY\n{'Brand': 'FULLSEXY', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1.62 Fl Oz', 'Number of Items': '6', 'Package Dimensions': '7.4 x 3 x 1 inches; 8.01 Ounces'}\nI was kind of disappointed in this purchase the polishes aren't very pigmented so I had to do 4 coats to get it to really show the way I wanted it to and having to do that many coats uses up a LOT of the product so it isn't very cost effective not to mention very time consuming because after each coat you have to cure them under the lamp so it takes up a lot of your time\nNot very cost effective.\nMakeup Brush Mini 4 in 1 Kit for Travel Cosmetic Applicator Foundation Sponges Brushes Valentine's Day Gift, Blending Eyeshadow Concealer Eyeliner Eyebrow\nSeencool\n{'Brand': 'Seencool', 'Recommended Uses For Product': 'Face Makeup', 'Color': 'Golden', 'Material': 'Latex', 'Skin Type': 'Sensitive', 'Item Form': 'Wand', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '5.2 x 1.6 x 1.1 inches; 1.59 Ounces', 'UPC': '783710114471'}\nI really like this mini brush kit it saves me from having to take all my other brushes because it has all the brushes I need in this easy to pack set so instead of having to take a handful of other brushes I can just throw this in my bag it saves space in my bag and I don't have to hunt for a different brush because it is all right there\nSaves space\nYouluv Under Eye Patches - Collagen Eye Mask Gel\nYOULUV\n{'Product Dimensions': '7 x 3.2 x 1.15 inches; 3.21 Ounces', 'Item model number': 'YL', 'UPC': '790492337899'}\nThese under eye patches don't work very well they don't stay on and honestly they really didn't do anything for my under eyes and when me and my daughter did our facials she said it didn't do anything for hers either so not a very good product\nDoesn't really do anything and doesn't stay on",
  "profile": "**User Summary:**\n\nThe user maintains a strong preference for beauty and makeup tools that prioritize convenience, efficiency, and quality. Their recent interactions suggest an increasingly discerning evaluation of product performance, particularly when items fail to meet high standards in effectiveness and longevity. Despite recently appreciating a compact brush kit, which enhanced their makeup routine, their latest interaction reflects a return to critical feedback after purchasing under eye patches that did not perform as expected.\n\nThe user's rigorous expectations are evident in their low average rating history, emphasizing a desire for tools that not only fulfill their intended purpose but also offer time efficiency and economical value. They continue to seek beauty products that strike a balance between aesthetics and practicality, with a focus on durability and ease of use. \n\nHowever, the recent negative experience with the under eye patches highlights a willingness to reassess products that miss the mark in functionality. Overall, while they remain committed to informed choices in their beauty arsenal, advocating for reliable items that meet their stringent standards, this recent dissatisfaction indicates a continued challenge in finding solutions that align with their needs. The user is open to discovering new improvements but expects significant performance to forge a positive shift in their evaluations.",
  "metrics": {
    "rouge1_f": 0.18863049095607232,
    "rouge2_f": 0.012953367875647671,
    "rougeL_f": 0.07235142118863049,
    "meteor": 0.07317374928936896,
    "bleu1": 0.03378055466598251,
    "bleu2": 0.006770718757673906,
    "bleu3": 0.002751345119233413,
    "bleu4": 0.0009873549470722943,
    "bertscore_precision": 0.2957138419151306,
    "bertscore_recall": 0.36593514680862427,
    "bertscore_f1": 0.32709819078445435
  }
}