{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 2 Pieces Satin Lined Sleep Caps Hair Cover Bonnets Silk Lined Slouchy Beanies Sleeping Caps for Night Sleeping (Royal Blue, Purple,25 cm)\nReview Date: 2021/02/08\nStore: Geyoga\nAverage Rating: 4.1\nProduct Details: {'Package Dimensions': '10.35 x 9.76 x 0.71 inches; 2.08 Ounces'}\nReview Text: These sleep caps work really well if you don't want your hair to get messed up while you sleep. I am so glad that now I can put my hair in a braid and it doesn't get messed up at all while I sleep\nReview Title: Keeps hair looking good\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Makeup Brush Cleaner Sponge for Quick Color Removal – Remove Shadow Color from Makeup Brushes\nZenda Naturals\n{'Brand': 'Zenda Naturals', 'Skin Type': 'All', 'Item Form': 'Wand', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.9 x 2.7 x 1.1 inches; 0.63 Ounces', 'UPC': '850772008236'}\nThe brush cleaner is great for the first couple of days then you clean it and it only works for a day then it needs to be cleaned again\nNeed to wash frequently\nDouble-Ended Professional Foundation &Contour Makeup Blending Brush | Soft Bristles Highlighting makeup brush |Travel makeup brush | Eco-Friendly & Cruelty-free| Powder setting brush\nEVE'S\n{'Brand': \"EVE'S\", 'Recommended Uses For Product': 'Contour, For Foundation, For Highlighting', 'Material': 'Wood', 'Item Form': 'Wand', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Handle Material': 'Wood', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 3.7 x 1.34 inches; 2.12 Ounces', 'UPC': '782290927471'}\nThis brush is very soft but it doesn't work as well as I expected it to.\nSoft brush\nNude Gel Polish 6 Colors Gel Nail Polish Set with Gift Box, Soak Off UV LED Gel Polish Kit\nFULLSEXY\n{'Brand': 'FULLSEXY', 'Item Form': 'Gel', 'Type': 'gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1.62 Fl Oz', 'Number of Items': '6', 'Package Dimensions': '7.4 x 3 x 1 inches; 8.01 Ounces'}\nI was kind of disappointed in this purchase the polishes aren't very pigmented so I had to do 4 coats to get it to really show the way I wanted it to and having to do that many coats uses up a LOT of the product so it isn't very cost effective not to mention very time consuming because after each coat you have to cure them under the lamp so it takes up a lot of your time\nNot very cost effective.\nMakeup Brush Mini 4 in 1 Kit for Travel Cosmetic Applicator Foundation Sponges Brushes Valentine's Day Gift, Blending Eyeshadow Concealer Eyeliner Eyebrow\nSeencool\n{'Brand': 'Seencool', 'Recommended Uses For Product': 'Face Makeup', 'Color': 'Golden', 'Material': 'Latex', 'Skin Type': 'Sensitive', 'Item Form': 'Wand', 'Number of Pieces': '1', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '5.2 x 1.6 x 1.1 inches; 1.59 Ounces', 'UPC': '783710114471'}\nI really like this mini brush kit it saves me from having to take all my other brushes because it has all the brushes I need in this easy to pack set so instead of having to take a handful of other brushes I can just throw this in my bag it saves space in my bag and I don't have to hunt for a different brush because it is all right there\nSaves space\nYouluv Under Eye Patches - Collagen Eye Mask Gel\nYOULUV\n{'Product Dimensions': '7 x 3.2 x 1.15 inches; 3.21 Ounces', 'Item model number': 'YL', 'UPC': '790492337899'}\nThese under eye patches don't work very well they don't stay on and honestly they really didn't do anything for my under eyes and when me and my daughter did our facials she said it didn't do anything for hers either so not a very good product\nDoesn't really do anything and doesn't stay on\nShower caps reusable for women's, waterproof turban shower caps, suitable for shower ，long hair shower cap & jumbo braid hair cap\nSHAWNTOO\n{'Brand': 'SHAWNTOO', 'Material': 'Polyester', 'Number of Items': '1', 'Item Dimensions LxWxH': '6.69 x 3.54 x 0.71 inches', 'Inner Material': 'EVA foam', 'Product Dimensions': '6.69 x 3.54 x 0.71 inches; 4.8 Ounces'}\nVery disappointed in shower cap i tried it out because I had just had my hair done and had to go out so didn't want it messed up and it ended up getting messed up anyway because the cap isn't completely waterproof it leaked and ruined my hair I was really hopeful it would work because of how tight it was and it wasn't very stretchy so I thought they made it that way to prevent leaking but obviously that wasn't the case so it leaked plus it wasn't very comfortable\nit leaks\n2 Pieces Satin Lined Sleep Caps Hair Cover Bonnets Silk Lined Slouchy Beanies Sleeping Caps for Night Sleeping (Royal Blue, Purple,25 cm)\nGeyoga\n{'Package Dimensions': '10.35 x 9.76 x 0.71 inches; 2.08 Ounces'}\nThese sleep caps work really well if you don't want your hair to get messed up while you sleep. I am so glad that now I can put my hair in a braid and it doesn't get messed up at all while I sleep\nKeeps hair looking good",
  "profile": "**User Summary:**\n\nThe user has a strong preference for beauty and makeup tools that emphasize convenience, efficiency, and quality. Their recent interactions reveal a discerning evaluation of product performance, often expressing disappointment when items fail to meet their high standards for effectiveness and longevity. After initially appreciating a compact brush kit, they have encountered challenges with various products, including a shower cap that was ineffective and uncomfortable.\n\nHowever, their latest experience with satin-lined sleep caps indicates a positive shift in their search for reliable beauty tools. They found these caps effective in keeping their hair intact overnight, illustrating their ongoing commitment to discovering high-performing items that meet their rigorous expectations. This recent positive review suggests a potential for improved evaluations as the user continues to seek products that balance aesthetics with practicality.\n\nThe user’s critical feedback pattern emphasizes their desire for items that fulfill their intended purpose while also offering time efficiency and economical value. While they remain open to exploring new improvements, they expect significant enhancements in product performance to influence future assessments positively. Overall, the user maintains a focus on durability, ease of use, and effectiveness, representing a meticulous approach to their beauty routine.",
  "metrics": {
    "rouge1_f": 0.15430267062314537,
    "rouge2_f": 0.009910802775024777,
    "rougeL_f": 0.06528189910979228,
    "meteor": 0.05361648444070647,
    "bleu1": 0.009325679130051487,
    "bleu2": 0.0021302799471426353,
    "bleu3": 0.0003813461638195127,
    "bleu4": 0.00016152915026814953,
    "bertscore_precision": 0.31820112466812134,
    "bertscore_recall": 0.4243314862251282,
    "bertscore_f1": 0.36368170380592346
  }
}