{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Wizard of Oz [Blu-ray]\nReview Date: 2017/09/16\nStore: Victor Fleming  (Director),     Judy Garland  (Actor),     Frank Morgan  (Actor)    &                   0                  more   Rated:    G    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Product Description', 'The magic of M-G-M’s wonderfully colorful and unique fantasy has melted hearts for more than seven decades with its indelible melodies and transcendent themes of family, home and the courage to pursue dreams. To celebrate the beloved movie’s 75th anniversary, Warner Bros. Home Entertainment is re-releasing The Wizard of Oz on Blu-ray.Adapted from L. Frank Baum’s timeless children’s tale about a Kansas girl’s journey over the rainbow, The Wizard of Oz starred Judy Garland as Dorothy, Ray Bolger as the Scarecrow; Bert Lahr as the Cowardly Lion; Jack Haley as the Tin Woodman and Margaret Hamilton as the Wicked Witch. The Wizard of Oz received five Academy Award nominations[1], including Best Picture (Outstanding Production), and captured two Oscars -- Best Song (“Over the Rainbow”) and Best Original Score -- plus a special award for Outstanding Juvenile Performance by Ms. Garland.', 'Review', 'The blend of old-fashioned, classic storytelling with cutting-edge technology is undeniably enthralling. --USA Today, Claudia PuigKnowing that it was made without a single computer, and entirely by human ingenuity, makes it all the more worthy of marveling at, 75 years and an added dimension later. --Toronto Star, Peter HowellThe greatest American movie fantasy. --Orange County Register, Michael Sragow']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Musicals, Action & Adventure', 'Format': 'Blu-ray, NTSC, Full length', 'Contributor': 'Bert Lahr, Judy Garland, Billie Burke, Mervyn LeRoy, L. Frank Baum, Florence Ryerson, Frank Morgan, Jack Haley, Ray Bolger, Victor Fleming, Margaret Hamilton, Charley Grapewin, Pat Walshe, Arthur Freed, Noel Langley, Edgar Allan WoolfBert Lahr, Judy Garland, Billie Burke, Mervyn LeRoy, L. Frank Baum, Florence Ryerson, Frank Morgan, Jack Haley, Ray Bolger, Victor Fleming, Margaret Hamilton, Charley Grapewin, Pat Walshe, Arthur Freed, Noel Langley, Edgar Allan Woolf  See more', 'Initial release date': '2013-10-01', 'Language': 'English', 'Aspect Ratio': '1.37:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '770136', 'Director': 'Victor Fleming', 'Media Format': 'Blu-ray, NTSC, Full length', 'Run time': '1 hour and 41 minutes', 'Release date': 'October 1, 2013', 'Actors': 'Judy Garland, Frank Morgan, Ray Bolger, Bert Lahr, Jack Haley', 'Producers': 'Mervyn LeRoy, Arthur Freed', 'Studio': 'Studio Distribution Services', 'Writers': 'Noel Langley, Florence Ryerson, Edgar Allan Woolf, L. Frank Baum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: All cleaned up, you can see the forest around the monkeys. Amazing detail.\nReview Title: Much better than the TV version you remember.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Meowingtons Hax 2K11\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Meowingtons Hax 2k11 TORONTO,', 'filmed during the final stop of deadmau5 record-breaking Meowingtons Hax Tour takes you into the heart of the action with one of electronic music s biggest stars! Experience deadmau5 like never before, packing Toronto s Rogers Centre with nearly 20,000 screaming fans!Full of record breaking performances, deadmau5 Meowingtons Hax Tour made historic stops at Lollapalooza (where he co-headlined with Foo Fighters), NYC s Roseland Ballroom (where he played 6 consecutive sold out nights) and LA s Hollywood Palladium (where he played 4 consecutive sold out nights).', 'Meowingtons Hax 2k11 TORONTO,', 'brings you mind-blowing visuals, some of his biggest hits, live performances, and previously unreleased tracks.', 'Review', \"The level of spectacle that the Canadian electronic musician/producer commands is not just beyond any other electronic act, it's beyond any other act period\", 'Meowingtons Hax 2k11 TORONTO,', 'brings you mind-blowing visuals, some of his biggest hits, live performances, and previously unreleased tracks. --Spin']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5 x 5.53 x 0.44 inches; 4.8 Ounces', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'March 19, 2013', 'Actors': 'deadmau5', 'Studio': 'Ultra Records', 'Number of discs': '1'}\nI saw this on Netflix and wanted it right away. It looks and sounds even better on DVD. Nice live vocals and overall a collection of his better stuff. The visuals are stunning and the crows is crazy huge. Maybe 20,000?\nGood video and sound production.\nLight of Day [VHS]\nMichael J. Fox  (Actor),     Gena Rowlands  (Actor),     Paul Schrader  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['vhs tape.']\n{'Format': 'Color, Subtitled, Closed-captioned, Digital Sound, NTSC', 'Contributor': 'Cherry Jones, Thomas G. Waites, Gena Rowlands, Paul Schrader, Rob Cohen, Alan Poul, Paul J. Harkins, Doug Claybourne, Jacqueline Cambas, Michael J. Fox, Joan Jett, Michael McKean, Jerry Gideon, Michael Dolan, Tom Irwin, John Bailey, Jason Miller, Keith Barish, Billy L. SullivanCherry Jones, Thomas G. Waites, Gena Rowlands, Paul Schrader, Rob Cohen, Alan Poul, Paul J. Harkins, Doug Claybourne, Jacqueline Cambas, Michael J. Fox, Joan Jett, Michael McKean, Jerry Gideon, Michael Dolan, Tom Irwin, John Bailey, Jason Miller, Keith Barish, Bill…  See more', 'Runtime': '1 hour and 47 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Paul Schrader', 'Run time': '1 hour and 47 minutes', 'Release date': 'September 13, 1989', 'Date First Available': 'September 29, 2006', 'Actors': 'Michael J. Fox, Gena Rowlands, Joan Jett, Michael McKean, Thomas G. Waites', 'Studio': 'Lions Gate', 'Producers': 'Alan Poul, Doug Claybourne, Keith Barish, Rob Cohen', 'Writers': 'Paul Schrader'}\nLove this movie.\nHappy\nThe Night Porter (The Criterion Collection) [Blu-ray]\nDirk Bogarde  (Actor),     Charlotte Rampling  (Actor),     Liliana Cavani  (Director)    &                   0                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"In this unsettling drama from Italian filmmaker Liliana Cavani (RIPLEY'S GAME), a concentration camp survivor (SWIMMING POOL's Charlotte Rampling) discovers her former torturer and lover (DEATH IN VENICE's Dirk Bogarde) working as a porter at a hotel in postwar Vienna. When the couple attempt to re-create their sadomasochistic relationship, his former SS comrades begin to stalk them. Operatic and disturbing, THE NIGHT PORTER deftly examines the lasting social and psychological effects of the Nazi regime.\"]\n{'Genre': 'Drama', 'Format': 'Blu-ray', 'Contributor': 'Charlotte Rampling, Liliana Cavani, Dirk Bogarde', 'Language': 'English', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '2421', 'Director': 'Liliana Cavani', 'Media Format': 'Blu-ray', 'Run time': '1 hour and 58 minutes', 'Release date': 'December 9, 2014', 'Actors': 'Dirk Bogarde, Charlotte Rampling', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSick little  film.\nTittilating\nThe Hidden\nKyle MacLachlan  (Actor),     Michael Nouri  (Actor),     Jack Sholder  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Alien Invasion\n[\"There's a power-mad space slug slithering among (and through) the innocent citizens of L.A., and it's up to a hardboiled cop and a detective from way up north to stop it in this wonderfully straight-faced sci-fi action flick. The basic plot may be nothi\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Director': 'Jack Sholder', 'Media Format': 'Full Screen, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 38 minutes', 'Release date': 'June 1, 2004', 'Actors': 'Kyle MacLachlan, Michael Nouri, Claudia Christian, Clarence Felder, Clu Gulager', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Mono)', 'Studio': 'New Line Home Video', 'Number of discs': '1'}\nLove this movie. Unpredictable and fun.\nSci fi and car frieks\nLimey, The\nTerence Stamp  (Actor),     Lesley Ann Warren  (Actor),     Steven Soderbergh  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, Top Sellers\n['Product Description', \"Wilson, a tough English ex-con who travels to Los Angeles to avenge his daughter's death. Upon arrival, Wilson goes to task battling an army of L.A.'s toughest criminals in the hopes of piecing together the events leading to her murder. As he survives a near-deadly beating, getting thrown out of a building and being chased down a dangerous mountain road, Wilson retaliates by doling out some bodily harm of his own. Before his trip is over, all of Los Angeles will know The Limey is in town.\", 'Amazon.com', \"Steven Soderbergh's follow-up to his sexy thriller\", 'Out of Sight', \"is an equally stylish but far more austere crime drama, a work of memory that mixes flashbacks, flashforwards, and ruminations on the present into an invigorating cinematic quilt. Terence Stamp is Wilson, an aging cockney criminal fresh out of prison who flies to Los Angeles to search for his daughter's killer. She died in a car wreck, but he suspects that her lover, a music industry mogul named Valentine (Peter Fonda), knows more than he's telling. Wilson is a fish out of water indeed, a cool, cruel London thug on the airy, sun-bright street of L.A., a silver-haired criminal taking on street punks and hit men with the relentless drive of a man possessed. It's like\", 'Get Carter', 'channeled through', 'Point Blank', ', a hard-edged revenge thriller steeped in sorrow and regret, trading the warmth of', 'Out of Sight', '\\'s romantic heat for a more contemplative remove. Fonda beautifully plays off his cinematic history of 1960s hippies and rebels as a nervous, cowardly millionaire sellout in white cotton peasant shirts and a deep California tan. Luiz Guzman and Lesley Ann Warren costar as Wilson\\'s \"adopted\" guides through modern L.A., and Barry Newman is excellent as Valentine\\'s tough, terse head of security, another aging pro blindsided by Wilson\\'s relentless single-mindedness. Soderbergh quotes from Ken Loach\\'s 1967 film', 'Poor Cow', \"(sadly not available on video in the U.S.) for Wilson's flashbacks as a fresh-faced teenage thug.\", '--Sean Axmaker']\n{'Genre': 'Action', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Closed-captioned, Widescreen', 'Contributor': 'Steve Heinze, Joe Dallesandro, Nicky Katt, Ousaun Elam, Nancy Lenehan, William Lucking, Wayne Pére, John Cothran Jr., Carl Ciarfalio, Peter Fonda, Melissa George, Terence Stamp, Amelia Heinle, Matthew Kimbrough, Barry Newman, Steven Soderbergh, Luis Guzmán, Lesley Ann WarrenSteve Heinze, Joe Dallesandro, Nicky Katt, Ousaun Elam, Nancy Lenehan, William Lucking, Wayne Pére, John Cothran Jr., Carl Ciarfalio, Peter Fonda, Melissa George, Terence Stamp, Amelia Heinle, Matthew Kimbrough, Barry Newman, Steven Soderbergh, Luis Guzmán, Les…   See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 29 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'LGT60750DVD', 'Director': 'Steven Soderbergh', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Closed-captioned, Widescreen', 'Run time': '1 hour and 29 minutes', 'Release date': 'March 14, 2000', 'Actors': 'Terence Stamp, Lesley Ann Warren, Luis Guzmán, Barry Newman, Joe Dallesandro', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Artisan', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSubtle and driving drama. A masterpiece for Stamp.\nA gem\nRevolver [Blu-ray]\nJason Statham  (Actor),     Ray Liotta  (Actor),     Guy Ritchie  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n[\"REVOLVER is populated with Guy Ritchie's (Snatch; Lock, Stock & Two Smoking Barrels) classic breed of fast-talking, sharp-suited gangsters but with a psychological twist that your mind may not be able to handle. Jason Statham(The Transporter and Transporter 2) is Jake Green, a grifter who vows revenge against Macha (Ray Liotta, Goodfellas), the ferocious crime boss who sent him to prison. After taking Macha down in a game of chance, Macha puts out a hit on Jake. Now, caught between a gun and a hard place, Jake finds himself protected by two vicious loan sharks (Vincent Pastore and Andre Benjamin) who make him an offer he can't refuse.\"]\n{'Genre': 'Action, Thriller, Crime', 'Format': 'AC-3, Blu-ray, Color, Dubbed, NTSC, Dolby, Subtitled, Widescreen', 'Contributor': 'Guy Ritchie, Virginie Silla, Vincent Pastore, Ray Liotta, EuropaCorp; Revolver Pictures Co., Andre Benjamin, Jason StathamGuy Ritchie, Virginie Silla, Vincent Pastore, Ray Liotta, EuropaCorp; Revolver Pictures Co., Andre Benjamin, Jason Statham   See more', 'Language': 'English, French', 'Runtime': '1 hour and 44 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.75 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '1201', 'Director': 'Guy Ritchie', 'Media Format': 'AC-3, Blu-ray, Color, Dubbed, NTSC, Dolby, Subtitled, Widescreen', 'Run time': '1 hour and 44 minutes', 'Release date': 'November 18, 2008', 'Actors': 'Jason Statham, Ray Liotta, Vincent Pastore, Andre Benjamin', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, French', 'Producers': 'Virginie Silla', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\na masterpiece. I love the shooting scene in the house\na must own\nNeighbors (1981)\nDan Aykroyd  (Actor),     John Belushi  (Actor),     John G. Avildsen  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Earl Keese (John Belushi, Animal House) is a slightly overweight, fairly average guy who is approaching middle age. He leads a reasonably comfortable life with his family in their suburban home. . . until the house next door is bought by a truly odd couple, Vic (Dan Aykroyd, Ghostbusters) and Ramona (Cathy Moriarty, Raging Bull), who quickly proceed to drive Earl crazy. Vic's lunatic behavior has Earl running in circles while Ramona's coarse seductiveness leaves him panting. In short, Earl's tranquil life is suddenly turned upside down. If it's laughs you want, these are the neighbors to look in on. John G. Avildsen (The Karate Kid, 1984, For Keeps?) directs a dream comedy cast (including SNL regular Tim Kazurinsky) from a screenplay by the one and only Larry Gelbart (Tootsie, The Wrong Box). Newly remastered.\"]\n{'Genre': 'Comedy', 'Format': 'NTSC', 'Contributor': 'David Brown, John G. Avildsen, Dan Aykroyd, John Belushi, Richard D. Zanuck', 'Runtime': '1 hour and 20 minutes', 'Studio': 'SPE', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'John G. Avildsen', 'Media Format': 'NTSC', 'Run time': '1 hour and 20 minutes', 'Release date': 'September 6, 2011', 'Actors': 'Dan Aykroyd, John Belushi', 'Producers': 'David Brown, Richard D. Zanuck', 'Country of Origin': 'USA', 'Number of discs': '1'}\nlost classic. Dan is the nut and Jim is the straight man.\ni waited forever for this\nDisney 4-Movie Collection: Herbie (Love Bug / Herbie Goes Bananas / Herbie Goes To Monte Carlo / Herbie Rides Again)\nJames Cameron  (Director)    Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Get revved up and ready to enjoy four timeless HERBIE films in one collectible DVD set. The whole family will adore these hilarious comedy classics, loaded with laughs and packed with pedal-to-the-metal fun. Herbie is a lovable car with a mind of his own. Fasten your seat belts as you experience the exciting adventures and nonstop action of THE LOVE BUG, HERBIE RIDES AGAIN, HERBIE GOES TO MONTE CARLO and HERBIE GOES BANANAS. Join legendary Hollywood stars Dean Jones, Don Knotts, Helen Hayes and more in four different high-octane movies about one incredible car who always comes through in the clutch!']\n{'Genre': 'Kids & Family, Comedy', 'Format': 'Multiple Formats, NTSC, Box set', 'Contributor': 'James Cameron', 'Language': 'English', 'Runtime': '6 hours and 43 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '0078693682844', 'Director': 'James Cameron', 'Media Format': 'Multiple Formats, NTSC, Box set', 'Run time': '6 hours and 43 minutes', 'Release date': 'September 2, 2012', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Country of Origin': 'USA', 'Number of discs': '4'}\nmy favorite car\nLove Herbie\nHigh Spirits [DVD]\nPeter O'Toole  (Actor),     Daryl Hannah  (Actor),     Neil Jordan  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', \"Daryl Hannah, Peter O'Toole and Steve Guttenberg star in this gleefully ghoulish comedy sparkling with romance and rollicking with supernatural special effects. Written and directed by Neil Jordan (Interview With the Vampire) and co-starring Beverly D'Angelo, Jennifer Tilly, Peter Gallagher and Liam Neeson, High Spirits is the most fun you'll have in this world or the next!Impoverished Peter Plunkett (O'Toole) hatches the perfect plan to save his debt-ridden Irish castle: lure American tourists by advertising the place as haunted. But when Peter and his staff don sheets and chains to go a-haunting, they scare up more than paying guests'they arouse the real ghosts of Castle Plunkett! And when American tourist Jack (Guttenberg) spies a gorgeous ghost named Mary (Hannah), it's love at first sighting. Now all Jack has to worry about is Mary's murderous spook of a husband and their 200-year age difference!\", 'Amazon.com', \"Peter O'Toole (\", 'Lawrence of Arabia', ',', 'My Favorite Year', ') gives an exuberant performance in', 'High Spirits', \". Peter Plunkett (O'Toole) hopes to save his mortgaged castle by turning it into a tourist attraction--the most haunted castle in Ireland. When American tourists arrive--among them Jack (Steve Guttenberg) and Sharon (Beverly D'Angelo), a couple whose marriage is rapidly disintegrating--Plunkett's tomfoolery arouses the real ghosts, who decide to give these interlopers everything they're asking for. But when Jack accidentally helps a beautiful ghost named Mary (Daryl Hannah), she decides he's the man to help her break the curse she's been suffering for 200 years.\", 'High Spirits', 'is an odd foray into comedy by director Neil Jordan (', 'The Crying Game', ',', 'Interview with the Vampire', \"). The special effects are clumsy, but the strong supporting cast includes Jennifer Tilly, Peter Gallagher, and Liam Neeson as Mary's murderous 200-year-old husband.\", '--Bret Fetzer']\n{'Genre': 'Romance, Comedy', 'Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Contributor': \"Steve Guttenberg, Liz Smith, Beverly D'Angelo, Hilary Reynolds, Tony Rohr, Daryl Hannah, Peter O'Toole, Mary Coughlan, Donal McCann, Neil Jordan, Tom Hickey, Isolde Cazelet, Little JohnSteve Guttenberg, Liz Smith, Beverly D'Angelo, Hilary Reynolds, Tony Rohr, Daryl Hannah, Peter O'Toole, Mary Coughlan, Donal McCann, Neil Jordan, Tom Hickey, Isolde Cazelet, Little John   See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), Unqualified', 'Runtime': '1 hour and 39 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 7.2 Ounces', 'Director': 'Neil Jordan', 'Media Format': 'Anamorphic, Closed-captioned, Color, Dolby, DVD, Full Screen, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 39 minutes', 'Release date': 'June 4, 2002', 'Actors': \"Peter O'Toole, Daryl Hannah, Steve Guttenberg, Donal McCann, Mary Coughlan\", 'Subtitles': 'English, Spanish, French', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Neil Jordan', 'Number of discs': '1'}\neveryone should see this movie. great story, great cast. c'mon, it;s peter o'toole\nmust see\nSleuth - Laurence Olivier, Michael Caine\nLaurence Olivier, Michael Caine, Alec Cawthorne  (Actor),     Joseph L. Mankiewicz  (Director)    Format: DVD\nMovies & TV, Featured Categories, DVD\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Joseph L. Mankiewicz', 'Run time': '2 hours and 18 minutes', 'Actors': 'Laurence Olivier, Michael Caine, Alec Cawthorne', 'Subtitles': 'English', 'Language': 'Unqualified (Dolby Digital 2.0), Unqualified (Dolby Digital 5.1)', 'Number of discs': '1'}\nThis is a masterpiece of film production. What is better than Olivier and Caine?\nI waited 35 years for this DVD\nNo Country for Old Men\nTommy Lee Jones  (Actor),     Javier Bardem  (Actor),     Ethan Coen  (Director, Producer),     Joel Coen  (Director, Producer)    &                   1                  more   Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Acclaimed filmmakers Joel and Ethan Coen deliver their most gripping and ambitious film yet in this sizzling and supercharged action- thriller. When a man stumbles on a bloody crime scene, a pickup truck loaded with heroin, and two million dollars in irresistible cash, his decision to take the money sets off an unstoppable chain reaction of violence. Not even west Texas law can contain it. Based on the novel by Pulitzer Prize-winning author Cormac McCarthy, and featuring an acclaimed cast led by Tommy Lee Jones, this gritty game of cat and mouse will take you to the edge of your seat and beyond right up to its heart-stopping final act.']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 2.4 Ounces', 'Item model number': '31398134848', 'Director': 'Ethan Coen, Joel Coen', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, DTS Surround Sound, NTSC, Closed-captioned, Widescreen, Digital_copy, Ultraviolet', 'Run time': '2 hours and 2 minutes', 'Release date': 'April 26, 2011', 'Actors': 'Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harrelson, Kelly MacDonald', 'Subtitles': 'Italian, Spanish, Norwegian', 'Producers': 'Vince McMahon, Joel Coen, Scott Rudin, Ethan Coen', 'Studio': 'Lionsgate', 'Number of discs': '1'}\non my shelf of the greats\nmust have\nThe Awakening Land (Tv Mini-Series)\nElizabeth Montgomery  (Actor),     Hal Holbrook  (Actor),     Boris Sagal  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Unschooled homesteader Sayward Luckett couldn't read her name if you showed it to her, yet she fell in love with and married agnostic, book-learned frontier lawyer Portius Wheeler. Now it's time to make a life with him in wild, wooded 1790s Ohio Territory. There will be children, seven in all; joy and hardships aplenty; inconstancies of heart; and the enduring legacy of settling a new land. Based on Conrad Richter's trilogy of novels (he received a Pulitzer Prize for the third), this miniseries nominated for 6 Emmy Awards celebrates the pioneering spirit as it chronicles Sayward's heroic, unadorned life. Elizabeth Montgomery and Hal Holbrook (earning two of those six Emmy nominations) lead a strong cast that includes Jane Seymour and W.H. Macy (his first screen credit).\"]\n{'Genre': 'Drama/Television, Television/Miniseries', 'Format': 'NTSC, Widescreen', 'Contributor': 'Jane Seymour, Hal Holbrook, Elizabeth Montgomery, Louise Latham, Boris Sagal, Steven Keats', 'Language': 'Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Item model number': '4720', 'Director': 'Boris Sagal', 'Media Format': 'NTSC, Widescreen', 'Run time': '5 hours and 33 minutes', 'Release date': 'April 23, 2010', 'Actors': 'Elizabeth Montgomery, Hal Holbrook, Jane Seymour, Steven Keats, Louise Latham', 'Studio': 'WBTV', 'Number of discs': '3'}\na real look into early pioneer life.\nlove it\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Joel Coen'], 'Producers': ['Ethan Coen'], 'Starring': ['Nicolas Cage', 'Holly Hunter', 'Trey Wilson']}\nBest Cage movie ever.\nMust see\nJack Nicholson Triple Feature (Carnal Knowledge / The Missouri Breaks / Prizzi's Honor)\nFormat: DVD\nMovies & TV, Movies\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'DVD'}\nClassic Jack, hard to find movies.\nA fan must.\nThe Wizard of Oz [Blu-ray]\nVictor Fleming  (Director),     Judy Garland  (Actor),     Frank Morgan  (Actor)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'The magic of M-G-M’s wonderfully colorful and unique fantasy has melted hearts for more than seven decades with its indelible melodies and transcendent themes of family, home and the courage to pursue dreams. To celebrate the beloved movie’s 75th anniversary, Warner Bros. Home Entertainment is re-releasing The Wizard of Oz on Blu-ray.Adapted from L. Frank Baum’s timeless children’s tale about a Kansas girl’s journey over the rainbow, The Wizard of Oz starred Judy Garland as Dorothy, Ray Bolger as the Scarecrow; Bert Lahr as the Cowardly Lion; Jack Haley as the Tin Woodman and Margaret Hamilton as the Wicked Witch. The Wizard of Oz received five Academy Award nominations[1], including Best Picture (Outstanding Production), and captured two Oscars -- Best Song (“Over the Rainbow”) and Best Original Score -- plus a special award for Outstanding Juvenile Performance by Ms. Garland.', 'Review', 'The blend of old-fashioned, classic storytelling with cutting-edge technology is undeniably enthralling. --USA Today, Claudia PuigKnowing that it was made without a single computer, and entirely by human ingenuity, makes it all the more worthy of marveling at, 75 years and an added dimension later. --Toronto Star, Peter HowellThe greatest American movie fantasy. --Orange County Register, Michael Sragow']\n{'Genre': 'Musicals, Action & Adventure', 'Format': 'Blu-ray, NTSC, Full length', 'Contributor': 'Bert Lahr, Judy Garland, Billie Burke, Mervyn LeRoy, L. Frank Baum, Florence Ryerson, Frank Morgan, Jack Haley, Ray Bolger, Victor Fleming, Margaret Hamilton, Charley Grapewin, Pat Walshe, Arthur Freed, Noel Langley, Edgar Allan WoolfBert Lahr, Judy Garland, Billie Burke, Mervyn LeRoy, L. Frank Baum, Florence Ryerson, Frank Morgan, Jack Haley, Ray Bolger, Victor Fleming, Margaret Hamilton, Charley Grapewin, Pat Walshe, Arthur Freed, Noel Langley, Edgar Allan Woolf  See more', 'Initial release date': '2013-10-01', 'Language': 'English', 'Aspect Ratio': '1.37:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '770136', 'Director': 'Victor Fleming', 'Media Format': 'Blu-ray, NTSC, Full length', 'Run time': '1 hour and 41 minutes', 'Release date': 'October 1, 2013', 'Actors': 'Judy Garland, Frank Morgan, Ray Bolger, Bert Lahr, Jack Haley', 'Producers': 'Mervyn LeRoy, Arthur Freed', 'Studio': 'Studio Distribution Services', 'Writers': 'Noel Langley, Florence Ryerson, Edgar Allan Woolf, L. Frank Baum', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAll cleaned up, you can see the forest around the monkeys. Amazing detail.\nMuch better than the TV version you remember.",
  "profile": "**Updated User Profile Summary:**\n\n- **Music & Film Enthusiast:** Passionate about electronic music and live performances, with a strong appreciation for soundtracks that enhance cinematic experiences.\n\n- **Visual & Audio Quality Focus:** Prioritizes stunning visuals and superior audio, favoring physical formats like Blu-ray for optimal viewing.\n\n- **Classic Film Appreciation:** Holds a significant admiration for classic cinema, especially iconic works featuring celebrated performers, showcasing a deep interest in timeless films.\n\n- **Comedic & Romantic Film Appreciation:** Enjoys lighthearted comedies and romantic narratives alongside classic films that delve into complex themes, balancing entertainment with thought-provoking content.\n\n- **Preference for Character-Driven Stories:** Inclined toward dramas exploring deep emotional landscapes and historical themes, favoring narratives that provide insights into the human experience.\n\n- **Live Experience Advocate:** Thrives on large-scale events and immersive experiences, seeking shared moments in both music and film.\n\n- **Positive & Enthusiastic Attitude:** Maintains an optimistic outlook, often providing high ratings and positive reviews, particularly highlighting emotional and historical depth.\n\n- **Eclectic Genre Interests:** Enjoys a diverse range of genres, including musicals and adventure, with a keen interest in emotionally impactful storytelling.\n\n- **Emphasis on Critically Acclaimed Performers:** Respects works by renowned directors and actors, favoring films that deliver strong performances.\n\n- **Appreciation for Quality Content:** Regularly expresses high regard for top-tier films that showcase profound narratives intertwined with humor and emotional resonance.",
  "metrics": {
    "rouge1_f": 0.051878787878787885,
    "rouge2_f": 0.003880669415474169,
    "rougeL_f": 0.026666666666666665,
    "meteor": 0.015560872186886076,
    "bleu1": 6.152578000163513e-09,
    "bleu2": 1.8333396862217234e-09,
    "bleu3": 5.690143053255117e-10,
    "bleu4": 1.7841372521850904e-10,
    "bertscore_precision": 0.35443517565727234,
    "bertscore_recall": 0.5019862055778503,
    "bertscore_f1": 0.41550007462501526
  }
}