{
  "user_id": "AFSQYNVKFMP3WWNXTFTNBFNU3EOA",
  "summary": "=== Purchase Information ===\nProduct Title: 96 Pieces Glossy False Nails Oval Rhinestone Full Cover False Nails Pink Color Changing Gradient Short Artificial Nail Tips with 4 Pieces Nail Glue for Women Girls Nail DIY Decorations\nReview Date: 2020/07/18\nStore: BBTO\nAverage Rating: 3.2\nProduct Details: {'Material': 'Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'BBTO', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Number of Pieces': '4, 96', 'Package Dimensions': '11.5 x 7.32 x 0.5 inches; 1.59 Ounces'}\nReview Text: You get what you pay for. The nails are pretty thin and that’s only alright for the short length, not medium which these are. There is only enough nails in each set for me to get both hands once. The others are wasted. I put the gradient color on first as it was the least trouble for this mommy of 4. All the others would REQUIRE a clear top coat. Jus touching the gold glitter n it started coming off. This gradient color could use a top coat to help it last longer but it’s fine. And before asking, I didnt bother trying the nail glue it comes with. If the nails aren’t great I wouldn’t trust the glue. For my regular fake nails I will stick with my short rounded French tips that are thicker and more durable than these. If I want something with color for a night or 2, I might put one of the others on. While I probably won’t buy these ever again they aren’t bad, jus not that good either to waste more of my money for another batch.<br />Edited review update: last pic is of my broken nail. It lasted 5 hours. Then I trimmed all my nails down n 5 more nails went the following day. There is no salvaging them either. It all split down the middle n not a small split either. It went almost through n just fell apart. And so I drop my ratings from 3 stars to 1. If I could give 0, I would.\nReview Title: Cheap and that’s the quality too\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DROP THE BOMB Bbosong Sun Stick SPF50+ PA++++ 15g - Oil Free UVA/UVB Protection Sebum Control Skin Smooth Moisturizing Sunblock Stick Balm without Sticky, Primer before Makeup\nReview Date: 2020/08/07\nStore: DROP THE BOMB\nAverage Rating: 3.2\nProduct Details: {'Sun Protection': '50 SPF', 'Item Weight': '15 Grams', 'Unit Count': '1.00 Count', 'Skin Type': 'Sensitive', 'Brand': 'DROP THE BOMB', 'Package Dimensions': '3.5 x 1.7 x 1.1 inches; 0.53 Ounces'}\nReview Text: When they say hypoallergenic, reef friendly, made with vegan ingredients, and calming natural ingredients I think it must be okay to order. But they don’t list their ingredients so I wasn’t sure if I should. And now I know why they don’t. I posted a picture of the ingredients if you would like to look them up yourself. The top half of the ingredients which take up most of what it is made of is made of: polyethylene(man made plastic), a chemical, acrylic or plexiglass, a few man made silicones, and chemical fragrances(some of them are really long words so I just put down the laymans terms.) I stopped looking it up at that point. I’m not putting this on as I’m allergic to a few of the ingredients. Hope this helps.\nReview Title: They don’t list ingredients but I have a picture of it\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nReview Date: 2020/08/25\nStore: Natwag\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nReview Text: I use these with my micellar water for my makeup removal and it works great. It was really easy to hand wash. I love that it comes with its own laundry bag if I choose to throw it in the washer. 18 pack, for the price ($10) is a steal!\nReview Title: So soft and easy to hand wash\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Amtidy Solid Color Vintage Modern Style Elastic Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nReview Date: 2020/09/14\nStore: Amtidy\nAverage Rating: 4.0\nProduct Details: {'Material': 'Rubber', 'Fabric Type': 'Elastic', 'Brand': 'Amtidy', 'Item Form': 'Spiral', 'Unit Count': '10.00 Count', 'Package Dimensions': '11.65 x 5.63 x 3.23 inches; 12.03 Ounces', 'UPC': '782931993780'}\nReview Text: I use these to get my hair out of the way for washing my face, gym time, and just to wear out. Variety of colors make it easy to match to my clothes. Fits my head good and stays on.\nReview Title: Good variety of color\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Biutee Poly Nail Gel Kit 15ml 0.53oz Pink Nail Extension Gel Builder Gel Long Lasting Nail Salon Nail Art Design DIY at Home Beginner Friendly…\nReview Date: 2020/10/07\nStore: Biutee\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '3.5 x 2 x 1.5 inches; 0.81 Ounces'}\nReview Text: This is just the poly gel. In order to use this for long nails you need nail forms, a solution, a container for the solution, and the brush with scrapper, and the UV lamp. Also the base coat and most likely a nail drill and some nails files (not shown in picture). ***Important*** You have to use a gel nail base coat before the poly gel in order for it to stick, otherwise they will pop off. If you don’t have these things, I would suggest you don’t get this for the first time. There are nail kits for that. And lots of YouTube videos to show how to do it. It’s how I learned to do mine. With a full set of long nails, and enough for extra nails and some fills, this one bottle could last for at least a couple months. This is a good amount of product for a reasonable price. $7 for nails for a couple months. And this nice color looks beautiful. It’s hardy nails like acrylic and gel nail polish in one.\nReview Title: Beautiful saloon nails\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Biutee Starry Sky Nail Gel Firework Nail Gel With black Nail Polish Gel 8ml UV LED\nReview Date: 2020/10/14\nStore: Biutee\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Biutee', 'Item Form': 'Gel', 'Type': 'Gel', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '3.5274 Ounce', 'Number of Items': '2', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '4.92 x 3.31 x 1.77 inches; 4.59 Ounces'}\nReview Text: This is a complete set, not a full kit. There is a big difference. Saying that this is everything you need to make the nails if you have everything else. That means you already have the UV lamp, the base and top coat, and the solution and brush kit. From my experience, this kit is not for beginners. The glitter set aka starry sky set is messy and requires a lot of filing similar to biutees cat eye set. By hand, but filing with a nail drill is better. I was trying different looks to see if I can make some awesome looking Halloween (witchy) looking nails. This set alone is not it though. I might try experimenting with mixing this with biutees poly gels that might make it better and more manageable.\nReview Title: Complete set not for beginners\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Glitter Poly Nail Gel Extensions Builder Gel UV/LED Soak Off Acrylic Fashion Gel Polish Set for Nails Beginner DIY Nail Art at Home 8 colors-15g (Pink series)\nReview Date: 2020/11/10\nStore: MIZHSE\nAverage Rating: 4.2\nProduct Details: {'Brand': 'MIZHSE', 'Item Form': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '478.00 Count', 'Number of Items': '9', 'Package Dimensions': '9.76 x 4.88 x 1.42 inches; 12.8 Ounces'}\nReview Text: First picture is the after, after a lot of work. Don’t let it fool you. Second picture is to just show that this white is really an off white, milky white. Third picture is 2 days later where 2 popped off. The next day the ring finger one broke in half. 🤦🏻‍♀️ This is my 7th set(of different sets and brands of polygel trying to find the best). Not my first rodeo. I know what I’m doing with polygels. Am I a professional? Nope. Just a mom doing my own nails at home. I love polygels as it gives me beautiful salon nails from home and can stand the abuse a regular mom can put it through (like cleaning and washing dishes without gloves,etc).<br /> I tried 4 different colors. They gave me an insight about the quality of this set. You only see 3 colors in the first pic, I know. But that’s because the clear is what I originally tried ( I really did try) to put on my middle finger instead of one of the glitters. Putting this set in the forms(I don’t use the forms from this set as I don’t like them), using solution to spread it in the forms was like any other polygel I’ve used. It’s when I turned it over and put it on my nails did something different happen. It basically started to ooze out of the forms way more than normal,it was getting messy. Putting it under the uv lamp to set it quickly. But as it was setting under the lamp the nails were falling a bit and setting that way. But it was the “clear” color that was the worst of the bunch. Oozed out so fast that it was un-salvageable. The way it oozed made me think of Buitee’s Starry sky set. But at least those were the specialty set, their regular ones were SOLID(even if I didn’t like some of the colors, that’s nothing on their quality). This set will probably work on nails like polish or something, but I love using the nail forms and this just doesn’t work, and didn’t stay ON. I don’t recommend this.\nReview Title: Worst polygel I’ve used yet\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hylunia Hydrate Body Wash - Energizing Blend With Mango 8.5 oz\nReview Date: 2020/12/11\nStore: Hylunia\nAverage Rating: 3.4\nProduct Details: {'Product Dimensions': '2 x 2 x 5 inches; 11.22 Ounces', 'Item model number': '059ENM-250-R', 'UPC': '185449000313'}\nReview Text: Smells like fermented mango....like a mango daiquiri....definitely not what I expected it to smell like lol. At the time of my order, it was priced about $20. I’m glad they dropped it as I don’t think it’s worth that much. Very much a gentle cleanser, not so much good for a lather. I’m actual surprised this is a body wash. I think it has the consistency of a cream facial cleanser, and the bottle looks like one as well. And after a few uses trying it as a body wash and not really liking it, I really only use it on my face now. I don’t think I would reorder this.\nReview Title: It’s alright-more better as a facial cream cleanser\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Follain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nReview Date: 2020/12/21\nStore: Follain\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nReview Text: This is a big bar of soap, and that helps mitigate the high cost of a single bar of soap if you feel like splurging. It smells nice and lathers really well by itself, with a cloth, sponge or a brush. Gives a nice clean feel but it does feel like it strips my skin a bit more than I would like.\nReview Title: Big bar of soap\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Balance White Mud Balancing Mask by Au Natural Skinfood | Rotorua Exfoliating Mask with 16+ Manuka Honey | Certified | Food For Your Skin | All Skin Types | Made in New Zealand | 1.7 oz\nReview Date: 2021/01/17\nStore: AÚ NATURAL SKINFOOD\nAverage Rating: 3.6\nProduct Details: {'Brand': 'AÚ NATURAL SKINFOOD', 'Item Form': 'Mask', 'Product Benefits': 'Exfoliates,Hydrates,Exfoliating', 'Scent': 'Honey', 'Skin Type': 'All', 'Product Dimensions': '9.65 x 6.1 x 1.77 inches; 1.7 Ounces'}\nReview Text: Pretty costly for such a small amount. I got 3 masks out of this small container, so that about $13 per mask. There was a lack of safety seal on mine which makes me question the product. Did I see a big difference between this expensive mask and one that costs less? Nope, not even alittle difference. While I do like companies that are about being all natural, there are cheaper options that do the same. Very unlikely I would reorder this.\nReview Title: Small amount an expensive mask\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NAILGIL Poly Nail Gel (Temperature)\nReview Date: 2021/02/22\nStore: NAIL GIL\nAverage Rating: 3.2\nProduct Details: {'Brand': 'NAIL GIL', 'Item Form': 'Gel', 'Type': 'gel', 'Unit Count': '1.00 Count', 'Item Dimensions LxWxH': '9.45 x 4.72 x 1.18 inches'}\nReview Text: I like this set. The base and top coat work great with the poly gels. I’ve also tried it with other sets of base and top coats and it works fine with those too. The sets lasted a few weeks no problems. The only thing that I’m not a fan of, is the colors. It supposed to be the color that it is on the tube. I find that the colors look a bit different from the tube to the dot that I made on the stick, and then even bigger difference on my nails. For instance, the red tube. Looks like a lighter red on the dot. Then on my hands, it turned red orange(not color changing either). I didn’t finish with a top coat before I took a picture because I didn’t like the color at all and I ended up painting it over with gel nail polish. Really that’s the only on with such a big difference. The others are not a big difference but a bit more sheer than I expected. It is still good quality, so if you like the colors then this set is for you. A bit on the expensive side for the amount of poly gels you get, and I’m not a big fan of the colors so I wouldn’t reorder this.\nReview Title: Good beginners set but a bit expensive\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: KPOKPO 2021 NEW - Soft Shower Body Brush ，Back Scrubber Soft Bristles Bath Brush， 3 in 1 Foldable Bath Brush Exfoliating Brush with Long Handle Body Brush Lotion Applicator and Massager\nReview Date: 2021/03/23\nStore: KPOKPO\nAverage Rating: 4.0\nProduct Details: {'Material': 'Sponge,Plastic,Nylon', 'Brand': 'KPOKPO', 'Item Dimensions LxWxH': '19.18 x 3.14 x 0.82 inches', 'Product Benefits': 'Softening,Nourishing,Clean,Exfoliating', 'Operation Mode': 'Manual', 'Product Dimensions': '19.18 x 3.14 x 0.82 inches; 13.44 Ounces', 'UPC': '712491891110', 'Manufacturer': 'ProOrganic'}\nReview Text: As I mentioned, I have sensitive skin. While for others this might be too soft, this is great as a weekly exfoliator. It is too rough for my skins daily use. I really like the length of the bristles and the curve of the scrubber, perfect for my back. It’s easy to switch out the different scrub heads.\nReview Title: Great for my sensitive skin as weekly exfoliator\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Body Brush with Super Comfy Bristles for Universal Skin,Long Bamboo Handle Gentle Exfoliation Improve Skin's Health and Beauty Wet or Dry Brushing Back Scrubber for Shower\nReview Date: 2021/04/23\nStore: Zhaoyun\nProduct Description: ['Bath Body Exfoliating Brush,Shower Back Cleaning Scrubber with Long Handle,Dry or Wet Skin Exfoliator Brush with Soft Bristles Back Washer', 'Perfect for Daily Hygiene and Sensitive Skin.', 'Soft Nylon Bristles Be Easier to produce abundant foam,Just add some gel on it and rub the bristles.', 'This Brush will help you a better bath experience, Feel Fresh and Renewed Every Day.', 'Long Reach Handle', 'The Extended 16 inches Long Handle Will Use More Friendly.', 'Note：this brush bristles is too soft so if you want to exfoliate, we recommend using it with a body scrub.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '17 x 4 x 2 inches; 7.55 Ounces', 'Manufacturer': 'Zhaoyun'}\nReview Text: I’ve been looking for a body brush like this and I’m so happy to have found this! This is exactly like my facial brush except on a bigger scale. This is a good back scrubber for my sensitive skin on a daily basis. Anything else I’ve tried to use on a daily has been too rough. This gives a great lather with liquid or bar soap. The rope helps with grip but I wish it was wrapped around a little bit longer for better grip. As is 4.5 stars\nReview Title: Great on my sensitive skin!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EASYDEW DW-EGF Double Synergy Moist Ampoule1.01 fl oz -K Beauty Award-Winning Anti Aging Ampoule with EGF to Plump, Moisturize Skin I For Sensitive Skin, Gift for Mom, Wife, Her\nReview Date: 2021/05/03\nStore: EASYDEW\nAverage Rating: 4.5\nProduct Details: {'Skin Type': 'Sensitive', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Aloe', 'Brand': 'EASYDEW', 'Material Feature': 'Natural', 'Package Dimensions': '4.29 x 1.54 x 1.46 inches; 3.53 Ounces'}\nReview Text: This is a good ampoule that has helped improve the texture of the skin on my face. I would say the only slight negative for me is that I still have to use an oil serum with it to help lock in my faces moisture all day. Even with applying a moisturizing cream afterwards. But I do live in a desert so most people might not need that extra help. I really don’t smell this when applying and it doesn’t clog my pores.\nReview Title: Face texture improved on my face\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vitamin C Face Serum with Lemon Peel Bio Ferment Restorative Anti-Aging Serum with 20% Vitamin C MSM Hyaluronic Acid Organic Aloe Vera and Jojoba – 1 Ounce\nReview Date: 2021/06/02\nStore: Sia Botanics\nAverage Rating: 4.6\nProduct Details: {'Package Dimensions': '4.57 x 1.46 x 1.34 inches; 3.21 Ounces', 'Item model number': 'SBCSRM', 'UPC': '713757595704'}\nReview Text: I’ve been trying to find a vitamin c serum to add to my facial routine for a while now. I lost track how many I’ve tried. One thing I remember from all those is that most of them sit on the top of my skin and most of them clog my pores and cause pimples. I’m not one to get much pimples and it’s an easy way to tell when a product doesn’t work for me. I’m so glad to have finally found one that absorbs into my skin but doesn’t clog my pores! A lot of them have that claim and none of them delivered like this one. Only thing is that this is a bit on the expensive side for 1 fl oz. I would reorder this when I run out.\nReview Title: Absorbs and doesn’t clog my pores\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: FASCY LAB GREEN+ Korean Sunscreen — SPF 50+PA++++, Daily Facial Sunscreen, Sun Cream With Patented Ingredients, Korean Spf, Korean Sun Cream for Face — Paraben Free [1 x 1.69 Fl.Oz.]\nReview Date: 2021/06/24\nStore: Fascy\nAverage Rating: 4.5\nProduct Details: {'Sun Protection': '50 SPF', 'Item Weight': '50 Milligrams', 'Number of Items': '1', 'Unit Count': '1.69 Fl Oz', 'Skin Type': 'Dry', 'Item model number': 'KC'}\nReview Text: I love this sunscreen for under my makeup. It’s all I use it for because once it absorbs into my skin, it gives a non greasy look. No white cast either. It takes about 10 mins for it to fully sink into my skin and I’m able to apply my makeup. I like that it is able to absorb into my skin even after I put on a serum and a day cream. It doesn’t cause me to break out but adds a layer of moisture to my skin.\nReview Title: My favorite sunscreen to use under makeup\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tirtyl Hand Soap Sheet Variety Pack - 240 Pack with Portable Storage Tin - Camping/Outdoor/Travel/Handbag - Lavender & Aloe - Bergamot & Ylang Ylang - Jasmine & Patchouli\nReview Date: 2021/07/20\nStore: Tirtyl\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Tirtyl', 'Scent': 'Bergamot,Lavender,Jasmine', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '240.00 Count', 'Package Dimensions': '9.88 x 6.26 x 0.75 inches; 3.21 Ounces'}\nReview Text: I’ve got the Tirtyl foaming hand soap at home that I love and I thought I would give this a try. From the foaming hand soap I have the coconut and vanilla, and the lavender and aloe. I thought the lavender and aloe sheets would smell the same as the foaming soap but it does not. Far from it. The sheets smell far too musky, strong, and more like men’s cologne on my hands. Not a fan of that one, but glad the smell doesn’t last long after the hand washing. The bergamot and Ylang ylang, and the jasmine and patchouli both smell nice but it is mild. I would say the bergamot and ylang ylang is a neutral smell, while the jasmine and patchouli are more flowery and a bit more feminine. Like I said, both are mild and after drying off my hands I can barely smell them already. One little pack fits into all my regular little inside purse pockets. I always keep soap on hand, especially since I’m allergic to most soaps kept in public restrooms and these soaps are great.\nReview Title: I love the Tirtyl soap\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nReview Date: 2021/08/10\nStore: Marine Forest\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Product Dimensions': '6.3 x 2.28 x 0.83 inches; 1.48 Ounces', 'UPC': '729843859957'}\nReview Text: I love this set. I live in a desert and the products I use cannot dry out my lips. I pair these lip liners with color lip gloss, lip tints, and lip sticks that have passed my test. None of the products I use dry out my lips. As long as the products I use that I pair this with is good, this is great. I line my lips, not color them with it. If i did, I’m sure it would dry out my lips. I love the range of colors this set comes with, great for any occasion. The only thing I don’t like about this set is the covers for the lip liners. They don’t stay on at all. I’ve had to stick them in a zip lock bag by themselves so it doesn’t mess up my makeup bag. Easy fix though. 4.5 stars\nReview Title: Great range of colors\nRating: 5.0\n--------------------------------------------------",
  "reference": "96 Pieces Glossy False Nails Oval Rhinestone Full Cover False Nails Pink Color Changing Gradient Short Artificial Nail Tips with 4 Pieces Nail Glue for Women Girls Nail DIY Decorations\nBBTO\n{'Material': 'Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'BBTO', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Number of Pieces': '4, 96', 'Package Dimensions': '11.5 x 7.32 x 0.5 inches; 1.59 Ounces'}\nYou get what you pay for. The nails are pretty thin and that’s only alright for the short length, not medium which these are. There is only enough nails in each set for me to get both hands once. The others are wasted. I put the gradient color on first as it was the least trouble for this mommy of 4. All the others would REQUIRE a clear top coat. Jus touching the gold glitter n it started coming off. This gradient color could use a top coat to help it last longer but it’s fine. And before asking, I didnt bother trying the nail glue it comes with. If the nails aren’t great I wouldn’t trust the glue. For my regular fake nails I will stick with my short rounded French tips that are thicker and more durable than these. If I want something with color for a night or 2, I might put one of the others on. While I probably won’t buy these ever again they aren’t bad, jus not that good either to waste more of my money for another batch.<br />Edited review update: last pic is of my broken nail. It lasted 5 hours. Then I trimmed all my nails down n 5 more nails went the following day. There is no salvaging them either. It all split down the middle n not a small split either. It went almost through n just fell apart. And so I drop my ratings from 3 stars to 1. If I could give 0, I would.\nCheap and that’s the quality too\nDROP THE BOMB Bbosong Sun Stick SPF50+ PA++++ 15g - Oil Free UVA/UVB Protection Sebum Control Skin Smooth Moisturizing Sunblock Stick Balm without Sticky, Primer before Makeup\nDROP THE BOMB\n{'Sun Protection': '50 SPF', 'Item Weight': '15 Grams', 'Unit Count': '1.00 Count', 'Skin Type': 'Sensitive', 'Brand': 'DROP THE BOMB', 'Package Dimensions': '3.5 x 1.7 x 1.1 inches; 0.53 Ounces'}\nWhen they say hypoallergenic, reef friendly, made with vegan ingredients, and calming natural ingredients I think it must be okay to order. But they don’t list their ingredients so I wasn’t sure if I should. And now I know why they don’t. I posted a picture of the ingredients if you would like to look them up yourself. The top half of the ingredients which take up most of what it is made of is made of: polyethylene(man made plastic), a chemical, acrylic or plexiglass, a few man made silicones, and chemical fragrances(some of them are really long words so I just put down the laymans terms.) I stopped looking it up at that point. I’m not putting this on as I’m allergic to a few of the ingredients. Hope this helps.\nThey don’t list ingredients but I have a picture of it\nNatwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nI use these with my micellar water for my makeup removal and it works great. It was really easy to hand wash. I love that it comes with its own laundry bag if I choose to throw it in the washer. 18 pack, for the price ($10) is a steal!\nSo soft and easy to hand wash\nAmtidy Solid Color Vintage Modern Style Elastic Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nAmtidy\n{'Material': 'Rubber', 'Fabric Type': 'Elastic', 'Brand': 'Amtidy', 'Item Form': 'Spiral', 'Unit Count': '10.00 Count', 'Package Dimensions': '11.65 x 5.63 x 3.23 inches; 12.03 Ounces', 'UPC': '782931993780'}\nI use these to get my hair out of the way for washing my face, gym time, and just to wear out. Variety of colors make it easy to match to my clothes. Fits my head good and stays on.\nGood variety of color\nBiutee Poly Nail Gel Kit 15ml 0.53oz Pink Nail Extension Gel Builder Gel Long Lasting Nail Salon Nail Art Design DIY at Home Beginner Friendly…\nBiutee\n{'Package Dimensions': '3.5 x 2 x 1.5 inches; 0.81 Ounces'}\nThis is just the poly gel. In order to use this for long nails you need nail forms, a solution, a container for the solution, and the brush with scrapper, and the UV lamp. Also the base coat and most likely a nail drill and some nails files (not shown in picture). ***Important*** You have to use a gel nail base coat before the poly gel in order for it to stick, otherwise they will pop off. If you don’t have these things, I would suggest you don’t get this for the first time. There are nail kits for that. And lots of YouTube videos to show how to do it. It’s how I learned to do mine. With a full set of long nails, and enough for extra nails and some fills, this one bottle could last for at least a couple months. This is a good amount of product for a reasonable price. $7 for nails for a couple months. And this nice color looks beautiful. It’s hardy nails like acrylic and gel nail polish in one.\nBeautiful saloon nails\nBiutee Starry Sky Nail Gel Firework Nail Gel With black Nail Polish Gel 8ml UV LED\nBiutee\n{'Brand': 'Biutee', 'Item Form': 'Gel', 'Type': 'Gel', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '3.5274 Ounce', 'Number of Items': '2', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '4.92 x 3.31 x 1.77 inches; 4.59 Ounces'}\nThis is a complete set, not a full kit. There is a big difference. Saying that this is everything you need to make the nails if you have everything else. That means you already have the UV lamp, the base and top coat, and the solution and brush kit. From my experience, this kit is not for beginners. The glitter set aka starry sky set is messy and requires a lot of filing similar to biutees cat eye set. By hand, but filing with a nail drill is better. I was trying different looks to see if I can make some awesome looking Halloween (witchy) looking nails. This set alone is not it though. I might try experimenting with mixing this with biutees poly gels that might make it better and more manageable.\nComplete set not for beginners\nGlitter Poly Nail Gel Extensions Builder Gel UV/LED Soak Off Acrylic Fashion Gel Polish Set for Nails Beginner DIY Nail Art at Home 8 colors-15g (Pink series)\nMIZHSE\n{'Brand': 'MIZHSE', 'Item Form': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '478.00 Count', 'Number of Items': '9', 'Package Dimensions': '9.76 x 4.88 x 1.42 inches; 12.8 Ounces'}\nFirst picture is the after, after a lot of work. Don’t let it fool you. Second picture is to just show that this white is really an off white, milky white. Third picture is 2 days later where 2 popped off. The next day the ring finger one broke in half. 🤦🏻‍♀️ This is my 7th set(of different sets and brands of polygel trying to find the best). Not my first rodeo. I know what I’m doing with polygels. Am I a professional? Nope. Just a mom doing my own nails at home. I love polygels as it gives me beautiful salon nails from home and can stand the abuse a regular mom can put it through (like cleaning and washing dishes without gloves,etc).<br /> I tried 4 different colors. They gave me an insight about the quality of this set. You only see 3 colors in the first pic, I know. But that’s because the clear is what I originally tried ( I really did try) to put on my middle finger instead of one of the glitters. Putting this set in the forms(I don’t use the forms from this set as I don’t like them), using solution to spread it in the forms was like any other polygel I’ve used. It’s when I turned it over and put it on my nails did something different happen. It basically started to ooze out of the forms way more than normal,it was getting messy. Putting it under the uv lamp to set it quickly. But as it was setting under the lamp the nails were falling a bit and setting that way. But it was the “clear” color that was the worst of the bunch. Oozed out so fast that it was un-salvageable. The way it oozed made me think of Buitee’s Starry sky set. But at least those were the specialty set, their regular ones were SOLID(even if I didn’t like some of the colors, that’s nothing on their quality). This set will probably work on nails like polish or something, but I love using the nail forms and this just doesn’t work, and didn’t stay ON. I don’t recommend this.\nWorst polygel I’ve used yet\nHylunia Hydrate Body Wash - Energizing Blend With Mango 8.5 oz\nHylunia\n{'Product Dimensions': '2 x 2 x 5 inches; 11.22 Ounces', 'Item model number': '059ENM-250-R', 'UPC': '185449000313'}\nSmells like fermented mango....like a mango daiquiri....definitely not what I expected it to smell like lol. At the time of my order, it was priced about $20. I’m glad they dropped it as I don’t think it’s worth that much. Very much a gentle cleanser, not so much good for a lather. I’m actual surprised this is a body wash. I think it has the consistency of a cream facial cleanser, and the bottle looks like one as well. And after a few uses trying it as a body wash and not really liking it, I really only use it on my face now. I don’t think I would reorder this.\nIt’s alright-more better as a facial cream cleanser\nFollain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nFollain\n{'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nThis is a big bar of soap, and that helps mitigate the high cost of a single bar of soap if you feel like splurging. It smells nice and lathers really well by itself, with a cloth, sponge or a brush. Gives a nice clean feel but it does feel like it strips my skin a bit more than I would like.\nBig bar of soap\nBalance White Mud Balancing Mask by Au Natural Skinfood | Rotorua Exfoliating Mask with 16+ Manuka Honey | Certified | Food For Your Skin | All Skin Types | Made in New Zealand | 1.7 oz\nAÚ NATURAL SKINFOOD\n{'Brand': 'AÚ NATURAL SKINFOOD', 'Item Form': 'Mask', 'Product Benefits': 'Exfoliates,Hydrates,Exfoliating', 'Scent': 'Honey', 'Skin Type': 'All', 'Product Dimensions': '9.65 x 6.1 x 1.77 inches; 1.7 Ounces'}\nPretty costly for such a small amount. I got 3 masks out of this small container, so that about $13 per mask. There was a lack of safety seal on mine which makes me question the product. Did I see a big difference between this expensive mask and one that costs less? Nope, not even alittle difference. While I do like companies that are about being all natural, there are cheaper options that do the same. Very unlikely I would reorder this.\nSmall amount an expensive mask\nNAILGIL Poly Nail Gel (Temperature)\nNAIL GIL\n{'Brand': 'NAIL GIL', 'Item Form': 'Gel', 'Type': 'gel', 'Unit Count': '1.00 Count', 'Item Dimensions LxWxH': '9.45 x 4.72 x 1.18 inches'}\nI like this set. The base and top coat work great with the poly gels. I’ve also tried it with other sets of base and top coats and it works fine with those too. The sets lasted a few weeks no problems. The only thing that I’m not a fan of, is the colors. It supposed to be the color that it is on the tube. I find that the colors look a bit different from the tube to the dot that I made on the stick, and then even bigger difference on my nails. For instance, the red tube. Looks like a lighter red on the dot. Then on my hands, it turned red orange(not color changing either). I didn’t finish with a top coat before I took a picture because I didn’t like the color at all and I ended up painting it over with gel nail polish. Really that’s the only on with such a big difference. The others are not a big difference but a bit more sheer than I expected. It is still good quality, so if you like the colors then this set is for you. A bit on the expensive side for the amount of poly gels you get, and I’m not a big fan of the colors so I wouldn’t reorder this.\nGood beginners set but a bit expensive\nKPOKPO 2021 NEW - Soft Shower Body Brush ，Back Scrubber Soft Bristles Bath Brush， 3 in 1 Foldable Bath Brush Exfoliating Brush with Long Handle Body Brush Lotion Applicator and Massager\nKPOKPO\n{'Material': 'Sponge,Plastic,Nylon', 'Brand': 'KPOKPO', 'Item Dimensions LxWxH': '19.18 x 3.14 x 0.82 inches', 'Product Benefits': 'Softening,Nourishing,Clean,Exfoliating', 'Operation Mode': 'Manual', 'Product Dimensions': '19.18 x 3.14 x 0.82 inches; 13.44 Ounces', 'UPC': '712491891110', 'Manufacturer': 'ProOrganic'}\nAs I mentioned, I have sensitive skin. While for others this might be too soft, this is great as a weekly exfoliator. It is too rough for my skins daily use. I really like the length of the bristles and the curve of the scrubber, perfect for my back. It’s easy to switch out the different scrub heads.\nGreat for my sensitive skin as weekly exfoliator\nBath Body Brush with Super Comfy Bristles for Universal Skin,Long Bamboo Handle Gentle Exfoliation Improve Skin's Health and Beauty Wet or Dry Brushing Back Scrubber for Shower\nZhaoyun\n['Bath Body Exfoliating Brush,Shower Back Cleaning Scrubber with Long Handle,Dry or Wet Skin Exfoliator Brush with Soft Bristles Back Washer', 'Perfect for Daily Hygiene and Sensitive Skin.', 'Soft Nylon Bristles Be Easier to produce abundant foam,Just add some gel on it and rub the bristles.', 'This Brush will help you a better bath experience, Feel Fresh and Renewed Every Day.', 'Long Reach Handle', 'The Extended 16 inches Long Handle Will Use More Friendly.', 'Note：this brush bristles is too soft so if you want to exfoliate, we recommend using it with a body scrub.']\n{'Product Dimensions': '17 x 4 x 2 inches; 7.55 Ounces', 'Manufacturer': 'Zhaoyun'}\nI’ve been looking for a body brush like this and I’m so happy to have found this! This is exactly like my facial brush except on a bigger scale. This is a good back scrubber for my sensitive skin on a daily basis. Anything else I’ve tried to use on a daily has been too rough. This gives a great lather with liquid or bar soap. The rope helps with grip but I wish it was wrapped around a little bit longer for better grip. As is 4.5 stars\nGreat on my sensitive skin!\nEASYDEW DW-EGF Double Synergy Moist Ampoule1.01 fl oz -K Beauty Award-Winning Anti Aging Ampoule with EGF to Plump, Moisturize Skin I For Sensitive Skin, Gift for Mom, Wife, Her\nEASYDEW\n{'Skin Type': 'Sensitive', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Aloe', 'Brand': 'EASYDEW', 'Material Feature': 'Natural', 'Package Dimensions': '4.29 x 1.54 x 1.46 inches; 3.53 Ounces'}\nThis is a good ampoule that has helped improve the texture of the skin on my face. I would say the only slight negative for me is that I still have to use an oil serum with it to help lock in my faces moisture all day. Even with applying a moisturizing cream afterwards. But I do live in a desert so most people might not need that extra help. I really don’t smell this when applying and it doesn’t clog my pores.\nFace texture improved on my face\nVitamin C Face Serum with Lemon Peel Bio Ferment Restorative Anti-Aging Serum with 20% Vitamin C MSM Hyaluronic Acid Organic Aloe Vera and Jojoba – 1 Ounce\nSia Botanics\n{'Package Dimensions': '4.57 x 1.46 x 1.34 inches; 3.21 Ounces', 'Item model number': 'SBCSRM', 'UPC': '713757595704'}\nI’ve been trying to find a vitamin c serum to add to my facial routine for a while now. I lost track how many I’ve tried. One thing I remember from all those is that most of them sit on the top of my skin and most of them clog my pores and cause pimples. I’m not one to get much pimples and it’s an easy way to tell when a product doesn’t work for me. I’m so glad to have finally found one that absorbs into my skin but doesn’t clog my pores! A lot of them have that claim and none of them delivered like this one. Only thing is that this is a bit on the expensive side for 1 fl oz. I would reorder this when I run out.\nAbsorbs and doesn’t clog my pores\nFASCY LAB GREEN+ Korean Sunscreen — SPF 50+PA++++, Daily Facial Sunscreen, Sun Cream With Patented Ingredients, Korean Spf, Korean Sun Cream for Face — Paraben Free [1 x 1.69 Fl.Oz.]\nFascy\n{'Sun Protection': '50 SPF', 'Item Weight': '50 Milligrams', 'Number of Items': '1', 'Unit Count': '1.69 Fl Oz', 'Skin Type': 'Dry', 'Item model number': 'KC'}\nI love this sunscreen for under my makeup. It’s all I use it for because once it absorbs into my skin, it gives a non greasy look. No white cast either. It takes about 10 mins for it to fully sink into my skin and I’m able to apply my makeup. I like that it is able to absorb into my skin even after I put on a serum and a day cream. It doesn’t cause me to break out but adds a layer of moisture to my skin.\nMy favorite sunscreen to use under makeup\nTirtyl Hand Soap Sheet Variety Pack - 240 Pack with Portable Storage Tin - Camping/Outdoor/Travel/Handbag - Lavender & Aloe - Bergamot & Ylang Ylang - Jasmine & Patchouli\nTirtyl\n{'Brand': 'Tirtyl', 'Scent': 'Bergamot,Lavender,Jasmine', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '240.00 Count', 'Package Dimensions': '9.88 x 6.26 x 0.75 inches; 3.21 Ounces'}\nI’ve got the Tirtyl foaming hand soap at home that I love and I thought I would give this a try. From the foaming hand soap I have the coconut and vanilla, and the lavender and aloe. I thought the lavender and aloe sheets would smell the same as the foaming soap but it does not. Far from it. The sheets smell far too musky, strong, and more like men’s cologne on my hands. Not a fan of that one, but glad the smell doesn’t last long after the hand washing. The bergamot and Ylang ylang, and the jasmine and patchouli both smell nice but it is mild. I would say the bergamot and ylang ylang is a neutral smell, while the jasmine and patchouli are more flowery and a bit more feminine. Like I said, both are mild and after drying off my hands I can barely smell them already. One little pack fits into all my regular little inside purse pockets. I always keep soap on hand, especially since I’m allergic to most soaps kept in public restrooms and these soaps are great.\nI love the Tirtyl soap\nLip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nMarine Forest\n{'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Product Dimensions': '6.3 x 2.28 x 0.83 inches; 1.48 Ounces', 'UPC': '729843859957'}\nI love this set. I live in a desert and the products I use cannot dry out my lips. I pair these lip liners with color lip gloss, lip tints, and lip sticks that have passed my test. None of the products I use dry out my lips. As long as the products I use that I pair this with is good, this is great. I line my lips, not color them with it. If i did, I’m sure it would dry out my lips. I love the range of colors this set comes with, great for any occasion. The only thing I don’t like about this set is the covers for the lip liners. They don’t stay on at all. I’ve had to stick them in a zip lock bag by themselves so it doesn’t mess up my makeup bag. Easy fix though. 4.5 stars\nGreat range of colors",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: 96 Pieces Glossy False Nails Oval Rhinestone Full Cover False Nails Pink Color Changing Gradient Short Artificial Nail Tips with 4 Pieces Nail Glue for Women Girls Nail DIY Decorations\nReview Date: 2020/07/18\nStore: BBTO\nAverage Rating: 3.2\nProduct Details: {'Material': 'Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'BBTO', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Number of Pieces': '4, 96', 'Package Dimensions': '11.5 x 7.32 x 0.5 inches; 1.59 Ounces'}\nReview Text: You get what you pay for. The nails are pretty thin and that’s only alright for the short length, not medium which these are. There is only enough nails in each set for me to get both hands once. The others are wasted. I put the gradient color on first as it was the least trouble for this mommy of 4. All the others would REQUIRE a clear top coat. Jus touching the gold glitter n it started coming off. This gradient color could use a top coat to help it last longer but it’s fine. And before asking, I didnt bother trying the nail glue it comes with. If the nails aren’t great I wouldn’t trust the glue. For my regular fake nails I will stick with my short rounded French tips that are thicker and more durable than these. If I want something with color for a night or 2, I might put one of the others on. While I probably won’t buy these ever again they aren’t bad, jus not that good either to waste more of my money for another batch.<br />Edited review update: last pic is of my broken nail. It lasted 5 hours. Then I trimmed all my nails down n 5 more nails went the following day. There is no salvaging them either. It all split down the middle n not a small split either. It went almost through n just fell apart. And so I drop my ratings from 3 stars to 1. If I could give 0, I would.\nReview Title: Cheap and that’s the quality too\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DROP THE BOMB Bbosong Sun Stick SPF50+ PA++++ 15g - Oil Free UVA/UVB Protection Sebum Control Skin Smooth Moisturizing Sunblock Stick Balm without Sticky, Primer before Makeup\nReview Date: 2020/08/07\nStore: DROP THE BOMB\nAverage Rating: 3.2\nProduct Details: {'Sun Protection': '50 SPF', 'Item Weight': '15 Grams', 'Unit Count': '1.00 Count', 'Skin Type': 'Sensitive', 'Brand': 'DROP THE BOMB', 'Package Dimensions': '3.5 x 1.7 x 1.1 inches; 0.53 Ounces'}\nReview Text: When they say hypoallergenic, reef friendly, made with vegan ingredients, and calming natural ingredients I think it must be okay to order. But they don’t list their ingredients so I wasn’t sure if I should. And now I know why they don’t. I posted a picture of the ingredients if you would like to look them up yourself. The top half of the ingredients which take up most of what it is made of is made of: polyethylene(man made plastic), a chemical, acrylic or plexiglass, a few man made silicones, and chemical fragrances(some of them are really long words so I just put down the laymans terms.) I stopped looking it up at that point. I’m not putting this on as I’m allergic to a few of the ingredients. Hope this helps.\nReview Title: They don’t list ingredients but I have a picture of it\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nReview Date: 2020/08/25\nStore: Natwag\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nReview Text: I use these with my micellar water for my makeup removal and it works great. It was really easy to hand wash. I love that it comes with its own laundry bag if I choose to throw it in the washer. 18 pack, for the price ($10) is a steal!\nReview Title: So soft and easy to hand wash\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Amtidy Solid Color Vintage Modern Style Elastic Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nReview Date: 2020/09/14\nStore: Amtidy\nAverage Rating: 4.0\nProduct Details: {'Material': 'Rubber', 'Fabric Type': 'Elastic', 'Brand': 'Amtidy', 'Item Form': 'Spiral', 'Unit Count': '10.00 Count', 'Package Dimensions': '11.65 x 5.63 x 3.23 inches; 12.03 Ounces', 'UPC': '782931993780'}\nReview Text: I use these to get my hair out of the way for washing my face, gym time, and just to wear out. Variety of colors make it easy to match to my clothes. Fits my head good and stays on.\nReview Title: Good variety of color\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Biutee Poly Nail Gel Kit 15ml 0.53oz Pink Nail Extension Gel Builder Gel Long Lasting Nail Salon Nail Art Design DIY at Home Beginner Friendly…\nReview Date: 2020/10/07\nStore: Biutee\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '3.5 x 2 x 1.5 inches; 0.81 Ounces'}\nReview Text: This is just the poly gel. In order to use this for long nails you need nail forms, a solution, a container for the solution, and the brush with scrapper, and the UV lamp. Also the base coat and most likely a nail drill and some nails files (not shown in picture). ***Important*** You have to use a gel nail base coat before the poly gel in order for it to stick, otherwise they will pop off. If you don’t have these things, I would suggest you don’t get this for the first time. There are nail kits for that. And lots of YouTube videos to show how to do it. It’s how I learned to do mine. With a full set of long nails, and enough for extra nails and some fills, this one bottle could last for at least a couple months. This is a good amount of product for a reasonable price. $7 for nails for a couple months. And this nice color looks beautiful. It’s hardy nails like acrylic and gel nail polish in one.\nReview Title: Beautiful saloon nails\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Biutee Starry Sky Nail Gel Firework Nail Gel With black Nail Polish Gel 8ml UV LED\nReview Date: 2020/10/14\nStore: Biutee\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Biutee', 'Item Form': 'Gel', 'Type': 'Gel', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '3.5274 Ounce', 'Number of Items': '2', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '4.92 x 3.31 x 1.77 inches; 4.59 Ounces'}\nReview Text: This is a complete set, not a full kit. There is a big difference. Saying that this is everything you need to make the nails if you have everything else. That means you already have the UV lamp, the base and top coat, and the solution and brush kit. From my experience, this kit is not for beginners. The glitter set aka starry sky set is messy and requires a lot of filing similar to biutees cat eye set. By hand, but filing with a nail drill is better. I was trying different looks to see if I can make some awesome looking Halloween (witchy) looking nails. This set alone is not it though. I might try experimenting with mixing this with biutees poly gels that might make it better and more manageable.\nReview Title: Complete set not for beginners\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Glitter Poly Nail Gel Extensions Builder Gel UV/LED Soak Off Acrylic Fashion Gel Polish Set for Nails Beginner DIY Nail Art at Home 8 colors-15g (Pink series)\nReview Date: 2020/11/10\nStore: MIZHSE\nAverage Rating: 4.2\nProduct Details: {'Brand': 'MIZHSE', 'Item Form': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '478.00 Count', 'Number of Items': '9', 'Package Dimensions': '9.76 x 4.88 x 1.42 inches; 12.8 Ounces'}\nReview Text: First picture is the after, after a lot of work. Don’t let it fool you. Second picture is to just show that this white is really an off white, milky white. Third picture is 2 days later where 2 popped off. The next day the ring finger one broke in half. 🤦🏻‍♀️ This is my 7th set(of different sets and brands of polygel trying to find the best). Not my first rodeo. I know what I’m doing with polygels. Am I a professional? Nope. Just a mom doing my own nails at home. I love polygels as it gives me beautiful salon nails from home and can stand the abuse a regular mom can put it through (like cleaning and washing dishes without gloves,etc).<br /> I tried 4 different colors. They gave me an insight about the quality of this set. You only see 3 colors in the first pic, I know. But that’s because the clear is what I originally tried ( I really did try) to put on my middle finger instead of one of the glitters. Putting this set in the forms(I don’t use the forms from this set as I don’t like them), using solution to spread it in the forms was like any other polygel I’ve used. It’s when I turned it over and put it on my nails did something different happen. It basically started to ooze out of the forms way more than normal,it was getting messy. Putting it under the uv lamp to set it quickly. But as it was setting under the lamp the nails were falling a bit and setting that way. But it was the “clear” color that was the worst of the bunch. Oozed out so fast that it was un-salvageable. The way it oozed made me think of Buitee’s Starry sky set. But at least those were the specialty set, their regular ones were SOLID(even if I didn’t like some of the colors, that’s nothing on their quality). This set will probably work on nails like polish or something, but I love using the nail forms and this just doesn’t work, and didn’t stay ON. I don’t recommend this.\nReview Title: Worst polygel I’ve used yet\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Hylunia Hydrate Body Wash - Energizing Blend With Mango 8.5 oz\nReview Date: 2020/12/11\nStore: Hylunia\nAverage Rating: 3.4\nProduct Details: {'Product Dimensions': '2 x 2 x 5 inches; 11.22 Ounces', 'Item model number': '059ENM-250-R', 'UPC': '185449000313'}\nReview Text: Smells like fermented mango....like a mango daiquiri....definitely not what I expected it to smell like lol. At the time of my order, it was priced about $20. I’m glad they dropped it as I don’t think it’s worth that much. Very much a gentle cleanser, not so much good for a lather. I’m actual surprised this is a body wash. I think it has the consistency of a cream facial cleanser, and the bottle looks like one as well. And after a few uses trying it as a body wash and not really liking it, I really only use it on my face now. I don’t think I would reorder this.\nReview Title: It’s alright-more better as a facial cream cleanser\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Follain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nReview Date: 2020/12/21\nStore: Follain\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nReview Text: This is a big bar of soap, and that helps mitigate the high cost of a single bar of soap if you feel like splurging. It smells nice and lathers really well by itself, with a cloth, sponge or a brush. Gives a nice clean feel but it does feel like it strips my skin a bit more than I would like.\nReview Title: Big bar of soap\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Balance White Mud Balancing Mask by Au Natural Skinfood | Rotorua Exfoliating Mask with 16+ Manuka Honey | Certified | Food For Your Skin | All Skin Types | Made in New Zealand | 1.7 oz\nReview Date: 2021/01/17\nStore: AÚ NATURAL SKINFOOD\nAverage Rating: 3.6\nProduct Details: {'Brand': 'AÚ NATURAL SKINFOOD', 'Item Form': 'Mask', 'Product Benefits': 'Exfoliates,Hydrates,Exfoliating', 'Scent': 'Honey', 'Skin Type': 'All', 'Product Dimensions': '9.65 x 6.1 x 1.77 inches; 1.7 Ounces'}\nReview Text: Pretty costly for such a small amount. I got 3 masks out of this small container, so that about $13 per mask. There was a lack of safety seal on mine which makes me question the product. Did I see a big difference between this expensive mask and one that costs less? Nope, not even alittle difference. While I do like companies that are about being all natural, there are cheaper options that do the same. Very unlikely I would reorder this.\nReview Title: Small amount an expensive mask\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NAILGIL Poly Nail Gel (Temperature)\nReview Date: 2021/02/22\nStore: NAIL GIL\nAverage Rating: 3.2\nProduct Details: {'Brand': 'NAIL GIL', 'Item Form': 'Gel', 'Type': 'gel', 'Unit Count': '1.00 Count', 'Item Dimensions LxWxH': '9.45 x 4.72 x 1.18 inches'}\nReview Text: I like this set. The base and top coat work great with the poly gels. I’ve also tried it with other sets of base and top coats and it works fine with those too. The sets lasted a few weeks no problems. The only thing that I’m not a fan of, is the colors. It supposed to be the color that it is on the tube. I find that the colors look a bit different from the tube to the dot that I made on the stick, and then even bigger difference on my nails. For instance, the red tube. Looks like a lighter red on the dot. Then on my hands, it turned red orange(not color changing either). I didn’t finish with a top coat before I took a picture because I didn’t like the color at all and I ended up painting it over with gel nail polish. Really that’s the only on with such a big difference. The others are not a big difference but a bit more sheer than I expected. It is still good quality, so if you like the colors then this set is for you. A bit on the expensive side for the amount of poly gels you get, and I’m not a big fan of the colors so I wouldn’t reorder this.\nReview Title: Good beginners set but a bit expensive\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: KPOKPO 2021 NEW - Soft Shower Body Brush ，Back Scrubber Soft Bristles Bath Brush， 3 in 1 Foldable Bath Brush Exfoliating Brush with Long Handle Body Brush Lotion Applicator and Massager\nReview Date: 2021/03/23\nStore: KPOKPO\nAverage Rating: 4.0\nProduct Details: {'Material': 'Sponge,Plastic,Nylon', 'Brand': 'KPOKPO', 'Item Dimensions LxWxH': '19.18 x 3.14 x 0.82 inches', 'Product Benefits': 'Softening,Nourishing,Clean,Exfoliating', 'Operation Mode': 'Manual', 'Product Dimensions': '19.18 x 3.14 x 0.82 inches; 13.44 Ounces', 'UPC': '712491891110', 'Manufacturer': 'ProOrganic'}\nReview Text: As I mentioned, I have sensitive skin. While for others this might be too soft, this is great as a weekly exfoliator. It is too rough for my skins daily use. I really like the length of the bristles and the curve of the scrubber, perfect for my back. It’s easy to switch out the different scrub heads.\nReview Title: Great for my sensitive skin as weekly exfoliator\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Body Brush with Super Comfy Bristles for Universal Skin,Long Bamboo Handle Gentle Exfoliation Improve Skin's Health and Beauty Wet or Dry Brushing Back Scrubber for Shower\nReview Date: 2021/04/23\nStore: Zhaoyun\nProduct Description: ['Bath Body Exfoliating Brush,Shower Back Cleaning Scrubber with Long Handle,Dry or Wet Skin Exfoliator Brush with Soft Bristles Back Washer', 'Perfect for Daily Hygiene and Sensitive Skin.', 'Soft Nylon Bristles Be Easier to produce abundant foam,Just add some gel on it and rub the bristles.', 'This Brush will help you a better bath experience, Feel Fresh and Renewed Every Day.', 'Long Reach Handle', 'The Extended 16 inches Long Handle Will Use More Friendly.', 'Note：this brush bristles is too soft so if you want to exfoliate, we recommend using it with a body scrub.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '17 x 4 x 2 inches; 7.55 Ounces', 'Manufacturer': 'Zhaoyun'}\nReview Text: I’ve been looking for a body brush like this and I’m so happy to have found this! This is exactly like my facial brush except on a bigger scale. This is a good back scrubber for my sensitive skin on a daily basis. Anything else I’ve tried to use on a daily has been too rough. This gives a great lather with liquid or bar soap. The rope helps with grip but I wish it was wrapped around a little bit longer for better grip. As is 4.5 stars\nReview Title: Great on my sensitive skin!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EASYDEW DW-EGF Double Synergy Moist Ampoule1.01 fl oz -K Beauty Award-Winning Anti Aging Ampoule with EGF to Plump, Moisturize Skin I For Sensitive Skin, Gift for Mom, Wife, Her\nReview Date: 2021/05/03\nStore: EASYDEW\nAverage Rating: 4.5\nProduct Details: {'Skin Type': 'Sensitive', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Aloe', 'Brand': 'EASYDEW', 'Material Feature': 'Natural', 'Package Dimensions': '4.29 x 1.54 x 1.46 inches; 3.53 Ounces'}\nReview Text: This is a good ampoule that has helped improve the texture of the skin on my face. I would say the only slight negative for me is that I still have to use an oil serum with it to help lock in my faces moisture all day. Even with applying a moisturizing cream afterwards. But I do live in a desert so most people might not need that extra help. I really don’t smell this when applying and it doesn’t clog my pores.\nReview Title: Face texture improved on my face\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vitamin C Face Serum with Lemon Peel Bio Ferment Restorative Anti-Aging Serum with 20% Vitamin C MSM Hyaluronic Acid Organic Aloe Vera and Jojoba – 1 Ounce\nReview Date: 2021/06/02\nStore: Sia Botanics\nAverage Rating: 4.6\nProduct Details: {'Package Dimensions': '4.57 x 1.46 x 1.34 inches; 3.21 Ounces', 'Item model number': 'SBCSRM', 'UPC': '713757595704'}\nReview Text: I’ve been trying to find a vitamin c serum to add to my facial routine for a while now. I lost track how many I’ve tried. One thing I remember from all those is that most of them sit on the top of my skin and most of them clog my pores and cause pimples. I’m not one to get much pimples and it’s an easy way to tell when a product doesn’t work for me. I’m so glad to have finally found one that absorbs into my skin but doesn’t clog my pores! A lot of them have that claim and none of them delivered like this one. Only thing is that this is a bit on the expensive side for 1 fl oz. I would reorder this when I run out.\nReview Title: Absorbs and doesn’t clog my pores\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: FASCY LAB GREEN+ Korean Sunscreen — SPF 50+PA++++, Daily Facial Sunscreen, Sun Cream With Patented Ingredients, Korean Spf, Korean Sun Cream for Face — Paraben Free [1 x 1.69 Fl.Oz.]\nReview Date: 2021/06/24\nStore: Fascy\nAverage Rating: 4.5\nProduct Details: {'Sun Protection': '50 SPF', 'Item Weight': '50 Milligrams', 'Number of Items': '1', 'Unit Count': '1.69 Fl Oz', 'Skin Type': 'Dry', 'Item model number': 'KC'}\nReview Text: I love this sunscreen for under my makeup. It’s all I use it for because once it absorbs into my skin, it gives a non greasy look. No white cast either. It takes about 10 mins for it to fully sink into my skin and I’m able to apply my makeup. I like that it is able to absorb into my skin even after I put on a serum and a day cream. It doesn’t cause me to break out but adds a layer of moisture to my skin.\nReview Title: My favorite sunscreen to use under makeup\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tirtyl Hand Soap Sheet Variety Pack - 240 Pack with Portable Storage Tin - Camping/Outdoor/Travel/Handbag - Lavender & Aloe - Bergamot & Ylang Ylang - Jasmine & Patchouli\nReview Date: 2021/07/20\nStore: Tirtyl\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Tirtyl', 'Scent': 'Bergamot,Lavender,Jasmine', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '240.00 Count', 'Package Dimensions': '9.88 x 6.26 x 0.75 inches; 3.21 Ounces'}\nReview Text: I’ve got the Tirtyl foaming hand soap at home that I love and I thought I would give this a try. From the foaming hand soap I have the coconut and vanilla, and the lavender and aloe. I thought the lavender and aloe sheets would smell the same as the foaming soap but it does not. Far from it. The sheets smell far too musky, strong, and more like men’s cologne on my hands. Not a fan of that one, but glad the smell doesn’t last long after the hand washing. The bergamot and Ylang ylang, and the jasmine and patchouli both smell nice but it is mild. I would say the bergamot and ylang ylang is a neutral smell, while the jasmine and patchouli are more flowery and a bit more feminine. Like I said, both are mild and after drying off my hands I can barely smell them already. One little pack fits into all my regular little inside purse pockets. I always keep soap on hand, especially since I’m allergic to most soaps kept in public restrooms and these soaps are great.\nReview Title: I love the Tirtyl soap\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lip Liner Set 12 Colors Natural Lip Liner Makeup Pencil Long Lasting Matte Velvet Lip Liner\nReview Date: 2021/08/10\nStore: Marine Forest\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Marine Forest', 'Skin Type': 'Sensitive', 'Item Form': 'Pencil', 'Finish Type': 'Matte,Velvet', 'Product Benefits': 'Smoothening', 'Product Dimensions': '6.3 x 2.28 x 0.83 inches; 1.48 Ounces', 'UPC': '729843859957'}\nReview Text: I love this set. I live in a desert and the products I use cannot dry out my lips. I pair these lip liners with color lip gloss, lip tints, and lip sticks that have passed my test. None of the products I use dry out my lips. As long as the products I use that I pair this with is good, this is great. I line my lips, not color them with it. If i did, I’m sure it would dry out my lips. I love the range of colors this set comes with, great for any occasion. The only thing I don’t like about this set is the covers for the lip liners. They don’t stay on at all. I’ve had to stick them in a zip lock bag by themselves so it doesn’t mess up my makeup bag. Easy fix though. 4.5 stars\nReview Title: Great range of colors\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user's positive experiences with the products indicate a strong satisfaction with quality, effectiveness, and value. They particularly appreciated items that provide great functionality, such as reusable cleansing pads and lip liners that paired well with other cosmetics, showing versatility. The positive feedback highlights a preference for products that perform well and enhance the user's beauty routines, especially those that are gentle on sensitive skin. The user's fondness for items offering a good combination of value and quality is evident, with certain products receiving high ratings for their ease of use and effectiveness.\n\nNEGATIVE SUMMARY:\nThe user's negative experiences primarily stem from products that did not meet expectations regarding durability and quality. Complaints were frequent about items being too fragile or breaking easily after minimal use, such as nail products that failed to adhere well or resulted in a messy application. Additionally, certain items lacked transparency in their ingredient lists, raising concerns about potential allergies. Frustration was also expressed towards products that were deemed overpriced for the small quantities or ineffective results, indicating a disappointment with value for money.\n\nOVERALL SUMMARY:\nThe user's shopping journey reflects a mix of satisfaction and disappointment. Positive interactions highlight appreciation for high-quality, effective products that cater to sensitive skin and offer good value, especially in reusable beauty items and makeup accessories. However, there is a significant portion of negative experiences marked by poor durability, lack of ingredient transparency, and high prices for inadequate results. The overall sentiment suggests a desire for more reliable and effective products while maintaining a keen eye on value and quality.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Nice and moisturizing, dark than expected",
    "text": "I thought this 02 PINK GO UP would be….a lot pinker(as shown on site picture). But it’s more mauve. While I like this color, I have about 5 of this color already and I was looking for something lighter. I do like this product. For being a matte and not a gloss I’m very surprised that it is as moisturizing as it is. It goes on smooth, very similar to a mousse lip tint I have. With this product I don’t have add chap stick or lip gloss over it because it started to chap and dry out my lips which can be a problem that I have with some other matte lipsticks. Overall I like the product and the price and if I ordered this color I would give it 4 stars. But I don’t think I would order this again because I’m not sure I would get the color I ordered.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/6179yJGLW-L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/6179yJGLW-L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/6179yJGLW-L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/717fp9IeHtL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/717fp9IeHtL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/717fp9IeHtL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09HM2T3JM",
    "parent_asin": "B09HMXY36F",
    "user_id": "AFSQYNVKFMP3WWNXTFTNBFNU3EOA",
    "timestamp": "2022-02-01 19:58:21.394000",
    "helpful_vote": 3,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Peripera Ink Mood Matte Lipstick, Lightweight, Matte, Smooth, Hydrating, Lasting Color Payoff (02 Pink Go Up)",
    "average_rating": 4.4,
    "rating_number": 242,
    "features": [
      "[SOFT SOUFFLE-LIKE TEXTURE] Inspired by the feeling of biting into a rich souffle cake, our new Ink Mood Matte Lipstick made with Pongsil-souffle complex fills in between the lips to provide a fluffy and soft application.",
      "[SMOOTH AND MATTE FINISH] Peripera's new Ink Mood Matte Lipstick glides on smoothly while providing a soft and matte finish. With one swipe, you'll get long-lasting natural, blurred and full lips!",
      "[8 MOODY SHADES] Peripera Ink Mood Matte Lipstick comes in 8 moody shades that deliver a natural color pay-off for any time and occasion. Apply for bold full lips or a dreamy, gradient look.",
      "[LASTING NATURAL COLOR PAYOFF ] Reapplication isn’t necessary thanks to its beautiful pigmentation and comfortable adhering formula that lasts all-day.",
      "[COMFORTABLE AND HYDRATING FORMULA] Formulated with Pongsil Souffle Complex, Agave Leaf Extract, and Sacha Inchi Oil, Ink Mood Matte Lipstick nourishes and moisturizes dry and rough lips for a luxuriously soft and silky application. No more worrying about flaky creased lips."
    ],
    "description": [],
    "price": 9.9,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/216k3FEZCBL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/216k3FEZCBL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/41Rc6q8Vl6L._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/216kqAO66jL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/216kqAO66jL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/41oJHzXIToL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31OnSPNl8kL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31OnSPNl8kL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/515nIBiOnKL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41PIaqMGkWL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41PIaqMGkWL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/91slDAOnw8L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Z14pPvqOL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Z14pPvqOL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61Wqtet1rDL._SL1200_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41YJ674bxNL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41YJ674bxNL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61JleRTKIBL._SL1200_.jpg"
      }
    ],
    "videos": [
      {
        "title": "so pretty shades! my fav was #2 and #5 :)",
        "url": "https://www.amazon.com/vdp/062cc4f0b994433496df6571969ff474?ref=dp_vse_rvc_0",
        "user_id": "/shop/influencer-9ad9f512"
      },
      {
        "title": "Peripera Ink Mood Matte Lipstick, 08",
        "url": "https://www.amazon.com/vdp/0787bf133a8f457f99f3a12a3c310fa8?ref=dp_vse_rvc_1",
        "user_id": "/shop/joypianomusic"
      },
      {
        "title": "Peripera Ink Mood Matte Lipstick 02",
        "url": "https://www.amazon.com/vdp/0068073e16af4e5ab26fa06fc56994c1?ref=dp_vse_rvc_2",
        "user_id": "/shop/joypianomusic"
      }
    ],
    "store": "Peripera",
    "categories": [],
    "details": {
      "Brand": "Peripera",
      "Color": "02 PINK GO UP",
      "Skin Type": "Dry",
      "Item Form": "Crayon",
      "Finish Type": "Matte",
      "Package Dimensions": "3.46 x 0.94 x 0.87 inches; 1.06 Ounces",
      "Manufacturer": "CLIO"
    },
    "bought_together": null
  }
}