{
  "user_id": "AFEYVUSF4YUXHCTHB5GDRCG73JIA",
  "summary": "=== Purchase Information ===\nProduct Title: Maniology (formerly bmc) Peel-able Temporary Short Wear Swatching Nail Lacquer Gel Polish Base Coat\nReview Date: 2015/07/22\nStore: b.m.c\nAverage Rating: 3.6\nProduct Details: {'Brand': 'B.m.c', 'Item Form': 'Gel', 'Type': 'Gel', 'Item Dimensions LxWxH': '1.1 x 1.1 x 2.6 inches', 'Item Weight': '0.05 Pounds', 'Product Dimensions': '1.1 x 1.1 x 2.6 inches; 0.8 Ounces', 'UPC': '708302916301'}\nReview Text: Read reviews and thought this would be great. Not so for me.  Clean release on some of my nail, and damaged the crap out of the lower 2/3. They looked like I had pried off acrylics. I nearly cried.  I took a fine file to them, and the damage wasn't quite so bad, except for one nail. My left thumb was badly damaged. It took weeks to grow out the damage.<br />This, however,  works ok with my teenagers nails, as she likes to peel off her nails if she gets bored (eeek) and this actually keeps her nails from being damaged. So, for her nails, its a 5, for mine, it was a 1, so I  rated it thusly.\nReview Title: Not impressed for me, works on others\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: PUEEN 168 Nail Stamping Plates Synthetic Leather Holder Case Organizer in Blue Rose Lace Pattern-BH000006\nReview Date: 2015/07/22\nStore: PUEEN\nAverage Rating: 3.8\nProduct Details: {}\nReview Text: Use this with my bmc and other plates. I haven't had any issues with it. The front feels nice, I like the texture.  Zipper works smooth. No obvious defects, sewing issues, etc. No nauseating smells when I  got it. Plastic has a smooth feel to it that I like, doesn't feel cheap. Holds plates pretty well. Turn it upside down and shake it,  yeah, you get some slipping.  I haven't had any slide out, and I've accidentally carried it around upside down quite a lot, dropped it and in one stunning display of clumsiness - I  managed to drop it, then kick it across the room, picked it up only to drop it from chest high. Sigh. And all the plates were STILL in place, and this thing is holding up quite well. Really happy with it. Recommend!\nReview Title: I love it, works great with my plates\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: b.m.c by Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-CYO 2 Collection\nReview Date: 2015/08/22\nStore: HealthMarket\nProduct Description: ['Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-2014 CYO Collection']\nAverage Rating: 4.2\nProduct Details: {'Product Dimensions': '2.2 x 2.2 x 0.1 inches; 2.4 Ounces', 'UPC': '701233192271', 'Manufacturer': 'HealthMarket'}\nReview Text: These are the stamping plates that I use all the time. I stamp over gel nail polish with konad stamping polish, Essie polish, or Sallie Hanson insta-dri polish. When you first pull off the blue protective film, clean the plates really well with acetone. Then,  I usually paint, scrape, roll, and then clean everything off without actually rolling the first stamping on my nails. I find the first stamping doesn't go well on a fresh plate, so I  just don't waste my time.<br />After doing that, they stamp fine all the time. I have found at least one image in every stamper bundle that has stamping issues. I just don't use that stamp. These plates have intricate designs that transfer well.  If you find that not all of your design is trasferring, first clean the plate really well with acetone.  All that built-up dried polish affects the stamp. There are lots of good videos on stamping troubleshooting,  too, if you are having trouble.<br />I stamp with a konad stamper, and scrape with an old credit card or empty gift cards. Metal scrapers will damage the plates.\nReview Title: My go-to stampers\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blackhead Extractor, Comedone Extractor & Blemish Remover Kit - 7 Professional Surgical Quality Tools including FREE Dentist's Mirror by Pristine Essentials + Complementary Ebook\nReview Date: 2015/09/27\nStore: Pristine Essentials\nProduct Description: ['Safe and Effective Extraction for Flawless Beautiful Skin You Deserve', 'Get Clean, Clear and Beautiful Skin Now!  Do you have blackheads, whiteheads, pimples on you face?  Are you sick of the blemishes on your skin?  Do you wish to have clean and clear skin?', 'Primary Instruments for acne extraction', \"Use these convenient tools to relieve your complexion by effectively extracting black and white heads.  This hygienic tool kit will not leave marks or scars when used properly.  The lance delicately pierces white heads when necessary and both parts of the tool can be used on face and body.  These tools feature a small loop for white heads and a flat side to extract blackheads.  The tools are designed with a pretty slate finish and the handle fits comfortably in the hand for ease and accuracy.  The angled wire end glides over whiteheads to release debris from the pore. The opposite side's long, flat loop is designed to gently press out blackheads.  100% satisfaction guaranteed or your money back no questions asked!  We cannot guarantee this SPECIAL PRICE, So be sure to add to your cart.\", 'Tips', \": You should never push too hard on a blackhead. A deep, cystic pimple should not be opened with a loop extractor. When dealing with deep acne, it's best to visit a dermatologist.\", 'TO MAKE THE DEAL EVEN BETTER WE HAVE INCLUDED A FREE EBOOK WITH TIPS ABOUT HOW TO CARE FOR YOUR SKIN']\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Pristine Essentials', 'Item Form': 'Needle', 'Material': 'Stainless Steel', 'Skin Type': 'acne prone', 'Item Weight': '137 Grams', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 2.4 x 1.1 inches; 4.83 Ounces', 'UPC': '646437950770', 'Manufacturer': 'Pristine Essentials'}\nReview Text: I have had a single tool for years. When I got the opportunity to review this product at a reduced price, I was pretty excited.<br />It comes with several tools. There are many different sizes to choose from, based on the size of the whitehead you are removing. The lancet is sharp enough to work without being dangerously sharp.<br />Besides being useful just for blackhead, whitehead or small cysts, these are also pretty useful with splinters and ingrown hairs. Comes with sterilization instructions and a very nice zippered pouch.\nReview Title: Great for face and body\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nReview Date: 2020/02/14\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nReview Text: First off, I couldn't get this wig on fully. I adjusted it as much as I could and still it didn't lay right. Apparently, I have a huge head.<br /><br />Besides that, I really was impressed with the quality. It came with the wig cap, a nice box, and false lashes. The quality is pretty darn impressive for the size. It looks and feels like real hair. Its really cute. I am pretty disappointed tjat my huge noggin keeps me from wearing it.<br /><br />Absolutely recommend for normal heads 😉\nReview Title: Nice wig, amazing quality for price\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nReview Date: 2020/07/28\nStore: Natwag\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nReview Text: I was pretty hesitant on these. I mean, my microfiber cleaning cloths are kinda rough and definitely not something I want to put on my skin. However, these are soft like a dream cloud.<br /><br />They do come with a laundry bag but I washed by hand.<br /><br />I washed one side of my face with a washcloth and the other with these. Then I swiped micellar water over each side. The microfiber side had a tiny bit of makeup residue. The washcloth side had waaaay more. I was pretty stunned.<br />I now only use these for makeup removal. And I definitely recommend 😊\nReview Title: So soft and great clean\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Dip Powder Liquid Set with Base Activator and Top Coat, 10ml x 3, for Dipping Powder Manicure System, No Including Bond Primer Brush Saver, No Need UV/LED Lamp to Cured\nReview Date: 2021/06/05\nStore: unibouti\nAverage Rating: 3.4\nProduct Details: {'Brand': 'Unibouti', 'Included Components': 'Top Coat, Dip Powder', 'Finish Type': 'Glossy', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.07 x 2.72 x 0.87 inches; 1.76 Ounces'}\nReview Text: I love dip nails but these solutions are a mess. They glue themselves shut..the brush turns to concrete. ..and so on. I thought I would give these a go. I only dislike the base coat a bit, it doesn't seem as sticky as some others I have used. It's decent,  don't get me wrong, just mho. The activator is great, dries rock hard and the top coat settles smooth and shiny. They, so far, haven't glued themselves shut or turned to rock. We'll see how well they hold up.\nReview Title: Decent top coat and strong activator\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: PHOERA 30ml Foundation Liquid Full Coverage 24HR Matte Oil Control Concealer (Nude #102) with Face Primer & Air Cushion CC Cream BB Cream Mushroom Head Foundation & Petal-Shaped Cosmetics Brush\nReview Date: 2021/09/02\nStore: SIGHTLING\nAverage Rating: 4.2\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'All', 'Finish Type': 'Matte', 'Recommended Uses For Product': 'Redness, Dark Spots, Wrinkles, Uneven Skin Tone', 'Package Information': 'Bottle', 'Package Dimensions': '6.22 x 3.5 x 3.19 inches; 8.64 Ounces'}\nReview Text: I am not a fan of the primer. It did not do good with my skin. The coverage was flawless, high-medium building up to full. it started settling into fine lines in an hour and by hour three, huge pores, wrinkles where i have none and flaking. wearing up under a mask was terrible even with setting spray, the transfer was unreal. i also tried varying primers, applicators (beauty blender, brush, the included brush which was not good for me) and it's not for long wear on me.<br />i was pretty impressed with the cc cream. the mushroom head applicator is really a beauty blender with a handle but feels pretty nice. the foundation is so pretty when it stamps onto the applicator. coverage was high medium, didn't cover all my redness but tbh nothing does when my face is flaring. and it wore pretty well until i realized i was orange. like an actual orange. so i tried different primers, all with the same result. major oxidation.<br />for coverage for an event or photos, the liquid foundation is really pretty for a few hours. i am disappointed that these didn't agree with my skin, because they are really good products.\nReview Title: The coverage is really good but not for dry skin\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tammy Taylor Beauty Gripper | Patent-Pending Makeup Sponge Blender Holder, Gripper & Drying Stand All in One | Perfect Travel Size | Made in USA\nReview Date: 2021/09/06\nStore: Tammy Taylor\nAverage Rating: 3.4\nProduct Details: {'Brand': 'Tammy Taylor', 'Item Dimensions LxWxH': '1.5 x 1.5 x 3.5 inches', 'Recommended Uses For Product': 'Travel,Blender', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 3.5 inches; 0.63 Ounces', 'Item model number': '1original', 'UPC': '764227646839'}\nReview Text: I thought these would be so cool and make my sponges be more like a mushroom head applicator. Well...i've tried it with my beauty blender, my elf blending sponges, and a generic beauty blender to no avail. the angle is just not good. I feel like i whack myself in the face pretty regularly and i've not been able to use them, tbh. it's a shame because i thought it would be good. however, maybe i'm just not getting this. I end up hitting my face with the plastic or dropping the sponge. as always, your mileage may vary.\nReview Title: I really either can't get the hang of this or it's just not for me\nRating: 2.0\n--------------------------------------------------",
  "reference": "Maniology (formerly bmc) Peel-able Temporary Short Wear Swatching Nail Lacquer Gel Polish Base Coat\nb.m.c\n{'Brand': 'B.m.c', 'Item Form': 'Gel', 'Type': 'Gel', 'Item Dimensions LxWxH': '1.1 x 1.1 x 2.6 inches', 'Item Weight': '0.05 Pounds', 'Product Dimensions': '1.1 x 1.1 x 2.6 inches; 0.8 Ounces', 'UPC': '708302916301'}\nRead reviews and thought this would be great. Not so for me.  Clean release on some of my nail, and damaged the crap out of the lower 2/3. They looked like I had pried off acrylics. I nearly cried.  I took a fine file to them, and the damage wasn't quite so bad, except for one nail. My left thumb was badly damaged. It took weeks to grow out the damage.<br />This, however,  works ok with my teenagers nails, as she likes to peel off her nails if she gets bored (eeek) and this actually keeps her nails from being damaged. So, for her nails, its a 5, for mine, it was a 1, so I  rated it thusly.\nNot impressed for me, works on others\nPUEEN 168 Nail Stamping Plates Synthetic Leather Holder Case Organizer in Blue Rose Lace Pattern-BH000006\nPUEEN\n{}\nUse this with my bmc and other plates. I haven't had any issues with it. The front feels nice, I like the texture.  Zipper works smooth. No obvious defects, sewing issues, etc. No nauseating smells when I  got it. Plastic has a smooth feel to it that I like, doesn't feel cheap. Holds plates pretty well. Turn it upside down and shake it,  yeah, you get some slipping.  I haven't had any slide out, and I've accidentally carried it around upside down quite a lot, dropped it and in one stunning display of clumsiness - I  managed to drop it, then kick it across the room, picked it up only to drop it from chest high. Sigh. And all the plates were STILL in place, and this thing is holding up quite well. Really happy with it. Recommend!\nI love it, works great with my plates\nb.m.c by Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-CYO 2 Collection\nHealthMarket\n['Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-2014 CYO Collection']\n{'Product Dimensions': '2.2 x 2.2 x 0.1 inches; 2.4 Ounces', 'UPC': '701233192271', 'Manufacturer': 'HealthMarket'}\nThese are the stamping plates that I use all the time. I stamp over gel nail polish with konad stamping polish, Essie polish, or Sallie Hanson insta-dri polish. When you first pull off the blue protective film, clean the plates really well with acetone. Then,  I usually paint, scrape, roll, and then clean everything off without actually rolling the first stamping on my nails. I find the first stamping doesn't go well on a fresh plate, so I  just don't waste my time.<br />After doing that, they stamp fine all the time. I have found at least one image in every stamper bundle that has stamping issues. I just don't use that stamp. These plates have intricate designs that transfer well.  If you find that not all of your design is trasferring, first clean the plate really well with acetone.  All that built-up dried polish affects the stamp. There are lots of good videos on stamping troubleshooting,  too, if you are having trouble.<br />I stamp with a konad stamper, and scrape with an old credit card or empty gift cards. Metal scrapers will damage the plates.\nMy go-to stampers\nBlackhead Extractor, Comedone Extractor & Blemish Remover Kit - 7 Professional Surgical Quality Tools including FREE Dentist's Mirror by Pristine Essentials + Complementary Ebook\nPristine Essentials\n['Safe and Effective Extraction for Flawless Beautiful Skin You Deserve', 'Get Clean, Clear and Beautiful Skin Now!  Do you have blackheads, whiteheads, pimples on you face?  Are you sick of the blemishes on your skin?  Do you wish to have clean and clear skin?', 'Primary Instruments for acne extraction', \"Use these convenient tools to relieve your complexion by effectively extracting black and white heads.  This hygienic tool kit will not leave marks or scars when used properly.  The lance delicately pierces white heads when necessary and both parts of the tool can be used on face and body.  These tools feature a small loop for white heads and a flat side to extract blackheads.  The tools are designed with a pretty slate finish and the handle fits comfortably in the hand for ease and accuracy.  The angled wire end glides over whiteheads to release debris from the pore. The opposite side's long, flat loop is designed to gently press out blackheads.  100% satisfaction guaranteed or your money back no questions asked!  We cannot guarantee this SPECIAL PRICE, So be sure to add to your cart.\", 'Tips', \": You should never push too hard on a blackhead. A deep, cystic pimple should not be opened with a loop extractor. When dealing with deep acne, it's best to visit a dermatologist.\", 'TO MAKE THE DEAL EVEN BETTER WE HAVE INCLUDED A FREE EBOOK WITH TIPS ABOUT HOW TO CARE FOR YOUR SKIN']\n{'Brand': 'Pristine Essentials', 'Item Form': 'Needle', 'Material': 'Stainless Steel', 'Skin Type': 'acne prone', 'Item Weight': '137 Grams', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 2.4 x 1.1 inches; 4.83 Ounces', 'UPC': '646437950770', 'Manufacturer': 'Pristine Essentials'}\nI have had a single tool for years. When I got the opportunity to review this product at a reduced price, I was pretty excited.<br />It comes with several tools. There are many different sizes to choose from, based on the size of the whitehead you are removing. The lancet is sharp enough to work without being dangerously sharp.<br />Besides being useful just for blackhead, whitehead or small cysts, these are also pretty useful with splinters and ingrown hairs. Comes with sterilization instructions and a very nice zippered pouch.\nGreat for face and body\nStraight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nFirst off, I couldn't get this wig on fully. I adjusted it as much as I could and still it didn't lay right. Apparently, I have a huge head.<br /><br />Besides that, I really was impressed with the quality. It came with the wig cap, a nice box, and false lashes. The quality is pretty darn impressive for the size. It looks and feels like real hair. Its really cute. I am pretty disappointed tjat my huge noggin keeps me from wearing it.<br /><br />Absolutely recommend for normal heads 😉\nNice wig, amazing quality for price\nNatwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nI was pretty hesitant on these. I mean, my microfiber cleaning cloths are kinda rough and definitely not something I want to put on my skin. However, these are soft like a dream cloud.<br /><br />They do come with a laundry bag but I washed by hand.<br /><br />I washed one side of my face with a washcloth and the other with these. Then I swiped micellar water over each side. The microfiber side had a tiny bit of makeup residue. The washcloth side had waaaay more. I was pretty stunned.<br />I now only use these for makeup removal. And I definitely recommend 😊\nSo soft and great clean\nNail Dip Powder Liquid Set with Base Activator and Top Coat, 10ml x 3, for Dipping Powder Manicure System, No Including Bond Primer Brush Saver, No Need UV/LED Lamp to Cured\nunibouti\n{'Brand': 'Unibouti', 'Included Components': 'Top Coat, Dip Powder', 'Finish Type': 'Glossy', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.07 x 2.72 x 0.87 inches; 1.76 Ounces'}\nI love dip nails but these solutions are a mess. They glue themselves shut..the brush turns to concrete. ..and so on. I thought I would give these a go. I only dislike the base coat a bit, it doesn't seem as sticky as some others I have used. It's decent,  don't get me wrong, just mho. The activator is great, dries rock hard and the top coat settles smooth and shiny. They, so far, haven't glued themselves shut or turned to rock. We'll see how well they hold up.\nDecent top coat and strong activator\nPHOERA 30ml Foundation Liquid Full Coverage 24HR Matte Oil Control Concealer (Nude #102) with Face Primer & Air Cushion CC Cream BB Cream Mushroom Head Foundation & Petal-Shaped Cosmetics Brush\nSIGHTLING\n{'Item Form': 'Cream', 'Skin Type': 'All', 'Finish Type': 'Matte', 'Recommended Uses For Product': 'Redness, Dark Spots, Wrinkles, Uneven Skin Tone', 'Package Information': 'Bottle', 'Package Dimensions': '6.22 x 3.5 x 3.19 inches; 8.64 Ounces'}\nI am not a fan of the primer. It did not do good with my skin. The coverage was flawless, high-medium building up to full. it started settling into fine lines in an hour and by hour three, huge pores, wrinkles where i have none and flaking. wearing up under a mask was terrible even with setting spray, the transfer was unreal. i also tried varying primers, applicators (beauty blender, brush, the included brush which was not good for me) and it's not for long wear on me.<br />i was pretty impressed with the cc cream. the mushroom head applicator is really a beauty blender with a handle but feels pretty nice. the foundation is so pretty when it stamps onto the applicator. coverage was high medium, didn't cover all my redness but tbh nothing does when my face is flaring. and it wore pretty well until i realized i was orange. like an actual orange. so i tried different primers, all with the same result. major oxidation.<br />for coverage for an event or photos, the liquid foundation is really pretty for a few hours. i am disappointed that these didn't agree with my skin, because they are really good products.\nThe coverage is really good but not for dry skin\nTammy Taylor Beauty Gripper | Patent-Pending Makeup Sponge Blender Holder, Gripper & Drying Stand All in One | Perfect Travel Size | Made in USA\nTammy Taylor\n{'Brand': 'Tammy Taylor', 'Item Dimensions LxWxH': '1.5 x 1.5 x 3.5 inches', 'Recommended Uses For Product': 'Travel,Blender', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 3.5 inches; 0.63 Ounces', 'Item model number': '1original', 'UPC': '764227646839'}\nI thought these would be so cool and make my sponges be more like a mushroom head applicator. Well...i've tried it with my beauty blender, my elf blending sponges, and a generic beauty blender to no avail. the angle is just not good. I feel like i whack myself in the face pretty regularly and i've not been able to use them, tbh. it's a shame because i thought it would be good. however, maybe i'm just not getting this. I end up hitting my face with the plastic or dropping the sponge. as always, your mileage may vary.\nI really either can't get the hang of this or it's just not for me",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Maniology (formerly bmc) Peel-able Temporary Short Wear Swatching Nail Lacquer Gel Polish Base Coat\nReview Date: 2015/07/22\nStore: b.m.c\nAverage Rating: 3.6\nProduct Details: {'Brand': 'B.m.c', 'Item Form': 'Gel', 'Type': 'Gel', 'Item Dimensions LxWxH': '1.1 x 1.1 x 2.6 inches', 'Item Weight': '0.05 Pounds', 'Product Dimensions': '1.1 x 1.1 x 2.6 inches; 0.8 Ounces', 'UPC': '708302916301'}\nReview Text: Read reviews and thought this would be great. Not so for me.  Clean release on some of my nail, and damaged the crap out of the lower 2/3. They looked like I had pried off acrylics. I nearly cried.  I took a fine file to them, and the damage wasn't quite so bad, except for one nail. My left thumb was badly damaged. It took weeks to grow out the damage.<br />This, however,  works ok with my teenagers nails, as she likes to peel off her nails if she gets bored (eeek) and this actually keeps her nails from being damaged. So, for her nails, its a 5, for mine, it was a 1, so I  rated it thusly.\nReview Title: Not impressed for me, works on others\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: PUEEN 168 Nail Stamping Plates Synthetic Leather Holder Case Organizer in Blue Rose Lace Pattern-BH000006\nReview Date: 2015/07/22\nStore: PUEEN\nAverage Rating: 3.8\nProduct Details: {}\nReview Text: Use this with my bmc and other plates. I haven't had any issues with it. The front feels nice, I like the texture.  Zipper works smooth. No obvious defects, sewing issues, etc. No nauseating smells when I  got it. Plastic has a smooth feel to it that I like, doesn't feel cheap. Holds plates pretty well. Turn it upside down and shake it,  yeah, you get some slipping.  I haven't had any slide out, and I've accidentally carried it around upside down quite a lot, dropped it and in one stunning display of clumsiness - I  managed to drop it, then kick it across the room, picked it up only to drop it from chest high. Sigh. And all the plates were STILL in place, and this thing is holding up quite well. Really happy with it. Recommend!\nReview Title: I love it, works great with my plates\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: b.m.c by Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-CYO 2 Collection\nReview Date: 2015/08/22\nStore: HealthMarket\nProduct Description: ['Bundle Monster 20pc Nail Art Image Manicure Stamping Plates-2014 CYO Collection']\nAverage Rating: 4.2\nProduct Details: {'Product Dimensions': '2.2 x 2.2 x 0.1 inches; 2.4 Ounces', 'UPC': '701233192271', 'Manufacturer': 'HealthMarket'}\nReview Text: These are the stamping plates that I use all the time. I stamp over gel nail polish with konad stamping polish, Essie polish, or Sallie Hanson insta-dri polish. When you first pull off the blue protective film, clean the plates really well with acetone. Then,  I usually paint, scrape, roll, and then clean everything off without actually rolling the first stamping on my nails. I find the first stamping doesn't go well on a fresh plate, so I  just don't waste my time.<br />After doing that, they stamp fine all the time. I have found at least one image in every stamper bundle that has stamping issues. I just don't use that stamp. These plates have intricate designs that transfer well.  If you find that not all of your design is trasferring, first clean the plate really well with acetone.  All that built-up dried polish affects the stamp. There are lots of good videos on stamping troubleshooting,  too, if you are having trouble.<br />I stamp with a konad stamper, and scrape with an old credit card or empty gift cards. Metal scrapers will damage the plates.\nReview Title: My go-to stampers\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Blackhead Extractor, Comedone Extractor & Blemish Remover Kit - 7 Professional Surgical Quality Tools including FREE Dentist's Mirror by Pristine Essentials + Complementary Ebook\nReview Date: 2015/09/27\nStore: Pristine Essentials\nProduct Description: ['Safe and Effective Extraction for Flawless Beautiful Skin You Deserve', 'Get Clean, Clear and Beautiful Skin Now!  Do you have blackheads, whiteheads, pimples on you face?  Are you sick of the blemishes on your skin?  Do you wish to have clean and clear skin?', 'Primary Instruments for acne extraction', \"Use these convenient tools to relieve your complexion by effectively extracting black and white heads.  This hygienic tool kit will not leave marks or scars when used properly.  The lance delicately pierces white heads when necessary and both parts of the tool can be used on face and body.  These tools feature a small loop for white heads and a flat side to extract blackheads.  The tools are designed with a pretty slate finish and the handle fits comfortably in the hand for ease and accuracy.  The angled wire end glides over whiteheads to release debris from the pore. The opposite side's long, flat loop is designed to gently press out blackheads.  100% satisfaction guaranteed or your money back no questions asked!  We cannot guarantee this SPECIAL PRICE, So be sure to add to your cart.\", 'Tips', \": You should never push too hard on a blackhead. A deep, cystic pimple should not be opened with a loop extractor. When dealing with deep acne, it's best to visit a dermatologist.\", 'TO MAKE THE DEAL EVEN BETTER WE HAVE INCLUDED A FREE EBOOK WITH TIPS ABOUT HOW TO CARE FOR YOUR SKIN']\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Pristine Essentials', 'Item Form': 'Needle', 'Material': 'Stainless Steel', 'Skin Type': 'acne prone', 'Item Weight': '137 Grams', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.6 x 2.4 x 1.1 inches; 4.83 Ounces', 'UPC': '646437950770', 'Manufacturer': 'Pristine Essentials'}\nReview Text: I have had a single tool for years. When I got the opportunity to review this product at a reduced price, I was pretty excited.<br />It comes with several tools. There are many different sizes to choose from, based on the size of the whitehead you are removing. The lancet is sharp enough to work without being dangerously sharp.<br />Besides being useful just for blackhead, whitehead or small cysts, these are also pretty useful with splinters and ingrown hairs. Comes with sterilization instructions and a very nice zippered pouch.\nReview Title: Great for face and body\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nReview Date: 2020/02/14\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nReview Text: First off, I couldn't get this wig on fully. I adjusted it as much as I could and still it didn't lay right. Apparently, I have a huge head.<br /><br />Besides that, I really was impressed with the quality. It came with the wig cap, a nice box, and false lashes. The quality is pretty darn impressive for the size. It looks and feels like real hair. Its really cute. I am pretty disappointed tjat my huge noggin keeps me from wearing it.<br /><br />Absolutely recommend for normal heads 😉\nReview Title: Nice wig, amazing quality for price\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nReview Date: 2020/07/28\nStore: Natwag\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nReview Text: I was pretty hesitant on these. I mean, my microfiber cleaning cloths are kinda rough and definitely not something I want to put on my skin. However, these are soft like a dream cloud.<br /><br />They do come with a laundry bag but I washed by hand.<br /><br />I washed one side of my face with a washcloth and the other with these. Then I swiped micellar water over each side. The microfiber side had a tiny bit of makeup residue. The washcloth side had waaaay more. I was pretty stunned.<br />I now only use these for makeup removal. And I definitely recommend 😊\nReview Title: So soft and great clean\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Dip Powder Liquid Set with Base Activator and Top Coat, 10ml x 3, for Dipping Powder Manicure System, No Including Bond Primer Brush Saver, No Need UV/LED Lamp to Cured\nReview Date: 2021/06/05\nStore: unibouti\nAverage Rating: 3.4\nProduct Details: {'Brand': 'Unibouti', 'Included Components': 'Top Coat, Dip Powder', 'Finish Type': 'Glossy', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.07 x 2.72 x 0.87 inches; 1.76 Ounces'}\nReview Text: I love dip nails but these solutions are a mess. They glue themselves shut..the brush turns to concrete. ..and so on. I thought I would give these a go. I only dislike the base coat a bit, it doesn't seem as sticky as some others I have used. It's decent,  don't get me wrong, just mho. The activator is great, dries rock hard and the top coat settles smooth and shiny. They, so far, haven't glued themselves shut or turned to rock. We'll see how well they hold up.\nReview Title: Decent top coat and strong activator\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: PHOERA 30ml Foundation Liquid Full Coverage 24HR Matte Oil Control Concealer (Nude #102) with Face Primer & Air Cushion CC Cream BB Cream Mushroom Head Foundation & Petal-Shaped Cosmetics Brush\nReview Date: 2021/09/02\nStore: SIGHTLING\nAverage Rating: 4.2\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'All', 'Finish Type': 'Matte', 'Recommended Uses For Product': 'Redness, Dark Spots, Wrinkles, Uneven Skin Tone', 'Package Information': 'Bottle', 'Package Dimensions': '6.22 x 3.5 x 3.19 inches; 8.64 Ounces'}\nReview Text: I am not a fan of the primer. It did not do good with my skin. The coverage was flawless, high-medium building up to full. it started settling into fine lines in an hour and by hour three, huge pores, wrinkles where i have none and flaking. wearing up under a mask was terrible even with setting spray, the transfer was unreal. i also tried varying primers, applicators (beauty blender, brush, the included brush which was not good for me) and it's not for long wear on me.<br />i was pretty impressed with the cc cream. the mushroom head applicator is really a beauty blender with a handle but feels pretty nice. the foundation is so pretty when it stamps onto the applicator. coverage was high medium, didn't cover all my redness but tbh nothing does when my face is flaring. and it wore pretty well until i realized i was orange. like an actual orange. so i tried different primers, all with the same result. major oxidation.<br />for coverage for an event or photos, the liquid foundation is really pretty for a few hours. i am disappointed that these didn't agree with my skin, because they are really good products.\nReview Title: The coverage is really good but not for dry skin\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tammy Taylor Beauty Gripper | Patent-Pending Makeup Sponge Blender Holder, Gripper & Drying Stand All in One | Perfect Travel Size | Made in USA\nReview Date: 2021/09/06\nStore: Tammy Taylor\nAverage Rating: 3.4\nProduct Details: {'Brand': 'Tammy Taylor', 'Item Dimensions LxWxH': '1.5 x 1.5 x 3.5 inches', 'Recommended Uses For Product': 'Travel,Blender', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 3.5 inches; 0.63 Ounces', 'Item model number': '1original', 'UPC': '764227646839'}\nReview Text: I thought these would be so cool and make my sponges be more like a mushroom head applicator. Well...i've tried it with my beauty blender, my elf blending sponges, and a generic beauty blender to no avail. the angle is just not good. I feel like i whack myself in the face pretty regularly and i've not been able to use them, tbh. it's a shame because i thought it would be good. however, maybe i'm just not getting this. I end up hitting my face with the plastic or dropping the sponge. as always, your mileage may vary.\nReview Title: I really either can't get the hang of this or it's just not for me\nRating: 2.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has expressed satisfaction with several products that demonstrate strong performance and desirable features. Specifically, a nail stamping plate organizer was praised for its quality construction, durability, and user-friendly design. It held items securely through various mishaps, indicating reliability. The reusable makeup remover pads received high commendation for their softness and effectiveness in removing makeup, surpassing traditional methods. Additionally, a wig showed impressive quality, with the user noting its realistic appearance and pleasant texture, although fitting issues were a concern. Overall, the user finds certain products to enhance their nail and beauty routines positively.\n\nNEGATIVE SUMMARY:\nConversely, there were notable disappointments with certain purchases. A peel-able nail lacquer caused significant damage to the user's nails, leading to frustration, while another product featured issues with residue and frustration regarding usability. A makeup foundation did not perform well on the user's skin type, leading to oxidation and discomfort over wear despite initial good coverage. Furthermore, a makeup sponge holder did not meet the user's expectations, leading to a sense of ineffectiveness and disappointment. These experiences highlight inconsistencies in product quality and performance.\n\nOVERALL SUMMARY:\nThe user's shopping experiences reflect a mixture of satisfaction and disappointment across various products. Positive experiences predominantly stem from well-made items that enhance beauty routines, particularly in nail care and makeup removal. However, several products resulted in negative outcomes due to poor fit, usability issues, or inadequate performance, particularly concerning skin compatibility. This fluctuation in experiences suggests the user values both quality and effectiveness, seeking out reliable products while encountering challenges with others that fall short of expectations.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Comfortable,  stays put",
    "text": "So I'll be honest and say first up these confused me.. I thought there would be like a little band for adjusting but no.. you can move the two pieces around to make tighter,, looser,, styled.. I wear these a lot.. they really stay in place.. after use I wash with a litte shampoo and hang to dry. For reference,  I am an RN so I get moving around a lot with them",
    "images": [],
    "asin": "B095YJMPS3",
    "parent_asin": "B095YJMPS3",
    "user_id": "AFEYVUSF4YUXHCTHB5GDRCG73JIA",
    "timestamp": "2021-10-16 02:21:28.738000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "8 Pack Headbands for Women Wide Head Wrap Knotted Elastic Teen Girls Yoga Workout Hair Accessories (Color M)",
    "average_rating": 3.8,
    "rating_number": 7,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/61Qf8Z6IqQS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/61Qf8Z6IqQS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/919FIDXajqS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61O0030YBFS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/61O0030YBFS.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/91GJYAGHhiS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41sRcEMUIzS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41sRcEMUIzS.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/81na2q7A8RS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/414F97unG6S._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/414F97unG6S.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71vHqcphCES._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51tCoWqUxoS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51tCoWqUxoS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71cfsUORSNS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51uiEKYSMmS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51uiEKYSMmS.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81QUJLQ8XwS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41XKxx63mFS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41XKxx63mFS.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/713SX6pSC7S._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Cmonie",
    "categories": [],
    "details": {
      "Material": "Elastic",
      "Fabric Type": "Elastic",
      "Brand": "Cmonie",
      "Size": "Medium",
      "Item Form": "Wrap",
      "Package Dimensions": "9.06 x 8.46 x 1.89 inches; 8.15 Ounces"
    },
    "bought_together": null
  }
}