{
  "user_id": "AEFRTLVCVRALKXBED77KHPIXEPWQ",
  "summary": "=== Purchase Information ===\nProduct Title: ABOUT ME MediAnswer Collagen Firming Up Mask 4ea (1box) 25g - 77% Pure Collagen Extract Anti-Aging Total Care Facial Mask Sheet, Powerful Hydrating and Anti-Wrinkle Night Skin Care\nReview Date: 2020/01/16\nStore: Samyang\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Samyang', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Fresh', 'Special Feature': 'Not Tested On Animals', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 6.3 x 0.9 inches; 0.88 Ounces'}\nReview Text: Pros: I had noticeably firmer skin after one use. It was cold and relaxing.<br /><br />Cons: The instructions on how to use are in Chinese. It's is a little difficult to position as the mask itself feels very much like slimy loose skin. My face turned red - but I do have very sensitive skin.<br /><br />Overall I was happy with the tighter looking skin. You will definitely look like something out of a horror movie when you wear this face mask so don't wear it around small children (see picture).\nReview Title: Works\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mens Sea Facial Detox Facial Mask Sheet for Oily Skin- New Skincare - Blackhead, Pore Cleansing, Peel-off (Age under 35)\nReview Date: 2020/01/22\nStore: SeptCity\nAverage Rating: 3.9\nProduct Details: {'Brand': 'SeptCity', 'Item Form': 'Sheet', 'Product Benefits': 'Detoxifying', 'Skin Type': 'Oily', 'Unit Count': '6.00 Count', 'Product Dimensions': '7.09 x 5.51 x 0.79 inches; 2.4 Ounces', 'UPC': '733424600616'}\nReview Text: I was skeptical when I first opened the pouch for this mask and found a dry sheet that seemingly was just a paper towel with cut outs but when I followed the directions and soaked it in water for a minute it became thick and almost skin like. I suggest when you place it in water to soak it unfolded and flat if possible because I had just added water to the pouch and let it soak folded in that and it was difficult to unfold. The eye holes and mouth holes were a bit too small for me so I will likely cut the holes bigger before soaking next time. Overall it did hydrate my skin some but not to the point where I wouldn't need to use moisturizer as I still had some dry patches. I did not experience any redness from this and for the rest of the day my skin has felt tighter. I prefer the sheer masks that come pre mositened mostly because it saves me a step but it does do what it says it will do.\nReview Title: Hydrates ok\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MainBasics Headband with Buttons for Face Masks (Gray)\nReview Date: 2020/06/14\nStore: MainBasics\nAverage Rating: 3.7\nProduct Details: {'Number of Items': '1', 'Brand': 'MainBasics', 'Unit Count': '1.00 Count', 'Package Dimensions': '9.5 x 3.5 x 0.3 inches; 0.81 Ounces', 'UPC': '790887351233'}\nReview Text: It is a soft material headband and it is comfortable to wear. You do need to make sure the headband is flat against your head or your mask elastic will keep popping off the buttons though. It does give your ears a break if you have to wear a mask all day. I wish the buttons were more firmly sewn in place though.\nReview Title: Works\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SUIBOBO skincare 100% quartz jade roller and Essential Oil bottle eye roller-real jade crystal gem stone marble cuarzo ice cold anti aging anti puff facial face roller eye roller massager\nReview Date: 2020/06/18\nStore: SUIBOBO\nAverage Rating: 4.8\nProduct Details: {'Package Dimensions': '7.13 x 3.66 x 1.46 inches; 7.16 Ounces', 'UPC': '619470980790', 'Manufacturer': 'HENNSERY CRAFT LIMITED'}\nReview Text: Easy to use and comes packaged nicely - very giftable. This roller provides a nice massage for my face and has a cool feeling to it. I like to use it with my face moisturizer. The essential oil roller is a nice bonus.\nReview Title: Relaxing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LAPCOS 24K Gold Foil Hydrogel Eye Mask (1 Pack) Under Eye Patches for Dark Circles, Puffiness, Fine Lines & Wrinkles - Anti-Aging Korean Eye Patches to Firm & Smooth Under Eye Skin\nReview Date: 2020/06/23\nStore: LAPCOS\nProduct Description: [\"This\\xa0luxurious hydrogel patch tackles the major signs of dark circles, puffiness, fine lines, and wrinkles for a glowing, revitalized appearance. Elevated by the power of Pure Gold to strengthen elastin, fight free radicals and stimulate blood flow achieving the ultimate level of radiance. Benefits: + Revitalizes and clarifies the under eye for a radiant glow + Helps to reverse the appearance of sun damage and age spots for an even complexion + Fights free radicals and protects against environmental aggressors Hero Ingredients Pure Gold An ingredient rumoured to be used in Cleopatra’s skincare routine, gold is revitalizing and clarifying. Known for its antioxidant and anti-inflammatory properties, the precious metal strengthens elastin, fights free radicals and stimulates blood flow for a firm, even, and radiant complexion. Niacinamide A form of vitamin B3, this skin-restoring ingredient minimizes the appearance of pores, uneven skin tone and wrinkles while maximizing skin radiance and glow. Royal Jelly Extract This honey bee secretion filled with vitamins A, E, C and B and protective immune proteins, defends against free radicals and environmental stressors that cause premature cell aging, and is responsible for a young bee developing into a queen bee. Details Hero Ingredients: Pure Gold, Niacinamide and Royal Jelly Extract Ideal for these Concerns: dark circles, puffiness, fine lines and wrinkles Preferences: Cruelty-free,\\xa0Sulfate-free Application Area: Under Eyes How to use: After cleansing, use toner to create a smooth skin base. Open package, remove supporter and place the mask on the outer corners to fit the eye shape. After 10-20 minutes, peel the mask off and lightly dab the remaining essence left on your skin. Full ingredient list Disclaimer: Ingredients are subject to change at the manufacturer's discretion. For the most complete and up-to-date list of ingredients, refer to the product packaging.) Disclaimer:Ingredients are subject to change at the manufacturer’s discretion. Actual packaging may vary, for the complete and up-to-date ingredients, refer to the product packaging. Please read labels, warnings and directions before use.\"]\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '5.12 x 3.94 x 0.24 inches; 0.71 Ounces', 'Item model number': 'A00FS153', 'UPC': '818929022900'}\nReview Text: I only got a 1 pack so it may take a lot longer to see any results. I have used gold under eye masks before and this one wasn't as good. I like to put them in the refrigerator for a nice cooling effect when I wake up in morning and usually the cool feeling lasts 10 mins but with these after a minute it wasn't cool anymore. My eyes didnt look any brighter underneath after wearing for 20 mins. They do feel more moisturized so I gave 3 stars because of that.\nReview Title: They are ok\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: [Abib] Creme coating mask Tone-up solution 17g (5pcs)\nReview Date: 2020/07/27\nStore: Abib\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Abib', 'Scent': 'Unscented', 'Number of Items': '5', 'Package Dimensions': '8.7 x 6.2 x 0.8 inches; 8.01 Ounces'}\nReview Text: This mask looks pretty terrifying when on but it does a fantastic job of soothing the skin. My skin is very pale and gets sections of redness easily and when I woke up this morning I had no red sections and my skin was really hydrated. It did leave my skin a bit oily looking but I used an oil paper to pull that out and my skin looked great after that.\nReview Title: Very soothing\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Reusable Cotton Swab Portable Silicone Swab Washable Cotton Swabs for Ear Cleaning Beauty Treatment Makeup Cotton Swab\nReview Date: 2020/09/24\nStore: JAOYU\nAverage Rating: 4.5\nProduct Details: {'Product Dimensions': '3.2 x 3.2 x 0.39 inches', 'UPC': '739232135913'}\nReview Text: I love these silicone \"cotton swabs\"!! I personally have a problem with the feeling of cotton balls and cotton swabs but they are useful. I didn't even realize something like this existed so I was super excited to try it out. I used it for touching up makeup and they are really easy to use and clean. It comes with different textured heads too so it's very versatile.\nReview Title: Love these\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Avajar Perfect V Lifting Premium Eye Mask 5 Sets(10 Pairs) - Under Eye Collagen Patch | Hydrogel Anti Aging Mask for Puffy Eyes & Bags, Dark Circles and Wrinkles | Elasticity Improvement Pad\nReview Date: 2020/09/25\nStore: a DAILY SELF-CARE COSMETICS avajar\nAverage Rating: 3.3\nProduct Details: {'Brand': 'a DAILY SELF-CARE COSMETICS avajar', 'Item Form': 'Mask', 'Product Benefits': 'Hydrating', 'Scent': 'Hydrogel', 'Skin Type': 'All', 'Product Dimensions': '4.33 x 2.17 x 5.91 inches; 4.66 Ounces'}\nReview Text: I was surprised when the instructions said to leave these on for 1 to 2 hours as I am used to other under eye patches only being on for 20 mins. I had the patches on for 1 hour and 25 mins. It had a slightly cool feeling the whole time it was on. I have sensitive skin and had no adverse reaction to it. I was impressed that my eye puffiness was visibly reduced.\nReview Title: Reduced puffiness\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Panama Jack Sunscreen Lip Balm - SPF 45, Tropical & Mango 6 Pack Plus, Broad Spectrum UVA-UVB Sunscreen Protection, Prevents & Soothes Dry, Chapped Lips\nReview Date: 2020/10/19\nStore: Panama Jack\nAverage Rating: 4.9\nProduct Details: {'Scent': 'Mango', 'Product Benefits': 'Soothing', 'Item Weight': '4.25 Grams', 'Number of Items': '6', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 4.72 x 1.34 inches; 0.15 Ounces'}\nReview Text: I have sensitive lips so I tend to only use nivea lip gloss but I wanted something with better sun protection. This one didn't cause my lips to get itchy or dry and goes on very smooth. There is hardly any scent to it and no flavor except for a slight sunscreen taste. Overall I like it because it provided great sun protection.\nReview Title: Smooth\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EASYDEW Fill Up Volume Spot 0.67 fl oz -Anti-Aging Filler Spot Good for Topical Wrinkle Care with Hyaluronic Acid I Moisturizer with Instant Filling Effect and Skin Renewal | For Topical Area\nReview Date: 2020/10/31\nStore: EASYDEW\nAverage Rating: 4.1\nProduct Details: {'Brand': 'EASYDEW', 'Scent': 'Aloe Vera', 'Item Form': 'Cream', 'Active Ingredients': 'Hyaluronic acid', 'Number of Items': '1', 'Product Dimensions': '1.46 x 0.91 x 5.71 inches; 1.41 Ounces'}\nReview Text: I've used for 3 days now and haven't noticed any difference. It might work after a longer period of use. That being said, I have sensitive skin and didn't have any bad reactions to this and a little bit does go a long way.\nReview Title: Haven't noticed results\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nReview Date: 2020/11/22\nStore: UJM\nAverage Rating: 4.2\nProduct Details: {'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nReview Text: This was my first time ever putting on fake lashes of any kind so any issues I had may have been operator error. I'm not the best at liquid eyeliner so some dripped in my eye which wasn't super fun. After the eyeliner dried the lashes stuck to it great! Fake eyelashes feel weird on but again I am new to it. They looked great though.\nReview Title: Great quality lashes\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: hominem Face and Beard Serum from Manilla Natural Skincare\nReview Date: 2021/01/23\nStore: Manilla Natural Skincare\nAverage Rating: 3.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches'}\nReview Text: This beard and face oil has a sweet smell that is hard for me to place. I do like the scent but I can't think of anything to compare it to. The oil came wrapped in bubble wrap and in a zip lock style small bag but it wasn't sealed so that is really my only complaint. Other than that the oil moisturized skin well and it didn't leak at all in shipping process.\nReview Title: Sweet smell\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fishdown 4Pcs Hair Bun Maker Women Hair Bun Shaper Accessories Classy Multicolor Cloth Magic Clip Girls Hairstyle Must-haves Tool\nReview Date: 2021/07/26\nStore: Fishdown\nAverage Rating: 1.6\nProduct Details: {'Color': 'Multicolor', 'Material': 'Cotton', 'Brand': 'Fishdown', 'Hair Type': 'Straight', 'Number of Pieces': '4', 'Package Dimensions': '13.86 x 3.78 x 1.57 inches; 2.89 Ounces'}\nReview Text: So I really like the concept of this and it's super quick and easy to use in my daughter's hair but it's definitely better for adults. It's rather large and ended up falling out of my daughter's hair after a few hours. She does have long hair so I thought it would work for her but I definitely want to see if I can find this in a smaller size.\nReview Title: Easy to use\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Summer Crystal Straw Hat Girl Alligator Hair Clip (Valentine Rose)\nReview Date: 2021/11/10\nStore: Summer Crystal\nAverage Rating: 5.0\nProduct Details: {'Product Dimensions': '4 x 4 x 1.25 inches; 0.88 Ounces', 'UPC': '635638429536'}\nReview Text: This hat hair clip is so cute!! It holds in the hair well and is perfect for a sundress accessory. Well made - good quality!\nReview Title: So cute\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Peripera Ink Mood Matte Lipstick, Lightweight, Matte, Smooth, Hydrating, Lasting Color Payoff (02 Pink Go Up)\nReview Date: 2021/11/10\nStore: Peripera\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Peripera', 'Color': '02 PINK GO UP', 'Skin Type': 'Dry', 'Item Form': 'Crayon', 'Finish Type': 'Matte', 'Package Dimensions': '3.46 x 0.94 x 0.87 inches; 1.06 Ounces', 'Manufacturer': 'CLIO'}\nReview Text: In the colder weather my lips get really pale but most lipsticks I try don't look natural enough for daily wear. This one is different. It's matte so it looks more natural and the color is gorgeous. It lasted about 4 hours before needing to reapply so that would be my only complaint but overall it's great.\nReview Title: Beautiful natural color\nRating: 4.0\n--------------------------------------------------",
  "reference": "ABOUT ME MediAnswer Collagen Firming Up Mask 4ea (1box) 25g - 77% Pure Collagen Extract Anti-Aging Total Care Facial Mask Sheet, Powerful Hydrating and Anti-Wrinkle Night Skin Care\nSamyang\n{'Brand': 'Samyang', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Fresh', 'Special Feature': 'Not Tested On Animals', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 6.3 x 0.9 inches; 0.88 Ounces'}\nPros: I had noticeably firmer skin after one use. It was cold and relaxing.<br /><br />Cons: The instructions on how to use are in Chinese. It's is a little difficult to position as the mask itself feels very much like slimy loose skin. My face turned red - but I do have very sensitive skin.<br /><br />Overall I was happy with the tighter looking skin. You will definitely look like something out of a horror movie when you wear this face mask so don't wear it around small children (see picture).\nWorks\nMens Sea Facial Detox Facial Mask Sheet for Oily Skin- New Skincare - Blackhead, Pore Cleansing, Peel-off (Age under 35)\nSeptCity\n{'Brand': 'SeptCity', 'Item Form': 'Sheet', 'Product Benefits': 'Detoxifying', 'Skin Type': 'Oily', 'Unit Count': '6.00 Count', 'Product Dimensions': '7.09 x 5.51 x 0.79 inches; 2.4 Ounces', 'UPC': '733424600616'}\nI was skeptical when I first opened the pouch for this mask and found a dry sheet that seemingly was just a paper towel with cut outs but when I followed the directions and soaked it in water for a minute it became thick and almost skin like. I suggest when you place it in water to soak it unfolded and flat if possible because I had just added water to the pouch and let it soak folded in that and it was difficult to unfold. The eye holes and mouth holes were a bit too small for me so I will likely cut the holes bigger before soaking next time. Overall it did hydrate my skin some but not to the point where I wouldn't need to use moisturizer as I still had some dry patches. I did not experience any redness from this and for the rest of the day my skin has felt tighter. I prefer the sheer masks that come pre mositened mostly because it saves me a step but it does do what it says it will do.\nHydrates ok\nMainBasics Headband with Buttons for Face Masks (Gray)\nMainBasics\n{'Number of Items': '1', 'Brand': 'MainBasics', 'Unit Count': '1.00 Count', 'Package Dimensions': '9.5 x 3.5 x 0.3 inches; 0.81 Ounces', 'UPC': '790887351233'}\nIt is a soft material headband and it is comfortable to wear. You do need to make sure the headband is flat against your head or your mask elastic will keep popping off the buttons though. It does give your ears a break if you have to wear a mask all day. I wish the buttons were more firmly sewn in place though.\nWorks\nSUIBOBO skincare 100% quartz jade roller and Essential Oil bottle eye roller-real jade crystal gem stone marble cuarzo ice cold anti aging anti puff facial face roller eye roller massager\nSUIBOBO\n{'Package Dimensions': '7.13 x 3.66 x 1.46 inches; 7.16 Ounces', 'UPC': '619470980790', 'Manufacturer': 'HENNSERY CRAFT LIMITED'}\nEasy to use and comes packaged nicely - very giftable. This roller provides a nice massage for my face and has a cool feeling to it. I like to use it with my face moisturizer. The essential oil roller is a nice bonus.\nRelaxing\nLAPCOS 24K Gold Foil Hydrogel Eye Mask (1 Pack) Under Eye Patches for Dark Circles, Puffiness, Fine Lines & Wrinkles - Anti-Aging Korean Eye Patches to Firm & Smooth Under Eye Skin\nLAPCOS\n[\"This\\xa0luxurious hydrogel patch tackles the major signs of dark circles, puffiness, fine lines, and wrinkles for a glowing, revitalized appearance. Elevated by the power of Pure Gold to strengthen elastin, fight free radicals and stimulate blood flow achieving the ultimate level of radiance. Benefits: + Revitalizes and clarifies the under eye for a radiant glow + Helps to reverse the appearance of sun damage and age spots for an even complexion + Fights free radicals and protects against environmental aggressors Hero Ingredients Pure Gold An ingredient rumoured to be used in Cleopatra’s skincare routine, gold is revitalizing and clarifying. Known for its antioxidant and anti-inflammatory properties, the precious metal strengthens elastin, fights free radicals and stimulates blood flow for a firm, even, and radiant complexion. Niacinamide A form of vitamin B3, this skin-restoring ingredient minimizes the appearance of pores, uneven skin tone and wrinkles while maximizing skin radiance and glow. Royal Jelly Extract This honey bee secretion filled with vitamins A, E, C and B and protective immune proteins, defends against free radicals and environmental stressors that cause premature cell aging, and is responsible for a young bee developing into a queen bee. Details Hero Ingredients: Pure Gold, Niacinamide and Royal Jelly Extract Ideal for these Concerns: dark circles, puffiness, fine lines and wrinkles Preferences: Cruelty-free,\\xa0Sulfate-free Application Area: Under Eyes How to use: After cleansing, use toner to create a smooth skin base. Open package, remove supporter and place the mask on the outer corners to fit the eye shape. After 10-20 minutes, peel the mask off and lightly dab the remaining essence left on your skin. Full ingredient list Disclaimer: Ingredients are subject to change at the manufacturer's discretion. For the most complete and up-to-date list of ingredients, refer to the product packaging.) Disclaimer:Ingredients are subject to change at the manufacturer’s discretion. Actual packaging may vary, for the complete and up-to-date ingredients, refer to the product packaging. Please read labels, warnings and directions before use.\"]\n{'Package Dimensions': '5.12 x 3.94 x 0.24 inches; 0.71 Ounces', 'Item model number': 'A00FS153', 'UPC': '818929022900'}\nI only got a 1 pack so it may take a lot longer to see any results. I have used gold under eye masks before and this one wasn't as good. I like to put them in the refrigerator for a nice cooling effect when I wake up in morning and usually the cool feeling lasts 10 mins but with these after a minute it wasn't cool anymore. My eyes didnt look any brighter underneath after wearing for 20 mins. They do feel more moisturized so I gave 3 stars because of that.\nThey are ok\n[Abib] Creme coating mask Tone-up solution 17g (5pcs)\nAbib\n{'Brand': 'Abib', 'Scent': 'Unscented', 'Number of Items': '5', 'Package Dimensions': '8.7 x 6.2 x 0.8 inches; 8.01 Ounces'}\nThis mask looks pretty terrifying when on but it does a fantastic job of soothing the skin. My skin is very pale and gets sections of redness easily and when I woke up this morning I had no red sections and my skin was really hydrated. It did leave my skin a bit oily looking but I used an oil paper to pull that out and my skin looked great after that.\nVery soothing\nReusable Cotton Swab Portable Silicone Swab Washable Cotton Swabs for Ear Cleaning Beauty Treatment Makeup Cotton Swab\nJAOYU\n{'Product Dimensions': '3.2 x 3.2 x 0.39 inches', 'UPC': '739232135913'}\nI love these silicone \"cotton swabs\"!! I personally have a problem with the feeling of cotton balls and cotton swabs but they are useful. I didn't even realize something like this existed so I was super excited to try it out. I used it for touching up makeup and they are really easy to use and clean. It comes with different textured heads too so it's very versatile.\nLove these\nAvajar Perfect V Lifting Premium Eye Mask 5 Sets(10 Pairs) - Under Eye Collagen Patch | Hydrogel Anti Aging Mask for Puffy Eyes & Bags, Dark Circles and Wrinkles | Elasticity Improvement Pad\na DAILY SELF-CARE COSMETICS avajar\n{'Brand': 'a DAILY SELF-CARE COSMETICS avajar', 'Item Form': 'Mask', 'Product Benefits': 'Hydrating', 'Scent': 'Hydrogel', 'Skin Type': 'All', 'Product Dimensions': '4.33 x 2.17 x 5.91 inches; 4.66 Ounces'}\nI was surprised when the instructions said to leave these on for 1 to 2 hours as I am used to other under eye patches only being on for 20 mins. I had the patches on for 1 hour and 25 mins. It had a slightly cool feeling the whole time it was on. I have sensitive skin and had no adverse reaction to it. I was impressed that my eye puffiness was visibly reduced.\nReduced puffiness\nPanama Jack Sunscreen Lip Balm - SPF 45, Tropical & Mango 6 Pack Plus, Broad Spectrum UVA-UVB Sunscreen Protection, Prevents & Soothes Dry, Chapped Lips\nPanama Jack\n{'Scent': 'Mango', 'Product Benefits': 'Soothing', 'Item Weight': '4.25 Grams', 'Number of Items': '6', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 4.72 x 1.34 inches; 0.15 Ounces'}\nI have sensitive lips so I tend to only use nivea lip gloss but I wanted something with better sun protection. This one didn't cause my lips to get itchy or dry and goes on very smooth. There is hardly any scent to it and no flavor except for a slight sunscreen taste. Overall I like it because it provided great sun protection.\nSmooth\nEASYDEW Fill Up Volume Spot 0.67 fl oz -Anti-Aging Filler Spot Good for Topical Wrinkle Care with Hyaluronic Acid I Moisturizer with Instant Filling Effect and Skin Renewal | For Topical Area\nEASYDEW\n{'Brand': 'EASYDEW', 'Scent': 'Aloe Vera', 'Item Form': 'Cream', 'Active Ingredients': 'Hyaluronic acid', 'Number of Items': '1', 'Product Dimensions': '1.46 x 0.91 x 5.71 inches; 1.41 Ounces'}\nI've used for 3 days now and haven't noticed any difference. It might work after a longer period of use. That being said, I have sensitive skin and didn't have any bad reactions to this and a little bit does go a long way.\nHaven't noticed results\nUJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nUJM\n{'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nThis was my first time ever putting on fake lashes of any kind so any issues I had may have been operator error. I'm not the best at liquid eyeliner so some dripped in my eye which wasn't super fun. After the eyeliner dried the lashes stuck to it great! Fake eyelashes feel weird on but again I am new to it. They looked great though.\nGreat quality lashes\nhominem Face and Beard Serum from Manilla Natural Skincare\nManilla Natural Skincare\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches'}\nThis beard and face oil has a sweet smell that is hard for me to place. I do like the scent but I can't think of anything to compare it to. The oil came wrapped in bubble wrap and in a zip lock style small bag but it wasn't sealed so that is really my only complaint. Other than that the oil moisturized skin well and it didn't leak at all in shipping process.\nSweet smell\nFishdown 4Pcs Hair Bun Maker Women Hair Bun Shaper Accessories Classy Multicolor Cloth Magic Clip Girls Hairstyle Must-haves Tool\nFishdown\n{'Color': 'Multicolor', 'Material': 'Cotton', 'Brand': 'Fishdown', 'Hair Type': 'Straight', 'Number of Pieces': '4', 'Package Dimensions': '13.86 x 3.78 x 1.57 inches; 2.89 Ounces'}\nSo I really like the concept of this and it's super quick and easy to use in my daughter's hair but it's definitely better for adults. It's rather large and ended up falling out of my daughter's hair after a few hours. She does have long hair so I thought it would work for her but I definitely want to see if I can find this in a smaller size.\nEasy to use\nSummer Crystal Straw Hat Girl Alligator Hair Clip (Valentine Rose)\nSummer Crystal\n{'Product Dimensions': '4 x 4 x 1.25 inches; 0.88 Ounces', 'UPC': '635638429536'}\nThis hat hair clip is so cute!! It holds in the hair well and is perfect for a sundress accessory. Well made - good quality!\nSo cute\nPeripera Ink Mood Matte Lipstick, Lightweight, Matte, Smooth, Hydrating, Lasting Color Payoff (02 Pink Go Up)\nPeripera\n{'Brand': 'Peripera', 'Color': '02 PINK GO UP', 'Skin Type': 'Dry', 'Item Form': 'Crayon', 'Finish Type': 'Matte', 'Package Dimensions': '3.46 x 0.94 x 0.87 inches; 1.06 Ounces', 'Manufacturer': 'CLIO'}\nIn the colder weather my lips get really pale but most lipsticks I try don't look natural enough for daily wear. This one is different. It's matte so it looks more natural and the color is gorgeous. It lasted about 4 hours before needing to reapply so that would be my only complaint but overall it's great.\nBeautiful natural color",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: ABOUT ME MediAnswer Collagen Firming Up Mask 4ea (1box) 25g - 77% Pure Collagen Extract Anti-Aging Total Care Facial Mask Sheet, Powerful Hydrating and Anti-Wrinkle Night Skin Care\nReview Date: 2020/01/16\nStore: Samyang\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Samyang', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Fresh', 'Special Feature': 'Not Tested On Animals', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 6.3 x 0.9 inches; 0.88 Ounces'}\nReview Text: Pros: I had noticeably firmer skin after one use. It was cold and relaxing.<br /><br />Cons: The instructions on how to use are in Chinese. It's is a little difficult to position as the mask itself feels very much like slimy loose skin. My face turned red - but I do have very sensitive skin.<br /><br />Overall I was happy with the tighter looking skin. You will definitely look like something out of a horror movie when you wear this face mask so don't wear it around small children (see picture).\nReview Title: Works\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mens Sea Facial Detox Facial Mask Sheet for Oily Skin- New Skincare - Blackhead, Pore Cleansing, Peel-off (Age under 35)\nReview Date: 2020/01/22\nStore: SeptCity\nAverage Rating: 3.9\nProduct Details: {'Brand': 'SeptCity', 'Item Form': 'Sheet', 'Product Benefits': 'Detoxifying', 'Skin Type': 'Oily', 'Unit Count': '6.00 Count', 'Product Dimensions': '7.09 x 5.51 x 0.79 inches; 2.4 Ounces', 'UPC': '733424600616'}\nReview Text: I was skeptical when I first opened the pouch for this mask and found a dry sheet that seemingly was just a paper towel with cut outs but when I followed the directions and soaked it in water for a minute it became thick and almost skin like. I suggest when you place it in water to soak it unfolded and flat if possible because I had just added water to the pouch and let it soak folded in that and it was difficult to unfold. The eye holes and mouth holes were a bit too small for me so I will likely cut the holes bigger before soaking next time. Overall it did hydrate my skin some but not to the point where I wouldn't need to use moisturizer as I still had some dry patches. I did not experience any redness from this and for the rest of the day my skin has felt tighter. I prefer the sheer masks that come pre mositened mostly because it saves me a step but it does do what it says it will do.\nReview Title: Hydrates ok\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MainBasics Headband with Buttons for Face Masks (Gray)\nReview Date: 2020/06/14\nStore: MainBasics\nAverage Rating: 3.7\nProduct Details: {'Number of Items': '1', 'Brand': 'MainBasics', 'Unit Count': '1.00 Count', 'Package Dimensions': '9.5 x 3.5 x 0.3 inches; 0.81 Ounces', 'UPC': '790887351233'}\nReview Text: It is a soft material headband and it is comfortable to wear. You do need to make sure the headband is flat against your head or your mask elastic will keep popping off the buttons though. It does give your ears a break if you have to wear a mask all day. I wish the buttons were more firmly sewn in place though.\nReview Title: Works\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SUIBOBO skincare 100% quartz jade roller and Essential Oil bottle eye roller-real jade crystal gem stone marble cuarzo ice cold anti aging anti puff facial face roller eye roller massager\nReview Date: 2020/06/18\nStore: SUIBOBO\nAverage Rating: 4.8\nProduct Details: {'Package Dimensions': '7.13 x 3.66 x 1.46 inches; 7.16 Ounces', 'UPC': '619470980790', 'Manufacturer': 'HENNSERY CRAFT LIMITED'}\nReview Text: Easy to use and comes packaged nicely - very giftable. This roller provides a nice massage for my face and has a cool feeling to it. I like to use it with my face moisturizer. The essential oil roller is a nice bonus.\nReview Title: Relaxing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LAPCOS 24K Gold Foil Hydrogel Eye Mask (1 Pack) Under Eye Patches for Dark Circles, Puffiness, Fine Lines & Wrinkles - Anti-Aging Korean Eye Patches to Firm & Smooth Under Eye Skin\nReview Date: 2020/06/23\nStore: LAPCOS\nProduct Description: [\"This\\xa0luxurious hydrogel patch tackles the major signs of dark circles, puffiness, fine lines, and wrinkles for a glowing, revitalized appearance. Elevated by the power of Pure Gold to strengthen elastin, fight free radicals and stimulate blood flow achieving the ultimate level of radiance. Benefits: + Revitalizes and clarifies the under eye for a radiant glow + Helps to reverse the appearance of sun damage and age spots for an even complexion + Fights free radicals and protects against environmental aggressors Hero Ingredients Pure Gold An ingredient rumoured to be used in Cleopatra’s skincare routine, gold is revitalizing and clarifying. Known for its antioxidant and anti-inflammatory properties, the precious metal strengthens elastin, fights free radicals and stimulates blood flow for a firm, even, and radiant complexion. Niacinamide A form of vitamin B3, this skin-restoring ingredient minimizes the appearance of pores, uneven skin tone and wrinkles while maximizing skin radiance and glow. Royal Jelly Extract This honey bee secretion filled with vitamins A, E, C and B and protective immune proteins, defends against free radicals and environmental stressors that cause premature cell aging, and is responsible for a young bee developing into a queen bee. Details Hero Ingredients: Pure Gold, Niacinamide and Royal Jelly Extract Ideal for these Concerns: dark circles, puffiness, fine lines and wrinkles Preferences: Cruelty-free,\\xa0Sulfate-free Application Area: Under Eyes How to use: After cleansing, use toner to create a smooth skin base. Open package, remove supporter and place the mask on the outer corners to fit the eye shape. After 10-20 minutes, peel the mask off and lightly dab the remaining essence left on your skin. Full ingredient list Disclaimer: Ingredients are subject to change at the manufacturer's discretion. For the most complete and up-to-date list of ingredients, refer to the product packaging.) Disclaimer:Ingredients are subject to change at the manufacturer’s discretion. Actual packaging may vary, for the complete and up-to-date ingredients, refer to the product packaging. Please read labels, warnings and directions before use.\"]\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '5.12 x 3.94 x 0.24 inches; 0.71 Ounces', 'Item model number': 'A00FS153', 'UPC': '818929022900'}\nReview Text: I only got a 1 pack so it may take a lot longer to see any results. I have used gold under eye masks before and this one wasn't as good. I like to put them in the refrigerator for a nice cooling effect when I wake up in morning and usually the cool feeling lasts 10 mins but with these after a minute it wasn't cool anymore. My eyes didnt look any brighter underneath after wearing for 20 mins. They do feel more moisturized so I gave 3 stars because of that.\nReview Title: They are ok\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: [Abib] Creme coating mask Tone-up solution 17g (5pcs)\nReview Date: 2020/07/27\nStore: Abib\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Abib', 'Scent': 'Unscented', 'Number of Items': '5', 'Package Dimensions': '8.7 x 6.2 x 0.8 inches; 8.01 Ounces'}\nReview Text: This mask looks pretty terrifying when on but it does a fantastic job of soothing the skin. My skin is very pale and gets sections of redness easily and when I woke up this morning I had no red sections and my skin was really hydrated. It did leave my skin a bit oily looking but I used an oil paper to pull that out and my skin looked great after that.\nReview Title: Very soothing\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Reusable Cotton Swab Portable Silicone Swab Washable Cotton Swabs for Ear Cleaning Beauty Treatment Makeup Cotton Swab\nReview Date: 2020/09/24\nStore: JAOYU\nAverage Rating: 4.5\nProduct Details: {'Product Dimensions': '3.2 x 3.2 x 0.39 inches', 'UPC': '739232135913'}\nReview Text: I love these silicone \"cotton swabs\"!! I personally have a problem with the feeling of cotton balls and cotton swabs but they are useful. I didn't even realize something like this existed so I was super excited to try it out. I used it for touching up makeup and they are really easy to use and clean. It comes with different textured heads too so it's very versatile.\nReview Title: Love these\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Avajar Perfect V Lifting Premium Eye Mask 5 Sets(10 Pairs) - Under Eye Collagen Patch | Hydrogel Anti Aging Mask for Puffy Eyes & Bags, Dark Circles and Wrinkles | Elasticity Improvement Pad\nReview Date: 2020/09/25\nStore: a DAILY SELF-CARE COSMETICS avajar\nAverage Rating: 3.3\nProduct Details: {'Brand': 'a DAILY SELF-CARE COSMETICS avajar', 'Item Form': 'Mask', 'Product Benefits': 'Hydrating', 'Scent': 'Hydrogel', 'Skin Type': 'All', 'Product Dimensions': '4.33 x 2.17 x 5.91 inches; 4.66 Ounces'}\nReview Text: I was surprised when the instructions said to leave these on for 1 to 2 hours as I am used to other under eye patches only being on for 20 mins. I had the patches on for 1 hour and 25 mins. It had a slightly cool feeling the whole time it was on. I have sensitive skin and had no adverse reaction to it. I was impressed that my eye puffiness was visibly reduced.\nReview Title: Reduced puffiness\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Panama Jack Sunscreen Lip Balm - SPF 45, Tropical & Mango 6 Pack Plus, Broad Spectrum UVA-UVB Sunscreen Protection, Prevents & Soothes Dry, Chapped Lips\nReview Date: 2020/10/19\nStore: Panama Jack\nAverage Rating: 4.9\nProduct Details: {'Scent': 'Mango', 'Product Benefits': 'Soothing', 'Item Weight': '4.25 Grams', 'Number of Items': '6', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.08 x 4.72 x 1.34 inches; 0.15 Ounces'}\nReview Text: I have sensitive lips so I tend to only use nivea lip gloss but I wanted something with better sun protection. This one didn't cause my lips to get itchy or dry and goes on very smooth. There is hardly any scent to it and no flavor except for a slight sunscreen taste. Overall I like it because it provided great sun protection.\nReview Title: Smooth\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EASYDEW Fill Up Volume Spot 0.67 fl oz -Anti-Aging Filler Spot Good for Topical Wrinkle Care with Hyaluronic Acid I Moisturizer with Instant Filling Effect and Skin Renewal | For Topical Area\nReview Date: 2020/10/31\nStore: EASYDEW\nAverage Rating: 4.1\nProduct Details: {'Brand': 'EASYDEW', 'Scent': 'Aloe Vera', 'Item Form': 'Cream', 'Active Ingredients': 'Hyaluronic acid', 'Number of Items': '1', 'Product Dimensions': '1.46 x 0.91 x 5.71 inches; 1.41 Ounces'}\nReview Text: I've used for 3 days now and haven't noticed any difference. It might work after a longer period of use. That being said, I have sensitive skin and didn't have any bad reactions to this and a little bit does go a long way.\nReview Title: Haven't noticed results\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nReview Date: 2020/11/22\nStore: UJM\nAverage Rating: 4.2\nProduct Details: {'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nReview Text: This was my first time ever putting on fake lashes of any kind so any issues I had may have been operator error. I'm not the best at liquid eyeliner so some dripped in my eye which wasn't super fun. After the eyeliner dried the lashes stuck to it great! Fake eyelashes feel weird on but again I am new to it. They looked great though.\nReview Title: Great quality lashes\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: hominem Face and Beard Serum from Manilla Natural Skincare\nReview Date: 2021/01/23\nStore: Manilla Natural Skincare\nAverage Rating: 3.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches'}\nReview Text: This beard and face oil has a sweet smell that is hard for me to place. I do like the scent but I can't think of anything to compare it to. The oil came wrapped in bubble wrap and in a zip lock style small bag but it wasn't sealed so that is really my only complaint. Other than that the oil moisturized skin well and it didn't leak at all in shipping process.\nReview Title: Sweet smell\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fishdown 4Pcs Hair Bun Maker Women Hair Bun Shaper Accessories Classy Multicolor Cloth Magic Clip Girls Hairstyle Must-haves Tool\nReview Date: 2021/07/26\nStore: Fishdown\nAverage Rating: 1.6\nProduct Details: {'Color': 'Multicolor', 'Material': 'Cotton', 'Brand': 'Fishdown', 'Hair Type': 'Straight', 'Number of Pieces': '4', 'Package Dimensions': '13.86 x 3.78 x 1.57 inches; 2.89 Ounces'}\nReview Text: So I really like the concept of this and it's super quick and easy to use in my daughter's hair but it's definitely better for adults. It's rather large and ended up falling out of my daughter's hair after a few hours. She does have long hair so I thought it would work for her but I definitely want to see if I can find this in a smaller size.\nReview Title: Easy to use\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Summer Crystal Straw Hat Girl Alligator Hair Clip (Valentine Rose)\nReview Date: 2021/11/10\nStore: Summer Crystal\nAverage Rating: 5.0\nProduct Details: {'Product Dimensions': '4 x 4 x 1.25 inches; 0.88 Ounces', 'UPC': '635638429536'}\nReview Text: This hat hair clip is so cute!! It holds in the hair well and is perfect for a sundress accessory. Well made - good quality!\nReview Title: So cute\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Peripera Ink Mood Matte Lipstick, Lightweight, Matte, Smooth, Hydrating, Lasting Color Payoff (02 Pink Go Up)\nReview Date: 2021/11/10\nStore: Peripera\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Peripera', 'Color': '02 PINK GO UP', 'Skin Type': 'Dry', 'Item Form': 'Crayon', 'Finish Type': 'Matte', 'Package Dimensions': '3.46 x 0.94 x 0.87 inches; 1.06 Ounces', 'Manufacturer': 'CLIO'}\nReview Text: In the colder weather my lips get really pale but most lipsticks I try don't look natural enough for daily wear. This one is different. It's matte so it looks more natural and the color is gorgeous. It lasted about 4 hours before needing to reapply so that would be my only complaint but overall it's great.\nReview Title: Beautiful natural color\nRating: 4.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has appreciated several products, noting effective hydration and skin benefits. They experienced firmer skin after using facial masks, and the relaxing feel of jade rollers received high praise. The lip balm provided optimal sun protection without causing dryness, and the headband offered comfort during extended wear. The hair clip was highlighted for its quality and cute design, while the lipstick’s natural matte finish and impressive staying power were well-received. Users generally enjoyed the soothing effects of various face masks, with notable satisfaction regarding their hydrating properties.\n\nNEGATIVE SUMMARY:\nThe user encountered multiple drawbacks, particularly with the application and effectiveness of some products. Issues arose with mask instructions being in an unfamiliar language, and some products were reported to leave skin feeling oily or did not show immediate visible results. The under-eye patches did not cool as expected, and there were concerns about the fit of certain masks being uncomfortable. The hair bun maker was too large for the intended user, leading to dissatisfaction, and the user expressed frustration with not noticing immediate benefits from a topical filler product.\n\nOVERALL SUMMARY:\nThe user’s experience encompasses a blend of satisfaction and disappointment. Many skincare items were effective for hydration and skin rejuvenation, leading to positive feelings about skin appearance and comfort during use. However, challenges with product instructions, fit, and efficacy were common, indicating areas for improvement. While the user found some products underwhelming in performance, those that worked well enhanced their overall skincare routine. This balance reflects a consumer journey rich with exploration in skincare and beauty, showcasing both successes and areas needing refinement.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Purse essential",
    "text": "This is a must have for your purse in the summer months. Really takes away the shine. It's a compact with a mirror and it will last a long time. I had some shine on my face from my sunscreen and this fixed it right up and didn't effect my sunscreen protection.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61U9wKZPzjL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61U9wKZPzjL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61U9wKZPzjL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61UX5T57jdL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61UX5T57jdL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61UX5T57jdL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09CLNDMXX",
    "parent_asin": "B09CLNDMXX",
    "user_id": "AEFRTLVCVRALKXBED77KHPIXEPWQ",
    "timestamp": "2022-06-18 00:15:53.067000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "By Terry Hyaluronic Pressed Hydra-Powder | Transcluscent | Infused with Hyaluronic Acid | Vegan",
    "average_rating": 4.3,
    "rating_number": 33,
    "features": [],
    "description": [],
    "price": 52.0,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51HsNyVjV7L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51HsNyVjV7L.jpg",
        "variant": "MAIN",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41SvTZ64FIL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41SvTZ64FIL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71wQW9Z0hxL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Eqet0bBwL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Eqet0bBwL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/818Pq+8ad7L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51jQp3MtIDL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51jQp3MtIDL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/81UCPJB+zkL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/417UeGGa+yL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/417UeGGa+yL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71MdFRIHjZL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Unending Wearability!",
        "url": "https://www.amazon.com/vdp/01b5388654de428b90a606ad40fc3e51?ref=dp_vse_rvc_0",
        "user_id": "AGDK5MFE5DGNEIIQZYASC3RP36TQ"
      },
      {
        "title": "Hyaluronic Hydra-Powder Palette",
        "url": "https://www.amazon.com/vdp/030b3926b56a421d8aedcf823a4bda32?ref=dp_vse_rvc_1",
        "user_id": ""
      }
    ],
    "store": "By Terry",
    "categories": [],
    "details": {
      "Brand": "By Terry",
      "Item Form": "powder",
      "Finish Type": "Matte",
      "Number of Items": "1",
      "Skin Tone": "All",
      "Package Dimensions": "3.19 x 3.15 x 0.75 inches; 2.82 Ounces",
      "Item model number": "3700076457087"
    },
    "bought_together": null
  }
}