{
  "user_id": "AF26IW2XGDITMNAJPGSM6S2YH33A",
  "summary": "=== Purchase Information ===\nProduct Title: SKEDERM EXHYDRO Ceramide Complex Moisturizer, Intensive Repair and Hydration Daily Face Cream, 50ml\nReview Date: 2016/08/26\nStore: BBInfinite\nAverage Rating: 3.8\nProduct Details: {'Brand': 'BBInfinite', 'Item Form': 'Cream', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Use for': 'Face', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.77 x 2.17 x 3.74 inches; 2.08 Ounces', 'Item model number': 'SKSF004-050'}\nReview Text: The Skederm ExHydro Ceramide Complex Moisturizer is great for facial skin that needs moisture but not necessarily a heavy duty cream. I found the consistency to be light and silky and almost undetectable on my skin after it absorbed. My skin just felt hydrated and bouncier. For my dry skin, I usually like more emollient creams for night time use. I found this cream perfect for daytime worn under an SPF cream and foundation or a BB cream. I use it in place of a serum and it acts like a makeup primer, blurring lines and pores and making skin appear smoother while adding a dose of hydration. Not a lot is needed. I use four small dots to cover my entire face. From what I can tell it is also color and fragrance free.<br /><br />The key ingredient that attracted me to this product is the Ceramide Complex consisting of Ceramides I, III, VI and natural ingredients (palm oil, algae extract, and fig extracts) that act to hydrate and firm skin. The Skederm ExHydro Ceramide Complex Moisturizer also has glycerin and silicone derivatives in it to increase water retention and give your skin a silky feel. I love that it is supplied in a tube. It's not fancy, but it is very convenient and hygienic. This Skederm product is made in Korea which has been at the forefront of cosmetics and skincare research in recent years.\nReview Title: The Skederm ExHydro Ceramide Complex Moisturizer is great for facial skin that needs moisture but not necessarily ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Myconos Magic BB CC Moist Air Cushion Compact Korean Cover Foundation SPF50+ with 1 Extra Refill Luminous Glow Shade 21\nReview Date: 2016/09/08\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Cream', 'Unit Count': '1.0 Count', 'Number of Items': '2', 'Age Range (Description)': 'Adult', 'Sun Protection': '50 SPF', 'Package Dimensions': '3.31 x 3.11 x 2.6 inches; 4.8 Ounces', 'UPC': '789655125510 763109545659'}\nReview Text: Wow! What a luxurious, well-made cushion compact. This rivals the high-end one I purchased from Lancome a few months ago. The product came boxed with the ingredients listed. You're also getting a sealed refill cushion compact included in the box which is amazing for the price. The compact is made of a high quality white plastic. It's easy to open using a push button in the front. There's a good size mirror in the upper lid and a hinged plastic cover to prevent the cushion from drying out. You can hear a soft click when it's closed, so you know it's not going to open inadvertently. There's a Myconos branded applicator that rests on top of the cover.<br /><br />The foundation I got (#2) works well with my NC20-25 skin. It's not a heavy foundation. I would consider it moderate coverage at best. It's very blendable and like most cushion compacts, feels very light on the skin. I included a picture which shows a heavy application on my cheek blended out towards the front of my face. Wear is very good. I haven't felt the need to reapply after using it in the morning. Like a lot of Korean cosmetics, the quality and cutting edge technology used is amazing. This is a fantastic deal especially since a refill was included.\nReview Title: Gorgeous Korean made cushion compact plus refill.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NuPeptin Calming Facial Scrub exfoliating scrub that cleanses and immediately helps to give your skin a smoother and softer appearance.\nReview Date: 2016/10/23\nStore: Nupeptin\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '6 x 2 x 0.3 inches; 3.2 Ounces', 'UPC': '727510007168', 'Manufacturer': 'Supportiback'}\nReview Text: This is a really nicely balanced facial scrub. There are plenty of exfoliating beads so you actually feel like you are scrubbing your skin. However, they are contained in an emollient base with Jojoba oil, sunflower seed oil, and vitamin E  so that it doesn't feel very harsh at all. I did not detect much of a scent and the overall experience was calming yet effective. After rinsing, I felt my skin was prepared to receive skincare product. A little goes a long way. Highly recommend.\nReview Title: This is a really nicely balanced facial scrub\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Evarne Refining Jojoba Face Wash Cleanser For Even Complexion - Paraben Free, Sulfate Free. Exfoliate, Brighten, Hydrate, Refresh, Purify\nReview Date: 2016/11/22\nStore: Evarne\nAverage Rating: 3.8\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'All', 'Brand': 'Evarne', 'Scent': 'Grapefruit, Aloe Vera', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 7.5 x 1.5 inches; 6.4 Ounces', 'UPC': '684334566342'}\nReview Text: I love this cleanser! It cleans gently yet effectively without any harsh detergents. It does contain both physical and chemical exfoliators in the form of jojoba beads and AHAs (glycolic, malic and lactic acids) and BHAs (salicylic acid). The jojoba beads feel like tiny little balls which eventually melt into the cleanser as you massage it onto your face. As they break down, they provide moisture to the skin along with the aloe and the glycerin in the formulation. It's important to use both physical and chemical exfoliation to get rid of dead skin cells and clean pores and it's nice to have both in one preparation.<br /><br />I use it to clean my skin after makeup removal. I wet my face and use a quarter size amount and massage onto my face for about a minute. You can feel the beads start to get smaller/less numerous as you massage. I leave this on my face for another 1-2 minutes to allow the AHAs and BHAs to do their work, then rinse well with water. Skin feels very clean but not dry or stripped of natural oils. It has a pleasant, light citrus scent and the packaging it simple, yet elegant. Very happy I found this!\nReview Title: I love this cleanser\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bamboo Serum by Elements of Beauty (1 oz) - Skin Firming Treatment Helps Tighten Sagging Skin - Anti-Wrinkle Serum Locks in Moisture - With Vitamin C, CoQ10 and Coconut\nReview Date: 2016/11/30\nStore: Elements of Beauty\nAverage Rating: 3.5\nProduct Details: {'Skin Type': 'Dry', 'Product Benefits': 'Hydrating', 'Use for': 'Face', 'Scent': 'Coconut', 'Brand': 'Elements of Beauty', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.1 x 4.65 x 1.6 inches; 3.6 Ounces', 'UPC': '712038006632'}\nReview Text: My bottle came with a dropper instead of the pump as shown in the listing (not sure if the dropper is new or old packaging). This is a slightly viscous, cloudy serum that I put on clean, dry skin. As it absorbs, you can fell a slight tightening effect on your face. It's subtle but noticeable. I compare it to putting stockings on your legs.  It just feels like things are being held in. I didn't notice any major wrinkles disappearing, but the lifting effect was pleasant. I had no problem applying moisturizers/makeup on top. There was no flaking or pilling and application of my makeup was smooth.<br /><br />I appreciate the inclusions of ingredients like Vitamin E, CoQ10, and Vitamin C. All of these are great for the skin and I Iike using them in my serums. I assume it's the bamboo extract that gives the tightening/lifting effect. Bamboo extract is very high in naturally occurring silica which helps build collagen and helps your body hold onto calcium which is suppose to result in a more elastic skin tone.  I didn't find this serum particularly moisturizing, but my skin is dry and as mentioned, I can use moisturizer on top without any issues. Really nice serum and different from a lot of other things currently on the market. Glad I tried it!\nReview Title: It just feels like things are being held in\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sinful Colors Finger Nail Polish Color Lacquer Set 10-Piece Collection (Shine)\nReview Date: 2017/03/15\nStore: Beauty Brags\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Beauty Brags', 'Item Form': 'Liquid', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'adult,teen', 'Unit Count': '5 Fl Oz', 'Number of Items': '10', 'Item Dimensions LxWxH': '6 x 2.5 x 3.5 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 2.5 x 3.5 inches; 1.25 Pounds', 'UPC': '709872667402'}\nReview Text: What a great value! I received shades from the recent Sinful Porcelain Matte collection (2016) and Carded collection (2016). I haven't tried all of them yet but I did inspect the bottles and none of them looked used. There was no spillage or leakage during transit and the consistency was as expected from Sinful np. Not all of the shades are to my taste but my daughter was happy to received the ones I didn't want. I ended up keeping about 8 of them for myself. Nice collection and I'm glad I purchased!\nReview Title: What a great value! I received shades from the recent Sinful ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Origin Beauty Green Piggy Clay Mask and Milky Piggy Carbonated Bubble Clay Mask(100g+100g)\nReview Date: 2017/12/08\nAverage Rating: 3.4\nProduct Details: {'Item Form': 'Clay', 'Scent': 'Green Piggy', 'Number of Items': '2', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.71 x 2.87 x 2.56 inches; 7.04 Ounces', 'UPC': '694090378127'}\nReview Text: These are fun. I wasn't too sure about the bubble mask at first but after a few minutes on the skin it did give that carbonated, fizzy feeling. My skin felt so clean afterwards. The collagen mask is nice too, although I didn't like it quite as much as the clay mask. It was thick and heavy but not greasy. My skin felt soft afterwards but not completely hydrated. They did work well together.\nReview Title: These are fun. I wasn't too sure about the bubble mask ...\nRating: 5.0\n--------------------------------------------------",
  "reference": "SKEDERM EXHYDRO Ceramide Complex Moisturizer, Intensive Repair and Hydration Daily Face Cream, 50ml\nBBInfinite\n{'Brand': 'BBInfinite', 'Item Form': 'Cream', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Use for': 'Face', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.77 x 2.17 x 3.74 inches; 2.08 Ounces', 'Item model number': 'SKSF004-050'}\nThe Skederm ExHydro Ceramide Complex Moisturizer is great for facial skin that needs moisture but not necessarily a heavy duty cream. I found the consistency to be light and silky and almost undetectable on my skin after it absorbed. My skin just felt hydrated and bouncier. For my dry skin, I usually like more emollient creams for night time use. I found this cream perfect for daytime worn under an SPF cream and foundation or a BB cream. I use it in place of a serum and it acts like a makeup primer, blurring lines and pores and making skin appear smoother while adding a dose of hydration. Not a lot is needed. I use four small dots to cover my entire face. From what I can tell it is also color and fragrance free.<br /><br />The key ingredient that attracted me to this product is the Ceramide Complex consisting of Ceramides I, III, VI and natural ingredients (palm oil, algae extract, and fig extracts) that act to hydrate and firm skin. The Skederm ExHydro Ceramide Complex Moisturizer also has glycerin and silicone derivatives in it to increase water retention and give your skin a silky feel. I love that it is supplied in a tube. It's not fancy, but it is very convenient and hygienic. This Skederm product is made in Korea which has been at the forefront of cosmetics and skincare research in recent years.\nThe Skederm ExHydro Ceramide Complex Moisturizer is great for facial skin that needs moisture but not necessarily ...\nMyconos Magic BB CC Moist Air Cushion Compact Korean Cover Foundation SPF50+ with 1 Extra Refill Luminous Glow Shade 21\n{'Item Form': 'Cream', 'Unit Count': '1.0 Count', 'Number of Items': '2', 'Age Range (Description)': 'Adult', 'Sun Protection': '50 SPF', 'Package Dimensions': '3.31 x 3.11 x 2.6 inches; 4.8 Ounces', 'UPC': '789655125510 763109545659'}\nWow! What a luxurious, well-made cushion compact. This rivals the high-end one I purchased from Lancome a few months ago. The product came boxed with the ingredients listed. You're also getting a sealed refill cushion compact included in the box which is amazing for the price. The compact is made of a high quality white plastic. It's easy to open using a push button in the front. There's a good size mirror in the upper lid and a hinged plastic cover to prevent the cushion from drying out. You can hear a soft click when it's closed, so you know it's not going to open inadvertently. There's a Myconos branded applicator that rests on top of the cover.<br /><br />The foundation I got (#2) works well with my NC20-25 skin. It's not a heavy foundation. I would consider it moderate coverage at best. It's very blendable and like most cushion compacts, feels very light on the skin. I included a picture which shows a heavy application on my cheek blended out towards the front of my face. Wear is very good. I haven't felt the need to reapply after using it in the morning. Like a lot of Korean cosmetics, the quality and cutting edge technology used is amazing. This is a fantastic deal especially since a refill was included.\nGorgeous Korean made cushion compact plus refill.\nNuPeptin Calming Facial Scrub exfoliating scrub that cleanses and immediately helps to give your skin a smoother and softer appearance.\nNupeptin\n{'Package Dimensions': '6 x 2 x 0.3 inches; 3.2 Ounces', 'UPC': '727510007168', 'Manufacturer': 'Supportiback'}\nThis is a really nicely balanced facial scrub. There are plenty of exfoliating beads so you actually feel like you are scrubbing your skin. However, they are contained in an emollient base with Jojoba oil, sunflower seed oil, and vitamin E  so that it doesn't feel very harsh at all. I did not detect much of a scent and the overall experience was calming yet effective. After rinsing, I felt my skin was prepared to receive skincare product. A little goes a long way. Highly recommend.\nThis is a really nicely balanced facial scrub\nEvarne Refining Jojoba Face Wash Cleanser For Even Complexion - Paraben Free, Sulfate Free. Exfoliate, Brighten, Hydrate, Refresh, Purify\nEvarne\n{'Item Form': 'Cream', 'Skin Type': 'All', 'Brand': 'Evarne', 'Scent': 'Grapefruit, Aloe Vera', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 7.5 x 1.5 inches; 6.4 Ounces', 'UPC': '684334566342'}\nI love this cleanser! It cleans gently yet effectively without any harsh detergents. It does contain both physical and chemical exfoliators in the form of jojoba beads and AHAs (glycolic, malic and lactic acids) and BHAs (salicylic acid). The jojoba beads feel like tiny little balls which eventually melt into the cleanser as you massage it onto your face. As they break down, they provide moisture to the skin along with the aloe and the glycerin in the formulation. It's important to use both physical and chemical exfoliation to get rid of dead skin cells and clean pores and it's nice to have both in one preparation.<br /><br />I use it to clean my skin after makeup removal. I wet my face and use a quarter size amount and massage onto my face for about a minute. You can feel the beads start to get smaller/less numerous as you massage. I leave this on my face for another 1-2 minutes to allow the AHAs and BHAs to do their work, then rinse well with water. Skin feels very clean but not dry or stripped of natural oils. It has a pleasant, light citrus scent and the packaging it simple, yet elegant. Very happy I found this!\nI love this cleanser\nBamboo Serum by Elements of Beauty (1 oz) - Skin Firming Treatment Helps Tighten Sagging Skin - Anti-Wrinkle Serum Locks in Moisture - With Vitamin C, CoQ10 and Coconut\nElements of Beauty\n{'Skin Type': 'Dry', 'Product Benefits': 'Hydrating', 'Use for': 'Face', 'Scent': 'Coconut', 'Brand': 'Elements of Beauty', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.1 x 4.65 x 1.6 inches; 3.6 Ounces', 'UPC': '712038006632'}\nMy bottle came with a dropper instead of the pump as shown in the listing (not sure if the dropper is new or old packaging). This is a slightly viscous, cloudy serum that I put on clean, dry skin. As it absorbs, you can fell a slight tightening effect on your face. It's subtle but noticeable. I compare it to putting stockings on your legs.  It just feels like things are being held in. I didn't notice any major wrinkles disappearing, but the lifting effect was pleasant. I had no problem applying moisturizers/makeup on top. There was no flaking or pilling and application of my makeup was smooth.<br /><br />I appreciate the inclusions of ingredients like Vitamin E, CoQ10, and Vitamin C. All of these are great for the skin and I Iike using them in my serums. I assume it's the bamboo extract that gives the tightening/lifting effect. Bamboo extract is very high in naturally occurring silica which helps build collagen and helps your body hold onto calcium which is suppose to result in a more elastic skin tone.  I didn't find this serum particularly moisturizing, but my skin is dry and as mentioned, I can use moisturizer on top without any issues. Really nice serum and different from a lot of other things currently on the market. Glad I tried it!\nIt just feels like things are being held in\nSinful Colors Finger Nail Polish Color Lacquer Set 10-Piece Collection (Shine)\nBeauty Brags\n{'Brand': 'Beauty Brags', 'Item Form': 'Liquid', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'adult,teen', 'Unit Count': '5 Fl Oz', 'Number of Items': '10', 'Item Dimensions LxWxH': '6 x 2.5 x 3.5 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 2.5 x 3.5 inches; 1.25 Pounds', 'UPC': '709872667402'}\nWhat a great value! I received shades from the recent Sinful Porcelain Matte collection (2016) and Carded collection (2016). I haven't tried all of them yet but I did inspect the bottles and none of them looked used. There was no spillage or leakage during transit and the consistency was as expected from Sinful np. Not all of the shades are to my taste but my daughter was happy to received the ones I didn't want. I ended up keeping about 8 of them for myself. Nice collection and I'm glad I purchased!\nWhat a great value! I received shades from the recent Sinful ...\nOrigin Beauty Green Piggy Clay Mask and Milky Piggy Carbonated Bubble Clay Mask(100g+100g)\n{'Item Form': 'Clay', 'Scent': 'Green Piggy', 'Number of Items': '2', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.71 x 2.87 x 2.56 inches; 7.04 Ounces', 'UPC': '694090378127'}\nThese are fun. I wasn't too sure about the bubble mask at first but after a few minutes on the skin it did give that carbonated, fizzy feeling. My skin felt so clean afterwards. The collagen mask is nice too, although I didn't like it quite as much as the clay mask. It was thick and heavy but not greasy. My skin felt soft afterwards but not completely hydrated. They did work well together.\nThese are fun. I wasn't too sure about the bubble mask ...",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: SKEDERM EXHYDRO Ceramide Complex Moisturizer, Intensive Repair and Hydration Daily Face Cream, 50ml\nReview Date: 2016/08/26\nStore: BBInfinite\nAverage Rating: 3.8\nProduct Details: {'Brand': 'BBInfinite', 'Item Form': 'Cream', 'Unit Count': '1.7 Fl Oz', 'Number of Items': '1', 'Use for': 'Face', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.77 x 2.17 x 3.74 inches; 2.08 Ounces', 'Item model number': 'SKSF004-050'}\nReview Text: The Skederm ExHydro Ceramide Complex Moisturizer is great for facial skin that needs moisture but not necessarily a heavy duty cream. I found the consistency to be light and silky and almost undetectable on my skin after it absorbed. My skin just felt hydrated and bouncier. For my dry skin, I usually like more emollient creams for night time use. I found this cream perfect for daytime worn under an SPF cream and foundation or a BB cream. I use it in place of a serum and it acts like a makeup primer, blurring lines and pores and making skin appear smoother while adding a dose of hydration. Not a lot is needed. I use four small dots to cover my entire face. From what I can tell it is also color and fragrance free.<br /><br />The key ingredient that attracted me to this product is the Ceramide Complex consisting of Ceramides I, III, VI and natural ingredients (palm oil, algae extract, and fig extracts) that act to hydrate and firm skin. The Skederm ExHydro Ceramide Complex Moisturizer also has glycerin and silicone derivatives in it to increase water retention and give your skin a silky feel. I love that it is supplied in a tube. It's not fancy, but it is very convenient and hygienic. This Skederm product is made in Korea which has been at the forefront of cosmetics and skincare research in recent years.\nReview Title: The Skederm ExHydro Ceramide Complex Moisturizer is great for facial skin that needs moisture but not necessarily ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Myconos Magic BB CC Moist Air Cushion Compact Korean Cover Foundation SPF50+ with 1 Extra Refill Luminous Glow Shade 21\nReview Date: 2016/09/08\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Cream', 'Unit Count': '1.0 Count', 'Number of Items': '2', 'Age Range (Description)': 'Adult', 'Sun Protection': '50 SPF', 'Package Dimensions': '3.31 x 3.11 x 2.6 inches; 4.8 Ounces', 'UPC': '789655125510 763109545659'}\nReview Text: Wow! What a luxurious, well-made cushion compact. This rivals the high-end one I purchased from Lancome a few months ago. The product came boxed with the ingredients listed. You're also getting a sealed refill cushion compact included in the box which is amazing for the price. The compact is made of a high quality white plastic. It's easy to open using a push button in the front. There's a good size mirror in the upper lid and a hinged plastic cover to prevent the cushion from drying out. You can hear a soft click when it's closed, so you know it's not going to open inadvertently. There's a Myconos branded applicator that rests on top of the cover.<br /><br />The foundation I got (#2) works well with my NC20-25 skin. It's not a heavy foundation. I would consider it moderate coverage at best. It's very blendable and like most cushion compacts, feels very light on the skin. I included a picture which shows a heavy application on my cheek blended out towards the front of my face. Wear is very good. I haven't felt the need to reapply after using it in the morning. Like a lot of Korean cosmetics, the quality and cutting edge technology used is amazing. This is a fantastic deal especially since a refill was included.\nReview Title: Gorgeous Korean made cushion compact plus refill.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NuPeptin Calming Facial Scrub exfoliating scrub that cleanses and immediately helps to give your skin a smoother and softer appearance.\nReview Date: 2016/10/23\nStore: Nupeptin\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '6 x 2 x 0.3 inches; 3.2 Ounces', 'UPC': '727510007168', 'Manufacturer': 'Supportiback'}\nReview Text: This is a really nicely balanced facial scrub. There are plenty of exfoliating beads so you actually feel like you are scrubbing your skin. However, they are contained in an emollient base with Jojoba oil, sunflower seed oil, and vitamin E  so that it doesn't feel very harsh at all. I did not detect much of a scent and the overall experience was calming yet effective. After rinsing, I felt my skin was prepared to receive skincare product. A little goes a long way. Highly recommend.\nReview Title: This is a really nicely balanced facial scrub\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Evarne Refining Jojoba Face Wash Cleanser For Even Complexion - Paraben Free, Sulfate Free. Exfoliate, Brighten, Hydrate, Refresh, Purify\nReview Date: 2016/11/22\nStore: Evarne\nAverage Rating: 3.8\nProduct Details: {'Item Form': 'Cream', 'Skin Type': 'All', 'Brand': 'Evarne', 'Scent': 'Grapefruit, Aloe Vera', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 7.5 x 1.5 inches; 6.4 Ounces', 'UPC': '684334566342'}\nReview Text: I love this cleanser! It cleans gently yet effectively without any harsh detergents. It does contain both physical and chemical exfoliators in the form of jojoba beads and AHAs (glycolic, malic and lactic acids) and BHAs (salicylic acid). The jojoba beads feel like tiny little balls which eventually melt into the cleanser as you massage it onto your face. As they break down, they provide moisture to the skin along with the aloe and the glycerin in the formulation. It's important to use both physical and chemical exfoliation to get rid of dead skin cells and clean pores and it's nice to have both in one preparation.<br /><br />I use it to clean my skin after makeup removal. I wet my face and use a quarter size amount and massage onto my face for about a minute. You can feel the beads start to get smaller/less numerous as you massage. I leave this on my face for another 1-2 minutes to allow the AHAs and BHAs to do their work, then rinse well with water. Skin feels very clean but not dry or stripped of natural oils. It has a pleasant, light citrus scent and the packaging it simple, yet elegant. Very happy I found this!\nReview Title: I love this cleanser\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bamboo Serum by Elements of Beauty (1 oz) - Skin Firming Treatment Helps Tighten Sagging Skin - Anti-Wrinkle Serum Locks in Moisture - With Vitamin C, CoQ10 and Coconut\nReview Date: 2016/11/30\nStore: Elements of Beauty\nAverage Rating: 3.5\nProduct Details: {'Skin Type': 'Dry', 'Product Benefits': 'Hydrating', 'Use for': 'Face', 'Scent': 'Coconut', 'Brand': 'Elements of Beauty', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.1 x 4.65 x 1.6 inches; 3.6 Ounces', 'UPC': '712038006632'}\nReview Text: My bottle came with a dropper instead of the pump as shown in the listing (not sure if the dropper is new or old packaging). This is a slightly viscous, cloudy serum that I put on clean, dry skin. As it absorbs, you can fell a slight tightening effect on your face. It's subtle but noticeable. I compare it to putting stockings on your legs.  It just feels like things are being held in. I didn't notice any major wrinkles disappearing, but the lifting effect was pleasant. I had no problem applying moisturizers/makeup on top. There was no flaking or pilling and application of my makeup was smooth.<br /><br />I appreciate the inclusions of ingredients like Vitamin E, CoQ10, and Vitamin C. All of these are great for the skin and I Iike using them in my serums. I assume it's the bamboo extract that gives the tightening/lifting effect. Bamboo extract is very high in naturally occurring silica which helps build collagen and helps your body hold onto calcium which is suppose to result in a more elastic skin tone.  I didn't find this serum particularly moisturizing, but my skin is dry and as mentioned, I can use moisturizer on top without any issues. Really nice serum and different from a lot of other things currently on the market. Glad I tried it!\nReview Title: It just feels like things are being held in\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sinful Colors Finger Nail Polish Color Lacquer Set 10-Piece Collection (Shine)\nReview Date: 2017/03/15\nStore: Beauty Brags\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Beauty Brags', 'Item Form': 'Liquid', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'adult,teen', 'Unit Count': '5 Fl Oz', 'Number of Items': '10', 'Item Dimensions LxWxH': '6 x 2.5 x 3.5 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '6 x 2.5 x 3.5 inches; 1.25 Pounds', 'UPC': '709872667402'}\nReview Text: What a great value! I received shades from the recent Sinful Porcelain Matte collection (2016) and Carded collection (2016). I haven't tried all of them yet but I did inspect the bottles and none of them looked used. There was no spillage or leakage during transit and the consistency was as expected from Sinful np. Not all of the shades are to my taste but my daughter was happy to received the ones I didn't want. I ended up keeping about 8 of them for myself. Nice collection and I'm glad I purchased!\nReview Title: What a great value! I received shades from the recent Sinful ...\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Origin Beauty Green Piggy Clay Mask and Milky Piggy Carbonated Bubble Clay Mask(100g+100g)\nReview Date: 2017/12/08\nAverage Rating: 3.4\nProduct Details: {'Item Form': 'Clay', 'Scent': 'Green Piggy', 'Number of Items': '2', 'Skin Tone': 'All', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.71 x 2.87 x 2.56 inches; 7.04 Ounces', 'UPC': '694090378127'}\nReview Text: These are fun. I wasn't too sure about the bubble mask at first but after a few minutes on the skin it did give that carbonated, fizzy feeling. My skin felt so clean afterwards. The collagen mask is nice too, although I didn't like it quite as much as the clay mask. It was thick and heavy but not greasy. My skin felt soft afterwards but not completely hydrated. They did work well together.\nReview Title: These are fun. I wasn't too sure about the bubble mask ...\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user's experiences with skincare and beauty products reveal a strong appreciation for effective formulations that deliver hydration and a sense of luxury. They particularly enjoy lightweight moisturizers that provide a silky feel and smooth application, ideal for daytime wear. The inclusion of convenient packaging, such as hygienic tubes and well-designed compacts, is noted positively. The user is delighted by the balance of gentleness and effectiveness in exfoliating scrubs, as well as the pleasant experiences with cleansing products that hydrate without harshness. Overall satisfaction with the quality and technology of Korean cosmetics is evident, especially among products that provide good value coupled with a luxurious feel.\n\nNEGATIVE SUMMARY:\nThe user expressed dissatisfaction with certain aspects, particularly the delivery or presentation of products, such as receiving a different type of packaging than expected. Some items failed to meet hydration expectations, leaving them feeling that certain serums did not provide enough moisture for dry skin. There were also minor critiques on the effectiveness of specific masks, with one being described as heavy yet lacking in hydration. Additionally, a mix of taste with nail polish shades indicates that not all products align with the user's personal preferences or expectations.\n\nOVERALL SUMMARY:\nThe user's shopping history showcases a diverse range of beauty products, primarily skewed towards skincare and makeup from Korean brands, which consistently deliver quality and effectiveness. Positive experiences center on hydration, luxurious textures, and practical packaging, reflecting a strong appreciation for thoughtful product design. However, there are occasional frustrations, particularly regarding packaging discrepancies and inconsistent results in moisturizing products. Ultimately, while there are minor negative aspects, the overall sentiment reflects a favorable view of the purchases, demonstrating a mix of satisfaction and a desire for improved consistency in some products.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Nice quality nail polishes for the price!",
    "text": "I wasn’t expecting much for the price, but these are pretty good nail polishes; definitely on par with drugstore polishes like Sally Hansen and Essie. They arrived packed well. There was no spillage or leakage. There are no names but rather numbers on the bottom and I received #1-12. Colors are gorgeous! The polish was a bit thick but easily fixed with a few drops of thinning solution. Wear was typical for me for a drugstore polish. I got about 4 days before I saw minor chipping and then by day 7, I needed to remove it. I wouldn’t hesitate to buy from this brand again.",
    "images": [
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/61y3Apgs9EL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/61y3Apgs9EL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/61y3Apgs9EL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71a-uPRYdLL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71a-uPRYdLL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71a-uPRYdLL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71fLmFc5xPL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71fLmFc5xPL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71fLmFc5xPL.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B01N00UFDV",
    "parent_asin": "B01N00UFDV",
    "user_id": "AF26IW2XGDITMNAJPGSM6S2YH33A",
    "timestamp": "2018-08-20 19:38:53.902000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "SXC Cosmetics Nail Polish Set, 12 Metallic Colors 15ml/0.5oz Full Size Nail Lacquer Gift lot",
    "average_rating": 4.2,
    "rating_number": 219,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51qV6U5xwAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51qV6U5xwAL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/91I7cqZ3rSL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51XnhEOsoYL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51XnhEOsoYL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71zyjuF903L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51j0+nbgJbL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51j0+nbgJbL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71fNC9VM-+L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51B0a4+PLJL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51B0a4+PLJL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/81TI21wO7IL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51nfbNbSRDL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51nfbNbSRDL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81dL-kcceZL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51r5VLV46rL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51r5VLV46rL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/817qnb-CDNL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41VZMqkj0dL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41VZMqkj0dL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71vwHsomd1L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51fvn1dcBfL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51fvn1dcBfL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/81NeobyGEnL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51lfpJstfML._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51lfpJstfML.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/71YDEJ0NWNL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "SXC",
    "categories": [],
    "details": {
      "Brand": "SXC",
      "Item Form": "Liquid",
      "Finish Type": "Metallic",
      "Unit Count": "6 Fl Oz",
      "Number of Items": "12",
      "Liquid Volume": "0.5 Fluid Ounces",
      "Package Dimensions": "5.75 x 4.25 x 3.5 inches; 1.75 Pounds",
      "UPC": "738964869714"
    },
    "bought_together": null
  }
}