{
  "user_id": "AFL5OB2GSBEQMSEYKWV732IWQ3GQ",
  "summary": "=== Purchase Information ===\nProduct Title: Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nReview Date: 2020/10/23\nStore: YanJie\nAverage Rating: 4.2\nProduct Details: {'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReview Text: Really gorgeous, these kitty ear headbands are super soft and pretty. I love them because they don't squeeze the ears. They fit great on me and my litt girl so I recommend them for mom and a daughter spa nights or for make a different gift.\nReview Title: Headlands\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nReview Date: 2020/11/04\nStore: Ehinew\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nReview Text: Recomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nReview Title: Kit para cejas!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Make-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nReview Date: 2020/11/05\nStore: LOMANTOWN\nAverage Rating: 4.1\nProduct Details: {'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\nReview Text: [[VIDEOID:91aba66c2bcb51abc6efaed2336f619d]] Estoy encantada con mi nuevo storage, comenzando con lo lindo que se ve y lo espacioso que es, el artículo está hecho de plástico que se ve y se siente de buena calidad. Es un gavetero para guardar de todo desde cósmicos, cremas del cuidado del la piel o hasta artículos para el cabello, me encantó porqué es grande y espacioso, sinceramente me cupo todos mis artículos de mi cuidado facial y aún me queda espacio para guardar mas cosas. Otra cosa que me gustó mucho es que es tipo maletero, es fácil de mover y colocar en distintos lugares cómo en el vanity, baño, cuartos ect.\nReview Title: Organizador de cosméticos.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Altaba Long Wavy Wigs Ombre Golden Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nReview Date: 2020/11/26\nStore: Altaba\nAverage Rating: 3.4\nProduct Details: {'Material': 'synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult'}\nReview Text: La peluca se ve bella, me encantó el largo y los risos del cabello además los colores son hermosos, pero cuándo voy a comprar o usar una peluca tomo en cuenta varias cosas y esta peluca no cumple con ninguno de los requisitos. Esta peluca parece peluca, que quiero decir? Bueno la banda del centro es demasiado ancha se puede notar claramente el grosor de la peluca con la división de la frente y se ve feo, otra cosa que no me gusta es que si peinas o mueves el cabello se ven claramente las bandas y los huecos sin cabello, es decir tiene muy poco cabello. Otra cosa que no me gusta es que la peluca suelta demasiado cabello no puedes pasar los dedos o peinar con cepillo porqué se salen los cabellos de la peluca. Desafortunadamente no la recomiendo.\nReview Title: Peluca estilo ombre.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: BH DERMCENTER Retinol Serum Restores Rejuvenates and Purifies Skin, 1 oz, Reduces Appearance of Fine Lines, Non-GMO, Vegan, Cruelty Free\nReview Date: 2020/12/26\nStore: BH DERMCENTER\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '2 x 2 x 5 inches; 1 Ounces', 'Item model number': 'BHDRETSER', 'UPC': '850004068076'}\nReview Text: No me gustó este suero para el rostro, comencé a usar este suero y ya en la 2nd vez mi piel comenzó a cambiar notoriamente, piel es sensible y este suero me causó un brote en la piel, mi piel comenzó a sentirse muy reseca, me dejó la piel muy maltratada, así que no lo recomiendo para personas con piel sensible.\nReview Title: No lo recomiendo para pieles sensibles.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Canple Self-cleaning Slicker Brush for Medium Long Hair Types Dog and Cat, Removes Loose Hair Undercoat Effectively Reduce Mats & Tanglings Grooming Brush\nReview Date: 2021/02/21\nStore: Canple\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Canple', 'Special Feature': 'Self Cleaning', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Hair Type': 'All', 'Package Dimensions': '10.16 x 6.3 x 2.2 inches; 8.82 Ounces'}\nReview Text: [[VIDEOID:5ee8a58a8f5b5d4ef7ef0f6e1c59ab85]] Es un excelente artículo, lo recomiendo para aquellos gatos o perros que son muy peludos. En mi casa tengo un gato muy peludo, así que este cepillo es ideal para remover el pelo, y a la vez a mi gato le gusta el masaje que le da. En lo personal me gusta porqué es un cepillo fácil de limpiar. Me gustó mucho.\nReview Title: Ideal para mascotas muy peludas.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ronas Timeless Albutin Ampoule 0.06fl oz 10vial. herbal extracts moisturizing.Skin Tone up clear Brightenting.vitality. Beautysalon Brand\nReview Date: 2021/02/26\nStore: Ronas\nAverage Rating: 2.4\nProduct Details: {'Skin Type': 'Dry', 'Brand': 'Ronas', 'Item Form': 'Ampoule', 'Item Volume': '2 Milliliters', 'Unit Count': '1.00 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.61 x 5.24 x 0.98 inches; 4.2 Ounces'}\nReview Text: Desafortunadamente deben de mejorar el paquete de envío de este artículo, este artículo es demasiado delicado para enviarlo en un sobre normal. Desafortunadamente  mi paquete llegó roto, sólo 2 ampollas llegaron en buen estado, así que desde mi experiencia no lo recomiendo.\nReview Title: Mi paquete llegó roto.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fascy Facial Mask Beauty Treatment 5 Packs 3 Step Mask, Korean Facial Skincare Mask, All Natural Moisturizing Facial Mask Skin Beauty Treatment with Eye Cream, Skin Rejuvenation Facial Mask\nReview Date: 2021/04/23\nStore: Fascy\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Fascy', 'Item Form': 'Cream, Sheet', 'Product Benefits': 'Hydrating', 'Scent': 'Centella Asiatica', 'Skin Type': 'Dry', 'Package Dimensions': '7.64 x 4.88 x 0.94 inches; 7.05 Ounces'}\nReview Text: Ya es la segunda vez que utilizo esta mascarilla, y tengo que decir que me encantan. Mi piel es sensible y me gusta que este set no causó ningún tipo de reacción alérgica, ni ardor, ni rojez. Al día siguiente mi piel se siente suave y reluciente, me encanta la sensación que deja esta mascarilla en mi piel.. algo que me gusta es que no se siente pegajosa y tampoco tienen olor, otra cosa que me gusta de esta mascarilla es que trae todo, crema para ojos, mascarilla de papel y una mascarilla para dormir.\nReview Title: Esta mascarilla me encantó, deja mi piel reluciente.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: QTMY Wide Headbands Fashion Women Baroque Crystal Gemstone Hair Accessories Head Band Fashion Headwear Hairbands for Women\nReview Date: 2021/06/17\nStore: QTMY\nAverage Rating: 3.6\nProduct Details: {'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Plastic', 'Number of Items': '1', 'Brand': 'QTMY', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.5 x 5.94 x 1.97 inches; 5.61 Ounces', 'Item model number': 'ZJ'}\nReview Text: [[VIDEOID:aae92d6d7eb66199773b79bd9fdddec6]] Esta diadema está hermosa, está muy bien hecha, es delicada y lo más que me gusta es que la diadema es liviana, Aún teniendo tanto detalle. Yo utilizo espejuelos y lo que me gusta en particular es que no aprieta detrás de las orejas, es muy cómoda. La diadema perdió 2 piedras, pero el paquete trajo de respuesta así que pude reponer las piedras que se salieron.\nReview Title: Esta diadema es realmente hermosa.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Facial Body Skin Tightening Machine - Uaike High Frequency Facial Device for Anti Aging, Reduce Wrinkle, Skin Lifting, Skin Care Beauty\nReview Date: 2021/08/08\nStore: Uaike\nProduct Description: ['Skin Tightening Machine']\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Uaike', 'Color': 'Uaike Beauty Device', 'Item Dimensions LxWxH': '8.27 x 8.27 x 5 inches', 'Product Dimensions': '8.27 x 8.27 x 5 inches; 4.87 Pounds', 'Item model number': 'Uaike RF01', 'UPC': '681599295468', 'Manufacturer': 'Uaike'}\nReview Text: Me gustó que la máquina, es fácil de configurar y de usar, además incluye un DVD explicativo.<br />La máquina me pareció muy profesional, concidero que es ideal para spa y profesionales en el campo de la belleza, (en mi caso la utilizo para propósitos personales). Esta máquina debe usasrse con un gel especial antes de comenzar el procedimiento. La máquina es de muy buena calidad, tiene muy buena apariencia e incluye 2 cabezas masajeadoras, una para rostro y otra para el cuerpo, ambas fáciles de limpiar de muy buena calidad.<br /><br />Llevo usando esta máquina mucho tiempo, y debo decir que no es una máquina \"milagrosa\" lleva su tiempo y su proceso, en mi caso quiero mejorar la apariencia de mis estrías y sí han mejorado, no se han ido pero su apariencia luce más clara y limpia, así que estoy feliz con los resultados y seguiré usándola.\nReview Title: Excelente calidad, ideal para SPA y profesionales en la belleza.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Maestee Gel Nail Polish Set - 9 Bottles-Bright Neon Nail Polish With Glossy & Matte Gel Top Coat Base Coat Soak Off UV/LED Nail Lamp 0.28oz Set-C\nReview Date: 2021/09/05\nStore: maestee\nAverage Rating: 4.5\nProduct Details: {'Brand': 'maestee', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '10.00 Fl Oz', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.73 x 3.74 x 1.34 inches; 14.07 Ounces', 'UPC': '780262904833'}\nReview Text: Los colores están bellos, son vibrantes y llamativos igual a la foto, en lo personal me encantaron!!!\nReview Title: Excelente, los colores están bellos!!!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lenaqueen Velvet Wig Grip Band Adjustable No Slip Wig Grip Headbands for Women Keep Wigs in Place Grip Wig Bands (Dark Brown)\nReview Date: 2021/09/07\nStore: Lenaqueen\nAverage Rating: 3.7\nProduct Details: {'Age Range (Description)': 'Adult', 'Material': 'Velvet', 'Fabric Type': 'Velvet', 'Number of Items': '1', 'Brand': 'Lenaqueen', 'Product Dimensions': '2.36 x 1.18 x 0.39 inches; 0.63 Ounces'}\nReview Text: Funciona perfectamente, no es necesario una banda de latex ya que este hace muy buena función. La peluca no se.mueve.\nReview Title: Agarra muy bien la peluca\nRating: 3.0\n--------------------------------------------------",
  "reference": "Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nYanJie\n{'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReally gorgeous, these kitty ear headbands are super soft and pretty. I love them because they don't squeeze the ears. They fit great on me and my litt girl so I recommend them for mom and a daughter spa nights or for make a different gift.\nHeadlands\nEyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nEhinew\n{'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nRecomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nKit para cejas!\nMake-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nLOMANTOWN\n{'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\n[[VIDEOID:91aba66c2bcb51abc6efaed2336f619d]] Estoy encantada con mi nuevo storage, comenzando con lo lindo que se ve y lo espacioso que es, el artículo está hecho de plástico que se ve y se siente de buena calidad. Es un gavetero para guardar de todo desde cósmicos, cremas del cuidado del la piel o hasta artículos para el cabello, me encantó porqué es grande y espacioso, sinceramente me cupo todos mis artículos de mi cuidado facial y aún me queda espacio para guardar mas cosas. Otra cosa que me gustó mucho es que es tipo maletero, es fácil de mover y colocar en distintos lugares cómo en el vanity, baño, cuartos ect.\nOrganizador de cosméticos.\nAltaba Long Wavy Wigs Ombre Golden Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult'}\nLa peluca se ve bella, me encantó el largo y los risos del cabello además los colores son hermosos, pero cuándo voy a comprar o usar una peluca tomo en cuenta varias cosas y esta peluca no cumple con ninguno de los requisitos. Esta peluca parece peluca, que quiero decir? Bueno la banda del centro es demasiado ancha se puede notar claramente el grosor de la peluca con la división de la frente y se ve feo, otra cosa que no me gusta es que si peinas o mueves el cabello se ven claramente las bandas y los huecos sin cabello, es decir tiene muy poco cabello. Otra cosa que no me gusta es que la peluca suelta demasiado cabello no puedes pasar los dedos o peinar con cepillo porqué se salen los cabellos de la peluca. Desafortunadamente no la recomiendo.\nPeluca estilo ombre.\nBH DERMCENTER Retinol Serum Restores Rejuvenates and Purifies Skin, 1 oz, Reduces Appearance of Fine Lines, Non-GMO, Vegan, Cruelty Free\nBH DERMCENTER\n{'Product Dimensions': '2 x 2 x 5 inches; 1 Ounces', 'Item model number': 'BHDRETSER', 'UPC': '850004068076'}\nNo me gustó este suero para el rostro, comencé a usar este suero y ya en la 2nd vez mi piel comenzó a cambiar notoriamente, piel es sensible y este suero me causó un brote en la piel, mi piel comenzó a sentirse muy reseca, me dejó la piel muy maltratada, así que no lo recomiendo para personas con piel sensible.\nNo lo recomiendo para pieles sensibles.\nCanple Self-cleaning Slicker Brush for Medium Long Hair Types Dog and Cat, Removes Loose Hair Undercoat Effectively Reduce Mats & Tanglings Grooming Brush\nCanple\n{'Brand': 'Canple', 'Special Feature': 'Self Cleaning', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Hair Type': 'All', 'Package Dimensions': '10.16 x 6.3 x 2.2 inches; 8.82 Ounces'}\n[[VIDEOID:5ee8a58a8f5b5d4ef7ef0f6e1c59ab85]] Es un excelente artículo, lo recomiendo para aquellos gatos o perros que son muy peludos. En mi casa tengo un gato muy peludo, así que este cepillo es ideal para remover el pelo, y a la vez a mi gato le gusta el masaje que le da. En lo personal me gusta porqué es un cepillo fácil de limpiar. Me gustó mucho.\nIdeal para mascotas muy peludas.\nRonas Timeless Albutin Ampoule 0.06fl oz 10vial. herbal extracts moisturizing.Skin Tone up clear Brightenting.vitality. Beautysalon Brand\nRonas\n{'Skin Type': 'Dry', 'Brand': 'Ronas', 'Item Form': 'Ampoule', 'Item Volume': '2 Milliliters', 'Unit Count': '1.00 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.61 x 5.24 x 0.98 inches; 4.2 Ounces'}\nDesafortunadamente deben de mejorar el paquete de envío de este artículo, este artículo es demasiado delicado para enviarlo en un sobre normal. Desafortunadamente  mi paquete llegó roto, sólo 2 ampollas llegaron en buen estado, así que desde mi experiencia no lo recomiendo.\nMi paquete llegó roto.\nFascy Facial Mask Beauty Treatment 5 Packs 3 Step Mask, Korean Facial Skincare Mask, All Natural Moisturizing Facial Mask Skin Beauty Treatment with Eye Cream, Skin Rejuvenation Facial Mask\nFascy\n{'Brand': 'Fascy', 'Item Form': 'Cream, Sheet', 'Product Benefits': 'Hydrating', 'Scent': 'Centella Asiatica', 'Skin Type': 'Dry', 'Package Dimensions': '7.64 x 4.88 x 0.94 inches; 7.05 Ounces'}\nYa es la segunda vez que utilizo esta mascarilla, y tengo que decir que me encantan. Mi piel es sensible y me gusta que este set no causó ningún tipo de reacción alérgica, ni ardor, ni rojez. Al día siguiente mi piel se siente suave y reluciente, me encanta la sensación que deja esta mascarilla en mi piel.. algo que me gusta es que no se siente pegajosa y tampoco tienen olor, otra cosa que me gusta de esta mascarilla es que trae todo, crema para ojos, mascarilla de papel y una mascarilla para dormir.\nEsta mascarilla me encantó, deja mi piel reluciente.\nQTMY Wide Headbands Fashion Women Baroque Crystal Gemstone Hair Accessories Head Band Fashion Headwear Hairbands for Women\nQTMY\n{'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Plastic', 'Number of Items': '1', 'Brand': 'QTMY', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.5 x 5.94 x 1.97 inches; 5.61 Ounces', 'Item model number': 'ZJ'}\n[[VIDEOID:aae92d6d7eb66199773b79bd9fdddec6]] Esta diadema está hermosa, está muy bien hecha, es delicada y lo más que me gusta es que la diadema es liviana, Aún teniendo tanto detalle. Yo utilizo espejuelos y lo que me gusta en particular es que no aprieta detrás de las orejas, es muy cómoda. La diadema perdió 2 piedras, pero el paquete trajo de respuesta así que pude reponer las piedras que se salieron.\nEsta diadema es realmente hermosa.\nFacial Body Skin Tightening Machine - Uaike High Frequency Facial Device for Anti Aging, Reduce Wrinkle, Skin Lifting, Skin Care Beauty\nUaike\n['Skin Tightening Machine']\n{'Brand': 'Uaike', 'Color': 'Uaike Beauty Device', 'Item Dimensions LxWxH': '8.27 x 8.27 x 5 inches', 'Product Dimensions': '8.27 x 8.27 x 5 inches; 4.87 Pounds', 'Item model number': 'Uaike RF01', 'UPC': '681599295468', 'Manufacturer': 'Uaike'}\nMe gustó que la máquina, es fácil de configurar y de usar, además incluye un DVD explicativo.<br />La máquina me pareció muy profesional, concidero que es ideal para spa y profesionales en el campo de la belleza, (en mi caso la utilizo para propósitos personales). Esta máquina debe usasrse con un gel especial antes de comenzar el procedimiento. La máquina es de muy buena calidad, tiene muy buena apariencia e incluye 2 cabezas masajeadoras, una para rostro y otra para el cuerpo, ambas fáciles de limpiar de muy buena calidad.<br /><br />Llevo usando esta máquina mucho tiempo, y debo decir que no es una máquina \"milagrosa\" lleva su tiempo y su proceso, en mi caso quiero mejorar la apariencia de mis estrías y sí han mejorado, no se han ido pero su apariencia luce más clara y limpia, así que estoy feliz con los resultados y seguiré usándola.\nExcelente calidad, ideal para SPA y profesionales en la belleza.\nMaestee Gel Nail Polish Set - 9 Bottles-Bright Neon Nail Polish With Glossy & Matte Gel Top Coat Base Coat Soak Off UV/LED Nail Lamp 0.28oz Set-C\nmaestee\n{'Brand': 'maestee', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '10.00 Fl Oz', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.73 x 3.74 x 1.34 inches; 14.07 Ounces', 'UPC': '780262904833'}\nLos colores están bellos, son vibrantes y llamativos igual a la foto, en lo personal me encantaron!!!\nExcelente, los colores están bellos!!!\nLenaqueen Velvet Wig Grip Band Adjustable No Slip Wig Grip Headbands for Women Keep Wigs in Place Grip Wig Bands (Dark Brown)\nLenaqueen\n{'Age Range (Description)': 'Adult', 'Material': 'Velvet', 'Fabric Type': 'Velvet', 'Number of Items': '1', 'Brand': 'Lenaqueen', 'Product Dimensions': '2.36 x 1.18 x 0.39 inches; 0.63 Ounces'}\nFunciona perfectamente, no es necesario una banda de latex ya que este hace muy buena función. La peluca no se.mueve.\nAgarra muy bien la peluca",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Makeup Headband 4 Pack Bow Hair Band Women Cat Ears Facial Spa Headband Soft Carol Fleece Hair Stuff Hairlace Party Favors Skincare Headbands for Girls Washing Face Shower Mask (Blue,Purple,Pink,Gray)\nReview Date: 2020/10/23\nStore: YanJie\nAverage Rating: 4.2\nProduct Details: {'Color': 'Blue,Gray,Pink,Purple', 'Age Range (Description)': 'Adult', 'Occasion': 'Party', 'Material': 'Microfiber', 'Fabric Type': 'Microfiber,Fleece', 'Package Dimensions': '11.73 x 7.8 x 2.68 inches; 9.14 Ounces', 'UPC': '751300682587'}\nReview Text: Really gorgeous, these kitty ear headbands are super soft and pretty. I love them because they don't squeeze the ears. They fit great on me and my litt girl so I recommend them for mom and a daughter spa nights or for make a different gift.\nReview Title: Headlands\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyebrow Lamination Kit,Ehinew Professional Eyebrow Lift Kit,DIY Perm For Brows,Eyebrow Perm Kit for Women,Lasting For 8 Weeks,Suitable for Salon,Home Use\nReview Date: 2020/11/04\nStore: Ehinew\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Ehinew', 'Item Form': 'Pencil', 'Product Benefits': 'Long Lasting', 'Package Information': 'Tube', 'Package Type': 'Box', 'Package Dimensions': '6.5 x 4.65 x 1.1 inches; 4.16 Ounces'}\nReview Text: Recomiendo este kit sólo para las personas que les gusta este tipo de looks diferentes y dramáticos, el kit funciona perfectamente y es fácil de usar.. en cuanto a la duración es dependiendo de cuánto tengas que lavar las cejas o cuánto maquilles tus cejas, aproximadamente una semana. En lo personal no me gustó porque al aplicar la pega y cepillar remueve vellos de las cejas literalmente te arranca los pelos de las cejas, no duele pero me gusta cuidar de mis cejas.\nReview Title: Kit para cejas!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Make-up Organizers Storage Cosmetic Organizer Display Case Dustproof Storage Box Waterproof Holder Used for Bathroom w/Handle Christmas Gift 12\"L x 16\"H White\nReview Date: 2020/11/05\nStore: LOMANTOWN\nAverage Rating: 4.1\nProduct Details: {'Mounting Type Tabletop Mount': '', '': 'Unit Count 1.00 Count', 'Specific Uses For Product': 'Makeup Organizer,Cosmetic Organizer,Bathroom', 'Material': 'Plastic', 'Special Feature': 'Waterproof,Durable', 'Brand': 'LOMANTOWN', 'Package Type': 'Standard Packaging', 'Number of Items': '1', 'Package Dimensions': '17.25 x 13.25 x 10.35 inches; 5.6 Pounds'}\nReview Text: [[VIDEOID:91aba66c2bcb51abc6efaed2336f619d]] Estoy encantada con mi nuevo storage, comenzando con lo lindo que se ve y lo espacioso que es, el artículo está hecho de plástico que se ve y se siente de buena calidad. Es un gavetero para guardar de todo desde cósmicos, cremas del cuidado del la piel o hasta artículos para el cabello, me encantó porqué es grande y espacioso, sinceramente me cupo todos mis artículos de mi cuidado facial y aún me queda espacio para guardar mas cosas. Otra cosa que me gustó mucho es que es tipo maletero, es fácil de mover y colocar en distintos lugares cómo en el vanity, baño, cuartos ect.\nReview Title: Organizador de cosméticos.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Altaba Long Wavy Wigs Ombre Golden Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nReview Date: 2020/11/26\nStore: Altaba\nAverage Rating: 3.4\nProduct Details: {'Material': 'synthetic', 'Hair Type': 'Wavy', 'Brand': 'Altaba', 'Age Range (Description)': 'Adult'}\nReview Text: La peluca se ve bella, me encantó el largo y los risos del cabello además los colores son hermosos, pero cuándo voy a comprar o usar una peluca tomo en cuenta varias cosas y esta peluca no cumple con ninguno de los requisitos. Esta peluca parece peluca, que quiero decir? Bueno la banda del centro es demasiado ancha se puede notar claramente el grosor de la peluca con la división de la frente y se ve feo, otra cosa que no me gusta es que si peinas o mueves el cabello se ven claramente las bandas y los huecos sin cabello, es decir tiene muy poco cabello. Otra cosa que no me gusta es que la peluca suelta demasiado cabello no puedes pasar los dedos o peinar con cepillo porqué se salen los cabellos de la peluca. Desafortunadamente no la recomiendo.\nReview Title: Peluca estilo ombre.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: BH DERMCENTER Retinol Serum Restores Rejuvenates and Purifies Skin, 1 oz, Reduces Appearance of Fine Lines, Non-GMO, Vegan, Cruelty Free\nReview Date: 2020/12/26\nStore: BH DERMCENTER\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '2 x 2 x 5 inches; 1 Ounces', 'Item model number': 'BHDRETSER', 'UPC': '850004068076'}\nReview Text: No me gustó este suero para el rostro, comencé a usar este suero y ya en la 2nd vez mi piel comenzó a cambiar notoriamente, piel es sensible y este suero me causó un brote en la piel, mi piel comenzó a sentirse muy reseca, me dejó la piel muy maltratada, así que no lo recomiendo para personas con piel sensible.\nReview Title: No lo recomiendo para pieles sensibles.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Canple Self-cleaning Slicker Brush for Medium Long Hair Types Dog and Cat, Removes Loose Hair Undercoat Effectively Reduce Mats & Tanglings Grooming Brush\nReview Date: 2021/02/21\nStore: Canple\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Canple', 'Special Feature': 'Self Cleaning', 'Product Benefits': 'Smoothing', 'Unit Count': '1.00 Count', 'Hair Type': 'All', 'Package Dimensions': '10.16 x 6.3 x 2.2 inches; 8.82 Ounces'}\nReview Text: [[VIDEOID:5ee8a58a8f5b5d4ef7ef0f6e1c59ab85]] Es un excelente artículo, lo recomiendo para aquellos gatos o perros que son muy peludos. En mi casa tengo un gato muy peludo, así que este cepillo es ideal para remover el pelo, y a la vez a mi gato le gusta el masaje que le da. En lo personal me gusta porqué es un cepillo fácil de limpiar. Me gustó mucho.\nReview Title: Ideal para mascotas muy peludas.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Ronas Timeless Albutin Ampoule 0.06fl oz 10vial. herbal extracts moisturizing.Skin Tone up clear Brightenting.vitality. Beautysalon Brand\nReview Date: 2021/02/26\nStore: Ronas\nAverage Rating: 2.4\nProduct Details: {'Skin Type': 'Dry', 'Brand': 'Ronas', 'Item Form': 'Ampoule', 'Item Volume': '2 Milliliters', 'Unit Count': '1.00 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.61 x 5.24 x 0.98 inches; 4.2 Ounces'}\nReview Text: Desafortunadamente deben de mejorar el paquete de envío de este artículo, este artículo es demasiado delicado para enviarlo en un sobre normal. Desafortunadamente  mi paquete llegó roto, sólo 2 ampollas llegaron en buen estado, así que desde mi experiencia no lo recomiendo.\nReview Title: Mi paquete llegó roto.\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fascy Facial Mask Beauty Treatment 5 Packs 3 Step Mask, Korean Facial Skincare Mask, All Natural Moisturizing Facial Mask Skin Beauty Treatment with Eye Cream, Skin Rejuvenation Facial Mask\nReview Date: 2021/04/23\nStore: Fascy\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Fascy', 'Item Form': 'Cream, Sheet', 'Product Benefits': 'Hydrating', 'Scent': 'Centella Asiatica', 'Skin Type': 'Dry', 'Package Dimensions': '7.64 x 4.88 x 0.94 inches; 7.05 Ounces'}\nReview Text: Ya es la segunda vez que utilizo esta mascarilla, y tengo que decir que me encantan. Mi piel es sensible y me gusta que este set no causó ningún tipo de reacción alérgica, ni ardor, ni rojez. Al día siguiente mi piel se siente suave y reluciente, me encanta la sensación que deja esta mascarilla en mi piel.. algo que me gusta es que no se siente pegajosa y tampoco tienen olor, otra cosa que me gusta de esta mascarilla es que trae todo, crema para ojos, mascarilla de papel y una mascarilla para dormir.\nReview Title: Esta mascarilla me encantó, deja mi piel reluciente.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: QTMY Wide Headbands Fashion Women Baroque Crystal Gemstone Hair Accessories Head Band Fashion Headwear Hairbands for Women\nReview Date: 2021/06/17\nStore: QTMY\nAverage Rating: 3.6\nProduct Details: {'Age Range (Description)': 'Adult', 'Occasion': 'Wedding, Birthday', 'Material': 'Plastic', 'Number of Items': '1', 'Brand': 'QTMY', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.5 x 5.94 x 1.97 inches; 5.61 Ounces', 'Item model number': 'ZJ'}\nReview Text: [[VIDEOID:aae92d6d7eb66199773b79bd9fdddec6]] Esta diadema está hermosa, está muy bien hecha, es delicada y lo más que me gusta es que la diadema es liviana, Aún teniendo tanto detalle. Yo utilizo espejuelos y lo que me gusta en particular es que no aprieta detrás de las orejas, es muy cómoda. La diadema perdió 2 piedras, pero el paquete trajo de respuesta así que pude reponer las piedras que se salieron.\nReview Title: Esta diadema es realmente hermosa.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Facial Body Skin Tightening Machine - Uaike High Frequency Facial Device for Anti Aging, Reduce Wrinkle, Skin Lifting, Skin Care Beauty\nReview Date: 2021/08/08\nStore: Uaike\nProduct Description: ['Skin Tightening Machine']\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Uaike', 'Color': 'Uaike Beauty Device', 'Item Dimensions LxWxH': '8.27 x 8.27 x 5 inches', 'Product Dimensions': '8.27 x 8.27 x 5 inches; 4.87 Pounds', 'Item model number': 'Uaike RF01', 'UPC': '681599295468', 'Manufacturer': 'Uaike'}\nReview Text: Me gustó que la máquina, es fácil de configurar y de usar, además incluye un DVD explicativo.<br />La máquina me pareció muy profesional, concidero que es ideal para spa y profesionales en el campo de la belleza, (en mi caso la utilizo para propósitos personales). Esta máquina debe usasrse con un gel especial antes de comenzar el procedimiento. La máquina es de muy buena calidad, tiene muy buena apariencia e incluye 2 cabezas masajeadoras, una para rostro y otra para el cuerpo, ambas fáciles de limpiar de muy buena calidad.<br /><br />Llevo usando esta máquina mucho tiempo, y debo decir que no es una máquina \"milagrosa\" lleva su tiempo y su proceso, en mi caso quiero mejorar la apariencia de mis estrías y sí han mejorado, no se han ido pero su apariencia luce más clara y limpia, así que estoy feliz con los resultados y seguiré usándola.\nReview Title: Excelente calidad, ideal para SPA y profesionales en la belleza.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Maestee Gel Nail Polish Set - 9 Bottles-Bright Neon Nail Polish With Glossy & Matte Gel Top Coat Base Coat Soak Off UV/LED Nail Lamp 0.28oz Set-C\nReview Date: 2021/09/05\nStore: maestee\nAverage Rating: 4.5\nProduct Details: {'Brand': 'maestee', 'Item Form': 'Gel', 'Finish Type': 'Glossy', 'Age Range (Description)': 'Adult', 'Unit Count': '10.00 Fl Oz', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '11.73 x 3.74 x 1.34 inches; 14.07 Ounces', 'UPC': '780262904833'}\nReview Text: Los colores están bellos, son vibrantes y llamativos igual a la foto, en lo personal me encantaron!!!\nReview Title: Excelente, los colores están bellos!!!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lenaqueen Velvet Wig Grip Band Adjustable No Slip Wig Grip Headbands for Women Keep Wigs in Place Grip Wig Bands (Dark Brown)\nReview Date: 2021/09/07\nStore: Lenaqueen\nAverage Rating: 3.7\nProduct Details: {'Age Range (Description)': 'Adult', 'Material': 'Velvet', 'Fabric Type': 'Velvet', 'Number of Items': '1', 'Brand': 'Lenaqueen', 'Product Dimensions': '2.36 x 1.18 x 0.39 inches; 0.63 Ounces'}\nReview Text: Funciona perfectamente, no es necesario una banda de latex ya que este hace muy buena función. La peluca no se.mueve.\nReview Title: Agarra muy bien la peluca\nRating: 3.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user expressed high satisfaction with a variety of products, particularly highlighting their softness and aesthetic appeal. Items related to skincare and organization were favored for their effectiveness and quality, appreciating spacious designs and smooth finishes. Positive remarks were noted regarding beauty treatments that left skin feeling revitalized and non-irritated, as well as accessories that combined style and comfort. The user also highlighted the functionality of grooming tools praised for their ease of use and efficiency, making them ideal for personal care routines.\n\nNEGATIVE SUMMARY:\nThe user experienced several disappointments primarily related to product performance and quality. Specific beauty products caused discomfort or adverse reactions, such as skin irritation and hair loss during application. Storage and packaging issues were mentioned, with damaged items affecting overall satisfaction. Additionally, fashion accessories, although visually appealing, did not meet expectations for durability or functionality, leading to dissatisfaction due to perceived quality deficiencies in the materials.\n\nOVERALL SUMMARY:\nThe user's purchasing experiences display a mix of positive and negative outcomes. While they enjoyed several beauty and organizational products that delivered on comfort and effectiveness, there were notable frustrations regarding product reactions and packaging integrity. This indicates a trend where appearance and initial impressions were significant, but long-term usage and functionality revealed issues that detracted from overall satisfaction. Balancing aesthetics with quality remains a key concern for the user's future shopping choices.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Hermoso trios de bandas para la cabeza.",
    "text": "[[VIDEOID:3aae3b15b4d13f7c099ee00cc3bf4390]] Hermoso trios de bandas para la cabeza, este set es de 3 diademas trenzadas, los 3 colores son muy lindos, iguales a la foto. Tengo que decir que son diademas super cómodas, fácil de combinar y usar a mi niña le encantaron.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61Cer88SQWL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61Cer88SQWL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61Cer88SQWL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61GX52X6SZL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61GX52X6SZL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61GX52X6SZL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B096LDHLNM",
    "parent_asin": "B096LDHLNM",
    "user_id": "AFL5OB2GSBEQMSEYKWV732IWQ3GQ",
    "timestamp": "2022-02-24 17:41:26.116000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Headband of Women , 3 Packs Wide Edge Velvet Twist Braided Hair Band , Solid Color Fashion Hair Bands. (Green/Yellow/Rose red)",
    "average_rating": 3.5,
    "rating_number": 21,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51GBIzLGsIS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GBIzLGsIS.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71dp8CAaNBS._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/419FuBDcRuS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/419FuBDcRuS.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61dQaMjcx5S._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Q4ig6vlbS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Q4ig6vlbS.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/711F-aXxN+S._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/513GnQkp5CS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/513GnQkp5CS.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61wnrsS1dLS._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51XcHhTgwbS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51XcHhTgwbS.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61quXYRBzmS._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51AxzAqY-CS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51AxzAqY-CS.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71oihFzhVGS._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/4188idk1dLS._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/4188idk1dLS.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/517PLxES+qS._SL1001_.jpg"
      }
    ],
    "videos": [],
    "store": "SportMore",
    "categories": [],
    "details": {
      "Color": "Yellow,Green,Red,Rose",
      "Age Range (Description)": "Adult",
      "Material": "Plastic",
      "Fabric Type": "Velvet",
      "Number of Items": "3",
      "Package Dimensions": "8.23 x 7.6 x 2.24 inches; 6.74 Ounces",
      "UPC": "781509879037"
    },
    "bought_together": null
  }
}