{
  "user_id": "AHISU6WTZZJNNVYK5A5UITDIWCNQ",
  "summary": "=== Purchase Information ===\nProduct Title: Silicone Makeup Sponge 2 Pack Premium Quality Silisponge -Easy To Wash Beauty Sponge Applicator for Flawless Application of Liquid Foundation,Primer, Concealer by SEALUXE\nReview Date: 2017/11/28\nStore: SEALUXE\nAverage Rating: 3.4\nProduct Details: {'Brand': 'SEALUXE', 'Item Dimensions LxWxH': '3.5 x 3.5 x 0.6 inches', 'Recommended Uses For Product': 'Makeup'}\nReview Text: My 18 year old grand daughter does her full face make up everyday whether she is leaving the house or not. I will admit she is pretty good at it, but she does spend alot of money on it. She had been using a sponge type and what she said that she really likes about this blender is that there is alot less waste of makeup, since the sponge absorbs it and this silicone blender spreads it. She said it spreads alot more evenly also and she was very happy with how she could clean it easily in water after each use.\nReview Title: SPREADS EVENLY & CLEANS EASILY\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair Styling Spray - Professional Extra Firm Hold Flexible Hairspray, 3-Level Adjustable Nozzle, Best Heat Resistant Anti-Humidity Finishing Hair Sprays, Hold it Right There (10oz)\nReview Date: 2017/12/16\nStore: Leyla Milani Hair\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'All', 'Liquid Volume': '10 Fluid Ounces', 'Item Form': 'Spray', 'Brand': 'Leyla Milani Hair', 'Number of Items': '1', 'Package Dimensions': '10 x 2 x 1.7 inches; 12.8 Ounces'}\nReview Text: I have kind of fine hair, but it is like I have alot of it. My hair normally when I curl it is flat within 1 hour tops. Even when I use hair spray, to even get it to hold I have to use alot of hairspray and then my hair feels so stiff and gross looking. This hair spray held my hair all day long and my hair was not at all stiff or hard or sticky, it was very free flowing. I absolutely love the smell of this hair spray. You adjust the spray flow on the nozzle. So depending on how I want my hair to be for the day is whether I use  the light, the medium or the high spray.\nReview Title: HELD MY HAIR CURLS ALL DAY LONG & SMELLS GREAT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair - Heat Protecting Anti Frizz Shine & Thermal Spray Alcohol-Free, Clean Melon Scent, Hair Repair - Glossilocks Spray - msrp $23\nReview Date: 2018/01/31\nStore: Leyla Milani Hair\nAverage Rating: 3.9\nProduct Details: {'Hair Type': 'All', 'Item Form': 'spray', 'Brand': 'Leyla Milani Hair', 'Number of Items': '1', 'Unit Count': '4.75 Ounce'}\nReview Text: I have very dull and lifeless hair, I think it is from too much sun and abuse growing up My hair is light weight but very frizzy so I have to use straighteners or curling irons to have it look decent. This has definitely made my hair shiny and looking great. I just sprayed it on damp hair, I combed it through and then I used a flat iron and I have also used it with the curling iron and I loved the outcome. My hair definitely had alot more life to it. I think if your hair looks good you feel good about yourself. The smell of this spray is amazing, it is like a fresh melon scent. It is super easy to use and I love that it gives my hair a layer of protection from the heated hair appliances and the sun. It is for all hair types and it is very light weight.\nReview Title: FANTASTIC SCENT & LOVING THE SHINY HAIR\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tanali Contour Highlighter Powder Palette -4 Color Matte Glitter Foundation Face Makeup Compact Set (#2)\nReview Date: 2018/02/17\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Powder', 'Finish Type': 'Matte', 'Unit Count': '1 Count', 'Number of Items': '1', 'Style': 'Compact', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.59 x 4.41 x 0.98 inches; 3.84 Ounces', 'UPC': '712069255788'}\nReview Text: My grand daughter used this on many different areas of her body for high lighting purposes. She really liked it. Said it went on easily and stayed on. She is very fair skinned so it looked really nice and stood out. You get 4 colors and they are a matte with a sparklyness to it. It is a compact design and worked great for contouring also. She had no irritations or problems with it.\nReview Title: LOVE IT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair Straightener Flat-Iron - 1 Inch Professional Ceramic Tourmaline Dual Voltage Hair-Straightening-Irons, Best Styling Tools, LCD Display Adjustable Temp | Give it to Me Straight - $110\nReview Date: 2018/08/07\nStore: Leyla Milani Hair\nAverage Rating: 3.7\nProduct Details: {'Package Dimensions': '13.75 x 4.6 x 2.75 inches; 1.65 Pounds', 'UPC': '855389006460'}\nReview Text: My husband and I are getting ready to take a trip abroad. I was worried about what I would use on my hair, because it has a mind of its own. He surprised me and bought me this flat iron for our trip since it is dual voltage. I have thin hair, but I have a lot of hair and with this having temperatures from 230 to 450 degrees I usually only have to set it at 350 for my type of hair to get it straight. It have a very nice LCD display that is very easy to read. This is a 1 inch ceramic tourmaline flat iron. It worked great in my hair making it very soft, shiny and smooth and it was done very quickly. I also like that it has an auto shut off, since I can easily get distracted. It comes with a very pretty satin drawstring bag, that will be great for putting it in my luggage.\nReview Title: SOFT, SHINY & SMOOTH HAIR\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair - No Crease, No Tug, Ouch-less design, hand dyed, Hair Accessories, Ponytail Holder, stretchy material 4pack, Best Hair Tie for Women, Teens, Girls - All Tied Up Hair Ties - msrp $18\nReview Date: 2018/09/18\nStore: Leyla Milani Hair\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Ribbon', 'Brand': 'Leyla Milani Hair', 'Hair Type': 'All', 'Number of Pieces': '4', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.5 x 3.4 x 0.4 inches; 0.63 Ounces', 'UPC': '855389006491'}\nReview Text: My hair is always breaking and coming off in my hair ties, so recently I have started replacing all my normal hair ties with hair items that are less damaging to my hair. I really like how these hold my long hair snug in a ponytail and they don’t pull on my hair when I take them out. I love the colors too, teal and black are my favorite colors.\nReview Title: LOVE THAT THEY DON’T PULL MY HAIR OUT WHEN I TAKE THEM OFF\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Professional Hair Straightener, Inkint Ceramic Tourmaline Ionic Flat Iron Styling Iron with LCD Display, Adjustable Temperature, Dual Voltage,Instant Heat Up,Heat Resistant Glove\nReview Date: 2018/11/26\nStore: inkint\nAverage Rating: 4.1\nProduct Details: {'Shape': 'Flat', 'Brand': 'Inkint', 'Hair Type': 'All', 'Material': 'Ceramic Tourmaline', 'Color': 'Purple', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.98 x 4.33 x 2.17 inches; 1.46 Pounds', 'UPC': '882200488990'}\nReview Text: I can't believe how fast this flat iron heated up, it was like instantly. It has a nicely lit LCD screen. All the buttons are on the inside, which is good since I usually hit the controls on my hair curling wand because they are on the outside. The temperature is adjustable, I only needed it about halfway since I have a finer hair. It does come with a heat resistant glove, instructions and a carrying case/ storage bag. There is a little loop on the cord so you can hang it and the cord also rotates so it doesn't get all tangled up.\nReview Title: HEATS UP VERY FAST & WORKS GREAT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: L’ange Hair Borago Borage Oil Deep Conditioning Masque | Powerful Nourishing Borage Oil for Hair | Ideal for Medium to Coarse Hair\nReview Date: 2019/04/02\nStore: L'ANGE HAIR\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.6 x 3.6 x 2.5 inches; 10 Ounces', 'Item model number': '2113', 'UPC': '810108191612'}\nReview Text: I had bought myself a  heat cap for my hair because my hair is dry and it has really been thinning since I started becoming middle aged. My sister gave me this deep condition protein  hair mask a few months ago to try. I have been using it once a week and my hair is definitely a lot softer and shinier. The one thing that really sticks out is the smell, it is very pleasant and not over powering.\nReview Title: LEAVES HAIR SOFT & SHINY\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fascigirl Hair Claw Clip, 18 PCS Womens Jaw Clip Vintage Hair Clamp Hair Accessory for Bath Shower … (18 pcs claw clips)\nReview Date: 2019/05/08\nStore: Fascigirl\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Fascigirl', 'Unit Count': '18.00 Count', 'Item Dimensions LxWxH': '4.33 x 1.97 x 4.33 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.33 x 1.97 x 4.33 inches; 6.88 Ounces', 'Item model number': 'TAB0247QTCA11CML2'}\nReview Text: My hair is fine and I have a hard time finding hair clips that keep my hair up, usually my hair slides right on through and falls down. I am very happy so far.\nReview Title: GREAT GRASP ON MY HAIR\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: L’Ange Hair Le Rêve Titanium Straightener - 2 in 1 Ceramic Hair Straightener - Titanium Hair Straightener with Dual Voltage - Ionic Straightener with Digital Display - 1“ Plate, MSRP $179.00\nReview Date: 2020/03/02\nStore: L'ANGE HAIR\nAverage Rating: 4.6\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Hair Type': 'Frizzy', 'Material': 'Titanium', 'Color': 'Black', 'Size': '1 Count (Pack of 1)', 'Package Dimensions': '14.37 x 5.12 x 2.4 inches; 1.67 Pounds', 'UPC': '797822150043', 'Manufacturer': \"L'ANGE HAIR\"}\nReview Text: I am so happy that I finally have a flat iron to take with me when I travel to Greece this spring, it is my 1st dual voltage hair appliance so I am quite excited to test it out there.  My hair has a mind of its own, so I have to keep it straightened. It is pretty light weight and I really like the black color with the rose gold accents.  It heats up very fast and really left my hair smooth and silky. So far I am very happy with it and to me the true test will be when I go overseas. As you can see in my picture it has an infrared light strip in the center of  the straightener.\nReview Title: DUAL VOLTAGE HAIR STRAIGHTENER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Flosuber Shower Brush with 100% Natural Loofah, Body Brushes Perfect for Exfoliating, Bath Back Loofahs Brush with Removable Dual-Purpose Long Handle\nReview Date: 2021/05/29\nStore: Flosuber\nAverage Rating: 3.6\nProduct Details: {'Material': 'Sponge', 'Brand': 'Flosuber', 'Power Source': 'Hand_powered', 'Product Benefits': 'Softening,Massage,Pores,Clean,Exfoliating', 'Skin Type': 'Acne Prone,Oily', 'Package Dimensions': '16.02 x 6.69 x 1.26 inches; 5.61 Ounces', 'UPC': '782932073702', 'Manufacturer': 'Flosuber'}\nReview Text: As I get older my skin seems to be drier and itchier. I can no longer reach all my back area and this loofah brush is great for getting those areas.  It is always fun to watch how big it can get in water. Not only does it clean my back but it also feels like a massager. It has a wooden handle that is removable and a rope through the handle to hang it in the shower. It is very well made.\nReview Title: WORKS GREAT\nRating: 5.0\n--------------------------------------------------",
  "reference": "Silicone Makeup Sponge 2 Pack Premium Quality Silisponge -Easy To Wash Beauty Sponge Applicator for Flawless Application of Liquid Foundation,Primer, Concealer by SEALUXE\nSEALUXE\n{'Brand': 'SEALUXE', 'Item Dimensions LxWxH': '3.5 x 3.5 x 0.6 inches', 'Recommended Uses For Product': 'Makeup'}\nMy 18 year old grand daughter does her full face make up everyday whether she is leaving the house or not. I will admit she is pretty good at it, but she does spend alot of money on it. She had been using a sponge type and what she said that she really likes about this blender is that there is alot less waste of makeup, since the sponge absorbs it and this silicone blender spreads it. She said it spreads alot more evenly also and she was very happy with how she could clean it easily in water after each use.\nSPREADS EVENLY & CLEANS EASILY\nLeyla Milani Hair Styling Spray - Professional Extra Firm Hold Flexible Hairspray, 3-Level Adjustable Nozzle, Best Heat Resistant Anti-Humidity Finishing Hair Sprays, Hold it Right There (10oz)\nLeyla Milani Hair\n{'Hair Type': 'All', 'Liquid Volume': '10 Fluid Ounces', 'Item Form': 'Spray', 'Brand': 'Leyla Milani Hair', 'Number of Items': '1', 'Package Dimensions': '10 x 2 x 1.7 inches; 12.8 Ounces'}\nI have kind of fine hair, but it is like I have alot of it. My hair normally when I curl it is flat within 1 hour tops. Even when I use hair spray, to even get it to hold I have to use alot of hairspray and then my hair feels so stiff and gross looking. This hair spray held my hair all day long and my hair was not at all stiff or hard or sticky, it was very free flowing. I absolutely love the smell of this hair spray. You adjust the spray flow on the nozzle. So depending on how I want my hair to be for the day is whether I use  the light, the medium or the high spray.\nHELD MY HAIR CURLS ALL DAY LONG & SMELLS GREAT\nLeyla Milani Hair - Heat Protecting Anti Frizz Shine & Thermal Spray Alcohol-Free, Clean Melon Scent, Hair Repair - Glossilocks Spray - msrp $23\nLeyla Milani Hair\n{'Hair Type': 'All', 'Item Form': 'spray', 'Brand': 'Leyla Milani Hair', 'Number of Items': '1', 'Unit Count': '4.75 Ounce'}\nI have very dull and lifeless hair, I think it is from too much sun and abuse growing up My hair is light weight but very frizzy so I have to use straighteners or curling irons to have it look decent. This has definitely made my hair shiny and looking great. I just sprayed it on damp hair, I combed it through and then I used a flat iron and I have also used it with the curling iron and I loved the outcome. My hair definitely had alot more life to it. I think if your hair looks good you feel good about yourself. The smell of this spray is amazing, it is like a fresh melon scent. It is super easy to use and I love that it gives my hair a layer of protection from the heated hair appliances and the sun. It is for all hair types and it is very light weight.\nFANTASTIC SCENT & LOVING THE SHINY HAIR\nTanali Contour Highlighter Powder Palette -4 Color Matte Glitter Foundation Face Makeup Compact Set (#2)\n{'Item Form': 'Powder', 'Finish Type': 'Matte', 'Unit Count': '1 Count', 'Number of Items': '1', 'Style': 'Compact', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.59 x 4.41 x 0.98 inches; 3.84 Ounces', 'UPC': '712069255788'}\nMy grand daughter used this on many different areas of her body for high lighting purposes. She really liked it. Said it went on easily and stayed on. She is very fair skinned so it looked really nice and stood out. You get 4 colors and they are a matte with a sparklyness to it. It is a compact design and worked great for contouring also. She had no irritations or problems with it.\nLOVE IT\nLeyla Milani Hair Straightener Flat-Iron - 1 Inch Professional Ceramic Tourmaline Dual Voltage Hair-Straightening-Irons, Best Styling Tools, LCD Display Adjustable Temp | Give it to Me Straight - $110\nLeyla Milani Hair\n{'Package Dimensions': '13.75 x 4.6 x 2.75 inches; 1.65 Pounds', 'UPC': '855389006460'}\nMy husband and I are getting ready to take a trip abroad. I was worried about what I would use on my hair, because it has a mind of its own. He surprised me and bought me this flat iron for our trip since it is dual voltage. I have thin hair, but I have a lot of hair and with this having temperatures from 230 to 450 degrees I usually only have to set it at 350 for my type of hair to get it straight. It have a very nice LCD display that is very easy to read. This is a 1 inch ceramic tourmaline flat iron. It worked great in my hair making it very soft, shiny and smooth and it was done very quickly. I also like that it has an auto shut off, since I can easily get distracted. It comes with a very pretty satin drawstring bag, that will be great for putting it in my luggage.\nSOFT, SHINY & SMOOTH HAIR\nLeyla Milani Hair - No Crease, No Tug, Ouch-less design, hand dyed, Hair Accessories, Ponytail Holder, stretchy material 4pack, Best Hair Tie for Women, Teens, Girls - All Tied Up Hair Ties - msrp $18\nLeyla Milani Hair\n{'Item Form': 'Ribbon', 'Brand': 'Leyla Milani Hair', 'Hair Type': 'All', 'Number of Pieces': '4', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.5 x 3.4 x 0.4 inches; 0.63 Ounces', 'UPC': '855389006491'}\nMy hair is always breaking and coming off in my hair ties, so recently I have started replacing all my normal hair ties with hair items that are less damaging to my hair. I really like how these hold my long hair snug in a ponytail and they don’t pull on my hair when I take them out. I love the colors too, teal and black are my favorite colors.\nLOVE THAT THEY DON’T PULL MY HAIR OUT WHEN I TAKE THEM OFF\nProfessional Hair Straightener, Inkint Ceramic Tourmaline Ionic Flat Iron Styling Iron with LCD Display, Adjustable Temperature, Dual Voltage,Instant Heat Up,Heat Resistant Glove\ninkint\n{'Shape': 'Flat', 'Brand': 'Inkint', 'Hair Type': 'All', 'Material': 'Ceramic Tourmaline', 'Color': 'Purple', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.98 x 4.33 x 2.17 inches; 1.46 Pounds', 'UPC': '882200488990'}\nI can't believe how fast this flat iron heated up, it was like instantly. It has a nicely lit LCD screen. All the buttons are on the inside, which is good since I usually hit the controls on my hair curling wand because they are on the outside. The temperature is adjustable, I only needed it about halfway since I have a finer hair. It does come with a heat resistant glove, instructions and a carrying case/ storage bag. There is a little loop on the cord so you can hang it and the cord also rotates so it doesn't get all tangled up.\nHEATS UP VERY FAST & WORKS GREAT\nL’ange Hair Borago Borage Oil Deep Conditioning Masque | Powerful Nourishing Borage Oil for Hair | Ideal for Medium to Coarse Hair\nL'ANGE HAIR\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.6 x 3.6 x 2.5 inches; 10 Ounces', 'Item model number': '2113', 'UPC': '810108191612'}\nI had bought myself a  heat cap for my hair because my hair is dry and it has really been thinning since I started becoming middle aged. My sister gave me this deep condition protein  hair mask a few months ago to try. I have been using it once a week and my hair is definitely a lot softer and shinier. The one thing that really sticks out is the smell, it is very pleasant and not over powering.\nLEAVES HAIR SOFT & SHINY\nFascigirl Hair Claw Clip, 18 PCS Womens Jaw Clip Vintage Hair Clamp Hair Accessory for Bath Shower … (18 pcs claw clips)\nFascigirl\n{'Brand': 'Fascigirl', 'Unit Count': '18.00 Count', 'Item Dimensions LxWxH': '4.33 x 1.97 x 4.33 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.33 x 1.97 x 4.33 inches; 6.88 Ounces', 'Item model number': 'TAB0247QTCA11CML2'}\nMy hair is fine and I have a hard time finding hair clips that keep my hair up, usually my hair slides right on through and falls down. I am very happy so far.\nGREAT GRASP ON MY HAIR\nL’Ange Hair Le Rêve Titanium Straightener - 2 in 1 Ceramic Hair Straightener - Titanium Hair Straightener with Dual Voltage - Ionic Straightener with Digital Display - 1“ Plate, MSRP $179.00\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Hair Type': 'Frizzy', 'Material': 'Titanium', 'Color': 'Black', 'Size': '1 Count (Pack of 1)', 'Package Dimensions': '14.37 x 5.12 x 2.4 inches; 1.67 Pounds', 'UPC': '797822150043', 'Manufacturer': \"L'ANGE HAIR\"}\nI am so happy that I finally have a flat iron to take with me when I travel to Greece this spring, it is my 1st dual voltage hair appliance so I am quite excited to test it out there.  My hair has a mind of its own, so I have to keep it straightened. It is pretty light weight and I really like the black color with the rose gold accents.  It heats up very fast and really left my hair smooth and silky. So far I am very happy with it and to me the true test will be when I go overseas. As you can see in my picture it has an infrared light strip in the center of  the straightener.\nDUAL VOLTAGE HAIR STRAIGHTENER\nFlosuber Shower Brush with 100% Natural Loofah, Body Brushes Perfect for Exfoliating, Bath Back Loofahs Brush with Removable Dual-Purpose Long Handle\nFlosuber\n{'Material': 'Sponge', 'Brand': 'Flosuber', 'Power Source': 'Hand_powered', 'Product Benefits': 'Softening,Massage,Pores,Clean,Exfoliating', 'Skin Type': 'Acne Prone,Oily', 'Package Dimensions': '16.02 x 6.69 x 1.26 inches; 5.61 Ounces', 'UPC': '782932073702', 'Manufacturer': 'Flosuber'}\nAs I get older my skin seems to be drier and itchier. I can no longer reach all my back area and this loofah brush is great for getting those areas.  It is always fun to watch how big it can get in water. Not only does it clean my back but it also feels like a massager. It has a wooden handle that is removable and a rope through the handle to hang it in the shower. It is very well made.\nWORKS GREAT",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Silicone Makeup Sponge 2 Pack Premium Quality Silisponge -Easy To Wash Beauty Sponge Applicator for Flawless Application of Liquid Foundation,Primer, Concealer by SEALUXE\nReview Date: 2017/11/28\nStore: SEALUXE\nAverage Rating: 3.4\nProduct Details: {'Brand': 'SEALUXE', 'Item Dimensions LxWxH': '3.5 x 3.5 x 0.6 inches', 'Recommended Uses For Product': 'Makeup'}\nReview Text: My 18 year old grand daughter does her full face make up everyday whether she is leaving the house or not. I will admit she is pretty good at it, but she does spend alot of money on it. She had been using a sponge type and what she said that she really likes about this blender is that there is alot less waste of makeup, since the sponge absorbs it and this silicone blender spreads it. She said it spreads alot more evenly also and she was very happy with how she could clean it easily in water after each use.\nReview Title: SPREADS EVENLY & CLEANS EASILY\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair Styling Spray - Professional Extra Firm Hold Flexible Hairspray, 3-Level Adjustable Nozzle, Best Heat Resistant Anti-Humidity Finishing Hair Sprays, Hold it Right There (10oz)\nReview Date: 2017/12/16\nStore: Leyla Milani Hair\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'All', 'Liquid Volume': '10 Fluid Ounces', 'Item Form': 'Spray', 'Brand': 'Leyla Milani Hair', 'Number of Items': '1', 'Package Dimensions': '10 x 2 x 1.7 inches; 12.8 Ounces'}\nReview Text: I have kind of fine hair, but it is like I have alot of it. My hair normally when I curl it is flat within 1 hour tops. Even when I use hair spray, to even get it to hold I have to use alot of hairspray and then my hair feels so stiff and gross looking. This hair spray held my hair all day long and my hair was not at all stiff or hard or sticky, it was very free flowing. I absolutely love the smell of this hair spray. You adjust the spray flow on the nozzle. So depending on how I want my hair to be for the day is whether I use  the light, the medium or the high spray.\nReview Title: HELD MY HAIR CURLS ALL DAY LONG & SMELLS GREAT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair - Heat Protecting Anti Frizz Shine & Thermal Spray Alcohol-Free, Clean Melon Scent, Hair Repair - Glossilocks Spray - msrp $23\nReview Date: 2018/01/31\nStore: Leyla Milani Hair\nAverage Rating: 3.9\nProduct Details: {'Hair Type': 'All', 'Item Form': 'spray', 'Brand': 'Leyla Milani Hair', 'Number of Items': '1', 'Unit Count': '4.75 Ounce'}\nReview Text: I have very dull and lifeless hair, I think it is from too much sun and abuse growing up My hair is light weight but very frizzy so I have to use straighteners or curling irons to have it look decent. This has definitely made my hair shiny and looking great. I just sprayed it on damp hair, I combed it through and then I used a flat iron and I have also used it with the curling iron and I loved the outcome. My hair definitely had alot more life to it. I think if your hair looks good you feel good about yourself. The smell of this spray is amazing, it is like a fresh melon scent. It is super easy to use and I love that it gives my hair a layer of protection from the heated hair appliances and the sun. It is for all hair types and it is very light weight.\nReview Title: FANTASTIC SCENT & LOVING THE SHINY HAIR\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tanali Contour Highlighter Powder Palette -4 Color Matte Glitter Foundation Face Makeup Compact Set (#2)\nReview Date: 2018/02/17\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Powder', 'Finish Type': 'Matte', 'Unit Count': '1 Count', 'Number of Items': '1', 'Style': 'Compact', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.59 x 4.41 x 0.98 inches; 3.84 Ounces', 'UPC': '712069255788'}\nReview Text: My grand daughter used this on many different areas of her body for high lighting purposes. She really liked it. Said it went on easily and stayed on. She is very fair skinned so it looked really nice and stood out. You get 4 colors and they are a matte with a sparklyness to it. It is a compact design and worked great for contouring also. She had no irritations or problems with it.\nReview Title: LOVE IT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair Straightener Flat-Iron - 1 Inch Professional Ceramic Tourmaline Dual Voltage Hair-Straightening-Irons, Best Styling Tools, LCD Display Adjustable Temp | Give it to Me Straight - $110\nReview Date: 2018/08/07\nStore: Leyla Milani Hair\nAverage Rating: 3.7\nProduct Details: {'Package Dimensions': '13.75 x 4.6 x 2.75 inches; 1.65 Pounds', 'UPC': '855389006460'}\nReview Text: My husband and I are getting ready to take a trip abroad. I was worried about what I would use on my hair, because it has a mind of its own. He surprised me and bought me this flat iron for our trip since it is dual voltage. I have thin hair, but I have a lot of hair and with this having temperatures from 230 to 450 degrees I usually only have to set it at 350 for my type of hair to get it straight. It have a very nice LCD display that is very easy to read. This is a 1 inch ceramic tourmaline flat iron. It worked great in my hair making it very soft, shiny and smooth and it was done very quickly. I also like that it has an auto shut off, since I can easily get distracted. It comes with a very pretty satin drawstring bag, that will be great for putting it in my luggage.\nReview Title: SOFT, SHINY & SMOOTH HAIR\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Leyla Milani Hair - No Crease, No Tug, Ouch-less design, hand dyed, Hair Accessories, Ponytail Holder, stretchy material 4pack, Best Hair Tie for Women, Teens, Girls - All Tied Up Hair Ties - msrp $18\nReview Date: 2018/09/18\nStore: Leyla Milani Hair\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Ribbon', 'Brand': 'Leyla Milani Hair', 'Hair Type': 'All', 'Number of Pieces': '4', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.5 x 3.4 x 0.4 inches; 0.63 Ounces', 'UPC': '855389006491'}\nReview Text: My hair is always breaking and coming off in my hair ties, so recently I have started replacing all my normal hair ties with hair items that are less damaging to my hair. I really like how these hold my long hair snug in a ponytail and they don’t pull on my hair when I take them out. I love the colors too, teal and black are my favorite colors.\nReview Title: LOVE THAT THEY DON’T PULL MY HAIR OUT WHEN I TAKE THEM OFF\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Professional Hair Straightener, Inkint Ceramic Tourmaline Ionic Flat Iron Styling Iron with LCD Display, Adjustable Temperature, Dual Voltage,Instant Heat Up,Heat Resistant Glove\nReview Date: 2018/11/26\nStore: inkint\nAverage Rating: 4.1\nProduct Details: {'Shape': 'Flat', 'Brand': 'Inkint', 'Hair Type': 'All', 'Material': 'Ceramic Tourmaline', 'Color': 'Purple', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.98 x 4.33 x 2.17 inches; 1.46 Pounds', 'UPC': '882200488990'}\nReview Text: I can't believe how fast this flat iron heated up, it was like instantly. It has a nicely lit LCD screen. All the buttons are on the inside, which is good since I usually hit the controls on my hair curling wand because they are on the outside. The temperature is adjustable, I only needed it about halfway since I have a finer hair. It does come with a heat resistant glove, instructions and a carrying case/ storage bag. There is a little loop on the cord so you can hang it and the cord also rotates so it doesn't get all tangled up.\nReview Title: HEATS UP VERY FAST & WORKS GREAT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: L’ange Hair Borago Borage Oil Deep Conditioning Masque | Powerful Nourishing Borage Oil for Hair | Ideal for Medium to Coarse Hair\nReview Date: 2019/04/02\nStore: L'ANGE HAIR\nAverage Rating: 4.6\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.6 x 3.6 x 2.5 inches; 10 Ounces', 'Item model number': '2113', 'UPC': '810108191612'}\nReview Text: I had bought myself a  heat cap for my hair because my hair is dry and it has really been thinning since I started becoming middle aged. My sister gave me this deep condition protein  hair mask a few months ago to try. I have been using it once a week and my hair is definitely a lot softer and shinier. The one thing that really sticks out is the smell, it is very pleasant and not over powering.\nReview Title: LEAVES HAIR SOFT & SHINY\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fascigirl Hair Claw Clip, 18 PCS Womens Jaw Clip Vintage Hair Clamp Hair Accessory for Bath Shower … (18 pcs claw clips)\nReview Date: 2019/05/08\nStore: Fascigirl\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Fascigirl', 'Unit Count': '18.00 Count', 'Item Dimensions LxWxH': '4.33 x 1.97 x 4.33 inches', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.33 x 1.97 x 4.33 inches; 6.88 Ounces', 'Item model number': 'TAB0247QTCA11CML2'}\nReview Text: My hair is fine and I have a hard time finding hair clips that keep my hair up, usually my hair slides right on through and falls down. I am very happy so far.\nReview Title: GREAT GRASP ON MY HAIR\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: L’Ange Hair Le Rêve Titanium Straightener - 2 in 1 Ceramic Hair Straightener - Titanium Hair Straightener with Dual Voltage - Ionic Straightener with Digital Display - 1“ Plate, MSRP $179.00\nReview Date: 2020/03/02\nStore: L'ANGE HAIR\nAverage Rating: 4.6\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Hair Type': 'Frizzy', 'Material': 'Titanium', 'Color': 'Black', 'Size': '1 Count (Pack of 1)', 'Package Dimensions': '14.37 x 5.12 x 2.4 inches; 1.67 Pounds', 'UPC': '797822150043', 'Manufacturer': \"L'ANGE HAIR\"}\nReview Text: I am so happy that I finally have a flat iron to take with me when I travel to Greece this spring, it is my 1st dual voltage hair appliance so I am quite excited to test it out there.  My hair has a mind of its own, so I have to keep it straightened. It is pretty light weight and I really like the black color with the rose gold accents.  It heats up very fast and really left my hair smooth and silky. So far I am very happy with it and to me the true test will be when I go overseas. As you can see in my picture it has an infrared light strip in the center of  the straightener.\nReview Title: DUAL VOLTAGE HAIR STRAIGHTENER\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Flosuber Shower Brush with 100% Natural Loofah, Body Brushes Perfect for Exfoliating, Bath Back Loofahs Brush with Removable Dual-Purpose Long Handle\nReview Date: 2021/05/29\nStore: Flosuber\nAverage Rating: 3.6\nProduct Details: {'Material': 'Sponge', 'Brand': 'Flosuber', 'Power Source': 'Hand_powered', 'Product Benefits': 'Softening,Massage,Pores,Clean,Exfoliating', 'Skin Type': 'Acne Prone,Oily', 'Package Dimensions': '16.02 x 6.69 x 1.26 inches; 5.61 Ounces', 'UPC': '782932073702', 'Manufacturer': 'Flosuber'}\nReview Text: As I get older my skin seems to be drier and itchier. I can no longer reach all my back area and this loofah brush is great for getting those areas.  It is always fun to watch how big it can get in water. Not only does it clean my back but it also feels like a massager. It has a wooden handle that is removable and a rope through the handle to hang it in the shower. It is very well made.\nReview Title: WORKS GREAT\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has enjoyed several positive experiences with their purchases. They appreciate the effectiveness of various beauty tools and hair care products, highlighting qualities such as ease of use, pleasant scents, and effective performance. Many products contributed to achieving desired looks, from flawless makeup application to beautifully styled hair that holds all day without stiffness. The user has also noted improvements in hair health, with noticeable shine and softness after using conditioning products. Accessories like hair ties and clips received praise for their gentle grip and durability. The user values products that enhance their overall beauty routine, emphasizing satisfaction and transformative results.\n\nNEGATIVE SUMMARY:\nSome experiences were marked by less favorable outcomes, particularly with the lower-rated products that did not meet expectations. Issues such as stability or insufficient performance in holding styles or providing the desired effect were mentioned. The user expressed dissatisfaction with the effectiveness of certain products, indicating a desire for better results. While specific adverse details were not elaborated, the overall sentiment suggests that not every purchase aligned with the high satisfaction seen in other items, affecting the user's perception of those products.\n\nOVERALL SUMMARY:\nThe user's shopping experience reflects a strong preference for effective beauty and hair care solutions, with numerous products receiving high praise for performance and user satisfaction. Positive experiences showcase a trend toward discovering products that enhance hair and makeup routines effectively. Conversely, some products did not live up to expectations, revealing occasional discrepancies in quality. Overall, the user appears to have a mix of highly satisfactory and mediocre experiences, indicating a generally favorable outlook with some room for improvement in certain purchases.",
  "target_interaction": {
    "rating": 5.0,
    "title": "WORKS GREAT & EASY TO USE",
    "text": "[[VIDEOID:f989859dba437111dda043bac274e8c6]] This is really good for my hair because my hair tends to break easily. These are velvet covered and very soft. They are so easy to use. All you do is open up, put your hair in it and close it up. They are well made and great colors. On the inside are these teeth all the way around it that grab on to your hair really good.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/51-drbTjWPL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/51-drbTjWPL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/51-drbTjWPL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/51FPLqUGEWL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/51FPLqUGEWL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/51FPLqUGEWL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61u-CwGySoL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61u-CwGySoL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61u-CwGySoL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09NKFQL53",
    "parent_asin": "B09NKFQL53",
    "user_id": "AHISU6WTZZJNNVYK5A5UITDIWCNQ",
    "timestamp": "2022-04-04 21:55:39.768000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "All Beauty",
    "title_meta": "8PC Lazy Bird's Nest Plate Hairpin Velvet Bird Nest Shaped Hair Clips Expandable Ponytail Holder Hair Loops Nest Plate Hairpin Hair Claw Clip barrette",
    "average_rating": 4.0,
    "rating_number": 90,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51s82o1jlWL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51s82o1jlWL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81Btkv29a4L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51LaQhLb1qL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51LaQhLb1qL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71DYLF2LAmL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41SxhoSNycL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41SxhoSNycL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61LF6w4+IiL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51CdY+cSiGL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51CdY+cSiGL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/81wmCecE-bL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51s48LOCjiL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51s48LOCjiL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71BzLIAWc9L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51QVEi8l7TL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51QVEi8l7TL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81ziBchzWqL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "WORKS GREAT & EASY TO USE",
        "url": "https://www.amazon.com/vdp/0ed55dc4dcb64ff9a650d1ba3b4d4e9d?ref=dp_vse_rvc_0",
        "user_id": "AFCDGE7LYJ5MIPOJLQISCR22OBEA"
      },
      {
        "title": "8PC Lazy Bird's Nest Plate Hairpin Velvet Bird Nest ",
        "url": "https://www.amazon.com/vdp/072f18710e43428cb1d0ba342cbae6e0?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "Pretty",
        "url": "https://www.amazon.com/vdp/0bb14a89f10944f0a331442b510e249a?ref=dp_vse_rvc_2",
        "user_id": "AE5NUR5FBBMMKATW4UGGDTWGEGBQ"
      },
      {
        "title": "7PCS  Geometric Retractable Hair Loops Ponytail Holder ",
        "url": "https://www.amazon.com/vdp/314491a869954065a736c8b83b474df1?ref=dp_vse_rvc_3",
        "user_id": ""
      },
      {
        "title": "Bird Nest Magic Hair Clips #hair #hairstyle",
        "url": "https://www.amazon.com/vdp/0c85a62ef25d4fedac435088059b64f3?ref=dp_vse_rvc_4",
        "user_id": "/shop/phenomenalteacher"
      }
    ],
    "store": "AhkeaDirectly",
    "categories": [],
    "details": {
      "Brand": "AhkeaDirectly",
      "Hair Type": "All",
      "Age Range (Description)": "Adult",
      "Embellishment": "Resin",
      "Material": "Plastic",
      "Package Dimensions": "6.02 x 5.2 x 2.32 inches; 4.16 Ounces",
      "UPC": "761312153890"
    },
    "bought_together": null
  }
}