{
  "user_id": "AEXGISIVX7WBUNI7UHHERVB3DF7Q",
  "summary": "=== Purchase Information ===\nProduct Title: Eye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nReview Date: 2019/09/15\nStore: Mourvibe\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nReview Text: These are so nice and easy to apply. You instantly feel the moisture in your skin from the moment you put them on. After taking them off you notice that it really helps with the bags! My wife has used a few times and has already noticed a difference! They are even more refreshing when cold! Just keep them in your fridge!\nReview Title: Feels so refreshing!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Embryolisse Eau de Beaute Rosamelis Face Toner, 6.76 Fl Oz\nReview Date: 2019/10/24\nAverage Rating: 3.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.85 x 2.76 x 7.44 inches; 8.11 Ounces', 'Item model number': '501000', 'Manufacturer': 'Embryolisse'}\nReview Text: My wife loves this stuff! She has been using for a few days and loves the scent! Smells a mix of rose and orange.. beautiful and very uplifting. It makes her skin feel hydrated and more firm. Very nice product!\nReview Title: Beautifully scented and sprays on like a mist!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nReview Date: 2019/12/24\nStore: L&I Apothecary\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\nReview Text: My wife is very happy with this facial cleanser. It’s very moisturizing and makes her skin feel baby soft after using. It barely has a scent to it and it works great on her sensitive skin.\nReview Title: Makes your skin feel baby soft!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wow the Crowd Eyelash Growth Serum for Full, Luscious, Long and Thick Lashes - Natural Formula (7mL), Clinically and Dermatologist Tested - Boost and Enhance Eyelashes and Brows\nReview Date: 2020/01/17\nStore: K Kerotin\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '4.6 x 1.3 x 1.3 inches; 4.8 Ounces', 'UPC': '632726043414'}\nReview Text: My wife has been using this product for about a week and likes it. It’s very easy to apply, just like clear liquid eyeliner. It’s good that it does not irritate my wife’s sensitive skin at all. She has tried on her lashes and has noticed a slight difference in the thickness of them. I am sure that time will bring more dramatic results. The product is a bit pricey for the amount you get though.\nReview Title: Easy to apply, does not irritate.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2-Pack Puretize 16.9 Oz Hand Sanitizing Gel w/Pump Tops - Extra Strength 70% Ethyl Alcohol - Moisturizing Formula with Aloe Vera, Vitamin E & Botanical Extracts - Quick Drying Formula\nReview Date: 2020/06/11\nStore: Pure Daily Care\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Pure Daily Care', 'Unit Count': '33.8 Fl Oz', 'Number of Items': '2', 'Special Feature': 'Moisturizing', 'Scent': 'Unscented', 'Package Dimensions': '7 x 6.5 x 4.5 inches; 1.06 Pounds', 'UPC': '810016711360'}\nReview Text: This hand sanitizer by Puretize is great. During the time of the pandemic, this is a must! It contains 70% alcohol, which is great to kill those nasty germs 🦠! It smells similar to rubbing alcohol, however it’s not too strong. I love this hand sanitizer as it doesn’t dry out my hands like others. Every family needs a bottle of this in their home!\nReview Title: Sanitizes without drying out hands!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 21°C 4 Pieces Detangling Brush and Hair Comb Set Knots Detangler Easy to Clean for Kinky Wavy Curly Coily Wet Dry Oil Thick Long Natural Hair(Pink)\nReview Date: 2020/06/20\nStore: 21°C\nAverage Rating: 4.4\nProduct Details: {'Brand': '21°C', 'Special Feature': 'Detangling', 'Product Benefits': 'Detangle', 'Unit Count': '8.3 Ounce', 'Hair Type': 'All, Coarse, Wavy, Dry, Curly, Thick', 'Package Dimensions': '10.3 x 3.4 x 1.7 inches; 8.5 Ounces'}\nReview Text: This 4 piece hair set is great! My wife has wavy hair, as well as my daughter, and myself. My son has long, curly, coarse hair. This set works on all of our hair types! The largest hollowed our brush is great for blow drying. The smaller comb/brush is designed to remove tangles from curly hair, and it works well when using with detangling spray. There is a small attachment included, which hooks onto the back of the brush to keep the bristles together. You also get a wide tooth comb and a parting comb. Everything included in the set is lightweight and easy to hold. It’s a great set at an amazing price!\nReview Title: The perfect set for your hair!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shakira Perfumes - Dance for Women - Long Lasting - Femenine, Charming and Modern Perfume - Fruity Floral Notes - Ideal for Day Wear - 1.7 Fl Oz\nReview Date: 2020/07/30\nStore: Shakira\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Shakira', 'Item Form': 'Liquid', 'Item Volume': '50 Milliliters', 'Scent': 'Dance', 'Special Feature': 'Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Product Dimensions': '2.64 x 2.05 x 5.63 inches; 1.76 Ounces', 'Item model number': '8411061823033'}\nReview Text: My wife really likes this perfume by Shakira! It has a nice sweet scent, with a hint of spice. It’s an incredibly sexy scent that I love too! ❤️ It doesn’t last the whole day, however if you reapply in the afternoon, it does. The bottle is beautiful too! Just looks weird with my wife grabbing Shakira’s bod and spraying. 😂 We got a good laugh out of it!\nReview Title: Sweet with a little bit of spice!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Bombs, SAZEN Bath Bomb with Natural & Organic Essential Oils, Shea Coconut Butter for Skin Moisturize, Bubble Spa Bath, Birthday Mothers Day Christmas Handmade Gift Set for Women Kids Her Him\nReview Date: 2020/08/22\nStore: SAZEN\nAverage Rating: 4.4\nProduct Details: {'Brand': 'SAZEN', 'Scent': 'Coconut', 'Material Feature': 'Organic Ingredients', 'Unit Count': '24.00 Count', 'Number of Items': '24', 'Package Dimensions': '12.17 x 6.26 x 2.24 inches; 2.65 Pounds', 'Item model number': 'SAZEN 01', 'UPC': '745103723622', 'Manufacturer': 'SAZEN'}\nReview Text: These bath bombs are great, especially for the price. You get 18 bath bombs in the box. The box looks like a gift box, so these would make a great gift for someone special! ❤️<br /><br />The bath bombs are scented with essential oils and are very moisturizing. Each bath bomb is wrapped in tissue paper and labeled. The packaging is just amazing!<br /><br />The scents are strong, so these may not work for you if you are sensitive to strong scents. I personally think they smell wonderful!\nReview Title: Packaged so nicely and smell lovely!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 10 Pairs Reusable Magnetic Eyelashes and 2 Tubes of Magnetic Eyeliner Kit, Upgraded 3D 5D Natural Look Magnetic Fake Lashes and Liner Set - No Glue Need\nReview Date: 2020/09/30\nStore: STRONGLO\nAverage Rating: 3.9\nProduct Details: {'Brand': 'STRONGLO', 'Item Dimensions LxWxH': '8.11 x 5.94 x 0.87 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8.11 x 5.94 x 0.87 inches; 3.21 Ounces'}\nReview Text: My wife has always wanted to try magnetic eyelashes, so she decided to give these a shot. They really do work! But, with these practice makes perfect.<br /><br />They come with 2 tubes of magnetic eyeliner (black), and 10 sets of eyelashes along with the application tool. When you apply the magnetic eyeliner, you have to be precise. The eyeliner is black, and will look very dark if you do too thick of a line. I would do thinner lines if possible, with about 2 layers so that the eyeliner is not overwhelming. Once the eyeliner dries, use the application tool to put the lashes on.<br /><br />It does feel a bit strange at first (if false lashes are new to you), and it may tickle around your eyes when you blink. But yes, these really work! With more practice my wife will get better at this.<br /><br />The only thing is that the magnetic eyeliner does not come off easily. You will need a good eye makeup remover to get this off as it’s waterproof!\nReview Title: Practice makes perfect\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 26 Inches Long Hair\nReview Date: 2021/04/13\nStore: SENSAIRUITE\nAverage Rating: 3.8\nProduct Details: {'Brand': 'SENSAIRUITE', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '11.18 x 6.97 x 6.38 inches; 1.9 Pounds'}\nReview Text: This mannequin head is great for the price. It includes the clamp, and the hair is very thick. The hair is not real human hair, it’s synthetic... so it doesn’t curl very good like real human hair.<br /><br />It is great for trying out new hair styles though, even for practicing hair cutting. It comes with 2 clips and rubber bands as well.\nReview Title: It’s great for testing new hairstyles!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spanature Green Tea Hand & Body Lotion Travel Size Selection, 4 Pack, Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nReview Date: 2021/05/15\nStore: Spanature\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Spanature', 'Item Form': 'Lotion', 'Active Ingredients': 'Green tea', 'Unit Count': '1.00 Count', 'Number of Items': '4', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 2.1 x 1.9 inches; 8.8 Ounces'}\nReview Text: This 4 pack of travel lotions by Spanature is super nice, from the presentation of the product, to the performance of the product. They come packaged soooo nicely in 4 little gift boxes, so they are perfect for gift giving. Also, the tubes are the perfect size to fit in your purse- so they are great for on the go or even traveling!<br /><br />The lotion itself is very moisturizing, and not greasy at all. The green tea scent is not strong at all, which is perfect if you are sensitive to strong scents.\nReview Title: Very moisturizing, but not greasy!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Begins Big Hair Claw Clips Claw Hair Clips for Women Girls, Durable Plastic Metal Spring Non- Stick MaterialFemale hair accessories , Strong Hold Jumbo Hair Jaw Clips,12Colors Available (Pack of 12)\nReview Date: 2021/10/20\nStore: SIXNEA\nAverage Rating: 4.6\nProduct Details: {'Brand': 'SIXNEA', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal', 'Unit Count': '12.00 Count', 'Package Dimensions': '9.57 x 6.85 x 2.4 inches; 15.2 Ounces', 'UPC': '769256469343'}\nReview Text: These big hair claw clips are amazing! My wife has thick hair and other hair clips are just not large or strong enough to hold all of her hair. These however are large enough and strong enough to hold all of her hair back.<br /><br />You get a nice variety of 12 different colors and they come in a pretty purple box. They work great for clipping back all of the hair, or in small sections as well when straightening.\nReview Title: They are large and strong enough to hold long thick hair.\nRating: 5.0\n--------------------------------------------------",
  "reference": "Eye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nMourvibe\n{'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nThese are so nice and easy to apply. You instantly feel the moisture in your skin from the moment you put them on. After taking them off you notice that it really helps with the bags! My wife has used a few times and has already noticed a difference! They are even more refreshing when cold! Just keep them in your fridge!\nFeels so refreshing!\nEmbryolisse Eau de Beaute Rosamelis Face Toner, 6.76 Fl Oz\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.85 x 2.76 x 7.44 inches; 8.11 Ounces', 'Item model number': '501000', 'Manufacturer': 'Embryolisse'}\nMy wife loves this stuff! She has been using for a few days and loves the scent! Smells a mix of rose and orange.. beautiful and very uplifting. It makes her skin feel hydrated and more firm. Very nice product!\nBeautifully scented and sprays on like a mist!\n13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nL&I Apothecary\n{'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\nMy wife is very happy with this facial cleanser. It’s very moisturizing and makes her skin feel baby soft after using. It barely has a scent to it and it works great on her sensitive skin.\nMakes your skin feel baby soft!\nWow the Crowd Eyelash Growth Serum for Full, Luscious, Long and Thick Lashes - Natural Formula (7mL), Clinically and Dermatologist Tested - Boost and Enhance Eyelashes and Brows\nK Kerotin\n{'Package Dimensions': '4.6 x 1.3 x 1.3 inches; 4.8 Ounces', 'UPC': '632726043414'}\nMy wife has been using this product for about a week and likes it. It’s very easy to apply, just like clear liquid eyeliner. It’s good that it does not irritate my wife’s sensitive skin at all. She has tried on her lashes and has noticed a slight difference in the thickness of them. I am sure that time will bring more dramatic results. The product is a bit pricey for the amount you get though.\nEasy to apply, does not irritate.\n2-Pack Puretize 16.9 Oz Hand Sanitizing Gel w/Pump Tops - Extra Strength 70% Ethyl Alcohol - Moisturizing Formula with Aloe Vera, Vitamin E & Botanical Extracts - Quick Drying Formula\nPure Daily Care\n{'Brand': 'Pure Daily Care', 'Unit Count': '33.8 Fl Oz', 'Number of Items': '2', 'Special Feature': 'Moisturizing', 'Scent': 'Unscented', 'Package Dimensions': '7 x 6.5 x 4.5 inches; 1.06 Pounds', 'UPC': '810016711360'}\nThis hand sanitizer by Puretize is great. During the time of the pandemic, this is a must! It contains 70% alcohol, which is great to kill those nasty germs 🦠! It smells similar to rubbing alcohol, however it’s not too strong. I love this hand sanitizer as it doesn’t dry out my hands like others. Every family needs a bottle of this in their home!\nSanitizes without drying out hands!\n21°C 4 Pieces Detangling Brush and Hair Comb Set Knots Detangler Easy to Clean for Kinky Wavy Curly Coily Wet Dry Oil Thick Long Natural Hair(Pink)\n21°C\n{'Brand': '21°C', 'Special Feature': 'Detangling', 'Product Benefits': 'Detangle', 'Unit Count': '8.3 Ounce', 'Hair Type': 'All, Coarse, Wavy, Dry, Curly, Thick', 'Package Dimensions': '10.3 x 3.4 x 1.7 inches; 8.5 Ounces'}\nThis 4 piece hair set is great! My wife has wavy hair, as well as my daughter, and myself. My son has long, curly, coarse hair. This set works on all of our hair types! The largest hollowed our brush is great for blow drying. The smaller comb/brush is designed to remove tangles from curly hair, and it works well when using with detangling spray. There is a small attachment included, which hooks onto the back of the brush to keep the bristles together. You also get a wide tooth comb and a parting comb. Everything included in the set is lightweight and easy to hold. It’s a great set at an amazing price!\nThe perfect set for your hair!\nShakira Perfumes - Dance for Women - Long Lasting - Femenine, Charming and Modern Perfume - Fruity Floral Notes - Ideal for Day Wear - 1.7 Fl Oz\nShakira\n{'Brand': 'Shakira', 'Item Form': 'Liquid', 'Item Volume': '50 Milliliters', 'Scent': 'Dance', 'Special Feature': 'Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Product Dimensions': '2.64 x 2.05 x 5.63 inches; 1.76 Ounces', 'Item model number': '8411061823033'}\nMy wife really likes this perfume by Shakira! It has a nice sweet scent, with a hint of spice. It’s an incredibly sexy scent that I love too! ❤️ It doesn’t last the whole day, however if you reapply in the afternoon, it does. The bottle is beautiful too! Just looks weird with my wife grabbing Shakira’s bod and spraying. 😂 We got a good laugh out of it!\nSweet with a little bit of spice!\nBath Bombs, SAZEN Bath Bomb with Natural & Organic Essential Oils, Shea Coconut Butter for Skin Moisturize, Bubble Spa Bath, Birthday Mothers Day Christmas Handmade Gift Set for Women Kids Her Him\nSAZEN\n{'Brand': 'SAZEN', 'Scent': 'Coconut', 'Material Feature': 'Organic Ingredients', 'Unit Count': '24.00 Count', 'Number of Items': '24', 'Package Dimensions': '12.17 x 6.26 x 2.24 inches; 2.65 Pounds', 'Item model number': 'SAZEN 01', 'UPC': '745103723622', 'Manufacturer': 'SAZEN'}\nThese bath bombs are great, especially for the price. You get 18 bath bombs in the box. The box looks like a gift box, so these would make a great gift for someone special! ❤️<br /><br />The bath bombs are scented with essential oils and are very moisturizing. Each bath bomb is wrapped in tissue paper and labeled. The packaging is just amazing!<br /><br />The scents are strong, so these may not work for you if you are sensitive to strong scents. I personally think they smell wonderful!\nPackaged so nicely and smell lovely!\n10 Pairs Reusable Magnetic Eyelashes and 2 Tubes of Magnetic Eyeliner Kit, Upgraded 3D 5D Natural Look Magnetic Fake Lashes and Liner Set - No Glue Need\nSTRONGLO\n{'Brand': 'STRONGLO', 'Item Dimensions LxWxH': '8.11 x 5.94 x 0.87 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8.11 x 5.94 x 0.87 inches; 3.21 Ounces'}\nMy wife has always wanted to try magnetic eyelashes, so she decided to give these a shot. They really do work! But, with these practice makes perfect.<br /><br />They come with 2 tubes of magnetic eyeliner (black), and 10 sets of eyelashes along with the application tool. When you apply the magnetic eyeliner, you have to be precise. The eyeliner is black, and will look very dark if you do too thick of a line. I would do thinner lines if possible, with about 2 layers so that the eyeliner is not overwhelming. Once the eyeliner dries, use the application tool to put the lashes on.<br /><br />It does feel a bit strange at first (if false lashes are new to you), and it may tickle around your eyes when you blink. But yes, these really work! With more practice my wife will get better at this.<br /><br />The only thing is that the magnetic eyeliner does not come off easily. You will need a good eye makeup remover to get this off as it’s waterproof!\nPractice makes perfect\n26 Inches Long Hair\nSENSAIRUITE\n{'Brand': 'SENSAIRUITE', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '11.18 x 6.97 x 6.38 inches; 1.9 Pounds'}\nThis mannequin head is great for the price. It includes the clamp, and the hair is very thick. The hair is not real human hair, it’s synthetic... so it doesn’t curl very good like real human hair.<br /><br />It is great for trying out new hair styles though, even for practicing hair cutting. It comes with 2 clips and rubber bands as well.\nIt’s great for testing new hairstyles!\nSpanature Green Tea Hand & Body Lotion Travel Size Selection, 4 Pack, Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nSpanature\n{'Brand': 'Spanature', 'Item Form': 'Lotion', 'Active Ingredients': 'Green tea', 'Unit Count': '1.00 Count', 'Number of Items': '4', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 2.1 x 1.9 inches; 8.8 Ounces'}\nThis 4 pack of travel lotions by Spanature is super nice, from the presentation of the product, to the performance of the product. They come packaged soooo nicely in 4 little gift boxes, so they are perfect for gift giving. Also, the tubes are the perfect size to fit in your purse- so they are great for on the go or even traveling!<br /><br />The lotion itself is very moisturizing, and not greasy at all. The green tea scent is not strong at all, which is perfect if you are sensitive to strong scents.\nVery moisturizing, but not greasy!\nBegins Big Hair Claw Clips Claw Hair Clips for Women Girls, Durable Plastic Metal Spring Non- Stick MaterialFemale hair accessories , Strong Hold Jumbo Hair Jaw Clips,12Colors Available (Pack of 12)\nSIXNEA\n{'Brand': 'SIXNEA', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal', 'Unit Count': '12.00 Count', 'Package Dimensions': '9.57 x 6.85 x 2.4 inches; 15.2 Ounces', 'UPC': '769256469343'}\nThese big hair claw clips are amazing! My wife has thick hair and other hair clips are just not large or strong enough to hold all of her hair. These however are large enough and strong enough to hold all of her hair back.<br /><br />You get a nice variety of 12 different colors and they come in a pretty purple box. They work great for clipping back all of the hair, or in small sections as well when straightening.\nThey are large and strong enough to hold long thick hair.",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Eye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nReview Date: 2019/09/15\nStore: Mourvibe\nAverage Rating: 3.0\nProduct Details: {'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nReview Text: These are so nice and easy to apply. You instantly feel the moisture in your skin from the moment you put them on. After taking them off you notice that it really helps with the bags! My wife has used a few times and has already noticed a difference! They are even more refreshing when cold! Just keep them in your fridge!\nReview Title: Feels so refreshing!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Embryolisse Eau de Beaute Rosamelis Face Toner, 6.76 Fl Oz\nReview Date: 2019/10/24\nAverage Rating: 3.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.85 x 2.76 x 7.44 inches; 8.11 Ounces', 'Item model number': '501000', 'Manufacturer': 'Embryolisse'}\nReview Text: My wife loves this stuff! She has been using for a few days and loves the scent! Smells a mix of rose and orange.. beautiful and very uplifting. It makes her skin feel hydrated and more firm. Very nice product!\nReview Title: Beautifully scented and sprays on like a mist!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nReview Date: 2019/12/24\nStore: L&I Apothecary\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\nReview Text: My wife is very happy with this facial cleanser. It’s very moisturizing and makes her skin feel baby soft after using. It barely has a scent to it and it works great on her sensitive skin.\nReview Title: Makes your skin feel baby soft!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Wow the Crowd Eyelash Growth Serum for Full, Luscious, Long and Thick Lashes - Natural Formula (7mL), Clinically and Dermatologist Tested - Boost and Enhance Eyelashes and Brows\nReview Date: 2020/01/17\nStore: K Kerotin\nAverage Rating: 3.5\nProduct Details: {'Package Dimensions': '4.6 x 1.3 x 1.3 inches; 4.8 Ounces', 'UPC': '632726043414'}\nReview Text: My wife has been using this product for about a week and likes it. It’s very easy to apply, just like clear liquid eyeliner. It’s good that it does not irritate my wife’s sensitive skin at all. She has tried on her lashes and has noticed a slight difference in the thickness of them. I am sure that time will bring more dramatic results. The product is a bit pricey for the amount you get though.\nReview Title: Easy to apply, does not irritate.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2-Pack Puretize 16.9 Oz Hand Sanitizing Gel w/Pump Tops - Extra Strength 70% Ethyl Alcohol - Moisturizing Formula with Aloe Vera, Vitamin E & Botanical Extracts - Quick Drying Formula\nReview Date: 2020/06/11\nStore: Pure Daily Care\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Pure Daily Care', 'Unit Count': '33.8 Fl Oz', 'Number of Items': '2', 'Special Feature': 'Moisturizing', 'Scent': 'Unscented', 'Package Dimensions': '7 x 6.5 x 4.5 inches; 1.06 Pounds', 'UPC': '810016711360'}\nReview Text: This hand sanitizer by Puretize is great. During the time of the pandemic, this is a must! It contains 70% alcohol, which is great to kill those nasty germs 🦠! It smells similar to rubbing alcohol, however it’s not too strong. I love this hand sanitizer as it doesn’t dry out my hands like others. Every family needs a bottle of this in their home!\nReview Title: Sanitizes without drying out hands!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 21°C 4 Pieces Detangling Brush and Hair Comb Set Knots Detangler Easy to Clean for Kinky Wavy Curly Coily Wet Dry Oil Thick Long Natural Hair(Pink)\nReview Date: 2020/06/20\nStore: 21°C\nAverage Rating: 4.4\nProduct Details: {'Brand': '21°C', 'Special Feature': 'Detangling', 'Product Benefits': 'Detangle', 'Unit Count': '8.3 Ounce', 'Hair Type': 'All, Coarse, Wavy, Dry, Curly, Thick', 'Package Dimensions': '10.3 x 3.4 x 1.7 inches; 8.5 Ounces'}\nReview Text: This 4 piece hair set is great! My wife has wavy hair, as well as my daughter, and myself. My son has long, curly, coarse hair. This set works on all of our hair types! The largest hollowed our brush is great for blow drying. The smaller comb/brush is designed to remove tangles from curly hair, and it works well when using with detangling spray. There is a small attachment included, which hooks onto the back of the brush to keep the bristles together. You also get a wide tooth comb and a parting comb. Everything included in the set is lightweight and easy to hold. It’s a great set at an amazing price!\nReview Title: The perfect set for your hair!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Shakira Perfumes - Dance for Women - Long Lasting - Femenine, Charming and Modern Perfume - Fruity Floral Notes - Ideal for Day Wear - 1.7 Fl Oz\nReview Date: 2020/07/30\nStore: Shakira\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Shakira', 'Item Form': 'Liquid', 'Item Volume': '50 Milliliters', 'Scent': 'Dance', 'Special Feature': 'Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Product Dimensions': '2.64 x 2.05 x 5.63 inches; 1.76 Ounces', 'Item model number': '8411061823033'}\nReview Text: My wife really likes this perfume by Shakira! It has a nice sweet scent, with a hint of spice. It’s an incredibly sexy scent that I love too! ❤️ It doesn’t last the whole day, however if you reapply in the afternoon, it does. The bottle is beautiful too! Just looks weird with my wife grabbing Shakira’s bod and spraying. 😂 We got a good laugh out of it!\nReview Title: Sweet with a little bit of spice!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Bombs, SAZEN Bath Bomb with Natural & Organic Essential Oils, Shea Coconut Butter for Skin Moisturize, Bubble Spa Bath, Birthday Mothers Day Christmas Handmade Gift Set for Women Kids Her Him\nReview Date: 2020/08/22\nStore: SAZEN\nAverage Rating: 4.4\nProduct Details: {'Brand': 'SAZEN', 'Scent': 'Coconut', 'Material Feature': 'Organic Ingredients', 'Unit Count': '24.00 Count', 'Number of Items': '24', 'Package Dimensions': '12.17 x 6.26 x 2.24 inches; 2.65 Pounds', 'Item model number': 'SAZEN 01', 'UPC': '745103723622', 'Manufacturer': 'SAZEN'}\nReview Text: These bath bombs are great, especially for the price. You get 18 bath bombs in the box. The box looks like a gift box, so these would make a great gift for someone special! ❤️<br /><br />The bath bombs are scented with essential oils and are very moisturizing. Each bath bomb is wrapped in tissue paper and labeled. The packaging is just amazing!<br /><br />The scents are strong, so these may not work for you if you are sensitive to strong scents. I personally think they smell wonderful!\nReview Title: Packaged so nicely and smell lovely!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 10 Pairs Reusable Magnetic Eyelashes and 2 Tubes of Magnetic Eyeliner Kit, Upgraded 3D 5D Natural Look Magnetic Fake Lashes and Liner Set - No Glue Need\nReview Date: 2020/09/30\nStore: STRONGLO\nAverage Rating: 3.9\nProduct Details: {'Brand': 'STRONGLO', 'Item Dimensions LxWxH': '8.11 x 5.94 x 0.87 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8.11 x 5.94 x 0.87 inches; 3.21 Ounces'}\nReview Text: My wife has always wanted to try magnetic eyelashes, so she decided to give these a shot. They really do work! But, with these practice makes perfect.<br /><br />They come with 2 tubes of magnetic eyeliner (black), and 10 sets of eyelashes along with the application tool. When you apply the magnetic eyeliner, you have to be precise. The eyeliner is black, and will look very dark if you do too thick of a line. I would do thinner lines if possible, with about 2 layers so that the eyeliner is not overwhelming. Once the eyeliner dries, use the application tool to put the lashes on.<br /><br />It does feel a bit strange at first (if false lashes are new to you), and it may tickle around your eyes when you blink. But yes, these really work! With more practice my wife will get better at this.<br /><br />The only thing is that the magnetic eyeliner does not come off easily. You will need a good eye makeup remover to get this off as it’s waterproof!\nReview Title: Practice makes perfect\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 26 Inches Long Hair\nReview Date: 2021/04/13\nStore: SENSAIRUITE\nAverage Rating: 3.8\nProduct Details: {'Brand': 'SENSAIRUITE', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '11.18 x 6.97 x 6.38 inches; 1.9 Pounds'}\nReview Text: This mannequin head is great for the price. It includes the clamp, and the hair is very thick. The hair is not real human hair, it’s synthetic... so it doesn’t curl very good like real human hair.<br /><br />It is great for trying out new hair styles though, even for practicing hair cutting. It comes with 2 clips and rubber bands as well.\nReview Title: It’s great for testing new hairstyles!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spanature Green Tea Hand & Body Lotion Travel Size Selection, 4 Pack, Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nReview Date: 2021/05/15\nStore: Spanature\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Spanature', 'Item Form': 'Lotion', 'Active Ingredients': 'Green tea', 'Unit Count': '1.00 Count', 'Number of Items': '4', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 2.1 x 1.9 inches; 8.8 Ounces'}\nReview Text: This 4 pack of travel lotions by Spanature is super nice, from the presentation of the product, to the performance of the product. They come packaged soooo nicely in 4 little gift boxes, so they are perfect for gift giving. Also, the tubes are the perfect size to fit in your purse- so they are great for on the go or even traveling!<br /><br />The lotion itself is very moisturizing, and not greasy at all. The green tea scent is not strong at all, which is perfect if you are sensitive to strong scents.\nReview Title: Very moisturizing, but not greasy!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Begins Big Hair Claw Clips Claw Hair Clips for Women Girls, Durable Plastic Metal Spring Non- Stick MaterialFemale hair accessories , Strong Hold Jumbo Hair Jaw Clips,12Colors Available (Pack of 12)\nReview Date: 2021/10/20\nStore: SIXNEA\nAverage Rating: 4.6\nProduct Details: {'Brand': 'SIXNEA', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal', 'Unit Count': '12.00 Count', 'Package Dimensions': '9.57 x 6.85 x 2.4 inches; 15.2 Ounces', 'UPC': '769256469343'}\nReview Text: These big hair claw clips are amazing! My wife has thick hair and other hair clips are just not large or strong enough to hold all of her hair. These however are large enough and strong enough to hold all of her hair back.<br /><br />You get a nice variety of 12 different colors and they come in a pretty purple box. They work great for clipping back all of the hair, or in small sections as well when straightening.\nReview Title: They are large and strong enough to hold long thick hair.\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user's experience reflects a strong appreciation for various products that enhance beauty and personal care. They have particularly enjoyed items that are easy to apply and have noticeable effects, such as those for skincare and hair care. Products that provide instant refreshment or hydration have garnered specific praise, showcasing a preference for effective moisturization and soothing textures. The quality of packaging and scents has also contributed to positive experiences, as many products were noted for their delightful fragrances and appealing presentation. Strong functionality, especially in hair-related items, such as those that can handle thick hair, has driven satisfaction levels high, indicating effective performance across different needs.\n\nNEGATIVE SUMMARY:\nSome products received mixed reviews due to issues such as effectiveness, the need for precision during application, and price concerns. Users expressed dissatisfaction with the longevity of certain scents or effects, noting that some fragrances did not last throughout the day. Additional frustrations arose from certain products being difficult to remove or using sticky formulations. Furthermore, there were concerns about value for money, particularly with products deemed overpriced relative to their quantity or results. These challenges suggest a gap between expectations and actual performance for some items.\n\nOVERALL SUMMARY:\nThe user's overall shopping experience displayed a blend of positive and negative sentiments. On one hand, there’s clear enthusiasm for products that provide immediate, visible results and enjoyable application experiences. Many skincare and hair care items received high praise for their effectiveness, scent, and thoughtful packaging. However, paired with these positive experiences are instances of dissatisfaction, particularly concerning product longevity, efficacy, and value. The combination of these reviews showcases a nuanced shopping journey, highlighting a search for quality and performance while navigating occasional disappointments.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Smells amazing and hypoallergenic.",
    "text": "My daughter always wants to wear perfume, but her skin is so sensitive. When I saw this, I had to get it. It is hypoallergenic, so it even works well with sensitive skin. The smell is sweet lavender, and smells amazing! It is perfect to apply after bath time.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61lA69soGVL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61lA69soGVL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61lA69soGVL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09G3M314N",
    "parent_asin": "B09G3KBK7Y",
    "user_id": "AEXGISIVX7WBUNI7UHHERVB3DF7Q",
    "timestamp": "2022-02-22 14:07:21.735000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Boiess Colognes Poppy mint For Moms, Babies & Kids | Natural Eau de Cologne | Clean & Fresh Scent | Children Fragrance For Soft & Sensitive Skin | Easy Use, Gentle on Baby | Size: 8.5 FL Oz",
    "average_rating": 3.7,
    "rating_number": 14,
    "features": [
      "FRESH, GENTLE & COOL POPPYMINT - The Poppymint scented mom&me fragrance is a fresh scent with a gentle blend of flowers and citrus and a cool mint finish. Lively top notes of bergamot, tangerine, lavandin, petitgrain, and mint blend into a heart of sensory jasmine, muguet, and orange blossom, and are finally grounded by an earthy base of cedar, musk, and sweet orange blossom. Spray cologne daily as part of your family’s routine.",
      "UNISEX KIDS & BABY COLOGNES - Our Mom&Me fragrance sprays are unisex, hypoallergenic, dermatologically and pediatrically tested, manufactured in Europe under the highest quality controls. Each fragrance is inspired by Mediterranean scents that leaves everyone smelling great!.",
      "INFUSED WITH PREBIOTICS & VITAMIN B3 - Pamper yourself and your family with natural Mom&Me colognes! Each fragrance is carefully crafted and infused with prebiotic and vitamin B3 to enhance their properties and freshness, leaving a soft scent behind safe for even the most sensitive skins.",
      "NATURAL INGREDIENTS - Our formulas are clean and natural, IFRA Conformity standards certified for babies and free of toxic ingredients to ensure that these colognes are gentle enough to use on even the most sensitive skin. We want mothers and fathers to feel confident and comfortable using our products. That’s why all of our products are free of parabens, phthalates, synthetic colors or dyes, GMOs, and Gluten Free.",
      "SUSTAINABLE PACKAGING - Our plant-based, environmentally friendly, and cruelty-free products are gentle enough for the whole family and the environment. We’ve intentionally designed our bottles to be compact for unit efficiency and removed outer packaging to minimize the usage of plastics and reduce our carbon footprint. We will continue to make earth conscious decisions and seek sustainable solutions on our mission to provide better high-quality, natural colognes.",
      "HOW TO USE - For Infants, we suggest applying gently on clothes and other items, whilst avoiding areas near the eyes or mouth. For toddlers and kids, spray freely through the day and night to create a relaxed, soothing and fresh environment."
    ],
    "description": [],
    "price": 22.9,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41YBUO6LzCL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41YBUO6LzCL.jpg",
        "variant": "MAIN",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51PT81BsCfL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51PT81BsCfL.jpg",
        "variant": "PT01",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51FbGvvs21L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51FbGvvs21L.jpg",
        "variant": "PT02",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51MW0HrErgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51MW0HrErgL.jpg",
        "variant": "PT03",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51mfqVwKzQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51mfqVwKzQL.jpg",
        "variant": "PT04",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41-11NxjvAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41-11NxjvAL.jpg",
        "variant": "PT05",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51GAygZx+SL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GAygZx+SL.jpg",
        "variant": "PT06",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "BOIESS Colognes Poppy mint For Moms, Babies & Kids",
        "url": "https://www.amazon.com/vdp/0388a701b63f48cfaf01825fb3ff3331?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Boiess All day Allstars Vegan Eau de Cologne",
        "url": "https://www.amazon.com/vdp/06f12b9fcc4a472ba51d589d63bc31f5?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "BOIESS Colognes For Moms, Babies & Kids",
        "url": "https://www.amazon.com/vdp/062460685aac4715a8158b9cea64f891?ref=dp_vse_rvc_2",
        "user_id": ""
      }
    ],
    "store": "Boiess",
    "categories": [],
    "details": {
      "Brand": "Boiess",
      "Item Form": "Liquid",
      "Item Volume": "8 Fluid Ounces",
      "Scent": "Poppymint",
      "Special Feature": "Dermatoligist tested, Pediatrician tested, Clean, Natural, Cruelty Free, Plant based, Hypoallegenic",
      "Package Dimensions": "6.38 x 2.17 x 2.17 inches; 8.5 Ounces",
      "UPC": "860007057533",
      "Country of Origin": "Spain"
    },
    "bought_together": null
  }
}