{
  "user_id": "AGNUU44ETNXLBOUB53LJGFJP3SQA",
  "summary": "=== Purchase Information ===\nProduct Title: Sdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nReview Date: 2020/06/20\nStore: Sdara Skincare\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nReview Text: Well - Cold Pressed / Chemical free / Organic Aloe Vera sounded like a great product.<br />BUT after receiving it, and paying more attention to ingredients I'm sorry I requested it.<br /><br />PROS<br />> While the Organic Aloe Vera (Cold Pressed) is what I wanted<br />> And Citric Acid is OK ingredient for better absorption.<br /><br />CONS<br />> I'm at a loss why - Sodium Bicarbonate (baking Soda) is included<br />> Phenoxyethanol is a BIGGY to AVOID = being it scores as one of the TOP 8 HARMFUL<br />chemicals to avoid in skin care.<br />It can have harmful effects on the brain and nervous system.<br />> Xantham gum - another less than healthy product often included to prevent ingredients<br />from separating. BUT can cause flue like systems and lung problems.<br /><br />SDARA SKIN CARE could just as easily made a healthy product<br />BUT - with 3 of 5 points being negative<br />I feel this a 2 star product.\nReview Title: Some Issues\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Barber Hair Cutting Cape for Men Women, Made with Ultra Soft Silk Fiber, 63\" x 57\"\nReview Date: 2020/07/11\nStore: SmoTecQ\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '11.8 x 9.2 x 0.7 inches; 4.8 Ounces'}\nReview Text: It's nice size and good for our purpose, cutting hair.<br />And since it called a 'Barber's Cape' and thusly one would expect dry cutting<br />I'm not sure how relevant this is.<br /><br />HOWEVER - it's also stated it's resistant to chemicals.<br />But I don't see how it could be protective to ones clothing when it's not water proof,<br />liquid pours right through, so it's not good for various processes using chemicals etc.<br />And the reason for 3 stars<br /><br />The material around the neck is pleated / drawn together with elastic.<br />It's adjustable with metal hooks, but feels poky and uncomfortable.\nReview Title: Safe For Dry Cutting\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: zelaxy Mask Strap Extenders, Soft Silicone Mask Holders for Relieve Ear Pain Caused by Mask (Eagle)\nReview Date: 2020/07/21\nStore: zelaxy\nAverage Rating: 3.3\nProduct Details: {'Package Dimensions': '7.3 x 2.5 x 0.4 inches; 1.59 Ounces', 'Manufacturer': 'zelaxy'}\nReview Text: These hold well during use and don't pull too tight on the nose.<br />However, they are maxed out for me (last hook on each side) for comfort<br />and wouldn't want them any tighter. (my head - thick hair - 22\" around)<br /><br />Even when pulling mask down around the neck, IF careful, stays connected.<br />But if pulling down without care, of course the strap is disconnected.<br />The silicone seems durable enough and doesn't pull my hair.<br /><br />This isn't a perfect situation, but I've not come across one that is.<br />SOo = 4 stars\nReview Title: Are Reasonably Comfortable\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: lorelo 4 Pieces Nail Dotting Pen, Dual-ended Nail Dotting Pen Liner Brush Nail Art Point Drill Drawing Tools Set Nail Art DIY Decoration Tool\nReview Date: 2020/07/31\nStore: lorelo\nAverage Rating: 3.7\nProduct Details: {'Package Dimensions': '7.3 x 4.2 x 0.6 inches; 1.59 Ounces', 'UPC': '619156572950'}\nReview Text: These are good tools for nails, and any number of hobby's.<br />Excellent also for costume jewelry repair.<br /><br />The wax end nicely picks up rhinestones to lay in place.<br />It's fairly soft so you don't need to press.<br />In-fact will press them out of shape if you do.<br /><br />The stainless steel tip is the size of the head of a straight pin.<br />and hollow in the middle for better centering / pressing down.<br /><br />5 stars\nReview Title: Good quality / value\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 5pcs Nail Art Liner Brushes, Lystaii Dual-ended Painting Nail Design Brush Pen Include Liner Brushes and Dotting Pen Nail Art Point Drill Drawing Brush Double Ended Dotting Tools Set 5,7,9,11,14mm\nReview Date: 2020/07/31\nStore: Lystaii\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '9.41 x 3.86 x 0.75 inches; 1.41 Ounces'}\nReview Text: The brushes are 5 1/2\" long 1/4\" wide and easy hold for articulating designs.<br />The 5 different brushes allow for various strokes of width / depth.<br /><br />The metal ends each have a different ball size tip<br />Perfect selection for large variety of designs.<br /><br />Very attractive rhinestones centers of pens.<br />5 stars\nReview Title: Good quality set.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Facial Cleansing Brush, Sonic Ultrasonic Vibration Facial Brush, Red-light for Deep Cleaning, Discharge Makeup, Gentle Exfoliating, Blackhead Removing, Massaging with 3 Adjustable Modes and Speeds\nReview Date: 2020/08/19\nStore: LKV\nAverage Rating: 3.6\nProduct Details: {'Material': 'Silicone', 'Brand': 'LKV', 'Power Source': 'Battery Powered', 'Product Care Instructions': 'Wash with Warm Water', 'Number of Speeds': '3', 'Package Dimensions': '4.7 x 3.1 x 1.7 inches; 3.99 Ounces', 'UPC': '193499829655', 'Manufacturer': 'LKV'}\nReview Text: Although this isn't the most productive cleaning tool, I can see it of some purpose.<br />The vibration modes have some noticeable movement.<br />And if one wishes = this fits good in hand to move around the face for quite a good scrubbing.<br /><br />The teardrop design allows easier cleaning the edges of face to the hair line.<br />And with continual ultrasound movement = the scrubber leavers the face feeling cleansed & massaged.<br />Although honestly - a wash cloth would also work.<br /><br />Don't know that this would actually remove blackheads,<br />other than the fact that it's deep cleaning might clean facial pores.<br /><br />One hr charge = (I think) 12 hr run time.<br />(( which is confusing, \"it can be used about 12 hours, and operated about 300 times\" )))<br />Red light = charging<br />Blue light = done\nReview Title: Although honestly - a wash cloth would also work.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr. Denese SkinScience Essential Lipid Anti Aging Power Infusion Dry Oil - Skin Nutrients 97% Organic 100% Natural - Rejuvinating Blend with Amaranth & Resveratrol - Paraben-Free, Cruelty-Free - 2oz\nReview Date: 2020/08/22\nStore: Dr. Denese\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Dr. Denese', 'Item Form': 'Dr. Denese', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.57 x 3.15 x 3.07 inches; 5.61 Ounces', 'Item model number': '800166A', 'UPC': '811684022284', 'Manufacturer': 'Dr. Denese'}\nReview Text: It's easy to see why it is, and expect this liquid to be / feel oily.<br />Of the 20 ingredients = 7 are extracts while 13 are various healthy oils.<br /><br />Interestingly = though there's some flower extracts - the product doesn't<br />have any fragrance. This is a light oil that is supposed to soak in skin.<br />Not sure how many hours it may take.<br /><br />But it is as the product description / reviews say =<br />These are all top notch ingredients.<br />And to have 20 in one product, I feel explains the price.<br /><br />Just started using this, so can't speak to it's effeteness.<br />But with 20 high end ingredients, I'm expecting to notice good things.\nReview Title: With a belief in the ingredients\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Pillow for Bathtub, Spa Pillows for Neck Head Shoulders Back Support, Thick Bath Tub Cushion with 6 Suction Cups Men Women Breathable Comfort 4D Air Mesh Quick Dry Headrest Bath Accessories\nReview Date: 2020/08/29\nStore: Azun\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Azun', 'Material': 'Mesh', 'Item Dimensions LxWxH': '13 x 11 x 1 inches', 'Product Care Instructions': 'Hand Wash Only', 'Product Dimensions': '13 x 11 x 1 inches; 11.36 Ounces'}\nReview Text: The 2 upper suction cups ended up needing placed where the shower surround<br />fake grout is = so no suction on the wall to keep it in place.<br />But the 4 suction cups against the tub hold it fairly well in place.<br /><br />We've found the pillow to be comfortable and filled in the 2\" ledge of the tub<br />to the wall perfectly. It's a soft / comfy / convenient cushion.<br />From my 'big box store' shopping from back in the day seems a good value.\nReview Title: A nice bath pillow.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lnlofen Silicone Back Scrubber for Shower, Exfoliating Long Silicone Body Back Brush, Handle Scrubbing Pad, Easy to Clean, Lathers Well, Comfortable Massage for Shower(Green)\nReview Date: 2020/08/30\nStore: Lnlofen\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '9.37 x 7.44 x 1.93 inches; 7.05 Ounces', 'UPC': '768894803786'}\nReview Text: Outer side tip to tip of handles 29 1/2\" but inside is 26\" (actual scrubbing area 23\" L - 3\" W)<br />Of course silicone isn't as effective as several other materials which actually scrub.<br />But this pad does a surprisingly good job.<br />At least it does reach across my back, which many I've tried don't.<br /><br />Not quite sure how effective it's gonna be for exfoliating.<br />But that also has some bearing on each individual<br />and how long they've let the back soak to loosen / open pores.<br />And how much it lathers has a lot to do with what soap one uses.<br /><br />Includes a 2 1/4\" sq tacky hook for shower wall.<br />So far I'd give this 5 stars\nReview Title: Scrubs Pretty Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vitamin C & 100% Pure Tea Tree Oil, Invisible Acne Spot Treatment Serum Oil to Clear Face & Body, Minimize Pores - Great Makeup Primer - Beard-Friendly (0.5oz)\nReview Date: 2020/09/19\nStore: JOMO CARE\nAverage Rating: 4.1\nProduct Details: {'Skin Type': 'Sensitive Skin,All Skin Types', 'Use for': 'Face', 'Scent': 'Tea Tree', 'Brand': 'JOMO CARE', 'Item Form': 'Oil', 'Package Dimensions': '3.86 x 1.46 x 1.38 inches; 2.08 Ounces', 'UPC': '093674953956'}\nReview Text: Our daughter used this Vit C / Tea Tree oil for treating a cyst on her back,<br />trying to avoid the need for it surgically removed.<br />But it was already out of hand for home remedies and she ended up having the surgery<br /><br />HOWEVER = this was found to be helpful in treating until the surgery,<br />and aided in the cyst drainage til it was removed.<br /> 4 stars\nReview Title: Good Serum\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Revitalizing N.M.F Intensive Hydrating Serum that treats Dull, Tired, Dry and Sensitive Skin from Manilla Natural Skincare\nReview Date: 2020/10/21\nStore: Manilla Natural Skincare\nAverage Rating: 3.8\nProduct Details: {'Skin Type': 'mature', 'Product Benefits': 'Hydration', 'Brand': 'Manilla Natural Skincare', 'Material Feature': 'Natural', 'Recommended Uses For Product': 'Hydrating,Wrinkles', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches; 3.99 Ounces'}\nReview Text: The serum is rather like a Very thin gel with a lightly sweet, pleasant fragrance.<br />(reminds me of vanilla)<br />It's cloudy looking and doesn't feel oily / greasy, = soaks in very quickly,<br />actually during application.<br /><br />> Instructions - apply on clean face morning / evening. (no mention of how much)<br />> Massage in and wait for it to settle.<br />Since it's adsorbed while applying it can seem the skin is begging for more serum,<br />even on already covered areas. Therefore I likely used more than may have been needed.<br />Gotta be aware to not go quickly through the bottle.<br /><br />Skin looks more naturally alive, and feels soft and supple.<br />> However, this doesn't leave my skin feeling hydrated.<br /><br />> SO - the purpose of this serum is of course to encourage / support the skins<br />Natural Moisturizing Factor = (NMF)<br />which in turn maintains the skins elasticity and supports synthesis of collagen which tightens the skin.<br />(> Which - the tightening effect is mostly how skin feels)<br />>>> Note that over moisturizing skin can actually weaken the skin barrier function<br />of self moisturizing.<br /><br />This seem to be a good serum for problematic areas that more often get heavy wrinkles.<br />(forehead - nose - lips - eyes)<br /><br />Comes in an attractive / quality / thick brown glass bottle - gold cap w/white dropper.<br />(total 3 1/2\" tall - under 1 1/2\" sq)<br />Expiration date on what I received = July 1, 2022 (stamped inside top flap of box)<br />5 stars\nReview Title: THIS may work\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3D Mask Bracket for Kids，Internal Support Holder Frame Nose Breathing Smoothly - Protect Lipstick Lips - Cool Face Mask Inner Support Frame-5Pcs\nReview Date: 2020/12/19\nStore: Vedory\nProduct Description: ['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\nAverage Rating: 2.9\nProduct Details: {'Package Dimensions': '11.93 x 4.41 x 1.73 inches; 0.71 Ounces', 'UPC': '305393618956 305393618819 800914455060', 'Manufacturer': '01'}\nReview Text: Adding a bracket to any mask - kids or adults will likely cause more perspiration in the summer.<br />This is a pliable / thin silicone bracelet that can lay between a regular mask / face.<br />> You don't need to have a mask with an opening, this has a hook on each side<br />to hook over the fold of the mask.<br /><br />> While the hooks are nice for placement - I've not found any that stay in place<br />without them being taped in place.<br />> If you do have masks with opening - this bracelet fits inside with lots of extra room.<br /><br />> If the ear elastics have a tiny bit of give / or are a bit loose, this can make them perfect.<br />It's not intrusive<br /><br />> Can be cleaned and disinfected after use.<br />> Washable / reusable<br /><br />3 1/2\" wide - 3\" tall - 1 1/2\" deep<br /><br />CONS<br />1. IF a mask already fits snug = this may make it too snug.<br />2. If adding inside a mask, may let that inside flap - flap against the face more than usual<br />5 stars\nReview Title: Kids Bracket\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TINY BUDDHA Mindfulness Gift Set Includes Soothing Bath and Shower Gel, Relaxing Pillow Spray, Calming Essential Oil Roll-On, Lychee Flower Scented Candle and Daily Mindfulness Practice Guide\nReview Date: 2021/05/17\nStore: Tiny Buddha\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Tiny Buddha', 'Special Feature': 'Scented', 'Seasons': 'All Seasons', 'Item Volume': '1 Fluid Ounces', 'Unit Count': '12.00 Fl Oz', 'Package Dimensions': '8.35 x 8.07 x 2.52 inches; 1.45 Pounds', 'Manufacturer': 'KMI Brands'}\nReview Text: I like the idea and intention behind the Tiny Buddha set.<br />It's a quick, self help guide for breathing in peacefulness and daily intention.<br /><br />A reminder that one only really appropriates, when one pays attention to stay in the moment.<br />This mindfulness guidance helps stay grounded, and / or get grounded.<br />Gives tips how to pull yourself, before bedtime, to a better place from any part of a bad day.<br /><br />Includes<br />> Lychee flower candle. small - (2\" of wax - 1 3/4\" wide.) smells nice.<br />> Lavender essential oil - shower /  bath gel - 6.8oz<br />> Lavender pillow / room spray - 3.4oz<br />> Lavender / jojoba / almond oil - pulse point fragrance. - 0.3 oz<br /><br />More important than the liquid contents is the self care info.<br />Excellent guidance for anyone - very gift-able.\nReview Title: Peacefulness - AM - Noon - PM\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lemon Oil Towelettes - 20 Count\nReview Date: 2021/08/09\nStore: Herban Essentials\nProduct Description: [\"The Essential Oil Towelettes from Herban Essentials combines clean hands with soothing scents. Our travel hand wipes work to keep your hands clean and skin soft. They also work as face cleansing wipes, face cloths, body wipes for adults bathing, and body wipes for men when you are traveling and cannot stop to take a shower. If you need a midday refresher, use one of our citrus moisture towelettes for an energizing pick-me-up! Our collection includes lemon wipes, facial wipes cleansing cloths, a natural towelette, and men's wipes.\"]\nAverage Rating: 4.9\nProduct Details: {'Brand': 'Herban Essentials', 'Skin Type': 'All', 'Material Feature': 'Natural', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7 x 1 x 6 inches; 5.29 Ounces', 'Manufacturer': 'Herban Essentials', 'Country of Origin': 'USA'}\nReview Text: Update Aug 11, 2021 - After using several wipes I find it's not a fluke.<br />They leave my hands feeling tacky even after they're dry.<br />And sweaty hands revive the tackiness.<br />> This has caused me to remove a star.<br /><br />Original comments<br />These are a 5\" x 8 1/2\" deliciously fragrant towelette.<br />There generously moist and stay damp between 10 to 20 minutes.<br /><br />The packets open easily = 20 (2 1/2\" x 3 1/2\") packets in each bag.<br /><br />The fragrance fades away in approx 15 minutes.<br /><br />This is expensive for towelettes but this is higher quality without alcohol / chemical.<br />This fragrance from lemon essential oil is a natural way for cleaning without drying hands.<br />Perfect for well = everywhere.<br /><br />Ingredients - Water - Lemon essential oil - Lactobacillus ferment - Polysorbate 20.<br />> I received orange - lemon - peppermint - lavender. (&lt; listed in the order I like best)<br />All are good - it's a matter of preference - mines orange.\nReview Title: Smells like REAL fresh cut LEMONS\nRating: 4.0\n--------------------------------------------------",
  "reference": "Sdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nSdara Skincare\n{'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nWell - Cold Pressed / Chemical free / Organic Aloe Vera sounded like a great product.<br />BUT after receiving it, and paying more attention to ingredients I'm sorry I requested it.<br /><br />PROS<br />> While the Organic Aloe Vera (Cold Pressed) is what I wanted<br />> And Citric Acid is OK ingredient for better absorption.<br /><br />CONS<br />> I'm at a loss why - Sodium Bicarbonate (baking Soda) is included<br />> Phenoxyethanol is a BIGGY to AVOID = being it scores as one of the TOP 8 HARMFUL<br />chemicals to avoid in skin care.<br />It can have harmful effects on the brain and nervous system.<br />> Xantham gum - another less than healthy product often included to prevent ingredients<br />from separating. BUT can cause flue like systems and lung problems.<br /><br />SDARA SKIN CARE could just as easily made a healthy product<br />BUT - with 3 of 5 points being negative<br />I feel this a 2 star product.\nSome Issues\nBarber Hair Cutting Cape for Men Women, Made with Ultra Soft Silk Fiber, 63\" x 57\"\nSmoTecQ\n{'Package Dimensions': '11.8 x 9.2 x 0.7 inches; 4.8 Ounces'}\nIt's nice size and good for our purpose, cutting hair.<br />And since it called a 'Barber's Cape' and thusly one would expect dry cutting<br />I'm not sure how relevant this is.<br /><br />HOWEVER - it's also stated it's resistant to chemicals.<br />But I don't see how it could be protective to ones clothing when it's not water proof,<br />liquid pours right through, so it's not good for various processes using chemicals etc.<br />And the reason for 3 stars<br /><br />The material around the neck is pleated / drawn together with elastic.<br />It's adjustable with metal hooks, but feels poky and uncomfortable.\nSafe For Dry Cutting\nzelaxy Mask Strap Extenders, Soft Silicone Mask Holders for Relieve Ear Pain Caused by Mask (Eagle)\nzelaxy\n{'Package Dimensions': '7.3 x 2.5 x 0.4 inches; 1.59 Ounces', 'Manufacturer': 'zelaxy'}\nThese hold well during use and don't pull too tight on the nose.<br />However, they are maxed out for me (last hook on each side) for comfort<br />and wouldn't want them any tighter. (my head - thick hair - 22\" around)<br /><br />Even when pulling mask down around the neck, IF careful, stays connected.<br />But if pulling down without care, of course the strap is disconnected.<br />The silicone seems durable enough and doesn't pull my hair.<br /><br />This isn't a perfect situation, but I've not come across one that is.<br />SOo = 4 stars\nAre Reasonably Comfortable\nlorelo 4 Pieces Nail Dotting Pen, Dual-ended Nail Dotting Pen Liner Brush Nail Art Point Drill Drawing Tools Set Nail Art DIY Decoration Tool\nlorelo\n{'Package Dimensions': '7.3 x 4.2 x 0.6 inches; 1.59 Ounces', 'UPC': '619156572950'}\nThese are good tools for nails, and any number of hobby's.<br />Excellent also for costume jewelry repair.<br /><br />The wax end nicely picks up rhinestones to lay in place.<br />It's fairly soft so you don't need to press.<br />In-fact will press them out of shape if you do.<br /><br />The stainless steel tip is the size of the head of a straight pin.<br />and hollow in the middle for better centering / pressing down.<br /><br />5 stars\nGood quality / value\n5pcs Nail Art Liner Brushes, Lystaii Dual-ended Painting Nail Design Brush Pen Include Liner Brushes and Dotting Pen Nail Art Point Drill Drawing Brush Double Ended Dotting Tools Set 5,7,9,11,14mm\nLystaii\n{'Package Dimensions': '9.41 x 3.86 x 0.75 inches; 1.41 Ounces'}\nThe brushes are 5 1/2\" long 1/4\" wide and easy hold for articulating designs.<br />The 5 different brushes allow for various strokes of width / depth.<br /><br />The metal ends each have a different ball size tip<br />Perfect selection for large variety of designs.<br /><br />Very attractive rhinestones centers of pens.<br />5 stars\nGood quality set.\nFacial Cleansing Brush, Sonic Ultrasonic Vibration Facial Brush, Red-light for Deep Cleaning, Discharge Makeup, Gentle Exfoliating, Blackhead Removing, Massaging with 3 Adjustable Modes and Speeds\nLKV\n{'Material': 'Silicone', 'Brand': 'LKV', 'Power Source': 'Battery Powered', 'Product Care Instructions': 'Wash with Warm Water', 'Number of Speeds': '3', 'Package Dimensions': '4.7 x 3.1 x 1.7 inches; 3.99 Ounces', 'UPC': '193499829655', 'Manufacturer': 'LKV'}\nAlthough this isn't the most productive cleaning tool, I can see it of some purpose.<br />The vibration modes have some noticeable movement.<br />And if one wishes = this fits good in hand to move around the face for quite a good scrubbing.<br /><br />The teardrop design allows easier cleaning the edges of face to the hair line.<br />And with continual ultrasound movement = the scrubber leavers the face feeling cleansed & massaged.<br />Although honestly - a wash cloth would also work.<br /><br />Don't know that this would actually remove blackheads,<br />other than the fact that it's deep cleaning might clean facial pores.<br /><br />One hr charge = (I think) 12 hr run time.<br />(( which is confusing, \"it can be used about 12 hours, and operated about 300 times\" )))<br />Red light = charging<br />Blue light = done\nAlthough honestly - a wash cloth would also work.\nDr. Denese SkinScience Essential Lipid Anti Aging Power Infusion Dry Oil - Skin Nutrients 97% Organic 100% Natural - Rejuvinating Blend with Amaranth & Resveratrol - Paraben-Free, Cruelty-Free - 2oz\nDr. Denese\n{'Brand': 'Dr. Denese', 'Item Form': 'Dr. Denese', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.57 x 3.15 x 3.07 inches; 5.61 Ounces', 'Item model number': '800166A', 'UPC': '811684022284', 'Manufacturer': 'Dr. Denese'}\nIt's easy to see why it is, and expect this liquid to be / feel oily.<br />Of the 20 ingredients = 7 are extracts while 13 are various healthy oils.<br /><br />Interestingly = though there's some flower extracts - the product doesn't<br />have any fragrance. This is a light oil that is supposed to soak in skin.<br />Not sure how many hours it may take.<br /><br />But it is as the product description / reviews say =<br />These are all top notch ingredients.<br />And to have 20 in one product, I feel explains the price.<br /><br />Just started using this, so can't speak to it's effeteness.<br />But with 20 high end ingredients, I'm expecting to notice good things.\nWith a belief in the ingredients\nBath Pillow for Bathtub, Spa Pillows for Neck Head Shoulders Back Support, Thick Bath Tub Cushion with 6 Suction Cups Men Women Breathable Comfort 4D Air Mesh Quick Dry Headrest Bath Accessories\nAzun\n{'Brand': 'Azun', 'Material': 'Mesh', 'Item Dimensions LxWxH': '13 x 11 x 1 inches', 'Product Care Instructions': 'Hand Wash Only', 'Product Dimensions': '13 x 11 x 1 inches; 11.36 Ounces'}\nThe 2 upper suction cups ended up needing placed where the shower surround<br />fake grout is = so no suction on the wall to keep it in place.<br />But the 4 suction cups against the tub hold it fairly well in place.<br /><br />We've found the pillow to be comfortable and filled in the 2\" ledge of the tub<br />to the wall perfectly. It's a soft / comfy / convenient cushion.<br />From my 'big box store' shopping from back in the day seems a good value.\nA nice bath pillow.\nLnlofen Silicone Back Scrubber for Shower, Exfoliating Long Silicone Body Back Brush, Handle Scrubbing Pad, Easy to Clean, Lathers Well, Comfortable Massage for Shower(Green)\nLnlofen\n{'Package Dimensions': '9.37 x 7.44 x 1.93 inches; 7.05 Ounces', 'UPC': '768894803786'}\nOuter side tip to tip of handles 29 1/2\" but inside is 26\" (actual scrubbing area 23\" L - 3\" W)<br />Of course silicone isn't as effective as several other materials which actually scrub.<br />But this pad does a surprisingly good job.<br />At least it does reach across my back, which many I've tried don't.<br /><br />Not quite sure how effective it's gonna be for exfoliating.<br />But that also has some bearing on each individual<br />and how long they've let the back soak to loosen / open pores.<br />And how much it lathers has a lot to do with what soap one uses.<br /><br />Includes a 2 1/4\" sq tacky hook for shower wall.<br />So far I'd give this 5 stars\nScrubs Pretty Good\nVitamin C & 100% Pure Tea Tree Oil, Invisible Acne Spot Treatment Serum Oil to Clear Face & Body, Minimize Pores - Great Makeup Primer - Beard-Friendly (0.5oz)\nJOMO CARE\n{'Skin Type': 'Sensitive Skin,All Skin Types', 'Use for': 'Face', 'Scent': 'Tea Tree', 'Brand': 'JOMO CARE', 'Item Form': 'Oil', 'Package Dimensions': '3.86 x 1.46 x 1.38 inches; 2.08 Ounces', 'UPC': '093674953956'}\nOur daughter used this Vit C / Tea Tree oil for treating a cyst on her back,<br />trying to avoid the need for it surgically removed.<br />But it was already out of hand for home remedies and she ended up having the surgery<br /><br />HOWEVER = this was found to be helpful in treating until the surgery,<br />and aided in the cyst drainage til it was removed.<br /> 4 stars\nGood Serum\nRevitalizing N.M.F Intensive Hydrating Serum that treats Dull, Tired, Dry and Sensitive Skin from Manilla Natural Skincare\nManilla Natural Skincare\n{'Skin Type': 'mature', 'Product Benefits': 'Hydration', 'Brand': 'Manilla Natural Skincare', 'Material Feature': 'Natural', 'Recommended Uses For Product': 'Hydrating,Wrinkles', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches; 3.99 Ounces'}\nThe serum is rather like a Very thin gel with a lightly sweet, pleasant fragrance.<br />(reminds me of vanilla)<br />It's cloudy looking and doesn't feel oily / greasy, = soaks in very quickly,<br />actually during application.<br /><br />> Instructions - apply on clean face morning / evening. (no mention of how much)<br />> Massage in and wait for it to settle.<br />Since it's adsorbed while applying it can seem the skin is begging for more serum,<br />even on already covered areas. Therefore I likely used more than may have been needed.<br />Gotta be aware to not go quickly through the bottle.<br /><br />Skin looks more naturally alive, and feels soft and supple.<br />> However, this doesn't leave my skin feeling hydrated.<br /><br />> SO - the purpose of this serum is of course to encourage / support the skins<br />Natural Moisturizing Factor = (NMF)<br />which in turn maintains the skins elasticity and supports synthesis of collagen which tightens the skin.<br />(> Which - the tightening effect is mostly how skin feels)<br />>>> Note that over moisturizing skin can actually weaken the skin barrier function<br />of self moisturizing.<br /><br />This seem to be a good serum for problematic areas that more often get heavy wrinkles.<br />(forehead - nose - lips - eyes)<br /><br />Comes in an attractive / quality / thick brown glass bottle - gold cap w/white dropper.<br />(total 3 1/2\" tall - under 1 1/2\" sq)<br />Expiration date on what I received = July 1, 2022 (stamped inside top flap of box)<br />5 stars\nTHIS may work\n3D Mask Bracket for Kids，Internal Support Holder Frame Nose Breathing Smoothly - Protect Lipstick Lips - Cool Face Mask Inner Support Frame-5Pcs\nVedory\n['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\n{'Package Dimensions': '11.93 x 4.41 x 1.73 inches; 0.71 Ounces', 'UPC': '305393618956 305393618819 800914455060', 'Manufacturer': '01'}\nAdding a bracket to any mask - kids or adults will likely cause more perspiration in the summer.<br />This is a pliable / thin silicone bracelet that can lay between a regular mask / face.<br />> You don't need to have a mask with an opening, this has a hook on each side<br />to hook over the fold of the mask.<br /><br />> While the hooks are nice for placement - I've not found any that stay in place<br />without them being taped in place.<br />> If you do have masks with opening - this bracelet fits inside with lots of extra room.<br /><br />> If the ear elastics have a tiny bit of give / or are a bit loose, this can make them perfect.<br />It's not intrusive<br /><br />> Can be cleaned and disinfected after use.<br />> Washable / reusable<br /><br />3 1/2\" wide - 3\" tall - 1 1/2\" deep<br /><br />CONS<br />1. IF a mask already fits snug = this may make it too snug.<br />2. If adding inside a mask, may let that inside flap - flap against the face more than usual<br />5 stars\nKids Bracket\nTINY BUDDHA Mindfulness Gift Set Includes Soothing Bath and Shower Gel, Relaxing Pillow Spray, Calming Essential Oil Roll-On, Lychee Flower Scented Candle and Daily Mindfulness Practice Guide\nTiny Buddha\n{'Brand': 'Tiny Buddha', 'Special Feature': 'Scented', 'Seasons': 'All Seasons', 'Item Volume': '1 Fluid Ounces', 'Unit Count': '12.00 Fl Oz', 'Package Dimensions': '8.35 x 8.07 x 2.52 inches; 1.45 Pounds', 'Manufacturer': 'KMI Brands'}\nI like the idea and intention behind the Tiny Buddha set.<br />It's a quick, self help guide for breathing in peacefulness and daily intention.<br /><br />A reminder that one only really appropriates, when one pays attention to stay in the moment.<br />This mindfulness guidance helps stay grounded, and / or get grounded.<br />Gives tips how to pull yourself, before bedtime, to a better place from any part of a bad day.<br /><br />Includes<br />> Lychee flower candle. small - (2\" of wax - 1 3/4\" wide.) smells nice.<br />> Lavender essential oil - shower /  bath gel - 6.8oz<br />> Lavender pillow / room spray - 3.4oz<br />> Lavender / jojoba / almond oil - pulse point fragrance. - 0.3 oz<br /><br />More important than the liquid contents is the self care info.<br />Excellent guidance for anyone - very gift-able.\nPeacefulness - AM - Noon - PM\nLemon Oil Towelettes - 20 Count\nHerban Essentials\n[\"The Essential Oil Towelettes from Herban Essentials combines clean hands with soothing scents. Our travel hand wipes work to keep your hands clean and skin soft. They also work as face cleansing wipes, face cloths, body wipes for adults bathing, and body wipes for men when you are traveling and cannot stop to take a shower. If you need a midday refresher, use one of our citrus moisture towelettes for an energizing pick-me-up! Our collection includes lemon wipes, facial wipes cleansing cloths, a natural towelette, and men's wipes.\"]\n{'Brand': 'Herban Essentials', 'Skin Type': 'All', 'Material Feature': 'Natural', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7 x 1 x 6 inches; 5.29 Ounces', 'Manufacturer': 'Herban Essentials', 'Country of Origin': 'USA'}\nUpdate Aug 11, 2021 - After using several wipes I find it's not a fluke.<br />They leave my hands feeling tacky even after they're dry.<br />And sweaty hands revive the tackiness.<br />> This has caused me to remove a star.<br /><br />Original comments<br />These are a 5\" x 8 1/2\" deliciously fragrant towelette.<br />There generously moist and stay damp between 10 to 20 minutes.<br /><br />The packets open easily = 20 (2 1/2\" x 3 1/2\") packets in each bag.<br /><br />The fragrance fades away in approx 15 minutes.<br /><br />This is expensive for towelettes but this is higher quality without alcohol / chemical.<br />This fragrance from lemon essential oil is a natural way for cleaning without drying hands.<br />Perfect for well = everywhere.<br /><br />Ingredients - Water - Lemon essential oil - Lactobacillus ferment - Polysorbate 20.<br />> I received orange - lemon - peppermint - lavender. (&lt; listed in the order I like best)<br />All are good - it's a matter of preference - mines orange.\nSmells like REAL fresh cut LEMONS",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Sdara Aloe Vera Gel For Face and Body - Organic & Natural, Soothing & Cooling For Sunburn Relief, Restorative For Dry Skin - Made In USA\nReview Date: 2020/06/20\nStore: Sdara Skincare\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Sdara Skincare', 'Scent': 'Aloe Vera', 'Item Form': 'Gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Package Dimensions': '4.9 x 2.3 x 1.3 inches; 9.59 Ounces', 'UPC': '707486993085'}\nReview Text: Well - Cold Pressed / Chemical free / Organic Aloe Vera sounded like a great product.<br />BUT after receiving it, and paying more attention to ingredients I'm sorry I requested it.<br /><br />PROS<br />> While the Organic Aloe Vera (Cold Pressed) is what I wanted<br />> And Citric Acid is OK ingredient for better absorption.<br /><br />CONS<br />> I'm at a loss why - Sodium Bicarbonate (baking Soda) is included<br />> Phenoxyethanol is a BIGGY to AVOID = being it scores as one of the TOP 8 HARMFUL<br />chemicals to avoid in skin care.<br />It can have harmful effects on the brain and nervous system.<br />> Xantham gum - another less than healthy product often included to prevent ingredients<br />from separating. BUT can cause flue like systems and lung problems.<br /><br />SDARA SKIN CARE could just as easily made a healthy product<br />BUT - with 3 of 5 points being negative<br />I feel this a 2 star product.\nReview Title: Some Issues\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Barber Hair Cutting Cape for Men Women, Made with Ultra Soft Silk Fiber, 63\" x 57\"\nReview Date: 2020/07/11\nStore: SmoTecQ\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '11.8 x 9.2 x 0.7 inches; 4.8 Ounces'}\nReview Text: It's nice size and good for our purpose, cutting hair.<br />And since it called a 'Barber's Cape' and thusly one would expect dry cutting<br />I'm not sure how relevant this is.<br /><br />HOWEVER - it's also stated it's resistant to chemicals.<br />But I don't see how it could be protective to ones clothing when it's not water proof,<br />liquid pours right through, so it's not good for various processes using chemicals etc.<br />And the reason for 3 stars<br /><br />The material around the neck is pleated / drawn together with elastic.<br />It's adjustable with metal hooks, but feels poky and uncomfortable.\nReview Title: Safe For Dry Cutting\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: zelaxy Mask Strap Extenders, Soft Silicone Mask Holders for Relieve Ear Pain Caused by Mask (Eagle)\nReview Date: 2020/07/21\nStore: zelaxy\nAverage Rating: 3.3\nProduct Details: {'Package Dimensions': '7.3 x 2.5 x 0.4 inches; 1.59 Ounces', 'Manufacturer': 'zelaxy'}\nReview Text: These hold well during use and don't pull too tight on the nose.<br />However, they are maxed out for me (last hook on each side) for comfort<br />and wouldn't want them any tighter. (my head - thick hair - 22\" around)<br /><br />Even when pulling mask down around the neck, IF careful, stays connected.<br />But if pulling down without care, of course the strap is disconnected.<br />The silicone seems durable enough and doesn't pull my hair.<br /><br />This isn't a perfect situation, but I've not come across one that is.<br />SOo = 4 stars\nReview Title: Are Reasonably Comfortable\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: lorelo 4 Pieces Nail Dotting Pen, Dual-ended Nail Dotting Pen Liner Brush Nail Art Point Drill Drawing Tools Set Nail Art DIY Decoration Tool\nReview Date: 2020/07/31\nStore: lorelo\nAverage Rating: 3.7\nProduct Details: {'Package Dimensions': '7.3 x 4.2 x 0.6 inches; 1.59 Ounces', 'UPC': '619156572950'}\nReview Text: These are good tools for nails, and any number of hobby's.<br />Excellent also for costume jewelry repair.<br /><br />The wax end nicely picks up rhinestones to lay in place.<br />It's fairly soft so you don't need to press.<br />In-fact will press them out of shape if you do.<br /><br />The stainless steel tip is the size of the head of a straight pin.<br />and hollow in the middle for better centering / pressing down.<br /><br />5 stars\nReview Title: Good quality / value\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 5pcs Nail Art Liner Brushes, Lystaii Dual-ended Painting Nail Design Brush Pen Include Liner Brushes and Dotting Pen Nail Art Point Drill Drawing Brush Double Ended Dotting Tools Set 5,7,9,11,14mm\nReview Date: 2020/07/31\nStore: Lystaii\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '9.41 x 3.86 x 0.75 inches; 1.41 Ounces'}\nReview Text: The brushes are 5 1/2\" long 1/4\" wide and easy hold for articulating designs.<br />The 5 different brushes allow for various strokes of width / depth.<br /><br />The metal ends each have a different ball size tip<br />Perfect selection for large variety of designs.<br /><br />Very attractive rhinestones centers of pens.<br />5 stars\nReview Title: Good quality set.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Facial Cleansing Brush, Sonic Ultrasonic Vibration Facial Brush, Red-light for Deep Cleaning, Discharge Makeup, Gentle Exfoliating, Blackhead Removing, Massaging with 3 Adjustable Modes and Speeds\nReview Date: 2020/08/19\nStore: LKV\nAverage Rating: 3.6\nProduct Details: {'Material': 'Silicone', 'Brand': 'LKV', 'Power Source': 'Battery Powered', 'Product Care Instructions': 'Wash with Warm Water', 'Number of Speeds': '3', 'Package Dimensions': '4.7 x 3.1 x 1.7 inches; 3.99 Ounces', 'UPC': '193499829655', 'Manufacturer': 'LKV'}\nReview Text: Although this isn't the most productive cleaning tool, I can see it of some purpose.<br />The vibration modes have some noticeable movement.<br />And if one wishes = this fits good in hand to move around the face for quite a good scrubbing.<br /><br />The teardrop design allows easier cleaning the edges of face to the hair line.<br />And with continual ultrasound movement = the scrubber leavers the face feeling cleansed & massaged.<br />Although honestly - a wash cloth would also work.<br /><br />Don't know that this would actually remove blackheads,<br />other than the fact that it's deep cleaning might clean facial pores.<br /><br />One hr charge = (I think) 12 hr run time.<br />(( which is confusing, \"it can be used about 12 hours, and operated about 300 times\" )))<br />Red light = charging<br />Blue light = done\nReview Title: Although honestly - a wash cloth would also work.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dr. Denese SkinScience Essential Lipid Anti Aging Power Infusion Dry Oil - Skin Nutrients 97% Organic 100% Natural - Rejuvinating Blend with Amaranth & Resveratrol - Paraben-Free, Cruelty-Free - 2oz\nReview Date: 2020/08/22\nStore: Dr. Denese\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Dr. Denese', 'Item Form': 'Dr. Denese', 'Unit Count': '2.00 Fl Oz', 'Number of Items': '1', 'Skin Type': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.57 x 3.15 x 3.07 inches; 5.61 Ounces', 'Item model number': '800166A', 'UPC': '811684022284', 'Manufacturer': 'Dr. Denese'}\nReview Text: It's easy to see why it is, and expect this liquid to be / feel oily.<br />Of the 20 ingredients = 7 are extracts while 13 are various healthy oils.<br /><br />Interestingly = though there's some flower extracts - the product doesn't<br />have any fragrance. This is a light oil that is supposed to soak in skin.<br />Not sure how many hours it may take.<br /><br />But it is as the product description / reviews say =<br />These are all top notch ingredients.<br />And to have 20 in one product, I feel explains the price.<br /><br />Just started using this, so can't speak to it's effeteness.<br />But with 20 high end ingredients, I'm expecting to notice good things.\nReview Title: With a belief in the ingredients\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Pillow for Bathtub, Spa Pillows for Neck Head Shoulders Back Support, Thick Bath Tub Cushion with 6 Suction Cups Men Women Breathable Comfort 4D Air Mesh Quick Dry Headrest Bath Accessories\nReview Date: 2020/08/29\nStore: Azun\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Azun', 'Material': 'Mesh', 'Item Dimensions LxWxH': '13 x 11 x 1 inches', 'Product Care Instructions': 'Hand Wash Only', 'Product Dimensions': '13 x 11 x 1 inches; 11.36 Ounces'}\nReview Text: The 2 upper suction cups ended up needing placed where the shower surround<br />fake grout is = so no suction on the wall to keep it in place.<br />But the 4 suction cups against the tub hold it fairly well in place.<br /><br />We've found the pillow to be comfortable and filled in the 2\" ledge of the tub<br />to the wall perfectly. It's a soft / comfy / convenient cushion.<br />From my 'big box store' shopping from back in the day seems a good value.\nReview Title: A nice bath pillow.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lnlofen Silicone Back Scrubber for Shower, Exfoliating Long Silicone Body Back Brush, Handle Scrubbing Pad, Easy to Clean, Lathers Well, Comfortable Massage for Shower(Green)\nReview Date: 2020/08/30\nStore: Lnlofen\nAverage Rating: 4.0\nProduct Details: {'Package Dimensions': '9.37 x 7.44 x 1.93 inches; 7.05 Ounces', 'UPC': '768894803786'}\nReview Text: Outer side tip to tip of handles 29 1/2\" but inside is 26\" (actual scrubbing area 23\" L - 3\" W)<br />Of course silicone isn't as effective as several other materials which actually scrub.<br />But this pad does a surprisingly good job.<br />At least it does reach across my back, which many I've tried don't.<br /><br />Not quite sure how effective it's gonna be for exfoliating.<br />But that also has some bearing on each individual<br />and how long they've let the back soak to loosen / open pores.<br />And how much it lathers has a lot to do with what soap one uses.<br /><br />Includes a 2 1/4\" sq tacky hook for shower wall.<br />So far I'd give this 5 stars\nReview Title: Scrubs Pretty Good\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Vitamin C & 100% Pure Tea Tree Oil, Invisible Acne Spot Treatment Serum Oil to Clear Face & Body, Minimize Pores - Great Makeup Primer - Beard-Friendly (0.5oz)\nReview Date: 2020/09/19\nStore: JOMO CARE\nAverage Rating: 4.1\nProduct Details: {'Skin Type': 'Sensitive Skin,All Skin Types', 'Use for': 'Face', 'Scent': 'Tea Tree', 'Brand': 'JOMO CARE', 'Item Form': 'Oil', 'Package Dimensions': '3.86 x 1.46 x 1.38 inches; 2.08 Ounces', 'UPC': '093674953956'}\nReview Text: Our daughter used this Vit C / Tea Tree oil for treating a cyst on her back,<br />trying to avoid the need for it surgically removed.<br />But it was already out of hand for home remedies and she ended up having the surgery<br /><br />HOWEVER = this was found to be helpful in treating until the surgery,<br />and aided in the cyst drainage til it was removed.<br /> 4 stars\nReview Title: Good Serum\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Revitalizing N.M.F Intensive Hydrating Serum that treats Dull, Tired, Dry and Sensitive Skin from Manilla Natural Skincare\nReview Date: 2020/10/21\nStore: Manilla Natural Skincare\nAverage Rating: 3.8\nProduct Details: {'Skin Type': 'mature', 'Product Benefits': 'Hydration', 'Brand': 'Manilla Natural Skincare', 'Material Feature': 'Natural', 'Recommended Uses For Product': 'Hydrating,Wrinkles', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches; 3.99 Ounces'}\nReview Text: The serum is rather like a Very thin gel with a lightly sweet, pleasant fragrance.<br />(reminds me of vanilla)<br />It's cloudy looking and doesn't feel oily / greasy, = soaks in very quickly,<br />actually during application.<br /><br />> Instructions - apply on clean face morning / evening. (no mention of how much)<br />> Massage in and wait for it to settle.<br />Since it's adsorbed while applying it can seem the skin is begging for more serum,<br />even on already covered areas. Therefore I likely used more than may have been needed.<br />Gotta be aware to not go quickly through the bottle.<br /><br />Skin looks more naturally alive, and feels soft and supple.<br />> However, this doesn't leave my skin feeling hydrated.<br /><br />> SO - the purpose of this serum is of course to encourage / support the skins<br />Natural Moisturizing Factor = (NMF)<br />which in turn maintains the skins elasticity and supports synthesis of collagen which tightens the skin.<br />(> Which - the tightening effect is mostly how skin feels)<br />>>> Note that over moisturizing skin can actually weaken the skin barrier function<br />of self moisturizing.<br /><br />This seem to be a good serum for problematic areas that more often get heavy wrinkles.<br />(forehead - nose - lips - eyes)<br /><br />Comes in an attractive / quality / thick brown glass bottle - gold cap w/white dropper.<br />(total 3 1/2\" tall - under 1 1/2\" sq)<br />Expiration date on what I received = July 1, 2022 (stamped inside top flap of box)<br />5 stars\nReview Title: THIS may work\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3D Mask Bracket for Kids，Internal Support Holder Frame Nose Breathing Smoothly - Protect Lipstick Lips - Cool Face Mask Inner Support Frame-5Pcs\nReview Date: 2020/12/19\nStore: Vedory\nProduct Description: ['❤-Outfits Set Include: 1 pack of 5 3D mask bracket (not including mask or cloth, etc.). ❤-Size: about 10*9*4.2cm / 3.9*3.51*1.64 inches, enough space for various masks. ❤-Unique design: designed to fit the face of the nose bridge, breathing more smoothly, breathable and not stuffy. ❤-Ideal Saver for Makeup - It makes the mask not to stick lipstick, protecting your perfect makeup from being messed up.If you wear glasses, 3D Inner Bracket can also prevent the lens from fogging because of more breathing space. ❤ 3D Inner Bracket also suitable for various ma-sks.Using double sided tape or thread to fasten the silicone frame onto the mask can make it work better.']\nAverage Rating: 2.9\nProduct Details: {'Package Dimensions': '11.93 x 4.41 x 1.73 inches; 0.71 Ounces', 'UPC': '305393618956 305393618819 800914455060', 'Manufacturer': '01'}\nReview Text: Adding a bracket to any mask - kids or adults will likely cause more perspiration in the summer.<br />This is a pliable / thin silicone bracelet that can lay between a regular mask / face.<br />> You don't need to have a mask with an opening, this has a hook on each side<br />to hook over the fold of the mask.<br /><br />> While the hooks are nice for placement - I've not found any that stay in place<br />without them being taped in place.<br />> If you do have masks with opening - this bracelet fits inside with lots of extra room.<br /><br />> If the ear elastics have a tiny bit of give / or are a bit loose, this can make them perfect.<br />It's not intrusive<br /><br />> Can be cleaned and disinfected after use.<br />> Washable / reusable<br /><br />3 1/2\" wide - 3\" tall - 1 1/2\" deep<br /><br />CONS<br />1. IF a mask already fits snug = this may make it too snug.<br />2. If adding inside a mask, may let that inside flap - flap against the face more than usual<br />5 stars\nReview Title: Kids Bracket\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: TINY BUDDHA Mindfulness Gift Set Includes Soothing Bath and Shower Gel, Relaxing Pillow Spray, Calming Essential Oil Roll-On, Lychee Flower Scented Candle and Daily Mindfulness Practice Guide\nReview Date: 2021/05/17\nStore: Tiny Buddha\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Tiny Buddha', 'Special Feature': 'Scented', 'Seasons': 'All Seasons', 'Item Volume': '1 Fluid Ounces', 'Unit Count': '12.00 Fl Oz', 'Package Dimensions': '8.35 x 8.07 x 2.52 inches; 1.45 Pounds', 'Manufacturer': 'KMI Brands'}\nReview Text: I like the idea and intention behind the Tiny Buddha set.<br />It's a quick, self help guide for breathing in peacefulness and daily intention.<br /><br />A reminder that one only really appropriates, when one pays attention to stay in the moment.<br />This mindfulness guidance helps stay grounded, and / or get grounded.<br />Gives tips how to pull yourself, before bedtime, to a better place from any part of a bad day.<br /><br />Includes<br />> Lychee flower candle. small - (2\" of wax - 1 3/4\" wide.) smells nice.<br />> Lavender essential oil - shower /  bath gel - 6.8oz<br />> Lavender pillow / room spray - 3.4oz<br />> Lavender / jojoba / almond oil - pulse point fragrance. - 0.3 oz<br /><br />More important than the liquid contents is the self care info.<br />Excellent guidance for anyone - very gift-able.\nReview Title: Peacefulness - AM - Noon - PM\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lemon Oil Towelettes - 20 Count\nReview Date: 2021/08/09\nStore: Herban Essentials\nProduct Description: [\"The Essential Oil Towelettes from Herban Essentials combines clean hands with soothing scents. Our travel hand wipes work to keep your hands clean and skin soft. They also work as face cleansing wipes, face cloths, body wipes for adults bathing, and body wipes for men when you are traveling and cannot stop to take a shower. If you need a midday refresher, use one of our citrus moisture towelettes for an energizing pick-me-up! Our collection includes lemon wipes, facial wipes cleansing cloths, a natural towelette, and men's wipes.\"]\nAverage Rating: 4.9\nProduct Details: {'Brand': 'Herban Essentials', 'Skin Type': 'All', 'Material Feature': 'Natural', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '7 x 1 x 6 inches; 5.29 Ounces', 'Manufacturer': 'Herban Essentials', 'Country of Origin': 'USA'}\nReview Text: Update Aug 11, 2021 - After using several wipes I find it's not a fluke.<br />They leave my hands feeling tacky even after they're dry.<br />And sweaty hands revive the tackiness.<br />> This has caused me to remove a star.<br /><br />Original comments<br />These are a 5\" x 8 1/2\" deliciously fragrant towelette.<br />There generously moist and stay damp between 10 to 20 minutes.<br /><br />The packets open easily = 20 (2 1/2\" x 3 1/2\") packets in each bag.<br /><br />The fragrance fades away in approx 15 minutes.<br /><br />This is expensive for towelettes but this is higher quality without alcohol / chemical.<br />This fragrance from lemon essential oil is a natural way for cleaning without drying hands.<br />Perfect for well = everywhere.<br /><br />Ingredients - Water - Lemon essential oil - Lactobacillus ferment - Polysorbate 20.<br />> I received orange - lemon - peppermint - lavender. (&lt; listed in the order I like best)<br />All are good - it's a matter of preference - mines orange.\nReview Title: Smells like REAL fresh cut LEMONS\nRating: 4.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has had several favorable experiences with products focusing on personal care and grooming. They appreciated the soothing and organic aspects of various skincare products, indicating a preference for natural ingredients. The bath pillow was noted for its comfort and effective design, making bath time enjoyable. Additionally, they found certain tools for beauty applications, like nail art utensils, to be of good quality and value, enhancing their crafting and DIY capabilities. The mindfulness gift set was well-received for its thoughtful content and calming effects, suggesting a focus on self-care and relaxation.\n\nNEGATIVE SUMMARY:\nDespite the positive experiences, the user faced multiple issues with certain purchases. They expressed disappointment with a skincare product containing harmful ingredients, which detracted from its intended benefits. The hair cutting cape was criticized for being ineffective against chemicals, and its neck area was noted as uncomfortable. The mask strap extenders had fit issues, causing discomfort, while some products did not meet the user’s expectations for efficacy, leading to overall lower satisfaction. The lemon towelettes, despite a great initial impression, were ultimately graded down due to a tacky residue left on hands after use.\n\nOVERALL SUMMARY:\nThe user's shopping experiences reflect a mix of satisfaction and disappointment. Positive interactions highlighted high-quality, soothing, and effective personal care items, contributing to their grooming and relaxation routines. However, several products fell short, primarily due to questionable ingredients, uncomfortable designs, or effectiveness concerns. The user values natural and functional products, leading to a nuanced view of their purchases, where exceptional items co-exist with less satisfactory ones. Overall, they seem to prioritize product quality and usability, indicating a discerning approach to their shopping behavior.",
  "target_interaction": {
    "rating": 4.0,
    "title": "vintage - RICH RED",
    "text": "I like the vintage appearance of the tube and lipstick which is reminiscent<br />of what my Mom / Grandma used to use.<br /><br />The price tag seems high though - given this isn't top shelf quality<br />and the amount of the 7/8\" length of lipstick.<br />And yes - it's as others have said - this goes on moist but ends up feeling dry.<br /><br />Still - I can see a lot of younger folks liking this bright RED color a LOT.<br />Our Grand-daughter for one.<br />You know - those silly kids that like constantly changing their hair color.",
    "images": [],
    "asin": "B005AL5H9S",
    "parent_asin": "B005AL5H9S",
    "user_id": "AGNUU44ETNXLBOUB53LJGFJP3SQA",
    "timestamp": "2022-02-05 22:06:33.130000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Besame Cosmetics | Forever Red Lipstick - 1925 | Classic Color Lipstick | Vintage Makeup | Long Lasting Lipstick | Semi Matte Lipstick for Women | Moisturizing Lipstick for Sensitive Skin",
    "average_rating": 4.4,
    "rating_number": 56,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31+5JFTd2fL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31+5JFTd2fL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61lQ6NcoRLL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Tac-X7cxL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Tac-X7cxL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61ACJGdG4NL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/414GwFkH1OL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/414GwFkH1OL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71S5NztImGL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51zInwbbGbL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51zInwbbGbL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71mc6CTiFZL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41C6JGFnZIL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41C6JGFnZIL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61tD-TzprpL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/411wR+F0e0L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/411wR+F0e0L.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61jPorbgUZL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Besame Lipstick How to Apply",
        "url": "https://www.amazon.com/vdp/0c01cd8209f644638b715cdab0c3616a?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Getting Glamourous with Besame",
        "url": "https://www.amazon.com/vdp/020255c9ce3d49c69ad7d875df662cbe?ref=dp_vse_rvc_1",
        "user_id": ""
      }
    ],
    "store": "BESAME COSMETICS",
    "categories": [],
    "details": {
      "Brand": "BESAME COSMETICS",
      "Skin Type": "All",
      "Item Form": "Powder",
      "Finish Type": "Semi Matte",
      "Product Benefits": "Hydrating,Long Lasting,Nourishing,Clean,Moisturizing,Makeup",
      "Package Dimensions": "4.45 x 1.14 x 1.06 inches; 0.74 Ounces"
    },
    "bought_together": null
  }
}