{
  "user_id": "AELRWE7QQJRKDFHDQHVAODTF5FRA",
  "summary": "=== Purchase Information ===\nProduct Title: JARGOD 1pcs 100% Kolinsky Sable Acrylic Nails Round Nail Art Brush (size 4)\nReview Date: 2020/09/03\nStore: JARGOD\nAverage Rating: 4.4\nProduct Details: {'Brand': 'JARGOD', 'Handle Material': 'Acrylic', 'Head Material': 'Kolinsky', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.7 x 0.3 x 0.3 inches; 0.63 Ounces'}\nReview Text: Minimal shedding, perfect shape! Just wish I had got a bigger one!! This is good for fills and nail art though!!\nReview Title: Licensed tech GOOD BRUSH\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Files 16 Pcs, Double Sided Emery Board Manicure Tools for Filing Natural Gel and Acrylic Nails for Home and Salon Use\nReview Date: 2020/09/05\nStore: Keiby Citom\nAverage Rating: 4.3\nProduct Details: {'Material': 'Acrylic', 'Brand': 'Keiby Citom', 'Grit Number': '100', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.8 x 5.08 x 0.59 inches; 5.29 Ounces', 'UPC': '742025065137', 'Manufacturer': 'YHIT'}\nReview Text: As a licensed Cosmetologist I've used ALOT of files and this shape is the best for when I so nail enhancements because I can get into the cuticle area and ensure it is smooth perfectly with the round side and then the straight side is good for filing the sides and shaping the nails! These are good quality and exactly as I expected!!\nReview Title: Best shape for nail files!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1000 Pcs Acrylic Nail Kit, Coffin Nails Long Fake Nails Tips For Nail Salons And DIY Nail, Artificial Half Cover Nail Tips With Box, Nature & Clear, 10 Size\nReview Date: 2020/09/09\nStore: VEAFX\nAverage Rating: 4.7\nProduct Details: {'Color': 'Clear', 'Size': 'Large', 'Material': 'Acrylic, Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'VEAFX', 'Style': 'French', 'Package Dimensions': '7.2 x 7 x 1.4 inches; 9.59 Ounces', 'UPC': '782912939134'}\nReview Text: All nail tips are the same just make sure you blend the seam And remove the shine too. Get the job done and come in bulk so they're perfect for me!\nReview Title: Medium depth nail well, No issues, good buy- Cosmetologist\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fashion Line 24nch Long Straight Clip In Hair Extension Full Head 7pcs/set 20Clips Heat Resistant Thick Synthetic Hairpiece Clip On Hair Extensions Dark Brown Color\nReview Date: 2020/09/14\nStore: FASHION LINE\nAverage Rating: 3.1\nProduct Details: {'Brand': 'FASHION LINE', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Package Dimensions': '14.22 x 4.89 x 0.91 inches; 6.88 Ounces', 'UPC': '193499624007'}\nReview Text: BEAUTIFUL and look so real!! I absolutely adore these!! Perfect thickness, length color and texture!! I hate that I have to color my hair and these won't match but I'm going to just buy another pair !!\nReview Title: Love these so cute\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: lootaan 500 Pieces False Nails French Acrylic Fake Nails Tips Half Cover Artificial Fake Nails With Box and False Nail Clipper for Women Girl\nReview Date: 2020/11/08\nStore: lootaan\nAverage Rating: 4.4\nProduct Details: {'Material': 'Acrylic', 'Brand': 'lootaan', 'Number of Pieces': '500', 'Package Dimensions': '9 x 6 x 2 inches; 8.01 Ounces', 'UPC': '710157699223'}\nReview Text: Sturdy tips on the thicker side but not obnoxiously thick they're perfect! I'm a nail tech (Licensed) and have used MANY different nail tips in my lifetime and never have I ever had a nail container have an actual slot for nail glue to be stored with them!! This is so smart and all of them should be like this! I will keep this container long after the tips are all used up lol!!\nReview Title: 10 stars!!! Sturdy not bulky tips, CONTAINER HAS SLOT FOR GLUE TO BE STORED!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pine Gel Nail Polish Set Chameleon Shimmering Color and Black 7.5 ml LED UV Cured Soak Off Nail Gel for Nail Art Manicure\nReview Date: 2020/11/19\nStore: pine\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Pine', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '1', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '4.96 x 3.7 x 2.91 inches; 9.14 Ounces', 'UPC': '738628890993'}\nReview Text: These colors are so much more vibrant than they look online for sure! They are just like breathtaking the shimmer in them is so  pretty I absolutely adore these polishes I cannot wait to get to use them on my nails and in the salon! I was surprised they were so bright when I opened the bottles! It also came with instructions too if you've never used gel polish too! Just make sure you have a UV lamp to cure these (=\nReview Title: SO PRETTY AND SUPER VIBRANT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yolife Acrylic Nail Brush with100% Pure Kolinsky Sable, Nail Art Brush With Brilliant crystal Handle, for Manicure Pedicure (6#, Silver)\nReview Date: 2020/12/18\nStore: YOLIFE\nAverage Rating: 4.3\nProduct Details: {'Color': 'Silver', 'Brand': 'YOLIFE', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.75 x 2 x 0.3 inches; 3.21 Ounces'}\nReview Text: This is some work I did with the brushes! The acrylic brush is perfect for doing french tips with acrylic and the brushes are perfect for art. I have a ton of art brushes I use as you can see and these ones are not only the cutest but the best quality. All my brushes are from amazon and very in price but these are so much nicer! A must have for holidays (= We need good quality tools like these for good nails!!\nReview Title: Cosmetologist review!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bicrops Professional Haircutting Shears Kit, Stainless Steel Beard Hairdressing Scissors Set, Regular Hair Shear, Thinning Scissor, Leather Case. Home Hair Salon For Men And Women\nReview Date: 2021/03/04\nStore: Bicrops\nAverage Rating: 4.8\nProduct Details: {'Material': 'Stainless Steel, Leather', 'Brand': 'Bicrops', 'Blade Material': 'Stainless Steel', 'Style': 'Classic', 'Blade Edge': 'Straight', 'Package Dimensions': '9.61 x 4.53 x 1.34 inches; 12.7 Ounces', 'UPC': '779324784056', 'Manufacturer': 'Bicrops'}\nReview Text: First of all this case is nice and worth the listed price on it's own! I have like 15 pairs of scissors and they're all dull so I figured I'd give these a try! I'm soo glad I did, I have nothing I dislike or don't love and I always have something I dislike usually lol. These have cute little blue gems and are really sharp and do a great job they're comfortable for my little hands and my chubby fingers! So excited to use them at work tommorrow!!! They have a nice weight to them I would expect to pay like $50+ for these atleast so I am blown away. I'm so glad I chose these!!\nReview Title: Good buy- Licensed pro going on 11 years!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RXBC2011 100 Eyelash Extensions Aftercare instructions Card Diamond Design 2 x 3.5 in\nReview Date: 2021/03/22\nStore: RXBC2011\nAverage Rating: 5.0\nProduct Details: {'Brand': 'RXBC2011', 'Material': 'Paper', 'Item Form': 'Individual', 'Unit Count': '1.00 Count', 'Item Weight': '4.5 Ounces'}\nReview Text: My only complaint is that they're kinda matte and not shiney in texture/look. They are super cute and all the information on the cards is correct which is why I wanted these. Customers have to know what to not do to ensure their lashes last so these are a perfect little reminder for them!\nReview Title: Good info perfect to hand out!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LXIANGN Nail Glass Cup With Lid Cute Dappen Dishes 2PCS Heart Shaped Bowl Glass Mini Crystal Bowls for Nail Art Manicure Care Tools\nReview Date: 2021/06/01\nStore: LXIANGN\nAverage Rating: 4.0\nProduct Details: {}\nReview Text: It is maybe 2 inches around in size small but perfect for monomer and powder to do nails! My sister saw these and loved them and wanted them for earrings which would be a great idea too!! The color isn't inside but underneath so if you put monomer in them it won't discolor it! These are great! I am so happy with them and highly recommend these for nail tech use! I used a little pipette to fill them with powder and liquid.\nReview Title: Nail tech use, perfect for me!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: French Smile Line Cutter Kit 8 Pieces, Nail Manicure Edge Trimmer Diy Plate Module with 2 Nail French Tip Brushes for DIY Acrylic Nail Art, Stainless Steel Easy French Smile Line Gel Cutter Tool\nReview Date: 2021/06/26\nStore: BQAN\nAverage Rating: 3.1\nProduct Details: {'Package Dimensions': '7.91 x 4.13 x 1.1 inches; 2.79 Ounces'}\nReview Text: I just had bought a 2 piece set and for my short/medium length nails they didn't work 😬 I was so sad untill I saw these! I love the variety of shapes and shapes for a variety of nail lengths! It's hard to explain but like some of the nail cutters are made only for long/xl nail shapes for a deep french tip. These will work with short nails medium large and xl nails too. They're just perfect I love these so much and cannot wait to try them!! There is one very unique shape I've never done or seen used before so that's really neat and I cannot wait!!!\nReview Title: Great variety for different length nails!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LUXEDIVA Brazilian Virgin Hair Straight 3 Bundles 10A Unprocessed Brazilian Short Straight Human Hair Weave Weft Natural Black 14 16 18\nReview Date: 2021/08/11\nStore: LUXEDIVA\nAverage Rating: 3.4\nProduct Details: {'Brand': 'LUXEDIVA', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '11.02 x 10.91 x 2.68 inches; 12.31 Ounces'}\nReview Text: The hair is a very nice quality and it is the length expected but it is so thin and the tracks are so bulky. I'm so bummed they're so thin because my hair is so thick. They are all 3 individually wrapped bundles and tell you the length on them. The track part is super thick but the very ends just thin out sooo much. I guess that is how natural hair is so I will give it a try. I'm going to do a hand tied weft and will update after I wear them and let you guys know how they dry too. I have naturally curly hair so I always prefer hair that dried kinda wavy like my own and nobody ever says in the reviews that and I'm sure other people wanted to know too!\nReview Title: Nice but thin\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mia Secret Monomer 8oz + Black Nail File Emery Boards Top-quality (100/180 Grit) - 5Pack\nReview Date: 2021/09/21\nStore: Sylvia Lashes\nAverage Rating: 4.4\nProduct Details: {'Material': 'Emery', 'Brand': 'Sylvia Lashes', 'Unit Count': '20.0 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.17 x 5.43 x 0.83 inches; 5.19 Ounces', 'UPC': '794020365385', 'Manufacturer': 'Okk Express'}\nReview Text: Perfect condition, the monomer has the same scent as my other same brand and same color so I do believe It is authentic Mia Secret and I love this monomer. The files were a really nice additional gift too! Great buy, very happy.\nReview Title: Legitimate monomer!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: VOKEYLA Blonde Short Wavy Wig with Bangs 12 Inch Shoulder Length Synthetic Cosplay Wig for Women None Lace Honey Blonde with Highlight Purple&Pink Stripe Pastel Wig(Blonde/Purple&Pink)\nReview Date: 2021/10/17\nStore: VOKEYLA\nAverage Rating: 3.9\nProduct Details: {'Material': 'Synthetic', 'Item Dimensions LxWxH': '12 x 6 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'VOKEYLA', 'Product Dimensions': '12 x 6 x 3 inches; 11.22 Ounces'}\nReview Text: I have worn so many different hair extensions or wigs and love them. This does have a fake hair kind of shine and it does shed quiet a bit. It is so cute and not easily tangled either. It's shorter in the back and a little longer in the front. The cap is a little on the more snug side. This has a really nice and pretty wave to it that makes it look a little more natural in my opinion. It's seriously so cute and unique it comes with 2 really nice wig caps and a barrette too and a seriously such cute earrings. I love these earrings so much such a nice little bonus\nReview Title: So cute and I love the pink stripe\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyelash Extension,BREYLEE Individual Eyelash Easy Fan Eyelash Silk Semi Permanent Extension Volume Lashes 15 Row 0.07 Thickness C Curl 8-15mm Mix Lash Extension Supplies For Salon Professional Use\nReview Date: 2021/10/28\nStore: BREYLEE\nAverage Rating: 3.4\nProduct Details: {'Brand': 'BREYLEE', 'Material': 'Silk', 'Item Form': 'Individual', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '2.1164 Ounce', 'Package Dimensions': '5.67 x 3.15 x 0.67 inches; 1.76 Ounces', 'Item model number': '1', 'UPC': '601951015015'}\nReview Text: These are so soft and I absolutely love them!  I have maybe 10+ different brands of lashes because I'm looking to find my favorite brand to use on my clients. These are the softest lashes I've used this far!! There doesn't seem to be like a super full amount on each line but that will make them easier to make volume lash fans with for sure! They are seriously so soft you guys! I seriously love these! I got the 8mm-15mm lengths in black then one row of blonde brown color, red and one row of blue the colored lashes are all in 12mm which is perfect! The case is unique too, I like that it is magnetic closure that is unique and it's a neat design too.\nReview Title: SOFT!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DoDo Premium Easy Fan Volume Lashes Extensions| Rapid Blooming Eyelash Extension .03/.05/.07mm C/D/CC/DD Curl Self Fanning Lashes Tray Soft Matte Application-Friendly\nReview Date: 2021/12/27\nStore: Dodo\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Dodo', 'Material': 'Polybutylene Terephthalate Fiber', 'Material Feature': 'Cruelty Free', 'Item Form': 'Individual', 'Mounting Type': 'Eyelash Glue'}\nReview Text: These are so so easy to fan out for volume lashes!! Since I got these I’ve ordered 2 more cases of this brand. They make making fans seriously SO MUCH easier!! I’ve used so many different brands and they either don’t fan well or bend or lose shape. These are absolutely perfect. They don’t lose shape from the tweezers at all or crimp like some cheap brands do! I absolutely love these so much and highly highly recommended trying these even if you are new to volume lashing like me. This order was for the 13mm and I ordered the like 16-22 I think and the 8-13 I think or something like that so that I have every size this brand has I wanted to stock up before everyone else sees how good they are and stocks up too lol.\nReview Title: Licensed Cosmetologist review!\nRating: 5.0\n--------------------------------------------------",
  "reference": "JARGOD 1pcs 100% Kolinsky Sable Acrylic Nails Round Nail Art Brush (size 4)\nJARGOD\n{'Brand': 'JARGOD', 'Handle Material': 'Acrylic', 'Head Material': 'Kolinsky', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.7 x 0.3 x 0.3 inches; 0.63 Ounces'}\nMinimal shedding, perfect shape! Just wish I had got a bigger one!! This is good for fills and nail art though!!\nLicensed tech GOOD BRUSH\nNail Files 16 Pcs, Double Sided Emery Board Manicure Tools for Filing Natural Gel and Acrylic Nails for Home and Salon Use\nKeiby Citom\n{'Material': 'Acrylic', 'Brand': 'Keiby Citom', 'Grit Number': '100', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.8 x 5.08 x 0.59 inches; 5.29 Ounces', 'UPC': '742025065137', 'Manufacturer': 'YHIT'}\nAs a licensed Cosmetologist I've used ALOT of files and this shape is the best for when I so nail enhancements because I can get into the cuticle area and ensure it is smooth perfectly with the round side and then the straight side is good for filing the sides and shaping the nails! These are good quality and exactly as I expected!!\nBest shape for nail files!!\n1000 Pcs Acrylic Nail Kit, Coffin Nails Long Fake Nails Tips For Nail Salons And DIY Nail, Artificial Half Cover Nail Tips With Box, Nature & Clear, 10 Size\nVEAFX\n{'Color': 'Clear', 'Size': 'Large', 'Material': 'Acrylic, Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'VEAFX', 'Style': 'French', 'Package Dimensions': '7.2 x 7 x 1.4 inches; 9.59 Ounces', 'UPC': '782912939134'}\nAll nail tips are the same just make sure you blend the seam And remove the shine too. Get the job done and come in bulk so they're perfect for me!\nMedium depth nail well, No issues, good buy- Cosmetologist\nFashion Line 24nch Long Straight Clip In Hair Extension Full Head 7pcs/set 20Clips Heat Resistant Thick Synthetic Hairpiece Clip On Hair Extensions Dark Brown Color\nFASHION LINE\n{'Brand': 'FASHION LINE', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Package Dimensions': '14.22 x 4.89 x 0.91 inches; 6.88 Ounces', 'UPC': '193499624007'}\nBEAUTIFUL and look so real!! I absolutely adore these!! Perfect thickness, length color and texture!! I hate that I have to color my hair and these won't match but I'm going to just buy another pair !!\nLove these so cute\nlootaan 500 Pieces False Nails French Acrylic Fake Nails Tips Half Cover Artificial Fake Nails With Box and False Nail Clipper for Women Girl\nlootaan\n{'Material': 'Acrylic', 'Brand': 'lootaan', 'Number of Pieces': '500', 'Package Dimensions': '9 x 6 x 2 inches; 8.01 Ounces', 'UPC': '710157699223'}\nSturdy tips on the thicker side but not obnoxiously thick they're perfect! I'm a nail tech (Licensed) and have used MANY different nail tips in my lifetime and never have I ever had a nail container have an actual slot for nail glue to be stored with them!! This is so smart and all of them should be like this! I will keep this container long after the tips are all used up lol!!\n10 stars!!! Sturdy not bulky tips, CONTAINER HAS SLOT FOR GLUE TO BE STORED!!\nPine Gel Nail Polish Set Chameleon Shimmering Color and Black 7.5 ml LED UV Cured Soak Off Nail Gel for Nail Art Manicure\npine\n{'Brand': 'Pine', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '1', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '4.96 x 3.7 x 2.91 inches; 9.14 Ounces', 'UPC': '738628890993'}\nThese colors are so much more vibrant than they look online for sure! They are just like breathtaking the shimmer in them is so  pretty I absolutely adore these polishes I cannot wait to get to use them on my nails and in the salon! I was surprised they were so bright when I opened the bottles! It also came with instructions too if you've never used gel polish too! Just make sure you have a UV lamp to cure these (=\nSO PRETTY AND SUPER VIBRANT\nYolife Acrylic Nail Brush with100% Pure Kolinsky Sable, Nail Art Brush With Brilliant crystal Handle, for Manicure Pedicure (6#, Silver)\nYOLIFE\n{'Color': 'Silver', 'Brand': 'YOLIFE', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.75 x 2 x 0.3 inches; 3.21 Ounces'}\nThis is some work I did with the brushes! The acrylic brush is perfect for doing french tips with acrylic and the brushes are perfect for art. I have a ton of art brushes I use as you can see and these ones are not only the cutest but the best quality. All my brushes are from amazon and very in price but these are so much nicer! A must have for holidays (= We need good quality tools like these for good nails!!\nCosmetologist review!\nBicrops Professional Haircutting Shears Kit, Stainless Steel Beard Hairdressing Scissors Set, Regular Hair Shear, Thinning Scissor, Leather Case. Home Hair Salon For Men And Women\nBicrops\n{'Material': 'Stainless Steel, Leather', 'Brand': 'Bicrops', 'Blade Material': 'Stainless Steel', 'Style': 'Classic', 'Blade Edge': 'Straight', 'Package Dimensions': '9.61 x 4.53 x 1.34 inches; 12.7 Ounces', 'UPC': '779324784056', 'Manufacturer': 'Bicrops'}\nFirst of all this case is nice and worth the listed price on it's own! I have like 15 pairs of scissors and they're all dull so I figured I'd give these a try! I'm soo glad I did, I have nothing I dislike or don't love and I always have something I dislike usually lol. These have cute little blue gems and are really sharp and do a great job they're comfortable for my little hands and my chubby fingers! So excited to use them at work tommorrow!!! They have a nice weight to them I would expect to pay like $50+ for these atleast so I am blown away. I'm so glad I chose these!!\nGood buy- Licensed pro going on 11 years!\nRXBC2011 100 Eyelash Extensions Aftercare instructions Card Diamond Design 2 x 3.5 in\nRXBC2011\n{'Brand': 'RXBC2011', 'Material': 'Paper', 'Item Form': 'Individual', 'Unit Count': '1.00 Count', 'Item Weight': '4.5 Ounces'}\nMy only complaint is that they're kinda matte and not shiney in texture/look. They are super cute and all the information on the cards is correct which is why I wanted these. Customers have to know what to not do to ensure their lashes last so these are a perfect little reminder for them!\nGood info perfect to hand out!\nLXIANGN Nail Glass Cup With Lid Cute Dappen Dishes 2PCS Heart Shaped Bowl Glass Mini Crystal Bowls for Nail Art Manicure Care Tools\nLXIANGN\n{}\nIt is maybe 2 inches around in size small but perfect for monomer and powder to do nails! My sister saw these and loved them and wanted them for earrings which would be a great idea too!! The color isn't inside but underneath so if you put monomer in them it won't discolor it! These are great! I am so happy with them and highly recommend these for nail tech use! I used a little pipette to fill them with powder and liquid.\nNail tech use, perfect for me!!\nFrench Smile Line Cutter Kit 8 Pieces, Nail Manicure Edge Trimmer Diy Plate Module with 2 Nail French Tip Brushes for DIY Acrylic Nail Art, Stainless Steel Easy French Smile Line Gel Cutter Tool\nBQAN\n{'Package Dimensions': '7.91 x 4.13 x 1.1 inches; 2.79 Ounces'}\nI just had bought a 2 piece set and for my short/medium length nails they didn't work 😬 I was so sad untill I saw these! I love the variety of shapes and shapes for a variety of nail lengths! It's hard to explain but like some of the nail cutters are made only for long/xl nail shapes for a deep french tip. These will work with short nails medium large and xl nails too. They're just perfect I love these so much and cannot wait to try them!! There is one very unique shape I've never done or seen used before so that's really neat and I cannot wait!!!\nGreat variety for different length nails!\nLUXEDIVA Brazilian Virgin Hair Straight 3 Bundles 10A Unprocessed Brazilian Short Straight Human Hair Weave Weft Natural Black 14 16 18\nLUXEDIVA\n{'Brand': 'LUXEDIVA', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '11.02 x 10.91 x 2.68 inches; 12.31 Ounces'}\nThe hair is a very nice quality and it is the length expected but it is so thin and the tracks are so bulky. I'm so bummed they're so thin because my hair is so thick. They are all 3 individually wrapped bundles and tell you the length on them. The track part is super thick but the very ends just thin out sooo much. I guess that is how natural hair is so I will give it a try. I'm going to do a hand tied weft and will update after I wear them and let you guys know how they dry too. I have naturally curly hair so I always prefer hair that dried kinda wavy like my own and nobody ever says in the reviews that and I'm sure other people wanted to know too!\nNice but thin\nMia Secret Monomer 8oz + Black Nail File Emery Boards Top-quality (100/180 Grit) - 5Pack\nSylvia Lashes\n{'Material': 'Emery', 'Brand': 'Sylvia Lashes', 'Unit Count': '20.0 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.17 x 5.43 x 0.83 inches; 5.19 Ounces', 'UPC': '794020365385', 'Manufacturer': 'Okk Express'}\nPerfect condition, the monomer has the same scent as my other same brand and same color so I do believe It is authentic Mia Secret and I love this monomer. The files were a really nice additional gift too! Great buy, very happy.\nLegitimate monomer!\nVOKEYLA Blonde Short Wavy Wig with Bangs 12 Inch Shoulder Length Synthetic Cosplay Wig for Women None Lace Honey Blonde with Highlight Purple&Pink Stripe Pastel Wig(Blonde/Purple&Pink)\nVOKEYLA\n{'Material': 'Synthetic', 'Item Dimensions LxWxH': '12 x 6 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'VOKEYLA', 'Product Dimensions': '12 x 6 x 3 inches; 11.22 Ounces'}\nI have worn so many different hair extensions or wigs and love them. This does have a fake hair kind of shine and it does shed quiet a bit. It is so cute and not easily tangled either. It's shorter in the back and a little longer in the front. The cap is a little on the more snug side. This has a really nice and pretty wave to it that makes it look a little more natural in my opinion. It's seriously so cute and unique it comes with 2 really nice wig caps and a barrette too and a seriously such cute earrings. I love these earrings so much such a nice little bonus\nSo cute and I love the pink stripe\nEyelash Extension,BREYLEE Individual Eyelash Easy Fan Eyelash Silk Semi Permanent Extension Volume Lashes 15 Row 0.07 Thickness C Curl 8-15mm Mix Lash Extension Supplies For Salon Professional Use\nBREYLEE\n{'Brand': 'BREYLEE', 'Material': 'Silk', 'Item Form': 'Individual', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '2.1164 Ounce', 'Package Dimensions': '5.67 x 3.15 x 0.67 inches; 1.76 Ounces', 'Item model number': '1', 'UPC': '601951015015'}\nThese are so soft and I absolutely love them!  I have maybe 10+ different brands of lashes because I'm looking to find my favorite brand to use on my clients. These are the softest lashes I've used this far!! There doesn't seem to be like a super full amount on each line but that will make them easier to make volume lash fans with for sure! They are seriously so soft you guys! I seriously love these! I got the 8mm-15mm lengths in black then one row of blonde brown color, red and one row of blue the colored lashes are all in 12mm which is perfect! The case is unique too, I like that it is magnetic closure that is unique and it's a neat design too.\nSOFT!\nDoDo Premium Easy Fan Volume Lashes Extensions| Rapid Blooming Eyelash Extension .03/.05/.07mm C/D/CC/DD Curl Self Fanning Lashes Tray Soft Matte Application-Friendly\nDodo\n{'Brand': 'Dodo', 'Material': 'Polybutylene Terephthalate Fiber', 'Material Feature': 'Cruelty Free', 'Item Form': 'Individual', 'Mounting Type': 'Eyelash Glue'}\nThese are so so easy to fan out for volume lashes!! Since I got these I’ve ordered 2 more cases of this brand. They make making fans seriously SO MUCH easier!! I’ve used so many different brands and they either don’t fan well or bend or lose shape. These are absolutely perfect. They don’t lose shape from the tweezers at all or crimp like some cheap brands do! I absolutely love these so much and highly highly recommended trying these even if you are new to volume lashing like me. This order was for the 13mm and I ordered the like 16-22 I think and the 8-13 I think or something like that so that I have every size this brand has I wanted to stock up before everyone else sees how good they are and stocks up too lol.\nLicensed Cosmetologist review!",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: JARGOD 1pcs 100% Kolinsky Sable Acrylic Nails Round Nail Art Brush (size 4)\nReview Date: 2020/09/03\nStore: JARGOD\nAverage Rating: 4.4\nProduct Details: {'Brand': 'JARGOD', 'Handle Material': 'Acrylic', 'Head Material': 'Kolinsky', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.7 x 0.3 x 0.3 inches; 0.63 Ounces'}\nReview Text: Minimal shedding, perfect shape! Just wish I had got a bigger one!! This is good for fills and nail art though!!\nReview Title: Licensed tech GOOD BRUSH\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Files 16 Pcs, Double Sided Emery Board Manicure Tools for Filing Natural Gel and Acrylic Nails for Home and Salon Use\nReview Date: 2020/09/05\nStore: Keiby Citom\nAverage Rating: 4.3\nProduct Details: {'Material': 'Acrylic', 'Brand': 'Keiby Citom', 'Grit Number': '100', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.8 x 5.08 x 0.59 inches; 5.29 Ounces', 'UPC': '742025065137', 'Manufacturer': 'YHIT'}\nReview Text: As a licensed Cosmetologist I've used ALOT of files and this shape is the best for when I so nail enhancements because I can get into the cuticle area and ensure it is smooth perfectly with the round side and then the straight side is good for filing the sides and shaping the nails! These are good quality and exactly as I expected!!\nReview Title: Best shape for nail files!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1000 Pcs Acrylic Nail Kit, Coffin Nails Long Fake Nails Tips For Nail Salons And DIY Nail, Artificial Half Cover Nail Tips With Box, Nature & Clear, 10 Size\nReview Date: 2020/09/09\nStore: VEAFX\nAverage Rating: 4.7\nProduct Details: {'Color': 'Clear', 'Size': 'Large', 'Material': 'Acrylic, Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'VEAFX', 'Style': 'French', 'Package Dimensions': '7.2 x 7 x 1.4 inches; 9.59 Ounces', 'UPC': '782912939134'}\nReview Text: All nail tips are the same just make sure you blend the seam And remove the shine too. Get the job done and come in bulk so they're perfect for me!\nReview Title: Medium depth nail well, No issues, good buy- Cosmetologist\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Fashion Line 24nch Long Straight Clip In Hair Extension Full Head 7pcs/set 20Clips Heat Resistant Thick Synthetic Hairpiece Clip On Hair Extensions Dark Brown Color\nReview Date: 2020/09/14\nStore: FASHION LINE\nAverage Rating: 3.1\nProduct Details: {'Brand': 'FASHION LINE', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Clip-In', 'Package Dimensions': '14.22 x 4.89 x 0.91 inches; 6.88 Ounces', 'UPC': '193499624007'}\nReview Text: BEAUTIFUL and look so real!! I absolutely adore these!! Perfect thickness, length color and texture!! I hate that I have to color my hair and these won't match but I'm going to just buy another pair !!\nReview Title: Love these so cute\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: lootaan 500 Pieces False Nails French Acrylic Fake Nails Tips Half Cover Artificial Fake Nails With Box and False Nail Clipper for Women Girl\nReview Date: 2020/11/08\nStore: lootaan\nAverage Rating: 4.4\nProduct Details: {'Material': 'Acrylic', 'Brand': 'lootaan', 'Number of Pieces': '500', 'Package Dimensions': '9 x 6 x 2 inches; 8.01 Ounces', 'UPC': '710157699223'}\nReview Text: Sturdy tips on the thicker side but not obnoxiously thick they're perfect! I'm a nail tech (Licensed) and have used MANY different nail tips in my lifetime and never have I ever had a nail container have an actual slot for nail glue to be stored with them!! This is so smart and all of them should be like this! I will keep this container long after the tips are all used up lol!!\nReview Title: 10 stars!!! Sturdy not bulky tips, CONTAINER HAS SLOT FOR GLUE TO BE STORED!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pine Gel Nail Polish Set Chameleon Shimmering Color and Black 7.5 ml LED UV Cured Soak Off Nail Gel for Nail Art Manicure\nReview Date: 2020/11/19\nStore: pine\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Pine', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '1', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '4.96 x 3.7 x 2.91 inches; 9.14 Ounces', 'UPC': '738628890993'}\nReview Text: These colors are so much more vibrant than they look online for sure! They are just like breathtaking the shimmer in them is so  pretty I absolutely adore these polishes I cannot wait to get to use them on my nails and in the salon! I was surprised they were so bright when I opened the bottles! It also came with instructions too if you've never used gel polish too! Just make sure you have a UV lamp to cure these (=\nReview Title: SO PRETTY AND SUPER VIBRANT\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Yolife Acrylic Nail Brush with100% Pure Kolinsky Sable, Nail Art Brush With Brilliant crystal Handle, for Manicure Pedicure (6#, Silver)\nReview Date: 2020/12/18\nStore: YOLIFE\nAverage Rating: 4.3\nProduct Details: {'Color': 'Silver', 'Brand': 'YOLIFE', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.75 x 2 x 0.3 inches; 3.21 Ounces'}\nReview Text: This is some work I did with the brushes! The acrylic brush is perfect for doing french tips with acrylic and the brushes are perfect for art. I have a ton of art brushes I use as you can see and these ones are not only the cutest but the best quality. All my brushes are from amazon and very in price but these are so much nicer! A must have for holidays (= We need good quality tools like these for good nails!!\nReview Title: Cosmetologist review!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bicrops Professional Haircutting Shears Kit, Stainless Steel Beard Hairdressing Scissors Set, Regular Hair Shear, Thinning Scissor, Leather Case. Home Hair Salon For Men And Women\nReview Date: 2021/03/04\nStore: Bicrops\nAverage Rating: 4.8\nProduct Details: {'Material': 'Stainless Steel, Leather', 'Brand': 'Bicrops', 'Blade Material': 'Stainless Steel', 'Style': 'Classic', 'Blade Edge': 'Straight', 'Package Dimensions': '9.61 x 4.53 x 1.34 inches; 12.7 Ounces', 'UPC': '779324784056', 'Manufacturer': 'Bicrops'}\nReview Text: First of all this case is nice and worth the listed price on it's own! I have like 15 pairs of scissors and they're all dull so I figured I'd give these a try! I'm soo glad I did, I have nothing I dislike or don't love and I always have something I dislike usually lol. These have cute little blue gems and are really sharp and do a great job they're comfortable for my little hands and my chubby fingers! So excited to use them at work tommorrow!!! They have a nice weight to them I would expect to pay like $50+ for these atleast so I am blown away. I'm so glad I chose these!!\nReview Title: Good buy- Licensed pro going on 11 years!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RXBC2011 100 Eyelash Extensions Aftercare instructions Card Diamond Design 2 x 3.5 in\nReview Date: 2021/03/22\nStore: RXBC2011\nAverage Rating: 5.0\nProduct Details: {'Brand': 'RXBC2011', 'Material': 'Paper', 'Item Form': 'Individual', 'Unit Count': '1.00 Count', 'Item Weight': '4.5 Ounces'}\nReview Text: My only complaint is that they're kinda matte and not shiney in texture/look. They are super cute and all the information on the cards is correct which is why I wanted these. Customers have to know what to not do to ensure their lashes last so these are a perfect little reminder for them!\nReview Title: Good info perfect to hand out!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LXIANGN Nail Glass Cup With Lid Cute Dappen Dishes 2PCS Heart Shaped Bowl Glass Mini Crystal Bowls for Nail Art Manicure Care Tools\nReview Date: 2021/06/01\nStore: LXIANGN\nAverage Rating: 4.0\nProduct Details: {}\nReview Text: It is maybe 2 inches around in size small but perfect for monomer and powder to do nails! My sister saw these and loved them and wanted them for earrings which would be a great idea too!! The color isn't inside but underneath so if you put monomer in them it won't discolor it! These are great! I am so happy with them and highly recommend these for nail tech use! I used a little pipette to fill them with powder and liquid.\nReview Title: Nail tech use, perfect for me!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: French Smile Line Cutter Kit 8 Pieces, Nail Manicure Edge Trimmer Diy Plate Module with 2 Nail French Tip Brushes for DIY Acrylic Nail Art, Stainless Steel Easy French Smile Line Gel Cutter Tool\nReview Date: 2021/06/26\nStore: BQAN\nAverage Rating: 3.1\nProduct Details: {'Package Dimensions': '7.91 x 4.13 x 1.1 inches; 2.79 Ounces'}\nReview Text: I just had bought a 2 piece set and for my short/medium length nails they didn't work 😬 I was so sad untill I saw these! I love the variety of shapes and shapes for a variety of nail lengths! It's hard to explain but like some of the nail cutters are made only for long/xl nail shapes for a deep french tip. These will work with short nails medium large and xl nails too. They're just perfect I love these so much and cannot wait to try them!! There is one very unique shape I've never done or seen used before so that's really neat and I cannot wait!!!\nReview Title: Great variety for different length nails!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LUXEDIVA Brazilian Virgin Hair Straight 3 Bundles 10A Unprocessed Brazilian Short Straight Human Hair Weave Weft Natural Black 14 16 18\nReview Date: 2021/08/11\nStore: LUXEDIVA\nAverage Rating: 3.4\nProduct Details: {'Brand': 'LUXEDIVA', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '11.02 x 10.91 x 2.68 inches; 12.31 Ounces'}\nReview Text: The hair is a very nice quality and it is the length expected but it is so thin and the tracks are so bulky. I'm so bummed they're so thin because my hair is so thick. They are all 3 individually wrapped bundles and tell you the length on them. The track part is super thick but the very ends just thin out sooo much. I guess that is how natural hair is so I will give it a try. I'm going to do a hand tied weft and will update after I wear them and let you guys know how they dry too. I have naturally curly hair so I always prefer hair that dried kinda wavy like my own and nobody ever says in the reviews that and I'm sure other people wanted to know too!\nReview Title: Nice but thin\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mia Secret Monomer 8oz + Black Nail File Emery Boards Top-quality (100/180 Grit) - 5Pack\nReview Date: 2021/09/21\nStore: Sylvia Lashes\nAverage Rating: 4.4\nProduct Details: {'Material': 'Emery', 'Brand': 'Sylvia Lashes', 'Unit Count': '20.0 Ounce', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.17 x 5.43 x 0.83 inches; 5.19 Ounces', 'UPC': '794020365385', 'Manufacturer': 'Okk Express'}\nReview Text: Perfect condition, the monomer has the same scent as my other same brand and same color so I do believe It is authentic Mia Secret and I love this monomer. The files were a really nice additional gift too! Great buy, very happy.\nReview Title: Legitimate monomer!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: VOKEYLA Blonde Short Wavy Wig with Bangs 12 Inch Shoulder Length Synthetic Cosplay Wig for Women None Lace Honey Blonde with Highlight Purple&Pink Stripe Pastel Wig(Blonde/Purple&Pink)\nReview Date: 2021/10/17\nStore: VOKEYLA\nAverage Rating: 3.9\nProduct Details: {'Material': 'Synthetic', 'Item Dimensions LxWxH': '12 x 6 x 3 inches', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Brand': 'VOKEYLA', 'Product Dimensions': '12 x 6 x 3 inches; 11.22 Ounces'}\nReview Text: I have worn so many different hair extensions or wigs and love them. This does have a fake hair kind of shine and it does shed quiet a bit. It is so cute and not easily tangled either. It's shorter in the back and a little longer in the front. The cap is a little on the more snug side. This has a really nice and pretty wave to it that makes it look a little more natural in my opinion. It's seriously so cute and unique it comes with 2 really nice wig caps and a barrette too and a seriously such cute earrings. I love these earrings so much such a nice little bonus\nReview Title: So cute and I love the pink stripe\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Eyelash Extension,BREYLEE Individual Eyelash Easy Fan Eyelash Silk Semi Permanent Extension Volume Lashes 15 Row 0.07 Thickness C Curl 8-15mm Mix Lash Extension Supplies For Salon Professional Use\nReview Date: 2021/10/28\nStore: BREYLEE\nAverage Rating: 3.4\nProduct Details: {'Brand': 'BREYLEE', 'Material': 'Silk', 'Item Form': 'Individual', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '2.1164 Ounce', 'Package Dimensions': '5.67 x 3.15 x 0.67 inches; 1.76 Ounces', 'Item model number': '1', 'UPC': '601951015015'}\nReview Text: These are so soft and I absolutely love them!  I have maybe 10+ different brands of lashes because I'm looking to find my favorite brand to use on my clients. These are the softest lashes I've used this far!! There doesn't seem to be like a super full amount on each line but that will make them easier to make volume lash fans with for sure! They are seriously so soft you guys! I seriously love these! I got the 8mm-15mm lengths in black then one row of blonde brown color, red and one row of blue the colored lashes are all in 12mm which is perfect! The case is unique too, I like that it is magnetic closure that is unique and it's a neat design too.\nReview Title: SOFT!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DoDo Premium Easy Fan Volume Lashes Extensions| Rapid Blooming Eyelash Extension .03/.05/.07mm C/D/CC/DD Curl Self Fanning Lashes Tray Soft Matte Application-Friendly\nReview Date: 2021/12/27\nStore: Dodo\nAverage Rating: 3.7\nProduct Details: {'Brand': 'Dodo', 'Material': 'Polybutylene Terephthalate Fiber', 'Material Feature': 'Cruelty Free', 'Item Form': 'Individual', 'Mounting Type': 'Eyelash Glue'}\nReview Text: These are so so easy to fan out for volume lashes!! Since I got these I’ve ordered 2 more cases of this brand. They make making fans seriously SO MUCH easier!! I’ve used so many different brands and they either don’t fan well or bend or lose shape. These are absolutely perfect. They don’t lose shape from the tweezers at all or crimp like some cheap brands do! I absolutely love these so much and highly highly recommended trying these even if you are new to volume lashing like me. This order was for the 13mm and I ordered the like 16-22 I think and the 8-13 I think or something like that so that I have every size this brand has I wanted to stock up before everyone else sees how good they are and stocks up too lol.\nReview Title: Licensed Cosmetologist review!\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:  \nThe user demonstrated a strong preference for high-quality nail and hair care products, consistently enjoying tools that enhanced their professional work. Positive feedback mentions minimal shedding and perfect shapes, emphasizing excellent performance in nail art. They appreciated the ideal shapes of nail files, vibrant colors of polishes, and innovative product designs, such as storage solutions for adhesives. Additionally, the comfort and aesthetics of tools like haircutting shears, and the softness of lashes were frequently highlighted. The user values products that deliver both functionality and pleasant aesthetics, indicating satisfaction with bulk purchases and unique designs.\n\nNEGATIVE SUMMARY:  \nSome negative experiences revolve around issues of product compatibility and quality. The user expressed disappointment regarding specific hair products being excessively thin despite good quality, which didn't meet their expectations. They noted dissatisfaction with the shine and shedding of synthetic wigs, indicating a desire for more natural appearance and durability. Additionally, there were mentions of tools not being versatile enough for varied nail lengths, which could lead to inefficiency. The lower ratings reflect frustration regarding performance and appearance not aligning with their professional standards.\n\nOVERALL SUMMARY:  \nThe user’s shopping behavior displays a clear trend toward seeking high-quality products for nail and hair care, often resulting in positive experiences with functionality and aesthetics. However, there are notable disappointments related to specific compatibility and quality concerns, particularly with hair extensions and tools. The blend of stellar satisfaction with certain brands alongside criticism of others reflects a discerning consumer who prioritizes performance, versatility, and overall value in their professional toolkit.",
  "target_interaction": {
    "rating": 2.0,
    "title": "Easy for cute nails,",
    "text": "They came with the wrong tips.. these were not what they said they are or ones that will work with the gel glue, disappointing. Like the lamp and the gel glue holds up well though just don’t count on getting the right nail tips. They have wells like half coverage ones, they are not coffin shaped or made of gel",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61+EkM4nIJL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61+EkM4nIJL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61+EkM4nIJL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/617dqG3PgfL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/617dqG3PgfL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/617dqG3PgfL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/618-E2KVcIL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/618-E2KVcIL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/618-E2KVcIL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61Ens9rtRnL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61Ens9rtRnL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61Ens9rtRnL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61MwwwZRiFL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61MwwwZRiFL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61MwwwZRiFL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61h7S9k7MRL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61h7S9k7MRL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61h7S9k7MRL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71jOQDpflZL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71jOQDpflZL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71jOQDpflZL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09CFZK853",
    "parent_asin": "B09CFZK853",
    "user_id": "AELRWE7QQJRKDFHDQHVAODTF5FRA",
    "timestamp": "2022-01-05 01:35:12.765000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Janier Coffin Nail Tips Nail Glue Kit,2 In 1 Nail Glue Base Coat Top Coat for Acrylic Nail with Coffin Fake Nail and U V LED Nail Lamp,Nail Extension Gel DIY Home Nail Art Set…",
    "average_rating": 4.2,
    "rating_number": 154,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51rxzikkFdL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51rxzikkFdL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71Mq+6vsTdL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51nxS16PkWL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51nxS16PkWL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71GMYe5Xv2L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Ai09L+KJL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Ai09L+KJL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61erGPXRfCL._SL1475_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51Ut0QqyYuL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51Ut0QqyYuL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71gNqc7daDL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51b1q2WmICL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51b1q2WmICL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61IEgKZCYHL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51xWtxD+ADL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51xWtxD+ADL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71M3gVPGWhL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51db4d6XTbL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51db4d6XTbL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/71ZG3gZdfHL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Janier",
    "categories": [],
    "details": {
      "Brand": "Janier",
      "Material": "Acrylic",
      "Item Form": "Gel",
      "Item Package Quantity": "1",
      "Item Volume": "10 Milliliters",
      "Package Dimensions": "7.72 x 4.25 x 3.98 inches; 15.2 Ounces",
      "UPC": "750081717808"
    },
    "bought_together": null
  }
}