{
  "user_id": "AE3QBGRRHKT3GFDPRXFEN7JICEZQ",
  "summary": "=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Waterproof Natural Thick Fiber Mascara, Thick Thickening Lengthening, Dramatic Extension Voluminous Eyelashes Mascara, No Clumping, No Smudging Lasting All Day\nReview Date: 2020/08/25\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.1 inches; 2.4 Ounces', 'UPC': '764690676838', 'Manufacturer': 'SIKEMAY'}\nReview Text: Does a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. Very happy with this purchase.\nReview Title: Great mascara\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nReview Date: 2020/08/25\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nReview Text: Does a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. I also really like the square shape of the bottle, it keeps it from rolling around on my counter when I set it down lol Very happy with this purchase.\nReview Title: Long, thick lashes in an instant!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Boar Bristle Hair Brush, Detangler Brush, Hairbrush for Long Short Thick Thin Curly Straight Wavy Dry Hair Adds Shine and Makes Hair Smooth, Best Paddle Hair Brush for Men Women Kids\nReview Date: 2020/09/09\nStore: LHIUEM\nAverage Rating: 4.5\nProduct Details: {'Brand': 'LHIUEM', 'Unit Count': '1.00 Count', 'Hair Type': 'All, Wavy, Dry, Curly, Straight', 'Material': 'Boar', 'Product Dimensions': '10.43 x 3.94 x 1.97 inches; 8.47 Ounces', 'UPC': '791523116681'}\nReview Text: I initially bought a soft bristle boar bristle brush and HATED it. I got this combination brush and I really, really like it. This gift set is great because it has a small travel brush as well as a cleaning tool and comb. I haven't used the comb but the travel brush came in really handy as I usually only with my regular comb and no brush because the brush takes up too much space. Having the smaller travel brush was nice and then the cleaning tool is awesome to clean hair out of both brushes. I would definitely recommend this set for anyone wanting a boar bristle brush.\nReview Title: Great gift pack!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pine Gel Nail Polish Set Chameleon Shimmering Color and Black 7.5 ml LED UV Cured Soak Off Nail Gel for Nail Art Manicure\nReview Date: 2020/12/11\nStore: pine\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Pine', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '1', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '4.96 x 3.7 x 2.91 inches; 9.14 Ounces', 'UPC': '738628890993'}\nReview Text: This set does not come with a base or top coat but DOES come with the necessary black polish that you will want to use under these colors. They are incredibly sheer polishes and to use without a black base you will not be able to get full, opaque coverage. With the black base though these polishes really stand out. They are unique to anything else I have in my gel polish collection and is similar to what you would find in the indie polish world of regular polishes. I swatched them on black swatch sticks and I only needed one coat to get the look I was going for. They were just thick enough to get good coverage but not so thick they were goopy. I'm looking forward to wearing these colors!\nReview Title: Fun!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CIMIY Gel Nail Polish Set 8 bottles - Manicure Colors Infinity with Top Base Coat for Forest Nail Art Natural Daily All Seasons for Nail Profession Salon and Starter at Home Soak Off UV LED 0.32oz\nReview Date: 2020/12/11\nStore: CIMIY\nAverage Rating: 4.1\nProduct Details: {'Brand': 'CIMIY', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Liquid Volume': '0.3 Fluid Ounces', 'Package Dimensions': '11.54 x 3.58 x 1.22 inches; 11.64 Ounces'}\nReview Text: These colors are perfect for the fall season. They come in a really nice gift set package and include a bas and top coat so your giftee will be all ready to go...as long as they already have a lamp ;) The colors on the bottles are very accurate as to what is inside the bottle, which is really good considering a lot of the time color accuracy is the biggest issue. I swatched one color; it was two coats of perfection. The formula is a lot like regular polish rather than gel, meaning it glides on really well and you don't have to manipulate it to get good coverage. The top coat cured in 30 seconds which I was super excited about. Some other brands I have tried recently have needed 120+ seconds to cure which just makes the process way too long for me. Overall I am really happy with this brand and this set. I wish they had more colors to try. Once they do, I'm sure I'll be making another purchase!\nReview Title: Beautiful fall set\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Color Changing Gel Nail Polish Set Spring Summer Mood Nail Polish for Starter and Professional 6 Colors Pink Red Blue Yellow Purple Brown Manicure Kit for Valentine’s Day Girlfriend Gift\nReview Date: 2020/12/11\nStore: ASKITO\nAverage Rating: 3.5\nProduct Details: {'Brand': 'ASKITO', 'Item Form': 'Gel', 'Type': 'Gel', 'Special Feature': 'Long Lasting,Long-lasting', 'Age Range (Description)': 'Adult', 'Unit Count': '1.62 Fl Oz', 'Number of Items': '6', 'Liquid Volume': '0.27 Fluid Ounces'}\nReview Text: I have quite a few regular nail polishes that are thermal and I love the magic of the changing colors. I really enjoy showing people how cool it looks for the polish to change color right before their eyes! Now having the option to do this with long lasting gel polish is super exciting! I swatched these colors and was able to immediately see the color difference after being under the warm lights of the led lamp so the changing is very sensitive, which is really what you want in a thermal polish. The stickers on the tops of the bottles aren't all that color accurate BUT they do give a general idea of what the colors are so you can have an idea of what you have. I did 2 coats for each color and it's a little hard to tell but some were great with 2 coats and others really could have benefited from a third. The glitter polish is really not a pretty color at all, I kind of wish it was either just a different thermal all together or they had chose different colors for it. The blue and reddish colors were the best formulas, seeming more like regular nail polish (not as thick and much smoother application).<br />The set is packaged great for gift giving. If you know anyone who really likes polish this would be great for them, keeping in mind if they don't already work with gel polishes they will need not only some type of lamp but also a base and top coat since this set does not include those.\nReview Title: Thermal gel polish-YES!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, Milantia 3/4 Inch Mini Travel Curling Wand Hair for Small Curly, Dual Voltage Ceramic Tourmaline 19mm Crimper Hair Iron for Women - Fast Heating, Portable\nReview Date: 2020/12/25\nStore: Milantia\nAverage Rating: 3.8\nProduct Details: {'Shape': 'Barrel', 'Brand': 'Milantia', 'Hair Type': 'All,Thick,Thin', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Product Dimensions': '9.25 x 1.97 x 1.97 inches; 12.63 Ounces', 'Manufacturer': 'Milantia'}\nReview Text: Ok, I know the photos of the product show the box that says \"mini-curler\" but nothing in the description indicates how MINI it truly is! I've never owned a 3 barrel iron before so I watched a few videos online while I was waiting for this to arrive. It looked easy enough, though I was questioning the size of the ones they used versus the what I ordered. The barrel is 3/4\" so I knew that would make for a tighter curl regardless and I was ok with that. What I didn't think about was the overall size of the whole thing. It's tiny, like really, really small lol I attached a pic of me holding it, it's like a play curling iron for a child lol BUT it does work! I was able to curl through all of my hair in no time at all and it left me feeling like I got a perm in 10 mins (see pic of my hair straight vs curled)! Not something I'm going to want to do on a regular basis. I think I want more of a relaxed wave for that which means a much larger barrel size, but for special occasions when I do want my hair curly this will do the trick nicely.<br />A separate, tiny complaint is the inability to adjust the heat setting. I have very thin hair and I generally don't use very high heat settings on my other curlers/straighteners but this one was either on or off, no adjustment for heat so I had to make sure to not hold my hair in for too long so I wouldn't risk breaking it off. It's not the most ideal situation but it is a fairly easy fix to just err on the side of not long enough rather than too long.\nReview Title: SMALL but effective\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UV LED Nail Lamp – 128W Rapid-Curing Gel Nails Dryer for Manicures and Pedicures – Dual-Voltage with Extra-Long Cable, Multi-Language Manual – Professional Gel Lamp for Homes or Salons by OVLUX, Gold\nReview Date: 2020/12/26\nStore: OVLUX\nAverage Rating: 4.3\nProduct Details: {'Brand': 'OVLUX', 'Special Feature': 'Energy Efficient', 'Light Source Type': 'LED', 'Material': 'Gel', 'Connectivity Technology': 'USB', 'Package Dimensions': '9.4 x 8.3 x 4.3 inches; 1.55 Pounds', 'UPC': '765453999881'}\nReview Text: I previously purchased a higher watt lamp with the hopes that it would cut down my curing time for doing gels at home. Unfortunately it did not and it also made my nail beds burn so that lamp went in the trash! This lamp doesn't have quite as high of wattage as that other one but is higher than most standard ones. So far it seems to do the trick for me. Cuts down on the time with no burn! Yay! It has a motion activated sensor so it will turn on to the last setting you used when you put your hand (or foot) in, there are several timed settings that countdown (10,30,60 & 99 low heat) or it will count up without selecting one of those to 120 seconds, and the bottom detaches to do pedicures. Very nice light at a great value!\nReview Title: Nice powerful lamp without being too powerful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ROSEGIN 23 Pcs Gel Nail Polish Set with Glossy and Matte Top and Base Coat Soak Off Gel Polish Colors Pink Red Green Neon Long Lasting Nail Gel Polish\nReview Date: 2021/01/14\nStore: ROSEGIN\nAverage Rating: 4.3\nProduct Details: {'Brand': 'ROSEGIN', 'Item Form': 'Gel', 'Color': 'Yellow,Orange,Green,Red,Pink', 'Finish Type': 'Glitter,Glossy', 'Special Feature': 'Long Lasting,Peel Off,Long-lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '23', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '11.77 x 10.12 x 1.14 inches; 1.78 Pounds'}\nReview Text: This set is packaged really nicely and includes 20 polishes plus a  base coat and both glossy and matte top coats. The bottles of color are small, super small, only 5ml! And most of the glitters need 3 coats at a minimum so you won't get much use out of those unless you only use them as accent nails. The creams are nice and opaque though, this was a one coater in the pic. I did like that there was a white crelly even though after 3 coats it still wasn't opaque. Ultimately this is an average set. The small size of the bottles and the sheerness of the glitters makes it a 3 star product. There are too many other sets out there that are better to put this one at the top of the list but because of the number of polishes that also includes base/top coats it's still better than others.\nReview Title: Good creams, glitters are sheer\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Purple Shampoo and Conditioner Set - Sulfate Free Salon Grade (2 x 16.9 fl oz) - Hydrating Toner - Shimmer Correction for Platinum Blonde, Silver, Light, and Grey Hair - New Formula\nReview Date: 2021/07/09\nStore: BELLISSO\nAverage Rating: 3.9\nProduct Details: {'Product Benefits': 'Hydrating,Shine,Restoring,Nourishing', 'Brand': 'BELLISSO', 'Hair Type': 'Color', 'Scent': 'Green Tea,Natural', 'Number of Items': '2', 'Package Dimensions': '8.86 x 6.02 x 3.11 inches; 2.91 Pounds', 'UPC': '765066671129'}\nReview Text: I really wanted to like this set. My initial thoughts on it while applying it in the shower was \"no\" because it provided absolutely no moisturizing qualities to my hair. The conditioner was more like a shampoo and the shampoo was horribly drying! I ended up having to use a seperate extra moisturizing conditioner after I rinsed this out. I was pretty sure this was going to be given away to someone at that point. Then I got out of the shower and styled my hair and it looked really nice and all the brassiness was gone. So now I'm really conflicted. I may end up keeping it with the knowledge that it needs an extra conditioning step but if that becomes annoying these may be given away.\nReview Title: Great at getting rid of brassiness, not so great at moisturizing\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gelike Reflective Glitter Gel Nail Polish - Gorgeous Gold Colors Soak Off Disco Diamond Nail Art Polish Sparkly Shiny Manicure Varnish, UV Led Lamp Required, 0.34 Fl.Oz\nReview Date: 2021/12/19\nStore: gelike ec\nAverage Rating: 3.3\nProduct Details: {'Brand': 'Gelike ec', 'Item Form': 'Gel', 'Color': 'Gold', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Liquid Volume': '0.33 Fluid Ounces', 'Package Dimensions': '2.91 x 1.3 x 0.87 inches; 1.45 Ounces'}\nReview Text: The gold sparkle in this is beautiful! And it's a fairly dense glitter so you only need 2 coats if you didn't feel like doing a third. I don't think a third is necessary to get the most out of this polish.\nReview Title: Stunning!\nRating: 5.0\n--------------------------------------------------",
  "reference": "4D Silk Fiber Lash Mascara Black, Waterproof Natural Thick Fiber Mascara, Thick Thickening Lengthening, Dramatic Extension Voluminous Eyelashes Mascara, No Clumping, No Smudging Lasting All Day\nSIKEMAY\n{'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.1 inches; 2.4 Ounces', 'UPC': '764690676838', 'Manufacturer': 'SIKEMAY'}\nDoes a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. Very happy with this purchase.\nGreat mascara\n4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nSIKEMAY\n{'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nDoes a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. I also really like the square shape of the bottle, it keeps it from rolling around on my counter when I set it down lol Very happy with this purchase.\nLong, thick lashes in an instant!\nBoar Bristle Hair Brush, Detangler Brush, Hairbrush for Long Short Thick Thin Curly Straight Wavy Dry Hair Adds Shine and Makes Hair Smooth, Best Paddle Hair Brush for Men Women Kids\nLHIUEM\n{'Brand': 'LHIUEM', 'Unit Count': '1.00 Count', 'Hair Type': 'All, Wavy, Dry, Curly, Straight', 'Material': 'Boar', 'Product Dimensions': '10.43 x 3.94 x 1.97 inches; 8.47 Ounces', 'UPC': '791523116681'}\nI initially bought a soft bristle boar bristle brush and HATED it. I got this combination brush and I really, really like it. This gift set is great because it has a small travel brush as well as a cleaning tool and comb. I haven't used the comb but the travel brush came in really handy as I usually only with my regular comb and no brush because the brush takes up too much space. Having the smaller travel brush was nice and then the cleaning tool is awesome to clean hair out of both brushes. I would definitely recommend this set for anyone wanting a boar bristle brush.\nGreat gift pack!\nPine Gel Nail Polish Set Chameleon Shimmering Color and Black 7.5 ml LED UV Cured Soak Off Nail Gel for Nail Art Manicure\npine\n{'Brand': 'Pine', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '1', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '4.96 x 3.7 x 2.91 inches; 9.14 Ounces', 'UPC': '738628890993'}\nThis set does not come with a base or top coat but DOES come with the necessary black polish that you will want to use under these colors. They are incredibly sheer polishes and to use without a black base you will not be able to get full, opaque coverage. With the black base though these polishes really stand out. They are unique to anything else I have in my gel polish collection and is similar to what you would find in the indie polish world of regular polishes. I swatched them on black swatch sticks and I only needed one coat to get the look I was going for. They were just thick enough to get good coverage but not so thick they were goopy. I'm looking forward to wearing these colors!\nFun!\nCIMIY Gel Nail Polish Set 8 bottles - Manicure Colors Infinity with Top Base Coat for Forest Nail Art Natural Daily All Seasons for Nail Profession Salon and Starter at Home Soak Off UV LED 0.32oz\nCIMIY\n{'Brand': 'CIMIY', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Liquid Volume': '0.3 Fluid Ounces', 'Package Dimensions': '11.54 x 3.58 x 1.22 inches; 11.64 Ounces'}\nThese colors are perfect for the fall season. They come in a really nice gift set package and include a bas and top coat so your giftee will be all ready to go...as long as they already have a lamp ;) The colors on the bottles are very accurate as to what is inside the bottle, which is really good considering a lot of the time color accuracy is the biggest issue. I swatched one color; it was two coats of perfection. The formula is a lot like regular polish rather than gel, meaning it glides on really well and you don't have to manipulate it to get good coverage. The top coat cured in 30 seconds which I was super excited about. Some other brands I have tried recently have needed 120+ seconds to cure which just makes the process way too long for me. Overall I am really happy with this brand and this set. I wish they had more colors to try. Once they do, I'm sure I'll be making another purchase!\nBeautiful fall set\nColor Changing Gel Nail Polish Set Spring Summer Mood Nail Polish for Starter and Professional 6 Colors Pink Red Blue Yellow Purple Brown Manicure Kit for Valentine’s Day Girlfriend Gift\nASKITO\n{'Brand': 'ASKITO', 'Item Form': 'Gel', 'Type': 'Gel', 'Special Feature': 'Long Lasting,Long-lasting', 'Age Range (Description)': 'Adult', 'Unit Count': '1.62 Fl Oz', 'Number of Items': '6', 'Liquid Volume': '0.27 Fluid Ounces'}\nI have quite a few regular nail polishes that are thermal and I love the magic of the changing colors. I really enjoy showing people how cool it looks for the polish to change color right before their eyes! Now having the option to do this with long lasting gel polish is super exciting! I swatched these colors and was able to immediately see the color difference after being under the warm lights of the led lamp so the changing is very sensitive, which is really what you want in a thermal polish. The stickers on the tops of the bottles aren't all that color accurate BUT they do give a general idea of what the colors are so you can have an idea of what you have. I did 2 coats for each color and it's a little hard to tell but some were great with 2 coats and others really could have benefited from a third. The glitter polish is really not a pretty color at all, I kind of wish it was either just a different thermal all together or they had chose different colors for it. The blue and reddish colors were the best formulas, seeming more like regular nail polish (not as thick and much smoother application).<br />The set is packaged great for gift giving. If you know anyone who really likes polish this would be great for them, keeping in mind if they don't already work with gel polishes they will need not only some type of lamp but also a base and top coat since this set does not include those.\nThermal gel polish-YES!\n3 Barrel Curling Iron, Milantia 3/4 Inch Mini Travel Curling Wand Hair for Small Curly, Dual Voltage Ceramic Tourmaline 19mm Crimper Hair Iron for Women - Fast Heating, Portable\nMilantia\n{'Shape': 'Barrel', 'Brand': 'Milantia', 'Hair Type': 'All,Thick,Thin', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Product Dimensions': '9.25 x 1.97 x 1.97 inches; 12.63 Ounces', 'Manufacturer': 'Milantia'}\nOk, I know the photos of the product show the box that says \"mini-curler\" but nothing in the description indicates how MINI it truly is! I've never owned a 3 barrel iron before so I watched a few videos online while I was waiting for this to arrive. It looked easy enough, though I was questioning the size of the ones they used versus the what I ordered. The barrel is 3/4\" so I knew that would make for a tighter curl regardless and I was ok with that. What I didn't think about was the overall size of the whole thing. It's tiny, like really, really small lol I attached a pic of me holding it, it's like a play curling iron for a child lol BUT it does work! I was able to curl through all of my hair in no time at all and it left me feeling like I got a perm in 10 mins (see pic of my hair straight vs curled)! Not something I'm going to want to do on a regular basis. I think I want more of a relaxed wave for that which means a much larger barrel size, but for special occasions when I do want my hair curly this will do the trick nicely.<br />A separate, tiny complaint is the inability to adjust the heat setting. I have very thin hair and I generally don't use very high heat settings on my other curlers/straighteners but this one was either on or off, no adjustment for heat so I had to make sure to not hold my hair in for too long so I wouldn't risk breaking it off. It's not the most ideal situation but it is a fairly easy fix to just err on the side of not long enough rather than too long.\nSMALL but effective\nUV LED Nail Lamp – 128W Rapid-Curing Gel Nails Dryer for Manicures and Pedicures – Dual-Voltage with Extra-Long Cable, Multi-Language Manual – Professional Gel Lamp for Homes or Salons by OVLUX, Gold\nOVLUX\n{'Brand': 'OVLUX', 'Special Feature': 'Energy Efficient', 'Light Source Type': 'LED', 'Material': 'Gel', 'Connectivity Technology': 'USB', 'Package Dimensions': '9.4 x 8.3 x 4.3 inches; 1.55 Pounds', 'UPC': '765453999881'}\nI previously purchased a higher watt lamp with the hopes that it would cut down my curing time for doing gels at home. Unfortunately it did not and it also made my nail beds burn so that lamp went in the trash! This lamp doesn't have quite as high of wattage as that other one but is higher than most standard ones. So far it seems to do the trick for me. Cuts down on the time with no burn! Yay! It has a motion activated sensor so it will turn on to the last setting you used when you put your hand (or foot) in, there are several timed settings that countdown (10,30,60 & 99 low heat) or it will count up without selecting one of those to 120 seconds, and the bottom detaches to do pedicures. Very nice light at a great value!\nNice powerful lamp without being too powerful\nROSEGIN 23 Pcs Gel Nail Polish Set with Glossy and Matte Top and Base Coat Soak Off Gel Polish Colors Pink Red Green Neon Long Lasting Nail Gel Polish\nROSEGIN\n{'Brand': 'ROSEGIN', 'Item Form': 'Gel', 'Color': 'Yellow,Orange,Green,Red,Pink', 'Finish Type': 'Glitter,Glossy', 'Special Feature': 'Long Lasting,Peel Off,Long-lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '23', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '11.77 x 10.12 x 1.14 inches; 1.78 Pounds'}\nThis set is packaged really nicely and includes 20 polishes plus a  base coat and both glossy and matte top coats. The bottles of color are small, super small, only 5ml! And most of the glitters need 3 coats at a minimum so you won't get much use out of those unless you only use them as accent nails. The creams are nice and opaque though, this was a one coater in the pic. I did like that there was a white crelly even though after 3 coats it still wasn't opaque. Ultimately this is an average set. The small size of the bottles and the sheerness of the glitters makes it a 3 star product. There are too many other sets out there that are better to put this one at the top of the list but because of the number of polishes that also includes base/top coats it's still better than others.\nGood creams, glitters are sheer\nPurple Shampoo and Conditioner Set - Sulfate Free Salon Grade (2 x 16.9 fl oz) - Hydrating Toner - Shimmer Correction for Platinum Blonde, Silver, Light, and Grey Hair - New Formula\nBELLISSO\n{'Product Benefits': 'Hydrating,Shine,Restoring,Nourishing', 'Brand': 'BELLISSO', 'Hair Type': 'Color', 'Scent': 'Green Tea,Natural', 'Number of Items': '2', 'Package Dimensions': '8.86 x 6.02 x 3.11 inches; 2.91 Pounds', 'UPC': '765066671129'}\nI really wanted to like this set. My initial thoughts on it while applying it in the shower was \"no\" because it provided absolutely no moisturizing qualities to my hair. The conditioner was more like a shampoo and the shampoo was horribly drying! I ended up having to use a seperate extra moisturizing conditioner after I rinsed this out. I was pretty sure this was going to be given away to someone at that point. Then I got out of the shower and styled my hair and it looked really nice and all the brassiness was gone. So now I'm really conflicted. I may end up keeping it with the knowledge that it needs an extra conditioning step but if that becomes annoying these may be given away.\nGreat at getting rid of brassiness, not so great at moisturizing\nGelike Reflective Glitter Gel Nail Polish - Gorgeous Gold Colors Soak Off Disco Diamond Nail Art Polish Sparkly Shiny Manicure Varnish, UV Led Lamp Required, 0.34 Fl.Oz\ngelike ec\n{'Brand': 'Gelike ec', 'Item Form': 'Gel', 'Color': 'Gold', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Liquid Volume': '0.33 Fluid Ounces', 'Package Dimensions': '2.91 x 1.3 x 0.87 inches; 1.45 Ounces'}\nThe gold sparkle in this is beautiful! And it's a fairly dense glitter so you only need 2 coats if you didn't feel like doing a third. I don't think a third is necessary to get the most out of this polish.\nStunning!",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Waterproof Natural Thick Fiber Mascara, Thick Thickening Lengthening, Dramatic Extension Voluminous Eyelashes Mascara, No Clumping, No Smudging Lasting All Day\nReview Date: 2020/08/25\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'black', 'Special Feature': 'Water, Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '7.2 x 4 x 1.1 inches; 2.4 Ounces', 'UPC': '764690676838', 'Manufacturer': 'SIKEMAY'}\nReview Text: Does a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. Very happy with this purchase.\nReview Title: Great mascara\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 4D Silk Fiber Lash Mascara Black, Natural Waterproof Mascara Extra Long Lash,Thick Thickening and Lengthening, No Clumping, No Smudging, Lasting Voluminous Eyelashes Dramatic Extension Mascara\nReview Date: 2020/08/25\nStore: SIKEMAY\nAverage Rating: 4.0\nProduct Details: {'Color': 'Black', 'Special Feature': 'Smudge Proof, Non Clumping', 'Brand': 'SIKEMAY', 'Specialty': 'Waterproof, Hypoallergenic', 'Unit Count': '1.00 Count', 'Package Dimensions': '8.9 x 4 x 1.1 inches; 2.57 Ounces', 'UPC': '764690676852', 'Manufacturer': 'SIKEMAY'}\nReview Text: Does a great job of making my lashes look lush and full plus it also makes them look longer. I usually have mascara that does one or the other but not both  so this product is great. It's waterproof but easily removable with a makeup wipe or eye makeup remover. I also really like the square shape of the bottle, it keeps it from rolling around on my counter when I set it down lol Very happy with this purchase.\nReview Title: Long, thick lashes in an instant!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Boar Bristle Hair Brush, Detangler Brush, Hairbrush for Long Short Thick Thin Curly Straight Wavy Dry Hair Adds Shine and Makes Hair Smooth, Best Paddle Hair Brush for Men Women Kids\nReview Date: 2020/09/09\nStore: LHIUEM\nAverage Rating: 4.5\nProduct Details: {'Brand': 'LHIUEM', 'Unit Count': '1.00 Count', 'Hair Type': 'All, Wavy, Dry, Curly, Straight', 'Material': 'Boar', 'Product Dimensions': '10.43 x 3.94 x 1.97 inches; 8.47 Ounces', 'UPC': '791523116681'}\nReview Text: I initially bought a soft bristle boar bristle brush and HATED it. I got this combination brush and I really, really like it. This gift set is great because it has a small travel brush as well as a cleaning tool and comb. I haven't used the comb but the travel brush came in really handy as I usually only with my regular comb and no brush because the brush takes up too much space. Having the smaller travel brush was nice and then the cleaning tool is awesome to clean hair out of both brushes. I would definitely recommend this set for anyone wanting a boar bristle brush.\nReview Title: Great gift pack!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pine Gel Nail Polish Set Chameleon Shimmering Color and Black 7.5 ml LED UV Cured Soak Off Nail Gel for Nail Art Manicure\nReview Date: 2020/12/11\nStore: pine\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Pine', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '1', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '4.96 x 3.7 x 2.91 inches; 9.14 Ounces', 'UPC': '738628890993'}\nReview Text: This set does not come with a base or top coat but DOES come with the necessary black polish that you will want to use under these colors. They are incredibly sheer polishes and to use without a black base you will not be able to get full, opaque coverage. With the black base though these polishes really stand out. They are unique to anything else I have in my gel polish collection and is similar to what you would find in the indie polish world of regular polishes. I swatched them on black swatch sticks and I only needed one coat to get the look I was going for. They were just thick enough to get good coverage but not so thick they were goopy. I'm looking forward to wearing these colors!\nReview Title: Fun!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CIMIY Gel Nail Polish Set 8 bottles - Manicure Colors Infinity with Top Base Coat for Forest Nail Art Natural Daily All Seasons for Nail Profession Salon and Starter at Home Soak Off UV LED 0.32oz\nReview Date: 2020/12/11\nStore: CIMIY\nAverage Rating: 4.1\nProduct Details: {'Brand': 'CIMIY', 'Item Form': 'Gel', 'Type': 'Gel', 'Finish Type': 'Glossy', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Liquid Volume': '0.3 Fluid Ounces', 'Package Dimensions': '11.54 x 3.58 x 1.22 inches; 11.64 Ounces'}\nReview Text: These colors are perfect for the fall season. They come in a really nice gift set package and include a bas and top coat so your giftee will be all ready to go...as long as they already have a lamp ;) The colors on the bottles are very accurate as to what is inside the bottle, which is really good considering a lot of the time color accuracy is the biggest issue. I swatched one color; it was two coats of perfection. The formula is a lot like regular polish rather than gel, meaning it glides on really well and you don't have to manipulate it to get good coverage. The top coat cured in 30 seconds which I was super excited about. Some other brands I have tried recently have needed 120+ seconds to cure which just makes the process way too long for me. Overall I am really happy with this brand and this set. I wish they had more colors to try. Once they do, I'm sure I'll be making another purchase!\nReview Title: Beautiful fall set\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Color Changing Gel Nail Polish Set Spring Summer Mood Nail Polish for Starter and Professional 6 Colors Pink Red Blue Yellow Purple Brown Manicure Kit for Valentine’s Day Girlfriend Gift\nReview Date: 2020/12/11\nStore: ASKITO\nAverage Rating: 3.5\nProduct Details: {'Brand': 'ASKITO', 'Item Form': 'Gel', 'Type': 'Gel', 'Special Feature': 'Long Lasting,Long-lasting', 'Age Range (Description)': 'Adult', 'Unit Count': '1.62 Fl Oz', 'Number of Items': '6', 'Liquid Volume': '0.27 Fluid Ounces'}\nReview Text: I have quite a few regular nail polishes that are thermal and I love the magic of the changing colors. I really enjoy showing people how cool it looks for the polish to change color right before their eyes! Now having the option to do this with long lasting gel polish is super exciting! I swatched these colors and was able to immediately see the color difference after being under the warm lights of the led lamp so the changing is very sensitive, which is really what you want in a thermal polish. The stickers on the tops of the bottles aren't all that color accurate BUT they do give a general idea of what the colors are so you can have an idea of what you have. I did 2 coats for each color and it's a little hard to tell but some were great with 2 coats and others really could have benefited from a third. The glitter polish is really not a pretty color at all, I kind of wish it was either just a different thermal all together or they had chose different colors for it. The blue and reddish colors were the best formulas, seeming more like regular nail polish (not as thick and much smoother application).<br />The set is packaged great for gift giving. If you know anyone who really likes polish this would be great for them, keeping in mind if they don't already work with gel polishes they will need not only some type of lamp but also a base and top coat since this set does not include those.\nReview Title: Thermal gel polish-YES!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, Milantia 3/4 Inch Mini Travel Curling Wand Hair for Small Curly, Dual Voltage Ceramic Tourmaline 19mm Crimper Hair Iron for Women - Fast Heating, Portable\nReview Date: 2020/12/25\nStore: Milantia\nAverage Rating: 3.8\nProduct Details: {'Shape': 'Barrel', 'Brand': 'Milantia', 'Hair Type': 'All,Thick,Thin', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Product Dimensions': '9.25 x 1.97 x 1.97 inches; 12.63 Ounces', 'Manufacturer': 'Milantia'}\nReview Text: Ok, I know the photos of the product show the box that says \"mini-curler\" but nothing in the description indicates how MINI it truly is! I've never owned a 3 barrel iron before so I watched a few videos online while I was waiting for this to arrive. It looked easy enough, though I was questioning the size of the ones they used versus the what I ordered. The barrel is 3/4\" so I knew that would make for a tighter curl regardless and I was ok with that. What I didn't think about was the overall size of the whole thing. It's tiny, like really, really small lol I attached a pic of me holding it, it's like a play curling iron for a child lol BUT it does work! I was able to curl through all of my hair in no time at all and it left me feeling like I got a perm in 10 mins (see pic of my hair straight vs curled)! Not something I'm going to want to do on a regular basis. I think I want more of a relaxed wave for that which means a much larger barrel size, but for special occasions when I do want my hair curly this will do the trick nicely.<br />A separate, tiny complaint is the inability to adjust the heat setting. I have very thin hair and I generally don't use very high heat settings on my other curlers/straighteners but this one was either on or off, no adjustment for heat so I had to make sure to not hold my hair in for too long so I wouldn't risk breaking it off. It's not the most ideal situation but it is a fairly easy fix to just err on the side of not long enough rather than too long.\nReview Title: SMALL but effective\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UV LED Nail Lamp – 128W Rapid-Curing Gel Nails Dryer for Manicures and Pedicures – Dual-Voltage with Extra-Long Cable, Multi-Language Manual – Professional Gel Lamp for Homes or Salons by OVLUX, Gold\nReview Date: 2020/12/26\nStore: OVLUX\nAverage Rating: 4.3\nProduct Details: {'Brand': 'OVLUX', 'Special Feature': 'Energy Efficient', 'Light Source Type': 'LED', 'Material': 'Gel', 'Connectivity Technology': 'USB', 'Package Dimensions': '9.4 x 8.3 x 4.3 inches; 1.55 Pounds', 'UPC': '765453999881'}\nReview Text: I previously purchased a higher watt lamp with the hopes that it would cut down my curing time for doing gels at home. Unfortunately it did not and it also made my nail beds burn so that lamp went in the trash! This lamp doesn't have quite as high of wattage as that other one but is higher than most standard ones. So far it seems to do the trick for me. Cuts down on the time with no burn! Yay! It has a motion activated sensor so it will turn on to the last setting you used when you put your hand (or foot) in, there are several timed settings that countdown (10,30,60 & 99 low heat) or it will count up without selecting one of those to 120 seconds, and the bottom detaches to do pedicures. Very nice light at a great value!\nReview Title: Nice powerful lamp without being too powerful\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ROSEGIN 23 Pcs Gel Nail Polish Set with Glossy and Matte Top and Base Coat Soak Off Gel Polish Colors Pink Red Green Neon Long Lasting Nail Gel Polish\nReview Date: 2021/01/14\nStore: ROSEGIN\nAverage Rating: 4.3\nProduct Details: {'Brand': 'ROSEGIN', 'Item Form': 'Gel', 'Color': 'Yellow,Orange,Green,Red,Pink', 'Finish Type': 'Glitter,Glossy', 'Special Feature': 'Long Lasting,Peel Off,Long-lasting', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '1 Count', 'Number of Items': '23', 'Liquid Volume': '0.25 Fluid Ounces', 'Package Dimensions': '11.77 x 10.12 x 1.14 inches; 1.78 Pounds'}\nReview Text: This set is packaged really nicely and includes 20 polishes plus a  base coat and both glossy and matte top coats. The bottles of color are small, super small, only 5ml! And most of the glitters need 3 coats at a minimum so you won't get much use out of those unless you only use them as accent nails. The creams are nice and opaque though, this was a one coater in the pic. I did like that there was a white crelly even though after 3 coats it still wasn't opaque. Ultimately this is an average set. The small size of the bottles and the sheerness of the glitters makes it a 3 star product. There are too many other sets out there that are better to put this one at the top of the list but because of the number of polishes that also includes base/top coats it's still better than others.\nReview Title: Good creams, glitters are sheer\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Purple Shampoo and Conditioner Set - Sulfate Free Salon Grade (2 x 16.9 fl oz) - Hydrating Toner - Shimmer Correction for Platinum Blonde, Silver, Light, and Grey Hair - New Formula\nReview Date: 2021/07/09\nStore: BELLISSO\nAverage Rating: 3.9\nProduct Details: {'Product Benefits': 'Hydrating,Shine,Restoring,Nourishing', 'Brand': 'BELLISSO', 'Hair Type': 'Color', 'Scent': 'Green Tea,Natural', 'Number of Items': '2', 'Package Dimensions': '8.86 x 6.02 x 3.11 inches; 2.91 Pounds', 'UPC': '765066671129'}\nReview Text: I really wanted to like this set. My initial thoughts on it while applying it in the shower was \"no\" because it provided absolutely no moisturizing qualities to my hair. The conditioner was more like a shampoo and the shampoo was horribly drying! I ended up having to use a seperate extra moisturizing conditioner after I rinsed this out. I was pretty sure this was going to be given away to someone at that point. Then I got out of the shower and styled my hair and it looked really nice and all the brassiness was gone. So now I'm really conflicted. I may end up keeping it with the knowledge that it needs an extra conditioning step but if that becomes annoying these may be given away.\nReview Title: Great at getting rid of brassiness, not so great at moisturizing\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Gelike Reflective Glitter Gel Nail Polish - Gorgeous Gold Colors Soak Off Disco Diamond Nail Art Polish Sparkly Shiny Manicure Varnish, UV Led Lamp Required, 0.34 Fl.Oz\nReview Date: 2021/12/19\nStore: gelike ec\nAverage Rating: 3.3\nProduct Details: {'Brand': 'Gelike ec', 'Item Form': 'Gel', 'Color': 'Gold', 'Type': 'Gel', 'Finish Type': 'Shimmery', 'Special Feature': 'Long Lasting', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Liquid Volume': '0.33 Fluid Ounces', 'Package Dimensions': '2.91 x 1.3 x 0.87 inches; 1.45 Ounces'}\nReview Text: The gold sparkle in this is beautiful! And it's a fairly dense glitter so you only need 2 coats if you didn't feel like doing a third. I don't think a third is necessary to get the most out of this polish.\nReview Title: Stunning!\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user's shopping experience showcases a strong appreciation for products that deliver significant results, particularly in enhancing appearance. They consistently highlight the effective performance of items that improve lash volume and length, as well as hair texture. Many products are commended for their ease of use and convenience, such as the travel-friendly brush and efficient nail lamps that meet their needs while being functional and user-friendly. The unique qualities of gel nail polishes, along with their vibrant colors and shine, have also garnered positive feedback, enhancing the user's enjoyment of their beauty routines.\n\nNEGATIVE SUMMARY:\nSeveral negative experiences stem from products that fell short of expectations in terms of performance or quality. Issues with certain nail polishes include lack of opacity and the need for multiple coats, which detracts from satisfaction. The user expressed disappointment in a hair care set that was overly drying, necessitating additional products to achieve desired results. The sizing of a curling iron did not align with their expectations, leaving the user feeling it was too small. Overall, the complaints revolve around product effectiveness, misleading descriptions, and inadequate results, leading to some frustration.\n\nOVERALL SUMMARY:\nThe user's purchase history reflects a generally positive engagement with beauty products that enhance appearance, with notable satisfaction regarding mascara performance and nail polish vibrancy. While they appreciate effective products, they also face challenges with certain items that fail to meet their performance expectations or offer usability issues, including drying hair care products and misleading sizing on tools. This blend of positive and negative experiences illustrates a nuanced relationship with beauty purchases, characterized by a search for effective solutions amid occasional disappointments.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Beautiful colors!",
    "text": "Comes with base coat and glossy/matte top coats as well as the colors. The colors are really nice and go on smoothly.",
    "images": [],
    "asin": "B09FXJRS2G",
    "parent_asin": "B09FXJRS2G",
    "user_id": "AE3QBGRRHKT3GFDPRXFEN7JICEZQ",
    "timestamp": "2021-12-31 20:13:47.016000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "MAYJAM 12PCS Gel Nail Polish Set - Nude Blue Green Glitter Red Colors Collection with Base Top Coat - 8ML Gel Polish Kit Manicure DIY Home Salon",
    "average_rating": 4.0,
    "rating_number": 36,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51wgT1SzcuL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51wgT1SzcuL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71V3KEXIvBL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/514pnl62TYL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/514pnl62TYL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71vrN9gdObL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41qOkmBB6PL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41qOkmBB6PL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61C+9HR+o9L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Nr22q1AlL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Nr22q1AlL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61FzRiRwbcL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41BKrxJERoL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41BKrxJERoL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61lTInjvb+L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51u5eRMHBOL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51u5eRMHBOL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71zFQ8m7MfL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51yXRr5Su1L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51yXRr5Su1L.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/81IBCeMH27L._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Nice Colors",
        "url": "https://www.amazon.com/vdp/0ab16d367c9d49ada0e00e5877e1a3b1?ref=dp_vse_rvc_0",
        "user_id": "AESZOIN2WVQ2D6W6AZ27DM2WOD4Q"
      }
    ],
    "store": "MAYJAM",
    "categories": [],
    "details": {
      "Brand": "MAYJAM",
      "Item Form": "Gel",
      "Color": "Blue,Green,Red",
      "Type": "gel",
      "Finish Type": "Shimmery",
      "Special Feature": "Long Lasting",
      "Age Range (Description)": "Adult",
      "Unit Count": "3.24 Fl Oz",
      "Liquid Volume": "0.27 Fluid Ounces",
      "Item Dimensions LxWxH": "8.66 x 6.38 x 0.79 inches",
      "Product Dimensions": "8.66 x 6.38 x 0.79 inches; 8.78 Ounces"
    },
    "bought_together": null
  }
}