{
  "user_id": "AEORT2SOUGKL76PYWWGS4SUL3OSA_1",
  "summary": "=== Purchase Information ===\nProduct Title: Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nReview Date: 2020/01/15\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nReview Text: Looks really nice.  It's easy to use and looks natural.  It has a good weight to it.  It even came with some eyelashes.\nReview Title: Good color\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dreamemo 48W UV LED Nail Lamp, with 4 Timer Setting, Professional Pink Nail Dryer for Gel Nail Polish Gel Nail Starter Kit for Fingernail and Toenail Curing\nReview Date: 2020/01/17\nStore: Dreamemo\nAverage Rating: 4.0\nProduct Details: {'Style': 'Traditional', 'Brand': 'Dreamemo', 'Light Source Type': 'LED', 'Wattage': '48 watts', 'Pattern': 'Solid', 'Package Dimensions': '11.26 x 8.58 x 4.37 inches; 1.63 Pounds'}\nReview Text: Love this.  Great for nails and those of use who might be a little clumsy and \"miss\" the opening smearing polish on the light. Works great.  Lots of nails in it's future.\nReview Title: wide opening\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nReview Date: 2020/06/22\nStore: Sam&Helen\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nReview Text: I have a few friends who have tried similar products and I was curious.  The liner is thick and has almost a rubbery feel.  Even with makeup remover I found it quite challenging to remove.  Make sure to mix it before applying.  It took me three coats to get the lashes to stay.  Make sure to let it dry all the way.  The lash options are helpful to get the right look.\nReview Title: challenging to remove\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Emilia Hypoallergenic Bath Oil for Babies - Paraben-Free Natural Baby Wash Enriched With Natural Oat Extract, Sunflower, Sweet Almond, Sesame, Calendula, and Chamomile 8.5 fl.oz.\nReview Date: 2020/09/02\nStore: Emilia\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Emilia', 'Scent': 'Chamomile', 'Item Form': 'Oil', 'Unit Count': '8.5 Fl Oz', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.81 x 2.05 x 1.85 inches; 8.78 Ounces'}\nReview Text: I really like the smell.  It is easy to add to my daughters bath and she comes out soft and ready for night time.  It leaves her skin soft but not oily and doesn't cause her sensitive skin any trouble.\nReview Title: Relaxing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LAPOTHICELL Blemish Out Cream 50ml, Face Moisturizer, improves uneven skin tone.\nReview Date: 2020/11/21\nStore: LAPOTHICELL\nAverage Rating: 3.9\nProduct Details: {'Brand': 'LAPOTHICELL', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'Acne Prone', 'Product Dimensions': '2.36 x 2.36 x 2.36 inches; 3.42 Ounces'}\nReview Text: I've fallen in love with a couple Korean beauty products so I was excited to try this one.  It came in a cute little pink box.  The outside of the container was clean.  I have combination skin and I am prone to hormonal breakouts.  Using this twice a day seems to help my blemishes heal faster and not get as bad.  My skin feels very healthy after using this regularly.  I have sensitive skin and have not had any problems.\nReview Title: Great for blemishes\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EZ Detangler Brush, Morgles 2 Pack Detangling Brush for Curly Hair Ez Hair Detangling Brush for Afro America/ African Hair 3a to 4c Wavy Hair\nReview Date: 2020/12/05\nStore: MORGLES\nAverage Rating: 3.8\nProduct Details: {'Brand': 'MORGLES', 'Shape': 'Oblong', 'Handle Material': 'Rubber', 'Unit Count': '2.00 Count', 'Hair Type': 'Curly,Wavy,Thick', 'Product Dimensions': '9.69 x 2.99 x 1.38 inches; 6.38 Ounces'}\nReview Text: Really easy to use brush that is great for all hair types.  My daughter has curly hair and this brush makes it so much easier to brush her hair.  She is more willing to sit for me to brush and style her hair and doesn't complain.  Then she attempts to brush my hair (still developing that skill).\nReview Title: Great for tangly hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Onkessy Lip Gloss Base Primer for DIY Lip Gloss Make Your Own Lip Gloss DIY Handmade Lip Gloss Glaze Gel Waterproof Non-Stick Cup 50/80ML\nReview Date: 2021/04/30\nStore: Onkessy\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Onkessy', 'Product Benefits': 'Softening,Smoothening', 'Item Form': 'Gel', 'Finish Type': 'Matte', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.43 x 3.07 x 1.26 inches; 3.21 Ounces'}\nReview Text: The volume is accurate to the ad for the lipgloss base.  It works well, I mix with Shae butter, vitamin e and pigment.  It is a good volume for my daughter and I to make homemade lipgloss but if making gifts or anything more than a handful of tunes this is a small volume.  Mine did not come with the non stick bowl the ad mentions.  It seems a little pricey but works well and my sensitive skin does not react to it.\nReview Title: Works well\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Swiss Botany Pueraria Mirifica Breast Lifters for Women - Breast Enlargement Serum with Pure Pueraria Mirifica Oil for Breast Firming, Lifting and Fuller, Bigger Breast - Large 2oz Bottle\nReview Date: 2021/05/21\nStore: Swiss Botany\nAverage Rating: 3.1\nProduct Details: {'Product Dimensions': '2 x 3 x 4 inches; 2 Ounces', 'Manufacturer': 'Swiss Botany'}\nReview Text: Between breastfeeding and weightloss my breasts are saggy and not full.  It's been a hard adjustment.  I know no cream or non surgical option will give me results like surgery would.  The cooper's ligaments once stretched will not suddenly retract from a serum.<br />This serum is light and easy to apply.  It does not irritate my sensitive skin and leaves it moisturized.  I also use a hyaluronic serum.<br />That being said I have noticed a small improvement.  They look a little fuller, not a measurable difference but to my eye they look a little less sad.  This in theory increases estrogen activity locally to increase the fullness of the breast tissue.  This will not replace a surgical breast lift but for minor changes it works for me.\nReview Title: Subtle changes\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kidskin- Foaming Body Wash with Tea Tree Oil- Helps Combat Body and Foot Odor and Stubborn Body Acne and Skin Issues - Cruelty Free, Gluten Free, Paraben Free, Sulfate Free, Unscented, and Vegan- Made in USA\nReview Date: 2021/06/01\nStore: Kidskin\nProduct Description: ['Kidskin Foaming Body Wash with Tea Tree Oil is designed exclusively for teens, tweens, pre teens, and boys and girls to work as an effective, yet gentle body wash. Natural ingredients like Allantoin and Bisabolol nourish beyond surface level, and penetrate into the lower levels of the skin for the deepest hydration possible, while active ingredient tea tree oil works to fight body acne and skin issues teens are commonly prone to. Unlike shower bars and other soaps, our products are designed to soothe problematic and compromised skin. With 100% Natural ingredients that are paraben, sulfate, fragrance, and gluten free, the Kidskin Foaming Body Wash with Tea Tree Oil is gentle enough for every day use. Our mission is to provide teens (like our own!) with a body wash that leaves them feeling fresh and confident so they can focus on what really matters- every day. Ingredients: Water (Aqua), Cocamidopropyl Betaine, Sodium Cocoyl Glutamate, Disodium Cocoyl Glutamate, Musa Sapientum (Banana) Extract, Polysorbate-20, Sodium Lauroyl Sarcosinate, ^ Glycerin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Sea Salt (Sodium Chloride), Tetrasodium EDTA, Citric Acid, Allantoin, Bisabolol']\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Bar, Foam', 'Skin Type': 'Sensitive', 'Brand': 'Kidskin', 'Scent': 'Tea Tree', 'Material Feature': 'Cruelty Free', 'Package Dimensions': '7.83 x 2.83 x 2.24 inches; 8 Ounces', 'Item model number': '4012', 'UPC': '880628401263', 'Manufacturer': 'Kidskin'}\nReview Text: This really helped with the acne on my back and left my skin feeling smooth and healthy. It foams out of the pump with the amount I need for a single use.  I keep the cap on it when I am not using it to keep it clean.  So far it is lasting well and I have been using it for several weeks as a daily wash.  It does not dry my skin out.\nReview Title: Awesome\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: KISSNOWY Manga Lashes Natural Look , Single Individual Lashes Wispy Cluster Lashes Extension for Cosplay Japanese Anime Makeup False Lashes (F-01)\nReview Date: 2021/06/08\nStore: KISSNOWY\nAverage Rating: 4.3\nProduct Details: {'Brand': 'KISSNOWY', 'Material': 'Faux,Faux Mink,Mink', 'Item Dimensions LxWxH': '0.39 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Item model number': '6D-05', 'UPC': '608018540503 608576075066'}\nReview Text: These are on the dramatic side for me but not the most dramatic ones I've used.  They are reusable and more comfortable than I expected to wear.  They do not come with eyelash glue.  They come staged on thin white plastic that I use to store them.\nReview Title: Dramatic and easy to use\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Unicorn Snot Lightning Drops - Liquid Highlighter & Bronzer Makeup - Face, Eyeshadow, Body Shimmer & Glitter - Cruelty Free (DIVA)\nReview Date: 2021/09/07\nStore: UNICORN SNOT\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Drops,Liquid', 'Finish Type': 'Shimmery', 'Coverage': 'Light', 'Brand': 'UNICORN SNOT', 'Color': 'silver', 'Package Dimensions': '2.9 x 1.1 x 1 inches; 1.59 Ounces', 'UPC': '811935023596'}\nReview Text: I really like show sheer this unicorn snot is but it layers well for a more saturated look.  It adds a nice sheer highlight but also makes a pretty eye shadow.  I have trouble getting the product out which is really frustrating.  I've tried shaking it, tapping it on my skin etc.  Hopefully with more experience I can get better at applying these unicorn drops.  I got the Diva.\nReview Title: Hard to dispense\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ANGNYA 6Pcs Nail Art Brushes Set Gel Nail Polish Design Pen Painting Tools With Nail Extension Gel Brushs,Builder Gel Brush,Nail Art Liner Brush for Salon at Home DIY Manicure(Pink)\nReview Date: 2021/12/29\nStore: ANGNYA\nAverage Rating: 4.3\nProduct Details: {'Brand': 'ANGNYA', 'Head Material': 'Nylon', 'Unit Count': '6.00 Count', 'Package Dimensions': '9.53 x 3.7 x 0.98 inches; 3.84 Ounces'}\nReview Text: These brushes work really well.  The bristles were very stiff until the first use.  They come with covers to protect the bristles.  I noticed each had some bristles that were longer than the rest so I had to cut them down.  The handles are decent and long enough to get good manipulation.  I was able to do some fun designs on my nails with my gel polish.  I also like the variety that comes in this pack so I can find the right shaped brush for what I am trying to do.\nReview Title: Good assortment\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Premium Taza Natural Moroccan Argan Oil Rosemary Lavender Conditioner, 16 fl oz (473 ml) ♦ For Healthy, Smooth, Silky Hair ♦ Contains: Moroccan Argan Oil, Broccoli Seed Oil, Pro Vitamin B5, Hydrolyzed\nReview Date: 2022/02/19\nStore: Taza\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Taza', 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Hair Type': 'Frizzy', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.48 x 2.48 x 8.27 inches; 15.2 Ounces', 'UPC': '628451263616'}\nReview Text: I opened the bottle and noticed the product only comes up to the shoulder of the bottle which I found strange.  The bottle is sealed under the cap and has a plastic wrap on the outside of the top.  I noticed the smell right away, I really like the rosemary smell.  It felt nice in my hands and I went to distribute it in my hair  it took a lot more product than I usually use and my hair didn't feel silky like it usually does.  I really didn't like the way my hair felt when I applied it.  Once dry it doesn't weigh down my soft fine waves and still has a little of the conditioner smell which I enjoyed.  I don't think my hair is significantly less frizzy than when I use the products I usually use but my hair does seem less weighed down.  I am still on the fence on this one, maybe with more regular use I will like it more.\nReview Title: Love the smell, undecided on hair\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 8PC Lazy Bird's Nest Plate Hairpin Velvet Bird Nest Shaped Hair Clips Expandable Ponytail Holder Hair Loops Nest Plate Hairpin Hair Claw Clip barrette\nReview Date: 2022/04/29\nStore: AhkeaDirectly\nAverage Rating: 4.0\nProduct Details: {'Brand': 'AhkeaDirectly', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Resin', 'Material': 'Plastic', 'Package Dimensions': '6.02 x 5.2 x 2.32 inches; 4.16 Ounces', 'UPC': '761312153890'}\nReview Text: If you can get past the prongs on the inside I love these because they don't crimp my hair like a hair tie and are much more gentle on my hair.  It's so easy to use these to make a volume pony or even messy bun style.  I am still trying new hair styles.  I have fine hair which these are fantastic for!\nReview Title: Easy and great for fine curly hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: mold remover gel (3 Pack)\nReview Date: 2022/05/08\nStore: Yondarli\nAverage Rating: 2.9\nProduct Details: {'Brand': 'Yondarli', 'Number of Items': '3', 'Unit Count': '1.0 Fl Oz', 'Package Dimensions': '5.94 x 2.76 x 1.77 inches; 7.13 Ounces'}\nReview Text: I wore gloves to apply this because I have sensitive skin.  It was pretty easy to apply and I made sure to do so liberally.  I waited several hours before scrubbing it off and it worked quite well.  I found it easy to open and easy to apply. I did leave the fan on in the bathroom to remove odor.\nReview Title: Easy to use, wear gloves\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sunny Isle Jamaican Black Castor Oil Pure Butter infused with Tea Tree Oil, 4 Oz\nReview Date: 2022/07/04\nStore: Sunny Isle\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Sunny Isle', 'Item Form': 'Butter', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Skin Type': 'Sensitive, Dry', 'Package Dimensions': '5.67 x 3.9 x 2.56 inches; 4 Ounces', 'UPC': '850006021659', 'Manufacturer': 'JBC Distributors Inc. (Sunny Isle)'}\nReview Text: This smells like Castor oil and tea tree, no surprise there.  It is very heavy so it can weigh down hair and make it greasy and feel greasy on dry skin.  I found taking a little in my hands and rubbing vigorously before applying to warm it up helps to not use too much.  I try to melt it really good in my hands first.  It can be challenging to wash off, so use a small amount and heat it up well with your hands to get the thinnest layer possible for best results.\nReview Title: Heavy oil\nRating: 4.0\n--------------------------------------------------",
  "reference": "Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nLooks really nice.  It's easy to use and looks natural.  It has a good weight to it.  It even came with some eyelashes.\nGood color\nDreamemo 48W UV LED Nail Lamp, with 4 Timer Setting, Professional Pink Nail Dryer for Gel Nail Polish Gel Nail Starter Kit for Fingernail and Toenail Curing\nDreamemo\n{'Style': 'Traditional', 'Brand': 'Dreamemo', 'Light Source Type': 'LED', 'Wattage': '48 watts', 'Pattern': 'Solid', 'Package Dimensions': '11.26 x 8.58 x 4.37 inches; 1.63 Pounds'}\nLove this.  Great for nails and those of use who might be a little clumsy and \"miss\" the opening smearing polish on the light. Works great.  Lots of nails in it's future.\nwide opening\nSam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nSam&Helen\n{'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nI have a few friends who have tried similar products and I was curious.  The liner is thick and has almost a rubbery feel.  Even with makeup remover I found it quite challenging to remove.  Make sure to mix it before applying.  It took me three coats to get the lashes to stay.  Make sure to let it dry all the way.  The lash options are helpful to get the right look.\nchallenging to remove\nEmilia Hypoallergenic Bath Oil for Babies - Paraben-Free Natural Baby Wash Enriched With Natural Oat Extract, Sunflower, Sweet Almond, Sesame, Calendula, and Chamomile 8.5 fl.oz.\nEmilia\n{'Brand': 'Emilia', 'Scent': 'Chamomile', 'Item Form': 'Oil', 'Unit Count': '8.5 Fl Oz', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.81 x 2.05 x 1.85 inches; 8.78 Ounces'}\nI really like the smell.  It is easy to add to my daughters bath and she comes out soft and ready for night time.  It leaves her skin soft but not oily and doesn't cause her sensitive skin any trouble.\nRelaxing\nLAPOTHICELL Blemish Out Cream 50ml, Face Moisturizer, improves uneven skin tone.\nLAPOTHICELL\n{'Brand': 'LAPOTHICELL', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'Acne Prone', 'Product Dimensions': '2.36 x 2.36 x 2.36 inches; 3.42 Ounces'}\nI've fallen in love with a couple Korean beauty products so I was excited to try this one.  It came in a cute little pink box.  The outside of the container was clean.  I have combination skin and I am prone to hormonal breakouts.  Using this twice a day seems to help my blemishes heal faster and not get as bad.  My skin feels very healthy after using this regularly.  I have sensitive skin and have not had any problems.\nGreat for blemishes\nEZ Detangler Brush, Morgles 2 Pack Detangling Brush for Curly Hair Ez Hair Detangling Brush for Afro America/ African Hair 3a to 4c Wavy Hair\nMORGLES\n{'Brand': 'MORGLES', 'Shape': 'Oblong', 'Handle Material': 'Rubber', 'Unit Count': '2.00 Count', 'Hair Type': 'Curly,Wavy,Thick', 'Product Dimensions': '9.69 x 2.99 x 1.38 inches; 6.38 Ounces'}\nReally easy to use brush that is great for all hair types.  My daughter has curly hair and this brush makes it so much easier to brush her hair.  She is more willing to sit for me to brush and style her hair and doesn't complain.  Then she attempts to brush my hair (still developing that skill).\nGreat for tangly hair\nOnkessy Lip Gloss Base Primer for DIY Lip Gloss Make Your Own Lip Gloss DIY Handmade Lip Gloss Glaze Gel Waterproof Non-Stick Cup 50/80ML\nOnkessy\n{'Brand': 'Onkessy', 'Product Benefits': 'Softening,Smoothening', 'Item Form': 'Gel', 'Finish Type': 'Matte', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.43 x 3.07 x 1.26 inches; 3.21 Ounces'}\nThe volume is accurate to the ad for the lipgloss base.  It works well, I mix with Shae butter, vitamin e and pigment.  It is a good volume for my daughter and I to make homemade lipgloss but if making gifts or anything more than a handful of tunes this is a small volume.  Mine did not come with the non stick bowl the ad mentions.  It seems a little pricey but works well and my sensitive skin does not react to it.\nWorks well\nSwiss Botany Pueraria Mirifica Breast Lifters for Women - Breast Enlargement Serum with Pure Pueraria Mirifica Oil for Breast Firming, Lifting and Fuller, Bigger Breast - Large 2oz Bottle\nSwiss Botany\n{'Product Dimensions': '2 x 3 x 4 inches; 2 Ounces', 'Manufacturer': 'Swiss Botany'}\nBetween breastfeeding and weightloss my breasts are saggy and not full.  It's been a hard adjustment.  I know no cream or non surgical option will give me results like surgery would.  The cooper's ligaments once stretched will not suddenly retract from a serum.<br />This serum is light and easy to apply.  It does not irritate my sensitive skin and leaves it moisturized.  I also use a hyaluronic serum.<br />That being said I have noticed a small improvement.  They look a little fuller, not a measurable difference but to my eye they look a little less sad.  This in theory increases estrogen activity locally to increase the fullness of the breast tissue.  This will not replace a surgical breast lift but for minor changes it works for me.\nSubtle changes\nKidskin- Foaming Body Wash with Tea Tree Oil- Helps Combat Body and Foot Odor and Stubborn Body Acne and Skin Issues - Cruelty Free, Gluten Free, Paraben Free, Sulfate Free, Unscented, and Vegan- Made in USA\nKidskin\n['Kidskin Foaming Body Wash with Tea Tree Oil is designed exclusively for teens, tweens, pre teens, and boys and girls to work as an effective, yet gentle body wash. Natural ingredients like Allantoin and Bisabolol nourish beyond surface level, and penetrate into the lower levels of the skin for the deepest hydration possible, while active ingredient tea tree oil works to fight body acne and skin issues teens are commonly prone to. Unlike shower bars and other soaps, our products are designed to soothe problematic and compromised skin. With 100% Natural ingredients that are paraben, sulfate, fragrance, and gluten free, the Kidskin Foaming Body Wash with Tea Tree Oil is gentle enough for every day use. Our mission is to provide teens (like our own!) with a body wash that leaves them feeling fresh and confident so they can focus on what really matters- every day. Ingredients: Water (Aqua), Cocamidopropyl Betaine, Sodium Cocoyl Glutamate, Disodium Cocoyl Glutamate, Musa Sapientum (Banana) Extract, Polysorbate-20, Sodium Lauroyl Sarcosinate, ^ Glycerin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Sea Salt (Sodium Chloride), Tetrasodium EDTA, Citric Acid, Allantoin, Bisabolol']\n{'Item Form': 'Bar, Foam', 'Skin Type': 'Sensitive', 'Brand': 'Kidskin', 'Scent': 'Tea Tree', 'Material Feature': 'Cruelty Free', 'Package Dimensions': '7.83 x 2.83 x 2.24 inches; 8 Ounces', 'Item model number': '4012', 'UPC': '880628401263', 'Manufacturer': 'Kidskin'}\nThis really helped with the acne on my back and left my skin feeling smooth and healthy. It foams out of the pump with the amount I need for a single use.  I keep the cap on it when I am not using it to keep it clean.  So far it is lasting well and I have been using it for several weeks as a daily wash.  It does not dry my skin out.\nAwesome\nKISSNOWY Manga Lashes Natural Look , Single Individual Lashes Wispy Cluster Lashes Extension for Cosplay Japanese Anime Makeup False Lashes (F-01)\nKISSNOWY\n{'Brand': 'KISSNOWY', 'Material': 'Faux,Faux Mink,Mink', 'Item Dimensions LxWxH': '0.39 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Item model number': '6D-05', 'UPC': '608018540503 608576075066'}\nThese are on the dramatic side for me but not the most dramatic ones I've used.  They are reusable and more comfortable than I expected to wear.  They do not come with eyelash glue.  They come staged on thin white plastic that I use to store them.\nDramatic and easy to use\nUnicorn Snot Lightning Drops - Liquid Highlighter & Bronzer Makeup - Face, Eyeshadow, Body Shimmer & Glitter - Cruelty Free (DIVA)\nUNICORN SNOT\n{'Item Form': 'Drops,Liquid', 'Finish Type': 'Shimmery', 'Coverage': 'Light', 'Brand': 'UNICORN SNOT', 'Color': 'silver', 'Package Dimensions': '2.9 x 1.1 x 1 inches; 1.59 Ounces', 'UPC': '811935023596'}\nI really like show sheer this unicorn snot is but it layers well for a more saturated look.  It adds a nice sheer highlight but also makes a pretty eye shadow.  I have trouble getting the product out which is really frustrating.  I've tried shaking it, tapping it on my skin etc.  Hopefully with more experience I can get better at applying these unicorn drops.  I got the Diva.\nHard to dispense\nANGNYA 6Pcs Nail Art Brushes Set Gel Nail Polish Design Pen Painting Tools With Nail Extension Gel Brushs,Builder Gel Brush,Nail Art Liner Brush for Salon at Home DIY Manicure(Pink)\nANGNYA\n{'Brand': 'ANGNYA', 'Head Material': 'Nylon', 'Unit Count': '6.00 Count', 'Package Dimensions': '9.53 x 3.7 x 0.98 inches; 3.84 Ounces'}\nThese brushes work really well.  The bristles were very stiff until the first use.  They come with covers to protect the bristles.  I noticed each had some bristles that were longer than the rest so I had to cut them down.  The handles are decent and long enough to get good manipulation.  I was able to do some fun designs on my nails with my gel polish.  I also like the variety that comes in this pack so I can find the right shaped brush for what I am trying to do.\nGood assortment\nPremium Taza Natural Moroccan Argan Oil Rosemary Lavender Conditioner, 16 fl oz (473 ml) ♦ For Healthy, Smooth, Silky Hair ♦ Contains: Moroccan Argan Oil, Broccoli Seed Oil, Pro Vitamin B5, Hydrolyzed\nTaza\n{'Brand': 'Taza', 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Hair Type': 'Frizzy', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.48 x 2.48 x 8.27 inches; 15.2 Ounces', 'UPC': '628451263616'}\nI opened the bottle and noticed the product only comes up to the shoulder of the bottle which I found strange.  The bottle is sealed under the cap and has a plastic wrap on the outside of the top.  I noticed the smell right away, I really like the rosemary smell.  It felt nice in my hands and I went to distribute it in my hair  it took a lot more product than I usually use and my hair didn't feel silky like it usually does.  I really didn't like the way my hair felt when I applied it.  Once dry it doesn't weigh down my soft fine waves and still has a little of the conditioner smell which I enjoyed.  I don't think my hair is significantly less frizzy than when I use the products I usually use but my hair does seem less weighed down.  I am still on the fence on this one, maybe with more regular use I will like it more.\nLove the smell, undecided on hair\n8PC Lazy Bird's Nest Plate Hairpin Velvet Bird Nest Shaped Hair Clips Expandable Ponytail Holder Hair Loops Nest Plate Hairpin Hair Claw Clip barrette\nAhkeaDirectly\n{'Brand': 'AhkeaDirectly', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Resin', 'Material': 'Plastic', 'Package Dimensions': '6.02 x 5.2 x 2.32 inches; 4.16 Ounces', 'UPC': '761312153890'}\nIf you can get past the prongs on the inside I love these because they don't crimp my hair like a hair tie and are much more gentle on my hair.  It's so easy to use these to make a volume pony or even messy bun style.  I am still trying new hair styles.  I have fine hair which these are fantastic for!\nEasy and great for fine curly hair\nmold remover gel (3 Pack)\nYondarli\n{'Brand': 'Yondarli', 'Number of Items': '3', 'Unit Count': '1.0 Fl Oz', 'Package Dimensions': '5.94 x 2.76 x 1.77 inches; 7.13 Ounces'}\nI wore gloves to apply this because I have sensitive skin.  It was pretty easy to apply and I made sure to do so liberally.  I waited several hours before scrubbing it off and it worked quite well.  I found it easy to open and easy to apply. I did leave the fan on in the bathroom to remove odor.\nEasy to use, wear gloves\nSunny Isle Jamaican Black Castor Oil Pure Butter infused with Tea Tree Oil, 4 Oz\nSunny Isle\n{'Brand': 'Sunny Isle', 'Item Form': 'Butter', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Skin Type': 'Sensitive, Dry', 'Package Dimensions': '5.67 x 3.9 x 2.56 inches; 4 Ounces', 'UPC': '850006021659', 'Manufacturer': 'JBC Distributors Inc. (Sunny Isle)'}\nThis smells like Castor oil and tea tree, no surprise there.  It is very heavy so it can weigh down hair and make it greasy and feel greasy on dry skin.  I found taking a little in my hands and rubbing vigorously before applying to warm it up helps to not use too much.  I try to melt it really good in my hands first.  It can be challenging to wash off, so use a small amount and heat it up well with your hands to get the thinnest layer possible for best results.\nHeavy oil",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nReview Date: 2020/01/15\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nReview Text: Looks really nice.  It's easy to use and looks natural.  It has a good weight to it.  It even came with some eyelashes.\nReview Title: Good color\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dreamemo 48W UV LED Nail Lamp, with 4 Timer Setting, Professional Pink Nail Dryer for Gel Nail Polish Gel Nail Starter Kit for Fingernail and Toenail Curing\nReview Date: 2020/01/17\nStore: Dreamemo\nAverage Rating: 4.0\nProduct Details: {'Style': 'Traditional', 'Brand': 'Dreamemo', 'Light Source Type': 'LED', 'Wattage': '48 watts', 'Pattern': 'Solid', 'Package Dimensions': '11.26 x 8.58 x 4.37 inches; 1.63 Pounds'}\nReview Text: Love this.  Great for nails and those of use who might be a little clumsy and \"miss\" the opening smearing polish on the light. Works great.  Lots of nails in it's future.\nReview Title: wide opening\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sam&Helen Magnetic Eyelashes With Eyeliner Kit, 5Pairs Magnetic Eyelashes And 2 Tubes Magnetic Eyeliners With Eyelash Applicator-No Glue Needed\nReview Date: 2020/06/22\nStore: Sam&Helen\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Sam&Helen', 'Item Dimensions LxWxH': '5.51 x 5.71 x 0.63 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '5.51 x 5.71 x 0.63 inches; 2.4 Ounces'}\nReview Text: I have a few friends who have tried similar products and I was curious.  The liner is thick and has almost a rubbery feel.  Even with makeup remover I found it quite challenging to remove.  Make sure to mix it before applying.  It took me three coats to get the lashes to stay.  Make sure to let it dry all the way.  The lash options are helpful to get the right look.\nReview Title: challenging to remove\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Emilia Hypoallergenic Bath Oil for Babies - Paraben-Free Natural Baby Wash Enriched With Natural Oat Extract, Sunflower, Sweet Almond, Sesame, Calendula, and Chamomile 8.5 fl.oz.\nReview Date: 2020/09/02\nStore: Emilia\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Emilia', 'Scent': 'Chamomile', 'Item Form': 'Oil', 'Unit Count': '8.5 Fl Oz', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.81 x 2.05 x 1.85 inches; 8.78 Ounces'}\nReview Text: I really like the smell.  It is easy to add to my daughters bath and she comes out soft and ready for night time.  It leaves her skin soft but not oily and doesn't cause her sensitive skin any trouble.\nReview Title: Relaxing\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: LAPOTHICELL Blemish Out Cream 50ml, Face Moisturizer, improves uneven skin tone.\nReview Date: 2020/11/21\nStore: LAPOTHICELL\nAverage Rating: 3.9\nProduct Details: {'Brand': 'LAPOTHICELL', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'Acne Prone', 'Product Dimensions': '2.36 x 2.36 x 2.36 inches; 3.42 Ounces'}\nReview Text: I've fallen in love with a couple Korean beauty products so I was excited to try this one.  It came in a cute little pink box.  The outside of the container was clean.  I have combination skin and I am prone to hormonal breakouts.  Using this twice a day seems to help my blemishes heal faster and not get as bad.  My skin feels very healthy after using this regularly.  I have sensitive skin and have not had any problems.\nReview Title: Great for blemishes\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EZ Detangler Brush, Morgles 2 Pack Detangling Brush for Curly Hair Ez Hair Detangling Brush for Afro America/ African Hair 3a to 4c Wavy Hair\nReview Date: 2020/12/05\nStore: MORGLES\nAverage Rating: 3.8\nProduct Details: {'Brand': 'MORGLES', 'Shape': 'Oblong', 'Handle Material': 'Rubber', 'Unit Count': '2.00 Count', 'Hair Type': 'Curly,Wavy,Thick', 'Product Dimensions': '9.69 x 2.99 x 1.38 inches; 6.38 Ounces'}\nReview Text: Really easy to use brush that is great for all hair types.  My daughter has curly hair and this brush makes it so much easier to brush her hair.  She is more willing to sit for me to brush and style her hair and doesn't complain.  Then she attempts to brush my hair (still developing that skill).\nReview Title: Great for tangly hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Onkessy Lip Gloss Base Primer for DIY Lip Gloss Make Your Own Lip Gloss DIY Handmade Lip Gloss Glaze Gel Waterproof Non-Stick Cup 50/80ML\nReview Date: 2021/04/30\nStore: Onkessy\nAverage Rating: 3.5\nProduct Details: {'Brand': 'Onkessy', 'Product Benefits': 'Softening,Smoothening', 'Item Form': 'Gel', 'Finish Type': 'Matte', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.43 x 3.07 x 1.26 inches; 3.21 Ounces'}\nReview Text: The volume is accurate to the ad for the lipgloss base.  It works well, I mix with Shae butter, vitamin e and pigment.  It is a good volume for my daughter and I to make homemade lipgloss but if making gifts or anything more than a handful of tunes this is a small volume.  Mine did not come with the non stick bowl the ad mentions.  It seems a little pricey but works well and my sensitive skin does not react to it.\nReview Title: Works well\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Swiss Botany Pueraria Mirifica Breast Lifters for Women - Breast Enlargement Serum with Pure Pueraria Mirifica Oil for Breast Firming, Lifting and Fuller, Bigger Breast - Large 2oz Bottle\nReview Date: 2021/05/21\nStore: Swiss Botany\nAverage Rating: 3.1\nProduct Details: {'Product Dimensions': '2 x 3 x 4 inches; 2 Ounces', 'Manufacturer': 'Swiss Botany'}\nReview Text: Between breastfeeding and weightloss my breasts are saggy and not full.  It's been a hard adjustment.  I know no cream or non surgical option will give me results like surgery would.  The cooper's ligaments once stretched will not suddenly retract from a serum.<br />This serum is light and easy to apply.  It does not irritate my sensitive skin and leaves it moisturized.  I also use a hyaluronic serum.<br />That being said I have noticed a small improvement.  They look a little fuller, not a measurable difference but to my eye they look a little less sad.  This in theory increases estrogen activity locally to increase the fullness of the breast tissue.  This will not replace a surgical breast lift but for minor changes it works for me.\nReview Title: Subtle changes\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Kidskin- Foaming Body Wash with Tea Tree Oil- Helps Combat Body and Foot Odor and Stubborn Body Acne and Skin Issues - Cruelty Free, Gluten Free, Paraben Free, Sulfate Free, Unscented, and Vegan- Made in USA\nReview Date: 2021/06/01\nStore: Kidskin\nProduct Description: ['Kidskin Foaming Body Wash with Tea Tree Oil is designed exclusively for teens, tweens, pre teens, and boys and girls to work as an effective, yet gentle body wash. Natural ingredients like Allantoin and Bisabolol nourish beyond surface level, and penetrate into the lower levels of the skin for the deepest hydration possible, while active ingredient tea tree oil works to fight body acne and skin issues teens are commonly prone to. Unlike shower bars and other soaps, our products are designed to soothe problematic and compromised skin. With 100% Natural ingredients that are paraben, sulfate, fragrance, and gluten free, the Kidskin Foaming Body Wash with Tea Tree Oil is gentle enough for every day use. Our mission is to provide teens (like our own!) with a body wash that leaves them feeling fresh and confident so they can focus on what really matters- every day. Ingredients: Water (Aqua), Cocamidopropyl Betaine, Sodium Cocoyl Glutamate, Disodium Cocoyl Glutamate, Musa Sapientum (Banana) Extract, Polysorbate-20, Sodium Lauroyl Sarcosinate, ^ Glycerin, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Sea Salt (Sodium Chloride), Tetrasodium EDTA, Citric Acid, Allantoin, Bisabolol']\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Bar, Foam', 'Skin Type': 'Sensitive', 'Brand': 'Kidskin', 'Scent': 'Tea Tree', 'Material Feature': 'Cruelty Free', 'Package Dimensions': '7.83 x 2.83 x 2.24 inches; 8 Ounces', 'Item model number': '4012', 'UPC': '880628401263', 'Manufacturer': 'Kidskin'}\nReview Text: This really helped with the acne on my back and left my skin feeling smooth and healthy. It foams out of the pump with the amount I need for a single use.  I keep the cap on it when I am not using it to keep it clean.  So far it is lasting well and I have been using it for several weeks as a daily wash.  It does not dry my skin out.\nReview Title: Awesome\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: KISSNOWY Manga Lashes Natural Look , Single Individual Lashes Wispy Cluster Lashes Extension for Cosplay Japanese Anime Makeup False Lashes (F-01)\nReview Date: 2021/06/08\nStore: KISSNOWY\nAverage Rating: 4.3\nProduct Details: {'Brand': 'KISSNOWY', 'Material': 'Faux,Faux Mink,Mink', 'Item Dimensions LxWxH': '0.39 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Item model number': '6D-05', 'UPC': '608018540503 608576075066'}\nReview Text: These are on the dramatic side for me but not the most dramatic ones I've used.  They are reusable and more comfortable than I expected to wear.  They do not come with eyelash glue.  They come staged on thin white plastic that I use to store them.\nReview Title: Dramatic and easy to use\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Unicorn Snot Lightning Drops - Liquid Highlighter & Bronzer Makeup - Face, Eyeshadow, Body Shimmer & Glitter - Cruelty Free (DIVA)\nReview Date: 2021/09/07\nStore: UNICORN SNOT\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Drops,Liquid', 'Finish Type': 'Shimmery', 'Coverage': 'Light', 'Brand': 'UNICORN SNOT', 'Color': 'silver', 'Package Dimensions': '2.9 x 1.1 x 1 inches; 1.59 Ounces', 'UPC': '811935023596'}\nReview Text: I really like show sheer this unicorn snot is but it layers well for a more saturated look.  It adds a nice sheer highlight but also makes a pretty eye shadow.  I have trouble getting the product out which is really frustrating.  I've tried shaking it, tapping it on my skin etc.  Hopefully with more experience I can get better at applying these unicorn drops.  I got the Diva.\nReview Title: Hard to dispense\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ANGNYA 6Pcs Nail Art Brushes Set Gel Nail Polish Design Pen Painting Tools With Nail Extension Gel Brushs,Builder Gel Brush,Nail Art Liner Brush for Salon at Home DIY Manicure(Pink)\nReview Date: 2021/12/29\nStore: ANGNYA\nAverage Rating: 4.3\nProduct Details: {'Brand': 'ANGNYA', 'Head Material': 'Nylon', 'Unit Count': '6.00 Count', 'Package Dimensions': '9.53 x 3.7 x 0.98 inches; 3.84 Ounces'}\nReview Text: These brushes work really well.  The bristles were very stiff until the first use.  They come with covers to protect the bristles.  I noticed each had some bristles that were longer than the rest so I had to cut them down.  The handles are decent and long enough to get good manipulation.  I was able to do some fun designs on my nails with my gel polish.  I also like the variety that comes in this pack so I can find the right shaped brush for what I am trying to do.\nReview Title: Good assortment\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Premium Taza Natural Moroccan Argan Oil Rosemary Lavender Conditioner, 16 fl oz (473 ml) ♦ For Healthy, Smooth, Silky Hair ♦ Contains: Moroccan Argan Oil, Broccoli Seed Oil, Pro Vitamin B5, Hydrolyzed\nReview Date: 2022/02/19\nStore: Taza\nAverage Rating: 3.2\nProduct Details: {'Brand': 'Taza', 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Hair Type': 'Frizzy', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.48 x 2.48 x 8.27 inches; 15.2 Ounces', 'UPC': '628451263616'}\nReview Text: I opened the bottle and noticed the product only comes up to the shoulder of the bottle which I found strange.  The bottle is sealed under the cap and has a plastic wrap on the outside of the top.  I noticed the smell right away, I really like the rosemary smell.  It felt nice in my hands and I went to distribute it in my hair  it took a lot more product than I usually use and my hair didn't feel silky like it usually does.  I really didn't like the way my hair felt when I applied it.  Once dry it doesn't weigh down my soft fine waves and still has a little of the conditioner smell which I enjoyed.  I don't think my hair is significantly less frizzy than when I use the products I usually use but my hair does seem less weighed down.  I am still on the fence on this one, maybe with more regular use I will like it more.\nReview Title: Love the smell, undecided on hair\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 8PC Lazy Bird's Nest Plate Hairpin Velvet Bird Nest Shaped Hair Clips Expandable Ponytail Holder Hair Loops Nest Plate Hairpin Hair Claw Clip barrette\nReview Date: 2022/04/29\nStore: AhkeaDirectly\nAverage Rating: 4.0\nProduct Details: {'Brand': 'AhkeaDirectly', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Resin', 'Material': 'Plastic', 'Package Dimensions': '6.02 x 5.2 x 2.32 inches; 4.16 Ounces', 'UPC': '761312153890'}\nReview Text: If you can get past the prongs on the inside I love these because they don't crimp my hair like a hair tie and are much more gentle on my hair.  It's so easy to use these to make a volume pony or even messy bun style.  I am still trying new hair styles.  I have fine hair which these are fantastic for!\nReview Title: Easy and great for fine curly hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: mold remover gel (3 Pack)\nReview Date: 2022/05/08\nStore: Yondarli\nAverage Rating: 2.9\nProduct Details: {'Brand': 'Yondarli', 'Number of Items': '3', 'Unit Count': '1.0 Fl Oz', 'Package Dimensions': '5.94 x 2.76 x 1.77 inches; 7.13 Ounces'}\nReview Text: I wore gloves to apply this because I have sensitive skin.  It was pretty easy to apply and I made sure to do so liberally.  I waited several hours before scrubbing it off and it worked quite well.  I found it easy to open and easy to apply. I did leave the fan on in the bathroom to remove odor.\nReview Title: Easy to use, wear gloves\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sunny Isle Jamaican Black Castor Oil Pure Butter infused with Tea Tree Oil, 4 Oz\nReview Date: 2022/07/04\nStore: Sunny Isle\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Sunny Isle', 'Item Form': 'Butter', 'Unit Count': '4.0 Ounce', 'Number of Items': '1', 'Skin Type': 'Sensitive, Dry', 'Package Dimensions': '5.67 x 3.9 x 2.56 inches; 4 Ounces', 'UPC': '850006021659', 'Manufacturer': 'JBC Distributors Inc. (Sunny Isle)'}\nReview Text: This smells like Castor oil and tea tree, no surprise there.  It is very heavy so it can weigh down hair and make it greasy and feel greasy on dry skin.  I found taking a little in my hands and rubbing vigorously before applying to warm it up helps to not use too much.  I try to melt it really good in my hands first.  It can be challenging to wash off, so use a small amount and heat it up well with your hands to get the thinnest layer possible for best results.\nReview Title: Heavy oil\nRating: 4.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:  \nThe user has expressed satisfaction with several products, highlighting their aesthetic appeal and functionality. They appreciated the quality of items that provided ease of use, such as a nail lamp and brush set, which facilitated enjoyable DIY experiences. Products that enhanced beauty routines, including effective skincare solutions and pleasant-smelling baby bath oil, were well-received, often contributing to smooth, healthy skin. Many items were valued for their thoughtful packaging and helpful extras, fostering a positive shopping experience and results that met or exceeded expectations.\n\nNEGATIVE SUMMARY:  \nSome products did not live up to expectations and led to dissatisfaction. The user encountered challenges with removing makeup products, stating that the removal was frustrating despite their effectiveness. Additionally, inconsistencies in product experience were noted, such as a hair conditioner that felt insufficient and left the user undecided on its effectiveness. There was also feedback indicating dissatisfaction regarding certain beauty items lacking essential components as advertised, contributing to a sense of disappointment and questioning the overall value.\n\nOVERALL SUMMARY:  \nThe user's experiences reflect a mix of positive and negative outcomes across various beauty and personal care products. Many items were praised for their ease of use, delightful scents, and effective results. However, certain products raised concerns regarding functionality and discrepancies between expectations and actual performance. Overall, the user seems open to exploring new products while remaining critical of those that do not meet their standards, suggesting a balanced approach to future purchases.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Chip easily, looks gorgeous",
    "text": "I love how easy these are to use, the packaging is reminiscent of eye shadow including the applicator brush.  It is pretty easy to rub on and shin on my top coat and looks fantastic.  I make sure to apply the top coat right before applying the chrome.  After the chrome I apply a top coat twice that extends a little further than the chrome to help it stay on.  It lasts a couple days before it starts to chip on the nails I use the most.  I know I put a lot of wear on my nails but I am still sad it doesn't last longer.  I have tried a couple brands of polish and still have the chipping problem.  I am going to try other designs that doesn't have chrome near the tips and I expect that to last much longer.  I have recieved lots of compliments on my nails and I do love how the chrome looks.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61dZPBPIscL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61dZPBPIscL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61dZPBPIscL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B0B4RV6X1H",
    "parent_asin": "B0B4RV6X1H",
    "user_id": "AEORT2SOUGKL76PYWWGS4SUL3OSA_1",
    "timestamp": "2022-07-16 18:14:50.578000",
    "helpful_vote": 6,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "MRTREUP Chrome Nail Powder Palette , Metallic Mirror Effect Chrome Powder for Nails , Rose Gold Sliver Pink Holographic Nail Glitter Nail Pigment Powder for DIY Salon Nail Art Decorations",
    "average_rating": 4.3,
    "rating_number": 66,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51e5QMKvKuL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51e5QMKvKuL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81hIs+aQFFL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41WcOAlwT7L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41WcOAlwT7L.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71fqKyGZu1L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51a6N23JdKL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51a6N23JdKL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71dVP+ogTLL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51gqCOE4+zL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51gqCOE4+zL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/81PLgvZ4YeL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51JVEb+cglL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51JVEb+cglL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71Lp1CGqT1L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/519IAR2P4YL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/519IAR2P4YL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71tEWmqE-oL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/417bu+4VA3L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/417bu+4VA3L.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/718LFh9nAxL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "MRTREUP",
    "categories": [],
    "details": {
      "Package Dimensions": "5.59 x 2.05 x 0.55 inches; 1.76 Ounces"
    },
    "bought_together": null
  }
}