{
  "user_id": "AF4P6A3SEKS2HCISWAKFZVIFM7NQ",
  "summary": "=== Purchase Information ===\nProduct Title: Biutee Starry Sky Nail Gel Firework Nail Gel With black Nail Polish Gel 8ml UV LED\nReview Date: 2020/09/19\nStore: Biutee\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Biutee', 'Item Form': 'Gel', 'Type': 'Gel', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '3.5274 Ounce', 'Number of Items': '2', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '4.92 x 3.31 x 1.77 inches; 4.59 Ounces'}\nReview Text: Thank you in advance to the Amazon VINE program for providing an item to review. A positive review was not required, nor was it requested, and all words are my own.<br /><br />Getting my nails done is not just a relaxing experience, but it is also an expressive/creative one.<br /><br />Seeing this colorful and glittery set – I had to get it.<br /><br />I don’t know about others’ experiences – mine did not come with a brush or applicator for the little “gel pots”. I remembered what my nail techs used to use – small make-up brushes – and thankfully I had some. That seemed to work.<br /><br />The black polish is necessary to get the desired effect. I chose the purple glitter gel and after a few awkward moments – I got a pretty decent manicure. More of the black showed through, there were moments when the purple glitter reflected, but it wasn’t what I thought.<br /><br />I haven’t tried the other colors. But, this is fairly decent and easy to use. Not my favorite as there are other brands out there that are even easier to use.<br /><br />Overall, I’m not too unhappy with it. It’s not something I would likely purchase again.\nReview Title: Not so Starry\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: STYLEAGAL Portable Electric Nail Drill, Manicure Pedicure Drill Kit Professional nail starter kit for beginners acrylic with drill（2020 Upgraded）\nReview Date: 2020/10/03\nStore: styleagal\nAverage Rating: 4.2\nProduct Details: {'Brand': 'styleagal', 'Voltage': '5 Volts', 'Power Source': 'Battery Powered', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.8 x 4.5 x 2 inches; 8.01 Ounces', 'UPC': '782913461771', 'Manufacturer': 'STYLEAGAL'}\nReview Text: Pretty standard nail drill.<br /><br />This is similar, if not identical to most of the nail drills used in the salon.<br /><br />Best used to remove gel polishes and/or nail tips to prepare them for other polishes or plain removal.\nReview Title: Standard Nail Drill\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 20pcs Nail Tips Clips for Quick Building Polygel Nail Forms Nail Tips Clip for Finger Nail Extension DIY Manicure Nail Art Tool\nReview Date: 2020/10/07\nStore: tiggell\nAverage Rating: 4.0\nProduct Details: {'Size': '20 Count (Pack of 1)', 'Material': 'Plastic', 'Brand': 'Tiggell', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '8.98 x 6.85 x 2.2 inches; 4.16 Ounces', 'UPC': '795853588163'}\nReview Text: I mainly got these for a “home-made” gel soak off (using foil).<br /><br />And, they worked! They don’t pinch at all; even my mom used them and said she could barely feel them.<br /><br />Light weight and fairly durable. There are enough for two people to use at the same time, or extras on hand if they ever break.<br /><br />If used for poly gels, I’m sure they would work just as well.\nReview Title: Nail Clips\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Acrylic Nail Powder Set Vcedas 24 Colors Acrylic Nail Art Tips UV Gel Carving Powder Dust Design Decoration 3D Manicure\nReview Date: 2020/11/15\nStore: Vcedas\nAverage Rating: 4.0\nProduct Details: {'Product Dimensions': '5.91 x 3.94 x 0.79 inches; 1.3 Pounds'}\nReview Text: Be warned, this is NOT “dip powder”. This is indeed acrylic powder in VERY small jars.<br /><br />This does not come with instructions though – at least mine didn’t. So that could make this a bit hard to work with.<br /><br />The colors are pretty though.<br /><br />This isn’t the best kit out there, I have seen better ones. The packaging isn’t that stable or durable. I ended up putting the jars in a pencil case.<br /><br />I honestly wouldn’t get it again. As far as durability, I usually do my manicure every week or so.\nReview Title: Not The Best Set Out There\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UV LED Nail Lamp – 128W Rapid-Curing Gel Nails Dryer for Manicures and Pedicures – Dual-Voltage with Extra-Long Cable, Multi-Language Manual – Professional Gel Lamp for Homes or Salons by OVLUX, Gold\nReview Date: 2020/11/26\nStore: OVLUX\nAverage Rating: 4.3\nProduct Details: {'Brand': 'OVLUX', 'Special Feature': 'Energy Efficient', 'Light Source Type': 'LED', 'Material': 'Gel', 'Connectivity Technology': 'USB', 'Package Dimensions': '9.4 x 8.3 x 4.3 inches; 1.55 Pounds', 'UPC': '765453999881'}\nReview Text: This UV/LED lamp is by far one of the best I’ve used. I have another one by OVLUX (one of my favorites). So, when I saw this, I didn’t hesitate to get it to have on standby.<br /><br />There are a few issues with it, but I’m overall pleased.<br /><br />Very easy to use.\nReview Title: Gold Standard of Lamps\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cherry Blossom Hand & Body Sugar Polish by South of France Clean Body Care | Moisturizing Sugar Scrub for Women | Shea Butter + Sunflower Oil | 8 oz Tube\nReview Date: 2020/12/14\nStore: South of France Natural Body Care\nAverage Rating: 3.6\nProduct Details: {'Brand': 'South of France Natural Body Care', 'Product Benefits': 'Moisturizing', 'Active Ingredients': 'Shea butter', 'Material Feature': 'Gluten Free, Natural', 'Item Volume': '8 Fluid Ounces', 'Product Dimensions': '8 x 2.8 x 2 inches; 8.8 Ounces', 'UPC': '856885005148', 'Manufacturer': 'South Of France LLC'}\nReview Text: I really wanted to LOVE this scrub – there was just too much wrong with it to even LIKE it.<br /><br />First of all – this is FAR TOO THICK to squeeze out of the tube. I had to SMASH it with my arm to get it to MOVE.<br /><br />The scent? If you’re looking for Bath & Body Works type of Cherry Blossom, you’re not going to get it.<br /><br />Once you get it out, and can take the scent – after it is applied, it is a soft, moisturizing and no slip scrub.<br /><br />This isn’t something I’d get again or recommend.\nReview Title: Not The Worst, But Definitely Not The Best\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, 25mm Curling Waver Iron Hair Waver with LCD Display Adjustable Temperature 1 Inch Tourmaline Ceramic Triple Hair Crimper Hair Tools for Deep Waves All Style (1#)\nReview Date: 2021/03/14\nStore: Solati\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Solati', 'Hair Type': 'Wavy, Curly, Normal', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '210 Degrees Celsius', 'Package Dimensions': '15.94 x 4.21 x 3.5 inches; 1.54 Pounds', 'UPC': '757350981861', 'Manufacturer': 'Solati'}\nReview Text: I have been trying, for well over 30 years, to get a curling iron that actually did what it was supposed to – curl my hair.<br /><br />Hot curlers – no good results<br /><br />Curling Irons (¼, ½) – no good results<br /><br /> Wrap-Around Fabric Curlers – nothing there<br /><br />I saw this and thought it couldn’t fail. Simple to use – plug in, turn on, heat up, section hair, and use – put hair in, count down.<br /><br />Works in theory, fails in execution. First up – there is NO heat seating guide for SAFE curling. THIS DEVICE IS CELSIUS (C) ONLY, NO FARENHEIT (F) OPTION. Google is strongly needed here.<br /><br />According to Redken: “For those with fine or thin hair, keep your iron set below 200 (so below 100°C on this device) degrees Fahrenheit. Any higher and your strands may burn. For those with coarse or thicker hair, have your curling iron set between 200 degrees and 300 degrees (148.9°C or on this device 150) Fahrenheit for optimal curls” [9 Curling Iron Secrets You Need to Know About/Redken]<br /><br />Using that, as well as Glamour’s 8-10 second rule [How to Curl Your Hair Correctly: 7 Mistakes to Avoid – Glamour; “Drill it into your brain: You should hold an iron on your hair for eight to 10 seconds max”], along with using thinner groups of hair – I should have SOME wave. Nope. I even went 25 seconds. Nothing.<br /><br />As my hair has become a bit thinner, has been color treated, and exposed to SO much – I wasn’t about to turn this up hotter.<br /><br />The curler is designed much like a crimper, but the “width” can make it difficult to handle, especially by yourself. There is a “guard” which heats up as well and it is easy to burn yourself.<br /><br />It wins with innovative idea as well as the digital temp gauge. Also, it does heat up SUPER fast, as well as cool down just as fast when lowering the temp.<br /><br />For use by myself – this is a two star deal. Perhaps if someone else were around it might be easier, but this definitely did not work well.\nReview Title: Barely Made a Wave\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Toenail Clippers Set, MOMSIV 10 pcs Professional Stainless Steel Pedicure Clippers Toenail Cutters, Super Sharp Men's Nail Clippers Toenail Clippers Set for Thickness & Ingrown Hard Toenails\nReview Date: 2021/05/17\nStore: MOMSIV\nAverage Rating: 4.2\nProduct Details: {'Color': 'Upgrade Black', 'Brand': 'MOMSIV', 'Material': 'Stainless Steel', 'Blade Edge': 'Curved', 'Blade Material': 'Stainless Steel', 'Package Dimensions': '7.68 x 4.41 x 1.38 inches; 9.59 Ounces', 'Manufacturer': 'MOMSIV'}\nReview Text: Colorful manicure and pedicure kit for home, gym, or travel.<br /><br />Has most everything needed and easy to store. Love the pretty case. Price is great as well.<br /><br />Each tool is functional and works great.\nReview Title: Perfect Manicure Set\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spanature Aloe Vera Hand & Body Lotion Travel Size Selection, 4 Pack, Relaxing and Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nReview Date: 2021/07/17\nStore: Spanature\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Spanature', 'Item Form': 'Lotion', 'Unit Count': '10.1 Ounce', 'Number of Items': '4', 'Use for': 'Hands', 'Package Dimensions': '4.21 x 3.62 x 2.8 inches; 1.05 Pounds', 'UPC': '088234470585'}\nReview Text: This product as a lot going for it. I love the idea of the individually gift boxed tubes, the cap is wonderful (huge and easy to use), the product is generously sized.<br /><br />The problem is that this stuff is runny, doesn’t absorb that well on me, and the “scent” that is there – it isn’t that great.<br /><br />For $15 before tax, that is roughly $3.75 a tube, and while they’re smaller – I’d honestly stick with Bath & Body Works.<br /><br />This isn’t something I’d get again and I wouldn’t recommend it. I also wouldn’t give it as a gift.\nReview Title: It Slightly Works\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tirtyl Hand Soap Sheet Variety Pack - 240 Pack with Portable Storage Tin - Camping/Outdoor/Travel/Handbag - Lavender & Aloe - Bergamot & Ylang Ylang - Jasmine & Patchouli\nReview Date: 2021/07/20\nStore: Tirtyl\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Tirtyl', 'Scent': 'Bergamot,Lavender,Jasmine', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '240.00 Count', 'Package Dimensions': '9.88 x 6.26 x 0.75 inches; 3.21 Ounces'}\nReview Text: As most have said here – these are great for travel, especially when you can’t find soap around but have water. Though I wouldn’t carry a bar of soap, I have used “travel” size body wash as a hand soap. If it cleans the body, should clean the hands, right?<br /><br />Anyway …<br /><br />The metal container I got was dented, but that is okay as I don’t intend to travel where I won’t have soap. So, I’m using these at my bathroom sink.<br /><br />LET ME STATE THIS AS A WARNING: HANDS MUST BE DRY BEFORE GRABBING A SOAP SHEET.<br /><br />I know all caps is yelling, but trust me – it is for a VERY GOOD reason. As one reviewer said, even a drop of water can damage these.<br /><br />Basically I grab a one with dry hands, hold it in palm, turn water on, let it dissolve. Good lather, I don’t really smell a “scent”, hands wash clean. They don’t dry out, but I do use a moisturizing sanitizer, and hand lotion after.<br /><br />I wouldn’t say these go years – if you’re like me and using them as an alternative to other hand soaps to preserve waste, they might last about a month (8 washes per day, 30 days). If only as travel backup – they might last a few years. Again, it depends on how they’re used.<br /><br />I personally find them a bit on the pricey side at almost $10 before tax. That’s just me.<br /><br />I do have other soaps, and these should last me a while. I would not recommend them as a body wash. As opposed to carrying a bar of soap, try a travel container with body wash. Just my suggestion.\nReview Title: Great for Travel\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YOUNG VISION Pearl Hard Wax Beads for Hair Removal, Wax Beans 1000 g/2.2 lb/35 oz for Home Waxing, Painless Bikini&Brazilian Waxing Beads, Thick/Coarse Hair Removal Wax Kit, Sensitive Skin Friendly\nReview Date: 2021/08/07\nStore: YOUNG VISION\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Wax', 'Skin Type': 'All', 'Brand': 'YOUNG VISION', 'Unit Count': '1 Count', 'Package Dimensions': '7.99 x 6.14 x 4.88 inches; 2.72 Pounds'}\nReview Text: I think a lot of us want an easier way to remove hair. Shaving, especially for a bigger girl like me, is not that easy. It’s worse when you have long legs, short arms.<br /><br />It’s bad when you have certain chin hairs (thankfully not that much it isn’t manageable another way).<br /><br />I tried some sugar wax kit back about 20+ years ago. That was a NIGHTMARE! It was supposedly edible. I think you microwaved the container, spread it on, let it cool, used a paper strip (supplied) to remove the hair. It didn’t work and stung.<br /><br />I then moved to a hair removal cream, that partially worked.<br /><br />After that? Back to the hold stand-by –> shave foam/cream and a razor. For my main body parts, that’s always worked. Tough “chin” hairs –> using a tweezer work. No, the dermaplaning tool didn’t work on them.<br /><br />I got a wax warmer, so I thought all beads/beans were equal.<br /><br />These came with ZERO instructions, and the after spray bottle was busted. The warmer kit at least had some. And, my warmer kit had specially made, disposable “cups”.<br /><br />These beads/beans, in a smaller cup, took over 90 minute to melt. And, the warmer was on 180°(F).<br /><br />I tried a small amount on my arm. The wax was sticky, not liquidy, and it cooled almost as soon as it hit my skin.<br /><br />I let it sit there for a few minutes (over 5), and peeled the max off. It didn’t hurt, sting, or cause redness – then again …<br /><br />THE HAIR WAS STILL THERE<br /><br />Okay, so my hair on my arm is a little thin. But, if this removes thick hair, shouldn’t it remove thinner hair?<br /><br />I found another patch, got some warm wax – tried it again. Nope. Tried legs, arms, and under my chin. Nothing. Then again, I see I'm not the only one experiencing issues with these beads/beans.<br /><br />I may have gotten a bad batch. But, I definitely wouldn’t get these again.\nReview Title: Wax On, Wax Off, Hair Still There\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: FIDDY898 Gold Silver Floral Hair Comb For Bride Tiny Beaded Wedding Hair Jewelry-Silver\nReview Date: 2021/10/16\nStore: FIDDY898\nAverage Rating: 4.1\nProduct Details: {'Brand': 'FIDDY898', 'Hair Type': 'All', 'Color': 'Gold,Silver', 'Number of Items': '1', 'Package Dimensions': '5.9 x 3.9 x 2.2 inches; 2.4 Ounces', 'Item model number': 'FDSD061101'}\nReview Text: This is, for less than $10, a lovely comb.<br /><br />Can function at a wedding or other event. However, the cons outweigh the beauty.<br /><br />Given how delicate this is, there is NO storage box or bag. So, after use – where does one put it? That is an issue for me. Even a simple velvet type bag would be a good idea.<br /><br />Second? The comb itself.<br /><br />While absolutely stunning in design – function is a bit questionable because of the construction. The combs are “OPEN” design – thus loose hairs can weave in, particularly those with thick and curly hair. This makes removal or readjusting a bit difficult if not a tad uncomfortable.<br /><br />This is also for thicker hair, not thin, and thus circles back to the issue I just presented.<br /><br />While pretty, it isn’t something I am particularly pleased with. It isn’t something I would get for myself again. I also wouldn’t give it as a gift.\nReview Title: Beautiful But Need to Be Cautious When Using\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NULASTIN Skin – Gentle Exfoliating Cleanser | Invigorating Face Scrub with Caffeine, Jojoba Oil Beads, Calendula Flower Extract & Witch Hazel — For Dry, Oily & Sensitive Skin (Vegan & Cruelty-Free)\nReview Date: 2022/01/10\nStore: NULASTIN\nAverage Rating: 4.6\nProduct Details: {'Brand': 'NULASTIN', 'Item Form': 'Oil', 'Skin Type': 'Dry,All Skin Types', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Cruelty Free, Vegan', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 2.36 x 6.5 inches; 6.88 Ounces', 'UPC': '718122770717'}\nReview Text: This is an exfoliating facial cleanser that really didn't feel that great or give me that much in benefits. For $23 it is not something I'd get again or recommend. It was slightly overpriced and overhyped.\nReview Title: Underwhelming Cleanser\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UPHUNAL Handmade Short Fake Nails, Artificial False Nails, Easy To Apply And Remove, Cool Full Cover Acrylic Nails Set, Professional Press On Nails High Quality Gel Nails With Design for Women and Girls 12Pcs (Cute Pink Flower)\nReview Date: 2022/01/29\nStore: UPHUNAL\nAverage Rating: 3.3\nProduct Details: {'Material': 'Acrylic', 'Brand': 'UPHUNAL', 'Style': 'Professional', 'Coverage': 'Full Well Tips', 'Number of Pieces': '12', 'Package Dimensions': '5.51 x 3.46 x 0.94 inches; 1.2 Ounces', 'UPC': '735626305894'}\nReview Text: I honestly don’t even know WHERE to begin with this review 🤷🏻‍♀️<br /><br />I have, in my lifetime – and, wearing “fake” nails for OVER 25 YEARS – NEVER seen this type of … idea 🤦🏻‍♀️<br /><br />I’ll be as short as possible with this …<br /><br />Most anyone who hasn’t had an amputation, usually has 8 fingers and 2 thumbs – total of 10 “DIGITS” ✋🏻🤚🏻 And, in MOST cases – the nails are usually shaped the same.<br /><br />Thus, in a set of nails you’d need:<br /><br />💅🏻 2 – Thumb nails<br />💅🏻 2 – Index fingernails<br />💅🏻 2 – Middle fingernails<br />💅🏻 2 – Ring fingernails<br />💅🏻 2 – Pinkie fingernails<br /><br />I know – sounds almost silly or stupid to mention, but that’s math. Total “NAILS” needed: 10 … (“Luxury 12pcs press on nails kit comes with 10 different sizes which is pre-numbered 0-9 in a box” … “choose the most suitable size that fits you every finger”). Hard to fit every finger when the nails are different sizes.<br /><br />And, we’re NOT all sized the same. Hence why some packaging is no less than 24 nails with 12 sizes. I know because I’ve bought nails like this for YEARS! Just look up KISS and you’ll see what I am talking about.<br /><br />This?<br /><br />Was this a joke? This is a set of TWELVE (12) nails – 10 different sizes! 🤷🏻‍♀️🤦🏻‍♀️<br /><br />Unlike the model hands – I don’t wear my nails OVER the edges of my finger. That is NOT how you wear these nails to begin with – and definitely NOT with nail glue. Even being “fake”, the nails should at LEAST attempt to look realistic. See how the salons do them, look on Google (or your favorite search engine).<br /><br />Who thought this was a great idea? And, these HAVE to be the LARGEST sizes for the particular “nails” I’ve seen. These really are a fancier version of the Lee and Wet N’ Wild from the late 1980’s/early 1990’.<br /><br />What’s worse? Even the PACKAGING states: 24<br /><br />Did they not think anyone would notice that detail?<br /><br />I’ll admit, these are pretty. And, thinking it was a HALF package, I contacted Amazon for a return/replacement. I cancelled the replacement, but I am returning these. As I told the rep – they’re pretty useless as they are. There is NO way I can use these. I would, at MINIMUM, only get 4 nails worth of coverage. For this price? Nope. Not at all. And, I feel sorry for those who do have to pay.<br /><br />In addition, the nearly $16 price tag (excluding sales tax) for 12 nails? Unreasonable. In my case, I’d need TWO (2) sets which would run $32. For that price – I might as well just wear a mask, go to the salon, and have them do it for me. My nails would definitely last two weeks, and I wouldn’t have to do them myself.<br /><br />I will not be getting these again and DO NOT recommend them. The seller might have a better set out there, but not this selection.\nReview Title: Not Sure if This is a Joke\nRating: 1.0\n--------------------------------------------------",
  "reference": "Biutee Starry Sky Nail Gel Firework Nail Gel With black Nail Polish Gel 8ml UV LED\nBiutee\n{'Brand': 'Biutee', 'Item Form': 'Gel', 'Type': 'Gel', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '3.5274 Ounce', 'Number of Items': '2', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '4.92 x 3.31 x 1.77 inches; 4.59 Ounces'}\nThank you in advance to the Amazon VINE program for providing an item to review. A positive review was not required, nor was it requested, and all words are my own.<br /><br />Getting my nails done is not just a relaxing experience, but it is also an expressive/creative one.<br /><br />Seeing this colorful and glittery set – I had to get it.<br /><br />I don’t know about others’ experiences – mine did not come with a brush or applicator for the little “gel pots”. I remembered what my nail techs used to use – small make-up brushes – and thankfully I had some. That seemed to work.<br /><br />The black polish is necessary to get the desired effect. I chose the purple glitter gel and after a few awkward moments – I got a pretty decent manicure. More of the black showed through, there were moments when the purple glitter reflected, but it wasn’t what I thought.<br /><br />I haven’t tried the other colors. But, this is fairly decent and easy to use. Not my favorite as there are other brands out there that are even easier to use.<br /><br />Overall, I’m not too unhappy with it. It’s not something I would likely purchase again.\nNot so Starry\nSTYLEAGAL Portable Electric Nail Drill, Manicure Pedicure Drill Kit Professional nail starter kit for beginners acrylic with drill（2020 Upgraded）\nstyleagal\n{'Brand': 'styleagal', 'Voltage': '5 Volts', 'Power Source': 'Battery Powered', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.8 x 4.5 x 2 inches; 8.01 Ounces', 'UPC': '782913461771', 'Manufacturer': 'STYLEAGAL'}\nPretty standard nail drill.<br /><br />This is similar, if not identical to most of the nail drills used in the salon.<br /><br />Best used to remove gel polishes and/or nail tips to prepare them for other polishes or plain removal.\nStandard Nail Drill\n20pcs Nail Tips Clips for Quick Building Polygel Nail Forms Nail Tips Clip for Finger Nail Extension DIY Manicure Nail Art Tool\ntiggell\n{'Size': '20 Count (Pack of 1)', 'Material': 'Plastic', 'Brand': 'Tiggell', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '8.98 x 6.85 x 2.2 inches; 4.16 Ounces', 'UPC': '795853588163'}\nI mainly got these for a “home-made” gel soak off (using foil).<br /><br />And, they worked! They don’t pinch at all; even my mom used them and said she could barely feel them.<br /><br />Light weight and fairly durable. There are enough for two people to use at the same time, or extras on hand if they ever break.<br /><br />If used for poly gels, I’m sure they would work just as well.\nNail Clips\nAcrylic Nail Powder Set Vcedas 24 Colors Acrylic Nail Art Tips UV Gel Carving Powder Dust Design Decoration 3D Manicure\nVcedas\n{'Product Dimensions': '5.91 x 3.94 x 0.79 inches; 1.3 Pounds'}\nBe warned, this is NOT “dip powder”. This is indeed acrylic powder in VERY small jars.<br /><br />This does not come with instructions though – at least mine didn’t. So that could make this a bit hard to work with.<br /><br />The colors are pretty though.<br /><br />This isn’t the best kit out there, I have seen better ones. The packaging isn’t that stable or durable. I ended up putting the jars in a pencil case.<br /><br />I honestly wouldn’t get it again. As far as durability, I usually do my manicure every week or so.\nNot The Best Set Out There\nUV LED Nail Lamp – 128W Rapid-Curing Gel Nails Dryer for Manicures and Pedicures – Dual-Voltage with Extra-Long Cable, Multi-Language Manual – Professional Gel Lamp for Homes or Salons by OVLUX, Gold\nOVLUX\n{'Brand': 'OVLUX', 'Special Feature': 'Energy Efficient', 'Light Source Type': 'LED', 'Material': 'Gel', 'Connectivity Technology': 'USB', 'Package Dimensions': '9.4 x 8.3 x 4.3 inches; 1.55 Pounds', 'UPC': '765453999881'}\nThis UV/LED lamp is by far one of the best I’ve used. I have another one by OVLUX (one of my favorites). So, when I saw this, I didn’t hesitate to get it to have on standby.<br /><br />There are a few issues with it, but I’m overall pleased.<br /><br />Very easy to use.\nGold Standard of Lamps\nCherry Blossom Hand & Body Sugar Polish by South of France Clean Body Care | Moisturizing Sugar Scrub for Women | Shea Butter + Sunflower Oil | 8 oz Tube\nSouth of France Natural Body Care\n{'Brand': 'South of France Natural Body Care', 'Product Benefits': 'Moisturizing', 'Active Ingredients': 'Shea butter', 'Material Feature': 'Gluten Free, Natural', 'Item Volume': '8 Fluid Ounces', 'Product Dimensions': '8 x 2.8 x 2 inches; 8.8 Ounces', 'UPC': '856885005148', 'Manufacturer': 'South Of France LLC'}\nI really wanted to LOVE this scrub – there was just too much wrong with it to even LIKE it.<br /><br />First of all – this is FAR TOO THICK to squeeze out of the tube. I had to SMASH it with my arm to get it to MOVE.<br /><br />The scent? If you’re looking for Bath & Body Works type of Cherry Blossom, you’re not going to get it.<br /><br />Once you get it out, and can take the scent – after it is applied, it is a soft, moisturizing and no slip scrub.<br /><br />This isn’t something I’d get again or recommend.\nNot The Worst, But Definitely Not The Best\n3 Barrel Curling Iron, 25mm Curling Waver Iron Hair Waver with LCD Display Adjustable Temperature 1 Inch Tourmaline Ceramic Triple Hair Crimper Hair Tools for Deep Waves All Style (1#)\nSolati\n{'Brand': 'Solati', 'Hair Type': 'Wavy, Curly, Normal', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '210 Degrees Celsius', 'Package Dimensions': '15.94 x 4.21 x 3.5 inches; 1.54 Pounds', 'UPC': '757350981861', 'Manufacturer': 'Solati'}\nI have been trying, for well over 30 years, to get a curling iron that actually did what it was supposed to – curl my hair.<br /><br />Hot curlers – no good results<br /><br />Curling Irons (¼, ½) – no good results<br /><br /> Wrap-Around Fabric Curlers – nothing there<br /><br />I saw this and thought it couldn’t fail. Simple to use – plug in, turn on, heat up, section hair, and use – put hair in, count down.<br /><br />Works in theory, fails in execution. First up – there is NO heat seating guide for SAFE curling. THIS DEVICE IS CELSIUS (C) ONLY, NO FARENHEIT (F) OPTION. Google is strongly needed here.<br /><br />According to Redken: “For those with fine or thin hair, keep your iron set below 200 (so below 100°C on this device) degrees Fahrenheit. Any higher and your strands may burn. For those with coarse or thicker hair, have your curling iron set between 200 degrees and 300 degrees (148.9°C or on this device 150) Fahrenheit for optimal curls” [9 Curling Iron Secrets You Need to Know About/Redken]<br /><br />Using that, as well as Glamour’s 8-10 second rule [How to Curl Your Hair Correctly: 7 Mistakes to Avoid – Glamour; “Drill it into your brain: You should hold an iron on your hair for eight to 10 seconds max”], along with using thinner groups of hair – I should have SOME wave. Nope. I even went 25 seconds. Nothing.<br /><br />As my hair has become a bit thinner, has been color treated, and exposed to SO much – I wasn’t about to turn this up hotter.<br /><br />The curler is designed much like a crimper, but the “width” can make it difficult to handle, especially by yourself. There is a “guard” which heats up as well and it is easy to burn yourself.<br /><br />It wins with innovative idea as well as the digital temp gauge. Also, it does heat up SUPER fast, as well as cool down just as fast when lowering the temp.<br /><br />For use by myself – this is a two star deal. Perhaps if someone else were around it might be easier, but this definitely did not work well.\nBarely Made a Wave\nToenail Clippers Set, MOMSIV 10 pcs Professional Stainless Steel Pedicure Clippers Toenail Cutters, Super Sharp Men's Nail Clippers Toenail Clippers Set for Thickness & Ingrown Hard Toenails\nMOMSIV\n{'Color': 'Upgrade Black', 'Brand': 'MOMSIV', 'Material': 'Stainless Steel', 'Blade Edge': 'Curved', 'Blade Material': 'Stainless Steel', 'Package Dimensions': '7.68 x 4.41 x 1.38 inches; 9.59 Ounces', 'Manufacturer': 'MOMSIV'}\nColorful manicure and pedicure kit for home, gym, or travel.<br /><br />Has most everything needed and easy to store. Love the pretty case. Price is great as well.<br /><br />Each tool is functional and works great.\nPerfect Manicure Set\nSpanature Aloe Vera Hand & Body Lotion Travel Size Selection, 4 Pack, Relaxing and Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nSpanature\n{'Brand': 'Spanature', 'Item Form': 'Lotion', 'Unit Count': '10.1 Ounce', 'Number of Items': '4', 'Use for': 'Hands', 'Package Dimensions': '4.21 x 3.62 x 2.8 inches; 1.05 Pounds', 'UPC': '088234470585'}\nThis product as a lot going for it. I love the idea of the individually gift boxed tubes, the cap is wonderful (huge and easy to use), the product is generously sized.<br /><br />The problem is that this stuff is runny, doesn’t absorb that well on me, and the “scent” that is there – it isn’t that great.<br /><br />For $15 before tax, that is roughly $3.75 a tube, and while they’re smaller – I’d honestly stick with Bath & Body Works.<br /><br />This isn’t something I’d get again and I wouldn’t recommend it. I also wouldn’t give it as a gift.\nIt Slightly Works\nTirtyl Hand Soap Sheet Variety Pack - 240 Pack with Portable Storage Tin - Camping/Outdoor/Travel/Handbag - Lavender & Aloe - Bergamot & Ylang Ylang - Jasmine & Patchouli\nTirtyl\n{'Brand': 'Tirtyl', 'Scent': 'Bergamot,Lavender,Jasmine', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '240.00 Count', 'Package Dimensions': '9.88 x 6.26 x 0.75 inches; 3.21 Ounces'}\nAs most have said here – these are great for travel, especially when you can’t find soap around but have water. Though I wouldn’t carry a bar of soap, I have used “travel” size body wash as a hand soap. If it cleans the body, should clean the hands, right?<br /><br />Anyway …<br /><br />The metal container I got was dented, but that is okay as I don’t intend to travel where I won’t have soap. So, I’m using these at my bathroom sink.<br /><br />LET ME STATE THIS AS A WARNING: HANDS MUST BE DRY BEFORE GRABBING A SOAP SHEET.<br /><br />I know all caps is yelling, but trust me – it is for a VERY GOOD reason. As one reviewer said, even a drop of water can damage these.<br /><br />Basically I grab a one with dry hands, hold it in palm, turn water on, let it dissolve. Good lather, I don’t really smell a “scent”, hands wash clean. They don’t dry out, but I do use a moisturizing sanitizer, and hand lotion after.<br /><br />I wouldn’t say these go years – if you’re like me and using them as an alternative to other hand soaps to preserve waste, they might last about a month (8 washes per day, 30 days). If only as travel backup – they might last a few years. Again, it depends on how they’re used.<br /><br />I personally find them a bit on the pricey side at almost $10 before tax. That’s just me.<br /><br />I do have other soaps, and these should last me a while. I would not recommend them as a body wash. As opposed to carrying a bar of soap, try a travel container with body wash. Just my suggestion.\nGreat for Travel\nYOUNG VISION Pearl Hard Wax Beads for Hair Removal, Wax Beans 1000 g/2.2 lb/35 oz for Home Waxing, Painless Bikini&Brazilian Waxing Beads, Thick/Coarse Hair Removal Wax Kit, Sensitive Skin Friendly\nYOUNG VISION\n{'Item Form': 'Wax', 'Skin Type': 'All', 'Brand': 'YOUNG VISION', 'Unit Count': '1 Count', 'Package Dimensions': '7.99 x 6.14 x 4.88 inches; 2.72 Pounds'}\nI think a lot of us want an easier way to remove hair. Shaving, especially for a bigger girl like me, is not that easy. It’s worse when you have long legs, short arms.<br /><br />It’s bad when you have certain chin hairs (thankfully not that much it isn’t manageable another way).<br /><br />I tried some sugar wax kit back about 20+ years ago. That was a NIGHTMARE! It was supposedly edible. I think you microwaved the container, spread it on, let it cool, used a paper strip (supplied) to remove the hair. It didn’t work and stung.<br /><br />I then moved to a hair removal cream, that partially worked.<br /><br />After that? Back to the hold stand-by –> shave foam/cream and a razor. For my main body parts, that’s always worked. Tough “chin” hairs –> using a tweezer work. No, the dermaplaning tool didn’t work on them.<br /><br />I got a wax warmer, so I thought all beads/beans were equal.<br /><br />These came with ZERO instructions, and the after spray bottle was busted. The warmer kit at least had some. And, my warmer kit had specially made, disposable “cups”.<br /><br />These beads/beans, in a smaller cup, took over 90 minute to melt. And, the warmer was on 180°(F).<br /><br />I tried a small amount on my arm. The wax was sticky, not liquidy, and it cooled almost as soon as it hit my skin.<br /><br />I let it sit there for a few minutes (over 5), and peeled the max off. It didn’t hurt, sting, or cause redness – then again …<br /><br />THE HAIR WAS STILL THERE<br /><br />Okay, so my hair on my arm is a little thin. But, if this removes thick hair, shouldn’t it remove thinner hair?<br /><br />I found another patch, got some warm wax – tried it again. Nope. Tried legs, arms, and under my chin. Nothing. Then again, I see I'm not the only one experiencing issues with these beads/beans.<br /><br />I may have gotten a bad batch. But, I definitely wouldn’t get these again.\nWax On, Wax Off, Hair Still There\nFIDDY898 Gold Silver Floral Hair Comb For Bride Tiny Beaded Wedding Hair Jewelry-Silver\nFIDDY898\n{'Brand': 'FIDDY898', 'Hair Type': 'All', 'Color': 'Gold,Silver', 'Number of Items': '1', 'Package Dimensions': '5.9 x 3.9 x 2.2 inches; 2.4 Ounces', 'Item model number': 'FDSD061101'}\nThis is, for less than $10, a lovely comb.<br /><br />Can function at a wedding or other event. However, the cons outweigh the beauty.<br /><br />Given how delicate this is, there is NO storage box or bag. So, after use – where does one put it? That is an issue for me. Even a simple velvet type bag would be a good idea.<br /><br />Second? The comb itself.<br /><br />While absolutely stunning in design – function is a bit questionable because of the construction. The combs are “OPEN” design – thus loose hairs can weave in, particularly those with thick and curly hair. This makes removal or readjusting a bit difficult if not a tad uncomfortable.<br /><br />This is also for thicker hair, not thin, and thus circles back to the issue I just presented.<br /><br />While pretty, it isn’t something I am particularly pleased with. It isn’t something I would get for myself again. I also wouldn’t give it as a gift.\nBeautiful But Need to Be Cautious When Using\nNULASTIN Skin – Gentle Exfoliating Cleanser | Invigorating Face Scrub with Caffeine, Jojoba Oil Beads, Calendula Flower Extract & Witch Hazel — For Dry, Oily & Sensitive Skin (Vegan & Cruelty-Free)\nNULASTIN\n{'Brand': 'NULASTIN', 'Item Form': 'Oil', 'Skin Type': 'Dry,All Skin Types', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Cruelty Free, Vegan', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 2.36 x 6.5 inches; 6.88 Ounces', 'UPC': '718122770717'}\nThis is an exfoliating facial cleanser that really didn't feel that great or give me that much in benefits. For $23 it is not something I'd get again or recommend. It was slightly overpriced and overhyped.\nUnderwhelming Cleanser\nUPHUNAL Handmade Short Fake Nails, Artificial False Nails, Easy To Apply And Remove, Cool Full Cover Acrylic Nails Set, Professional Press On Nails High Quality Gel Nails With Design for Women and Girls 12Pcs (Cute Pink Flower)\nUPHUNAL\n{'Material': 'Acrylic', 'Brand': 'UPHUNAL', 'Style': 'Professional', 'Coverage': 'Full Well Tips', 'Number of Pieces': '12', 'Package Dimensions': '5.51 x 3.46 x 0.94 inches; 1.2 Ounces', 'UPC': '735626305894'}\nI honestly don’t even know WHERE to begin with this review 🤷🏻‍♀️<br /><br />I have, in my lifetime – and, wearing “fake” nails for OVER 25 YEARS – NEVER seen this type of … idea 🤦🏻‍♀️<br /><br />I’ll be as short as possible with this …<br /><br />Most anyone who hasn’t had an amputation, usually has 8 fingers and 2 thumbs – total of 10 “DIGITS” ✋🏻🤚🏻 And, in MOST cases – the nails are usually shaped the same.<br /><br />Thus, in a set of nails you’d need:<br /><br />💅🏻 2 – Thumb nails<br />💅🏻 2 – Index fingernails<br />💅🏻 2 – Middle fingernails<br />💅🏻 2 – Ring fingernails<br />💅🏻 2 – Pinkie fingernails<br /><br />I know – sounds almost silly or stupid to mention, but that’s math. Total “NAILS” needed: 10 … (“Luxury 12pcs press on nails kit comes with 10 different sizes which is pre-numbered 0-9 in a box” … “choose the most suitable size that fits you every finger”). Hard to fit every finger when the nails are different sizes.<br /><br />And, we’re NOT all sized the same. Hence why some packaging is no less than 24 nails with 12 sizes. I know because I’ve bought nails like this for YEARS! Just look up KISS and you’ll see what I am talking about.<br /><br />This?<br /><br />Was this a joke? This is a set of TWELVE (12) nails – 10 different sizes! 🤷🏻‍♀️🤦🏻‍♀️<br /><br />Unlike the model hands – I don’t wear my nails OVER the edges of my finger. That is NOT how you wear these nails to begin with – and definitely NOT with nail glue. Even being “fake”, the nails should at LEAST attempt to look realistic. See how the salons do them, look on Google (or your favorite search engine).<br /><br />Who thought this was a great idea? And, these HAVE to be the LARGEST sizes for the particular “nails” I’ve seen. These really are a fancier version of the Lee and Wet N’ Wild from the late 1980’s/early 1990’.<br /><br />What’s worse? Even the PACKAGING states: 24<br /><br />Did they not think anyone would notice that detail?<br /><br />I’ll admit, these are pretty. And, thinking it was a HALF package, I contacted Amazon for a return/replacement. I cancelled the replacement, but I am returning these. As I told the rep – they’re pretty useless as they are. There is NO way I can use these. I would, at MINIMUM, only get 4 nails worth of coverage. For this price? Nope. Not at all. And, I feel sorry for those who do have to pay.<br /><br />In addition, the nearly $16 price tag (excluding sales tax) for 12 nails? Unreasonable. In my case, I’d need TWO (2) sets which would run $32. For that price – I might as well just wear a mask, go to the salon, and have them do it for me. My nails would definitely last two weeks, and I wouldn’t have to do them myself.<br /><br />I will not be getting these again and DO NOT recommend them. The seller might have a better set out there, but not this selection.\nNot Sure if This is a Joke",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Biutee Starry Sky Nail Gel Firework Nail Gel With black Nail Polish Gel 8ml UV LED\nReview Date: 2020/09/19\nStore: Biutee\nAverage Rating: 4.1\nProduct Details: {'Brand': 'Biutee', 'Item Form': 'Gel', 'Type': 'Gel', 'Material Feature': 'Non-Toxic, Cruelty Free', 'Age Range (Description)': 'Adult', 'Unit Count': '3.5274 Ounce', 'Number of Items': '2', 'Liquid Volume': '0.27 Fluid Ounces', 'Package Dimensions': '4.92 x 3.31 x 1.77 inches; 4.59 Ounces'}\nReview Text: Thank you in advance to the Amazon VINE program for providing an item to review. A positive review was not required, nor was it requested, and all words are my own.<br /><br />Getting my nails done is not just a relaxing experience, but it is also an expressive/creative one.<br /><br />Seeing this colorful and glittery set – I had to get it.<br /><br />I don’t know about others’ experiences – mine did not come with a brush or applicator for the little “gel pots”. I remembered what my nail techs used to use – small make-up brushes – and thankfully I had some. That seemed to work.<br /><br />The black polish is necessary to get the desired effect. I chose the purple glitter gel and after a few awkward moments – I got a pretty decent manicure. More of the black showed through, there were moments when the purple glitter reflected, but it wasn’t what I thought.<br /><br />I haven’t tried the other colors. But, this is fairly decent and easy to use. Not my favorite as there are other brands out there that are even easier to use.<br /><br />Overall, I’m not too unhappy with it. It’s not something I would likely purchase again.\nReview Title: Not so Starry\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: STYLEAGAL Portable Electric Nail Drill, Manicure Pedicure Drill Kit Professional nail starter kit for beginners acrylic with drill（2020 Upgraded）\nReview Date: 2020/10/03\nStore: styleagal\nAverage Rating: 4.2\nProduct Details: {'Brand': 'styleagal', 'Voltage': '5 Volts', 'Power Source': 'Battery Powered', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.8 x 4.5 x 2 inches; 8.01 Ounces', 'UPC': '782913461771', 'Manufacturer': 'STYLEAGAL'}\nReview Text: Pretty standard nail drill.<br /><br />This is similar, if not identical to most of the nail drills used in the salon.<br /><br />Best used to remove gel polishes and/or nail tips to prepare them for other polishes or plain removal.\nReview Title: Standard Nail Drill\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 20pcs Nail Tips Clips for Quick Building Polygel Nail Forms Nail Tips Clip for Finger Nail Extension DIY Manicure Nail Art Tool\nReview Date: 2020/10/07\nStore: tiggell\nAverage Rating: 4.0\nProduct Details: {'Size': '20 Count (Pack of 1)', 'Material': 'Plastic', 'Brand': 'Tiggell', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Package Dimensions': '8.98 x 6.85 x 2.2 inches; 4.16 Ounces', 'UPC': '795853588163'}\nReview Text: I mainly got these for a “home-made” gel soak off (using foil).<br /><br />And, they worked! They don’t pinch at all; even my mom used them and said she could barely feel them.<br /><br />Light weight and fairly durable. There are enough for two people to use at the same time, or extras on hand if they ever break.<br /><br />If used for poly gels, I’m sure they would work just as well.\nReview Title: Nail Clips\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Acrylic Nail Powder Set Vcedas 24 Colors Acrylic Nail Art Tips UV Gel Carving Powder Dust Design Decoration 3D Manicure\nReview Date: 2020/11/15\nStore: Vcedas\nAverage Rating: 4.0\nProduct Details: {'Product Dimensions': '5.91 x 3.94 x 0.79 inches; 1.3 Pounds'}\nReview Text: Be warned, this is NOT “dip powder”. This is indeed acrylic powder in VERY small jars.<br /><br />This does not come with instructions though – at least mine didn’t. So that could make this a bit hard to work with.<br /><br />The colors are pretty though.<br /><br />This isn’t the best kit out there, I have seen better ones. The packaging isn’t that stable or durable. I ended up putting the jars in a pencil case.<br /><br />I honestly wouldn’t get it again. As far as durability, I usually do my manicure every week or so.\nReview Title: Not The Best Set Out There\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UV LED Nail Lamp – 128W Rapid-Curing Gel Nails Dryer for Manicures and Pedicures – Dual-Voltage with Extra-Long Cable, Multi-Language Manual – Professional Gel Lamp for Homes or Salons by OVLUX, Gold\nReview Date: 2020/11/26\nStore: OVLUX\nAverage Rating: 4.3\nProduct Details: {'Brand': 'OVLUX', 'Special Feature': 'Energy Efficient', 'Light Source Type': 'LED', 'Material': 'Gel', 'Connectivity Technology': 'USB', 'Package Dimensions': '9.4 x 8.3 x 4.3 inches; 1.55 Pounds', 'UPC': '765453999881'}\nReview Text: This UV/LED lamp is by far one of the best I’ve used. I have another one by OVLUX (one of my favorites). So, when I saw this, I didn’t hesitate to get it to have on standby.<br /><br />There are a few issues with it, but I’m overall pleased.<br /><br />Very easy to use.\nReview Title: Gold Standard of Lamps\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Cherry Blossom Hand & Body Sugar Polish by South of France Clean Body Care | Moisturizing Sugar Scrub for Women | Shea Butter + Sunflower Oil | 8 oz Tube\nReview Date: 2020/12/14\nStore: South of France Natural Body Care\nAverage Rating: 3.6\nProduct Details: {'Brand': 'South of France Natural Body Care', 'Product Benefits': 'Moisturizing', 'Active Ingredients': 'Shea butter', 'Material Feature': 'Gluten Free, Natural', 'Item Volume': '8 Fluid Ounces', 'Product Dimensions': '8 x 2.8 x 2 inches; 8.8 Ounces', 'UPC': '856885005148', 'Manufacturer': 'South Of France LLC'}\nReview Text: I really wanted to LOVE this scrub – there was just too much wrong with it to even LIKE it.<br /><br />First of all – this is FAR TOO THICK to squeeze out of the tube. I had to SMASH it with my arm to get it to MOVE.<br /><br />The scent? If you’re looking for Bath & Body Works type of Cherry Blossom, you’re not going to get it.<br /><br />Once you get it out, and can take the scent – after it is applied, it is a soft, moisturizing and no slip scrub.<br /><br />This isn’t something I’d get again or recommend.\nReview Title: Not The Worst, But Definitely Not The Best\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, 25mm Curling Waver Iron Hair Waver with LCD Display Adjustable Temperature 1 Inch Tourmaline Ceramic Triple Hair Crimper Hair Tools for Deep Waves All Style (1#)\nReview Date: 2021/03/14\nStore: Solati\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Solati', 'Hair Type': 'Wavy, Curly, Normal', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '210 Degrees Celsius', 'Package Dimensions': '15.94 x 4.21 x 3.5 inches; 1.54 Pounds', 'UPC': '757350981861', 'Manufacturer': 'Solati'}\nReview Text: I have been trying, for well over 30 years, to get a curling iron that actually did what it was supposed to – curl my hair.<br /><br />Hot curlers – no good results<br /><br />Curling Irons (¼, ½) – no good results<br /><br /> Wrap-Around Fabric Curlers – nothing there<br /><br />I saw this and thought it couldn’t fail. Simple to use – plug in, turn on, heat up, section hair, and use – put hair in, count down.<br /><br />Works in theory, fails in execution. First up – there is NO heat seating guide for SAFE curling. THIS DEVICE IS CELSIUS (C) ONLY, NO FARENHEIT (F) OPTION. Google is strongly needed here.<br /><br />According to Redken: “For those with fine or thin hair, keep your iron set below 200 (so below 100°C on this device) degrees Fahrenheit. Any higher and your strands may burn. For those with coarse or thicker hair, have your curling iron set between 200 degrees and 300 degrees (148.9°C or on this device 150) Fahrenheit for optimal curls” [9 Curling Iron Secrets You Need to Know About/Redken]<br /><br />Using that, as well as Glamour’s 8-10 second rule [How to Curl Your Hair Correctly: 7 Mistakes to Avoid – Glamour; “Drill it into your brain: You should hold an iron on your hair for eight to 10 seconds max”], along with using thinner groups of hair – I should have SOME wave. Nope. I even went 25 seconds. Nothing.<br /><br />As my hair has become a bit thinner, has been color treated, and exposed to SO much – I wasn’t about to turn this up hotter.<br /><br />The curler is designed much like a crimper, but the “width” can make it difficult to handle, especially by yourself. There is a “guard” which heats up as well and it is easy to burn yourself.<br /><br />It wins with innovative idea as well as the digital temp gauge. Also, it does heat up SUPER fast, as well as cool down just as fast when lowering the temp.<br /><br />For use by myself – this is a two star deal. Perhaps if someone else were around it might be easier, but this definitely did not work well.\nReview Title: Barely Made a Wave\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Toenail Clippers Set, MOMSIV 10 pcs Professional Stainless Steel Pedicure Clippers Toenail Cutters, Super Sharp Men's Nail Clippers Toenail Clippers Set for Thickness & Ingrown Hard Toenails\nReview Date: 2021/05/17\nStore: MOMSIV\nAverage Rating: 4.2\nProduct Details: {'Color': 'Upgrade Black', 'Brand': 'MOMSIV', 'Material': 'Stainless Steel', 'Blade Edge': 'Curved', 'Blade Material': 'Stainless Steel', 'Package Dimensions': '7.68 x 4.41 x 1.38 inches; 9.59 Ounces', 'Manufacturer': 'MOMSIV'}\nReview Text: Colorful manicure and pedicure kit for home, gym, or travel.<br /><br />Has most everything needed and easy to store. Love the pretty case. Price is great as well.<br /><br />Each tool is functional and works great.\nReview Title: Perfect Manicure Set\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spanature Aloe Vera Hand & Body Lotion Travel Size Selection, 4 Pack, Relaxing and Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nReview Date: 2021/07/17\nStore: Spanature\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Spanature', 'Item Form': 'Lotion', 'Unit Count': '10.1 Ounce', 'Number of Items': '4', 'Use for': 'Hands', 'Package Dimensions': '4.21 x 3.62 x 2.8 inches; 1.05 Pounds', 'UPC': '088234470585'}\nReview Text: This product as a lot going for it. I love the idea of the individually gift boxed tubes, the cap is wonderful (huge and easy to use), the product is generously sized.<br /><br />The problem is that this stuff is runny, doesn’t absorb that well on me, and the “scent” that is there – it isn’t that great.<br /><br />For $15 before tax, that is roughly $3.75 a tube, and while they’re smaller – I’d honestly stick with Bath & Body Works.<br /><br />This isn’t something I’d get again and I wouldn’t recommend it. I also wouldn’t give it as a gift.\nReview Title: It Slightly Works\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Tirtyl Hand Soap Sheet Variety Pack - 240 Pack with Portable Storage Tin - Camping/Outdoor/Travel/Handbag - Lavender & Aloe - Bergamot & Ylang Ylang - Jasmine & Patchouli\nReview Date: 2021/07/20\nStore: Tirtyl\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Tirtyl', 'Scent': 'Bergamot,Lavender,Jasmine', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '240.00 Count', 'Package Dimensions': '9.88 x 6.26 x 0.75 inches; 3.21 Ounces'}\nReview Text: As most have said here – these are great for travel, especially when you can’t find soap around but have water. Though I wouldn’t carry a bar of soap, I have used “travel” size body wash as a hand soap. If it cleans the body, should clean the hands, right?<br /><br />Anyway …<br /><br />The metal container I got was dented, but that is okay as I don’t intend to travel where I won’t have soap. So, I’m using these at my bathroom sink.<br /><br />LET ME STATE THIS AS A WARNING: HANDS MUST BE DRY BEFORE GRABBING A SOAP SHEET.<br /><br />I know all caps is yelling, but trust me – it is for a VERY GOOD reason. As one reviewer said, even a drop of water can damage these.<br /><br />Basically I grab a one with dry hands, hold it in palm, turn water on, let it dissolve. Good lather, I don’t really smell a “scent”, hands wash clean. They don’t dry out, but I do use a moisturizing sanitizer, and hand lotion after.<br /><br />I wouldn’t say these go years – if you’re like me and using them as an alternative to other hand soaps to preserve waste, they might last about a month (8 washes per day, 30 days). If only as travel backup – they might last a few years. Again, it depends on how they’re used.<br /><br />I personally find them a bit on the pricey side at almost $10 before tax. That’s just me.<br /><br />I do have other soaps, and these should last me a while. I would not recommend them as a body wash. As opposed to carrying a bar of soap, try a travel container with body wash. Just my suggestion.\nReview Title: Great for Travel\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: YOUNG VISION Pearl Hard Wax Beads for Hair Removal, Wax Beans 1000 g/2.2 lb/35 oz for Home Waxing, Painless Bikini&Brazilian Waxing Beads, Thick/Coarse Hair Removal Wax Kit, Sensitive Skin Friendly\nReview Date: 2021/08/07\nStore: YOUNG VISION\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Wax', 'Skin Type': 'All', 'Brand': 'YOUNG VISION', 'Unit Count': '1 Count', 'Package Dimensions': '7.99 x 6.14 x 4.88 inches; 2.72 Pounds'}\nReview Text: I think a lot of us want an easier way to remove hair. Shaving, especially for a bigger girl like me, is not that easy. It’s worse when you have long legs, short arms.<br /><br />It’s bad when you have certain chin hairs (thankfully not that much it isn’t manageable another way).<br /><br />I tried some sugar wax kit back about 20+ years ago. That was a NIGHTMARE! It was supposedly edible. I think you microwaved the container, spread it on, let it cool, used a paper strip (supplied) to remove the hair. It didn’t work and stung.<br /><br />I then moved to a hair removal cream, that partially worked.<br /><br />After that? Back to the hold stand-by –> shave foam/cream and a razor. For my main body parts, that’s always worked. Tough “chin” hairs –> using a tweezer work. No, the dermaplaning tool didn’t work on them.<br /><br />I got a wax warmer, so I thought all beads/beans were equal.<br /><br />These came with ZERO instructions, and the after spray bottle was busted. The warmer kit at least had some. And, my warmer kit had specially made, disposable “cups”.<br /><br />These beads/beans, in a smaller cup, took over 90 minute to melt. And, the warmer was on 180°(F).<br /><br />I tried a small amount on my arm. The wax was sticky, not liquidy, and it cooled almost as soon as it hit my skin.<br /><br />I let it sit there for a few minutes (over 5), and peeled the max off. It didn’t hurt, sting, or cause redness – then again …<br /><br />THE HAIR WAS STILL THERE<br /><br />Okay, so my hair on my arm is a little thin. But, if this removes thick hair, shouldn’t it remove thinner hair?<br /><br />I found another patch, got some warm wax – tried it again. Nope. Tried legs, arms, and under my chin. Nothing. Then again, I see I'm not the only one experiencing issues with these beads/beans.<br /><br />I may have gotten a bad batch. But, I definitely wouldn’t get these again.\nReview Title: Wax On, Wax Off, Hair Still There\nRating: 1.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: FIDDY898 Gold Silver Floral Hair Comb For Bride Tiny Beaded Wedding Hair Jewelry-Silver\nReview Date: 2021/10/16\nStore: FIDDY898\nAverage Rating: 4.1\nProduct Details: {'Brand': 'FIDDY898', 'Hair Type': 'All', 'Color': 'Gold,Silver', 'Number of Items': '1', 'Package Dimensions': '5.9 x 3.9 x 2.2 inches; 2.4 Ounces', 'Item model number': 'FDSD061101'}\nReview Text: This is, for less than $10, a lovely comb.<br /><br />Can function at a wedding or other event. However, the cons outweigh the beauty.<br /><br />Given how delicate this is, there is NO storage box or bag. So, after use – where does one put it? That is an issue for me. Even a simple velvet type bag would be a good idea.<br /><br />Second? The comb itself.<br /><br />While absolutely stunning in design – function is a bit questionable because of the construction. The combs are “OPEN” design – thus loose hairs can weave in, particularly those with thick and curly hair. This makes removal or readjusting a bit difficult if not a tad uncomfortable.<br /><br />This is also for thicker hair, not thin, and thus circles back to the issue I just presented.<br /><br />While pretty, it isn’t something I am particularly pleased with. It isn’t something I would get for myself again. I also wouldn’t give it as a gift.\nReview Title: Beautiful But Need to Be Cautious When Using\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NULASTIN Skin – Gentle Exfoliating Cleanser | Invigorating Face Scrub with Caffeine, Jojoba Oil Beads, Calendula Flower Extract & Witch Hazel — For Dry, Oily & Sensitive Skin (Vegan & Cruelty-Free)\nReview Date: 2022/01/10\nStore: NULASTIN\nAverage Rating: 4.6\nProduct Details: {'Brand': 'NULASTIN', 'Item Form': 'Oil', 'Skin Type': 'Dry,All Skin Types', 'Product Benefits': 'Exfoliating', 'Material Feature': 'Cruelty Free, Vegan', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 2.36 x 6.5 inches; 6.88 Ounces', 'UPC': '718122770717'}\nReview Text: This is an exfoliating facial cleanser that really didn't feel that great or give me that much in benefits. For $23 it is not something I'd get again or recommend. It was slightly overpriced and overhyped.\nReview Title: Underwhelming Cleanser\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: UPHUNAL Handmade Short Fake Nails, Artificial False Nails, Easy To Apply And Remove, Cool Full Cover Acrylic Nails Set, Professional Press On Nails High Quality Gel Nails With Design for Women and Girls 12Pcs (Cute Pink Flower)\nReview Date: 2022/01/29\nStore: UPHUNAL\nAverage Rating: 3.3\nProduct Details: {'Material': 'Acrylic', 'Brand': 'UPHUNAL', 'Style': 'Professional', 'Coverage': 'Full Well Tips', 'Number of Pieces': '12', 'Package Dimensions': '5.51 x 3.46 x 0.94 inches; 1.2 Ounces', 'UPC': '735626305894'}\nReview Text: I honestly don’t even know WHERE to begin with this review 🤷🏻‍♀️<br /><br />I have, in my lifetime – and, wearing “fake” nails for OVER 25 YEARS – NEVER seen this type of … idea 🤦🏻‍♀️<br /><br />I’ll be as short as possible with this …<br /><br />Most anyone who hasn’t had an amputation, usually has 8 fingers and 2 thumbs – total of 10 “DIGITS” ✋🏻🤚🏻 And, in MOST cases – the nails are usually shaped the same.<br /><br />Thus, in a set of nails you’d need:<br /><br />💅🏻 2 – Thumb nails<br />💅🏻 2 – Index fingernails<br />💅🏻 2 – Middle fingernails<br />💅🏻 2 – Ring fingernails<br />💅🏻 2 – Pinkie fingernails<br /><br />I know – sounds almost silly or stupid to mention, but that’s math. Total “NAILS” needed: 10 … (“Luxury 12pcs press on nails kit comes with 10 different sizes which is pre-numbered 0-9 in a box” … “choose the most suitable size that fits you every finger”). Hard to fit every finger when the nails are different sizes.<br /><br />And, we’re NOT all sized the same. Hence why some packaging is no less than 24 nails with 12 sizes. I know because I’ve bought nails like this for YEARS! Just look up KISS and you’ll see what I am talking about.<br /><br />This?<br /><br />Was this a joke? This is a set of TWELVE (12) nails – 10 different sizes! 🤷🏻‍♀️🤦🏻‍♀️<br /><br />Unlike the model hands – I don’t wear my nails OVER the edges of my finger. That is NOT how you wear these nails to begin with – and definitely NOT with nail glue. Even being “fake”, the nails should at LEAST attempt to look realistic. See how the salons do them, look on Google (or your favorite search engine).<br /><br />Who thought this was a great idea? And, these HAVE to be the LARGEST sizes for the particular “nails” I’ve seen. These really are a fancier version of the Lee and Wet N’ Wild from the late 1980’s/early 1990’.<br /><br />What’s worse? Even the PACKAGING states: 24<br /><br />Did they not think anyone would notice that detail?<br /><br />I’ll admit, these are pretty. And, thinking it was a HALF package, I contacted Amazon for a return/replacement. I cancelled the replacement, but I am returning these. As I told the rep – they’re pretty useless as they are. There is NO way I can use these. I would, at MINIMUM, only get 4 nails worth of coverage. For this price? Nope. Not at all. And, I feel sorry for those who do have to pay.<br /><br />In addition, the nearly $16 price tag (excluding sales tax) for 12 nails? Unreasonable. In my case, I’d need TWO (2) sets which would run $32. For that price – I might as well just wear a mask, go to the salon, and have them do it for me. My nails would definitely last two weeks, and I wouldn’t have to do them myself.<br /><br />I will not be getting these again and DO NOT recommend them. The seller might have a better set out there, but not this selection.\nReview Title: Not Sure if This is a Joke\nRating: 1.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has had several favorable experiences with various beauty products, particularly nail care items and tools. Most noteworthy was a UV/LED lamp praised for its effectiveness and ease of use, highlighting the positive impact of this purchase on their nail care routine. The manicure set was also appreciated for its functionality and pretty packaging, indicating satisfaction with the quality and aesthetics of the products. Additionally, a set of nail tips clips received positive feedback for their durability and comfort during use, enhancing the overall home manicure experience.\n\nNEGATIVE SUMMARY:\nThe user encountered multiple disappointing experiences, especially with products that fell short of expectations. Several items, such as a hair removal wax kit and artificial nails, were criticized for poor performance and impractical design features. The wax lacked effectiveness and directions, while the nails were unsuitable due to sizing discrepancies, leading to frustration. A sugar scrub was described as excessively thick and difficult to use, further reflecting dissatisfaction, and the price point of many items was viewed as unjustifiable, with several products described as overpriced compared to their performance.\n\nOVERALL SUMMARY:\nThe user’s shopping journey includes a mix of positive and negative experiences across various beauty products. While they found some items, like a UV/LED lamp and manicure tools, to be helpful and satisfactory, many others were marked by issues related to effectiveness, functionality, and value. There is a clear trend of the user being critical towards products that do not perform as expected or do not meet industry standards, leading to a reluctance to repurchase these items. Overall, while there are bright spots in their experience, significant frustrations remain prevalent.",
  "target_interaction": {
    "rating": 3.0,
    "title": "Suited More for 6+ and Older",
    "text": "A few things here …<br /><br />LES ENFANTS is French for CHILDREN<br /><br />It doesn’t refer to infants or toddlers. For those who don’t know, a quick note …<br /><br />Newborn – birth to 4 weeks<br />Infants – 4 weeks to 1 year<br />Toddler – 1-3<br />Preschooler – 3-5<br />Child – 6-13<br /><br />That said …<br /><br />It does state NOT TO SPRAY IT ON A BABY’S SKIN. “Applying gently on clothes” is the preferred method. Though to be honest, I’d say this is more for ages 6+<br /><br />While baby cologne isn’t something I would use on a baby, it could be better for adults who want a light scent and not overwhelmed by a perfume.<br /><br />For almost $30, this is an 8.5 fl oz spray. Compared to some perfumes and colognes, this is moderately priced.<br /><br />Smell? It isn’t the greatest. I do like it as a light, after-bathing scent. It seems more suited to a room freshener than a perfume. But, it isn’t the WORST perfume/scent I’ve smelled.<br /><br />The generous size means it will last a while.<br /><br />Would I get it again? No. Nor would I recommend it either.",
    "images": [],
    "asin": "B09G3LCKNN",
    "parent_asin": "B09G3KBK7Y",
    "user_id": "AF4P6A3SEKS2HCISWAKFZVIFM7NQ",
    "timestamp": "2022-04-05 00:46:26.038000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Boiess Colognes Poppy mint For Moms, Babies & Kids | Natural Eau de Cologne | Clean & Fresh Scent | Children Fragrance For Soft & Sensitive Skin | Easy Use, Gentle on Baby | Size: 8.5 FL Oz",
    "average_rating": 3.7,
    "rating_number": 14,
    "features": [
      "FRESH, GENTLE & COOL POPPYMINT - The Poppymint scented mom&me fragrance is a fresh scent with a gentle blend of flowers and citrus and a cool mint finish. Lively top notes of bergamot, tangerine, lavandin, petitgrain, and mint blend into a heart of sensory jasmine, muguet, and orange blossom, and are finally grounded by an earthy base of cedar, musk, and sweet orange blossom. Spray cologne daily as part of your family’s routine.",
      "UNISEX KIDS & BABY COLOGNES - Our Mom&Me fragrance sprays are unisex, hypoallergenic, dermatologically and pediatrically tested, manufactured in Europe under the highest quality controls. Each fragrance is inspired by Mediterranean scents that leaves everyone smelling great!.",
      "INFUSED WITH PREBIOTICS & VITAMIN B3 - Pamper yourself and your family with natural Mom&Me colognes! Each fragrance is carefully crafted and infused with prebiotic and vitamin B3 to enhance their properties and freshness, leaving a soft scent behind safe for even the most sensitive skins.",
      "NATURAL INGREDIENTS - Our formulas are clean and natural, IFRA Conformity standards certified for babies and free of toxic ingredients to ensure that these colognes are gentle enough to use on even the most sensitive skin. We want mothers and fathers to feel confident and comfortable using our products. That’s why all of our products are free of parabens, phthalates, synthetic colors or dyes, GMOs, and Gluten Free.",
      "SUSTAINABLE PACKAGING - Our plant-based, environmentally friendly, and cruelty-free products are gentle enough for the whole family and the environment. We’ve intentionally designed our bottles to be compact for unit efficiency and removed outer packaging to minimize the usage of plastics and reduce our carbon footprint. We will continue to make earth conscious decisions and seek sustainable solutions on our mission to provide better high-quality, natural colognes.",
      "HOW TO USE - For Infants, we suggest applying gently on clothes and other items, whilst avoiding areas near the eyes or mouth. For toddlers and kids, spray freely through the day and night to create a relaxed, soothing and fresh environment."
    ],
    "description": [],
    "price": 22.9,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41YBUO6LzCL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41YBUO6LzCL.jpg",
        "variant": "MAIN",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51PT81BsCfL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51PT81BsCfL.jpg",
        "variant": "PT01",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51FbGvvs21L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51FbGvvs21L.jpg",
        "variant": "PT02",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51MW0HrErgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51MW0HrErgL.jpg",
        "variant": "PT03",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51mfqVwKzQL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51mfqVwKzQL.jpg",
        "variant": "PT04",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41-11NxjvAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41-11NxjvAL.jpg",
        "variant": "PT05",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51GAygZx+SL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GAygZx+SL.jpg",
        "variant": "PT06",
        "hi_res": null
      }
    ],
    "videos": [
      {
        "title": "BOIESS Colognes Poppy mint For Moms, Babies & Kids",
        "url": "https://www.amazon.com/vdp/0388a701b63f48cfaf01825fb3ff3331?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Boiess All day Allstars Vegan Eau de Cologne",
        "url": "https://www.amazon.com/vdp/06f12b9fcc4a472ba51d589d63bc31f5?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "BOIESS Colognes For Moms, Babies & Kids",
        "url": "https://www.amazon.com/vdp/062460685aac4715a8158b9cea64f891?ref=dp_vse_rvc_2",
        "user_id": ""
      }
    ],
    "store": "Boiess",
    "categories": [],
    "details": {
      "Brand": "Boiess",
      "Item Form": "Liquid",
      "Item Volume": "8 Fluid Ounces",
      "Scent": "Poppymint",
      "Special Feature": "Dermatoligist tested, Pediatrician tested, Clean, Natural, Cruelty Free, Plant based, Hypoallegenic",
      "Package Dimensions": "6.38 x 2.17 x 2.17 inches; 8.5 Ounces",
      "UPC": "860007057533",
      "Country of Origin": "Spain"
    },
    "bought_together": null
  }
}