{
  "user_id": "AHG5KKQMMZJA46LDH73IZ4QUHYXA",
  "summary": "=== Purchase Information ===\nProduct Title: MARLOWE. Essentials Kit for Men No. 202 | Gift Set with 9 Products, Toiletry Bag | Lotion, Shave, Wash, Soap, Pomade, Lip Balm | Simple & Effective\nReview Date: 2020/02/08\nStore: MARLOWE. M BLEND\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '10.24 x 5.24 x 4.76 inches; 2.62 Pounds', 'UPC': '859984007822'}\nReview Text: I am a fan of MARLOW products...I have several others not included in this set and all are great. I'll break down each product briefly below.<br /><br />BAG: Very nice, basic black but well padded and holds it's shape. I basic in shape but I higher quality then usual.<br /><br />SOAP: Great balsam/fir scent. Excellent balance of exfoliation and suds. Leaves body invigorated, soft and smelling great!<br /><br />SHAVE: Has a tea scent, hint of some sort of alcohol. Builds into a creamy texture, not much sud but decent coverage. Does it's job. Finishes with a clean scent.<br /><br />FACE WASH: Nice balsam/fir scent to it. A little goes a long way! Very slick, seems to not penetrate but wash the exterior of skin. Takes some work to wash off. Finishes with a green tea scent and refreshed.<br /><br />FACE MOISTURIZER: Has a tea/alcohol scent at first...Goes on smooth. Dries fairly quickly, leaving a sweet green tea scent. Leaves face feeling soft not oily.<br /><br />POMADE: Great scent, more cologne like. Goes on easy, not too tacky or slick. Does a decent job.<br /><br />LIP BALM: Awesome balm!!! At first I thought it was an odd addition to the set. But man I love this balm. Goes on with a hint of sweet tea. Not waxy, not glossy, just a perfect balance that keeps lips moisturized.\nReview Title: Great set...All you need in one bundle. Great gift for someone.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AZURE Hyaluronic & Retinol Anti Aging Under Eye Pads- Moisturizing & Rejuvenating Eye Mask Patches - Reduces Fine Lines, Wrinkles, Dark Circles & Puffiness - Skin Care Made in Korea - 5 Pairs\nReview Date: 2020/03/01\nStore: Azure Cosmetics\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Azure Cosmetics', 'Item Form': 'Under eye Patch', 'Product Benefits': 'Moisturizing', 'Scent': 'Unscented', 'Material Type Free': 'Paraben Free', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.5 x 1 x 6 inches; 2.08 Ounces', 'Item model number': '689513260202', 'UPC': '689513260202', 'Manufacturer': 'Just Solutions!'}\nReview Text: Pretty straight forward. Come 2 to a sealed pouch. They are stacked in the pouch so they can be a little difficult to get apart and straightened out. No noticeable or standout scent to them. Apply smooth, nice that they have slits so you can shape it to your contour. They do a nice job refreshing and smoothing my eyes.\nReview Title: Nice product. Smooths nicely.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Somaluxe Collagen Moisturizer with 3 Types of Collagen Peptides and Hyaluronic Acid, 2 oz\nReview Date: 2020/04/15\nStore: Somaluxe\nProduct Description: [\"Indulge your skin with the perfect daily hydrating moisturizer that not only quenches your skin's thirst but also nourishes it with an array of enriching benefits. This specially formulated moisturizer features a proprietary vitamin complex that works wonders to boost collagen production, resulting in visibly smoother and younger-looking skin. Say goodbye to pesky fine lines and wrinkles as this moisturizer helps to minimize their appearance, leaving you with a flawless complexion that radiates confidence. The secret to this moisturizer's amazing effectiveness lies in its blend of natural ingredients, including coconut extract, which provides superior moisture retention to combat dryness and give your skin a youthfully smooth texture. But that's not all – this moisturizer is also infused with the goodness of shea butter, avocado, sunflower, and olive fruit oils that work in harmony to condition your skin and restore its suppleness. These nourishing oils penetrate deep into the skin to support its natural protective barrier, shielding it from harmful environmental stressors and pollutants. With this daily hydrating moisturizer, you can expect a host of benefits that go beyond mere hydration. Get ready to enjoy a more youthful, radiant, and healthy-looking complexion that's the envy of all. So go ahead, pamper your skin with the luxurious care it deserves and say hello to a healthier, happier you!\"]\nAverage Rating: 4.3\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 2 inches; 4.96 Ounces', 'UPC': '639713237146', 'Country of Origin': 'USA'}\nReview Text: The cream is fairly thin, with a pudding like consistency. Applies and spreads well. Leave a hydrated feel without an oily or shiny residual. Happy with it's performance, just not crazy about the scent. Smells earthy, like peat moss.\nReview Title: Thin but works well. Not crazy about the scent.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MD Complete Bright & Healthy Vitamin C+ Vitalizing Face Serum| with Vitamin C, Vitamin E and Herbal Extracts | Potent Antioxidant Protection, Nourishes, Brightens and Evens Skin 0.5 fl oz\nReview Date: 2020/08/22\nStore: MD Complete by Dr. Brian Zelickson\nAverage Rating: 4.2\nProduct Details: {'Skin Type': 'Acne Prone, Sensitive', 'Use for': 'Face', 'Scent': 'Aloe', 'Brand': 'MD Complete by Dr. Brian Zelickson', 'Item Form': 'Serum', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.05 x 1.63 x 3.75 inches; 4.97 Ounces', 'UPC': '850458005573'}\nReview Text: First, the scent is AMAZING...Sweet blood orange with a grapefruit bubble gum undertone, maybe even some jasmine and peppermint, something that awakens your olfactory. Its very strong but not overpowering. Truly one of the best things I've smelt.<br /><br />APPLICATION: Goes on fairly oily and blends pretty well. Immediately brings color to my face, I have medium skin and it starts with an apricot redness but fades back to an awakened tone. I really enjoy that about this, I see others complain about this so maybe it's not best for fair skinned people?.<br /><br />Once dry, I am left with a matte sheen that is well hydrated. You expect it to feel oily but it's more like a raw feel. A really nice balance of hydrated but not wet and definitely softer. I really enjoy this product as well as their others I've tried and will happily continue to use this as my nightly regiment.\nReview Title: Amazing scent. Brings out the color in my skin.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dog Paw Washer Automatic Cleaner for Small and Medium dogs with Brush Pet Foot Cup Silicone\nReview Date: 2020/09/11\nStore: Mr Ros\nAverage Rating: 3.1\nProduct Details: {'Brand': 'Mr Ros', 'Unit Count': '1 Count', 'Material': 'Silicone', 'Product Dimensions': '3.94 x 3.94 x 6.3 inches; 15.66 Ounces'}\nReview Text: [[VIDEOID:5d66b612355cbdece6627644534d9174]] The biggest downside to this cleaner is it's price. Price is subjective, but you don't feel like you are getting a $50 product. The logo is just a crappy sticker, it feels pretty thin, isn't very powerful and didn't come with a wall plug (only cord, not a huge deal but for the price...). There are similar ones for less.<br /><br />Performance wish, I like it a lot. Coming from a manual one, this makes for much easier work to wrangle my dog an let this do the work. It is not very powerful but that is okay as it doesn't scare my dogs. This is a 4 star product but I feel I had to remove another star for it's price/value.\nReview Title: Nice brush. Good fit for my 75lb bullies.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Pristine Organic Beard Conditioner to Grow, Thicken, Moisturize and Protect Your Beard, 8.5 oz.\nReview Date: 2020/09/12\nStore: Mr. Pristine\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Mr. Pristine', 'Material Feature': 'Natural', 'Hair Type': 'Dry', 'Age Range (Description)': 'Adult', 'Unit Count': '8.5 Fl Oz', 'Package Dimensions': '3.1 x 2.5 x 2.36 inches; 7.76 Ounces', 'UPC': '627843801825', 'Manufacturer': 'Mr. Pristine'}\nReview Text: I would give it 2 stars but I actually like the (opposite) effect it had on my beard. It ended up drying out my beard but gave it a fuller effect. The conditioner itself is a thick lotion like consistency, very hard to squeeze out. Scent is a light spearmint that doesn't transfer to my beard well. Disappears after rinsing. End effect left my beard and face feeling dry and chapped, not what I want from a conditioner.\nReview Title: Thickened but dried out my beard.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Automatic Hand Soap/Sanitizer Dispenser Kit - Table liquid Dispenser Pump Station 13.5 oz. Alcohol-Based Sprayer\nReview Date: 2020/09/19\nStore: YAPASPT\nAverage Rating: 4.0\nProduct Details: {'Color': 'Transparent', 'Material': 'Abs', 'Brand': 'YAPASPT', 'Number of Sets': '1', 'Package Dimensions': '8.4 x 4 x 3.5 inches; 10.41 Ounces', 'UPC': '710050025280'}\nReview Text: **update** Unit stopped working after a few days. New (and tested) batteries placed in it and it won't power on. The second part, which is my original review stands true...However, I can not longer give a good rating to a product that lasted a couple days. Your results may vary.<br /><br />Nice little dispenser. Good goldielocks size, not too big, not too small. Doesn't get in the way but doesn't get overlooked. Sanitary design and functions well.\nReview Title: *update* Stopped working.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Portable Hard Travel Gift Case for Dyson Supersonic Hair Dryer, Storage Case Box Organizer for Dyson Supersonic HD01,Black\nReview Date: 2020/09/20\nStore: Forlin\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '14.69 x 12.09 x 3.7 inches; 1.76 Pounds'}\nReview Text: Price seems a bit high, but you are getting a very nice case that is a great fit for you high priced hair dryer...So the price is a bit relevant in that sense. Every item fit securely in it's place and the box has a nice hard shell to it. The hard shell is a medium strength...Sturdy, not floppy but not crush proof but does a great job of protection and would feel safe packing this in a suitcase for travel.\nReview Title: Great investment protection.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NAILGIL Poly Nail Gel (Temperature)\nReview Date: 2021/01/06\nStore: NAIL GIL\nAverage Rating: 3.2\nProduct Details: {'Brand': 'NAIL GIL', 'Item Form': 'Gel', 'Type': 'gel', 'Unit Count': '1.00 Count', 'Item Dimensions LxWxH': '9.45 x 4.72 x 1.18 inches'}\nReview Text: Nice set for the money. Packaged nicely to make for a great gift. Colors are on point and so far they are holding up will on my wife, who is a nurse and bangs her hands around all day.\nReview Title: Nice set. Great gift.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, 25mm Curling Waver Iron Hair Waver with LCD Display Adjustable Temperature 1 Inch Tourmaline Ceramic Triple Hair Crimper Hair Tools for Deep Waves All Style (1#)\nReview Date: 2021/01/07\nStore: Solati\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Solati', 'Hair Type': 'Wavy, Curly, Normal', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '210 Degrees Celsius', 'Package Dimensions': '15.94 x 4.21 x 3.5 inches; 1.54 Pounds', 'UPC': '757350981861', 'Manufacturer': 'Solati'}\nReview Text: Really nice iron! 5 stars based off of it's value at a $35 price point. Is it a top of the line, 5 star iron? No...But for this price, it is an excellent value for an entry level device. The handle is very ergonomic with an on/off button with +/- temperature control. It heats up quick enough, giving you a temp readout on the LCD display. The iron itself is a little thin and somewhat cheaply painted but it functions nicely. The clasp opens and closes with ease but has good retention. My wife was unsure if she'd like one of these and she is very happy with it and it's results!\nReview Title: Great for it's price!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bold Men, Beard Oil 30ml- Beard Oil, Conditioner and Softener, Natural Essential Oils of Cedarwood and Patchouli (Mad Man)\nReview Date: 2021/01/19\nStore: BOLD MEN\nAverage Rating: 2.8\nProduct Details: {'Product Benefits': 'Hydrating', 'Hair Type': 'All', 'Scent': 'Fresh', 'Liquid Volume': '30 Milliliters', 'Item Form': 'Oil', 'Product Dimensions': '1.57 x 1.57 x 4.33 inches; 2.89 Ounces', 'UPC': '793611800632'}\nReview Text: Good stuff...The oil is on the mild/medium side, not to greasy or shiny, a good balance. Scent is very cologne like with a strong backbone of sweet lemon rind/lemonhead. It's in no way overpowering but has a fair presence. I find the scent enjoyable and the oil decent, I would prefer it a little more slick but this is a great happy medium and I can just go extra if need be.\nReview Title: Good stuff. A bit cologne-y but not overpowering.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Body Brush with Super Comfy Bristles for Universal Skin,Long Bamboo Handle Gentle Exfoliation Improve Skin's Health and Beauty Wet or Dry Brushing Back Scrubber for Shower\nReview Date: 2021/01/20\nStore: Zhaoyun\nProduct Description: ['Bath Body Exfoliating Brush,Shower Back Cleaning Scrubber with Long Handle,Dry or Wet Skin Exfoliator Brush with Soft Bristles Back Washer', 'Perfect for Daily Hygiene and Sensitive Skin.', 'Soft Nylon Bristles Be Easier to produce abundant foam,Just add some gel on it and rub the bristles.', 'This Brush will help you a better bath experience, Feel Fresh and Renewed Every Day.', 'Long Reach Handle', 'The Extended 16 inches Long Handle Will Use More Friendly.', 'Note：this brush bristles is too soft so if you want to exfoliate, we recommend using it with a body scrub.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '17 x 4 x 2 inches; 7.55 Ounces', 'Manufacturer': 'Zhaoyun'}\nReview Text: So soft and soothing! It's like getting petted by my dog, haha. The bristles are so soft and smooth, they remind me of petting my dog. Works up a great lather, the bamboo is solid and heavy duty. Head size is a little on the small size but good enough to get the job done. You need this brush!\nReview Title: LOVE this!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 10 Magnets Magnetic Eyelashes With Eyeliner, LANKIZ Exclusive 3x Stronger 1mm Ultra-Light Magnets, 5D Magnetic Lashes Pack Natural Look with 2 Tubes Magnetic Eyeliner Kit & Unique Applicator Tool\nReview Date: 2021/02/05\nStore: LANKIZ\nAverage Rating: 3.7\nProduct Details: {'Color': 'Black', 'Brand': 'LANKIZ', 'Material': 'Silicone,Steel,Silk,Mink', 'Item Dimensions LxWxH': '6.81 x 6.22 x 0.71 inches', 'Material Feature': 'Latex Free, Cruelty Free', 'Product Dimensions': '6.81 x 6.22 x 0.71 inches; 4.97 Ounces'}\nReview Text: My wife is pretty happy with these. Nice aesthetics, decent magnets...Trick is to find the right amount of liner, it requires a good amount for a strong cling but not a crazy amount.\nReview Title: Look good. Need a lot of liner.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: hominem Face and Beard Serum from Manilla Natural Skincare\nReview Date: 2021/02/10\nStore: Manilla Natural Skincare\nAverage Rating: 3.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches'}\nReview Text: The scent is very pleasant...Just, in my opinion, not the best scent for a beard serum (male). It smells very sweet, candy/sweet tarts, with a floral rose bouquet. Excuse the gender stereotyping but it's more feminine, even teenage. Reminds me of grade school and the roll on candy perfumes the girls would use.<br /><br />I like the serum, it's more of an oil though. Fairly runny. Does a nice job on my skin and beard. I do like it and the scent I'm just embarrassed to smell that way in public.\nReview Title: Smells good, but not how I want to smell.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ZOUSZ Black Oud Vegan Beard Balm - Classic Wood-Scented Facial Hair Grooming and Skin Care Butter for Men - Avocado, Argan, Macadamia Oils - Vegan Moisturiser, Conditioner, and Dandruff Remover\nReview Date: 2021/06/15\nStore: ZOUSZ\nAverage Rating: 4.2\nProduct Details: {'Brand': 'ZOUSZ', 'Item Form': 'Liquid,Balm', 'Material Feature': 'Natural', 'Hair Type': 'Dry', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.15 x 3.15 x 3.94 inches; 1.76 Ounces'}\nReview Text: If you're a cologne guy, this is more for you...It's strong enough you probably don't have to wear cologne with it. Scent starts off as clean laundry, then comes a little cedar spice, ending with a sweet vanilla...Combined for what I personally wouldn't call \"manly\" but more of a \"man who is trying to smell good\"... Has a designer fragrance to it, a little body spray but a bit more classy.<br /><br />Performance is okay. The balm is very fluffy ad soft like coconut butter. It doesn't tame as much as I like but softens and gives a nice glow.<br /><br />Overall I want to hate on this but just can't... I can see why some might hate the cologne smell, it's quite strong and different from the dozens of balms I've reviewed... BUT if you like wearing cologne, you'll love this. It's a bit high in price but hey, you'll be saving in cologne price.\nReview Title: Good if you like cologne.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SUPRENT Razors for Men with Matrix Cutter Head, 38.5° Golden Angle Shaving Kit for Men, Travelling Razor Kit-1 Mens Razor Handle, 2 Blade Refills,1 Dock,1 Shave Foam\nReview Date: 2021/09/07\nStore: SUPRENT\nAverage Rating: 3.6\nProduct Details: {'Brand': 'SUPRENT', 'Number of Blades': '6', 'Unit Count': '1.00 Count', 'Skin Type': 'All', 'Handle Material': 'Metal', 'Product Dimensions': '3.94 x 3.94 x 1.97 inches; 1.28 Pounds'}\nReview Text: This is a tough one to review...Works great on my neck and face but not so great on my bald head. The ergonomics are fantastic, it's a hefty metal body with nice curves. The blade nestles in the top groove with metal surrounding it...This makes for a difficult close shave from my bald head curves, I like to press down harder and get a close shave but the surrounding metal prevents that from happening. However, on my neck and cheeks, it does well, particularly with a dry shave.<br /><br />The foam is nice but nothing special. Doesn't slick up great but has a nice scent. The holder is okay...Sturdy but holds the blade loosely. Also, as of now, I don't see where I can get replacement blades.\nReview Title: Love the ergonomics. Tough to get a close shave though.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Organic Patchouli Beard Wash by American Shaving Co, Rich, Foaming Cleanser that Softens, cleanse & Strengthens the beard hair, Clean and Refresh your beard with Patchouli Fragrance - 8 oz\nReview Date: 2022/08/29\nStore: American Shaving Co.\nAverage Rating: 3.5\nProduct Details: {'Brand': 'American Shaving Co.', 'Skin Type': 'All', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '8.0 Ounce', 'Package Dimensions': '7.84 x 1.85 x 1.81 inches; 8.64 Ounces', 'UPC': '685167904479'}\nReview Text: Not bad...Large size, pumps a thick tan cream. Fair amount of sud/foam. Pretty strong, classic, patchouli scent. Scent washes out a bit with the soap but leaves a nice, light amount behind. Does a good job at cleansing and softening.\nReview Title: Good stuff. Classic patchouli scent.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Electronic Breath Spray for Bad Breath, Dry Mouth Spray, Heavy Super Mint Flavor Rechargeable Oral Care Mist, Oral Care Mouth Freshener\nReview Date: 2022/11/09\nStore: AusKit\nAverage Rating: 4.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.6 x 0.9 x 0.9 inches', 'Item model number': 'KPO2'}\nReview Text: Impressive effectiveness from a simple vapor stream. Provides a strong mint blast and sweet mint flavor. Helps ice down a scratchy throat too. A bit pricey but a pretty neat device. Refills are pricey too.\nReview Title: Impressive.\nRating: 4.0\n--------------------------------------------------",
  "reference": "MARLOWE. Essentials Kit for Men No. 202 | Gift Set with 9 Products, Toiletry Bag | Lotion, Shave, Wash, Soap, Pomade, Lip Balm | Simple & Effective\nMARLOWE. M BLEND\n{'Package Dimensions': '10.24 x 5.24 x 4.76 inches; 2.62 Pounds', 'UPC': '859984007822'}\nI am a fan of MARLOW products...I have several others not included in this set and all are great. I'll break down each product briefly below.<br /><br />BAG: Very nice, basic black but well padded and holds it's shape. I basic in shape but I higher quality then usual.<br /><br />SOAP: Great balsam/fir scent. Excellent balance of exfoliation and suds. Leaves body invigorated, soft and smelling great!<br /><br />SHAVE: Has a tea scent, hint of some sort of alcohol. Builds into a creamy texture, not much sud but decent coverage. Does it's job. Finishes with a clean scent.<br /><br />FACE WASH: Nice balsam/fir scent to it. A little goes a long way! Very slick, seems to not penetrate but wash the exterior of skin. Takes some work to wash off. Finishes with a green tea scent and refreshed.<br /><br />FACE MOISTURIZER: Has a tea/alcohol scent at first...Goes on smooth. Dries fairly quickly, leaving a sweet green tea scent. Leaves face feeling soft not oily.<br /><br />POMADE: Great scent, more cologne like. Goes on easy, not too tacky or slick. Does a decent job.<br /><br />LIP BALM: Awesome balm!!! At first I thought it was an odd addition to the set. But man I love this balm. Goes on with a hint of sweet tea. Not waxy, not glossy, just a perfect balance that keeps lips moisturized.\nGreat set...All you need in one bundle. Great gift for someone.\nAZURE Hyaluronic & Retinol Anti Aging Under Eye Pads- Moisturizing & Rejuvenating Eye Mask Patches - Reduces Fine Lines, Wrinkles, Dark Circles & Puffiness - Skin Care Made in Korea - 5 Pairs\nAzure Cosmetics\n{'Brand': 'Azure Cosmetics', 'Item Form': 'Under eye Patch', 'Product Benefits': 'Moisturizing', 'Scent': 'Unscented', 'Material Type Free': 'Paraben Free', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.5 x 1 x 6 inches; 2.08 Ounces', 'Item model number': '689513260202', 'UPC': '689513260202', 'Manufacturer': 'Just Solutions!'}\nPretty straight forward. Come 2 to a sealed pouch. They are stacked in the pouch so they can be a little difficult to get apart and straightened out. No noticeable or standout scent to them. Apply smooth, nice that they have slits so you can shape it to your contour. They do a nice job refreshing and smoothing my eyes.\nNice product. Smooths nicely.\nSomaluxe Collagen Moisturizer with 3 Types of Collagen Peptides and Hyaluronic Acid, 2 oz\nSomaluxe\n[\"Indulge your skin with the perfect daily hydrating moisturizer that not only quenches your skin's thirst but also nourishes it with an array of enriching benefits. This specially formulated moisturizer features a proprietary vitamin complex that works wonders to boost collagen production, resulting in visibly smoother and younger-looking skin. Say goodbye to pesky fine lines and wrinkles as this moisturizer helps to minimize their appearance, leaving you with a flawless complexion that radiates confidence. The secret to this moisturizer's amazing effectiveness lies in its blend of natural ingredients, including coconut extract, which provides superior moisture retention to combat dryness and give your skin a youthfully smooth texture. But that's not all – this moisturizer is also infused with the goodness of shea butter, avocado, sunflower, and olive fruit oils that work in harmony to condition your skin and restore its suppleness. These nourishing oils penetrate deep into the skin to support its natural protective barrier, shielding it from harmful environmental stressors and pollutants. With this daily hydrating moisturizer, you can expect a host of benefits that go beyond mere hydration. Get ready to enjoy a more youthful, radiant, and healthy-looking complexion that's the envy of all. So go ahead, pamper your skin with the luxurious care it deserves and say hello to a healthier, happier you!\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 2 inches; 4.96 Ounces', 'UPC': '639713237146', 'Country of Origin': 'USA'}\nThe cream is fairly thin, with a pudding like consistency. Applies and spreads well. Leave a hydrated feel without an oily or shiny residual. Happy with it's performance, just not crazy about the scent. Smells earthy, like peat moss.\nThin but works well. Not crazy about the scent.\nMD Complete Bright & Healthy Vitamin C+ Vitalizing Face Serum| with Vitamin C, Vitamin E and Herbal Extracts | Potent Antioxidant Protection, Nourishes, Brightens and Evens Skin 0.5 fl oz\nMD Complete by Dr. Brian Zelickson\n{'Skin Type': 'Acne Prone, Sensitive', 'Use for': 'Face', 'Scent': 'Aloe', 'Brand': 'MD Complete by Dr. Brian Zelickson', 'Item Form': 'Serum', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.05 x 1.63 x 3.75 inches; 4.97 Ounces', 'UPC': '850458005573'}\nFirst, the scent is AMAZING...Sweet blood orange with a grapefruit bubble gum undertone, maybe even some jasmine and peppermint, something that awakens your olfactory. Its very strong but not overpowering. Truly one of the best things I've smelt.<br /><br />APPLICATION: Goes on fairly oily and blends pretty well. Immediately brings color to my face, I have medium skin and it starts with an apricot redness but fades back to an awakened tone. I really enjoy that about this, I see others complain about this so maybe it's not best for fair skinned people?.<br /><br />Once dry, I am left with a matte sheen that is well hydrated. You expect it to feel oily but it's more like a raw feel. A really nice balance of hydrated but not wet and definitely softer. I really enjoy this product as well as their others I've tried and will happily continue to use this as my nightly regiment.\nAmazing scent. Brings out the color in my skin.\nDog Paw Washer Automatic Cleaner for Small and Medium dogs with Brush Pet Foot Cup Silicone\nMr Ros\n{'Brand': 'Mr Ros', 'Unit Count': '1 Count', 'Material': 'Silicone', 'Product Dimensions': '3.94 x 3.94 x 6.3 inches; 15.66 Ounces'}\n[[VIDEOID:5d66b612355cbdece6627644534d9174]] The biggest downside to this cleaner is it's price. Price is subjective, but you don't feel like you are getting a $50 product. The logo is just a crappy sticker, it feels pretty thin, isn't very powerful and didn't come with a wall plug (only cord, not a huge deal but for the price...). There are similar ones for less.<br /><br />Performance wish, I like it a lot. Coming from a manual one, this makes for much easier work to wrangle my dog an let this do the work. It is not very powerful but that is okay as it doesn't scare my dogs. This is a 4 star product but I feel I had to remove another star for it's price/value.\nNice brush. Good fit for my 75lb bullies.\nMr. Pristine Organic Beard Conditioner to Grow, Thicken, Moisturize and Protect Your Beard, 8.5 oz.\nMr. Pristine\n{'Brand': 'Mr. Pristine', 'Material Feature': 'Natural', 'Hair Type': 'Dry', 'Age Range (Description)': 'Adult', 'Unit Count': '8.5 Fl Oz', 'Package Dimensions': '3.1 x 2.5 x 2.36 inches; 7.76 Ounces', 'UPC': '627843801825', 'Manufacturer': 'Mr. Pristine'}\nI would give it 2 stars but I actually like the (opposite) effect it had on my beard. It ended up drying out my beard but gave it a fuller effect. The conditioner itself is a thick lotion like consistency, very hard to squeeze out. Scent is a light spearmint that doesn't transfer to my beard well. Disappears after rinsing. End effect left my beard and face feeling dry and chapped, not what I want from a conditioner.\nThickened but dried out my beard.\nAutomatic Hand Soap/Sanitizer Dispenser Kit - Table liquid Dispenser Pump Station 13.5 oz. Alcohol-Based Sprayer\nYAPASPT\n{'Color': 'Transparent', 'Material': 'Abs', 'Brand': 'YAPASPT', 'Number of Sets': '1', 'Package Dimensions': '8.4 x 4 x 3.5 inches; 10.41 Ounces', 'UPC': '710050025280'}\n**update** Unit stopped working after a few days. New (and tested) batteries placed in it and it won't power on. The second part, which is my original review stands true...However, I can not longer give a good rating to a product that lasted a couple days. Your results may vary.<br /><br />Nice little dispenser. Good goldielocks size, not too big, not too small. Doesn't get in the way but doesn't get overlooked. Sanitary design and functions well.\n*update* Stopped working.\nPortable Hard Travel Gift Case for Dyson Supersonic Hair Dryer, Storage Case Box Organizer for Dyson Supersonic HD01,Black\nForlin\n{'Package Dimensions': '14.69 x 12.09 x 3.7 inches; 1.76 Pounds'}\nPrice seems a bit high, but you are getting a very nice case that is a great fit for you high priced hair dryer...So the price is a bit relevant in that sense. Every item fit securely in it's place and the box has a nice hard shell to it. The hard shell is a medium strength...Sturdy, not floppy but not crush proof but does a great job of protection and would feel safe packing this in a suitcase for travel.\nGreat investment protection.\nNAILGIL Poly Nail Gel (Temperature)\nNAIL GIL\n{'Brand': 'NAIL GIL', 'Item Form': 'Gel', 'Type': 'gel', 'Unit Count': '1.00 Count', 'Item Dimensions LxWxH': '9.45 x 4.72 x 1.18 inches'}\nNice set for the money. Packaged nicely to make for a great gift. Colors are on point and so far they are holding up will on my wife, who is a nurse and bangs her hands around all day.\nNice set. Great gift.\n3 Barrel Curling Iron, 25mm Curling Waver Iron Hair Waver with LCD Display Adjustable Temperature 1 Inch Tourmaline Ceramic Triple Hair Crimper Hair Tools for Deep Waves All Style (1#)\nSolati\n{'Brand': 'Solati', 'Hair Type': 'Wavy, Curly, Normal', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '210 Degrees Celsius', 'Package Dimensions': '15.94 x 4.21 x 3.5 inches; 1.54 Pounds', 'UPC': '757350981861', 'Manufacturer': 'Solati'}\nReally nice iron! 5 stars based off of it's value at a $35 price point. Is it a top of the line, 5 star iron? No...But for this price, it is an excellent value for an entry level device. The handle is very ergonomic with an on/off button with +/- temperature control. It heats up quick enough, giving you a temp readout on the LCD display. The iron itself is a little thin and somewhat cheaply painted but it functions nicely. The clasp opens and closes with ease but has good retention. My wife was unsure if she'd like one of these and she is very happy with it and it's results!\nGreat for it's price!\nBold Men, Beard Oil 30ml- Beard Oil, Conditioner and Softener, Natural Essential Oils of Cedarwood and Patchouli (Mad Man)\nBOLD MEN\n{'Product Benefits': 'Hydrating', 'Hair Type': 'All', 'Scent': 'Fresh', 'Liquid Volume': '30 Milliliters', 'Item Form': 'Oil', 'Product Dimensions': '1.57 x 1.57 x 4.33 inches; 2.89 Ounces', 'UPC': '793611800632'}\nGood stuff...The oil is on the mild/medium side, not to greasy or shiny, a good balance. Scent is very cologne like with a strong backbone of sweet lemon rind/lemonhead. It's in no way overpowering but has a fair presence. I find the scent enjoyable and the oil decent, I would prefer it a little more slick but this is a great happy medium and I can just go extra if need be.\nGood stuff. A bit cologne-y but not overpowering.\nBath Body Brush with Super Comfy Bristles for Universal Skin,Long Bamboo Handle Gentle Exfoliation Improve Skin's Health and Beauty Wet or Dry Brushing Back Scrubber for Shower\nZhaoyun\n['Bath Body Exfoliating Brush,Shower Back Cleaning Scrubber with Long Handle,Dry or Wet Skin Exfoliator Brush with Soft Bristles Back Washer', 'Perfect for Daily Hygiene and Sensitive Skin.', 'Soft Nylon Bristles Be Easier to produce abundant foam,Just add some gel on it and rub the bristles.', 'This Brush will help you a better bath experience, Feel Fresh and Renewed Every Day.', 'Long Reach Handle', 'The Extended 16 inches Long Handle Will Use More Friendly.', 'Note：this brush bristles is too soft so if you want to exfoliate, we recommend using it with a body scrub.']\n{'Product Dimensions': '17 x 4 x 2 inches; 7.55 Ounces', 'Manufacturer': 'Zhaoyun'}\nSo soft and soothing! It's like getting petted by my dog, haha. The bristles are so soft and smooth, they remind me of petting my dog. Works up a great lather, the bamboo is solid and heavy duty. Head size is a little on the small size but good enough to get the job done. You need this brush!\nLOVE this!!!\n10 Magnets Magnetic Eyelashes With Eyeliner, LANKIZ Exclusive 3x Stronger 1mm Ultra-Light Magnets, 5D Magnetic Lashes Pack Natural Look with 2 Tubes Magnetic Eyeliner Kit & Unique Applicator Tool\nLANKIZ\n{'Color': 'Black', 'Brand': 'LANKIZ', 'Material': 'Silicone,Steel,Silk,Mink', 'Item Dimensions LxWxH': '6.81 x 6.22 x 0.71 inches', 'Material Feature': 'Latex Free, Cruelty Free', 'Product Dimensions': '6.81 x 6.22 x 0.71 inches; 4.97 Ounces'}\nMy wife is pretty happy with these. Nice aesthetics, decent magnets...Trick is to find the right amount of liner, it requires a good amount for a strong cling but not a crazy amount.\nLook good. Need a lot of liner.\nhominem Face and Beard Serum from Manilla Natural Skincare\nManilla Natural Skincare\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches'}\nThe scent is very pleasant...Just, in my opinion, not the best scent for a beard serum (male). It smells very sweet, candy/sweet tarts, with a floral rose bouquet. Excuse the gender stereotyping but it's more feminine, even teenage. Reminds me of grade school and the roll on candy perfumes the girls would use.<br /><br />I like the serum, it's more of an oil though. Fairly runny. Does a nice job on my skin and beard. I do like it and the scent I'm just embarrassed to smell that way in public.\nSmells good, but not how I want to smell.\nZOUSZ Black Oud Vegan Beard Balm - Classic Wood-Scented Facial Hair Grooming and Skin Care Butter for Men - Avocado, Argan, Macadamia Oils - Vegan Moisturiser, Conditioner, and Dandruff Remover\nZOUSZ\n{'Brand': 'ZOUSZ', 'Item Form': 'Liquid,Balm', 'Material Feature': 'Natural', 'Hair Type': 'Dry', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.15 x 3.15 x 3.94 inches; 1.76 Ounces'}\nIf you're a cologne guy, this is more for you...It's strong enough you probably don't have to wear cologne with it. Scent starts off as clean laundry, then comes a little cedar spice, ending with a sweet vanilla...Combined for what I personally wouldn't call \"manly\" but more of a \"man who is trying to smell good\"... Has a designer fragrance to it, a little body spray but a bit more classy.<br /><br />Performance is okay. The balm is very fluffy ad soft like coconut butter. It doesn't tame as much as I like but softens and gives a nice glow.<br /><br />Overall I want to hate on this but just can't... I can see why some might hate the cologne smell, it's quite strong and different from the dozens of balms I've reviewed... BUT if you like wearing cologne, you'll love this. It's a bit high in price but hey, you'll be saving in cologne price.\nGood if you like cologne.\nSUPRENT Razors for Men with Matrix Cutter Head, 38.5° Golden Angle Shaving Kit for Men, Travelling Razor Kit-1 Mens Razor Handle, 2 Blade Refills,1 Dock,1 Shave Foam\nSUPRENT\n{'Brand': 'SUPRENT', 'Number of Blades': '6', 'Unit Count': '1.00 Count', 'Skin Type': 'All', 'Handle Material': 'Metal', 'Product Dimensions': '3.94 x 3.94 x 1.97 inches; 1.28 Pounds'}\nThis is a tough one to review...Works great on my neck and face but not so great on my bald head. The ergonomics are fantastic, it's a hefty metal body with nice curves. The blade nestles in the top groove with metal surrounding it...This makes for a difficult close shave from my bald head curves, I like to press down harder and get a close shave but the surrounding metal prevents that from happening. However, on my neck and cheeks, it does well, particularly with a dry shave.<br /><br />The foam is nice but nothing special. Doesn't slick up great but has a nice scent. The holder is okay...Sturdy but holds the blade loosely. Also, as of now, I don't see where I can get replacement blades.\nLove the ergonomics. Tough to get a close shave though.\nOrganic Patchouli Beard Wash by American Shaving Co, Rich, Foaming Cleanser that Softens, cleanse & Strengthens the beard hair, Clean and Refresh your beard with Patchouli Fragrance - 8 oz\nAmerican Shaving Co.\n{'Brand': 'American Shaving Co.', 'Skin Type': 'All', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '8.0 Ounce', 'Package Dimensions': '7.84 x 1.85 x 1.81 inches; 8.64 Ounces', 'UPC': '685167904479'}\nNot bad...Large size, pumps a thick tan cream. Fair amount of sud/foam. Pretty strong, classic, patchouli scent. Scent washes out a bit with the soap but leaves a nice, light amount behind. Does a good job at cleansing and softening.\nGood stuff. Classic patchouli scent.\nElectronic Breath Spray for Bad Breath, Dry Mouth Spray, Heavy Super Mint Flavor Rechargeable Oral Care Mist, Oral Care Mouth Freshener\nAusKit\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.6 x 0.9 x 0.9 inches', 'Item model number': 'KPO2'}\nImpressive effectiveness from a simple vapor stream. Provides a strong mint blast and sweet mint flavor. Helps ice down a scratchy throat too. A bit pricey but a pretty neat device. Refills are pricey too.\nImpressive.",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: MARLOWE. Essentials Kit for Men No. 202 | Gift Set with 9 Products, Toiletry Bag | Lotion, Shave, Wash, Soap, Pomade, Lip Balm | Simple & Effective\nReview Date: 2020/02/08\nStore: MARLOWE. M BLEND\nAverage Rating: 4.3\nProduct Details: {'Package Dimensions': '10.24 x 5.24 x 4.76 inches; 2.62 Pounds', 'UPC': '859984007822'}\nReview Text: I am a fan of MARLOW products...I have several others not included in this set and all are great. I'll break down each product briefly below.<br /><br />BAG: Very nice, basic black but well padded and holds it's shape. I basic in shape but I higher quality then usual.<br /><br />SOAP: Great balsam/fir scent. Excellent balance of exfoliation and suds. Leaves body invigorated, soft and smelling great!<br /><br />SHAVE: Has a tea scent, hint of some sort of alcohol. Builds into a creamy texture, not much sud but decent coverage. Does it's job. Finishes with a clean scent.<br /><br />FACE WASH: Nice balsam/fir scent to it. A little goes a long way! Very slick, seems to not penetrate but wash the exterior of skin. Takes some work to wash off. Finishes with a green tea scent and refreshed.<br /><br />FACE MOISTURIZER: Has a tea/alcohol scent at first...Goes on smooth. Dries fairly quickly, leaving a sweet green tea scent. Leaves face feeling soft not oily.<br /><br />POMADE: Great scent, more cologne like. Goes on easy, not too tacky or slick. Does a decent job.<br /><br />LIP BALM: Awesome balm!!! At first I thought it was an odd addition to the set. But man I love this balm. Goes on with a hint of sweet tea. Not waxy, not glossy, just a perfect balance that keeps lips moisturized.\nReview Title: Great set...All you need in one bundle. Great gift for someone.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AZURE Hyaluronic & Retinol Anti Aging Under Eye Pads- Moisturizing & Rejuvenating Eye Mask Patches - Reduces Fine Lines, Wrinkles, Dark Circles & Puffiness - Skin Care Made in Korea - 5 Pairs\nReview Date: 2020/03/01\nStore: Azure Cosmetics\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Azure Cosmetics', 'Item Form': 'Under eye Patch', 'Product Benefits': 'Moisturizing', 'Scent': 'Unscented', 'Material Type Free': 'Paraben Free', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.5 x 1 x 6 inches; 2.08 Ounces', 'Item model number': '689513260202', 'UPC': '689513260202', 'Manufacturer': 'Just Solutions!'}\nReview Text: Pretty straight forward. Come 2 to a sealed pouch. They are stacked in the pouch so they can be a little difficult to get apart and straightened out. No noticeable or standout scent to them. Apply smooth, nice that they have slits so you can shape it to your contour. They do a nice job refreshing and smoothing my eyes.\nReview Title: Nice product. Smooths nicely.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Somaluxe Collagen Moisturizer with 3 Types of Collagen Peptides and Hyaluronic Acid, 2 oz\nReview Date: 2020/04/15\nStore: Somaluxe\nProduct Description: [\"Indulge your skin with the perfect daily hydrating moisturizer that not only quenches your skin's thirst but also nourishes it with an array of enriching benefits. This specially formulated moisturizer features a proprietary vitamin complex that works wonders to boost collagen production, resulting in visibly smoother and younger-looking skin. Say goodbye to pesky fine lines and wrinkles as this moisturizer helps to minimize their appearance, leaving you with a flawless complexion that radiates confidence. The secret to this moisturizer's amazing effectiveness lies in its blend of natural ingredients, including coconut extract, which provides superior moisture retention to combat dryness and give your skin a youthfully smooth texture. But that's not all – this moisturizer is also infused with the goodness of shea butter, avocado, sunflower, and olive fruit oils that work in harmony to condition your skin and restore its suppleness. These nourishing oils penetrate deep into the skin to support its natural protective barrier, shielding it from harmful environmental stressors and pollutants. With this daily hydrating moisturizer, you can expect a host of benefits that go beyond mere hydration. Get ready to enjoy a more youthful, radiant, and healthy-looking complexion that's the envy of all. So go ahead, pamper your skin with the luxurious care it deserves and say hello to a healthier, happier you!\"]\nAverage Rating: 4.3\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 2 x 2 inches; 4.96 Ounces', 'UPC': '639713237146', 'Country of Origin': 'USA'}\nReview Text: The cream is fairly thin, with a pudding like consistency. Applies and spreads well. Leave a hydrated feel without an oily or shiny residual. Happy with it's performance, just not crazy about the scent. Smells earthy, like peat moss.\nReview Title: Thin but works well. Not crazy about the scent.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: MD Complete Bright & Healthy Vitamin C+ Vitalizing Face Serum| with Vitamin C, Vitamin E and Herbal Extracts | Potent Antioxidant Protection, Nourishes, Brightens and Evens Skin 0.5 fl oz\nReview Date: 2020/08/22\nStore: MD Complete by Dr. Brian Zelickson\nAverage Rating: 4.2\nProduct Details: {'Skin Type': 'Acne Prone, Sensitive', 'Use for': 'Face', 'Scent': 'Aloe', 'Brand': 'MD Complete by Dr. Brian Zelickson', 'Item Form': 'Serum', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.05 x 1.63 x 3.75 inches; 4.97 Ounces', 'UPC': '850458005573'}\nReview Text: First, the scent is AMAZING...Sweet blood orange with a grapefruit bubble gum undertone, maybe even some jasmine and peppermint, something that awakens your olfactory. Its very strong but not overpowering. Truly one of the best things I've smelt.<br /><br />APPLICATION: Goes on fairly oily and blends pretty well. Immediately brings color to my face, I have medium skin and it starts with an apricot redness but fades back to an awakened tone. I really enjoy that about this, I see others complain about this so maybe it's not best for fair skinned people?.<br /><br />Once dry, I am left with a matte sheen that is well hydrated. You expect it to feel oily but it's more like a raw feel. A really nice balance of hydrated but not wet and definitely softer. I really enjoy this product as well as their others I've tried and will happily continue to use this as my nightly regiment.\nReview Title: Amazing scent. Brings out the color in my skin.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Dog Paw Washer Automatic Cleaner for Small and Medium dogs with Brush Pet Foot Cup Silicone\nReview Date: 2020/09/11\nStore: Mr Ros\nAverage Rating: 3.1\nProduct Details: {'Brand': 'Mr Ros', 'Unit Count': '1 Count', 'Material': 'Silicone', 'Product Dimensions': '3.94 x 3.94 x 6.3 inches; 15.66 Ounces'}\nReview Text: [[VIDEOID:5d66b612355cbdece6627644534d9174]] The biggest downside to this cleaner is it's price. Price is subjective, but you don't feel like you are getting a $50 product. The logo is just a crappy sticker, it feels pretty thin, isn't very powerful and didn't come with a wall plug (only cord, not a huge deal but for the price...). There are similar ones for less.<br /><br />Performance wish, I like it a lot. Coming from a manual one, this makes for much easier work to wrangle my dog an let this do the work. It is not very powerful but that is okay as it doesn't scare my dogs. This is a 4 star product but I feel I had to remove another star for it's price/value.\nReview Title: Nice brush. Good fit for my 75lb bullies.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mr. Pristine Organic Beard Conditioner to Grow, Thicken, Moisturize and Protect Your Beard, 8.5 oz.\nReview Date: 2020/09/12\nStore: Mr. Pristine\nAverage Rating: 3.8\nProduct Details: {'Brand': 'Mr. Pristine', 'Material Feature': 'Natural', 'Hair Type': 'Dry', 'Age Range (Description)': 'Adult', 'Unit Count': '8.5 Fl Oz', 'Package Dimensions': '3.1 x 2.5 x 2.36 inches; 7.76 Ounces', 'UPC': '627843801825', 'Manufacturer': 'Mr. Pristine'}\nReview Text: I would give it 2 stars but I actually like the (opposite) effect it had on my beard. It ended up drying out my beard but gave it a fuller effect. The conditioner itself is a thick lotion like consistency, very hard to squeeze out. Scent is a light spearmint that doesn't transfer to my beard well. Disappears after rinsing. End effect left my beard and face feeling dry and chapped, not what I want from a conditioner.\nReview Title: Thickened but dried out my beard.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Automatic Hand Soap/Sanitizer Dispenser Kit - Table liquid Dispenser Pump Station 13.5 oz. Alcohol-Based Sprayer\nReview Date: 2020/09/19\nStore: YAPASPT\nAverage Rating: 4.0\nProduct Details: {'Color': 'Transparent', 'Material': 'Abs', 'Brand': 'YAPASPT', 'Number of Sets': '1', 'Package Dimensions': '8.4 x 4 x 3.5 inches; 10.41 Ounces', 'UPC': '710050025280'}\nReview Text: **update** Unit stopped working after a few days. New (and tested) batteries placed in it and it won't power on. The second part, which is my original review stands true...However, I can not longer give a good rating to a product that lasted a couple days. Your results may vary.<br /><br />Nice little dispenser. Good goldielocks size, not too big, not too small. Doesn't get in the way but doesn't get overlooked. Sanitary design and functions well.\nReview Title: *update* Stopped working.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Portable Hard Travel Gift Case for Dyson Supersonic Hair Dryer, Storage Case Box Organizer for Dyson Supersonic HD01,Black\nReview Date: 2020/09/20\nStore: Forlin\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '14.69 x 12.09 x 3.7 inches; 1.76 Pounds'}\nReview Text: Price seems a bit high, but you are getting a very nice case that is a great fit for you high priced hair dryer...So the price is a bit relevant in that sense. Every item fit securely in it's place and the box has a nice hard shell to it. The hard shell is a medium strength...Sturdy, not floppy but not crush proof but does a great job of protection and would feel safe packing this in a suitcase for travel.\nReview Title: Great investment protection.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NAILGIL Poly Nail Gel (Temperature)\nReview Date: 2021/01/06\nStore: NAIL GIL\nAverage Rating: 3.2\nProduct Details: {'Brand': 'NAIL GIL', 'Item Form': 'Gel', 'Type': 'gel', 'Unit Count': '1.00 Count', 'Item Dimensions LxWxH': '9.45 x 4.72 x 1.18 inches'}\nReview Text: Nice set for the money. Packaged nicely to make for a great gift. Colors are on point and so far they are holding up will on my wife, who is a nurse and bangs her hands around all day.\nReview Title: Nice set. Great gift.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 3 Barrel Curling Iron, 25mm Curling Waver Iron Hair Waver with LCD Display Adjustable Temperature 1 Inch Tourmaline Ceramic Triple Hair Crimper Hair Tools for Deep Waves All Style (1#)\nReview Date: 2021/01/07\nStore: Solati\nAverage Rating: 3.6\nProduct Details: {'Brand': 'Solati', 'Hair Type': 'Wavy, Curly, Normal', 'Material': 'Ceramic', 'Power Source': 'Corded Electric', 'Max Temperature Setting': '210 Degrees Celsius', 'Package Dimensions': '15.94 x 4.21 x 3.5 inches; 1.54 Pounds', 'UPC': '757350981861', 'Manufacturer': 'Solati'}\nReview Text: Really nice iron! 5 stars based off of it's value at a $35 price point. Is it a top of the line, 5 star iron? No...But for this price, it is an excellent value for an entry level device. The handle is very ergonomic with an on/off button with +/- temperature control. It heats up quick enough, giving you a temp readout on the LCD display. The iron itself is a little thin and somewhat cheaply painted but it functions nicely. The clasp opens and closes with ease but has good retention. My wife was unsure if she'd like one of these and she is very happy with it and it's results!\nReview Title: Great for it's price!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bold Men, Beard Oil 30ml- Beard Oil, Conditioner and Softener, Natural Essential Oils of Cedarwood and Patchouli (Mad Man)\nReview Date: 2021/01/19\nStore: BOLD MEN\nAverage Rating: 2.8\nProduct Details: {'Product Benefits': 'Hydrating', 'Hair Type': 'All', 'Scent': 'Fresh', 'Liquid Volume': '30 Milliliters', 'Item Form': 'Oil', 'Product Dimensions': '1.57 x 1.57 x 4.33 inches; 2.89 Ounces', 'UPC': '793611800632'}\nReview Text: Good stuff...The oil is on the mild/medium side, not to greasy or shiny, a good balance. Scent is very cologne like with a strong backbone of sweet lemon rind/lemonhead. It's in no way overpowering but has a fair presence. I find the scent enjoyable and the oil decent, I would prefer it a little more slick but this is a great happy medium and I can just go extra if need be.\nReview Title: Good stuff. A bit cologne-y but not overpowering.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bath Body Brush with Super Comfy Bristles for Universal Skin,Long Bamboo Handle Gentle Exfoliation Improve Skin's Health and Beauty Wet or Dry Brushing Back Scrubber for Shower\nReview Date: 2021/01/20\nStore: Zhaoyun\nProduct Description: ['Bath Body Exfoliating Brush,Shower Back Cleaning Scrubber with Long Handle,Dry or Wet Skin Exfoliator Brush with Soft Bristles Back Washer', 'Perfect for Daily Hygiene and Sensitive Skin.', 'Soft Nylon Bristles Be Easier to produce abundant foam,Just add some gel on it and rub the bristles.', 'This Brush will help you a better bath experience, Feel Fresh and Renewed Every Day.', 'Long Reach Handle', 'The Extended 16 inches Long Handle Will Use More Friendly.', 'Note：this brush bristles is too soft so if you want to exfoliate, we recommend using it with a body scrub.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '17 x 4 x 2 inches; 7.55 Ounces', 'Manufacturer': 'Zhaoyun'}\nReview Text: So soft and soothing! It's like getting petted by my dog, haha. The bristles are so soft and smooth, they remind me of petting my dog. Works up a great lather, the bamboo is solid and heavy duty. Head size is a little on the small size but good enough to get the job done. You need this brush!\nReview Title: LOVE this!!!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 10 Magnets Magnetic Eyelashes With Eyeliner, LANKIZ Exclusive 3x Stronger 1mm Ultra-Light Magnets, 5D Magnetic Lashes Pack Natural Look with 2 Tubes Magnetic Eyeliner Kit & Unique Applicator Tool\nReview Date: 2021/02/05\nStore: LANKIZ\nAverage Rating: 3.7\nProduct Details: {'Color': 'Black', 'Brand': 'LANKIZ', 'Material': 'Silicone,Steel,Silk,Mink', 'Item Dimensions LxWxH': '6.81 x 6.22 x 0.71 inches', 'Material Feature': 'Latex Free, Cruelty Free', 'Product Dimensions': '6.81 x 6.22 x 0.71 inches; 4.97 Ounces'}\nReview Text: My wife is pretty happy with these. Nice aesthetics, decent magnets...Trick is to find the right amount of liner, it requires a good amount for a strong cling but not a crazy amount.\nReview Title: Look good. Need a lot of liner.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: hominem Face and Beard Serum from Manilla Natural Skincare\nReview Date: 2021/02/10\nStore: Manilla Natural Skincare\nAverage Rating: 3.5\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches'}\nReview Text: The scent is very pleasant...Just, in my opinion, not the best scent for a beard serum (male). It smells very sweet, candy/sweet tarts, with a floral rose bouquet. Excuse the gender stereotyping but it's more feminine, even teenage. Reminds me of grade school and the roll on candy perfumes the girls would use.<br /><br />I like the serum, it's more of an oil though. Fairly runny. Does a nice job on my skin and beard. I do like it and the scent I'm just embarrassed to smell that way in public.\nReview Title: Smells good, but not how I want to smell.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ZOUSZ Black Oud Vegan Beard Balm - Classic Wood-Scented Facial Hair Grooming and Skin Care Butter for Men - Avocado, Argan, Macadamia Oils - Vegan Moisturiser, Conditioner, and Dandruff Remover\nReview Date: 2021/06/15\nStore: ZOUSZ\nAverage Rating: 4.2\nProduct Details: {'Brand': 'ZOUSZ', 'Item Form': 'Liquid,Balm', 'Material Feature': 'Natural', 'Hair Type': 'Dry', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.15 x 3.15 x 3.94 inches; 1.76 Ounces'}\nReview Text: If you're a cologne guy, this is more for you...It's strong enough you probably don't have to wear cologne with it. Scent starts off as clean laundry, then comes a little cedar spice, ending with a sweet vanilla...Combined for what I personally wouldn't call \"manly\" but more of a \"man who is trying to smell good\"... Has a designer fragrance to it, a little body spray but a bit more classy.<br /><br />Performance is okay. The balm is very fluffy ad soft like coconut butter. It doesn't tame as much as I like but softens and gives a nice glow.<br /><br />Overall I want to hate on this but just can't... I can see why some might hate the cologne smell, it's quite strong and different from the dozens of balms I've reviewed... BUT if you like wearing cologne, you'll love this. It's a bit high in price but hey, you'll be saving in cologne price.\nReview Title: Good if you like cologne.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SUPRENT Razors for Men with Matrix Cutter Head, 38.5° Golden Angle Shaving Kit for Men, Travelling Razor Kit-1 Mens Razor Handle, 2 Blade Refills,1 Dock,1 Shave Foam\nReview Date: 2021/09/07\nStore: SUPRENT\nAverage Rating: 3.6\nProduct Details: {'Brand': 'SUPRENT', 'Number of Blades': '6', 'Unit Count': '1.00 Count', 'Skin Type': 'All', 'Handle Material': 'Metal', 'Product Dimensions': '3.94 x 3.94 x 1.97 inches; 1.28 Pounds'}\nReview Text: This is a tough one to review...Works great on my neck and face but not so great on my bald head. The ergonomics are fantastic, it's a hefty metal body with nice curves. The blade nestles in the top groove with metal surrounding it...This makes for a difficult close shave from my bald head curves, I like to press down harder and get a close shave but the surrounding metal prevents that from happening. However, on my neck and cheeks, it does well, particularly with a dry shave.<br /><br />The foam is nice but nothing special. Doesn't slick up great but has a nice scent. The holder is okay...Sturdy but holds the blade loosely. Also, as of now, I don't see where I can get replacement blades.\nReview Title: Love the ergonomics. Tough to get a close shave though.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Organic Patchouli Beard Wash by American Shaving Co, Rich, Foaming Cleanser that Softens, cleanse & Strengthens the beard hair, Clean and Refresh your beard with Patchouli Fragrance - 8 oz\nReview Date: 2022/08/29\nStore: American Shaving Co.\nAverage Rating: 3.5\nProduct Details: {'Brand': 'American Shaving Co.', 'Skin Type': 'All', 'Age Range (Description)': 'Adult', 'Number of Items': '1', 'Unit Count': '8.0 Ounce', 'Package Dimensions': '7.84 x 1.85 x 1.81 inches; 8.64 Ounces', 'UPC': '685167904479'}\nReview Text: Not bad...Large size, pumps a thick tan cream. Fair amount of sud/foam. Pretty strong, classic, patchouli scent. Scent washes out a bit with the soap but leaves a nice, light amount behind. Does a good job at cleansing and softening.\nReview Title: Good stuff. Classic patchouli scent.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Electronic Breath Spray for Bad Breath, Dry Mouth Spray, Heavy Super Mint Flavor Rechargeable Oral Care Mist, Oral Care Mouth Freshener\nReview Date: 2022/11/09\nStore: AusKit\nAverage Rating: 4.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.6 x 0.9 x 0.9 inches', 'Item model number': 'KPO2'}\nReview Text: Impressive effectiveness from a simple vapor stream. Provides a strong mint blast and sweet mint flavor. Helps ice down a scratchy throat too. A bit pricey but a pretty neat device. Refills are pricey too.\nReview Title: Impressive.\nRating: 4.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has expressed satisfaction with several products, highlighting excellent qualities and performance. High-quality packaging and design elements were praised, especially in gift sets, which show good value for their price. Specific products were noted for their pleasant and invigorating scents, effective moisturizing and hydrating properties, and ease of use, enhancing the overall user experience. Positive sentiments were also found regarding the aesthetics and results from beauty tools and skin-care items, indicating a trend towards appreciation for products that improve daily grooming routines.\n\nNEGATIVE SUMMARY:\nIn contrast, the user experienced dissatisfaction with several products, particularly related to price versus perceived value. Complaints included products that did not perform as expected, such as a hand soap dispenser that malfunctioned shortly after purchase and a beard conditioner that dried out facial hair despite being intended for moisturizing. Additionally, some scents were mentioned as unpleasant or unsuitable, reflecting a disconnect between the product’s marketed benefits and actual outcomes. Overall, there were several reviews indicating disappointment with product durability and effectiveness.\n\nOVERALL SUMMARY:\nThe user's experiences reflect a blend of satisfaction and frustration with various grooming and skincare products. While many items were appreciated for their quality, effective performance, and attractive scents, several failures in product reliability and value for money led to negative experiences. The user clearly favors items that enhance daily routines but remains critical of products that fail to deliver on their promises, indicating a desire for better consistency in quality and function across purchases.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Softening. Potpourri spice scent.",
    "text": "Pumps out thick and hand soap like... Works to a nice lather. Scent is wonderful potpourri apple spice! Cinnamon, nutmeg, sandalwood forward with a soft fruit background. Goes on gel like, washes off fairly easy. End result is a bit on the dry side but the trade off is very soft and clean feeling skin/hair.",
    "images": [
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61HacwcLz0L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61HacwcLz0L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61HacwcLz0L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/61vaLFgYF8L._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/61vaLFgYF8L._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/61vaLFgYF8L._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71Odl2-lpKL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71Odl2-lpKL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71Odl2-lpKL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://m.media-amazon.com/images/I/71TlKMG+8oL._SL256_.jpg",
        "medium_image_url": "https://m.media-amazon.com/images/I/71TlKMG+8oL._SL800_.jpg",
        "large_image_url": "https://m.media-amazon.com/images/I/71TlKMG+8oL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B0BQWTXV2Q",
    "parent_asin": "B0BQWTXV2Q",
    "user_id": "AHG5KKQMMZJA46LDH73IZ4QUHYXA",
    "timestamp": "2023-02-01 04:54:12.739000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Hanz de Fuko Everything Wash for Hair, Face & Body – All-in-One Soap & Shampoo for Men, Women & Kids, Safe for Sensitive Skin – Minty Rum & Sandalwood, 8 oz. Bottle",
    "average_rating": 4.4,
    "rating_number": 30,
    "features": [
      "3-in-One Body Wash: Made for gentle, thorough cleansing, our Everything Wash rinses away dirt and other impurities from your skin without leaving it tight or dry; it works on the hair, face and body",
      "Works as a Shampoo: This cleanser leaves your hair soft and conditioned without residue",
      "Made for Sensitive Skin: Our body wash is sulfate and paraben free and suitable for all skin types, even those with sensitivities",
      "Effective Ingredients: Featuring 16+ plant extracts, including apple, cactus flower, honeysuckle and lemon, our formula is designed to help cleanse, moisturize, repair and smooth",
      "Premium Hair & Body Products Since 2009: Founded in Los Angeles, Hanz de Fuko has built up a passionate following as a result of our commitment to high-quality, innovative, organic hair and beauty products"
    ],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41GER0dtOyL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41GER0dtOyL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61eEJcSuuiL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/416us8kEJFL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/416us8kEJFL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71Zk3IWy9wL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41gx8ogJTTL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41gx8ogJTTL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61ZhwgMt0HL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51FHCWtjSHL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51FHCWtjSHL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71x2+l5cJGL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "HDF Everything Wash",
        "url": "https://www.amazon.com/vdp/04f1a52d553041bbb250e6696777cb08?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Hanz De Fuko Hair Oil",
        "url": "https://www.amazon.com/vdp/0be3cc1f347f493bb3ef7fc544f2f695?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "Hanz de Fuko TWO TON Insane Hold Pomade",
        "url": "https://www.amazon.com/vdp/ce159c1f02834f079914d278b930be47?ref=dp_vse_rvc_2",
        "user_id": ""
      },
      {
        "title": "Hanz De Fuko Sponge-Wax",
        "url": "https://www.amazon.com/vdp/0b19f8d7c46445838183c3e3b2e14401?ref=dp_vse_rvc_3",
        "user_id": ""
      },
      {
        "title": "Hanz De Fuko Scheme Cream",
        "url": "https://www.amazon.com/vdp/0eb1a047716f4e9ab0c967249291fc18?ref=dp_vse_rvc_4",
        "user_id": ""
      },
      {
        "title": "Hanz de Fuko Butter Balm",
        "url": "https://www.amazon.com/vdp/0b4d5b6311454818980ac6013c22ee9b?ref=dp_vse_rvc_5",
        "user_id": ""
      },
      {
        "title": "Hanz de Fuko Hybridized Wax",
        "url": "https://www.amazon.com/vdp/02dd1ed4029d472094e9ccefa80c2506?ref=dp_vse_rvc_6",
        "user_id": ""
      },
      {
        "title": "Hanz de Fuko Butter Balm - For Skin & Hair",
        "url": "https://www.amazon.com/vdp/0cbb3fbbc3434ddcb858d34ee9ccedbe?ref=dp_vse_rvc_7",
        "user_id": ""
      }
    ],
    "store": "Hanz de Fuko",
    "categories": [],
    "details": {
      "Item Form": "Cream",
      "Skin Type": "Sensitive, Dry",
      "Brand": "Hanz de Fuko",
      "Scent": "Lemon",
      "Material Type Free": "Paraben Free",
      "Package Dimensions": "12.2 x 4.33 x 3.35 inches; 8 Ounces",
      "UPC": "196852229642"
    },
    "bought_together": null
  }
}