{
  "user_id": "AEG2APVZSEZULB4ENINTBABQF7BQ",
  "summary": "=== Purchase Information ===\nProduct Title: Makeup Brush Kit (10 pc, Super Soft Synthetic) - Premium Essential Makeup Brush Set, Contour Brush Kabuki Cosmetics Foundation Blending Blush Eyeliner Face Powder Brush\nReview Date: 2015/02/15\nAverage Rating: 4.0\nProduct Details: {'Recommended Uses For Product': 'Contour, For Eyelining, For Foundation', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '6 x 6 x 1.5 inches; 4.8 Ounces', 'UPC': '856549003206'}\nReview Text: I love this make up it is all I need to have flawless almost perfect look.  It can get messy but once you get use to using it will come natural to you and the messy goes away.  Thank you for a great affordable product.\nReview Title: Great looking skin\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Red Rock Organics Rosacea and Sensitive Skin Serum | Organic & Nano Nutrients- Firms and Tightens-Reduces Puffy Eyes & Soothes Skin with Manuka Honey and Hyaluronic Acid (.5 oz)\nReview Date: 2015/03/15\nStore: Red Rock Organics\nProduct Description: ['FOUR FAMILIAR BEAUTY AND AGING TROUBLES - WHICH DO YOU WANT TO OVERCOME?', \"- Dark Circles? - Puffy Eyes? - Crow's feet? - Discoloration?\", 'Now You Can Reverse the Effects of Aging with Natural Ingredients', \"Our natural, potent anti-aging eye serum is your solution. It's made with 20% hyaluronic acid and 5% vitamin C which are scientifically proven to reduce wrinkles, fine lines and to stimulate collagen.\", 'There have always been two types of eye serums: - Short Term for tightening and plumping the delicate skin around your eye and - Long Term serum which infuses nutrients deep into your skin to repair the damaged cells taking 2 to 3 months to show improvement.', 'We have combined these two serums into one.', \"You won't believe the amazing results in less than 3 minutes, but wait the full 3 months and be even more amazed.\", 'We use Manuka Honey and all of the vitamins, trace minerals and nutrients that your eye tissue cells need to repair themselves.', 'Special Agents and Moisture Magnets', 'We have special agents that go deep into your skin and wake up your collagen producers and tell them to get back to work.', 'We also use moisture magnets that pull moisture particles out of the air and trap them in your cells giving you the instant youthful look you want in minutes.', 'Natural ingredients sit in a soothing aloe vera base. We never use water, mineral oil or alcohol in our products. Aloe vera is excellent at penetrating deep into your skin acting as the carrier for all of the other nutrients bringing them deep into your cells.', 'Anti-Aging Eye Serum comes with our usual money back guarantee.', 'Click the Add to Cart button above to start looking more youthful naturally.']\nAverage Rating: 3.2\nProduct Details: {'Skin Type': 'Oily, Combination, Aging, Dry, Normal', 'Scent': 'Unscented', 'Brand': 'Red Rock Organics', 'Item Form': 'Liquid', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 3.8 inches; 2.4 Ounces', 'UPC': '852684999220', 'Manufacturer': 'Bio Fitness'}\nReview Text: This is another one of my favorite products I was given this to try and give my honest review on,  Red Rock Organics - BEST Eye Gel, Eye Cream... is truly amazing and it really does what it said it would do this is now one of the only products that I will continue to use every day the results are real and they last no gimmicks no hype to this products it does just what it states it will do I have been using now for about  2 weeks and I already see a bid change in my eyes.  The dark circles are all but gone the puffiness has also gone and the fine lines have faded I truly love this product and will use it from now on Thank you\nReview Title: This is real and it works fast\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mother’s Select Stretchmark & Cellulite Complex for Women Thighs, Legs, Stomach, Pregnancy, Slimming, Firming, Removal, Tightening, Hydration, Unsightly Scars, & Fat Deposits\nReview Date: 2015/05/08\nStore: Mama's Select\nAverage Rating: 3.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.1 x 1.3 x 1.3 inches; 4 Ounces', 'UPC': '804879533283', 'Manufacturer': \"Mama's Select\"}\nReview Text: I was given a discount for this product for a review.  I like the feeling of this product and I did see a slight change in color of just a few stretch marks I have but not the change that I was really hoping for that may be that all my stretch marks are old and I have had them for 20+ years, that may play a roll in the results.\nReview Title: Maybe, Maybe Not\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy\nReview Date: 2015/06/02\nAverage Rating: 3.0\nProduct Details: {'Product Dimensions': '1.38 x 1.38 x 5 inches; 3.2 Ounces', 'UPC': '704660231261'}\nReview Text: Anti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy...<br /> HIGHLY CONCENTRATED FORMULA - Argireline is the hero ingredient at the optimal concentration recommended by the manufacturer. Other active ingredients are derived from coconut oil and glycerin, excellent emollients and skin-repairing ingredients due to the medium chain fatty acids that skin can utilize to repair its surface and resist moisture loss; they also have an anti-inflammatory effect that reduces the risk of irritation.<br />- DOCUMENTED CLINICAL STUDIES - Studies based on the use of a 5% concentration of Argireline in volunteers showed that wrinkles around the eyes decreased up to 17% after 15 days of treatment and up to 27% after 30 days of treatment. Controlled studies have also demonstrated that wrinkle depth can also be reduced in the forehead. Our formula has 8%, the high end recommended for optimal results.<br />- NO HARMFUL INGREDIENTS - No parabens, bpa, phthlates, mineral oil, alcohol, sodium benzoate, propylene or any other toxic ingredients. All contents are compared to the EWG's Skin Deep Database for safety and compliance.<br />- MADE IN THE USA in our GMP (good manufacturing practices) and FDA certified facility; 100% fragrance free, 100% cruelty free, 100% manufacturer's money back guarantee.<br /> - Reduce the appearance of fine lines and wrinkles, reduce the appearance of under-eye bags, increase skin firmness and smoothness, repair and refresh skin surface, ideal for all skin types.<br />Paloma Perfect Peptide contains a highly concentrated 8% (by volume, not an 8% solution) of this ingredient, one of the highest available on the market, and recommended by the ingredient creator. Beware of deceptive and incomplete labeling. Ingredients should ALWAYS be listed from highest to lowest concentration, not by just the active ingredients!<br />The best of intelligent science and natural, responsibly sourced ingredients, our formulas are produced in small carefully controlled batches to preserve freshness, and bottled only in airless pumps to prevent the ingredient destabilization and contamination that occurs when products are opened and exposed to air or contact with fingers.<br />Indications<br />Designed to aid in the prevention and elimination of fine lines, wrinkles, and sagging skin.<br />Ingredients<br />Deionized Water, Glycerin, Coconut Oil Extract (suberb emollients as Caprylic/Capric Triglyceride), Argireline 8% (Acetyl Hexapeptide-8), Polyacrylamide (moisture binding agent), C 13-14 (emollient and thickener), Isoparaffin (thickener) Laureth-7 (emulsifier), Phenoxyethanol (cosmetic preservative) Caprylyl Glycol, Sorbic Acid (cosmetic preservatives).<br />Directions<br />Tap the bottle gently on the heel of your hand to settle contents after shipping and to dislodge any air bubbles from the airless pump. After cleansing and toning, apply one or two pumps as needed, each about the size of a pearl, to face, neck and decollete. A 30 ml bottle will last 45-60 days.<br />As I age I pay special attention to those fine lines around my eyes and keeping any forehead lines at bay by using the best of the best anti aging formulas available. I have also learned how critical it is to moisturize and care for the neck and decollete area. These areas are so often overlooked but they are two areas that can really reveal your age or make you look older than you really are. I also notice an increased firmness and smoothness in my skin. I am very impressed at how quickly this moisturizer has worked compared to other more expensive ones that I have tried. It has a pump action applicator making for easy dispensing. I am very pleased with this nice quality moisturizer and I highly recommend it to anyone.<br />I recevid the product for review at a discount this is my honest review on the product  I am a 43 year young and this is a product that I will be using from now on.\nReview Title: Anti Aging product that works\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pure Rosehip Seed Oil Certified Organic Large 4 Ounce Bottle (120 Ml) By Jarosa Beauty - Cold Pressed, Virgin & Unrefined, Carrier, Face & Hair Oil - No Fillers or Fragrance\nReview Date: 2015/06/30\nStore: Jarosa Beauty\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Jarosa Beauty', 'Item Form': 'Oil', 'Unit Count': '4.0 Fl Oz', 'Skin Type': 'Dry', 'Item Volume': '120 Milliliters', 'Product Dimensions': '5 x 2.5 x 2.5 inches; 4 Ounces', 'UPC': '712392715416'}\nReview Text: Pure Rosehip Seed Oil Certified Organic Large 4 Ounce Bottle (120 Ml) By Jarosa Beauty - Cold Pressed, Virgin & Unrefined, Carrier, Face & Hair Oil - No Fillers or Fragranc<br /><br />Jarosa Beauty Organic Rosehip Seed Oil is a super-oil is a staple in every skin care routine and also has many other uses. It deeply moisturizes to create a youthful glow. Used by beauty experts around the world it is now available to you directly from nature, pure and unrefined. This is certified organic by Eco Cert ICO which has the HIGHEST STANDARDS in the cosmetic industry for certified organic. Jarosa Beauty's oil is synthetic free of anything unnatural or harsh, including pesticides, herbicides, dyes, parabens, gmos, or fragrances. This is the ingredient that big cosmetics companies put in their products and charge hundreds of dollars for, for a fraction of the cost and with none of the fillers.<br /><br />Natural Skin-Care Remedy Works for Multiple Skin Care Issues. All Natural & Certified Organic.<br />Do you want brighter more brilliant skin? Have you experienced any of the following problems?<br />Dry, Flaky, or Itchy Skin', Large Pores, Extremely Dry Skin, Scars', Stretch Marks', Dry & Damaged hair<br />The Benefits of Jarosa's Rosehip Seed Oil are Numerous and Include: Hydrates & Restores Flaky, Dry and Itchy Skin', Reduces the Appearance of Scars, Age Spots & Stretch Marks, Minimizes Fine Lines & Wrinkles, Reduces Inflammation from Red Itchy Skin', Reduces the Effects Sun damage<br />Comes in a dark amber glass bottle to protect the integrity of the oil from light exposure. It is also also provided with a pump top to prevent exposure to the air caused by repeatedly opening the bottle to remove a dropper<br /><br />Indications<br />To REJUVENATE and BRIGHTEN Skin, giving it a soft youthful glow To balance the skins oils, preventing acne and breakouts. To minimize the appearance of WRINKLES, AGE SPOTS, STRETCH MARKS, and DISCOLORATION by restoring elasticity to skin, deeply moisturizing, and nourishing to promote healing. To deeply moisturize dry, damaged skin and problem areas like feet, heels, elbows, and hands. To Treat and soften BRITTLE NAILS and hard cuticles Repairing dry, fragile LIPS As a powerful Carrier Oil essential oils such as Bergamot, Clary Sage, Cinnamon Leaf, Eucalyptus, Grapefruit, Lavender, Lemon, Lime, Patchouli, Peppermint, Rosemary, Spearmint, Sweet Orange , Tea Tree Sage, Geranium, Bulgarian Rose, Carrot Seed, Black Pepper, Frankincense, Myrrh, Thieves, Basil & Oregano<br /><br />Ingredients<br />Ingredients: Pure Cold-Pressed Virgin ORGANIC ROSEHIP SEED OIL (Rosa Canina). Our oil is extracted from the seeds of the rose bush. Because it is cold pressed and pure, it is rich in vitamins A & C and essential fatty acids needed to maintain beautiful skin. It's scent is strongly of vitamins and earthy.<br /><br />Directions<br />FOR EXTERNAL USE ONLY Great for all skin types. Apply to wrinkles and aged skin and to prevent the onset of symptoms for aging skin. Our oil is a reddish orange hue, which occurs naturally in the oil. Apply directly to the skin; the color does not stay. Do not apply to open wounds, but may apply over scabs to aid in healing and reduce scars. FACE: Use 2-3 drops after cleansing skin in the morning, allowing time to absorb before applying makeup. At night, apply liberally to face and neck after cleansing and allow to absorb for 20 minutes before bed, so the oil can revitalize and rejuvenate the skin through the night. BODY: Apply liberally to problem areas such as hands, feet, elbows, heels and knees to soften and smooth. You may cup in your hand and add a drop of your favorite essential oil. Apply directly to stretch marks and old scars. Has been known to aid in diminishing the appearance of stretch marks, scars, and age spots. OTHER USES: Add a boost of 3-6 pumps to your lotion, shampoo, conditioner, or other skin care product to improve the results.<br /><br />This particular oil I like because it's a lightweight oil with no other ingredients. There's no strong fragrance and it absorbs easily into the skin. I also use it on my dry frizzy hair and it works so awesome on my hair too! If you would like an all natural product to help with anti-aging, sun damaged skin and help with scars then I highly recommend you use this oil.\nReview Title: Amazing Pure Rosehip Seed Oil\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Retinol 2.5% Cream From Majestic Pure for Face and Eye Area Will Nourish Your Skin, Potent Anti Aging Formula Reduces Wrinkles, Stretch Marks & Redness, 50ml\nReview Date: 2015/08/11\nStore: MAJESTIC PURE\nAverage Rating: 4.0\nProduct Details: {'Brand': 'MAJESTIC PURE', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Use for': 'Face', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.3 x 2.9 x 2.4 inches; 5.6 Ounces', 'UPC': '784190666689 684758988935'}\nReview Text: This is a review for Majestic Pure Retinol Moisturizer Cream..........<br /><br />Product Description<br />Retinol Moisturizer For Anti Aging<br /><br />Retinol Cream is based on advanced formula of carefully picked ingredients to improve your skin recapture a youthful appearance. Retinol (Vitamin A) promotes healthier skin and helps to reverse the signs of aging. It offers many benefits such as<br />• Moisturizes the skin to provide long-lasting hydration<br />• Helps to restore Damaged skin into a healthier and youthful appearance<br />• Helps in Diminishing the appearance of wrinkles and fine lines<br />• Reduces the appearance of hyperpigmentation, such as sun spots, age spots and dark spots<br />• Helps control breakouts and reduces blemishes<br />• Restores firmness and elasticity of skin<br />• Helps to make skin soft, supple skin<br /><br />Majestic Pure 2.5% Retinol moisturizer will truly diminish the signs of aging while nourishing your skin with the most natural and potent ingredients available. This is the most effective anti-wrinkle, anti-aging cream.<br /><br />Majestic Pure Retinol Cream in as excellent anti aging Youth Formula based on 71% Organic ingredients. Hydrates Skin and Helps recapture a youthful appearance.<br />Retinol 2.5% formula is designed to Reduce wrinkles, blemishes, age spots, blotches and Other Signs of Aging. It contains a high concentration of retinol. Retinol moisturizer is nutritious and fabulous. Makes your skin silky reversing the signs of aging.<br />Retinol has been proven to smooth fine lines, fade age spots, reduce pores, and even cure some types of acne. Some peeling may occur from the retinol. It might make your skin sensitive to the sun. Sunscreen is highly recommended.<br />Retinol is effective at managing acne and eczema, as well as improving discolorations and wrinkles from sun damage.<br />100% GUARANTEE - Purchase with complete peace of mind, we are confident we have developed the absolute best Retinol 2.5% Moisturizer cream. If you are not completely satisfied with Majestic Pure Retinol Cream, we will refund your entire purchase.<br /><br />Important Information<br />Indications:<br />Retinol 2.5% provides immediate and long term benefit to support radiant skin. Retinol is effective at managing acne and eczema, as well as improving discolorations and wrinkles from sun damage.<br /><br />Ingredients:<br />2.5% Retinol, shea butter, Propolis, Green Tea, Vitamin E, Vitamin B5, Jojoba Oil<br /><br />Directions:<br />Apply a small amount on face and neck. Lightly massage with fingertips in circular upward motion. Can be used under makeup. For sensitive skin, use once daily at night time. For normal to oily skin, can be applied morning and night. If skin starts to dry, alternate with a more moisturizing lotion. If used during day, follow up with sunscreen as Retinol may make your skin more sensitive.<br /><br />This is a great product I saw results as soon as I applied to face noticed tightening of skin and hydration to my face was amazing I try to use this twice a day but I always use it before bed and when I wake in the mornings I see a big difference in my face the skin looks great the tone is evening out and the fine lines around my mouth and eyes seem to be fading some.  Disclosure: Product was provided for review, thank you\nReview Title: It offers many benefits such as • Moisturizes the skin to provide long-lasting hydration • Helps to restore Damaged skin into a\nRating: 5.0\n--------------------------------------------------",
  "reference": "Makeup Brush Kit (10 pc, Super Soft Synthetic) - Premium Essential Makeup Brush Set, Contour Brush Kabuki Cosmetics Foundation Blending Blush Eyeliner Face Powder Brush\n{'Recommended Uses For Product': 'Contour, For Eyelining, For Foundation', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '6 x 6 x 1.5 inches; 4.8 Ounces', 'UPC': '856549003206'}\nI love this make up it is all I need to have flawless almost perfect look.  It can get messy but once you get use to using it will come natural to you and the messy goes away.  Thank you for a great affordable product.\nGreat looking skin\nRed Rock Organics Rosacea and Sensitive Skin Serum | Organic & Nano Nutrients- Firms and Tightens-Reduces Puffy Eyes & Soothes Skin with Manuka Honey and Hyaluronic Acid (.5 oz)\nRed Rock Organics\n['FOUR FAMILIAR BEAUTY AND AGING TROUBLES - WHICH DO YOU WANT TO OVERCOME?', \"- Dark Circles? - Puffy Eyes? - Crow's feet? - Discoloration?\", 'Now You Can Reverse the Effects of Aging with Natural Ingredients', \"Our natural, potent anti-aging eye serum is your solution. It's made with 20% hyaluronic acid and 5% vitamin C which are scientifically proven to reduce wrinkles, fine lines and to stimulate collagen.\", 'There have always been two types of eye serums: - Short Term for tightening and plumping the delicate skin around your eye and - Long Term serum which infuses nutrients deep into your skin to repair the damaged cells taking 2 to 3 months to show improvement.', 'We have combined these two serums into one.', \"You won't believe the amazing results in less than 3 minutes, but wait the full 3 months and be even more amazed.\", 'We use Manuka Honey and all of the vitamins, trace minerals and nutrients that your eye tissue cells need to repair themselves.', 'Special Agents and Moisture Magnets', 'We have special agents that go deep into your skin and wake up your collagen producers and tell them to get back to work.', 'We also use moisture magnets that pull moisture particles out of the air and trap them in your cells giving you the instant youthful look you want in minutes.', 'Natural ingredients sit in a soothing aloe vera base. We never use water, mineral oil or alcohol in our products. Aloe vera is excellent at penetrating deep into your skin acting as the carrier for all of the other nutrients bringing them deep into your cells.', 'Anti-Aging Eye Serum comes with our usual money back guarantee.', 'Click the Add to Cart button above to start looking more youthful naturally.']\n{'Skin Type': 'Oily, Combination, Aging, Dry, Normal', 'Scent': 'Unscented', 'Brand': 'Red Rock Organics', 'Item Form': 'Liquid', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 3.8 inches; 2.4 Ounces', 'UPC': '852684999220', 'Manufacturer': 'Bio Fitness'}\nThis is another one of my favorite products I was given this to try and give my honest review on,  Red Rock Organics - BEST Eye Gel, Eye Cream... is truly amazing and it really does what it said it would do this is now one of the only products that I will continue to use every day the results are real and they last no gimmicks no hype to this products it does just what it states it will do I have been using now for about  2 weeks and I already see a bid change in my eyes.  The dark circles are all but gone the puffiness has also gone and the fine lines have faded I truly love this product and will use it from now on Thank you\nThis is real and it works fast\nMother’s Select Stretchmark & Cellulite Complex for Women Thighs, Legs, Stomach, Pregnancy, Slimming, Firming, Removal, Tightening, Hydration, Unsightly Scars, & Fat Deposits\nMama's Select\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.1 x 1.3 x 1.3 inches; 4 Ounces', 'UPC': '804879533283', 'Manufacturer': \"Mama's Select\"}\nI was given a discount for this product for a review.  I like the feeling of this product and I did see a slight change in color of just a few stretch marks I have but not the change that I was really hoping for that may be that all my stretch marks are old and I have had them for 20+ years, that may play a roll in the results.\nMaybe, Maybe Not\nAnti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy\n{'Product Dimensions': '1.38 x 1.38 x 5 inches; 3.2 Ounces', 'UPC': '704660231261'}\nAnti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy...<br /> HIGHLY CONCENTRATED FORMULA - Argireline is the hero ingredient at the optimal concentration recommended by the manufacturer. Other active ingredients are derived from coconut oil and glycerin, excellent emollients and skin-repairing ingredients due to the medium chain fatty acids that skin can utilize to repair its surface and resist moisture loss; they also have an anti-inflammatory effect that reduces the risk of irritation.<br />- DOCUMENTED CLINICAL STUDIES - Studies based on the use of a 5% concentration of Argireline in volunteers showed that wrinkles around the eyes decreased up to 17% after 15 days of treatment and up to 27% after 30 days of treatment. Controlled studies have also demonstrated that wrinkle depth can also be reduced in the forehead. Our formula has 8%, the high end recommended for optimal results.<br />- NO HARMFUL INGREDIENTS - No parabens, bpa, phthlates, mineral oil, alcohol, sodium benzoate, propylene or any other toxic ingredients. All contents are compared to the EWG's Skin Deep Database for safety and compliance.<br />- MADE IN THE USA in our GMP (good manufacturing practices) and FDA certified facility; 100% fragrance free, 100% cruelty free, 100% manufacturer's money back guarantee.<br /> - Reduce the appearance of fine lines and wrinkles, reduce the appearance of under-eye bags, increase skin firmness and smoothness, repair and refresh skin surface, ideal for all skin types.<br />Paloma Perfect Peptide contains a highly concentrated 8% (by volume, not an 8% solution) of this ingredient, one of the highest available on the market, and recommended by the ingredient creator. Beware of deceptive and incomplete labeling. Ingredients should ALWAYS be listed from highest to lowest concentration, not by just the active ingredients!<br />The best of intelligent science and natural, responsibly sourced ingredients, our formulas are produced in small carefully controlled batches to preserve freshness, and bottled only in airless pumps to prevent the ingredient destabilization and contamination that occurs when products are opened and exposed to air or contact with fingers.<br />Indications<br />Designed to aid in the prevention and elimination of fine lines, wrinkles, and sagging skin.<br />Ingredients<br />Deionized Water, Glycerin, Coconut Oil Extract (suberb emollients as Caprylic/Capric Triglyceride), Argireline 8% (Acetyl Hexapeptide-8), Polyacrylamide (moisture binding agent), C 13-14 (emollient and thickener), Isoparaffin (thickener) Laureth-7 (emulsifier), Phenoxyethanol (cosmetic preservative) Caprylyl Glycol, Sorbic Acid (cosmetic preservatives).<br />Directions<br />Tap the bottle gently on the heel of your hand to settle contents after shipping and to dislodge any air bubbles from the airless pump. After cleansing and toning, apply one or two pumps as needed, each about the size of a pearl, to face, neck and decollete. A 30 ml bottle will last 45-60 days.<br />As I age I pay special attention to those fine lines around my eyes and keeping any forehead lines at bay by using the best of the best anti aging formulas available. I have also learned how critical it is to moisturize and care for the neck and decollete area. These areas are so often overlooked but they are two areas that can really reveal your age or make you look older than you really are. I also notice an increased firmness and smoothness in my skin. I am very impressed at how quickly this moisturizer has worked compared to other more expensive ones that I have tried. It has a pump action applicator making for easy dispensing. I am very pleased with this nice quality moisturizer and I highly recommend it to anyone.<br />I recevid the product for review at a discount this is my honest review on the product  I am a 43 year young and this is a product that I will be using from now on.\nAnti Aging product that works\nPure Rosehip Seed Oil Certified Organic Large 4 Ounce Bottle (120 Ml) By Jarosa Beauty - Cold Pressed, Virgin & Unrefined, Carrier, Face & Hair Oil - No Fillers or Fragrance\nJarosa Beauty\n{'Brand': 'Jarosa Beauty', 'Item Form': 'Oil', 'Unit Count': '4.0 Fl Oz', 'Skin Type': 'Dry', 'Item Volume': '120 Milliliters', 'Product Dimensions': '5 x 2.5 x 2.5 inches; 4 Ounces', 'UPC': '712392715416'}\nPure Rosehip Seed Oil Certified Organic Large 4 Ounce Bottle (120 Ml) By Jarosa Beauty - Cold Pressed, Virgin & Unrefined, Carrier, Face & Hair Oil - No Fillers or Fragranc<br /><br />Jarosa Beauty Organic Rosehip Seed Oil is a super-oil is a staple in every skin care routine and also has many other uses. It deeply moisturizes to create a youthful glow. Used by beauty experts around the world it is now available to you directly from nature, pure and unrefined. This is certified organic by Eco Cert ICO which has the HIGHEST STANDARDS in the cosmetic industry for certified organic. Jarosa Beauty's oil is synthetic free of anything unnatural or harsh, including pesticides, herbicides, dyes, parabens, gmos, or fragrances. This is the ingredient that big cosmetics companies put in their products and charge hundreds of dollars for, for a fraction of the cost and with none of the fillers.<br /><br />Natural Skin-Care Remedy Works for Multiple Skin Care Issues. All Natural & Certified Organic.<br />Do you want brighter more brilliant skin? Have you experienced any of the following problems?<br />Dry, Flaky, or Itchy Skin', Large Pores, Extremely Dry Skin, Scars', Stretch Marks', Dry & Damaged hair<br />The Benefits of Jarosa's Rosehip Seed Oil are Numerous and Include: Hydrates & Restores Flaky, Dry and Itchy Skin', Reduces the Appearance of Scars, Age Spots & Stretch Marks, Minimizes Fine Lines & Wrinkles, Reduces Inflammation from Red Itchy Skin', Reduces the Effects Sun damage<br />Comes in a dark amber glass bottle to protect the integrity of the oil from light exposure. It is also also provided with a pump top to prevent exposure to the air caused by repeatedly opening the bottle to remove a dropper<br /><br />Indications<br />To REJUVENATE and BRIGHTEN Skin, giving it a soft youthful glow To balance the skins oils, preventing acne and breakouts. To minimize the appearance of WRINKLES, AGE SPOTS, STRETCH MARKS, and DISCOLORATION by restoring elasticity to skin, deeply moisturizing, and nourishing to promote healing. To deeply moisturize dry, damaged skin and problem areas like feet, heels, elbows, and hands. To Treat and soften BRITTLE NAILS and hard cuticles Repairing dry, fragile LIPS As a powerful Carrier Oil essential oils such as Bergamot, Clary Sage, Cinnamon Leaf, Eucalyptus, Grapefruit, Lavender, Lemon, Lime, Patchouli, Peppermint, Rosemary, Spearmint, Sweet Orange , Tea Tree Sage, Geranium, Bulgarian Rose, Carrot Seed, Black Pepper, Frankincense, Myrrh, Thieves, Basil & Oregano<br /><br />Ingredients<br />Ingredients: Pure Cold-Pressed Virgin ORGANIC ROSEHIP SEED OIL (Rosa Canina). Our oil is extracted from the seeds of the rose bush. Because it is cold pressed and pure, it is rich in vitamins A & C and essential fatty acids needed to maintain beautiful skin. It's scent is strongly of vitamins and earthy.<br /><br />Directions<br />FOR EXTERNAL USE ONLY Great for all skin types. Apply to wrinkles and aged skin and to prevent the onset of symptoms for aging skin. Our oil is a reddish orange hue, which occurs naturally in the oil. Apply directly to the skin; the color does not stay. Do not apply to open wounds, but may apply over scabs to aid in healing and reduce scars. FACE: Use 2-3 drops after cleansing skin in the morning, allowing time to absorb before applying makeup. At night, apply liberally to face and neck after cleansing and allow to absorb for 20 minutes before bed, so the oil can revitalize and rejuvenate the skin through the night. BODY: Apply liberally to problem areas such as hands, feet, elbows, heels and knees to soften and smooth. You may cup in your hand and add a drop of your favorite essential oil. Apply directly to stretch marks and old scars. Has been known to aid in diminishing the appearance of stretch marks, scars, and age spots. OTHER USES: Add a boost of 3-6 pumps to your lotion, shampoo, conditioner, or other skin care product to improve the results.<br /><br />This particular oil I like because it's a lightweight oil with no other ingredients. There's no strong fragrance and it absorbs easily into the skin. I also use it on my dry frizzy hair and it works so awesome on my hair too! If you would like an all natural product to help with anti-aging, sun damaged skin and help with scars then I highly recommend you use this oil.\nAmazing Pure Rosehip Seed Oil\nRetinol 2.5% Cream From Majestic Pure for Face and Eye Area Will Nourish Your Skin, Potent Anti Aging Formula Reduces Wrinkles, Stretch Marks & Redness, 50ml\nMAJESTIC PURE\n{'Brand': 'MAJESTIC PURE', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Use for': 'Face', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.3 x 2.9 x 2.4 inches; 5.6 Ounces', 'UPC': '784190666689 684758988935'}\nThis is a review for Majestic Pure Retinol Moisturizer Cream..........<br /><br />Product Description<br />Retinol Moisturizer For Anti Aging<br /><br />Retinol Cream is based on advanced formula of carefully picked ingredients to improve your skin recapture a youthful appearance. Retinol (Vitamin A) promotes healthier skin and helps to reverse the signs of aging. It offers many benefits such as<br />• Moisturizes the skin to provide long-lasting hydration<br />• Helps to restore Damaged skin into a healthier and youthful appearance<br />• Helps in Diminishing the appearance of wrinkles and fine lines<br />• Reduces the appearance of hyperpigmentation, such as sun spots, age spots and dark spots<br />• Helps control breakouts and reduces blemishes<br />• Restores firmness and elasticity of skin<br />• Helps to make skin soft, supple skin<br /><br />Majestic Pure 2.5% Retinol moisturizer will truly diminish the signs of aging while nourishing your skin with the most natural and potent ingredients available. This is the most effective anti-wrinkle, anti-aging cream.<br /><br />Majestic Pure Retinol Cream in as excellent anti aging Youth Formula based on 71% Organic ingredients. Hydrates Skin and Helps recapture a youthful appearance.<br />Retinol 2.5% formula is designed to Reduce wrinkles, blemishes, age spots, blotches and Other Signs of Aging. It contains a high concentration of retinol. Retinol moisturizer is nutritious and fabulous. Makes your skin silky reversing the signs of aging.<br />Retinol has been proven to smooth fine lines, fade age spots, reduce pores, and even cure some types of acne. Some peeling may occur from the retinol. It might make your skin sensitive to the sun. Sunscreen is highly recommended.<br />Retinol is effective at managing acne and eczema, as well as improving discolorations and wrinkles from sun damage.<br />100% GUARANTEE - Purchase with complete peace of mind, we are confident we have developed the absolute best Retinol 2.5% Moisturizer cream. If you are not completely satisfied with Majestic Pure Retinol Cream, we will refund your entire purchase.<br /><br />Important Information<br />Indications:<br />Retinol 2.5% provides immediate and long term benefit to support radiant skin. Retinol is effective at managing acne and eczema, as well as improving discolorations and wrinkles from sun damage.<br /><br />Ingredients:<br />2.5% Retinol, shea butter, Propolis, Green Tea, Vitamin E, Vitamin B5, Jojoba Oil<br /><br />Directions:<br />Apply a small amount on face and neck. Lightly massage with fingertips in circular upward motion. Can be used under makeup. For sensitive skin, use once daily at night time. For normal to oily skin, can be applied morning and night. If skin starts to dry, alternate with a more moisturizing lotion. If used during day, follow up with sunscreen as Retinol may make your skin more sensitive.<br /><br />This is a great product I saw results as soon as I applied to face noticed tightening of skin and hydration to my face was amazing I try to use this twice a day but I always use it before bed and when I wake in the mornings I see a big difference in my face the skin looks great the tone is evening out and the fine lines around my mouth and eyes seem to be fading some.  Disclosure: Product was provided for review, thank you\nIt offers many benefits such as • Moisturizes the skin to provide long-lasting hydration • Helps to restore Damaged skin into a",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Makeup Brush Kit (10 pc, Super Soft Synthetic) - Premium Essential Makeup Brush Set, Contour Brush Kabuki Cosmetics Foundation Blending Blush Eyeliner Face Powder Brush\nReview Date: 2015/02/15\nAverage Rating: 4.0\nProduct Details: {'Recommended Uses For Product': 'Contour, For Eyelining, For Foundation', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '6 x 6 x 1.5 inches; 4.8 Ounces', 'UPC': '856549003206'}\nReview Text: I love this make up it is all I need to have flawless almost perfect look.  It can get messy but once you get use to using it will come natural to you and the messy goes away.  Thank you for a great affordable product.\nReview Title: Great looking skin\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Red Rock Organics Rosacea and Sensitive Skin Serum | Organic & Nano Nutrients- Firms and Tightens-Reduces Puffy Eyes & Soothes Skin with Manuka Honey and Hyaluronic Acid (.5 oz)\nReview Date: 2015/03/15\nStore: Red Rock Organics\nProduct Description: ['FOUR FAMILIAR BEAUTY AND AGING TROUBLES - WHICH DO YOU WANT TO OVERCOME?', \"- Dark Circles? - Puffy Eyes? - Crow's feet? - Discoloration?\", 'Now You Can Reverse the Effects of Aging with Natural Ingredients', \"Our natural, potent anti-aging eye serum is your solution. It's made with 20% hyaluronic acid and 5% vitamin C which are scientifically proven to reduce wrinkles, fine lines and to stimulate collagen.\", 'There have always been two types of eye serums: - Short Term for tightening and plumping the delicate skin around your eye and - Long Term serum which infuses nutrients deep into your skin to repair the damaged cells taking 2 to 3 months to show improvement.', 'We have combined these two serums into one.', \"You won't believe the amazing results in less than 3 minutes, but wait the full 3 months and be even more amazed.\", 'We use Manuka Honey and all of the vitamins, trace minerals and nutrients that your eye tissue cells need to repair themselves.', 'Special Agents and Moisture Magnets', 'We have special agents that go deep into your skin and wake up your collagen producers and tell them to get back to work.', 'We also use moisture magnets that pull moisture particles out of the air and trap them in your cells giving you the instant youthful look you want in minutes.', 'Natural ingredients sit in a soothing aloe vera base. We never use water, mineral oil or alcohol in our products. Aloe vera is excellent at penetrating deep into your skin acting as the carrier for all of the other nutrients bringing them deep into your cells.', 'Anti-Aging Eye Serum comes with our usual money back guarantee.', 'Click the Add to Cart button above to start looking more youthful naturally.']\nAverage Rating: 3.2\nProduct Details: {'Skin Type': 'Oily, Combination, Aging, Dry, Normal', 'Scent': 'Unscented', 'Brand': 'Red Rock Organics', 'Item Form': 'Liquid', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 3.8 inches; 2.4 Ounces', 'UPC': '852684999220', 'Manufacturer': 'Bio Fitness'}\nReview Text: This is another one of my favorite products I was given this to try and give my honest review on,  Red Rock Organics - BEST Eye Gel, Eye Cream... is truly amazing and it really does what it said it would do this is now one of the only products that I will continue to use every day the results are real and they last no gimmicks no hype to this products it does just what it states it will do I have been using now for about  2 weeks and I already see a bid change in my eyes.  The dark circles are all but gone the puffiness has also gone and the fine lines have faded I truly love this product and will use it from now on Thank you\nReview Title: This is real and it works fast\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Mother’s Select Stretchmark & Cellulite Complex for Women Thighs, Legs, Stomach, Pregnancy, Slimming, Firming, Removal, Tightening, Hydration, Unsightly Scars, & Fat Deposits\nReview Date: 2015/05/08\nStore: Mama's Select\nAverage Rating: 3.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.1 x 1.3 x 1.3 inches; 4 Ounces', 'UPC': '804879533283', 'Manufacturer': \"Mama's Select\"}\nReview Text: I was given a discount for this product for a review.  I like the feeling of this product and I did see a slight change in color of just a few stretch marks I have but not the change that I was really hoping for that may be that all my stretch marks are old and I have had them for 20+ years, that may play a roll in the results.\nReview Title: Maybe, Maybe Not\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Anti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy\nReview Date: 2015/06/02\nAverage Rating: 3.0\nProduct Details: {'Product Dimensions': '1.38 x 1.38 x 5 inches; 3.2 Ounces', 'UPC': '704660231261'}\nReview Text: Anti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy...<br /> HIGHLY CONCENTRATED FORMULA - Argireline is the hero ingredient at the optimal concentration recommended by the manufacturer. Other active ingredients are derived from coconut oil and glycerin, excellent emollients and skin-repairing ingredients due to the medium chain fatty acids that skin can utilize to repair its surface and resist moisture loss; they also have an anti-inflammatory effect that reduces the risk of irritation.<br />- DOCUMENTED CLINICAL STUDIES - Studies based on the use of a 5% concentration of Argireline in volunteers showed that wrinkles around the eyes decreased up to 17% after 15 days of treatment and up to 27% after 30 days of treatment. Controlled studies have also demonstrated that wrinkle depth can also be reduced in the forehead. Our formula has 8%, the high end recommended for optimal results.<br />- NO HARMFUL INGREDIENTS - No parabens, bpa, phthlates, mineral oil, alcohol, sodium benzoate, propylene or any other toxic ingredients. All contents are compared to the EWG's Skin Deep Database for safety and compliance.<br />- MADE IN THE USA in our GMP (good manufacturing practices) and FDA certified facility; 100% fragrance free, 100% cruelty free, 100% manufacturer's money back guarantee.<br /> - Reduce the appearance of fine lines and wrinkles, reduce the appearance of under-eye bags, increase skin firmness and smoothness, repair and refresh skin surface, ideal for all skin types.<br />Paloma Perfect Peptide contains a highly concentrated 8% (by volume, not an 8% solution) of this ingredient, one of the highest available on the market, and recommended by the ingredient creator. Beware of deceptive and incomplete labeling. Ingredients should ALWAYS be listed from highest to lowest concentration, not by just the active ingredients!<br />The best of intelligent science and natural, responsibly sourced ingredients, our formulas are produced in small carefully controlled batches to preserve freshness, and bottled only in airless pumps to prevent the ingredient destabilization and contamination that occurs when products are opened and exposed to air or contact with fingers.<br />Indications<br />Designed to aid in the prevention and elimination of fine lines, wrinkles, and sagging skin.<br />Ingredients<br />Deionized Water, Glycerin, Coconut Oil Extract (suberb emollients as Caprylic/Capric Triglyceride), Argireline 8% (Acetyl Hexapeptide-8), Polyacrylamide (moisture binding agent), C 13-14 (emollient and thickener), Isoparaffin (thickener) Laureth-7 (emulsifier), Phenoxyethanol (cosmetic preservative) Caprylyl Glycol, Sorbic Acid (cosmetic preservatives).<br />Directions<br />Tap the bottle gently on the heel of your hand to settle contents after shipping and to dislodge any air bubbles from the airless pump. After cleansing and toning, apply one or two pumps as needed, each about the size of a pearl, to face, neck and decollete. A 30 ml bottle will last 45-60 days.<br />As I age I pay special attention to those fine lines around my eyes and keeping any forehead lines at bay by using the best of the best anti aging formulas available. I have also learned how critical it is to moisturize and care for the neck and decollete area. These areas are so often overlooked but they are two areas that can really reveal your age or make you look older than you really are. I also notice an increased firmness and smoothness in my skin. I am very impressed at how quickly this moisturizer has worked compared to other more expensive ones that I have tried. It has a pump action applicator making for easy dispensing. I am very pleased with this nice quality moisturizer and I highly recommend it to anyone.<br />I recevid the product for review at a discount this is my honest review on the product  I am a 43 year young and this is a product that I will be using from now on.\nReview Title: Anti Aging product that works\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Pure Rosehip Seed Oil Certified Organic Large 4 Ounce Bottle (120 Ml) By Jarosa Beauty - Cold Pressed, Virgin & Unrefined, Carrier, Face & Hair Oil - No Fillers or Fragrance\nReview Date: 2015/06/30\nStore: Jarosa Beauty\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Jarosa Beauty', 'Item Form': 'Oil', 'Unit Count': '4.0 Fl Oz', 'Skin Type': 'Dry', 'Item Volume': '120 Milliliters', 'Product Dimensions': '5 x 2.5 x 2.5 inches; 4 Ounces', 'UPC': '712392715416'}\nReview Text: Pure Rosehip Seed Oil Certified Organic Large 4 Ounce Bottle (120 Ml) By Jarosa Beauty - Cold Pressed, Virgin & Unrefined, Carrier, Face & Hair Oil - No Fillers or Fragranc<br /><br />Jarosa Beauty Organic Rosehip Seed Oil is a super-oil is a staple in every skin care routine and also has many other uses. It deeply moisturizes to create a youthful glow. Used by beauty experts around the world it is now available to you directly from nature, pure and unrefined. This is certified organic by Eco Cert ICO which has the HIGHEST STANDARDS in the cosmetic industry for certified organic. Jarosa Beauty's oil is synthetic free of anything unnatural or harsh, including pesticides, herbicides, dyes, parabens, gmos, or fragrances. This is the ingredient that big cosmetics companies put in their products and charge hundreds of dollars for, for a fraction of the cost and with none of the fillers.<br /><br />Natural Skin-Care Remedy Works for Multiple Skin Care Issues. All Natural & Certified Organic.<br />Do you want brighter more brilliant skin? Have you experienced any of the following problems?<br />Dry, Flaky, or Itchy Skin', Large Pores, Extremely Dry Skin, Scars', Stretch Marks', Dry & Damaged hair<br />The Benefits of Jarosa's Rosehip Seed Oil are Numerous and Include: Hydrates & Restores Flaky, Dry and Itchy Skin', Reduces the Appearance of Scars, Age Spots & Stretch Marks, Minimizes Fine Lines & Wrinkles, Reduces Inflammation from Red Itchy Skin', Reduces the Effects Sun damage<br />Comes in a dark amber glass bottle to protect the integrity of the oil from light exposure. It is also also provided with a pump top to prevent exposure to the air caused by repeatedly opening the bottle to remove a dropper<br /><br />Indications<br />To REJUVENATE and BRIGHTEN Skin, giving it a soft youthful glow To balance the skins oils, preventing acne and breakouts. To minimize the appearance of WRINKLES, AGE SPOTS, STRETCH MARKS, and DISCOLORATION by restoring elasticity to skin, deeply moisturizing, and nourishing to promote healing. To deeply moisturize dry, damaged skin and problem areas like feet, heels, elbows, and hands. To Treat and soften BRITTLE NAILS and hard cuticles Repairing dry, fragile LIPS As a powerful Carrier Oil essential oils such as Bergamot, Clary Sage, Cinnamon Leaf, Eucalyptus, Grapefruit, Lavender, Lemon, Lime, Patchouli, Peppermint, Rosemary, Spearmint, Sweet Orange , Tea Tree Sage, Geranium, Bulgarian Rose, Carrot Seed, Black Pepper, Frankincense, Myrrh, Thieves, Basil & Oregano<br /><br />Ingredients<br />Ingredients: Pure Cold-Pressed Virgin ORGANIC ROSEHIP SEED OIL (Rosa Canina). Our oil is extracted from the seeds of the rose bush. Because it is cold pressed and pure, it is rich in vitamins A & C and essential fatty acids needed to maintain beautiful skin. It's scent is strongly of vitamins and earthy.<br /><br />Directions<br />FOR EXTERNAL USE ONLY Great for all skin types. Apply to wrinkles and aged skin and to prevent the onset of symptoms for aging skin. Our oil is a reddish orange hue, which occurs naturally in the oil. Apply directly to the skin; the color does not stay. Do not apply to open wounds, but may apply over scabs to aid in healing and reduce scars. FACE: Use 2-3 drops after cleansing skin in the morning, allowing time to absorb before applying makeup. At night, apply liberally to face and neck after cleansing and allow to absorb for 20 minutes before bed, so the oil can revitalize and rejuvenate the skin through the night. BODY: Apply liberally to problem areas such as hands, feet, elbows, heels and knees to soften and smooth. You may cup in your hand and add a drop of your favorite essential oil. Apply directly to stretch marks and old scars. Has been known to aid in diminishing the appearance of stretch marks, scars, and age spots. OTHER USES: Add a boost of 3-6 pumps to your lotion, shampoo, conditioner, or other skin care product to improve the results.<br /><br />This particular oil I like because it's a lightweight oil with no other ingredients. There's no strong fragrance and it absorbs easily into the skin. I also use it on my dry frizzy hair and it works so awesome on my hair too! If you would like an all natural product to help with anti-aging, sun damaged skin and help with scars then I highly recommend you use this oil.\nReview Title: Amazing Pure Rosehip Seed Oil\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Retinol 2.5% Cream From Majestic Pure for Face and Eye Area Will Nourish Your Skin, Potent Anti Aging Formula Reduces Wrinkles, Stretch Marks & Redness, 50ml\nReview Date: 2015/08/11\nStore: MAJESTIC PURE\nAverage Rating: 4.0\nProduct Details: {'Brand': 'MAJESTIC PURE', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Use for': 'Face', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.3 x 2.9 x 2.4 inches; 5.6 Ounces', 'UPC': '784190666689 684758988935'}\nReview Text: This is a review for Majestic Pure Retinol Moisturizer Cream..........<br /><br />Product Description<br />Retinol Moisturizer For Anti Aging<br /><br />Retinol Cream is based on advanced formula of carefully picked ingredients to improve your skin recapture a youthful appearance. Retinol (Vitamin A) promotes healthier skin and helps to reverse the signs of aging. It offers many benefits such as<br />• Moisturizes the skin to provide long-lasting hydration<br />• Helps to restore Damaged skin into a healthier and youthful appearance<br />• Helps in Diminishing the appearance of wrinkles and fine lines<br />• Reduces the appearance of hyperpigmentation, such as sun spots, age spots and dark spots<br />• Helps control breakouts and reduces blemishes<br />• Restores firmness and elasticity of skin<br />• Helps to make skin soft, supple skin<br /><br />Majestic Pure 2.5% Retinol moisturizer will truly diminish the signs of aging while nourishing your skin with the most natural and potent ingredients available. This is the most effective anti-wrinkle, anti-aging cream.<br /><br />Majestic Pure Retinol Cream in as excellent anti aging Youth Formula based on 71% Organic ingredients. Hydrates Skin and Helps recapture a youthful appearance.<br />Retinol 2.5% formula is designed to Reduce wrinkles, blemishes, age spots, blotches and Other Signs of Aging. It contains a high concentration of retinol. Retinol moisturizer is nutritious and fabulous. Makes your skin silky reversing the signs of aging.<br />Retinol has been proven to smooth fine lines, fade age spots, reduce pores, and even cure some types of acne. Some peeling may occur from the retinol. It might make your skin sensitive to the sun. Sunscreen is highly recommended.<br />Retinol is effective at managing acne and eczema, as well as improving discolorations and wrinkles from sun damage.<br />100% GUARANTEE - Purchase with complete peace of mind, we are confident we have developed the absolute best Retinol 2.5% Moisturizer cream. If you are not completely satisfied with Majestic Pure Retinol Cream, we will refund your entire purchase.<br /><br />Important Information<br />Indications:<br />Retinol 2.5% provides immediate and long term benefit to support radiant skin. Retinol is effective at managing acne and eczema, as well as improving discolorations and wrinkles from sun damage.<br /><br />Ingredients:<br />2.5% Retinol, shea butter, Propolis, Green Tea, Vitamin E, Vitamin B5, Jojoba Oil<br /><br />Directions:<br />Apply a small amount on face and neck. Lightly massage with fingertips in circular upward motion. Can be used under makeup. For sensitive skin, use once daily at night time. For normal to oily skin, can be applied morning and night. If skin starts to dry, alternate with a more moisturizing lotion. If used during day, follow up with sunscreen as Retinol may make your skin more sensitive.<br /><br />This is a great product I saw results as soon as I applied to face noticed tightening of skin and hydration to my face was amazing I try to use this twice a day but I always use it before bed and when I wake in the mornings I see a big difference in my face the skin looks great the tone is evening out and the fine lines around my mouth and eyes seem to be fading some.  Disclosure: Product was provided for review, thank you\nReview Title: It offers many benefits such as • Moisturizes the skin to provide long-lasting hydration • Helps to restore Damaged skin into a\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has had several positive experiences with various skincare and makeup products. Consistently, they appreciate the effectiveness of items that deliver visible results, such as serums and moisturizers that reduce fine lines, improve skin firmness, and enhance overall appearance. The ease of use and rapid benefits from some products were particularly praised, with mentions of an improved complexion and reduced puffiness. The user values products that are affordable and natural, showcasing a strong preference for organic ingredients that align with their skincare goals, ultimately leading to a feeling of satisfaction and enhanced confidence in their appearance.\n\nNEGATIVE SUMMARY:\nDespite some positive experiences, the user expressed dissatisfaction with certain products that did not meet their expectations, particularly those related to stretch mark and cellulite reduction. They noted a lack of significant change despite consistent use, feeling disappointed that the results were not as noticeable as hoped. Additionally, some products received average ratings indicating mixed feelings about their effectiveness. Concerns about the complexity of certain application processes and the potential for messiness were also mentioned, indicating a desire for simpler, more user-friendly options in their skincare routine.\n\nOVERALL SUMMARY:\nThe user's shopping behavior reflects a balance of positive engagement with effective, affordable skincare and makeup products, while also encountering some disappointments with those that failed to deliver desired results. They have shown a strong preference for organic and natural ingredients, valuing products that yield quick, visible improvements. However, experiences with products targeting stretch marks and cellulite revealed unmet expectations. Overall, the user appears to prioritize quality and effectiveness in their beauty purchases, highlighting a thoughtful approach to personal care while remaining open to exploring new options.",
  "target_interaction": {
    "rating": 5.0,
    "title": "An amazing quality hair extension at a great price...",
    "text": "Grammy® 18 Inch Long Straight Nature Full Head Clips In Human Hair Remy Hair Extensions Clip Extensions Human Hair Clip 7pcs ( #99J Red Wine Burgundy) ...<br /><br />This is a review for Grammy 18&#34; long straight nature full head clip ins.  The hair extensions arrived as planned and they were attached to cardboard  the length of the hair to keep safe. They were then wrapped in a plastic bag to cover hair.  Upon opening the hair I did not smell any kind of smell to the hair.  The hair is soft to the touch and was the right color that I had ordered.  As with any extensions, you receive in the mail first thing you must do is use a hot iron and get the creases out from shipping.  When combing through the hair there were no tangles or missing hair.  I did have a little bit of shedding but that is to be expected and was not enough to have a second thought about.  The hair straightened great with no problems.  The hair is sewn onto a small comb metal clip and I did not see any loose clips.<br /><br />The quantity: The hair is what I expected it to be.  When I compared the two matching pieces together I did note that one has more hair than the matching piece. (You will see in pictures that I have included in this review).  However, this was on the two smallest extensions and not any other piece so for me that is not a big deal because I usually do not use those pieces.<br /><br />The quality: This is my second hair extension I have ever owned. The first one I bought I paid quite a bit of money for and the hair was not near as soft as this one from Grammy.  The quality of this hair is what I expected it to be but with softer hair. I am very pleased with the quality.<br /><br />In my opinion, if you have somewhat fuller hair than one package should give you the fullness you are seeking. With that being said, if your hair is really thin and you are seeking a full thick head of hair look than you might need to go with 2 packages. I would but then you run into how to clip all the pieces in your head. You must have hair to clip these on for them to stay in place.<br /><br />How I manage to be able to keep the extensions in my head all day all night and even sleep in for 2 nights if I want is by starting with clean dry straighten hair.  I then part my hair every spot that I will be clipping an extension to and I spray with a strong hair spray let dry and then I take a small man's comb and tease just at the base of my hair close to my scalp,  that gives the clips something to hold them in tightly no matter what I am doing.<br /><br />I hope that this review has helped in your buying decision.  I have posted pictures that I hope will allow for you to see each piece and the clipping device.  Thank you for reading and if you have any questions or comments please feel free to post.  I have added 12 pictures and I hope this is helpful.<br /><br />DISCLOSURE: Product received to test with the option to review. No financial compensation is EVER accepted, and a vendor may request that item be returned. I reserve 4 and 5-star ratings for products I would either recommend to others or buy for myself. This is a great product that I would highly recommend.<br />[[ASIN:B00P8XLPO4 Grammy® 18 Inch Long Straight Nature Full Head Clips In Human Hair Remy Hair Extensions Clip Extensions Human Hair Clip 7pcs ( #99J Red Wine Burgundy)]]",
    "images": [
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71+Tgr16iNL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71+Tgr16iNL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71+Tgr16iNL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/711vOmpiaNL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/711vOmpiaNL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/711vOmpiaNL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/717UDZaopDL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/717UDZaopDL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/717UDZaopDL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Mw0uioyrL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Mw0uioyrL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Mw0uioyrL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Wrw0m3LfL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Wrw0m3LfL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71Wrw0m3LfL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71c2lJnpyUL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71c2lJnpyUL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71c2lJnpyUL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71f9D2Pk2UL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71f9D2Pk2UL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71f9D2Pk2UL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71fDcdsF2zL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71fDcdsF2zL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71fDcdsF2zL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71iO0wRU2nL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71iO0wRU2nL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71iO0wRU2nL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71q2ra+i03L._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71q2ra+i03L._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71q2ra+i03L.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/71wa0uMxPBL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/71wa0uMxPBL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/71wa0uMxPBL.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81746zlF0DL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81746zlF0DL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81746zlF0DL.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B00P8XLPO4",
    "parent_asin": "B00P8XLPO4",
    "user_id": "AEG2APVZSEZULB4ENINTBABQF7BQ",
    "timestamp": "2016-06-12 01:25:42",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "Clip Hair Extension, Grammy 18 Inch Long Straight Nature Full Head Clips In Human Hair Remy Hair Extensions Clip Extensions Human Hair Clip 7pcs (#99J Red Wine Burgundy)",
    "average_rating": 3.6,
    "rating_number": 14,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41z4DxTL2bL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41z4DxTL2bL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81XQdbcHbRL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41sidsH80fL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41sidsH80fL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61jwX7zx9kL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51BZ4bpMYxL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51BZ4bpMYxL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61VeSQfTPDL._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5114qTzAMAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/5114qTzAMAL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71XX-9-vB5L._SL1000_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41i3D11ekhL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41i3D11ekhL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81O+bUD3B6L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41YabE+AQeL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41YabE+AQeL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/813OS-SJlxL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Grammy",
    "categories": [],
    "details": {
      "Brand": "Grammy",
      "Material": "Human Hair",
      "Extension Length": "18 Inches",
      "Hair Type": "Straight",
      "Material Feature": "Natural",
      "Is Discontinued By Manufacturer": "No",
      "Package Dimensions": "11.5 x 4.5 x 0.9 inches; 0.35 Ounces",
      "UPC": "622450346950"
    },
    "bought_together": null
  }
}