{
  "user_id": "AGRO3UTLKTF724ZW64QXGWXJ4SYA",
  "summary": "=== Purchase Information ===\nProduct Title: LumaRx Facial Cleansing Brush with 1-Minute Pulsing Timer and LED Speed Indicator Light, Rechargeable and Showerproof, White/Silver\nReview Date: 2016/03/04\nAverage Rating: 3.8\nProduct Details: {'Material': 'Silver', 'Brand': 'LumaRx', 'Color': 'White/Silver', 'Power Source': 'electric', 'Item Dimensions LxWxH': '3.88 x 7 x 10 inches', 'Product Dimensions': '3.88 x 7 x 10 inches; 5.6 Ounces', 'Item model number': '1', 'UPC': '074590543216', 'Manufacturer': 'LumaRx'}\nReview Text: What is possibly better than a good hot bath, and I mean in the Tub!  A good soak is totally relaxing.  I was in a deep soak cycle when I was able to first use this product.  My old one uses replaceable batteries and not water proof.  This is water proof, and rechargeable---perfect for the bath.  Try not to let it submerge, I think that's common sense. Works just fine in the shower too.  Started out with a good exfoliate  which removes and loosens dry skin.  Next step was to use Dove liquid on the brushes----feels fabulous and clean.  That is how I enjoy my personal time.<br />All of the heads you will ever need are included with this luxury product from the very sensitive brush up to the massaging brush head, there are three.  It has three speeds, a very small footprint and lasts a long time on a single charge, a one minute timer allowing the right time per area.  It really isn't complicated at all---also comes with a patent carrying case, large enough to hold everything.  Excellent product!\nReview Title: Exfoliate And Clean\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lesentia Tinted Moisturizer with SPF 31 – Tinted Moisturizer For Face With Spf and Blemish Concealer with All Natural Ingredients like Shea Butter, Jojoba Oil, Vitamin E and Zinc* (Medium - 2fl oz)\nReview Date: 2020/06/28\nStore: L'esentia\nAverage Rating: 3.1\nProduct Details: {'Brand': \"L'esentia\", 'Scent': 'Unscented', 'Item Form': 'Oil', 'Active Ingredients': 'jojoba,vitamin e,zinc', 'Unit Count': '2.00 Fl Oz', 'Package Dimensions': '6.77 x 2.32 x 2.24 inches; 5.29 Ounces', 'UPC': '850016254009'}\nReview Text: Barb:  I'm not so sure if I like wearing this L'esentia Tinted Moisturizer.  The SPF 31 is supposed to be great if out in the sun, but this product doesn't really feel like it's absorbed into my face, leaving it shiny.  I don't want it dripping down into my eyes!  If I happen to touch my face it leaves a slick film on the fingers, and I worry about touching anything else and leaving a smudge of the tint.  The moisturizer has an unusual scent when applied, smelling like natural clay.  Maybe that's the Zinc Oxide?  After a while it's not quite as noticeable.  I usually use a same brand moisturizer with SPF 15 and the liquid foundation also SPF 15, and they appear to be much better absorbed into my face.  If this product works for others, that's good.  I'm very fair, and I must say that the tint actually worked  by putting a little natural color in my face.  That was the only part worthwhile for me.\nReview Title: Lots of sun protection, but don't like feel on face.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nReview Date: 2020/08/29\nStore: RAREKIND\nAverage Rating: 3.8\nProduct Details: {'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nReview Text: This RAREKIND tube of lipstick arrived earlier as I was getting dressed to greet the day.  So I was able to try it out now!  The color I have is called Maple Road, a very intense, but subtle brownish red.  It's a matte, and so far has good staying power, and I'm a blotter (only a tiny bit on the tissue).  The box that contains the hard plastic square container tube of lipstick says \"Fade Matte Lipstick\", but not sure what is meant.  The lipstick itself is the usual swivel type, but with my lipstick when I swiveled it up to use, it didn't want to swivel back down into the protective tube.  I had to gently push the lipstick down into the tube.  Hopefully it's just a glitch with mine.  Anyway, it appears to be a nice lipstick that stays on for a long while, and feels comfortable on the lips\nReview Title: Good staying power, feels like nothing's there!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Unny Club Black Square Lipstick (Magenta) | matte lipstick\nReview Date: 2020/09/03\nStore: UNNY CLUB\nAverage Rating: 3.3\nProduct Details: {'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.8 x 0.91 x 0.87 inches; 1.13 Ounces'}\nReview Text: This Unny Club Lipstick arrived yesterday, and I'm wearing it today.  I'm a blotter, so I gave it a try and almost, most of it is staying on the lips, though lips are showing through a bit.  Perhaps I blotted too soon!  This lipstick has a lot of oils added to the formula, and that definitely helps with the moisture, though I'm noticing a bit of flakiness (could be just my lips).  The oils were listed on the Amazon site, the actual product box is written in Korean.  It's a matte, so no gloss, just actual color.  The square black plastic tube has a magnet installed to make sure the top stays in place, a nice feature.  *Now, about the color....I got this because it's supposed to be \"Magenta\".  To my reasoning, the color Magenta is a red/blue, purplish-red shade.  This Magenta (MO6) is closer to a muted Scarlet, an intense red with a bit of orange.....no blue at all.  Anyway, it's a pretty color even though I was expecting a different shade.  Not sure if the wrong label was installed, or if that's the name of color that the manufacturer chose.  Barb\nReview Title: A nice matte look and feeling, but color is different.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: COSMOCOS FromNature Perfect Cover BB Cream - Light Beighe/Natural Beige SPF 50+ / PA+++ Sun Protection, Natural Skin Tone, High Coverage Korean Cosmetic K Beauty - 50g (1.76 fl oz) (Natural Beige)\nReview Date: 2020/10/09\nStore: COSMOCOS\nAverage Rating: 3.8\nProduct Details: {'Brand': 'COSMOCOS', 'Item Form': 'Cream', 'Unit Count': '1.72 Fl Oz', 'Number of Items': '1', 'Use for': 'Skin', 'Product Dimensions': '6 x 1.5 x 1 inches; 2.89 Ounces', 'UPC': '364597179557'}\nReview Text: When this new BB Blemish Balm arrived today I was not dressed yet, so that gave me the opportunity to try it out - now.  Well, I like it!  I myself, would call it a makeup because it matches the color of my face perfectly - #2 Natural Beige, just a tad darker to give me some color.  It's a creamy liquid in a squeezable tube and glides easily over my face.  It covers those blemishes (on me, age spots) and other spots nicely, and more coats can be added if necessary.  I only used one.  It's supposed to be good for all skin types, and is SPF 50.  As for ingredients, don't know, other than there are pictures of 8 flower extracts and a fruit extract, so I'm guessing those are in the mix.  This product is made in Korea, so most of any writing is in Korean. (There was also some samples of hair products tucked in the box, that was nice.)  I've had it on for a few hours and it still looks great, and feels like there's nothing there.....that's a good thing.  It's a Perfect Cover!\nReview Title: Excellent coverage called a Blemish Balm.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Moisturizing Facial Emulsion for Restoring Hydrating Smoothing Skin from Manilla Natural Skincare\nReview Date: 2020/10/25\nStore: Manilla Natural Skincare\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Manilla Natural Skincare', 'Scent': 'Coconut', 'Item Form': 'Serum', 'Unit Count': '1.00 Fl Oz', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 5.9 inches; 2.19 Ounces'}\nReview Text: This is my second type of skin moisturizer from Manilla.  This one is called nuditum, a Daily Facial Moisturizer with argan oil and aloe vera extract.  I decided this one would be perfect as a night moisturizer, so last night was the first tryout, after removing my makeup.  It comes in a slim container with a pump dispenser, and it's a pure white lightweight lotion that soaks in easily, not greasy, and has no discernible scent.  It felt very nice on my face, soothing and comfortable, exactly what I needed after all day wearing makeup.  This one is also made in Lithuania, I love trying products from other countries......broaden my horizons!\nReview Title: A good pure and moisturizing lotion for your face.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Follain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nReview Date: 2020/11/06\nStore: Follain\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nReview Text: This is an excellent bar of soap.  Also, it's one of my favorite scents - Lavender!  This bar is rectangular with rounded sides, and is heavy and substantial at 5 oz.  It's a creamy white color, with a strong and wonderful scent of Lavender and Bergamot, which is a citrus.  Bergamot is also used in my preferred special tea of Earl Grey, so it's very familiar.  I used this nice soap in my morning shower and was pleased that it produced a lot of rich lather and suds, and it left me feeling super clean.  Listed in it's ingredients is a mixture of Palm oils that are from certified growers of this product, and it contains Shea Butter that helps keep the skin moisturized, and Argan oil that's good for a comfortable and soft feel on the skin.  The citrusy Bergamot and sharp Lavender flowery scent hung on for a while.  It should be great for either sex, with that nice pure and clean smell.  This bar fits comfortably in the hand, and should last for some time, as it's a good sturdy and hard soap.\nReview Title: Wonderful lasting scent, and it cleans very well!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bodyguard Moisturizing Immunity Soap 6pk | 7 Essential Oils Clinically Evaluated to Boost Immunity and Protect | Moisturizes with Sweet Almond Oil | Healthy PH for Skin Microbiome\nReview Date: 2020/11/09\nStore: Spa-Da\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Dry', 'Brand': 'Spa-Da', 'Scent': 'Cinnamon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8 x 3.3 x 2 inches; 7.2 Ounces', 'UPC': '860003618998'}\nReview Text: This soap is different.  Can't make up my mind - like or dislike.  It's a very unique soap, as it's hand made (in Ohio) using some interesting ingredients that one would find in their kitchen.  Ingredients that are made into Essential Oils that are blended with other stuff to create this soap.  The scent is really strange, it's spicy, herby, woodsy, and lingering...hard to pinpoint or explain.  There are 6 little soaps in a package, and are a modernized teardrop shape, a shield design, making it easy to hold while using.  The soap actually produces a good amount of a creamy, sudsy lather, and leaves the skin very clean and soft with a nice amount of moisture.  They say it's good for immunity support with the special natural oils, but all I know is it's a great cleaning soap that has a very distinctive and potent scent.\nReview Title: A unique and potent cleansing soap, lots of suds.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Organic Sweet Almond Oil and Fractionated Coconut Oil Bundle for Hair and Skin, 100% Pure and Natural, Hexane-Free, Moisturizing, For Healthy Skin, Silky Hair, Multiuse Body Oil, 16 fl. Oz X 2\nReview Date: 2020/11/21\nStore: Shiny Leaf\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Shiny Leaf', 'Scent': 'Almond Oil and Fractionated Coconut', 'Item Form': 'Oil', 'Unit Count': '32.00 Fl Oz', 'Number of Items': '2', 'Package Dimensions': '8.62 x 5.04 x 2.48 inches; 2.23 Pounds', 'UPC': '781584950669'}\nReview Text: These two Oils are just what I've been wanting.  I've purchased everything I need to set up some nice Reed Diffusers with Essential Oils.  Everything except some carrier oils to mix with the E Os.  Fractionated Coconut, and Sweet Almond Oils seem to be the preferred carrier oils, and they're Organic.  These two oils from Shiny Leaf are pure and natural, refined and lightweight, and perfect for my use.  They are in liquid form and clear.  Of course, these Oils are also wonderful for therapeutic use for a great massage therapy, and for a moisturizer for skin or hair.  There's plenty in these 16 fl. oz. bottles to try everything.  What fun!\nReview Title: Perfect carrier oils, or for therapeutic use.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Simply Dana Cellular De-Stressing Cream, Boost Skin's Natural Immunity - 1 oz (30g)\nReview Date: 2021/01/26\nStore: Simply Dana\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Simply Dana', 'Item Form': 'Cream', 'Unit Count': '1.0 Ounce', 'Item Volume': '1 Fluid Ounces', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.4 x 2.2 x 1.4 inches; 1.59 Ounces', 'UPC': '602573781319'}\nReview Text: This Simply Dana is referred to as a De-Stressing Cream.  I don't think my skin is stressed, but thought it still might be worthwhile. For now, I'm not going out in the world to submit my body to any skin-stressing stuff in the air.  So far, I used the very nice cream at bedtime, and in the morning before applying my makeup.  I really like it under my makeup.  The pure white lightweight moisturizing cream spreads easily and soaks in fast, leaving my face and neck feeling ready for anything (perhaps it's coating is boosting my skin's natural immunity = protection).  There is no stickiness, no sheen, no oiliness, and no noticeable coating, just a comfortable feeling like there's nothing there except a clean face ready for the day.  The 1 oz. container is a frosted glass with a subtle light grayish silver plastic lid.  There is a slight scent that is not objectionable, and doesn't last.  (On the bottom is the expiration date of 6/2021 - not a lot of time - this is 1/2021)  The ingredients appear to be similar to a lot of other products used in cosmetics.  Listing a few: Safflower oil - good for acne, eczema, and healthy skin; Silicone - helps product glide smoothly and easily; Squalane - an emollient and moisturizer, good for hydrating the skin; Chamomile (wild) - for the scent, not much.\nReview Title: A nice lightweight moisturizing cream - De-Stressing -?\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2 Pack Soy Candles Gifts Set for Women, Lavender, Fir Scent, Hand Poured Aromatherapy Candle, Scented with Essential Oils, Each 8 oz\nReview Date: 2021/03/04\nStore: Natural Amor Los Angeles\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Natural Amor Los Angeles', 'Color': 'White', 'Number of Items': '2', 'Operating Time': '40 Hours', 'Specific Uses For Product': 'Scented,Aromatherapy,Scent', 'Shape': 'Round', 'Material': 'Soy Wax', 'Occasion': 'Travel', 'Seasons': 'All Season', 'Special Feature': 'Portable,Scented,Eco-friendly', 'Package Dimensions': '4.61 x 3.35 x 3.27 inches; 1.01 Pounds', 'UPC': '618119939175'}\nReview Text: This 2-pack of Natural Amor Candles is a real treasure.  The scents are wonderful and relaxing, reminiscent of walking through a forest or field and breathing in \"nature\".  The candles are made of 100% Soy wax (the best) and scented with natural Essential Oils of Lavender and Balsam Fir.  What's nice about these is the subtleness of the fragrances, but yet, still very aromatic - no sweet flowery smell, just nature!  The candles come in very substantial round metal tins and lids, about 2 1/4\" high, and 3\" across.  Each candle has 2 wicks sticking up out of the creamy white wax.  These together or separate would make a nice gift for anyone that would enjoy an alternative to a floral aromatherapy.....a very nice and different, calming experience.\nReview Title: Two excellent scents worth trying - back to nature.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DOYIZZ Makeup Brushes Set, 10pcs Crystal Handle Makeup Brushes Powder Blush Brush Foundation Brush Blending Eye shadow Concealer Makeup Brush Set (Pink)\nReview Date: 2021/03/23\nStore: DOYIZZ\nAverage Rating: 4.6\nProduct Details: {'Brand': 'DOYIZZ', 'Recommended Uses For Product': 'For Eyeshadow, For Concealing, For Blush, For Foundation', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '10.55 x 5.71 x 1.61 inches; 5.93 Ounces'}\nReview Text: I needed some new cosmetic Brushes!  My current ones were very shop-worn and ratty-looking.  Even after washing they were not worth keeping any longer.  This lovely DOYIZZ Makeup Brush Set is just what I needed.  There are 10 brushes of varied sizes, though I'll be using the \"big 4\" fluffy ones the most.  Fluffy is the word for these!  They are super fluffy, and so soft, and feel really good when applying my blush, bronzer, highlighter, or powder.  The smaller brushes are great for any eye shadows, and etc.  Did I mention how pretty and girly-girl this set is?  The business end - soft fluffy brushes, is a lovely shade of light pink, as is the metal attached to the handles, and the handles.....oh! the handles - they are a gorgeous and sparkly Faceted Crystal pink tinted clear plastic that's easy to handle when using. Makes me smile - a bright spot to my morning.  All in all, a very efficient, attractive, and useful Set!\nReview Title: Gorgeous Makeup Brush Set - so soft and fluffy, and sparkly too!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Movo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#2 Natural)\nReview Date: 2021/05/06\nStore: Movo\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 3.07 Ounces'}\nReview Text: Boy, did I get lucky!  I picked the perfect color (#2 Natural) for my complexion.  This Movo Matte Liquid Makeup is very nice and easy to apply, especially with the included Makeup Sponge.  I used both this morning applying over my moisturizer, and it smoothed on perfectly.  The appearance looks \"natural\" and even covers those slight blemishes, and feels comfortable on my face and neck!  It has a matte finish that looks great, but also has suppleness and moisture instead of looking flaky and dry.  Glad to try this wonderful product.\nReview Title: Perfect color for me, and looks great on my face!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SHIONLE - Semi Matte Air Lipstick: Creamy semi matte lipstick | Long Lasting | Great Coverage | Creamy Texture | 03 FLAMINGO PINK | 3.3g\nReview Date: 2021/06/10\nStore: SHIONLE\nAverage Rating: 3.1\nProduct Details: {'Brand': 'SHIONLE', 'Skin Type': 'Dry', 'Item Form': 'Cream', 'Finish Type': 'Matte', 'Product Benefits': 'Long Lasting,Moisturizing', 'Product Dimensions': '1 x 3 x 1 inches; 0.12 Ounces'}\nReview Text: Disappointed!  The lipstick arrived today and I immediately opened and noticed there was no pink caste for the color #03 - Pink Flamingo.  It's more of an light coral/orangey shade, more subtle that a distinct orange, but still no pink.  Thought I'd try it out anyway, hoping once on my lips some pink might appear and show through.  Well, the only thing that showed through was my lips!  That's not what I wanted!  My lips are pretty much wrinkled with lines, and it was obvious that this new lipstick was not going to fill-in on the lips and look good.  In fact, my lips look very dry and raggedy wearing this lipstick, kind of a hit or miss look.  The box says semi-matte air lipstick.  Finally just wiped off the lipstick =  a no - go for me.\nReview Title: Was expecting a pinkish shade - nope!  Lipstick itself - ehhh!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Florona Hibiscus Air Freshener Room Spray for Deep Sleep 100 ml - Pure & Unrefined Pillow Mist & Linen Spray (Hibiscus,100 ml)\nReview Date: 2021/06/29\nStore: FLORONA\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '5.75 x 1.73 x 1.69 inches; 4.73 Ounces', 'Manufacturer': 'FLORONA'}\nReview Text: I was curious about the Hibiscus scent.  We're all familiar with other stronger scents like rose, or gardenia, and etc., but this one is more obscure.  Well, it's different, interesting, with a subtle but deep aroma, that actually is quite nice.  I spritzed some mist on our bedding about an hour before bedtime, and later the slight delicate fragrance was there in a relaxing sort of way.  Not powerful or too flowery for the guys, but a nice calm fresh and peaceful scent that was only minimally noticeable.  The spray has only 3 ingredients listed: water, hibiscus oil, castor oil, - no chemicals, so looks to be pretty pure, and it comes in a clear plastic bottle with plastic pump.  A good alternative to some of those annoying strong scents in a can.\nReview Title: Lovely subtle scent of Hibiscus, relaxing.\nRating: 5.0\n--------------------------------------------------",
  "reference": "LumaRx Facial Cleansing Brush with 1-Minute Pulsing Timer and LED Speed Indicator Light, Rechargeable and Showerproof, White/Silver\n{'Material': 'Silver', 'Brand': 'LumaRx', 'Color': 'White/Silver', 'Power Source': 'electric', 'Item Dimensions LxWxH': '3.88 x 7 x 10 inches', 'Product Dimensions': '3.88 x 7 x 10 inches; 5.6 Ounces', 'Item model number': '1', 'UPC': '074590543216', 'Manufacturer': 'LumaRx'}\nWhat is possibly better than a good hot bath, and I mean in the Tub!  A good soak is totally relaxing.  I was in a deep soak cycle when I was able to first use this product.  My old one uses replaceable batteries and not water proof.  This is water proof, and rechargeable---perfect for the bath.  Try not to let it submerge, I think that's common sense. Works just fine in the shower too.  Started out with a good exfoliate  which removes and loosens dry skin.  Next step was to use Dove liquid on the brushes----feels fabulous and clean.  That is how I enjoy my personal time.<br />All of the heads you will ever need are included with this luxury product from the very sensitive brush up to the massaging brush head, there are three.  It has three speeds, a very small footprint and lasts a long time on a single charge, a one minute timer allowing the right time per area.  It really isn't complicated at all---also comes with a patent carrying case, large enough to hold everything.  Excellent product!\nExfoliate And Clean\nLesentia Tinted Moisturizer with SPF 31 – Tinted Moisturizer For Face With Spf and Blemish Concealer with All Natural Ingredients like Shea Butter, Jojoba Oil, Vitamin E and Zinc* (Medium - 2fl oz)\nL'esentia\n{'Brand': \"L'esentia\", 'Scent': 'Unscented', 'Item Form': 'Oil', 'Active Ingredients': 'jojoba,vitamin e,zinc', 'Unit Count': '2.00 Fl Oz', 'Package Dimensions': '6.77 x 2.32 x 2.24 inches; 5.29 Ounces', 'UPC': '850016254009'}\nBarb:  I'm not so sure if I like wearing this L'esentia Tinted Moisturizer.  The SPF 31 is supposed to be great if out in the sun, but this product doesn't really feel like it's absorbed into my face, leaving it shiny.  I don't want it dripping down into my eyes!  If I happen to touch my face it leaves a slick film on the fingers, and I worry about touching anything else and leaving a smudge of the tint.  The moisturizer has an unusual scent when applied, smelling like natural clay.  Maybe that's the Zinc Oxide?  After a while it's not quite as noticeable.  I usually use a same brand moisturizer with SPF 15 and the liquid foundation also SPF 15, and they appear to be much better absorbed into my face.  If this product works for others, that's good.  I'm very fair, and I must say that the tint actually worked  by putting a little natural color in my face.  That was the only part worthwhile for me.\nLots of sun protection, but don't like feel on face.\nRAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nRAREKIND\n{'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nThis RAREKIND tube of lipstick arrived earlier as I was getting dressed to greet the day.  So I was able to try it out now!  The color I have is called Maple Road, a very intense, but subtle brownish red.  It's a matte, and so far has good staying power, and I'm a blotter (only a tiny bit on the tissue).  The box that contains the hard plastic square container tube of lipstick says \"Fade Matte Lipstick\", but not sure what is meant.  The lipstick itself is the usual swivel type, but with my lipstick when I swiveled it up to use, it didn't want to swivel back down into the protective tube.  I had to gently push the lipstick down into the tube.  Hopefully it's just a glitch with mine.  Anyway, it appears to be a nice lipstick that stays on for a long while, and feels comfortable on the lips\nGood staying power, feels like nothing's there!\nUnny Club Black Square Lipstick (Magenta) | matte lipstick\nUNNY CLUB\n{'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.8 x 0.91 x 0.87 inches; 1.13 Ounces'}\nThis Unny Club Lipstick arrived yesterday, and I'm wearing it today.  I'm a blotter, so I gave it a try and almost, most of it is staying on the lips, though lips are showing through a bit.  Perhaps I blotted too soon!  This lipstick has a lot of oils added to the formula, and that definitely helps with the moisture, though I'm noticing a bit of flakiness (could be just my lips).  The oils were listed on the Amazon site, the actual product box is written in Korean.  It's a matte, so no gloss, just actual color.  The square black plastic tube has a magnet installed to make sure the top stays in place, a nice feature.  *Now, about the color....I got this because it's supposed to be \"Magenta\".  To my reasoning, the color Magenta is a red/blue, purplish-red shade.  This Magenta (MO6) is closer to a muted Scarlet, an intense red with a bit of orange.....no blue at all.  Anyway, it's a pretty color even though I was expecting a different shade.  Not sure if the wrong label was installed, or if that's the name of color that the manufacturer chose.  Barb\nA nice matte look and feeling, but color is different.\nCOSMOCOS FromNature Perfect Cover BB Cream - Light Beighe/Natural Beige SPF 50+ / PA+++ Sun Protection, Natural Skin Tone, High Coverage Korean Cosmetic K Beauty - 50g (1.76 fl oz) (Natural Beige)\nCOSMOCOS\n{'Brand': 'COSMOCOS', 'Item Form': 'Cream', 'Unit Count': '1.72 Fl Oz', 'Number of Items': '1', 'Use for': 'Skin', 'Product Dimensions': '6 x 1.5 x 1 inches; 2.89 Ounces', 'UPC': '364597179557'}\nWhen this new BB Blemish Balm arrived today I was not dressed yet, so that gave me the opportunity to try it out - now.  Well, I like it!  I myself, would call it a makeup because it matches the color of my face perfectly - #2 Natural Beige, just a tad darker to give me some color.  It's a creamy liquid in a squeezable tube and glides easily over my face.  It covers those blemishes (on me, age spots) and other spots nicely, and more coats can be added if necessary.  I only used one.  It's supposed to be good for all skin types, and is SPF 50.  As for ingredients, don't know, other than there are pictures of 8 flower extracts and a fruit extract, so I'm guessing those are in the mix.  This product is made in Korea, so most of any writing is in Korean. (There was also some samples of hair products tucked in the box, that was nice.)  I've had it on for a few hours and it still looks great, and feels like there's nothing there.....that's a good thing.  It's a Perfect Cover!\nExcellent coverage called a Blemish Balm.\nMoisturizing Facial Emulsion for Restoring Hydrating Smoothing Skin from Manilla Natural Skincare\nManilla Natural Skincare\n{'Brand': 'Manilla Natural Skincare', 'Scent': 'Coconut', 'Item Form': 'Serum', 'Unit Count': '1.00 Fl Oz', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 5.9 inches; 2.19 Ounces'}\nThis is my second type of skin moisturizer from Manilla.  This one is called nuditum, a Daily Facial Moisturizer with argan oil and aloe vera extract.  I decided this one would be perfect as a night moisturizer, so last night was the first tryout, after removing my makeup.  It comes in a slim container with a pump dispenser, and it's a pure white lightweight lotion that soaks in easily, not greasy, and has no discernible scent.  It felt very nice on my face, soothing and comfortable, exactly what I needed after all day wearing makeup.  This one is also made in Lithuania, I love trying products from other countries......broaden my horizons!\nA good pure and moisturizing lotion for your face.\nFollain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nFollain\n{'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nThis is an excellent bar of soap.  Also, it's one of my favorite scents - Lavender!  This bar is rectangular with rounded sides, and is heavy and substantial at 5 oz.  It's a creamy white color, with a strong and wonderful scent of Lavender and Bergamot, which is a citrus.  Bergamot is also used in my preferred special tea of Earl Grey, so it's very familiar.  I used this nice soap in my morning shower and was pleased that it produced a lot of rich lather and suds, and it left me feeling super clean.  Listed in it's ingredients is a mixture of Palm oils that are from certified growers of this product, and it contains Shea Butter that helps keep the skin moisturized, and Argan oil that's good for a comfortable and soft feel on the skin.  The citrusy Bergamot and sharp Lavender flowery scent hung on for a while.  It should be great for either sex, with that nice pure and clean smell.  This bar fits comfortably in the hand, and should last for some time, as it's a good sturdy and hard soap.\nWonderful lasting scent, and it cleans very well!\nBodyguard Moisturizing Immunity Soap 6pk | 7 Essential Oils Clinically Evaluated to Boost Immunity and Protect | Moisturizes with Sweet Almond Oil | Healthy PH for Skin Microbiome\nSpa-Da\n{'Item Form': 'Oil', 'Skin Type': 'Dry', 'Brand': 'Spa-Da', 'Scent': 'Cinnamon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8 x 3.3 x 2 inches; 7.2 Ounces', 'UPC': '860003618998'}\nThis soap is different.  Can't make up my mind - like or dislike.  It's a very unique soap, as it's hand made (in Ohio) using some interesting ingredients that one would find in their kitchen.  Ingredients that are made into Essential Oils that are blended with other stuff to create this soap.  The scent is really strange, it's spicy, herby, woodsy, and lingering...hard to pinpoint or explain.  There are 6 little soaps in a package, and are a modernized teardrop shape, a shield design, making it easy to hold while using.  The soap actually produces a good amount of a creamy, sudsy lather, and leaves the skin very clean and soft with a nice amount of moisture.  They say it's good for immunity support with the special natural oils, but all I know is it's a great cleaning soap that has a very distinctive and potent scent.\nA unique and potent cleansing soap, lots of suds.\nOrganic Sweet Almond Oil and Fractionated Coconut Oil Bundle for Hair and Skin, 100% Pure and Natural, Hexane-Free, Moisturizing, For Healthy Skin, Silky Hair, Multiuse Body Oil, 16 fl. Oz X 2\nShiny Leaf\n{'Brand': 'Shiny Leaf', 'Scent': 'Almond Oil and Fractionated Coconut', 'Item Form': 'Oil', 'Unit Count': '32.00 Fl Oz', 'Number of Items': '2', 'Package Dimensions': '8.62 x 5.04 x 2.48 inches; 2.23 Pounds', 'UPC': '781584950669'}\nThese two Oils are just what I've been wanting.  I've purchased everything I need to set up some nice Reed Diffusers with Essential Oils.  Everything except some carrier oils to mix with the E Os.  Fractionated Coconut, and Sweet Almond Oils seem to be the preferred carrier oils, and they're Organic.  These two oils from Shiny Leaf are pure and natural, refined and lightweight, and perfect for my use.  They are in liquid form and clear.  Of course, these Oils are also wonderful for therapeutic use for a great massage therapy, and for a moisturizer for skin or hair.  There's plenty in these 16 fl. oz. bottles to try everything.  What fun!\nPerfect carrier oils, or for therapeutic use.\nSimply Dana Cellular De-Stressing Cream, Boost Skin's Natural Immunity - 1 oz (30g)\nSimply Dana\n{'Brand': 'Simply Dana', 'Item Form': 'Cream', 'Unit Count': '1.0 Ounce', 'Item Volume': '1 Fluid Ounces', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.4 x 2.2 x 1.4 inches; 1.59 Ounces', 'UPC': '602573781319'}\nThis Simply Dana is referred to as a De-Stressing Cream.  I don't think my skin is stressed, but thought it still might be worthwhile. For now, I'm not going out in the world to submit my body to any skin-stressing stuff in the air.  So far, I used the very nice cream at bedtime, and in the morning before applying my makeup.  I really like it under my makeup.  The pure white lightweight moisturizing cream spreads easily and soaks in fast, leaving my face and neck feeling ready for anything (perhaps it's coating is boosting my skin's natural immunity = protection).  There is no stickiness, no sheen, no oiliness, and no noticeable coating, just a comfortable feeling like there's nothing there except a clean face ready for the day.  The 1 oz. container is a frosted glass with a subtle light grayish silver plastic lid.  There is a slight scent that is not objectionable, and doesn't last.  (On the bottom is the expiration date of 6/2021 - not a lot of time - this is 1/2021)  The ingredients appear to be similar to a lot of other products used in cosmetics.  Listing a few: Safflower oil - good for acne, eczema, and healthy skin; Silicone - helps product glide smoothly and easily; Squalane - an emollient and moisturizer, good for hydrating the skin; Chamomile (wild) - for the scent, not much.\nA nice lightweight moisturizing cream - De-Stressing -?\n2 Pack Soy Candles Gifts Set for Women, Lavender, Fir Scent, Hand Poured Aromatherapy Candle, Scented with Essential Oils, Each 8 oz\nNatural Amor Los Angeles\n{'Brand': 'Natural Amor Los Angeles', 'Color': 'White', 'Number of Items': '2', 'Operating Time': '40 Hours', 'Specific Uses For Product': 'Scented,Aromatherapy,Scent', 'Shape': 'Round', 'Material': 'Soy Wax', 'Occasion': 'Travel', 'Seasons': 'All Season', 'Special Feature': 'Portable,Scented,Eco-friendly', 'Package Dimensions': '4.61 x 3.35 x 3.27 inches; 1.01 Pounds', 'UPC': '618119939175'}\nThis 2-pack of Natural Amor Candles is a real treasure.  The scents are wonderful and relaxing, reminiscent of walking through a forest or field and breathing in \"nature\".  The candles are made of 100% Soy wax (the best) and scented with natural Essential Oils of Lavender and Balsam Fir.  What's nice about these is the subtleness of the fragrances, but yet, still very aromatic - no sweet flowery smell, just nature!  The candles come in very substantial round metal tins and lids, about 2 1/4\" high, and 3\" across.  Each candle has 2 wicks sticking up out of the creamy white wax.  These together or separate would make a nice gift for anyone that would enjoy an alternative to a floral aromatherapy.....a very nice and different, calming experience.\nTwo excellent scents worth trying - back to nature.\nDOYIZZ Makeup Brushes Set, 10pcs Crystal Handle Makeup Brushes Powder Blush Brush Foundation Brush Blending Eye shadow Concealer Makeup Brush Set (Pink)\nDOYIZZ\n{'Brand': 'DOYIZZ', 'Recommended Uses For Product': 'For Eyeshadow, For Concealing, For Blush, For Foundation', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '10.55 x 5.71 x 1.61 inches; 5.93 Ounces'}\nI needed some new cosmetic Brushes!  My current ones were very shop-worn and ratty-looking.  Even after washing they were not worth keeping any longer.  This lovely DOYIZZ Makeup Brush Set is just what I needed.  There are 10 brushes of varied sizes, though I'll be using the \"big 4\" fluffy ones the most.  Fluffy is the word for these!  They are super fluffy, and so soft, and feel really good when applying my blush, bronzer, highlighter, or powder.  The smaller brushes are great for any eye shadows, and etc.  Did I mention how pretty and girly-girl this set is?  The business end - soft fluffy brushes, is a lovely shade of light pink, as is the metal attached to the handles, and the handles.....oh! the handles - they are a gorgeous and sparkly Faceted Crystal pink tinted clear plastic that's easy to handle when using. Makes me smile - a bright spot to my morning.  All in all, a very efficient, attractive, and useful Set!\nGorgeous Makeup Brush Set - so soft and fluffy, and sparkly too!\nMovo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#2 Natural)\nMovo\n{'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 3.07 Ounces'}\nBoy, did I get lucky!  I picked the perfect color (#2 Natural) for my complexion.  This Movo Matte Liquid Makeup is very nice and easy to apply, especially with the included Makeup Sponge.  I used both this morning applying over my moisturizer, and it smoothed on perfectly.  The appearance looks \"natural\" and even covers those slight blemishes, and feels comfortable on my face and neck!  It has a matte finish that looks great, but also has suppleness and moisture instead of looking flaky and dry.  Glad to try this wonderful product.\nPerfect color for me, and looks great on my face!\nSHIONLE - Semi Matte Air Lipstick: Creamy semi matte lipstick | Long Lasting | Great Coverage | Creamy Texture | 03 FLAMINGO PINK | 3.3g\nSHIONLE\n{'Brand': 'SHIONLE', 'Skin Type': 'Dry', 'Item Form': 'Cream', 'Finish Type': 'Matte', 'Product Benefits': 'Long Lasting,Moisturizing', 'Product Dimensions': '1 x 3 x 1 inches; 0.12 Ounces'}\nDisappointed!  The lipstick arrived today and I immediately opened and noticed there was no pink caste for the color #03 - Pink Flamingo.  It's more of an light coral/orangey shade, more subtle that a distinct orange, but still no pink.  Thought I'd try it out anyway, hoping once on my lips some pink might appear and show through.  Well, the only thing that showed through was my lips!  That's not what I wanted!  My lips are pretty much wrinkled with lines, and it was obvious that this new lipstick was not going to fill-in on the lips and look good.  In fact, my lips look very dry and raggedy wearing this lipstick, kind of a hit or miss look.  The box says semi-matte air lipstick.  Finally just wiped off the lipstick =  a no - go for me.\nWas expecting a pinkish shade - nope!  Lipstick itself - ehhh!\nFlorona Hibiscus Air Freshener Room Spray for Deep Sleep 100 ml - Pure & Unrefined Pillow Mist & Linen Spray (Hibiscus,100 ml)\nFLORONA\n{'Package Dimensions': '5.75 x 1.73 x 1.69 inches; 4.73 Ounces', 'Manufacturer': 'FLORONA'}\nI was curious about the Hibiscus scent.  We're all familiar with other stronger scents like rose, or gardenia, and etc., but this one is more obscure.  Well, it's different, interesting, with a subtle but deep aroma, that actually is quite nice.  I spritzed some mist on our bedding about an hour before bedtime, and later the slight delicate fragrance was there in a relaxing sort of way.  Not powerful or too flowery for the guys, but a nice calm fresh and peaceful scent that was only minimally noticeable.  The spray has only 3 ingredients listed: water, hibiscus oil, castor oil, - no chemicals, so looks to be pretty pure, and it comes in a clear plastic bottle with plastic pump.  A good alternative to some of those annoying strong scents in a can.\nLovely subtle scent of Hibiscus, relaxing.",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: LumaRx Facial Cleansing Brush with 1-Minute Pulsing Timer and LED Speed Indicator Light, Rechargeable and Showerproof, White/Silver\nReview Date: 2016/03/04\nAverage Rating: 3.8\nProduct Details: {'Material': 'Silver', 'Brand': 'LumaRx', 'Color': 'White/Silver', 'Power Source': 'electric', 'Item Dimensions LxWxH': '3.88 x 7 x 10 inches', 'Product Dimensions': '3.88 x 7 x 10 inches; 5.6 Ounces', 'Item model number': '1', 'UPC': '074590543216', 'Manufacturer': 'LumaRx'}\nReview Text: What is possibly better than a good hot bath, and I mean in the Tub!  A good soak is totally relaxing.  I was in a deep soak cycle when I was able to first use this product.  My old one uses replaceable batteries and not water proof.  This is water proof, and rechargeable---perfect for the bath.  Try not to let it submerge, I think that's common sense. Works just fine in the shower too.  Started out with a good exfoliate  which removes and loosens dry skin.  Next step was to use Dove liquid on the brushes----feels fabulous and clean.  That is how I enjoy my personal time.<br />All of the heads you will ever need are included with this luxury product from the very sensitive brush up to the massaging brush head, there are three.  It has three speeds, a very small footprint and lasts a long time on a single charge, a one minute timer allowing the right time per area.  It really isn't complicated at all---also comes with a patent carrying case, large enough to hold everything.  Excellent product!\nReview Title: Exfoliate And Clean\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Lesentia Tinted Moisturizer with SPF 31 – Tinted Moisturizer For Face With Spf and Blemish Concealer with All Natural Ingredients like Shea Butter, Jojoba Oil, Vitamin E and Zinc* (Medium - 2fl oz)\nReview Date: 2020/06/28\nStore: L'esentia\nAverage Rating: 3.1\nProduct Details: {'Brand': \"L'esentia\", 'Scent': 'Unscented', 'Item Form': 'Oil', 'Active Ingredients': 'jojoba,vitamin e,zinc', 'Unit Count': '2.00 Fl Oz', 'Package Dimensions': '6.77 x 2.32 x 2.24 inches; 5.29 Ounces', 'UPC': '850016254009'}\nReview Text: Barb:  I'm not so sure if I like wearing this L'esentia Tinted Moisturizer.  The SPF 31 is supposed to be great if out in the sun, but this product doesn't really feel like it's absorbed into my face, leaving it shiny.  I don't want it dripping down into my eyes!  If I happen to touch my face it leaves a slick film on the fingers, and I worry about touching anything else and leaving a smudge of the tint.  The moisturizer has an unusual scent when applied, smelling like natural clay.  Maybe that's the Zinc Oxide?  After a while it's not quite as noticeable.  I usually use a same brand moisturizer with SPF 15 and the liquid foundation also SPF 15, and they appear to be much better absorbed into my face.  If this product works for others, that's good.  I'm very fair, and I must say that the tint actually worked  by putting a little natural color in my face.  That was the only part worthwhile for me.\nReview Title: Lots of sun protection, but don't like feel on face.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: RAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nReview Date: 2020/08/29\nStore: RAREKIND\nAverage Rating: 3.8\nProduct Details: {'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nReview Text: This RAREKIND tube of lipstick arrived earlier as I was getting dressed to greet the day.  So I was able to try it out now!  The color I have is called Maple Road, a very intense, but subtle brownish red.  It's a matte, and so far has good staying power, and I'm a blotter (only a tiny bit on the tissue).  The box that contains the hard plastic square container tube of lipstick says \"Fade Matte Lipstick\", but not sure what is meant.  The lipstick itself is the usual swivel type, but with my lipstick when I swiveled it up to use, it didn't want to swivel back down into the protective tube.  I had to gently push the lipstick down into the tube.  Hopefully it's just a glitch with mine.  Anyway, it appears to be a nice lipstick that stays on for a long while, and feels comfortable on the lips\nReview Title: Good staying power, feels like nothing's there!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Unny Club Black Square Lipstick (Magenta) | matte lipstick\nReview Date: 2020/09/03\nStore: UNNY CLUB\nAverage Rating: 3.3\nProduct Details: {'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.8 x 0.91 x 0.87 inches; 1.13 Ounces'}\nReview Text: This Unny Club Lipstick arrived yesterday, and I'm wearing it today.  I'm a blotter, so I gave it a try and almost, most of it is staying on the lips, though lips are showing through a bit.  Perhaps I blotted too soon!  This lipstick has a lot of oils added to the formula, and that definitely helps with the moisture, though I'm noticing a bit of flakiness (could be just my lips).  The oils were listed on the Amazon site, the actual product box is written in Korean.  It's a matte, so no gloss, just actual color.  The square black plastic tube has a magnet installed to make sure the top stays in place, a nice feature.  *Now, about the color....I got this because it's supposed to be \"Magenta\".  To my reasoning, the color Magenta is a red/blue, purplish-red shade.  This Magenta (MO6) is closer to a muted Scarlet, an intense red with a bit of orange.....no blue at all.  Anyway, it's a pretty color even though I was expecting a different shade.  Not sure if the wrong label was installed, or if that's the name of color that the manufacturer chose.  Barb\nReview Title: A nice matte look and feeling, but color is different.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: COSMOCOS FromNature Perfect Cover BB Cream - Light Beighe/Natural Beige SPF 50+ / PA+++ Sun Protection, Natural Skin Tone, High Coverage Korean Cosmetic K Beauty - 50g (1.76 fl oz) (Natural Beige)\nReview Date: 2020/10/09\nStore: COSMOCOS\nAverage Rating: 3.8\nProduct Details: {'Brand': 'COSMOCOS', 'Item Form': 'Cream', 'Unit Count': '1.72 Fl Oz', 'Number of Items': '1', 'Use for': 'Skin', 'Product Dimensions': '6 x 1.5 x 1 inches; 2.89 Ounces', 'UPC': '364597179557'}\nReview Text: When this new BB Blemish Balm arrived today I was not dressed yet, so that gave me the opportunity to try it out - now.  Well, I like it!  I myself, would call it a makeup because it matches the color of my face perfectly - #2 Natural Beige, just a tad darker to give me some color.  It's a creamy liquid in a squeezable tube and glides easily over my face.  It covers those blemishes (on me, age spots) and other spots nicely, and more coats can be added if necessary.  I only used one.  It's supposed to be good for all skin types, and is SPF 50.  As for ingredients, don't know, other than there are pictures of 8 flower extracts and a fruit extract, so I'm guessing those are in the mix.  This product is made in Korea, so most of any writing is in Korean. (There was also some samples of hair products tucked in the box, that was nice.)  I've had it on for a few hours and it still looks great, and feels like there's nothing there.....that's a good thing.  It's a Perfect Cover!\nReview Title: Excellent coverage called a Blemish Balm.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Moisturizing Facial Emulsion for Restoring Hydrating Smoothing Skin from Manilla Natural Skincare\nReview Date: 2020/10/25\nStore: Manilla Natural Skincare\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Manilla Natural Skincare', 'Scent': 'Coconut', 'Item Form': 'Serum', 'Unit Count': '1.00 Fl Oz', 'Skin Type': 'Sensitive', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 5.9 inches; 2.19 Ounces'}\nReview Text: This is my second type of skin moisturizer from Manilla.  This one is called nuditum, a Daily Facial Moisturizer with argan oil and aloe vera extract.  I decided this one would be perfect as a night moisturizer, so last night was the first tryout, after removing my makeup.  It comes in a slim container with a pump dispenser, and it's a pure white lightweight lotion that soaks in easily, not greasy, and has no discernible scent.  It felt very nice on my face, soothing and comfortable, exactly what I needed after all day wearing makeup.  This one is also made in Lithuania, I love trying products from other countries......broaden my horizons!\nReview Title: A good pure and moisturizing lotion for your face.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Follain Everybody Bar Soap | Lavender & Bergamot, Skin Moisturizing Hand & Body Cleanser with Shea Butter, Argan Oil, Hydrate for Softer Skin, Non-Drying, Rich-Lather, Cruelty Free, 5 oz\nReview Date: 2020/11/06\nStore: Follain\nAverage Rating: 4.1\nProduct Details: {'Item Form': 'Bar', 'Skin Type': 'Sensitive', 'Brand': 'Follain', 'Scent': 'Bergamot,Lavender', 'Material Feature': 'Cru, Non GMO, Dermatologist Tested', 'Product Dimensions': '3.75 x 2.25 x 1 inches; 5.11 Ounces', 'Item model number': '692764483009', 'UPC': '692764483009'}\nReview Text: This is an excellent bar of soap.  Also, it's one of my favorite scents - Lavender!  This bar is rectangular with rounded sides, and is heavy and substantial at 5 oz.  It's a creamy white color, with a strong and wonderful scent of Lavender and Bergamot, which is a citrus.  Bergamot is also used in my preferred special tea of Earl Grey, so it's very familiar.  I used this nice soap in my morning shower and was pleased that it produced a lot of rich lather and suds, and it left me feeling super clean.  Listed in it's ingredients is a mixture of Palm oils that are from certified growers of this product, and it contains Shea Butter that helps keep the skin moisturized, and Argan oil that's good for a comfortable and soft feel on the skin.  The citrusy Bergamot and sharp Lavender flowery scent hung on for a while.  It should be great for either sex, with that nice pure and clean smell.  This bar fits comfortably in the hand, and should last for some time, as it's a good sturdy and hard soap.\nReview Title: Wonderful lasting scent, and it cleans very well!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bodyguard Moisturizing Immunity Soap 6pk | 7 Essential Oils Clinically Evaluated to Boost Immunity and Protect | Moisturizes with Sweet Almond Oil | Healthy PH for Skin Microbiome\nReview Date: 2020/11/09\nStore: Spa-Da\nAverage Rating: 4.0\nProduct Details: {'Item Form': 'Oil', 'Skin Type': 'Dry', 'Brand': 'Spa-Da', 'Scent': 'Cinnamon', 'Age Range (Description)': 'Adult', 'Package Dimensions': '8 x 3.3 x 2 inches; 7.2 Ounces', 'UPC': '860003618998'}\nReview Text: This soap is different.  Can't make up my mind - like or dislike.  It's a very unique soap, as it's hand made (in Ohio) using some interesting ingredients that one would find in their kitchen.  Ingredients that are made into Essential Oils that are blended with other stuff to create this soap.  The scent is really strange, it's spicy, herby, woodsy, and lingering...hard to pinpoint or explain.  There are 6 little soaps in a package, and are a modernized teardrop shape, a shield design, making it easy to hold while using.  The soap actually produces a good amount of a creamy, sudsy lather, and leaves the skin very clean and soft with a nice amount of moisture.  They say it's good for immunity support with the special natural oils, but all I know is it's a great cleaning soap that has a very distinctive and potent scent.\nReview Title: A unique and potent cleansing soap, lots of suds.\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Organic Sweet Almond Oil and Fractionated Coconut Oil Bundle for Hair and Skin, 100% Pure and Natural, Hexane-Free, Moisturizing, For Healthy Skin, Silky Hair, Multiuse Body Oil, 16 fl. Oz X 2\nReview Date: 2020/11/21\nStore: Shiny Leaf\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Shiny Leaf', 'Scent': 'Almond Oil and Fractionated Coconut', 'Item Form': 'Oil', 'Unit Count': '32.00 Fl Oz', 'Number of Items': '2', 'Package Dimensions': '8.62 x 5.04 x 2.48 inches; 2.23 Pounds', 'UPC': '781584950669'}\nReview Text: These two Oils are just what I've been wanting.  I've purchased everything I need to set up some nice Reed Diffusers with Essential Oils.  Everything except some carrier oils to mix with the E Os.  Fractionated Coconut, and Sweet Almond Oils seem to be the preferred carrier oils, and they're Organic.  These two oils from Shiny Leaf are pure and natural, refined and lightweight, and perfect for my use.  They are in liquid form and clear.  Of course, these Oils are also wonderful for therapeutic use for a great massage therapy, and for a moisturizer for skin or hair.  There's plenty in these 16 fl. oz. bottles to try everything.  What fun!\nReview Title: Perfect carrier oils, or for therapeutic use.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Simply Dana Cellular De-Stressing Cream, Boost Skin's Natural Immunity - 1 oz (30g)\nReview Date: 2021/01/26\nStore: Simply Dana\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Simply Dana', 'Item Form': 'Cream', 'Unit Count': '1.0 Ounce', 'Item Volume': '1 Fluid Ounces', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.4 x 2.2 x 1.4 inches; 1.59 Ounces', 'UPC': '602573781319'}\nReview Text: This Simply Dana is referred to as a De-Stressing Cream.  I don't think my skin is stressed, but thought it still might be worthwhile. For now, I'm not going out in the world to submit my body to any skin-stressing stuff in the air.  So far, I used the very nice cream at bedtime, and in the morning before applying my makeup.  I really like it under my makeup.  The pure white lightweight moisturizing cream spreads easily and soaks in fast, leaving my face and neck feeling ready for anything (perhaps it's coating is boosting my skin's natural immunity = protection).  There is no stickiness, no sheen, no oiliness, and no noticeable coating, just a comfortable feeling like there's nothing there except a clean face ready for the day.  The 1 oz. container is a frosted glass with a subtle light grayish silver plastic lid.  There is a slight scent that is not objectionable, and doesn't last.  (On the bottom is the expiration date of 6/2021 - not a lot of time - this is 1/2021)  The ingredients appear to be similar to a lot of other products used in cosmetics.  Listing a few: Safflower oil - good for acne, eczema, and healthy skin; Silicone - helps product glide smoothly and easily; Squalane - an emollient and moisturizer, good for hydrating the skin; Chamomile (wild) - for the scent, not much.\nReview Title: A nice lightweight moisturizing cream - De-Stressing -?\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 2 Pack Soy Candles Gifts Set for Women, Lavender, Fir Scent, Hand Poured Aromatherapy Candle, Scented with Essential Oils, Each 8 oz\nReview Date: 2021/03/04\nStore: Natural Amor Los Angeles\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Natural Amor Los Angeles', 'Color': 'White', 'Number of Items': '2', 'Operating Time': '40 Hours', 'Specific Uses For Product': 'Scented,Aromatherapy,Scent', 'Shape': 'Round', 'Material': 'Soy Wax', 'Occasion': 'Travel', 'Seasons': 'All Season', 'Special Feature': 'Portable,Scented,Eco-friendly', 'Package Dimensions': '4.61 x 3.35 x 3.27 inches; 1.01 Pounds', 'UPC': '618119939175'}\nReview Text: This 2-pack of Natural Amor Candles is a real treasure.  The scents are wonderful and relaxing, reminiscent of walking through a forest or field and breathing in \"nature\".  The candles are made of 100% Soy wax (the best) and scented with natural Essential Oils of Lavender and Balsam Fir.  What's nice about these is the subtleness of the fragrances, but yet, still very aromatic - no sweet flowery smell, just nature!  The candles come in very substantial round metal tins and lids, about 2 1/4\" high, and 3\" across.  Each candle has 2 wicks sticking up out of the creamy white wax.  These together or separate would make a nice gift for anyone that would enjoy an alternative to a floral aromatherapy.....a very nice and different, calming experience.\nReview Title: Two excellent scents worth trying - back to nature.\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: DOYIZZ Makeup Brushes Set, 10pcs Crystal Handle Makeup Brushes Powder Blush Brush Foundation Brush Blending Eye shadow Concealer Makeup Brush Set (Pink)\nReview Date: 2021/03/23\nStore: DOYIZZ\nAverage Rating: 4.6\nProduct Details: {'Brand': 'DOYIZZ', 'Recommended Uses For Product': 'For Eyeshadow, For Concealing, For Blush, For Foundation', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '10.55 x 5.71 x 1.61 inches; 5.93 Ounces'}\nReview Text: I needed some new cosmetic Brushes!  My current ones were very shop-worn and ratty-looking.  Even after washing they were not worth keeping any longer.  This lovely DOYIZZ Makeup Brush Set is just what I needed.  There are 10 brushes of varied sizes, though I'll be using the \"big 4\" fluffy ones the most.  Fluffy is the word for these!  They are super fluffy, and so soft, and feel really good when applying my blush, bronzer, highlighter, or powder.  The smaller brushes are great for any eye shadows, and etc.  Did I mention how pretty and girly-girl this set is?  The business end - soft fluffy brushes, is a lovely shade of light pink, as is the metal attached to the handles, and the handles.....oh! the handles - they are a gorgeous and sparkly Faceted Crystal pink tinted clear plastic that's easy to handle when using. Makes me smile - a bright spot to my morning.  All in all, a very efficient, attractive, and useful Set!\nReview Title: Gorgeous Makeup Brush Set - so soft and fluffy, and sparkly too!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Movo Matte Liquid Foundation and Makeup Sponge Set – 5 Shades Medium Coverage Lightweight Feel Liquid Foundation for Combination / Oily Skin, Flawless Natural Look with Matte Finish 1.0 oz (#2 Natural)\nReview Date: 2021/05/06\nStore: Movo\nAverage Rating: 3.6\nProduct Details: {'Item Form': 'Liquid', 'Skin Type': 'Oily', 'Finish Type': 'Matte', 'Package Information': 'Bottle', 'Brand': 'Movo', 'Product Dimensions': '5.11 x 1.57 x 1 inches; 3.07 Ounces'}\nReview Text: Boy, did I get lucky!  I picked the perfect color (#2 Natural) for my complexion.  This Movo Matte Liquid Makeup is very nice and easy to apply, especially with the included Makeup Sponge.  I used both this morning applying over my moisturizer, and it smoothed on perfectly.  The appearance looks \"natural\" and even covers those slight blemishes, and feels comfortable on my face and neck!  It has a matte finish that looks great, but also has suppleness and moisture instead of looking flaky and dry.  Glad to try this wonderful product.\nReview Title: Perfect color for me, and looks great on my face!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: SHIONLE - Semi Matte Air Lipstick: Creamy semi matte lipstick | Long Lasting | Great Coverage | Creamy Texture | 03 FLAMINGO PINK | 3.3g\nReview Date: 2021/06/10\nStore: SHIONLE\nAverage Rating: 3.1\nProduct Details: {'Brand': 'SHIONLE', 'Skin Type': 'Dry', 'Item Form': 'Cream', 'Finish Type': 'Matte', 'Product Benefits': 'Long Lasting,Moisturizing', 'Product Dimensions': '1 x 3 x 1 inches; 0.12 Ounces'}\nReview Text: Disappointed!  The lipstick arrived today and I immediately opened and noticed there was no pink caste for the color #03 - Pink Flamingo.  It's more of an light coral/orangey shade, more subtle that a distinct orange, but still no pink.  Thought I'd try it out anyway, hoping once on my lips some pink might appear and show through.  Well, the only thing that showed through was my lips!  That's not what I wanted!  My lips are pretty much wrinkled with lines, and it was obvious that this new lipstick was not going to fill-in on the lips and look good.  In fact, my lips look very dry and raggedy wearing this lipstick, kind of a hit or miss look.  The box says semi-matte air lipstick.  Finally just wiped off the lipstick =  a no - go for me.\nReview Title: Was expecting a pinkish shade - nope!  Lipstick itself - ehhh!\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Florona Hibiscus Air Freshener Room Spray for Deep Sleep 100 ml - Pure & Unrefined Pillow Mist & Linen Spray (Hibiscus,100 ml)\nReview Date: 2021/06/29\nStore: FLORONA\nAverage Rating: 3.6\nProduct Details: {'Package Dimensions': '5.75 x 1.73 x 1.69 inches; 4.73 Ounces', 'Manufacturer': 'FLORONA'}\nReview Text: I was curious about the Hibiscus scent.  We're all familiar with other stronger scents like rose, or gardenia, and etc., but this one is more obscure.  Well, it's different, interesting, with a subtle but deep aroma, that actually is quite nice.  I spritzed some mist on our bedding about an hour before bedtime, and later the slight delicate fragrance was there in a relaxing sort of way.  Not powerful or too flowery for the guys, but a nice calm fresh and peaceful scent that was only minimally noticeable.  The spray has only 3 ingredients listed: water, hibiscus oil, castor oil, - no chemicals, so looks to be pretty pure, and it comes in a clear plastic bottle with plastic pump.  A good alternative to some of those annoying strong scents in a can.\nReview Title: Lovely subtle scent of Hibiscus, relaxing.\nRating: 5.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has had several positive experiences with various products, particularly in facial cleansing and moisturizing items. They appreciated the waterproof feature and pampering qualities of a facial cleansing device, as well as the satisfaction gained from effective exfoliation. The user enjoyed the lightweight, soothing sensations of a moisturizer that absorbs well and a BB cream that provides excellent coverage while feeling almost invisible on the skin. Candles with subtle natural scents created a calming atmosphere, while a set of fluffy makeup brushes added joy to their cosmetic routine. Overall, there is a clear preference for items that deliver effective results, comfort, and an enjoyable sensory experience.\n\nNEGATIVE SUMMARY:\nThe user expressed dissatisfaction with multiple products, particularly some cosmetic items that did not meet expectations. One moisturizer felt greasy and didn’t absorb well, while a tinted moisturizer left an unpleasant shine. A lipstick that was expected to be pink turned out to be a disappointing coral color, highlighting imperfections in the user's lips instead of enhancing them. The hand-made soap's uniquely strong scent was also off-putting. There were concerns regarding the absorption and feel of certain products, indicating a struggle with items that didn’t provide a desirable texture or appearance.\n\nOVERALL SUMMARY:\nThe user's shopping history reflects a mix of positive and negative experiences across various personal care products. They favored items that offered comfort, effectiveness, and pleasant scents while enjoying soothing and pampering qualities. However, there were several disappointments, particularly with cosmetics that didn't perform as desired or had unexpected results, resulting in frustration and unmet expectations. Overall, the user clearly values high-quality, effective products but has faced challenges with consistency in satisfaction across different categories.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Saves Much Elbow Grease!",
    "text": "I must say this stuff does an excellent job on tile grout,  with a lot less elbow grease!  My only gripe would be the translation to English from Chinese---really poor!  The review is however, for the product and not grammar or spelling.  In the past we have had tiled shower and tub enclosures, what a pain to keep clean, wish this was available then!  Very pleased with this product.",
    "images": [],
    "asin": "B09TTC9Q9W",
    "parent_asin": "B09TTC9Q9W",
    "user_id": "AGRO3UTLKTF724ZW64QXGWXJ4SYA",
    "timestamp": "2022-04-24 13:09:30.320000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "mold remover gel (3 Pack)",
    "average_rating": 2.9,
    "rating_number": 28,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/514Gfq4oWAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/514Gfq4oWAL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71gXQBCnp9L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51rS-b-eIZL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51rS-b-eIZL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71hDQjYpwpL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51ErWw73xKL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51ErWw73xKL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71J6+7PEsbL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51GuNttH3vL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GuNttH3vL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/71iyztQa6rL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51gYksSpLxL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51gYksSpLxL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71KkbCtksaL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51H76BHjfGL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51H76BHjfGL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71T8BOsiGIL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Yondarli",
    "categories": [],
    "details": {
      "Brand": "Yondarli",
      "Number of Items": "3",
      "Unit Count": "1.0 Fl Oz",
      "Package Dimensions": "5.94 x 2.76 x 1.77 inches; 7.13 Ounces"
    },
    "bought_together": null
  }
}