{
  "user_id": "AFUBMCVI5J6G4F2RFQGTDRXLE6VQ",
  "summary": "=== Purchase Information ===\nProduct Title: Clip in Hair Extensions - Platinum Blonde - Straight - 18in / 46cm - Full Head - 8 Pcs 120g - Japanese Heat Resistant Synthetic Hairpiece - Looks and Feels like Real Hair\nReview Date: 2015/01/26\nStore: Elegant Hair\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '18 x 38.98 x 0.39 inches; 4.23 Ounces', 'Item model number': 'SCIHLST20920', 'UPC': '799632432838'}\nReview Text: fantastic value for fake hair.  perfect color. True pale blonde platinum with white like highlights. Great if you bleach your hair!<br />Very soft. doesnt tangle. blends into your own hair very well. Easy to put on and off. Keep the bag and put them in it when not in use.<br />Make sure you straighten your own hair first before you put these in because these are SUPER straight!\nReview Title: fantastic value for fake hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Elegant Hair - 17\" PONYTAIL Clip in Hair Piece CURLY Platinum Blonde #16/60 REVERSIBLE Claw Clip 220g\nReview Date: 2015/03/16\nStore: Elegant Hair\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '17 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16.93 x 3.94 x 1.97 inches; 5.64 Ounces', 'UPC': '799632434306'}\nReview Text: Fantastic! I own the 22inch hair version as well. Both are great but the 22inch one  can weight heavy on the head after 6 to 8 hours (and i suffer from migraines so I have to be careful about that) . this 17inch one is lighter but still VERY full. can wear it all day at work with no issues.<br />Very curly! very beautiful! Looks real!\nReview Title: This is elegant HAIR!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CAISHA by PRETTYSHOP Hair Donut Up Do Hair Ring Hairstyler Bun Maker Bridal Hairpiece Hair Styling Tool Brown DK2\nReview Date: 2018/04/26\nStore: CAISHA\nProduct Description: ['Synthetic fiber hair styler. Diameter: 3,6\" (9cm); Weight: 0.1 lb (45g). . . .']\nAverage Rating: 3.5\nProduct Details: {'Color': 'brown #DK2', 'Material': 'Synthetic', 'Brand': 'CAISHA', 'Item Dimensions LxWxH': '9.45 x 7.09 x 1.97 inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.45 x 7.09 x 1.97 inches; 1.41 Ounces', 'Item model number': 'DKxx', 'UPC': '885860274224 716670803819', 'Manufacturer': 'Generic'}\nReview Text: More golden in color and it losses shape after a few wears\nReview Title: Its okay. More gold then photo\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Magnetic Eyelashes False Lashes with Magnets Top and Bottom Magnetic Lashes Resuable Lashes 2 Pair / 8pcs Natural Style\nReview Date: 2020/09/16\nStore: Cuckoo\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Cuckoo', 'Material': 'synthetic fibers', 'Item Dimensions LxWxH': '5.12 x 4.3 x 0.9 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Product Dimensions': '5.12 x 4.3 x 0.9 inches; 2.4 Ounces'}\nReview Text: The magnet is strong. I bought the two paid sandwich style. I tried the videos, and the hacks that say cut them ...I tried applying with special lash tweezers... Nothing works to get them close to the lash lid. The magnetic is strong so I'm sure it won't fall off, but it's so strong that when you start to move the under lash toward your eye with the upper lash laying on top of your lashes, the magnetic pulls and moves is soil quickly that it always ends up locked half way through your natural lashes. And I'm a contact wearer...so it's not like I have  fear of putting stuff near my eyes. These probably will work well with lash liners. The lashes themselves look nicely constructed. It's just the application as intended is impossible.\nReview Title: The lashes look beautiful but you'll never get them on\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ENTRANCED STYLES Straight Black Wig with Bangs for Women Fashion Long Straight Wig Heat Resistant Bangs Synthetic Wig 20 Inch Natural Looking Daily Party Cosplay Wig\nReview Date: 2020/10/29\nStore: ENTRANCED STYLES\nAverage Rating: 4.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'ENTRANCED STYLES', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 6.1 x 2 inches; 3.99 Ounces', 'UPC': '778992677189'}\nReview Text: There are better options out there. This had a weird part. The flesh color looks like layers of beige mesh for the scalp and it kind of shimmers like pantyhose? Super straight part so to fix your need alot of plucking but with that trange scalp material, I don't think it's worth it for me.  The scalp pokes out at the edges because there is not enough hair on top. Wefts are shown. Bangs are thin and would need alot of styling to look good.\nReview Title: Not that great. Underwhelmed.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: S-noilite Secret Wire in Human Hair Extensions 100% Real Remy Hair Extension Invisible String 16\" 90g One Piece Double Drawn Fish Line Extensions for Women Gifts #60 Platinum Blonde\nReview Date: 2020/11/18\nStore: S-noilite\nAverage Rating: 2.0\nProduct Details: {'Package Dimensions': '12.4 x 7.56 x 0.59 inches; 4.23 Ounces'}\nReview Text: So they came packed nicely but not in the s-noilite package. No logo. Just staples to a cardboard slip and wrapped in a pink bag. The hair feels nice. However, I bought the same one twice. First one was brassy in color. I was ordering the #60 in platinum. The thick version. Alot of hair. But totally brassy. So I saw the price drop so I was like okay I'll try again see if they get the color right. Nope. Still brassy and the second one was not the thick halo version. No more then 50grams. Both have double thick wires which don't hide well compared to other companies. The thin version they sent on the second ordee  had clips as well. Why doesn't the thick version have clips? It would help so the ends stay close to the head. The wire was also short. So not happy based on color, difference in style sent even though I ordered same style twiced, and not package from s-noilite. My seller was us fashion outlet. I'd be sceptical to purchase from them if they are the only seller.\nReview Title: Bought twice and neither was right color nor brand\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: [DASHING DIVA–Nails with Big Stone]Premium Magic Press Super Slim Fit-Better Than Rose+Twinkle Corsage241/42GMC(2Different Designs 30strips+30strips in 12sizes)\nReview Date: 2021/02/08\nStore: Dashing Diva\nAverage Rating: 4.1\nProduct Details: {'Size': '33 Piece Set', 'Brand': 'Dashing Diva', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Item Form': 'Gel', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.43 x 3.35 x 1.85 inches; 2.65 Ounces', 'Item model number': '8809657105388'}\nReview Text: It's just a weak press on nail. Does not flex and form close to your own nail. Lifts very easily and will snag and pop off. Okay if you have maybe a photo shoot and your not a hand model. But don't expect to use your hand or nails without these popping off within mins of application.\nReview Title: Thought it was like flexible nail gel. No. It's a press on nail.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: BOGSEA Dark Brown Wig with Bangs Long Dark Brown Wigs for Women Long Synthetic Wavy Wigs for Daily Party (24Inch,Dark Brown)\nReview Date: 2021/06/12\nStore: BOGSEA\nAverage Rating: 3.6\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'BOGSEA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.97 x 9.09 x 2.83 inches; 10.23 Ounces', 'UPC': '701347548230'}\nReview Text: So I felt they did a good job of hiding the weft and had alot of hair. The unit shed pretty bad just by touching it though. The hair was shiney but powder should control that. The length was there. It had one spot near the bangs that looked like someone fried it. And that would be hard to conceal. The bangs looked nicer then most but it just wasn't for me. Fake scalp also not best I've seen but concealer would probably fix that. The top had no volume and I don't mean amount of hair. It was slicked down really tight. I tried to shake it a bit with my fingers to see if it would gain some life but it didn't, plus a bunch of hair fell out.  This super flat look near the fake scalp and with a mid part that cannot be moved is just gonna make me look like the Amish. I would look at this company again if they had a unit without the bangs and maybe a more flexible part. A mini front lace would probably help.\nReview Title: Very flat top. Some fried pieces under the wig.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Long Wavy Lace Front Wigs Synthetic Ombre Brown Wig for Women Natural Wave Heat Resistant Wig for Daily Parties (Mixed Brown Color)\nReview Date: 2021/07/14\nStore: N\\C\nProduct Description: ['This long wave wigs with a small lace front was born by our best wig designer based on current fashion trends, it shows natural and authentic unique originality. Incredibly versatile-beautiful colors, natural curves, allowing you to have impressive curls, braids, ponytails and any other hairstyles you create! Material: High-quality, high-heat-resistant imported soft synthetic fiber. Size: 22inch Style: long hair wig Texture: natural appearance, soft touch Heat-resistant temperature: 150 degrees Celsius302 degrees Fahrenheit Function: very suitable for daily use, Halloween, concerts, theme parties, weddings, appointments, etc. Tips: (As synthetic wigs, they are knotted in the smallest amount. Sometimes after long-distance logistics and transportation, sometimes they can be restyled a little. Let them breathe for a day or two, they look as beautiful as the picture.) 1. Do not spray gel water and wax on the wig to avoid greasy wigs. 2. All synthetic wigs have a small amount of shedding and tangles, which is normal. 3. Due to the color setting of the computer monitor or other reasons, the color may sometimes be slightly different from the photo. How to clean the wig? 1. Use a wide-tooth comb to comb the wig. 2. Add some shampoo to cold water. Gently shake the wig in the water until the wig is saturated, and soak for about 15 minutes. 3. Empty the water and rinse the wig several times with clean cold water. 4. Gently squeeze the water in the wig. Spread out the wig with a dry towel, place it in a ventilated area, and dry it overnight. Show your confidence and beauty The wig is made of super-realistic materials and looks like real hair. If you want to try something new, it allows you to find a differen.']\nAverage Rating: 3.7\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'N\\\\C', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.77 x 8.66 x 2.24 inches; 10.55 Ounces'}\nReview Text: So it's honestly not bad at this price point. It sheds a bit but all units have some shedding. For the mix brown I give 4 stars.The face front is about 2 inches and is meant to be cut and plucked for a natural look. I did neither in the photo. I just folded it under the the front as I'm afraid that cutting will make it look lifted in the front and obviously show it's a wig without some glue to put it down. The color is not exactly what I wanted. I was hoping it would be a darker brown. It's kinda a mousey brown and alittle strange in my opinion. It will need to be restyle in the front as some waves/curls flattened out by how it was packed in transport. The part is both a plastic fake skin and a mesh on top. You can see the mesh upon close examination. Makeup might help to conceal this.... Or make it worse. What I did like was the fullness and length. The weft was not too easy to be seen even when pulling hair apart. This is good compared to other brands where the wefts are often very visible, especially in the back and crown of a unit. Because the simulated scalp is narrow, you won't be able to change the part. It's also a bit flat near the part so it's gonna take some work to give a bit of volume. I would have enjoyed this much more had the color been a rich brown and if the scalp was a bit more realistic. Would I wear in public? Probably not. Would this be good for photo shoots or costumes ? yes. Would I buy other colors from this brand? Yes and I haven't done that with other brands on Amazon. For the purple ombre: I give 3 stars. It doesn't have the lace in front. This is more pure costume. The black is very shiney and the front of wig where the part is shows a bit of the black backing for construction. If it laid more flat and had the lace I would have given the purple ombre 4 stars. Dull the shiney with some powder like dry shampoo or maybe even dark eyeshadow. The fake scalp is actually better on the purple ombre compared to the brown mix. The ombre for the blonde is also a 4 star. Hair at the crown is a bit flat but the rest of the style is beautiful. The brown to blonde has the 2 inch lace like the long brown one. It's not as full on the head but you don't see the wefts unless you pull it apart a bit.  I feel the color is much more realistic. Hair feels pretty good for a synthetic. Note if you play too much , it will get a knotty feel. Again, good for photos. Some people might actually wear it daily but I don't know if it took take daily abuse. Length is great.\nReview Title: Better then most at this price point, depends on which one you get\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nnzes Long Wavy Wigs for Black Women Natural Looking Wavy Synthetic Wig Highlight Synthetic Wigs for Women Heat Resistant Fiber Hair for Daily Party Wear (22 inch, Brown)\nReview Date: 2021/08/03\nStore: Nnzes\nAverage Rating: 3.7\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'Nnzes', 'Package Dimensions': '11.57 x 9.21 x 2.72 inches; 11.68 Ounces'}\nReview Text: It's alittle more course then other synthetic hair, but it's not bad. Length is great. Has a small 2 inch lace to help blend it. Some hairs on top are alittle short compared to rest and may look like a few fly aways, but I think that makes it look more natural honestly. Will tangle easily so keep a wide comb. Curls are nice without being over styled. It's alittle thin near the crown so be careful as it doesn't take much to find the wefts. It's a nice brown#6.\nReview Title: Pretty good brown\nRating: 4.0\n--------------------------------------------------",
  "reference": "Clip in Hair Extensions - Platinum Blonde - Straight - 18in / 46cm - Full Head - 8 Pcs 120g - Japanese Heat Resistant Synthetic Hairpiece - Looks and Feels like Real Hair\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '18 x 38.98 x 0.39 inches; 4.23 Ounces', 'Item model number': 'SCIHLST20920', 'UPC': '799632432838'}\nfantastic value for fake hair.  perfect color. True pale blonde platinum with white like highlights. Great if you bleach your hair!<br />Very soft. doesnt tangle. blends into your own hair very well. Easy to put on and off. Keep the bag and put them in it when not in use.<br />Make sure you straighten your own hair first before you put these in because these are SUPER straight!\nfantastic value for fake hair\nElegant Hair - 17\" PONYTAIL Clip in Hair Piece CURLY Platinum Blonde #16/60 REVERSIBLE Claw Clip 220g\nElegant Hair\n{'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '17 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16.93 x 3.94 x 1.97 inches; 5.64 Ounces', 'UPC': '799632434306'}\nFantastic! I own the 22inch hair version as well. Both are great but the 22inch one  can weight heavy on the head after 6 to 8 hours (and i suffer from migraines so I have to be careful about that) . this 17inch one is lighter but still VERY full. can wear it all day at work with no issues.<br />Very curly! very beautiful! Looks real!\nThis is elegant HAIR!\nCAISHA by PRETTYSHOP Hair Donut Up Do Hair Ring Hairstyler Bun Maker Bridal Hairpiece Hair Styling Tool Brown DK2\nCAISHA\n['Synthetic fiber hair styler. Diameter: 3,6\" (9cm); Weight: 0.1 lb (45g). . . .']\n{'Color': 'brown #DK2', 'Material': 'Synthetic', 'Brand': 'CAISHA', 'Item Dimensions LxWxH': '9.45 x 7.09 x 1.97 inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.45 x 7.09 x 1.97 inches; 1.41 Ounces', 'Item model number': 'DKxx', 'UPC': '885860274224 716670803819', 'Manufacturer': 'Generic'}\nMore golden in color and it losses shape after a few wears\nIts okay. More gold then photo\nMagnetic Eyelashes False Lashes with Magnets Top and Bottom Magnetic Lashes Resuable Lashes 2 Pair / 8pcs Natural Style\nCuckoo\n{'Brand': 'Cuckoo', 'Material': 'synthetic fibers', 'Item Dimensions LxWxH': '5.12 x 4.3 x 0.9 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Product Dimensions': '5.12 x 4.3 x 0.9 inches; 2.4 Ounces'}\nThe magnet is strong. I bought the two paid sandwich style. I tried the videos, and the hacks that say cut them ...I tried applying with special lash tweezers... Nothing works to get them close to the lash lid. The magnetic is strong so I'm sure it won't fall off, but it's so strong that when you start to move the under lash toward your eye with the upper lash laying on top of your lashes, the magnetic pulls and moves is soil quickly that it always ends up locked half way through your natural lashes. And I'm a contact wearer...so it's not like I have  fear of putting stuff near my eyes. These probably will work well with lash liners. The lashes themselves look nicely constructed. It's just the application as intended is impossible.\nThe lashes look beautiful but you'll never get them on\nENTRANCED STYLES Straight Black Wig with Bangs for Women Fashion Long Straight Wig Heat Resistant Bangs Synthetic Wig 20 Inch Natural Looking Daily Party Cosplay Wig\nENTRANCED STYLES\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'ENTRANCED STYLES', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 6.1 x 2 inches; 3.99 Ounces', 'UPC': '778992677189'}\nThere are better options out there. This had a weird part. The flesh color looks like layers of beige mesh for the scalp and it kind of shimmers like pantyhose? Super straight part so to fix your need alot of plucking but with that trange scalp material, I don't think it's worth it for me.  The scalp pokes out at the edges because there is not enough hair on top. Wefts are shown. Bangs are thin and would need alot of styling to look good.\nNot that great. Underwhelmed.\nS-noilite Secret Wire in Human Hair Extensions 100% Real Remy Hair Extension Invisible String 16\" 90g One Piece Double Drawn Fish Line Extensions for Women Gifts #60 Platinum Blonde\nS-noilite\n{'Package Dimensions': '12.4 x 7.56 x 0.59 inches; 4.23 Ounces'}\nSo they came packed nicely but not in the s-noilite package. No logo. Just staples to a cardboard slip and wrapped in a pink bag. The hair feels nice. However, I bought the same one twice. First one was brassy in color. I was ordering the #60 in platinum. The thick version. Alot of hair. But totally brassy. So I saw the price drop so I was like okay I'll try again see if they get the color right. Nope. Still brassy and the second one was not the thick halo version. No more then 50grams. Both have double thick wires which don't hide well compared to other companies. The thin version they sent on the second ordee  had clips as well. Why doesn't the thick version have clips? It would help so the ends stay close to the head. The wire was also short. So not happy based on color, difference in style sent even though I ordered same style twiced, and not package from s-noilite. My seller was us fashion outlet. I'd be sceptical to purchase from them if they are the only seller.\nBought twice and neither was right color nor brand\n[DASHING DIVA–Nails with Big Stone]Premium Magic Press Super Slim Fit-Better Than Rose+Twinkle Corsage241/42GMC(2Different Designs 30strips+30strips in 12sizes)\nDashing Diva\n{'Size': '33 Piece Set', 'Brand': 'Dashing Diva', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Item Form': 'Gel', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.43 x 3.35 x 1.85 inches; 2.65 Ounces', 'Item model number': '8809657105388'}\nIt's just a weak press on nail. Does not flex and form close to your own nail. Lifts very easily and will snag and pop off. Okay if you have maybe a photo shoot and your not a hand model. But don't expect to use your hand or nails without these popping off within mins of application.\nThought it was like flexible nail gel. No. It's a press on nail.\nBOGSEA Dark Brown Wig with Bangs Long Dark Brown Wigs for Women Long Synthetic Wavy Wigs for Daily Party (24Inch,Dark Brown)\nBOGSEA\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'BOGSEA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.97 x 9.09 x 2.83 inches; 10.23 Ounces', 'UPC': '701347548230'}\nSo I felt they did a good job of hiding the weft and had alot of hair. The unit shed pretty bad just by touching it though. The hair was shiney but powder should control that. The length was there. It had one spot near the bangs that looked like someone fried it. And that would be hard to conceal. The bangs looked nicer then most but it just wasn't for me. Fake scalp also not best I've seen but concealer would probably fix that. The top had no volume and I don't mean amount of hair. It was slicked down really tight. I tried to shake it a bit with my fingers to see if it would gain some life but it didn't, plus a bunch of hair fell out.  This super flat look near the fake scalp and with a mid part that cannot be moved is just gonna make me look like the Amish. I would look at this company again if they had a unit without the bangs and maybe a more flexible part. A mini front lace would probably help.\nVery flat top. Some fried pieces under the wig.\nLong Wavy Lace Front Wigs Synthetic Ombre Brown Wig for Women Natural Wave Heat Resistant Wig for Daily Parties (Mixed Brown Color)\nN\\C\n['This long wave wigs with a small lace front was born by our best wig designer based on current fashion trends, it shows natural and authentic unique originality. Incredibly versatile-beautiful colors, natural curves, allowing you to have impressive curls, braids, ponytails and any other hairstyles you create! Material: High-quality, high-heat-resistant imported soft synthetic fiber. Size: 22inch Style: long hair wig Texture: natural appearance, soft touch Heat-resistant temperature: 150 degrees Celsius302 degrees Fahrenheit Function: very suitable for daily use, Halloween, concerts, theme parties, weddings, appointments, etc. Tips: (As synthetic wigs, they are knotted in the smallest amount. Sometimes after long-distance logistics and transportation, sometimes they can be restyled a little. Let them breathe for a day or two, they look as beautiful as the picture.) 1. Do not spray gel water and wax on the wig to avoid greasy wigs. 2. All synthetic wigs have a small amount of shedding and tangles, which is normal. 3. Due to the color setting of the computer monitor or other reasons, the color may sometimes be slightly different from the photo. How to clean the wig? 1. Use a wide-tooth comb to comb the wig. 2. Add some shampoo to cold water. Gently shake the wig in the water until the wig is saturated, and soak for about 15 minutes. 3. Empty the water and rinse the wig several times with clean cold water. 4. Gently squeeze the water in the wig. Spread out the wig with a dry towel, place it in a ventilated area, and dry it overnight. Show your confidence and beauty The wig is made of super-realistic materials and looks like real hair. If you want to try something new, it allows you to find a differen.']\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'N\\\\C', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.77 x 8.66 x 2.24 inches; 10.55 Ounces'}\nSo it's honestly not bad at this price point. It sheds a bit but all units have some shedding. For the mix brown I give 4 stars.The face front is about 2 inches and is meant to be cut and plucked for a natural look. I did neither in the photo. I just folded it under the the front as I'm afraid that cutting will make it look lifted in the front and obviously show it's a wig without some glue to put it down. The color is not exactly what I wanted. I was hoping it would be a darker brown. It's kinda a mousey brown and alittle strange in my opinion. It will need to be restyle in the front as some waves/curls flattened out by how it was packed in transport. The part is both a plastic fake skin and a mesh on top. You can see the mesh upon close examination. Makeup might help to conceal this.... Or make it worse. What I did like was the fullness and length. The weft was not too easy to be seen even when pulling hair apart. This is good compared to other brands where the wefts are often very visible, especially in the back and crown of a unit. Because the simulated scalp is narrow, you won't be able to change the part. It's also a bit flat near the part so it's gonna take some work to give a bit of volume. I would have enjoyed this much more had the color been a rich brown and if the scalp was a bit more realistic. Would I wear in public? Probably not. Would this be good for photo shoots or costumes ? yes. Would I buy other colors from this brand? Yes and I haven't done that with other brands on Amazon. For the purple ombre: I give 3 stars. It doesn't have the lace in front. This is more pure costume. The black is very shiney and the front of wig where the part is shows a bit of the black backing for construction. If it laid more flat and had the lace I would have given the purple ombre 4 stars. Dull the shiney with some powder like dry shampoo or maybe even dark eyeshadow. The fake scalp is actually better on the purple ombre compared to the brown mix. The ombre for the blonde is also a 4 star. Hair at the crown is a bit flat but the rest of the style is beautiful. The brown to blonde has the 2 inch lace like the long brown one. It's not as full on the head but you don't see the wefts unless you pull it apart a bit.  I feel the color is much more realistic. Hair feels pretty good for a synthetic. Note if you play too much , it will get a knotty feel. Again, good for photos. Some people might actually wear it daily but I don't know if it took take daily abuse. Length is great.\nBetter then most at this price point, depends on which one you get\nNnzes Long Wavy Wigs for Black Women Natural Looking Wavy Synthetic Wig Highlight Synthetic Wigs for Women Heat Resistant Fiber Hair for Daily Party Wear (22 inch, Brown)\nNnzes\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'Nnzes', 'Package Dimensions': '11.57 x 9.21 x 2.72 inches; 11.68 Ounces'}\nIt's alittle more course then other synthetic hair, but it's not bad. Length is great. Has a small 2 inch lace to help blend it. Some hairs on top are alittle short compared to rest and may look like a few fly aways, but I think that makes it look more natural honestly. Will tangle easily so keep a wide comb. Curls are nice without being over styled. It's alittle thin near the crown so be careful as it doesn't take much to find the wefts. It's a nice brown#6.\nPretty good brown",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Clip in Hair Extensions - Platinum Blonde - Straight - 18in / 46cm - Full Head - 8 Pcs 120g - Japanese Heat Resistant Synthetic Hairpiece - Looks and Feels like Real Hair\nReview Date: 2015/01/26\nStore: Elegant Hair\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '18 x 38.98 x 0.39 inches; 4.23 Ounces', 'Item model number': 'SCIHLST20920', 'UPC': '799632432838'}\nReview Text: fantastic value for fake hair.  perfect color. True pale blonde platinum with white like highlights. Great if you bleach your hair!<br />Very soft. doesnt tangle. blends into your own hair very well. Easy to put on and off. Keep the bag and put them in it when not in use.<br />Make sure you straighten your own hair first before you put these in because these are SUPER straight!\nReview Title: fantastic value for fake hair\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Elegant Hair - 17\" PONYTAIL Clip in Hair Piece CURLY Platinum Blonde #16/60 REVERSIBLE Claw Clip 220g\nReview Date: 2015/03/16\nStore: Elegant Hair\nAverage Rating: 5.0\nProduct Details: {'Brand': 'Elegant Hair', 'Material': 'Human Hair', 'Extension Length': '17 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '16.93 x 3.94 x 1.97 inches; 5.64 Ounces', 'UPC': '799632434306'}\nReview Text: Fantastic! I own the 22inch hair version as well. Both are great but the 22inch one  can weight heavy on the head after 6 to 8 hours (and i suffer from migraines so I have to be careful about that) . this 17inch one is lighter but still VERY full. can wear it all day at work with no issues.<br />Very curly! very beautiful! Looks real!\nReview Title: This is elegant HAIR!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CAISHA by PRETTYSHOP Hair Donut Up Do Hair Ring Hairstyler Bun Maker Bridal Hairpiece Hair Styling Tool Brown DK2\nReview Date: 2018/04/26\nStore: CAISHA\nProduct Description: ['Synthetic fiber hair styler. Diameter: 3,6\" (9cm); Weight: 0.1 lb (45g). . . .']\nAverage Rating: 3.5\nProduct Details: {'Color': 'brown #DK2', 'Material': 'Synthetic', 'Brand': 'CAISHA', 'Item Dimensions LxWxH': '9.45 x 7.09 x 1.97 inches', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '9.45 x 7.09 x 1.97 inches; 1.41 Ounces', 'Item model number': 'DKxx', 'UPC': '885860274224 716670803819', 'Manufacturer': 'Generic'}\nReview Text: More golden in color and it losses shape after a few wears\nReview Title: Its okay. More gold then photo\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Magnetic Eyelashes False Lashes with Magnets Top and Bottom Magnetic Lashes Resuable Lashes 2 Pair / 8pcs Natural Style\nReview Date: 2020/09/16\nStore: Cuckoo\nAverage Rating: 3.0\nProduct Details: {'Brand': 'Cuckoo', 'Material': 'synthetic fibers', 'Item Dimensions LxWxH': '5.12 x 4.3 x 0.9 inches', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Product Dimensions': '5.12 x 4.3 x 0.9 inches; 2.4 Ounces'}\nReview Text: The magnet is strong. I bought the two paid sandwich style. I tried the videos, and the hacks that say cut them ...I tried applying with special lash tweezers... Nothing works to get them close to the lash lid. The magnetic is strong so I'm sure it won't fall off, but it's so strong that when you start to move the under lash toward your eye with the upper lash laying on top of your lashes, the magnetic pulls and moves is soil quickly that it always ends up locked half way through your natural lashes. And I'm a contact wearer...so it's not like I have  fear of putting stuff near my eyes. These probably will work well with lash liners. The lashes themselves look nicely constructed. It's just the application as intended is impossible.\nReview Title: The lashes look beautiful but you'll never get them on\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: ENTRANCED STYLES Straight Black Wig with Bangs for Women Fashion Long Straight Wig Heat Resistant Bangs Synthetic Wig 20 Inch Natural Looking Daily Party Cosplay Wig\nReview Date: 2020/10/29\nStore: ENTRANCED STYLES\nAverage Rating: 4.2\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'ENTRANCED STYLES', 'Age Range (Description)': 'Adult', 'Package Dimensions': '10.4 x 6.1 x 2 inches; 3.99 Ounces', 'UPC': '778992677189'}\nReview Text: There are better options out there. This had a weird part. The flesh color looks like layers of beige mesh for the scalp and it kind of shimmers like pantyhose? Super straight part so to fix your need alot of plucking but with that trange scalp material, I don't think it's worth it for me.  The scalp pokes out at the edges because there is not enough hair on top. Wefts are shown. Bangs are thin and would need alot of styling to look good.\nReview Title: Not that great. Underwhelmed.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: S-noilite Secret Wire in Human Hair Extensions 100% Real Remy Hair Extension Invisible String 16\" 90g One Piece Double Drawn Fish Line Extensions for Women Gifts #60 Platinum Blonde\nReview Date: 2020/11/18\nStore: S-noilite\nAverage Rating: 2.0\nProduct Details: {'Package Dimensions': '12.4 x 7.56 x 0.59 inches; 4.23 Ounces'}\nReview Text: So they came packed nicely but not in the s-noilite package. No logo. Just staples to a cardboard slip and wrapped in a pink bag. The hair feels nice. However, I bought the same one twice. First one was brassy in color. I was ordering the #60 in platinum. The thick version. Alot of hair. But totally brassy. So I saw the price drop so I was like okay I'll try again see if they get the color right. Nope. Still brassy and the second one was not the thick halo version. No more then 50grams. Both have double thick wires which don't hide well compared to other companies. The thin version they sent on the second ordee  had clips as well. Why doesn't the thick version have clips? It would help so the ends stay close to the head. The wire was also short. So not happy based on color, difference in style sent even though I ordered same style twiced, and not package from s-noilite. My seller was us fashion outlet. I'd be sceptical to purchase from them if they are the only seller.\nReview Title: Bought twice and neither was right color nor brand\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: [DASHING DIVA–Nails with Big Stone]Premium Magic Press Super Slim Fit-Better Than Rose+Twinkle Corsage241/42GMC(2Different Designs 30strips+30strips in 12sizes)\nReview Date: 2021/02/08\nStore: Dashing Diva\nAverage Rating: 4.1\nProduct Details: {'Size': '33 Piece Set', 'Brand': 'Dashing Diva', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Item Form': 'Gel', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.43 x 3.35 x 1.85 inches; 2.65 Ounces', 'Item model number': '8809657105388'}\nReview Text: It's just a weak press on nail. Does not flex and form close to your own nail. Lifts very easily and will snag and pop off. Okay if you have maybe a photo shoot and your not a hand model. But don't expect to use your hand or nails without these popping off within mins of application.\nReview Title: Thought it was like flexible nail gel. No. It's a press on nail.\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: BOGSEA Dark Brown Wig with Bangs Long Dark Brown Wigs for Women Long Synthetic Wavy Wigs for Daily Party (24Inch,Dark Brown)\nReview Date: 2021/06/12\nStore: BOGSEA\nAverage Rating: 3.6\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'BOGSEA', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.97 x 9.09 x 2.83 inches; 10.23 Ounces', 'UPC': '701347548230'}\nReview Text: So I felt they did a good job of hiding the weft and had alot of hair. The unit shed pretty bad just by touching it though. The hair was shiney but powder should control that. The length was there. It had one spot near the bangs that looked like someone fried it. And that would be hard to conceal. The bangs looked nicer then most but it just wasn't for me. Fake scalp also not best I've seen but concealer would probably fix that. The top had no volume and I don't mean amount of hair. It was slicked down really tight. I tried to shake it a bit with my fingers to see if it would gain some life but it didn't, plus a bunch of hair fell out.  This super flat look near the fake scalp and with a mid part that cannot be moved is just gonna make me look like the Amish. I would look at this company again if they had a unit without the bangs and maybe a more flexible part. A mini front lace would probably help.\nReview Title: Very flat top. Some fried pieces under the wig.\nRating: 3.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Long Wavy Lace Front Wigs Synthetic Ombre Brown Wig for Women Natural Wave Heat Resistant Wig for Daily Parties (Mixed Brown Color)\nReview Date: 2021/07/14\nStore: N\\C\nProduct Description: ['This long wave wigs with a small lace front was born by our best wig designer based on current fashion trends, it shows natural and authentic unique originality. Incredibly versatile-beautiful colors, natural curves, allowing you to have impressive curls, braids, ponytails and any other hairstyles you create! Material: High-quality, high-heat-resistant imported soft synthetic fiber. Size: 22inch Style: long hair wig Texture: natural appearance, soft touch Heat-resistant temperature: 150 degrees Celsius302 degrees Fahrenheit Function: very suitable for daily use, Halloween, concerts, theme parties, weddings, appointments, etc. Tips: (As synthetic wigs, they are knotted in the smallest amount. Sometimes after long-distance logistics and transportation, sometimes they can be restyled a little. Let them breathe for a day or two, they look as beautiful as the picture.) 1. Do not spray gel water and wax on the wig to avoid greasy wigs. 2. All synthetic wigs have a small amount of shedding and tangles, which is normal. 3. Due to the color setting of the computer monitor or other reasons, the color may sometimes be slightly different from the photo. How to clean the wig? 1. Use a wide-tooth comb to comb the wig. 2. Add some shampoo to cold water. Gently shake the wig in the water until the wig is saturated, and soak for about 15 minutes. 3. Empty the water and rinse the wig several times with clean cold water. 4. Gently squeeze the water in the wig. Spread out the wig with a dry towel, place it in a ventilated area, and dry it overnight. Show your confidence and beauty The wig is made of super-realistic materials and looks like real hair. If you want to try something new, it allows you to find a differen.']\nAverage Rating: 3.7\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'N\\\\C', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.77 x 8.66 x 2.24 inches; 10.55 Ounces'}\nReview Text: So it's honestly not bad at this price point. It sheds a bit but all units have some shedding. For the mix brown I give 4 stars.The face front is about 2 inches and is meant to be cut and plucked for a natural look. I did neither in the photo. I just folded it under the the front as I'm afraid that cutting will make it look lifted in the front and obviously show it's a wig without some glue to put it down. The color is not exactly what I wanted. I was hoping it would be a darker brown. It's kinda a mousey brown and alittle strange in my opinion. It will need to be restyle in the front as some waves/curls flattened out by how it was packed in transport. The part is both a plastic fake skin and a mesh on top. You can see the mesh upon close examination. Makeup might help to conceal this.... Or make it worse. What I did like was the fullness and length. The weft was not too easy to be seen even when pulling hair apart. This is good compared to other brands where the wefts are often very visible, especially in the back and crown of a unit. Because the simulated scalp is narrow, you won't be able to change the part. It's also a bit flat near the part so it's gonna take some work to give a bit of volume. I would have enjoyed this much more had the color been a rich brown and if the scalp was a bit more realistic. Would I wear in public? Probably not. Would this be good for photo shoots or costumes ? yes. Would I buy other colors from this brand? Yes and I haven't done that with other brands on Amazon. For the purple ombre: I give 3 stars. It doesn't have the lace in front. This is more pure costume. The black is very shiney and the front of wig where the part is shows a bit of the black backing for construction. If it laid more flat and had the lace I would have given the purple ombre 4 stars. Dull the shiney with some powder like dry shampoo or maybe even dark eyeshadow. The fake scalp is actually better on the purple ombre compared to the brown mix. The ombre for the blonde is also a 4 star. Hair at the crown is a bit flat but the rest of the style is beautiful. The brown to blonde has the 2 inch lace like the long brown one. It's not as full on the head but you don't see the wefts unless you pull it apart a bit.  I feel the color is much more realistic. Hair feels pretty good for a synthetic. Note if you play too much , it will get a knotty feel. Again, good for photos. Some people might actually wear it daily but I don't know if it took take daily abuse. Length is great.\nReview Title: Better then most at this price point, depends on which one you get\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nnzes Long Wavy Wigs for Black Women Natural Looking Wavy Synthetic Wig Highlight Synthetic Wigs for Women Heat Resistant Fiber Hair for Daily Party Wear (22 inch, Brown)\nReview Date: 2021/08/03\nStore: Nnzes\nAverage Rating: 3.7\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'Nnzes', 'Package Dimensions': '11.57 x 9.21 x 2.72 inches; 11.68 Ounces'}\nReview Text: It's alittle more course then other synthetic hair, but it's not bad. Length is great. Has a small 2 inch lace to help blend it. Some hairs on top are alittle short compared to rest and may look like a few fly aways, but I think that makes it look more natural honestly. Will tangle easily so keep a wide comb. Curls are nice without being over styled. It's alittle thin near the crown so be careful as it doesn't take much to find the wefts. It's a nice brown#6.\nReview Title: Pretty good brown\nRating: 4.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has experienced several positive interactions with hair extensions and wigs, particularly valuing the natural appearance and quality of the products. Users consistently praised the fantastic value and realistic look of extensions, noting their softness, ease of application, and how well they blend with natural hair. The positive feedback extends to lighter and more comfortable items, making them suitable for all-day wear without discomfort. Additionally, the user highlighted the attractive colors and fullness in various hairpieces, reinforcing a sense of confidence in their appearance.\n\nNEGATIVE SUMMARY:\nThe user's negative experiences predominantly revolved around issues with product quality and dissatisfaction with color accuracy. Several items were reported to have brassy tones instead of the expected shades, leading to disappointment. Additionally, difficulties in application and style retention were frequently mentioned, particularly with magnetic eyelashes and press-on nails that didn't perform as intended. Some wigs lacked volume or realistic scalp appearance, resulting in underwhelming experiences. Overall, there were frustrations with shedding and packaging, negatively impacting the perceived value of certain purchases.\n\nOVERALL SUMMARY:\nThe user's shopping experience reflects a blend of satisfaction and disappointment. While many hair extensions and wigs received high marks for their quality and appearance, issues such as color discrepancies, application challenges, and product durability marred the overall shopping experience. The contrast between the praised natural look of certain items and the dissatisfaction with others highlights a need for improved consistency in products. Despite the mixed results, the user continues to explore different options, indicating an enduring interest in finding suitable hair solutions.",
  "target_interaction": {
    "rating": 4.0,
    "title": "Not a great fit but maybe helpful",
    "text": "I found this doesn't fit very comfortable on my face and doesn't quite lay on my chin area the way I had hoped. I find I have to turn it nearly all the way up to feel some pulses . There is no plate directly under the center of the chin, which is my targeted area. The pro is it is cheaper in price then many other devices that look exactly like it. It's too soon to tell if it's really helping. I bought this to help with lymph drainage massage in the chin and neck area. If I put it all the way up, I do notice pulses in my teeth nerves so that's annoying. But too low and with the bad contact to skin in most areas, then I feel nothing. Might work for others better.",
    "images": [],
    "asin": "B09SW7B6MS",
    "parent_asin": "B09SW7B6MS",
    "user_id": "AFUBMCVI5J6G4F2RFQGTDRXLE6VQ",
    "timestamp": "2022-07-21 14:57:17.756000",
    "helpful_vote": 2,
    "verified_purchase": true,
    "main_category": "All Beauty",
    "title_meta": "Electric V- Face Shaping Massager - 2022 Best Intelligent Facial Lifting Machine, Micro-Current Double Chin Reducing Massager, 6 Types of Face Beauty Lifting Device",
    "average_rating": 3.4,
    "rating_number": 31,
    "features": [
      "👩【 Electric V-Face Instrument 】 Effectively remove wrinkles, enhance skin elasticity, and tighten skin, give skin complement moisture, delay the aging of the skin in combination with vibration mode, tighten contour, improve stereo feeling, made V shaped face.",
      "👩【A Style】Cleaning and tender skin, protect skin, strengthen skin absorption, repair, balances skin oil, whiten and lighten spots, tender skin, eliminate wrinkles, and shrink pores.",
      "👩【B Style】Skin repair, improve the activity of skin cells, promote metabolism, promote blood circulation, enhance skin elasticity, anti‑aging, anti‑oxidation.",
      "👩【Easy to Use and Carry】 You Can Adjust the Intensity According to Your Needs, Just Wear It for 10 Minutes While Reading, Sleeping, Watching Tv or Doing Housework. Small and light, It is suitable for use in offices, homes, and travel.",
      "👩【Ergonomic Design】 It has a sensitive touch button control switch, so you can easily set the intensity level and switch the working mode, and turn it on and off instantly. You can use it with one hand even after wearing a face massager."
    ],
    "description": [],
    "price": 27.79,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41a2lbGq3fL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41a2lbGq3fL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61gGhCUTJfL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51zdVZ9A0YL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51zdVZ9A0YL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/61vQTC6XIaL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51nyjVgYKBL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51nyjVgYKBL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/61tqpvF-caL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51cLV8QqgzL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51cLV8QqgzL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61RXmeWlWjL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/510LUEJEh1L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/510LUEJEh1L.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61jqWWlme+L._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51bP59rONUL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51bP59rONUL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/61yCkeqAOjL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51cUL+-XCoL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51cUL+-XCoL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/61xXADuaxjL._SL1001_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/5162u2ZBfoL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/5162u2ZBfoL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/613T3zVVonL._SL1001_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Electric V- Face Shaping Massager",
        "url": "https://www.amazon.com/vdp/04a63d7448fb4a9a9eecb336620e8cc1?ref=dp_vse_rvc_0",
        "user_id": ""
      }
    ],
    "store": "Wxgreats",
    "categories": [],
    "details": {
      "Brand": "Wxgreats",
      "Style": "Modern",
      "Included Components": "Face Massager, Manual, USB Data Cable",
      "UPC": "884275371399",
      "Manufacturer": "Wxgreats"
    },
    "bought_together": null
  }
}