{
  "user_id": "AEPS33MI7LANKDAHRYF2MRKNYTIQ",
  "summary": "=== Purchase Information ===\nProduct Title: BeautyBio GloPRO Regeneration Tools\nReview Date: 2019/10/06\nAverage Rating: 4.3\nProduct Details: {'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nReview Text: At first, I was excited to get this micro-needling device, but then I started to look into micro needling. Dermatologists said to take Vitamin C 2 for weeks before use, and avoid sunlight; avoid makeup; your skin may peel afterward. So, I was afraid to try it out.  It turns out, that using this is not painful at all.  But when used on my forehead, it looks like it has more pores.  So, I decided to start taking vitamins, and planned out when to try this out, but I avoided trying it out before times when I planned to expose it to sunlight, along with one week before my (wife’s) period.<br /><br />Finally, I had the right time to try it out, and it had no obvious side effects...no pain, no skin flushing, no damage, no problems with sunlight or wearing makeup.  Because this is a device made for home use, it is much more mild than professional devices.  You may be able to use this every other day.<br /><br />The device is light weight, and rechargeable, but comes with batteries, so you don’t have to charge before use; this makes it easy to bring on travel.  I wish I had tried it much earlier.<br /><br />The head is supposed to be replaced every three months at a current cost of $35.  You are supposed to use a new cleaning pad before every use, and it came with 5 pads; the replacement skin prep pads are $35 for 30 pads which will last you two months, using it two to three times a week, which is what the manufacturer recommends.  The minimum monthly cost of supplies is about $38 per month.  You also need to have isopropyl (rubbing) alcohol to use with the provided spray bottle to sanitize the micro-needling head.<br /><br />I would recommend using sun screen after use, to protect your skin.<br /><br />After the first few uses, I haven’t seen much effect, but my husband thinks my face’s skin looks better.\nReview Title: Don’t Be Afraid, Just Give it a Try!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly, Top Japanese Makeup Remover, Gentle Skin Cleanser, Mild Floral Fragrance, Non-Greasy, 7.8 Ounce\nReview Date: 2020/05/20\nStore: Bioré\nProduct Description: ['Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly is a non-greasy makeup remover that removes dirt and impurities from deep below the surface of your skin. This top Japanese makeup remover glides on gently and leaves no sticky residue. Formulated with conditioning beauty essence, this jelly leaves skin feeling moisturized and free of makeup. Satisfaction Guaranteed. Limitations may apply.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '1.56 x 2.5 x 7.25 inches; 10.08 Ounces', 'Item model number': '28077_obs', 'UPC': '019100264557', 'Manufacturer': 'Kao USA Inc.'}\nReview Text: Biore Cleansing oil make-up removing clothes come in a plastic box of 44 and are made in Japan.  At first, my wife thought that these are small and thin, but she found that one was sufficient to remove makeup and mascara, with mascara top coat (which can be challenging to remove with other wipes).  My wife has tried several brands before, including top-rated wipes, and all of them except for this one irritates her skin slightly.  These do not!  Her skin is pretty tough, and she doesn't usually have reactions to cosmetics.<br /><br />There is a label on the inner package with Japanese writing, that's not translated into English on the package.  It says to make sure to use the plastic box to store the wipes to ensure quality and peel off the sticker completely; don't remove the wipes from the bag; make sure to close the lid after use.  I'd suggest that the manufacturer add a translated version on the package.  The package says to use the entire package within 45 days after opening, so if you don't wear make-up every day, you may not finish the package before they start to dry out.<br /><br />My wife loves these!  Highly recommended, especially for those who have sensitive skin!\nReview Title: Effective Wipes (with just one) - Recommended for those with Sensitive Skin!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Small Spray Bottle,Plastic Spray Bottle for Hair 3.4 oz Empty Travel Spray Bottle [ 5 PACK]\nReview Date: 2020/06/24\nStore: ARCTIC EAGLE\nAverage Rating: 4.2\nProduct Details: {'Brand': 'ARCTIC EAGLE', 'Material': 'Plastic', 'Capacity': '3.4 Ounces', 'Product Care Instructions': 'Hand Wash Only', 'Reusability': 'Reusable', 'Package Dimensions': '8.3 x 5.7 x 1.7 inches; 3.99 Ounces', 'UPC': '791523481260'}\nReview Text: This set of 5 spray bottles comes with caps, a spare pump, and a very tiny funnel for filling.  The pumps work well, and create a very fine mist, that sprays about 10 inches from the nozzle.  The bottles are fairly rigid.  Overall, these are a great value!  The funnel could be a bit larger, as it's top opening is not much larger than the neck of the bottles. Recommended!\nReview Title: Good Quality, Fine Mist, Spare Pump and Funnel\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: minihope Women's Elastic Hair Tiea, Black, 120 Count (Pack of 1), 4MM for Medium Hair.Value pack.\nReview Date: 2020/08/24\nStore: minihope\nAverage Rating: 4.6\nProduct Details: {'Material': 'Metal', 'Item Form': 'elastic', 'Brand': 'minihope', 'Hair Type': 'Medium, Thick', 'Number of Pieces': '120', 'Package Dimensions': '6.3 x 2.9 x 2.2 inches; 7.2 Ounces', 'Item model number': 'ET-SET-200703', 'UPC': '725683672763 661757097431'}\nReview Text: For years, I have purchased random brands of elastic hair ties whenever I need more, and they have all performed similarly. I assumed that the Minihope Women's Hair Elastic Thick Ties would be just like the rest. Not so much. When I stretched one of them for the first time, they felt stiff and brittle, unlike all of the other elastic hair ties I have used. These stretch to about twice the original size when pulled, while my others stretch to about three times or more than the original size.<br /><br />Stretching a new Minihope Hair Elastic Thick Tie just three times, it did not return to the original size.  I’m guessing these won’t last long, even though they are more expensive than the ties I usually buy.\nReview Title: Stiff, Little Stretch, Lack Elasticity\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Travel Bottles Keychain, 1.7oz/50ml Portable Hand Sanitizer Bottles, Fine Mist Spray Keychain Bottles, Empty Leakproof Refillable Containers with Flip/Spray Cap Plastic Travel Bottles (5PC)\nReview Date: 2020/11/09\nStore: XITENBAO\nAverage Rating: 4.4\nProduct Details: {'Brand': 'XITENBAO', 'Material': 'Silicone,Plastic', 'Capacity': '50 Milliliters, 1.7 Ounces', 'Number of Items': '1', 'Special Feature': 'Portable, Mist Spray, Leakproof', 'Package Dimensions': '7 x 7 x 2.5 inches; 3.99 Ounces', 'Item model number': 'klp-001', 'UPC': '192408404112'}\nReview Text: I have been using hand sanitizer bottles with built-in carabiners and sprayer bottles for rubbing alcohol, but had never looked for a spray bottle with built-in carabiners...  It is great that the sprayer bottles can be attached to something, as there is less chance of dropping and losing them while travelling.  Note that since the sprayer cap isn’t attached and can be still lost.<br /><br />This bottle can be used for gel / cream or liquid to spray. The sprayer tube extends to the bottom of the bottle near the narrow carabiner attachment hole, so you can spray until almost the last drop. The sprayer has been working well. It is also nice that the set includes a collapsible funnel for refilling.  Love them!\nReview Title: Great versatile little keychain bottles!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spray Bottle with Black Trigger, Suream 10.6oz/300ml Adjustable Sprayer with Stream Mist Mode for Hair, Refillable Empty Plastic Houseplant Mister for Hair Styling, Gardening, Ironing and Cleaning\nReview Date: 2020/11/09\nStore: SUREAM\nAverage Rating: 4.4\nProduct Details: {'Brand': 'SUREAM', 'Material': 'Plastic', 'Capacity': '10.6 Ounces', 'Number of Items': '1', 'Special Feature': 'Mist Spray', 'Package Dimensions': '11.81 x 4.92 x 3.27 inches; 3.21 Ounces', 'UPC': '704078929859'}\nReview Text: I like this sprayer as it works very well and is the perfect size for hair products as it isn’t too heavy when full. The wide base makes the bottle less likely to tip over when placed quickly on a table or vanity.  The opaque, dark gray color of this bottle protects light-sensitive liquids from light degradation.  It sprays well.  Highly recommended!\nReview Title: Opaque Silver-Gray Sprayer with Great Form and Function\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NeoCell Overnighter Collagen, 9.3oz\nReview Date: 2021/05/13\nStore: NeoCell\nAverage Rating: 4.4\nProduct Details: {'Brand': 'NeoCell', 'Item Form': 'Powder', 'Active Ingredients': 'Vitamin c,zinc', 'Unit Count': '9.3 Ounce', 'Number of Items': '1', 'Package Dimensions': '5.55 x 5.08 x 3.46 inches; 9.3 Ounces', 'UPC': '016185130623'}\nReview Text: The NeoCell overnighter collagen comes with about 20 servings in a $34.95 bottle, or about $1.75 per serving or day.  The blueberry pomegranate flavor is not really perceivable as such; the flavor is sweet and artificial.<br /><br />Collagen is supposed to moisture the skin and make it more elastic. However, intake of collagen in food form until recently was thought to be ineffective.  This product does actually seem to firm, hydrate and restore my wife's skin.  It has gaba and melatonin, so my wife tries to not take it prior to 20 minutes before bed.  After starting this product, she's been having to get up during the night to use the restroom, because this is to be taken with 8 ounces of water.  She would prefer to have this product in pill form, and to not have it include melatonin, which can help one fall asleep sooner, but may disrupt one's sleep cycle. So this product did not work well for my wife.\nReview Title: Melatonin and Water May Disrupt Sleep Cycle; Seems to Firm and Hydrate Skin\nRating: 3.0\n--------------------------------------------------",
  "reference": "BeautyBio GloPRO Regeneration Tools\n{'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nAt first, I was excited to get this micro-needling device, but then I started to look into micro needling. Dermatologists said to take Vitamin C 2 for weeks before use, and avoid sunlight; avoid makeup; your skin may peel afterward. So, I was afraid to try it out.  It turns out, that using this is not painful at all.  But when used on my forehead, it looks like it has more pores.  So, I decided to start taking vitamins, and planned out when to try this out, but I avoided trying it out before times when I planned to expose it to sunlight, along with one week before my (wife’s) period.<br /><br />Finally, I had the right time to try it out, and it had no obvious side effects...no pain, no skin flushing, no damage, no problems with sunlight or wearing makeup.  Because this is a device made for home use, it is much more mild than professional devices.  You may be able to use this every other day.<br /><br />The device is light weight, and rechargeable, but comes with batteries, so you don’t have to charge before use; this makes it easy to bring on travel.  I wish I had tried it much earlier.<br /><br />The head is supposed to be replaced every three months at a current cost of $35.  You are supposed to use a new cleaning pad before every use, and it came with 5 pads; the replacement skin prep pads are $35 for 30 pads which will last you two months, using it two to three times a week, which is what the manufacturer recommends.  The minimum monthly cost of supplies is about $38 per month.  You also need to have isopropyl (rubbing) alcohol to use with the provided spray bottle to sanitize the micro-needling head.<br /><br />I would recommend using sun screen after use, to protect your skin.<br /><br />After the first few uses, I haven’t seen much effect, but my husband thinks my face’s skin looks better.\nDon’t Be Afraid, Just Give it a Try!\nBioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly, Top Japanese Makeup Remover, Gentle Skin Cleanser, Mild Floral Fragrance, Non-Greasy, 7.8 Ounce\nBioré\n['Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly is a non-greasy makeup remover that removes dirt and impurities from deep below the surface of your skin. This top Japanese makeup remover glides on gently and leaves no sticky residue. Formulated with conditioning beauty essence, this jelly leaves skin feeling moisturized and free of makeup. Satisfaction Guaranteed. Limitations may apply.']\n{'Product Dimensions': '1.56 x 2.5 x 7.25 inches; 10.08 Ounces', 'Item model number': '28077_obs', 'UPC': '019100264557', 'Manufacturer': 'Kao USA Inc.'}\nBiore Cleansing oil make-up removing clothes come in a plastic box of 44 and are made in Japan.  At first, my wife thought that these are small and thin, but she found that one was sufficient to remove makeup and mascara, with mascara top coat (which can be challenging to remove with other wipes).  My wife has tried several brands before, including top-rated wipes, and all of them except for this one irritates her skin slightly.  These do not!  Her skin is pretty tough, and she doesn't usually have reactions to cosmetics.<br /><br />There is a label on the inner package with Japanese writing, that's not translated into English on the package.  It says to make sure to use the plastic box to store the wipes to ensure quality and peel off the sticker completely; don't remove the wipes from the bag; make sure to close the lid after use.  I'd suggest that the manufacturer add a translated version on the package.  The package says to use the entire package within 45 days after opening, so if you don't wear make-up every day, you may not finish the package before they start to dry out.<br /><br />My wife loves these!  Highly recommended, especially for those who have sensitive skin!\nEffective Wipes (with just one) - Recommended for those with Sensitive Skin!\nSmall Spray Bottle,Plastic Spray Bottle for Hair 3.4 oz Empty Travel Spray Bottle [ 5 PACK]\nARCTIC EAGLE\n{'Brand': 'ARCTIC EAGLE', 'Material': 'Plastic', 'Capacity': '3.4 Ounces', 'Product Care Instructions': 'Hand Wash Only', 'Reusability': 'Reusable', 'Package Dimensions': '8.3 x 5.7 x 1.7 inches; 3.99 Ounces', 'UPC': '791523481260'}\nThis set of 5 spray bottles comes with caps, a spare pump, and a very tiny funnel for filling.  The pumps work well, and create a very fine mist, that sprays about 10 inches from the nozzle.  The bottles are fairly rigid.  Overall, these are a great value!  The funnel could be a bit larger, as it's top opening is not much larger than the neck of the bottles. Recommended!\nGood Quality, Fine Mist, Spare Pump and Funnel\nminihope Women's Elastic Hair Tiea, Black, 120 Count (Pack of 1), 4MM for Medium Hair.Value pack.\nminihope\n{'Material': 'Metal', 'Item Form': 'elastic', 'Brand': 'minihope', 'Hair Type': 'Medium, Thick', 'Number of Pieces': '120', 'Package Dimensions': '6.3 x 2.9 x 2.2 inches; 7.2 Ounces', 'Item model number': 'ET-SET-200703', 'UPC': '725683672763 661757097431'}\nFor years, I have purchased random brands of elastic hair ties whenever I need more, and they have all performed similarly. I assumed that the Minihope Women's Hair Elastic Thick Ties would be just like the rest. Not so much. When I stretched one of them for the first time, they felt stiff and brittle, unlike all of the other elastic hair ties I have used. These stretch to about twice the original size when pulled, while my others stretch to about three times or more than the original size.<br /><br />Stretching a new Minihope Hair Elastic Thick Tie just three times, it did not return to the original size.  I’m guessing these won’t last long, even though they are more expensive than the ties I usually buy.\nStiff, Little Stretch, Lack Elasticity\nTravel Bottles Keychain, 1.7oz/50ml Portable Hand Sanitizer Bottles, Fine Mist Spray Keychain Bottles, Empty Leakproof Refillable Containers with Flip/Spray Cap Plastic Travel Bottles (5PC)\nXITENBAO\n{'Brand': 'XITENBAO', 'Material': 'Silicone,Plastic', 'Capacity': '50 Milliliters, 1.7 Ounces', 'Number of Items': '1', 'Special Feature': 'Portable, Mist Spray, Leakproof', 'Package Dimensions': '7 x 7 x 2.5 inches; 3.99 Ounces', 'Item model number': 'klp-001', 'UPC': '192408404112'}\nI have been using hand sanitizer bottles with built-in carabiners and sprayer bottles for rubbing alcohol, but had never looked for a spray bottle with built-in carabiners...  It is great that the sprayer bottles can be attached to something, as there is less chance of dropping and losing them while travelling.  Note that since the sprayer cap isn’t attached and can be still lost.<br /><br />This bottle can be used for gel / cream or liquid to spray. The sprayer tube extends to the bottom of the bottle near the narrow carabiner attachment hole, so you can spray until almost the last drop. The sprayer has been working well. It is also nice that the set includes a collapsible funnel for refilling.  Love them!\nGreat versatile little keychain bottles!\nSpray Bottle with Black Trigger, Suream 10.6oz/300ml Adjustable Sprayer with Stream Mist Mode for Hair, Refillable Empty Plastic Houseplant Mister for Hair Styling, Gardening, Ironing and Cleaning\nSUREAM\n{'Brand': 'SUREAM', 'Material': 'Plastic', 'Capacity': '10.6 Ounces', 'Number of Items': '1', 'Special Feature': 'Mist Spray', 'Package Dimensions': '11.81 x 4.92 x 3.27 inches; 3.21 Ounces', 'UPC': '704078929859'}\nI like this sprayer as it works very well and is the perfect size for hair products as it isn’t too heavy when full. The wide base makes the bottle less likely to tip over when placed quickly on a table or vanity.  The opaque, dark gray color of this bottle protects light-sensitive liquids from light degradation.  It sprays well.  Highly recommended!\nOpaque Silver-Gray Sprayer with Great Form and Function\nNeoCell Overnighter Collagen, 9.3oz\nNeoCell\n{'Brand': 'NeoCell', 'Item Form': 'Powder', 'Active Ingredients': 'Vitamin c,zinc', 'Unit Count': '9.3 Ounce', 'Number of Items': '1', 'Package Dimensions': '5.55 x 5.08 x 3.46 inches; 9.3 Ounces', 'UPC': '016185130623'}\nThe NeoCell overnighter collagen comes with about 20 servings in a $34.95 bottle, or about $1.75 per serving or day.  The blueberry pomegranate flavor is not really perceivable as such; the flavor is sweet and artificial.<br /><br />Collagen is supposed to moisture the skin and make it more elastic. However, intake of collagen in food form until recently was thought to be ineffective.  This product does actually seem to firm, hydrate and restore my wife's skin.  It has gaba and melatonin, so my wife tries to not take it prior to 20 minutes before bed.  After starting this product, she's been having to get up during the night to use the restroom, because this is to be taken with 8 ounces of water.  She would prefer to have this product in pill form, and to not have it include melatonin, which can help one fall asleep sooner, but may disrupt one's sleep cycle. So this product did not work well for my wife.\nMelatonin and Water May Disrupt Sleep Cycle; Seems to Firm and Hydrate Skin",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: BeautyBio GloPRO Regeneration Tools\nReview Date: 2019/10/06\nAverage Rating: 4.3\nProduct Details: {'Product Dimensions': '9.88 x 2.38 x 7.88 inches; 1.3 Pounds', 'Item model number': 'ZumYu', 'Batteries': '2 AAA batteries required. (included)', 'UPC': '810813030237 851262002673', 'Manufacturer': 'BeautyBio', 'Country of Origin': 'China'}\nReview Text: At first, I was excited to get this micro-needling device, but then I started to look into micro needling. Dermatologists said to take Vitamin C 2 for weeks before use, and avoid sunlight; avoid makeup; your skin may peel afterward. So, I was afraid to try it out.  It turns out, that using this is not painful at all.  But when used on my forehead, it looks like it has more pores.  So, I decided to start taking vitamins, and planned out when to try this out, but I avoided trying it out before times when I planned to expose it to sunlight, along with one week before my (wife’s) period.<br /><br />Finally, I had the right time to try it out, and it had no obvious side effects...no pain, no skin flushing, no damage, no problems with sunlight or wearing makeup.  Because this is a device made for home use, it is much more mild than professional devices.  You may be able to use this every other day.<br /><br />The device is light weight, and rechargeable, but comes with batteries, so you don’t have to charge before use; this makes it easy to bring on travel.  I wish I had tried it much earlier.<br /><br />The head is supposed to be replaced every three months at a current cost of $35.  You are supposed to use a new cleaning pad before every use, and it came with 5 pads; the replacement skin prep pads are $35 for 30 pads which will last you two months, using it two to three times a week, which is what the manufacturer recommends.  The minimum monthly cost of supplies is about $38 per month.  You also need to have isopropyl (rubbing) alcohol to use with the provided spray bottle to sanitize the micro-needling head.<br /><br />I would recommend using sun screen after use, to protect your skin.<br /><br />After the first few uses, I haven’t seen much effect, but my husband thinks my face’s skin looks better.\nReview Title: Don’t Be Afraid, Just Give it a Try!\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly, Top Japanese Makeup Remover, Gentle Skin Cleanser, Mild Floral Fragrance, Non-Greasy, 7.8 Ounce\nReview Date: 2020/05/20\nStore: Bioré\nProduct Description: ['Bioré J-Beauty Makeup Removing Moisturizing Cleansing Jelly is a non-greasy makeup remover that removes dirt and impurities from deep below the surface of your skin. This top Japanese makeup remover glides on gently and leaves no sticky residue. Formulated with conditioning beauty essence, this jelly leaves skin feeling moisturized and free of makeup. Satisfaction Guaranteed. Limitations may apply.']\nAverage Rating: 4.4\nProduct Details: {'Product Dimensions': '1.56 x 2.5 x 7.25 inches; 10.08 Ounces', 'Item model number': '28077_obs', 'UPC': '019100264557', 'Manufacturer': 'Kao USA Inc.'}\nReview Text: Biore Cleansing oil make-up removing clothes come in a plastic box of 44 and are made in Japan.  At first, my wife thought that these are small and thin, but she found that one was sufficient to remove makeup and mascara, with mascara top coat (which can be challenging to remove with other wipes).  My wife has tried several brands before, including top-rated wipes, and all of them except for this one irritates her skin slightly.  These do not!  Her skin is pretty tough, and she doesn't usually have reactions to cosmetics.<br /><br />There is a label on the inner package with Japanese writing, that's not translated into English on the package.  It says to make sure to use the plastic box to store the wipes to ensure quality and peel off the sticker completely; don't remove the wipes from the bag; make sure to close the lid after use.  I'd suggest that the manufacturer add a translated version on the package.  The package says to use the entire package within 45 days after opening, so if you don't wear make-up every day, you may not finish the package before they start to dry out.<br /><br />My wife loves these!  Highly recommended, especially for those who have sensitive skin!\nReview Title: Effective Wipes (with just one) - Recommended for those with Sensitive Skin!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Small Spray Bottle,Plastic Spray Bottle for Hair 3.4 oz Empty Travel Spray Bottle [ 5 PACK]\nReview Date: 2020/06/24\nStore: ARCTIC EAGLE\nAverage Rating: 4.2\nProduct Details: {'Brand': 'ARCTIC EAGLE', 'Material': 'Plastic', 'Capacity': '3.4 Ounces', 'Product Care Instructions': 'Hand Wash Only', 'Reusability': 'Reusable', 'Package Dimensions': '8.3 x 5.7 x 1.7 inches; 3.99 Ounces', 'UPC': '791523481260'}\nReview Text: This set of 5 spray bottles comes with caps, a spare pump, and a very tiny funnel for filling.  The pumps work well, and create a very fine mist, that sprays about 10 inches from the nozzle.  The bottles are fairly rigid.  Overall, these are a great value!  The funnel could be a bit larger, as it's top opening is not much larger than the neck of the bottles. Recommended!\nReview Title: Good Quality, Fine Mist, Spare Pump and Funnel\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: minihope Women's Elastic Hair Tiea, Black, 120 Count (Pack of 1), 4MM for Medium Hair.Value pack.\nReview Date: 2020/08/24\nStore: minihope\nAverage Rating: 4.6\nProduct Details: {'Material': 'Metal', 'Item Form': 'elastic', 'Brand': 'minihope', 'Hair Type': 'Medium, Thick', 'Number of Pieces': '120', 'Package Dimensions': '6.3 x 2.9 x 2.2 inches; 7.2 Ounces', 'Item model number': 'ET-SET-200703', 'UPC': '725683672763 661757097431'}\nReview Text: For years, I have purchased random brands of elastic hair ties whenever I need more, and they have all performed similarly. I assumed that the Minihope Women's Hair Elastic Thick Ties would be just like the rest. Not so much. When I stretched one of them for the first time, they felt stiff and brittle, unlike all of the other elastic hair ties I have used. These stretch to about twice the original size when pulled, while my others stretch to about three times or more than the original size.<br /><br />Stretching a new Minihope Hair Elastic Thick Tie just three times, it did not return to the original size.  I’m guessing these won’t last long, even though they are more expensive than the ties I usually buy.\nReview Title: Stiff, Little Stretch, Lack Elasticity\nRating: 2.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Travel Bottles Keychain, 1.7oz/50ml Portable Hand Sanitizer Bottles, Fine Mist Spray Keychain Bottles, Empty Leakproof Refillable Containers with Flip/Spray Cap Plastic Travel Bottles (5PC)\nReview Date: 2020/11/09\nStore: XITENBAO\nAverage Rating: 4.4\nProduct Details: {'Brand': 'XITENBAO', 'Material': 'Silicone,Plastic', 'Capacity': '50 Milliliters, 1.7 Ounces', 'Number of Items': '1', 'Special Feature': 'Portable, Mist Spray, Leakproof', 'Package Dimensions': '7 x 7 x 2.5 inches; 3.99 Ounces', 'Item model number': 'klp-001', 'UPC': '192408404112'}\nReview Text: I have been using hand sanitizer bottles with built-in carabiners and sprayer bottles for rubbing alcohol, but had never looked for a spray bottle with built-in carabiners...  It is great that the sprayer bottles can be attached to something, as there is less chance of dropping and losing them while travelling.  Note that since the sprayer cap isn’t attached and can be still lost.<br /><br />This bottle can be used for gel / cream or liquid to spray. The sprayer tube extends to the bottom of the bottle near the narrow carabiner attachment hole, so you can spray until almost the last drop. The sprayer has been working well. It is also nice that the set includes a collapsible funnel for refilling.  Love them!\nReview Title: Great versatile little keychain bottles!\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Spray Bottle with Black Trigger, Suream 10.6oz/300ml Adjustable Sprayer with Stream Mist Mode for Hair, Refillable Empty Plastic Houseplant Mister for Hair Styling, Gardening, Ironing and Cleaning\nReview Date: 2020/11/09\nStore: SUREAM\nAverage Rating: 4.4\nProduct Details: {'Brand': 'SUREAM', 'Material': 'Plastic', 'Capacity': '10.6 Ounces', 'Number of Items': '1', 'Special Feature': 'Mist Spray', 'Package Dimensions': '11.81 x 4.92 x 3.27 inches; 3.21 Ounces', 'UPC': '704078929859'}\nReview Text: I like this sprayer as it works very well and is the perfect size for hair products as it isn’t too heavy when full. The wide base makes the bottle less likely to tip over when placed quickly on a table or vanity.  The opaque, dark gray color of this bottle protects light-sensitive liquids from light degradation.  It sprays well.  Highly recommended!\nReview Title: Opaque Silver-Gray Sprayer with Great Form and Function\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: NeoCell Overnighter Collagen, 9.3oz\nReview Date: 2021/05/13\nStore: NeoCell\nAverage Rating: 4.4\nProduct Details: {'Brand': 'NeoCell', 'Item Form': 'Powder', 'Active Ingredients': 'Vitamin c,zinc', 'Unit Count': '9.3 Ounce', 'Number of Items': '1', 'Package Dimensions': '5.55 x 5.08 x 3.46 inches; 9.3 Ounces', 'UPC': '016185130623'}\nReview Text: The NeoCell overnighter collagen comes with about 20 servings in a $34.95 bottle, or about $1.75 per serving or day.  The blueberry pomegranate flavor is not really perceivable as such; the flavor is sweet and artificial.<br /><br />Collagen is supposed to moisture the skin and make it more elastic. However, intake of collagen in food form until recently was thought to be ineffective.  This product does actually seem to firm, hydrate and restore my wife's skin.  It has gaba and melatonin, so my wife tries to not take it prior to 20 minutes before bed.  After starting this product, she's been having to get up during the night to use the restroom, because this is to be taken with 8 ounces of water.  She would prefer to have this product in pill form, and to not have it include melatonin, which can help one fall asleep sooner, but may disrupt one's sleep cycle. So this product did not work well for my wife.\nReview Title: Melatonin and Water May Disrupt Sleep Cycle; Seems to Firm and Hydrate Skin\nRating: 3.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:\nThe user has experienced several positive interactions with beauty and skincare products. They enjoyed the micro-needling device's mildness and ease of use, appreciating its home-friendly design and portability. The makeup remover was highly praised for its effectiveness, particularly on sensitive skin, proving to be gentle and non-irritating. Additionally, the travel spray bottles were noted for their quality and versatility, making them suitable for various uses. The larger spray bottle received accolades for its functionality and size, enhancing hair product application with its effective spray mechanism. Overall, the user expressed satisfaction with the quality and performance of several products.\n\nNEGATIVE SUMMARY:\nThe user encountered some negative experiences, particularly with the hair ties, which they found to lack elasticity and durability, suggesting that they may not last long despite their higher price. The collagen supplement's flavor and formulation were also points of contention, with the user disliking the sweet artificial taste and the inclusion of melatonin, which disrupted their sleep cycle. Although the micro-needling device initially caused apprehension due to pre-usage skin care requirements, noticeable negative effects such as increased pore visibility were noted, leading to mixed feelings about the overall effectiveness.\n\nOVERALL SUMMARY:\nThe user's shopping experience reflects both positive and negative aspects. Positive outcomes included effective skincare solutions and reliable beauty tools that demonstrated quality and gentleness, particularly for sensitive skin. However, some products fell short of expectations, with the hair ties lacking elasticity and the collagen supplement's formulation negatively impacting sleep. Despite these challenges, the user maintains a generally favorable view of the products, particularly for their usability and effectiveness in skincare routines. The blend of positive experiences and minor setbacks indicates a continued interest in exploring new beauty solutions while remaining mindful of individual product performance.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Moisturizes Well, Doesn't Seem to Unclog Pores or Exfoliate Well",
    "text": "The Skinesque Wake Up and Makeup prep facial sheet mast is supposed to detox, moisturize, and anti-age skin.  My wife said it did not exfoliate or unclog and minimize pores, as far as she could tell.  But it surely moisturized the skin, after using only for 3 minutes.  This helps her with her makeup application.  She thinks using this in the morning seems to be a great idea!  At $27.45 for 30, they're $0.92 each.  She thinks that this isn't a great value, but is a fair value.<br /><br />They come in a box with a built-in tweezer and tweezer holder.  The tweezers are used to remove the masks without touching them.  The box is made of a heavy plastic, so it doesn't seem to be more ecologically responsible than selling wipes in individual packs.",
    "images": [],
    "asin": "B07YXB7TJ4",
    "parent_asin": "B07YXB7TJ4",
    "user_id": "AEPS33MI7LANKDAHRYF2MRKNYTIQ",
    "timestamp": "2021-12-20 01:44:14.169000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "SKINESQUE Wake Up and Makeup Prep facial Sheet Mask antiaging detox moisturizing Nicinamicide essence korean skin care, 30 sheet masks per container",
    "average_rating": 4.3,
    "rating_number": 46,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51F5MBZ6hgL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51F5MBZ6hgL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81C8wecJXPL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/418gpVcn8bL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/418gpVcn8bL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/615S0kBkXHL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41wcw1oRGuL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41wcw1oRGuL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61FNvnvQ-DL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/419Pj5x8fYL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/419Pj5x8fYL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71Wbl0DlNQL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/412Gbp9p2cL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/412Gbp9p2cL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/61WaC9NAU8L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51804twU3oL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51804twU3oL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71gzQNJ+5PL._SL1500_.jpg"
      }
    ],
    "videos": [
      {
        "title": "Skinesque - Wake Up & Makeup Prep Sheet Mask",
        "url": "https://www.amazon.com/vdp/06e6640842f8485895cdde685d9ee83e?ref=dp_vse_rvc_0",
        "user_id": ""
      },
      {
        "title": "Pick and Quick Mask",
        "url": "https://www.amazon.com/vdp/000d19840a0046089476a52b85961ff6?ref=dp_vse_rvc_1",
        "user_id": ""
      },
      {
        "title": "How to Use",
        "url": "https://www.amazon.com/vdp/944d2dc9f94d4957ab908d3ee6a8c6bc?ref=dp_vse_rvc_2",
        "user_id": ""
      },
      {
        "title": "DEWYTREE Pick and Quick Mask",
        "url": "https://www.amazon.com/vdp/0dab4c65c6534bcbaa33d57b119001e3?ref=dp_vse_rvc_3",
        "user_id": ""
      },
      {
        "title": "when sheetmasks come in baby wipe packaging",
        "url": "https://www.amazon.com/vdp/09ec99774f4b46a1a9b7a31412ed9ab7?ref=dp_vse_rvc_4",
        "user_id": "/shop/influencer-7ebf1feb"
      }
    ],
    "store": "SKINESQUE",
    "categories": [],
    "details": {
      "Package Dimensions": "5 x 4.2 x 2.8 inches; 1.22 Pounds",
      "UPC": "855501006224"
    },
    "bought_together": null
  }
}