{
  "user_id": "AFATNFWGYVVMEZWGDNLDUXRBRFLQ",
  "summary": "=== Purchase Information ===\nProduct Title: Imstyle Drag Queens Wig Wavy Ash Brown Heat Resistant Synthetic Lace Wig\nReview Date: 2016/09/29\nStore: IMSTYLE\nAverage Rating: 2.1\nProduct Details: {'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'IMSTYLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.21 x 6.5 x 2.4 inches; 13.05 Ounces', 'Item model number': 'CWN5#16/8', 'UPC': '795400523081'}\nReview Text: Amazing quality and realistic looking product. Imstyle's Ash Brown. I hope they bring this back. After trying out so many wigs for fun and costuming, this is IT. I would buy this again in a heartbeat.\nReview Title: Amazing. This Looks So Real. Color is Fantastic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CORELLE Livingware South Beach 8.5\" Plate (Set of 4), 8.5 Inch (Pack of 4)\nReview Date: 2017/12/20\nStore: Corelle\nProduct Description: ['Corelle Livingware South Beach 8.5\" Plate (Set of 4)']\nAverage Rating: 4.7\nProduct Details: {'Material': 'Glass', 'Brand': 'Corelle', 'Color': 'Nipple-471', 'Special Feature': 'Alcohol-Free', 'Occasion': 'Beach', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 10 x 1 inches; 8.64 Ounces', 'Item model number': '1113999', 'Department': 'Womens', 'UPC': '071160081611 793842466546 735343339578', 'Manufacturer': 'CORELLE'}\nReview Text: When I was a kid, we'd always had these around our home- different patterns of course, but the same Corelle glass plate sets that I still love today. And boy am I sorry I had given so many settings away to charities over the years as I've moved, thinking I'd just get some nicer plates.  Well, I do have &#34;nicer&#34; (aka at least more expensive, anyways) plates, and had gone through that whole phase w the bridal registry picks, fancy parties and such. Lately tho, I am back to ease of use, and simple living is far more important to me. I've been purchasing Corelle plates and bowls again, which I like to use the most, because nothing beats their lightweight and thin design, and I love their bright designs, like this newer South Beach pattern, which is just very Happy.  Some things just are good, and stay good, no matter how many years pass.\nReview Title: Awesome Corelle. What's Not to Love?\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nReview Date: 2019/06/17\nStore: Temer\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nReview Text: This Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer is a very good moisturizing acid, with the benefit of stimulating skin sloughing and renewal over time. The texture is like a lightweight syrup (but not sticky), and it has very little fragrance. This goes on the face smoothly and provides a protective, lightly moisturizing feel that does not sting at all. I like how my face feels very soft and dewy when I wake up, as I use this before bedtime. I think my skin has definitely improved in texture over the few weeks I've used this.\nReview Title: Lightly Moisturizing and Non-Stinging\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Segbeauty empty bottle 290\nReview Date: 2019/10/21\nStore: TruuMe\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nReview Text: This Fine Mist Clear Bottles, Segbeauty 5.4oz/160ml Continuous Plastic Spray Squirt Bottle is a unique style spray bottle that mists fairly well, without the typical pump action you need with regular manual spray bottles. This has a pressurized lever that provides a longer spray with one squeeze. The mist is fine, but not quite as fine as I was hoping- it's more granular than a steamer or vibration dispenser (like cool mist vaporizers), but this is manual, so I guess I'm complaining for no reason. For a hand pump spray, this is a very good (fine) spray overall.  They recommend that you not put anything but water in the device, and I'm guessing that may be due to it being easy to clog. So, if you do add some other products in the bottle, just be aware that it's not recommended.\nReview Title: Unique, Manual Squeeze-type Water Spray\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Files and Buffers, Teenitor 16PCS Professional Nail Manicure Tool for Acrylic Nails, 100/180 and 120/240 Grits Emery Boards 120 Grits Nail Buffer Block for Shaping and Buffing Nails\nReview Date: 2020/01/22\nStore: Teenitor\nAverage Rating: 4.6\nProduct Details: {'Package Dimensions': '7 x 6 x 1 inches; 3.21 Ounces'}\nReview Text: This Teenitor Nail File And Buffer gives you quite a bit of product at a good price. This includes the 10 large 2 sided nail files as well as the 6 soft sponge smoothing finishers. These work well for either smoothing out the ridges on your natural nails, or doing doing a final once over for a clean finish. I wouldn't be using these for the first pass on acrylics though, as the grit is too fine. This is a good value set.\nReview Title: Good Value For A Finishing Smoother Set\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sliver Grey Hair Color Wax Temporary Hairstyle Cream 4.23 oz Hair Pomades Natural White Hairstyle Wax for Party Cosplay Halloween Date (Grey)…\nReview Date: 2020/01/22\nStore: SOVONCARE\nAverage Rating: 3.1\nProduct Details: {'Hair Type': 'All', 'Item Form': 'Wax', 'Brand': 'SOVONCARE', 'Unit Count': '4.23 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.94 x 2.94 x 2.11 inches; 6.38 Ounces', 'UPC': '725732252984'}\nReview Text: I have about 5 different colors of this Mofajang Hair Color Wax Temporary Hairstyle Cream, and I purchased them before I got this gray sample to try. what I like about these products is that they add a temporary color to my already light grey hair- such as a pink or purple tinge or even a darker gray or darker blue gray...you get the picture. This easily adds a pastel color to my lighter hair with a smallish amount of product.  I could see that to change up dark hair or to get a strong/intense color tone, you'd need to pile this stuff on, and I think that's where this gets a bad rap. Yes, you can glob this on to higher opacity and change your dark colored hair to the color shown in the jar. BUT, you need a lot to do this, and you may not like the sticky, waxy result -it is wax, after all. If you are using a little bit (about a quarter sized blob) and adding this through your washed and wet hair and then blow dry, your hair will still move naturally and have the lighter tone of the product, provided your hair was fairly light to begin with-- just my two cents.\nReview Title: Very Good For Some Purposes, Difficult For Others\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 360 Pieces French False Nails Artificial Fingernails Pink White French Fake Nail Tips Kit 12 Sizes Full Cover with Nail Files and Stick for Salon DIY Decoration\nReview Date: 2020/02/14\nStore: Mudder\nAverage Rating: 3.6\nProduct Details: {'Size': '370 Piece Set', 'Material': 'Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'Mudder', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Product Dimensions': '7.09 x 1.97 x 0.79 inches; 1.76 Ounces'}\nReview Text: Having tried many fake nail tops, I know they fit differently for everyone. I feel very lucky that this particular set fits my nail bed very well- so much so that I barely have to file them to fit, and they conform to the curvature of my nail as well. These are on the slightly thinner side, which I prefer, because they feel and look a lot more natural on top. The length is perfect too- not too long.<br /><br />I lightly buffed the top of these and painted them w regular nail polish. If I polish without buffing, they can crinkle a bit - I have not tried gel yet tho, and that probably will work out w a clear top if I want to keep the white tip look. Even without polish, the buffed look just looks like a beautiful pink matte polish, as if I had painted them that way on purpose. Some commenters have said the white part scratches off somewhat easily. This is true. But, I love these for the natural look and great fit, and am buying another set now, so I never run out.\nReview Title: Best Nails I've Tried- Very Good Fit For Me\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nReview Date: 2020/06/05\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nReview Text: I really love this NOBLE Natural Straight Lace Front Wigs Burgundy Color- it's only slightly burgundy- and more auburn imo, but it looks very natural and not artificially colored. The texture is also smooth and heavy, but it's slippery or shiny. This fits my head very comfortably and looked great out of the box with very little plucking or adjusting. This is one of my more worn wigs. I'd definitely recommend.\nReview Title: Realistic and Fits So Well\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EMMOR Long Ash Blonde Wig for Women - Natural Straight Hair With Air Bang Wigs, Party Cosplay Daily Use\nReview Date: 2020/08/02\nStore: EMMOR\nAverage Rating: 3.3\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.19 x 9.29 x 2.72 inches; 10.62 Ounces'}\nReview Text: This EMMOR Long Ash Blonde Wig for Women - Natural Straight Hair Middle Part With Air Bangs is a really nice wig that feels very comfortable on, and looks very natural. The top has a rubberized part that looks better imo than the circular spot part that a lot of less pricey wigs have, and the hair is thick with a lot of gradations in color that make this very pretty. My daughter thought it was too shiny, but a little powder will take that out. The only thing I'd note is that this is less ash blonde than I expected in color- it's has more of a darker blonde/ reddish/ golden tone- still very pretty however.\nReview Title: Pretty Wig- Very Comfortable, Well Made\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 16 Jars Chrome Nail Powder Kit Mirror Effect Manicure Decoration Pigment 16 Colors Art Nail Powders with 16pcs Eyeshadow Sticks, 1g/Jar (Mirror-16 Jars)\nReview Date: 2021/02/20\nStore: FIFATA\nAverage Rating: 4.2\nProduct Details: {'Brand': 'FIFATA', 'Item Weight': '1 Grams', 'Number of Pieces': '16', 'Item Form': 'Powder', 'Recommended Uses For Product': 'Arts', 'Package Dimensions': '7.6 x 7 x 2.6 inches; 0.04 Ounces'}\nReview Text: This 16 Jars Chrome Nail Powder Kit Mirror Effect Manicure Decoration Pigment is a set with more colors than I can use, and it's a good value. The powders themselves last forever because you need so little to get the shine coating, and they \"stick\" well to my polish. I use this right under my final gel coat, and it makes the underlying colors come to life. This is a great set.\nReview Title: Great Set- Wide Variety of Colors\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nReview Date: 2021/03/13\nStore: COSYMAY\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nReview Text: This COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight is quite nice. I received a good quality unit with thick feeling hair that looked like virgin hair. The lace front was as expected and the part was easy to move around naturally. I only deducted a star because the hair became a bit thinner near the ends, a bit more than usual, and I'd recommend getting a longer length if you are planning to get a straight cut at the bottom vs. more of a \"v\" shape.\nReview Title: Comfortable Cap, Good Quality and Weight\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AISI BEAUTY Short Wavy Bob Wig with Bangs Shoulder Length Burgundy Synthetic Bob Curly Wigs for Women Natural Looking Heat Resistant Fiber Hair\nReview Date: 2021/06/06\nStore: AISI BEAUTY\nAverage Rating: 4.1\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Brand': 'AISI BEAUTY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.13 x 9.21 x 2.95 inches; 9.59 Ounces'}\nReview Text: This AISI BEAUTY Short Wavy Bob Wig with Bangs Shoulder Length Burgundy is a comfortable unit with straight across bangs and a wavy, casual look. The unit has a single point top, and the hair is shiny, but not overly so, and it looks fun and casual. This is a pretty color, and you could get away with wearing this for daily use with a band.\nReview Title: Good Quality, Fun Wig\nRating: 4.0\n--------------------------------------------------",
  "reference": "Imstyle Drag Queens Wig Wavy Ash Brown Heat Resistant Synthetic Lace Wig\nIMSTYLE\n{'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'IMSTYLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.21 x 6.5 x 2.4 inches; 13.05 Ounces', 'Item model number': 'CWN5#16/8', 'UPC': '795400523081'}\nAmazing quality and realistic looking product. Imstyle's Ash Brown. I hope they bring this back. After trying out so many wigs for fun and costuming, this is IT. I would buy this again in a heartbeat.\nAmazing. This Looks So Real. Color is Fantastic\nCORELLE Livingware South Beach 8.5\" Plate (Set of 4), 8.5 Inch (Pack of 4)\nCorelle\n['Corelle Livingware South Beach 8.5\" Plate (Set of 4)']\n{'Material': 'Glass', 'Brand': 'Corelle', 'Color': 'Nipple-471', 'Special Feature': 'Alcohol-Free', 'Occasion': 'Beach', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 10 x 1 inches; 8.64 Ounces', 'Item model number': '1113999', 'Department': 'Womens', 'UPC': '071160081611 793842466546 735343339578', 'Manufacturer': 'CORELLE'}\nWhen I was a kid, we'd always had these around our home- different patterns of course, but the same Corelle glass plate sets that I still love today. And boy am I sorry I had given so many settings away to charities over the years as I've moved, thinking I'd just get some nicer plates.  Well, I do have &#34;nicer&#34; (aka at least more expensive, anyways) plates, and had gone through that whole phase w the bridal registry picks, fancy parties and such. Lately tho, I am back to ease of use, and simple living is far more important to me. I've been purchasing Corelle plates and bowls again, which I like to use the most, because nothing beats their lightweight and thin design, and I love their bright designs, like this newer South Beach pattern, which is just very Happy.  Some things just are good, and stay good, no matter how many years pass.\nAwesome Corelle. What's Not to Love?\n1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nTemer\n{'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nThis Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer is a very good moisturizing acid, with the benefit of stimulating skin sloughing and renewal over time. The texture is like a lightweight syrup (but not sticky), and it has very little fragrance. This goes on the face smoothly and provides a protective, lightly moisturizing feel that does not sting at all. I like how my face feels very soft and dewy when I wake up, as I use this before bedtime. I think my skin has definitely improved in texture over the few weeks I've used this.\nLightly Moisturizing and Non-Stinging\nSegbeauty empty bottle 290\nTruuMe\n{'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nThis Fine Mist Clear Bottles, Segbeauty 5.4oz/160ml Continuous Plastic Spray Squirt Bottle is a unique style spray bottle that mists fairly well, without the typical pump action you need with regular manual spray bottles. This has a pressurized lever that provides a longer spray with one squeeze. The mist is fine, but not quite as fine as I was hoping- it's more granular than a steamer or vibration dispenser (like cool mist vaporizers), but this is manual, so I guess I'm complaining for no reason. For a hand pump spray, this is a very good (fine) spray overall.  They recommend that you not put anything but water in the device, and I'm guessing that may be due to it being easy to clog. So, if you do add some other products in the bottle, just be aware that it's not recommended.\nUnique, Manual Squeeze-type Water Spray\nNail Files and Buffers, Teenitor 16PCS Professional Nail Manicure Tool for Acrylic Nails, 100/180 and 120/240 Grits Emery Boards 120 Grits Nail Buffer Block for Shaping and Buffing Nails\nTeenitor\n{'Package Dimensions': '7 x 6 x 1 inches; 3.21 Ounces'}\nThis Teenitor Nail File And Buffer gives you quite a bit of product at a good price. This includes the 10 large 2 sided nail files as well as the 6 soft sponge smoothing finishers. These work well for either smoothing out the ridges on your natural nails, or doing doing a final once over for a clean finish. I wouldn't be using these for the first pass on acrylics though, as the grit is too fine. This is a good value set.\nGood Value For A Finishing Smoother Set\nSliver Grey Hair Color Wax Temporary Hairstyle Cream 4.23 oz Hair Pomades Natural White Hairstyle Wax for Party Cosplay Halloween Date (Grey)…\nSOVONCARE\n{'Hair Type': 'All', 'Item Form': 'Wax', 'Brand': 'SOVONCARE', 'Unit Count': '4.23 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.94 x 2.94 x 2.11 inches; 6.38 Ounces', 'UPC': '725732252984'}\nI have about 5 different colors of this Mofajang Hair Color Wax Temporary Hairstyle Cream, and I purchased them before I got this gray sample to try. what I like about these products is that they add a temporary color to my already light grey hair- such as a pink or purple tinge or even a darker gray or darker blue gray...you get the picture. This easily adds a pastel color to my lighter hair with a smallish amount of product.  I could see that to change up dark hair or to get a strong/intense color tone, you'd need to pile this stuff on, and I think that's where this gets a bad rap. Yes, you can glob this on to higher opacity and change your dark colored hair to the color shown in the jar. BUT, you need a lot to do this, and you may not like the sticky, waxy result -it is wax, after all. If you are using a little bit (about a quarter sized blob) and adding this through your washed and wet hair and then blow dry, your hair will still move naturally and have the lighter tone of the product, provided your hair was fairly light to begin with-- just my two cents.\nVery Good For Some Purposes, Difficult For Others\n360 Pieces French False Nails Artificial Fingernails Pink White French Fake Nail Tips Kit 12 Sizes Full Cover with Nail Files and Stick for Salon DIY Decoration\nMudder\n{'Size': '370 Piece Set', 'Material': 'Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'Mudder', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Product Dimensions': '7.09 x 1.97 x 0.79 inches; 1.76 Ounces'}\nHaving tried many fake nail tops, I know they fit differently for everyone. I feel very lucky that this particular set fits my nail bed very well- so much so that I barely have to file them to fit, and they conform to the curvature of my nail as well. These are on the slightly thinner side, which I prefer, because they feel and look a lot more natural on top. The length is perfect too- not too long.<br /><br />I lightly buffed the top of these and painted them w regular nail polish. If I polish without buffing, they can crinkle a bit - I have not tried gel yet tho, and that probably will work out w a clear top if I want to keep the white tip look. Even without polish, the buffed look just looks like a beautiful pink matte polish, as if I had painted them that way on purpose. Some commenters have said the white part scratches off somewhat easily. This is true. But, I love these for the natural look and great fit, and am buying another set now, so I never run out.\nBest Nails I've Tried- Very Good Fit For Me\nStraight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nNOBLE\n{'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nI really love this NOBLE Natural Straight Lace Front Wigs Burgundy Color- it's only slightly burgundy- and more auburn imo, but it looks very natural and not artificially colored. The texture is also smooth and heavy, but it's slippery or shiny. This fits my head very comfortably and looked great out of the box with very little plucking or adjusting. This is one of my more worn wigs. I'd definitely recommend.\nRealistic and Fits So Well\nEMMOR Long Ash Blonde Wig for Women - Natural Straight Hair With Air Bang Wigs, Party Cosplay Daily Use\nEMMOR\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.19 x 9.29 x 2.72 inches; 10.62 Ounces'}\nThis EMMOR Long Ash Blonde Wig for Women - Natural Straight Hair Middle Part With Air Bangs is a really nice wig that feels very comfortable on, and looks very natural. The top has a rubberized part that looks better imo than the circular spot part that a lot of less pricey wigs have, and the hair is thick with a lot of gradations in color that make this very pretty. My daughter thought it was too shiny, but a little powder will take that out. The only thing I'd note is that this is less ash blonde than I expected in color- it's has more of a darker blonde/ reddish/ golden tone- still very pretty however.\nPretty Wig- Very Comfortable, Well Made\n16 Jars Chrome Nail Powder Kit Mirror Effect Manicure Decoration Pigment 16 Colors Art Nail Powders with 16pcs Eyeshadow Sticks, 1g/Jar (Mirror-16 Jars)\nFIFATA\n{'Brand': 'FIFATA', 'Item Weight': '1 Grams', 'Number of Pieces': '16', 'Item Form': 'Powder', 'Recommended Uses For Product': 'Arts', 'Package Dimensions': '7.6 x 7 x 2.6 inches; 0.04 Ounces'}\nThis 16 Jars Chrome Nail Powder Kit Mirror Effect Manicure Decoration Pigment is a set with more colors than I can use, and it's a good value. The powders themselves last forever because you need so little to get the shine coating, and they \"stick\" well to my polish. I use this right under my final gel coat, and it makes the underlying colors come to life. This is a great set.\nGreat Set- Wide Variety of Colors\nCOSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nCOSYMAY\n{'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nThis COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight is quite nice. I received a good quality unit with thick feeling hair that looked like virgin hair. The lace front was as expected and the part was easy to move around naturally. I only deducted a star because the hair became a bit thinner near the ends, a bit more than usual, and I'd recommend getting a longer length if you are planning to get a straight cut at the bottom vs. more of a \"v\" shape.\nComfortable Cap, Good Quality and Weight\nAISI BEAUTY Short Wavy Bob Wig with Bangs Shoulder Length Burgundy Synthetic Bob Curly Wigs for Women Natural Looking Heat Resistant Fiber Hair\nAISI BEAUTY\n{'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Brand': 'AISI BEAUTY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.13 x 9.21 x 2.95 inches; 9.59 Ounces'}\nThis AISI BEAUTY Short Wavy Bob Wig with Bangs Shoulder Length Burgundy is a comfortable unit with straight across bangs and a wavy, casual look. The unit has a single point top, and the hair is shiny, but not overly so, and it looks fun and casual. This is a pretty color, and you could get away with wearing this for daily use with a band.\nGood Quality, Fun Wig",
  "prompt": "Based on the provided purchase history, generate three separate summaries focusing on different aspects of the user's experiences. Each summary should be under 256 words. Focus only on keywords and clear trends supported by multiple interactions. Do not repeat specific product names or details. avoid repeating product names, specifications, or technical details:\n\n        1. POSITIVE: Describe only the positive experiences and what was liked.\n\n        2. NEGATIVE: Describe only the negative experiences and what was disliked.\n\n        3. OVERALL: Provide a overall summary including both positive and negative aspects.\n\n        Here's the purchase data:\n\n        === Purchase Information ===\nProduct Title: Imstyle Drag Queens Wig Wavy Ash Brown Heat Resistant Synthetic Lace Wig\nReview Date: 2016/09/29\nStore: IMSTYLE\nAverage Rating: 2.1\nProduct Details: {'Hair Type': 'Wavy', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'IMSTYLE', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.21 x 6.5 x 2.4 inches; 13.05 Ounces', 'Item model number': 'CWN5#16/8', 'UPC': '795400523081'}\nReview Text: Amazing quality and realistic looking product. Imstyle's Ash Brown. I hope they bring this back. After trying out so many wigs for fun and costuming, this is IT. I would buy this again in a heartbeat.\nReview Title: Amazing. This Looks So Real. Color is Fantastic\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: CORELLE Livingware South Beach 8.5\" Plate (Set of 4), 8.5 Inch (Pack of 4)\nReview Date: 2017/12/20\nStore: Corelle\nProduct Description: ['Corelle Livingware South Beach 8.5\" Plate (Set of 4)']\nAverage Rating: 4.7\nProduct Details: {'Material': 'Glass', 'Brand': 'Corelle', 'Color': 'Nipple-471', 'Special Feature': 'Alcohol-Free', 'Occasion': 'Beach', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '10 x 10 x 1 inches; 8.64 Ounces', 'Item model number': '1113999', 'Department': 'Womens', 'UPC': '071160081611 793842466546 735343339578', 'Manufacturer': 'CORELLE'}\nReview Text: When I was a kid, we'd always had these around our home- different patterns of course, but the same Corelle glass plate sets that I still love today. And boy am I sorry I had given so many settings away to charities over the years as I've moved, thinking I'd just get some nicer plates.  Well, I do have &#34;nicer&#34; (aka at least more expensive, anyways) plates, and had gone through that whole phase w the bridal registry picks, fancy parties and such. Lately tho, I am back to ease of use, and simple living is far more important to me. I've been purchasing Corelle plates and bowls again, which I like to use the most, because nothing beats their lightweight and thin design, and I love their bright designs, like this newer South Beach pattern, which is just very Happy.  Some things just are good, and stay good, no matter how many years pass.\nReview Title: Awesome Corelle. What's Not to Love?\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 1 Ounce Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer with Anti-Aging Skin Care Properties. Beauty and Skin Care\nReview Date: 2019/06/17\nStore: Temer\nAverage Rating: 4.2\nProduct Details: {'Brand': 'Temer', 'Item Form': 'Oil', 'Active Ingredients': 'Hyaluronic_acid', 'Unit Count': '1 Fl. Oz', 'Number of Items': '1'}\nReview Text: This Hyaluronic Acid Serum for Skin – Hydrating Facial Moisturizer is a very good moisturizing acid, with the benefit of stimulating skin sloughing and renewal over time. The texture is like a lightweight syrup (but not sticky), and it has very little fragrance. This goes on the face smoothly and provides a protective, lightly moisturizing feel that does not sting at all. I like how my face feels very soft and dewy when I wake up, as I use this before bedtime. I think my skin has definitely improved in texture over the few weeks I've used this.\nReview Title: Lightly Moisturizing and Non-Stinging\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Segbeauty empty bottle 290\nReview Date: 2019/10/21\nStore: TruuMe\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Segbeauty', 'Color': 'Clear', 'Material Type Free': 'Dairy Free', 'Item Weight': '3.4 Ounces', 'Bottle Nipple Type': 'Vented', 'Package Dimensions': '7.99 x 3.19 x 2.24 inches; 3.4 Ounces', 'Item model number': 'AM-160083-03', 'UPC': '701822757553 701822760621'}\nReview Text: This Fine Mist Clear Bottles, Segbeauty 5.4oz/160ml Continuous Plastic Spray Squirt Bottle is a unique style spray bottle that mists fairly well, without the typical pump action you need with regular manual spray bottles. This has a pressurized lever that provides a longer spray with one squeeze. The mist is fine, but not quite as fine as I was hoping- it's more granular than a steamer or vibration dispenser (like cool mist vaporizers), but this is manual, so I guess I'm complaining for no reason. For a hand pump spray, this is a very good (fine) spray overall.  They recommend that you not put anything but water in the device, and I'm guessing that may be due to it being easy to clog. So, if you do add some other products in the bottle, just be aware that it's not recommended.\nReview Title: Unique, Manual Squeeze-type Water Spray\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Nail Files and Buffers, Teenitor 16PCS Professional Nail Manicure Tool for Acrylic Nails, 100/180 and 120/240 Grits Emery Boards 120 Grits Nail Buffer Block for Shaping and Buffing Nails\nReview Date: 2020/01/22\nStore: Teenitor\nAverage Rating: 4.6\nProduct Details: {'Package Dimensions': '7 x 6 x 1 inches; 3.21 Ounces'}\nReview Text: This Teenitor Nail File And Buffer gives you quite a bit of product at a good price. This includes the 10 large 2 sided nail files as well as the 6 soft sponge smoothing finishers. These work well for either smoothing out the ridges on your natural nails, or doing doing a final once over for a clean finish. I wouldn't be using these for the first pass on acrylics though, as the grit is too fine. This is a good value set.\nReview Title: Good Value For A Finishing Smoother Set\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Sliver Grey Hair Color Wax Temporary Hairstyle Cream 4.23 oz Hair Pomades Natural White Hairstyle Wax for Party Cosplay Halloween Date (Grey)…\nReview Date: 2020/01/22\nStore: SOVONCARE\nAverage Rating: 3.1\nProduct Details: {'Hair Type': 'All', 'Item Form': 'Wax', 'Brand': 'SOVONCARE', 'Unit Count': '4.23 Fl Oz', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.94 x 2.94 x 2.11 inches; 6.38 Ounces', 'UPC': '725732252984'}\nReview Text: I have about 5 different colors of this Mofajang Hair Color Wax Temporary Hairstyle Cream, and I purchased them before I got this gray sample to try. what I like about these products is that they add a temporary color to my already light grey hair- such as a pink or purple tinge or even a darker gray or darker blue gray...you get the picture. This easily adds a pastel color to my lighter hair with a smallish amount of product.  I could see that to change up dark hair or to get a strong/intense color tone, you'd need to pile this stuff on, and I think that's where this gets a bad rap. Yes, you can glob this on to higher opacity and change your dark colored hair to the color shown in the jar. BUT, you need a lot to do this, and you may not like the sticky, waxy result -it is wax, after all. If you are using a little bit (about a quarter sized blob) and adding this through your washed and wet hair and then blow dry, your hair will still move naturally and have the lighter tone of the product, provided your hair was fairly light to begin with-- just my two cents.\nReview Title: Very Good For Some Purposes, Difficult For Others\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 360 Pieces French False Nails Artificial Fingernails Pink White French Fake Nail Tips Kit 12 Sizes Full Cover with Nail Files and Stick for Salon DIY Decoration\nReview Date: 2020/02/14\nStore: Mudder\nAverage Rating: 3.6\nProduct Details: {'Size': '370 Piece Set', 'Material': 'Acrylonitrile Butadiene Styrene (ABS)', 'Brand': 'Mudder', 'Style': 'French', 'Coverage': 'Full Well Tips', 'Product Dimensions': '7.09 x 1.97 x 0.79 inches; 1.76 Ounces'}\nReview Text: Having tried many fake nail tops, I know they fit differently for everyone. I feel very lucky that this particular set fits my nail bed very well- so much so that I barely have to file them to fit, and they conform to the curvature of my nail as well. These are on the slightly thinner side, which I prefer, because they feel and look a lot more natural on top. The length is perfect too- not too long.<br /><br />I lightly buffed the top of these and painted them w regular nail polish. If I polish without buffing, they can crinkle a bit - I have not tried gel yet tho, and that probably will work out w a clear top if I want to keep the white tip look. Even without polish, the buffed look just looks like a beautiful pink matte polish, as if I had painted them that way on purpose. Some commenters have said the white part scratches off somewhat easily. This is true. But, I love these for the natural look and great fit, and am buying another set now, so I never run out.\nReview Title: Best Nails I've Tried- Very Good Fit For Me\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: Straight 13x4 Lace Front Wigs Burgundy Lace Front Wigs Long Bob Synthetic Ombre Wine Red Wig Pre-plucked with Baby Hair Free Part Heat Resistant Synthetic Lace Wigs for Women 20 Inch\nReview Date: 2020/06/05\nStore: NOBLE\nAverage Rating: 3.8\nProduct Details: {'Material': 'Human Hair', 'Hair Type': 'Straight', 'Style': 'Modern', 'Special Feature': 'Heat Resistant', 'Brand': 'NOBLE', 'Package Dimensions': '13.74 x 7.87 x 2.2 inches; 12.63 Ounces'}\nReview Text: I really love this NOBLE Natural Straight Lace Front Wigs Burgundy Color- it's only slightly burgundy- and more auburn imo, but it looks very natural and not artificially colored. The texture is also smooth and heavy, but it's slippery or shiny. This fits my head very comfortably and looked great out of the box with very little plucking or adjusting. This is one of my more worn wigs. I'd definitely recommend.\nReview Title: Realistic and Fits So Well\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: EMMOR Long Ash Blonde Wig for Women - Natural Straight Hair With Air Bang Wigs, Party Cosplay Daily Use\nReview Date: 2020/08/02\nStore: EMMOR\nAverage Rating: 3.3\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Brand': 'EMMOR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '13.19 x 9.29 x 2.72 inches; 10.62 Ounces'}\nReview Text: This EMMOR Long Ash Blonde Wig for Women - Natural Straight Hair Middle Part With Air Bangs is a really nice wig that feels very comfortable on, and looks very natural. The top has a rubberized part that looks better imo than the circular spot part that a lot of less pricey wigs have, and the hair is thick with a lot of gradations in color that make this very pretty. My daughter thought it was too shiny, but a little powder will take that out. The only thing I'd note is that this is less ash blonde than I expected in color- it's has more of a darker blonde/ reddish/ golden tone- still very pretty however.\nReview Title: Pretty Wig- Very Comfortable, Well Made\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: 16 Jars Chrome Nail Powder Kit Mirror Effect Manicure Decoration Pigment 16 Colors Art Nail Powders with 16pcs Eyeshadow Sticks, 1g/Jar (Mirror-16 Jars)\nReview Date: 2021/02/20\nStore: FIFATA\nAverage Rating: 4.2\nProduct Details: {'Brand': 'FIFATA', 'Item Weight': '1 Grams', 'Number of Pieces': '16', 'Item Form': 'Powder', 'Recommended Uses For Product': 'Arts', 'Package Dimensions': '7.6 x 7 x 2.6 inches; 0.04 Ounces'}\nReview Text: This 16 Jars Chrome Nail Powder Kit Mirror Effect Manicure Decoration Pigment is a set with more colors than I can use, and it's a good value. The powders themselves last forever because you need so little to get the shine coating, and they \"stick\" well to my polish. I use this right under my final gel coat, and it makes the underlying colors come to life. This is a great set.\nReview Title: Great Set- Wide Variety of Colors\nRating: 5.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight Wig Brazilian Virgin Hair Full Wig Average Size 1B\nReview Date: 2021/03/13\nStore: COSYMAY\nAverage Rating: 3.6\nProduct Details: {'Hair Type': 'Straight', 'Brand': 'COSYMAY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '9.96 x 6.73 x 2.72 inches; 11.99 Ounces', 'UPC': '738627428647'}\nReview Text: This COSYMAY 20 inch Human Hair Wig for Women Long Black Wig with Bangs 4x4 Lace Closure Straight is quite nice. I received a good quality unit with thick feeling hair that looked like virgin hair. The lace front was as expected and the part was easy to move around naturally. I only deducted a star because the hair became a bit thinner near the ends, a bit more than usual, and I'd recommend getting a longer length if you are planning to get a straight cut at the bottom vs. more of a \"v\" shape.\nReview Title: Comfortable Cap, Good Quality and Weight\nRating: 4.0\n--------------------------------------------------\n=== Purchase Information ===\nProduct Title: AISI BEAUTY Short Wavy Bob Wig with Bangs Shoulder Length Burgundy Synthetic Bob Curly Wigs for Women Natural Looking Heat Resistant Fiber Hair\nReview Date: 2021/06/06\nStore: AISI BEAUTY\nAverage Rating: 4.1\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly', 'Brand': 'AISI BEAUTY', 'Age Range (Description)': 'Adult', 'Package Dimensions': '12.13 x 9.21 x 2.95 inches; 9.59 Ounces'}\nReview Text: This AISI BEAUTY Short Wavy Bob Wig with Bangs Shoulder Length Burgundy is a comfortable unit with straight across bangs and a wavy, casual look. The unit has a single point top, and the hair is shiny, but not overly so, and it looks fun and casual. This is a pretty color, and you could get away with wearing this for daily use with a band.\nReview Title: Good Quality, Fun Wig\nRating: 4.0\n--------------------------------------------------\n\n        Format your response exactly as follows:\n        POSITIVE SUMMARY:\n        [Your positive summary here]\n\n        NEGATIVE SUMMARY:\n        [Your negative summary here]\n\n        OVERALL SUMMARY:\n        [Your overall summary here]",
  "raw_response": "POSITIVE SUMMARY:  \nThe user has expressed strong satisfaction with various products highlighting their quality and aesthetic appeal. They have praised the realistic appearance and comfort of several wigs, noting that some wigs resemble natural hair and fit well, enhancing their overall look. Corelle plates have also been appreciated for their lightweight design and durability, reminiscent of fond childhood memories. Additionally, the moisturizing serum has been commended for its non-sticky texture and effective hydrating properties, leading to improved skin softness and health. Overall, the user enjoys products that combine functionality with visual charm across multiple categories.\n\nNEGATIVE SUMMARY:  \nDespite several positive experiences, the user has encountered some dissatisfaction. Notably, certain products, especially some wigs, received lower ratings due to issues like unexpected color variations and texture not meeting expectations. A temporary hair color wax was critiqued for requiring excessive product for desired results and leaving a sticky feel. Additionally, false nails were noted for their tendency to scratch easily, detracting from their appeal. These concerns indicate that while some items excel in quality, others may fall short in terms of performance or durability.\n\nOVERALL SUMMARY:  \nThe user's purchasing history showcases a blend of delightful products and areas for improvement. They have consistently enjoyed high-quality items like wigs and kitchenware, praising realism, comfort, and nostalgia, while also receiving value from beauty and nail products. Nonetheless, some experiences highlighted concerns regarding product performance, such as color fidelity and texture, reflecting mixed feelings about certain purchases. Overall, the shopping behavior reveals a balance of excitement for well-made items alongside caution for those that may not meet expectations.",
  "target_interaction": {
    "rating": 5.0,
    "title": "Attractive, Well Made, and a Good Value",
    "text": "I'm really liking these attractive Spove Boho Headbands for Women, 12pcs, which is a good amount of variety in both color and design. The headbands are extremely comfortable, and each one has the double loop pattern on top and a fabric covered elastic base. These are well made, and the fabrics all have a lighter nylon/chiffon type feel to them. This is a good value as a set of 12, and I'd highly recommend.",
    "images": [
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81MCPtB-WTL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81MCPtB-WTL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81MCPtB-WTL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/81kkurs7IUL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/81kkurs7IUL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/81kkurs7IUL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      },
      {
        "small_image_url": "https://images-na.ssl-images-amazon.com/images/I/91vl5oapViL._SL256_.jpg",
        "medium_image_url": "https://images-na.ssl-images-amazon.com/images/I/91vl5oapViL._SL800_.jpg",
        "large_image_url": "https://images-na.ssl-images-amazon.com/images/I/91vl5oapViL._SL1600_.jpg",
        "attachment_type": "IMAGE"
      }
    ],
    "asin": "B09258TP6J",
    "parent_asin": "B09258TP6J",
    "user_id": "AFATNFWGYVVMEZWGDNLDUXRBRFLQ",
    "timestamp": "2021-06-09 23:45:36.681000",
    "helpful_vote": 0,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "12pcs Floral Boho Headbands for Women, Sport Cross Elastic Hair Band, Stretchy Headwear, Hair Accessories for Girls (Style 1)",
    "average_rating": 4.5,
    "rating_number": 5,
    "features": [],
    "description": [],
    "price": NaN,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51zXJL8h-7L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51zXJL8h-7L.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71D0T+qWH6L._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51R61dBI2GL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51R61dBI2GL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71xymVsk0TL._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51YkE80ZhPL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51YkE80ZhPL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/71NZGAyOUmL._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51TcQtqcNAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51TcQtqcNAL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61veu1HHZ-L._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51I7fvnhbJL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51I7fvnhbJL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/71xXQ2zKYvL._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51VtBesbQSL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51VtBesbQSL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/71GIo4ibbfL._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51UB07uEA4L._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51UB07uEA4L.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/61AtUp62u3L._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51mggQ8QYPL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51mggQ8QYPL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71QLX-x2-aL._SL1050_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51tg8PBQQAL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/51tg8PBQQAL.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/618It3Yg6WL._SL1050_.jpg"
      }
    ],
    "videos": [],
    "store": "SPOVE",
    "categories": [],
    "details": {
      "Age Range (Description)": "Adult",
      "Material": "Chiffon, Elastic",
      "Number of Items": "12",
      "Brand": "SPOVE",
      "Unit Count": "1.00 Count",
      "Package Dimensions": "10.31 x 7.2 x 1.61 inches; 6.31 Ounces",
      "UPC": "631145784946"
    },
    "bought_together": null
  }
}