{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Journey to the Center of the Earth\nReview Date: 2017/10/14\nStore: James Mason  (Actor),     Pat Boone  (Actor),     Henry Levin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\nProduct Description: [\"Jules Verne's classic science fiction tale as brought to the screen for the first time! Alan Caillou, Alan Napier, Alex Finlayson, Arlene Dahl, and Ben Wright. Restoration comparison; Theatrical trailers. 1959 Original Language: English\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Charles Brackett, Diane Baker, Pat Boone, Arlene Dahl, Alan Napier, Thayer David, Mary Brady, Alan Caillou, Gertrude the Duck, John Epper, Walter Reisch, Peter Ronson, Robert Adler, Jules Verne, James Mason, Henry LevinCharles Brackett, Diane Baker, Pat Boone, Arlene Dahl, Alan Napier, Thayer David, Mary Brady, Alan Caillou, Gertrude the Duck, John Epper, Walter Reisch, Peter Ronson, Robert Adler, Jules Verne, James Mason, Henry Levin   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 9 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'Relay Time: 132 min', 'Director': 'Henry Levin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '2 hours and 9 minutes', 'Release date': 'March 4, 2003', 'Actors': 'James Mason, Pat Boone, Arlene Dahl, Diane Baker, Thayer David', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Charles Brackett, Jules Verne, Walter Reisch', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Love the movie\nReview Title: Dvd\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Alice Through the Looking Glass\nJohnny Depp  (Actor),     Helena Bonham Carter  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney invites you to step through the looking glass and join Alice, the Mad Hatter, Cheshire Cat and the Red Queen on a wild ride back to Wonderland! The adventure begins when Alice embarks on a daring quest to save her dear friend the Hatter (Johnny Depp). Plunging back into the whimsical, topsy-turvy world of Wonderland with all her old companions and a host of zany new ones, Alice must take on Time himself to right a past wrong, find her muchness... and remember that nothing is impossible.']\n{'Genre': 'Action/Adventure', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Matt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen FryMatt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen Fry   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936850901', 'Director': 'James Bobin', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 18, 2016', 'Actors': 'Johnny Depp, Helena Bonham Carter, Sacha Baron Cohen, Anne Hathaway, Mia Wasikowska', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Based On Characters Created By Lewis Carroll, Written By Linda Woolverton', 'Number of discs': '1'}\nLove the movie johnny depp is awesome\nAlice movie\nMiss Peregrine's Home for Peculiar Children\nEva Green  (Actor),     Asa Butterfield  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['From visionary director Tim Burton, and based upon the best-selling novel, comes an unforgettable motion picture experience. When Jake discovers clues to a mystery that spans different worlds and times, he finds a magical place known as Miss Peregrine\\'s Home for Peculiar Children. But the mystery and danger deepen as he gets to know the residents and learns about their special powers... and their powerful enemies. Ultimately, Jake discovers that only his own special \"peculiarity\" can save his new friends.']\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': \"Georgia Pemberton, Raffiella Chapman, Eva Green, Joseph Odwell, Thomas Odwell, Tim Burton, Asa Butterfield, Pixie Davies, Chris O'Dowd, Samuel L. Jackson, Rupert Everett, Finlay MacMillan, Judi Dench, Jane Goldman, Lauren McCrostie, Terence Stamp, Allison Janney, Milo Parker, Hayden Keeler-Stone, Cameron King, Ella PurnellGeorgia Pemberton, Raffiella Chapman, Eva Green, Joseph Odwell, Thomas Odwell, Tim Burton, Asa Butterfield, Pixie Davies, Chris O'Dowd, Samuel L. Jackson, Rupert Everett, Finlay MacMillan, Judi Dench, Jane Goldman, Lauren McCrostie, Terence Stamp, Allison Janney, Mi…  See more\", 'Language': 'English', 'Runtime': '127 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '024543155287', 'Director': 'Tim Burton', 'Media Format': 'NTSC', 'Run time': '127 minutes', 'Release date': 'December 13, 2016', 'Actors': \"Eva Green, Asa Butterfield, Chris O'Dowd, Allison Janney, Rupert Everett\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Jane Goldman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove the movie,  Tim Burton off the wall live him\nMovie\nThe Silence of the Lambs (Two-Disc Collector's Edition)\nJodie Foster  (Actor),     Anthony Hopkins  (Actor),     Jonathan Demme  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Product Description', \"A psychopath nicknamed Buffalo Bill is murdering women across the Midwest. Believing it takes one to know one, the FBI sends Agent Clarice Starling (Foster) to interview a demented prisoner who may provide clues to the killer's actions.\", 'Amazon.com', \"Based on Thomas Harris's novel, this terrifying film by Jonathan Demme really only contains a couple of genuinely shocking moments (one involving an autopsy, the other a prison break). The rest of the film is a splatter-free visual and psychological descent into the hell of madness, redeemed astonishingly by an unlikely connection between a monster and a haunted young woman. Anthony Hopkins is extraordinary as the cannibalistic psychiatrist Dr. Hannibal Lecter, virtually entombed in a subterranean prison for the criminally insane. At the behest of the FBI, agent-in-training Clarice Starling (Jodie Foster) approaches Lecter, requesting his insights into the identity and methods of a serial killer named Buffalo Bill (Ted Levine). In exchange, Lecter demands the right to penetrate Starling's most painful memories, creating a bizarre but palpable intimacy that liberates them both under separate but equally horrific circumstances. Demme, a filmmaker with a uniquely populist vision (\", 'Melvin and Howard', ',', 'Something Wild', '), also spent his early years making pulp for Roger Corman (', 'Caged Heat', \"), and he hasn't forgotten the significance of tone, atmosphere, and the unsettling nature of a crudely effective close-up. Much of the film, in fact, consists of actors staring straight into the camera (usually from Clarice's point of view), making every bridge between one set of eyes to another seem terribly dangerous. --\", 'Tom Keogh', 'Set Contains:', 'A great movie deserves great special features, and MGM has done right by', 'The Silence of the Lambs', \"--for the most part. Although Criterion's commentary track and storyboards are missing, this collector's edition offers some first-rate extras. The bone-chilling thriller is on the first disc, while the second boasts a bevy of bonus material, including the original making-of featurette, deleted scenes, and outtakes. New documentaries consist of\", 'Inside the Labyrinth: Making of The Silence of the Lambs', ', which covers every aspect of the production;', 'Jonathan Demme & Jodie Foster', \", a look at the film from the perspective of director and leading actress; and a two-part installment of Bravo's\", 'Page to Screen', \", which traces the transition from bestselling book to Oscar-winning film. As for the latter, the author's input is notable by its absence, but the program notes that Thomas Harris refuses all media requests. Instead, screenwriter Ted Tally and others speak about his work. Though repetition is inevitable, the combined features answer pretty much every question a viewer could have about\", 'The Silence of the Lambs', ', i.e. Yes, that', 'is', 'director George Romero in a cameo and yes, the head in the jar', 'was', \"modeled after producer Ed Saxon. There are even recipe cards for dishes like roast lamb and fava bean risotto. Interestingly however, there's no mention of the various sequels and prequels to Demme's film, like Michael Mann's\", 'Manhunter', \"or Ridley Scott's\", 'Hannibal', \", but then again, they weren't produced by the same creative team.\", '--Kathleen C. Fennessy', 'See more']\n{'Genre': 'Horror, Mystery & Suspense', 'Format': 'Multiple Formats, Widescreen, Color, Dolby, Dubbed, Subtitled, NTSC', 'Contributor': 'Thomas Harris, Diane Baker, Don Brockett, Anthony Heald, Frankie Faison, Kasi Lemmons, Anthony Hopkins, Jodie Foster, Scott Glenn, Brooke Smith, Dan Butler, Jonathan Demme, Ted Levine, Lawrence T. Wrentz, Ted TallyThomas Harris, Diane Baker, Don Brockett, Anthony Heald, Frankie Faison, Kasi Lemmons, Anthony Hopkins, Jodie Foster, Scott Glenn, Brooke Smith, Dan Butler, Jonathan Demme, Ted Levine, Lawrence T. Wrentz, Ted Tally  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'M106584', 'Director': 'Jonathan Demme', 'Media Format': 'Multiple Formats, Widescreen, Color, Dolby, Dubbed, Subtitled, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'January 30, 2007', 'Actors': 'Jodie Foster, Anthony Hopkins, Scott Glenn, Ted Levine, Brooke Smith', 'Dubbed': 'English, French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Mgm (Video & DVD)', 'Writers': 'Ted Tally, Thomas Harris', 'Number of discs': '2'}\nLovery the movie what a classic\nSlince of thr lambs\nHook\nDustin Hoffman  (Actor),     Robin Williams  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n{}\nGreat movie, love Robin Williams\nHook\nRodeo Video NFR 5 DVD Set\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Sports\n['This fully indexed DVD collection contains all 10 rounds of 2014 Wrangler National Finals Rodeo competition. And, each round of competition is divided into seven easily accessed rodeo events., so you can find your favorite event or contestant with a click of your remote. The Wrangler National Finals Rodeo is the rodeo equivalent to the Super Bowl or World Series. The top 15 contestants in each event compete over 10 days and for more than $7 million in prize money. The event takes place each year at the Thomas and Mack in Las Vegas and every performance is sold out.']\n{'Genre': 'Rodeo', 'Format': 'DVD', 'Contributor': 'Rodeo Video, Inc.', 'Is Discontinued By Manufacturer': 'No', 'Media Format': 'DVD', 'Producers': 'Rodeo Video, Inc.', 'Studio': 'Rodeo Video', 'Number of discs': '5'}\nGreat clips of rodeo, great Christmas gift\nNfr rodeo finals dvd\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Condon'], 'Producers': ['David Hoberman', 'Todd Lieberman'], 'Starring': ['Emma Watson', 'Dan Stevens', 'Luke Evans'], 'Studio': ['Walt Disney Pictures']}\nNevercreceived, granddaughter stated wonderful movie\nBeauty and beast dvd\nJourney to the Center of the Earth\nJames Mason  (Actor),     Pat Boone  (Actor),     Henry Levin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n[\"Jules Verne's classic science fiction tale as brought to the screen for the first time! Alan Caillou, Alan Napier, Alex Finlayson, Arlene Dahl, and Ben Wright. Restoration comparison; Theatrical trailers. 1959 Original Language: English\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Charles Brackett, Diane Baker, Pat Boone, Arlene Dahl, Alan Napier, Thayer David, Mary Brady, Alan Caillou, Gertrude the Duck, John Epper, Walter Reisch, Peter Ronson, Robert Adler, Jules Verne, James Mason, Henry LevinCharles Brackett, Diane Baker, Pat Boone, Arlene Dahl, Alan Napier, Thayer David, Mary Brady, Alan Caillou, Gertrude the Duck, John Epper, Walter Reisch, Peter Ronson, Robert Adler, Jules Verne, James Mason, Henry Levin   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 9 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'Relay Time: 132 min', 'Director': 'Henry Levin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '2 hours and 9 minutes', 'Release date': 'March 4, 2003', 'Actors': 'James Mason, Pat Boone, Arlene Dahl, Diane Baker, Thayer David', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Charles Brackett, Jules Verne, Walter Reisch', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove the movie\nDvd",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user has a strong affinity for fantasy and adventure genres, particularly influenced by Disney and Tim Burton, alongside an emerging appreciation for psychological thrillers and sports-themed narratives. Their interest in classic science fiction indicates a fondness for timeless storytelling.\n\n- **Favorite Actors:** They favor dynamic performers such as Johnny Depp, Helena Bonham Carter, Eva Green, Jodie Foster, Anthony Hopkins, and Robin Williams, reflecting their preference for memorable roles across various genres.\n\n- **Viewing Format:** The user maintains a strong preference for DVD format, highlighting their commitment to physical media and the value they place on building a collection of films.\n\n- **Rating Trends:** While the user consistently rates films highly, their recent critical review underscores a growing discernment regarding storytelling quality, reinforcing a balanced perspective that appreciates both classic and niche genres.\n\n- **Key Themes:** They resonate with narratives centered on friendship, adventure, self-discovery, psychological tension, and themes of competition and achievement that explore complex emotions.\n\n- **Review Style:** The user typically offers succinct and positive commentary but is developing a more critical lens, emphasizing the importance of compelling narratives and performances.\n\nOverall, the user remains passionate about fantasy and adventure films while also embracing intricately crafted stories across genres, revealing a deepening expectation for quality storytelling and character development.",
  "metrics": {
    "rouge1_f": 0.10536218250235184,
    "rouge2_f": 0.015065913370998116,
    "rougeL_f": 0.04985888993414864,
    "meteor": 0.034267986576601475,
    "bleu1": 4.480107223839838e-05,
    "bleu2": 2.063502692660814e-05,
    "bleu3": 1.2980329253224331e-05,
    "bleu4": 8.664881770162978e-06,
    "bertscore_precision": 0.3607795834541321,
    "bertscore_recall": 0.48764559626579285,
    "bertscore_f1": 0.4147273898124695
  }
}