{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Goosebumps 2 [DVD]\nReview Date: 2019/03/18\nStore: Wendi McLendon-Covey  (Actor),     Madison Iseman  (Actor),     Ari Sandel  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\nProduct Description: ['Be careful what you wish for. With their after school junk business, best friends Sonny and Sam hope to find treasure in other people’s trash. But when cleaning out the old Stine house, they open a locked book that frees a supernatural nightmare – Slappy! Now, with the help of Sonny’s sister Sarah, they’re in a race against time to get the sinister dummy and all the creatures he’s brought to life back into the pages before he unleashes total pandemonium!']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Children/Family, Comedy, Action/Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Deborah Forte, Madison Iseman, Wendi McLendon-Covey, Columbia Pictures Corporation, Caleel Harris, Chris Parnell, Ari Sandel, Neal Moritz, Jeremy Taylor, Ken Jeong, Bryce Cass, Peyton WichDeborah Forte, Madison Iseman, Wendi McLendon-Covey, Columbia Pictures Corporation, Caleel Harris, Chris Parnell, Ari Sandel, Neal Moritz, Jeremy Taylor, Ken Jeong, Bryce Cass, Peyton Wich   See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Digital Copy Expiration Date': 'December 23, 2021', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Director': 'Ari Sandel', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 15, 2019', 'Actors': 'Wendi McLendon-Covey, Madison Iseman, Jeremy Taylor, Caleel Harris, Chris Parnell', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Deborah Forte, Neal Moritz', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Movie is wnderful, funny\nReview Title: Love\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Alice Through the Looking Glass\nJohnny Depp  (Actor),     Helena Bonham Carter  (Actor),     James Bobin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney invites you to step through the looking glass and join Alice, the Mad Hatter, Cheshire Cat and the Red Queen on a wild ride back to Wonderland! The adventure begins when Alice embarks on a daring quest to save her dear friend the Hatter (Johnny Depp). Plunging back into the whimsical, topsy-turvy world of Wonderland with all her old companions and a host of zany new ones, Alice must take on Time himself to right a past wrong, find her muchness... and remember that nothing is impossible.']\n{'Genre': 'Action/Adventure', 'Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Contributor': 'Matt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen FryMatt Lucas, Rhys Ifans, Johnny Depp, Anne Hathaway, Mia Wasikowska, Written By Linda Woolverton, Michael Sheen, Timothy Spall, Helena Bonham Carter, James Bobin, Alan Rickman, Based On Characters Created By Lewis Carroll, Sacha Baron Cohen, Stephen Fry   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936850901', 'Director': 'James Bobin', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 18, 2016', 'Actors': 'Johnny Depp, Helena Bonham Carter, Sacha Baron Cohen, Anne Hathaway, Mia Wasikowska', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'Walt Disney Studios', 'Writers': 'Based On Characters Created By Lewis Carroll, Written By Linda Woolverton', 'Number of discs': '1'}\nLove the movie johnny depp is awesome\nAlice movie\nMiss Peregrine's Home for Peculiar Children\nEva Green  (Actor),     Asa Butterfield  (Actor),     Tim Burton  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['From visionary director Tim Burton, and based upon the best-selling novel, comes an unforgettable motion picture experience. When Jake discovers clues to a mystery that spans different worlds and times, he finds a magical place known as Miss Peregrine\\'s Home for Peculiar Children. But the mystery and danger deepen as he gets to know the residents and learns about their special powers... and their powerful enemies. Ultimately, Jake discovers that only his own special \"peculiarity\" can save his new friends.']\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': \"Georgia Pemberton, Raffiella Chapman, Eva Green, Joseph Odwell, Thomas Odwell, Tim Burton, Asa Butterfield, Pixie Davies, Chris O'Dowd, Samuel L. Jackson, Rupert Everett, Finlay MacMillan, Judi Dench, Jane Goldman, Lauren McCrostie, Terence Stamp, Allison Janney, Milo Parker, Hayden Keeler-Stone, Cameron King, Ella PurnellGeorgia Pemberton, Raffiella Chapman, Eva Green, Joseph Odwell, Thomas Odwell, Tim Burton, Asa Butterfield, Pixie Davies, Chris O'Dowd, Samuel L. Jackson, Rupert Everett, Finlay MacMillan, Judi Dench, Jane Goldman, Lauren McCrostie, Terence Stamp, Allison Janney, Mi…  See more\", 'Language': 'English', 'Runtime': '127 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '024543155287', 'Director': 'Tim Burton', 'Media Format': 'NTSC', 'Run time': '127 minutes', 'Release date': 'December 13, 2016', 'Actors': \"Eva Green, Asa Butterfield, Chris O'Dowd, Allison Janney, Rupert Everett\", 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Studio': 'TWENTIETH CENTURY FOX', 'Writers': 'Jane Goldman', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove the movie,  Tim Burton off the wall live him\nMovie\nThe Silence of the Lambs (Two-Disc Collector's Edition)\nJodie Foster  (Actor),     Anthony Hopkins  (Actor),     Jonathan Demme  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n['Product Description', \"A psychopath nicknamed Buffalo Bill is murdering women across the Midwest. Believing it takes one to know one, the FBI sends Agent Clarice Starling (Foster) to interview a demented prisoner who may provide clues to the killer's actions.\", 'Amazon.com', \"Based on Thomas Harris's novel, this terrifying film by Jonathan Demme really only contains a couple of genuinely shocking moments (one involving an autopsy, the other a prison break). The rest of the film is a splatter-free visual and psychological descent into the hell of madness, redeemed astonishingly by an unlikely connection between a monster and a haunted young woman. Anthony Hopkins is extraordinary as the cannibalistic psychiatrist Dr. Hannibal Lecter, virtually entombed in a subterranean prison for the criminally insane. At the behest of the FBI, agent-in-training Clarice Starling (Jodie Foster) approaches Lecter, requesting his insights into the identity and methods of a serial killer named Buffalo Bill (Ted Levine). In exchange, Lecter demands the right to penetrate Starling's most painful memories, creating a bizarre but palpable intimacy that liberates them both under separate but equally horrific circumstances. Demme, a filmmaker with a uniquely populist vision (\", 'Melvin and Howard', ',', 'Something Wild', '), also spent his early years making pulp for Roger Corman (', 'Caged Heat', \"), and he hasn't forgotten the significance of tone, atmosphere, and the unsettling nature of a crudely effective close-up. Much of the film, in fact, consists of actors staring straight into the camera (usually from Clarice's point of view), making every bridge between one set of eyes to another seem terribly dangerous. --\", 'Tom Keogh', 'Set Contains:', 'A great movie deserves great special features, and MGM has done right by', 'The Silence of the Lambs', \"--for the most part. Although Criterion's commentary track and storyboards are missing, this collector's edition offers some first-rate extras. The bone-chilling thriller is on the first disc, while the second boasts a bevy of bonus material, including the original making-of featurette, deleted scenes, and outtakes. New documentaries consist of\", 'Inside the Labyrinth: Making of The Silence of the Lambs', ', which covers every aspect of the production;', 'Jonathan Demme & Jodie Foster', \", a look at the film from the perspective of director and leading actress; and a two-part installment of Bravo's\", 'Page to Screen', \", which traces the transition from bestselling book to Oscar-winning film. As for the latter, the author's input is notable by its absence, but the program notes that Thomas Harris refuses all media requests. Instead, screenwriter Ted Tally and others speak about his work. Though repetition is inevitable, the combined features answer pretty much every question a viewer could have about\", 'The Silence of the Lambs', ', i.e. Yes, that', 'is', 'director George Romero in a cameo and yes, the head in the jar', 'was', \"modeled after producer Ed Saxon. There are even recipe cards for dishes like roast lamb and fava bean risotto. Interestingly however, there's no mention of the various sequels and prequels to Demme's film, like Michael Mann's\", 'Manhunter', \"or Ridley Scott's\", 'Hannibal', \", but then again, they weren't produced by the same creative team.\", '--Kathleen C. Fennessy', 'See more']\n{'Genre': 'Horror, Mystery & Suspense', 'Format': 'Multiple Formats, Widescreen, Color, Dolby, Dubbed, Subtitled, NTSC', 'Contributor': 'Thomas Harris, Diane Baker, Don Brockett, Anthony Heald, Frankie Faison, Kasi Lemmons, Anthony Hopkins, Jodie Foster, Scott Glenn, Brooke Smith, Dan Butler, Jonathan Demme, Ted Levine, Lawrence T. Wrentz, Ted TallyThomas Harris, Diane Baker, Don Brockett, Anthony Heald, Frankie Faison, Kasi Lemmons, Anthony Hopkins, Jodie Foster, Scott Glenn, Brooke Smith, Dan Butler, Jonathan Demme, Ted Levine, Lawrence T. Wrentz, Ted Tally  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'M106584', 'Director': 'Jonathan Demme', 'Media Format': 'Multiple Formats, Widescreen, Color, Dolby, Dubbed, Subtitled, NTSC', 'Run time': '1 hour and 58 minutes', 'Release date': 'January 30, 2007', 'Actors': 'Jodie Foster, Anthony Hopkins, Scott Glenn, Ted Levine, Brooke Smith', 'Dubbed': 'English, French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Mgm (Video & DVD)', 'Writers': 'Ted Tally, Thomas Harris', 'Number of discs': '2'}\nLovery the movie what a classic\nSlince of thr lambs\nHook\nDustin Hoffman  (Actor),     Robin Williams  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n{}\nGreat movie, love Robin Williams\nHook\nRodeo Video NFR 5 DVD Set\nFormat: DVD\nMovies & TV, Genre for Featured Categories, Sports\n['This fully indexed DVD collection contains all 10 rounds of 2014 Wrangler National Finals Rodeo competition. And, each round of competition is divided into seven easily accessed rodeo events., so you can find your favorite event or contestant with a click of your remote. The Wrangler National Finals Rodeo is the rodeo equivalent to the Super Bowl or World Series. The top 15 contestants in each event compete over 10 days and for more than $7 million in prize money. The event takes place each year at the Thomas and Mack in Las Vegas and every performance is sold out.']\n{'Genre': 'Rodeo', 'Format': 'DVD', 'Contributor': 'Rodeo Video, Inc.', 'Is Discontinued By Manufacturer': 'No', 'Media Format': 'DVD', 'Producers': 'Rodeo Video, Inc.', 'Studio': 'Rodeo Video', 'Number of discs': '5'}\nGreat clips of rodeo, great Christmas gift\nNfr rodeo finals dvd\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Condon'], 'Producers': ['David Hoberman', 'Todd Lieberman'], 'Starring': ['Emma Watson', 'Dan Stevens', 'Luke Evans'], 'Studio': ['Walt Disney Pictures']}\nNevercreceived, granddaughter stated wonderful movie\nBeauty and beast dvd\nJourney to the Center of the Earth\nJames Mason  (Actor),     Pat Boone  (Actor),     Henry Levin  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n[\"Jules Verne's classic science fiction tale as brought to the screen for the first time! Alan Caillou, Alan Napier, Alex Finlayson, Arlene Dahl, and Ben Wright. Restoration comparison; Theatrical trailers. 1959 Original Language: English\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Charles Brackett, Diane Baker, Pat Boone, Arlene Dahl, Alan Napier, Thayer David, Mary Brady, Alan Caillou, Gertrude the Duck, John Epper, Walter Reisch, Peter Ronson, Robert Adler, Jules Verne, James Mason, Henry LevinCharles Brackett, Diane Baker, Pat Boone, Arlene Dahl, Alan Napier, Thayer David, Mary Brady, Alan Caillou, Gertrude the Duck, John Epper, Walter Reisch, Peter Ronson, Robert Adler, Jules Verne, James Mason, Henry Levin   See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 9 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'Relay Time: 132 min', 'Director': 'Henry Levin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '2 hours and 9 minutes', 'Release date': 'March 4, 2003', 'Actors': 'James Mason, Pat Boone, Arlene Dahl, Diane Baker, Thayer David', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Charles Brackett, Jules Verne, Walter Reisch', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove the movie\nDvd\nDqe's the New Adventures of Peter Pan: Fairy Friendship\nAugusto Zanovello  (Director)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Neverland, is in great danger! Captain Hook has hatched a twisted plan to capture Peter and his friends. In order to keep Neverland safe from Hook, the young heroes must fly head-on into adventure and protect their right to never grow up!']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '35218549', 'Director': 'Augusto Zanovello', 'Media Format': 'Multiple Formats, Animated, Color, NTSC, Widescreen', 'Run time': '1 hour and 4 minutes', 'Release date': 'July 1, 2016', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nGrand daught enjoys\nDvd\nShape Of Water, The\nSally Hawkins  (Actor),     Michael Shannon  (Actor),     Guillermo Del Toro  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Mute since birth, Elisa Esposito (Sally Hawkins) works as a janitor at a secret government lab in the early 1960s. When she discovers an amphibious humanoid (Doug Jones) being held there, she forms an unexpected bond with the creature. Learning that her new friend is to be dissected, Elisa hatches a plan for him escape, keeping him in her bathtub until he can be released in a nearby canal. Winner of four Academy Awards, including Best Picture, Guillermo del Toro's fantasy also stars Michael Shannon, Richard Jenkins, Octavia Spencer. 123 min. Widescreen (Enhanced); Soundtracks: English Dolby Digital 5.1, DVS 5.1, Spanish Dolby Digital stereo, French Dolby Digital stereo; Subtitles: English (SDH), Spanish, French; featurette; theatrical trailers.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOX2341767DVD DVD', 'Director': 'Guillermo Del Toro', 'Media Format': 'AC-3, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'March 13, 2018', 'Actors': 'Sally Hawkins, Michael Shannon, Richard Jenkins, Doug Jones, Michael Stuhlbarg', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo)', 'Studio': '20th Century Fox', 'Writers': 'Guillermo Del Toro, Vanessa Taylor', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove\nPg 13\nShrek\nMike Myers  (Actor),     Eddie Murphy  (Actor),     Andrew Adamson  (Director),     Vicky Jenson  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Characters & Series, Shrek\n['You\\'ve never met a hero quite like Shrek, winner of the first Academy Award for Best Animated Feature. The endearing ogre sparked a motion picture phenomenon and captured the world\\'s imagination with…the Greatest Fairy Tale Never Told! Critics have called Shrek \"not just a brilliant animated feature, but a superb film on any level\" (Larry King, USA Today). Relive every moment of Shrek\\'s (Mike Myers) daring quest to rescue feisty Princess Fiona (Cameron Diaz), with the help of his lovable loudmouthed Donkey (Eddie Murphy), and win back the deed to his beloved swamp from scheming Lord Farquaad (John Lithgow). Enchantingly irreverent and \"monstrously clever\" (Leah Rozen, People Magazine), Shrek is an ogre-sized adventure you\\'ll want to see again and again.Bonus Content:', 'Spotlight On Donkey', 'Spotlight On Donkey', 'Secrets of Shrek', 'Secrets of Shrek', 'Deleted Scenes', 'Deleted Scenes', \"Filmmakers' Commentary\", \"Filmmakers' Commentary\", 'Shrek, Rattle, & Roll', 'Shrek, Rattle, & Roll', 'Previews', 'Previews']\n{'Genre': 'Musicals & Performing Arts, Science Fiction & Fantasy, Kids & Family, DVD Movie, Puss in Boots, Shrek (version francaise incluse), Animation, Blu-ray Movie, Comedy, DreamWorks Animation, Shrek (version française incluse)Musicals & Performing Arts, Science Fiction & Fantasy, Kids & Family, DVD Movie, Puss in Boots, Shrek (version francaise incluse), Animation, Blu-ray Movie, Comedy, DreamWorks Animation, Shrek (version française incluse)  See more', 'Format': 'Color, NTSC, Subtitled, Widescreen, Animated', 'Contributor': 'Joe Stillman, Roger S.H. Schulman, John Lithgow, John H. Williams, Eddie Murphy, Jeffrey Katzenberg, Vincent Cassel, Vicky Jenson, Andrew Adamson, Mike Myers, Terry Rossio, Cameron Diaz, Ted Elliott, Aron WarnerJoe Stillman, Roger S.H. Schulman, John Lithgow, John H. Williams, Eddie Murphy, Jeffrey Katzenberg, Vincent Cassel, Vicky Jenson, Andrew Adamson, Mike Myers, Terry Rossio, Cameron Diaz, Ted Elliott, Aron Warner  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.5 Ounces', 'Item model number': '35396372', 'Director': 'Andrew Adamson, Vicky Jenson', 'Media Format': 'Color, NTSC, Subtitled, Widescreen, Animated', 'Run time': '1 hour and 31 minutes', 'Release date': 'June 8, 2016', 'Actors': 'Mike Myers, Eddie Murphy, Cameron Diaz, John Lithgow, Vincent Cassel', 'Subtitles': 'English, French, Spanish', 'Producers': 'Aron Warner, John H. Williams, Jeffrey Katzenberg', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Ted Elliott, Terry Rossio, Joe Stillman, Roger S.H. Schulman', 'Number of discs': '1'}\nLove\nShrek\nMALEFICENT\nAngelina Jolie  (Actor),     Sharlto Copley  (Actor),     Robert Stromberg  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Explore the untold story of Disney\\'s most iconic villain in this wickedly fun twist on the classic SLEEPING BEAUTY. In an unforgiving mood after a neighboring kingdom threatens her forest, Maleficent (Angelina Jolie) places an irrevocable curse on the king\\'s newborn daughter, the Princess Aurora. But as the child grows, Maleficent finds herself becoming fond of the girl. And as the conflict between the two realms intensifies, Maleficent realizes that Aurora may hold the key to peace in the land. Journey beyond the fairy tale in this soaring adventure that is \"visually arresting, brilliantly designed\" (Andrew Barker, Variety).']\n{'Genre': 'Fantasy', 'Format': 'Multiple Formats, Full Screen, Dolby, Dubbed, NTSC', 'Contributor': 'Angelina Jolie, Sam Riley, Juno Temple, Imelda Staunton, Sharlto Copley, Elle Fanning, Lesley Manville, Robert StrombergAngelina Jolie, Sam Riley, Juno Temple, Imelda Staunton, Sharlto Copley, Elle Fanning, Lesley Manville, Robert Stromberg  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 37 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '11020800', 'Director': 'Robert Stromberg', 'Media Format': 'Multiple Formats, Full Screen, Dolby, Dubbed, NTSC', 'Run time': '1 hour and 37 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Angelina Jolie, Sharlto Copley, Elle Fanning, Sam Riley, Imelda Staunton', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Studio': 'WALT DISNEY PICTURES', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this disney movie great story\nMaleficent\nTangled\nMandy Moore  (Actor),     Zachary Levi  (Actor),     Nathan Greno  (Director),     Byron Howard  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Disney presents a new twist on one of the most hilarious and hair-raising tales ever told. Your whole family will get tangled up in the fun, excitement and adventure of this magical motion picture.When the kingdom\\'s most wanted - and most charming - bandit Flynn Rider hides in a mysterious tower, the last thing he expects to find is Rapunzel, a spirited teen with an unlikely superpower - 70 feet of magical golden hair! Together, the unlikely duo sets off on a fantastic journey filled with surprising heroes, laughter and suspense.Let your hair down and get ready to cheer for \"Tangled.\" Bursting with never-before-seen bonus features, it\\'s even more enchanting on Blu-ray Hi-Def.']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, SubtitledMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled  See more', 'Contributor': 'M.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. TompkinsM.C. Gainey, Donna Murphy, Jeffrey Tambor, Mandy Moore, Byron Howard, Ron Perlman, Zachary Levi, Brad Garrett, Nathan Greno, Paul F. Tompkins  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'WD10633400DVD', 'Director': 'Nathan Greno, Byron Howard', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, NTSC, Widescreen, Dubbed, Subtitled', 'Run time': '1 hour and 40 minutes', 'Release date': 'March 29, 2011', 'Actors': 'Mandy Moore, Zachary Levi, Donna Murphy, Ron Perlman, M.C. Gainey', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English', 'Studio': 'Walt Disney Pictures', 'Number of discs': '1'}\nLove the movie\nLike\nThe House with a Clock in Its Walls [DVD]\nJack Black  (Actor),     Cate Blanchett  (Actor),     Eli Roth  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"In the tradition of Amblin classics where fantastical events occur in the most unexpected places, Jack Black and two-time Academy Award® winner Cate Blanchett star in The House with a Clock in Its Walls. The magical adventure tells the spine-tingling tale of 10-year-old Lewis (Owen Vaccaro), who goes to live with his uncle in a creaky old house with a mysterious tick-tocking heart. But his new town's sleepy façade jolts to life with a secret world of warlocks and witches. Based on the beloved children's classic book.\", 'Bonus Content:', 'Alternate Opening and Ending', 'Alternate Opening and Ending', 'Deleted Scenes', 'Deleted Scenes', 'Gag Reel', 'Gag Reel', 'Warlocks and Witches', 'Warlocks and Witches', 'Movie Magic', 'Movie Magic', 'Tick Tock: Bringing the Book to Life', 'Tick Tock: Bringing the Book to Life', \"Eli Roth: Director's Journals\", \"Eli Roth: Director's Journals\", 'Owen Goes Behind the Scenes', 'Owen Goes Behind the Scenes', 'Theme Song Challenge', 'Theme Song Challenge', 'Do You Know Jack Black?', 'Do You Know Jack Black?', 'Abracadabra!', 'Abracadabra!', \"Jack Black's Greatest Fear\", \"Jack Black's Greatest Fear\", 'The Mighty Wurlitzer', 'The Mighty Wurlitzer', 'Feature Commentary with Director Eli Roth and Actor Jack Black', 'Feature Commentary with Director Eli Roth and Actor Jack Black', ']]>']\n{'Genre': \"Kids & Family, DVD Movie, Based on book, Classic book, The House with a Clock in It's Walls, Digital Movie, Blu-ray Movie, Buy Movie, 4K Movie, Children's book, Action & Adventure, Rent MovieKids & Family, DVD Movie, Based on book, Classic book, The House with a Clock in It's Walls, Digital Movie, Blu-ray Movie, Buy Movie, 4K Movie, Children's book, Action & Adventure, Rent Movie   See more\", 'Format': 'NTSC, Subtitled', 'Contributor': 'Owen Vaccaro, Renee Elise Goldsberry, James Vanderbilt, Kyle MacLachlan, Bradley J. Fischer, Lorenza Izzo, Eli Roth, Eric Kripke, Jack Black, Cate Blanchett, Colleen Camp, Sunny SuljicOwen Vaccaro, Renee Elise Goldsberry, James Vanderbilt, Kyle MacLachlan, Bradley J. Fischer, Lorenza Izzo, Eli Roth, Eric Kripke, Jack Black, Cate Blanchett, Colleen Camp, Sunny Suljic   See more', 'Initial release date': '2018-12-18', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Aspect Ratio': '2.39:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.33 Ounces', 'Director': 'Eli Roth', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 45 minutes', 'Release date': 'December 18, 2018', 'Actors': 'Jack Black, Cate Blanchett, Owen Vaccaro, Renee Elise Goldsberry, Sunny Suljic', 'Subtitles': 'French, Spanish', 'Producers': 'Bradley J. Fischer, James Vanderbilt, Eric Kripke', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Eric Kripke', 'Country of Origin': 'USA', 'Number of discs': '1'}\nSo cute, love the dvd\nLove\nGoosebumps 2 [DVD]\nWendi McLendon-Covey  (Actor),     Madison Iseman  (Actor),     Ari Sandel  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Be careful what you wish for. With their after school junk business, best friends Sonny and Sam hope to find treasure in other people’s trash. But when cleaning out the old Stine house, they open a locked book that frees a supernatural nightmare – Slappy! Now, with the help of Sonny’s sister Sarah, they’re in a race against time to get the sinister dummy and all the creatures he’s brought to life back into the pages before he unleashes total pandemonium!']\n{'Genre': 'Children/Family, Comedy, Action/Adventure', 'Format': 'DVD, NTSC', 'Contributor': 'Deborah Forte, Madison Iseman, Wendi McLendon-Covey, Columbia Pictures Corporation, Caleel Harris, Chris Parnell, Ari Sandel, Neal Moritz, Jeremy Taylor, Ken Jeong, Bryce Cass, Peyton WichDeborah Forte, Madison Iseman, Wendi McLendon-Covey, Columbia Pictures Corporation, Caleel Harris, Chris Parnell, Ari Sandel, Neal Moritz, Jeremy Taylor, Ken Jeong, Bryce Cass, Peyton Wich   See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Digital Copy Expiration Date': 'December 23, 2021', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Audio Description': 'English', 'Director': 'Ari Sandel', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'January 15, 2019', 'Actors': 'Wendi McLendon-Covey, Madison Iseman, Jeremy Taylor, Caleel Harris, Chris Parnell', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Deborah Forte, Neal Moritz', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMovie is wnderful, funny\nLove",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user maintains a robust passion for fantasy and adventure genres, especially influenced by Disney and Tim Burton, while also embracing psychologically rich narratives with heartfelt storytelling.\n\n- **Favorite Actors:** A continued fondness for versatile actors such as Johnny Depp, Helena Bonham Carter, Eva Green, Jodie Foster, Anthony Hopkins, Robin Williams, and Angelina Jolie reflects their preference for dynamic and engaging performances.\n\n- **Viewing Format:** The user is a dedicated collector of physical media, particularly DVDs, enjoying the tangible experience and unique charm of their collection.\n\n- **Rating Trends:** Their film ratings remain predominantly positive, alongside a sophisticated discernment for storytelling quality. They show a keen interest in classic tales that possess significant narrative depth.\n\n- **Key Themes:** The user resonates with themes like friendship, adventure, self-discovery, psychological complexity, and competition, indicating a love for emotionally intricate narratives.\n\n- **Review Style:** Their reviews, while succinct and positive, are increasingly thoughtful, showcasing higher expectations for character development and storytelling quality.\n\n- **Recent Interaction:** The latest acquisition emphasizes a sustained enthusiasm for animated films, further highlighting their affection for magical storytelling that intertwines adventure and emotional depth, reinforcing their desire to explore richly crafted narratives across various genres.",
  "metrics": {
    "rouge1_f": 0.05034642032332563,
    "rouge2_f": 0.006469500924214418,
    "rougeL_f": 0.02725173210161663,
    "meteor": 0.015718705867710715,
    "bleu1": 1.4541261847762814e-10,
    "bleu2": 6.867498945721768e-11,
    "bleu3": 4.2500228636319095e-11,
    "bleu4": 2.8140672472580048e-11,
    "bertscore_precision": 0.35428547859191895,
    "bertscore_recall": 0.507872462272644,
    "bertscore_f1": 0.4173987805843353
  }
}