{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Yalmeh Naturals Eye Bright Gel\nReview Date: 2014/10/22\nStore: Yalmeh Peerless Beauty\nProduct Description: [\"Yalmeh Glory Eye Bright Gel ranks as a superior Anti Aging product for all your skin. It is extremely effective at eliminating dark circles and wrinkles. It is also efficient for puffiness and loss of tone. SAFE, ALL NATURAL INGREDIENTS- Yalmeh Glory Eye Bright Gel contains all natural ingredients, no toxic chemicals or cancer causing additives - no mineral oil, sulfates or alcohol ,propylene glycol or paraben. We do not test our products on animals NEVER-EVER. This is the BEST EYE GEL and is an effective natural solution for all types of skin. And, it lasts forever - a little goes a long way. And what matters most, however, is that the Yalmeh Glory Eye Gel works incredibly well. You will feel better both inside and out. THIS EYE GEL is 100% natural & 75% organic Click the 'Add to Cart' button at the top of this page NOW - Your Eyes Will Thank You.\"]\nAverage Rating: 3.2\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.4 x 0.4 x 0.4 inches; 0.35 Ounces', 'Item model number': 'GEBG-Y005', 'UPC': '640671981439 885612923240', 'Manufacturer': 'SETAF'}\nReview Text: I have tried other Yalmeh products in the past and have been very happy with the results that I got. Needless to say, I had high hopes when I started using this eye gel. I was and still am very impressed with how well it works for my sensitive undereye area, as it really reduces the puffiness under my eyes that I am perpetually plagued with, when I wake up in the morning. It is also working so well as far as hydrating my eye area goes! This product and brand always delivers the results that I am hoping to get from skin care products. Love this brand and product!<br /><br />I received one or more of the products mentioned above for review purposes. Regardless, I only recommend products or services I use personally and believe will be good for my readers. I’m just a regular consumer and I appreciate reading and giving honest feedback about products that regular people like me use on a daily basis or consider buying. My views and opinions are from a customer/end user’s standpoint.\nReview Title: ... Yalmeh products in the past and have been very happy with the results that I got\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "La Deessa Powerful 20% Vitamin C Serum For Face +11% Hyaluronic, Organic Anti Aging Skin Care. Hydrate, Moisturize, Increase Collagen, Reduce Fine Lines, Hyper pigmentation & Acne.\nLa Deessa\n['La Deessa products are the answer to compromised skin structure & integrity. With the utmost respect for our eco system, La Deessa sustainably combines Natural, Organic, Plant Based and Wild Crafted Botanicals with clinically proven & independently peer reviewed superstar natural and organic age-defying ingredients with highly effective delivery systems to create results-driven anti aging skin care products. KEY INGREDIENT HIGHLIGHTS: ALOE VERA increases your body’s production of collagen and is packed with essential vitamins including A, B1, B2, B6, B12, C & E. Aloe penetrates skin four-times (4x) more rapidly than water and accelerates skin cell reproduction by as much as eight-times (8x)! VITAMIN C supports every aspect of collagen production from stem cell activity to improving the structural integrity, resilience and stability of the skin. Sodium Ascorbyl Phosphate is an extremely stable and gentle Vitamin C derivative and a precursor to Vitamin C; it waits to convert into Ascorbic Acid until it is fully absorbed, at which time the sodium molecules separate, converting it into pure Vitamin C deep within your skin...this prevents irritation and amplifies antioxidant benefits, making Sodium Ascorbyl Phosphate a superior form of Vitamin C in cosmetic formulations. HYALURONIC ACID has the unique ability to hold more than 1000 times its weight in water, allowing the skin to retain more water. Amazingly, hyaluronic acid adjusts its moisture absorption to your skin’s need for moisture making it ideal for all skin types. Hyaluronic acid also protects the epidermis by scavenging reactive oxygen species generated by ultra violet light. Our formulations contain high percentages of Hyaluronic Acid. MSM- METHYL SULPHONYL MTHANE (ORGANIC SULFUR) Dubbed the “Beauty Mineral” Organic sulfur is referred to as the “Beauty Mineral” because it promotes oxygen transport across cell membranes (intracellular) facilitating cellular regeneration…resulting in skin that is more beautiful.']\n{'Skin Type': 'All', 'Scent': 'Fragrance Free', 'Brand': 'La Deessa', 'Item Form': 'liquid', 'Material Feature': 'Organic, Gluten Free, Natural, Vegan', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4 x 2 x 2 inches; 3 Ounces', 'Item model number': 'LD-VITAC20', 'UPC': '040232150944', 'Manufacturer': 'La Deessa'}\nI have very dry and sensitive skin and read so many good things about Vitamin C Serum. This particular brand has been working very good for me - I have been using it at night and I have been loving it so far!<br /><br />Please do check my in depth blog review on this product: http://wp.me/p1u6bQ-fB<br /><br />Disclaimer: I received one or more of the products mentioned above for free - for review purposes. Regardless, I only recommend products or services I use personally and believe will be good for my readers. I'm just a regular consumer and I appreciate reading and giving honest feedback about products that regular people like me use on a daily basis or consider buying. My views and opinions are from a customer/end user's standpoint.\nLoving this serum!\nYalmeh Naturals Eye Bright Gel\nYalmeh Peerless Beauty\n[\"Yalmeh Glory Eye Bright Gel ranks as a superior Anti Aging product for all your skin. It is extremely effective at eliminating dark circles and wrinkles. It is also efficient for puffiness and loss of tone. SAFE, ALL NATURAL INGREDIENTS- Yalmeh Glory Eye Bright Gel contains all natural ingredients, no toxic chemicals or cancer causing additives - no mineral oil, sulfates or alcohol ,propylene glycol or paraben. We do not test our products on animals NEVER-EVER. This is the BEST EYE GEL and is an effective natural solution for all types of skin. And, it lasts forever - a little goes a long way. And what matters most, however, is that the Yalmeh Glory Eye Gel works incredibly well. You will feel better both inside and out. THIS EYE GEL is 100% natural & 75% organic Click the 'Add to Cart' button at the top of this page NOW - Your Eyes Will Thank You.\"]\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.4 x 0.4 x 0.4 inches; 0.35 Ounces', 'Item model number': 'GEBG-Y005', 'UPC': '640671981439 885612923240', 'Manufacturer': 'SETAF'}\nI have tried other Yalmeh products in the past and have been very happy with the results that I got. Needless to say, I had high hopes when I started using this eye gel. I was and still am very impressed with how well it works for my sensitive undereye area, as it really reduces the puffiness under my eyes that I am perpetually plagued with, when I wake up in the morning. It is also working so well as far as hydrating my eye area goes! This product and brand always delivers the results that I am hoping to get from skin care products. Love this brand and product!<br /><br />I received one or more of the products mentioned above for review purposes. Regardless, I only recommend products or services I use personally and believe will be good for my readers. I’m just a regular consumer and I appreciate reading and giving honest feedback about products that regular people like me use on a daily basis or consider buying. My views and opinions are from a customer/end user’s standpoint.\n... Yalmeh products in the past and have been very happy with the results that I got",
  "profile": "**User Profile Summary:**\n\n- **Skin Concerns:** Focus on dry and sensitive skin, prioritizing hydration and anti-aging benefits. Recently engaged with solutions for puffiness and dark circles in the delicate eye area.\n- **Product Preferences:** Strong preference for organic, natural, and eco-friendly skincare products. Values ingredients like Vitamin C and Hyaluronic Acid for their proven benefits, as well as 100% natural formulations that are free from toxic chemicals.\n- **Usage Behavior:** Prefers applying serums and treatments at night, emphasizing a restorative skincare routine. Demonstrates a willingness to explore targeted treatments, particularly for the under-eye area.\n- **Research-Oriented:** Engages deeply with product information before purchase, valuing customer reviews and personal testimonials. Recent review shared demonstrates high engagement with product effectiveness and brand reputation.\n- **Honest Feedback:** Committed to providing straightforward, authentic reviews based on personal experiences. Prioritizes a genuine perspective in recommendations, reinforcing a trustworthiness in her feedback.\n- **Brand Values:** Drawn to brands that emphasize sustainability, efficacy, and holistic skin health. Consistently seeks products that align with her values of being cruelty-free and supporting natural ingredients.\n\nThis user exhibits a dedicated approach to skincare that aligns with her focus on maintaining skin integrity, targeting specific concerns, and using well-researched, natural products.",
  "metrics": {
    "rouge1_f": 0.2175883952855848,
    "rouge2_f": 0.03814713896457766,
    "rougeL_f": 0.08522212148685404,
    "meteor": 0.08768239616250882,
    "bleu1": 0.021956610276838796,
    "bleu2": 0.009344849734659098,
    "bleu3": 0.003873270633966693,
    "bleu4": 0.0017649499553213475,
    "bertscore_precision": 0.40547868609428406,
    "bertscore_recall": 0.524664044380188,
    "bertscore_f1": 0.45743536949157715
  }
}