{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Blade / Blade 2 / Blade: Trinity (BD)(3FE) [Blu-ray]\nReview Date: 2022/05/29\nStore: Various  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Blade / Blade 2 / Blade: Trinity (BD)(3FE)', 'BLADE - Wesley Snipes stars as the tortured soul Blade, who is half man, half immortal. Blade sharpens his lethal skills under the FBI, he is forced into the daylight, where he joins forces with a clan of human vampire hunters, the Nightstalkers. Together with two deftly trained Nightstalkers, Blade follows a trail of blood to the original vampire: Dracula. guidance of Whistler – his mentor, guardian and fellow hunter of the night. When the bloodthirsty Immortals’ lord, Deacon Frost, declares war on the human race, Blade is humanity’s last hope for survival. BLADE II - Guillermo del Toro directs this high-voltage adventure from screenwriter David S. Goyer. When the world is threatened by a new and deadlier breed of super vampire, Blade and Whistler join forces with an elite team of vampire warriors made up of Blade’s sworn enemies to stop the carnage and destroy the ravenous fiends. BLADE: TRINITY - For years, Blade has fought the vampires under the cover of night. But after falling into the crosshairs of the', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'NTSC, Widescreen, Blu-ray', 'Contributor': 'Various', 'Initial release date': '2015-03-10', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.53 Ounces', 'Item model number': '1000479690', 'Director': 'Various', 'Media Format': 'NTSC, Widescreen, Blu-ray', 'Release date': 'March 10, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nReview Text: great action from movie 1 through 3. enjoy.\nReview Title: one of the best early adoptions of a marvel comic character. great work by Wesley Snipes\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Resident Evil: Vendetta\nTakanori Tsujimoto  (Director)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['When a fearless enemy out for revenge unleashes a brutal and deadly new virus, BSAA captain Chris Redfield enlists the help of Agent Leon S. Kennedy and Professor Rebecca Chambers to bring down the death merchant and save New York City.']\n{'Brand': 'Sony', 'Format': 'AC-3, Dolby, Subtitled', 'Genre': 'Action, Sci-Fi, Anime, Horror, Thriller', 'Publication Date': 'July 18, 2017', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': 'D50162D', 'Director': 'Takanori Tsujimoto', 'Media Format': 'AC-3, Dolby, Subtitled', 'Run time': '1 hour and 37 minutes', 'Release date': 'July 18, 2017', 'Dubbed': 'Thai, Portuguese, French, Spanish', 'Subtitles': 'Thai, English, Korean, Mandarin Chinese, Portuguese, French, Spanish', 'Producers': 'Hiroyasu Shinohara', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\ngood resident evil story\nFive Stars\nUnderworld: Blood Wars\nKate Beckinsale  (Actor),     Theo James  (Actor),     Anna Foerster  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['In the next installment of the blockbuster franchise, Vampire death dealer Selene (Kate Beckinsale) fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David (Theo James) and his father Thomas (Charles Dance), she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.']\n{'Genre': 'Action, Sci-Fi, Horror', 'Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Contributor': 'Oliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter AnderssonOliver Stark, Clementine Nicholson, Tom Rosenberg, Lara Pulver, Theo James, Bradley James, Len Wiseman, Gary Lucchesi, Screen Gems, Richard Wright, David Kern, Anna Foerster, Daisy Head, James Faulkner, Tobias Menzies, Kate Beckinsale, Peter Andersson  See more', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Director': 'Anna Foerster', 'Media Format': 'Dolby, AC-3, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 31 minutes', 'Release date': 'April 25, 2017', 'Actors': 'Kate Beckinsale, Theo James, Lara Pulver, Tobias Menzies, Bradley James', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'David Kern, Richard Wright, Gary Lucchesi, Tom Rosenberg, Len Wiseman', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nkate is awesome\nFive Stars\nThe Thousand Faces of Dunjia [Blu-ray]\nNi Ni  (Actor),     Dongyu Zhou  (Actor),     Yuen Woo-ping  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', 'Centuries ago, the ragtag warrior-sorcerors of the Wuyin clan were entrusted to safeguard China from threats beyond our plane of existence. But can even their skills keep a world-destroying device from the clutches of the alien invaders determined to claim it? Splashy big-budget Wuxia fantasy-actioner, directed by Woo-ping Yuen and scripted by Tsui Hark, stars Da Peng, Ni Ni, Wu Bai, Dongyu Zhou, and Arif Rahman Lee. 113 min. Widescreen; Soundtrack: Mandarin; Subtitles: English; featurette; theatrical trailer. In Mandarin with English subtitles.', 'Review', 'Dunjia is exuberant and visually inventive\" --Washington PostDelightful twists and turns and high energy performances --Film Combat SyndicateDunjia is a blast --Film Journal International']\n{'Genre': 'Action & Adventure', 'Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Contributor': 'Chengpeng Dong, Yuen Woo-ping, Dongyu Zhou, Ni Ni', 'Language': 'Mandarin Chinese (DTS 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.88 Ounces', 'Director': 'Yuen Woo-ping', 'Media Format': 'Dolby, NTSC, Subtitled, Widescreen, Surround Sound', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 27, 2018', 'Actors': 'Ni Ni, Dongyu Zhou, Chengpeng Dong', 'Subtitles': 'English', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\ninteresting story and characters. looking forward to part 2\ninteresting story and characters. looking forward to part 2\nThe Witch: Subversion\nChoi Woo-shik  (Actor),     Kim Da-mi  (Actor),     Park Hoon-jung  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Product Description', '10 years ago, Ja-yoon escaped from a secret government facility in the midst of an inexplicable incident. An old couple finds her alone near death in the woods and takes her in even though she has no memory of who she is or how she got there. She grows up to be a bright high school student and enters a nationally televised audition program to win the top prize and help her struggling family. But as soon as she appears on TV, strange people start appearing in her life and Ja-yoon falls into turmoil as her seemingly ordinary life turns upside down in a blink of an eye Featuring an award-winning performance by Kim Da-mi and co-starring Choi Woo-shik (PARASITE, TRAIN TO BUSAN).', 'Review', 'the action sensation of the year that could rival any superhero movie --Starburst Magazinea kick-ass sci-fi action flick, with a satisfying gore factor to boot. --NerdlyAn ever-so-delicate twist on the Korean revenge thriller. --The Hollywood Reporter', 'About the Actor', 'Choi Woo-shik is known for Parasite (2019), Okja (2017), Set Me Free (2014), and Train to Busan (2016).', 'About the Director', 'Park Hoon-jung is known for New World (2013), The Tiger (2015), V.I.P. (2017), and I Saw the Devil (2010).', 'See more']\n{'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Director': 'Park Hoon-jung', 'Media Format': 'Dolby, Subtitled, Widescreen, Surround Sound', 'Run time': '2 hours and 7 minutes', 'Release date': 'March 10, 2020', 'Actors': 'Choi Woo-shik, Kim Da-mi, Cho Min-soo, Park Hee-soon', 'Subtitles': 'English', 'Language': 'Korean (DTS 5.1)', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\nthe title can throw you off. would like to see the story continue with a sequel with same cast.\nlikeable story and great characters on display.\nHeavy Metal [Blu-ray]\nGerald Potterton  (Director)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Based on the fantastical illustrated magazine', 'Heavy Metal', \", producer Ivan Reitman enlists the help of some of Hollywood's animation masters to create the otherworldly tale of a glowing green orb from outer space that spreads destruction throughout the galaxy. Only when encountered by its one true enemy, to whom it is inexplicably drawn, will goodness prevail throughout the universe. Richly and lavishly drawn, the vignettes of the orb's dark victories include the character voices of John Candy, Harold Ramis and a pounding soundtrack by Black Sabbath, Blue Oyster Cult, Cheap Trick, Devo, Donald Fagen, Don Felder, Grand Funk Railroad, Sammy Hagar, Journey, Nazareth, Stevie Nicks, Riggs, and Trust. Highly imaginative and full of surprising special effects,\", 'Heavy Metal', 'set the standard for the alternative contemporary animation. An intoxicating experience not to be missed!', 'Amazon.com', 'As long as there is a need for adolescent male sexual fantasy, there will be an audience for', 'Heavy Metal', \". Released in 1981 and based on stories from the graphic magazine of the same name (possibly the greatest publication to simultaneously provoke imagination and masturbation), the film has since become the most popular single title in Columbia/TriStar's entire film library. That's an amazing fact considering just how silly and senseless the movie really is--an aimless, juvenile amalgam of disjointed stories and clashing visual styles, employing hundreds of animators from around the world with a near-total absence of creative cohesion. It remains, for better and worse, a midnight-movie favorite for the stoner crowd--a movie best enjoyed by randy adolescents or near-adults in an altered state of consciousness. With a framing story about a glowing green orb claiming to be the embodiment of all evil, the film shuttles through eight episodic tales of sci-fi adventure, each fueled by some of the most wretched rock music to emerge from the 1980s. The most consistent trademark is an abundance of blood-splattering violence and wet-dream sex, the latter involving a succession of huge-breasted babes who shed their clothes at the drop of a G-string. It's all quite fun in its rampantly brainless desire to fuel the young male libido, and for all its incoherence\", 'Heavy Metal', \"remains impressive for the ambitious artistry of its individual segments. Courtesy of producer Ivan Reitman (who'd just scored a hit with Stripes), voice talents include several Canadian veterans of Second City comedy, including John Candy, Harold Ramis, Eugene Levy, and Joe Flaherty.\", '--Jeff Shannon']\n{'Genre': 'Sci-Fi, Fantasy, Musical', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Columbia Pictures; Heavy Metal Animation Co., Ivan Reitman, Gerald Potterton', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '17211076', 'Director': 'Gerald Potterton', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 14, 2011', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Producers': 'Ivan Reitman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat music. solid story. graphics look dated\ngreat music. solid story. graphics look dated\nBlack Widow\nScarlett Johansson  (Actor),     Florence Pugh  (Actor),     Cate Shortland  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['In Marvel Studios\\' action-packed spy thriller \"Black Widow,\" Natasha Romanoff aka Black Widow confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.']\n{'Genre': 'Action/Adventure', 'Format': 'Subtitled, NTSC', 'Contributor': 'Olga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh, Eric Pearson, CC SmiffOlga Kurylenko, Cate Shortland, Ever Anderson, William Hurt, Violet McGraw, Liani Samuel, Lewis Young, Scarlett Johansson, Simona Zivkovska, O-T Fagbenle, Rachel Weisz, David Harbour, Nanna Blondell, Ray Winstone, Ryan Kiera Armstrong, Michelle Lee, Florence Pugh…  See more', 'Language': 'English (Dolby Digital 2.0), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '2.39:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.73 x 5.31 x 0.47 inches; 0.01 Ounces', 'Director': 'Cate Shortland', 'Media Format': 'Subtitled, NTSC', 'Run time': '2 hours and 13 minutes', 'Release date': 'September 14, 2021', 'Actors': 'Scarlett Johansson, Florence Pugh, David Harbour, O-T Fagbenle, Olga Kurylenko', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'MARVEL', 'Writers': 'Eric Pearson', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat marvel movie. should have be made way earlier. black widow can carry a movie on her own.\ngreat marvel movie. should have be made way earlier. black widow can carry a movie on her own.\nSnake Eyes: G.I. Joe Origins\nSamara Weaving  (Actor),     Henry Golding  (Actor)    Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['The origins of the Joes\\' unseen, unspeaking, and undeniably most popular member have been shrouded in mystery-until now. Proved worthy of recruitment into the Arashikage ninja clan, the man called Snake Eyes (Henry Golding) swiftly forges a bond with heir apparent Tommy \"Storm Shadow\" Arashikage (Andrew Koji)... but will the truth of his past convert it to lifelong enmity? Samara Weaving, Úrsula Corberó, Iko Uwais, Peter Mensah co-star. AKA: \"Snake Eyes: G.I. Joe Origins.\" 121 min. Widescreen; Soundtrack: English.']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray', 'Contributor': 'Iko Uwais, Samara Weaving, Henry Golding, rsula Corber, Andrew Koji', 'Language': 'English', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Package Dimensions': '6.93 x 5.43 x 0.51 inches; 2.88 ounces', 'Media Format': 'Blu-ray', 'Release date': 'February 1, 2022', 'Actors': 'Samara Weaving, Henry Golding, Iko Uwais, Andrew Koji, rsula Corber', 'Dubbed': 'French, Spanish', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\ninteresting origin story. not sure if it follows character canon.\ninteresting origin story. not sure if it follows character canon.\nBlade / Blade 2 / Blade: Trinity (BD)(3FE) [Blu-ray]\nVarious  (Actor, Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Blade / Blade 2 / Blade: Trinity (BD)(3FE)', 'BLADE - Wesley Snipes stars as the tortured soul Blade, who is half man, half immortal. Blade sharpens his lethal skills under the FBI, he is forced into the daylight, where he joins forces with a clan of human vampire hunters, the Nightstalkers. Together with two deftly trained Nightstalkers, Blade follows a trail of blood to the original vampire: Dracula. guidance of Whistler – his mentor, guardian and fellow hunter of the night. When the bloodthirsty Immortals’ lord, Deacon Frost, declares war on the human race, Blade is humanity’s last hope for survival. BLADE II - Guillermo del Toro directs this high-voltage adventure from screenwriter David S. Goyer. When the world is threatened by a new and deadlier breed of super vampire, Blade and Whistler join forces with an elite team of vampire warriors made up of Blade’s sworn enemies to stop the carnage and destroy the ravenous fiends. BLADE: TRINITY - For years, Blade has fought the vampires under the cover of night. But after falling into the crosshairs of the', ']]>']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC, Widescreen, Blu-ray', 'Contributor': 'Various', 'Initial release date': '2015-03-10', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.53 Ounces', 'Item model number': '1000479690', 'Director': 'Various', 'Media Format': 'NTSC, Widescreen, Blu-ray', 'Release date': 'March 10, 2015', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\ngreat action from movie 1 through 3. enjoy.\none of the best early adoptions of a marvel comic character. great work by Wesley Snipes",
  "profile": "**User Profile Summary:**\n\n- **Genre Preferences:** Continues to enjoy action, sci-fi, horror, and thriller genres in film and television, with a notable admiration for vibrant animation and musical elements.\n- **Franchise Engagement:** Remains loyal to established franchises, particularly within the action and horror realms, with a specific interest in early adaptations of comic book characters.\n- **Adaptation Interest:** Prefers stories adapted from popular video game franchises and comic books, seeking rich, immersive worlds and complex storytelling.\n- **Format Preference:** Strong commitment to the Blu-ray format for superior media quality, exemplified by consistent purchases and positive reviews.\n- **High Ratings:** Frequently rates content highly, often giving five-star reviews, reflecting an appreciation for compelling storytelling and artistic craftsmanship.\n- **Multilingual Content:** Enjoys films with multilingual features and subtitles, indicating a value for diverse narratives and accessibility.\n- **Engagement with Actors:** Demonstrates admiration for performances, particularly those by actors like Wesley Snipes, and acknowledges the creative talents within preferred genres.\n- **Preference for Unique Narratives:** Shows a strong interest in visually inventive stories and engaging characters, with a focus on character-driven narratives and strong female leads in action films.\n- **Recent Interests:** Displays a growing curiosity for origin stories within established franchises, aiming to understand complex character backgrounds while considering canon fidelity.\n\nIn summary, the user values immersive narratives across genres, high-quality formats, diverse storytelling, and engaging character dynamics, particularly in action films.",
  "metrics": {
    "rouge1_f": 0.0948438088069251,
    "rouge2_f": 0.010546139359698684,
    "rougeL_f": 0.04817463304478736,
    "meteor": 0.027778142077724444,
    "bleu1": 1.4420474272240674e-05,
    "bleu2": 4.758258743762829e-06,
    "bleu3": 1.3657229810048562e-06,
    "bleu4": 4.1178624869451525e-07,
    "bertscore_precision": 0.37114495038986206,
    "bertscore_recall": 0.5112389922142029,
    "bertscore_f1": 0.43007078766822815
  }
}