{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 14 Inch Women Short Wavy Wig Synthetic Colorful Cosplay Daily Party Wig Purple Hair Wig Heat Resistant\nReview Date: 2019/10/29\nStore: Generic\nAverage Rating: 5.0\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.77 x 8.19 x 1.81 inches; 6.77 Ounces', 'UPC': '646040640860'}\nReview Text: I had a hard time taking a picture of the beautiful colors. There are many different shades of purple in the strands. Its gorgeous and has a lot of dimension.\nReview Title: Very beautiful\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Persephone Ombre Grey Bob Wig for Women Full Machine Made Beauty Short Wavy Synthetic Wigs 2 Tones Glueless Hair Replacement Wigs\nPersephone\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Modern', 'Brand': 'Persephone', 'Age Range (Description)': 'Adult', 'Package Dimensions': '16.5 x 8.9 x 1.65 inches; 13.12 Ounces', 'UPC': '708210346207'}\nGreat for cosplay\nFun wig\nUpdated 2020 Blackhead Remover Pore Vacuum - Blackhead Remover Vacuum Facial Pore Cleanser Electric Acne Comedone Extractor Kit for Facial Skin Beauty Device\nEAVUTY\n{'Brand': 'EAVUTY', 'Item Form': 'Pen', 'Material': 'Acrylonitrile Butadiene Styrene', 'Skin Type': 'Acne Prone', 'Number of Items': '6', 'Product Dimensions': '7.48 x 1.77 x 1.57 inches; 8.78 Ounces', 'Item model number': 'Blackhead Remover Pore Vacuum'}\nIt's kinda fun to see it suck the pimples out. Cleans your face really well.\nKinda fun\n14 Inch Women Short Wavy Wig Synthetic Colorful Cosplay Daily Party Wig Purple Hair Wig Heat Resistant\nGeneric\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '11.77 x 8.19 x 1.81 inches; 6.77 Ounces', 'UPC': '646040640860'}\nI had a hard time taking a picture of the beautiful colors. There are many different shades of purple in the strands. Its gorgeous and has a lot of dimension.\nVery beautiful",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Type Preference:** The user's strong interest in modern and distinctive wigs continues, reinforced by a recent purchase that emphasizes vibrant colors for creative occasions like cosplay and daily wear. Their engagement with skincare devices indicates a commitment to broadening their beauty and self-care repertoire.\n  \n- **Material Preference:** While the user favors synthetic materials for wigs due to practicality and affordability, they are open to diverse materials in beauty products, including plastics in skincare tools.\n\n- **Usage Context:** The user's enthusiasm for wigs for creative contexts persists, and their recent focus on skincare highlights a desire for a holistic beauty approach, aiming for both aesthetic enhancement and skin health.\n\n- **Aesthetic Trends:** Consistent preference for short, wavy hairstyles persists, alongside a growing appreciation for colorful variations, particularly in purple hues, reflecting a playful and adventurous spirit in their beauty choices.\n\n- **Review Behavior:** The user actively engages with products, providing high ratings and positive feedback, exemplified by their latest review that highlights the beauty and dimensionality of their new wig. This showcases their satisfaction and enthusiasm for experimenting with different looks.\n\n- **Overall Attitude:** The user maintains a playful and fun approach to beauty, emphasizing versatility, creativity, and enjoyment in both hairstyling and skincare, positioning them as an explorative and engaged member of the beauty community.",
  "metrics": {
    "rouge1_f": 0.2028301886792453,
    "rouge2_f": 0.018957345971563982,
    "rougeL_f": 0.10849056603773585,
    "meteor": 0.1365432985986346,
    "bleu1": 0.1814946619217082,
    "bleu2": 0.025459678339463717,
    "bleu3": 0.006147528354441318,
    "bleu4": 0.0030235294730139826,
    "bertscore_precision": 0.38870155811309814,
    "bertscore_recall": 0.40805134177207947,
    "bertscore_f1": 0.398141473531723
  }
}