{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/10/10\nAverage Rating: 4.6\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Landon'], 'Producers': ['Todd Garner', 'Andy Fickman', 'Samson Mucke', 'Sean Robins', 'Bryan Brucks'], 'Starring': ['ye Sheridan', 'David Koechner'], 'Studio': ['Paramount Pictures']}\nReview Text: This was so friggin funny, Glad I watched it.\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Red Riding Hood\nAmanda Seyfried  (Actor),     Gary Oldman  (Actor),     Catherine Hardwicke  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"In a medieval village a beautiful young girl falls for an orphaned woodcutter, much to her family's displeasure. When her sister is killed by the werewolf that prowls the dark forest surrounding their village, the people call on a famed werewolf hunter to help them kill the wolf. As the death toll rises with each moon, the girl begins to suspect that the werewolf could be someone she loves. Panic grips the town as she discovers that she has a unique connection to the beast--one that inexorably draws them together, making her both suspect...and bait.\", 'Amazon.com', \"This is not your grandmother's\", 'Red Riding Hood', \". There's a basket of goodies (not exactly the edible kind), a sweet grandma, a winsome young lass in a beautiful red hood, and a Big Bad Wolf. But there the similarity ends. This\", 'Red Riding Hood', 'is shot through the lens of the', 'Twilight', 'films--for wide appeal to the tween and teen audiences, and definitely', 'not', 'a bedtime story for the little ones. Helmed by', 'Twilight', 'director Catherine Hardwicke,', 'Red Riding Hood', \"bears a lot of the moody trademarks of the vampire series. Valerie (Amanda Seyfried), the plucky girl in the stunning cape, lives in a tiny medieval village whose geography is not specified--it's just very mountainous and remote. Valerie's heart belongs to her childhood friend Peter (Shiloh Fernandez), but as\", 'Red Riding Hood', \"opens, she learns she has been betrothed to Henry (Max Irons). As if that love triangle weren't enough, it seems a dangerous wolf--or is it werewolf?--has been terrorizing the town for years, and its killing sprees have intensified. When the townsfolk kill a wolf, they think they have finally freed their town from tyranny, and throw a giant bacchanal--like Burning Man in the snow. But then Father Solomon (Gary Oldman, in wickedly good form) appears on the scene to tell the villagers they've killed only a gray wolf--not, in fact, the werewolf he knows is the true villain.\", \"So the romantic pulls of Valerie, Peter, and Henry play out with a backdrop of true chills and mystery. The atmosphere created by Hardwicke, along with production designer Thomas E. Sanders and cinematographer Mandy Walker, is perfect for a goose-bumpy horror story with teen hearts caught in the balance. The set design of the village, especially, is rich with detail--even the trees in the surrounding forest seem to have branches made of threatening spikes. Seyfried is willful, passionate, and perfect as Valerie, and easily anchors a film that could have spun out. Other standouts include Virginia Madsen, Valerie's mother who has a dark secret in her own past, and Julie Christie as Valerie's rather peculiar grandmother. All\", 'Twilight', 'fans, and those who love a good tale of star-crossed (or perhaps full-moon-crossed) lovers will enjoy', 'Red Riding Hood', \". Just don't go walking in those big bad woods alone. --\", 'A.T. Hurley']\n{'Genre': 'Horror, Fantasy, Science Fiction', 'Format': 'Multiple Formats, AC-3, Color, Subtitled, NTSC, Dubbed, Widescreen, Dolby', 'Contributor': 'Gary Oldman, Catherine Hardwicke, Amanda Seyfried', 'Initial release date': '2011-06-14', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': 'WHV1000203549DVD', 'Director': 'Catherine Hardwicke', 'Media Format': 'Multiple Formats, AC-3, Color, Subtitled, NTSC, Dubbed, Widescreen, Dolby', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 14, 2011', 'Actors': 'Amanda Seyfried, Gary Oldman', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Warner Bros. Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt was everything I expected. The seller shipped fast. It was in excellent condition. I can't think of anything I was upset about.\nGreat\nLabyrinth\nDavid Bowie  (Actor),     Jennifer Connelly  (Actor),     Jim Henson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Relive the magic. This newly restored, 2-disc anniversary edition of Jim Henson's\", 'Labyrinth', \"contains an all-new commentary and bonus features that are guaranteed to captivate as never before. David Bowie and Jennifer Connelly invite you into a magical universe where nothing is what it seems. Babysitting infant stepbrother Toby on a weekend night isn't young Sarah's (Connelly) idea of fun. Frustrated by his crying, she secretly imagines the Goblins from her favorite book,\", 'Labyrinth', ', carrying Toby away. When her fantasy comes true, a distraught Sarah must enter a maze of illusion to bring Toby back from a kingdom inhabited by mystical creatures and governed by the wicked Goblin King (Bowie).']\n{'Genre': 'Sci-Fi, Fantasy, Children', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'David Bowie, Jim Henson, Toby Froud, Brian Henson, Eric Rattray, Labyrinth Enterprises, Shari Weiser, Christopher Malcolm, Jennifer Connelly, Natalie Finland, Ron Mueck, Shelley ThompsonDavid Bowie, Jim Henson, Toby Froud, Brian Henson, Eric Rattray, Labyrinth Enterprises, Shari Weiser, Christopher Malcolm, Jennifer Connelly, Natalie Finland, Ron Mueck, Shelley Thompson  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2227731', 'Director': 'Jim Henson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'October 5, 1999', 'Actors': 'David Bowie, Jennifer Connelly, Toby Froud, Shelley Thompson, Christopher Malcolm', 'Subtitles': 'English, Spanish', 'Producers': 'Eric Rattray', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nwonderful\nFive Stars\nEasy A\nEmma Stone  (Actor),     Stanley Tucci  (Actor),     Will Gluck  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"In this charming, critically acclaimed tale of rumors and reputation, Olive (Emma Stone), an average high school student, sees her below-the-radar existence turn around overnight once she decides to use the school's gossip grapevine to advance her social standing. Now her classmates (Amanda Bynes, Aly Michalka) are turning against her and the school board is becoming concerned, including her favorite teacher (Thomas Haden Church) and the distracted guidance counselor (Lisa Kudrow). With the support of her hilariously idiosyncratic parents (Stanley Tucci, Patricia Clarkson) and a little help from a long-time crush (Penn Badgley), Olive attempts to take on her notorious new identity and crush the rumor mill once and for all.\", 'Amazon.com', 'Easy A', 'is a frothy, fizzy, and', 'funny', 'romantic comedy for teens--and adults will love it too. Not since', 'Clueless', 'has a high-school heroine been able to delight both audiences, and', 'Easy A', \"'s Olive (the sparkling Emma Stone) is a stellar young star. But\", 'Easy A', \"benefits from a great script by writer Bert V. Royal and assured direction by TV veteran Will Gluck. Olive is a smart girl happy to stay in the shadows of high school, until her good friend, Brandon (Dan Byrd), who's gay, begs her to pretend to have sex with him so the rest of the school will stop picking on him. She obliges, but soon she picks up not one but two reputations--as the girl who sleeps around, and, on the down-low, as the girl who'll\", 'pretend', \"to sleep with a guy so he won't be branded a virgin. Soon\", 'Easy A', '\\'s complications pile up higher than the entrance of Olive\\'s high school, and her two story lines, neither of which reflects the real Olive, take on lives of their own. There are backlashes and blacklists and repercussions galore. \"I always thought', 'pretending', 'to lose my virginity would feel a little more special,\" muses Olive. \"Judy Blume should have prepared me for that.\" Stone is accompanied by a strong supporting cast: Stanley Tucci and Patricia Clarkson as her bemused parents,', 'Gossip Girl', \"'s dreamy Penn Badgley, the freshly unretired Amanda Bynes, Thomas Haden Church, Lisa Kudrow, and Malcolm McDowell. And it's to the cast's and the writer's credit that the audience is kept engaged, and guessing, till the very end.\", 'Easy A', 'should be awarded exactly that. --', 'A.T. Hurley']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Contributor': 'Stanley Tucci, Will Gluck, Emma Stone', 'Language': 'English', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'CTR36279DVD', 'Director': 'Will Gluck', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 32 minutes', 'Release date': 'December 21, 2010', 'Actors': 'Emma Stone, Stanley Tucci', 'Dubbed': 'French', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love this movie.\nFive Stars\nPixels\nScience Fiction, Comedy, Campy, Cerebral\n['Video-game champions defend Earth from an alien invasion.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Columbus'], 'Producers': ['Adam Sandler', 'Allen Covert'], 'Starring': ['Adam Sandler', 'Kevin James', 'Michelle Monaghan']}\nfunny\nFive Stars\nThe Mighty Boosh Special Edition DVD (Seasons 1-3)\nNoel Fielding  (Actor),     Julian Barratt  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'Mighty Boosh, The: Special Edition DVD [1-3]', \"Come with us now on a journey through time and space to the world of theMighty Boosh. Visit Bob Fossil's Zooniverse where you'll meet Howard Moon (jazz maverick), Vince Noir (king of the mods) and Naboo (the enigma). Sit back and strap yourself in coz the Boosh is loose and it's comin' at ya like a flannel.\", ']]>', 'Amazon.com', 'Come along for an extended journey through time and space with the', 'Mighty Boosh Special Edition DVD', \", a seven-disc compilation of the surreal UK comedy series' first three seasons, plus a bonus disc of live material and behind-the-scenes footage that's sure to please the show's growing legion of fans. Those who own the double-disc standalone editions of\", 'Boosh', \"'s first three seasons will find all of that material repeated here in six of the special edition's discs, including all episodes and supplemental features, so for those wishing to get up to speed in a hurry on the adventures of zookeepers Howard Moon and Vince Noir (creators Julian Barrett and Noel Fielding), or complete their collection in one fell swoop, here's the set to do it. It's the seventh disc that makes the special edition a must-have for first-timers and\", 'Boosh', 'faithful alike; chief among its many extras is', 'The Mighty Boosh: A Journey Through Time and Space', \", a lighthearted but comprehensive hour-long documentary about Barrett and Fielding's trajectory from humble standups to certifiable pop culture icons, with plenty of commentary by fellow UK comics like series producer Steve Coogan. Barrett and Fielding are also front and center for an interview at the Institute of Contemporary Arts and as hosts of a\", 'Mighty Boosh', \"night on BBC Three from 2008, complete with their live linking segments. There's also a glimpse at a proto-\", 'Boosh', 'in sketches from a 1997 unreleased TV pilot called', '(Un)Natural Acts', ', which also finds the pair in a zoo setting, albeit without the outlandish props. Deleted scenes, outtakes, and a look at the creation of the berserk Sammy the Crab puppet also await the faithful; the special features have been arranged in an appropriately psychedelic manner on the disc (none are labeled, and many simply lead to visual non sequiturs), with some only available as Easter eggs, so patience is most definitely required.', '--Paul Gaita']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Noel Fielding, Julian Barratt', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '7', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.6 x 1.5 inches; 14.88 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '9 hours and 48 minutes', 'Release date': 'October 13, 2009', 'Actors': 'Noel Fielding, Julian Barratt', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '7'}\nThis show is so awesome.\nFive Stars\nJurassic World\nChris Pratt  (Actor),     Bryce Dallas Howard  (Actor),     Colin Trevorrow  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Universal Studios Featured Deals\n['Steven Spielberg returns to executive produce the long-awaited next installment of his groundbreaking Jurassic Park series, Jurassic World, an epic action-adventure.']\n{'Genre': 'Science Fiction & Fantasy, Mystery & Suspense/Thrillers, Mystery & Suspense, Action & AdventureScience Fiction & Fantasy, Mystery & Suspense/Thrillers, Mystery & Suspense, Action & Adventure  See more', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Lauren Lapkus, Nick Robinson, Jake Johnson, Judy Greer, Colin Trevorrow, Ty Simpkins, Bryce Dallas Howard, Chris Pratt, BD WongLauren Lapkus, Nick Robinson, Jake Johnson, Judy Greer, Colin Trevorrow, Ty Simpkins, Bryce Dallas Howard, Chris Pratt, BD Wong  See more', 'Initial release date': '2015-10-20', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1)', 'Aspect Ratio': '2:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35222347', 'Director': 'Colin Trevorrow', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 20, 2015', 'Actors': 'Chris Pratt, Bryce Dallas Howard, Judy Greer, Jake Johnson, Lauren Lapkus', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat a wonderful movie.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Nutter', 'Alan Taylor', 'Alex Graves', 'Miguel Sapochnik', 'Mark Mylod', 'Jeremy Podeswa', 'Daniel Minahan', 'Alik Sakharov', 'Michelle MacLaren', 'Brian Kirk'], 'Producers': ['Greg Spence', 'Lisa McAtackney', 'Bryan Cogman', 'Guymon Casady', 'George R.R. Martin', 'Vince Gerardis', 'Chris Newman'], 'Starring': ['Peter Dinklage', 'Lena Headey', 'Emilia Clarke'], 'Studio': ['HBO']}\namazing\nFive Stars\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'Silas Weir Mitchell', 'Russell Hornsby'], 'Studio': ['NBC']}\nloved it.\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Landon'], 'Producers': ['Todd Garner', 'Andy Fickman', 'Samson Mucke', 'Sean Robins', 'Bryan Brucks'], 'Starring': ['ye Sheridan', 'David Koechner'], 'Studio': ['Paramount Pictures']}\nThis was so friggin funny, Glad I watched it.\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user maintains a strong passion for fantasy, horror, and supernatural genres, now actively exploring quirky, surreal comedies and action-adventure films that blend humor and excitement with unconventional narratives. Their recent engagement reflects a continued interest in productions containing elements of violence and mature themes.\n\n- **Content Style:** They favor immersive storytelling characterized by moody atmospheres and visually rich environments, appreciating narratives that balance comedy and emotional depth. The user enjoys clever commentary woven within plots that mix humor with suspenseful elements.\n\n- **Target Audience:** Primarily aimed at tweens and teens, they value contemporary adaptations of classic tales and creators who develop relatable characters. Their curiosity extends to narratives that engage with mature themes while remaining entertaining and engaging.\n\n- **Rating Behavior:** The user consistently rates media highly, emphasizing their enthusiasm for engaging content. Their recent five-star rating showcases a strong preference for humor-laden productions that leave a lasting impression.\n\n- **Shopping Experience:** Prioritizing fast shipping and product quality, the user favors reliable sellers known for outstanding customer service, ensuring a satisfactory purchasing experience.\n\nOverall, the user’s profile signifies a dynamic engagement with modern, entertaining narratives that blend nostalgia, humor, and innovative storytelling while continually adapting to a diverse range of themes and genres.",
  "metrics": {
    "rouge1_f": 0.075402635431918,
    "rouge2_f": 0.004395604395604396,
    "rougeL_f": 0.03953147877013177,
    "meteor": 0.01990107992624894,
    "bleu1": 6.867650808189171e-07,
    "bleu2": 1.8677265985281626e-07,
    "bleu3": 2.9398802381464395e-08,
    "bleu4": 1.1674810798783581e-08,
    "bertscore_precision": 0.3430047929286957,
    "bertscore_recall": 0.491416335105896,
    "bertscore_f1": 0.40401220321655273
  }
}