{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Game of Thrones: Complete Series [DVD]\nReview Date: 2022/05/13\nStore: Nikolaj Coster-Waldau  (Actor),     Michelle Fairley  (Actor)    Format: DVD\nCategories: Movies & TV, HBO, All HBO Titles\nProduct Description: ['Game of Thrones: Complete Series (DVD)', \"Trouble is brewing in the Seven Kingdoms of Westeros. For the driven inhabitants of this visionary world, control of Westeros' Iron Throne holds the lure of great power. But in a land where the seasons can last a lifetime, winter is coming...and beyond the Great Wall that protects them, an ancient evil has returned. Based on the bestselling book series 'A Song of Ice and Fire' by George R.R. Martin comes this epic HBO drama series set in a fantastic realm where noble families engage in a deadly fight for control.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC, DVD', 'Contributor': 'Nathalie Emmanuel, Paul Kaye, Liam Cunningham, Diana Rigg, Daniel Portman, Jason Momoa, Kristofer Hivju, Michelle Fairley, Rose Leslie, David Benioff, Patrick Malahide, Indira Varma, Alfie Allen, Iwan Rheon, Natalie Dormer, Mark Addy, Conleth Hill, Guymon Casady, Isaac Hempstead Wright, Maisie Williams, Jack Gleeson, Pedro Pascal, Jacob Anderson, Jonathan Pryce, John Bradley, Dean-Charles Chapman, Sean Bean, Peter Dinklage, Charles Dance, Stephen Dillane, Gwendoline Christie, Michiel Huisman, Rory McCann, Lena Headey, Jerome Flynn, Anton Lesser, Carice van Houten, Richard Dormer, Nikolaj Coster-Waldau, George R.R. Martin, Vince Gerardis, Sophie Turner, Carolyn Strauss, Emilia Clarke, Harry Lloyd, Michael McElhatton, Ralph Vicinanza, Kit Harington, Oona Chaplin, Aidan Gillen, Hannah Murray, Tom Wlaschiha, Gemma Whelan, Alexander Siddig, Richard MaddenNathalie Emmanuel, Paul Kaye, Liam Cunningham, Diana Rigg, Daniel Portman, Jason Momoa, Kristofer Hivju, Michelle Fairley, Rose Leslie, David Benioff, Patrick Malahide, Indira Varma, Alfie Allen, Iwan Rheon, Natalie Dormer, Mark Addy, Conleth Hill, Guymon Casady, Isaac He…  See more', 'Number Of Discs': '34', 'Publication Date': 'December 3, 2019', 'Product Dimensions': '5 x 5.7 x 7.7 inches; 3.13 Pounds', 'Item model number': '1000744375', 'Media Format': 'NTSC, DVD', 'Release date': 'December 3, 2019', 'Actors': 'Nikolaj Coster-Waldau, Michelle Fairley, Lena Headey, Emilia Clarke, Peter Dinklage', 'Subtitles': 'English', 'Producers': 'David Benioff, George R.R. Martin, Vince Gerardis, Ralph Vicinanza, Guymon Casady', 'Studio': 'Studio Distribution Services', 'Number of discs': '34'}\nReview Text: So I watched seasons 1-5 and the the discs worked perfectly. Then I go to watch season 6 and the first tw discs didn't work. So I had to return.\nReview Title: Decent show from what I saw, but\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Red Riding Hood\nAmanda Seyfried  (Actor),     Gary Oldman  (Actor),     Catherine Hardwicke  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', \"In a medieval village a beautiful young girl falls for an orphaned woodcutter, much to her family's displeasure. When her sister is killed by the werewolf that prowls the dark forest surrounding their village, the people call on a famed werewolf hunter to help them kill the wolf. As the death toll rises with each moon, the girl begins to suspect that the werewolf could be someone she loves. Panic grips the town as she discovers that she has a unique connection to the beast--one that inexorably draws them together, making her both suspect...and bait.\", 'Amazon.com', \"This is not your grandmother's\", 'Red Riding Hood', \". There's a basket of goodies (not exactly the edible kind), a sweet grandma, a winsome young lass in a beautiful red hood, and a Big Bad Wolf. But there the similarity ends. This\", 'Red Riding Hood', 'is shot through the lens of the', 'Twilight', 'films--for wide appeal to the tween and teen audiences, and definitely', 'not', 'a bedtime story for the little ones. Helmed by', 'Twilight', 'director Catherine Hardwicke,', 'Red Riding Hood', \"bears a lot of the moody trademarks of the vampire series. Valerie (Amanda Seyfried), the plucky girl in the stunning cape, lives in a tiny medieval village whose geography is not specified--it's just very mountainous and remote. Valerie's heart belongs to her childhood friend Peter (Shiloh Fernandez), but as\", 'Red Riding Hood', \"opens, she learns she has been betrothed to Henry (Max Irons). As if that love triangle weren't enough, it seems a dangerous wolf--or is it werewolf?--has been terrorizing the town for years, and its killing sprees have intensified. When the townsfolk kill a wolf, they think they have finally freed their town from tyranny, and throw a giant bacchanal--like Burning Man in the snow. But then Father Solomon (Gary Oldman, in wickedly good form) appears on the scene to tell the villagers they've killed only a gray wolf--not, in fact, the werewolf he knows is the true villain.\", \"So the romantic pulls of Valerie, Peter, and Henry play out with a backdrop of true chills and mystery. The atmosphere created by Hardwicke, along with production designer Thomas E. Sanders and cinematographer Mandy Walker, is perfect for a goose-bumpy horror story with teen hearts caught in the balance. The set design of the village, especially, is rich with detail--even the trees in the surrounding forest seem to have branches made of threatening spikes. Seyfried is willful, passionate, and perfect as Valerie, and easily anchors a film that could have spun out. Other standouts include Virginia Madsen, Valerie's mother who has a dark secret in her own past, and Julie Christie as Valerie's rather peculiar grandmother. All\", 'Twilight', 'fans, and those who love a good tale of star-crossed (or perhaps full-moon-crossed) lovers will enjoy', 'Red Riding Hood', \". Just don't go walking in those big bad woods alone. --\", 'A.T. Hurley']\n{'Genre': 'Horror, Fantasy, Science Fiction', 'Format': 'Multiple Formats, AC-3, Color, Subtitled, NTSC, Dubbed, Widescreen, Dolby', 'Contributor': 'Gary Oldman, Catherine Hardwicke, Amanda Seyfried', 'Initial release date': '2011-06-14', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.6 Ounces', 'Item model number': 'WHV1000203549DVD', 'Director': 'Catherine Hardwicke', 'Media Format': 'Multiple Formats, AC-3, Color, Subtitled, NTSC, Dubbed, Widescreen, Dolby', 'Run time': '1 hour and 40 minutes', 'Release date': 'June 14, 2011', 'Actors': 'Amanda Seyfried, Gary Oldman', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish', 'Studio': 'Warner Bros. Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt was everything I expected. The seller shipped fast. It was in excellent condition. I can't think of anything I was upset about.\nGreat\nLabyrinth\nDavid Bowie  (Actor),     Jennifer Connelly  (Actor),     Jim Henson  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Relive the magic. This newly restored, 2-disc anniversary edition of Jim Henson's\", 'Labyrinth', \"contains an all-new commentary and bonus features that are guaranteed to captivate as never before. David Bowie and Jennifer Connelly invite you into a magical universe where nothing is what it seems. Babysitting infant stepbrother Toby on a weekend night isn't young Sarah's (Connelly) idea of fun. Frustrated by his crying, she secretly imagines the Goblins from her favorite book,\", 'Labyrinth', ', carrying Toby away. When her fantasy comes true, a distraught Sarah must enter a maze of illusion to bring Toby back from a kingdom inhabited by mystical creatures and governed by the wicked Goblin King (Bowie).']\n{'Genre': 'Sci-Fi, Fantasy, Children', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'David Bowie, Jim Henson, Toby Froud, Brian Henson, Eric Rattray, Labyrinth Enterprises, Shari Weiser, Christopher Malcolm, Jennifer Connelly, Natalie Finland, Ron Mueck, Shelley ThompsonDavid Bowie, Jim Henson, Toby Froud, Brian Henson, Eric Rattray, Labyrinth Enterprises, Shari Weiser, Christopher Malcolm, Jennifer Connelly, Natalie Finland, Ron Mueck, Shelley Thompson  See more', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2227731', 'Director': 'Jim Henson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'October 5, 1999', 'Actors': 'David Bowie, Jennifer Connelly, Toby Froud, Shelley Thompson, Christopher Malcolm', 'Subtitles': 'English, Spanish', 'Producers': 'Eric Rattray', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nwonderful\nFive Stars\nEasy A\nEmma Stone  (Actor),     Stanley Tucci  (Actor),     Will Gluck  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"In this charming, critically acclaimed tale of rumors and reputation, Olive (Emma Stone), an average high school student, sees her below-the-radar existence turn around overnight once she decides to use the school's gossip grapevine to advance her social standing. Now her classmates (Amanda Bynes, Aly Michalka) are turning against her and the school board is becoming concerned, including her favorite teacher (Thomas Haden Church) and the distracted guidance counselor (Lisa Kudrow). With the support of her hilariously idiosyncratic parents (Stanley Tucci, Patricia Clarkson) and a little help from a long-time crush (Penn Badgley), Olive attempts to take on her notorious new identity and crush the rumor mill once and for all.\", 'Amazon.com', 'Easy A', 'is a frothy, fizzy, and', 'funny', 'romantic comedy for teens--and adults will love it too. Not since', 'Clueless', 'has a high-school heroine been able to delight both audiences, and', 'Easy A', \"'s Olive (the sparkling Emma Stone) is a stellar young star. But\", 'Easy A', \"benefits from a great script by writer Bert V. Royal and assured direction by TV veteran Will Gluck. Olive is a smart girl happy to stay in the shadows of high school, until her good friend, Brandon (Dan Byrd), who's gay, begs her to pretend to have sex with him so the rest of the school will stop picking on him. She obliges, but soon she picks up not one but two reputations--as the girl who sleeps around, and, on the down-low, as the girl who'll\", 'pretend', \"to sleep with a guy so he won't be branded a virgin. Soon\", 'Easy A', '\\'s complications pile up higher than the entrance of Olive\\'s high school, and her two story lines, neither of which reflects the real Olive, take on lives of their own. There are backlashes and blacklists and repercussions galore. \"I always thought', 'pretending', 'to lose my virginity would feel a little more special,\" muses Olive. \"Judy Blume should have prepared me for that.\" Stone is accompanied by a strong supporting cast: Stanley Tucci and Patricia Clarkson as her bemused parents,', 'Gossip Girl', \"'s dreamy Penn Badgley, the freshly unretired Amanda Bynes, Thomas Haden Church, Lisa Kudrow, and Malcolm McDowell. And it's to the cast's and the writer's credit that the audience is kept engaged, and guessing, till the very end.\", 'Easy A', 'should be awarded exactly that. --', 'A.T. Hurley']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Contributor': 'Stanley Tucci, Will Gluck, Emma Stone', 'Language': 'English', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.3 x 7.5 inches; 2.4 Ounces', 'Item model number': 'CTR36279DVD', 'Director': 'Will Gluck', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen, Dubbed', 'Run time': '1 hour and 32 minutes', 'Release date': 'December 21, 2010', 'Actors': 'Emma Stone, Stanley Tucci', 'Dubbed': 'French', 'Studio': 'Sony Pictures', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI love this movie.\nFive Stars\nPixels\nScience Fiction, Comedy, Campy, Cerebral\n['Video-game champions defend Earth from an alien invasion.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Chris Columbus'], 'Producers': ['Adam Sandler', 'Allen Covert'], 'Starring': ['Adam Sandler', 'Kevin James', 'Michelle Monaghan']}\nfunny\nFive Stars\nThe Mighty Boosh Special Edition DVD (Seasons 1-3)\nNoel Fielding  (Actor),     Julian Barratt  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'Mighty Boosh, The: Special Edition DVD [1-3]', \"Come with us now on a journey through time and space to the world of theMighty Boosh. Visit Bob Fossil's Zooniverse where you'll meet Howard Moon (jazz maverick), Vince Noir (king of the mods) and Naboo (the enigma). Sit back and strap yourself in coz the Boosh is loose and it's comin' at ya like a flannel.\", ']]>', 'Amazon.com', 'Come along for an extended journey through time and space with the', 'Mighty Boosh Special Edition DVD', \", a seven-disc compilation of the surreal UK comedy series' first three seasons, plus a bonus disc of live material and behind-the-scenes footage that's sure to please the show's growing legion of fans. Those who own the double-disc standalone editions of\", 'Boosh', \"'s first three seasons will find all of that material repeated here in six of the special edition's discs, including all episodes and supplemental features, so for those wishing to get up to speed in a hurry on the adventures of zookeepers Howard Moon and Vince Noir (creators Julian Barrett and Noel Fielding), or complete their collection in one fell swoop, here's the set to do it. It's the seventh disc that makes the special edition a must-have for first-timers and\", 'Boosh', 'faithful alike; chief among its many extras is', 'The Mighty Boosh: A Journey Through Time and Space', \", a lighthearted but comprehensive hour-long documentary about Barrett and Fielding's trajectory from humble standups to certifiable pop culture icons, with plenty of commentary by fellow UK comics like series producer Steve Coogan. Barrett and Fielding are also front and center for an interview at the Institute of Contemporary Arts and as hosts of a\", 'Mighty Boosh', \"night on BBC Three from 2008, complete with their live linking segments. There's also a glimpse at a proto-\", 'Boosh', 'in sketches from a 1997 unreleased TV pilot called', '(Un)Natural Acts', ', which also finds the pair in a zoo setting, albeit without the outlandish props. Deleted scenes, outtakes, and a look at the creation of the berserk Sammy the Crab puppet also await the faithful; the special features have been arranged in an appropriately psychedelic manner on the disc (none are labeled, and many simply lead to visual non sequiturs), with some only available as Easter eggs, so patience is most definitely required.', '--Paul Gaita']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': 'Noel Fielding, Julian Barratt', 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Number Of Discs': '7', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.6 x 1.5 inches; 14.88 Ounces', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '9 hours and 48 minutes', 'Release date': 'October 13, 2009', 'Actors': 'Noel Fielding, Julian Barratt', 'Subtitles': 'English', 'Studio': 'BBC Home Entertainment', 'Number of discs': '7'}\nThis show is so awesome.\nFive Stars\nJurassic World\nChris Pratt  (Actor),     Bryce Dallas Howard  (Actor),     Colin Trevorrow  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Today's Deals, Universal Studios Featured Deals\n['Steven Spielberg returns to executive produce the long-awaited next installment of his groundbreaking Jurassic Park series, Jurassic World, an epic action-adventure.']\n{'Genre': 'Science Fiction & Fantasy, Mystery & Suspense/Thrillers, Mystery & Suspense, Action & AdventureScience Fiction & Fantasy, Mystery & Suspense/Thrillers, Mystery & Suspense, Action & Adventure  See more', 'Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Contributor': 'Lauren Lapkus, Nick Robinson, Jake Johnson, Judy Greer, Colin Trevorrow, Ty Simpkins, Bryce Dallas Howard, Chris Pratt, BD WongLauren Lapkus, Nick Robinson, Jake Johnson, Judy Greer, Colin Trevorrow, Ty Simpkins, Bryce Dallas Howard, Chris Pratt, BD Wong  See more', 'Initial release date': '2015-10-20', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (Dolby Digital 5.1)', 'Aspect Ratio': '2:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '35222347', 'Director': 'Colin Trevorrow', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC', 'Run time': '2 hours and 5 minutes', 'Release date': 'October 20, 2015', 'Actors': 'Chris Pratt, Bryce Dallas Howard, Judy Greer, Jake Johnson, Lauren Lapkus', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWhat a wonderful movie.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['David Nutter', 'Alan Taylor', 'Alex Graves', 'Miguel Sapochnik', 'Mark Mylod', 'Jeremy Podeswa', 'Daniel Minahan', 'Alik Sakharov', 'Michelle MacLaren', 'Brian Kirk'], 'Producers': ['Greg Spence', 'Lisa McAtackney', 'Bryan Cogman', 'Guymon Casady', 'George R.R. Martin', 'Vince Gerardis', 'Chris Newman'], 'Starring': ['Peter Dinklage', 'Lena Headey', 'Emilia Clarke'], 'Studio': ['HBO']}\namazing\nFive Stars\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Norberto Barba', \"Terrence O'Hara\", 'Eric Laneuville', 'Aaron Lipstadt', 'Peter Werner', 'David Solomon', 'Steven DePaul', 'John Behring', 'Darnell Martin', 'Karen Gaviola'], 'Starring': ['David Giuntoli', 'Silas Weir Mitchell', 'Russell Hornsby'], 'Studio': ['NBC']}\nloved it.\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Landon'], 'Producers': ['Todd Garner', 'Andy Fickman', 'Samson Mucke', 'Sean Robins', 'Bryan Brucks'], 'Starring': ['ye Sheridan', 'David Koechner'], 'Studio': ['Paramount Pictures']}\nThis was so friggin funny, Glad I watched it.\nFive Stars\nWyatt Earp\nDennis Quaid  (Actor),     Gene Hackman  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Wyatt Earp (DVD)', 'Kevin Costner plays the most famous lawman ever to stride the Wild West. In a gritty, complex portrayal hailed as a \"classic American performance\" (Bob Campbell, Newhouse Newspapers), Academy Award winner Costner (Dances with Wolves, The Bodyguard) plays the man who became a myth in acclaimed director Lawrence Kasdan\\'s (The Big Chill, Silverado) epic, action-filled saga. Gene Hackman, an Oscar winner for Unforgiven, as Wyatt\\'s iron-willed father, and Dennis Quaid (The Big Easy, The Right Stuff) as Earp\\'s deadly best friend Doc Holliday add power to this mammoth, hard-hitting Western. From Wichita to Dodge City to the O.K. Corral in Tombstone, Arizona, Wyatt Earp is a thrilling journey of romance, adventure and desperate, heroic action.', ']]>']\n{'Genre': 'Drama, Documentary/History, Westerns', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': \"Michael Grillo, Mark Harmon, Bill Pullman, JoBeth Williams, Kevin Costner, Jim Wilson, Catherine O'Hara, Dennis Quaid, Tom Sizemore, Jeff Fahey, Lawrence Kasdan, Isabella Rossellini, Gene Hackman, Michael Madsen, Mare Winningham, Jon Slan, Dan Gordon, Charles OkunMichael Grillo, Mark Harmon, Bill Pullman, JoBeth Williams, Kevin Costner, Jim Wilson, Catherine O'Hara, Dennis Quaid, Tom Sizemore, Jeff Fahey, Lawrence Kasdan, Isabella Rossellini, Gene Hackman, Michael Madsen, Mare Winningham, Jon Slan, Dan Gordon, Charl…   See more\", 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround)', 'Runtime': '3 hours and 10 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 2.4 Ounces', 'Item model number': '74492', 'Director': 'Lawrence Kasdan', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '3 hours and 10 minutes', 'Release date': 'September 4, 2007', 'Actors': 'Kevin Costner, Dennis Quaid, Gene Hackman, Jeff Fahey, Mark Harmon', 'Dubbed': 'French', 'Subtitles': 'Spanish, English, French', 'Producers': 'Jim Wilson, Jon Slan, Kevin Costner, Dan Gordon, Charles Okun', 'Studio': 'WarnerBrothers', 'Writers': 'Lawrence Kasdan, Dan Gordon', 'Number of discs': '1'}\nI love this movie. I am glad to finally have it in my collection.\nFive Stars\nTombstone\nKurt Russell  (Actor),     Val Kilmer  (Actor),     George P. Cosmatos  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Note :The opening scene is not a disc error .It was intentionally shot and presented in this format and aspect ratio as this was the directors vision for his film.A sizzling, star-studded cast brings to life the legendary battle to deliver justice to TOMBSTONE! Kurt Russell (MIRACLE, VANILLA SKY) turns in a gripping performance as U.S. Marshall Wyatt Earp and Val Kilmer (THE MISSING, BATMAN FOREVER) ignites the screen as the outrageous Doc Holliday. Together, they team up to bring law to the lawless in a notorious showdown with the ruthless outlaws at the O.K. Corral! The all-star ensemble also includes Sam Elliott, Bill Paxton, Dana Delany, Jason Priestley, Michael Biehn, and long-time Hollywood favorite Charlton Heston. Get ready for an explosive, action-packed adventure the Wild West would never forget!', 'Amazon.com', \"This Western has become a modest cult favorite since its release in 1993, when the film was met with mixed reviews but the performances of Kurt Russell (as Wyatt Earp) and especially Val Kilmer, for his memorably eccentric performance as the dying gunslinger Doc Holliday, garnered high praise. The movie opens with Wyatt Earp trying to put his violent past behind him, living happily in Tombstone with his brothers and the woman (Dana Delany) who puts his soul at ease. But a murderous gang called the Cowboys has burst on the scene, and Earp can't keep his gun belt off any longer. The plot sounds routine, and in many ways it is, but Western buffs won't mind a bit thanks to a fine cast and some well-handled action on the part of\", 'Rambo', 'director George P. Cosmatos, who has yet to make a better film than this.', '--Jeff Shannon']\n{'Genre': 'RUSSELL, CORRAL, O.K., HOLIDAY, DOC, EARP, WYATT, Action/Adventure, KURT', 'Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Contributor': 'Charlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden ChurchCharlton Heston, Kurt Russell, Sam Elliott, Kevin Jarre, Powers Boothe, Bill Paxton, George P. Cosmatos, Michael Biehn, Jason Priestley, Val Kilmer, Dana Delany, Thomas Haden Church  See more', 'Language': 'Unqualified, French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': 'MFR717951000064#VG', 'Director': 'George P. Cosmatos', 'Media Format': 'Multiple Formats, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Run time': '2 hours and 10 minutes', 'Release date': 'December 2, 1997', 'Actors': 'Kurt Russell, Val Kilmer, Sam Elliott, Bill Paxton, Powers Boothe', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish', 'Studio': 'HOLLYWOOD PICTURES', 'Writers': 'Kevin Jarre', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis movie was great. Much better than expected.\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Blake Calhoun'], 'Producers': ['Felicia Day'], 'Starring': ['Amber Benson', 'Robert Picardo', 'Lindsay Seidel'], 'Studio': ['Pen Ultimate Productions']}\ncan we get the rest?\nFive Stars\nZombieland\nWoody Harrelson  (Actor),     Jesse Eisenberg  (Actor),     Ruben Fleischer  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Nerdy college student Columbus (Jesse Eisenberg) has survived the plague that has turned mankind into flesh-devouring zombies because he’s scared of just about everything. Gun-toting, Twinkie-loving Tallahassee (Woody Harrelson) has no fears. Together, they are about to stare down their most horrifying challenge yet: each other’s company. Emma Stone and Abigail Breslin co-star in this double-hitting, head-smashing comedy.', 'Amazon.com', \"If there's been a zombie apocalypse and you're road-tripping alone though the wasteland, you could do worse than run into Tallahassee (Woody Harrelson), a bourbon-swilling bad-boy butt-kicker with a really cool car. This is where the careful hero of\", 'Zombieland', ', a kid nicknamed Columbus (Jesse Eisenberg), finds himself early in the film, and you can hardly blame him for hitching a ride with this swaggering Alpha Male. Still, they have their hands full not only with gibbering zombies but also with two sisters (Emma Stone and Abigail Breslin) who will stop at nothing to reach a Disneyland-like amusement park in L.A. Although', 'Zombieland', \"gets off to a rocky start with Columbus's overly-cute narration (he's got a list of rules for surviving in the zombie world), it settles into an amusing comedy, regularly interrupted by bouts of blood-letting. The road-trip stuff is enough fun that when the movie does arrive at its version of Disneyland, the air goes out of it a little; sure, there's a giant zombie blowout, with entrails flying, but it's not quite the same. Director Ruben Fleischer keeps the gags coming, although the movie is often funnier in its odd little asides (both Eisenberg and Harrelson are expert at this) than in its official jokes. Comic high point: an interlude at the home of a very famous movie star, who plays himself--and we'll leave the spoiler unspoiled, in case anybody hasn't heard about this funny extended cameo.\", '--Robert Horton', 'Stills from', 'Zombieland', '(Click for larger image)']\n{'Genre': 'Action, Sci-Fi, Horror, Comedy', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Widescreen, Subtitled', 'Contributor': 'Abigail Breslin, Derek Graf, Ruben Fleischer, Jesse Eisenberg, Woody Harrelson, Zombieland Productions, LLC, Gavin Polone, Amber Heard, Emma Stone, Bill MurrayAbigail Breslin, Derek Graf, Ruben Fleischer, Jesse Eisenberg, Woody Harrelson, Zombieland Productions, LLC, Gavin Polone, Amber Heard, Emma Stone, Bill Murray  See more', 'Language': 'French (Dolby Digital 2.0 Stereo), Unqualified (DTS ES 6.1)', 'Runtime': '1 hour and 28 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.57 x 4.98 x 7.84 inches; 2.56 Ounces', 'Audio Description': 'English', 'Item model number': 'CTR33154DVD', 'Director': 'Ruben Fleischer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 28 minutes', 'Release date': 'February 2, 2010', 'Actors': 'Woody Harrelson, Jesse Eisenberg, Emma Stone, Abigail Breslin, Amber Heard', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Gavin Polone', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nlove this movie\nFive Stars\nRepo! The Genetic Opera\nPaul Sorvino  (Actor),     Anthony Head  (Actor),     Darren Lynn Bousman  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['Product Description', 'By fusing THE ROCKY HORROR PICTURE SHOW and BLADE RUNNER, this futuristic tale of horror modernizes the \"rock opera\" genre with original music and rich, dark production design.', 'Amazon.com', 'Likening', 'Repo! The Genetic Opera', 'to its predecessors,', 'Little Shop of Horrors', 'and', 'Rocky Horror Picture Show', ', conveys this film’s high camp and operatic bursts of song, but does little to describe how absolutely bizarre', 'Repo!', 'is. Like', 'Rocky Horror', ', Repo! was written for stage performance by Darren Smith and Terrance Zdunich, who stars as a Graverobber, dolled up in vampiric makeup to resemble', 'Rocky Horror’s', 'iconic tranny, Dr. Frank-N-Furter. Hiring newbie director, Darren Lynn Bousman, fresh out of film school to shoot this mutant movie, Smith and Zdunich clearly focused on writing comedy into extremely gruesome slasher scenes, which works with mixed results. Stills of comic strips contextualize each scene, telling the story of biotech corporation Geneco’s repossessions of organs that they implanted into various patients to save human lives during a long history of operations. Organs, here, were bought on credit, and as the economy nosedives, citizens of this a makeshift Gotham City cannot pay bills, and must forfeit their lives to repo men make a killing around town, literally. Heading this enterprise is CEO Rotti Largo (Paul Sorvino), who has two bickering sons, Luigi (Bill Moseley) and Pavi (Nivek Ogre), whose white facemask is third generation Phantom, borrowing directly from Winslow Leach’s in Brian De Palma’s', 'Phantom of the Paradise', '. Central to the plot is head repo guy/slaughterer, Nathan Wallace (Anthony Head of', 'Buffy the Vampire Slayer', '), who hides his career path to preserve his sexy teenage daughter, Shilo’s (Alexa Vega), innocence. As Shilo discovers her godmom, Blind Mag (Sarah Brightman), and the \"Z\"-addicted surgery slut, Amber Sweet (Paris Hilton), she embarks on adventures through an urban landscape constructed of metal gear, corpse piles, and S/M zombie girls, while dad straps people up in his torture chamber to take back body parts. Hmmmm. Since', 'Repo!', 'looks likes a Marilyn Manson video, its musical niche sensibility will only appeal to fans who like Goth and Industrial music. To anyone who doesn’t go for that look, it does impress for its sheer dedication to choreography and song. In the least,', 'Repo! The Genetic Opera', 'is an anomalous glimpse into visionary horror. --', 'Trinie Dalton']\n{'Genre': 'Cult Movies', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Darren Smith, Anthony Head, Jessica Horn, Darren Lynn Bousman, Paris Hilton, Brianna Buckmaster, Terrance Zdunich, Branko Lebar, Sarah Brightman, Bill Moseley, Sarah Power, Nivek Ogre, Alexa Vega, Paul SorvinoDarren Smith, Anthony Head, Jessica Horn, Darren Lynn Bousman, Paris Hilton, Brianna Buckmaster, Terrance Zdunich, Branko Lebar, Sarah Brightman, Bill Moseley, Sarah Power, Nivek Ogre, Alexa Vega, Paul Sorvino  See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.44 Ounces', 'Item model number': 'MFR031398104353#VG', 'Director': 'Darren Lynn Bousman', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'January 20, 2009', 'Actors': 'Paul Sorvino, Anthony Head, Alexa Vega, Sarah Brightman, Paris Hilton', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Writers': 'Darren Smith, Terrance Zdunich', 'Country of Origin': 'USA', 'Number of discs': '1'}\namazing movie\nFive Stars\nGame of Thrones: Complete Series [DVD]\nNikolaj Coster-Waldau  (Actor),     Michelle Fairley  (Actor)    Format: DVD\nMovies & TV, HBO, All HBO Titles\n['Game of Thrones: Complete Series (DVD)', \"Trouble is brewing in the Seven Kingdoms of Westeros. For the driven inhabitants of this visionary world, control of Westeros' Iron Throne holds the lure of great power. But in a land where the seasons can last a lifetime, winter is coming...and beyond the Great Wall that protects them, an ancient evil has returned. Based on the bestselling book series 'A Song of Ice and Fire' by George R.R. Martin comes this epic HBO drama series set in a fantastic realm where noble families engage in a deadly fight for control.\"]\n{'Genre': 'Drama', 'Format': 'NTSC, DVD', 'Contributor': 'Nathalie Emmanuel, Paul Kaye, Liam Cunningham, Diana Rigg, Daniel Portman, Jason Momoa, Kristofer Hivju, Michelle Fairley, Rose Leslie, David Benioff, Patrick Malahide, Indira Varma, Alfie Allen, Iwan Rheon, Natalie Dormer, Mark Addy, Conleth Hill, Guymon Casady, Isaac Hempstead Wright, Maisie Williams, Jack Gleeson, Pedro Pascal, Jacob Anderson, Jonathan Pryce, John Bradley, Dean-Charles Chapman, Sean Bean, Peter Dinklage, Charles Dance, Stephen Dillane, Gwendoline Christie, Michiel Huisman, Rory McCann, Lena Headey, Jerome Flynn, Anton Lesser, Carice van Houten, Richard Dormer, Nikolaj Coster-Waldau, George R.R. Martin, Vince Gerardis, Sophie Turner, Carolyn Strauss, Emilia Clarke, Harry Lloyd, Michael McElhatton, Ralph Vicinanza, Kit Harington, Oona Chaplin, Aidan Gillen, Hannah Murray, Tom Wlaschiha, Gemma Whelan, Alexander Siddig, Richard MaddenNathalie Emmanuel, Paul Kaye, Liam Cunningham, Diana Rigg, Daniel Portman, Jason Momoa, Kristofer Hivju, Michelle Fairley, Rose Leslie, David Benioff, Patrick Malahide, Indira Varma, Alfie Allen, Iwan Rheon, Natalie Dormer, Mark Addy, Conleth Hill, Guymon Casady, Isaac He…  See more', 'Number Of Discs': '34', 'Publication Date': 'December 3, 2019', 'Product Dimensions': '5 x 5.7 x 7.7 inches; 3.13 Pounds', 'Item model number': '1000744375', 'Media Format': 'NTSC, DVD', 'Release date': 'December 3, 2019', 'Actors': 'Nikolaj Coster-Waldau, Michelle Fairley, Lena Headey, Emilia Clarke, Peter Dinklage', 'Subtitles': 'English', 'Producers': 'David Benioff, George R.R. Martin, Vince Gerardis, Ralph Vicinanza, Guymon Casady', 'Studio': 'Studio Distribution Services', 'Number of discs': '34'}\nSo I watched seasons 1-5 and the the discs worked perfectly. Then I go to watch season 6 and the first tw discs didn't work. So I had to return.\nDecent show from what I saw, but",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user continues to maintain a strong affinity for fantasy, horror, and supernatural genres while also enjoying quirky comedies and action-adventure films. Their interest in classic Westerns and historical narratives remains, illustrating a passion for a wide range of storytelling.\n\n- **Content Style:** They are drawn to immersive narratives characterized by moody atmospheres. The user favors stories that blend humor with emotional depth, showcasing clever writing and compelling characters that tackle entertaining yet thought-provoking themes.\n\n- **Target Audience:** Focused on tweens and teens, the user appreciates contemporary adaptations of classic tales, favoring relatable characters and narratives that address mature themes in an enjoyable manner.\n\n- **Rating Behavior:** The user has a discerning taste, recently expressing dissatisfaction through a low rating for a product that had technical issues, contrasting with their previous high ratings. This reinforces their expectation for quality and reliability in their media selections.\n\n- **Shopping Experience:** They prioritize fast shipping and product quality, valuing reliable sellers known for excellent customer service which enhances their overall purchasing experience.\n\nOverall, this profile reflects the user's dynamic engagement with a variety of genres, their critical eye for quality, and a preference for innovative storytelling that artfully combines nostalgia, humor, and emotional resonance.",
  "metrics": {
    "rouge1_f": 0.044787644787644784,
    "rouge2_f": 0.005407493240633449,
    "rougeL_f": 0.02393822393822394,
    "meteor": 0.012085322375974381,
    "bleu1": 8.198162222014537e-13,
    "bleu2": 3.0331660523567404e-13,
    "bleu3": 8.840592645775581e-14,
    "bleu4": 2.686534191804465e-14,
    "bertscore_precision": 0.33287349343299866,
    "bertscore_recall": 0.502629280090332,
    "bertscore_f1": 0.40050607919692993
  }
}