{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Alien Anthology (Alien / Aliens / Alien 3 / Alien: Resurrection) [Blu-ray]\nReview Date: 2013/02/25\nStore: Sigourney Weaver  (Actor),     Tom Skerritt  (Actor),     Ridley Scott  (Director),     David Fincher  (Director)    &                   1                  more   Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Featured Categories, Blu-ray\nProduct Description: ['Product Description', 'Brace yourself for a whole new breed of Blu ray: Four powerful films...eight thrilling versions...in dazzling, terrifying, high def clarity with the purest digital sound on the planet. Two bonus dics and over 65 hours of archival and never before seen content, including the totally immersive MU TH UR mode feature, makes this definitive', 'Alien', 'collection!', 'Amazon.com', 'Review of', 'Alien', 'A landmark of science fiction and horror, Alien arrived in 1979 between Star Wars and The Empire Strikes Back as a stylishly malevolent alternative to George Lucas\\'s space fantasy. Partially inspired by 1958\\'s It! The Terror from Beyond Space, this instant classic set a tone of its own, offering richly detailed sets, ominous atmosphere, relentless suspense, and a flawless ensemble cast as the crew of the space freighter Nostromo, who fall prey to a vicious creature (designed by Swiss artist H.R. Giger) that had gestated inside one of the ill-fated crew members. In a star-making role, Sigourney Weaver excels as sole survivor Ripley, becoming the screen\\'s most popular heroine in a lucrative movie franchise. To measure the film\\'s success, one need only recall the many images that have been burned into our collective psyche, including the \"facehugger,\" the \"chestburster,\" and Ripley\\'s climactic encounter with the full-grown monster. Impeccably directed by Ridley Scott, Alien is one of the cinema\\'s most unforgettable nightmares.', '--Jeff Shannon', 'Review of', 'Aliens', 'Aliens is one of the few cases of a sequel that far surpassed the original. Sigourney Weaver returns as Ripley, who awakens on Earth only to discover that she has been hibernating in space so long that everyone she knows is dead. Then she is talked into traveling (along with a squad of Marines) to a planet under assault by the same aliens that nearly killed her. Once she gets there, she finds a lost little girl who triggers her maternal instincts--and she discovers that the company has once again double-crossed her, in hopes of capturing one of the aliens to study as a military weapon. Directed and written by James Cameron, this is one of the most intensely exciting (not to mention intensely frightening) action films ever, with a large ensemble cast that includes Bill Paxton, Lance Henriksen, Paul Reiser, and Michael Biehn. Weaver defined the action woman in this film and walked away with an Oscar nomination for her trouble.', '--Marshall Fine', 'Review of', 'Alien 3', 'The least successful film in this series was directed by stylemaster (and content-underachiever) David Fincher. Ripley, the only survivor of her past mission, awakens on a prison planet in the far corners of the solar system. As she tries to recover, she realizes that not only has an alien gotten loose on the planet, the alien has implanted one of its own within her. As she battles the prison authorities (and is aided by the prisoners) in trying to kill the alien, she must also cope with a distinctly shortened lifespan that awaits her. But the striking imagery makes for muddled action and the script confuses it further. The ending looks startling but it takes a long time--and a not particularly satisfying journey--to get there.', '--Marshall Fine', 'Review of', 'Alien Resurrection', \"Perhaps these films are like the Star Trek movies: The even-numbered episodes are the best ones. Certainly this film (directed by French stylist Jean-Pierre Jeunet) is an improvement over Alien 3, with a script that breathes exciting new life into the franchise. This chapter is set even further in the future, where scientists on a space colony have cloned both the alien and Ripley (Sigourney Weaver), who died in Alien 3; in doing so, however, they've mixed alien DNA with Ripley's human chromosomes, which gives Ripley surprising power (and a bad attitude). A band of smugglers comes aboard only to discover the new race of aliens--and when the multi-mouthed melonheads get loose, no place is safe. But, on the plus side, they have Ripley as a guide to help them get out. Winona Ryder is on hand as the smugglers' most unlikely crew member (with a secret of her own), but this one is Sigourney's all the way.\", '--Marshall Fine']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Horror/Things That Go Bump/Monsters, Science Fiction & Fantasy', 'Format': 'Multiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen   See more', 'Contributor': 'Tom Skerritt, David Fincher, Ridley Scott, John Hurt, James Cameron, Winona Ryder, Sigourney Weaver, Jean-Pierre Jeunet, Lance HenriksenTom Skerritt, David Fincher, Ridley Scott, John Hurt, James Cameron, Winona Ryder, Sigourney Weaver, Jean-Pierre Jeunet, Lance Henriksen   See more', 'Language': 'German (DTS 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD)', 'Runtime': '7 hours and 57 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '1 x 5.6 x 6.9 inches; 14.4 Ounces', 'Item model number': 'Alien Ant', 'Director': 'Ridley Scott, David Fincher, James Cameron, Jean-Pierre Jeunet', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '7 hours and 57 minutes', 'Release date': 'October 26, 2010', 'Actors': 'Sigourney Weaver, Tom Skerritt, John Hurt, Lance Henriksen, Winona Ryder', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, German, Portuguese, Spanish', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '6'}\nReview Text: I read a lot of reviews about transfer quality and things like that, but if the picture quality is good, that's usually good enough for me.  Maybe it's because I've seen these movies, especially the classic Alien, so many times that I noticed the difference, but the Blu-ray version of this film is like seeing it for the first time.  The film is shadowy, lots of darkness, and there are many shots that we've never seen clearly before.  I've never seen, or at least noticed, such a difference between a DVD and a Blu-ray disc.  That alone was worth the price of this anthology.\nReview Title: Alien on Blu-ray.  Like Seeing it for the First Time.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Hours [DVD]\nMeryl Streep  (Actor),     Nicole Kidman  (Actor),     Stephen Daldry  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', 'THE HOURS tells the story of three very different individuals who share the feeling that they have been living their lives for someone else. Virginia Woolf (Kidman) lives in a suburb of London in the 1920\\x92s as she struggles to begin writing her first great novel, Mrs. Dalloway, while also attempting to overcome the mental illness that threatens to engulf her. Laura Brown (Moore), a young wife and mother in post-World War II Los Angeles, is just starting to read Mrs. Dalloway, and is so deeply affected by it that she begins to question the life she has chosen for herself. Then, in contemporary New York City, Clarissa Vaughan (Streep) is a modern-day mirror image of Woolf\\x92s Mrs. Dalloway as she plans what may be the final party for her friend and former lover, Richard (Harris), who is dying of AIDS.', 'Amazon.com', 'Delicate and hypnotic,', 'The Hours', 'interweaves three stories with remarkable skill: in the 1920s Virginia Woolf (Nicole Kidman) grapples with her inner demons and slowly works on her novel', 'Mrs. Dalloway', \"; in 1949 housewife Laura Brown (Julianne Moore) feels her own destructive impulses; and in 1999 book editor Clarissa Vaughn (Meryl Streep)--much like the title character of Woolf's novel--prepares to throw a party, in honor of her dearest friend, a seriously ill poet (Ed Harris). Small details reverberate from story to story as a powerhouse cast (including Allison Janney, Toni Collette, Claire Danes, Jeff Daniels, John C. Reilly, Stephen Dillane, and Miranda Richardson) gives subtle and beautifully modulated performances. In the hands of director Stephen Daldry (\", 'Billy Elliot', '),', 'The Hours', 'is almost more a piece of music than a story, and like music, it may move you in unexpected ways.', '--Bret Fetzer', 'Set Contains:', \"It's hard to imagine anyone wanting more than what's on this lovely, single disc. There are four newly produced segments: a talk with composer Philip Glass, a featurette on the three main actresses, a must-see 10-minute feature on the writer of the novel (Michael Cunningham) and the screenplay (David Hare), and a crisp half-hour history of Virginia Wolfe with many anecdotes from various scholars. There are two commentaries. Highly recommended is Cunningham with director Stephen Daldry as they go through the movie with a good sense of appreciation for each person's craft. Cunningham is quite charming in revealing the story's origins while Daldry makes even the smallest task of filmmaking interesting. Daldry's so detailed he apologizes for such seemingly trivial bits as filming the opening sequence at a different time of year than it actually happened. The main three actresses speak separately on the other commentary track, and even though fans will enjoy their insights, the energy is very low; perhaps they should have recorded the track together. Streep's deep laughs at her little jokes are very smile-inducing.\", '--Doug Thomas', 'See more']\n{'Genre': 'Kids & Family, Drama', 'Format': 'Anamorphic, Closed-captioned, Color, DVD, Widescreen, NTSC', 'Contributor': 'Linda Bassett, Meryl Streep, Michael Cunningham, Charley Ramm, Stephen Daldry, David Hare, Stephen Dillane, Miranda Richardson, Michael Culkin, Christian Coulson, Nicole Kidman, Sophie Wyburd, Julianne Moore, Lyndsey Marshal, George LoftusLinda Bassett, Meryl Streep, Michael Cunningham, Charley Ramm, Stephen Daldry, David Hare, Stephen Dillane, Miranda Richardson, Michael Culkin, Christian Coulson, Nicole Kidman, Sophie Wyburd, Julianne Moore, Lyndsey Marshal, George Loftus  See more', 'Language': 'English (Dolby Digital 5.0), French', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Stephen Daldry', 'Media Format': 'Anamorphic, Closed-captioned, Color, DVD, Widescreen, NTSC', 'Run time': '1 hour and 54 minutes', 'Release date': 'June 24, 2003', 'Actors': 'Meryl Streep, Nicole Kidman, Julianne Moore, Stephen Dillane, Miranda Richardson', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'David Hare, Michael Cunningham', 'Number of discs': '1'}\nIf you haven't seen this film, get it now.  You'll hate yourself for not buying it sooner.  This is one of the most powerful films I have ever seen.  I was mesmerized from the first scene.  It is simply brilliant, and Streep, Kidman, Lewis and Harris are, without a doubt, four of the greatest living actors.  When the film was finished, I couldn't move.  I sat and stared at the blank screen, and I can't remember when, if ever, that's happened with another film.<br />The DVD extras are very nice, and include a documentary on Virginia Woolf and interviews with the three amazing women stars, but to be honest, I had to watch those later because I was so blown away by the film itself that I couldn't concentrate on the extra features afterwards.  I think it's nearly miraculous that every aspect of this film -- the writing, directing, cinematography, and every single actor -- is excellent.  I think it's a masterpiece.\nDon't waste another minute...\nA Prairie Home Companion\nWoody Harrelson  (Actor),     Tommy Lee Jones  (Actor),     Robert Altman  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Prairie Home Companion, A (DVD)', 'From legendary director Robert Altman comes his final film, the deeply moving and comedic A Prairie Home Companion. Based on Garrison Keillor\\'s wildly popular radio program of the same name, Altman invites audiences to the fictional \"closing night\" of the fabled show. As the rain pours down on a blustery Minnesota evening, the cast tapes their final performance, while waiting for the Texas businessman who has bought the theater to arrive and shut them down. Backstage the colorful ensemble says their goodbyes and confront old conflicts, while onstage a sold-out audience enjoys the wit and musical whimsy for which the show is famous. But when a mysterious woman appears offstage introducing herself as the angel Asphodel, it becomes apparent that this will be no ordinary closing night.', ']]>']\n{'Genre': 'Drama, Comedy, Science Fiction', 'Format': 'NTSC, Closed-captioned, Color, Full Screen', 'Contributor': 'Tony Judge, Wren Arthur, Meryl Streep, Woody Harrelson, Maya Rudolph, Lily Tomlin, John Penotti, Robert Altman, Garrison Keillor, L.Q. Jones, Joshua Astrachan, Fisher Stevens, Bill Pohlad, Virginia Madsen, George Sheanshang, Kevin Kline, David Levy, Tommy Lee Jones, Lindsay Lohan, John C. Reilly, Ken LazebnikTony Judge, Wren Arthur, Meryl Streep, Woody Harrelson, Maya Rudolph, Lily Tomlin, John Penotti, Robert Altman, Garrison Keillor, L.Q. Jones, Joshua Astrachan, Fisher Stevens, Bill Pohlad, Virginia Madsen, George Sheanshang, Kevin Kline, David Levy, Tommy Lee Jones, L…   See more', 'Initial release date': '2007-01-16', 'Language': 'English (Dolby Digital 2.0 Surround), Unqualified, English (Dolby Digital 5.1)', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': 'N10541', 'Director': 'Robert Altman', 'Media Format': 'NTSC, Closed-captioned, Color, Full Screen', 'Run time': '1 hour and 46 minutes', 'Release date': 'January 16, 2007', 'Actors': 'Woody Harrelson, Tommy Lee Jones, Garrison Keillor, Kevin Kline, Lindsay Lohan', 'Subtitles': 'Spanish, English', 'Producers': 'Robert Altman, John Penotti, Wren Arthur, Bill Pohlad, George Sheanshang', 'Studio': 'Studio Distribution Services', 'Writers': 'Garrison Keillor, Ken Lazebnik', 'Number of discs': '1'}\nSeeing all the bad reviews makes me smile a little, and would probably make Robert Altman smile as well. No, some folks just don't get him, but we've filled museums with the works of misunderstood geniuses, and this film is a fitting farewell from one such artist.<br /><br />Altman's signature overlapping dialogue seems different here than in any other film. Unlike the nervous energy of MASH, or the comic surrealism of Popeye, or the self-involved banter in Gosford Park, these conversations are so natural and intimate and authentic that they appear ad-libbed, although Tomlin has confirmed since that they were not. The dressing-rooms scenes between Streep & Tomlin are amazing. No one can bring a viewer into the moment like Altman could. This is Tomlin's best work since Nashville. Even when she's sharing the shot with Streep, one of our greatest actresses, I couldn't take my eyes off Lily Tomlin. She deserves an Oscar nomination for this role.<br /><br />I'm an Altman lover, not an expert, but I can't remember another film in which he used light so beautifully. He lights the film with an amber glow and often the low reflection of footlights, much like Chuck Akers, in anticipation of a romantic interlude, lovingly fills his dressing room with candlelight. Altman creates a look that conveys the intimate, warm nostalgia created by Keillor in his radio broadcasts.<br /><br />Of course, Keillor's material is brilliant, whether or not you like everything about his screenplay. The film is no more political nor sacrilegious nor racy than the radio show, if you pay attention to the radio broadcasts. Might I have done some things differently? Sure, but I probably would have painted eyebrows on the Mona Lisa.<br /><br />Altman lovers will treasure this beautiful gem. Anyone else should understand that you won't be spoon-fed a formulaic film, and if you can put aside any expectations and simply let this master filmmaker tell you his story, paint you his picture, you'll see why we love him so much.\nWe'll miss you, Mr. Altman.\nAlien Anthology (Alien / Aliens / Alien 3 / Alien: Resurrection) [Blu-ray]\nSigourney Weaver  (Actor),     Tom Skerritt  (Actor),     Ridley Scott  (Director),     David Fincher  (Director)    &                   1                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Product Description', 'Brace yourself for a whole new breed of Blu ray: Four powerful films...eight thrilling versions...in dazzling, terrifying, high def clarity with the purest digital sound on the planet. Two bonus dics and over 65 hours of archival and never before seen content, including the totally immersive MU TH UR mode feature, makes this definitive', 'Alien', 'collection!', 'Amazon.com', 'Review of', 'Alien', 'A landmark of science fiction and horror, Alien arrived in 1979 between Star Wars and The Empire Strikes Back as a stylishly malevolent alternative to George Lucas\\'s space fantasy. Partially inspired by 1958\\'s It! The Terror from Beyond Space, this instant classic set a tone of its own, offering richly detailed sets, ominous atmosphere, relentless suspense, and a flawless ensemble cast as the crew of the space freighter Nostromo, who fall prey to a vicious creature (designed by Swiss artist H.R. Giger) that had gestated inside one of the ill-fated crew members. In a star-making role, Sigourney Weaver excels as sole survivor Ripley, becoming the screen\\'s most popular heroine in a lucrative movie franchise. To measure the film\\'s success, one need only recall the many images that have been burned into our collective psyche, including the \"facehugger,\" the \"chestburster,\" and Ripley\\'s climactic encounter with the full-grown monster. Impeccably directed by Ridley Scott, Alien is one of the cinema\\'s most unforgettable nightmares.', '--Jeff Shannon', 'Review of', 'Aliens', 'Aliens is one of the few cases of a sequel that far surpassed the original. Sigourney Weaver returns as Ripley, who awakens on Earth only to discover that she has been hibernating in space so long that everyone she knows is dead. Then she is talked into traveling (along with a squad of Marines) to a planet under assault by the same aliens that nearly killed her. Once she gets there, she finds a lost little girl who triggers her maternal instincts--and she discovers that the company has once again double-crossed her, in hopes of capturing one of the aliens to study as a military weapon. Directed and written by James Cameron, this is one of the most intensely exciting (not to mention intensely frightening) action films ever, with a large ensemble cast that includes Bill Paxton, Lance Henriksen, Paul Reiser, and Michael Biehn. Weaver defined the action woman in this film and walked away with an Oscar nomination for her trouble.', '--Marshall Fine', 'Review of', 'Alien 3', 'The least successful film in this series was directed by stylemaster (and content-underachiever) David Fincher. Ripley, the only survivor of her past mission, awakens on a prison planet in the far corners of the solar system. As she tries to recover, she realizes that not only has an alien gotten loose on the planet, the alien has implanted one of its own within her. As she battles the prison authorities (and is aided by the prisoners) in trying to kill the alien, she must also cope with a distinctly shortened lifespan that awaits her. But the striking imagery makes for muddled action and the script confuses it further. The ending looks startling but it takes a long time--and a not particularly satisfying journey--to get there.', '--Marshall Fine', 'Review of', 'Alien Resurrection', \"Perhaps these films are like the Star Trek movies: The even-numbered episodes are the best ones. Certainly this film (directed by French stylist Jean-Pierre Jeunet) is an improvement over Alien 3, with a script that breathes exciting new life into the franchise. This chapter is set even further in the future, where scientists on a space colony have cloned both the alien and Ripley (Sigourney Weaver), who died in Alien 3; in doing so, however, they've mixed alien DNA with Ripley's human chromosomes, which gives Ripley surprising power (and a bad attitude). A band of smugglers comes aboard only to discover the new race of aliens--and when the multi-mouthed melonheads get loose, no place is safe. But, on the plus side, they have Ripley as a guide to help them get out. Winona Ryder is on hand as the smugglers' most unlikely crew member (with a secret of her own), but this one is Sigourney's all the way.\", '--Marshall Fine']\n{'Genre': 'Horror/Things That Go Bump/Monsters, Science Fiction & Fantasy', 'Format': 'Multiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen   See more', 'Contributor': 'Tom Skerritt, David Fincher, Ridley Scott, John Hurt, James Cameron, Winona Ryder, Sigourney Weaver, Jean-Pierre Jeunet, Lance HenriksenTom Skerritt, David Fincher, Ridley Scott, John Hurt, James Cameron, Winona Ryder, Sigourney Weaver, Jean-Pierre Jeunet, Lance Henriksen   See more', 'Language': 'German (DTS 5.1), French (DTS 5.1), Spanish (Dolby Digital 5.1), English (Dolby TrueHD)', 'Runtime': '7 hours and 57 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '1 x 5.6 x 6.9 inches; 14.4 Ounces', 'Item model number': 'Alien Ant', 'Director': 'Ridley Scott, David Fincher, James Cameron, Jean-Pierre Jeunet', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Box set, Dolby, DTS Surround Sound, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '7 hours and 57 minutes', 'Release date': 'October 26, 2010', 'Actors': 'Sigourney Weaver, Tom Skerritt, John Hurt, Lance Henriksen, Winona Ryder', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, French, German, Portuguese, Spanish', 'Studio': '20th Century Fox Home Entertainment', 'Number of discs': '6'}\nI read a lot of reviews about transfer quality and things like that, but if the picture quality is good, that's usually good enough for me.  Maybe it's because I've seen these movies, especially the classic Alien, so many times that I noticed the difference, but the Blu-ray version of this film is like seeing it for the first time.  The film is shadowy, lots of darkness, and there are many shots that we've never seen clearly before.  I've never seen, or at least noticed, such a difference between a DVD and a Blu-ray disc.  That alone was worth the price of this anthology.\nAlien on Blu-ray.  Like Seeing it for the First Time.",
  "profile": "**User Summary:**\n\nThis user has a profound appreciation for emotionally resonant cinema, particularly engaged with films that explore complex themes and character struggles. Their recent purchase of a notable anthology underscores a preference for classic sci-fi and horror, reflecting a deep appreciation for iconic films renowned for their atmospheric tension and character depth. They admire the craftsmanship of acclaimed directors, such as Ridley Scott, and are drawn to nuanced storytelling that balances drama with elements of horror and suspense.\n\nThe user's tendency to analyze the quality of film presentations indicates a discerning nature, valuing high-definition clarity and the immersive experience that enhanced formats provide. They are particularly receptive to changes in cinematic techniques and visual storytelling, further reinforcing their quest for quality in film.\n\nMoreover, their engagement with behind-the-scenes insights complements their artistic understanding and enhances their viewing experience, while they consistently advocate for films that may be underappreciated by mainstream audiences. The combination of their refined tastes and appreciation for strong production elements positions them as a sophisticated viewer who cherishes the seamless collaboration among talented filmmakers and actors, favoring character-driven narratives that evoke strong emotional responses. This user continues to exemplify a dedication to both classic and contemporary cinematic works that showcase exceptional storytelling and craftsmanship.",
  "metrics": {
    "rouge1_f": 0.08316008316008316,
    "rouge2_f": 0.0048543689320388345,
    "rougeL_f": 0.04435204435204435,
    "meteor": 0.022054190296156267,
    "bleu1": 3.696274895029381e-07,
    "bleu2": 1.352619682831983e-07,
    "bleu3": 4.844477819311176e-08,
    "bleu4": 1.3724618022989989e-08,
    "bertscore_precision": 0.3382437229156494,
    "bertscore_recall": 0.5050277709960938,
    "bertscore_f1": 0.40514227747917175
  }
}