{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mighty Mouse: The New Adventures - The Complete Series\nReview Date: 2020/01/04\nStore: Patrick Pinney  (Actor),     Mona Marshall  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Paramount Home Entertainment, Boxed Sets\nProduct Description: ['Product Description', \"In this revival of the classic Mighty Mouse cartoon, we follow the humorous, satirical adventures of Mike Mouse (a worker at Pearl Pureheart's factory) in this Saturday Morning cartoon by Ralph Bakshi.\", 'Amazon.com', 'Saturday-morning cartoons had been in a rut, nothing but superheroes, toys, and other franchise properties, and certainly little that was flat-out funny. In the nick of time (1987 to be exact), along came', 'Mighty Mouse: The New Adventures', \"to save the day, and, as the theme song promised, things wouldn't be like they'd been before. Born in creative anarchy,\", 'Mighty Mouse', 'brought a Looney Tunes sensibility back to Saturday mornings, with cartoons that, like their Warner Bros. predecessors, seem designed by the animators to first and foremost amuse themselves, as witness \"Don\\'t Touch That Dial,\" a \"Duck Amuck\"-inspired cartoon in which Mighty Mouse finds himself inserted into parodic takes on', 'The Flintstones', 'and', 'The Jetsons', ',', 'Scooby-Doo!', ', and', 'Rocky and Bullwinkle', '(think Sylvester Stallone instead of flying squirrel).', 'Mighty Mouse', \"has cult classic drawn all over it. It was produced by Ralph Bakshi, who began his career in children's animation before making the infamous X-rated\", 'Fritz the Cat', 'as well as', 'Wizards', ',', 'Lord of the Rings', ', and the epic', 'American Pop', '. He recruited John Kricfalusi (who would later create the kindred-spirited', 'Ren & Stimpy', ') as well as young (and cheap) talent just out of college, among them Bruce Timm (', 'Batman: The Animated Series', ', Andrew Stanton (', 'Wall-E', '), and Jim Reardon (', 'The Simpsons', '). As someone observes in the excellent series retrospective included as a special feature, \"I don\\'t think you could afford to put all those names in the same room.\" Like the best of Warner Bros. and Jay Ward, most of the cartoons have cross-generational appeal, with silliness for the kids, and sly, subversive satire and pop culture references for adults. The series was a rebuke to the \"electronic pabulum\" television dished out. So, of course, after a mere two seasons, it was canceled after a controversy blossomed over the cartoon \"The Littlest Tramp,\" in which an image of Mighty Mouse sniffing a crushed flower was outrageously misrepresented by a fundamentalist group to be a cocaine gag. That cartoon is included in this set. As a treat for baby boomers who grew up with the original, three vintage', 'Mighty Mouse', 'cartoons are also included as bonuses. The best is the operatic \"Gypsy Life.\"', 'Mighty Mouse: The New Adventures', 'ushered in a new golden age of television animation. Its energy and artistic integrity are undimmed. What strength, what power, what a mouse!', '--Donald Liebenson']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Animation/Television, Kids & Family/Television', 'Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Contributor': 'Mona Marshall, Maggie Roswell, Dana Hill, Michael Pataki, Patrick Pinney', 'Language': 'Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '6632084', 'Media Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Run time': '7 hours and 35 minutes', 'Release date': 'February 4, 2014', 'Actors': 'Patrick Pinney, Mona Marshall, Maggie Roswell, Dana Hill, Michael Pataki', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '3'}\nReview Text: My 70 y/o Dad has raved about classic<br />Mighty Mouse cartoons FOREVER! I finally I got the hint and bought this DVD for Christmas. It warms my heart to see him so happy and I am truly grateful! Thank you!\nReview Title: My 70 yr old Dad loves Mighty Mouse!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Color Purple (Two-Disc Special Edition)\nDanny Glover  (Actor),     Whoopi Goldberg  (Actor),     Steven Spielberg  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['The Color Purple (Widescreen Special Edition)']\n{'Genre': 'Foreign', 'Format': \"Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, Dubbed, NTSC, Director's CutMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, Dubbed, NTSC, Director's Cut   See more\", 'Contributor': 'Rae Dawn Chong, Steven Spielberg, Bennet Guillory, Dana Ivey, Willard E. Pugh, Desreta Jackson, Danny Glover, Whoopi Goldberg, Leonard Jackson, Akosua Busia, Menno Meyjes, Margaret Avery, Oprah Winfrey, Alice Walker, Adolph CaesarRae Dawn Chong, Steven Spielberg, Bennet Guillory, Dana Ivey, Willard E. Pugh, Desreta Jackson, Danny Glover, Whoopi Goldberg, Leonard Jackson, Akosua Busia, Menno Meyjes, Margaret Avery, Oprah Winfrey, Alice Walker, Adolph Caesar   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Stereo)', 'Runtime': '2 hours and 34 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 6.4 Ounces', 'Director': 'Steven Spielberg', 'Media Format': \"Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Special Edition, Subtitled, Widescreen, Dubbed, NTSC, Director's Cut\", 'Run time': '2 hours and 34 minutes', 'Release date': 'February 18, 2003', 'Actors': 'Danny Glover, Whoopi Goldberg, Oprah Winfrey, Margaret Avery, Willard E. Pugh', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Alice Walker, Menno Meyjes', 'Number of discs': '2'}\nAwesome, classic movie! Thank you!\ngreat gift for my mom.\nGraffiti Bridge\nPrince  (Actor, Director, Writer),     Morris Day  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Music Artists, Prince\n['Product Description', 'Graffiti Bridge (DVD)', 'In a sequel of sorts to Purple Rain, the artist formerly known as Princestruggles musically with Morris Day for control of the nightclub thatthe two co-own in this dramatic musical fantasy. There is the power offaith--in oneself and in a higher power. There is the power of love.There is the never-ending struggle between good and bad. And there isthe power of music. Graffiti Bridge.', ']]>', 'Amazon.com', \"A sort of fairy-tale sequel to Prince's enormously successful\", 'Purple Rain', \", 1990's\", 'Graffiti Bridge', \"finds his purple highness not only singing and acting, but writing and directing, too. His performance suffers on all fronts. The film isn't a disaster, but it's safe to predict completist fans will make up most of its viewers. In the earlier film, Prince (known as the Kid) was fighting for his place on stage. This time he's fighting to keep his club safe from the money-grubbing hands of his musical rival, the Time's Morris Day, now a nightclub mogul. Day embodies spiritual, sexual, and economic corruption, while the Kid stands for salvation through music and a more redemptive form of lust.\", 'The graffiti bridge conceit--a metaphor for a place of rejuvenation and artistic inspiration--is intriguing. Unfortunately, the bridge itself is merely a prop in a Paisley Park soundstage. Where', 'Purple Rain', 'was a movie that set new standards for lensing musical performances,', 'Graffiti Bridge', 'feels like a music video masquerading as a movie. Lucky for us, Prince cast the honey-voiced poet and performer Ingrid Chavez as Aura, part muse and part angel to both Day and the Kid. Her beauty and charisma ignite every frame she graces.', '--Michael Mikesell', 'Set Contains:', 'Bonus features are minimal but apt: a surprisingly good movie trailer and a quartet of relevant music videos, three drawn from the film and one, \"Question of U,\" a characteristically electric concert clip.', '--Michael Mikesell', 'See more']\n{'Genre': 'Musicals & Performing Arts/Musicals, Drama', 'Format': 'Closed-captioned, Color, Dolby, NTSC, Widescreen, Subtitled, Surround Sound', 'Contributor': 'Phillip C, Morris Day, Damon Dickson, Levi Seacer Jr., Kirk Johnson, Ingrid Chavez, Miko Weaver, Prince, Jerome Benton, The Time, Rosie Gaines, Michael Bland, Tony MosleyPhillip C, Morris Day, Damon Dickson, Levi Seacer Jr., Kirk Johnson, Ingrid Chavez, Miko Weaver, Prince, Jerome Benton, The Time, Rosie Gaines, Michael Bland, Tony Mosley  See more', 'Language': 'Unqualified, English (Dolby Digital 4.0)', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 0.01 Ounces', 'Director': 'Prince', 'Media Format': 'Closed-captioned, Color, Dolby, NTSC, Widescreen, Subtitled, Surround Sound', 'Run time': '1 hour and 30 minutes', 'Release date': 'February 8, 2005', 'Actors': 'Prince, Morris Day, Jerome Benton, Ingrid Chavez, The Time', 'Subtitles': 'Spanish, English, French', 'Studio': 'WarnerBrothers', 'Writers': 'Prince', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI, along with the rest of the world was devastated when his Royal Purple Badness, Prince Rogers Nelson passed away on 4.21.16 so I wanted to have his movies on dvd ( i had them all on vhs. Haha) and it was just what I needed. This isnt the greatest film but I enjoy it because it's Prince-what can i say?<br /><br />It was nice to see him reprise his roll as The Kid but it is not as visually appealing and sexy or dramatic as Purple Rain or funny and cinematic as Under the Cherry Moon.\nPrince can do no wrong.\nPurple Rain (DVD)\nPrince  (Actor),     Apollonia Kotero  (Actor),     Albert Magnoli  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Product Description', 'Purple Rain (DVD)', 'Rock star Prince makes a spectacular feature film debut in this highly autobiographical blockbuster that won both an Oscar and a Grammy award. Headstrong, vulnerable young musician The Kid (Prince) struggles with his own inner demons and with his alcoholic father who beats his mother. But the madness infects his music, fueling a sound that transforms the struggling, young rocker into a star.', ']]>', 'Amazon.com', \"When Prince's dazzling and dynamic\", 'Purple Rain', '(movie and soundtrack album) and the hypnotic hit single \"When Doves Cry\" exploded onto the pop-culture scene in 1984, it seemed there was nothing the purple one couldn\\'t do. The film is basically a feature-length music video, but no musician has ever had a better big-screen showcase for his many talents. The plot is really just a theme (about the son of an abusive father struggling not to continue the pattern) upon which to hang some of Prince\\'s most dazzling songs (including \"Let\\'s Go Crazy\" and the title tune), and some sizzling live-concert numbers. Apollonia Kotero is ravishing as the romantic interest, and Morris Day and the Time provide some terrific musical competition.', 'Purple Rain', \"is an essential artifact of the mid-'80s pop Zeitgeist. Prince took home an Oscar for the song score.\", '--Jim Emerson']\n{'Genre': 'Musicals & Performing Arts/Musicals, Drama', 'Format': 'NTSC, Subtitled', 'Contributor': 'Apollonia Kotero, Steven Fargnoli, Clarence Williams III, Prince, Olga Karlatos, Albert Magnoli, Jerome J. Benton, William Blinn, Morris Day, Joseph Ruffalo, Robert CavalloApollonia Kotero, Steven Fargnoli, Clarence Williams III, Prince, Olga Karlatos, Albert Magnoli, Jerome J. Benton, William Blinn, Morris Day, Joseph Ruffalo, Robert Cavallo   See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '1 hour and 51 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 1.6 Ounces', 'Item model number': 'MFR085391139829#VG', 'Director': 'Albert Magnoli', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 51 minutes', 'Release date': 'February 3, 2004', 'Actors': 'Prince, Apollonia Kotero, Morris Day, Olga Karlatos, Clarence Williams III', 'Subtitles': 'English, French, Spanish', 'Producers': 'Robert Cavallo, Joseph Ruffalo, Steven Fargnoli', 'Studio': 'WarnerBrothers', 'Writers': 'Albert Magnoli, William Blinn', 'Country of Origin': 'USA', 'Number of discs': '1'}\nPurple Rain is a cult classic and is the best Prince movie. It never gets old and still moves and resonats after all of these years.<br />The acting was so good that you really believed that this was Prince's biography. Althought it was loosely based on his life, fact or fiction, Purple Rain will always be one of the greatest rock movies ever made. The wardrobe, the cinematography, the music, and the Minneapolis backdrop and culture of that time all created the perfect purple storm of musical genius. Rest in Power Beautiful One!\nPurple Rain is a cult classic!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Scott Montoya'], 'Producers': ['Garrett Abdo'], 'Starring': ['Rickey Smiley'], 'Studio': ['Entertainment One']}\nFunniest stand up EVER! Rickey Smiley is so silly and I love how he laughs at his own jokes! I never tire of watching this special and was glad it was available on Prime.\nOne of my all-time faves! Rickey Smiley is KING!\n{'Content advisory': ['Violence', 'frightening scenes', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nigel Bach'], 'Producers': ['Nigel Bach'], 'Starring': ['Nigel Bach'], 'Studio': ['Bach Studios']}\nIn the same vein as the docu-horror Blair Witch, Paranormal Activity & other single camera horror movies, this does not disappoint. The home security surveillance cameras with the motion detector sensors were the real stars of the film. It has several &#34;oh sh*t&#34; moments, coupled with the typical &#34;wth is he doing?&#34; Or &#34;just leave the house&#34; moments. This movie is a good watch and creepy.\nDocu-Horror Realness\n{'Subtitles': ['None available'], 'Directors': ['Isaac Rodriguez'], 'Producers': ['Cynthia Bergen'], 'Starring': ['Emanuel Bermudez', 'Billy Necessary'], 'Studio': ['No Sleep']}\nOk...it IS my fault that I didnt pay attention to the movie's running time. When i saw the credits, i thought, omg! Did i accidentally skip to the end? Smh. Not sure about the appeal of short films, but I'll pass.\nReally?\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Stephen Cognetti'], 'Producers': ['Joe Bandelli'], 'Starring': ['Kristin Michelle Taylor', 'Theodore Bouloukos', 'Jeb Kreager'], 'Studio': ['AMC Plus Horror']}\nAny movie that has be paranoid and turning on lights at night has gotten to me! I totally underestimated this movie, it was pretty good! I love the 'found footage genre', as it adds to the believability and terror of it all. The appeal of the haunted house and trying to figure out what is real and what isn't created the perfect setting for this movie plot. This movie was very scary!  I'm pretty sure I slept with one eye open all night.\nSurprisingly terrifying!\nPopeye The Sailor Man (The Animated Classics Collection)\nJack Mercer  (Actor),     Mae Questel  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n[\"This 2-disc set contains 34 Popeye cartoons from the 'classic' Fleischer and Famous studios period. Popeye first appeared in a 1929 daily comic strip called Thimble Theatre by Elsie Segar and caught the country by storm. Popeye had nothing but his wits, a funny way of talking and a rush on Olive Oyl. His fame eventually caught the attention of the Max Fleischer Studio and by 1933 Popeye had made his big screen debut in a Betty Boop short called 'Popeye the Sailor and one of the world's most cartoon popular heroes was born.\"]\n{'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.48 x 5.39 x 0.63 inches; 3.49 Ounces', 'Run time': '240 minutes', 'Actors': 'Jack Mercer, Mae Questel', 'Number of discs': '2'}\nFor years my father has raved about classic Popeye cartoons, along with Betty boop and mighty mouse. I finally got the hint and bought several Popeye DVDs for Christmas and my dad loves them. The quality is great and viewers have the option of listening to the commentary with the episode. It took us a minute to figure out how to turn off the commentary, but it's a nice feature. It warmed my heart to witness my Dad return to his childhood. Thank you!\nThis took my Dad back to his childhood.\nBetty Boop Cartoons V.2\nAnimated  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Comedy\n['###############################################################################################################################################################################################################################################################']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Black & White, Color, NTSC', 'Contributor': 'Animated', 'Language': 'English', 'Runtime': '1 hour and 45 minutes', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Media Format': 'Multiple Formats, Black & White, Color, NTSC', 'Run time': '1 hour and 45 minutes', 'Release date': 'May 3, 2003', 'Actors': 'Animated', 'Studio': 'Echo Bridge Home Entertainment', 'Number of discs': '1'}\nFor years my 70 year old father has raved about classic Popeye cartoons, along with Betty boop and mighty mouse, and it never occurred to me to buy these DVDs for Christmas. Well, I finally got the hint and bought this DVD for my dad and he loves them!!! The quality is great and this brought him so much joy! Thank you!\nMy Dad loves Betty Boob!\nPopeye The Sailor: 1933-1938 Vol. 1\nRated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['\"I yam what I yam,\" Popeye says. And what he yam is the greatest swabbie ever to sail the cartoon seas, a savvy old salt with outsized forearms and an even larger sense of fair play. Step aboard, mates, for the bestest with the mostest: 60 original (and uproarious) theatrical shorts from the innovative Max Fleischer Cartoon Studio. Here, you\\'ll find spindly Olive Oyl, burger opportunist Wimpy, lil\\' Swee\\'pea, brooding Bluto and even a pair of rare, full-color, two-reel extravaganzas that received top billing in some movie houses. And you\\'ll find Popeye in all his muttering, spinach-chomping, Bluto-bashing, crowd-pleasing greatness. He yam what he yam. He\\'s Popeye the Sailor Man. Toot-Toot!']\n{'Genre': 'Kids & Family, Animation', 'Format': 'NTSC, Subtitled', 'Language': 'English', 'Runtime': '7 hours and 3 minutes', 'Studio': 'Warner Archive', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.5 Ounces', 'Media Format': 'NTSC, Subtitled', 'Run time': '7 hours and 3 minutes', 'Release date': 'January 11, 2020', 'Country of Origin': 'USA', 'Number of discs': '4'}\nMy 70 y/o Dad has raved about classic Popeye cartoons FOREVER! I finally I got the hint and bought several series of Popeye DVDs for my dad for Christmas and he loves them. They arrived just in time.  The quality is great and I love that viewers have the option of listening to the commentary with the episode. It took us a minute to figure out how to turn off the commentary, but it's nice to have that feature available. My dad was like a little kid watching these Popeye cartoons and it really warmed my heart to see him so happy! Thank you!\nMy 70 year old Dad LOVES these!\nMighty Mouse: The New Adventures - The Complete Series\nPatrick Pinney  (Actor),     Mona Marshall  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Boxed Sets\n['Product Description', \"In this revival of the classic Mighty Mouse cartoon, we follow the humorous, satirical adventures of Mike Mouse (a worker at Pearl Pureheart's factory) in this Saturday Morning cartoon by Ralph Bakshi.\", 'Amazon.com', 'Saturday-morning cartoons had been in a rut, nothing but superheroes, toys, and other franchise properties, and certainly little that was flat-out funny. In the nick of time (1987 to be exact), along came', 'Mighty Mouse: The New Adventures', \"to save the day, and, as the theme song promised, things wouldn't be like they'd been before. Born in creative anarchy,\", 'Mighty Mouse', 'brought a Looney Tunes sensibility back to Saturday mornings, with cartoons that, like their Warner Bros. predecessors, seem designed by the animators to first and foremost amuse themselves, as witness \"Don\\'t Touch That Dial,\" a \"Duck Amuck\"-inspired cartoon in which Mighty Mouse finds himself inserted into parodic takes on', 'The Flintstones', 'and', 'The Jetsons', ',', 'Scooby-Doo!', ', and', 'Rocky and Bullwinkle', '(think Sylvester Stallone instead of flying squirrel).', 'Mighty Mouse', \"has cult classic drawn all over it. It was produced by Ralph Bakshi, who began his career in children's animation before making the infamous X-rated\", 'Fritz the Cat', 'as well as', 'Wizards', ',', 'Lord of the Rings', ', and the epic', 'American Pop', '. He recruited John Kricfalusi (who would later create the kindred-spirited', 'Ren & Stimpy', ') as well as young (and cheap) talent just out of college, among them Bruce Timm (', 'Batman: The Animated Series', ', Andrew Stanton (', 'Wall-E', '), and Jim Reardon (', 'The Simpsons', '). As someone observes in the excellent series retrospective included as a special feature, \"I don\\'t think you could afford to put all those names in the same room.\" Like the best of Warner Bros. and Jay Ward, most of the cartoons have cross-generational appeal, with silliness for the kids, and sly, subversive satire and pop culture references for adults. The series was a rebuke to the \"electronic pabulum\" television dished out. So, of course, after a mere two seasons, it was canceled after a controversy blossomed over the cartoon \"The Littlest Tramp,\" in which an image of Mighty Mouse sniffing a crushed flower was outrageously misrepresented by a fundamentalist group to be a cocaine gag. That cartoon is included in this set. As a treat for baby boomers who grew up with the original, three vintage', 'Mighty Mouse', 'cartoons are also included as bonuses. The best is the operatic \"Gypsy Life.\"', 'Mighty Mouse: The New Adventures', 'ushered in a new golden age of television animation. Its energy and artistic integrity are undimmed. What strength, what power, what a mouse!', '--Donald Liebenson']\n{'Genre': 'Animation/Television, Kids & Family/Television', 'Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Contributor': 'Mona Marshall, Maggie Roswell, Dana Hill, Michael Pataki, Patrick Pinney', 'Language': 'Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '6632084', 'Media Format': 'Multiple Formats, Animated, Box set, Color, Full Screen, NTSC', 'Run time': '7 hours and 35 minutes', 'Release date': 'February 4, 2014', 'Actors': 'Patrick Pinney, Mona Marshall, Maggie Roswell, Dana Hill, Michael Pataki', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '3'}\nMy 70 y/o Dad has raved about classic<br />Mighty Mouse cartoons FOREVER! I finally I got the hint and bought this DVD for Christmas. It warms my heart to see him so happy and I am truly grateful! Thank you!\nMy 70 yr old Dad loves Mighty Mouse!",
  "profile": "**Updated User Profile Summary:**\n\n- **Movie Preferences**: The user has a strong appreciation for classic animated films, particularly those that have cultural themes and humor. Their love for nostalgic content is enhanced by a focus on family-oriented shows that bring joy to older family members.\n\n- **Genres**: Enjoys musical dramas, comedy specials, horror documentaries, and animated series, showcasing a blend of comedic storytelling and immersive humor while also nurturing family bonding through media.\n\n- **Key Influencers**: Influenced by prominent figures in animation and comedy, highlighting their interest in relatable narratives with universal appeal across generations.\n\n- **Format**: Prefers well-rounded viewing experiences with formats that allow for subtitles and commentary, indicating a thoughtful and engaged approach to media consumption.\n\n- **Social Connections**: Places high value on shared viewing experiences with family, having recently focused on acquiring animated classics that delight loved ones, especially older family members.\n\n- **Rating Behavior**: Shows a keen interest in storytelling that fosters emotional connections, prioritizing nostalgic and heartwarming narratives that resonate with family traditions.\n\n- **Overall Engagement**: Actively shares meaningful reviews and recommendations, exemplifying a passion for classic storytelling that fosters cherished memories through family entertainment. Their recent interactions underscore a commitment to enriching family experiences through timeless animated content.",
  "metrics": {
    "rouge1_f": 0.06060606060606061,
    "rouge2_f": 0.002450229709035222,
    "rougeL_f": 0.032445668809305175,
    "meteor": 0.016676128299744537,
    "bleu1": 2.0262934578350053e-08,
    "bleu2": 4.682173545055524e-09,
    "bleu3": 7.808915306518358e-10,
    "bleu4": 3.1921075214955673e-10,
    "bertscore_precision": 0.3416626453399658,
    "bertscore_recall": 0.48486489057540894,
    "bertscore_f1": 0.4008583128452301
  }
}