{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/12/23\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Henry Madden', 'George Chialtas', 'Allan Jacobsen', 'Gary Conrad', 'Kuni Tomita', 'Sherie Pollack', 'Matt Engstrom'], 'Producers': ['Valerie Walsh', 'Chris Gifford', 'Eric Weiner']}\nReview Text: When my granddaughter visits all she want to see it this, its great!\nReview Title: its great!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Rizzoli & Isles: Season 3\nAngie Harmon  (Actor),     Sasha Alexander  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Rizzoli & Isles: The Complete Third Season (DVD)', 'Angie Harmon and Sasha Alexander are back on the case as Rizzoli & Isles continues for a third explosive season. As the chart-busting second season came to a close, Jane shot Maura’s estranged father, crime boss Paddy Doyle (guest star John Doman), as he tried to defend Maura against an assailant — an incident which has driven a deep wedge between the two friends and colleagues. Jane and Maura will work hard to set aside their differences as they investigate a number of complex and troublesome crimes, including the murder of a female college student, a killer who has turned the transit system into his personal hunting ground and the brutal murder of two young homeless veterans. Brian Goodman joins the cast this season as a series regular, starring as Lieutenant Detective Sean Cavanaugh, whose knowledge of the hardscrabble back alleys of Boston and history as a detective make him the perfect choice to head the Homicide unit.', ']]>', 'Amazon.com', \"Talk about hitting the ground running: as this third season of TNT's\", 'Rizzoli & Isles', '(with 15 episodes, plus bonus material, on three discs) opens, Boston detective Jane Rizzoli (Angie Harmon) has just shot the father of her best friend, forensic pathologist Dr. Maura Isles (Sasha Alexander), who had only recently discovered that said dad is a notorious mob boss suspected of multiple murders. The shooting itself took place at the end of the previous season, but the ripple effect is strong this time out, as the usual banter between the brilliant but somewhat clueless Maura (Rizzoli calls her \"the dumbest genius I know\") and the more roughhewn and street-wise Jane takes on a decidedly nasty, if still amusing, edge for the first couple of episodes (Maura: \"Drive straight past the coniferous spruce.\" Jane: \"Sure, maybe I\\'ll pass the hemlock, too\"). The repartee continues throughout the season, as the pair trade witty bons mots while they and the other cops are solving various murder cases, some of them gripping (human trafficking, a serial killer) and others laughably absurd (two brothers in a rock group kill their third bro, who\\'s also a member, thinking it will boost the band\\'s record sales; an ex-Army Ranger turned yoga guru garrotes a young environmentalist who was on to his sinister oil-fracking scheme). Looming large over all of these scenarios are Rizzoli and Isles\\' crazily tangled family dramas. Aside from her gangster father, Maura has a birth mother (a doctor played by Sharon Lawrence) who thinks she\\'s dead and doesn\\'t react well when informed otherwise. Then there\\'s Jane\\'s dad (a cameo by Chazz Palminteri), who wants estranged wife Angela (Lorraine Bracco in a recurring role) to grant him an annulment so he can marry a much younger woman--who just happens to have had an affair with Tommy (Colin Egglesfield), Jane\\'s brother. Throw in the two leads\\' various romantic entanglements, and you\\'ve got a show that\\'s as much supermarket tabloid as cop drama. So', 'Rizzoli & Isles', \"isn't as hard core as, say,\", 'Southland', \". That's cool; all it's trying to be is entertaining, and on that level, this show is a winner.\", '--Sam Graham']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Brian Goodman, Bill Haber, Bruce McGill, Michael Katleman, Jordan Bridges, Angie Harmon, Janet Tamaro, Tess Gerritsen, Lee Thompson Young, Sasha Alexander, Lorraine BraccoBrian Goodman, Bill Haber, Bruce McGill, Michael Katleman, Jordan Bridges, Angie Harmon, Janet Tamaro, Tess Gerritsen, Lee Thompson Young, Sasha Alexander, Lorraine Bracco  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '26411314', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '10 hours and 45 minutes', 'Release date': 'June 11, 2013', 'Actors': 'Angie Harmon, Sasha Alexander, Jordan Bridges, Lee Thompson Young, Brian Goodman', 'Subtitles': 'French, Thai', 'Producers': 'Janet Tamaro, Bill Haber, Michael Katleman', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nThis is one of my top summer shows love the fact that I can order the dvd for my library. Received it on time and packaging was excellent.\nMy Fav\nCovert Affairs: Season 3\nPiper Perabo  (Actor),     Christopher Gorham  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['Everything changes for savvy CIA operative Annie Walker (Piper Perabo, Looper) in season three of the hit series Covert Affairs. Reassigned to a new and even more covert division of the Agency, Annie takes on missions that become personal and finds herself on dangerous forays into inhospitable territory, while a series of explosive revelations force her to question her role and what (and who) matters most. From the producers of The Bourne Trilogy and co-starring Christopher Gorham (Ugly Betty), Kari Matchett (Leverage), and Peter Gallagher (The O.C.), watch all 16 action-packed episodes back to back and uninterrupted of the pulse-racing series that \"will keep you at the edge of your seat\" (Jeanne Jakle, San Antonio Express News). International shooting locations this season include Moscow, Paris, Barcelona, Morocco and Puerto Rico.Bonus Content:', 'Disc 1 - Covert Affairs Season Three:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 2 - Covert Affairs Season Three:', 'Deleted Scenes', 'Deleted Scenes', 'Disc 4 - Covert Affairs Season Three:', 'Deleted Scenes', 'Deleted Scenes', 'Sights Unseen: A Covert Affairs Prequel', 'Sights Unseen: A Covert Affairs Prequel']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Contributor': 'Christopher Gorham, Kari Matchett, Piper Perabo, Peter Gallagher', 'Initial release date': '2013-05-28', 'Language': 'English (Dolby Digital 5.1)', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '20504915', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Widescreen', 'Run time': '11 hours and 24 minutes', 'Release date': 'May 28, 2013', 'Actors': 'Piper Perabo, Christopher Gorham, Kari Matchett, Peter Gallagher', 'Studio': 'Studio Distribution Services', 'Number of discs': '4'}\nOn time arrival, great packaging and it's a great collection for my summer shows library. Very happy with the on time delivery.\nGreat\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Andy Mikita', 'Sturla Gunnarsson', 'David Frazee', 'Stefan Pleszczynski', 'Charles Martin Smith', 'Bronwen Hughes', 'Mathias Herndl', 'Jeremiah S. Chechik', 'Kelly Makin', 'Mairzee Almas'], 'Starring': ['Kristin Lehman', 'Louis Ferreira', 'Lauren Holly']}\nAnother one of my favorite summer shows. It's a great show and I recommend it if you like police dramas.\nGreat\nHawaii Five-0: Season 3\nDaniel Dae Kim  (Actor),     Grace Park  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n[\"HAWAII FIVE-0 is a contemporary take on the classic series about a new elite federalized task force whose mission is to wipe out the crime that washes up on the Islands' sun-drenched beaches.\"]\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Box set', 'Contributor': \"Alex O'Loughlin, Grace Park, Daniel Dae Kim, Scott Caan\", 'Language': 'English', 'Number Of Discs': '7', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8 Ounces', 'Item model number': '27571148', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen, Box set', 'Run time': '17 hours and 12 minutes', 'Release date': 'August 4, 2015', 'Actors': \"Daniel Dae Kim, Grace Park, Alex O'Loughlin, Scott Caan\", 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '7'}\nThis by far is one of the best shows on TV right now. Quality of the DVD is exceptional and I highly recommend it.\nHooked\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Haber', 'Steve Robin', 'Michael Katleman', 'Norman Buckley', 'Gregory Prange', 'Michael Zinberg', 'Randy Zisk', 'Michael M. Robin', 'Stephen Clancy', 'Paul Holahan'], 'Producers': ['Not Specified'], 'Starring': ['Angie Harmon', 'Sasha Alexander'], 'Studio': ['Discovery Global']}\nAwesome.\nFive Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jean de Segonzac', 'Paul Holahan', 'Matt Earl Beesley', 'Peter Werner', 'Oz Scott', 'John David Coles', 'Niels Arden Oplev', 'Anna Foerster', 'Jace Alexander', 'David Platt'], 'Starring': ['Poppy Montgomery', 'Dylan Walsh'], 'Studio': ['CBS']}\nAwesome\nFive Stars\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jean de Segonzac', 'Paul Holahan', 'Matt Earl Beesley', 'Peter Werner', 'Oz Scott', 'John David Coles', 'Niels Arden Oplev', 'Anna Foerster', 'Jace Alexander', 'David Platt'], 'Starring': ['Poppy Montgomery', 'Dylan Walsh'], 'Studio': ['CBS']}\nAwesome\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Guy Ferland', 'Christine Moore', 'John Polson', 'Ron Fortunato', 'Seith Mann', 'Jerry Levine', 'Larry Teng', 'Lucy Liu', 'Aaron Lipstadt', 'Andrew Bernstein'], 'Studio': ['CBS']}\nAwesome\nFive Stars\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Henry Madden', 'George Chialtas', 'Allan Jacobsen', 'Gary Conrad', 'Kuni Tomita', 'Sherie Pollack', 'Matt Engstrom'], 'Producers': ['Valerie Walsh', 'Chris Gifford', 'Eric Weiner']}\nWhen my granddaughter visits all she want to see it this, its great!\nits great!",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference**: The user continues to strongly favor drama and suspense narratives, particularly police dramas featuring dynamic character interactions and intriguing mysteries.\n- **Actor Affinity**: While maintaining an appreciation for Angie Harmon and Sasha Alexander, the user is also cultivating a growing admiration for Daniel Dae Kim and Grace Park, reflecting an expanding taste for talented actors in these genres.\n- **Viewing Habits**: Known for binge-watching and collecting DVD seasons, the user consistently rates purchases between 4.0 and 5.0, with recent interactions highlighting their discerning taste, as shown by a perfect score for a recent review.\n- **Product Evaluation**: The user recently rated a purchase at 5.0, praising its overall experience, which indicates a continued preference for excellence in content quality and presentation.\n- **Content Appeal**: Enjoys series that intricately weave crime-solving with personal relationships, valuing deep narratives and character development while also appreciating lighter moments within suspenseful plots.\n- **Family Engagement**: The user has shared that their granddaughter enjoys certain series, indicating a familial aspect to their viewing habits and suggesting an additional motivation for keeping content engaging.\n- **Overall Experience**: Describes watched shows as entertaining and engaging, favoring a blend of action, personal stakes, and character growth. The user remains proactive in recommending series that embody these qualities, reinforcing their appreciation for high-quality content.",
  "metrics": {
    "rouge1_f": 0.13204325554923163,
    "rouge2_f": 0.012535612535612535,
    "rougeL_f": 0.05463858850313034,
    "meteor": 0.03789438759802206,
    "bleu1": 0.00025604661206165153,
    "bleu2": 9.327279769486364e-05,
    "bleu3": 4.5258268033903164e-05,
    "bleu4": 2.110153091607432e-05,
    "bertscore_precision": 0.35591357946395874,
    "bertscore_recall": 0.48012465238571167,
    "bertscore_f1": 0.40879201889038086
  }
}