{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/03/23\nAverage Rating: 4.4\nProduct Details: {'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Matthew Vaughn'], 'Producers': ['Adam Bohling', 'David Reid', 'Matthew Vaughn', 'Ralph Fiennes', 'Dave Gibbons', 'Stephen Marks', 'Mark Millar', 'Claudia Schiffer'], 'Starring': ['Ralph Fiennes', 'Gemma Arterton', 'Rhys Ifans'], 'Studio': ['Cloudy']}\nReview Text: I love the way this movie followed history so closely. Being a world war one history buff. It was actually believable that this fictional account of the events leading up to the war could have been legitimate.\nReview Title: Cute movie- a little slow starting but then the action started.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Grease 2\nMichelle Pfeiffer  (Actor),     Maxwell Caulfield  (Actor),     Patricia Birch  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Musicals & Performing Arts, Musicals\n['The sequel to the 1978 hit movie, GREASE 2 is set in the early 1960\\x92s when a new British student, Michael Carrington (Caulfield), rides into town and joins the ranks at Rydell High. A book nerd who immediately falls for the blonde bombshell leader of the Pink Ladies, Stephanie Zinone (Pfeiffer), Michael finds himself smitten, but out of his element. Knowing that the Pink Ladies are the hippest clique of chicks at Rydell, who only date their equals in coolness - the T-Birds, Michael sets out to turn from a geek to a greaser to see if he can win the gorgeous Stephanie\\x92s heart.']\n{'Genre': 'Musicals, Romance', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Maureen Teefy, Leif Green, Didi Conn, Alison Price, Eve Arden, Lorna Luft, Pamela Adlon, Michelle Pfeiffer, Patricia Birch, Ken Finkleman, Maxwell Caulfield, Peter Frechette, Adrian Zmed, Christopher McDonaldMaureen Teefy, Leif Green, Didi Conn, Alison Price, Eve Arden, Lorna Luft, Pamela Adlon, Michelle Pfeiffer, Patricia Birch, Ken Finkleman, Maxwell Caulfield, Peter Frechette, Adrian Zmed, Christopher McDonald  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Patricia Birch', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'June 10, 2003', 'Actors': 'Michelle Pfeiffer, Maxwell Caulfield, Lorna Luft, Maureen Teefy, Alison Price', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Ken Finkleman', 'Number of discs': '1'}\nI did not see the movie yet but my 9 yera old daughter stated, \"it needs a little work!\"  This is from a 9 yr old who loves the movie Greesand has watched it over 12 time, so I did not expect it to get good reviews!  lol\nReview from my 9 yr old daughter\n{'Subtitles': ['None available'], 'Directors': ['Chris Miller'], 'Producers': ['Joe M. Aguilar', 'Latifa Ouaou'], 'Starring': ['Antonio Banderas', 'Salma Hayek', 'Zach Galifianakis'], 'Studio': ['Paramount']}\nOMG!  What can I say! This movie is so good. Loved it and watched it over and over and over.\nEXCELLENT!\nThe Brothers Grimm\nMatt Damon  (Actor),     Heath Ledger  (Actor),     Terry Gilliam  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n[\"Matt Damon (THE BOURNE SUPREMACY, OCEAN'S TWELVE) and Heath Ledger (THE PATRIOT, A KNIGHT'S TALE) team up to bring you one of the year's most fantastic adventures in this magical tale based on the lives of the legendary storytellers. Will and Jake Grimm (Damon and Ledger) dazzle small towns with their imaginative folklore and elaborate illusions, but when the brothers journey into a real enchanted forest they encounter many of the fantastic characters and thrilling situations found in their beloved fairy tales! From the award-winning director of 12 MONKEYS, BRAZIL and MONTY PYTHON AND THE HOLY GRAIL, this fabulous motion picture is sure to leave you living happily ever after!\"]\n{'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Monica Bellucci, Charles Roven, Vaclav Chalupa, Uma Thurman, Matt Damon, Richard Ridings, Rudolf Pellar, Ota Filip, Heath Ledger, Jonathan Pryce, Jakub Zindulka, Petr Ratimec, Tomas Hanak, Roger Ashton-Griffiths, Peter Stormare, Lena Headey, Terry Gilliam, Miroslav Táborský, Julian Bleach, Daniel Bobker, Jan Unger, Mackenzie Cook, Audrey Hamm, Bruce MacEwenMonica Bellucci, Charles Roven, Vaclav Chalupa, Uma Thurman, Matt Damon, Richard Ridings, Rudolf Pellar, Ota Filip, Heath Ledger, Jonathan Pryce, Jakub Zindulka, Petr Ratimec, Tomas Hanak, Roger Ashton-Griffiths, Peter Stormare, Lena Headey, Terry Gilliam, Miroslav Tábor…  See more', 'Language': 'English', 'Studio': 'Miramax Lionsgate', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Director': 'Terry Gilliam', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Release date': 'January 8, 2013', 'Actors': 'Matt Damon, Heath Ledger, Peter Stormare, Lena Headey, Jonathan Pryce', 'Subtitles': 'French, Spanish', 'Producers': 'Daniel Bobker, Charles Roven', 'Number of discs': '1'}\nI enjoyed this movie - a little different! Enjoyable!\nFive Stars\nThe Imaginarium of Doctor Parnassus\nHeath Ledger  (Actor),     Christopher Plummer  (Actor),     Terry Gilliam  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Enter a dazzling world of fantasy in The Imaginarium of Dr. Parnassus,Director Terry Gilliam’s magical adventure tale starring Heath Ledger in his last film role along with Christopher Plummer, Johnny Depp, Colin Farrell and Jude Law. In exchange for extraordinary powers, Dr. Parnassus (Plummer)makes a deal with the Devil to turn over any child of his when they turn sixteen. But as his daughter Valentina’s (Lily Cole) birthday approaches, a mysterious stranger(Ledger) arrives with the power to change everything. In this captivating, explosive and wonderfully imaginative race against time, Dr. Parnassus must fight to save his daughter in a never-ending landscape of surreal obstacles - and undo the mistakes of his past once and for all!', 'Amazon.com', \"Terry Gilliam has long admired Marcel Carné's beautiful and tragic\", 'Children of Paradise', '(he even contributes an introduction to the Criterion Collection edition). In', 'The Imaginarium of Doctor Parnassus', ', among his more phantasmagorical features, Gilliam conjures up his own unique theatrical troupe. Led by the immortal Parnassus (Christopher Plummer, whose daughter, Amanda, appeared in', 'The Fisher King', '), Anton (', 'Boy A', '\\'s Andrew Garfield), Percy (Verne Troyer), and the doctor\\'s doll-faced daughter, Valentina (model Lily Cole), travel through 21st-century London in their stagecoach set. Times are tight and the quartet is starting to unravel when they rescue Tony, a philanthropist (Heath Ledger, reuniting with Gilliam for the last time), from the Russian mob. Though Anton pines for Valentina, she falls for the new fellow, who charms female viewers into opening up their wallets. Little do the ladies realize they risk their souls when they pass through the Imaginarium, a Mylar mirror that leads to alternate realities (where Johnny Depp, Jude Law, and Colin Farrell play Tony\\'s doppelgängers). As it transpires, Parnassus made a Faustian bargain with Mr. Nick (Tom Waits, whom Gilliam considers \"America\\'s greatest musical poet\") centuries before and must supply Satan with five souls by Valentina\\'s 16th birthday or Nick will take her away from him--permanently. One of the movie\\'s more haunting lines, \"Nothing is forever, not even death,\" could serve as an epitaph for Ledger, who died from an accidental overdose during filming, but lives again in the erratic, yet imaginative Gilliam\\'s most purely enjoyable film since', 'Time Bandits', '.', '--Kathleen C. Fennessy', 'Stills from', 'The Imaginarium of Doctor Parnassus', '(Click for larger image)']\n{'Genre': 'Adventure, Drama, Fantasy, Mystery', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Colin Farrell, Terry Gilliam, Christopher Plummer, Heath Ledger, Johnny Depp, Jude Law', 'Language': 'Unqualified', 'Runtime': '2 hours and 3 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.56 x 5.43 x 7.32 inches; 2.72 Ounces', 'Item model number': '34362', 'Director': 'Terry Gilliam', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'April 27, 2010', 'Actors': 'Heath Ledger, Christopher Plummer, Johnny Depp, Jude Law, Colin Farrell', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Sony Pictures Classics', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWeird movie but entertaining - hard to follow\nFour Stars\n{'Content advisory': ['Nudity', 'violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Martin Scorsese'], 'Producers': ['Emma Koskoff', 'Alexandra Milchan', 'Rick Yorn', 'Irwin Winkler', 'Danny Dimbort', 'Joel Gotler', 'Georgia Kacandes', 'Martin Scorsese', 'Leonardo DiCaprio', 'Riza Aziz', 'Joey McFarland', 'Emma Tillinger Koskoff'], 'Starring': ['Leonardo DiCaprio', 'Jonah Hill', 'Margot Robbie'], 'Studio': ['Hit Movies']}\nNasty movie - we all loved it!\nFive Stars\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kenneth Branagh'], 'Producers': ['Ridley Scott', 'Mark Gordon', 'Simon Kinberg', 'Kenneth Branagh', 'Judy Hofflund', 'Michael Schaefer'], 'Starring': ['Kenneth Branagh', 'Penélope Cruz', 'Johnny Depp'], 'Studio': ['Kinberg Genre;The Mark Gordon Company;Scott Free']}\nCool ending - was not aware of the story.\nFive Stars\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Glenn Kershaw', 'Félix Enríquez Alcalá', 'Rob Bailey', 'Edward Allen Bernero', 'Matthew Gray Gubler', 'John Gallagher', 'Guy Norman Bee', 'Larry Teng', 'Joe Mantegna', 'Douglas Aarniokoski']}\nBought these two episodes as they are not on Netflix.\nGREAT SHOW\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['John Madden'], 'Producers': ['Ben Browning', 'Kris Thykier', 'Ariel Zeitoun'], 'Starring': ['Jessica Chastain', 'Mark Strong', 'Gugu Mbatha-Raw'], 'Studio': ['Transfilm']}\nOn the edge of my seat. GREAT movie.\nShe is such a GREAT actress who is also super HOT\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Morten Tyldum'], 'Producers': ['Nora Grossman', 'Ido Ostrowsky', 'Teddy Schwarzman', 'Peter Heslop'], 'Starring': ['Benedict Cumberbatch', 'Keira Knightley', 'Matthew Goode'], 'Studio': ['Lionsgate']}\nWhat can you say about Benedict he is a wonderful actor. This movie was absolutely fascinating but I was very very angry at the end when I realized what happened to the main character. This is based on a true story and the ending should make you very angry.\nGreat movie\n{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Matthew Vaughn'], 'Producers': ['Adam Bohling', 'David Reid', 'Matthew Vaughn', 'Ralph Fiennes', 'Dave Gibbons', 'Stephen Marks', 'Mark Millar', 'Claudia Schiffer'], 'Starring': ['Ralph Fiennes', 'Gemma Arterton', 'Rhys Ifans'], 'Studio': ['Cloudy']}\nI love the way this movie followed history so closely. Being a world war one history buff. It was actually believable that this fictional account of the events leading up to the war could have been legitimate.\nCute movie- a little slow starting but then the action started.",
  "profile": "**Updated User Profile Summary:**\n\nThis user maintains a strong dedication to family-friendly films and musicals while successfully harmonizing their entertainment choices with those of their child. Recent interactions reveal a growing interest in unconventional narratives that marry fantasy and adventure with mature themes, reflecting their desire for stories that stimulate meaningful discussions during family movie nights.\n\nTheir latest review highlights their appreciation for films that incorporate historical context, showcasing their enthusiasm for narratives that blend fact with fiction. While they remain open to content containing elements of violence and mature themes, they prioritize authenticity and relatable storytelling in their viewing experience. This engagement further enriches their role as a parent who aims to foster thoughtful conversations through film.\n\nWith a particular fondness for movies that feature unexpected plot twists and strong character development, this user thrives on a diverse array of cinematic experiences ranging from popular hits to more eccentric choices. Their commitment to creating memorable family moments through film reflects a passion for nurturing a shared appreciation for creativity and complex storytelling among family members. This profile underscores a dynamic individual curating a versatile viewing experience that resonates across ages, emphasizing the significance of meaningful interactions and lasting family connections.",
  "metrics": {
    "rouge1_f": 0.09086161879895562,
    "rouge2_f": 0.0020909566126502874,
    "rougeL_f": 0.03968668407310705,
    "meteor": 0.023153789909822083,
    "bleu1": 4.385309448866451e-06,
    "bleu2": 1.0723570578142084e-06,
    "bleu3": 1.823033808792106e-07,
    "bleu4": 7.525300948769456e-08,
    "bertscore_precision": 0.30145400762557983,
    "bertscore_recall": 0.4526873230934143,
    "bertscore_f1": 0.3619067072868347
  }
}