{
  "interaction_number": 16,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Fx\nReview Date: 2016/02/12\nStore: Brian Dennehy  (Actor),     Bryan Brown  (Actor),     Robert Mandell  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"Rollie Tyler (Bryan Brown) is the best special effects artist in showbiz. But this time it's not the studios seeking him out.... it's the Justice Department. His assignment: to stage an assassination of an important underworld witness. And after he pulls the illusion off making the informant disappear Rollie is dumbfounded to learn that he's being pinned for the murder! Double-crossed and now hunted by those who hired him, Rollie quickly learns that he can trust no one ... and that the only thing left that can save his life is his unequaled mastery of illusion!\"]\nAverage Rating: 4.5\nProduct Details: {'Format': 'NTSC', 'Contributor': 'Diane Venora, Robert Mandell, Bryan Brown, Brian Dennehy', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.86 Ounces', 'Director': 'Robert Mandell', 'Media Format': 'NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'June 23, 2011', 'Actors': 'Brian Dennehy, Bryan Brown, Diane Venora', 'Studio': 'Tgg Direct', 'Number of discs': '1'}\nReview Text: Great classic movie\nReview Title: Four Stars\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Beastmaster (Special Edition) [DVD]\nMarc Singer  (Actor),     Tanya Roberts  (Actor),     Don Coscarelli  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"This low-budget entry into the sword-and-sorcery cycle of the early '80s wasn't successful during its initial release, but has steadily built a strong cult following over the years. The Beastmaster tells the story of Dar (Marc Singer), the son of a king who was stolen from his mother's womb by a witch under the command of vicious sorcerer Maax (Rip Torn). A poor villager saves Dar from being sacrificed and raises him as his own son, teaching Dar how to fight and witnessing the boy's ability to telepathically communicate with animals. Their happiness is destroyed when their village is attacked by the evil Jun horde, a race of beast-like warriors controlled by Maax. Dar vows revenge and journeys to his father's former kingdom to destroy Maax. Along the way, he falls in love with gorgeous slave girl Kiri (Tanya Roberts) and teams up with former royal guard Seth (John Amos). Dar also uses his powers to enlist the aid of an eagle, a panther and two adorable ferrets named Kodo and Podo. Together, Dar and his unlikely but brave team square off with Maax in an impressive two-part finale that involves a swordfight on the side of a pyramid and a showdown with the Jun horde near a flaming moat. The resulting film was full of action and eccentric surprises, but failed to make an impression at a box office already glutted with fantasy films. However, The Beastmaster eventually became a serious cult favorite thanks to home video and extensive exposure on cable (it is the second most aired movie on TBS after Gone With the Wind). This enduring popularity led to two sequels and a syndicated television series chronicling the further adventures of Dar.\"]\n{'Genre': 'Fantasy, Romance, Action & Adventure', 'Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Contributor': 'Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Janet Jones, Janet DeMay, Bruce Paul Barbour, Eddy Donno, Jim Driggers, Rip Torn, Gary McLarty, Joshua Milrad, Tim Dunlavey, Billy Hank Hooker, Monty L. Simons, Eddie Hice, John Amos, Tony Epper, Linda Smith, Paul Reynolds, Ralph Strait, Hugh Armstrong, Mick Thibodeau, Jeremy Whelan, Daniel Zormeier, Larry Randles, Vanna Bonta, George Scott (II), Henry Carbo, Vince Deadrick Sr.Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Jan…  See more', 'Language': 'English (DTS ES 6.1), English (THX Surround EX)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.84 Ounces', 'Director': 'Don Coscarelli', 'Media Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Run time': '1 hour and 58 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Marc Singer, Tanya Roberts, Rip Torn, John Amos, Joshua Milrad', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nI love this classic type of Sci-fi movie that was a really well written story.  I know it seems corny now but at the time it was a really cool movie.\nBeastmaster (Special Edition)\nBones: Season 2\nEmily Deschanel  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', 'David Boreanaz (Angel, Buffy the Vampire Slayer) stars as F.B.I. Agent Seeley Booth, who teams up with forensic anthropologist Dr. Temperance \"Bones\" Brennan (Emily Deschanel) to solve some of the most baffling and bizarre crimes ever. Booth depends on clues from the living, witnesses and suspects, while Brennan gathers evidence from the dead, relying on her uncanny ability to read clues left behind in the bones of the victims. Their different investigative styles cause the two to frequently clash, creating an undeniable chemistry and just the right touch of dark humor. Inspired by real-life forensic anthropologist Kathy Reichs and state-of-the-art criminal investigation procedures, Bones is a compelling, cutting edge television.', 'Amazon.com', 'Beginning with the death of a senator and ending with a marriage, the second season of', 'Bones', \"builds on the momentum created during the Fox drama's debut year.\", 'Bones', \"' sophomore season (which includes all 21 episodes that originally aired during 2006-2007) centers on the collaborations between FBI special agent Seeley Booth (David Boreanaz,\", 'Angel', ',', 'Buffy the Vampire Slayer', ') and forensic anthropologist Dr. Temperance Brennan (Emily Deschanel), whom Booth has nicknamed \"Bones.\" While Booth doesn\\'t completely believe in Bones\\' method, he can\\'t argue with her success rate at solving crimes. As for Bones, she is meticulous at what she does and is a borderline genius, but she has issues. Seemingly oblivious to her own good looks, she is all but socially inept. Booth may be blunt, but he\\'s comfortable dealing with the public. Bones, on the other hand, would rather be sequestered away with the dead, trying to figure out what happened before their uncertain deaths. Of course, while viewers can see that Bones and Booth would be a perfect couple, the characters aren\\'t quite there yet. Their friendship becomes a little more complicated this season when it turns out that Bones\\' new demanding boss, Dr. Camille Saroyan (Tamara Taylor), is a former girlfriend of Booth\\'s. And the two women aren\\'t getting along.', \"Still, everyone is able to work together to solve a series of crimes, such as identifying the remains of an all but unidentifiable teenage boy and dealing with a serial killer who is emulating the crimes depicted in Bones' latest mystery novel. (Yes, she's not only a brilliant scientist but also an ace author.) Like many television dramas where forensic evidence is a driving force in the plots,\", 'Bones', \"offers up the gross-out autopsies. But it also serves up a lot of humanity in the way the characters interact with one another. It is giving nothing away to reveal that Bones and Booth are not the couple getting married in the season finale. But the episode does reveal that beneath their tough exteriors, marriage and all that it implies is something they wouldn't mind... perhaps even with each other.\", '--Jae-Ha Kim']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Emily Deschanel', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.48 x 7.65 inches; 6.4 Ounces', 'Item model number': '2246045', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '15 hours and 17 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Emily Deschanel', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nThis series is so interesting with the back and forth play between the characters that it is a great show.\nGreat Series from start to finish\nHarry Potter and the Order of the Phoenix (Two-Disc Special Edition)\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Characters & Series, Harry Potter, Harry Potter and the Order of the Phoenix\n['Product Description', 'Harry Potter and the Order Of The Phoenix: Special Edition (Dbl DVD) (O-Sleeve)', 'Lord Voldemort has returned, but few want to believe it. In fact, the Ministry of Magic is doing everything it can to keep the wizarding world from knowing the truth - including appointing Ministry official Dolores Umbridge as the new Defense Against the Dark Arts teacher at Hogwarts. When Professor Umbridge refuses to train her students in practical defensive magic, a select group of students decides to learn on their own. With Harry Potter as their leader, these students (who call themselves \"Dumbledore\\'s Army\") meet secretly in a hidden room at Hogwarts to hone their wizarding skills in preparation for battle with the Dark Lord and his Death Eaters. . New adventure - more dangerous , more thrilling than ever - is yours in this enthralling film version of the fifth novel in J.K. Rowling\\'s Harry Potter series. A terrifying showdown between good and evil awaits. Prepare for battle!', ']]>', 'Amazon.com', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.\", \"Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper\", 'The Daily Prophet', 'to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.', \"This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a\", 'good', 'movie.', '--Jordan Thompson', 'On the DVD', 'The second disc of', 'The Order of the Phoenix', 'features \"The Hidden Secrets of Harry Potter,\" a retrospective on the series so far, with \"Potter experts\" (i.e., people who run fan sites) weighing in on what\\'s to come. This must have been filmed during production, because all their speculation about the conclusion of the saga is clearly dated and therefore superfluous (since', 'Order', 'released theatrically at the same time as the seventh book, one would\\'ve expected a more current analysis). Many of the deleted scenes are mostly extensions, with the exception of one hilarious take of Professor Trelawney (Emma Thompson) trying--unsuccessfully--to eat gracefully during Dolores Umbridge\\'s introduction at Hogwarts. The chatty actress Natalia Tena, who plays Tonks, gives a tour of the set in \"Trailing Tonks,\" even playing a Christmas song she wrote on her guitar, and director David Yates and editor Mark Day demonstrate editing 101 with a feature that lets you edit your own scene from the movie. Watch the feature but skip the self-editing part; the controls are too complicated to navigate and too frustrating to work properly (plus, hit the wrong button and you\\'ve gone all the way back to the beginning). A digital copy of the movie is also included on the bonus disc.', '--Ellen A. Kim']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Widescreen, NTSC', 'Contributor': 'Rupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Lionel Wigram, Imelda Staunton, David Heyman, David Bradley, Evanna Lynch, Gary Oldman, Dame Maggie Smith, Robert Hardy, David Thewlis, Robbie Coltrane, Alan Rickman, Kathryn Hunter, Ralph Fiennes, George HarrisRupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Li…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.8 Ounces', 'Item model number': '85391174929', 'Director': 'David Yates', 'Media Format': 'Widescreen, NTSC', 'Run time': '2 hours and 19 minutes', 'Release date': 'April 9, 2013', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Helena Bonham Carter, Robbie Coltrane', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Lionel Wigram, David Heyman, David Barron', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Goldenberg', 'Number of discs': '2'}\nThe extras are kind of interesting but this could be the best movie of the 5 right now what can i say.\nHarry Potter 5 What can I say.\nBatman Beyond - The Movie\nWill Friedle  (Actor),     Kevin Conroy  (Actor),     Butch Lukic  (Director),     Curt Geda  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Batman Beyond: The Movie [Import]']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Butch Lukic, Curt Geda, Dan Riba, Yukio Suzuki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, NTSC', 'Run time': '2 hours and 12 minutes', 'Release date': 'December 21, 1999', 'Actors': 'Will Friedle, Kevin Conroy, Sherman Howard, Michael Ansara, Linda Hamilton', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Language': 'French (Dolby Digital 2.0 Stereo), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Warner Home Video', 'Writers': 'Alan Burnett, Bob Kane, Hilary Bader, Jerry Robinson', 'Number of discs': '1'}\nI love this TV series and does a great job to keep Batman around but it also moves from the older Bruce Wayne to a younger character.  The problem that I had wasn't with the movie but when I received it in the mail the case pieces that hold the disc in had broken so that allowed the disc to move all around in the case.  I was able to clean it off but that was the only problem.  I still loved the series and all the others I got.\nLove the show and Batman, but...\nAngel - Seasons 1-4\nBoreanaz, David  (Actor, Director),     Denisof, Alexis  (Actor),     Astin, Sean  (Director),     Fusager, Frederik  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n{'Format': 'NTSC', 'Contributor': \"Boreanaz, David, Astin, Sean, Price, Roger Damon, Semencic, Iva, Fusager, Frederik, Kimble, Robert L., Norton, C. Goodwin, O'Hara (II), Tim, Wheeler, Charlotte, Minello, Gianni, Rao, Mallikarjuna, McGivern, David, Gates, Tudor, Kartheiser, Vincent, Green (VI), Chris, McNab, Mercedes, Denisof, Alexis, Meyer, Werner, Wright (III), Will, Whitmore (II), PeterBoreanaz, David, Astin, Sean, Price, Roger Damon, Semencic, Iva, Fusager, Frederik, Kimble, Robert L., Norton, C. Goodwin, O'Hara (II), Tim, Wheeler, Charlotte, Minello, Gianni, Rao, Mallikarjuna, McGivern, David, Gates, Tudor, Kartheiser, Vincent, Green (VI), Chris, McNab, M…  See more\", 'Language': 'English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Number Of Discs': '24', 'Publication Date': 'April 12, 2005', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 6.75 x 6 inches; 4.3 Pounds', 'Director': 'Astin, Sean, Boreanaz, David, Fusager, Frederik, Gates, Tudor, Green (VI), Chris', 'Media Format': 'NTSC', 'Release date': 'April 12, 2005', 'Actors': 'Boreanaz, David, Denisof, Alexis, Kartheiser, Vincent, McNab, Mercedes', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '24'}\nThis is an addition to a great universe that Joss has created.  There are so many things that you can get from the series along with a general enjoyment of it.  I wish there were more than the 5 seasons but they will go on for a long time.\nGood Characters Great Stories\nBatman & Mr. Freeze: SubZero / Batman: Mask of the Phantasm\nKevin Conroy  (Actor),     Efrem Zimbalist Jr.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, DC Comics Collection, Batman Animated Movies\n['Batman: Mask of Phantasm Batman and Mr. Freeze: Sub Zero (DVD)', 'Batman: Mask of the Phantasm - When the city’s most feared gangsters are systematically eliminated, the Caped Crusader is blamed. But prowling the Gotham night is a shadowy new villain, the Phantasm, a sinister figure with some link to Batman’s past. Can the Dark Knight elude the police, capture the Phantasm and clear his own name? Unmasking the Phantasm is just one of the twists in this dazzling animated feature. Discover revelations about Batman’s past, his archrival the Joker and Batman’s most grueling battle ever — the choice between his love for a beautiful woman and his vow to be the defender of right. Batman & Mr. Freeze: Subzero - Cold-blooded crime comes to Gotham City: Archvillain Mr. Freeze kidnaps Batgirl, and the Dark Knight and Robin scramble to rescue her before she’s forever iced in the animated chiller-thriller movie Batman and Mr. Freeze Subzero.', ']]>']\n{'Genre': 'Kids & Family', 'Format': 'Full Screen, NTSC', 'Contributor': 'Efrem Zimbalist Jr., Robert Costanzo, Michael Ansara, Bob Hastings, Kevin Conroy, Dana Delany', 'Initial release date': '2008-02-12', 'Language': 'Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000035736DVD', 'Media Format': 'Full Screen, NTSC', 'Run time': '2 hours and 23 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Kevin Conroy, Efrem Zimbalist Jr., Bob Hastings, Robert Costanzo, Dana Delany', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI got this because of the Mask of Phantasm and when I saw I could get the other one I jumped at the chance.  I really like both of the movie but of course I am a Batman fan.\nTwo great movies on one disc\nRikki Tikki Tavi/Yankee Doodle Cricket\nLes Tremayne  (Actor),     Mel Blanc  (Actor),     Chuck Jones  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n['The original 1976 animated feature Rikki Tikki Tavi along with a bonus cartoon of Yankee Doodle Cricket on the same disc!']\n{'Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC', 'Contributor': 'George Selden, June Foray, Chuck Jones, Les Tremayne, Mel Blanc', 'Language': 'Unqualified', 'Runtime': '30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '12236170662', 'Director': 'Chuck Jones', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC', 'Run time': '30 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Les Tremayne, Mel Blanc, June Foray', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Writers': 'Chuck Jones, George Selden', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt is a great little movie about a story of overcoming odds and to me that means a lot.  Chuck Jones knows his cartoons and knows what kids liked.\nClassic cartoon reminds me of childhood\nBatman Beyond - Tech Wars/Disappearing Inque (Animated Double Feature)\nVarious  (Actor, Director)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Anime\n['Batman Beyond: Tech Wars/Disappearing Inque (DVD) (Multi-Title)', \"Batman Beyond: Disappearing Inque - The Gotham nights give birth to a brand-new super villain. She is deadly, shape-shifting industrial saboteur named Inque. Black Out - When Terry faces Inque for the first time, he finds that he still has a lot to learn about becoming Batman. Disappearing Inque - With the help of an infatuated lab worker, Inque escapes her frozen imprisonment and devises a plan to destroy Batman and Bruce Wayne. Shriek - When Bruce Wayne challenges Derek Powers's control of Wayne/Powers Industries, Powers orders an employee who has discovered sound can be a weapon, to become Shriek and eliminate Wayne. Year: 1999\", ']]>']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Animated', 'Contributor': 'Various', 'Language': 'Unqualified, English (Dolby Digital 4.0)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Animated', 'Run time': '2 hours and 4 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nThis series has gone back to where Batman the Animated series type of stories and I feel they are the best stories and cartoons.\nNew Batman Great stories\nBatman Beyond - School Dayz/Spellbound (Animated Double Feature)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Animation', 'Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Various', 'Language': 'English', 'Number Of Discs': '1'}\nIt contains great episodes of the newest Batman and love the characters and am glad I got it.\nMore great Batman stories\nMosquito Coast, The (DVD)\nHarrison Ford  (Actor),     River Phoenix  (Actor),     Peter Weir  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Mosquito Coast, The (DVD)', \"Embittered by the blighted landscape of the contemporary United States, inventor Allie Fox (Harrison Ford) moves his wife and kids to the rain forest of Central America, where he plans to create a new civilization starting with his own nuclear family. Although they compliantly go along with Allie's scheme to build a free society, the other Foxes notice that Allie's single-minded obsession and driving egomania have turned him into a tyrannical fascist who demands total subservience from his broken brood.\", ']]>']\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': \"Dick O'Neill, Saul Zaentz, Paul Theroux, Jerome Hellman, Harrison Ford, River Phoenix, Paul Schrader, Helen Mirren, Conrad Roberts, Peter Weir, Martha Plimpton, Andre GregoryDick O'Neill, Saul Zaentz, Paul Theroux, Jerome Hellman, Harrison Ford, River Phoenix, Paul Schrader, Helen Mirren, Conrad Roberts, Peter Weir, Martha Plimpton, Andre Gregory  See more\", 'Initial release date': '2008-09-30', 'Language': 'Unqualified, English (Dolby Digital 4.0)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.25 inches; 0.01 Ounces', 'Item model number': 'WHV1000042230DVD', 'Director': 'Peter Weir', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'September 30, 2008', 'Actors': 'Harrison Ford, River Phoenix, Helen Mirren, Conrad Roberts, Martha Plimpton', 'Subtitles': 'French, English', 'Producers': 'Saul Zaentz, Jerome Hellman', 'Studio': 'Studio Distribution Services', 'Writers': 'Paul Schrader', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis movie shows the far one side of his acting and having him going crazy over this type of life.  I like the movie and I know it isn't one of Harrison Ford's best movies but it is one that shows he can act in a wide varied of roles if he wants too.  Also in this day in age it is interesting to think what might life be like if we simplified things as opposed to making life more complicated.\nHarrison Ford shows range of acting\nThe Water Babies [DVD]\nJames Mason  (Actor),     Bernard Cribbins  (Actor),     Lionel Jeffries  (Director, Writer)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, MGM Home Entertainment, All MGM Titles\n[\"Dive beneath the wavesand beyond your wildest dreamsto an underwater playground overflowing with adventure! Featuring a magical mix of live action and animation, The Water Babies is the most fun you'll have aboveand belowsea level! When 12-year-old Tom jumps into a swirling stream, he is suddenly swept away to a fantastical place filled with music, excitement and colorful characters. Frolicking with the fish, singing with the squid and cavorting with the crabs, Tom's as happy as a clam until he grows lonesome for his friends back home. To get to solid ground, Tom must findthe Water Babiesa group of fun-loving children who live far across the ocean. For only the WaterBabies can take Tom to the great Lord of the Seathe one creature powerful enough to make his every wish come true!\"]\n{'Genre': 'Anime & Manga, Action & Adventure', 'Format': 'Animated, Color, DVD, Live, NTSC', 'Contributor': 'Denis Norden, Tommy Pender, Jon Pertwee, Joan Greenwood, Paul Luty, Michael Robson, Charles Kingsley, Lance Percival, David Jason, Olive Gregg, Lionel Jeffries, Billie Whitelaw, Bernard Cribbins, David Tomlinson, Samantha Gates, James MasonDenis Norden, Tommy Pender, Jon Pertwee, Joan Greenwood, Paul Luty, Michael Robson, Charles Kingsley, Lance Percival, David Jason, Olive Gregg, Lionel Jeffries, Billie Whitelaw, Bernard Cribbins, David Tomlinson, Samantha Gates, James Mason  See more', 'Language': 'English (Mono)', 'Runtime': '1 hour and 32 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Lionel Jeffries', 'Media Format': 'Animated, Color, DVD, Live, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'February 4, 2003', 'Actors': 'James Mason, Bernard Cribbins, Billie Whitelaw, Joan Greenwood, David Tomlinson', 'Subtitles': 'English, French, Spanish', 'Studio': 'MGM (Video & DVD)', 'Writers': 'Charles Kingsley, Denis Norden, Lionel Jeffries, Michael Robson', 'Number of discs': '1'}\nA nice British movie that has a good value of tell the truth and all is good but it also has a catchy song and it was one of the first movies to incorporate cartoons as well.\nA classic I grew up with\nFringe: Season 1\nAnna Torv  (Actor),     Joshua Jackson  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Fringe: The Complete First Season (DVD)', 'J.J. Abrams, the creator of Lost and Alias, teams up with Roberto Orci and Alex Kurtzman (Mission: Impossible 3, Transformers) to create this highly anticipated drama series. Featuring Australian newcomer Anna Torv, Dawson’s Creek’s Josh Jackson, John Noble and Lance Reddick, the first electrifying season of Fringe follows an unlikely trio who uncover a deadly mystery that may be part of a larger and more disturbing pattern that lives somewhere between science fiction and reality. As the season begins, FBI Special Agent Olivia Dunham (Torv) is called in to investigate a mysterious outbreak that nearly kills her partner. The only person with any answers is an institutionalized scientist, Dr. Walter Bishop (Noble) who can only be released under the care of his estranged son (Jackson). Together, the three discover that the answer to this mystery is only a small piece of a much larger, more shocking truth.', ']]>', 'Amazon.com', 'Teleportation, mind control, astral projection, invisibility, precognition, spontaneous combustion, reanimation: these are among the peripheral sciences--or \"pseudo-sciences,\" as one skeptic puts it--examined during the first season of', 'Fringe', ', a Fox network TV drama debuting on DVD with the full first season (twenty episodes) offered on seven extras-laden discs. The notion that those phenomena could have a genuine scientific basis is intriguing enough. But co-creator J.J. Abrams (whose bulging resume as a director, writer, and producer includes', 'Lost', ',', 'Alias', ', and the 2009', 'Star Trek', \"feature film) has even more on his mind. Along with the weird science, the series features a multi-agency task force investigating related acts of terrorism that may very well add up to a threat of unimaginable global proportions; people who are exactly what they appear to be (i.e., insane) and others who are anything but; plot twists galore; family drama, interpersonal relationships, corporate evil, cop chases... There's a lot in play here, and while it doesn't always hold together (and like any new series, it takes a while to hit its stride),\", 'Fringe', 'is rarely boring, and never less than impressively ambitious.', 'The pilot introduces us to the main characters, principally FBI agent Olivia Dunham (Anna Torv, good but not great in the show\\'s central role) and others on the task force brought in to investigate some gross goings-on aboard a jumbo jet (a \"self-eradicating, airborne toxin\" reduced everyone to blood and bones). Seems this is but one part of \"The Pattern,\" a series of synchronous, similarly shocking events that unfold as the show progresses; in subsequent episodes, lots of people are killed in graphic fashion by all manner of horrors, including scary monsters (slugs as big as a football, teethed parasites that can crush your heart), a gas that freezes a busload of passengers \"like insects trapped in amber,\" people so radioactive they can literally make your brain boil… it goes on. Helping Dunham and the rest of the force figure it all out are scientist Dr. Walter Bishop (an appealing John Noble), who\\'s spent the past 17 years locked up in the loony bin and whose research may be responsible for some of the crimes we witness, and his son-babysitter Peter (Joshua Jackson). As for the \"fringe\" element, Dr. Bishop and other, less benign geniuses jump-start a dead man\\'s brain, photograph another victim\\'s cornea in order to access the last thing she saw before death, connect Dunham to her boyfriend so she can experience his memories of the incident that left him comatose, use high-frequency vibrations to enable bank robbers to pass through a solid vault wall, and much, much more. As for where and how all of this ends up, let\\'s just that inquiring minds will have to hang in for the long, complicated run.', 'Bonus features are many and varied; among the best are \"Deciphering the Scene\" (brief explications of key scenes in every episode) and \"The Massive Undertaking\" (detailing how certain special effects sequences were pulled off).', '--Sam Graham']\n{'Genre': 'Science Fiction & Fantasy, Drama', 'Format': 'AC-3, Color, Dolby, Dubbed, NTSC, Multiple Formats, Subtitled, Widescreen', 'Contributor': 'Anna Torv, Blair Brown, Jasika Nicole, Joshua Jackson, Lance Reddick, Michael Cerveris, Kirk Acevedo, John NobleAnna Torv, Blair Brown, Jasika Nicole, Joshua Jackson, Lance Reddick, Michael Cerveris, Kirk Acevedo, John Noble  See more', 'Language': 'English (Dolby Digital 5.1), Portuguese (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '7', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.4 x 1 inches; 11.2 Ounces', 'Item model number': '5458810', 'Media Format': 'AC-3, Color, Dolby, Dubbed, NTSC, Multiple Formats, Subtitled, Widescreen', 'Run time': '17 hours and 8 minutes', 'Release date': 'September 8, 2009', 'Actors': 'Anna Torv, Joshua Jackson, Lance Reddick, Kirk Acevedo, Blair Brown', 'Subtitles': 'English, French, Spanish, Portuguese, Thai', 'Studio': 'Warner Home Video', 'Number of discs': '7'}\nA whole different type of series remenisent of X-Files.  I love Sci-fi and those added type of story lines.\nVery interesting series\nCastle: Season 4\nNathan Fillion  (Actor),     Stana Katic  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['She’s armed. He’s dangerous. Relive every exciting investigation with TV’s most unlikely partners in crime! Own each episode and bring home even more Castle and Beckett with exclusive Bonus Features on ABC’s', 'Castle: The Complete Fourth Season', 'on DVD.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Molly C. Quinn, Penny Johnson, Seamus Dever, Jon Huertas, Stana Katic, Susan Sullivan, Nathan Fillion, Tamala JonesMolly C. Quinn, Penny Johnson, Seamus Dever, Jon Huertas, Stana Katic, Susan Sullivan, Nathan Fillion, Tamala Jones   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 5.28 Ounces', 'Item model number': '25631319', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 25 minutes', 'Release date': 'September 11, 2012', 'Actors': 'Nathan Fillion, Stana Katic, Jon Huertas, Seamus Dever, Tamala Jones', 'Subtitles': 'English, French, Portuguese, Spanish', 'Studio': 'Buena Vista Home Entertainment', 'Number of discs': '5'}\nAgain Castle delivers with a great season.  The DVDs came to me in great condition and I haven't had any problems with them playing.  Will be getting season 5 when it comes out.\nCastle is an awesome show\nBones: Season 6\nDavid Boreanaz  (Actor),     Emily Deschanel  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', 'After a much-needed break, forensic anthropologist Dr. Temperance Brennan (Emily Deschanel) and FBI Special Agent Seeley Booth (David Boreanaz) return to the Jeffersonian Institute, along with their team of investigative \"squints,\" for another darkly humorous season of murder, mystery, controversy and chemistry. In addition to a vast array of personal crises, ranging from Angela\\'s secret pregnancy to Booth\\'s new relationship with a beautiful reporter, the team tackles a complex caseload of gruesome crimes that includes facing a murderous Chupacabra, a trip to the Jersey Shore, the final return of the Gravedigger, and a vigilante sniper with a deadly link to Booth\\'s past.', 'Amazon.com', 'The opening moments of', 'Bones', \"'s sixth season finds its main characters Dr. Temperance Brennan (Emily Deschanel) and FBI agent Booth (David Boreanaz) separated by extreme distances, before being awkwardly reunited to aid a colleague. As far as metaphors go, it's a rather fitting one for a show that fumbles a bit with the established formula, before regaining its winning mix of light office banter and extremely grody crime scenes. (For the squeamish, said gnarly moments this time around include some steroid-juiced super maggots, a splattery bowling alley scenario straight out of a pre-censorship\", 'Tales from the Crypt', \"comic, and an exploding head that puts David Cronenberg's notorious\", 'Scanners', \"to shame.) Picking up seven months after the previous season, these 23 episodes find the team uneasily attempting to regain their chemistry within the Jeffersonian Museum, a task made especially difficult by the appearance of Booth's new girlfriend (Katheryn Winnick), an ambitious war reporter whose presence throws Dr. Brennan into unfamiliar emotional territory. Promising as such a shakeup is in theory, however, it proves awkward in practice, with the entertainingly implacable self-assurance of Deschanel's character tipping over into outright arrogance. Once the status quo is regained in the second half of the season, though,\", 'Bones', 'really starts to regain its cruising speed, balancing out some nicely goofy one-offs (look out for the Chupacabra!) with the overarching storylines, which include an unexpected development in the marriage between Angela (Michaela Conlin) and Dr. Hodgins (T.J. Thyne), and a recurring threat from a vengeful sniper, all culminating in a reveal that promises to permanently alter the relationship of the lead characters. While not without its missteps--most notably an awkward backdoor pilot for the short-lived spinoff', 'The Finder', \"--there are ultimately enough solid moments here to ensure that fans will stay tuned. When a show can follow up a screamingly gross candy-factory mishap with an understated Oompa-Loompa reference, it's a sign that things are back to firing on all cylinders. --\", 'Andrew Wright']\n{'Genre': 'Television/Crime', 'Format': 'AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'David Boreanaz, Tamara Taylor, Emily Deschanel, TJ Thyne, Michaela Conlin', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.88 Ounces', 'Item model number': '22035618', 'Media Format': 'AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '16 hours and 40 minutes', 'Release date': 'October 11, 2011', 'Actors': 'David Boreanaz, Emily Deschanel, Michaela Conlin, TJ Thyne, Tamara Taylor', 'Subtitles': 'French, English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nThis show is continuing to be good with each and every season.  The cast is one that has so much chemistry with one another that it really is truly a great show.\nNerds rule\nThe World's End / Hot Fuzz / Shaun of the Dead Trilogy\nSimon Pegg  (Actor, Writer),     Nick Frost  (Actor),     Edgar Wright  (Director, Writer)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['The World\\'s End: Twenty years after their first epic pub crawl attempt, the \"five musketeers\" reunite to complete the ultimate challenge – one night, five friends, twelve bars – a boozy quest on which only the strongest will survive. They soon realize that reaching their final pub, The World\\'s End, may be the least of their troubles. They\\'re having the time of their lives, ready to take on the world…but tonight they may have to save it. Simon Pegg and Nick Frost reteam with director Edgar Wright in this wildly entertaining thrill ride that critics call \"sheer comic perfection\" (Peter Travers, Rolling Stone). Hot Fuzz: Nicholas Angel (Simon Pegg) is a big-city cop who can\\'t be stopped - but he\\'s making everyone else on the force look bad. When he is reassigned to a small, quiet town, he struggles with this new, seemingly idyllic world and his bumbling partner (Nick Frost). Their dull existence is interrupted by several grisly and suspicious accidents, and the crime-fighting duo turn up the heat and hand out high-octane, car-chasing, gun-fighting big-city justice in this hilarious hit critics are calling \"Outrageous! Uproariously Funny!\" (Thelma Adams, US Weekly). Shaun of the Dead: There comes a day in every man\\'s life when he has to get off the couch… and kill some zombies. When flesh-eating zombies are on the hunt for a bite to eat, it\\'s up to slacker Shaun (Simon Pegg) and his best pal Ed (Nick Frost), to save their friends and family from becoming the next entreé. Novelist Stephen King gushes Shaun of the Dead is \"a 10 on the fun meter and destined to be a cult classic\" and Newsweek calls it \"a bloody hoot!\"', 'Your Digital Copy redemption code is printed on an insert inside your Blu-ray/DVD package.A Digital Copy is a digital version of the full-length movie that you get when you own specially-marked Blu-ray/DVD discs bearing the “Digital” logo. Owning the digital version of the movie extends your enjoyment because it enables you to download or stream your movie to a computer, mobile device, internet-connected TV, Blu-ray player, or set-top box.']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '6.75 x 5.3 x 0.45 inches; 4.8 Ounces', 'Item model number': 'MHV61130021BR', 'Director': 'Edgar Wright', 'Media Format': 'NTSC, Blu-ray, Widescreen, Ultraviolet', 'Run time': '5 hours and 30 minutes', 'Release date': 'November 19, 2013', 'Actors': 'Simon Pegg, Nick Frost, Kate Ashfield, Paddy Considine, Jim Broadbent', 'Subtitles': 'French, Spanish', 'Producers': 'Nira Park, Tim Bevan, Eric Fellner', 'Language': 'French (DTS 5.1), Spanish (DTS 5.1), English (DTS-HD Master Audio 5.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Simon Pegg, Edgar Wright', 'Country of Origin': 'USA', 'Number of discs': '3'}\nI thought this came with both the Blu-ray discs and Digital versions of all three movies but it only comes with Shaun of the Dead Blu-ray disc and then has all 3 in digital form.\nI thought this came with both the Blu-ray discs and ...\nFx\nBrian Dennehy  (Actor),     Bryan Brown  (Actor),     Robert Mandell  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Rollie Tyler (Bryan Brown) is the best special effects artist in showbiz. But this time it's not the studios seeking him out.... it's the Justice Department. His assignment: to stage an assassination of an important underworld witness. And after he pulls the illusion off making the informant disappear Rollie is dumbfounded to learn that he's being pinned for the murder! Double-crossed and now hunted by those who hired him, Rollie quickly learns that he can trust no one ... and that the only thing left that can save his life is his unequaled mastery of illusion!\"]\n{'Format': 'NTSC', 'Contributor': 'Diane Venora, Robert Mandell, Bryan Brown, Brian Dennehy', 'Runtime': '1 hour and 49 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.86 Ounces', 'Director': 'Robert Mandell', 'Media Format': 'NTSC', 'Run time': '1 hour and 49 minutes', 'Release date': 'June 23, 2011', 'Actors': 'Brian Dennehy, Bryan Brown, Diane Venora', 'Studio': 'Tgg Direct', 'Number of discs': '1'}\nGreat classic movie\nFour Stars",
  "profile": "### Updated User Profile Summary\n\n**User Preferences:**\n\n- **Genre Affinity:** The user continues to engage with classic science fiction and fantasy, while their interest in mystery narratives remains strong. They hold a lasting fondness for iconic franchises and animated content, particularly from the DC Comics universe.\n\n- **Film and Series Characteristics:** They favor character-driven stories filled with action and emotional depth, appreciating intricate narratives that explore significant themes and character development. High-quality storytelling, strong chemistry within ensemble casts, and diverse performances are consistently sought after.\n\n- **Nostalgia:** Recent interactions demonstrate a trend toward revisiting classic films and series, reinforcing their emotional connection to the media they consume and showcasing a love for nostalgia-infused narratives.\n\n- **Review Habits:** The user actively evaluates films and series based on emotional impact and critical acclaim, emphasizing dynamic character interactions. Their reviews indicate a preference for narratives that maintain quality across seasons, as seen in their recent ratings of classic films.\n\n- **Cultural Context:** They appreciate cult classics that delve into mentorship, moral dilemmas, and personal growth, with a newfound fondness for humor-infused stories. Recent purchases reflect their ongoing commitment to narratives that provoke reflection and engagement.\n\nOverall, the user remains dedicated to character-centric narratives imbued with nostalgia, emotional resonance, and thought-provoking themes, consistently seeking entertainment that resonates deeply on multiple levels.",
  "metrics": {
    "rouge1_f": 0.03339882121807466,
    "rouge2_f": 0.004491858506457046,
    "rougeL_f": 0.019927027785573953,
    "meteor": 0.009605974462056435,
    "bleu1": 8.982020396701667e-16,
    "bleu2": 3.57562381938807e-16,
    "bleu3": 9.545585369969228e-17,
    "bleu4": 2.776053563634522e-17,
    "bertscore_precision": 0.34664931893348694,
    "bertscore_recall": 0.5257223844528198,
    "bertscore_f1": 0.41780656576156616
  }
}