{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Batman Beyond - Tech Wars/Disappearing Inque (Animated Double Feature)\nReview Date: 2009/06/29\nStore: Various  (Actor, Director)    Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Anime\nProduct Description: ['Batman Beyond: Tech Wars/Disappearing Inque (DVD) (Multi-Title)', \"Batman Beyond: Disappearing Inque - The Gotham nights give birth to a brand-new super villain. She is deadly, shape-shifting industrial saboteur named Inque. Black Out - When Terry faces Inque for the first time, he finds that he still has a lot to learn about becoming Batman. Disappearing Inque - With the help of an infatuated lab worker, Inque escapes her frozen imprisonment and devises a plan to destroy Batman and Bruce Wayne. Shriek - When Bruce Wayne challenges Derek Powers's control of Wayne/Powers Industries, Powers orders an employee who has discovered sound can be a weapon, to become Shriek and eliminate Wayne. Year: 1999\", ']]>']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Animated', 'Contributor': 'Various', 'Language': 'Unqualified, English (Dolby Digital 4.0)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Animated', 'Run time': '2 hours and 4 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nReview Text: This series has gone back to where Batman the Animated series type of stories and I feel they are the best stories and cartoons.\nReview Title: New Batman Great stories\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "The Beastmaster (Special Edition) [DVD]\nMarc Singer  (Actor),     Tanya Roberts  (Actor),     Don Coscarelli  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"This low-budget entry into the sword-and-sorcery cycle of the early '80s wasn't successful during its initial release, but has steadily built a strong cult following over the years. The Beastmaster tells the story of Dar (Marc Singer), the son of a king who was stolen from his mother's womb by a witch under the command of vicious sorcerer Maax (Rip Torn). A poor villager saves Dar from being sacrificed and raises him as his own son, teaching Dar how to fight and witnessing the boy's ability to telepathically communicate with animals. Their happiness is destroyed when their village is attacked by the evil Jun horde, a race of beast-like warriors controlled by Maax. Dar vows revenge and journeys to his father's former kingdom to destroy Maax. Along the way, he falls in love with gorgeous slave girl Kiri (Tanya Roberts) and teams up with former royal guard Seth (John Amos). Dar also uses his powers to enlist the aid of an eagle, a panther and two adorable ferrets named Kodo and Podo. Together, Dar and his unlikely but brave team square off with Maax in an impressive two-part finale that involves a swordfight on the side of a pyramid and a showdown with the Jun horde near a flaming moat. The resulting film was full of action and eccentric surprises, but failed to make an impression at a box office already glutted with fantasy films. However, The Beastmaster eventually became a serious cult favorite thanks to home video and extensive exposure on cable (it is the second most aired movie on TBS after Gone With the Wind). This enduring popularity led to two sequels and a syndicated television series chronicling the further adventures of Dar.\"]\n{'Genre': 'Fantasy, Romance, Action & Adventure', 'Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Contributor': 'Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Janet Jones, Janet DeMay, Bruce Paul Barbour, Eddy Donno, Jim Driggers, Rip Torn, Gary McLarty, Joshua Milrad, Tim Dunlavey, Billy Hank Hooker, Monty L. Simons, Eddie Hice, John Amos, Tony Epper, Linda Smith, Paul Reynolds, Ralph Strait, Hugh Armstrong, Mick Thibodeau, Jeremy Whelan, Daniel Zormeier, Larry Randles, Vanna Bonta, George Scott (II), Henry Carbo, Vince Deadrick Sr.Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Jan…  See more', 'Language': 'English (DTS ES 6.1), English (THX Surround EX)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.84 Ounces', 'Director': 'Don Coscarelli', 'Media Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Run time': '1 hour and 58 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Marc Singer, Tanya Roberts, Rip Torn, John Amos, Joshua Milrad', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nI love this classic type of Sci-fi movie that was a really well written story.  I know it seems corny now but at the time it was a really cool movie.\nBeastmaster (Special Edition)\nBones: Season 2\nEmily Deschanel  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', 'David Boreanaz (Angel, Buffy the Vampire Slayer) stars as F.B.I. Agent Seeley Booth, who teams up with forensic anthropologist Dr. Temperance \"Bones\" Brennan (Emily Deschanel) to solve some of the most baffling and bizarre crimes ever. Booth depends on clues from the living, witnesses and suspects, while Brennan gathers evidence from the dead, relying on her uncanny ability to read clues left behind in the bones of the victims. Their different investigative styles cause the two to frequently clash, creating an undeniable chemistry and just the right touch of dark humor. Inspired by real-life forensic anthropologist Kathy Reichs and state-of-the-art criminal investigation procedures, Bones is a compelling, cutting edge television.', 'Amazon.com', 'Beginning with the death of a senator and ending with a marriage, the second season of', 'Bones', \"builds on the momentum created during the Fox drama's debut year.\", 'Bones', \"' sophomore season (which includes all 21 episodes that originally aired during 2006-2007) centers on the collaborations between FBI special agent Seeley Booth (David Boreanaz,\", 'Angel', ',', 'Buffy the Vampire Slayer', ') and forensic anthropologist Dr. Temperance Brennan (Emily Deschanel), whom Booth has nicknamed \"Bones.\" While Booth doesn\\'t completely believe in Bones\\' method, he can\\'t argue with her success rate at solving crimes. As for Bones, she is meticulous at what she does and is a borderline genius, but she has issues. Seemingly oblivious to her own good looks, she is all but socially inept. Booth may be blunt, but he\\'s comfortable dealing with the public. Bones, on the other hand, would rather be sequestered away with the dead, trying to figure out what happened before their uncertain deaths. Of course, while viewers can see that Bones and Booth would be a perfect couple, the characters aren\\'t quite there yet. Their friendship becomes a little more complicated this season when it turns out that Bones\\' new demanding boss, Dr. Camille Saroyan (Tamara Taylor), is a former girlfriend of Booth\\'s. And the two women aren\\'t getting along.', \"Still, everyone is able to work together to solve a series of crimes, such as identifying the remains of an all but unidentifiable teenage boy and dealing with a serial killer who is emulating the crimes depicted in Bones' latest mystery novel. (Yes, she's not only a brilliant scientist but also an ace author.) Like many television dramas where forensic evidence is a driving force in the plots,\", 'Bones', \"offers up the gross-out autopsies. But it also serves up a lot of humanity in the way the characters interact with one another. It is giving nothing away to reveal that Bones and Booth are not the couple getting married in the season finale. But the episode does reveal that beneath their tough exteriors, marriage and all that it implies is something they wouldn't mind... perhaps even with each other.\", '--Jae-Ha Kim']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Emily Deschanel', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.48 x 7.65 inches; 6.4 Ounces', 'Item model number': '2246045', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '15 hours and 17 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Emily Deschanel', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nThis series is so interesting with the back and forth play between the characters that it is a great show.\nGreat Series from start to finish\nHarry Potter and the Order of the Phoenix (Two-Disc Special Edition)\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Characters & Series, Harry Potter, Harry Potter and the Order of the Phoenix\n['Product Description', 'Harry Potter and the Order Of The Phoenix: Special Edition (Dbl DVD) (O-Sleeve)', 'Lord Voldemort has returned, but few want to believe it. In fact, the Ministry of Magic is doing everything it can to keep the wizarding world from knowing the truth - including appointing Ministry official Dolores Umbridge as the new Defense Against the Dark Arts teacher at Hogwarts. When Professor Umbridge refuses to train her students in practical defensive magic, a select group of students decides to learn on their own. With Harry Potter as their leader, these students (who call themselves \"Dumbledore\\'s Army\") meet secretly in a hidden room at Hogwarts to hone their wizarding skills in preparation for battle with the Dark Lord and his Death Eaters. . New adventure - more dangerous , more thrilling than ever - is yours in this enthralling film version of the fifth novel in J.K. Rowling\\'s Harry Potter series. A terrifying showdown between good and evil awaits. Prepare for battle!', ']]>', 'Amazon.com', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.\", \"Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper\", 'The Daily Prophet', 'to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.', \"This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a\", 'good', 'movie.', '--Jordan Thompson', 'On the DVD', 'The second disc of', 'The Order of the Phoenix', 'features \"The Hidden Secrets of Harry Potter,\" a retrospective on the series so far, with \"Potter experts\" (i.e., people who run fan sites) weighing in on what\\'s to come. This must have been filmed during production, because all their speculation about the conclusion of the saga is clearly dated and therefore superfluous (since', 'Order', 'released theatrically at the same time as the seventh book, one would\\'ve expected a more current analysis). Many of the deleted scenes are mostly extensions, with the exception of one hilarious take of Professor Trelawney (Emma Thompson) trying--unsuccessfully--to eat gracefully during Dolores Umbridge\\'s introduction at Hogwarts. The chatty actress Natalia Tena, who plays Tonks, gives a tour of the set in \"Trailing Tonks,\" even playing a Christmas song she wrote on her guitar, and director David Yates and editor Mark Day demonstrate editing 101 with a feature that lets you edit your own scene from the movie. Watch the feature but skip the self-editing part; the controls are too complicated to navigate and too frustrating to work properly (plus, hit the wrong button and you\\'ve gone all the way back to the beginning). A digital copy of the movie is also included on the bonus disc.', '--Ellen A. Kim']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Widescreen, NTSC', 'Contributor': 'Rupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Lionel Wigram, Imelda Staunton, David Heyman, David Bradley, Evanna Lynch, Gary Oldman, Dame Maggie Smith, Robert Hardy, David Thewlis, Robbie Coltrane, Alan Rickman, Kathryn Hunter, Ralph Fiennes, George HarrisRupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Li…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.8 Ounces', 'Item model number': '85391174929', 'Director': 'David Yates', 'Media Format': 'Widescreen, NTSC', 'Run time': '2 hours and 19 minutes', 'Release date': 'April 9, 2013', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Helena Bonham Carter, Robbie Coltrane', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Lionel Wigram, David Heyman, David Barron', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Goldenberg', 'Number of discs': '2'}\nThe extras are kind of interesting but this could be the best movie of the 5 right now what can i say.\nHarry Potter 5 What can I say.\nBatman Beyond - The Movie\nWill Friedle  (Actor),     Kevin Conroy  (Actor),     Butch Lukic  (Director),     Curt Geda  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Animation\n['Batman Beyond: The Movie [Import]']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Director': 'Butch Lukic, Curt Geda, Dan Riba, Yukio Suzuki', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, Dubbed, Full Screen, Subtitled, NTSC', 'Run time': '2 hours and 12 minutes', 'Release date': 'December 21, 1999', 'Actors': 'Will Friedle, Kevin Conroy, Sherman Howard, Michael Ansara, Linda Hamilton', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Language': 'French (Dolby Digital 2.0 Stereo), English (Dolby Digital 2.0 Stereo)', 'Studio': 'Warner Home Video', 'Writers': 'Alan Burnett, Bob Kane, Hilary Bader, Jerry Robinson', 'Number of discs': '1'}\nI love this TV series and does a great job to keep Batman around but it also moves from the older Bruce Wayne to a younger character.  The problem that I had wasn't with the movie but when I received it in the mail the case pieces that hold the disc in had broken so that allowed the disc to move all around in the case.  I was able to clean it off but that was the only problem.  I still loved the series and all the others I got.\nLove the show and Batman, but...\nAngel - Seasons 1-4\nBoreanaz, David  (Actor, Director),     Denisof, Alexis  (Actor),     Astin, Sean  (Director),     Fusager, Frederik  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n{'Format': 'NTSC', 'Contributor': \"Boreanaz, David, Astin, Sean, Price, Roger Damon, Semencic, Iva, Fusager, Frederik, Kimble, Robert L., Norton, C. Goodwin, O'Hara (II), Tim, Wheeler, Charlotte, Minello, Gianni, Rao, Mallikarjuna, McGivern, David, Gates, Tudor, Kartheiser, Vincent, Green (VI), Chris, McNab, Mercedes, Denisof, Alexis, Meyer, Werner, Wright (III), Will, Whitmore (II), PeterBoreanaz, David, Astin, Sean, Price, Roger Damon, Semencic, Iva, Fusager, Frederik, Kimble, Robert L., Norton, C. Goodwin, O'Hara (II), Tim, Wheeler, Charlotte, Minello, Gianni, Rao, Mallikarjuna, McGivern, David, Gates, Tudor, Kartheiser, Vincent, Green (VI), Chris, McNab, M…  See more\", 'Language': 'English (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Number Of Discs': '24', 'Publication Date': 'April 12, 2005', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.75 x 6.75 x 6 inches; 4.3 Pounds', 'Director': 'Astin, Sean, Boreanaz, David, Fusager, Frederik, Gates, Tudor, Green (VI), Chris', 'Media Format': 'NTSC', 'Release date': 'April 12, 2005', 'Actors': 'Boreanaz, David, Denisof, Alexis, Kartheiser, Vincent, McNab, Mercedes', 'Subtitles': 'English, Spanish', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '24'}\nThis is an addition to a great universe that Joss has created.  There are so many things that you can get from the series along with a general enjoyment of it.  I wish there were more than the 5 seasons but they will go on for a long time.\nGood Characters Great Stories\nBatman & Mr. Freeze: SubZero / Batman: Mask of the Phantasm\nKevin Conroy  (Actor),     Efrem Zimbalist Jr.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, DC Comics Collection, Batman Animated Movies\n['Batman: Mask of Phantasm Batman and Mr. Freeze: Sub Zero (DVD)', 'Batman: Mask of the Phantasm - When the city’s most feared gangsters are systematically eliminated, the Caped Crusader is blamed. But prowling the Gotham night is a shadowy new villain, the Phantasm, a sinister figure with some link to Batman’s past. Can the Dark Knight elude the police, capture the Phantasm and clear his own name? Unmasking the Phantasm is just one of the twists in this dazzling animated feature. Discover revelations about Batman’s past, his archrival the Joker and Batman’s most grueling battle ever — the choice between his love for a beautiful woman and his vow to be the defender of right. Batman & Mr. Freeze: Subzero - Cold-blooded crime comes to Gotham City: Archvillain Mr. Freeze kidnaps Batgirl, and the Dark Knight and Robin scramble to rescue her before she’s forever iced in the animated chiller-thriller movie Batman and Mr. Freeze Subzero.', ']]>']\n{'Genre': 'Kids & Family', 'Format': 'Full Screen, NTSC', 'Contributor': 'Efrem Zimbalist Jr., Robert Costanzo, Michael Ansara, Bob Hastings, Kevin Conroy, Dana Delany', 'Initial release date': '2008-02-12', 'Language': 'Unqualified (DTS ES 6.1)', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000035736DVD', 'Media Format': 'Full Screen, NTSC', 'Run time': '2 hours and 23 minutes', 'Release date': 'February 12, 2008', 'Actors': 'Kevin Conroy, Efrem Zimbalist Jr., Bob Hastings, Robert Costanzo, Dana Delany', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI got this because of the Mask of Phantasm and when I saw I could get the other one I jumped at the chance.  I really like both of the movie but of course I am a Batman fan.\nTwo great movies on one disc\nRikki Tikki Tavi/Yankee Doodle Cricket\nLes Tremayne  (Actor),     Mel Blanc  (Actor),     Chuck Jones  (Director, Writer)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Animation\n['The original 1976 animated feature Rikki Tikki Tavi along with a bonus cartoon of Yankee Doodle Cricket on the same disc!']\n{'Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC', 'Contributor': 'George Selden, June Foray, Chuck Jones, Les Tremayne, Mel Blanc', 'Language': 'Unqualified', 'Runtime': '30 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': '12236170662', 'Director': 'Chuck Jones', 'Media Format': 'Multiple Formats, Animated, Closed-captioned, Color, NTSC', 'Run time': '30 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Les Tremayne, Mel Blanc, June Foray', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Studio': 'Lionsgate', 'Writers': 'Chuck Jones, George Selden', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt is a great little movie about a story of overcoming odds and to me that means a lot.  Chuck Jones knows his cartoons and knows what kids liked.\nClassic cartoon reminds me of childhood\nBatman Beyond - Tech Wars/Disappearing Inque (Animated Double Feature)\nVarious  (Actor, Director)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Anime\n['Batman Beyond: Tech Wars/Disappearing Inque (DVD) (Multi-Title)', \"Batman Beyond: Disappearing Inque - The Gotham nights give birth to a brand-new super villain. She is deadly, shape-shifting industrial saboteur named Inque. Black Out - When Terry faces Inque for the first time, he finds that he still has a lot to learn about becoming Batman. Disappearing Inque - With the help of an infatuated lab worker, Inque escapes her frozen imprisonment and devises a plan to destroy Batman and Bruce Wayne. Shriek - When Bruce Wayne challenges Derek Powers's control of Wayne/Powers Industries, Powers orders an employee who has discovered sound can be a weapon, to become Shriek and eliminate Wayne. Year: 1999\", ']]>']\n{'Genre': 'Anime & Manga', 'Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Animated', 'Contributor': 'Various', 'Language': 'Unqualified, English (Dolby Digital 4.0)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.72 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, NTSC, Closed-captioned, Animated', 'Run time': '2 hours and 4 minutes', 'Release date': 'August 3, 2004', 'Actors': 'Various', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nThis series has gone back to where Batman the Animated series type of stories and I feel they are the best stories and cartoons.\nNew Batman Great stories",
  "profile": "### Updated User Profile Summary\n\n**User Preferences:**\n\n- **Genre Affinity:** The user exhibits an enduring passion for classic science fiction and fantasy, particularly cherishing iconic franchises and animated adaptations from the DC Comics universe. Their recent purchase reinforces this focus on beloved characters within these genres.\n- **Film and Series Characteristics:** They favor character-driven narratives that intricately blend action with emotional depth, expressing a joy for storytelling that resonates with iconic characters and complex themes of resilience and mentorship. Their latest interaction highlights a preference for narratives reminiscent of earlier animated series.\n- **Nostalgia:** The user retains a profound emotional connection to nostalgic content, particularly from earlier decades, which manifests in their admiration for stories featuring cherished characters. This sentimentality continues to play a significant role in their entertainment choices.\n- **Review Habits:** The user habitually provides high ratings and engages with emotionally resonant narratives. Their latest review reflects their admiration for storytelling reminiscent of classic animated features, reinforcing their appreciation for high-quality narratives.\n- **Cultural Context:** The user enjoys cult-status series that explore themes of mentorship and moral complexity, with a continued attraction to childhood themes of overcoming adversity, further solidifying their commitment to heartwarming stories in animation.\n\nOverall, the user remains deeply invested in character-focused storytelling intertwined with nostalgia and emotionally impactful content.",
  "metrics": {
    "rouge1_f": 0.05724789915966386,
    "rouge2_f": 0.004729374671571204,
    "rougeL_f": 0.032037815126050424,
    "meteor": 0.01680130279984315,
    "bleu1": 6.930268971003418e-09,
    "bleu2": 2.1289941867992986e-09,
    "bleu3": 3.0019337378006397e-10,
    "bleu4": 1.1283089397341772e-10,
    "bertscore_precision": 0.343585729598999,
    "bertscore_recall": 0.5089117288589478,
    "bertscore_f1": 0.4102177917957306
  }
}