{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Bones: Season 2\nReview Date: 2008/01/27\nStore: Emily Deschanel  (Actor)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\nProduct Description: ['Product Description', 'David Boreanaz (Angel, Buffy the Vampire Slayer) stars as F.B.I. Agent Seeley Booth, who teams up with forensic anthropologist Dr. Temperance \"Bones\" Brennan (Emily Deschanel) to solve some of the most baffling and bizarre crimes ever. Booth depends on clues from the living, witnesses and suspects, while Brennan gathers evidence from the dead, relying on her uncanny ability to read clues left behind in the bones of the victims. Their different investigative styles cause the two to frequently clash, creating an undeniable chemistry and just the right touch of dark humor. Inspired by real-life forensic anthropologist Kathy Reichs and state-of-the-art criminal investigation procedures, Bones is a compelling, cutting edge television.', 'Amazon.com', 'Beginning with the death of a senator and ending with a marriage, the second season of', 'Bones', \"builds on the momentum created during the Fox drama's debut year.\", 'Bones', \"' sophomore season (which includes all 21 episodes that originally aired during 2006-2007) centers on the collaborations between FBI special agent Seeley Booth (David Boreanaz,\", 'Angel', ',', 'Buffy the Vampire Slayer', ') and forensic anthropologist Dr. Temperance Brennan (Emily Deschanel), whom Booth has nicknamed \"Bones.\" While Booth doesn\\'t completely believe in Bones\\' method, he can\\'t argue with her success rate at solving crimes. As for Bones, she is meticulous at what she does and is a borderline genius, but she has issues. Seemingly oblivious to her own good looks, she is all but socially inept. Booth may be blunt, but he\\'s comfortable dealing with the public. Bones, on the other hand, would rather be sequestered away with the dead, trying to figure out what happened before their uncertain deaths. Of course, while viewers can see that Bones and Booth would be a perfect couple, the characters aren\\'t quite there yet. Their friendship becomes a little more complicated this season when it turns out that Bones\\' new demanding boss, Dr. Camille Saroyan (Tamara Taylor), is a former girlfriend of Booth\\'s. And the two women aren\\'t getting along.', \"Still, everyone is able to work together to solve a series of crimes, such as identifying the remains of an all but unidentifiable teenage boy and dealing with a serial killer who is emulating the crimes depicted in Bones' latest mystery novel. (Yes, she's not only a brilliant scientist but also an ace author.) Like many television dramas where forensic evidence is a driving force in the plots,\", 'Bones', \"offers up the gross-out autopsies. But it also serves up a lot of humanity in the way the characters interact with one another. It is giving nothing away to reveal that Bones and Booth are not the couple getting married in the season finale. But the episode does reveal that beneath their tough exteriors, marriage and all that it implies is something they wouldn't mind... perhaps even with each other.\", '--Jae-Ha Kim']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Emily Deschanel', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.48 x 7.65 inches; 6.4 Ounces', 'Item model number': '2246045', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '15 hours and 17 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Emily Deschanel', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nReview Text: This series is so interesting with the back and forth play between the characters that it is a great show.\nReview Title: Great Series from start to finish\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Beastmaster (Special Edition) [DVD]\nMarc Singer  (Actor),     Tanya Roberts  (Actor),     Don Coscarelli  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"This low-budget entry into the sword-and-sorcery cycle of the early '80s wasn't successful during its initial release, but has steadily built a strong cult following over the years. The Beastmaster tells the story of Dar (Marc Singer), the son of a king who was stolen from his mother's womb by a witch under the command of vicious sorcerer Maax (Rip Torn). A poor villager saves Dar from being sacrificed and raises him as his own son, teaching Dar how to fight and witnessing the boy's ability to telepathically communicate with animals. Their happiness is destroyed when their village is attacked by the evil Jun horde, a race of beast-like warriors controlled by Maax. Dar vows revenge and journeys to his father's former kingdom to destroy Maax. Along the way, he falls in love with gorgeous slave girl Kiri (Tanya Roberts) and teams up with former royal guard Seth (John Amos). Dar also uses his powers to enlist the aid of an eagle, a panther and two adorable ferrets named Kodo and Podo. Together, Dar and his unlikely but brave team square off with Maax in an impressive two-part finale that involves a swordfight on the side of a pyramid and a showdown with the Jun horde near a flaming moat. The resulting film was full of action and eccentric surprises, but failed to make an impression at a box office already glutted with fantasy films. However, The Beastmaster eventually became a serious cult favorite thanks to home video and extensive exposure on cable (it is the second most aired movie on TBS after Gone With the Wind). This enduring popularity led to two sequels and a syndicated television series chronicling the further adventures of Dar.\"]\n{'Genre': 'Fantasy, Romance, Action & Adventure', 'Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Contributor': 'Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Janet Jones, Janet DeMay, Bruce Paul Barbour, Eddy Donno, Jim Driggers, Rip Torn, Gary McLarty, Joshua Milrad, Tim Dunlavey, Billy Hank Hooker, Monty L. Simons, Eddie Hice, John Amos, Tony Epper, Linda Smith, Paul Reynolds, Ralph Strait, Hugh Armstrong, Mick Thibodeau, Jeremy Whelan, Daniel Zormeier, Larry Randles, Vanna Bonta, George Scott (II), Henry Carbo, Vince Deadrick Sr.Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Jan…  See more', 'Language': 'English (DTS ES 6.1), English (THX Surround EX)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.84 Ounces', 'Director': 'Don Coscarelli', 'Media Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Run time': '1 hour and 58 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Marc Singer, Tanya Roberts, Rip Torn, John Amos, Joshua Milrad', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nI love this classic type of Sci-fi movie that was a really well written story.  I know it seems corny now but at the time it was a really cool movie.\nBeastmaster (Special Edition)\nBones: Season 2\nEmily Deschanel  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', 'David Boreanaz (Angel, Buffy the Vampire Slayer) stars as F.B.I. Agent Seeley Booth, who teams up with forensic anthropologist Dr. Temperance \"Bones\" Brennan (Emily Deschanel) to solve some of the most baffling and bizarre crimes ever. Booth depends on clues from the living, witnesses and suspects, while Brennan gathers evidence from the dead, relying on her uncanny ability to read clues left behind in the bones of the victims. Their different investigative styles cause the two to frequently clash, creating an undeniable chemistry and just the right touch of dark humor. Inspired by real-life forensic anthropologist Kathy Reichs and state-of-the-art criminal investigation procedures, Bones is a compelling, cutting edge television.', 'Amazon.com', 'Beginning with the death of a senator and ending with a marriage, the second season of', 'Bones', \"builds on the momentum created during the Fox drama's debut year.\", 'Bones', \"' sophomore season (which includes all 21 episodes that originally aired during 2006-2007) centers on the collaborations between FBI special agent Seeley Booth (David Boreanaz,\", 'Angel', ',', 'Buffy the Vampire Slayer', ') and forensic anthropologist Dr. Temperance Brennan (Emily Deschanel), whom Booth has nicknamed \"Bones.\" While Booth doesn\\'t completely believe in Bones\\' method, he can\\'t argue with her success rate at solving crimes. As for Bones, she is meticulous at what she does and is a borderline genius, but she has issues. Seemingly oblivious to her own good looks, she is all but socially inept. Booth may be blunt, but he\\'s comfortable dealing with the public. Bones, on the other hand, would rather be sequestered away with the dead, trying to figure out what happened before their uncertain deaths. Of course, while viewers can see that Bones and Booth would be a perfect couple, the characters aren\\'t quite there yet. Their friendship becomes a little more complicated this season when it turns out that Bones\\' new demanding boss, Dr. Camille Saroyan (Tamara Taylor), is a former girlfriend of Booth\\'s. And the two women aren\\'t getting along.', \"Still, everyone is able to work together to solve a series of crimes, such as identifying the remains of an all but unidentifiable teenage boy and dealing with a serial killer who is emulating the crimes depicted in Bones' latest mystery novel. (Yes, she's not only a brilliant scientist but also an ace author.) Like many television dramas where forensic evidence is a driving force in the plots,\", 'Bones', \"offers up the gross-out autopsies. But it also serves up a lot of humanity in the way the characters interact with one another. It is giving nothing away to reveal that Bones and Booth are not the couple getting married in the season finale. But the episode does reveal that beneath their tough exteriors, marriage and all that it implies is something they wouldn't mind... perhaps even with each other.\", '--Jae-Ha Kim']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Emily Deschanel', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.48 x 7.65 inches; 6.4 Ounces', 'Item model number': '2246045', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '15 hours and 17 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Emily Deschanel', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nThis series is so interesting with the back and forth play between the characters that it is a great show.\nGreat Series from start to finish",
  "profile": "### Updated User Profile Summary\n\n**User Preferences:**\n\n- **Genre Affinity:** Maintains a strong interest in classic science fiction and fantasy films, particularly those with cult followings, as well as engaging television series with compelling narratives.\n- **Film and Series Characteristics:** Prefers well-written, character-driven stories that feature action, adventure, and an element of romance, appreciating both film and television for their character dynamics and engaging plots.\n- **Nostalgia:** Values classic content, which suggests a fondness for older films and series from the '80s and earlier, relishing in their storytelling and entertainment value.\n- **Review Habits:** Tends to rate content highly, as demonstrated by a 5.0 rating for a beloved title, indicating positive engagement with emotionally resonant material. Recent reviews highlight a preference for series that balance character chemistry with interesting storytelling.\n- **Cultural Context:** Enjoys films and series that have gained cult status and sentimentality, reflecting on past viewing experiences and connections to cherished characters.\n\nThis user exhibits a consistent pattern of enjoying narratives—both in movies and television—that blend engaging characters with compelling plots, showcasing a deeper emotional connection to the stories they appreciate.",
  "metrics": {
    "rouge1_f": 0.12871287128712872,
    "rouge2_f": 0.01558073654390935,
    "rougeL_f": 0.06506364922206506,
    "meteor": 0.04249593893813049,
    "bleu1": 0.001071352142339971,
    "bleu2": 0.00028549179638070863,
    "bleu3": 4.46413578114594e-05,
    "bleu4": 1.7671697877415003e-05,
    "bertscore_precision": 0.34516289830207825,
    "bertscore_recall": 0.4872901439666748,
    "bertscore_f1": 0.4040936231613159
  }
}