{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Harry Potter and the Order of the Phoenix (Two-Disc Special Edition)\nReview Date: 2008/01/27\nStore: Daniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Characters & Series, Harry Potter, Harry Potter and the Order of the Phoenix\nProduct Description: ['Product Description', 'Harry Potter and the Order Of The Phoenix: Special Edition (Dbl DVD) (O-Sleeve)', 'Lord Voldemort has returned, but few want to believe it. In fact, the Ministry of Magic is doing everything it can to keep the wizarding world from knowing the truth - including appointing Ministry official Dolores Umbridge as the new Defense Against the Dark Arts teacher at Hogwarts. When Professor Umbridge refuses to train her students in practical defensive magic, a select group of students decides to learn on their own. With Harry Potter as their leader, these students (who call themselves \"Dumbledore\\'s Army\") meet secretly in a hidden room at Hogwarts to hone their wizarding skills in preparation for battle with the Dark Lord and his Death Eaters. . New adventure - more dangerous , more thrilling than ever - is yours in this enthralling film version of the fifth novel in J.K. Rowling\\'s Harry Potter series. A terrifying showdown between good and evil awaits. Prepare for battle!', ']]>', 'Amazon.com', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.\", \"Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper\", 'The Daily Prophet', 'to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.', \"This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a\", 'good', 'movie.', '--Jordan Thompson', 'On the DVD', 'The second disc of', 'The Order of the Phoenix', 'features \"The Hidden Secrets of Harry Potter,\" a retrospective on the series so far, with \"Potter experts\" (i.e., people who run fan sites) weighing in on what\\'s to come. This must have been filmed during production, because all their speculation about the conclusion of the saga is clearly dated and therefore superfluous (since', 'Order', 'released theatrically at the same time as the seventh book, one would\\'ve expected a more current analysis). Many of the deleted scenes are mostly extensions, with the exception of one hilarious take of Professor Trelawney (Emma Thompson) trying--unsuccessfully--to eat gracefully during Dolores Umbridge\\'s introduction at Hogwarts. The chatty actress Natalia Tena, who plays Tonks, gives a tour of the set in \"Trailing Tonks,\" even playing a Christmas song she wrote on her guitar, and director David Yates and editor Mark Day demonstrate editing 101 with a feature that lets you edit your own scene from the movie. Watch the feature but skip the self-editing part; the controls are too complicated to navigate and too frustrating to work properly (plus, hit the wrong button and you\\'ve gone all the way back to the beginning). A digital copy of the movie is also included on the bonus disc.', '--Ellen A. Kim']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Widescreen, NTSC', 'Contributor': 'Rupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Lionel Wigram, Imelda Staunton, David Heyman, David Bradley, Evanna Lynch, Gary Oldman, Dame Maggie Smith, Robert Hardy, David Thewlis, Robbie Coltrane, Alan Rickman, Kathryn Hunter, Ralph Fiennes, George HarrisRupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Li…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.8 Ounces', 'Item model number': '85391174929', 'Director': 'David Yates', 'Media Format': 'Widescreen, NTSC', 'Run time': '2 hours and 19 minutes', 'Release date': 'April 9, 2013', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Helena Bonham Carter, Robbie Coltrane', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Lionel Wigram, David Heyman, David Barron', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Goldenberg', 'Number of discs': '2'}\nReview Text: The extras are kind of interesting but this could be the best movie of the 5 right now what can i say.\nReview Title: Harry Potter 5 What can I say.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Beastmaster (Special Edition) [DVD]\nMarc Singer  (Actor),     Tanya Roberts  (Actor),     Don Coscarelli  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n[\"This low-budget entry into the sword-and-sorcery cycle of the early '80s wasn't successful during its initial release, but has steadily built a strong cult following over the years. The Beastmaster tells the story of Dar (Marc Singer), the son of a king who was stolen from his mother's womb by a witch under the command of vicious sorcerer Maax (Rip Torn). A poor villager saves Dar from being sacrificed and raises him as his own son, teaching Dar how to fight and witnessing the boy's ability to telepathically communicate with animals. Their happiness is destroyed when their village is attacked by the evil Jun horde, a race of beast-like warriors controlled by Maax. Dar vows revenge and journeys to his father's former kingdom to destroy Maax. Along the way, he falls in love with gorgeous slave girl Kiri (Tanya Roberts) and teams up with former royal guard Seth (John Amos). Dar also uses his powers to enlist the aid of an eagle, a panther and two adorable ferrets named Kodo and Podo. Together, Dar and his unlikely but brave team square off with Maax in an impressive two-part finale that involves a swordfight on the side of a pyramid and a showdown with the Jun horde near a flaming moat. The resulting film was full of action and eccentric surprises, but failed to make an impression at a box office already glutted with fantasy films. However, The Beastmaster eventually became a serious cult favorite thanks to home video and extensive exposure on cable (it is the second most aired movie on TBS after Gone With the Wind). This enduring popularity led to two sequels and a syndicated television series chronicling the further adventures of Dar.\"]\n{'Genre': 'Fantasy, Romance, Action & Adventure', 'Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Contributor': 'Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Janet Jones, Janet DeMay, Bruce Paul Barbour, Eddy Donno, Jim Driggers, Rip Torn, Gary McLarty, Joshua Milrad, Tim Dunlavey, Billy Hank Hooker, Monty L. Simons, Eddie Hice, John Amos, Tony Epper, Linda Smith, Paul Reynolds, Ralph Strait, Hugh Armstrong, Mick Thibodeau, Jeremy Whelan, Daniel Zormeier, Larry Randles, Vanna Bonta, George Scott (II), Henry Carbo, Vince Deadrick Sr.Tanya Roberts, Kim Tabet, Ben Hammer, Marc Singer, Christine Kellogg, Billy Jayne, Dale Shawver, Rod Loomis, Chuck Hicks, Freddie Hice, Jonathan Gravish, Richard Humphreys, Fess Reynolds, Don Heyn, Mike Kirton, Diamond Farnsworth, Don Coscarelli, Tommy J. Huff, Jan…  See more', 'Language': 'English (DTS ES 6.1), English (THX Surround EX)', 'Runtime': '1 hour and 58 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'Yes', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.75 inches; 3.84 Ounces', 'Director': 'Don Coscarelli', 'Media Format': 'Color, Dolby, DTS Surround Sound, DVD, Widescreen, NTSC, Special Edition', 'Run time': '1 hour and 58 minutes', 'Release date': 'January 25, 2005', 'Actors': 'Marc Singer, Tanya Roberts, Rip Torn, John Amos, Joshua Milrad', 'Studio': 'Starz / Anchor Bay', 'Number of discs': '1'}\nI love this classic type of Sci-fi movie that was a really well written story.  I know it seems corny now but at the time it was a really cool movie.\nBeastmaster (Special Edition)\nBones: Season 2\nEmily Deschanel  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Fox TV, General\n['Product Description', 'David Boreanaz (Angel, Buffy the Vampire Slayer) stars as F.B.I. Agent Seeley Booth, who teams up with forensic anthropologist Dr. Temperance \"Bones\" Brennan (Emily Deschanel) to solve some of the most baffling and bizarre crimes ever. Booth depends on clues from the living, witnesses and suspects, while Brennan gathers evidence from the dead, relying on her uncanny ability to read clues left behind in the bones of the victims. Their different investigative styles cause the two to frequently clash, creating an undeniable chemistry and just the right touch of dark humor. Inspired by real-life forensic anthropologist Kathy Reichs and state-of-the-art criminal investigation procedures, Bones is a compelling, cutting edge television.', 'Amazon.com', 'Beginning with the death of a senator and ending with a marriage, the second season of', 'Bones', \"builds on the momentum created during the Fox drama's debut year.\", 'Bones', \"' sophomore season (which includes all 21 episodes that originally aired during 2006-2007) centers on the collaborations between FBI special agent Seeley Booth (David Boreanaz,\", 'Angel', ',', 'Buffy the Vampire Slayer', ') and forensic anthropologist Dr. Temperance Brennan (Emily Deschanel), whom Booth has nicknamed \"Bones.\" While Booth doesn\\'t completely believe in Bones\\' method, he can\\'t argue with her success rate at solving crimes. As for Bones, she is meticulous at what she does and is a borderline genius, but she has issues. Seemingly oblivious to her own good looks, she is all but socially inept. Booth may be blunt, but he\\'s comfortable dealing with the public. Bones, on the other hand, would rather be sequestered away with the dead, trying to figure out what happened before their uncertain deaths. Of course, while viewers can see that Bones and Booth would be a perfect couple, the characters aren\\'t quite there yet. Their friendship becomes a little more complicated this season when it turns out that Bones\\' new demanding boss, Dr. Camille Saroyan (Tamara Taylor), is a former girlfriend of Booth\\'s. And the two women aren\\'t getting along.', \"Still, everyone is able to work together to solve a series of crimes, such as identifying the remains of an all but unidentifiable teenage boy and dealing with a serial killer who is emulating the crimes depicted in Bones' latest mystery novel. (Yes, she's not only a brilliant scientist but also an ace author.) Like many television dramas where forensic evidence is a driving force in the plots,\", 'Bones', \"offers up the gross-out autopsies. But it also serves up a lot of humanity in the way the characters interact with one another. It is giving nothing away to reveal that Bones and Booth are not the couple getting married in the season finale. But the episode does reveal that beneath their tough exteriors, marriage and all that it implies is something they wouldn't mind... perhaps even with each other.\", '--Jae-Ha Kim']\n{'Genre': 'Television/Crime', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Emily Deschanel', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '6', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.94 x 5.48 x 7.65 inches; 6.4 Ounces', 'Item model number': '2246045', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '15 hours and 17 minutes', 'Release date': 'September 11, 2007', 'Actors': 'Emily Deschanel', 'Subtitles': 'English, Spanish, French', 'Studio': '20th Century Fox', 'Number of discs': '6'}\nThis series is so interesting with the back and forth play between the characters that it is a great show.\nGreat Series from start to finish\nHarry Potter and the Order of the Phoenix (Two-Disc Special Edition)\nDaniel Radcliffe  (Actor),     Rupert Grint  (Actor),     David Yates  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Characters & Series, Harry Potter, Harry Potter and the Order of the Phoenix\n['Product Description', 'Harry Potter and the Order Of The Phoenix: Special Edition (Dbl DVD) (O-Sleeve)', 'Lord Voldemort has returned, but few want to believe it. In fact, the Ministry of Magic is doing everything it can to keep the wizarding world from knowing the truth - including appointing Ministry official Dolores Umbridge as the new Defense Against the Dark Arts teacher at Hogwarts. When Professor Umbridge refuses to train her students in practical defensive magic, a select group of students decides to learn on their own. With Harry Potter as their leader, these students (who call themselves \"Dumbledore\\'s Army\") meet secretly in a hidden room at Hogwarts to hone their wizarding skills in preparation for battle with the Dark Lord and his Death Eaters. . New adventure - more dangerous , more thrilling than ever - is yours in this enthralling film version of the fifth novel in J.K. Rowling\\'s Harry Potter series. A terrifying showdown between good and evil awaits. Prepare for battle!', ']]>', 'Amazon.com', 'Alas! The fifth', 'Harry Potter', 'film has arrived. The time is long past that this can be considered a simple \"children\\'s\" series--though children and adults alike will enjoy it immensely. Starting off from the dark and tragic ending of the fourth film,', 'Harry Potter and the Order of the Phoenix', 'begins in a somber and angst-filled tone that carries through the entire 138 minutes (the shortest of any', 'HP', \"movie despite being adapted from the longest book). Hopes of winning the Quidditch Cup have been replaced by woes like government corruption, distorted media spin, and the casualties of war. As the themes have matured, so have the primary characters' acting abilities. Ron (Rupert Grint), Hermione (Emma Watson), and especially Harry (Daniel Radcliffe) are more convincing than ever--in roles that are more demanding.\", \"Harry is deeply traumatized from having witnessed Cedric Diggory's murder, but he will soon find that this was just another chapter in the continuing loss he will endure. Lord Voldemort (Ralph Fiennes) has returned and, in an attempt to conceal this catastrophe from the wizarding public, the Ministry of Magic has teamed up with the wizard newspaper\", 'The Daily Prophet', 'to smear young Potter and wise Dumbledore (Michael Gambon)--seemingly the only two people in the public eye who believe the Dark Lord has returned. With no one else to stand against the wicked Death Eaters, the Hogwarts headmaster is forced to revive his secret anti-Voldemort society, the Order of the Phoenix. This welcomes back characters like Mad-Eye Moody (Brendan Gleeson), kind Remus Lupin (David Thewlis), fatherly Sirius Black (Gary Oldman), and insidious Severus Snape (Alan Rickman), and introduces a short list of intriguing new faces. In the meantime, a semi-psychotic bureaucrat from the Ministry (brilliantly portrayed by Imelda Staunton) has seized power at Hogwarts, and Harry is forced to form a secret society of his own--lest the other young wizards at his school be left ill-equipped to defend themselves in the looming war between good and evil. In addition, Harry is filled with an inexplicable rage that only his Godfather Sirius seems to be able to understand.', \"This film, though not as frightening as its predecessor, earns its PG-13 rating mostly because of the ever-darkening tone. As always, the loyal fans of J.K. Rowling's books will suffer huge cuts from the original plot and character developments, but make no mistake: this is a\", 'good', 'movie.', '--Jordan Thompson', 'On the DVD', 'The second disc of', 'The Order of the Phoenix', 'features \"The Hidden Secrets of Harry Potter,\" a retrospective on the series so far, with \"Potter experts\" (i.e., people who run fan sites) weighing in on what\\'s to come. This must have been filmed during production, because all their speculation about the conclusion of the saga is clearly dated and therefore superfluous (since', 'Order', 'released theatrically at the same time as the seventh book, one would\\'ve expected a more current analysis). Many of the deleted scenes are mostly extensions, with the exception of one hilarious take of Professor Trelawney (Emma Thompson) trying--unsuccessfully--to eat gracefully during Dolores Umbridge\\'s introduction at Hogwarts. The chatty actress Natalia Tena, who plays Tonks, gives a tour of the set in \"Trailing Tonks,\" even playing a Christmas song she wrote on her guitar, and director David Yates and editor Mark Day demonstrate editing 101 with a feature that lets you edit your own scene from the movie. Watch the feature but skip the self-editing part; the controls are too complicated to navigate and too frustrating to work properly (plus, hit the wrong button and you\\'ve gone all the way back to the beginning). A digital copy of the movie is also included on the bonus disc.', '--Ellen A. Kim']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'Widescreen, NTSC', 'Contributor': 'Rupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Lionel Wigram, Imelda Staunton, David Heyman, David Bradley, Evanna Lynch, Gary Oldman, Dame Maggie Smith, Robert Hardy, David Thewlis, Robbie Coltrane, Alan Rickman, Kathryn Hunter, Ralph Fiennes, George HarrisRupert Grint, Emma Watson, David Barron, Emma Thompson, Richard Griffiths, Fiona Shaw, Julie Walters, Mark Williams, Michael Goldenberg, Daniel Radcliffe, Brendan Gleeson, Helena Bonham Carter, David Yates, Jason Isaacs, Natalia Tena, Warwick Davis, Michael Gambon, Li…   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 4.8 Ounces', 'Item model number': '85391174929', 'Director': 'David Yates', 'Media Format': 'Widescreen, NTSC', 'Run time': '2 hours and 19 minutes', 'Release date': 'April 9, 2013', 'Actors': 'Daniel Radcliffe, Rupert Grint, Emma Watson, Helena Bonham Carter, Robbie Coltrane', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, French, Spanish', 'Producers': 'Lionel Wigram, David Heyman, David Barron', 'Studio': 'WarnerBrothers', 'Writers': 'Michael Goldenberg', 'Number of discs': '2'}\nThe extras are kind of interesting but this could be the best movie of the 5 right now what can i say.\nHarry Potter 5 What can I say.",
  "profile": "### Updated User Profile Summary\n\n**User Preferences:**\n\n- **Genre Affinity:** Demonstrates a robust enthusiasm for classic science fiction and fantasy films, especially those with cult followings. Recently reinforced interest in the Harry Potter series, indicative of a broader affinity for beloved franchise narratives.\n- **Film and Series Characteristics:** Continues to favor well-written, character-driven stories that blend action, adventure, and romance, appreciating the intricate character dynamics and engaging plots.\n- **Nostalgia:** Maintains a strong appreciation for classic content, particularly films and series from the '80s and earlier, highlighting a sentimental connection to nostalgia-rich storytelling.\n- **Review Habits:** Frequently rates content highly, with recent interactions indicating a tendency to engage deeply with emotionally resonant material. The user has awarded a perfect score to a recent favorite, showcasing alignment with their long-standing appreciation for quality narratives and character chemistry.\n- **Cultural Context:** Enjoys films and series that have achieved cult status, reflecting sentimental ties to past viewing experiences and connections to cherished characters. The new interaction suggests a solidified interest in series and films that resonate with themes of friendship, bravery, and the battle between good and evil.\n\nThis user continues to exemplify a consistent pattern of valuing engaging narratives that intertwine compelling characters with intricate plots, forging a deeper emotional connection to the stories they adore.",
  "metrics": {
    "rouge1_f": 0.09754163362410785,
    "rouge2_f": 0.016666666666666666,
    "rougeL_f": 0.05154639175257732,
    "meteor": 0.029893124861526097,
    "bleu1": 1.5169113557808532e-05,
    "bleu2": 6.325260634202793e-06,
    "bleu3": 2.8874077544123946e-06,
    "bleu4": 1.552906718927008e-06,
    "bertscore_precision": 0.3620048761367798,
    "bertscore_recall": 0.5139119029045105,
    "bertscore_f1": 0.4247860610485077
  }
}