{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Facial Skincare,Cucumber Essence Hydrating Moisturizing Revitalizing Hydration Fruit Extract Deep Cleaning Facial Skincare Sheet for All Skin Type Care, 35ml/1.18oz, Pack of 5\nReview Date: 2020/10/29\nStore: PalNour\nAverage Rating: 4.3\nProduct Details: {}\nReview Text: Smells good and works wonders on your skin!<br /><br />Having combination skin I lack moisture in my t-zone so this mask really helped to rehydrate my skin!\nReview Title: Hydrating!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nI strive to buy products that will cut costs in the long run but that also help the environment. I wear makeup every day and use cotton rounds to remove my makeup which can cost a lot overly time. I switched to these reusable wash pads and not only are they easy to hold because of the hook but they remove my makeup without being harsh on my skin. The wash bag makes it easy to just throw in the washer and protect the quality of the cloths just as I would use for delicates.\nDurable pads for everyday makeup use\nAmtidy Solid Color Vintage Modern Style Elastic Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nAmtidy\n{'Material': 'Rubber', 'Fabric Type': 'Elastic', 'Brand': 'Amtidy', 'Item Form': 'Spiral', 'Unit Count': '10.00 Count', 'Package Dimensions': '11.65 x 5.63 x 3.23 inches; 12.03 Ounces', 'UPC': '782931993780'}\nI love the variety of colors that can fit through the whole year. Living in Florida is very humid most of the year so having headbands to keep your hair away from your face but still adds style to your outfits. They are double lined and super stretchy. I love the vibrant colors and the warmer tones.\nComfortable + great for all seasons\nBEYELIAN Lash Shampoo with Brush Eyelash Extension Cleanser Eyelid Foaming Cleanser Lash Foam Shampoo Makeup Remover - For Home & Salon Use\nBEYELIAN\n{'Package Dimensions': '6.5 x 1.7 x 1.1 inches; 1.94 Ounces'}\nI’ve recently had lash extensions put on for the first time and it’s been an adjustment to care for them and find a product that doesn’t pull lashes while cleaning my makeup off. This is perfect for traveling or carrying in your purse! I highly recommend this because it doesn’t irritate my sensitive eyes and wipes away my makeup after one wash!\nGood lash cleaner!\nFacial Skincare,Cucumber Essence Hydrating Moisturizing Revitalizing Hydration Fruit Extract Deep Cleaning Facial Skincare Sheet for All Skin Type Care, 35ml/1.18oz, Pack of 5\nPalNour\n{}\nSmells good and works wonders on your skin!<br /><br />Having combination skin I lack moisture in my t-zone so this mask really helped to rehydrate my skin!\nHydrating!",
  "profile": "**User Summary:**\n\n- **Eco-Conscious:** Prefers environmentally friendly products that offer cost savings and sustainability over time. \n- **Everyday Makeup User:** Incorporates makeup removal into daily routines, valuing practical and effective beauty accessories.\n- **Preference for Reusability:** Favors reusable items over single-use options, aligning with a commitment to sustainable skincare and beauty practices. \n- **Gentle on Skin:** Prioritizes products that are effective yet gentle, indicating a strong concern for skin health and comfort. \n- **Convenience Seekers:** Appreciates easy maintenance and practical solutions, preferring versatile and durable items suitable for various seasons and climates.\n- **Positive Product Experience:** Reports satisfaction with product durability and effectiveness, showing a tendency to choose reliable and highly rated items. \n- **Recent Focus on Eye Care:** Recently demonstrated an interest in products specifically designed for eyelash care, highlighting a desire for gentler cleaning options that accommodate sensitive skin and enhance makeup removal efficiency.\n- **Skincare Enthusiast:** Recently explored hydrating skincare solutions, particularly those that cater to combination skin, indicating a commitment to maintaining skin hydration and health.\n- **Fashion-Forward:** Shows a keen interest in stylish hair accessories that add flair while serving functional purposes, particularly in humid environments.\n\nOverall, this user values sustainability, convenience, and effective, skin-friendly solutions in beauty and skincare, while also embracing fashionable yet practical accessories that enhance their everyday look. Their recent interest in hydrating products emphasizes their dedication to nurturing their skin, especially in relation to moisture balance.",
  "metrics": {
    "rouge1_f": 0.25406203840472674,
    "rouge2_f": 0.023703703703703706,
    "rougeL_f": 0.10635155096011815,
    "meteor": 0.1318378591105864,
    "bleu1": 0.16255346381307717,
    "bleu2": 0.027922472519056926,
    "bleu3": 0.005000716492965801,
    "bleu4": 0.0021179817714788943,
    "bertscore_precision": 0.39673978090286255,
    "bertscore_recall": 0.4583559036254883,
    "bertscore_f1": 0.4253278970718384
  }
}