{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 26 pcs letters Hairpin, hair clips for women hair accessories, DIY barrettes\nReview Date: 2021/03/29\nStore: JEBDY RUBBY\nAverage Rating: 3.5\nProduct Details: {'Brand': 'JEBDY RUBBY', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Metal', 'Unit Count': '26.00 Count', 'Package Dimensions': '3.27 x 3.23 x 1.26 inches; 2.08 Ounces'}\nReview Text: [[VIDEOID:aeba6b8cba447789a6a04eee5e7f9abe]] These alphabet hair clips are great for writing out your name or nickname! They are easy to read and are vibrant with dark hair.\nReview Title: Cute hair detail!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nI strive to buy products that will cut costs in the long run but that also help the environment. I wear makeup every day and use cotton rounds to remove my makeup which can cost a lot overly time. I switched to these reusable wash pads and not only are they easy to hold because of the hook but they remove my makeup without being harsh on my skin. The wash bag makes it easy to just throw in the washer and protect the quality of the cloths just as I would use for delicates.\nDurable pads for everyday makeup use\nAmtidy Solid Color Vintage Modern Style Elastic Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nAmtidy\n{'Material': 'Rubber', 'Fabric Type': 'Elastic', 'Brand': 'Amtidy', 'Item Form': 'Spiral', 'Unit Count': '10.00 Count', 'Package Dimensions': '11.65 x 5.63 x 3.23 inches; 12.03 Ounces', 'UPC': '782931993780'}\nI love the variety of colors that can fit through the whole year. Living in Florida is very humid most of the year so having headbands to keep your hair away from your face but still adds style to your outfits. They are double lined and super stretchy. I love the vibrant colors and the warmer tones.\nComfortable + great for all seasons\nBEYELIAN Lash Shampoo with Brush Eyelash Extension Cleanser Eyelid Foaming Cleanser Lash Foam Shampoo Makeup Remover - For Home & Salon Use\nBEYELIAN\n{'Package Dimensions': '6.5 x 1.7 x 1.1 inches; 1.94 Ounces'}\nI’ve recently had lash extensions put on for the first time and it’s been an adjustment to care for them and find a product that doesn’t pull lashes while cleaning my makeup off. This is perfect for traveling or carrying in your purse! I highly recommend this because it doesn’t irritate my sensitive eyes and wipes away my makeup after one wash!\nGood lash cleaner!\nFacial Skincare,Cucumber Essence Hydrating Moisturizing Revitalizing Hydration Fruit Extract Deep Cleaning Facial Skincare Sheet for All Skin Type Care, 35ml/1.18oz, Pack of 5\nPalNour\n{}\nSmells good and works wonders on your skin!<br /><br />Having combination skin I lack moisture in my t-zone so this mask really helped to rehydrate my skin!\nHydrating!\nDr.Althea Multi-Action Infusion Serum - 56 Packets of Light weight Gel Serum\nDr.Althea\n{'Skin Type': 'All', 'Brand': 'Dr.Althea', 'Item Form': 'Gel', 'Material Feature': 'Natural', 'Recommended Uses For Product': 'Protein,Calluses,Anti-aging', 'Package Dimensions': '6.8 x 5.7 x 1.3 inches; 5.61 Ounces'}\nI’ve been carrying these individually packaged serums for after a workout. I’ve been wearing masks for long periods of time and I’ve noticed my skin needed a little tlc. I’ve been washing my face more times a day and applying this serum all over my face and neck. I’ve noticed my skin looks brighter and hydrated since using this product.\nGlowing skin!\nMulticolors Crimped Bobby Pins, 96 Counts 2 Inches Non Slip Grip Hair Pins For Women, Safe Rubber Tips & Strong Grip Bob Pins, Bobby Pins Blonde, Black, Brown, Green\nDARONGFENG\n{'Brand': 'DARONGFENG', 'Hair Type': 'All', 'Color': 'Gray,Green,Brown', 'Age Range (Description)': 'Adult', 'Material': 'Metal, Rubber', 'Package Dimensions': '4.8 x 3.8 x 0.7 inches; 3.21 Ounces', 'Item model number': 'Hair pins-D96-4', 'UPC': '741416436082'}\n[[VIDEOID:2cdede7e71d7fcbe49c85fc3e6dd4373]] These Bobby pins are great to have if you want them to blend in with your hair color or give you a pop of color. I have almost jet black hair so using the gold Bobby pins with gold accessories looks really nice. Can’t wait to try different styles with the Bobby pins besides the cross cross I’ve been doing.\nGreat variety pack!\nEmpty Amber Glass Spray Bottles - (4 Pack) 16 oz with Labels Refillable Container for Essential Oils, Cleaning Solutions, Cleaning Products, Hair, Plant Mister, Daily Shower, Gardening or Aromatherapy\nAYL\n{'Brand': 'AYL', 'Material': 'Glass', 'Capacity': '16 Ounces', 'Number of Items': '4', 'Product Care Instructions': 'Hand Wash Only', 'Package Dimensions': '9.88 x 7.6 x 7.17 inches; 2.98 Pounds', 'Item model number': 'EmptyAmberGlassSprayBottles 4 Pack', 'UPC': '860005177202'}\n[[VIDEOID:c6772df5dbc6852104055655b1eb7]] These bottles are great for having a cohesive style of spray bottles for all of your home cleaning sprays. You can make your own labels with a label maker or even print some on a thicker paper and tape them to the bottles. I’ve been making my own sprays for cleaning using essential oils. I want to have more nautical products to deep clean my house. The lids are great for back up cleaning supplies and the funnel is so helpful for little to no waste.\nGreat quality!\nArgan Magic Color Protection Hair Mask – Nourishes, Hydrates & Helps to Protect Color Treated Hair | Enriched with Moringa Oil & Botanical Extracts | Made in USA | Paraben Free | Cruelty Free (8 oz)\nArgan Magic\n{'Brand': 'Argan Magic', 'Item Form': 'Cream', 'Material Feature': 'Natural, Cruelty Free, Paraben Free', 'Hair Type': 'Color Treated', 'Product Benefits': 'Hydrating', 'Package Dimensions': '4.45 x 4.09 x 3.43 inches; 8 Ounces', 'UPC': '605923470710'}\nConstantly color and using heat styling tools in my hair that using hair masks keeps my hair healthy and maintained. I use this hair mask that not only smells clean and refreshing after I shampoo my hair and I let it absorb for about 5 mins in a shower cap then I rinse it out. My hair feels so smooth and healthy!\nGreat mask for color treated hair!\nReusable Shower Cap for Women – Leakproof, Nonslip Hair Cap for Shower w/ Comfy Flexiband – Soft, Breathable Shower Caps for Women Reusable Waterproof – Durable, Heavy Duty Shower Cap by SMPL OBJECTS (Marble)\nSMPL objects\n{'Brand': 'SMPL objects', 'Material': 'Polyester', 'Age Range (Description)': 'Adult', 'Pattern': 'Marble', 'Number of Items': '1', 'Package Dimensions': '9.21 x 6.97 x 0.67 inches; 0.63 Ounces', 'Manufacturer': 'SMPL Objects', 'Country of Origin': 'China'}\nThis tropical lovely shower cap with a bow not only have vibrant, and fun  colors but multiple uses.It can be use when cooking, swimming or if you have your hair messy or dirty to cover it up. The bow detailing gives it a feminine touch and it’s so comfortable to wear!\nGreat for many uses!\n26 pcs letters Hairpin, hair clips for women hair accessories, DIY barrettes\nJEBDY RUBBY\n{'Brand': 'JEBDY RUBBY', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Metal', 'Unit Count': '26.00 Count', 'Package Dimensions': '3.27 x 3.23 x 1.26 inches; 2.08 Ounces'}\n[[VIDEOID:aeba6b8cba447789a6a04eee5e7f9abe]] These alphabet hair clips are great for writing out your name or nickname! They are easy to read and are vibrant with dark hair.\nCute hair detail!",
  "profile": "**User Summary:**\n\n- **Eco-Conscious:** Maintains a strong preference for environmentally friendly products, emphasizing cost savings and sustainability.\n- **Everyday Makeup User:** Incorporates makeup removal in daily routines, valuing effective beauty accessories.\n- **Preference for Reusability:** Committed to sustainable beauty practices, favoring reusable items along with versatile accessories for various uses.\n- **Gentle on Skin:** Prioritizes products that are effective yet gentle, reflecting a concern for skin health and comfort.\n- **Convenience Seeker:** Appreciates easy maintenance and multifunctional items suitable for all seasons and climates, enhancing overall usability.\n- **Positive Product Experience:** Generally satisfied with durable, reliable products that blend functionality with style, now also showing interest in creative personal expression through accessories.\n- **Recent Focus on Eye and Skin Care:** Interested in hydration solutions for eyelash care and combination skin, focusing on moisture balance.\n- **Post-Workout Skin Care:** Engaged in skincare routines following workouts, utilizing lightweight, hydrating solutions.\n- **Fashion-Forward:** Displays a growing interest in stylish hair accessories that add a playful touch to personal style while complementing various looks.\n- **Home Care Enthusiast:** Emphasized sustainable home management practices, investing in DIY cleaning solutions and aesthetically pleasing refillable containers.\n- **Hair Care Advocate:** Highlights a preference for hydrating products supporting color-treated hair, enjoying treatments that sustain hair health after styling.\n\nThe user integrates sustainability, convenience, effective skin-friendly solutions, and hair care into daily life, while also expressing creativity through fashion-forward choices.",
  "metrics": {
    "rouge1_f": 0.1553672316384181,
    "rouge2_f": 0.019801980198019802,
    "rougeL_f": 0.07627118644067797,
    "meteor": 0.06160699025052543,
    "bleu1": 0.00871665253197493,
    "bleu2": 0.0020659772234096862,
    "bleu3": 0.0006690738663019357,
    "bleu4": 0.0002142848071699275,
    "bertscore_precision": 0.3860320746898651,
    "bertscore_recall": 0.49243974685668945,
    "bertscore_f1": 0.43279141187667847
  }
}