{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Multicolors Crimped Bobby Pins, 96 Counts 2 Inches Non Slip Grip Hair Pins For Women, Safe Rubber Tips & Strong Grip Bob Pins, Bobby Pins Blonde, Black, Brown, Green\nReview Date: 2020/12/27\nStore: DARONGFENG\nAverage Rating: 4.5\nProduct Details: {'Brand': 'DARONGFENG', 'Hair Type': 'All', 'Color': 'Gray,Green,Brown', 'Age Range (Description)': 'Adult', 'Material': 'Metal, Rubber', 'Package Dimensions': '4.8 x 3.8 x 0.7 inches; 3.21 Ounces', 'Item model number': 'Hair pins-D96-4', 'UPC': '741416436082'}\nReview Text: [[VIDEOID:2cdede7e71d7fcbe49c85fc3e6dd4373]] These Bobby pins are great to have if you want them to blend in with your hair color or give you a pop of color. I have almost jet black hair so using the gold Bobby pins with gold accessories looks really nice. Can’t wait to try different styles with the Bobby pins besides the cross cross I’ve been doing.\nReview Title: Great variety pack!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nI strive to buy products that will cut costs in the long run but that also help the environment. I wear makeup every day and use cotton rounds to remove my makeup which can cost a lot overly time. I switched to these reusable wash pads and not only are they easy to hold because of the hook but they remove my makeup without being harsh on my skin. The wash bag makes it easy to just throw in the washer and protect the quality of the cloths just as I would use for delicates.\nDurable pads for everyday makeup use\nAmtidy Solid Color Vintage Modern Style Elastic Women's Rhinestone Crown Tiara, Bridal Wedding Dance Party Birthday Party Women's Headband Tiara, Queen Tiara With Comb（Silver）\nAmtidy\n{'Material': 'Rubber', 'Fabric Type': 'Elastic', 'Brand': 'Amtidy', 'Item Form': 'Spiral', 'Unit Count': '10.00 Count', 'Package Dimensions': '11.65 x 5.63 x 3.23 inches; 12.03 Ounces', 'UPC': '782931993780'}\nI love the variety of colors that can fit through the whole year. Living in Florida is very humid most of the year so having headbands to keep your hair away from your face but still adds style to your outfits. They are double lined and super stretchy. I love the vibrant colors and the warmer tones.\nComfortable + great for all seasons\nBEYELIAN Lash Shampoo with Brush Eyelash Extension Cleanser Eyelid Foaming Cleanser Lash Foam Shampoo Makeup Remover - For Home & Salon Use\nBEYELIAN\n{'Package Dimensions': '6.5 x 1.7 x 1.1 inches; 1.94 Ounces'}\nI’ve recently had lash extensions put on for the first time and it’s been an adjustment to care for them and find a product that doesn’t pull lashes while cleaning my makeup off. This is perfect for traveling or carrying in your purse! I highly recommend this because it doesn’t irritate my sensitive eyes and wipes away my makeup after one wash!\nGood lash cleaner!\nFacial Skincare,Cucumber Essence Hydrating Moisturizing Revitalizing Hydration Fruit Extract Deep Cleaning Facial Skincare Sheet for All Skin Type Care, 35ml/1.18oz, Pack of 5\nPalNour\n{}\nSmells good and works wonders on your skin!<br /><br />Having combination skin I lack moisture in my t-zone so this mask really helped to rehydrate my skin!\nHydrating!\nDr.Althea Multi-Action Infusion Serum - 56 Packets of Light weight Gel Serum\nDr.Althea\n{'Skin Type': 'All', 'Brand': 'Dr.Althea', 'Item Form': 'Gel', 'Material Feature': 'Natural', 'Recommended Uses For Product': 'Protein,Calluses,Anti-aging', 'Package Dimensions': '6.8 x 5.7 x 1.3 inches; 5.61 Ounces'}\nI’ve been carrying these individually packaged serums for after a workout. I’ve been wearing masks for long periods of time and I’ve noticed my skin needed a little tlc. I’ve been washing my face more times a day and applying this serum all over my face and neck. I’ve noticed my skin looks brighter and hydrated since using this product.\nGlowing skin!\nMulticolors Crimped Bobby Pins, 96 Counts 2 Inches Non Slip Grip Hair Pins For Women, Safe Rubber Tips & Strong Grip Bob Pins, Bobby Pins Blonde, Black, Brown, Green\nDARONGFENG\n{'Brand': 'DARONGFENG', 'Hair Type': 'All', 'Color': 'Gray,Green,Brown', 'Age Range (Description)': 'Adult', 'Material': 'Metal, Rubber', 'Package Dimensions': '4.8 x 3.8 x 0.7 inches; 3.21 Ounces', 'Item model number': 'Hair pins-D96-4', 'UPC': '741416436082'}\n[[VIDEOID:2cdede7e71d7fcbe49c85fc3e6dd4373]] These Bobby pins are great to have if you want them to blend in with your hair color or give you a pop of color. I have almost jet black hair so using the gold Bobby pins with gold accessories looks really nice. Can’t wait to try different styles with the Bobby pins besides the cross cross I’ve been doing.\nGreat variety pack!",
  "profile": "**User Summary:**\n\n- **Eco-Conscious:** Prefers environmentally friendly products that emphasize cost savings and sustainability.\n- **Everyday Makeup User:** Incorporates makeup removal into daily routines, valuing practical and effective beauty accessories.\n- **Preference for Reusability:** Favors reusable items, demonstrating a commitment to sustainable skincare and beauty practices.\n- **Gentle on Skin:** Chooses products that are effective yet gentle, showing a strong concern for skin health and comfort.\n- **Convenience Seeker:** Appreciates easy maintenance and practical solutions, preferring versatile items suitable for various climates and seasons.\n- **Positive Product Experience:** Reports satisfaction with product durability and effectiveness, leaning toward reliable and highly rated options, including accessories that offer both functionality and style.\n- **Recent Focus on Eye and Skin Care:** Demonstrated interest in products for eyelash care and hydrating skincare solutions, particularly for combination skin, highlighting a dedication to moisture balance and nurturing skin health.\n- **Post-Workout Skin Care:** Recently engaged in skin care routines following workouts, using lightweight serums to address dryness and enhance skin brightness and hydration.\n- **Fashion-Forward:** Shows interest in stylish hair accessories that provide flair, with a particular inclination towards versatile options that can complement various hair colors and styles.\n\nThe user continues to embrace sustainability, convenience, and effective skin-friendly solutions while also enhancing their fashion-forward approach to beauty and hair care. Their recent investment in colorful hair accessories indicates an eagerness to experiment with personal style.",
  "metrics": {
    "rouge1_f": 0.21668472372697725,
    "rouge2_f": 0.023887079261672096,
    "rougeL_f": 0.10834236186348863,
    "meteor": 0.09054650160102207,
    "bleu1": 0.058940343410591005,
    "bleu2": 0.012418704266129853,
    "bleu3": 0.0020081106549803118,
    "bleu4": 0.0008081735420569602,
    "bertscore_precision": 0.3797045350074768,
    "bertscore_recall": 0.48454105854034424,
    "bertscore_f1": 0.4257642328739166
  }
}