{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Innisfree Red Beet Bright Toning Cleanser 100ml New Super Food Skin Care Line/Transparent skin and Moisture Care\nReview Date: 2017/06/14\nAverage Rating: 2.6\nProduct Details: {'Package Dimensions': '6.4 x 1.5 x 0.9 inches; 11.2 Ounces'}\nReview Text: Smells like moth balls, no brightening effect\nReview Title: One Star\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "Hey! Pinkgo Girl Brightening White Yogurt Lifting Lace Sheet Mask 5pcs - Repairing, Firming and Brightening\nHey! Pinkgo Girl\n['The paraben-free brightening sheet mask is like a multivitamin for the skin!', \"With Hey! Pinkgo Girl Brightening White Yogurt Lifting Lace Sheet Mask, you can meet your complexion's nutritional needs with the array of vitamins and minerals found in yogurt. The rich creamy base also draws impurities out of the skin and gently lifts away cellular debris for brightening benefits.\", 'Aloe vera leaf helps to calm signs of inflammation and provides ample protection against the environmental impurities that damage skin tissue and cause it to age before its time. Hyaluronic acid simultaneously offers moisturizing and firming benefits by drawing amounts of moisture up to 1000 times its weight into the skin tissue. This leaves existing fine lines and wrinkles greatly diminished and the complexion feeling softer and smoother!']\n{'Brand': 'Hey! Pinkgo Girl', 'Item Form': 'Cream, Sheet', 'Scent': 'Aloe Vera', 'Skin Type': 'Sensitive', 'Special Feature': 'Not Tested On Animals', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2 x 4.3 x 6.3 inches; 11.2 Ounces'}\nAmazing! You will see the results from the first time\nMagic mask\nYUNAI 24 Pcs/set French Nails Nail Art Pre-design Acrylic Fake Nail Classical Full Cover Short White Manicure\nYUNAI\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.5 x 2 x 0.4 inches; 0.35 Ounces'}\nsize is weird too the white part starts too soon, nobody's nails are that short\nOne Star\nInnisfree Red Beet Bright Toning Cleanser 100ml New Super Food Skin Care Line/Transparent skin and Moisture Care\n{'Package Dimensions': '6.4 x 1.5 x 0.9 inches; 11.2 Ounces'}\nSmells like moth balls, no brightening effect\nOne Star",
  "profile": "**User Profile Summary:**\n\n- **Skincare Preference:** The user maintains a strong interest in brightening and repairing skin solutions, favoring sheet masks with nourishing ingredients like yogurt and aloe vera. However, recent experiences indicate increased scrutiny towards product efficacy, particularly regarding scent and performance.\n\n- **Ingredient Sensitivity:** Prefers paraben-free, sensitive skin-friendly, and cruelty-free skincare products, reflecting a commitment to ethical and safe formulations.\n\n- **Effectiveness:** Values immediate visible results, showing a tendency towards high-efficacy skincare but has recently highlighted dissatisfaction when products do not meet expectations, particularly in relation to scent and promised effects.\n\n- **Overall Quality Focus:** Continues to exhibit a critical eye for product performance. Recent submissions demonstrate a significant decline in satisfaction when products fail to deliver on key promises, warranting low ratings for perceived ineffective results.\n\n- **Rating Patterns:** Utilizes a detailed rating scale, focusing on performance and ingredients, with heightened expectations for quality in light of recent dissatisfaction, particularly with product scent.\n\n- **Experience Preference:** Enjoys a sensory experience through pleasant scents like aloe vera, which has become more important as poor scent experiences have negatively impacted recent ratings.\n\n- **Recent Behavioral Shift:** The user has shown an expanding interest in beauty products beyond skincare, specifically in nail care, but maintains a discerning attitude toward quality and fit, especially after expressing dissatisfaction with a recent low-rated purchase.\n\nOverall, the user seeks highly effective, quality skincare and beauty products that provide quick results while highlighting a growing sensitivity to product attributes and performance across all beauty categories.",
  "metrics": {
    "rouge1_f": 0.18416206261510126,
    "rouge2_f": 0.014787430683918667,
    "rougeL_f": 0.09576427255985266,
    "meteor": 0.1124395103899801,
    "bleu1": 0.1651557782062806,
    "bleu2": 0.006810071877817963,
    "bleu3": 0.002355203275448651,
    "bleu4": 0.0013861520746074132,
    "bertscore_precision": 0.4109001159667969,
    "bertscore_recall": 0.43356525897979736,
    "bertscore_f1": 0.4219285249710083
  }
}