{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: RUNATURE Mini Tape Hair Extensions Human Hair 20 Inch Remy Hair Tape ins Extensions Chestnut Brown Highlighted Blonde Human Hair Tape Extensions Real Hair 20g\nReview Date: 2021/09/21\nStore: RUNATURE\nAverage Rating: 3.3\nProduct Details: {'Brand': 'RUNATURE', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No'}\nReview Text: Colors are nice, I love the size so I can fill in smaller areas. BUT their  tapes don’t stick to each other!! And the defective tape is so stuck onto each weft that it took forever to peel them off so I could put working tapes on them. Very Frustrating!!!\nReview Title: Tapes Defective!\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "7 Wonders Nourishing Leave In Conditioner with Pure Organic Oils of Almond, Marula, Argan, Olive, Macadamia, Coconut & Jojoba 16.9 fl. Oz.\nFrulatte\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.46 x 3.86 x 2.8 inches; 1.23 Pounds'}\nI first found this product at a discount store. And I’m thrilled to find that Amazon has it so I can never be without it! I have waist-length hair that is kinky curly with gray hair throughout that I wear straightened. This product is the only one that keeps my hair from frizzing no matter how hot and humid it gets! And the shine and softness of my hair is the best it’s ever been. I use it after using It’s A Ten Miracle Silk Leave-In after washing my hair with Wen.<br /><br />Even if you have long hair, use this stuff sparingly and make sure you liquify it in the palms of your hand and between your fingers before you put it through your hair.<br /><br />Another plus: the huge bottle lasts me about 6 months. Keep in mind my hair is dry so I only wash it twice a week. Knowing that, you can gauge how long this bottle will last you.\nBest Anti-Frizz Hair Product I’ve Ever Used\nFESHFEN Straight Long Ponytail Extensions 24 Inch Wrap Around Synthetic Hair Piece Magic Paste Pony Tail Hair Extensions Hairpieces for Women Girls\nFESHFEN\n{'Brand': 'FESHFEN', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.96 x 3.58 x 0.75 inches; 5.19 Ounces'}\nDifficult to get the hair ‘wrap’ wrapped around my own ponytail  because the Velcro sticks to the fake hair. Also is too heavy so is slides down your own ponytail.\nDoesn’t stay on!\nYoungSee 20\" Remy Tape in Hair Extensions Ombre Balayage Medium Brown with Bleach Blonde 100% Real Human Hair Seamless Tape in Human Hair Extensions 50g 20pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Wavy, Straight', 'Installation Type': 'Tape-In', 'Product Dimensions': '20 x 1 x 1 inches; 1.76 Ounces', 'UPC': '786784875194'}\nI was so disappointed when I open the package. The top of the Wests are almost black. They are not a medium brown at all. Unfortunately I open the package too late to be able to return them. I’m keeping the box to remind myself never to buy from them again.<br /><br />UPDATE: They also mat horribly!\nDON’T BUY -Tops are Black,NOT Brown\nVeSunny 20Inch Balayage Tape in Hair Extensions Remi Human Hair Brazilian Remy Hair Invisible Tape Ombre #4 Dark Brown to Caramel Blonde Mixed Platinum Blonde Human Hair Tape in Extensions 20pc 50g\nVe Sunny\n{'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 0.98 x 0.98 inches; 1.76 Ounces', 'UPC': '798863462690'}\nThese extensions are NOT Remy! You can’t call this remy hair if the cuticles are not all going in the same direction. And miss-matched cuticles cause matting at the tape. While sitting and watching TV not moving my head, they all matted up at the tape! Now I have to take them all out!\nNOT REMY HAIR-They all may up at the tapes!\nHuman Hair Extensions Tape in 50g Golden Blonde Highlighted With Light Blonde Tape in Hair Extensions 20 Inches Tape Extensions\nRUNATURE\n{'Brand': 'RUNATURE', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape', 'Package Dimensions': '8.31 x 4.65 x 1.77 inches; 5.36 Ounces'}\nThe first set I purchased matted several times a day no matter how often I oiled them. They matted within 10-15 minutes after brushing, even when I sat still and didn’t move my head. I contacted the company, and they were very helpful. They offered to replace the extensions with new ones! Now that’s Customer Service! I look forward to receiving my replacement extensions.\nGreat Customer Service!\nVario Tape In Human Hair Extensions 7A Silky Straight Skin Weft Human Remy Hair For Fashion Women (22 Inche 60g 20PCS #12P613)\nVARIO\n{'Brand': 'VARIO', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Tape-In', 'Product Dimensions': '22 x 2 x 0.5 inches; 3.2 Ounces', 'UPC': '610877854301'}\nBeautiful hair, match my color perfectly.\nBeautiful hair\nRUNATURE Mini Tape Hair Extensions Human Hair 20 Inch Remy Hair Tape ins Extensions Chestnut Brown Highlighted Blonde Human Hair Tape Extensions Real Hair 20g\nRUNATURE\n{'Brand': 'RUNATURE', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No'}\nColors are nice, I love the size so I can fill in smaller areas. BUT their  tapes don’t stick to each other!! And the defective tape is so stuck onto each weft that it took forever to peel them off so I could put working tapes on them. Very Frustrating!!!\nTapes Defective!",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Emphasis:** The focus on effective frizz management in humid conditions continues, with a strong emphasis on product quality and color accuracy, particularly in hair extensions.\n- **Product Preference:** The user remains loyal to nourishing leave-in conditioners enriched with organic oils while exploring hair accessories. Recent experiences with hair extensions have prompted a critical evaluation of product quality and effectiveness, with a recent mixed experience underscoring a need for reliability.\n- **Hair Type Specificity:** With waist-length, kinky curly hair that is often straightened, the user battles dryness and grays, reinforcing their commitment to hydration and maintenance. Challenges with extensions have highlighted the importance of both color matching and product integrity.\n- **Brand Loyalty:** A discerning approach to purchasing reflects a recent reevaluation of product authenticity. Mixed experiences with hair-related products have resulted in both cautious exploration and reinforced brand loyalty based on positive encounters.\n- **Usage Habits:** The user maintains a routine of washing their hair twice a week while remaining mindful of economical practices, particularly after recent unsatisfactory experiences.\n- **Customer Service Appreciation:** Excellent customer service continues to strengthen their loyalty to brands, especially following difficult situations.\n- **Sustainability Focus:** The user seeks cost-effective options at discount outlets, balancing their pursuit of quality and overall value in hair care products while navigating the landscape of extensions with scrutiny.",
  "metrics": {
    "rouge1_f": 0.19792648444863337,
    "rouge2_f": 0.03399433427762039,
    "rougeL_f": 0.0885956644674835,
    "meteor": 0.07355936802982162,
    "bleu1": 0.02230425873027059,
    "bleu2": 0.006227018094306762,
    "bleu3": 0.0025668669061327766,
    "bleu4": 0.0007799974098303819,
    "bertscore_precision": 0.3703077733516693,
    "bertscore_recall": 0.47665315866470337,
    "bertscore_f1": 0.4168040454387665
  }
}