{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Human Hair Extensions Tape in 50g Golden Blonde Highlighted With Light Blonde Tape in Hair Extensions 20 Inches Tape Extensions\nReview Date: 2020/11/24\nStore: RUNATURE\nAverage Rating: 5.0\nProduct Details: {'Brand': 'RUNATURE', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape', 'Package Dimensions': '8.31 x 4.65 x 1.77 inches; 5.36 Ounces'}\nReview Text: The first set I purchased matted several times a day no matter how often I oiled them. They matted within 10-15 minutes after brushing, even when I sat still and didn’t move my head. I contacted the company, and they were very helpful. They offered to replace the extensions with new ones! Now that’s Customer Service! I look forward to receiving my replacement extensions.\nReview Title: Great Customer Service!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "7 Wonders Nourishing Leave In Conditioner with Pure Organic Oils of Almond, Marula, Argan, Olive, Macadamia, Coconut & Jojoba 16.9 fl. Oz.\nFrulatte\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.46 x 3.86 x 2.8 inches; 1.23 Pounds'}\nI first found this product at a discount store. And I’m thrilled to find that Amazon has it so I can never be without it! I have waist-length hair that is kinky curly with gray hair throughout that I wear straightened. This product is the only one that keeps my hair from frizzing no matter how hot and humid it gets! And the shine and softness of my hair is the best it’s ever been. I use it after using It’s A Ten Miracle Silk Leave-In after washing my hair with Wen.<br /><br />Even if you have long hair, use this stuff sparingly and make sure you liquify it in the palms of your hand and between your fingers before you put it through your hair.<br /><br />Another plus: the huge bottle lasts me about 6 months. Keep in mind my hair is dry so I only wash it twice a week. Knowing that, you can gauge how long this bottle will last you.\nBest Anti-Frizz Hair Product I’ve Ever Used\nFESHFEN Straight Long Ponytail Extensions 24 Inch Wrap Around Synthetic Hair Piece Magic Paste Pony Tail Hair Extensions Hairpieces for Women Girls\nFESHFEN\n{'Brand': 'FESHFEN', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.96 x 3.58 x 0.75 inches; 5.19 Ounces'}\nDifficult to get the hair ‘wrap’ wrapped around my own ponytail  because the Velcro sticks to the fake hair. Also is too heavy so is slides down your own ponytail.\nDoesn’t stay on!\nYoungSee 20\" Remy Tape in Hair Extensions Ombre Balayage Medium Brown with Bleach Blonde 100% Real Human Hair Seamless Tape in Human Hair Extensions 50g 20pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Wavy, Straight', 'Installation Type': 'Tape-In', 'Product Dimensions': '20 x 1 x 1 inches; 1.76 Ounces', 'UPC': '786784875194'}\nI was so disappointed when I open the package. The top of the Wests are almost black. They are not a medium brown at all. Unfortunately I open the package too late to be able to return them. I’m keeping the box to remind myself never to buy from them again.<br /><br />UPDATE: They also mat horribly!\nDON’T BUY -Tops are Black,NOT Brown\nVeSunny 20Inch Balayage Tape in Hair Extensions Remi Human Hair Brazilian Remy Hair Invisible Tape Ombre #4 Dark Brown to Caramel Blonde Mixed Platinum Blonde Human Hair Tape in Extensions 20pc 50g\nVe Sunny\n{'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 0.98 x 0.98 inches; 1.76 Ounces', 'UPC': '798863462690'}\nThese extensions are NOT Remy! You can’t call this remy hair if the cuticles are not all going in the same direction. And miss-matched cuticles cause matting at the tape. While sitting and watching TV not moving my head, they all matted up at the tape! Now I have to take them all out!\nNOT REMY HAIR-They all may up at the tapes!\nHuman Hair Extensions Tape in 50g Golden Blonde Highlighted With Light Blonde Tape in Hair Extensions 20 Inches Tape Extensions\nRUNATURE\n{'Brand': 'RUNATURE', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape', 'Package Dimensions': '8.31 x 4.65 x 1.77 inches; 5.36 Ounces'}\nThe first set I purchased matted several times a day no matter how often I oiled them. They matted within 10-15 minutes after brushing, even when I sat still and didn’t move my head. I contacted the company, and they were very helpful. They offered to replace the extensions with new ones! Now that’s Customer Service! I look forward to receiving my replacement extensions.\nGreat Customer Service!",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Emphasis:** Continues to prioritize effective solutions for frizz management, particularly in humid conditions, emphasizing quality and color accuracy in products.\n- **Product Preference:** Remains a fan of nourishing leave-in conditioners enriched with organic oils, while still exploring hair accessories and extensions. Recent mixed experiences have heightened scrutiny on product authenticity and quality.\n- **Hair Type Specificity:** Has waist-length, kinky curly hair that undergoes straightening, experiencing dryness and grays that reinforce the need for hydration and reliable care. Recent issues with extensions have increased focus on color matching and product integrity.\n- **Brand Loyalty:** Committed to finding trusted products and now approaches purchases with added discernment, especially after evaluating product claims regarding quality and authenticity.\n- **Usage Habits:** Washes hair twice a week with a mindful, economical approach that focuses on longevity, reflecting a careful selection process after prior unsatisfactory experiences.\n- **Customer Service Appreciation:** Values excellent customer service, as demonstrated by positive interactions with brands during challenging scenarios, fueling ongoing brand loyalty.\n- **Sustainability Focus:** Continues to shop at discount outlets, seeking cost-effective yet quality options while emphasizing overall value in hair care purchases.\n\nThe user's commitment to effective hair maintenance and a keen focus on authenticity have intensified, influenced by both positive and negative recent experiences.",
  "metrics": {
    "rouge1_f": 0.21099887766554434,
    "rouge2_f": 0.03374578177727784,
    "rougeL_f": 0.0920314253647587,
    "meteor": 0.08919969650208003,
    "bleu1": 0.04105675531131006,
    "bleu2": 0.011470906324317211,
    "bleu3": 0.003924896590398097,
    "bleu4": 0.0012922275457159852,
    "bertscore_precision": 0.36112773418426514,
    "bertscore_recall": 0.46287864446640015,
    "bertscore_f1": 0.40572094917297363
  }
}