{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: VeSunny 20Inch Balayage Tape in Hair Extensions Remi Human Hair Brazilian Remy Hair Invisible Tape Ombre #4 Dark Brown to Caramel Blonde Mixed Platinum Blonde Human Hair Tape in Extensions 20pc 50g\nReview Date: 2020/11/20\nStore: Ve Sunny\nAverage Rating: 3.3\nProduct Details: {'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 0.98 x 0.98 inches; 1.76 Ounces', 'UPC': '798863462690'}\nReview Text: These extensions are NOT Remy! You can’t call this remy hair if the cuticles are not all going in the same direction. And miss-matched cuticles cause matting at the tape. While sitting and watching TV not moving my head, they all matted up at the tape! Now I have to take them all out!\nReview Title: NOT REMY HAIR-They all may up at the tapes!\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "7 Wonders Nourishing Leave In Conditioner with Pure Organic Oils of Almond, Marula, Argan, Olive, Macadamia, Coconut & Jojoba 16.9 fl. Oz.\nFrulatte\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.46 x 3.86 x 2.8 inches; 1.23 Pounds'}\nI first found this product at a discount store. And I’m thrilled to find that Amazon has it so I can never be without it! I have waist-length hair that is kinky curly with gray hair throughout that I wear straightened. This product is the only one that keeps my hair from frizzing no matter how hot and humid it gets! And the shine and softness of my hair is the best it’s ever been. I use it after using It’s A Ten Miracle Silk Leave-In after washing my hair with Wen.<br /><br />Even if you have long hair, use this stuff sparingly and make sure you liquify it in the palms of your hand and between your fingers before you put it through your hair.<br /><br />Another plus: the huge bottle lasts me about 6 months. Keep in mind my hair is dry so I only wash it twice a week. Knowing that, you can gauge how long this bottle will last you.\nBest Anti-Frizz Hair Product I’ve Ever Used\nFESHFEN Straight Long Ponytail Extensions 24 Inch Wrap Around Synthetic Hair Piece Magic Paste Pony Tail Hair Extensions Hairpieces for Women Girls\nFESHFEN\n{'Brand': 'FESHFEN', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.96 x 3.58 x 0.75 inches; 5.19 Ounces'}\nDifficult to get the hair ‘wrap’ wrapped around my own ponytail  because the Velcro sticks to the fake hair. Also is too heavy so is slides down your own ponytail.\nDoesn’t stay on!\nYoungSee 20\" Remy Tape in Hair Extensions Ombre Balayage Medium Brown with Bleach Blonde 100% Real Human Hair Seamless Tape in Human Hair Extensions 50g 20pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Wavy, Straight', 'Installation Type': 'Tape-In', 'Product Dimensions': '20 x 1 x 1 inches; 1.76 Ounces', 'UPC': '786784875194'}\nI was so disappointed when I open the package. The top of the Wests are almost black. They are not a medium brown at all. Unfortunately I open the package too late to be able to return them. I’m keeping the box to remind myself never to buy from them again.<br /><br />UPDATE: They also mat horribly!\nDON’T BUY -Tops are Black,NOT Brown\nVeSunny 20Inch Balayage Tape in Hair Extensions Remi Human Hair Brazilian Remy Hair Invisible Tape Ombre #4 Dark Brown to Caramel Blonde Mixed Platinum Blonde Human Hair Tape in Extensions 20pc 50g\nVe Sunny\n{'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 0.98 x 0.98 inches; 1.76 Ounces', 'UPC': '798863462690'}\nThese extensions are NOT Remy! You can’t call this remy hair if the cuticles are not all going in the same direction. And miss-matched cuticles cause matting at the tape. While sitting and watching TV not moving my head, they all matted up at the tape! Now I have to take them all out!\nNOT REMY HAIR-They all may up at the tapes!",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Emphasis:** Continues to prioritize effective hair care solutions to manage frizz in humid conditions, with a focus on quality and color accuracy in products. \n- **Product Preference:** Remains a fan of leave-in conditioners enriched with organic oils for nourishment and moisture, while still exploring hair accessories and extensions. However, negative experiences have intensified scrutiny on product authenticity and quality.\n- **Hair Type Specificity:** Has waist-length, kinky curly hair that undergoes straightening. The user experiences dryness and grays, reinforcing the need for hydration and reliable care solutions. Recent experiences with hair extensions have heightened concern over color matching and product integrity.\n- **Brand Loyalty:** Dedicated to finding trusted products, showing reluctance to tolerate subpar items. Negative experiences with extensions have led to a reassessment of product claims, particularly around the definition of Remy hair.\n- **Usage Habits:** Washes hair twice a week, using products sparingly, reflecting a mindful and economical approach to hair care with a focus on longevity. Disparate experiences have made the user more discerning.\n- **Positive Experience:** Generally satisfied with past quality, but recent interactions with hair extensions and accessories highlight a need for careful evaluation of product performance and authenticity.\n- **Sustainability Focus:** Continue to shop at discount outlets for cost-effective yet quality options, emphasizing value in all hair care purchases. \n\nOverall, the user's commitment to finding suitable hair maintenance products continues, with an increased vigilance for authenticity and performance after negative experiences.",
  "metrics": {
    "rouge1_f": 0.24500000000000002,
    "rouge2_f": 0.03508771929824561,
    "rougeL_f": 0.11250000000000002,
    "meteor": 0.11158688744589629,
    "bleu1": 0.09534719111732906,
    "bleu2": 0.023049766142931843,
    "bleu3": 0.007910517598271783,
    "bleu4": 0.002608117631341999,
    "bertscore_precision": 0.37575775384902954,
    "bertscore_recall": 0.45931774377822876,
    "bertscore_f1": 0.413357138633728
  }
}