{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: FESHFEN Straight Long Ponytail Extensions 24 Inch Wrap Around Synthetic Hair Piece Magic Paste Pony Tail Hair Extensions Hairpieces for Women Girls\nReview Date: 2019/12/02\nStore: FESHFEN\nAverage Rating: 3.3\nProduct Details: {'Brand': 'FESHFEN', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.96 x 3.58 x 0.75 inches; 5.19 Ounces'}\nReview Text: Difficult to get the hair ‘wrap’ wrapped around my own ponytail  because the Velcro sticks to the fake hair. Also is too heavy so is slides down your own ponytail.\nReview Title: Doesn’t stay on!\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "7 Wonders Nourishing Leave In Conditioner with Pure Organic Oils of Almond, Marula, Argan, Olive, Macadamia, Coconut & Jojoba 16.9 fl. Oz.\nFrulatte\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.46 x 3.86 x 2.8 inches; 1.23 Pounds'}\nI first found this product at a discount store. And I’m thrilled to find that Amazon has it so I can never be without it! I have waist-length hair that is kinky curly with gray hair throughout that I wear straightened. This product is the only one that keeps my hair from frizzing no matter how hot and humid it gets! And the shine and softness of my hair is the best it’s ever been. I use it after using It’s A Ten Miracle Silk Leave-In after washing my hair with Wen.<br /><br />Even if you have long hair, use this stuff sparingly and make sure you liquify it in the palms of your hand and between your fingers before you put it through your hair.<br /><br />Another plus: the huge bottle lasts me about 6 months. Keep in mind my hair is dry so I only wash it twice a week. Knowing that, you can gauge how long this bottle will last you.\nBest Anti-Frizz Hair Product I’ve Ever Used\nFESHFEN Straight Long Ponytail Extensions 24 Inch Wrap Around Synthetic Hair Piece Magic Paste Pony Tail Hair Extensions Hairpieces for Women Girls\nFESHFEN\n{'Brand': 'FESHFEN', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.96 x 3.58 x 0.75 inches; 5.19 Ounces'}\nDifficult to get the hair ‘wrap’ wrapped around my own ponytail  because the Velcro sticks to the fake hair. Also is too heavy so is slides down your own ponytail.\nDoesn’t stay on!",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Emphasis:** Prioritizes effective hair care solutions, particularly for managing frizz in humid conditions.\n- **Product Preference:** Values leave-in conditioners, especially those enriched with organic oils for nourishment and moisture, but is also exploring hair accessories.\n- **Hair Type Specificity:** Has waist-length, kinky curly hair that undergoes straightening; experiences dryness and grays, indicating a strong need for hydration and care.\n- **Brand Loyalty:** Enthusiastic about finding trusted products, with a willingness to seek out specific brands across different retailers, even when trying new types of hair products.\n- **Usage Habits:** Washes hair twice a week; utilizes products sparingly, indicating a mindful approach to hair care and a focus on the longevity of product use.\n- **Positive Experience:** Generally satisfied with previous purchases, though recent experiences with hair accessories indicate a need for careful evaluation of functionality and comfort.\n- **Sustainability Focus:** The purchase of products from discount outlets reflects a value for cost-effectiveness and accessibility.\n\nOverall, this user is focused on finding quality hair maintenance products that cater to their specific hair type and conditions, while also valuing longevity and effectiveness. The mixed experience with a recent hair accessory highlights the importance of practicality and performance in their purchasing decisions.",
  "metrics": {
    "rouge1_f": 0.2958579881656805,
    "rouge2_f": 0.03960396039603961,
    "rougeL_f": 0.14201183431952663,
    "meteor": 0.16590776314543743,
    "bleu1": 0.20782130953442576,
    "bleu2": 0.04626924103064045,
    "bleu3": 0.017688258059372304,
    "bleu4": 0.006155904835552648,
    "bertscore_precision": 0.4119609594345093,
    "bertscore_recall": 0.4700823426246643,
    "bertscore_f1": 0.4391067326068878
  }
}