{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Vario Tape In Human Hair Extensions 7A Silky Straight Skin Weft Human Remy Hair For Fashion Women (22 Inche 60g 20PCS #12P613)\nReview Date: 2020/12/08\nStore: VARIO\nAverage Rating: 3.7\nProduct Details: {'Brand': 'VARIO', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Tape-In', 'Product Dimensions': '22 x 2 x 0.5 inches; 3.2 Ounces', 'UPC': '610877854301'}\nReview Text: Beautiful hair, match my color perfectly.\nReview Title: Beautiful hair\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "7 Wonders Nourishing Leave In Conditioner with Pure Organic Oils of Almond, Marula, Argan, Olive, Macadamia, Coconut & Jojoba 16.9 fl. Oz.\nFrulatte\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.46 x 3.86 x 2.8 inches; 1.23 Pounds'}\nI first found this product at a discount store. And I’m thrilled to find that Amazon has it so I can never be without it! I have waist-length hair that is kinky curly with gray hair throughout that I wear straightened. This product is the only one that keeps my hair from frizzing no matter how hot and humid it gets! And the shine and softness of my hair is the best it’s ever been. I use it after using It’s A Ten Miracle Silk Leave-In after washing my hair with Wen.<br /><br />Even if you have long hair, use this stuff sparingly and make sure you liquify it in the palms of your hand and between your fingers before you put it through your hair.<br /><br />Another plus: the huge bottle lasts me about 6 months. Keep in mind my hair is dry so I only wash it twice a week. Knowing that, you can gauge how long this bottle will last you.\nBest Anti-Frizz Hair Product I’ve Ever Used\nFESHFEN Straight Long Ponytail Extensions 24 Inch Wrap Around Synthetic Hair Piece Magic Paste Pony Tail Hair Extensions Hairpieces for Women Girls\nFESHFEN\n{'Brand': 'FESHFEN', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.96 x 3.58 x 0.75 inches; 5.19 Ounces'}\nDifficult to get the hair ‘wrap’ wrapped around my own ponytail  because the Velcro sticks to the fake hair. Also is too heavy so is slides down your own ponytail.\nDoesn’t stay on!\nYoungSee 20\" Remy Tape in Hair Extensions Ombre Balayage Medium Brown with Bleach Blonde 100% Real Human Hair Seamless Tape in Human Hair Extensions 50g 20pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Wavy, Straight', 'Installation Type': 'Tape-In', 'Product Dimensions': '20 x 1 x 1 inches; 1.76 Ounces', 'UPC': '786784875194'}\nI was so disappointed when I open the package. The top of the Wests are almost black. They are not a medium brown at all. Unfortunately I open the package too late to be able to return them. I’m keeping the box to remind myself never to buy from them again.<br /><br />UPDATE: They also mat horribly!\nDON’T BUY -Tops are Black,NOT Brown\nVeSunny 20Inch Balayage Tape in Hair Extensions Remi Human Hair Brazilian Remy Hair Invisible Tape Ombre #4 Dark Brown to Caramel Blonde Mixed Platinum Blonde Human Hair Tape in Extensions 20pc 50g\nVe Sunny\n{'Brand': 'Ve Sunny', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'Tape-In', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '20 x 0.98 x 0.98 inches; 1.76 Ounces', 'UPC': '798863462690'}\nThese extensions are NOT Remy! You can’t call this remy hair if the cuticles are not all going in the same direction. And miss-matched cuticles cause matting at the tape. While sitting and watching TV not moving my head, they all matted up at the tape! Now I have to take them all out!\nNOT REMY HAIR-They all may up at the tapes!\nHuman Hair Extensions Tape in 50g Golden Blonde Highlighted With Light Blonde Tape in Hair Extensions 20 Inches Tape Extensions\nRUNATURE\n{'Brand': 'RUNATURE', 'Material': 'Human Hair', 'Extension Length': '20 Inches', 'Hair Type': 'Straight', 'Installation Type': 'Tape', 'Package Dimensions': '8.31 x 4.65 x 1.77 inches; 5.36 Ounces'}\nThe first set I purchased matted several times a day no matter how often I oiled them. They matted within 10-15 minutes after brushing, even when I sat still and didn’t move my head. I contacted the company, and they were very helpful. They offered to replace the extensions with new ones! Now that’s Customer Service! I look forward to receiving my replacement extensions.\nGreat Customer Service!\nVario Tape In Human Hair Extensions 7A Silky Straight Skin Weft Human Remy Hair For Fashion Women (22 Inche 60g 20PCS #12P613)\nVARIO\n{'Brand': 'VARIO', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Tape-In', 'Product Dimensions': '22 x 2 x 0.5 inches; 3.2 Ounces', 'UPC': '610877854301'}\nBeautiful hair, match my color perfectly.\nBeautiful hair",
  "profile": "**Updated User Profile Summary:**\n\n- **Hair Care Emphasis:** Focus remains on effective solutions for frizz management in humid conditions, with an emphasis on quality and color accuracy in products.\n- **Product Preference:** Shows continued favor for nourishing leave-in conditioners with organic oils while exploring hair accessories and extensions. Recent mixed experiences have resulted in heightened scrutiny of product authenticity and quality, though a recent positive encounter with color-matched extensions indicates a balance between exploration and commitment.\n- **Hair Type Specificity:** Maintains waist-length, kinky curly hair that is often straightened, facing challenges with dryness and grays, reinforcing a need for hydration. Recent experiences with extensions underscore the importance of color matching and product integrity.\n- **Brand Loyalty:** Committed to finding trusted products, now approaching purchases with discernment, especially after evaluating product claims regarding quality and authenticity. Positive recent experiences boost brand loyalty.\n- **Usage Habits:** Washes hair twice a week, prioritizing mindful, economical practices that reflect careful selection processes following previous unsatisfactory experiences.\n- **Customer Service Appreciation:** Values excellent customer service, which has strengthened loyalty towards brands after navigating challenging situations.\n- **Sustainability Focus:** Continues shopping at discount outlets, seeking cost-effective options while maintaining an emphasis on overall value in hair care.\n\nThe user's commitment to authentic hair maintenance and quality has intensified, influenced positively by recent experiences with well-matched products.",
  "metrics": {
    "rouge1_f": 0.1981230448383733,
    "rouge2_f": 0.03552769070010449,
    "rougeL_f": 0.08759124087591241,
    "meteor": 0.08241866775438317,
    "bleu1": 0.03262811743497083,
    "bleu2": 0.009535402629136483,
    "bleu3": 0.003990988600605112,
    "bleu4": 0.0012220230882484973,
    "bertscore_precision": 0.37274521589279175,
    "bertscore_recall": 0.4798930585384369,
    "bertscore_f1": 0.419586718082428
  }
}