{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: YoungSee 20\" Remy Tape in Hair Extensions Ombre Balayage Medium Brown with Bleach Blonde 100% Real Human Hair Seamless Tape in Human Hair Extensions 50g 20pcs\nReview Date: 2020/09/15\nStore: YoungSee\nAverage Rating: 1.0\nProduct Details: {'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Wavy, Straight', 'Installation Type': 'Tape-In', 'Product Dimensions': '20 x 1 x 1 inches; 1.76 Ounces', 'UPC': '786784875194'}\nReview Text: I was so disappointed when I open the package. The top of the Wests are almost black. They are not a medium brown at all. Unfortunately I open the package too late to be able to return them. I’m keeping the box to remind myself never to buy from them again.<br /><br />UPDATE: They also mat horribly!\nReview Title: DON’T BUY -Tops are Black,NOT Brown\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "7 Wonders Nourishing Leave In Conditioner with Pure Organic Oils of Almond, Marula, Argan, Olive, Macadamia, Coconut & Jojoba 16.9 fl. Oz.\nFrulatte\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '8.46 x 3.86 x 2.8 inches; 1.23 Pounds'}\nI first found this product at a discount store. And I’m thrilled to find that Amazon has it so I can never be without it! I have waist-length hair that is kinky curly with gray hair throughout that I wear straightened. This product is the only one that keeps my hair from frizzing no matter how hot and humid it gets! And the shine and softness of my hair is the best it’s ever been. I use it after using It’s A Ten Miracle Silk Leave-In after washing my hair with Wen.<br /><br />Even if you have long hair, use this stuff sparingly and make sure you liquify it in the palms of your hand and between your fingers before you put it through your hair.<br /><br />Another plus: the huge bottle lasts me about 6 months. Keep in mind my hair is dry so I only wash it twice a week. Knowing that, you can gauge how long this bottle will last you.\nBest Anti-Frizz Hair Product I’ve Ever Used\nFESHFEN Straight Long Ponytail Extensions 24 Inch Wrap Around Synthetic Hair Piece Magic Paste Pony Tail Hair Extensions Hairpieces for Women Girls\nFESHFEN\n{'Brand': 'FESHFEN', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '14.96 x 3.58 x 0.75 inches; 5.19 Ounces'}\nDifficult to get the hair ‘wrap’ wrapped around my own ponytail  because the Velcro sticks to the fake hair. Also is too heavy so is slides down your own ponytail.\nDoesn’t stay on!\nYoungSee 20\" Remy Tape in Hair Extensions Ombre Balayage Medium Brown with Bleach Blonde 100% Real Human Hair Seamless Tape in Human Hair Extensions 50g 20pcs\nYoungSee\n{'Brand': 'YoungSee', 'Extension Length': '20 Inches', 'Hair Type': 'Wavy, Straight', 'Installation Type': 'Tape-In', 'Product Dimensions': '20 x 1 x 1 inches; 1.76 Ounces', 'UPC': '786784875194'}\nI was so disappointed when I open the package. The top of the Wests are almost black. They are not a medium brown at all. Unfortunately I open the package too late to be able to return them. I’m keeping the box to remind myself never to buy from them again.<br /><br />UPDATE: They also mat horribly!\nDON’T BUY -Tops are Black,NOT Brown",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Emphasis:** Prioritizes effective hair care solutions, particularly for managing frizz in humid conditions. Considers quality and color accuracy essential in hair products.\n- **Product Preference:** Values leave-in conditioners, especially those enriched with organic oils for nourishment and moisture, while exploring hair accessories and extensions.\n- **Hair Type Specificity:** Has waist-length, kinky curly hair that undergoes straightening; experiences dryness and grays, highlighting the need for hydration and care. Recent purchase of hair extensions revealed a mismatch in color and quality.\n- **Brand Loyalty:** Committed to finding trusted products, demonstrating a willingness to explore brands but with heightened scrutiny following unsatisfactory experiences with new items.\n- **Usage Habits:** Washes hair twice a week and uses products sparingly, reflecting a mindful approach to hair care focused on longevity. Disappointing experiences have caused reassessment of product reliability.\n- **Positive Experience:** Generally satisfied with past purchases but recent interactions with hair accessories and extensions indicate a need for careful evaluation of functionality, comfort, and color fidelity. \n- **Sustainability Focus:** Purchases from discount outlets to ensure cost-effectiveness while seeking accessible quality, underscoring the importance of value in hair care products.\n\nOverall, the user is committed to finding quality hair maintenance products tailored to their specific hair type, with an increasing emphasis on color accuracy and performance following a negative experience with extensions.",
  "metrics": {
    "rouge1_f": 0.26976744186046514,
    "rouge2_f": 0.04354587869362364,
    "rougeL_f": 0.13023255813953488,
    "meteor": 0.13206883316880552,
    "bleu1": 0.1306414994076391,
    "bleu2": 0.02790168313964641,
    "bleu3": 0.010518867728240174,
    "bleu4": 0.003635141041757916,
    "bertscore_precision": 0.38834020495414734,
    "bertscore_recall": 0.4583381414413452,
    "bertscore_f1": 0.42044565081596375
  }
}