{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Maybelline Master Fixer Makeup Remover Pen\nReview Date: 2022/02/15\nStore: MAYBELLINE\nProduct Description: ['Master Fixer Makeup Remover Pen instantly repairs eyeliner, mascara, lip liner, and lipstick mishaps.']\nAverage Rating: 4.5\nProduct Details: {'Color': 'White', 'Brand': 'MAYBELLINE', 'Product Benefits': \"At home or on the go? Makeup slips can happen anywhere. Now, correct makeup mistakes instantly, all without ruining your look. Maybelline's makeup remover pen touches up any smudges or marks without leaving behind a greasy feeling.At home or on the go? Makeup slips can happen anywhere. Now, correct makeup mistakes instantly, all without ruining your look. Maybelline's makeup remover pen touches up any smudges or marks without leaving…   See more\", 'Skin Type': 'All', 'UPC': '041554494563'}\nReview Text: This is really a good little tool. Maybelline and so many places end up doing away with the OG'S which is awful and sad. Things like this are so good to have this works great holds up wonderful.\nReview Title: Maybelline please don't ever stop making this.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Beauty Treats Eye shadow NUDES & SMOKY 2pc Palette\nBeauty Treats\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.51 x 4.02 x 0.98 inches; 6.4 Ounces', 'Item model number': 'SG_B01B6WTCCM_US', 'UPC': '784179131863 755332577347 676768409012'}\nTruly unreal this is really good no joke just as good as high end brands no lie. I was truly shocked but what can it hurt to try and see for yourself. This was a huge shock really good if you had blind folds on you would NOT know the differences between this and visesrts.\nJust because things are cheaper doesn't mean they are not as good or better then higher priced brands\nBeauty Treats Eye Shadow MODERN MATTE 2 pc Palette\nBeauty Treats\n{'Brand': 'Beauty Treats', 'Finish Type': 'Matte', 'Special Feature': 'Travel size, Matte', 'Number of Items': '2', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.51 x 4.02 x 0.98 inches; 0.01 Ounces', 'Item model number': 'SG_B01B6WXOEY_US', 'UPC': '784179908755 755332499977 676768409036'}\nThese truly SHOCKED ME.. These are just as good as high end that's no lie.  I have visearts and when I bought these I was truly shocked. They truly can stand with the high end brands and hold their own.  Honestly\nJust because something is cheaper doesn't mean its not good or better then higher brands.\nBelen Thermal Temperature Color Changing Gel Nail Polish Soak Off UV LED Nail Lacquer 4219\nBelen\n{'Brand': 'Belen', 'Item Form': 'Gel', 'Type': 'gel', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Liquid Volume': '0.25 Fluid Ounces, 7 Milliliters', 'Is Discontinued By Manufacturer': 'No', 'UPC': '794168032521'}\nI love the way the colors change however I hate the way it makes your real nails even with a clear protector on 2 coats before hand it's still makes your real nails brittle soft and very unhealthy looking.\nI wish ida knew it was going to make my real nails brittle\nL.A. Colors Iced Pigment Powder Eye shadow Metallic (CEP536 LUSTER)\nL.A. COLORS\n['A highly pigmented powder with a bold, frosted metallic finish. Long lasting, buildableæeye color available in 12 dazzling shades. Each color is beautifully encapsulated in a flashy color matched metallic cube to attract and delight all makeup enthusiasts.']\n{'Brand': 'L.A. COLORS', 'Item Form': 'Powder', 'Finish Type': 'Metallic', 'Skin Tone': 'Light', 'Package Information': 'Jar', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '4.72 x 4.72 x 1.18 inches; 1.59 Ounces', 'Item model number': '0081555755324', 'UPC': '748616077442 789533683781 081555755324'}\nReally nice. So glad I bought these\nThey are really easy and work great\nMILANI ~ Fierce Foil EYESHINE ~ 05 NAPLES\nMilani\n['Milani Fierce Foil Eyeshine Eyeshadow Quad 05 Naples']\n{'Brand': 'Milani', 'Skin Tone': 'All', 'Skin Type': 'All', 'Item Weight': '4 Grams', 'Package Information': 'Palette', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.54 x 2.68 x 0.63 inches; 0.14 Ounces', 'UPC': '717489690058'}\nThese are the worse things I've ever put on my lids. My goodness talk about burning my eyes was on fire.  I washed them 5 times and still couldn't get this plaster off.  Please don't put these on your eyes.  I'm sending these horror rings back.  ASAP!!!!\nTore my eyes up\nMaybelline Master Fixer Makeup Remover Pen\nMAYBELLINE\n['Master Fixer Makeup Remover Pen instantly repairs eyeliner, mascara, lip liner, and lipstick mishaps.']\n{'Color': 'White', 'Brand': 'MAYBELLINE', 'Product Benefits': \"At home or on the go? Makeup slips can happen anywhere. Now, correct makeup mistakes instantly, all without ruining your look. Maybelline's makeup remover pen touches up any smudges or marks without leaving behind a greasy feeling.At home or on the go? Makeup slips can happen anywhere. Now, correct makeup mistakes instantly, all without ruining your look. Maybelline's makeup remover pen touches up any smudges or marks without leaving…   See more\", 'Skin Type': 'All', 'UPC': '041554494563'}\nThis is really a good little tool. Maybelline and so many places end up doing away with the OG'S which is awful and sad. Things like this are so good to have this works great holds up wonderful.\nMaybelline please don't ever stop making this.",
  "profile": "**Updated User Profile Summary**\n\n- **Product Interest:** Passionate about cosmetics, particularly eye makeup with a strong focus on eyeshadow palettes, and an increasing interest in nail products.\n\n- **Brand Perception:** Champions affordable beauty options while maintaining a discerning attitude toward quality.\n\n- **Preference for Performance:** Values cosmetics that deliver effective performance comparable to higher-end products. Encourages budget-friendly finds with impressive results but is realistic about potential downsides regarding health and aesthetics.\n\n- **Positive Attitude:** Maintains an optimistic outlook on discovering high-quality, affordable products while being candid about performance issues, especially related to eye and nail health.\n\n- **Engagement:** Actively shares comprehensive reviews and personal experiences within the beauty community. Values transparency in feedback, readily discussing both positive and negative encounters.\n\n- **Recent Interactions:** Following a negative experience with an eyeshadow product due to irritation and removal difficulties, the user remains committed to honest critiques, reinforcing their quality expectations. Additionally, they expressed satisfaction with a recent purchase that effectively addressed makeup mishaps, showcasing their appreciation for reliable tools that enhance their beauty routine.\n\nThrough their reviews and insights, the user continues to establish themselves as a trusted voice in the beauty community, advocating for affordability without sacrificing quality while being open about product challenges.",
  "metrics": {
    "rouge1_f": 0.1288888888888889,
    "rouge2_f": 0.004454342984409799,
    "rougeL_f": 0.057777777777777775,
    "meteor": 0.05516840882694541,
    "bleu1": 0.019348000651728633,
    "bleu2": 0.004102065688505398,
    "bleu3": 0.0007882223604897604,
    "bleu4": 0.0003458571570128569,
    "bertscore_precision": 0.33040690422058105,
    "bertscore_recall": 0.42516279220581055,
    "bertscore_f1": 0.3718431890010834
  }
}