{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Pre-stretched Braiding Hair Easy Braid Professional Itch Free Synthetic Fiber Corchet Braids Yaki Texture Hair Extensions 5 packs Braid Hair 22 Inch (Color T1B/27)\nReview Date: 2020/06/28\nStore: Kapelli Hair\nAverage Rating: 4.0\nProduct Details: {'Brand': 'Kapelli Hair', 'Material': 'Synthetic', 'Extension Length': '22 Inches', 'Package Dimensions': '11.9 x 11.25 x 2.3 inches; 15.2 Ounces'}\nReview Text: I ordered these Kapelli Hair textured crochet extensions for my wife and she does look really good with them. My wife says that she says she does like them a lot because they are different from the crochet hair extensions that she usually gets and she likes how lightweight, abundant and flowy they feel on her head. She likes how they have a very natural and fluffy look and how easy they are to fic with no harm or damage to her skin. My wife does like the hair pattern and she says that they are nice and smooth. She says that they didn't even look frizzy or damaged when the hair was taken out of the packets. She says her favorite thing about these hair's is how easy they are to wash and how breathable it feels which makes it nice for when it’s hot in our neck of the woods Summer weather. My wife does like that the hair looks tangle -free and sheds- free after washing them. Overall my wife really likes the hair extension and she says that they are different, cute and they look natural and shiny. I would definitely recommend them.\nReview Title: Durable, easy to fix and great value for money!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Lihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nI ordered these Lihui Pre- Twisted Passion twists crochet 6 packs hair for my wife and she likes them so much. She says they seem to be made of good quality materials and like that they are pe-twisted. My wife wanted to try out a different style so we got these crochet passion twists. She likes that they are lightweight, durable, and easy to install with simple to follow instructions. She says she likes that the twists are tight and bouncy and they are also soft and shiny. Another feature my wife likes is that the passion twists don't tangle easily as she since she fixed them. She likes that they comes with enough twists for her whole head, and even had extra after fixing the hair. My wife has ordered hair in the past that smelled bad, luckily these twists didn't have a foul odor. Overall, my wife was very happy with these twists and how beautiful they looked on her. I would recommend them.\nEasy to install, and good value for money\nSTYLEAGAL False Eyelashes - 4 Pairs Multipack Natural 3D False Eyelashes Natural Thick Hand-Made Faux Mink Eyelashes Extension(G106)\nstyleagal\n{'Brand': 'styleagal', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 3.8 x 0.3 inches; 0.63 Ounces'}\nI ordered these STYLEAGAL false eyelashes for my wife and she says she likes them so much and the thickness and the color. She says the eyelashes were easy to attach on her own eyelashes by following simple steps.<br />After applying them the lashes on, she says she likes how the false eyelashes blend well with her own natural eyelashes; giving them a more full look. She likes that they were made of good quality synthetic fibers, and they appear to be durable. She says she likes that they are lightweight, soft, and smooth. My wife likes that she can reuse them and she has reused them 6 times in the last 2+ weeks, and so far, so good.<br />For the quality, quantity and price, they are great value for money. I would recommend them.\nGreat quality and value for money\nPre-stretched Braiding Hair Easy Braid Professional Itch Free Synthetic Fiber Corchet Braids Yaki Texture Hair Extensions 5 packs Braid Hair 22 Inch (Color T1B/27)\nKapelli Hair\n{'Brand': 'Kapelli Hair', 'Material': 'Synthetic', 'Extension Length': '22 Inches', 'Package Dimensions': '11.9 x 11.25 x 2.3 inches; 15.2 Ounces'}\nI ordered these Kapelli Hair textured crochet extensions for my wife and she does look really good with them. My wife says that she says she does like them a lot because they are different from the crochet hair extensions that she usually gets and she likes how lightweight, abundant and flowy they feel on her head. She likes how they have a very natural and fluffy look and how easy they are to fic with no harm or damage to her skin. My wife does like the hair pattern and she says that they are nice and smooth. She says that they didn't even look frizzy or damaged when the hair was taken out of the packets. She says her favorite thing about these hair's is how easy they are to wash and how breathable it feels which makes it nice for when it’s hot in our neck of the woods Summer weather. My wife does like that the hair looks tangle -free and sheds- free after washing them. Overall my wife really likes the hair extension and she says that they are different, cute and they look natural and shiny. I would definitely recommend them.\nDurable, easy to fix and great value for money!",
  "profile": "**Updated User Profile Summary:**\n\n- **Targeted Demographic:** Engages with beauty products for women, specifically in hair styling and eye enhancement, with a keen interest in grooming items.\n- **Style Preference:** Favors versatile hairstyles, particularly enjoying lightweight, textured styles that enhance a natural look while embracing innovations in makeup like false eyelashes.\n- **Material Quality:** Highly values premium, soft, and durable materials with excellent craftsmanship, appreciating items that feel good and function well.\n- **Installation & Ease of Use:** Prioritizes convenience, seeking user-friendly products that come with clear instructions, making application straightforward in both hair care and makeup routines.\n- **Care & Maintenance:** Prefers low-maintenance and breathable hair solutions, evident from the satisfaction in using products that are easy to wash and maintain, contributing to comfortable wear in warmer climates.\n- **Satisfaction Indicators:** Appreciates odor-free, tangle-free, and shedding-free products, looking for items that provide sufficient quantity for complete styling without needing additional purchases.\n- **Recommendation Tendencies:** Likely to recommend well-performing products based on positive experiences, particularly those that demonstrate quality and ease of use.\n- **Value for Money:** Seeks good value, emphasizing quality at an affordable price, often gravitating towards options that offer durability and are multi-use in both hair and beauty categories.\n\nOverall, the user values quality, usability, innovative style, and cost-effectiveness in beauty products that enhance aesthetics while ensuring ease of application and upkeep.",
  "metrics": {
    "rouge1_f": 0.21758241758241761,
    "rouge2_f": 0.037444933920704845,
    "rougeL_f": 0.10329670329670329,
    "meteor": 0.09619089890709348,
    "bleu1": 0.07206460406857185,
    "bleu2": 0.027633920522119042,
    "bleu3": 0.0124080823937524,
    "bleu4": 0.005884176710793289,
    "bertscore_precision": 0.3860001564025879,
    "bertscore_recall": 0.46198028326034546,
    "bertscore_f1": 0.4205862581729889
  }
}