{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nReview Date: 2020/02/03\nStore: Lihui\nAverage Rating: 4.4\nProduct Details: {'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nReview Text: I ordered these Lihui Pre- Twisted Passion twists crochet 6 packs hair for my wife and she likes them so much. She says they seem to be made of good quality materials and like that they are pe-twisted. My wife wanted to try out a different style so we got these crochet passion twists. She likes that they are lightweight, durable, and easy to install with simple to follow instructions. She says she likes that the twists are tight and bouncy and they are also soft and shiny. Another feature my wife likes is that the passion twists don't tangle easily as she since she fixed them. She likes that they comes with enough twists for her whole head, and even had extra after fixing the hair. My wife has ordered hair in the past that smelled bad, luckily these twists didn't have a foul odor. Overall, my wife was very happy with these twists and how beautiful they looked on her. I would recommend them.\nReview Title: Easy to install, and good value for money\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Lihui Pre-Twisted Passion Twist Crochet Hair 6 Packs Pre-Looped Crochet Hair For Women 14inch Passion Twist Hair Crochet Braids Hair(14Inch,#1B)\nLihui\n{'Brand': 'Lihui', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Package Dimensions': '9.6 x 6.2 x 2.4 inches; 12.8 Ounces', 'UPC': '755101858097'}\nI ordered these Lihui Pre- Twisted Passion twists crochet 6 packs hair for my wife and she likes them so much. She says they seem to be made of good quality materials and like that they are pe-twisted. My wife wanted to try out a different style so we got these crochet passion twists. She likes that they are lightweight, durable, and easy to install with simple to follow instructions. She says she likes that the twists are tight and bouncy and they are also soft and shiny. Another feature my wife likes is that the passion twists don't tangle easily as she since she fixed them. She likes that they comes with enough twists for her whole head, and even had extra after fixing the hair. My wife has ordered hair in the past that smelled bad, luckily these twists didn't have a foul odor. Overall, my wife was very happy with these twists and how beautiful they looked on her. I would recommend them.\nEasy to install, and good value for money",
  "profile": "**User Profile Summary:**\n\n- **Targeted Demographic:** Prefers products for women’s hair styling, indicating engagement with female-oriented beauty and grooming products.\n- **Style Preference:** Enjoys trying different hairstyles, specifically opting for pre-twisted crochet styles that offer versatility.\n- **Material Quality:** Values high-quality materials that are soft, shiny, lightweight, and durable, highlighting an appreciation for good craftsmanship.\n- **Installation & Ease of Use:** Looks for products that are easy to install, with simple instructions, indicating a preference for convenience in hair care routines.\n- **Care & Maintenance:** Appreciates low-maintenance options, as evident from the mention of products that do not tangle easily once installed.\n- **Satisfaction Indicators:** Prioritizes products that are odor-free and come with sufficient quantity for complete styling without needing extra purchases.\n- **Recommendation Tendencies:** Likely to recommend products based on positive experiences, suggesting a tendency towards sharing helpful feedback and reviews.\n- **Value for Money:** Seeks products that are perceived as good value, balancing quality with affordability.\n\nOverall, this user prioritizes quality, usability, and style variety in hair products, focusing on those that enhance aesthetics while ensuring ease of application and maintenance.",
  "metrics": {
    "rouge1_f": 0.33414043583535114,
    "rouge2_f": 0.06326034063260341,
    "rougeL_f": 0.1598062953995157,
    "meteor": 0.20797688387331636,
    "bleu1": 0.3056745846861708,
    "bleu2": 0.11507926745628264,
    "bleu3": 0.05241589482978571,
    "bleu4": 0.01513029352439765,
    "bertscore_precision": 0.44322386384010315,
    "bertscore_recall": 0.46984708309173584,
    "bertscore_f1": 0.45614734292030334
  }
}