{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Tattoo Concealer, Makeup Concealer, Scar Concealer, Pro Concealer, Professional Waterproof Concealer Set, Cover Tattoo/ Scar/ Birthmark/ Vitiligo/ Bruise/ Acne, Tattoo Cover up Makeup/Body Concealer\nReview Date: 2019/08/12\nStore: BUOCEANS Official\nAverage Rating: 3.2\nProduct Details: {'Item Form': 'Cream', 'Color': 'Ivory', 'Skin Type': 'Acne Prone', 'Finish Type': 'Natural', 'Package Information': 'Bottle', 'Package Dimensions': '6 x 4.5 x 1.3 inches; 2.4 Ounces'}\nReview Text: This concealer covers my arms with almost perfect match to my skin color. It stay on all day without smudging, or feeling like my pores are clogged.  End of the day I wash it off.\nReview Title: Cover me good\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Kuyang 4 IN 1 Electric Razor for Women, USB Rechargeable Electric Shaver for Women, Cordless Electric Epilator with 3 Different Razor Head 1 Facial Cleansing Brush, Wet or Dry Use\nKuyang\n{'Package Dimensions': '8 x 4.7 x 3.9 inches; 13.62 Ounces', 'UPC': '796862932046'}\nMy first experience with a shaver Like this and I love it. The back and forth motion and no fear of getting sliced like a reg razor is definitely a plus. Very easy to clean and compact ; goes with me everywhere.\nSlick as a whistle\nGel Nail Lamp with 5 Storage Units, NEXPURE 48W UV LED Nail Dryer Curing Lamp 4 Timer Setting Auto Sensor for All Nail Polish\nNEXPURE\n{'Brand': 'NEXPURE', 'Color': 'Pink', 'Product Dimensions': '10.24 x 7.68 x 5.43 inches; 1.76 Pounds', 'Special Feature': 'Motion Sensor', 'Light Source Type': 'LED', 'UPC': '681013249145', 'Manufacturer': 'NEXPURE'}\nTired of having to pay a lot of<br />Money for just a polish change. This is so easy to set up and use. I can do my own nails whenever I want now. Compact enough to stow away in a drawer or closet.\nPretty nails today\nTattoo Concealer, Concealer, To Cover Tattoo/Scar/Birthmarks/Vitiligo, Waterproof Concealer, Professional Waterproof Tattoos Cover Up Makeup Concealer Set\nTOULLGO\n{'Item Form': 'Cream', 'Color': 'Brown, White, Ivory', 'Skin Type': 'Acne Prone', 'Package Information': 'Bottle', 'Brand': 'TOULLGO', 'Package Dimensions': '5.9 x 4.2 x 1.5 inches; 3.84 Ounces'}\nMy job does not allow tattoos , this stuff is amazing. It goes on smoothly and looks just like my own skin. It doesn’t rub off onto anything and washes off easily. Great over my scar too.\nYou can’t see me\nTattoo Concealer, Makeup Concealer, Scar Concealer, Pro Concealer, Professional Waterproof Concealer Set, Cover Tattoo/ Scar/ Birthmark/ Vitiligo/ Bruise/ Acne, Tattoo Cover up Makeup/Body Concealer\nBUOCEANS Official\n{'Item Form': 'Cream', 'Color': 'Ivory', 'Skin Type': 'Acne Prone', 'Finish Type': 'Natural', 'Package Information': 'Bottle', 'Package Dimensions': '6 x 4.5 x 1.3 inches; 2.4 Ounces'}\nThis concealer covers my arms with almost perfect match to my skin color. It stay on all day without smudging, or feeling like my pores are clogged.  End of the day I wash it off.\nCover me good",
  "profile": "**User Profile Summary:**\n\n- **Product Preference:** The user continues to favor electric grooming devices, particularly multifunctional razors designed for women. Their ongoing interest in enhancing their beauty routine is reinforced by their recent positive experiences with concealer products, showcasing a desire for versatile tools that can effectively address various skin imperfections.\n\n- **Safety and Ease of Use:** The user values safety in grooming and beauty products, opting for those that minimize the risk of cuts and ensure an intuitive user experience. Their satisfaction with concealers indicates they prefer products that deliver effective results without complications.\n\n- **User Experience:** Positive interactions with products are crucial for the user. They consistently show appreciation for quality and reliability, evident from their high ratings of concealers that effectively match their skin tone and provide all-day wear without clogging pores.\n\n- **Compactness and Portability:** The user favors tools that are compact and easily portable, aligning with their lifestyle where convenience is key. Space-saving products enhance their grooming and beauty routines effectively, whether at home or on the go.\n\n- **Additional Features:** The user highly values multifunctionality, reflected in their broader interest in grooming and beauty applications. They appreciate features that enhance usability, including ease of application and effectiveness across different contexts.\n\nOverall, the user seeks dependable, safe, and convenient beauty solutions that elevate their routines, emphasizing quality, performance, and user-friendly experiences.",
  "metrics": {
    "rouge1_f": 0.1760797342192691,
    "rouge2_f": 0.009999999999999998,
    "rougeL_f": 0.08970099667774087,
    "meteor": 0.09749894022891056,
    "bleu1": 0.11882265508461694,
    "bleu2": 0.004467290783503356,
    "bleu3": 0.0014983403955839804,
    "bleu4": 0.0008685272984415359,
    "bertscore_precision": 0.36010944843292236,
    "bertscore_recall": 0.41805505752563477,
    "bertscore_f1": 0.3869248330593109
  }
}