{
  "interaction_number": 18,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Pottersville\nReview Date: 2021/06/22\nStore: Michael Shannon  (Actor),     Ian McShane  (Actor),     Seth Henrikson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: ['A beloved local businessman inadvertently sets off a media spectacle when mistaken for Bigfoot in an otherwise quaint New England town.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Comedy', 'Format': 'NTSC, Widescreen', 'Contributor': 'Seth Henrikson, Thomas Lennon, Judy Greer, Ron Perlman, Michael Shannon, Ian McShane, Christina HendricksSeth Henrikson, Thomas Lennon, Judy Greer, Ron Perlman, Michael Shannon, Ian McShane, Christina Hendricks  See more', 'Language': 'English', 'Runtime': '1 hour and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Seth Henrikson', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'December 12, 2017', 'Actors': 'Michael Shannon, Ian McShane, Thomas Lennon, Christina Hendricks, Judy Greer', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nReview Text: Hilarious holiday-ish movie - great for anyone living in \"bigfoot\" country...like us here in the PNW. Ha!\nReview Title: Love this movie!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Nora Ephron'], 'Producers': ['Nora Ephron', 'Laurence Mark', 'Amy Robinson', 'Eric Steel'], 'Starring': ['Meryl Streep', 'Amy Adams', 'Stanley Tucci'], 'Studio': ['SONY PICTURES ENTERTAINMENT', 'INC.']}\nI just love this movie. Two true stories intertwined with delicious food at the center, Meryl Streep and Amy Adams in the lead roles - what's not to like? Great for anyone who loves to cook and has considered writing a blog - it's a fun and inspiring story.\nCooking and Blogging Inspiration\nMiracle on 34th Street\nRichard Attenborough  (Actor),     Elizabeth Perkins  (Actor),     Les Mayfield  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n['Product Description', \"Six year old Susan Walker has doubts about childhood enduring miracle Santa Claus, until the man portraying Santa in the Macy's Thanksgiving Day parade claims to be the genuine article. Starring Elizabeth Perkins, Richard Attenborough, Dylan McDermott and Mara Wilson. (1994) Running Time: 114 Minutes.\", 'Amazon.com', 'Anyone skeptical of updated retreads of Christmas movie classics may be genuinely surprised by this 1994 version of', 'Miracle on 34th Street', '. Based on the 1947 holiday classic, this new', 'Miracle', \"sticks close to the original's story, though it offers more contemporary, crisper pacing and a tone curiously more reflective--even sorrowful--than before. Richard Attenborough is charming and twinkly as Kris Kringle, the part that won Edmund Gwenn an Oscar. Mara Wilson is the little New York City girl who doesn't believe in Santa Claus until Kris persuades her otherwise. Elizabeth Perkins is her hardened mother, and Dylan McDermott plays the handsome lawyer next door who defends Kris during an insanity hearing. While screenwriter John Hughes has toughened up the dialogue a bit, and McDermott's intensity looks like a dry run for his then- future role on television's\", 'The Practice', ', this', 'Miracle', 'is as persuasively sweet as the one previous.', '--Tom Keogh']\n{'Genre': 'Kids & Family', 'Format': 'Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Elizabeth Perkins, Richard Attenborough, Kathrine Narducci, Dylan McDermott, James Remar, Mary McCormack, Jane Leeves, J.T. Walsh, Valentine Davies, William Windom, George Seaton, Mara Wilson, John Hughes, Simon Jones, Les Mayfield, Robert ProskyElizabeth Perkins, Richard Attenborough, Kathrine Narducci, Dylan McDermott, James Remar, Mary McCormack, Jane Leeves, J.T. Walsh, Valentine Davies, William Windom, George Seaton, Mara Wilson, John Hughes, Simon Jones, Les Mayfield, Robert Prosky  See more', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified, English (Dolby Digital 5.0)', 'Runtime': '1 hour and 54 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.58 x 5.34 x 7.44 inches; 0.01 Ounces', 'Item model number': '24543004981', 'Director': 'Les Mayfield', 'Media Format': 'Anamorphic, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'October 31, 2000', 'Actors': 'Richard Attenborough, Elizabeth Perkins, Dylan McDermott, J.T. Walsh, James Remar', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'George Seaton, John Hughes, Valentine Davies', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI just love this movie! I've seen the original, and I definitely like this one better. Richard Attenborough makes a most fantastic Santa Clause!\nGreat for the annual Christmastime viewing\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon Favreau'], 'Producers': ['Jon Favreau', 'Sergei Bespalov'], 'Starring': ['Jon Favreau', 'Sofia Vergara', 'John Leguizamo']}\nGreat, inspiring movie!\nWatch it!\nThe Big Bang Theory: Season 7\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Big Bang Theory, The: The Complete Seventh Season (DVD)', 'Doctors Leonard Hofstadter & Sheldon Cooper (Johnny Galecki & Jim Parsons) are brilliant physicists – masterminds of their CalTech laboratories, but socially challenged in the non-theoretical real world. Enter beautiful, street-smart neighbor, the actress/waitress Penny (Kaley Cuoco), who aims to teach them a thing or two about life. Despite their on-again, off-again relationship in the past, Leonard believes he’s found true love with Penny. Even Sheldon has grown comfortable with a female companion, entering into a signed “Relationship Agreement” with neurobiologist Amy Farrah Fowler (Mayim Bialik). In their free time, Leonard and Sheldon continue to enjoy weekly trips to the comic book store and fantasy role-playing games with their ever-expanding universe of friends, including fellow scientists Rajesh Koothrappali (Kunal Nayyar), Howard Wolowitz (Simon Helberg), and Howard’s microbiologist wife, Bernadette (Melissa Rauch).', ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Widescreen, NTSC', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Johnny Galecki, Kaley Cuoco, Chuck LorreMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Johnny Galecki, Kaley Cuoco, Chuck Lorre  See more', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 4.8 Ounces', 'Item model number': '829047', 'Media Format': 'Multiple Formats, Widescreen, NTSC', 'Run time': '8 hours and 5 minutes', 'Release date': 'September 16, 2014', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar', 'Subtitles': 'French, Portuguese, Korean, Thai, Spanish', 'Producers': 'Chuck Lorre, Bill Prady, Steven Molaro', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\nLove this show! This season is even better than all the previous seasons - I wasn't sure about Amy until this season and now she's one of my favorite characters. They've all really come into their characters more naturally this season. It's great!\nLoving this season!\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Ridley Scott'], 'Producers': ['Ridley Scott'], 'Starring': ['Russell Crowe', 'Abbie Cornish', 'Albert Finney'], 'Studio': ['20TH CENTURY FOX']}\nIt was decent. Not the kind of movie I would expect from Russell Crowe. A friend had just been out there and actually saw the movie while they were there and then recommended it to us. We enjoyed it. Would watch it again.\nGood movie\nSeinfeld: Season 6\nJerry Seinfeld  (Actor, Producer),     Julia Louis-Dreyfus  (Actor),     Andy Ackerman  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['MATCH GENERIC']\n{'Genre': 'Comedy', 'Format': 'Box set, Full Screen, Subtitled, NTSC', 'Contributor': 'Jason Alexander, Michael Richards, Andy Ackerman, Jerry Seinfeld, Julia Louis-Dreyfus, Suzy Mamann Greenberg, Peter MehlmanJason Alexander, Michael Richards, Andy Ackerman, Jerry Seinfeld, Julia Louis-Dreyfus, Suzy Mamann Greenberg, Peter Mehlman  See more', 'Language': 'English', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': '25546682', 'Director': 'Andy Ackerman', 'Media Format': 'Box set, Full Screen, Subtitled, NTSC', 'Run time': '9 hours and 9 minutes', 'Release date': 'September 25, 2012', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander', 'Dubbed': 'French', 'Subtitles': 'English, Portuguese, French, Spanish', 'Producers': 'Suzy Mamann Greenberg, Peter Mehlman, Jerry Seinfeld', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '4'}\nOf course I'm giving it five stars. How can you not love Seinfeld?\nHow can you not love Seinfeld?\nSeinfeld: Season 5\nJerry Seinfeld  (Actor, Producer),     Julia Louis-Dreyfus  (Actor),     Tom Cherones  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['MATCH GENERIC']\n{'Genre': 'Comedy', 'Format': 'Box set, Full Screen, Subtitled, NTSC', 'Contributor': 'Jason Alexander, Michael Richards, Jerry Seinfeld, Julia Louis-Dreyfus, Max Pross, Tom Cherones, Tom GammillJason Alexander, Michael Richards, Jerry Seinfeld, Julia Louis-Dreyfus, Max Pross, Tom Cherones, Tom Gammill  See more', 'Language': 'English', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.28 Ounces', 'Item model number': '25546681', 'Director': 'Tom Cherones', 'Media Format': 'Box set, Full Screen, Subtitled, NTSC', 'Run time': '8 hours and 18 minutes', 'Release date': 'September 25, 2012', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish, Portuguese', 'Producers': 'Jerry Seinfeld, Max Pross, Tom Gammill', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '4'}\nLove it - hilarious!\nFive Stars\nSeinfeld: Season 4\nJerry Seinfeld  (Actor, Producer),     Julia Louis-Dreyfus  (Actor),     Tom Cherones  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Match Generic', 'Amazon.com', \"It's hard to believe, but for the first three seasons nobody really knew that\", 'Seinfeld', 'was about, well, you know. It wasn\\'t until season 4--unleashed here in a four-disc set that\\'s equal in scope, quality, and quantity of bonus material to its predecessors--that the show really became something. In a series which can claim every installment as classic, the two-parter on disc 1 titled \"The Pitch/The Ticket\" truly stands out as a defining episode and, in retrospect, marked', 'Seinfeld', '4 as the breakthrough season. It\\'s the one where (fake) NBC executives express their interest in working with Jerry Seinfeld on a TV show, then moves to the who\\'s-on-first shtick of George successfully pitching Jerry on creating \"a show about nothing.\" Scattered throughout the discs in commentaries by cast and creators and in numerous \"Inside Look\" documentaries, nearly everyone expresses some anxiety about the season having a story \"arc\" depicting Jerry and his \"real\" life becoming a sitcom. The show had been only marginally successful up to that point anyway, and with the edict, \"no hugging, no learning,\" still in place, maybe messing with nothing was a bad idea. What makes the arc so arch is the self-reflexive way it details the reality of Jerry Seinfeld and Larry David coming up with the concept and pitching it to (real) NBC executives as a show that really was about, well, you know. In one of the many informally informative interview segments, Jerry remembers hitting a stride during this time when a lot of crazy ideas started to make sense. \"Everything was just a wild guess,\" he says, \"and it takes a while to get confident that you\\'re guessing pretty good. I think sometime in season 4 we realized we were guessing pretty good.\" Oh, that we could all be so good at nothing.', 'Season 4 also gave us the episodes \"The Bubble Boy\" (\"He lives in a bubble!\"), \"The Pick\" (\"There was no pick!\"), and, perhaps most memorably, \"The Contest.\" Recalling how nervous he thought NBC might be about a show based on how long a person can remain--ahem--master of his domain, Larry David says that he kept the idea hidden for a long time. He may have had NBC sweating, but the episode goes by without anyone uttering the word that it\\'s really about. The curmudgeonly David also observes that another famous season 4 episode, \"The Outing,\" only made it on the air due to a network \"note\" about making sure it wouldn\\'t be offensive to homosexuals. Hence we have the addition of another standard to the', 'Seinfeld', 'lexicon of American pop culture: \"Not that there\\'s anything wrong with that!\" Not only wasn\\'t there anything wrong with it, the episode won a GLAAD Media Award. Season 4 also brought', 'Seinfeld', 'its first Emmy for Outstanding Comedy Series. Stay tuned for season 5 (and a move to the coveted Thursday-at-9 slot) when the volcano we now know was always brewing really blew its comedic top.', '--Ted Fry']\n{'Genre': 'Comedy', 'Format': 'Subtitled', 'Contributor': 'Jason Alexander, Michael Richards, Jerry Seinfeld, Julia Louis-Dreyfus, Tom Cherones', 'Language': 'French (Dolby Digital 2.0), English (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0)', 'Number Of Discs': '4', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 1.25 inches; 15.2 Ounces', 'Item model number': '654078', 'Director': 'Tom Cherones', 'Media Format': 'Subtitled', 'Run time': '9 hours and 11 minutes', 'Release date': 'May 17, 2005', 'Actors': 'Jerry Seinfeld, Julia Louis-Dreyfus, Michael Richards, Jason Alexander', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Portuguese, French, Spanish', 'Producers': 'Jerry Seinfeld', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '4'}\nThis is not my favorite season but there are still some good gems in there!\nFour Stars\nHome for the Holidays, Cover may vary\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Home For the Holidays (RPKG/DVD)', ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Anamorphic, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Contributor': 'Various', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0 Stereo), Unqualified, Spanish (Dolby Digital 2.0 Stereo)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 1.6 Ounces', 'Item model number': '1002359', 'Director': 'Various', 'Media Format': 'Multiple Formats, Anamorphic, Color, NTSC, Closed-captioned, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Various', 'Dubbed': 'Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'WarnerBrothers', 'Number of discs': '1'}\nLove this movie! Had it on VHS and watched it every year around Thanksgiving - it was our tradition. It's hilarious and also depicts your typical disfunctional family with some atypical issues!\nLove this movie\nThe Brothers Grimm\nMatt Damon  (Actor),     Heath Ledger  (Actor),     Terry Gilliam  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n[\"Matt Damon (THE BOURNE SUPREMACY, OCEAN'S TWELVE) and Heath Ledger (THE PATRIOT, A KNIGHT'S TALE) team up to bring you one of the year's most fantastic adventures in this magical tale based on the lives of the legendary storytellers. Will and Jake Grimm (Damon and Ledger) dazzle small towns with their imaginative folklore and elaborate illusions, but when the brothers journey into a real enchanted forest they encounter many of the fantastic characters and thrilling situations found in their beloved fairy tales! From the award-winning director of 12 MONKEYS, BRAZIL and MONTY PYTHON AND THE HOLY GRAIL, this fabulous motion picture is sure to leave you living happily ever after!\"]\n{'Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Monica Bellucci, Charles Roven, Vaclav Chalupa, Uma Thurman, Matt Damon, Richard Ridings, Rudolf Pellar, Ota Filip, Heath Ledger, Jonathan Pryce, Jakub Zindulka, Petr Ratimec, Tomas Hanak, Roger Ashton-Griffiths, Peter Stormare, Lena Headey, Terry Gilliam, Miroslav Táborský, Julian Bleach, Daniel Bobker, Jan Unger, Mackenzie Cook, Audrey Hamm, Bruce MacEwenMonica Bellucci, Charles Roven, Vaclav Chalupa, Uma Thurman, Matt Damon, Richard Ridings, Rudolf Pellar, Ota Filip, Heath Ledger, Jonathan Pryce, Jakub Zindulka, Petr Ratimec, Tomas Hanak, Roger Ashton-Griffiths, Peter Stormare, Lena Headey, Terry Gilliam, Miroslav Tábor…  See more', 'Language': 'English', 'Studio': 'Miramax Lionsgate', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Director': 'Terry Gilliam', 'Media Format': 'Multiple Formats, Color, NTSC, Subtitled, Widescreen', 'Release date': 'January 8, 2013', 'Actors': 'Matt Damon, Heath Ledger, Peter Stormare, Lena Headey, Jonathan Pryce', 'Subtitles': 'French, Spanish', 'Producers': 'Daniel Bobker, Charles Roven', 'Number of discs': '1'}\nI love this movie! I have an annual Halloween movie night for which I have a bunch of gal pals over to watch a semi-scary Halloween-y movie, and this was the pick for this year - not really all that scary, but has some creepy parts to it (we have some lightweights so we can't go too scary), as well as some funny parts. Overall it was a hit!\nGood movie!\nThe Big Bang Theory: Season 9 [DVD]\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['The Big Bang Theory: The Complete Ninth Season (DVD)', 'Prepare to enter phase nine of television’s perpetual laughter experiment as THE BIG BANG THEORY successfully fuses the elements of science and sitcom. Our two genius roommates – Leonard and Sheldon ¬– and their friends are back once again (smarter, but no wiser). Last season, Sheldon went soul-searching (on a train, of course) and was prepared to make some substantial revisions on his Relationship Agreement with Amy, when everything changed. Leonard, meanwhile, was off to Vegas with Penny to finally tie the knot in the season finale. Howard finds himself alone with Bernadette after the sudden passing of his mother; while Raj is not only talking to women – he’s getting exclusive with Emily (Laura Spencer). Together, they will all learn that life is far more complicated outside of the lab as love and friendship never produce predictable results!', ']]>']\n{'Genre': 'Comedy', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley CuocoMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley Cuoco   See more', 'Initial release date': '2016-09-13', 'Language': 'English (Dolby Digital 5.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.6 inches; 4.16 Ounces', 'Item model number': '3000069730', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '8 hours and 5 minutes', 'Release date': 'September 13, 2016', 'Actors': 'Johnny Galecki, Jim Parsons, Kaley Cuoco, Simon Helberg, Kunal Nayyar', 'Subtitles': 'English, French, Spanish, Korean, Portuguese, Thai', 'Producers': 'Chuck Lorre, Steven Molaro, Bill Prady', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nProbably the best season yet!\nLove this show!\nA Christmas Story (DVD)\nPeter Billingsley  (Actor),     Melinda Dillon  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', 'Christmas Story, A (WBFE) (DVD)', \"It's the final days before Christmas in early 1940s Cleveland, and 9-year-old Ralphie wants one thing from Santa Clause more than anything else: a Red Ryder Carbine Action Air Rifle. As he trudges through the snow to school, faces the neighborhood bully and visits a malevolent department store Santa Clause, Ralphie connives, conspires and campaigns for the most fabulous Christmas present ever in this heartwarming, hysterical and sweetly nostalgic holiday film.\", ']]>', 'Amazon.com', \"Director Bob Clark's charming, touching, and very funny adaptation of humorist Jean Shepherd's nostalgic, autobiographical Yuletide novel,\", 'In God We Trust, All Others Pay Cash', ', remains essential holiday family viewing. Narrated by a man (Shepherd) recalling his childhood, the film looks back at the compulsive efforts of 7-year-old Ralphie (Peter Billingsley) as he tries every means possible to acquire his dream Christmas gift--a Daisy-brand Red Ryder repeating BB carbine with a compass mounted in the stock. Problem is, he lives in a Norman Rockwell-esque Midwestern town in the 1940s, where his parents, teachers, and even Santa Claus all warn Ralphie that \"he\\'ll shoot his eye out.\" Episodic in nature and seen entirely through the eyes of a child, the film offers a wonderful look at the day-to-day eccentricities that grew out of this conservative period. More interestingly, it cleverly captures childhood urgency, where even the most trivial fantasies or objects become immediate life-or-death necessities. While countless family Christmas movies serve up clichéd situations suffocating with preachy sermons, Clark\\'s acute eye for detail and odd mixture of warmth, satire, and quirky humor are the reasons why so many viewers have rediscovered this after it initially bombed in the theaters. Sentimental without being syrupy, it\\'s a true rarity: a holiday movie that adults and children can enjoy equally, for completely different reasons and regardless of the season.', '--Dave McCoy', 'Review', \"In short, A Christmas Story isn't just about Christmas; it's about childhood and it recaptures a time and place with love and wonder. It seems an instant classic, a film that will give pleasure to people not only this Christmas, but for many Christmases to come. --Jay Car, Boston GlobeThe cast is wonderful--especially McGavin, Billingsley and Petrella--the laughs are nonstop if rarely subtle, and the whole thing deserves to become a Christmastime classic. --TV Guide, StaffIt is pitch-perfect, telling the story through the enthusiastic and single-minded vision of its hero Ralphie, and finding in young Peter Billingsley a sly combination of innocence and calculation. --Roger Ebert, Chicago Sun-Times\", 'About the Actor', \"Peter Billingsley has been a member of the Hollywood community since he was a small child. After appearing on numerous television shows and films during his youth, the Emmy Award-nominated actor delivered a performance for the ages in the beloved holiday film, A Christmas Story (1983). Melinda Dillon made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969) and in Steven Spielberg's Close Encounters of the Third Kind (1977). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987).\", 'About the Director', \"Bob Clark is a director known for his '80s movies such as A Christmas Story (1983), Porky's (1982) and Rhinestone (1984).\", 'See more']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.33 Ounces', 'Item model number': '3349475', 'Director': 'Bob Clark', 'Media Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2007', 'Actors': 'Peter Billingsley, Melinda Dillon, Darren McGavin, Ian Petrella, Scott Schwartz', 'Subtitles': 'English, French, Spanish', 'Producers': 'Rene Dupont, Bob Clark', 'Studio': 'Studio Distribution Services', 'Writers': 'Jean Sheppard, Leigh Brown', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA holiday classic!\nFive Stars\nA Christmas Carol\nGeorge C. Scott  (Actor),     David Warner  (Actor),     Clive Donner  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Science Fiction, General\n['Christmas elicits nothing more than \"Bah, humbug!\" from Ebenezer Scrooge (Scott), a miser whose sole pursuit of financial success has left him a bitter and lonely old man. But a Christmas Eve visit from the Ghosts of Christmas Past, Present and Future ultimately teaches him to open his heart to the spirit of Christmas and to the joys of friends and family.']\n{'Genre': 'Family Entertainment', 'Format': 'Color, NTSC', 'Contributor': 'Angela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy GutteridgeAngela Pleasence, Caroline Langrishe, Anthony Walters, Michael Carter, George C. Scott, Nigel Davenport, Clive Donner, Mark Strickson, Roger Rees, Joanne Whalley, David Warner, Frank Finlay, Susannah York, Edward Woodward, Lucy Gutteridge   See more', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 40 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '24543027201', 'Director': 'Clive Donner', 'Media Format': 'Color, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'October 5, 1999', 'Actors': 'George C. Scott, David Warner, Susannah York, Anthony Walters, Frank Finlay', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': '20TH CENTURY STUDIOS', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA holiday classic!\nFive Stars\nBig Bang Theory: Season 8\nJohnny Galecki  (Actor),     Jim Parsons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Box set, Color, Dolby, NTSC, Subtitled', 'Contributor': 'Mayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley CuocoMayim Bialik, Melissa Rauch, Steven Molaro, Bill Prady, Jim Parsons, Kunal Nayyar, Simon Helberg, Chuck Lorre, Johnny Galecki, Kaley Cuoco   See more', 'Initial release date': '2015-09-15', 'Language': 'English'}\nLove this show!\nFive Stars\nThe Professor\nJeff Beck & Johnny Depp  (Actor),     Johnny Depp  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['A college professor lives his life with reckless abandon after being diagnosed with a terminal illness.']\n{'Genre': 'Comedy', 'Format': 'NTSC, Subtitled', 'Contributor': 'Johnny Depp, Danny Huston, Rosemarie DeWitt, Ron Livingston, Jeff Beck & Johnny Depp', 'Language': 'English', 'Runtime': '1 hour and 31 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Audio Description': 'English', 'Media Format': 'NTSC, Subtitled', 'Run time': '1 hour and 31 minutes', 'Release date': 'July 9, 2019', 'Actors': 'Jeff Beck & Johnny Depp, Johnny Depp, Rosemarie DeWitt, Danny Huston, Ron Livingston', 'Subtitles': 'Spanish', 'Studio': 'Lionsgate Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA great movie, with even better messages! It'll make you laugh, cry, and think about what's really important in life and about living. Love it!\nLove Dark Comedy\nLove, Rosie\nLily Collins  (Actor),     Sam Claflin  (Actor),     Christian Ditter  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"Since the moment they met at age 5, Rosie (Lily Collins) and Alex (Sam Claflin) have been best friends, facing the highs and lows of growing up side by side. A fleeting shared moment, one missed opportunity, and the decisions that follow send their lives in completely different directions. As each navigates the complexities of life, love, and everything in between, they always find their way back to each other - but is it just friendship, or something more? Based on Cecelia Ahern's bestselling novel, LOVE, ROSIE is a heart-warming, modern comedy-of-errors posing the ultimate question: do we really only get one shot at true love?\"]\n{'Genre': 'Comedy/Romantic Comedies', 'Format': 'Multiple Formats, AC-3, Dolby, Subtitled, Color, Widescreen, NTSC', 'Contributor': 'Tamsin Egerton, Jamie Beamish, Lorcan Cranitch, Sam Claflin, Christian Ditter, Jaime Winstone, Christian Cooke, Suki Waterhouse, Lily Collins, Ger RyanTamsin Egerton, Jamie Beamish, Lorcan Cranitch, Sam Claflin, Christian Ditter, Jaime Winstone, Christian Cooke, Suki Waterhouse, Lily Collins, Ger Ryan   See more', 'Language': 'English', 'Runtime': '1 hour and 42 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.6 Ounces', 'Item model number': '59169185000', 'Director': 'Christian Ditter', 'Media Format': 'Multiple Formats, AC-3, Dolby, Subtitled, Color, Widescreen, NTSC', 'Run time': '1 hour and 42 minutes', 'Release date': 'May 5, 2015', 'Actors': 'Lily Collins, Sam Claflin, Christian Cooke, Jaime Winstone, Suki Waterhouse', 'Subtitles': 'English, Spanish', 'Studio': 'Paramount', 'Number of discs': '1'}\nEven hubby loves it!\nExcellent movie!\nIf I Were You\nMarcia Gay Harden  (Actor),     Aidan Quinn  (Actor),     Joan Carr-Wiggin  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"After Madelyn (Academy Award Winner Marcia Gay Harden) and Lucy (Leonor Watling) meet by chance, they make a pact to fix their unhappy lives: they will only do what the other one says and ignore their own instincts. But Madelyn has a secret. She knows her husband is sleeping with Lucy, a much younger and beautiful woman. Madelyn's plan backfires when Lucy, an aspiring actress, orders her to play King Lear in a very amateur production, with Lucy playing the Fool. Madelyn's life is transformed in unexpected ways as, like Lear, she struggles with matters of mortality and betrayal, loyalty and love.\"]\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Anamorphic, Surround Sound, Widescreen', 'Contributor': 'Joan Carr-Wiggin, Valerie Mahaffey, Aidan Quinn, Marcia Gay Harden, Leonor Watling', 'Language': 'English', 'Runtime': '1 hour and 54 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'LBFK1120DVD', 'Director': 'Joan Carr-Wiggin', 'Media Format': 'Multiple Formats, Color, AC-3, Dolby, NTSC, Anamorphic, Surround Sound, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'May 14, 2013', 'Actors': 'Marcia Gay Harden, Aidan Quinn, Leonor Watling, Valerie Mahaffey', 'Studio': 'Kino Lorber', 'Country of Origin': 'USA', 'Number of discs': '1'}\nMarcia Gay Harden is one of our favorite actresses - she's so diverse! We fell in love with this movie on Amazon Prime, but it's no longer free. We missed it so much (we like to play movies as background noise - much like music) that I went ahead and bought it. Great movie, check it out!\nGreat Movie!\nPottersville\nMichael Shannon  (Actor),     Ian McShane  (Actor),     Seth Henrikson  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['A beloved local businessman inadvertently sets off a media spectacle when mistaken for Bigfoot in an otherwise quaint New England town.']\n{'Genre': 'Comedy', 'Format': 'NTSC, Widescreen', 'Contributor': 'Seth Henrikson, Thomas Lennon, Judy Greer, Ron Perlman, Michael Shannon, Ian McShane, Christina HendricksSeth Henrikson, Thomas Lennon, Judy Greer, Ron Perlman, Michael Shannon, Ian McShane, Christina Hendricks  See more', 'Language': 'English', 'Runtime': '1 hour and 25 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Seth Henrikson', 'Media Format': 'NTSC, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'December 12, 2017', 'Actors': 'Michael Shannon, Ian McShane, Thomas Lennon, Christina Hendricks, Judy Greer', 'Studio': 'Echo Bridge', 'Number of discs': '1'}\nHilarious holiday-ish movie - great for anyone living in \"bigfoot\" country...like us here in the PNW. Ha!\nLove this movie!",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user remains passionate about cooking, food-related content, and storytelling, particularly during the holidays. They enjoy reimagined classics and character-driven comedies while also appreciating films featuring strong female leads that navigate complex themes of love and friendship.\n- **Preferred Genres:** They favor a blend of light and dark comedies, nostalgic sitcoms, family-friendly films, and humorous fantasy adventures with subtle creepiness. The user shows a particular affinity for narratives emphasizing character development and community experiences.\n- **Content Sensitivity:** Open to mature themes, including humor surrounding violence and strong language, the user enjoys stories that offer both levity and profound insights.\n- **Emotional Resonance:** Engaging narratives that provoke thought on life’s significance while entertaining are highly valued, with a preference for clever humor interwoven with emotional depth.\n- **Engagement Style:** The user seeks media that inspires creativity in cooking, blogging, and storytelling, heavily leaning towards character-centric narratives that blend fun with introspection.\n- **Rating Tendency:** They consistently provide high ratings, reflecting an appreciation for emotionally resonant characters and heartwarming tales that balance humor with meaningful themes, particularly those with a holiday spirit or whimsical qualities.\n\nThe user's profile continues to celebrate nostalgia, humor, and profound explorations within the media landscape.",
  "metrics": {
    "rouge1_f": 0.04779627815866797,
    "rouge2_f": 0.003919263178522437,
    "rougeL_f": 0.023506366307541625,
    "meteor": 0.01327013028329542,
    "bleu1": 1.6853121613919904e-12,
    "bleu2": 6.302889777668328e-13,
    "bleu3": 1.7682966008974705e-13,
    "bleu4": 5.2719744728135065e-14,
    "bertscore_precision": 0.34728530049324036,
    "bertscore_recall": 0.5275680422782898,
    "bertscore_f1": 0.4188510477542877
  }
}