{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: QUANTUM LEAP THE CS DVD FF\nReview Date: 2014/08/13\nStore: Scott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Drama\nProduct Description: ['Get ready for an adventure of many lifetimes with the ground-breaking sci-fi classic, Quantum Leap. With the complete series box set, you can now leap through all 95 thrilling episodes over 5 seasons of this Primetime Emmy Award-winning series back-to-back and uninterrupted! Join Dr. Sam Beckett (Scott Bakula), a time traveler lost in time, who temporarily leaps into the bodies and lives of other people to \"put right what once went wrong.\" Accompanied by Al (Dean Stockwell), a wise-cracking holograph that only Sam can see and hear, Sam twists the hands of fate with each heart-pounding, action-packed adventure in the hopes that he can someday complete the mission that will take him home.Bonus Content:', 'Quantum Leap: Season One:', 'A Kiss with History', 'A Kiss with History', 'Quantum Knowledge', 'Quantum Knowledge', 'Quantum Leap: Season Four:', 'Season 5 Episode: Liberation', 'Season 5 Episode: Liberation', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Quantum Leap: Season Five:', 'Blueprints', 'Blueprints']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Runtime': '76 hours and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.95 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '76 hours and 38 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '27'}\nReview Text: All Universal Studios Home Entertainment is doing is re-packaging the original disks with grainy footage, techno-music, and probably the same double sided disks that separate and are ruined. These are a complete waste of time and money except for those who are replacing their already defective discs.<br />Quantum Leap Fans: Protest!!! Let Universal know that we want the original music, cleaned up footage and blu ray. Obviously their goal based on response below is NOT to provide the highest standard in product quality or customer care.<br /><br />Give us what we have asked for Universal.  We are willing to pay more for the corrected series.<br /><br />I contacted Universal Studios Home Entertainment. Their response:<br /><br />Thank you for contacting us. Please note that the release you are referring to has the same content as the previous release in a downsized package.<br />Our goal is to provide the highest standard in product quality and customer care, and we value input from our customers.<br />Your comments regarding Quantum Leap music will be forwarded to the appropriate department.<br />We hope you will enjoy future Universal releases.<br /><br />Sincerely,<br /><br />Consumer Relations<br />UNIVERSAL STUDIOS HOME ENTERTAINMENT\nReview Title: An amazing, excellent and still relevant show destroyed by Universal\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Remington Steele: Season 1\nStephanie Zimbalist  (Actor),     Pierce Brosnan  (Actor),     Burt Brinckerhoff  (Director),     Don Weis  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'Before he was Bond... he was Remington Steele...Private eye Laura Holt (Stephanie Zimbalist) grudgingly accepts a new partner when a mystery man (Pierce Brosnan) assumes the identity of her fictitious boss, Remington Steele. Together, the two battle crime as as their feelings for each other.', 'Amazon.com', 'Remington Steele', \"'s fusion of whodunit mystery and screwball comedy burst onto television in 1982. After struggling to get clients to hire a female detective, Laura Holt (sultry Stephanie Zimbalist) invents a fictional boss named Remington Steele, whose dashing manly name draws in work. But while protecting some South African jewels, Holt runs across a mysterious thief and con-man (an elfin, baby-faced Pierce Brosnan) whom her client assumes is the nonexistent Steele--and when the case is resolved, the accidental detective decides he likes the work and sticks around, infuriating Holt with his arrogant ways and tantalizing her with his dashing good looks. Murders may occur at a winery, an island sex club, or a college reunion, but just about every episode plunders plot elements from classic movies like\", 'Bringing Up Baby', ',', 'The Third Man', ', and', 'The Trouble with Harry', \"(even the theme song was written by film composer Henry Mancini). The writers openly acknowledge this influence by having Steele use ideas he's lifted from movies to solve crimes. The constant allusions to old films should be annoying, but the show demonstrates such a rich affection for the classics that these tips of the hat actually mesh with\", 'Remington Steele', \"'s world.\", 'Remington Steele', \"has become best known as Brosnan's launching pad (he later become James Bond in\", 'GoldenEye', \"and its sequels), but Zimbalist was every bit as crucial to the show's success; her mixture of glamor and toughness gives the show a distinctly adult sexiness and grounds Brosnan's boyish charm. The dialogue sometimes slipped from arch camp to sheer cheese, but even at its most ridiculous (say, a scene where Holt and Steele question homeless bums while dressed in formal evening wear)\", 'Remington Steele', \"remains an eminently watchable show, thanks to zippy plotting and the chemistry between Zimbalist and Brosnan. Some episodes clearly implied that the pair had become intimate, yet that didn't defuse their attraction. Even when the stories became a bit silly, the mutual respect and desire between Holt and Steele never lost its sophistication.\", '--Bret Fetzer']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 6.4 Ounces', 'Director': 'Burt Brinckerhoff, Don Weis, Jeff Bleckner, Larry Elikann, Leo Penn', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '17 hours and 58 minutes', 'Release date': 'July 26, 2005', 'Actors': 'Stephanie Zimbalist, Pierce Brosnan, James Read, Janet DeMay, Carlene Watkins', 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nWHAT IS WITH THE COVER??  Shouldn't this be a black background with lip print, gun and such. (As in the beginning of later episodes)  Stephanie Zimbalist was excellent in this series.  Why is she ignored?  Worse yet, what is with the \"Bond\" reference. If \"she\" didn't have a deep dark secret would Brosnan be necessary?????<br /><br />Hey, don't get me wrong. I watched it for ...his blue eyes and mysterious past....\nAnother deep dark secret.........\nWorking Girl\nMelanie Griffith  (Actor),     Harrison Ford  (Actor),     Mike Nichols  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Nominated for 6 Academy Awards; director Mike Nichols' witty, romantic look at life in the corporate jungle stars Melanie Griffith as Tess McGill, an ambitious secretary with a unique approach for climbing the ladder to success. When her classy, but villainous boss (Sigourneey Weaver) Breaks a leg skiing, Tess simply takes over her office, her apartment, even her wardrobe. She then creates a deal with a handsome investment banker (Harrison Ford) that will either take her straight to the top - or finish her off for good.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.08 Ounces', 'Director': 'Mike Nichols', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 17, 2001', 'Actors': 'Melanie Griffith, Harrison Ford, Sigourney Weaver, Alec Baldwin, Joan Cusack', 'Subtitles': 'English, Spanish', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), English (Dolby Digital 3.0)', 'Studio': '20th Century Fox', 'Writers': 'Kevin Wade', 'Number of discs': '1'}\nFor a general review of this fun movie please read other excellent reviews.  I would love to own the DVD.  But where can I purchase a cut version?  I prefer NOT to watch Alec Baldwin \"bopping\" Doreen. Or Kevin Spacey attempting \"seduction??\" by showing a porn film to Griffith.  Nor listen to Griffith remind herself not to F--- Up repeatedly.  Classy lady with foul mouth moves up the corporate ladder.  Nichols attempt to seek a R rating is just plain stupid.  This otherwise wonderful film is ruined by this mess.  To enjoy Working Girl at its best I will watch the TV version.\nGratuitous nudity, foul language & vulgarities\nBee Gees: In Our Own Time [Blu-ray]\nBee Gees  (Actor),     n/a  (Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n[\"Blu-ray pressing. In Our Own Time is the compelling story of the Bee Gees career. From their roots in the North West of England, through their early career in Australia, their return to England and international breakthrough in the late '60s and then on to global superstardom with Saturday Night Fever and beyond. Alongside the success there is the heartache of the tragically early deaths of first their younger brother Andy and then later Maurice. The story is told in their own words through in depth new interviews with Barry and Robin Gibb and through extensive interviews with Maurice filmed shortly before his death in January 2003. These are lavishly illustrated by live performances, TV and film clips and home movies of their early days.\"]\n{'Genre': 'Pop, Music Video & Concerts', 'Format': 'Dolby', 'Contributor': 'n/a, Bee Gees', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '1333729', 'Media Format': 'Dolby', 'Run time': '1 hour and 56 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have always enjoyed the Bee Gees songs, but had not followed their career very closely.  I caught the end of this program on A&E's Biography.  I set the DVR for a repeat of this two hour show.  Watched it and immediately purchased the DVD.  I knew these guys were talented, but the detailed account of their rise to stardom, the damage done by disco, which they DID NOT invent.  And where they have gone from there is just amazing.<br /><br />The bit where they demonstrate their three part harmony, singing Lollipop acapella, caused my 22 year old daughter to exclaim, \"That it crazy good!\"  She is so right.<br /><br />I would recommend this to anyone who has enjoyed the Bee Gees.  I am sure the diehard fans already have their copies.[[ASIN:B0043E8YAM Bee Gees: In Our Own Time [Blu-ray]]]\nExcellent\nAbove Suspicion\nRated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Above Suspicion is a British TV series based on Lynda La Plante's novels Above Suspicion, The Red Dahlia, Deadly Intent and Silent Scream. It stars Kelly Reilly and Ciarán Hinds, and features the career of La Plante's latest heroine DC Anna Travis.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '9 x 5.5 x 0.53 inches; 4 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'August 28, 2001', 'Actors': 'Bakula, Sciorra, Gentile, Asner, B', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Polygram USA Video', 'Number of discs': '1'}\nInteresting storyline.  Writing is not the best.  Scott Bakula's acting can make much more out of mediocre material. I did enjoy the movie.\nScott Bakula\nNow Voyager\nBarry Gibb  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['Barry Gibb ,Now Voyager, DVD 2005, Collectors item,Deleted edition ,Hard to find.']\n{'Genre': 'Music Videos & Concerts', 'Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Contributor': 'Barry Gibb', 'Language': 'English (PCM Stereo), English (DTS 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.51 x 0.39 x 7.87 inches; 3.88 Ounces', 'Media Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Run time': '1 hour and 45 minutes', 'Actors': 'Barry Gibb', 'Subtitles': 'English', 'Studio': 'universal', 'Number of discs': '1'}\nBarry Gibb, can that be bad?  Several well written and well performed songs.  Barry without a beard (which he hates).\nMusic Video\nMen of a Certain Age: Season 2\nRay Romano  (Actor),     Scott Bakula  (Actor),     David Boyd  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Product Description', 'Men of a Certain Age: The Complete Second Season', 'MEN OF A CERTAIN AGE returns for a second season, with all three men facing a number of roadblocks on their continuing journeys through midlife. They know they can always rely on their friends to see them through. Joe (Romano) is a divorced, slightly neurotic father of two who runs a party store and recently overcame a gambling problem. He’s now decided to rekindle his dream of becoming a professional golfer, training for a spot on the senior tour. Owen (Braugher) the married one of the group, is finally asserting himself at his family’s car dealership, but is struggling with being the boss. Terry (Bakula) the relaxed, handsome actor continues to search for stability after disastrous attempts at managing an apartment complex and reviving his acting career.', ']]>', 'Amazon.com', \"It's an overused term, but few words seem more apt than\", 'bittersweet', 'to describe the second and final season of the critically acclaimed comedy/drama', 'Men of a Certain Age', ': bitter in that the show was brought to a close far too soon for fans and many critics, but also sweet in that the series, created by Ray Romano and Mike Royce, ended on the same notes of honesty, poignancy, and sheer creative quality that marked its beginning. The sophomore season of', 'Certain Age', 'also found the show escaping from the short-sightedness that painted it as a series about \"guys in midlife crisis\" to become a program about the second chances and minor miracles that were also part of the lives of its trio of protagonists: party-store owner Joe (Romano) shakes off the torpor of his divorce to finally pursue his dream of professional golf, while married man Owen (Andre Braugher) takes hold of his long-delayed destiny as owner of his father\\'s car dealership. And while the transition of Terry (Scott Bakula) from lothario and would-be actor to a man committed to romance and a realistic future takes the occasional back seat to his friends\\' storylines, his struggles never lack for intimacy while also showcasing some of the show\\'s most cringe-worthy moments as he attempts to shake off a lifetime of half-steps and fruitless relationships. In each of their stories, as well as in those of the people who orbit their lives, from Joe\\'s children (Braeden Lemasters and Brittany Curran) to Owen\\'s wife (Lisa Gay Hamilton) and coworkers and Terry\\'s supremely patient girlfriend (Melinda McGraw), there is not a false note in regard to the operation of the human heart as how it truly works and not as depicted in network notes or audience demographic research. The writing in the second season (by several veterans of', 'Everybody Loves Raymond', \", among others) achieves a sort of literary level in its best moments, a gorgeous opaqueness that reveals such depths of richness and truth behind the veil of ordinary life. That high-water mark is met by the direction as well as the exceptional cast, from Romano, who continues to prove himself a remarkably subtle dramatic actor, and Braugher and Bakula, down to supporting players like Hamilton, McGraw, Richard Gant (as Braugher's prideful father), Alanna Ubach, Sarah Clarke (the\", 'Twilight', 'series), Matt Price, and Brian White. However, the season is again stolen by Jon Manfrellotti (', 'Mad Men', \") as Joe's bookie, Manfro, whose cancer diagnosis peels away his Runyonesque exterior to reveal a vinegary sagacity in his uncomfortable dealings with Joe.\", 'The three-disc presentation of', 'Men of a Certain Age', \"'s second season is anchored by commentaries by the show's key players on all 12 episodes. Romano and Royce are the dominant voices, and the humor that they and fellow writers Bridget Bedard, Lew Schneider, and Tucker Cawley provide also allows for glimpses into the show's production as well as what might have happened in its third season. Romano, Royce, Bedard, and Schneider additionally appear on a solid featurette that discusses the tone and direction of the series in fine detail. There is also a brace of deleted scenes from both seasons, as well as a frequently funny gag reel, all of which should appeal to the show's small but dedicated cadre of fans. But more significantly, what those viewers can take away from this final season is not just the excellence of the episodes, but also the fact that\", 'Men of a Certain Age', 'belongs in the ranks of such extraordinary works as', 'Freaks and Geeks', ',', 'Deadwood', ',', 'Sports Night', ',', 'Arrested Development', ',', 'Veronica Mars', ', and other series that slipped the surly bonds of the medium and truly defined the phrase', 'too good for television', '.', '--Paul Gaita']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '883929174317', 'Director': 'David Boyd', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 48 minutes', 'Release date': 'January 15, 2013', 'Actors': 'Ray Romano, Scott Bakula, Andre Braugher, Lisa Gay Hamilton, Matt Price', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'TNT', 'Number of discs': '3'}\nWhat else can be said?  We don't need or want another CSI. Do we have to know how people in Jersey or the Kardasian's behave.  I do enjoy the occasional reality show but Bachelor Pad, really?  A Dallas remake? It seemed that there were no more ideas for good shows. Then Mike Royce and Ray Romano write this incredible show. A fresh idea, excellent writing, wonderful acting, Peabody award winner. What were we thinking to enjoy such a show.  Thank you Mike Royce, Ray Romano, Scott Bakula and Andre Braugher for offering a glimpse into the lives of these guys. It is so sad that we will only have two seasons of this fabulous show.\nExcellent writing, excellent acting. Critically acclaimed\nScarecrow & Mrs. King: Season 4\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Scarecrow and Mrs. King: The Complete Fourth Season', 'A single mother in suburban Washington D.C. discovers she has a talent for espionage work when she meets a dashing undercover agent--but balancing her duties as a spy with her responsibility as a parent proves constantly entertaining in this romantic-adventure series.', ']]>', 'Amazon.com', 'By their final season, Amanda King (Kate Jackson), a mother of two, and Lee \"Scarecrow\" Stetson (Bruce Boxleitner), a former ladies\\' man, had become Agency colleagues, but they continue to keep their relationship under wraps--otherwise, they wouldn\\'t be able to catch the bad guys. And with the Cold War in full effect, there are plenty of Eastern bloc operatives with dodgy accents to keep them busy. The year begins with a two-parter in which Stetson pretends to fall for a Soviet spy, but when the plan backfires, Amanda has to prove that he hasn\\'t been \"playing footsie with the Russians,\" as their boss, Billy (Mel Stewart), puts it. Once they put that business behind them, Lee proposes, and the two make (secret) plans for the future. After awhile, though, Amanda\\'s mother, Dotty (Beverly Garland, delightful as ever), and others start to catch on.', 'In the meantime, Lee receives damning information about his late parents, who also worked in intelligence, and sets out to clear their names (Jackson directed this episode, which features film noir-like flashbacks starring Wendie Malick). Other cases involve terrorists, kidnappers, art thieves, shady toy manufacturers, and Dotty\\'s gambling-addicted boyfriend (though the actors who play Amanda\\'s sons still appear in the credits, they garner minimal screen time). In the process, evildoers poison Lee, shoot Amanda, and manipulate Billy\\'s memories in scenarios involving familiar faces like Dennis Haysbert and Blair Underwood. If Francine (Martha Smith) assists with most operations, Dr. Smyth (Myron Natwick) hinders more than he helps--Lee describes his high-blown speech as \"verbal fruit salad.\" Due to Jackson\\'s health problems, which contributed to the show\\'s demise, Smith fills in for the final three episodes. In retrospect,', 'Scarecrow and Mrs. King', 'was a sweet, sincere series that shares much of the same romantic appeal as', 'Remington Steele', '.', '--Kathleen C. Fennessy']\n{'Genre': 'Mystery & Suspense, Action & Adventure', 'Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Contributor': 'George Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg MortonGeorge Geiger, Sascha Schneider, Sam Melville, Martha Smith, Mel Stewart, Kate Jackson, Bruce Boxleitner, Beverly Garland, Tom Chehak, Robert W. Gilmer, Paul Stout, Greg Morton  See more', 'Language': 'English', 'Number Of Discs': '5', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '26411291', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Subtitled', 'Run time': '16 hours and 8 minutes', 'Release date': 'January 22, 2013', 'Actors': 'Kate Jackson, Bruce Boxleitner, Beverly Garland, Mel Stewart, Martha Smith', 'Subtitles': 'English', 'Producers': 'Tom Chehak, George Geiger, Robert W. Gilmer, Sascha Schneider', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nThis video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas.\nFun show\nScarecrow and Mrs. King: Season 3\nKate Jackson  (Actor),     Bruce Boxleitner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n{'Genre': 'Mystery & Suspense/Thrillers, Action & Adventure', 'Format': 'Color, Multiple Formats, NTSC, Box set', 'Contributor': 'Kate Jackson, Bruce Boxleitner', 'Language': 'English', 'Number Of Discs': '5'}\nThis video has not been remastered. Still good quality though. I enjoyed the show when it aired and it is fun to revisit. Technology has advanced and obviously dated the show. However, it is pleasant to watch a good show without today's added (and unnecessary) profanity, sex, political and social agendas. My review is the same for all seasons.\nPleasant show, nice to revisit.\nQUANTUM LEAP THE CS DVD FF\nScott Bakula  (Actor),     Dean Stockwell  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Drama\n['Get ready for an adventure of many lifetimes with the ground-breaking sci-fi classic, Quantum Leap. With the complete series box set, you can now leap through all 95 thrilling episodes over 5 seasons of this Primetime Emmy Award-winning series back-to-back and uninterrupted! Join Dr. Sam Beckett (Scott Bakula), a time traveler lost in time, who temporarily leaps into the bodies and lives of other people to \"put right what once went wrong.\" Accompanied by Al (Dean Stockwell), a wise-cracking holograph that only Sam can see and hear, Sam twists the hands of fate with each heart-pounding, action-packed adventure in the hopes that he can someday complete the mission that will take him home.Bonus Content:', 'Quantum Leap: Season One:', 'A Kiss with History', 'A Kiss with History', 'Quantum Knowledge', 'Quantum Knowledge', 'Quantum Leap: Season Four:', 'Season 5 Episode: Liberation', 'Season 5 Episode: Liberation', \"The Great 80's TV Flashback\", \"The Great 80's TV Flashback\", 'Quantum Leap: Season Five:', 'Blueprints', 'Blueprints']\n{'Genre': 'Science Fiction & Fantasy, Drama, Television, DVD Movie, Blu-ray Movie, Action & Adventure', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Scott Bakula, Dean Stockwell', 'Language': 'English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Runtime': '76 hours and 38 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 1.95 Pounds', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '76 hours and 38 minutes', 'Release date': 'November 4, 2014', 'Actors': 'Scott Bakula, Dean Stockwell', 'Subtitles': 'French, Spanish', 'Studio': 'Universal Pictures Home Entertainment', 'Number of discs': '27'}\nAll Universal Studios Home Entertainment is doing is re-packaging the original disks with grainy footage, techno-music, and probably the same double sided disks that separate and are ruined. These are a complete waste of time and money except for those who are replacing their already defective discs.<br />Quantum Leap Fans: Protest!!! Let Universal know that we want the original music, cleaned up footage and blu ray. Obviously their goal based on response below is NOT to provide the highest standard in product quality or customer care.<br /><br />Give us what we have asked for Universal.  We are willing to pay more for the corrected series.<br /><br />I contacted Universal Studios Home Entertainment. Their response:<br /><br />Thank you for contacting us. Please note that the release you are referring to has the same content as the previous release in a downsized package.<br />Our goal is to provide the highest standard in product quality and customer care, and we value input from our customers.<br />Your comments regarding Quantum Leap music will be forwarded to the appropriate department.<br />We hope you will enjoy future Universal releases.<br /><br />Sincerely,<br /><br />Consumer Relations<br />UNIVERSAL STUDIOS HOME ENTERTAINMENT\nAn amazing, excellent and still relevant show destroyed by Universal",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user continues to show a strong affinity for documentaries and biographical films about iconic musicians. They enjoy classic TV series that blend mystery and romance, with a reinforced focus on content that delivers entertaining narratives alongside a nostalgic charm.\n\n- **Notable Preferences:** Their admiration for nuanced character portrayals remains evident, particularly favoring performances from actors like Scott Bakula and Ray Romano. They prefer series with significant cultural resonance, emphasizing authentic narratives that avoid unnecessary modern distractions.\n\n- **Ratings and Feedback Patterns:** The user maintains a high standard for storytelling depth and emotional engagement, recently displaying frustration with re-packaged media that fails to enhance quality or provide original content. This highlights their desire for sincere storytelling that respects the narrative integrity of classic shows.\n\n- **Themes and Elements Valued:** They appreciate character evolution and narratives examining midlife challenges and personal growth. Their insights emphasize a commitment to genuine human experiences rather than superficial representations commonly found in modern media.\n\nThe user's interactions reaffirm their continued appreciation for character-driven narratives and exceptional acting while revealing a growing discontent with current media re-releases that do not meet their high standards for authenticity and quality. Their focus on emotional sincerity and cultural richness remains a cornerstone of their media preferences.",
  "metrics": {
    "rouge1_f": 0.06331931733860993,
    "rouge2_f": 0.00791883197228409,
    "rougeL_f": 0.031659658669304966,
    "meteor": 0.0161951425469674,
    "bleu1": 1.2549540695925652e-09,
    "bleu2": 4.962319312636061e-10,
    "bleu3": 1.7220195183932267e-10,
    "bleu4": 4.8016519911245104e-11,
    "bertscore_precision": 0.3444947600364685,
    "bertscore_recall": 0.5203502178192139,
    "bertscore_f1": 0.414543479681015
  }
}