{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Now Voyager\nReview Date: 2011/08/05\nStore: Barry Gibb  (Actor)    Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Music Videos & Concerts\nProduct Description: ['Barry Gibb ,Now Voyager, DVD 2005, Collectors item,Deleted edition ,Hard to find.']\nAverage Rating: 4.4\nProduct Details: {'Genre': 'Music Videos & Concerts', 'Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Contributor': 'Barry Gibb', 'Language': 'English (PCM Stereo), English (DTS 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.51 x 0.39 x 7.87 inches; 3.88 Ounces', 'Media Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Run time': '1 hour and 45 minutes', 'Actors': 'Barry Gibb', 'Subtitles': 'English', 'Studio': 'universal', 'Number of discs': '1'}\nReview Text: Barry Gibb, can that be bad?  Several well written and well performed songs.  Barry without a beard (which he hates).\nReview Title: Music Video\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Remington Steele: Season 1\nStephanie Zimbalist  (Actor),     Pierce Brosnan  (Actor),     Burt Brinckerhoff  (Director),     Don Weis  (Director)    &                   1                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product Description', 'Before he was Bond... he was Remington Steele...Private eye Laura Holt (Stephanie Zimbalist) grudgingly accepts a new partner when a mystery man (Pierce Brosnan) assumes the identity of her fictitious boss, Remington Steele. Together, the two battle crime as as their feelings for each other.', 'Amazon.com', 'Remington Steele', \"'s fusion of whodunit mystery and screwball comedy burst onto television in 1982. After struggling to get clients to hire a female detective, Laura Holt (sultry Stephanie Zimbalist) invents a fictional boss named Remington Steele, whose dashing manly name draws in work. But while protecting some South African jewels, Holt runs across a mysterious thief and con-man (an elfin, baby-faced Pierce Brosnan) whom her client assumes is the nonexistent Steele--and when the case is resolved, the accidental detective decides he likes the work and sticks around, infuriating Holt with his arrogant ways and tantalizing her with his dashing good looks. Murders may occur at a winery, an island sex club, or a college reunion, but just about every episode plunders plot elements from classic movies like\", 'Bringing Up Baby', ',', 'The Third Man', ', and', 'The Trouble with Harry', \"(even the theme song was written by film composer Henry Mancini). The writers openly acknowledge this influence by having Steele use ideas he's lifted from movies to solve crimes. The constant allusions to old films should be annoying, but the show demonstrates such a rich affection for the classics that these tips of the hat actually mesh with\", 'Remington Steele', \"'s world.\", 'Remington Steele', \"has become best known as Brosnan's launching pad (he later become James Bond in\", 'GoldenEye', \"and its sequels), but Zimbalist was every bit as crucial to the show's success; her mixture of glamor and toughness gives the show a distinctly adult sexiness and grounds Brosnan's boyish charm. The dialogue sometimes slipped from arch camp to sheer cheese, but even at its most ridiculous (say, a scene where Holt and Steele question homeless bums while dressed in formal evening wear)\", 'Remington Steele', \"remains an eminently watchable show, thanks to zippy plotting and the chemistry between Zimbalist and Brosnan. Some episodes clearly implied that the pair had become intimate, yet that didn't defuse their attraction. Even when the stories became a bit silly, the mutual respect and desire between Holt and Steele never lost its sophistication.\", '--Bret Fetzer']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 6.4 Ounces', 'Director': 'Burt Brinckerhoff, Don Weis, Jeff Bleckner, Larry Elikann, Leo Penn', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Full Screen', 'Run time': '17 hours and 58 minutes', 'Release date': 'July 26, 2005', 'Actors': 'Stephanie Zimbalist, Pierce Brosnan, James Read, Janet DeMay, Carlene Watkins', 'Dubbed': 'English', 'Subtitles': 'English, Spanish', 'Language': 'Unqualified, English (Dolby Digital 1.0)', 'Studio': '20th Century Fox', 'Number of discs': '4'}\nWHAT IS WITH THE COVER??  Shouldn't this be a black background with lip print, gun and such. (As in the beginning of later episodes)  Stephanie Zimbalist was excellent in this series.  Why is she ignored?  Worse yet, what is with the \"Bond\" reference. If \"she\" didn't have a deep dark secret would Brosnan be necessary?????<br /><br />Hey, don't get me wrong. I watched it for ...his blue eyes and mysterious past....\nAnother deep dark secret.........\nWorking Girl\nMelanie Griffith  (Actor),     Harrison Ford  (Actor),     Mike Nichols  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"Nominated for 6 Academy Awards; director Mike Nichols' witty, romantic look at life in the corporate jungle stars Melanie Griffith as Tess McGill, an ambitious secretary with a unique approach for climbing the ladder to success. When her classy, but villainous boss (Sigourneey Weaver) Breaks a leg skiing, Tess simply takes over her office, her apartment, even her wardrobe. She then creates a deal with a handsome investment banker (Harrison Ford) that will either take her straight to the top - or finish her off for good.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.53 inches; 2.08 Ounces', 'Director': 'Mike Nichols', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 53 minutes', 'Release date': 'April 17, 2001', 'Actors': 'Melanie Griffith, Harrison Ford, Sigourney Weaver, Alec Baldwin, Joan Cusack', 'Subtitles': 'English, Spanish', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Surround), English (Dolby Digital 3.0)', 'Studio': '20th Century Fox', 'Writers': 'Kevin Wade', 'Number of discs': '1'}\nFor a general review of this fun movie please read other excellent reviews.  I would love to own the DVD.  But where can I purchase a cut version?  I prefer NOT to watch Alec Baldwin \"bopping\" Doreen. Or Kevin Spacey attempting \"seduction??\" by showing a porn film to Griffith.  Nor listen to Griffith remind herself not to F--- Up repeatedly.  Classy lady with foul mouth moves up the corporate ladder.  Nichols attempt to seek a R rating is just plain stupid.  This otherwise wonderful film is ruined by this mess.  To enjoy Working Girl at its best I will watch the TV version.\nGratuitous nudity, foul language & vulgarities\nBee Gees: In Our Own Time [Blu-ray]\nBee Gees  (Actor),     n/a  (Director)    Rated:    Unrated    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n[\"Blu-ray pressing. In Our Own Time is the compelling story of the Bee Gees career. From their roots in the North West of England, through their early career in Australia, their return to England and international breakthrough in the late '60s and then on to global superstardom with Saturday Night Fever and beyond. Alongside the success there is the heartache of the tragically early deaths of first their younger brother Andy and then later Maurice. The story is told in their own words through in depth new interviews with Barry and Robin Gibb and through extensive interviews with Maurice filmed shortly before his death in January 2003. These are lavishly illustrated by live performances, TV and film clips and home movies of their early days.\"]\n{'Genre': 'Pop, Music Video & Concerts', 'Format': 'Dolby', 'Contributor': 'n/a, Bee Gees', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '1333729', 'Media Format': 'Dolby', 'Run time': '1 hour and 56 minutes', 'Release date': 'November 16, 2010', 'Actors': 'Bee Gees', 'Studio': 'Eagle Rock Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have always enjoyed the Bee Gees songs, but had not followed their career very closely.  I caught the end of this program on A&E's Biography.  I set the DVR for a repeat of this two hour show.  Watched it and immediately purchased the DVD.  I knew these guys were talented, but the detailed account of their rise to stardom, the damage done by disco, which they DID NOT invent.  And where they have gone from there is just amazing.<br /><br />The bit where they demonstrate their three part harmony, singing Lollipop acapella, caused my 22 year old daughter to exclaim, \"That it crazy good!\"  She is so right.<br /><br />I would recommend this to anyone who has enjoyed the Bee Gees.  I am sure the diehard fans already have their copies.[[ASIN:B0043E8YAM Bee Gees: In Our Own Time [Blu-ray]]]\nExcellent\nAbove Suspicion\nRated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Above Suspicion is a British TV series based on Lynda La Plante's novels Above Suspicion, The Red Dahlia, Deadly Intent and Silent Scream. It stars Kelly Reilly and Ciarán Hinds, and features the career of La Plante's latest heroine DC Anna Travis.\"]\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '9 x 5.5 x 0.53 inches; 4 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'August 28, 2001', 'Actors': 'Bakula, Sciorra, Gentile, Asner, B', 'Language': 'English (Dolby Digital 2.0 Stereo)', 'Studio': 'Polygram USA Video', 'Number of discs': '1'}\nInteresting storyline.  Writing is not the best.  Scott Bakula's acting can make much more out of mediocre material. I did enjoy the movie.\nScott Bakula\nNow Voyager\nBarry Gibb  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Music Videos & Concerts\n['Barry Gibb ,Now Voyager, DVD 2005, Collectors item,Deleted edition ,Hard to find.']\n{'Genre': 'Music Videos & Concerts', 'Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Contributor': 'Barry Gibb', 'Language': 'English (PCM Stereo), English (DTS 5.1)', 'Runtime': '1 hour and 45 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.51 x 0.39 x 7.87 inches; 3.88 Ounces', 'Media Format': \"Color, Full Screen, Director's Cut, DTS Surround Sound, Dolby\", 'Run time': '1 hour and 45 minutes', 'Actors': 'Barry Gibb', 'Subtitles': 'English', 'Studio': 'universal', 'Number of discs': '1'}\nBarry Gibb, can that be bad?  Several well written and well performed songs.  Barry without a beard (which he hates).\nMusic Video",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests:** The user maintains a strong interest in a variety of genres, particularly documentaries and biographical films about iconic music artists. This aligns with their established preference for classic TV series and films that blend elements of mystery and romance.\n\n- **Notable Preferences:** Recent interactions indicate a fondness for strong character portrayals, emphasizing performances by actors like Scott Bakula, along with a continued appreciation for musicians and actors, notably Barry Gibb. \n\n- **Ratings and Feedback Patterns:** The user exhibits a high standard for emotional resonance and storytelling integrity. Their latest review highlights an appreciation for well-crafted musical performances, showcasing their nuanced ability to evaluate artistic merit even in less conventional formats.\n\n- **Themes and Elements Valued:** The user remains captivated by narratives that delve into cultural themes while demonstrating character evolution. Their sensitivity to storytelling is evident in their enjoyment of performances that elevate the material, reinforcing their interest in the interplay between personal challenges and cultural legacies.\n\nOverall, the user’s evolving interests illustrate a commitment to character-driven narratives, strong performances, and insightful explorations of cultural phenomena, with an emphasis on emotional depth and authenticity in diverse storytelling avenues.",
  "metrics": {
    "rouge1_f": 0.10798650168728909,
    "rouge2_f": 0.00900900900900901,
    "rougeL_f": 0.0562429696287964,
    "meteor": 0.03242036068551367,
    "bleu1": 0.00010074125360155976,
    "bleu2": 3.3152331734516834e-05,
    "bleu3": 4.783674611134791e-06,
    "bleu4": 1.8190493962788042e-06,
    "bertscore_precision": 0.33691632747650146,
    "bertscore_recall": 0.47913891077041626,
    "bertscore_f1": 0.3956342935562134
  }
}