{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 21°C 4 Pieces Detangling Brush and Hair Comb Set Knots Detangler Easy to Clean for Kinky Wavy Curly Coily Wet Dry Oil Thick Long Natural Hair(Pink)\nReview Date: 2020/06/20\nStore: 21°C\nAverage Rating: 4.4\nProduct Details: {'Brand': '21°C', 'Special Feature': 'Detangling', 'Product Benefits': 'Detangle', 'Unit Count': '8.3 Ounce', 'Hair Type': 'All, Coarse, Wavy, Dry, Curly, Thick', 'Package Dimensions': '10.3 x 3.4 x 1.7 inches; 8.5 Ounces'}\nReview Text: This 4 piece hair set is great! My wife has wavy hair, as well as my daughter, and myself. My son has long, curly, coarse hair. This set works on all of our hair types! The largest hollowed our brush is great for blow drying. The smaller comb/brush is designed to remove tangles from curly hair, and it works well when using with detangling spray. There is a small attachment included, which hooks onto the back of the brush to keep the bristles together. You also get a wide tooth comb and a parting comb. Everything included in the set is lightweight and easy to hold. It’s a great set at an amazing price!\nReview Title: The perfect set for your hair!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Eye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nMourvibe\n{'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nThese are so nice and easy to apply. You instantly feel the moisture in your skin from the moment you put them on. After taking them off you notice that it really helps with the bags! My wife has used a few times and has already noticed a difference! They are even more refreshing when cold! Just keep them in your fridge!\nFeels so refreshing!\nEmbryolisse Eau de Beaute Rosamelis Face Toner, 6.76 Fl Oz\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.85 x 2.76 x 7.44 inches; 8.11 Ounces', 'Item model number': '501000', 'Manufacturer': 'Embryolisse'}\nMy wife loves this stuff! She has been using for a few days and loves the scent! Smells a mix of rose and orange.. beautiful and very uplifting. It makes her skin feel hydrated and more firm. Very nice product!\nBeautifully scented and sprays on like a mist!\n13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nL&I Apothecary\n{'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\nMy wife is very happy with this facial cleanser. It’s very moisturizing and makes her skin feel baby soft after using. It barely has a scent to it and it works great on her sensitive skin.\nMakes your skin feel baby soft!\nWow the Crowd Eyelash Growth Serum for Full, Luscious, Long and Thick Lashes - Natural Formula (7mL), Clinically and Dermatologist Tested - Boost and Enhance Eyelashes and Brows\nK Kerotin\n{'Package Dimensions': '4.6 x 1.3 x 1.3 inches; 4.8 Ounces', 'UPC': '632726043414'}\nMy wife has been using this product for about a week and likes it. It’s very easy to apply, just like clear liquid eyeliner. It’s good that it does not irritate my wife’s sensitive skin at all. She has tried on her lashes and has noticed a slight difference in the thickness of them. I am sure that time will bring more dramatic results. The product is a bit pricey for the amount you get though.\nEasy to apply, does not irritate.\n2-Pack Puretize 16.9 Oz Hand Sanitizing Gel w/Pump Tops - Extra Strength 70% Ethyl Alcohol - Moisturizing Formula with Aloe Vera, Vitamin E & Botanical Extracts - Quick Drying Formula\nPure Daily Care\n{'Brand': 'Pure Daily Care', 'Unit Count': '33.8 Fl Oz', 'Number of Items': '2', 'Special Feature': 'Moisturizing', 'Scent': 'Unscented', 'Package Dimensions': '7 x 6.5 x 4.5 inches; 1.06 Pounds', 'UPC': '810016711360'}\nThis hand sanitizer by Puretize is great. During the time of the pandemic, this is a must! It contains 70% alcohol, which is great to kill those nasty germs 🦠! It smells similar to rubbing alcohol, however it’s not too strong. I love this hand sanitizer as it doesn’t dry out my hands like others. Every family needs a bottle of this in their home!\nSanitizes without drying out hands!\n21°C 4 Pieces Detangling Brush and Hair Comb Set Knots Detangler Easy to Clean for Kinky Wavy Curly Coily Wet Dry Oil Thick Long Natural Hair(Pink)\n21°C\n{'Brand': '21°C', 'Special Feature': 'Detangling', 'Product Benefits': 'Detangle', 'Unit Count': '8.3 Ounce', 'Hair Type': 'All, Coarse, Wavy, Dry, Curly, Thick', 'Package Dimensions': '10.3 x 3.4 x 1.7 inches; 8.5 Ounces'}\nThis 4 piece hair set is great! My wife has wavy hair, as well as my daughter, and myself. My son has long, curly, coarse hair. This set works on all of our hair types! The largest hollowed our brush is great for blow drying. The smaller comb/brush is designed to remove tangles from curly hair, and it works well when using with detangling spray. There is a small attachment included, which hooks onto the back of the brush to keep the bristles together. You also get a wide tooth comb and a parting comb. Everything included in the set is lightweight and easy to hold. It’s a great set at an amazing price!\nThe perfect set for your hair!",
  "profile": "**User Summary:**\n\nThe user maintains a strong preference for skin care products, focusing on effective solutions like under-eye treatments for puffiness and dark circles. They prioritize practicality and ease of use, favoring items that deliver instant hydration and refreshing sensations. The user appreciates products that enhance sensory experiences, often highlighting the benefits of cooling items like masks. \n\nRecently, they demonstrated a family-centric approach by sharing positive feedback about a gentle face cleanser their wife enjoys, emphasizing its moisturizing qualities and suitability for sensitive skin. They also value beautifully scented products but are flexible in exploring options that resonate with loved ones, regardless of scent. \n\nIn their latest interaction, the user showcased their commitment to family needs by purchasing a detangling hair brush set suitable for various hair types within their household, underlining their focus on practical solutions for effective grooming. This aligns with their dedication to ensuring the use of functional products that enhance health and well-being for themselves and their family. \n\nOverall, the user seeks skin care options that blend immediate benefits with sensory pleasure while showing an evolving awareness of natural and cruelty-free ingredients. Their approach underscores the importance of practical, effective routines while remaining dedicated to both personal care and the well-being of their loved ones.",
  "metrics": {
    "rouge1_f": 0.2147239263803681,
    "rouge2_f": 0.024590163934426226,
    "rougeL_f": 0.10224948875255624,
    "meteor": 0.0745145481136283,
    "bleu1": 0.016844866345425327,
    "bleu2": 0.004606664995005873,
    "bleu3": 0.0015653770877439035,
    "bleu4": 0.0005136959950401557,
    "bertscore_precision": 0.3614158034324646,
    "bertscore_recall": 0.4858971834182739,
    "bertscore_f1": 0.4145125150680542
  }
}