{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Spanature Green Tea Hand & Body Lotion Travel Size Selection, 4 Pack, Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nReview Date: 2021/05/15\nStore: Spanature\nAverage Rating: 4.5\nProduct Details: {'Brand': 'Spanature', 'Item Form': 'Lotion', 'Active Ingredients': 'Green tea', 'Unit Count': '1.00 Count', 'Number of Items': '4', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 2.1 x 1.9 inches; 8.8 Ounces'}\nReview Text: This 4 pack of travel lotions by Spanature is super nice, from the presentation of the product, to the performance of the product. They come packaged soooo nicely in 4 little gift boxes, so they are perfect for gift giving. Also, the tubes are the perfect size to fit in your purse- so they are great for on the go or even traveling!<br /><br />The lotion itself is very moisturizing, and not greasy at all. The green tea scent is not strong at all, which is perfect if you are sensitive to strong scents.\nReview Title: Very moisturizing, but not greasy!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Eye Mask for Puffy Eyes,Under Eye Patches,Dark Circles Under Eye Treatment,Eye Masks& Puffy Eyes Treatment, Eye Mask for Dark Circles（60 PCS)\nMourvibe\n{'Package Dimensions': '3 x 3 x 1.5 inches; 6.07 Ounces', 'UPC': '778365190505'}\nThese are so nice and easy to apply. You instantly feel the moisture in your skin from the moment you put them on. After taking them off you notice that it really helps with the bags! My wife has used a few times and has already noticed a difference! They are even more refreshing when cold! Just keep them in your fridge!\nFeels so refreshing!\nEmbryolisse Eau de Beaute Rosamelis Face Toner, 6.76 Fl Oz\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.85 x 2.76 x 7.44 inches; 8.11 Ounces', 'Item model number': '501000', 'Manufacturer': 'Embryolisse'}\nMy wife loves this stuff! She has been using for a few days and loves the scent! Smells a mix of rose and orange.. beautiful and very uplifting. It makes her skin feel hydrated and more firm. Very nice product!\nBeautifully scented and sprays on like a mist!\n13.5 fl. Oz. Goat Milk Facial Cleanser, Moisturizing Face Wash for Women, Hydrating Natural Face Wash, Anti-aging Face Wash, Face Wash for Aging Ski\nL&I Apothecary\n{'Item Form': 'Foam', 'Skin Type': 'All', 'Brand': 'L&I Apothecary', 'Scent': 'Aloe Vera', 'Material Feature': 'Natural, Cruelty Free', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.06 x 4.25 x 4.13 inches; 1.38 Pounds', 'Item model number': 'LI-BB', 'UPC': '781490943212', 'Manufacturer': 'The Henna Guys, Inc.'}\nMy wife is very happy with this facial cleanser. It’s very moisturizing and makes her skin feel baby soft after using. It barely has a scent to it and it works great on her sensitive skin.\nMakes your skin feel baby soft!\nWow the Crowd Eyelash Growth Serum for Full, Luscious, Long and Thick Lashes - Natural Formula (7mL), Clinically and Dermatologist Tested - Boost and Enhance Eyelashes and Brows\nK Kerotin\n{'Package Dimensions': '4.6 x 1.3 x 1.3 inches; 4.8 Ounces', 'UPC': '632726043414'}\nMy wife has been using this product for about a week and likes it. It’s very easy to apply, just like clear liquid eyeliner. It’s good that it does not irritate my wife’s sensitive skin at all. She has tried on her lashes and has noticed a slight difference in the thickness of them. I am sure that time will bring more dramatic results. The product is a bit pricey for the amount you get though.\nEasy to apply, does not irritate.\n2-Pack Puretize 16.9 Oz Hand Sanitizing Gel w/Pump Tops - Extra Strength 70% Ethyl Alcohol - Moisturizing Formula with Aloe Vera, Vitamin E & Botanical Extracts - Quick Drying Formula\nPure Daily Care\n{'Brand': 'Pure Daily Care', 'Unit Count': '33.8 Fl Oz', 'Number of Items': '2', 'Special Feature': 'Moisturizing', 'Scent': 'Unscented', 'Package Dimensions': '7 x 6.5 x 4.5 inches; 1.06 Pounds', 'UPC': '810016711360'}\nThis hand sanitizer by Puretize is great. During the time of the pandemic, this is a must! It contains 70% alcohol, which is great to kill those nasty germs 🦠! It smells similar to rubbing alcohol, however it’s not too strong. I love this hand sanitizer as it doesn’t dry out my hands like others. Every family needs a bottle of this in their home!\nSanitizes without drying out hands!\n21°C 4 Pieces Detangling Brush and Hair Comb Set Knots Detangler Easy to Clean for Kinky Wavy Curly Coily Wet Dry Oil Thick Long Natural Hair(Pink)\n21°C\n{'Brand': '21°C', 'Special Feature': 'Detangling', 'Product Benefits': 'Detangle', 'Unit Count': '8.3 Ounce', 'Hair Type': 'All, Coarse, Wavy, Dry, Curly, Thick', 'Package Dimensions': '10.3 x 3.4 x 1.7 inches; 8.5 Ounces'}\nThis 4 piece hair set is great! My wife has wavy hair, as well as my daughter, and myself. My son has long, curly, coarse hair. This set works on all of our hair types! The largest hollowed our brush is great for blow drying. The smaller comb/brush is designed to remove tangles from curly hair, and it works well when using with detangling spray. There is a small attachment included, which hooks onto the back of the brush to keep the bristles together. You also get a wide tooth comb and a parting comb. Everything included in the set is lightweight and easy to hold. It’s a great set at an amazing price!\nThe perfect set for your hair!\nShakira Perfumes - Dance for Women - Long Lasting - Femenine, Charming and Modern Perfume - Fruity Floral Notes - Ideal for Day Wear - 1.7 Fl Oz\nShakira\n{'Brand': 'Shakira', 'Item Form': 'Liquid', 'Item Volume': '50 Milliliters', 'Scent': 'Dance', 'Special Feature': 'Long Lasting', 'Is Discontinued By Manufacturer': 'No', 'Language': 'English', 'Product Dimensions': '2.64 x 2.05 x 5.63 inches; 1.76 Ounces', 'Item model number': '8411061823033'}\nMy wife really likes this perfume by Shakira! It has a nice sweet scent, with a hint of spice. It’s an incredibly sexy scent that I love too! ❤️ It doesn’t last the whole day, however if you reapply in the afternoon, it does. The bottle is beautiful too! Just looks weird with my wife grabbing Shakira’s bod and spraying. 😂 We got a good laugh out of it!\nSweet with a little bit of spice!\nBath Bombs, SAZEN Bath Bomb with Natural & Organic Essential Oils, Shea Coconut Butter for Skin Moisturize, Bubble Spa Bath, Birthday Mothers Day Christmas Handmade Gift Set for Women Kids Her Him\nSAZEN\n{'Brand': 'SAZEN', 'Scent': 'Coconut', 'Material Feature': 'Organic Ingredients', 'Unit Count': '24.00 Count', 'Number of Items': '24', 'Package Dimensions': '12.17 x 6.26 x 2.24 inches; 2.65 Pounds', 'Item model number': 'SAZEN 01', 'UPC': '745103723622', 'Manufacturer': 'SAZEN'}\nThese bath bombs are great, especially for the price. You get 18 bath bombs in the box. The box looks like a gift box, so these would make a great gift for someone special! ❤️<br /><br />The bath bombs are scented with essential oils and are very moisturizing. Each bath bomb is wrapped in tissue paper and labeled. The packaging is just amazing!<br /><br />The scents are strong, so these may not work for you if you are sensitive to strong scents. I personally think they smell wonderful!\nPackaged so nicely and smell lovely!\n10 Pairs Reusable Magnetic Eyelashes and 2 Tubes of Magnetic Eyeliner Kit, Upgraded 3D 5D Natural Look Magnetic Fake Lashes and Liner Set - No Glue Need\nSTRONGLO\n{'Brand': 'STRONGLO', 'Item Dimensions LxWxH': '8.11 x 5.94 x 0.87 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8.11 x 5.94 x 0.87 inches; 3.21 Ounces'}\nMy wife has always wanted to try magnetic eyelashes, so she decided to give these a shot. They really do work! But, with these practice makes perfect.<br /><br />They come with 2 tubes of magnetic eyeliner (black), and 10 sets of eyelashes along with the application tool. When you apply the magnetic eyeliner, you have to be precise. The eyeliner is black, and will look very dark if you do too thick of a line. I would do thinner lines if possible, with about 2 layers so that the eyeliner is not overwhelming. Once the eyeliner dries, use the application tool to put the lashes on.<br /><br />It does feel a bit strange at first (if false lashes are new to you), and it may tickle around your eyes when you blink. But yes, these really work! With more practice my wife will get better at this.<br /><br />The only thing is that the magnetic eyeliner does not come off easily. You will need a good eye makeup remover to get this off as it’s waterproof!\nPractice makes perfect\n26 Inches Long Hair\nSENSAIRUITE\n{'Brand': 'SENSAIRUITE', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Package Dimensions': '11.18 x 6.97 x 6.38 inches; 1.9 Pounds'}\nThis mannequin head is great for the price. It includes the clamp, and the hair is very thick. The hair is not real human hair, it’s synthetic... so it doesn’t curl very good like real human hair.<br /><br />It is great for trying out new hair styles though, even for practicing hair cutting. It comes with 2 clips and rubber bands as well.\nIt’s great for testing new hairstyles!\nSpanature Green Tea Hand & Body Lotion Travel Size Selection, 4 Pack, Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nSpanature\n{'Brand': 'Spanature', 'Item Form': 'Lotion', 'Active Ingredients': 'Green tea', 'Unit Count': '1.00 Count', 'Number of Items': '4', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 2.1 x 1.9 inches; 8.8 Ounces'}\nThis 4 pack of travel lotions by Spanature is super nice, from the presentation of the product, to the performance of the product. They come packaged soooo nicely in 4 little gift boxes, so they are perfect for gift giving. Also, the tubes are the perfect size to fit in your purse- so they are great for on the go or even traveling!<br /><br />The lotion itself is very moisturizing, and not greasy at all. The green tea scent is not strong at all, which is perfect if you are sensitive to strong scents.\nVery moisturizing, but not greasy!",
  "profile": "The user continues to prioritize skin care solutions that deliver immediate effectiveness, focusing on practical products like under-eye treatments for puffiness and dark circles. Their recent interest in beauty accessories highlights a commitment to enhancing their family's grooming routine, particularly exploring tools for creative hairstyles.\n\nMaintaining a devotion to skin care items that provide hydration and refreshing effects, the user opts for cooling solutions and appreciates beautifully scented products. Their recent purchase of travel-sized lotions showcases a preference for moisturizers that are both effective and convenient, demonstrating a keen interest in products that are perfect for gifting as well as personal use.\n\nFamily well-being remains central to the user’s approach, with a focus on gifts that benefit themselves and their loved ones. They increasingly favor natural and cruelty-free ingredients, reinforcing an ethical perspective in personal care choices. Their sense of humor enriches their interactions surrounding skin care and fragrances, making their beauty routine enjoyable.\n\nOverall, the user seeks versatile skin care and beauty options that balance immediate benefits with sensory pleasure, while actively exploring practical tools that support innovative grooming experiences. This highlights a practical and effective approach to enhancing personal and familial well-being, all while remaining open to new beauty experiences that align with their values of effectiveness and ethical care.",
  "metrics": {
    "rouge1_f": 0.12465526751241036,
    "rouge2_f": 0.0176697956929873,
    "rougeL_f": 0.0628792057363486,
    "meteor": 0.036484698463023504,
    "bleu1": 0.0001538476546649609,
    "bleu2": 5.274159554574445e-05,
    "bleu3": 2.397210808749599e-05,
    "bleu4": 6.9130770346670785e-06,
    "bertscore_precision": 0.3445286154747009,
    "bertscore_recall": 0.489856481552124,
    "bertscore_f1": 0.4045363962650299
  }
}