{
  "interaction_number": 20,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: ZEROID Dermanewal Revitalizing Ampoule Korean Dermocosmetic | Restore Energy to Stressed Out Skin | (30mL\nReview Date: 2021/08/24\nStore: ZEROID\nAverage Rating: 4.7\nProduct Details: {'Use for': 'Whole Body', 'Scent': 'Aloe', 'Brand': 'ZEROID', 'Item Form': 'Oil', 'Material Feature': 'Non-Comedogenic', 'Product Dimensions': '6.25 x 1 x 1 inches; 3.95 Ounces', 'Item model number': '00602'}\nReview Text: I found myself using this product more when I’m on my cycle. I minimize my skin care products around that times. It always works wonderfully afterwards.  According to ZEROID this product Tests have proven that his product is both Hypo-allergenic and Non-Comedogenic. Dualguard-9 and multi-peptide ingredients increase the capacity of the skin to purify itself and to increase radiance. Madecassoside and Beta Glucan work together to leave the skin feeling less taut and more relax. Overall, if your face feels need extra boost, this product is worth trying. I have very sensitive skin when it comes to fragrant, ZEROID contains almost zero fragrant. The products are simply amazing. I am sold!\nReview Title: Gives youthful looking\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "LDR by Baysyx - Restorative Glow Hydro Boost Moisturizer | Nourishing Hydration Cream with Collagen Stimulation | Fortified with Hyaluronic Acid | Made in The USA from Natural Ingredients (1.7 Oz)\nLDR\n{'Brand': 'LDR', 'Item Form': 'Cream', 'Unit Count': '1.00 Count', 'Number of Items': '1', 'Skin Type': 'All', 'Package Dimensions': '6.3 x 1.2 x 1.1 inches; 1.7 Ounces', 'UPC': '725835779579', 'Manufacturer': 'LDR'}\nAccording to this Biomarine Hydro Boost moisturizer bottle, this moisturizer is made with natural ingredients that help stimulate collagen production to fill in fine lines and wrinkles, while helping to keep your face moisturized. As they claimed I’ve been putting this moisturizer day and night time. It’s a bit early to tell if my fine lines and wrinkles are reduced. However, my face was hydrated after use without having any skin issues. My husband is struggling with dry skin lately due to the weather. I recommend him to use this since this product is for men and women. He’s been liking this moisturizer. He said this has decent scents without being too overwhelming. My husband and I both like this moisturizer. I would recommend to people.\nDecent face moisturizer\nEmbryolisse Eau de Beaute Rosamelis Face Toner, 6.76 Fl Oz\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.85 x 2.76 x 7.44 inches; 8.11 Ounces', 'Item model number': '501000', 'Manufacturer': 'Embryolisse'}\nEmbryolisse Eau de Beaute Rosamelis, Face Toner contains Rose, orange blossom, cornflower and hamamelis natural origin flower waters purify and tone the skin after cleansing. I found this Eau de Beaut Rosamlis leaves a very soft and comfortable skin, its texture is tighter, and the complexion is glowing and fresh. I use this toner to refresh skin at any time during the day. This toner is light weigh and very gentle on the skin. I really like this toner!\nGreat daily facial toner\n24K Gold Under Eye Mask - Eye Patches Treatment for Puffy Eyes Pure Collagen Golden Anti-aging Dark Circles Eye Bags Wrinkles Pads Masks Cooling Eye Spa Hydrogel Undereye patch - 20 Pairs (GOLD)\nMOSTORY\n{'Brand': 'MOSTORY', 'Item Form': 'Pads', 'Product Benefits': 'Anti Aging', 'Scent': 'Fresh', 'Special Feature': 'Anti Aging', 'Package Dimensions': '4.8 x 3.86 x 1.65 inches; 7.05 Ounces'}\nI get super puffy very often especially in the mornings. I popped these open before I put on make up. I didn’t see much differences. Except cooling since they were in the refrigerator. The product is made in China as well. If someone is interested in where it’s made.\nOkay\nABOUT ME MediAnswer Collagen Firming Up Mask 4ea (1box) 25g - 77% Pure Collagen Extract Anti-Aging Total Care Facial Mask Sheet, Powerful Hydrating and Anti-Wrinkle Night Skin Care\nSamyang\n{'Brand': 'Samyang', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Fresh', 'Special Feature': 'Not Tested On Animals', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 6.3 x 0.9 inches; 0.88 Ounces'}\nABOUT ME MediAnswer Collagen Firming Up Mask is made with 77% Pure Collagen Extract  The collagen supposed to help Anti-Aging Total Care, Powerful Hydrating and Anti-Wrinkle. I like the mask sheets. The sheets are very interesting without being messy. These masked helped me a lot to calm my skins after getting lots of sun from Florida. I would recommend these masks\nCollagen!\nCancun Collection Cacao Body Bronzer – Superfood Infused Sunless Tanning Lotion with Cacao 5.1 fl.oz, For Instant Tan in 1 minute.\nCancun Collection\n{'Item Form': 'Lotion', 'Skin Type': 'All', 'Brand': 'Cancun Collection', 'Skin Tone': 'All', 'Material Feature': 'Antioxidant', 'Package Dimensions': '5.1 x 4.6 x 1 inches; 14.39 Ounces', 'UPC': '659436986640'}\nThis is my first time using Cancun collection body bronzer. I have to say I love this product! I have odd patch between my neck and chest area. This body bronzer did great job on hiding and  blending into my body without looking crazy. This bronzer did not make me look like an orange either. I like the clean ingredients that this bronzer contains. I would recommend this bronzer. So far I am in love with this!<br /><br />++ I would recommend to apply this bronzer with a bronzer glove if can. That’s the best way to get the best result.\nSuperfood infused!\n[the SAEM] Derma Plan Cleansing Bubble Pad 15pcs - One Step Gentle Makeup Cleansing Wipes Produce Fine & Dense Bubbles, Hypoallergenic Formula, Pore Clean, Mild Exfoliation\nTHESAEM\n{'Brand': 'THESAEM', 'Skin Type': 'Sensitive', 'Unit Count': '15.00 Count', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Package Dimensions': '3.9 x 3.9 x 1.8 inches; 3.21 Ounces'}\nI never used the SEAM’s skin products before. I told myself why not try one?! So I did! The pads are bigger than my goto face cleaning pads which I really like. One pad does a long way around my face even to neckline. This bottle has got plenty of liquid to work on. Also, I didn’t notice any irritation after using this bottle. Overall, I like the scent, it is mild. Also, I like the inexpensive price point. This bottle works for me. I hope my review helps!\nInexpensive, great daily face pads\nEasydew 2-Step Face Contour Sheet Mask - Tightening & Anti-Aging & Hydrating Korean Face Mask with DW-EGF, Hyaluronic Acid for Anti-Winkle, Reducing Fine Line & Producing Collagen (Qty 5)\nEASYDEW\n{'Brand': 'EASYDEW', 'Item Form': 'Sheet', 'Scent': 'Honey', 'Special Feature': 'Not Tested On Animals', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'Yes', 'Package Dimensions': '8.35 x 6.38 x 0.63 inches; 7.44 Ounces', 'Item model number': 'EETS1003', 'Manufacturer': 'CleveAid'}\nMy friend told me about this brand and this face masks. I was so curious to try. I am in my 30’s now. I do happen to use a lot more of anti wrinkle products these days. I like the masks because the ingredients are good for anti wrinkle, I noticed the masks moisturize well after use them. I like the concept and the ingredients as well. I am going to have to purchase more in the future after I run out!\nWorth the hype!\n[Abib] Creme coating mask Tone-up solution 17g (5pcs)\nAbib\n{'Brand': 'Abib', 'Scent': 'Unscented', 'Number of Items': '5', 'Package Dimensions': '8.7 x 6.2 x 0.8 inches; 8.01 Ounces'}\nI’ve used Abib’s cooling masks before. I think like this toning mask sheets more. Because, the mask sheets are thick, lock all the moistures while wearing the mask sheets, leave soft and smooth skin afterward. I didn’t notice dramatic tone-up effect. But, overall I love the concept of the mask sheet, very moisturizing they are. I wish Abib company could minimize the packing later on. Other than that I’m very happy with these non drying your skin masks!\nSuitable for dry skin\nDr. Denese Cannabis Sativa Super Serum with Soothing Calming Organic Cold-Pressed Hemp Oil, Ginger, Bisabolol, Ceramides - Reduce Look of Wrinkles, Moisturize & Improved Tightness - Cruelty-Free - 2oz\nDr. Denese\n{'Skin Type': 'All, Oily, Sensitive, Dry', 'Product Benefits': 'Dr. Denese', 'Scent': 'Aloe', 'Brand': 'Dr. Denese', 'Item Form': 'Serum', 'Package Dimensions': '4.6 x 2.6 x 1.7 inches; 2 Ounces', 'Manufacturer': 'Dr. Denese'}\nFirst time trying Dr. Denese products. I often see it either online or at the drugstore. I apply a few drops at night time. This serum makes my face much brighter and clear looking. However, I found no expiration date on the box nor on the product. Other than that this product works well on my skin type ( I have normal skin type with oily T zone). I would recommend trying if you’re in mid 30’s like myself. It’s great.\nLove the serum but not expiration date\nKaruna Oh, Glow On Face Mask Sheet, Skincare and Beauty Facial Masks with Moisturizing and Collagen Promotion Properties for Healthy Glow, Contain Green Tea, Vitamin C and Pineapple (3 Sheets)\nKaruna\n{'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrate Skin,Hydrate', 'Scent': 'Pineapple', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.54 x 4.88 x 0.87 inches; 9.59 Ounces', 'Item model number': 'MSF1004 - CA', 'UPC': '857950007166'}\nEvery time I find a beauty brand I try going to their websites and learn about their ingredients, where the products are manufactured. I assumed the products were made somewhere in California with USA ingredients. But, I noticed that the product is made in Taiwan. No offense to the country. But, I’ve never used a beauty product manufactured in Taiwan before.<br /><br />I do like the fact that the masks are made without toxic ingredients. Also, mask is okay. But, I wish the company put where the products are manufactured on amazon page. Also, thought that the price was overpriced. 3 product for $18 is too much.\nNot so “hip” than you think.\nKaruna Hit Refresh Eucalyptus Fiber-Infused Sheet Mask: Burst of Hydration & Refreshing Glow, 3 Count\nKaruna\n{'Brand': 'Karuna', 'Item Form': 'Sheet', 'Product Benefits': 'Hydrating', 'Scent': 'Eucalyptus', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '6.5 x 4.88 x 0.71 inches; 4.2 Ounces', 'Item model number': 'MSF1006 - CA', 'UPC': '857950007159'}\nThe product is okay. I didn’t feel these masks were better than other masks that I’ve used before. Also, the masks are not made in USA. They are made in Taiwan. Cool advertisement but, it’s 3 masks for $18. It’s a pass for me.\nOverpriced.\nEasydew Daily Double Hydra Cream 2.02 fl oz - Moisturizing Cream with EGF & Serine of NMFHydrating, Soothing, Anti-Aging EGF, Serine - N.M.F(Natural Moisturizing Factors) for Oily, Sensitive, Acne-Prone, Dry Skin Types\nEASYDEW\n{'Brand': 'EASYDEW', 'Item Form': 'Cream', 'Unit Count': '5.2911 Ounce', 'Number of Items': '1', 'Skin Type': 'Acne Prone,Oily,Sensitive,All Skin Types', 'Package Dimensions': '5.98 x 1.69 x 1.46 inches; 3 Ounces'}\nI recently got some sort of skin reaction that I couldn’t apply my normal goto skin care products. I tested this Easydew daily double hydra care cream on my wrist first then started applying minimum amount on my face. Ever since I started using this cream my face was clearing up, my face was becoming normal. Partially I was eating clean and minimized my skin care but, still I really do think this product helped me out a lot.<br /><br />I would highly recommend this product who has sensitive skin and even normal skin type people as well. This product is very mind and soothing. I would highly recommend this product!\nVery soothing and mild on skin\nEASYDEW Fill Up Volume Spot 0.67 fl oz -Anti-Aging Filler Spot Good for Topical Wrinkle Care with Hyaluronic Acid I Moisturizer with Instant Filling Effect and Skin Renewal | For Topical Area\nEASYDEW\n{'Brand': 'EASYDEW', 'Scent': 'Aloe Vera', 'Item Form': 'Cream', 'Active Ingredients': 'Hyaluronic acid', 'Number of Items': '1', 'Product Dimensions': '1.46 x 0.91 x 5.71 inches; 1.41 Ounces'}\nI am a  big fan of Easy dew products. First time trying this fill up volume product. I am in my 30’s and I see my eyes are slightly stared to sag sadly! I haven’t noticed dramatic differences. But, Easy dew products never broke me out before and so does this product. I apply this day and night time. The eye product is rich and little goes a long way. Overall, it is a great product to treat small area. I like this product a lot. I would recommend this!\neasy to apply, rich and moist using\nCaudalie Beauty Essentials Beauty Elixir Set: 3 Piece Radiance Trio including a Pore Tightening Facial Mist, Daily Foam Cleanser, Brightening Glycolic Peel Mask\n{'Package Dimensions': '7.87 x 5.83 x 1.61 inches; 1.18 Pounds'}\nThese Caudalie beauty essential is life! I’ve been loving this caudalie brand since I was younger. I love the eco friendly packaging and the company donates to the charity afterward too. Of course the products are well familiar for me. I love how this set has everything you need as a skin care set. This packaging is everything. I would be very happy if someone gifted this to me for Christmas or as a birthday gift. My skin is happy and shiny! No complains here.\nBeautiful and cheaper to buy set\nEASYDEW DW-EGF Double Synergy Moist Ampoule1.01 fl oz -K Beauty Award-Winning Anti Aging Ampoule with EGF to Plump, Moisturize Skin I For Sensitive Skin, Gift for Mom, Wife, Her\nEASYDEW\n{'Skin Type': 'Sensitive', 'Product Benefits': 'Hydrating,Anti-aging', 'Scent': 'Aloe', 'Brand': 'EASYDEW', 'Material Feature': 'Natural', 'Package Dimensions': '4.29 x 1.54 x 1.46 inches; 3.53 Ounces'}\nI love Easydew’s skin care products. Their products seem to work very well on my skin. I was first introduced from a friend of mine from Korea. I absolutely loved Easydew’s green face lotion so much I decided to try the company’s other products.<br /><br />I have normal to sensitive skin. I am very sensitive to scent, certain ingredients. Easydew products have very mild baby like scent that’s smells amazing. Also, this serum absorbs on my skin in no time. I apply this after washing my face than apply Easydew green face cream. The combo is fire!<br />Overall, this product works very well on my skin type. If you’re mid- sensitive skin this product would work well. I would highly recommend this serum. This makes my face glowy!\nMoisturizing and soothing for sensitive skin\nMurad Hydration Intense Recovery Cream - Deeply Moisturizes Severely Dry and Stressed Skin - For Face and Eyes, 1.7 Fl Oz\n{'Brand': 'Murad', 'Scent': 'Unscented', 'Item Form': 'Cream', 'Active Ingredients': 'Vitamin A', 'Unit Count': '1.7 Fl Oz', 'Language': 'English', 'Product Dimensions': '2.91 x 2.91 x 1.69 inches; 7.2 Ounces', 'Item model number': '15293', 'UPC': '767332152936'}\nI recently moved to a very low humidity area. This Murad hydration intense recovery cream has been such a great help for my dry, dull skin. The cream is thick so I apply small amount then I reapply the same amount. So far that method has been working out great for my skin. I use it at night time and I wake up to fresh and moisturized skin. Overall, I am happy with almost no scent cream product and the product itself is great. I would recommend to anyone who has dry and dull skin that need some rich hydration. This cream would be great!\nDeeply moisturizing\nKneipp Body Lotion (Lavender)\n{'Brand': 'Kneipp', 'Scent': 'Lavender', 'Item Form': 'Lotion', 'Active Ingredients': 'lavender,vitamin a', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '5.2 x 2.72 x 13.7 inches; 7.05 Ounces'}\nI’ve used kneipp’s body wash before. I liked the product so much I wanted to try body lotion version. I have pretty bd anxiety, also have trouble falling asleep at night time. I think this lavender body lotion has been helping me falling asleep faster than usual.<br />The smell is very natural, (not sweet or artificial) you can smell the pure lavender scent from the lotion. The lotion’s consistency is slightly runny but not liquidy.<br />Overall, this product has been helping me falling asleep, I even apply during the day to my arms and hands because the lotion smells so good. If you’re looking for a natural scented body lotion, this would be appropriate. I would recommend this product. Plus, Kneipp doesn’t test on animal.\nLovely smell helps sleeping, anxiety\nLAPOTHICELL Vita-C Energy Boosting Serum 25ml, Firming, Brightening\nLAPOTHICELL\n{'Scent': 'Aloe', 'Brand': 'LAPOTHICELL', 'Recommended Uses For Product': 'Vitamin,Smooth Skin,Brightening,Energy'}\nFirst time trying this Korean beauty brand. I live in Colorado and I do get lots of sun daily. I started using this vitaminC serum in order to minimize my uneven skin tone and hopefully help to reduce pores from 4 different berries that this vitamin C serum contains. For first impression I did like the consistency, non tackiness on my face. This serum is good to use daily without thinking too much about it. You do need to apply sunscreen underneath before putting this serum if you apply on a daylight time. Overall, I really like the serum and I am glad to see great Korean beauty products on amazon. I would recommend this serum!\nGood daily serum\n[BOTANIC HEAL BOH] Probioderm Repair Ampoule Serum 1.69 fl.oz. (50ml) - Probiotics & Peptide Highly Concentrated Anti-Aging Facial Serum, Skin Elasticity & Glow Care, Improves Saggy Skin\nBOTANIC HEAL BOH\n{'Skin Type': 'Dry', 'Scent': 'Aloe', 'Brand': 'BOTANIC HEAL BOH', 'Item Form': 'Serum', 'Recommended Uses For Product': 'Anti-aging', 'Package Dimensions': '6.38 x 4.88 x 1.81 inches; 10.23 Ounces'}\nI’ve seen this brand many times on olive young global. I love the heavy duty serum glad with nice pump. Overall, Lovely products with good price! The serum is very easy to pump out to use and the two samples are nice to be added to try out!\nAffordable, nice set\nZEROID Dermanewal Revitalizing Ampoule Korean Dermocosmetic | Restore Energy to Stressed Out Skin | (30mL\nZEROID\n{'Use for': 'Whole Body', 'Scent': 'Aloe', 'Brand': 'ZEROID', 'Item Form': 'Oil', 'Material Feature': 'Non-Comedogenic', 'Product Dimensions': '6.25 x 1 x 1 inches; 3.95 Ounces', 'Item model number': '00602'}\nI found myself using this product more when I’m on my cycle. I minimize my skin care products around that times. It always works wonderfully afterwards.  According to ZEROID this product Tests have proven that his product is both Hypo-allergenic and Non-Comedogenic. Dualguard-9 and multi-peptide ingredients increase the capacity of the skin to purify itself and to increase radiance. Madecassoside and Beta Glucan work together to leave the skin feeling less taut and more relax. Overall, if your face feels need extra boost, this product is worth trying. I have very sensitive skin when it comes to fragrant, ZEROID contains almost zero fragrant. The products are simply amazing. I am sold!\nGives youthful looking",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Gives youthful looking",
    "text": "I found myself using this product more when I’m on my cycle. I minimize my skin care products around that times. It always works wonderfully afterwards.  According to ZEROID this product Tests have proven that his product is both Hypo-allergenic and Non-Comedogenic. Dualguard-9 and multi-peptide ingredients increase the capacity of the skin to purify itself and to increase radiance. Madecassoside and Beta Glucan work together to leave the skin feeling less taut and more relax. Overall, if your face feels need extra boost, this product is worth trying. I have very sensitive skin when it comes to fragrant, ZEROID contains almost zero fragrant. The products are simply amazing. I am sold!",
    "images": [],
    "asin": "B08QZ8LD7F",
    "parent_asin": "B08QZ8LD7F",
    "user_id": "AERGQ6U7YCR6JZ54FFKYPUM7PFDQ",
    "timestamp": "2021-08-24 14:17:36.282000",
    "helpful_vote": 1,
    "verified_purchase": false,
    "main_category": "All Beauty",
    "title_meta": "ZEROID Dermanewal Revitalizing Ampoule Korean Dermocosmetic | Restore Energy to Stressed Out Skin | (30mL",
    "average_rating": 4.7,
    "rating_number": 18,
    "features": [
      "WHAT IS THIS PRODUCT: A revitalizing Ampoule that helps restore energy to stressed out skin. Tests have proven that his product is both Hypo-allergenic and Non-Comedogenic.",
      "WHAT DOES IT CONTAIN: Dualguard-9 and Biotide help plump the skin to help it bounce back when touched. Madocassoside, extracted from Centella Asiatica, moisturizes as well as soothes. Oligopeptide, Palmitoyl Pentapeptide, two ingredients known for their anti-aging properties. These both help enhance the vitality and energy of the skin cells.",
      "APPLICATION METHOD: Squeeze a few drops into the palm of the hand and apply all over the face. To enhance hydration, mix 2 or 3 drops of the Ampoule with one of the Dermanewal Creams, Repair or Protect and then apply all over the face.",
      "DERMATOLOGIST TESTED: ALL ZEROID products contain the ingredients that work to improve the condition of the skin, such as: MLE (+ Ceramide-9S) which has a similar structure to the skin barrier, helps protect and strengthen that skin barrier. Defensamide helps stimulate the production of peptides; it also aids in improving and reinforcing the functions of the skin barrier and the skin self-defense system.",
      "PRODUCT EXPIRY AND SHELF LIFE: The date on the packaging is NOT the expiration date. It is the MANUFACTURED date. According to Korea FDA regulation, manufacturer should print manufactured (or produced date) at the bottom of package. Korean language “제조” on package means produce (or manufacture), NOT expiration date. The SHELF LIFE of UNOPENED PRODUCT is 3 years (36 months or 1095 days). OPENED PRODUCT should be used within 12 months."
    ],
    "description": [],
    "price": 29.69,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/31BHpNGLofL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31BHpNGLofL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61Q1kWsjmKL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31z3JBtaRPL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31z3JBtaRPL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/71DOE4471iL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/515EJ8CNnIL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/515EJ8CNnIL.jpg",
        "variant": "PT02",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41MSIXfJ2XL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41MSIXfJ2XL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/61VlQ+0CZlL._SL1210_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41oGjCJcUjL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41oGjCJcUjL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/61zg5Eg3oGL._SL1280_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41d7HrO64aL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41d7HrO64aL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/51Dbmn-BoQL._SL1280_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31azvWMmaUL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31azvWMmaUL.jpg",
        "variant": "PT06",
        "hi_res": "https://m.media-amazon.com/images/I/51jZoIE1b9L._SL1110_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Nt6FhNQNL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Nt6FhNQNL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/61AhEmbmVPL._SL1277_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/31xZqQlzdqL._SS40_.jpg",
        "large": "https://m.media-amazon.com/images/I/31xZqQlzdqL.jpg",
        "variant": "PT08",
        "hi_res": "https://m.media-amazon.com/images/I/511zjMMVhJL._SL1280_.jpg"
      }
    ],
    "videos": [],
    "store": "ZEROID",
    "categories": [],
    "details": {
      "Use for": "Whole Body",
      "Scent": "Aloe",
      "Brand": "ZEROID",
      "Item Form": "Oil",
      "Material Feature": "Non-Comedogenic",
      "Product Dimensions": "6.25 x 1 x 1 inches; 3.95 Ounces",
      "Item model number": "00602"
    },
    "bought_together": null
  }
}