{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: HANYUDIE Brown Wigs for Women Short Straight Wig with bangs Mixed Brown Bob Wig Shoulder Length Synthetic wig for Women Daily Party Use(16 inch)\nReview Date: 2021/08/21\nStore: HANYUDIE\nAverage Rating: 3.4\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'HANYUDIE', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.5 x 8.54 x 2.09 inches; 8.15 Ounces'}\nReview Text: Well this is the second wig I have tried. One long hair, because I used to have long hair. That was a BIG NOPE! So I seen this one, It being the color of my natural hair, and shorter, I thought I would give it a try...Still a NOPE! Maybe I just cannot wear a wig...or maybe just not yet. I do still have hair. To me, it seems I'm about bald, but to others I've still got plenty of hair...I don't know, I'm just used to having hair, and I want hair, so I was trying this wig to rush along my need of something to give me hair, when I'm truly not ready for it yet. Because it's a nice wig, nice color, length and style, I rate this wig with 4 stars. It's not the wigs fault I'm not ready.\nReview Title: Not for me\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Natural Solution Himalayan Pink Salt Body Scrub with Organic Marula Essential Oil, Moisturizes and Nourishes Face & Skin - 12.3 Oz\nNatural Solution\n['Natural Solution Organic Marula Oil Body Scrub Exfoliate and nourish your skin with this luxurious Natural Solution body scrub made with organic marula oil. Marula oil is a natural oil & is known for its ability to moisturize and protect the skin, as well as to reduce the appearance of wrinkles and fine lines. This body scrub is also made with Himalayan pink salt, which is a natural exfoliator that helps to remove dead skin cells and leave your skin feeling smooth and soft. The scrub is gentle enough for daily use, and it is perfect for all skin types. Usage: Apply a generous amount of scrub to wet skin. Massage in circular motions for 2-3 minutes. Rinse with water. Use 2 times per week for best results. Caution: Avoid contact with eyes. If contact occurs, rinse immediately with water. Keep out of reach of children. Store in a cool, dry place. Benefits: 1- Exfoliates and removes dead skin cells 2- Moisturizes and nourishes the skin 3- Protects the skin from free radicals 4- Leaves skin feeling smooth and soft 5-Suitable for all skin types']\n{'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.75 x 3.75 x 3.6 inches; 12.35 Ounces', 'Item model number': '8246E', 'UPC': '818581019775', 'Manufacturer': 'Natural Solution'}\nUnfortunately, when I first used this, it caused a rash. I passed it on to a friend of mine, who seems to like it. Saying, \"her skin feels so soft and smooth.\"\nSharing with friends\nDaletu Nail Clips, 10PCS Clear Nail Clips Finger Extension Fixed Clip, Quick Building Finger Builder Nail Clamps, Nails Art DIY Manicure Tool\nDaletu\n{'Size': 'Large', 'Brand': 'Daletu', 'Coverage': 'Full Well Tips', 'Number of Pieces': '10', 'Unit Count': '1.00 Count', 'Package Dimensions': '4.09 x 3.9 x 2.01 inches; 1.76 Ounces', 'UPC': '738634020063'}\nI use the polygel nails, and from time to time, I need to clip it on to hold it on until it gets completely dry. I got these clips to help aid in holding my nails in place. But for some reason, these clips leave dents in my nails. I  had to redo them totally. 1 star is the lowest  I can go.\nDents in nails\nLuxsea 12 Colors Liquid Eyeliner Kit Matte and Glitter Colorful Cosmetic Pen Set Lasting Highly-Pigmented Extremely Fine Easy to Wear Waterproof Eye Liner Makeup Pen Set\nuxsea\n{'Brand': 'uxsea', 'Item Form': 'Liquid', 'Finish Type': 'Metallic,Glitter,Shimmer,Matte', 'Special Feature': 'Waterproof, Matte', 'Unit Count': '1.00 Count', 'Package Dimensions': '6.97 x 5.51 x 0.55 inches; 0.71 Ounces'}\nThe colors and very pretty. But when putting the liner on my eyes, I dipped the liner in the color, and went to apply it to my eye, but it's just not that great. It starts out going on smoothly, but its like it dries out mid stride across my lid. So other than the beautiful colors, I have nothing more good to say about these liquid eyeliners.\nToo Fast Drying Liner\nWaxing Kit,Wax Warmer Hair Removal for Women Men,upgrade Portable Wax Kit with Scented Hard Wax Beans,Wax Machine for sensitive skin Full Body at home waxing or on vacation\nJAPUSOON\n{'Item Form': 'Wax', 'Skin Type': 'Sensitive', 'Brand': 'JAPUSOON', 'Number of Items': '1', 'Unit Count': '1 Count', 'Package Dimensions': '7.52 x 7.4 x 5.2 inches; 1.41 Pounds', 'UPC': '750440491196'}\nIt could warm the wax up a little quicker. As far as everything else goes, it's a great product. Now if only I could get the arch in my eyebrow down pat, lol.\nHair be gone\nHANYUDIE Brown Wigs for Women Short Straight Wig with bangs Mixed Brown Bob Wig Shoulder Length Synthetic wig for Women Daily Party Use(16 inch)\nHANYUDIE\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Modern', 'Brand': 'HANYUDIE', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.5 x 8.54 x 2.09 inches; 8.15 Ounces'}\nWell this is the second wig I have tried. One long hair, because I used to have long hair. That was a BIG NOPE! So I seen this one, It being the color of my natural hair, and shorter, I thought I would give it a try...Still a NOPE! Maybe I just cannot wear a wig...or maybe just not yet. I do still have hair. To me, it seems I'm about bald, but to others I've still got plenty of hair...I don't know, I'm just used to having hair, and I want hair, so I was trying this wig to rush along my need of something to give me hair, when I'm truly not ready for it yet. Because it's a nice wig, nice color, length and style, I rate this wig with 4 stars. It's not the wigs fault I'm not ready.\nNot for me",
  "profile": "The user maintains a strong preference for natural and organic skincare products, particularly those that focus on moisturizing and nourishing properties. Their inclination towards body scrubs with natural exfoliators highlights a desire for smooth skin, while past adverse reactions, such as rashes, reinforce their cautious approach to product selection. They express disappointment in products that fall short of performance expectations, leading to low ratings.\n\nRecently, the user has explored nail care but has encountered issues with initial purchases, resulting in low ratings. They have also ventured into makeup, particularly liquid eyeliners, yet expressed dissatisfaction due to ineffective performance and the need for gentleness.\n\nIn their latest interaction, the user purchased a wig, rating it positively despite feeling unprepared for the change. This reflects their curiosity for new beauty solutions while maintaining a focus on product effectiveness. They are pleased with their recent waxing kit for sensitive skin, though they desire quicker wax warming, demonstrating their ongoing pursuit of effective beauty products compatible with their sensitivity concerns.\n\nOverall, the user's preferences reveal a balance between cautious exploration of new beauty items and a strong commitment to skincare and performance-focused products that align with their needs.",
  "metrics": {
    "rouge1_f": 0.1681159420289855,
    "rouge2_f": 0.01936108422071636,
    "rougeL_f": 0.09468599033816426,
    "meteor": 0.06699522748726909,
    "bleu1": 0.008860660909329498,
    "bleu2": 0.002490683325782643,
    "bleu3": 0.000854224375050427,
    "bleu4": 0.00028164529836531614,
    "bertscore_precision": 0.3486819863319397,
    "bertscore_recall": 0.4785541296005249,
    "bertscore_f1": 0.40342339873313904
  }
}