{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Jason Bourne\nReview Date: 2018/04/22\nStore: Damon, Matt  (Actor),     Lee Jones, Tommy  (Actor),     Paul Greengrass  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Action & Adventure\nProduct Description: [\"Matt Damon returns to his most iconic role in Jason Bourne. Paul Greengrass, the director of The Bourne Supremacy and The Bourne Ultimatum, once again joins Damon for the next chapter of Universal Pictures' Bourne franchise, which finds the CIA's most lethal operative drawn out of the shadows. Damon is joined by Alicia Vikander, Vincent Cassel and Tommy Lee Jones, while Julia Stiles reprises her role in the series.\", 'Bonus Content:', 'Bringing Back Bourne', 'Bringing Back Bourne', 'Bourne To Fight', 'Bourne To Fight', 'The Athens Escape', 'The Athens Escape', 'Las Vegas Showdown', 'Las Vegas Showdown', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43379923', 'Director': 'Paul Greengrass', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 4 minutes', 'Release date': 'December 6, 2016', 'Actors': 'Damon, Matt, Lee Jones, Tommy, Vikander, Alicia, Cassel, Vincent, Stiles, Julia', 'Subtitles': 'Spanish, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS:X Master Audio), French (DTS:X Master Audio), Spanish (DTS:X Master Audio)', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Couldn't find in my local Walmart so I bought it on here. I love the Bourne movie, so I had to get this one, too. Great movie!\nReview Title: Couldn't find it my local Walmart\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Unusuals: The Complete Series\nAmber Tamblyn  (Actor),     Jeremy Renner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Amber Tamblyn (TV’s “Joan of Arcadia”) and Jeremy Renner (THE HURT LOCKER) star as Detective Casey Shraeger and Detective Jason Walsh in this dark and gritty series that explores both the grounded drama and comic insanity of the world of New York City police detectives. Together, the two must investigate the murder of a cop, unraveling the conflicting clues that they hope will lead to the killer and ultimately reveal the truth behind the dead cop’s past. Also stars Harold Perrineau (TV’s“Lost”) as Detective Banks and Adam Goldberg (TV’s“Entourage”) as Detective Delahoy.', 'Amazon.com', 'Stills from', 'The Unusuals', '(Click for larger image)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Monique Curnen, Terry Kinney, Jeremy Renner, Kai Lennox, Harold Perrineau, Adam Goldberg, Joshua Close, Amber TamblynMonique Curnen, Terry Kinney, Jeremy Renner, Kai Lennox, Harold Perrineau, Adam Goldberg, Joshua Close, Amber Tamblyn  See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.18 Ounces', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '7 hours and 12 minutes', 'Release date': 'April 6, 2010', 'Actors': 'Amber Tamblyn, Jeremy Renner, Harold Perrineau, Adam Goldberg, Terry Kinney', 'Studio': 'Sony Pictures', 'Number of discs': '2'}\nI had heard of this series when it came out, but I never got to watch it. There's a bunch of hilarious irony & smart-aleck comments to make you think this group of detectives have been together for a long time. They make this work. The one piece I found to be quite ironic & funny was in the pilot episode, Jeremy Renner's character made a smart-aleck comment to a lady that &#34;this isn't a Bourne movie,&#34; then a few years later he starred in &#34;The Bourne Legacy.&#34;\nSeries is hilarious\nThe Town\nBen Affleck  (Actor, Director),     Rebecca Hall  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Ben Affleck follows his acclaimed', 'Gone Baby Gone', 'directorial debut by directing, co-writing and starring in a taut thriller about robbers and cops, friendship and betrayal, love and hope and escaping a past that has no future. He plays Doug MacRay, leader of a Boston bank robber gang but not cut from the same cloth as his fellow thieves. When Doug falls into a passionate romance with the bank manager (Rebecca Hall) briefly taken hostage in their last heist, he wants out of this life and out of the town. As the Feds close in and the crew questions his loyalty, he has one of two choices: betray his friends or lose the woman he loves.', 'Amazon.com', 'Ben Affleck worked triple-time on', 'The Town', \", in which he directs, stars, and co-adapts Chuck Hogan's\", 'Prince of Thieves', \". Affleck's Doug MacRay comes from a line of Boston bank robbers. With his father (Chris Cooper) behind bars, he spent most of his childhood in Charlestown with loyal hothead Jem (\", 'The Hurt Locker', \"'s Jeremy Renner). Doug had a chance to go legit as a pro hockey player, but he threw it away on drugs and bad behavior. After the armed robbery that opens the film, Jem becomes convinced that bank manager Claire (\", 'Vicki Cristina Barcelona', \"'s Rebecca Hall) saw something, so Doug, who wore a disguise at the time, sets out to make sure she doesn't tell FBI agent Frawley (\", 'Mad Men', \"'s Jon Hamm) anything incriminating (Titus Welliver plays Frawley's partner). Doug starts by asking Claire out, and finds she's more shaken than stirred--and that he likes her better than Jem's oxy-addicted sister, Krista (\", 'Gossip Girl', \"'s Blake Lively), his sometime girlfriend. Unfortunately, neither Jem nor vicious enforcer Fergie (Pete Postlethwaite) will cut him loose until he orchestrates two more scores--the last to take place at Fenway Park. If\", 'The Town', \"offers fewer surprises than Affleck's directorial debut,\", 'Gone Baby Gone', ', he raises the stakes with well-planned heists, nerve-jangling car chases, and deadly shootouts. Though Affleck looks too clean-cut to portray a thug, he gives a nicely understated performance, while Hall proves an inspired choice as a woman who could make a bad guy turn good--or die trying.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Drama/Love & Romance, Mystery & Suspense/Thrillers, Action & Adventure/Crime, Mystery & Suspense/CrimeDrama, Drama/Love & Romance, Mystery & Suspense/Thrillers, Action & Adventure/Crime, Mystery & Suspense/Crime  See more', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Chris Cooper, Jon Hamm, Titus Welliver, Jeremy Renner, Rebecca Hall, Slaine, Blake Lively, Pete Postlethwaite, Ben AffleckChris Cooper, Jon Hamm, Titus Welliver, Jeremy Renner, Rebecca Hall, Slaine, Blake Lively, Pete Postlethwaite, Ben Affleck  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 5 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.57 x 5.26 x 7.6 inches; 2.4 Ounces', 'Item model number': 'WHV1000119682DVD', 'Director': 'Ben Affleck', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'December 17, 2010', 'Actors': 'Ben Affleck, Rebecca Hall, Jon Hamm, Jeremy Renner, Blake Lively', 'Subtitles': 'Spanish, English, French', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nSit down and watch all the way through. It's kinda fast paced, and if you don't pay attention you will miss some stuff.\nGreat movie\nTrouble with the Curve\nRobert Lorenz  (Director),     Amy Adams  (Actor),     Justin Timberlake  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Trouble With The Curve (DVD)', 'Screen icon and multiple Academy Award® winner Clint Eastwood (Gran Torino, Million Dollar Baby) returns in front of the camera once more for this heartfelt sports dramedy about an aging major league baseball scout on the cusp of retirement. Confronting his own mortality and his failing eyesight, he sets out on an unforgettable road trip to Atlanta to scout a hot high school batting prospect. Along the way, he tries to mend his troubled relationship with his alienated lawyer daughter. Directed by Eastwood\\x92s longtime producing partner, Robert Lorenz, this diamond in the rough dramedy represents another moving return to form for the legendary Eastwood.', ']]>', 'Amazon.com', 'Clint Eastwood has developed a killer changeup during his career, using his iconic status and mainstream credibility to take audiences to some thoughtfully unexpected places. (How the man behind the lyrical', 'Letters from Iwo Jima', 'and', 'A Perfect World', 'can also peel off something like the cheerfully meatheaded', 'The Rookie', 'is one of the most enjoyable mysteries in Hollywood.) The biggest surprise behind', 'Trouble with the Curve', \", Eastwood's first time in front of the camera since\", 'Gran Torino', \"(and his first appearance in a film he hasn't directed since 1993's\", 'In the Line of Fire', \"), is how resolutely unsurprising it is, telling its story with an unfashionably retro simplicity. Still, even if the resolution is easily guessed, the star's trademark glower and a stellar supporting cast make it an exceedingly pleasant journey. Pulling a 180 from the methods espoused in\", 'Moneyball', \", Randy Brown's script follows Gus (Eastwood), a cantankerous talent scout for the Atlanta Braves whose old-school ethics are on the outs. While on what may be his last recruiting trip, Gus is reunited with his estranged daughter (Amy Adams), an upwardly mobile attorney still smarting from her father's distancing techniques. First-time director Robert Lorenz wisely places his actors front and center, with the sparkling Adams, Justin Timberlake, Matthew Lillard, and the great John Goodman all delivering terrifically tuned performances. Ultimately, though,\", 'Trouble with the Curve', \"rises and falls with Eastwood, who keeps the material from drifting into cornball territory by sheer force of will. Squinting balefully at even the most minor annoyance, and rasping out a succession of mildly profane wisecracks, he generates more than enough star power to keep the film on track. If he hasn't earned the right to coast occasionally, then for Pete's sake, who has? --\", 'Andrew Wright']\n{'Genre': 'Drama, Sports', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Michele Weisler, Amy Adams, Matthew Lillard, Robert Patrick, Joe Massingill, Justin Timberlake, Clint Eastwood, Tim Moore, Randy Brown, John Goodman, Robert LorenzMichele Weisler, Amy Adams, Matthew Lillard, Robert Patrick, Joe Massingill, Justin Timberlake, Clint Eastwood, Tim Moore, Randy Brown, John Goodman, Robert Lorenz   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '1000300900', 'Director': 'Robert Lorenz', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 51 minutes', 'Release date': 'December 18, 2012', 'Actors': 'Clint Eastwood, Amy Adams, Justin Timberlake, John Goodman, Matthew Lillard', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Tim Moore, Clint Eastwood, Michele Weisler', 'Studio': 'WarnerBrothers', 'Writers': 'Randy Brown', 'Number of discs': '1'}\nI love baseball (especially the Braves), so I thoroughly enjoyed this movie. I recommend it to any baseball fan anywhere. The casting is wonderful - Clint Eastwood, Amy Adams, Justin Timberlake, John Goodman, Matthew Lillard... You simply can't go wrong!\nLOVE THIS MOVIE!!\nThe Hurt Locker\nJeremy Renner  (Actor),     Anthony Mackie  (Actor),     Kathryn Bigelow  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['War is a drug. Nobody knows that better than Staff Sergeant James, head of elite squad of soldiers tasked with disarming bombs in the heat of combat. To do this nerve-shredding job, it\\'s not enough to be the best: you have to thrive in a zone where the margin of error is zero, think as diabolically as a bomb-maker, and somehow survive with your body and soul intact. Powerfully realistic, action-packed, unrelenting and intense, The Hurt Locker has been hailed by critics as \"an adrenaline-soaked tour de force\" (A.O. Scott, The New York Times) and \"one of the great war movies.\" (Richard Corliss, Time)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Evangeline Lilly, Christian Camargo, David Morse, Kathryn Bigelow, Jeremy Renner, Guy Pearce, Anthony Mackie, Brian Geraghty, Ralph FiennesEvangeline Lilly, Christian Camargo, David Morse, Kathryn Bigelow, Jeremy Renner, Guy Pearce, Anthony Mackie, Brian Geraghty, Ralph Fiennes   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.64 x 5.44 x 7.57 inches; 0.8 Ounces', 'Item model number': '000092183', 'Director': 'Kathryn Bigelow', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'January 12, 2010', 'Actors': 'Jeremy Renner, Anthony Mackie, Brian Geraghty, Ralph Fiennes, Guy Pearce', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Summit Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have more family in the military than I know what to do with. One of which was an IED for years. So this movie really hit home with me. It's hard to watch at times, but it's very well written, directed and played out. This is why I plan on getting a degree in psychology. I've been listening to stories like this my whole life. I guarantee every actor & crew member on this movie has some degree of PTSD.\nInteresting\nMission: Impossible Ghost Protocol\nTom Cruise  (Actor),     Jeremy Renner  (Actor),     Brad Bird  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'No plan. No backup. No choice. Agent Ethan Hunt (Tom Cruise) and his elite team (Jeremy Renner,', 'The Avengers', 'and Simon Pegg,', 'Star Trek', \") go underground after a bombing of the Kremlin implicates the IMF as international terrorists. While trying to clear the agency's name, the team uncovers a plot to start a nuclear war. Now, to save the world, they must use every high-tech trick in the book. The mission has never been more real, more dangerous, or more impossible.\", 'Amazon.com', \"The second half of the first decade of the 21st century has been kind of tough for Tom Cruise. That's tough in a way over and above the hardship of living the legacy of one of history's top movie stars--a job more demanding than any mere mortal could imagine. But after two fruitful collaborations with Steven Spielberg (\", 'Minority Report', 'and', 'War of the Worlds', '), his stature took a beating from the one-two hits of those wacky PR gaffes and that string of relative box-office disappointments (', 'Lions for Lambs', ',', 'Valkyrie', ',', 'Knight and Day', '), which seemed to start with the third installment of his', 'Mission: Impossible', \"franchise in 2006. It's hard to say with a straight face that taking in only $398 million worldwide is a disappointment, but it was a low for the series, which some later saw as a prelude to his potentially dimming stardom. But on the cusp of turning 50, it looks like Tom Cruise has put the licking behind him and entered a new phase of self-conception with an upcoming array of roles, starting with a more maturely controlled version of superspy Ethan Hunt in the sleek and supercharged\", 'Mission: Impossible - Ghost Protocol', '. The things Cruise has done right in', 'M: I', 'part four include toning down his youthful, arrogant preening and letting his castmates share more of the spotlight (Jeremy Renner, Paula Patton, and Simon Pegg all have some terrifically shiny moments). He also lets the unique creative vision of director Brad Bird shine through in a first live-action outing for the acclaimed helmer of', 'Iron Giant', ',', 'The Incredibles', ', and', 'Ratatouille', \". Still looking much younger than his years (that hair! those pecs! those abs!), Cruise is playing more age-appropriately, letting a little wisdom and grace seep into his charisma so the wattage of his mere presence smolders a little deeper. It's a nice nod to a graying generation that says you can get older and still be cool. All that is not to say he doesn't play up his action-star chops to the max. In a mostly inconsequential narrative arc that has something to do with purloined nuclear launch codes, an important metal briefcase, satellite uplinks, and global annihilation that leaps from Moscow to Dubai to Mumbai, Cruise is as dangerously nimble as he has ever been. He dangles one-handed from the tallest building in the world, bounds off ledges, springs out of speeding vehicles, tumbles and careens up and down the levels of an automated parking garage, and generally sprints and jumps his way across the movie with only a scratch or bruise to show for it. Also on the outlandish upside is a happily stereotypical villain straight out of Connery-era Bond and as many bleeding-edge gadgets as the art department techno-geeks could dream up. A running gag is that many of these electronic fantasy tools fail at just the wrong moment, which is part of a larger wink acknowledging how utterly preposterous yet ingeniously conceived this behemoth of a movie really is. The gadgetry is not limited just to the miraculous props.\", 'Ghost Protocol', \"employs CGI fakery of the highest order from the sub-industry of effects contractors that ratchet up the standard of computing power and software design, one-upping each successive action-adventure extravaganza. The loving detail that goes into blowing up the Kremlin or rendering a photo-realistic sandstorm erupting across the enhanced skyline of an Oz-like desert city is nothing short of miraculous. What's more astonishing is that Tom Cruise closes the deal with a selling power that's as new and improved as the laminates on his multi-million-dollar teeth. --\", 'Ted Fry']\n{'Genre': 'Action & Adventure', 'Format': 'Subtitled, NTSC', 'Contributor': 'Jeremy Renner, Brad Bird, Tom Cruise', 'Language': 'English', 'Runtime': '2 hours and 12 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '25100497', 'Director': 'Brad Bird', 'Media Format': 'Subtitled, NTSC', 'Run time': '2 hours and 12 minutes', 'Release date': 'April 17, 2012', 'Actors': 'Tom Cruise, Jeremy Renner', 'Dubbed': 'French, Spanish', 'Studio': 'Paramount Pictures', 'Number of discs': '1'}\nI'm pretty sure I caught all of the irony & smart aleck comments in this movie because I laughed the whole time!!!\nPretty good movie, fast paced\nHappy Feet Two\nElijah Wood  (Actor),     Pink  (Actor),     George Miller  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The sequel to \"Happy Feet\", the Academy Award®-winning animated smash hit, \"Happy Feet Two\" returns audiences to the magnificent landscape of Antarctica. Mumble, The Master of Tap, has a problem because his tiny son, Erik, is choreo-phobic. Reluctant to dance, Erik runs away and encounters The Mighty Sven - a penguin who can fly! Mumble has no hope of competing with this charismatic new role model. But things get worse when the world is shaken by powerful forces. Erik learns of his father\\'s \"guts and grit\" as Mumble brings together the penguin nations and all manner of fabulous creatures - from tiny Krill to giant Elephant Seals - to put things right.', 'Amazon.com', 'The sequel', 'Happy Feet 2', \"begins a few years after the 2006 original ended: Mumble (voiced by Elijah Wood) is now married to Gloria (Pink) and the father of Erik (Ava Acres), a chick who's afraid to dance. When Erik sees the puffin Mighty Sven (Hank Azaria), he decides he can learn to fly: Sven is the leader of a cult that preaches if you believe it, it can happen. An unexplained seismic event causes a glacier to shift, trapping Gloria and all the other emperor penguins: Mumble, Erik, and two other chicks must rescue them before they starve. What begins as a familiar story about a diffident chick quickly becomes needlessly and hopelessly mired in subplots involving elephant seals, skua gulls, human explorers, and a pair of renegade krill (voiced by Brad Pitt and Matt Damon). The motion-capture animation is adequate at best, with snow and water splashing around the dancing penguins to hide the fact that their feet aren't making contact with the ground plane. Endless tracking shots over the cracking glaciers recall the second\", 'Ice Age', 'movie. The vocal performances feature a discordant mélange of accents, with African-American, Latino, and British penguins, surfer-dude krill, Australian seals, and \"fugeddaboutit\"', 'Jersey Shore', 'seagulls. Even more jarring is the presence of human actors who appear out of nowhere, start to help the trapped penguins, then disappear. The standard-issue poop and snot jokes do little to leaven the nonstop nattering.', 'Happy Feet 2', 'confirms 2011 as the year of the unnecessary sequel in American animation. (Rated PG for some rude humor and mild peril)', '--Charles Solomon']\n{'Genre': 'Musicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, ComedyMusicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, Comedy  See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Elijah Wood, Pink, George Miller', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 39 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000168080DVD', 'Director': 'George Miller', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'March 13, 2012', 'Actors': 'Elijah Wood, Pink', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros. Pictures', 'Number of discs': '1'}\nMy 9-year-old fell in love with the first Happy Feet - even had the little stuffed penguin. So when he found out there was a Happy Feet 2 he just had to have it. This movie is so cute, and I love it myself.\nWonderful kids movie!\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jack Bender', 'Peter Leto', 'David Barrett', 'Sergio Mimica-Gezzan', 'Kari Skogland', 'Eriq La Salle', 'Edward Ornelas', 'Peter Weller', 'Roxann Dawson', 'Paul A. Edwards'], 'Starring': ['Mike Vogel', 'Rachelle Lefevre', 'Alexander Koch'], 'Studio': ['CBS']}\nThis show is awesome! We watched the first two seasons in about 2 weeks, and now we can't wait for the 3rd season to start!\nLove this show!\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ron Howard'], 'Producers': ['Brian Grazer'], 'Starring': ['Tom Hanks', 'Bill Paxton', 'Kevin Bacon'], 'Studio': ['UNIVERSAL PAY TELEVISION']}\nOne of my favorite movies! I've always been fascinated with space flight & air travel. The actors did a wonderful job of portraying their respected real-life counterparts in telling this heroic story of Apollo 13's crew and their &#34;successful failure&#34; mission.\nGreat movie!\nBill Engvall: 15° Off Cool\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Bill Engvall's\", '15: Off Cool', ', filmed at the Paramount Theatre in Austin, TX, features all-new material and documents his Comedy Central special.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': '2-38712', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 1 minute', 'Release date': 'March 27, 2007', 'Actors': 'Bill Engvall', 'Language': 'Unqualified', 'Studio': 'Jack Records', 'Number of discs': '1'}\nMy favorite stand-up routine from my favorite comedian!\nHilarious!\nCoyote Ugly\nPiper Perabo  (Actor),     Adam Garcia  (Actor),     David McNally  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Music Artists, Grateful Dead\n['Product Description', 'From hit-making producer Jerry Bruckheimer (GONE IN 60 SECONDS, ARMEGEDDON) comes COYOTE UGLY, the intoxicating sexy comedy starring an unbeatable cast of hot new stars inlcuding Piper Perabo (ROCKY AND BULLWINKLE) and Maria Bello (PAYBACK). Moving to New York to pursue her dream of becoming a famous songwriter, Violet Sanford (Perabo) finds herself desperate and broke. Through a twist of fate, the shy, innocent Violet lands a job as one of the barmaids at the hottest nightclub in town -- the down and dirty, wild and fun Coyote Ugly. Pouring drinks and overflowing with attitude, the \"Coyotes\" spend more time on top of the bar than behind it, tantalizing the standing-room-only crowd with their outrageous antics! It\\'s one wild adventure for a small-town girl chasing her dream in the big city.', 'Amazon.com', 'As a producer, Jerry Bruckheimer makes movies for guys, mostly action films like', 'Top Gun', 'and', 'Gone in 60 Seconds', '. The ones he makes that feature women, such as', 'Flashdance', 'and now', 'Coyote Ugly', ', broaden their appeal with a fondness for \"strong women.\" For Bruckheimer, that means self-determined, attractive women who don\\'t need men to get what they want. Is there anything sexier than that? In', 'Coyote Ugly', ', the charming young waif Piper Perabo stars as Violet, a New Jersey waitress who moves to New York to make it big as a songwriter. She has absolutely no idea how the music business works, relying instead on her faith in her own abilities. In order to make ends meet, she gets a job in a bar called Coyote Ugly, where the bartenders are scantily clad women who dance on the bar and order around their mostly male clientele. Really, they are strippers who don\\'t have to take off their clothes. In fact, the owner (Maria Bello) orders them to enact the first rule of strip clubs: \"Appear available but never be available.\" Bruckheimer is smart enough to focus on the naive girl instead of the seamier side of the story, following her as she realizes her dream and picks up a disposable but nice man along the way. Further \"empowering\" the female figures in the film, Zoe (Tyra Banks), the bartender whom Violet is replacing, leaves in order to go to law school. See? They\\'re as smart as they are sexy! Then there\\'s John Goodman, who turns in an absolutely charming performance as Violet\\'s concerned father. This is a sweet and inoffensive film as long as you don\\'t think too much about it.', '--Andy Spletzer']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, WidescreenMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Bridget Moynahan, Gina Wendkos, Piper Perabo, Izabella Miko, Jeremy Rowley, Michael Bay, LeAnn Rimes, Bud Cort, David McNally, Ellen Cleghorne, Maria Bello, John Fugelsang, Melanie Lynskey, John Goodman, Adam GarciaBridget Moynahan, Gina Wendkos, Piper Perabo, Izabella Miko, Jeremy Rowley, Michael Bay, LeAnn Rimes, Bud Cort, David McNally, Ellen Cleghorne, Maria Bello, John Fugelsang, Melanie Lynskey, John Goodman, Adam Garcia  See more', 'Language': 'English (Dolby Digital 5.1), English (DTS 5.1), French (Dolby Digital 5.1), Unqualified', 'Runtime': '1 hour and 41 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': '2162700', 'Director': 'David McNally', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 41 minutes', 'Release date': 'January 16, 2001', 'Actors': 'Piper Perabo, Adam Garcia, Maria Bello, Melanie Lynskey, Izabella Miko', 'Subtitles': 'Spanish', 'Studio': 'TOUCHSTONE PICTURES', 'Writers': 'Gina Wendkos', 'Country of Origin': 'USA', 'Number of discs': '1'}\nFunny!\nOne of my favorite movies!\nLilo & Stitch\nChris Sanders  (Actor, Director, Writer),     Daveigh Chase  (Actor),     Dean Deblois  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'Get ready for the wildly original story about an independent little girl named Lilo and her adopted alien \"puppy,\" the mischievous Stitch, a runaway genetic experiment from a faraway planet. After crash-landing on Earth, Stitch wreaks havoc on the Hawaiian Islands, but he also learns about loyalty, friendship and \\'ohana, the Hawaiian tradition of family. Now, catch the wave of fun and adventure in this 2-Disc Big Wave Edition jam-packed with games and awesome bonus features that take you and your family behind the scenes of the movie! Experience LILO & STITCH like never before in this 2-Disc Big Wave Edition. There\\'s excitement and entertainment for every member of your \\'ohana!|The movie has a rocking soundtrack fit for a \"King.\" Six of Elvis Presley\\'s biggest hits, sung by the King himself, are included in the film: \"Heartbreak Hotel,\" \"Stuck On You,\" \"Blue Hawaii,\" \"Suspicious Minds,\" \"Devil In Disguise,\" and \"Hound Dog.\"|Writer/director Chris Sanders first began thinking about a Stitch-like character nearly 17 years ago when he was just out of school. He revisited the idea around 1997, when he proposed a simple yet strong character-driven film involving his creation.|In the early stages of story development, Stitch landed in rural Kansas and interacted entirely with animals. Animation president Thomas Schumacher suggested that Stitch interact with people instead, while a well-timed Hawaii vacation gave Sanders the idea to move the story from the barnyard to the beach.', 'Amazon.com', 'Stills from', 'Lilo & Stitch: Big Wave Edition', '(Click for larger image)']\n{'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': 'DV04965100', 'Director': 'Chris Sanders, Dean Deblois', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Full Screen, Widescreen', 'Run time': '1 hour and 25 minutes', 'Release date': 'March 24, 2009', 'Actors': 'Chris Sanders, Daveigh Chase, Tia Carrere, Ving Rhames, David Ogden-Stiers', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Spanish, English', 'Language': 'English (Dolby Digital 5.1), French, Unqualified, Spanish', 'Studio': 'WALT DISNEY ANIMATION', 'Writers': 'Chris Sanders', 'Country of Origin': 'USA', 'Number of discs': '2'}\nSuch a cute movie!\nToo cute!\nJason Bourne\nDamon, Matt  (Actor),     Lee Jones, Tommy  (Actor),     Paul Greengrass  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Matt Damon returns to his most iconic role in Jason Bourne. Paul Greengrass, the director of The Bourne Supremacy and The Bourne Ultimatum, once again joins Damon for the next chapter of Universal Pictures' Bourne franchise, which finds the CIA's most lethal operative drawn out of the shadows. Damon is joined by Alicia Vikander, Vincent Cassel and Tommy Lee Jones, while Julia Stiles reprises her role in the series.\", 'Bonus Content:', 'Bringing Back Bourne', 'Bringing Back Bourne', 'Bourne To Fight', 'Bourne To Fight', 'The Athens Escape', 'The Athens Escape', 'Las Vegas Showdown', 'Las Vegas Showdown', ']]>']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '43379923', 'Director': 'Paul Greengrass', 'Media Format': 'NTSC, Subtitled', 'Run time': '2 hours and 4 minutes', 'Release date': 'December 6, 2016', 'Actors': 'Damon, Matt, Lee Jones, Tommy, Vikander, Alicia, Cassel, Vincent, Stiles, Julia', 'Subtitles': 'Spanish, French', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS:X Master Audio), French (DTS:X Master Audio), Spanish (DTS:X Master Audio)', 'Studio': 'Universal Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nCouldn't find in my local Walmart so I bought it on here. I love the Bourne movie, so I had to get this one, too. Great movie!\nCouldn't find it my local Walmart",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Couldn't find it my local Walmart",
    "text": "Couldn't find in my local Walmart so I bought it on here. I love the Bourne movie, so I had to get this one, too. Great movie!",
    "images": [],
    "asin": "B01JAQEQOK",
    "parent_asin": "B01JAQEQOK",
    "user_id": "AEELTFR7EFE5YGNLHG56OLLBYD5Q",
    "timestamp": "2018-04-22 19:39:55.170000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Jason Bourne",
    "average_rating": 4.7,
    "rating_number": 14108,
    "features": [],
    "description": [
      "Matt Damon returns to his most iconic role in Jason Bourne. Paul Greengrass, the director of The Bourne Supremacy and The Bourne Ultimatum, once again joins Damon for the next chapter of Universal Pictures' Bourne franchise, which finds the CIA's most lethal operative drawn out of the shadows. Damon is joined by Alicia Vikander, Vincent Cassel and Tommy Lee Jones, while Julia Stiles reprises her role in the series.",
      "Bonus Content:",
      "Bringing Back Bourne",
      "Bringing Back Bourne",
      "Bourne To Fight",
      "Bourne To Fight",
      "The Athens Escape",
      "The Athens Escape",
      "Las Vegas Showdown",
      "Las Vegas Showdown",
      "]]>"
    ],
    "price": 5.99,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/41rihPprdLL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41rihPprdLL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/71AyG3Pm3VL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/512Pb9-6gfL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/512Pb9-6gfL.jpg",
        "variant": "FRNT",
        "hi_res": "https://m.media-amazon.com/images/I/714kDpOH2AL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/61F2Ds7sa0L._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/61F2Ds7sa0L.jpg",
        "variant": "BACK",
        "hi_res": "https://m.media-amazon.com/images/I/91LBpg7IoHL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Y6AdqigPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Y6AdqigPL.jpg",
        "variant": "PT01",
        "hi_res": "https://m.media-amazon.com/images/I/91GoWRII+KL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/51IrGkSlynL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51IrGkSlynL.jpg",
        "variant": "PT02",
        "hi_res": "https://m.media-amazon.com/images/I/9113-rfQ0IL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/415srQ9GkyL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/415srQ9GkyL.jpg",
        "variant": "PT03",
        "hi_res": "https://m.media-amazon.com/images/I/91eZZxwRddL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41Ko93aSQPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41Ko93aSQPL.jpg",
        "variant": "PT04",
        "hi_res": "https://m.media-amazon.com/images/I/81H2Igwys7L._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/411e4LYr-JL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/411e4LYr-JL.jpg",
        "variant": "PT05",
        "hi_res": "https://m.media-amazon.com/images/I/81DOYDA5GxL._SL1500_.jpg"
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/41wXnXmzrzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/41wXnXmzrzL.jpg",
        "variant": "PT06",
        "hi_res": null
      },
      {
        "thumb": "https://m.media-amazon.com/images/I/21USVmZu1pL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/21USVmZu1pL.jpg",
        "variant": "PT07",
        "hi_res": "https://m.media-amazon.com/images/I/71SSBeSTm0L._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Damon, Matt  (Actor),     Lee Jones, Tommy  (Actor),     Paul Greengrass  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD",
    "categories": [
      "Movies & TV",
      "Genre for Featured Categories",
      "Action & Adventure"
    ],
    "details": {
      "Aspect Ratio": "2.40:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "PG-13 (Parents Strongly Cautioned)",
      "Product Dimensions": "0.7 x 7.5 x 5.4 inches; 2.72 Ounces",
      "Item model number": "43379923",
      "Director": "Paul Greengrass",
      "Media Format": "NTSC, Subtitled",
      "Run time": "2 hours and 4 minutes",
      "Release date": "December 6, 2016",
      "Actors": "Damon, Matt, Lee Jones, Tommy, Vikander, Alicia, Cassel, Vincent, Stiles, Julia",
      "Subtitles": "Spanish, French",
      "Language": "English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS:X Master Audio), French (DTS:X Master Audio), Spanish (DTS:X Master Audio)",
      "Studio": "Universal Pictures Home Entertainment",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}