{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Hurt Locker\nReview Date: 2013/01/14\nStore: Jeremy Renner  (Actor),     Anthony Mackie  (Actor),     Kathryn Bigelow  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['War is a drug. Nobody knows that better than Staff Sergeant James, head of elite squad of soldiers tasked with disarming bombs in the heat of combat. To do this nerve-shredding job, it\\'s not enough to be the best: you have to thrive in a zone where the margin of error is zero, think as diabolically as a bomb-maker, and somehow survive with your body and soul intact. Powerfully realistic, action-packed, unrelenting and intense, The Hurt Locker has been hailed by critics as \"an adrenaline-soaked tour de force\" (A.O. Scott, The New York Times) and \"one of the great war movies.\" (Richard Corliss, Time)']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Evangeline Lilly, Christian Camargo, David Morse, Kathryn Bigelow, Jeremy Renner, Guy Pearce, Anthony Mackie, Brian Geraghty, Ralph FiennesEvangeline Lilly, Christian Camargo, David Morse, Kathryn Bigelow, Jeremy Renner, Guy Pearce, Anthony Mackie, Brian Geraghty, Ralph Fiennes   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.64 x 5.44 x 7.57 inches; 0.8 Ounces', 'Item model number': '000092183', 'Director': 'Kathryn Bigelow', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'January 12, 2010', 'Actors': 'Jeremy Renner, Anthony Mackie, Brian Geraghty, Ralph Fiennes, Guy Pearce', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Summit Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I have more family in the military than I know what to do with. One of which was an IED for years. So this movie really hit home with me. It's hard to watch at times, but it's very well written, directed and played out. This is why I plan on getting a degree in psychology. I've been listening to stories like this my whole life. I guarantee every actor & crew member on this movie has some degree of PTSD.\nReview Title: Interesting\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Unusuals: The Complete Series\nAmber Tamblyn  (Actor),     Jeremy Renner  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Amber Tamblyn (TV’s “Joan of Arcadia”) and Jeremy Renner (THE HURT LOCKER) star as Detective Casey Shraeger and Detective Jason Walsh in this dark and gritty series that explores both the grounded drama and comic insanity of the world of New York City police detectives. Together, the two must investigate the murder of a cop, unraveling the conflicting clues that they hope will lead to the killer and ultimately reveal the truth behind the dead cop’s past. Also stars Harold Perrineau (TV’s“Lost”) as Detective Banks and Adam Goldberg (TV’s“Entourage”) as Detective Delahoy.', 'Amazon.com', 'Stills from', 'The Unusuals', '(Click for larger image)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, NTSC, Widescreen', 'Contributor': 'Monique Curnen, Terry Kinney, Jeremy Renner, Kai Lennox, Harold Perrineau, Adam Goldberg, Joshua Close, Amber TamblynMonique Curnen, Terry Kinney, Jeremy Renner, Kai Lennox, Harold Perrineau, Adam Goldberg, Joshua Close, Amber Tamblyn  See more', 'Language': 'Unqualified (DTS ES 6.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.18 Ounces', 'Media Format': 'Multiple Formats, NTSC, Widescreen', 'Run time': '7 hours and 12 minutes', 'Release date': 'April 6, 2010', 'Actors': 'Amber Tamblyn, Jeremy Renner, Harold Perrineau, Adam Goldberg, Terry Kinney', 'Studio': 'Sony Pictures', 'Number of discs': '2'}\nI had heard of this series when it came out, but I never got to watch it. There's a bunch of hilarious irony & smart-aleck comments to make you think this group of detectives have been together for a long time. They make this work. The one piece I found to be quite ironic & funny was in the pilot episode, Jeremy Renner's character made a smart-aleck comment to a lady that &#34;this isn't a Bourne movie,&#34; then a few years later he starred in &#34;The Bourne Legacy.&#34;\nSeries is hilarious\nThe Town\nBen Affleck  (Actor, Director),     Rebecca Hall  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Ben Affleck follows his acclaimed', 'Gone Baby Gone', 'directorial debut by directing, co-writing and starring in a taut thriller about robbers and cops, friendship and betrayal, love and hope and escaping a past that has no future. He plays Doug MacRay, leader of a Boston bank robber gang but not cut from the same cloth as his fellow thieves. When Doug falls into a passionate romance with the bank manager (Rebecca Hall) briefly taken hostage in their last heist, he wants out of this life and out of the town. As the Feds close in and the crew questions his loyalty, he has one of two choices: betray his friends or lose the woman he loves.', 'Amazon.com', 'Ben Affleck worked triple-time on', 'The Town', \", in which he directs, stars, and co-adapts Chuck Hogan's\", 'Prince of Thieves', \". Affleck's Doug MacRay comes from a line of Boston bank robbers. With his father (Chris Cooper) behind bars, he spent most of his childhood in Charlestown with loyal hothead Jem (\", 'The Hurt Locker', \"'s Jeremy Renner). Doug had a chance to go legit as a pro hockey player, but he threw it away on drugs and bad behavior. After the armed robbery that opens the film, Jem becomes convinced that bank manager Claire (\", 'Vicki Cristina Barcelona', \"'s Rebecca Hall) saw something, so Doug, who wore a disguise at the time, sets out to make sure she doesn't tell FBI agent Frawley (\", 'Mad Men', \"'s Jon Hamm) anything incriminating (Titus Welliver plays Frawley's partner). Doug starts by asking Claire out, and finds she's more shaken than stirred--and that he likes her better than Jem's oxy-addicted sister, Krista (\", 'Gossip Girl', \"'s Blake Lively), his sometime girlfriend. Unfortunately, neither Jem nor vicious enforcer Fergie (Pete Postlethwaite) will cut him loose until he orchestrates two more scores--the last to take place at Fenway Park. If\", 'The Town', \"offers fewer surprises than Affleck's directorial debut,\", 'Gone Baby Gone', ', he raises the stakes with well-planned heists, nerve-jangling car chases, and deadly shootouts. Though Affleck looks too clean-cut to portray a thug, he gives a nicely understated performance, while Hall proves an inspired choice as a woman who could make a bad guy turn good--or die trying.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Drama/Love & Romance, Mystery & Suspense/Thrillers, Action & Adventure/Crime, Mystery & Suspense/CrimeDrama, Drama/Love & Romance, Mystery & Suspense/Thrillers, Action & Adventure/Crime, Mystery & Suspense/Crime  See more', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Chris Cooper, Jon Hamm, Titus Welliver, Jeremy Renner, Rebecca Hall, Slaine, Blake Lively, Pete Postlethwaite, Ben AffleckChris Cooper, Jon Hamm, Titus Welliver, Jeremy Renner, Rebecca Hall, Slaine, Blake Lively, Pete Postlethwaite, Ben Affleck  See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 5 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.57 x 5.26 x 7.6 inches; 2.4 Ounces', 'Item model number': 'WHV1000119682DVD', 'Director': 'Ben Affleck', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 5 minutes', 'Release date': 'December 17, 2010', 'Actors': 'Ben Affleck, Rebecca Hall, Jon Hamm, Jeremy Renner, Blake Lively', 'Subtitles': 'Spanish, English, French', 'Studio': 'Warner Home Video', 'Number of discs': '1'}\nSit down and watch all the way through. It's kinda fast paced, and if you don't pay attention you will miss some stuff.\nGreat movie\nTrouble with the Curve\nRobert Lorenz  (Director),     Amy Adams  (Actor),     Justin Timberlake  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'Trouble With The Curve (DVD)', 'Screen icon and multiple Academy Award® winner Clint Eastwood (Gran Torino, Million Dollar Baby) returns in front of the camera once more for this heartfelt sports dramedy about an aging major league baseball scout on the cusp of retirement. Confronting his own mortality and his failing eyesight, he sets out on an unforgettable road trip to Atlanta to scout a hot high school batting prospect. Along the way, he tries to mend his troubled relationship with his alienated lawyer daughter. Directed by Eastwood\\x92s longtime producing partner, Robert Lorenz, this diamond in the rough dramedy represents another moving return to form for the legendary Eastwood.', ']]>', 'Amazon.com', 'Clint Eastwood has developed a killer changeup during his career, using his iconic status and mainstream credibility to take audiences to some thoughtfully unexpected places. (How the man behind the lyrical', 'Letters from Iwo Jima', 'and', 'A Perfect World', 'can also peel off something like the cheerfully meatheaded', 'The Rookie', 'is one of the most enjoyable mysteries in Hollywood.) The biggest surprise behind', 'Trouble with the Curve', \", Eastwood's first time in front of the camera since\", 'Gran Torino', \"(and his first appearance in a film he hasn't directed since 1993's\", 'In the Line of Fire', \"), is how resolutely unsurprising it is, telling its story with an unfashionably retro simplicity. Still, even if the resolution is easily guessed, the star's trademark glower and a stellar supporting cast make it an exceedingly pleasant journey. Pulling a 180 from the methods espoused in\", 'Moneyball', \", Randy Brown's script follows Gus (Eastwood), a cantankerous talent scout for the Atlanta Braves whose old-school ethics are on the outs. While on what may be his last recruiting trip, Gus is reunited with his estranged daughter (Amy Adams), an upwardly mobile attorney still smarting from her father's distancing techniques. First-time director Robert Lorenz wisely places his actors front and center, with the sparkling Adams, Justin Timberlake, Matthew Lillard, and the great John Goodman all delivering terrifically tuned performances. Ultimately, though,\", 'Trouble with the Curve', \"rises and falls with Eastwood, who keeps the material from drifting into cornball territory by sheer force of will. Squinting balefully at even the most minor annoyance, and rasping out a succession of mildly profane wisecracks, he generates more than enough star power to keep the film on track. If he hasn't earned the right to coast occasionally, then for Pete's sake, who has? --\", 'Andrew Wright']\n{'Genre': 'Drama, Sports', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Michele Weisler, Amy Adams, Matthew Lillard, Robert Patrick, Joe Massingill, Justin Timberlake, Clint Eastwood, Tim Moore, Randy Brown, John Goodman, Robert LorenzMichele Weisler, Amy Adams, Matthew Lillard, Robert Patrick, Joe Massingill, Justin Timberlake, Clint Eastwood, Tim Moore, Randy Brown, John Goodman, Robert Lorenz   See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Runtime': '1 hour and 51 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '1000300900', 'Director': 'Robert Lorenz', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '1 hour and 51 minutes', 'Release date': 'December 18, 2012', 'Actors': 'Clint Eastwood, Amy Adams, Justin Timberlake, John Goodman, Matthew Lillard', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Tim Moore, Clint Eastwood, Michele Weisler', 'Studio': 'WarnerBrothers', 'Writers': 'Randy Brown', 'Number of discs': '1'}\nI love baseball (especially the Braves), so I thoroughly enjoyed this movie. I recommend it to any baseball fan anywhere. The casting is wonderful - Clint Eastwood, Amy Adams, Justin Timberlake, John Goodman, Matthew Lillard... You simply can't go wrong!\nLOVE THIS MOVIE!!\nThe Hurt Locker\nJeremy Renner  (Actor),     Anthony Mackie  (Actor),     Kathryn Bigelow  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['War is a drug. Nobody knows that better than Staff Sergeant James, head of elite squad of soldiers tasked with disarming bombs in the heat of combat. To do this nerve-shredding job, it\\'s not enough to be the best: you have to thrive in a zone where the margin of error is zero, think as diabolically as a bomb-maker, and somehow survive with your body and soul intact. Powerfully realistic, action-packed, unrelenting and intense, The Hurt Locker has been hailed by critics as \"an adrenaline-soaked tour de force\" (A.O. Scott, The New York Times) and \"one of the great war movies.\" (Richard Corliss, Time)']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Evangeline Lilly, Christian Camargo, David Morse, Kathryn Bigelow, Jeremy Renner, Guy Pearce, Anthony Mackie, Brian Geraghty, Ralph FiennesEvangeline Lilly, Christian Camargo, David Morse, Kathryn Bigelow, Jeremy Renner, Guy Pearce, Anthony Mackie, Brian Geraghty, Ralph Fiennes   See more', 'Language': 'Unqualified', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.64 x 5.44 x 7.57 inches; 0.8 Ounces', 'Item model number': '000092183', 'Director': 'Kathryn Bigelow', 'Media Format': 'Multiple Formats, Color, Dolby, AC-3, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'January 12, 2010', 'Actors': 'Jeremy Renner, Anthony Mackie, Brian Geraghty, Ralph Fiennes, Guy Pearce', 'Dubbed': 'Spanish', 'Subtitles': 'English', 'Studio': 'Summit Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI have more family in the military than I know what to do with. One of which was an IED for years. So this movie really hit home with me. It's hard to watch at times, but it's very well written, directed and played out. This is why I plan on getting a degree in psychology. I've been listening to stories like this my whole life. I guarantee every actor & crew member on this movie has some degree of PTSD.\nInteresting",
  "profile": "The user has a strong affinity for gritty dramas that artfully blend humor with themes of police work, detective narratives, and character-driven stories. Their appreciation for clever writing, irony, and witty banter aligns with their engagement in narratives centered around crime, friendship, and personal redemption, particularly those marked by intense plotlines and emotional depth. \n\nRecently, they have expanded their interests to include heartfelt sports-themed dramas, underscoring a broader appreciation for stories that explore human relationships and emotional complexities. This aligns with their previous patterns of valuing strong character arcs and dramatic tension, as they continue to seek narratives that resonate with themes of loyalty, love, and moral dilemmas.\n\nTheir latest interaction reveals a personal connection to stories involving military and trauma, indicating the user’s interest in narratives that deal with intense, real-life experiences and psychological themes. They express enthusiasm for high-rated content and are likely to endorse works with unique storytelling elements and standout performances. Overall, the user's preferences reflect a desire for complexity in storytelling, emotionally engaging experiences that provoke thought, and authentic character journeys, whether through the lens of sports, war, or other dramatic narratives.",
  "metrics": {
    "rouge1_f": 0.08824895494658616,
    "rouge2_f": 0.004649000464900046,
    "rougeL_f": 0.04366000928936368,
    "meteor": 0.02639270050978896,
    "bleu1": 3.6050071694033425e-06,
    "bleu2": 1.3789106988888271e-06,
    "bleu3": 1.886778077421676e-07,
    "bleu4": 6.987459975951001e-08,
    "bertscore_precision": 0.32354068756103516,
    "bertscore_recall": 0.48771363496780396,
    "bertscore_f1": 0.3890153765678406
  }
}