{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Herbs Botanica Alum Powder Alumbre Potassium Alum Fitkari Fatkari for Skin. Keeping Flower Fresh, Canker Sores | 100% Natural and Original No Added Color or Chemical |150 GMS / 5.30 oz\nReview Date: 2022/11/04\nStore: Herbs Botanica\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Herbs Botanica', 'Item Form': 'Powder', 'Unit Count': '3.5 Ounce', 'Flavor': 'Unflavored', 'Number of Items': '1', 'Product Dimensions': '8.74 x 5.75 x 1.34 inches; 5.93 Ounces', 'Manufacturer': 'Sai Expo Mart'}\nReview Text: Alum is a staple to have around the house. It helps to remedy so many things. Cute, canker sores, etc. This is a great product at an even better price for the amount that you receive.\nReview Title: Great value, great product\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Hairro Curly Ponytail Drawstring 18 Inch #12 Light Brown\nHairro\n{'Material': 'Synthetic', 'Hair Type': 'Wavy, Curly, Coily', 'Style': 'Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'Hairro', 'Package Dimensions': '12.4 x 8.03 x 1.69 inches; 5.61 Ounces'}\nIt’s not great, but I also guess it’s not horrible. It tangles easily and the combs don’t really have a purpose and pokes you in the scalp. It’s extremely heavy, & definitely has a synthetic look to it. But maybe add some baby powder or dry shampoo to get rid of the shine?\nYou get what you pay for.\nEveryday Beauty Age-Defying Eye Cream to Minimize Dark Circles, Discoloration, and Puffiness, Anti-Aging Eye Cream with Squalene and Hyaluronic Acid, 0.5 oz. Jar\nEveryday Beauty\n{'Brand': 'Everyday Beauty', 'Active Ingredients': 'Hyaluronic acid', 'Number of Items': '1', 'Item Volume': '0.5 Fluid Ounces', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.56 x 2.56 x 1.65 inches; 3.53 Ounces', 'UPC': '700463002367', 'Manufacturer': 'Cosmetic Solutions, LLC'}\nUpon opening up this jar, liquid immediately spilled out. Once I looked inside there was what appeared to be be a huge clump of jelly like substance. I won’t be using this.\nExpired?\nCelleanser Vegan Clean Serum100% Vegan Ingredients Quick Relief and Repair Hypoallergic Tested Hydrating Panthenol Silky Texture Made in Korea 30ml 1.01 fl. oz.\nCelleanser\n{'Package Dimensions': '5.83 x 1.26 x 1.26 inches; 2.89 Ounces'}\nSimple, clean, scentless serum. This is sensitive skin approved.\nSensitive skin approved\nMilyBest Fluffy Lashes False Eyelashes Natural Look Cat Eye Lashes, Dramatic Faux Mink Lashes 3D Effect 18mm D Curl Volume Extension Reusable Wispy Lashes Pack 10 Pairs\nMilyBest\n{'Color': 'B-Sweet Date | 18MM', 'Brand': 'MilyBest', 'Material': 'Faux Mink, Plastic, Cotton', 'Item Dimensions LxWxH': '7.44 x 4.02 x 0.69 inches', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '7.44 x 4.02 x 0.69 inches; 0.32 Ounces', 'Item model number': 'QC10-T02', 'Manufacturer': 'MilyBest', 'Country of Origin': 'China'}\nThese are innovative…but I found that when I used them I needed to add a set of my cluster lashes to the inner corners of the eye to make it look right.\nClose but no cigar\nBAR;SOO - Natural boar bristle paddle cushion hair brush for Thick Curly Thin Long Short hair, Detangle all types of hair, Hair loss prevention, Naturally glossy Hair (Purple/violet)\nBAR;SOO\n{'Brand': 'BAR;SOO', 'Color': 'Purple,Violet', 'Shape': 'Oblong', 'Handle Material': 'Nylon', 'Special Feature': 'Detangling', 'Package Dimensions': '10.83 x 5.59 x 2.01 inches; 6.38 Ounces', 'Country of Origin': 'Korea, Republic of'}\nPresentation is a 10/10. This was package with so much thought and care. The quality of the brush is also amazing.\nImpeccable packaging\nBLAISTER Headbands for Women knotted Head Bands Fashion Boho Hair Bands Hair Hoops Women Headbands Hair Accessories 4 Pcs (knot colourful)\nBLAISTER\n{'Age Range (Description)': 'Adult', 'Material': 'Plastic', 'Number of Items': '4', 'Brand': 'BLAISTER', 'Unit Count': '1.00 Count', 'Package Dimensions': '5.9 x 4.9 x 2.2 inches; 8.01 Ounces', 'UPC': '614614988069'}\nThese are super cute and great quality. I am happy with this purchase. 10/10 recommend!!!\nSuper cute\nShower Cap for Women Reusable Long Hair Double Waterproof Large Shower Hair Hat Adjustable (11 inches, Braids Black, Bowknot)\nWhaleLife\n{'Brand': 'WhaleLife', 'Material': 'Elastic', 'Age Range (Description)': 'Adult', 'Pattern': 'Solid', 'Number of Items': '2', 'Package Dimensions': '5.94 x 4.72 x 1.1 inches; 3.21 Ounces', 'UPC': '759263505226'}\nComfortable, durable, and water resistant. I like how stylish these are as well. Only con is that they’re a little snug. If you have a lot of hair these more than likely won’t work very well for you.\nstylish\nHerbs Botanica Alum Powder Alumbre Potassium Alum Fitkari Fatkari for Skin. Keeping Flower Fresh, Canker Sores | 100% Natural and Original No Added Color or Chemical |150 GMS / 5.30 oz\nHerbs Botanica\n{'Brand': 'Herbs Botanica', 'Item Form': 'Powder', 'Unit Count': '3.5 Ounce', 'Flavor': 'Unflavored', 'Number of Items': '1', 'Product Dimensions': '8.74 x 5.75 x 1.34 inches; 5.93 Ounces', 'Manufacturer': 'Sai Expo Mart'}\nAlum is a staple to have around the house. It helps to remedy so many things. Cute, canker sores, etc. This is a great product at an even better price for the amount that you receive.\nGreat value, great product",
  "profile": "**User Profile Summary:**\n\n- **Hair Care Preferences:** The user continues to focus on curly hairstyles, seeking products that enhance natural curl patterns while appreciating stylish, functional hair accessories that blend practicality with aesthetics.\n\n- **Material Sensitivity:** A preference for heat-resistant and quality materials remains strong, with sensitivity to synthetic materials influencing their choice of beauty accessories and hair care tools.\n\n- **Product Quality Expectation:** The user maintains a discerning attitude toward product quality, valuing effective formulations at reasonable prices. Their recent positive review of a household item highlights their growing appreciation for well-crafted products that deliver both utility and quality.\n\n- **Practical Usage Insights:** Practicality is paramount, as evidenced by their enthusiasm for functional yet stylish accessories. The user values weight, comfort, and ease of maintenance in their purchases, reflecting a preference for innovative solutions that enhance both usability and appearance.\n\n- **Overall Satisfaction:** An evolving appreciation for style without sacrificing comfort or quality is evident, as the user has shifted from low ratings for aesthetic products to more positive experiences. This trend underscores their advocacy for practical solutions that enrich their beauty and daily routines while appreciating the value in quality home essentials that contribute to overall satisfaction.",
  "metrics": {
    "rouge1_f": 0.17868675995694294,
    "rouge2_f": 0.004314994606256743,
    "rougeL_f": 0.0688912809472551,
    "meteor": 0.05926108509884881,
    "bleu1": 0.013850799907803734,
    "bleu2": 0.0031633263563400453,
    "bleu3": 0.0005661599404048892,
    "bleu4": 0.0002397632371565354,
    "bertscore_precision": 0.343727171421051,
    "bertscore_recall": 0.440980464220047,
    "bertscore_f1": 0.38632720708847046
  }
}