{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Lookatool Pro Makeup Cosmetic Brushes Powder Foundation Eyeshadow Contour Brush Tool\nReview Date: 2017/09/04\nAverage Rating: 3.4\nProduct Details: {}\nReview Text: Great for highlighting\nReview Title: Love these\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "12 Classic Color Elegant Blush Set\nEMORI\n['Classic 12 color blush kit, comes in 2 blush set. Each set is around 5 inch in length and 4 inch in width. This blush set is all you need to bring out the best look. Perfect for everyday use.']\n{'Brand': 'EMORI', 'Skin Tone': 'All', 'Unit Count': '1 count', 'Number of Items': '2', 'Style': 'Compact', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.88 x 4.09 x 1.1 inches; 3.99 Ounces'}\nThis is good quality makeup... My only dislike of the palettes is that there are more orange and peach like colors.. If you like them... Then this would be a good palette for you.. I really like more pinky colors but it is a good  palette.\nGood peachy colors\nNEW 2015 KISS imPRESS \"BIG FLIRT\" Short Length by Broadway Press-On Manicure Nails\nimPRESS\n{'Size': '1 Count (Pack of 1)', 'Brand': 'ImPRESS', 'Style': 'French', 'Pattern': 'Solid', 'Coverage': 'Full Well Tips', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.84 x 1.85 x 0.94 inches; 0.67 Ounces', 'Item model number': 'Kiss'}\nAnd they look great\nFun to use\nMakeup Geek Eyeshadow Pan - Peach Smoothie\nMakeup Geek\n{'Brand': 'Makeup Geek', 'Special Feature': 'Travel size, Matte', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Skin Type': 'All'}\nThis is a truly all over good color... Definitely recommend.  I love their foiled shadows. If you havnt tried them you must.\nLove love love makeup geeks shadows escpecially the foiled ones\nJosie Maran Argan Enlightenment Illuminizer - Hydrate and Smooth Skin with this Creamy Highlighting Concentrate (15ml/0.5oz)\nJosie Maran\n{'Item Form': 'Liquid', 'Coverage': 'Light, Full', 'Brand': 'Josie Maran', 'Skin Tone': 'All', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.8 x 1.25 x 1.25 inches; 1.6 Ounces', 'UPC': '755332565863 787734629850 737003482242 879634008467'}\nThis is good to add to your foundation to darken it or to lighten your skin. It also is cey moisturizing ..\nLike adding to foundation\nLookatool Pro Makeup Cosmetic Brushes Powder Foundation Eyeshadow Contour Brush Tool\n{}\nGreat for highlighting\nLove these",
  "profile": "**User Summary:**\n\n- **Makeup Preference:** The user continues to engage deeply with makeup, with a strong focus on blush products and versatile eyeshadows. Their recent foray into highlighters and now makeup brushes indicates a desire to refine their application techniques and enhance their overall complexion and makeup routine. Nail care remains an essential part of their beauty regimen.\n\n- **Color Inclination:** They consistently favor pink shades in their beauty selections, complemented by neutral tones that allow for seamless integration into various looks. This color preference enhances their aesthetic appeal.\n\n- **Quality Concern:** The user maintains a high standard for cosmetic quality, as evidenced by their thoughtful feedback on product performance. They seek effective and reliable products that align with their discerning taste.\n\n- **Versatility:** The user appreciates multifunctional products that cater to everyday beauty needs, demonstrating a practical and adaptable approach to their makeup application.\n\n- **Store Preference:** They remain loyal to select beauty brands, indicating a structured shopping strategy that includes both cosmetic and nail products.\n\n- **Review Behavior:** The user actively shares insights on their experiences with various beauty items, offering critical yet appreciative feedback. Their recent interaction highlights their interest in tools that enhance makeup application, revealing a commitment to improving their beauty techniques.\n\nOverall, the user emphasizes quality, versatility, and aesthetic appeal, consistently choosing products that reflect their preferences and elevate their beauty routine.",
  "metrics": {
    "rouge1_f": 0.18150087260034903,
    "rouge2_f": 0.0,
    "rougeL_f": 0.07329842931937172,
    "meteor": 0.08453085376162299,
    "bleu1": 0.10137589115870464,
    "bleu2": 0.013110511817843356,
    "bleu3": 0.0030809889456619144,
    "bleu4": 0.001494886993038338,
    "bertscore_precision": 0.36203813552856445,
    "bertscore_recall": 0.4327560365200043,
    "bertscore_f1": 0.3942509591579437
  }
}