{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: AILIBOTE Samsung Galaxy S10e Screen Protector, [3 Pack] 9H Hardness Anti-Scratch Full Coverage Tempered Glass Screen Protector Film for Samsung73\nReview Date: 2019/03/01\nStore: Ben Nye\nAverage Rating: 4.6\nProduct Details: {'Brand': 'Ben Nye', 'Item Form': 'Powder', 'Coverage': 'Full', 'Item Weight': '0.2 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.7 x 2.6 x 1.5 inches; 3.2 Ounces', 'UPC': '665760873785'}\nReview Text: I have pink undertones in my skin as opposed to yellow so this balances out my makeup . If it’s too light it darkens it . If it’s too dark it lightens it . I would like it if it wasn’t so dry or maybe if they would add some dimethacone to it to make it more moist . My skin is dry and I always have to set the makeup with a spray to moisten it back after the foundation and powder is on ..  love it and it’s inexpensive\nReview Title: My favorite color . Been using it for a long time\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "12 Classic Color Elegant Blush Set\nEMORI\n['Classic 12 color blush kit, comes in 2 blush set. Each set is around 5 inch in length and 4 inch in width. This blush set is all you need to bring out the best look. Perfect for everyday use.']\n{'Brand': 'EMORI', 'Skin Tone': 'All', 'Unit Count': '1 count', 'Number of Items': '2', 'Style': 'Compact', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.88 x 4.09 x 1.1 inches; 3.99 Ounces'}\nThis is good quality makeup... My only dislike of the palettes is that there are more orange and peach like colors.. If you like them... Then this would be a good palette for you.. I really like more pinky colors but it is a good  palette.\nGood peachy colors\nNEW 2015 KISS imPRESS \"BIG FLIRT\" Short Length by Broadway Press-On Manicure Nails\nimPRESS\n{'Size': '1 Count (Pack of 1)', 'Brand': 'ImPRESS', 'Style': 'French', 'Pattern': 'Solid', 'Coverage': 'Full Well Tips', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.84 x 1.85 x 0.94 inches; 0.67 Ounces', 'Item model number': 'Kiss'}\nAnd they look great\nFun to use\nMakeup Geek Eyeshadow Pan - Peach Smoothie\nMakeup Geek\n{'Brand': 'Makeup Geek', 'Special Feature': 'Travel size, Matte', 'Number of Items': '1', 'Unit Count': '1.00 Count', 'Skin Type': 'All'}\nThis is a truly all over good color... Definitely recommend.  I love their foiled shadows. If you havnt tried them you must.\nLove love love makeup geeks shadows escpecially the foiled ones\nJosie Maran Argan Enlightenment Illuminizer - Hydrate and Smooth Skin with this Creamy Highlighting Concentrate (15ml/0.5oz)\nJosie Maran\n{'Item Form': 'Liquid', 'Coverage': 'Light, Full', 'Brand': 'Josie Maran', 'Skin Tone': 'All', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.8 x 1.25 x 1.25 inches; 1.6 Ounces', 'UPC': '755332565863 787734629850 737003482242 879634008467'}\nThis is good to add to your foundation to darken it or to lighten your skin. It also is cey moisturizing ..\nLike adding to foundation\nLookatool Pro Makeup Cosmetic Brushes Powder Foundation Eyeshadow Contour Brush Tool\n{}\nGreat for highlighting\nLove these\nVERA MONA Color Switch®\nVERA MONA\n{'Color': 'Purple', 'Brand': 'VERA MONA', 'Item Form': 'foam', 'Product Benefits': 'Removes pigment instantly from any brush', 'Number of Items': '1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 1 x 3 inches; 1.5 Ounces', 'Item model number': '863151000011', 'UPC': '863151000011 784179713892 755332626700', 'Manufacturer': 'Vera Mona', 'Country of Origin': 'China'}\nAnd is extremely handy\nThis works\nBoo-Boo Cover-Up Healing Concealer, Medium, 0.13 Ounce\nBoo-Boo Cover-Up\n['Have a Boo-Boo on the Go? Skip the bandage and the shiny ointment. Look your best even while you heal with Baby Boo-Boo Cover-Up for the Face and Body. Our innovative formula offers great coverage for skin imperfections while containing ingredients known in nature to promote healing. Contains aloe, chamomile, green tea, tea tree oil and vitamin E Net Weight 0.13 oz / 4 mL']\n{'Item Form': 'Cream', 'Color': 'Medium', 'Package Information': 'Bottle', 'Brand': 'Boo-Boo Cover-Up', 'Coverage': 'Medium', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '3.5 x 2 x 1 inches; 0.8 Ounces', 'UPC': '723175846012'}\ni love the creaminess  of this product  i had originally got it as a highlighter it was a little bit too light for my skin so i ordered the medium which i have used before. i think i got it some time ago in an tipsy bag and wanted to get one again ever since just got my new one in the mail today, it works great for the undereye  area if you get tired from working so hard. my best and hope you enjoy. get the light if you are truly fair\nthis shade was a little too light for me but great coverage\nAILIBOTE Samsung Galaxy S10e Screen Protector, [3 Pack] 9H Hardness Anti-Scratch Full Coverage Tempered Glass Screen Protector Film for Samsung73\nBen Nye\n{'Brand': 'Ben Nye', 'Item Form': 'Powder', 'Coverage': 'Full', 'Item Weight': '0.2 Pounds', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '2.7 x 2.6 x 1.5 inches; 3.2 Ounces', 'UPC': '665760873785'}\nI have pink undertones in my skin as opposed to yellow so this balances out my makeup . If it’s too light it darkens it . If it’s too dark it lightens it . I would like it if it wasn’t so dry or maybe if they would add some dimethacone to it to make it more moist . My skin is dry and I always have to set the makeup with a spray to moisten it back after the foundation and powder is on ..  love it and it’s inexpensive\nMy favorite color . Been using it for a long time",
  "profile": "**User Summary:**\n\nThe user continues to demonstrate a strong engagement with makeup, notably favoring blush products, versatile eyeshadows, and effective concealers. Their recent purchase highlights a long-term preference for products that cater to their unique skin undertones, particularly pink. This ongoing focus on achieving the perfect balance in their makeup routine reflects their commitment to enhancing both beauty and skin wellness.\n\nAdditionally, the user has expressed a desire for products that offer improved hydration, indicating a need to address concerns related to dry skin. This preference further emphasizes their diligent approach to refining their beauty techniques, particularly the importance of moisturizing elements in makeup. Their thoughtful reviews underscore a preference for value, seeking reliable products that deliver great performance while remaining budget-friendly.\n\nNail care continues to be a vital aspect of their personal grooming regimen, reinforcing their holistic approach to beauty. The user remains loyal to specific brands, demonstrating a structured shopping strategy that includes a focus on quality and multifunctionality.\n\nThey actively share insights about their beauty experiences, providing constructive feedback while maintaining emphasis on versatility and aesthetic appeal. The user's preferences consistently align with reliable products that enhance their overall grooming routine, making them a discerning customer who prioritizes both effectiveness and skin benefits.",
  "metrics": {
    "rouge1_f": 0.16383616383616384,
    "rouge2_f": 0.006006006006006006,
    "rougeL_f": 0.06593406593406594,
    "meteor": 0.0532023736443626,
    "bleu1": 0.010395367159926946,
    "bleu2": 0.002556911857669223,
    "bleu3": 0.0004354855099828978,
    "bleu4": 0.0001799167868700597,
    "bertscore_precision": 0.32159432768821716,
    "bertscore_recall": 0.4389447569847107,
    "bertscore_f1": 0.3712160289287567
  }
}