{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dr. McDougall's Total Health Solution for the 21st Century\nReview Date: 2010/01/16\nStore: Dr. John McDougall  (Actor, Director),     Mary McDougall  (Actor)    Rated:    G    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Special Interests\nProduct Description: [\"Discover a dietary program that is right from all viewpoints: it prevents illnesses, reverses diseases, causes you to lose the right amount of weight without ever being hungry, helps you avoid infectious diseases, conserves our natural resources and is kind to animals. Plus can reduce your food bill by as much as 40%. Dr. McDougall's Total Health Solution for the 21st Century presents information on how to plan successful meals that result in your optimal health. This program is effective in treating and/or preventing a host of common health ailments that include allergies, arthritis, diabetes, heart attacks, hypertension, gastritis, polyps, and ulcers. Dr. John McDougall is a board-certified internist and the author of ten national best-selling books. Mary McDougall is a nurse, co-author of 9 national best-sellers, and creator of over 2500 healthy recipes.\"]\nAverage Rating: 4.7\nProduct Details: {'Format': 'Dolby, NTSC', 'Contributor': 'Mary McDougall, Dr. John McDougall', 'Runtime': '5 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Dr. John McDougall', 'Media Format': 'Dolby, NTSC', 'Run time': '5 hours', 'Release date': 'June 6, 2003', 'Actors': 'Dr. John McDougall, Mary McDougall', 'Studio': 'Self-published', 'Number of discs': '2'}\nReview Text: This is by far the best foundational information for making the change to a healthier diet. Nothing is left untouched. You will learn why you should change, the immediate and long term benefits of making a change and how to make it easier than you might expect. Will you be hungry? NO! Will you feel better. Absolutely! Whether you are trying to regain your health, or prevent unnecessary disease, this will really help you on your way.\nReview Title: Outstanding\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Baron Baptiste's Power Yoga Level 2\nRated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['A great yoga training DVD']\n{'Genre': 'Exercise & Fitness', 'Format': 'NTSC', 'Contributor': 'Baptiste, Baron', 'Language': 'English', 'Publication Date': 'August 5, 2003', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'NTSC', 'Release date': 'August 5, 2003', 'Actors': 'Baptiste, Baron', 'Studio': 'Good Times Video'}\nI purchased this because I had viewed the PBS Journey Into Power program and was intrigued.  The DVD is a Goodtimes production and the first  part of the &quot;program&quot; is a commercial for their other products. You can't just skip to the workout, which I found annoying. The actual practice begins with Baron explaining how yoga will improve your life,etc. Again, you can't skip ahead here, either. When the practice actually starts, it turns out to be a set, with everyone ( all under 25 yrs. and very fit)  in white Danskin yoga-gear.  The music is eighties - ish and as loud as Baron is, so it's distracting. No one appears to be doing any modifications so those just beginning may injure themselves trying to keep up.<br /> If  you're looking for a 'power yoga'  practice that you can grow with, I highly recommend David Swenson's Short Forms tape or DVD (also available at amazon) as the best to begin with. It has three workouts that are suitable for the beginner and the advanced practitioner, and a great guided relaxation. His book is a must have, too. The Flow series, featuring Tracey Rich and Ganga White, is also an excellent production that is beautifully produced, can be tailored to your level and never gets 'old'.\nDifficult to view and practice with.\nPlanet Earth: The Complete BBC Series\nDavid Attenborough  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'Planet Earth: The Complete Collection (DVD)', 'With an unprecedented production budget of $25 million, and from the makers of', 'Blue Planet: Seas of Life', \", comes the epic story of life on Earth. Five years in production, over 2,000 days in the field, using 40 cameramen filming across 200 locations, shot entirely in high definition, this is the ultimate portrait of our planet. A stunning television experience that captures rare action, impossible locations and intimate moments with our planet's best-loved, wildest and most elusive creatures. From the highest mountains to the deepest rivers, this blockbuster series takes you on an unforgettable journey through the daily struggle for survival in Earth's most extreme habitats. Planet Earth takes you to places you have never seen before, to experience sights and sounds you may never experience anywhere else.\", ']]>', 'Amazon.com', 'As of its release in early 2007,', 'Planet Earth', 'is quite simply the greatest nature/wildlife series ever produced. Following the similarly monumental achievement of', 'The Blue Planet: Seas of Life', ', this astonishing 11-part BBC series is brilliantly narrated by Sir David Attenborough and sensibly organized so that each 50-minute episode covers a specific geographical region and/or wildlife habitat (mountains, caves, deserts, shallow seas, seasonal forests, etc.) until the entire planet has been magnificently represented by the most astonishing sights and sounds you\\'ll ever experience from the comforts of home. The premiere episode, \"From Pole to Pole,\" serves as a primer for things to come, placing the entire series in proper context and giving a general overview of what to expect from each individual episode. Without being overtly political, the series maintains a consistent and subtle emphasis on the urgent need for ongoing conservation, best illustrated by the plight of polar bears whose very behavior is changing (to accommodate life-threatening changes in their fast-melting habitat) in the wake of global warming--a phenomenon that this series appropriately presents as scientific fact. With this harsh reality as subtext, the series proceeds to accentuate the positive, delivering a seemingly endless variety of natural wonders, from the spectacular mating displays of New Guinea\\'s various birds of paradise to a rare encounter with Siberia\\'s nearly-extinct Amur Leopards, of which only 30 remain in the wild.', 'That\\'s just a hint of the marvels on display. Accompanied by majestic orchestral scores by George Fenton, every episode is packed with images so beautiful or so forcefully impressive (and so perfectly photographed by the BBC\\'s tenacious high-definition camera crews) that you\\'ll be rendered speechless by the splendor of it all. You\\'ll see a seal struggling to out-maneuver a Great White Shark; swimming macaques in the Ganges delta; massive flocks of snow geese numbering in the hundreds of thousands; an awesome night-vision sequence of lions attacking an elephant; the Colugo (or \"flying lemur\"--not really a lemur!) of the Philippines; a hunting alliance of fish and snakes on Indonesia\\'s magnificent coral reef; the bioluminescent \"vampire squid\" of the deep oceans... these are just a few of countless highlights, masterfully filmed from every conceivable angle, with frequent use of super-slow-motion and amazing motion-controlled time-lapse cinematography, and narrated by Attenborough with his trademark combination of observational wit and informative authority. The result is a hugely entertaining series that doesn\\'t flinch from the predatory realities of nature (death is a constant presence, without being off-putting), and each episode ends with 10-minute \"Planet Earth Diaries\" (exclusive to this DVD set) that cover a specific aspect of production, like \"Diving with Pirahnas\" or \"Into the Abyss\" (the latter showing the rigors of filming the planet\\'s most spectacular caves, including the last filming ever officially permitted in the \"Chandelier Ballroom,\" a crystal-encrusted cavern found over a mile deep in New Mexico\\'s treacherous Lechuguilla, the deepest cave in the continental United States.)', \"With so many of Earth's natural wonders on display, it's only fitting that the final DVD in this five-disc set is devoted to\", 'Planet Earth: The Future', \", a separate three-part series in which a global array of experts is assembled to discuss issues of conservation, protection of delicate ecosystems, and the socio-economic benefits of understanding nature as a commodity that returns trillions of dollars in value at no cost to Earth's human population. At a time when the multiple threats of global warming should be obvious to all, let's give Sir David the last word, from the closing of\", 'Planet Earth', '\\'s final episode: \"We can now destroy or we can cherish--the choice is ours.\"', '--Jeff Shannon', 'Stills from', 'Planet Earth', '(click for larger image)']\n{'Genre': 'Documentary', 'Format': 'Anamorphic, Box set, Closed-captioned, Subtitled', 'Contributor': 'David Attenborough', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7 x 5.5 x 1.25 inches; 14.22 Ounces', 'Item model number': 'E2938', 'Media Format': 'Anamorphic, Box set, Closed-captioned, Subtitled', 'Run time': '2 hours and 30 minutes', 'Release date': 'April 24, 2007', 'Actors': 'David Attenborough', 'Subtitles': 'English, Spanish, French', 'Studio': 'BBC Home Entertainment', 'Number of discs': '5'}\nSometimes - maybe all the time, we humans forget that we're not the only earthlings. And like ants on a counter top, we are unable to take in the diversity and power of the life and geology around us. Planet Earth has taken on the challenge to awaken our senses, treat our eyes and ears and, explode our personal myths of the dominance of \"man\". The production and photography are amongest the best! Stunning, magnificent and breathtaking don't do the film justice. We have been glued to our seats as we've been introduced to animals and plants we've never seen and the familiar are even more amazing thanks to the tireless and often risky business of photography in the wilds. This production will become a classic because every aspect of the film has been carefully thought out - serendipity, not withstanding. You may not need to own this but you must see it.<br /><br />The only reason I didn't give this 5 stars is because the producers just had to gratuitously throw in the most over done wildlife episodes seen on almost every wildlife program - the wildebeast crossing with the crocodiles, the wolf hunt, dog hunt, lion hunt, the shark \"attack\", etc., etc.  These could have been left out as everyone with access to a Tv has probably seen these ad nauseum.\nOne of the best!\nAmerica's Test Kitchen Season 6\nRated:    NR    Format: DVD\nMovies & TV, TV\n['Twenty-six episodes (the complete 6th season) on four discs, Color, Not Rated. America\\'s Test Kitchen is the public television cooking show filmed in the test kitchen of Cook\\'s Illustrated magazine just outside Boston. Watched by more than 2 1/2 million viewers per episode, America\\'s Test Kitchen demonstrates the secrets to foolproof home cooking along with no-nonsense reviews of kitchen equipment and supermarket ingredients. Christian Science Monitor: \"King of its kind on public TV.\"']\n{'Format': 'NTSC', 'Language': 'English', 'Number Of Discs': '4', 'Runtime': '2 hours', 'Publication Date': 'October 10, 2006', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.25 x 1.25 inches; 10.88 Ounces', 'Media Format': 'NTSC', 'Run time': '2 hours', 'Release date': 'October 10, 2006', 'Studio': \"America's Test Kitchen\", 'Number of discs': '4'}\nI borrowed this from the library and liked it so much I bought it. The recipes turn out perfect and the reviews are very helpful. This season covers a lot of classics and comfort food and basic techniques that even a 'well seasoned' cook will learn from. I highly recommend Season 6.\nGreat recipes and techniques\nDr. McDougall's Total Health Solution for the 21st Century\nDr. John McDougall  (Actor, Director),     Mary McDougall  (Actor)    Rated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Special Interests\n[\"Discover a dietary program that is right from all viewpoints: it prevents illnesses, reverses diseases, causes you to lose the right amount of weight without ever being hungry, helps you avoid infectious diseases, conserves our natural resources and is kind to animals. Plus can reduce your food bill by as much as 40%. Dr. McDougall's Total Health Solution for the 21st Century presents information on how to plan successful meals that result in your optimal health. This program is effective in treating and/or preventing a host of common health ailments that include allergies, arthritis, diabetes, heart attacks, hypertension, gastritis, polyps, and ulcers. Dr. John McDougall is a board-certified internist and the author of ten national best-selling books. Mary McDougall is a nurse, co-author of 9 national best-sellers, and creator of over 2500 healthy recipes.\"]\n{'Format': 'Dolby, NTSC', 'Contributor': 'Mary McDougall, Dr. John McDougall', 'Runtime': '5 hours', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Director': 'Dr. John McDougall', 'Media Format': 'Dolby, NTSC', 'Run time': '5 hours', 'Release date': 'June 6, 2003', 'Actors': 'Dr. John McDougall, Mary McDougall', 'Studio': 'Self-published', 'Number of discs': '2'}\nThis is by far the best foundational information for making the change to a healthier diet. Nothing is left untouched. You will learn why you should change, the immediate and long term benefits of making a change and how to make it easier than you might expect. Will you be hungry? NO! Will you feel better. Absolutely! Whether you are trying to regain your health, or prevent unnecessary disease, this will really help you on your way.\nOutstanding",
  "profile": "**User Profile Summary:**\n\n- **Fitness Focus**: User actively engages with yoga and exercise content, particularly power yoga, with interest in both beginner-friendly and advanced practices.\n- **Content Preference**: Prefers DVDs that offer clear instruction and multiple workout options, emphasizing guided relaxation and modifications for various skill levels to prevent injury.\n- **Quality Expectations**: Dislikes poorly structured content that combines promotional material with workouts. Favors high-quality, visually appealing productions tailored to different levels, akin to their appreciation for well-produced documentaries.\n- **Music Sensitivity**: Views distracting music as a negative aspect during workouts, with a strong inclination towards unobtrusive music that complements instructional content.\n- **Documentary Appreciation**: Enjoys nature documentaries featuring stunning visuals and thoughtful commentary on environmental issues, with a preference for fresh content over repetitive themes.\n- **Culinary Interests**: Recently expanded interest in cooking content that emphasizes foolproof techniques and practical kitchen reviews, reflecting their commitment to a healthy lifestyle through diet.\n- **Health Advocacy**: Demonstrates a proactive approach to nutrition by seeking out comprehensive dietary programs that emphasize health benefits and practical meal planning.\n- **Review Behavior**: Shares detailed reviews that highlight both strengths and weaknesses of the content, showing a discerning attitude towards media consumption. Values engaging storytelling and exceptional production quality across genres, including fitness, culinary programming, and health.\n\nIn summary, the user opts for structured, high-quality fitness programming, captivating documentaries, and practical cooking content that collectively enhance their health and wellbeing journey.",
  "metrics": {
    "rouge1_f": 0.11732355637030248,
    "rouge2_f": 0.009174311926605503,
    "rougeL_f": 0.05499541704857929,
    "meteor": 0.038302884647487954,
    "bleu1": 0.0003495432136785492,
    "bleu2": 0.00010905016380621066,
    "bleu3": 1.4615914831358577e-05,
    "bleu4": 5.35526838870725e-06,
    "bertscore_precision": 0.37165260314941406,
    "bertscore_recall": 0.4989202320575714,
    "bertscore_f1": 0.42598390579223633
  }
}