{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: N3 No Name Necessary Pore-Minimizing Mattifying Oil and Shine Control Anti-aging Makeup Face Primer Spray (200ml)\nReview Date: 2019/08/30\nStore: No Name Necessary\nAverage Rating: 3.9\nProduct Details: {'Brand': 'No Name Necessary', 'Skin Type': 'Combination', 'Package Information': 'Bottle', 'Finish Type': 'Matte', 'Specialty': 'Mattifying', 'Product Dimensions': '1.7 x 1.7 x 7.5 inches; 8.78 Ounces'}\nReview Text: I really wanted to love this product and have been using it for a few weeks, before applying my makeup. My skin is oily and I get shiny really quickly. I was excited to try this product because I was hoping it would diminish appearance of pores and keep my makeup on looking matte longer. But with or without this primer my results are about the same. I get shiny within just a couple of hours. I did not notice much result from it at all. It works like a mist - and it’s quite pleasant, makes it easier to apply my makeup, but other than that no promised results.\nReview Title: Did not work on my oily skin\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "BABEYOND Roaring 20s Forehead Band 1920s Bridal Headpiece Vintage Forehead Chain for Wedding Bridesmaid Gatsby Costume Accessories with Gift Box\nBABEYOND\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 7.28 x 3.7 inches; 10.86 Ounces'}\nI got this headpiece as a photography prop and part for my costume for an upcoming masquerade ball. Let me tell  you - this is a headband style crown and absolutely gorgeous! It looks much more expensive, it is sparkley and highly detailed. I love the chain details that go over the forehead. It does not look anywhere like real diamonds - but more like good quality costume piece. My first photoshoot with this crown was a child model portrait session - and it did not disappoint. What I love about it that it is a headband style - it is slightly flexible - so it can fit adult or child head just fine. It does pinch a little if tilted forward, but if worn over the top of the head - it is fine. This can be dressed up many ways - as a princess, flapper, belly dancer and more.. I really love this headpiece and will definitely use it for more creative photoshoots and for my own costume.\nGorgeous! Unique headpiece!\nBlackhead Remover Pore Vacuum Cleaner - Blackhead Vacuum Comedone Extractor Tool Device Comedo Suction Kit Electric Face Nose Blackhead Whitehead Remover with 4 Replaceable Suction Head\ncoppy\n[\"don't buy !!!\"]\n{'Package Dimensions': '6.81 x 3.03 x 1.89 inches; 5.71 Ounces', 'Batteries': '1 Lithium Polymer batteries required. (included)', 'UPC': '705586525663'}\nSo this little devise exceeded my expectations - try this on the back of your hand before trying it on your face. This thing is really powerful even on the mildest setting. You have to keep this moving or it will bruise you! Use it on the lowest setting fits while you getting used to it. Best use on freshly steamed skin. I only using this on my nose since this is so powerful I am concerned I will end up with red lines on my face.\nWhat a powerful little tool!\nN3 No Name Necessary Pore-Minimizing Mattifying Oil and Shine Control Anti-aging Makeup Face Primer Spray (200ml)\nNo Name Necessary\n{'Brand': 'No Name Necessary', 'Skin Type': 'Combination', 'Package Information': 'Bottle', 'Finish Type': 'Matte', 'Specialty': 'Mattifying', 'Product Dimensions': '1.7 x 1.7 x 7.5 inches; 8.78 Ounces'}\nI really wanted to love this product and have been using it for a few weeks, before applying my makeup. My skin is oily and I get shiny really quickly. I was excited to try this product because I was hoping it would diminish appearance of pores and keep my makeup on looking matte longer. But with or without this primer my results are about the same. I get shiny within just a couple of hours. I did not notice much result from it at all. It works like a mist - and it’s quite pleasant, makes it easier to apply my makeup, but other than that no promised results.\nDid not work on my oily skin",
  "profile": "User Profile Summary:\n\n- **Interests**: The user enjoys costuming, photography, and themed events such as masquerade balls and creative photoshoots. Their passion has expanded to include grooming tools that enhance personal care and appearance.\n- **Style Preference**: They have a strong affinity for vintage and glamorous accessories that evoke historical eras, particularly the Roaring 20s, reflecting a love for elegance and uniqueness.\n- **Functionality**: The user seeks versatile fashion items and beauty tools that serve multiple roles, catering to different occasions and age groups.\n- **Quality Awareness**: They prioritize high-quality products with visual appeal and effectiveness at a reasonable price point, valuing both aesthetics and performance.\n- **Comfort Considerations**: Comfort is a key factor in their choices, with attention to fit and usability while maintaining an aesthetic and safe application.\n- **Event Enthusiasm**: They show great enthusiasm for events promoting creativity and self-expression, actively seeking ways to complement their appearance through effective grooming practices.\n\nRecent interactions indicate the user's continued exploration of beauty products aimed at addressing specific skin concerns like oiliness and the desire for matte finishes, although some products haven't met their expectations. This shows their commitment to achieving a polished look for various occasions while remaining open to discovering effective tools for their beauty routine.",
  "metrics": {
    "rouge1_f": 0.22160664819944598,
    "rouge2_f": 0.013888888888888886,
    "rougeL_f": 0.09141274238227147,
    "meteor": 0.12139238143857091,
    "bleu1": 0.09125359922608708,
    "bleu2": 0.019064530480075496,
    "bleu3": 0.0033120255729513774,
    "bleu4": 0.0013818177104816603,
    "bertscore_precision": 0.3562813103199005,
    "bertscore_recall": 0.4360005259513855,
    "bertscore_f1": 0.3921302258968353
  }
}