{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Newcally Eyelashes 25MM Long False Lashes Faux Mink Dramatic Messy Lashes 5 Pairs\nReview Date: 2020/05/15\nStore: Newcally\nAverage Rating: 4.3\nProduct Details: {'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 3.9 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372077'}\nReview Text: If you are looking for an oversized lashes - these are for you. They are really long and fluffy, they are not too comfortable. These are lots of drama lashes - so not for the beginners. These are not the most comfortable to wear all night, unless you are used to wearing big lashes daily. Would be really great for shows and drag. Good value for a set.\nReview Title: Huge eyelashes!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "BABEYOND Roaring 20s Forehead Band 1920s Bridal Headpiece Vintage Forehead Chain for Wedding Bridesmaid Gatsby Costume Accessories with Gift Box\nBABEYOND\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 7.28 x 3.7 inches; 10.86 Ounces'}\nI got this headpiece as a photography prop and part for my costume for an upcoming masquerade ball. Let me tell  you - this is a headband style crown and absolutely gorgeous! It looks much more expensive, it is sparkley and highly detailed. I love the chain details that go over the forehead. It does not look anywhere like real diamonds - but more like good quality costume piece. My first photoshoot with this crown was a child model portrait session - and it did not disappoint. What I love about it that it is a headband style - it is slightly flexible - so it can fit adult or child head just fine. It does pinch a little if tilted forward, but if worn over the top of the head - it is fine. This can be dressed up many ways - as a princess, flapper, belly dancer and more.. I really love this headpiece and will definitely use it for more creative photoshoots and for my own costume.\nGorgeous! Unique headpiece!\nBlackhead Remover Pore Vacuum Cleaner - Blackhead Vacuum Comedone Extractor Tool Device Comedo Suction Kit Electric Face Nose Blackhead Whitehead Remover with 4 Replaceable Suction Head\ncoppy\n[\"don't buy !!!\"]\n{'Package Dimensions': '6.81 x 3.03 x 1.89 inches; 5.71 Ounces', 'Batteries': '1 Lithium Polymer batteries required. (included)', 'UPC': '705586525663'}\nSo this little devise exceeded my expectations - try this on the back of your hand before trying it on your face. This thing is really powerful even on the mildest setting. You have to keep this moving or it will bruise you! Use it on the lowest setting fits while you getting used to it. Best use on freshly steamed skin. I only using this on my nose since this is so powerful I am concerned I will end up with red lines on my face.\nWhat a powerful little tool!\nN3 No Name Necessary Pore-Minimizing Mattifying Oil and Shine Control Anti-aging Makeup Face Primer Spray (200ml)\nNo Name Necessary\n{'Brand': 'No Name Necessary', 'Skin Type': 'Combination', 'Package Information': 'Bottle', 'Finish Type': 'Matte', 'Specialty': 'Mattifying', 'Product Dimensions': '1.7 x 1.7 x 7.5 inches; 8.78 Ounces'}\nI really wanted to love this product and have been using it for a few weeks, before applying my makeup. My skin is oily and I get shiny really quickly. I was excited to try this product because I was hoping it would diminish appearance of pores and keep my makeup on looking matte longer. But with or without this primer my results are about the same. I get shiny within just a couple of hours. I did not notice much result from it at all. It works like a mist - and it’s quite pleasant, makes it easier to apply my makeup, but other than that no promised results.\nDid not work on my oily skin\nTaya Beauty Inner Core Hair Strong Anti-Breakage Shampoo & Conditioner Duo - Strengthening and Repairing Formula - Free From Sulfates and Parabens - 8 fl oz Bottles\nTAYA I AM.\n['INNER CORE SHAMPOO: Ingredients: Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Sodium Methyl Cocoyl Taurate, Acrylates Copolymer, Glycerin, Glycol Distearate, Bambusa Vulgaris Extract, Helianthus Annuus (Sunflower) Seed Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Panthenol, Dimethicone, PEG-120 Methyl Glucose Dioleate, Cetrimonium Chloride, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Cetyl Alcohol, Bis-Cetearyl Amodimethicone, Polyquaternium-11, Laureth-4, Laureth-23, Decylene Glycol, Caprylyl Glycol, Disodium EDTA, Amodimethicone, Cocamide MIPA, Trideceth-12, Kaolin, Polysorbate 20, Fragrance/Parfum, Phenoxyethanol, Sodium Hydroxide, Sodium Sulfate, Sodium Chloride, Coconut Acid, Sodium Methyltaurate, Isopropanolamine, Tocopherol, Salicylic Acid, Cyclotetrasiloxane, Cyclopentasiloxane, Ethylhexylglycerin, Citric Acid, Amyl Cinnamal, Benzyl Salicylate, Linalool. INNER CORE CONDITIONER: Ingredients: Water/Aqua/Eau, Cetearyl Alcohol, Glycerin, Behentrimonium Methosulfate, Stearamidopropyl Dimethylamine, Polysorbate 60, Bambusa Vulgaris Extract, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Cetrimonium Chloride, Dimethicone, Divinyldimethicone/Dimethicone Copolymer, Polyquaternium-37, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Propylene Glycol Dicaprylate/Dicaprate, Dicetyldimonium Chloride, Amodimethicone, Polyquaternium-7, PPG-1 Trideceth-6, Cetyl Alcohol, Trideceth-12, C11-15 Pareth-7, C12-13 Pareth-23, C12-13 Pareth-3, Decylene Glycol, Caprylyl Glycol, PEG-90M, Tetrasodium EDTA, Buteth-3, C10-40 Isoalkylamidopropylethyldimonium Ethosulfate, Sodium Benzotriazolyl Butylphenol Sulfonate, Laureth-9, Tributyl Citrate, Citric Acid, Fragrance/Parfum, Kaolin, Yellow 6/CI 15985, Phenoxyethanol, Sorbitan Oleate, Acrylates/Stearyl Methacrylate Copolymer, C10-11 Isoparaffin, Isopropyl Alcohol, Trisodium HEDTA, Silica, BHT, Amyl Cinnamal, Benzyl Salicylate, Linalool.']\n{'Product Benefits': 'Moisturizing,Repairing,Cleanses,Breakage', 'Item Form': 'Liquid', 'Brand': 'TAYA I AM.', 'Hair Type': 'Wavy, Color Treated, Curly, Damaged, Thin', 'Scent': 'Coconut', 'Package Dimensions': '7.99 x 4.53 x 2.09 inches; 1 Pounds', 'Item model number': '3.00', 'UPC': '858308002185'}\nMy hair are really long, thin, bleached blonde and tangles easily. This shampoo and conditioner set is fantastic. My hair feels much more silky and manageable. I can brush it through after washing much easier.<br />I really like the pleasant scent of these products.<br /> The top of the bottle is a twist to squeeze just the right amount of product.<br />It is not cheap but for sure worth it.\nFantastic for bleached overworked hair\nCancun Collection Cacao Body Bronzer – Superfood Infused Sunless Tanning Lotion with Cacao 5.1 fl.oz, For Instant Tan in 1 minute.\nCancun Collection\n{'Item Form': 'Lotion', 'Skin Type': 'All', 'Brand': 'Cancun Collection', 'Skin Tone': 'All', 'Material Feature': 'Antioxidant', 'Package Dimensions': '5.1 x 4.6 x 1 inches; 14.39 Ounces', 'UPC': '659436986640'}\nSuper easy to use. Absorbs immediately leaving your skin smooth, hydrated and bronzed. This product has light coconut scent. It comes off really easily with water and soap. Great product for photoshoots or a night out. The container is really thin and flat which makes it easy to tip - so you might want to keep the lid on it at all the times when not in use in order to prevent unexpected messes.\nIt’s like foundation for your body\nMaynice Soft Nature 3D Mink Stripe Lashes WIth Package 1 pair Y50\nMaynice\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '4.72 x 2.17 x 0.59 inches; 1.06 Ounces', 'UPC': '743811077808'}\nThese eyelashes are really pretty - soft and fluffy and they are long. Definitely not for someone who is just getting into lashes. These are best for someone who is very experienced and loves big dramatic lashes. These lashes are really thick and I love how fluffy they are. Lots of drama.\nBig and fluffy\nNewcally Eyelashes 25MM Long False Lashes Faux Mink Dramatic Messy Lashes 5 Pairs\nNewcally\n{'Brand': 'Newcally', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '5.4 x 3.9 x 0.8 inches; 0.81 Ounces', 'UPC': '732376372077'}\nIf you are looking for an oversized lashes - these are for you. They are really long and fluffy, they are not too comfortable. These are lots of drama lashes - so not for the beginners. These are not the most comfortable to wear all night, unless you are used to wearing big lashes daily. Would be really great for shows and drag. Good value for a set.\nHuge eyelashes!",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user enjoys costuming, photography, and themed events such as masquerade balls and creative photoshoots. They have a growing passion for dramatic beauty items that enhance their look, reflecting their commitment to creativity and self-expression.\n\n- **Style Preference**: They maintain a strong affinity for vintage and glamorous accessories, particularly inspired by the Roaring 20s, emphasizing elegance and uniqueness while embracing high-impact styles.\n\n- **Functionality**: They seek versatile fashion items and beauty tools that serve multiple roles, suitable for various occasions and age groups, with an eye for bold, dramatic elements that make a statement.\n\n- **Quality Awareness**: Prioritizing high-quality products, the user values visual appeal and effectiveness at a reasonable price, ensuring an attractive aesthetic without compromising on performance.\n\n- **Comfort Considerations**: While comfort is a key factor, their recent selections show a willingness to experiment with less comfortable but striking options, especially for events and theatrical looks.\n\n- **Event Enthusiasm**: The user shows great enthusiasm for events that encourage creativity, actively seeking ways to elevate their appearance through dramatic enhancements and high-impact grooming products that align with their love for glamour.\n\n- **Recent Behavior**: They have recently explored hair care products suitable for damaged and color-treated hair, expanded their grooming routine to include body tanning products, and actively engaged with bold eyelash options, reflecting a continued focus on dramatic styling for special occasions and photoshoots.",
  "metrics": {
    "rouge1_f": 0.15044858523119392,
    "rouge2_f": 0.0082930200414651,
    "rougeL_f": 0.062111801242236024,
    "meteor": 0.0610037532129131,
    "bleu1": 0.006021343096027454,
    "bleu2": 0.001120028883806761,
    "bleu3": 0.0001871598708659704,
    "bleu4": 7.657278122361458e-05,
    "bertscore_precision": 0.3609755039215088,
    "bertscore_recall": 0.4851091802120209,
    "bertscore_f1": 0.41393616795539856
  }
}