{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: BABEYOND Roaring 20s Forehead Band 1920s Bridal Headpiece Vintage Forehead Chain for Wedding Bridesmaid Gatsby Costume Accessories with Gift Box\nReview Date: 2019/01/15\nStore: BABEYOND\nAverage Rating: 4.4\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 7.28 x 3.7 inches; 10.86 Ounces'}\nReview Text: I got this headpiece as a photography prop and part for my costume for an upcoming masquerade ball. Let me tell  you - this is a headband style crown and absolutely gorgeous! It looks much more expensive, it is sparkley and highly detailed. I love the chain details that go over the forehead. It does not look anywhere like real diamonds - but more like good quality costume piece. My first photoshoot with this crown was a child model portrait session - and it did not disappoint. What I love about it that it is a headband style - it is slightly flexible - so it can fit adult or child head just fine. It does pinch a little if tilted forward, but if worn over the top of the head - it is fine. This can be dressed up many ways - as a princess, flapper, belly dancer and more.. I really love this headpiece and will definitely use it for more creative photoshoots and for my own costume.\nReview Title: Gorgeous! Unique headpiece!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "BABEYOND Roaring 20s Forehead Band 1920s Bridal Headpiece Vintage Forehead Chain for Wedding Bridesmaid Gatsby Costume Accessories with Gift Box\nBABEYOND\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '10.2 x 7.28 x 3.7 inches; 10.86 Ounces'}\nI got this headpiece as a photography prop and part for my costume for an upcoming masquerade ball. Let me tell  you - this is a headband style crown and absolutely gorgeous! It looks much more expensive, it is sparkley and highly detailed. I love the chain details that go over the forehead. It does not look anywhere like real diamonds - but more like good quality costume piece. My first photoshoot with this crown was a child model portrait session - and it did not disappoint. What I love about it that it is a headband style - it is slightly flexible - so it can fit adult or child head just fine. It does pinch a little if tilted forward, but if worn over the top of the head - it is fine. This can be dressed up many ways - as a princess, flapper, belly dancer and more.. I really love this headpiece and will definitely use it for more creative photoshoots and for my own costume.\nGorgeous! Unique headpiece!",
  "profile": "User Profile Summary:\n\n- **Interests**: Costuming, photography, and themed events (e.g., masquerade balls and creative photoshoots).\n- **Style Preference**: Appreciates vintage and glamorous accessories, particularly those that evoke historical eras (e.g., Roaring 20s).\n- **Functionality**: Values versatility in fashion items, seeking pieces that can serve multiple roles (e.g., suitable for both adults and children).\n- **Quality Awareness**: Drawn to products that appear high-quality, even if they are costume pieces—preferring items that offer visual appeal without the high cost.\n- **Comfort Considerations**: Considers comfort in wear, indicating awareness of fit and usability while maintaining aesthetic appeal.\n- **Event Enthusiasm**: Shows a high level of enthusiasm for events that allow for creativity and self-expression through costume.\n\nThe user displays a clear preference for elegant, unique accessories that can enhance creative endeavors, along with a commitment to costuming for various occasions.",
  "metrics": {
    "rouge1_f": 0.2441860465116279,
    "rouge2_f": 0.029239766081871347,
    "rougeL_f": 0.12209302325581395,
    "meteor": 0.17513306373964949,
    "bleu1": 0.21257059447529686,
    "bleu2": 0.05169002789674864,
    "bleu3": 0.010401360814590258,
    "bleu4": 0.004671988888649201,
    "bertscore_precision": 0.42264729738235474,
    "bertscore_recall": 0.4403337240219116,
    "bertscore_f1": 0.4313092827796936
  }
}