{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Anti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy\nReview Date: 2015/06/02\nAverage Rating: 3.0\nProduct Details: {'Product Dimensions': '1.38 x 1.38 x 5 inches; 3.2 Ounces', 'UPC': '704660231261'}\nReview Text: Anti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy...<br /> HIGHLY CONCENTRATED FORMULA - Argireline is the hero ingredient at the optimal concentration recommended by the manufacturer. Other active ingredients are derived from coconut oil and glycerin, excellent emollients and skin-repairing ingredients due to the medium chain fatty acids that skin can utilize to repair its surface and resist moisture loss; they also have an anti-inflammatory effect that reduces the risk of irritation.<br />- DOCUMENTED CLINICAL STUDIES - Studies based on the use of a 5% concentration of Argireline in volunteers showed that wrinkles around the eyes decreased up to 17% after 15 days of treatment and up to 27% after 30 days of treatment. Controlled studies have also demonstrated that wrinkle depth can also be reduced in the forehead. Our formula has 8%, the high end recommended for optimal results.<br />- NO HARMFUL INGREDIENTS - No parabens, bpa, phthlates, mineral oil, alcohol, sodium benzoate, propylene or any other toxic ingredients. All contents are compared to the EWG's Skin Deep Database for safety and compliance.<br />- MADE IN THE USA in our GMP (good manufacturing practices) and FDA certified facility; 100% fragrance free, 100% cruelty free, 100% manufacturer's money back guarantee.<br /> - Reduce the appearance of fine lines and wrinkles, reduce the appearance of under-eye bags, increase skin firmness and smoothness, repair and refresh skin surface, ideal for all skin types.<br />Paloma Perfect Peptide contains a highly concentrated 8% (by volume, not an 8% solution) of this ingredient, one of the highest available on the market, and recommended by the ingredient creator. Beware of deceptive and incomplete labeling. Ingredients should ALWAYS be listed from highest to lowest concentration, not by just the active ingredients!<br />The best of intelligent science and natural, responsibly sourced ingredients, our formulas are produced in small carefully controlled batches to preserve freshness, and bottled only in airless pumps to prevent the ingredient destabilization and contamination that occurs when products are opened and exposed to air or contact with fingers.<br />Indications<br />Designed to aid in the prevention and elimination of fine lines, wrinkles, and sagging skin.<br />Ingredients<br />Deionized Water, Glycerin, Coconut Oil Extract (suberb emollients as Caprylic/Capric Triglyceride), Argireline 8% (Acetyl Hexapeptide-8), Polyacrylamide (moisture binding agent), C 13-14 (emollient and thickener), Isoparaffin (thickener) Laureth-7 (emulsifier), Phenoxyethanol (cosmetic preservative) Caprylyl Glycol, Sorbic Acid (cosmetic preservatives).<br />Directions<br />Tap the bottle gently on the heel of your hand to settle contents after shipping and to dislodge any air bubbles from the airless pump. After cleansing and toning, apply one or two pumps as needed, each about the size of a pearl, to face, neck and decollete. A 30 ml bottle will last 45-60 days.<br />As I age I pay special attention to those fine lines around my eyes and keeping any forehead lines at bay by using the best of the best anti aging formulas available. I have also learned how critical it is to moisturize and care for the neck and decollete area. These areas are so often overlooked but they are two areas that can really reveal your age or make you look older than you really are. I also notice an increased firmness and smoothness in my skin. I am very impressed at how quickly this moisturizer has worked compared to other more expensive ones that I have tried. It has a pump action applicator making for easy dispensing. I am very pleased with this nice quality moisturizer and I highly recommend it to anyone.<br />I recevid the product for review at a discount this is my honest review on the product  I am a 43 year young and this is a product that I will be using from now on.\nReview Title: Anti Aging product that works\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Makeup Brush Kit (10 pc, Super Soft Synthetic) - Premium Essential Makeup Brush Set, Contour Brush Kabuki Cosmetics Foundation Blending Blush Eyeliner Face Powder Brush\n{'Recommended Uses For Product': 'Contour, For Eyelining, For Foundation', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '6 x 6 x 1.5 inches; 4.8 Ounces', 'UPC': '856549003206'}\nI love this make up it is all I need to have flawless almost perfect look.  It can get messy but once you get use to using it will come natural to you and the messy goes away.  Thank you for a great affordable product.\nGreat looking skin\nRed Rock Organics Rosacea and Sensitive Skin Serum | Organic & Nano Nutrients- Firms and Tightens-Reduces Puffy Eyes & Soothes Skin with Manuka Honey and Hyaluronic Acid (.5 oz)\nRed Rock Organics\n['FOUR FAMILIAR BEAUTY AND AGING TROUBLES - WHICH DO YOU WANT TO OVERCOME?', \"- Dark Circles? - Puffy Eyes? - Crow's feet? - Discoloration?\", 'Now You Can Reverse the Effects of Aging with Natural Ingredients', \"Our natural, potent anti-aging eye serum is your solution. It's made with 20% hyaluronic acid and 5% vitamin C which are scientifically proven to reduce wrinkles, fine lines and to stimulate collagen.\", 'There have always been two types of eye serums: - Short Term for tightening and plumping the delicate skin around your eye and - Long Term serum which infuses nutrients deep into your skin to repair the damaged cells taking 2 to 3 months to show improvement.', 'We have combined these two serums into one.', \"You won't believe the amazing results in less than 3 minutes, but wait the full 3 months and be even more amazed.\", 'We use Manuka Honey and all of the vitamins, trace minerals and nutrients that your eye tissue cells need to repair themselves.', 'Special Agents and Moisture Magnets', 'We have special agents that go deep into your skin and wake up your collagen producers and tell them to get back to work.', 'We also use moisture magnets that pull moisture particles out of the air and trap them in your cells giving you the instant youthful look you want in minutes.', 'Natural ingredients sit in a soothing aloe vera base. We never use water, mineral oil or alcohol in our products. Aloe vera is excellent at penetrating deep into your skin acting as the carrier for all of the other nutrients bringing them deep into your cells.', 'Anti-Aging Eye Serum comes with our usual money back guarantee.', 'Click the Add to Cart button above to start looking more youthful naturally.']\n{'Skin Type': 'Oily, Combination, Aging, Dry, Normal', 'Scent': 'Unscented', 'Brand': 'Red Rock Organics', 'Item Form': 'Liquid', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.5 x 1.5 x 3.8 inches; 2.4 Ounces', 'UPC': '852684999220', 'Manufacturer': 'Bio Fitness'}\nThis is another one of my favorite products I was given this to try and give my honest review on,  Red Rock Organics - BEST Eye Gel, Eye Cream... is truly amazing and it really does what it said it would do this is now one of the only products that I will continue to use every day the results are real and they last no gimmicks no hype to this products it does just what it states it will do I have been using now for about  2 weeks and I already see a bid change in my eyes.  The dark circles are all but gone the puffiness has also gone and the fine lines have faded I truly love this product and will use it from now on Thank you\nThis is real and it works fast\nMother’s Select Stretchmark & Cellulite Complex for Women Thighs, Legs, Stomach, Pregnancy, Slimming, Firming, Removal, Tightening, Hydration, Unsightly Scars, & Fat Deposits\nMama's Select\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.1 x 1.3 x 1.3 inches; 4 Ounces', 'UPC': '804879533283', 'Manufacturer': \"Mama's Select\"}\nI was given a discount for this product for a review.  I like the feeling of this product and I did see a slight change in color of just a few stretch marks I have but not the change that I was really hoping for that may be that all my stretch marks are old and I have had them for 20+ years, that may play a roll in the results.\nMaybe, Maybe Not\nAnti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy\n{'Product Dimensions': '1.38 x 1.38 x 5 inches; 3.2 Ounces', 'UPC': '704660231261'}\nAnti Aging Moisturizer with Peptides-Advanced Luxury Concentrated Argireline Cream for Face, Eyes, and Neck by Paloma Skin Therapy...<br /> HIGHLY CONCENTRATED FORMULA - Argireline is the hero ingredient at the optimal concentration recommended by the manufacturer. Other active ingredients are derived from coconut oil and glycerin, excellent emollients and skin-repairing ingredients due to the medium chain fatty acids that skin can utilize to repair its surface and resist moisture loss; they also have an anti-inflammatory effect that reduces the risk of irritation.<br />- DOCUMENTED CLINICAL STUDIES - Studies based on the use of a 5% concentration of Argireline in volunteers showed that wrinkles around the eyes decreased up to 17% after 15 days of treatment and up to 27% after 30 days of treatment. Controlled studies have also demonstrated that wrinkle depth can also be reduced in the forehead. Our formula has 8%, the high end recommended for optimal results.<br />- NO HARMFUL INGREDIENTS - No parabens, bpa, phthlates, mineral oil, alcohol, sodium benzoate, propylene or any other toxic ingredients. All contents are compared to the EWG's Skin Deep Database for safety and compliance.<br />- MADE IN THE USA in our GMP (good manufacturing practices) and FDA certified facility; 100% fragrance free, 100% cruelty free, 100% manufacturer's money back guarantee.<br /> - Reduce the appearance of fine lines and wrinkles, reduce the appearance of under-eye bags, increase skin firmness and smoothness, repair and refresh skin surface, ideal for all skin types.<br />Paloma Perfect Peptide contains a highly concentrated 8% (by volume, not an 8% solution) of this ingredient, one of the highest available on the market, and recommended by the ingredient creator. Beware of deceptive and incomplete labeling. Ingredients should ALWAYS be listed from highest to lowest concentration, not by just the active ingredients!<br />The best of intelligent science and natural, responsibly sourced ingredients, our formulas are produced in small carefully controlled batches to preserve freshness, and bottled only in airless pumps to prevent the ingredient destabilization and contamination that occurs when products are opened and exposed to air or contact with fingers.<br />Indications<br />Designed to aid in the prevention and elimination of fine lines, wrinkles, and sagging skin.<br />Ingredients<br />Deionized Water, Glycerin, Coconut Oil Extract (suberb emollients as Caprylic/Capric Triglyceride), Argireline 8% (Acetyl Hexapeptide-8), Polyacrylamide (moisture binding agent), C 13-14 (emollient and thickener), Isoparaffin (thickener) Laureth-7 (emulsifier), Phenoxyethanol (cosmetic preservative) Caprylyl Glycol, Sorbic Acid (cosmetic preservatives).<br />Directions<br />Tap the bottle gently on the heel of your hand to settle contents after shipping and to dislodge any air bubbles from the airless pump. After cleansing and toning, apply one or two pumps as needed, each about the size of a pearl, to face, neck and decollete. A 30 ml bottle will last 45-60 days.<br />As I age I pay special attention to those fine lines around my eyes and keeping any forehead lines at bay by using the best of the best anti aging formulas available. I have also learned how critical it is to moisturize and care for the neck and decollete area. These areas are so often overlooked but they are two areas that can really reveal your age or make you look older than you really are. I also notice an increased firmness and smoothness in my skin. I am very impressed at how quickly this moisturizer has worked compared to other more expensive ones that I have tried. It has a pump action applicator making for easy dispensing. I am very pleased with this nice quality moisturizer and I highly recommend it to anyone.<br />I recevid the product for review at a discount this is my honest review on the product  I am a 43 year young and this is a product that I will be using from now on.\nAnti Aging product that works",
  "profile": "**User Profile Summary:**\n\n- **Focus on Makeup & Skincare**: The user maintains a strong interest in makeup and skincare, emphasizing effective treatments for skin concerns and demonstrating a holistic approach to beauty.\n- **Preference for Quality & Efficacy**: They value high-quality products that deliver real results, favoring natural ingredients and scientifically backed formulations for a youthful appearance.\n- **Positive Outcome Orientation**: The user appreciates products that show tangible improvements, driving their commitment to mastering new beauty techniques and practices.\n- **Learning Curve Acknowledgment**: They recognize that some products may require a learning phase but remain motivated by consistent use and visible results.\n- **Affordability & Accessibility**: Affordability is crucial, as they seek effective solutions that enhance their beauty routines without compromising on quality.\n- **Inclusive Utility**: The user looks for versatile products applicable to various skin types and concerns, promoting broader accessibility within their regimen.\n- **Experimental Mindset**: Recent interactions indicate a willingness to explore new products, appreciating positive experiences with textures and gradual outcomes despite initial expectations. Their latest purchase, lauded for efficacy and quick results compared to pricier alternatives, underscores their inclination toward well-formulated, high-performance items.\n\nOverall, this user demonstrates a commitment to efficient, natural, and affordable beauty solutions, remaining open to exploration and mastery for optimal results.",
  "metrics": {
    "rouge1_f": 0.11612106238418778,
    "rouge2_f": 0.00989486703772418,
    "rougeL_f": 0.060531192093885126,
    "meteor": 0.048188075454733886,
    "bleu1": 0.0018312721833976737,
    "bleu2": 0.000458661950797599,
    "bleu3": 7.023848699244156e-05,
    "bleu4": 2.7511814583784782e-05,
    "bertscore_precision": 0.3707659840583801,
    "bertscore_recall": 0.48552238941192627,
    "bertscore_f1": 0.42045459151268005
  }
}