{
  "interaction_number": 13,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Doctor Who: The Movie (Special Edition)\nReview Date: 2020/01/07\nStore: Paul McGann  (Actor),     Daphne Ashbrook  (Actor),     Geoffrey Sax  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, BBC, All BBC Titles\nProduct Description: ['Product Description', 'This highly requested TV movie aired on Fox on May 14, 1995, and is available on North American video for the first time. The Doctor is returning home to Gallifrey with the remains of his arch-nemesis, the Master. Forced off course, the TARDIS arrives in San Francisco on New Year’s Eve 1999, where the Doctor is critically wounded in a gangland gun battle. At the local hospital, Dr. Grace Holloway fights--and fails--to save his life. Later, in the morgue, the Doctor wakes up a new man. But he is not the only one--the Master has also found himself a new body. As the clock counts down to the start of the new millennium, can the Doctor stop his oldest enemy from destroying all life on Earth?', 'Amazon.com', \"Made to re-launch television's most famous time traveler,\", 'Doctor Who: The Movie', \"is an expensive feature-length episode which attempts to continue the classic series and work as a stand-alone film. Transporting the remains of the Master, Sylvester McCoy's Seventh Doctor is diverted to San Francisco in 1999. Regenerating in the form of Paul McGann, the Doctor gains a new companion in heart surgeon Dr. Grace Holloway (Daphne Ashbrook) and must stop the Master from destroying the world. All of which might have been fine, had not the most eccentrically British of programs been almost entirely assimilated by the requirements of American network broadcasting. Matthew Jacobs' screenplay is literally nonsense, dependent on arbitrary, unexplained events while introducing numerous elements that contradict established Doctor Who mythology. The Tardis is re-imagined as a bizarre pre-Raphaelite/Gothic folly, while the Doctor, now half-human, becomes romantically involved with his lady companion. From the West Coast setting to metallic CGI morphing, from the look of Eric Roberts as the Master to a motorcycle/truck freeway chase, director Geoffrey Sax borrows freely from James Cameron's\", 'Terminator 2: Judgment Day', '(1991). Doctor Who fans should feel relieved this travesty was not successful enough to lead to a series, though McGann himself does have the potential to make a fine Doctor.', '--Gary S Dalkin']\nAverage Rating: 4.4\nProduct Details: {'Format': 'Multiple Formats, Color, Full Screen, NTSC, Original recording remastered, Special Edition', 'Contributor': 'Glen MacPherson, Geoffrey Sax, Peter V Ware, Paul McGann, Eric Roberts, Daphne Ashbrook, Matthew JacobsGlen MacPherson, Geoffrey Sax, Peter V Ware, Paul McGann, Eric Roberts, Daphne Ashbrook, Matthew Jacobs   See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '5.3 x 0.6 x 7.5 inches; 4 Ounces', 'Director': 'Geoffrey Sax', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Original recording remastered, Special Edition', 'Run time': '1 hour and 26 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Paul McGann, Daphne Ashbrook, Eric Roberts', 'Producers': 'Peter V Ware', 'Studio': 'BBC Home Entertainment', 'Writers': 'Matthew Jacobs', 'Number of discs': '2'}\nReview Text: I recently purchased this Wonderful Movie on DVD \"Doctor Who: The Movie (Special Edition)\" and I am very glad that I did!!!! I had originally watched this Fox TV movie back in 1996, but was not able to view it again because I no longer had a working VCR (I had recorded the film myself when it aired). I think that I still own the old VHS tape that I made with the move on it.. but no longer have a VCR.  I have been a huge fan of Doctor Who for years,  so I really wanted to re-visit this special program !!!!!!! The Move was great.. even better than I had remembered it !!!!! I have not yet watched all of the special features on disc 2.. but what I have seen were interesting segments !!!!! In order to watch the DVD on my Windows 10 PC I had to download a free DVD player app from the Windows store called \"Any Player\". (I do not have a DVD player) It was a really enjoyable film !!!!!!\nReview Title: Wonderful DVD Movie..\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Coming Home VHS\nJane Fonda  (Actor),     Jon Voight  (Actor),     Hal Ashby  (Director)    &                   0                  more   Rated:    R    Format: VHS Tape\nMovies & TV, Studio Specials, MGM Home Entertainment, All MGM Titles\n['Amazon.com', \"Both Jane Fonda and Jon Voight won Oscars for their performances in this profoundly moving 1978 flick dealing with the aftereffects of the Vietnam War. Fonda, feeling isolated while her hawkish husband, Bruce Dern, is away in Vietnam, follows a friend's example and volunteers at a veteran's hospital. There she is reacquainted with Voight, an old friend who has returned from the war as a paraplegic. Lonely and disconnected from her husband, Fonda finds love, and fulfilling sex, with Voight. The sex scenes, very steamy for the time, are still provocative. This mature love story is about expanding your horizons, and is both moving and thoughtful. Director Hal Ashby (\", 'Harold and Maude', ') does succumb to melodrama on occasion, but these are forgivable slips.', \"--Rochelle O'Gorman\"]\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Hal Ashby', 'Run time': '2 hours and 7 minutes', 'Release date': 'July 8, 1997', 'Date First Available': 'September 29, 2006', 'Actors': 'Jane Fonda, Jon Voight, Bruce Dern, Penelope Milford, Robert Carradine', 'Studio': 'MGM (Video & DVD)', 'Producers': 'Bruce Gilbert, Jerome Hellman', 'Writers': 'Nancy Dowd, Robert C. Jones, Rudy Wurlitzer, Waldo Salt'}\nI bought this VHS tape as a gift for a good friend of mine. She had owned a copy of it and was very happy to get another one!\nVery Nice!\nA Star Is Born VHS\nBarbra Streisand  (Actor),     Kris Kristofferson  (Actor),     Frank Pierson  (Director, Writer)    &                   0                  more   Rated:    R    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['Product description', 'Guaranteed to work or your money back - PLEASE NOTE ALL MONIES FROM THIS SALE GO TO A 501 (C)3 NO KILL ANIMAL SHELTER', 'Amazon.com', 'This film actually began with the idea of remaking', 'A Star Is Born', 'with the then-hot couple James Taylor and Carly Simon. Eventually, it evolved into this vanity production for Barbra Streisand, with Kris Kristofferson as the designated stud muffin. The story remains the same: A superstar on the decline meets a young singer on the way up. They marry as their career trajectories intersect, and his eventual demise is meant as a sacrifice to further boost her career by ridding her of the burden of him. Kristofferson\\'s rock & roll numbers are decidedly lousy--Hollywood\\'s idea of rock music--and Streisand looks good and always sounds fine (she won an Oscar for cowriting the song \"Evergreen\"). But you can feel her heavy hand guiding every shot; she seems to serve as puppet master for director Frank Pierson, framing every image of herself for maximum glow. The ultimate date flick (if the guy can sit still through it).', '--Marshall Fine']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Director': 'Frank Pierson', 'Run time': '2 hours and 19 minutes', 'Release date': 'April 15, 1992', 'Date First Available': 'December 7, 2006', 'Actors': 'Barbra Streisand, Kris Kristofferson, Gary Busey, Oliver Clark, Venetta Fields', 'Studio': 'Warner Home Video', 'Writers': 'Alvin Sargent, Frank Pierson, Jay Presson Allen, Joan Didion, John Gregory Dunne'}\nI purchased this VHS tape as a gift for a friend. She had owned a copy of it some time ago.. and was hoping to get another one!\nVery Nice!\n{'Subtitles': ['None available'], 'Directors': ['Takuya Igarashi', 'Yasuhiro Irie', 'Tensai Okamura', 'Takefumi Anzai', 'Shin Matsuo', 'Ikurô Satô', 'Daisuke Chiba', 'Shingo Kaneko', 'Yoshiyuki Asai', 'Toshinori Narita']}\nI just purchased a few of my Favorite Episodes of the Anime &#34;Soul Eater&#34; using Amazon Instant Video, and I want to say that I am very pleased! I have always enjoyed this animated series.. &#34;Soul Eater&#34; is a very funny and engaging show with very memorable characters.<br /><br />It is nice to have a few of my most favorite episodes to watch when ever I want. The quality of the videos is, in my opinion, excellent!\nVery Nice Series!\n{'Subtitles': ['None available'], 'Directors': ['Takuya Igarashi', 'Yasuhiro Irie', 'Tensai Okamura', 'Takefumi Anzai', 'Shin Matsuo', 'Ikurô Satô', 'Daisuke Chiba', 'Shingo Kaneko', 'Yoshiyuki Asai', 'Toshinori Narita']}\nI just purchased a few of my Favorite Episodes of the Anime &#34;Soul Eater&#34; using Amazon Instant Video, and I want to say that I am very pleased! I have always enjoyed this animated series.. &#34;Soul Eater&#34; is a very funny and engaging show with very memorable characters.<br /><br />It is nice to have a few of my most favorite episodes to watch when ever I want. The quality of the videos is, in my opinion, excellent! Especially the episodes that are available in HD.<br /><br />The Series itself is nicely done, and follows a number of students in the DWMA (Death Weapon Meister Academy) as they learn to work with their partners and protect the world from evil.\nExcellent Animated Series\n{'Subtitles': ['None available'], 'Directors': ['Takuya Igarashi', 'Yasuhiro Irie', 'Tensai Okamura', 'Takefumi Anzai', 'Shin Matsuo', 'Ikurô Satô', 'Daisuke Chiba', 'Shingo Kaneko', 'Yoshiyuki Asai', 'Toshinori Narita']}\nI have been purchasing a few of my Favorite Episodes of the Anime &#34;Soul Eater&#34; using Amazon Instant Video, and I want to say that I am very pleased! I have always enjoyed this animated series.. &#34;Soul Eater&#34; is a very funny and engaging show with very memorable characters.<br /><br />It is nice to have a few of my most favorite episodes to watch when ever I want. The quality of the videos is, in my opinion, excellent! Especially the episodes that are available in HD.<br /><br />The Series itself is nicely done, and follows a number of students in the DWMA (Death Weapon Meister Academy) as they learn to work with their partners and protect the world from evil.\nExcellent (and Fun) Animated Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Manny Hernandez'], 'Producers': ['Daniel Chong', 'Brian A. Miller', 'Jennifer Pelphrey', 'Rob Sorcher', 'Carrie Wilksen', 'Randy Myers', 'Curtis Lelash', 'Diara Jaye', 'Tramm Wigzell'], 'Studio': ['Cartoon Network']}\nI decided to purchase a  season pass for &#34;We Bare Bears&#34; (Season 1) after I had watched several episodes of this new series, and realized just how much I was enjoying each new &#34;installment&#34; as it came along.<br /><br />In truth I am really beginning to love this show! It is very funny, well written, and the characters are very memorable. Griz, Panda, and Ice Bear have each continued to grow on me, the more I have seen them.  And I can't wait to see where new storylines might go.<br /><br />I also noticed that I was still enjoying re-watching each of the episodes, even though I had seen them many times. In my opinion, this series definitely has some real potential.. and it seems to possess a certain appeal!<br /><br />EDITS: And, as many other folks here have said.. each episode seems to include a new song (which relates to the storyline) ..and these songs are also well done, they are rather catchy, and are quite memorable.. (just like what I had said about the characters, a few lines above in this review).<br /><br />In one sense, it is too bad that these little &#34;song sequences&#34; tend to be a bit short.. but they work, and they are cool.<br /><br />So.. in my opinion, &#34;We Bare Bears&#34; is very nicely done, ..a wonderful series thus far!\nWonderful Series!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['Christopher Eccleston', 'Billie Piper'], 'Studio': ['BBC America']}\nI recently began watching this show (&#34;Doctor Who Season 1&#34;) on Amazon Prime after having seen some of the episodes (but not all of them) before.<br /><br />So.. I  decided I should probably try starting the series over at the beginning.. and watching it through.  And i am really glad that I did!<br /><br />This show is totally awesome, and it is a whole lot of fun!  It really recaptures a great deal of the feel from the original &#34;Doctor Who&#34; series that began back in the 60's.\nGreat Series!!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'Billie Piper'], 'Studio': ['BBC America']}\nI recently began (re) watching the &#34;new&#34; Doctor Who series from the beginning, ..after having seen many (but not all) of the episodes (basically up to the end of season 4) a few years back.<br /><br />My goal is to get caught up on the series.. and I figured the best thing to do was start at the beginning and watch the all, to refresh my memory.<br /><br />I am very glad that I did.. Season 2 of Doctor Who is really Great! ..and I am really enjoying revisiting the entire series thus far!\nAnother Great Season..\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'Freema Agyeman', 'John Barrowman'], 'Studio': ['BBC America']}\nAs I have continued to (re) watch each of these seasons of the &#34;new&#34; Doctor Who series.. I must say that I have been enjoying myself immensely!<br /><br />Season three is another Great season in my opinion.  And even though I believe that I have probably seen all of the episodes in this particular season some time ago.. I am still enjoying re-visiting each one of them and refreshing my memory!<br /><br />The entire series has been terrific thus far.\nGreat Series, and Great Fun!..\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'Catherine Tate', 'Freema Agyeman'], 'Studio': ['BBC America']}\nVery *minor spoilers* concerning the Doctor..<br /><br />I have continued to (re)watch (and to truly enjoy) each season of the &#34;new&#34; Doctor Who series! And season four of Doctor Who has got to be one of my favorite seasons (thus far).<br /><br />In fact, now that I have finished (re)watching all of season four.. I am &#34;caught up&#34; with as many episodes as I have previously seen of the series. Meaning that from this point on.. I will be watching any &#34;future&#34; episodes for the first time.<br /><br />Season four of Doctor Who was really great! You have got to love Donna Noble!  She and David Tennant's Doctor make a great combination.<br /><br />And I just want  to mention that after finishing season four.. viewers should watch &#34;Doctor Who: The David Tennant Specials ...&#34; next, in order not to miss any parts of the story.<br /><br />Again, after completing season four.. you should then watch the &#34;Doctor Who: The David Tennant Specials ...&#34; next (and not just go on with season five.. because the story line continues with the specials) -- before season five begins with the new Doctor.<br /><br />&#34;Doctor Who: The David Tennant Specials ...&#34; is actually a short &#34;season&#34; of eight specials which are the final episodes of David Tennant's Doctor.<br /><br />Episode 1: Planet of the Dead<br />Episode 2: The Doctor Who Confidential: Planet of the Dead (commentary)<br /><br />Episode 3: The Waters of Mars<br />Episode 4: The Doctor Who Confidential: The Waters of Mars (commentary)<br /><br />Episode 5: End of Time, Part 1<br />Episode 6: The Doctor Who Confidential: End of Time, Part 1 (commentary)<br /><br />Episode 7: End of Time, Part 2<br />Episode 8: The Doctor Who Confidential: End of Time, Part 2 (commentary)<br /><br />(You can skip the commentaries if you want to.. but I would not, because but they are good.. and well worth watching.. especially once you have seen the particular episode that they talk about).<br /><br />Then go on to watch season five of the series..\nGreat Season.. (*minor spoilers* concerning the Doctor..)\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes']}\nAwesome special episodes!! The Great series continues!<br /><br />I watched this Wonderful but short &#34;season&#34; of eight specials.. which are the final episodes of David Tennant's Doctor.. (and as such should be viewed following season four of &#34;Doctor Who&#34;.. and before continuing on with season five..)\nAwesome special episodes!! The Great series continues!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Graeme Harper', 'Euros Lyn', 'Jamie Magnus Stone', 'Douglas Mackinnon', 'Rachel Talalay', 'James Strong', 'Charlie Palmer', 'James Hawes', 'Joe Ahearne', 'Toby Haynes'], 'Starring': ['David Tennant', 'David Morrissey', 'Michelle Ryan'], 'Studio': ['BBC America']}\nI have been really enjoying watching each new season of &#34;Doctor Who&#34;!<br /><br />And season five of the show continues to be a lot of fun. This season introduces some very interesting (and memorable) characters.. along with some rather surprising storylines!<br /><br />Corrected Edit: Oh.. and I think that viewers are probably supposed to watch at least one of the episodes found in  ”Season 1&#34; of the ”Doctor Who - Christmas Specials&#34; next (after finishing season five of the series).. before going on to season six.<br /><br />Further Edit: Yes, according to a Wiki page that I found.. after watching the last episode in season 5 of &#34;Doctor Who&#34; (&#34;The Big Bang&#34;) you should then watch the December 25, 2010 Christmas special (&#34;A Christmas Carol&#34;) (found in  ”Season 1&#34; of the ”Doctor Who - Christmas Specials&#34;).. before beginning to watch season six.<br /><br />So in the  future you may want to check the dates of the specials (meaning mostly the year) to be sure that you are watching episodes in the right order. Either that or look up a Wiki Page that lists the episodes.. like I did.\nWonderful Season!\nDoctor Who: The Movie (Special Edition)\nPaul McGann  (Actor),     Daphne Ashbrook  (Actor),     Geoffrey Sax  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, BBC, All BBC Titles\n['Product Description', 'This highly requested TV movie aired on Fox on May 14, 1995, and is available on North American video for the first time. The Doctor is returning home to Gallifrey with the remains of his arch-nemesis, the Master. Forced off course, the TARDIS arrives in San Francisco on New Year’s Eve 1999, where the Doctor is critically wounded in a gangland gun battle. At the local hospital, Dr. Grace Holloway fights--and fails--to save his life. Later, in the morgue, the Doctor wakes up a new man. But he is not the only one--the Master has also found himself a new body. As the clock counts down to the start of the new millennium, can the Doctor stop his oldest enemy from destroying all life on Earth?', 'Amazon.com', \"Made to re-launch television's most famous time traveler,\", 'Doctor Who: The Movie', \"is an expensive feature-length episode which attempts to continue the classic series and work as a stand-alone film. Transporting the remains of the Master, Sylvester McCoy's Seventh Doctor is diverted to San Francisco in 1999. Regenerating in the form of Paul McGann, the Doctor gains a new companion in heart surgeon Dr. Grace Holloway (Daphne Ashbrook) and must stop the Master from destroying the world. All of which might have been fine, had not the most eccentrically British of programs been almost entirely assimilated by the requirements of American network broadcasting. Matthew Jacobs' screenplay is literally nonsense, dependent on arbitrary, unexplained events while introducing numerous elements that contradict established Doctor Who mythology. The Tardis is re-imagined as a bizarre pre-Raphaelite/Gothic folly, while the Doctor, now half-human, becomes romantically involved with his lady companion. From the West Coast setting to metallic CGI morphing, from the look of Eric Roberts as the Master to a motorcycle/truck freeway chase, director Geoffrey Sax borrows freely from James Cameron's\", 'Terminator 2: Judgment Day', '(1991). Doctor Who fans should feel relieved this travesty was not successful enough to lead to a series, though McGann himself does have the potential to make a fine Doctor.', '--Gary S Dalkin']\n{'Format': 'Multiple Formats, Color, Full Screen, NTSC, Original recording remastered, Special Edition', 'Contributor': 'Glen MacPherson, Geoffrey Sax, Peter V Ware, Paul McGann, Eric Roberts, Daphne Ashbrook, Matthew JacobsGlen MacPherson, Geoffrey Sax, Peter V Ware, Paul McGann, Eric Roberts, Daphne Ashbrook, Matthew Jacobs   See more', 'Language': 'English', 'Runtime': '1 hour and 26 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '5.3 x 0.6 x 7.5 inches; 4 Ounces', 'Director': 'Geoffrey Sax', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Original recording remastered, Special Edition', 'Run time': '1 hour and 26 minutes', 'Release date': 'February 8, 2011', 'Actors': 'Paul McGann, Daphne Ashbrook, Eric Roberts', 'Producers': 'Peter V Ware', 'Studio': 'BBC Home Entertainment', 'Writers': 'Matthew Jacobs', 'Number of discs': '2'}\nI recently purchased this Wonderful Movie on DVD \"Doctor Who: The Movie (Special Edition)\" and I am very glad that I did!!!! I had originally watched this Fox TV movie back in 1996, but was not able to view it again because I no longer had a working VCR (I had recorded the film myself when it aired). I think that I still own the old VHS tape that I made with the move on it.. but no longer have a VCR.  I have been a huge fan of Doctor Who for years,  so I really wanted to re-visit this special program !!!!!!! The Move was great.. even better than I had remembered it !!!!! I have not yet watched all of the special features on disc 2.. but what I have seen were interesting segments !!!!! In order to watch the DVD on my Windows 10 PC I had to download a free DVD player app from the Windows store called \"Any Player\". (I do not have a DVD player) It was a really enjoyable film !!!!!!\nWonderful DVD Movie..",
  "actual_interaction": {
    "rating": 5.0,
    "title": "Wonderful DVD Movie..",
    "text": "I recently purchased this Wonderful Movie on DVD \"Doctor Who: The Movie (Special Edition)\" and I am very glad that I did!!!! I had originally watched this Fox TV movie back in 1996, but was not able to view it again because I no longer had a working VCR (I had recorded the film myself when it aired). I think that I still own the old VHS tape that I made with the move on it.. but no longer have a VCR.  I have been a huge fan of Doctor Who for years,  so I really wanted to re-visit this special program !!!!!!! The Move was great.. even better than I had remembered it !!!!! I have not yet watched all of the special features on disc 2.. but what I have seen were interesting segments !!!!! In order to watch the DVD on my Windows 10 PC I had to download a free DVD player app from the Windows store called \"Any Player\". (I do not have a DVD player) It was a really enjoyable film !!!!!!",
    "images": [],
    "asin": "B0049S1NYG",
    "parent_asin": "B0049S1NYG",
    "user_id": "AHTBBASAHXHHOXKLSSZG2IPUDDFA",
    "timestamp": "2020-01-07 22:14:26.245000",
    "helpful_vote": 5,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Doctor Who: The Movie (Special Edition)",
    "average_rating": 4.4,
    "rating_number": 1391,
    "features": [],
    "description": [
      "Product Description",
      "This highly requested TV movie aired on Fox on May 14, 1995, and is available on North American video for the first time. The Doctor is returning home to Gallifrey with the remains of his arch-nemesis, the Master. Forced off course, the TARDIS arrives in San Francisco on New Year’s Eve 1999, where the Doctor is critically wounded in a gangland gun battle. At the local hospital, Dr. Grace Holloway fights--and fails--to save his life. Later, in the morgue, the Doctor wakes up a new man. But he is not the only one--the Master has also found himself a new body. As the clock counts down to the start of the new millennium, can the Doctor stop his oldest enemy from destroying all life on Earth?",
      "Amazon.com",
      "Made to re-launch television's most famous time traveler,",
      "Doctor Who: The Movie",
      "is an expensive feature-length episode which attempts to continue the classic series and work as a stand-alone film. Transporting the remains of the Master, Sylvester McCoy's Seventh Doctor is diverted to San Francisco in 1999. Regenerating in the form of Paul McGann, the Doctor gains a new companion in heart surgeon Dr. Grace Holloway (Daphne Ashbrook) and must stop the Master from destroying the world. All of which might have been fine, had not the most eccentrically British of programs been almost entirely assimilated by the requirements of American network broadcasting. Matthew Jacobs' screenplay is literally nonsense, dependent on arbitrary, unexplained events while introducing numerous elements that contradict established Doctor Who mythology. The Tardis is re-imagined as a bizarre pre-Raphaelite/Gothic folly, while the Doctor, now half-human, becomes romantically involved with his lady companion. From the West Coast setting to metallic CGI morphing, from the look of Eric Roberts as the Master to a motorcycle/truck freeway chase, director Geoffrey Sax borrows freely from James Cameron's",
      "Terminator 2: Judgment Day",
      "(1991). Doctor Who fans should feel relieved this travesty was not successful enough to lead to a series, though McGann himself does have the potential to make a fine Doctor.",
      "--Gary S Dalkin"
    ],
    "price": 50.0,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51tMtdTjhiL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51tMtdTjhiL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/81t6J+VYzBL._SL1500_.jpg"
      }
    ],
    "videos": [],
    "store": "Paul McGann  (Actor),     Daphne Ashbrook  (Actor),     Geoffrey Sax  (Director)    &                   0                  more   Rated:    NR    Format: DVD",
    "categories": [
      "Movies & TV",
      "BBC",
      "All BBC Titles"
    ],
    "details": {
      "Format": "Multiple Formats, Color, Full Screen, NTSC, Original recording remastered, Special Edition",
      "Contributor": "Glen MacPherson, Geoffrey Sax, Peter V Ware, Paul McGann, Eric Roberts, Daphne Ashbrook, Matthew JacobsGlen MacPherson, Geoffrey Sax, Peter V Ware, Paul McGann, Eric Roberts, Daphne Ashbrook, Matthew Jacobs   See more",
      "Language": "English",
      "Runtime": "1 hour and 26 minutes",
      "Aspect Ratio": "1.33:1",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "NR (Not Rated)",
      "Product Dimensions": "5.3 x 0.6 x 7.5 inches; 4 Ounces",
      "Director": "Geoffrey Sax",
      "Media Format": "Multiple Formats, Color, Full Screen, NTSC, Original recording remastered, Special Edition",
      "Run time": "1 hour and 26 minutes",
      "Release date": "February 8, 2011",
      "Actors": "Paul McGann, Daphne Ashbrook, Eric Roberts",
      "Producers": "Peter V Ware",
      "Studio": "BBC Home Entertainment",
      "Writers": "Matthew Jacobs",
      "Number of discs": "2"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}