{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/06/23\nAverage Rating: 4.5\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Takuya Igarashi', 'Yasuhiro Irie', 'Tensai Okamura', 'Takefumi Anzai', 'Shin Matsuo', 'Ikurô Satô', 'Daisuke Chiba', 'Shingo Kaneko', 'Yoshiyuki Asai', 'Toshinori Narita']}\nReview Text: I just purchased a few of my Favorite Episodes of the Anime &#34;Soul Eater&#34; using Amazon Instant Video, and I want to say that I am very pleased! I have always enjoyed this animated series.. &#34;Soul Eater&#34; is a very funny and engaging show with very memorable characters.<br /><br />It is nice to have a few of my most favorite episodes to watch when ever I want. The quality of the videos is, in my opinion, excellent!\nReview Title: Very Nice Series!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Coming Home VHS\nJane Fonda  (Actor),     Jon Voight  (Actor),     Hal Ashby  (Director)    &                   0                  more   Rated:    R    Format: VHS Tape\nMovies & TV, Studio Specials, MGM Home Entertainment, All MGM Titles\n['Amazon.com', \"Both Jane Fonda and Jon Voight won Oscars for their performances in this profoundly moving 1978 flick dealing with the aftereffects of the Vietnam War. Fonda, feeling isolated while her hawkish husband, Bruce Dern, is away in Vietnam, follows a friend's example and volunteers at a veteran's hospital. There she is reacquainted with Voight, an old friend who has returned from the war as a paraplegic. Lonely and disconnected from her husband, Fonda finds love, and fulfilling sex, with Voight. The sex scenes, very steamy for the time, are still provocative. This mature love story is about expanding your horizons, and is both moving and thoughtful. Director Hal Ashby (\", 'Harold and Maude', ') does succumb to melodrama on occasion, but these are forgivable slips.', \"--Rochelle O'Gorman\"]\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Hal Ashby', 'Run time': '2 hours and 7 minutes', 'Release date': 'July 8, 1997', 'Date First Available': 'September 29, 2006', 'Actors': 'Jane Fonda, Jon Voight, Bruce Dern, Penelope Milford, Robert Carradine', 'Studio': 'MGM (Video & DVD)', 'Producers': 'Bruce Gilbert, Jerome Hellman', 'Writers': 'Nancy Dowd, Robert C. Jones, Rudy Wurlitzer, Waldo Salt'}\nI bought this VHS tape as a gift for a good friend of mine. She had owned a copy of it and was very happy to get another one!\nVery Nice!\nA Star Is Born VHS\nBarbra Streisand  (Actor),     Kris Kristofferson  (Actor),     Frank Pierson  (Director, Writer)    &                   0                  more   Rated:    R    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Drama\n['Product description', 'Guaranteed to work or your money back - PLEASE NOTE ALL MONIES FROM THIS SALE GO TO A 501 (C)3 NO KILL ANIMAL SHELTER', 'Amazon.com', 'This film actually began with the idea of remaking', 'A Star Is Born', 'with the then-hot couple James Taylor and Carly Simon. Eventually, it evolved into this vanity production for Barbra Streisand, with Kris Kristofferson as the designated stud muffin. The story remains the same: A superstar on the decline meets a young singer on the way up. They marry as their career trajectories intersect, and his eventual demise is meant as a sacrifice to further boost her career by ridding her of the burden of him. Kristofferson\\'s rock & roll numbers are decidedly lousy--Hollywood\\'s idea of rock music--and Streisand looks good and always sounds fine (she won an Oscar for cowriting the song \"Evergreen\"). But you can feel her heavy hand guiding every shot; she seems to serve as puppet master for director Frank Pierson, framing every image of herself for maximum glow. The ultimate date flick (if the guy can sit still through it).', '--Marshall Fine']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Director': 'Frank Pierson', 'Run time': '2 hours and 19 minutes', 'Release date': 'April 15, 1992', 'Date First Available': 'December 7, 2006', 'Actors': 'Barbra Streisand, Kris Kristofferson, Gary Busey, Oliver Clark, Venetta Fields', 'Studio': 'Warner Home Video', 'Writers': 'Alvin Sargent, Frank Pierson, Jay Presson Allen, Joan Didion, John Gregory Dunne'}\nI purchased this VHS tape as a gift for a friend. She had owned a copy of it some time ago.. and was hoping to get another one!\nVery Nice!\n{'Subtitles': ['None available'], 'Directors': ['Takuya Igarashi', 'Yasuhiro Irie', 'Tensai Okamura', 'Takefumi Anzai', 'Shin Matsuo', 'Ikurô Satô', 'Daisuke Chiba', 'Shingo Kaneko', 'Yoshiyuki Asai', 'Toshinori Narita']}\nI just purchased a few of my Favorite Episodes of the Anime &#34;Soul Eater&#34; using Amazon Instant Video, and I want to say that I am very pleased! I have always enjoyed this animated series.. &#34;Soul Eater&#34; is a very funny and engaging show with very memorable characters.<br /><br />It is nice to have a few of my most favorite episodes to watch when ever I want. The quality of the videos is, in my opinion, excellent!\nVery Nice Series!",
  "profile": "**Updated User Profile Summary:**\n\n- **Primary Interest:** The user maintains a strong affinity for classic films with complex narratives and emotional depth, while also appreciating animated series that offer humor and engaging characters, reflecting a broadening interest in storytelling across different formats.\n\n- **Media Format Preference:** The user's preference for vintage formats, especially VHS tapes, showcases their nostalgic appreciation for physical media and collecting. They have recently expanded their engagement with digital platforms, demonstrating a willingness to adapt to new formats while still cherishing traditional ones.\n\n- **Interpersonal Connection:** The user remains thoughtful and considerate, including sharing experiences through gifting meaningful cinematic titles. Their enjoyment of sharing beloved content with friends further emphasizes their desire for connection through film and animation.\n\n- **Content Appreciation:** The user values mature themes in cinema, alongside the humor and charm found in animated series. They consistently rate content highly when it resonates personally, indicating a strong emotional engagement with the stories they choose.\n\n- **Rating Tendencies:** The user typically gives high ratings to films and shows that they are passionate about, emphasizing recognition of quality and supporting notable releases with significant cultural impact.\n\nOverall, this user cherishes profound cinematic and animated experiences, enjoys the nostalgia of vintage formats, and finds joy in sharing those experiences with others, while expanding their collection to include a variety of storytelling mediums.",
  "metrics": {
    "rouge1_f": 0.19311875693673697,
    "rouge2_f": 0.011123470522803113,
    "rougeL_f": 0.08435072142064375,
    "meteor": 0.0745710678291712,
    "bleu1": 0.03205025938145319,
    "bleu2": 0.0072157968362611185,
    "bleu3": 0.0011929914771952844,
    "bleu4": 0.00048552253928674916,
    "bertscore_precision": 0.3455907106399536,
    "bertscore_recall": 0.4606555104255676,
    "bertscore_f1": 0.3949122726917267
  }
}