{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nReview Date: 2020/09/24\nStore: AILIWEI\nAverage Rating: 3.7\nProduct Details: {'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nReview Text: I've been picking up things for our Halloween costumes (even if we will just be enjoying together at home), and this is one of the things I added to our costumes barrel.<br /><br />The wig went on well and was tried on by most members of my family. It is tight enough to keep the hairline from showing and stays put.<br /><br />The hair quality, itself, is great! I am no wig expert (can count on one hand the times I've worn one), but this seems like a nice wig.\nReview Title: Nice wig!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "24K Gold Under Eye Mask– 20 Pairs- Under Eye Patches with Face Massager Roller, Anti-Aging Hyaluronic Acid Collagen Eye Masks for Dark Circles and Puffiness Dark Under Eyes Treatment\nFRLEDM\n{'Package Dimensions': '7.4 x 6.8 x 1.1 inches; 1.2 Pounds', 'Batteries': '1 AA batteries required. (included)', 'UPC': '616985543564', 'Manufacturer': 'FRLEDM'}\nI love using eye masks, so I got this, because there were 20 pairs in the box, which is a really good deal for the price. I also liked the ingredients listed. But after receiving this, I'm a little disappointed, because it says, \"Main Ingredients\" and it doesn't have a list of all the ingredients anywhere. So, I do wonder what else is in these.<br /><br />Saying that - these stay on well, didn't bother my skin left my eye area soft. So, yes, a list of ingredients would've been nice, but I like them anyway.<br /><br />As far as the vibrating facial massager wand - I didn't expect to use it, because I use stone rollers and stones on my face, but I can see this helping with lymphatic and sinus drainage, so I'll keep it on hand for that. It's actually a pretty nifty little gadget that takes a normal sized battery (and comes with it), so I kind of like it. :)\nGreat value for good eye masks.\nGIOVANNI Hemp Hydrating Hair Shine Spray, 4.3 oz. - Hemp Seed Oil, Aloe Vera, Frankincense Helps Stimulate Moisturize & Revitalize Damaged Hair, No Parabens, Color Safe, Lauryl & Laureth Sulfate Free\nGIOVANNI\n['GIOVANNI Hemp Hydrating Hair Shine Spray creates gloss that rocks, with a smooth surface that talks. This Mist will seal in any hairstyle, bridging the gap between natural and salon quality. GIOVANNI was the first full-range, salon-inspired hair-care brand in natural product stores, and today is the #1 selling Hair Care* lines in the United States Natural Products Industry. But before there was a brand, there was a pioneer. Arthur Guidotti had a vision and a love for all things hair. He began developing his passion as a hairstylist in Hollywood and Beverly Hills. By the 1960s, Arthur was maturing his talents and decided to open his own salon, called On Sunset. The salon was a bustling site, on the famous Sunset Strip, and a hit with many Hollywood celebrities, including Lucille Ball. Since 1979 the GIOVANNI Rule of Balance has been our commitment to make each product as pure and as natural as possible without sacrificing exceptional product performance. GIOVANNI is committed to creating only the highest-performance formulations, wrapped in aesthetically beautiful packaging and marketed with extraordinary visuals and graphics.*According to SPINs.']\n{'Product Benefits': 'Frizz Control, Shine', 'Hair Type': 'All', 'Scent': 'Frankincense', 'Liquid Volume': '5.6 Fluid Ounces', 'Item Form': 'Spray', 'Product Dimensions': '2 x 2 x 4.75 inches; 5.6 Ounces', 'Item model number': '18640', 'UPC': '716237186409', 'Manufacturer': 'AmazonUs/GIOR7', 'Country of Origin': 'USA'}\nI have curly, dry, frizzy hair that needs lots of additional conditioning and is NEVER shiny. I'm always looking for products that add moisture, shine, and control to my hair.<br /><br />I use the GIOVANNI Mousse Air-Turbo Charged Hair Styling Foam and really like it, so I was excited to try another GIOVANNI product. I like spraying this Hemp Hydrating Hair Shine on my dry hair, and it really does add shine. I also love the scent. It smells yummy. I also like to comb it through my hair to put my hair back in a ponytail. It tames the frizz just a bit.<br /><br />The bottle did come with oil covering the outside, but it's been over 100 degrees here, so it might've just been affected by the heat in travel. It cleaned off fine (and it was inside a ziplock bag).\nMakes my hair shiny\n24 Inches Synthetic Long Curly Blonde Wig Natural Wavy Hair NONE Lace Heat Resistant Wigs for Women Cosplay Costume\nAILIWEI\n{'Item Dimensions LxWxH': '6.69 x 3.94 x 1.97 inches', 'Hair Type': 'Wavy, Curly', 'Special Feature': 'Heat Resistant', 'Brand': 'AILIWEI', 'Age Range (Description)': 'Adult', 'Product Dimensions': '6.69 x 3.94 x 1.97 inches; 9.59 Ounces', 'UPC': '710731915817'}\nI've been picking up things for our Halloween costumes (even if we will just be enjoying together at home), and this is one of the things I added to our costumes barrel.<br /><br />The wig went on well and was tried on by most members of my family. It is tight enough to keep the hairline from showing and stays put.<br /><br />The hair quality, itself, is great! I am no wig expert (can count on one hand the times I've worn one), but this seems like a nice wig.\nNice wig!",
  "profile": "**User Profile Summary:**\n\n- **Product Interest:** The user has a strong focus on eye care, particularly under-eye treatments, while also expressing a growing interest in hair care products, specifically those that enhance shine and manage frizz. Recent purchases indicate a curiosity about wigs for costume purposes, highlighting a willingness to experiment with different hair appearances.\n- **Value Seeker:** Prefers cost-effective products and has demonstrated loyalty to brands that offer desirable benefits and quality, often purchasing items in bulk and trying multiple products from the same brand. The user is also proactive in seeking products for specific occasions like Halloween.\n- **Ingredient Consciousness:** Values transparency in ingredient listings and feels more comfortable with products that are free from harmful additives. The user appreciates formulations that prioritize natural ingredients but also shows flexibility by exploring various hair-related items, including synthetic products for temporary use.\n- **Sensory Sensitivity:** Prefers products that feel good on the skin or hair, emphasizing moisture, shine, and manageability without irritation.\n- **Preference for Tools and Multipurpose Products:** Shows interest in facial tools like massagers and is open to products that serve diverse functions, including styling and moisturizing benefits.\n- **Trends:** Demonstrates a commitment to quality and effectiveness across skincare and hair care routines, displaying satisfaction with products that deliver visible results and enjoyable scents, and exploring new options for family activities.\n\nOverall, the user maintains a comprehensive approach to personal care, balancing interests in skincare and hair care while prioritizing value, quality, and ingredient integrity.",
  "metrics": {
    "rouge1_f": 0.24785510009532888,
    "rouge2_f": 0.02292263610315186,
    "rougeL_f": 0.10104861773117253,
    "meteor": 0.09423132927688345,
    "bleu1": 0.0426518035086308,
    "bleu2": 0.014347075355124111,
    "bleu3": 0.005841454802727049,
    "bleu4": 0.0033707956398355172,
    "bertscore_precision": 0.3931026756763458,
    "bertscore_recall": 0.5019558668136597,
    "bertscore_f1": 0.4409101605415344
  }
}