{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 24K Gold Under Eye Mask– 20 Pairs- Under Eye Patches with Face Massager Roller, Anti-Aging Hyaluronic Acid Collagen Eye Masks for Dark Circles and Puffiness Dark Under Eyes Treatment\nReview Date: 2020/09/05\nStore: FRLEDM\nAverage Rating: 4.2\nProduct Details: {'Package Dimensions': '7.4 x 6.8 x 1.1 inches; 1.2 Pounds', 'Batteries': '1 AA batteries required. (included)', 'UPC': '616985543564', 'Manufacturer': 'FRLEDM'}\nReview Text: I love using eye masks, so I got this, because there were 20 pairs in the box, which is a really good deal for the price. I also liked the ingredients listed. But after receiving this, I'm a little disappointed, because it says, \"Main Ingredients\" and it doesn't have a list of all the ingredients anywhere. So, I do wonder what else is in these.<br /><br />Saying that - these stay on well, didn't bother my skin left my eye area soft. So, yes, a list of ingredients would've been nice, but I like them anyway.<br /><br />As far as the vibrating facial massager wand - I didn't expect to use it, because I use stone rollers and stones on my face, but I can see this helping with lymphatic and sinus drainage, so I'll keep it on hand for that. It's actually a pretty nifty little gadget that takes a normal sized battery (and comes with it), so I kind of like it. :)\nReview Title: Great value for good eye masks.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "24K Gold Under Eye Mask– 20 Pairs- Under Eye Patches with Face Massager Roller, Anti-Aging Hyaluronic Acid Collagen Eye Masks for Dark Circles and Puffiness Dark Under Eyes Treatment\nFRLEDM\n{'Package Dimensions': '7.4 x 6.8 x 1.1 inches; 1.2 Pounds', 'Batteries': '1 AA batteries required. (included)', 'UPC': '616985543564', 'Manufacturer': 'FRLEDM'}\nI love using eye masks, so I got this, because there were 20 pairs in the box, which is a really good deal for the price. I also liked the ingredients listed. But after receiving this, I'm a little disappointed, because it says, \"Main Ingredients\" and it doesn't have a list of all the ingredients anywhere. So, I do wonder what else is in these.<br /><br />Saying that - these stay on well, didn't bother my skin left my eye area soft. So, yes, a list of ingredients would've been nice, but I like them anyway.<br /><br />As far as the vibrating facial massager wand - I didn't expect to use it, because I use stone rollers and stones on my face, but I can see this helping with lymphatic and sinus drainage, so I'll keep it on hand for that. It's actually a pretty nifty little gadget that takes a normal sized battery (and comes with it), so I kind of like it. :)\nGreat value for good eye masks.",
  "profile": "**User Profile Summary:**\n\n- **Product Interest:** Eye care, particularly under-eye treatments such as masks.\n- **Value Seeker:** Prefers products that offer good value for money, as evidenced by purchasing items in bulk (20 pairs).\n- **Ingredient Consciousness:** Values transparency in product ingredients and expresses concern when details are not provided.\n- **Sensory Sensitivity:** Pays attention to how products feel on the skin, favoring those that do not cause irritation.\n- **Preference for Tools:** Shows an interest in facial tools, such as massagers and rollers, indicating openness to exploring new skincare gadgets.\n- **Practicality:** Appreciates multifunctionality, as seen in the enjoyment of the massager for lymphatic and sinus drainage, despite typically using different tools.\n\n**Trends:**\n- Emphasizes quality and effectiveness in skincare.\n- Shows a willingness to try complementary products that enhance the skincare routine.\n- Expresses satisfaction with products that deliver results despite some reservations about transparency.\n\nOverall, the user demonstrates a keen interest in skincare, particularly products that enhance the under-eye area, balanced with a focus on value and ingredient transparency.",
  "metrics": {
    "rouge1_f": 0.2770780856423174,
    "rouge2_f": 0.055696202531645575,
    "rougeL_f": 0.1309823677581864,
    "meteor": 0.15823742736998908,
    "bleu1": 0.2391195247561811,
    "bleu2": 0.07987736913034427,
    "bleu3": 0.04002454388653253,
    "bleu4": 0.025628541852681763,
    "bertscore_precision": 0.424563467502594,
    "bertscore_recall": 0.4607548415660858,
    "bertscore_f1": 0.4419194161891937
  }
}