{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: L'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones\nReview Date: 2022/07/27\nStore: L'ANGE HAIR\nAverage Rating: 4.3\nProduct Details: {'Brand': \"L'ANGE HAIR\", 'Item Form': 'Cream', 'Skin Type': 'Dry', 'Product Benefits': 'Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more', 'Material Feature': 'Natural', 'Product Dimensions': '2.9 x 2.9 x 2.5 inches; 6.38 Ounces', 'UPC': '810108190721', 'Manufacturer': \"L'ANGE HAIR\"}\nReview Text: I liked using L’ange’s exfoliar purifying scalp scrub. It helped to get rid of buildup while also gently exfoliating the scalp. It’s paraben and silicone-free, but it’s not sulfate-free. I would be careful to not over-use this product, since sulfates can really dry and damage your hair.\nReview Title: Read the instructions, use for no longer than 2 minutes!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Blonde Tape in Hair Extensions Human Hair 20pcs/50g 14in Tape in Platinum Blonde Hair Extensions Remy Human Hair Straight For Women With Salon Style\nLaaVoo\n{'Brand': 'LaaVoo', 'Color': 'Platinum blonde', 'Material': 'Human Hair', 'Extension Length': '14 Inches', 'Hair Type': 'Straight', 'Product Dimensions': '14 x 1 x 1 inches; 1.76 Ounces'}\nThese hair extensions are gorgeous and the hair itself is good quality. My only complaint is how weak the tape is. I’ve only had them on for a couple days before the first one fell off. I’ve never had tape extensions fall off this soon. It seems this is anticipated as the box comes with replacement tapes.\nSoft hair, weak tape\nUltimate Essentials Kit\n{'Brand': 'Olaplex', 'Item Form': 'Liquid', 'Hair Type': 'Damaged', 'Age Range (Description)': 'Adult', 'Product Benefits': 'Repairs, Strengthens & Protects hair. Restores texture. Adds shine.', 'Product Dimensions': '6 x 1.38 x 4.88 inches; 7.83 Ounces', 'UPC': '850018802420', 'Manufacturer': 'Olaplex'}\nThe kit comes with No. 0, 3, 4, 5, and 8. No. 1 and 2 are only for professional use, thus why they are not included. Like how the numbers imply, start with No.0 and work upward. Everything included in the kit has little-to-no scent. My favorite has to be No.3. I saw the most change in my hair after using it. Despite my hair being damaged, No.3 made it appear healthier. The items in this kid are small, making them perfect for traveling.\nHair repair kit\nL'ANGE HAIR Exfolier Purifying Scalp Scrub | Gentle Cleansing Salt Scrub for Scalp | Helps Exfoliate, Balance, and Hydrate Scalp | Free of Parabens and Silicones\nL'ANGE HAIR\n{'Brand': \"L'ANGE HAIR\", 'Item Form': 'Cream', 'Skin Type': 'Dry', 'Product Benefits': 'Targets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores bodyTargets buildup and impurities, nourishes hair and scalp, gently cleanses and exfoliates, soothes and restores body  See more', 'Material Feature': 'Natural', 'Product Dimensions': '2.9 x 2.9 x 2.5 inches; 6.38 Ounces', 'UPC': '810108190721', 'Manufacturer': \"L'ANGE HAIR\"}\nI liked using L’ange’s exfoliar purifying scalp scrub. It helped to get rid of buildup while also gently exfoliating the scalp. It’s paraben and silicone-free, but it’s not sulfate-free. I would be careful to not over-use this product, since sulfates can really dry and damage your hair.\nRead the instructions, use for no longer than 2 minutes!",
  "profile": "**User Profile Summary:**\n\n- **Hair Extensions Preference:** The user prefers high-quality human hair extensions that blend seamlessly, focusing on platinum blonde shades and straight styles.\n\n- **Quality Concerns:** The user is sensitive to product durability and attachment methods' effectiveness, placing strong emphasis on performance and reliability.\n\n- **Rating Behavior:** Typically valuing quality, the user's balanced evaluation approach reflects a tendency to express disappointment when products fall short, resulting in an average rating of 3.0.\n\n- **Replacement Options:** Their proactive nature is evident as they seek solutions for product issues, favoring brands that offer replacement options.\n\n- **Hair Care Products:** Recently, the user has shown interest in products that enhance hair health and appearance, including a hair repair kit that significantly improved their hair texture and shine. Their latest purchase, a scalp scrub, also aligns with their focus on quality and functionality, offering effective cleansing while adhering to their preference for natural ingredients.\n\n- **Caution with Ingredients:** The user is cautious about certain ingredients, particularly sulfates, which they believe may harm their hair with overuse, reflecting a desire to maintain hair health.\n\nOverall, the user values high-quality hair extensions and care products that enhance aesthetics and ensure dependable performance, highlighting a comprehensive approach to hair health and beauty.",
  "metrics": {
    "rouge1_f": 0.2642740619902121,
    "rouge2_f": 0.02618657937806874,
    "rougeL_f": 0.13376835236541598,
    "meteor": 0.10608624134818102,
    "bleu1": 0.12213767580042956,
    "bleu2": 0.028683277183261524,
    "bleu3": 0.0048096159079584,
    "bleu4": 0.0019713407296275067,
    "bertscore_precision": 0.37730586528778076,
    "bertscore_recall": 0.44791585206985474,
    "bertscore_f1": 0.4095900058746338
  }
}