{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Team America: World Police\nReview Date: 2017/12/09\nStore: Trey Parker  (Actor),     Matt Stone  (Actor)    Rated:    R    Format: Blu-ray\nCategories: Movies & TV, Blu-ray, Movies\nProduct Description: ['Using puppetry techniques inspired by Gerry Anderson\\'s Supermarionation sagas, \"South Park\" creators Trey Parker and Matt Stone skewer U.S. politics and celebrity activism with their hilarious and controversial satire about a high-tech international law enforcement agency that recruits a renowned Broadway thespian to help them mount a series of ill-conceived anti-terrorist campaigns. Parker and Stone provide voices along with Kristen Miller, Daran Norris. 98 min. Widescreen (Enhanced); Soundtracks: English DTS HD 5.1 Master Audio, French Dolby Digital 5.1, Spanish Dolby Digital 5.1; Subtitles: English (SDH), French, Spanish.']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Anime & Manga, Comedy', 'Format': 'AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen', 'Contributor': 'Trey Parker, Matt Stone', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Media Format': 'AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'August 29, 2017', 'Actors': 'Trey Parker, Matt Stone', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, Japanese, Italian, German, Portuguese, English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I'm Matt Damon! I'm Matt Damon!<br /><br />Fabulous skewering of our sacred cow celebrities.\nReview Title: Deserved Skewering of Hollywood Celebrities\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Arrival [Blu-ray]\nRon Silver  (Actor),     Charlie Sheen  (Actor),     David N. Twohy  (Director),     David Twohy  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Mystery & Thrillers\n['Zane Ziminski is an astrophysicist who receives a message that seems to have extraterrestrial origins. Eerily soon after his discovery, Zane is fired. He then embarks on a search to determine the origins of the transmission that leads him into a Hitchcockian labyrinth of paranoia and intrigue.']\n{'Genre': 'Mystery', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Original recording remastered, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Original recording remastered, Widescreen   See more', 'Contributor': 'David N. Twohy, Catalina Botello, Phyllis Applegate, Roger Cudney, Tony Johnson, David Twohy, Ron Silver, Ángel de la Peña, Thomas Smith, Richard Schiff, Alan Coates, Leon Rippy, Javier Morga, Jorge Becerril, Luisa Huertas, Dave Galasso, James Steele, Alejandro Usigli, Shane, Jorge Zepeda, Andrea Sisniega, Monica Dionne, Maria Coronel, David Villalpando, Charlie Sheen, Jacqueline Voltaire, Ellen Bradley, José Garcia, Buddy Joe Hooker, Georg Lillitsch, Teri Polo, Ree Johnson, Lindsay CrouseDavid N. Twohy, Catalina Botello, Phyllis Applegate, Roger Cudney, Tony Johnson, David Twohy, Ron Silver, Ángel de la Peña, Thomas Smith, Richard Schiff, Alan Coates, Leon Rippy, Javier Morga, Jorge Becerril, Luisa Huertas, Dave Galasso, James Steele, Alejandro Usigli, S…   See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT25338BR', 'Director': 'David N. Twohy, David Twohy', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Original recording remastered, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Ron Silver, Charlie Sheen, Lindsay Crouse, Richard Schiff, Shane', 'Producers': 'James Steele, Thomas Smith', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI saw this by accident on FiOS. What a stinker. Plot is awful. Characters thin. Effects cheesy. \"Sets\" phony. The very idea of buying this on Blu-ray is laughable. Sheen is a joke. He should stick to what he knows: one-line sex jokes, hookers and beating up his wives.<br /><br />This is a third world-produced \"film\" that should have gone straight to video that I'd perhaps buy used for $1 at a garage sale, and then throw away to save space. This makes Plan 9 From Outer Space look plausible.<br /><br />Man am I glad I saw it on a backwater channel and didn't put any money out on this turkey, even as a rental. There is no doubt why it failed at the box office. It would have failed at 2:00 AM on Syfy channel.<br /><br />If this is what passes for good sci-fi, y'all have a pretty low threshold for quality.\nStinker\nAmerican Horror Story: Season 1\nConnie Britton  (Actor),     Dylan McDermott  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n[\"Brace yourself for an addictive thrill ride! American Horror Story is TV's most original new drama, a deeply stylish psychosexual haunt devised to keep you on the edge of your seat. The Harmon's (Dylan McDermott, Connie Britton) fresh start in a new home deviously twists to reveal discoveries of love, sex and murderous revenge. Featuring a Golden Globe(R) -winning performance by Jessica Lange, Season One scares up a host of engrossing extras.\"]\n{'Genre': 'Television, Horror/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Dylan McDermott, Connie Britton', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 4.96 Ounces', 'Item model number': '4608409810465', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 54 minutes', 'Release date': 'September 25, 2012', 'Actors': 'Connie Britton, Dylan McDermott', 'Subtitles': 'Spanish, English, French', 'Studio': 'FX', 'Number of discs': '4'}\nWhy did Moira O'Hara age after her death? None of the other characters aged. And she became two characters of different age while other characters stayed at the age and level of maturity they were when they died.<br /><br />And everybody else kept their death wounds. Young Moira was shot through the right eye. Old Moira had that bum eye, but young Moira had both eyes.<br /><br />This is Really Important. Or not.\nOne question...\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nHunger Games is a video game that meets American Idol. I honestly don't understand the attraction. My wife loved it, though. Got involved with the characters, I suppose. I could not make it through the first episode. Wife watched them all.<br /><br />Come on: virtual wild animals on demand? Medicine packs that heal wounds rapidly? Really? You mean like video game &#34;health&#34; modules? Wide variety of weapons to choose from as you run across the field? Enemies to defeat within a pre-described battlefield? Rules changing on a whim?<br /><br />Paper thin plot.\nCross between American Idol and any given video game\nThe Martian\nScience Fiction, Drama, Anxious, Biting\n['From legendary director Ridley Scott (Alien, Prometheus) comes a gripping tale of human strength and the will to survive, starring Matt Damon as an astronaut stranded on Mars.']\n{'Content advisory': ['Nudity', 'violence', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ridley Scott'], 'Producers': ['Simon Kinberg', 'Ridley Scott', 'Michael Schaeffer', 'Aditya Sood', 'Mark Huffam'], 'Starring': ['Matt Damon', 'Jessica Chastain', 'Kristen Wiig']}\nYou mean to tell me that our thoroughly professional and very capable aerospace engineers could not predict that the escape vehicle might be subject to Martian storms that could knock the vehicle over? Have they not heard of guy wires? And why did the other vehicle survive?<br /><br />Fun movie otherwise.\nWhat? Nobody Thought of Guy Wires?\nAIX Records - Blu-Ray Audio Calibration Disc and HD Music Sampler\nFormat: Blu-ray\nMovies & TV, Blu-ray, Movies\n[\"This is the first Blu-Ray disc that AIX Records has produced. Finally, AIX Records is able to combine its high definition, surround music tracks with the high definition video that AIX Records shoots during out sessions. * System Calibration Introduction presented by Mark Waldrep * System Setup Tutorial, presented by Mark Waldrep * Channel Idenitifcation Tests, 7.1, 5.1, 2.0 * Speaker Balance Tests, 7.1, 5.1, 2.0 * Speaker Phase Tests Check the phase of each speaker pair * Frequency Sweep Tests Test for rattles or room nodes * Subwoofer Sweep TestTest for low frequency rumble * Subwoofer Crossover Test Check your crossover frequency * John Gorka Mercy of the Wheels * Lisbeth Scott, Let Me * Carl Verheyen, Henry's Farm * The AIX All Stars, Pachelbel Acoustica * The Banda Brothers with Destani Wolf Primavera * Albert Lee Luxury Liner * Chamber Music Palisades Shostakovich Piano Quintet Op. 57\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.88 Ounces', 'Media Format': 'HiFi Sound'}\nThis is primarily an AIX ad to demonstrate high def music recorded in surround, but in the Setup section many useful tools are provided to check setup of both 5.1 and 7.1 surround systems.<br /><br />It's also an excellent primer on surround in general, HDMI cables, proper layout of speakers and bass management -- how subwoofers are to integrat with the satellite speakers seamlessly.<br /><br />Be careful not to run your volume too high as the frequency sweeps play. You could blow a speaker, especially if you set your amp to assume your satellite speakers are &#34;large,&#34; which sends full-frequency signal power to all speaker instead of sending the bass frequencies and their power to the sub and less powerful high frequencies to the smaller satellites.<br /><br />The Blu-ray outputs several sets of frequency tests in PCM, Dolby Digital, Master Audio, DTS. Separate tests help you set up 5.1 and 7.1 systems independently.<br /><br />You should have a dB meter handy unless you just want to trust your ears.\nVery Helpful and Informative\nIndiana Jones: The Complete Adventures (Raiders of the Lost Ark / Temple of Doom / Last Crusade / Kingdom of the Crystal Skull) [Blu-ray]\nVic Tablian  (Actor),     Harrison Ford  (Actor),     Steven Spielb  (Director),     Michael D. Moore  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Own all four', 'Indiana Jones', 'adventures in this Blu ray collection.\\xa0 This collection includes:', 'Indiana Jones and the Raiders of the Lost Ark, Indiana Jones and the Temple of Doom, Indiana Jones and the Last Crusade,', 'and', 'Indiana Jones and the Kingdom of the Crystal Skull.', 'Raiders of the Lost Ark', 'Indiana Jones (Harrison Ford) is no ordinary archeologist. When we first see him, he is somewhere in the Peruvian jungle in 1936, running a booby trapped gauntlet (complete with an over sized rolling boulder) to fetch a solid gold idol. He loses this artifact to his chief rival, a French archeologist named Belloq (Paul Freeman), who then prepares to kill our hero. In the first of many serial like escapes, Indy eludes Belloq by hopping into a convenient plane. So, then: is Indiana Jones afraid of anything? Yes, snakes. The next time we see Jones, he\\'s a soft spoken, bespectacled professor. He is then summoned from his ivy covered environs by Marcus Brody (Denholm Elliott) to find the long lost Ark of the Covenant. The Nazis, it seems, are already searching for the Ark, which the mystical minded Hitler hopes to use to make his stormtroopers invincible. But to find the Ark, Indy must first secure a medallion kept under the protection of Indy\\'s old friend Abner Ravenwood, whose daughter, Marion (Karen Allen), evidently has a \"history\" with Jones. Whatever their personal differences, Indy and Marion become partners in one action packed adventure after another, ranging from wandering the snake pits of the Well of Souls to surviving the pyrotechnic unearthing of the sacred Ark. A joint project of Hollywood prodigies George Lucas and Steven Spielberg, with a script co written by Lawrence Kasdan and Philip Kaufman, among others, Raiders of the Lost Ark is not so much a movie as a 115 minute thrill ride. Costing 22 million dollars (nearly three times the original estimate), Raiders of the Lost Ark reaped 200 million dollars during its first run. It was followed by Indiana Jones and the Temple of Doom (1985) and Indiana Jones and the Last Crusade (1989), as well as a short lived TV series \"prequel.\"', 'Temple of Doom', 'The second of the George Lucas/Steven Spielberg', 'Indiana Jones', 'epics is set a year or so before the events in', 'Raiders of the Lost Ark', \"(1984). After a brief brouhaha involving a precious vial and a wild ride down a raging Himalyan river, Indy (Harrison Ford) gets down to the problem at hand: retrieving a precious gem and several kidnapped young boys on behalf of a remote East Indian village. His companions this time around include a dimbulbed, easily frightened nightclub chanteuse (Kate Capshaw), and a feisty 12 year old kid named Short Round (Quan Ke Huy). Throughout, the plot takes second place to the thrills, which include a harrowing rollercoaster ride in an abandoned mineshaft and Indy's rescue of the heroine from a ritual sacrifice. There are also a couple of cute references to\", 'Raiders of the Lost Ark', \", notably a funny variation of Indy's shooting of the Sherpa warrior.\", 'Last Crusade', \"The third installment in the widely beloved Spielberg/Lucas Indiana Jones saga begins with an introduction to a younger Indy (played by the late River Phoenix), who, through a fast paced prologue, gives the audience insight into the roots of his taste for adventure, fear of snakes, and dogged determination to take historical artifacts out of the hands of bad guys and into the museums in which they belong. A grown up Indy (Harrison Ford) reveals himself shortly afterward in a familiar classroom scene, teaching archeology to a disproportionate number of starry eyed female college students in 1938. Once again, however, Mr. Jones is drawn away from his day job after an art collector (Julian Glover) approaches him with a proposition to find the much sought after Holy Grail. Circumstances reveal that there was another avid archeologist in search of the famed cup — Indiana Jones' father, Dr. Henry Jones (Sean Connery) — who had recently disappeared during his efforts. The junior and senior members of the Jones family find themselves in a series of tough situations in locales ranging from Venice to the most treacherous spots in the Middle East. Complicating the situation further is the presence of Elsa (Alison Doody), a beautiful and intelligent woman with one fatal flaw: she's an undercover Nazi agent. The search for the grail is a dangerous quest, and its discovery may prove fatal to those who seek it for personal gain. Indiana Jones and the Last Crusade earned a then record breaking $50 million in its first week of release.\", 'Kingdom of the Crystal Skull', 'Steven Spielberg and George Lucas bring you the greatest adventurer of all time in “a nonstop thrill ride” (Richard Corliss, TIME) that’s packed with “sensational, awe inspiring spectacles” (Roger Ebert, Chicago Sun Times).', 'Indiana Jones and the Kingdom of the Crystal Skull', 'finds Indy (Harrison Ford) trying to outrace a brilliant and beautiful agent (Cate Blanchett) for the mystical, all powerful Crystal Skull of Akator. Teaming up with a rebellious young biker (Shia LaBeouf) and his spirited original love Marion (Karen Allen), Indy takes you on a breathtaking action packed adventure in the exciting tradition of the classic', 'Indiana Jones', 'movies!', 'Amazon.com', 'Raiders of the Lost Ark', 'It’s said that the original is the greatest, and there can be no more vivid proof than', 'Raiders of the Lost Ark', ', the first and indisputably best of the initial three Indiana Jones adventures cooked up by the dream team of Steven Spielberg and George Lucas. Expectations were high for this 1981 collaboration between the two men, who essentially invented the box office blockbuster with ‘70s efforts like', 'Jaws', 'and', 'Star Wars', ', and Spielberg (who directed) and Lucas (who co-wrote the story and executive produced) didn’t disappoint. This wildly entertaining film has it all: non-stop action, exotic locations, grand spectacle, a hero for the ages, despicable villains, a beautiful love interest, humor, horror… not to mention lots of snakes. And along with all the bits that are so familiar by now--Indy (Harrison Ford) running from the giant boulder in a cave, using his pistol instead of his trusty whip to take out a scimitar-wielding bad guy, facing off with a hissing cobra, and on and on--there’s real resonance in a potent storyline that brings together a profound religious-archaeological icon (the Ark of the Covenant, nothing less than \"a radio for speaking to God\") and the 20th century’s most infamous criminals (the Nazis). Now', 'that’s', 'entertainment.', '--Sam Graham', 'Temple of Doom', 'It’s hard to imagine that a film with worldwide box office receipts topping $300 million worldwide could be labeled a disappointment, but some moviegoers considered', 'Indiana Jones and the Temple of Doom', ', the second installment in Steven Spielberg and George Lucas’ 1980s adventure trilogy, to be just that. That doesn’t mean it’s a bad effort; any collaboration between these two cinema giants (Spielberg directed, while Lucas provided the story and was executive producer) is bound to have more than its share of terrific moments, and', 'Temple of Doom', 'is no exception. But in exchanging the very real threat of Nazi Germany for the cartoonish Thuggee cult, it loses some of the heft of its predecessor (', 'Raiders of the Lost Ark', '); on the other hand, it’s also the darkest and most disturbing of the three films, what with multiple scenes of children enslaved, a heart pulled out of a man’s chest, and the immolation of a sacrificial victim, which makes it less fun than either', 'Raiders', 'or', 'The Last Crusade', ', notwithstanding a couple of riotous chase scenes and impressively grand sets. Many fans were also less than thrilled with the new love interest, a spoiled, querulous nightclub singer portrayed by Kate Capshaw, but a cute kid sidekick (\"Short Round,\" played by Ke Huy Quan) and, of course, the ever-reliable Harrison Ford as the cynical-but-swashbuckling hero more than make up for that character’s shortcomings.', 'A six-minute introduction by Lucas and Spielberg is the prime special feature, with both men candidly addressing the film’s good and bad points (Lucas points out that the second', 'Star Wars', 'film,', 'The Empire Strikes Back', ', was also the darkest of the original three; as for Spielberg, the fact that the leading lady would soon become his wife was the best part of the whole trip). Also good are \"The Creepy Crawlies,\" a mini-doc about the thousands of snakes, bugs, rats and other scary critters that populate the trilogy, and \"Travels with Indy,\" a look at some of the films’ cool locations. Storyboards and a photo gallery are included as well.', '--Sam Graham', 'Last Crusade', 'Not as good as the first one, but better than the second. That’s been the consensus opinion regarding', 'Indiana Jones and the Last Crusade', ', the final installment in Steven Spielberg and George Lucas’ original adventure trilogy, throughout the nearly two decades since its 1989 theatrical release. It’s a fair assessment. After the relatively dark and disturbing', 'Temple of Doom', '(1984),', 'The Last Crusade', '(1989) recalls the sheer fun of', 'Raiders of the Lost Ark', '(1981). With its variety of colorful locations, multiple chase scenes (the opening sequence on a circus train, with River Phoenix as the young Indy, is one of the best of the series, as is the boat chase through the canals of Venice), and cloak-and-dagger vibe, it’s the closest in tone to a James Bond outing, which director Spielberg has noted was the inspiration for the trilogy in the first place; what’s more, it harkens back to', 'Raiders', \"in its choice of villains (i.e., the Nazis--Indy even comes face to face with Hitler at a rally in Berlin) and its quest for an antiquity of incalculable value and significance (the Holy Grail, the chalice said to have been the receptacle of Christ's blood as he hung on the cross). Add to that the presence of Sean Connery, playing Indy’s father and having a field day opposite Harrison Ford, and you’ve got a most welcome return to form.\", 'Special features include a six-minute introduction by Spielberg and Lucas, who discuss the grail as a metaphor for bringing Indy and his estranged father together and agree that', 'Crusade', 'is the funniest of the three films; \"Indy’s Women,\" an American Film Institute tribute with leading ladies Karen Allen, Kate Capshaw, and Alison Doody each discussing her character (Capshaw candidly describes', 'Temple of Doom', '’s Willie Scott as \"whiny, petulant, and annoying\"); \"Indy’s Friends and Enemies,\" a look at the films’ various villains and sidekicks; plus storyboards and photo galleries.', '--Sam Graham', 'Kingdom of the Crystal Skull', 'Nearly 20 years after riding his last Crusade, Harrison Ford makes a welcome return as archaeologist/relic hunter Indiana Jones in', 'Indiana Jones and the Kingdom of the Crystal Skul', \"l, an action-packed fourth installment that's, in a nutshell, less memorable than the first three but great nostalgia for fans of the series. Producer George Lucas and screenwriter David Koepp (\", 'War of the Worlds', \") set the film during the cold war, as the Soviets--replacing Nazis as Indy's villains of choice and led by a sword-wielding Cate Blanchett with black bob and sunglasses--are in pursuit of a crystal skull, which has mystical powers related to a city of gold. After escaping from them in a spectacular opening action sequence, Indy is coerced to head to Peru at the behest of a young greaser (Shia LaBeouf) whose friend--and Indy's colleague--Professor Oxley (John Hurt) has been captured for his knowledge of the skull's whereabouts. Whatever secrets the skull holds are tertiary; its reveal is the weakest part of the movie, as the CGI effects that inevitably accompany it feel jarring next to the boulder-rolling world of Indy audiences knew and loved. There's plenty of comedy, delightful stunts--ants play a deadly role here--and the return of\", 'Raiders', \"love interest Karen Allen as Marion Ravenwood, once shrill but now softened, giving her ex-love bemused glances and eye-rolls as he huffs his way to save the day. Which brings us to Ford: bullwhip still in hand, he's a little creakier, a lot grayer, but still twice the action hero of anyone in film today. With all the anticipation and hype leading up to the film's release, perhaps no reunion is sweeter than that of Ford with the role that fits him as snugly as that fedora hat.\", '--Ellen A. Kim']\n{'Genre': 'Action & Adventure', 'Format': 'Blu-ray, AC-3, Dolby, DTS Surround Sound, Dubbed, NTSC, Box set, Subtitled, Widescreen', 'Contributor': 'Steven Spielb, Alfred Molina, Wolf Kahler, Steven Spielberg, Paul Freeman, Denholm Elliott, William Hootkins, Sonny Caldinez, Bill Reimbold, Anthony Chinn, Tutte Lemkow, Ted Grossman, Pat Roach, Ronald Lacey, Tony Vogel, Matthew Scurfield, Eddie Tagoe, Patrick Durkin, Terry Richards, Harrison Ford, John Rees, John Rhys-Davies, Anthony Higgins, Frank Marshall, Kiran Shah, Steve Hanson, Michael D. Moore, Ishaq Bux, Vic Tablian, Don Fellows, Karen Allen, George HarrisSteven Spielb, Alfred Molina, Wolf Kahler, Steven Spielberg, Paul Freeman, Denholm Elliott, William Hootkins, Sonny Caldinez, Bill Reimbold, Anthony Chinn, Tutte Lemkow, Ted Grossman, Pat Roach, Ronald Lacey, Tony Vogel, Matthew Scurfield, Eddie Tagoe, Patrick D…  See more', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD Master Audio 5.1)', 'Runtime': '8 hours and 1 minute', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '994098445108', 'Director': 'Steven Spielb, Michael D. Moore, Steven Spielberg', 'Media Format': 'Blu-ray, AC-3, Dolby, DTS Surround Sound, Dubbed, NTSC, Box set, Subtitled, Widescreen', 'Run time': '8 hours and 1 minute', 'Release date': 'September 18, 2012', 'Actors': 'Vic Tablian, Harrison Ford, Karen Allen, Paul Freeman, Ronald Lacey', 'Dubbed': 'Spanish, Portuguese, French', 'Subtitles': 'Spanish, English, French, Portuguese', 'Studio': 'Paramount', 'Number of discs': '5'}\nThis is a great set of all four Indiana Jones adventures and a ton of &#34;making of&#34; videos, which are quite enjoyable, especially the old Raiders making of.<br /><br />All the movies are great except Temple of Doom, which I -- and all people of good taste -- disliked since its release. I've even come to enjoy Crystal Skull.<br /><br />Blu-ray quality is stunning and audio is sufficient to drive my wife from the room screaming &#34;TURN IT DOWN!&#34; -- but that's half the fun. Subwoofers now and forever!\nAll Good Except Temple of Doom, But Everyone Knows That Already\nKingsman: The Secret Service [4K UHD]\nColin Firth  (Actor),     Samuel L. Jackson  (Actor),     Matthew Vaughn  (Director)    &                   0                  more   Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Kingsman: The Secret Service [4K Ultra HD + Blu-ray + Digital HD]', \"Synopsis - A super-secret organization recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a dire global threat emerges from a twisted tech genius. A phenomenal cast, including Academy Award Winners Colin Firth and Michael Caine and Oscar Nominee Samuel L. Jackson, leads this action-packed spy-thriller directed by Matthew Vaughn (X-Men: First Class).\", 'FEATURES:', 'Format: 4K, NTSC', 'Format: 4K, NTSC', 'Number of discs: 2', 'Number of discs: 2', 'Rated: R Restricted', 'Rated: R Restricted', 'Studio: 20th Century Fox / Fox Home Entertainment', 'Studio: 20th Century Fox / Fox Home Entertainment', 'Theatrical Release: Feb 13, 2015', 'Theatrical Release: Feb 13, 2015', 'Dom. Box Office $128.3M', 'Dom. Box Office $128.3M', 'Cast: Colin Firth, Samuel L. Jackson, Mark Strong, Taron Egerton, Michael Caine', 'Cast: Colin Firth, Samuel L. Jackson, Mark Strong, Taron Egerton, Michael Caine', 'Director: Matthew Vaughn', 'Director: Matthew Vaughn', 'Year: 2014', 'Year: 2014', 'Language: English, Arabic, Swedish', 'Language: English, Arabic, Swedish', 'Disc Language: English', 'Disc Language: English', 'Video: 2160p 2.39:1', 'Video: 2160p 2.39:1', 'Audio: DTS-HD MA 7.1', 'Audio: DTS-HD MA 7.1', 'UltraViolet Digital Copy', 'UltraViolet Digital Copy', 'Release Date Feb 22, 2016', 'Release Date Feb 22, 2016', 'Tags: Action, Adventure, Comedy, Crime, Thriller', 'Tags: Action, Adventure, Comedy, Crime, Thriller', '[4K Ultra HD + Blu-ray + Digital HD]']\n{'Genre': 'Action/Adventure', 'Format': '4K', 'Contributor': 'Michael Caine, Jordan Long, Alex Nikolov, Taron Egerton, Colin Firth, Samuel L. Jackson, Mark Hamill, Sophie Cookson, Samantha Womack, Sofia Boutella, Jonno Davies, Matthew Vaughn, Adrian Quinton, Jack Davenport, Velibor Topic, Jack Cutmore-Scott, Mark Strong, Edward Holcroft, Geoff BellMichael Caine, Jordan Long, Alex Nikolov, Taron Egerton, Colin Firth, Samuel L. Jackson, Mark Hamill, Sophie Cookson, Samantha Womack, Sofia Boutella, Jonno Davies, Matthew Vaughn, Adrian Quinton, Jack Davenport, Velibor Topic, Jack Cutmore-Scott, Mark Strong, Edward H…   See more', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '2326147', 'Director': 'Matthew Vaughn', 'Media Format': '4K', 'Release date': 'February 22, 2016', 'Actors': 'Colin Firth, Samuel L. Jackson, Mark Strong, Taron Egerton, Sophie Cookson', 'Subtitles': 'English', 'Studio': '20TH CENTURY STUDIOS', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis is a great movie.<br /><br />Harkens back to the spy movies of yesteryear: English gentlemen, gadgets, aplomb and super villains and their super henchwomen defeated, all while sipping a proper martini made by waving the glass of gin near an unopened bottle of vermouth.\nI Hope They Make A Sequel, But Casting It Will Be Difficult\nLive Die Repeat: Edge of Tomorrow\nTom Cruise  (Actor),     Emily Blunt  (Actor),     Doug Liman  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['An alien race, undefeatable by any existing military unit, has launched a relentless attack on Earth, and Major William Cage (Tom Cruise) finds himself dropped into a suicide mission. Killed within minutes, Cage is thrown into a time loop, forced to live out the same brutal combat over and over, fighting and dying again and again. Training alongside warrior Rita Vrataski (Emily Blunt), his skills slowly evolve, and each battle moves them one step closer to defeating the enemy in this fun action thriller.']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.5 x 5.4 x 6.7 inches; 8.32 Ounces', 'Item model number': '828744', 'Director': 'Doug Liman', 'Media Format': 'Blu-ray, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '1 hour and 53 minutes', 'Release date': 'October 7, 2014', 'Actors': 'Tom Cruise, Emily Blunt, Bill Paxton, Brendan Gleeson, Noah Taylor', 'Dubbed': 'French, Spanish', 'Subtitles': 'French, Portuguese, Spanish', 'Producers': 'Erwin Stoff, Tom Lassally, Jeffrey Silver, Gregory Jacobs, Jason Hoffs', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'WarnerBrothers', 'Writers': 'Christopher McQuarrie, Jez Butterworth, John-Henry Butterworth', 'Country of Origin': 'USA', 'Number of discs': '1'}\nAbout half way through this movie I realized, like Hunger Games, it's just another plot stolen from a video game. Our hero, like a video gamer, keeps trying until he gets it right. (Death is just a construct, right?)<br /><br />Hunger Games even went so far as to allow the participants to get &#34;Health&#34; to recover from their wounds. But it was an Important Movie that Made A Statement.<br /><br />With this movie, just die and start over again.\nPlot Stolen, er, Borrowed From Any Given Video Game\nThe Tourist\nJohnny Depp  (Actor),     Angelina Jolie  (Actor),     Florian Henckel von Donnersmarck  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Frank (Johnny Depp), a mild-mannered American on vacation in Venice, Italy, is befriended by Elise (Angelina Jolie), a breathtakingly beautiful woman with a mysterious secret. Soon, their playful romantic dalliance turns into a complicated web of dangerous deceit as they are chased by Interpol, the Italian police, and Russian hit men in this suspense-filled, international action thriller.', 'Amazon.com', 'Johnny Depp and Angelina Jolie use their star power to help propel', 'The Tourist', 'to its ultimate, satisfying destination. It just takes a little while to get there. Director Florian Henckel von Donnersmarck (', 'The Lives of Others', ') sets a leisurely pace for', 'The Tourist', ', which lets the film be equal parts mystery, romance, thriller, and comedy. But because of its lush cinematography and location-based shooting,', 'The Tourist', \"is perhaps first and foremost a valentine to the city of Venice. Jolie plays Elise, an international woman of mystery, somehow caught up with a glamorous thief who's double-crossed a gangster, Shaw (Steven Berkoff, splendidly menacing). On a train from Paris to Venice, Elise meets Frank (Depp), a schlumpy math teacher from Wisconsin on holiday. Before the train hits Venice, poor Frank has become entangled in a dangerous web that he can't begin to understand. As the plot unfolds, a group of stone-headed thugs dashes after Frank and Elise, darting through canals, across tile rooftops, and into some of the most beautiful hotel rooms in the world. The cinematography of John Seale and the score by James Newton Howard set an immersive tone. Depp and Jolie do a respectable job with their roles, though perhaps because of the mysteries in the plot, as a couple, Elise and Frank lack a certain oomph. But the supporting actors, including Paul Bettany, Timothy Dalton, and Rufus Sewell, are uniformly excellent, and the story (based on the French film\", 'Anthony Zimmer', ') wraps up nicely. Yet the true star of', 'The Tourist', 'is enchanting Venice--and anyone dreaming of a romantic getaway will not want to miss this trip. --', 'A.T. Hurley']\n{'Genre': 'Action, Drama, Thriller', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen, AC-3', 'Contributor': 'Angelina Jolie, Johnny Depp, Florian Henckel von Donnersmarck', 'Language': 'English', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Item model number': 'CTR37404DVD', 'Director': 'Florian Henckel von Donnersmarck', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Dubbed, Widescreen, AC-3', 'Run time': '1 hour and 43 minutes', 'Release date': 'March 22, 2011', 'Actors': 'Johnny Depp, Angelina Jolie', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Columbia Pictures', 'Number of discs': '1'}\nPretty predictable with several really outlandish premises. Good thing we movie watchers willingly suspend our disbelief. Still fun though.\nA Slight Twist On The Thomas Crown Affair\nFantastic Beasts (Blu-ray)(BD)\nDavid Yates  (Director),     Eddie Redmayne  (Actor),     Katherine Waterston  (Actor)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Action & Adventure\n['Fantastic Beasts and Where to Find Them (Blu-ray) (BD)', 'Explore a new era of the Wizarding World before Harry Potter. Something mysterious is leaving a path of destruction in the streets of 1926 New York, threatening to expose the wizarding community. Newt Scamander arrives in the city nearing the end of a global excursion to research and rescue magical creatures. When unsuspecting No-Maj Jacob Kowalski inadvertently lets some of Newt’s beasts loose, a band of unlikely heroes must recover the missing beasts before they come to harm, but their mission puts them on a collision course with Dark forces.', ']]>']\n{'Digital Copy Expiration Date': 'March 31, 2018', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 8.32 Ounces', 'Item model number': 'B01LTHOAGM', 'Director': 'David Yates', 'Media Format': 'Blu-ray, NTSC, Subtitled', 'Run time': '2 hours and 12 minutes', 'Release date': 'March 28, 2017', 'Actors': 'Eddie Redmayne, Katherine Waterston, Alison Sudol, Dan Fogler, Colin Farrell', 'Subtitles': 'Spanish, French, English, Portuguese', 'Producers': 'Tim Lewis, David Heyman, Neil Blair, Steve Kloves, Rick Senat', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Studio Distribution Services', 'Writers': 'J.K. Rowling', 'Country of Origin': 'USA', 'Number of discs': '1'}\nTotally predictable with plodding pace. &#34;Men In Black meets X-Men meets Hellboy.&#34;  Growing really tired of the &#34;The world just doesn't accept our kind!&#34; plot gimmick, complete with dark evil badguy who wants to take over everything.<br /><br /> Tour de force animation, if you can suspend your disbelief. Quite amazing.<br /><br />Loved the Blu-ray quality in picture and sound. Sparkling.<br /><br />Movie suffers from too much J.K. Rowling worship.<br /><br />Music score kind of forgettable. No memorable themes.<br /><br />Glad I didn't pay full price for the Blu-ray when it first came out. May never watch it again.\nNot That Original\nApollo 13 [Blu-ray]\nTom Hanks  (Actor),     Ed Harris  (Actor),     Ron Howard  (Director)    &                   0                  more   Rated:    PG    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Astronauts Jim Lovell, Fred Haise and Jack Swigert try to come back alive after an explosion aborts the April 1970 moonshot. Directed by Ron Howard. From Lovell\\'s memoir \"Lost Moon.\" VUDU Instawatch Included']\n{'Genre': 'Neil Armstrong, DVD Movie, NASA, Blu-ray Movie, Apollo 13 (version française incluse), Apollo 13 (version francaise incluse), Action & Adventure/Thrillers, Jack Swigert, Jim Lovell, Drama, Apollo Thirteen, Gene Kranz, Action & Adventure, Mystery & Suspense, Fred HaiseNeil Armstrong, DVD Movie, NASA, Blu-ray Movie, Apollo 13 (version française incluse), Apollo 13 (version francaise incluse), Action & Adventure/Thrillers, Jack Swigert, Jim Lovell, Drama, Apollo Thirteen, Gene Kranz, Action & Adventure, Mystery & Suspense, Fred Haise   See more', 'Format': '4K', 'Contributor': 'Rick Dior, Mike Hill, Mary Kate Schellhardt, Al Reinert, Bill Paxton, Chris Ellis, Max Elliott Slade, David MacMillan, Gary Sinise, Steve Pederson, Tom Hanks, David Andrews, William Broyles Jr., Jean Speegle Howard, Miko Hughes, Ron Howard, Scott Millan, Dan Hanley, Kathleen Quinlan, Ed Harris, Kevin Bacon, Emily Ann Lloyd, Brian GrazerRick Dior, Mike Hill, Mary Kate Schellhardt, Al Reinert, Bill Paxton, Chris Ellis, Max Elliott Slade, David MacMillan, Gary Sinise, Steve Pederson, Tom Hanks, David Andrews, William Broyles Jr., Jean Speegle Howard, Miko Hughes, Ron Howard, Scott Millan, Dan Hanley, Kathleen Quinl…   See more', 'Language': 'Japanese (DTS 5.1), Italian (DTS 5.1), Portuguese (DTS 5.1), German (DTS 5.1), French (DTS 5.1), English (DTS-HD Master Audio 5.1), Spanish (DTS 5.1), French Canadian (DTS 5.1)', 'Runtime': '2 hours and 20 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '6.75 x 5.5 x 0.55 inches; 3.52 Ounces', 'Item model number': 'BR61186788', 'Director': 'Ron Howard', 'Media Format': '4K', 'Run time': '2 hours and 20 minutes', 'Release date': 'October 17, 2017', 'Actors': 'Tom Hanks, Ed Harris, Bill Paxton, Kevin Bacon, Gary Sinise', 'Subtitles': 'Portuguese, Spanish, Dutch, French, German, Italian, Japanese, Danish, Swedish, Finnish, Norwegian', 'Producers': 'Brian Grazer', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'William Broyles Jr., Al Reinert', 'Country of Origin': 'USA', 'Number of discs': '2'}\nWhy do I love a movie that I know how it ends, every single time? Great music, good acting, good script, and American ingenuity on parade.<br /><br />A little overdone with arguing in space (the astronauts didn't do that) but I love the music score and when the guys make it back it always moves me.<br /><br />What a great achievement. Apollo 13 and the space program, not so much the movie, but I like the movie nonethe less.\nTo The Moon And Back With Sliderules\nTeam America: World Police\nTrey Parker  (Actor),     Matt Stone  (Actor)    Rated:    R    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Using puppetry techniques inspired by Gerry Anderson\\'s Supermarionation sagas, \"South Park\" creators Trey Parker and Matt Stone skewer U.S. politics and celebrity activism with their hilarious and controversial satire about a high-tech international law enforcement agency that recruits a renowned Broadway thespian to help them mount a series of ill-conceived anti-terrorist campaigns. Parker and Stone provide voices along with Kristen Miller, Daran Norris. 98 min. Widescreen (Enhanced); Soundtracks: English DTS HD 5.1 Master Audio, French Dolby Digital 5.1, Spanish Dolby Digital 5.1; Subtitles: English (SDH), French, Spanish.']\n{'Genre': 'Anime & Manga, Comedy', 'Format': 'AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen', 'Contributor': 'Trey Parker, Matt Stone', 'Language': 'English', 'Runtime': '1 hour and 38 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 1.76 Ounces', 'Media Format': 'AC-3, Dolby, DTS Surround Sound, Dubbed, Subtitled, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'August 29, 2017', 'Actors': 'Trey Parker, Matt Stone', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, Japanese, Italian, German, Portuguese, English', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI'm Matt Damon! I'm Matt Damon!<br /><br />Fabulous skewering of our sacred cow celebrities.\nDeserved Skewering of Hollywood Celebrities",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user exhibits a pronounced dedication to high-quality films, favoring Mystery and Thriller genres while also enjoying action-adventure with fantasy elements. They maintain a critical stance towards mainstream cinema, viewing it as often lacking in depth and originality.\n\n- **Critical Viewpoint:** Their recent reviews continue to reflect skepticism towards predictable narratives, employing humor and sarcasm to express disappointment with clichéd plot devices and superficial storytelling. Their latest interaction demonstrates an appreciation for satire that effectively critiques Hollywood.\n\n- **Entertainment Consumption:** A strong preference for technical excellence remains evident, particularly in choices that emphasize superior sound and visual quality, such as Blu-ray and 4K formats, thereby enhancing immersive viewing experiences.\n\n- **Rating Tendencies:** The user consistently rates films based on thoughtful storytelling, often bestowing high ratings on substantive works while issuing low ratings to uninspired offerings. Recent critiques further showcase their understanding of emotional and narrative quality.\n\n- **General Attitude:** Their analytical approach highlights a relentless quest for excellence in cinema and technology, with a low tolerance for repetitive themes. This is coupled with a consistent pursuit of films that combine compelling narratives with high production values, aligning with their appreciation for well-crafted storytelling, even when outcomes are predictable.",
  "metrics": {
    "rouge1_f": 0.03800766283524905,
    "rouge2_f": 0.003372681281618887,
    "rougeL_f": 0.020229885057471263,
    "meteor": 0.01065216301569001,
    "bleu1": 1.0599235694804245e-15,
    "bleu2": 3.635563981303831e-16,
    "bleu3": 1.0332699042361139e-16,
    "bleu4": 3.10074804666432e-17,
    "bertscore_precision": 0.3316831588745117,
    "bertscore_recall": 0.5157425999641418,
    "bertscore_f1": 0.40372419357299805
  }
}