{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2016/01/29\nAverage Rating: 4.7\nProduct Details: {'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nReview Text: Hunger Games is a video game that meets American Idol. I honestly don't understand the attraction. My wife loved it, though. Got involved with the characters, I suppose. I could not make it through the first episode. Wife watched them all.<br /><br />Come on: virtual wild animals on demand? Medicine packs that heal wounds rapidly? Really? You mean like video game &#34;health&#34; modules? Wide variety of weapons to choose from as you run across the field? Enemies to defeat within a pre-described battlefield? Rules changing on a whim?<br /><br />Paper thin plot.\nReview Title: Cross between American Idol and any given video game\nRating: 1.0\n--------------------------------------------------",
  "reference_summary": "The Arrival [Blu-ray]\nRon Silver  (Actor),     Charlie Sheen  (Actor),     David N. Twohy  (Director),     David Twohy  (Director)    &                   1                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray, Mystery & Thrillers\n['Zane Ziminski is an astrophysicist who receives a message that seems to have extraterrestrial origins. Eerily soon after his discovery, Zane is fired. He then embarks on a search to determine the origins of the transmission that leads him into a Hitchcockian labyrinth of paranoia and intrigue.']\n{'Genre': 'Mystery', 'Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Original recording remastered, WidescreenMultiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Original recording remastered, Widescreen   See more', 'Contributor': 'David N. Twohy, Catalina Botello, Phyllis Applegate, Roger Cudney, Tony Johnson, David Twohy, Ron Silver, Ángel de la Peña, Thomas Smith, Richard Schiff, Alan Coates, Leon Rippy, Javier Morga, Jorge Becerril, Luisa Huertas, Dave Galasso, James Steele, Alejandro Usigli, Shane, Jorge Zepeda, Andrea Sisniega, Monica Dionne, Maria Coronel, David Villalpando, Charlie Sheen, Jacqueline Voltaire, Ellen Bradley, José Garcia, Buddy Joe Hooker, Georg Lillitsch, Teri Polo, Ree Johnson, Lindsay CrouseDavid N. Twohy, Catalina Botello, Phyllis Applegate, Roger Cudney, Tony Johnson, David Twohy, Ron Silver, Ángel de la Peña, Thomas Smith, Richard Schiff, Alan Coates, Leon Rippy, Javier Morga, Jorge Becerril, Luisa Huertas, Dave Galasso, James Steele, Alejandro Usigli, S…   See more', 'Language': 'English', 'Runtime': '1 hour and 55 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Audio Description': 'English', 'Item model number': 'LGT25338BR', 'Director': 'David N. Twohy, David Twohy', 'Media Format': 'Multiple Formats, AC-3, Blu-ray, Color, Dolby, DTS Surround Sound, NTSC, Original recording remastered, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'April 21, 2009', 'Actors': 'Ron Silver, Charlie Sheen, Lindsay Crouse, Richard Schiff, Shane', 'Producers': 'James Steele, Thomas Smith', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI saw this by accident on FiOS. What a stinker. Plot is awful. Characters thin. Effects cheesy. \"Sets\" phony. The very idea of buying this on Blu-ray is laughable. Sheen is a joke. He should stick to what he knows: one-line sex jokes, hookers and beating up his wives.<br /><br />This is a third world-produced \"film\" that should have gone straight to video that I'd perhaps buy used for $1 at a garage sale, and then throw away to save space. This makes Plan 9 From Outer Space look plausible.<br /><br />Man am I glad I saw it on a backwater channel and didn't put any money out on this turkey, even as a rental. There is no doubt why it failed at the box office. It would have failed at 2:00 AM on Syfy channel.<br /><br />If this is what passes for good sci-fi, y'all have a pretty low threshold for quality.\nStinker\nAmerican Horror Story: Season 1\nConnie Britton  (Actor),     Dylan McDermott  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n[\"Brace yourself for an addictive thrill ride! American Horror Story is TV's most original new drama, a deeply stylish psychosexual haunt devised to keep you on the edge of your seat. The Harmon's (Dylan McDermott, Connie Britton) fresh start in a new home deviously twists to reveal discoveries of love, sex and murderous revenge. Featuring a Golden Globe(R) -winning performance by Jessica Lange, Season One scares up a host of engrossing extras.\"]\n{'Genre': 'Television, Horror/Television', 'Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Dylan McDermott, Connie Britton', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 4.96 Ounces', 'Item model number': '4608409810465', 'Media Format': 'Multiple Formats, AC-3, Box set, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '8 hours and 54 minutes', 'Release date': 'September 25, 2012', 'Actors': 'Connie Britton, Dylan McDermott', 'Subtitles': 'Spanish, English, French', 'Studio': 'FX', 'Number of discs': '4'}\nWhy did Moira O'Hara age after her death? None of the other characters aged. And she became two characters of different age while other characters stayed at the age and level of maturity they were when they died.<br /><br />And everybody else kept their death wounds. Young Moira was shot through the right eye. Old Moira had that bum eye, but young Moira had both eyes.<br /><br />This is Really Important. Or not.\nOne question...\n{'Content advisory': ['Violence', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'हिन्दी', 'मराठी', 'తెలుగు', 'Français', 'தமிழ்'], 'Subtitles': ['English [CC]', 'Français', 'हिन्दी', 'Indonesia', '한국어', 'Bahasa Melayu', 'ไทย', 'Tiếng Việt', '中文（简体）'], 'Directors': ['Gary Ross'], 'Producers': ['Nina Jacobson', 'Jon Kilik'], 'Starring': ['Jennifer Lawrence', 'Josh Hutcherson', 'Liam Hemsworth'], 'Studio': ['SciFi and Fantasy']}\nHunger Games is a video game that meets American Idol. I honestly don't understand the attraction. My wife loved it, though. Got involved with the characters, I suppose. I could not make it through the first episode. Wife watched them all.<br /><br />Come on: virtual wild animals on demand? Medicine packs that heal wounds rapidly? Really? You mean like video game &#34;health&#34; modules? Wide variety of weapons to choose from as you run across the field? Enemies to defeat within a pre-described battlefield? Rules changing on a whim?<br /><br />Paper thin plot.\nCross between American Idol and any given video game",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user continues to favor high-quality films, particularly in the Mystery and Thriller genres. They remain engaged with television series that explore horror and psychological themes but exhibit an increasing skepticism toward popular content, especially those perceived as lacking depth.\n\n- **Critical Viewpoint:** The user's discerning nature is highlighted in their latest review, which strongly critiques a well-known series for its shallow plot and unrealistic elements. Their comedic sarcasm underscores their skepticism, contrasting sharply with the positive reception of the content among peers, such as a partner who found it enjoyable.\n\n- **Entertainment Consumption:** The user is cautious about financial investments in media but shows a trend toward purchasing content that is well-reviewed, particularly when popular acclaim aligns with their critical standards. However, their latest interaction reflects a retreat from this shift, opting instead for strong critiques of perceived narrative flaws.\n\n- **Rating Tendencies:** The user maintains a critical rating approach, frequently assigning low scores when underwhelmed. Their recent experience’s low rating suggests a reinforcement of this pattern, as they remain strict regarding quality and coherence in storytelling.\n\n- **General Attitude:** The user's humorous yet critical tone reveals a commitment to quality entertainment experiences while unapologetically expressing discontent when expectations are not met, indicating little tolerance for narratives they deem superficial or poorly constructed.",
  "metrics": {
    "rouge1_f": 0.12315698178664353,
    "rouge2_f": 0.0052128583840139004,
    "rougeL_f": 0.0572419774501301,
    "meteor": 0.044535667260475566,
    "bleu1": 0.004914789296137515,
    "bleu2": 0.000941780449036871,
    "bleu3": 0.0001749524974166428,
    "bleu4": 7.547512136533116e-05,
    "bertscore_precision": 0.3239530920982361,
    "bertscore_recall": 0.4293690621852875,
    "bertscore_f1": 0.3692854344844818
  }
}