{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: LOVE CINEMA Curl & Volume-up Mascara 111\nReview Date: 2022/08/11\nStore: LOVE CINEMA\nAverage Rating: 4.1\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.47 x 0.87 x 0.67 inches; 1.02 Ounces', 'UPC': '795827835224'}\nReview Text: Its a really good mascara , I like the fact that it doesn't make my eyelashes all clumpy and ugly. It glides just prefect and gives me the desire length I want to achieve. Good quality\nReview Title: No clumping\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Kristin Ess The Oversized Satin Scrunchie ? Cheetah\nKristin Ess\n['But make it fashun! This chic satin, oversized scrunchie can be wrapped once or twice depending on the thickness of your hair. Try securing your ponytail with a regular elastic first and then put this over to maximize the look!']\n{'Material': 'Satin', 'Item Form': 'Scrunchie', 'Brand': 'Kristin Ess', 'Hair Type': 'All', 'Number of Pieces': '1', 'Package Dimensions': '10.55 x 6.26 x 1.46 inches; 1.13 Ounces', 'Item model number': '184-KES-0309', 'UPC': '840797141438'}\n[[VIDEOID:1caeab65346b101dab4627efe802e13f]] This has no stretch whatsoever. It’s literally just a super tight hair tie wrapped in a bunch of extra, unnecessary fabric. I have waist length hair and only use scrunchies because it’s the only thing that stretches enough and holds my hair. This is not it ladies.\nAbsolutely not\nArqumi Shower Cap for Women, Polyester Satin Shower Cap, Waterproof Pattern Shower Cap Bath Cap with Elastic Band, Wine Red\nArqumi\n{'Package Dimensions': '9.37 x 6.06 x 1.85 inches; 1.76 Ounces'}\nI struggled with finding a shower cap that could actually hold all of my hair. I have waist-length, thick hair and this held it perfectly well. It kept all of my hair inside and didn’t get wet at all. It’s good thick material, I definitely recommend for those with long and thick hair.\nFor long hair.\n8PC Lazy Bird's Nest Plate Hairpin Velvet Bird Nest Shaped Hair Clips Expandable Ponytail Holder Hair Loops Nest Plate Hairpin Hair Claw Clip barrette\nAhkeaDirectly\n{'Brand': 'AhkeaDirectly', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Embellishment': 'Resin', 'Material': 'Plastic', 'Package Dimensions': '6.02 x 5.2 x 2.32 inches; 4.16 Ounces', 'UPC': '761312153890'}\n[[VIDEOID:2e5c6485a58e57540c7be371e49b8b9b]] They are really nice and they expand big enough to make any hair style you want to use it for. They are made of hard durable materials and velvet. It comes in really pretty colors to match any outfit you want.\nPretty\nLOVE CINEMA Curl & Volume-up Mascara 111\nLOVE CINEMA\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.47 x 0.87 x 0.67 inches; 1.02 Ounces', 'UPC': '795827835224'}\nIts a really good mascara , I like the fact that it doesn't make my eyelashes all clumpy and ugly. It glides just prefect and gives me the desire length I want to achieve. Good quality\nNo clumping",
  "profile": "**User Summary:**\n\n- **Hair Accessories Preference:** The user prefers practical hair accessories that effectively manage thick, long hair, opting for scrunchies and clips that provide secure hold.\n- **Material Sensitivity:** They favor stretchy materials and express dissatisfaction with non-stretchy or tight products, prioritizing comfort and ease of use.\n- **Quality Expectations:** The user has high standards for product performance, often giving lower ratings to items that do not meet their expectations.\n- **Product Rating Pattern:** They provide honest feedback based on practical experiences, focusing on functionality and quality in their reviews.\n- **Focus on Functionality:** They seek items that can securely manage waist-length, thick hair while being user-friendly and visually appealing.\n- **Recent Interaction Reflection:** After a recent purchase of an expandable hair accessory that performed well, the user rated it highly, emphasizing their dedication to practical and reliable beauty accessories. \n- **Mascara Purchase:** In addition to hair accessories, the user recently purchased a mascara, appreciating its ability to avoid clumping while providing desired length. They rated the product positively, highlighting quality and performance.\n  \nThis interaction reinforces the user's trend of prioritizing effective solutions that work well for their specific needs in beauty products, showcasing a consistent appreciation for quality and functionality across different product categories.",
  "metrics": {
    "rouge1_f": 0.25870646766169153,
    "rouge2_f": 0.019966722129783693,
    "rougeL_f": 0.10281923714759536,
    "meteor": 0.12039292008777189,
    "bleu1": 0.1406652166300612,
    "bleu2": 0.04133348318261757,
    "bleu3": 0.017332597208226806,
    "bleu4": 0.009447043305116804,
    "bertscore_precision": 0.38222503662109375,
    "bertscore_recall": 0.4471818804740906,
    "bertscore_f1": 0.41215983033180237
  }
}