{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Celtic Thunder: Heritage\nReview Date: 2012/11/29\nStore: Celtic Thunder  (Actor, Director)    Rated:    Unrated    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Music Videos & Concerts\nProduct Description: [\"Following the success of their last 4 shows the new Celtic Thunder show Heritage accentuates the musical culture of Ireland. The DVD features 12 new recordings including: An Irish Blessing, A Place In The Choir and Whiskey In The Jar. In 2011 March PBS pledge will feature Celtic Thunder's Heritage airing the program over 1,000 times. In the fall of 2011 Celtic Thunder Heritage will be on tour. Over the past 3 years Celtic Thunder has been one of the most successful PBS music programs.\"]\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Celtic Thunder', 'Language': 'English', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.3 x 0.5 x 7.5 inches; 3.2 Ounces', 'Director': 'Celtic Thunder', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour', 'Release date': 'February 22, 2011', 'Actors': 'Celtic Thunder', 'Studio': 'Celtic Thunder', 'Number of discs': '1'}\nReview Text: I bought this because I had seen this group on PBS and I thoroughly enjoy their music and performing.  I give it high marks and they are excellent.\nReview Title: Great music\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Celtic Thunder - Christmas\nCeltic Thunder  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n['The heart-warming new Celtic Thunder Show features holiday standards such as \"It\\'s Beginning To Look A Lot Like Christmas,\" \"Let It Snow,\" \"Winter Wonderland\" and \"Silent Night\" as well as a few specially-written originals, \"Going Home For Christmas\", \"Christmas Morning Donegal\" and \"Our First Christmas Together\". Filmed in Poughkeepsie, NY in front of a live audience, Damian McGinty, Keith Harkin, Paul Byrom, Ryan Kelly and George Donaldson of Celtic Thunder bring together their affinity for a great popular song with outstanding live performances, pay homage to cherished holiday favorites. The show is a holiday celebration for all the family performed as ever with Celtic Thunder magic.', \"Track Listings: 1. Christmas Overture 2. It's Beginning To Look A Lot Like Christmas 3. Winter Wonderland 4. Christmas Morning, Donegal 5. Amazing Grace 6. Let It Snow, Let It Snow, Let It Snow 7. Last Christmas 8. When You Wish Upon A Star 9. Silent Night 10. Going Home For Christmas 11. Our First Christmas Together 12. Christmas 1915 13. Baby, It's Cold Outside 14. Ave Maria 15. Hallelujah 16. All I Want For Christmas Is You 17. I Wish It Could Be Christmas Everyday 18. The Most Wonderful Time Of The Year/We Wish You A Merry Christmas 19. Solo Performances - Damian McGinty 20. Solo Performances - Keith Harkin 21. Solo Performances - Ryan Kelly 22. Solo Performances - Paul Byrom 23. Solo Performances - George Donaldson 24. Solo Performances - Neil Byrne 25. All I Want For Christmas Is You - A Very Special Slideshow\"]\n{'Genre': 'Kids & Family', 'Format': 'NTSC, Import', 'Contributor': 'Celtic Thunder', 'Runtime': '1 hour', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'Celtic Thunder', 'Media Format': 'NTSC, Import', 'Run time': '1 hour', 'Release date': 'November 22, 2010', 'Actors': 'Celtic Thunder', 'Studio': 'Celtic Thunder', 'Number of discs': '1'}\nI enjoyed Celtic Thunder so much of the PBS special so I ordered these and I truly enjoy listening to this great group.\nGreat music\nCeltic Thunder: Heritage\nCeltic Thunder  (Actor, Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Music Videos & Concerts\n[\"Following the success of their last 4 shows the new Celtic Thunder show Heritage accentuates the musical culture of Ireland. The DVD features 12 new recordings including: An Irish Blessing, A Place In The Choir and Whiskey In The Jar. In 2011 March PBS pledge will feature Celtic Thunder's Heritage airing the program over 1,000 times. In the fall of 2011 Celtic Thunder Heritage will be on tour. Over the past 3 years Celtic Thunder has been one of the most successful PBS music programs.\"]\n{'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Celtic Thunder', 'Language': 'English', 'Runtime': '1 hour', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '5.3 x 0.5 x 7.5 inches; 3.2 Ounces', 'Director': 'Celtic Thunder', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour', 'Release date': 'February 22, 2011', 'Actors': 'Celtic Thunder', 'Studio': 'Celtic Thunder', 'Number of discs': '1'}\nI bought this because I had seen this group on PBS and I thoroughly enjoy their music and performing.  I give it high marks and they are excellent.\nGreat music",
  "profile": "**User Profile Summary:**\n\n- **Music Preference:** The user has a strong affinity for Celtic music, with a particular enjoyment of performances that showcase the musical culture of Ireland. Their love for seasonal themes, especially during the holiday season, enhances their appreciation for this genre.\n  \n- **Content Format:** They favor DVDs and live performances, indicating a preference for visual and auditory experiences that capture the essence of live shows, especially those featuring dynamic group performances.\n\n- **Holiday Enthusiasm:** The user shows a notable enjoyment of holiday-themed content, particularly Christmas music, suggesting that seasonal celebrations hold significant meaning for them and influence their entertainment choices.\n\n- **Community Engagement:** They value performances by ensembles and groups, reflecting a preference for collaborative musical experiences over solo acts, which further emphasizes their appreciation for community and shared enjoyment in music.\n\n- **Quality Focus:** The user consistently seeks high-quality entertainment, evidenced by their high ratings for products, which align with their discerning taste and desire for excellence in their musical selections.\n\n- **Emotional Connection:** Their reviews highlight their heartfelt engagement with the content, signifying that music plays a crucial role in evoking emotions and enhancing a festive atmosphere, particularly during the holiday season.\n\nOverall, this user demonstrates a clear pattern of enjoying high-quality Celtic music, especially in live formats, and values the emotional richness and community aspects of their musical experiences.",
  "metrics": {
    "rouge1_f": 0.24458598726114647,
    "rouge2_f": 0.022988505747126436,
    "rougeL_f": 0.11210191082802548,
    "meteor": 0.09073800241968007,
    "bleu1": 0.05766238856292646,
    "bleu2": 0.01835866018756993,
    "bleu3": 0.009961533782235575,
    "bleu4": 0.00646386587438759,
    "bertscore_precision": 0.3470831513404846,
    "bertscore_recall": 0.43072086572647095,
    "bertscore_f1": 0.3844052255153656
  }
}