{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Dolly Parton's Christmas of Many Colors: Circle of Love [DVD]\nReview Date: 2018/01/12\nStore: Alyvia Alyn Lind  (Actor),     Jennifer Nettles  (Actor),     Stephen Herek  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Documentary\nProduct Description: [\"Dolly Parton's Christmas of Many Colors: Circle of Love (DVD)\", 'Coming off the phenomenal performance of last year’s holiday special and looking to recapture the enthusiasm of the nearly 16 million viewers who tuned in, the heartwarming story continues with the next chapter in the young life of legendary country singer Dolly Parton, Dolly Parton’s Christmas of Many Colors: Circle of Love. The film delivers Christmas joy and peril as an unexpected blizzard threatens the Parton family, while at the same time Dolly’s father (and his kids) make sacrifices to raise enough money to finally buy his loving wife the wedding ring he could never afford to give her. Meanwhile, an important person in little Dolly’s life begins to see that her amazing voice and musical gift might just be made for something bigger than rural Tennessee.', ']]>']\nAverage Rating: 4.9\nProduct Details: {'Genre': 'Documentary, Musicals, Arts, Culture & Entertainment', 'Format': 'NTSC, Subtitled, DVD', 'Contributor': 'Alyvia Alyn Lind, Ricky Schroder, Sam Haskell, Gerald McRaney, Hudson Hickman, Stephen Herek, Jennifer Nettles, Pamela Long, Dolly PartonAlyvia Alyn Lind, Ricky Schroder, Sam Haskell, Gerald McRaney, Hudson Hickman, Stephen Herek, Jennifer Nettles, Pamela Long, Dolly Parton   See more', 'Initial release date': '2016-12-20', 'Language': 'English (Dolby Digital 5.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Item model number': '43382116', 'Director': 'Stephen Herek', 'Media Format': 'NTSC, Subtitled, DVD', 'Run time': '1 hour and 25 minutes', 'Release date': 'December 20, 2016', 'Actors': 'Alyvia Alyn Lind, Jennifer Nettles, Ricky Schroder, Gerald McRaney', 'Dubbed': 'English', 'Producers': 'Hudson Hickman, Dolly Parton, Sam Haskell, Pamela Long', 'Studio': 'Studio Distribution Services', 'Writers': 'Pamela Long', 'Number of discs': '1'}\nReview Text: Happy\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Sound of Music 50th Anniversary [Blu-ray]\nJulie Andrews  (Actor),     Christopher Plummer  (Actor),     Robert Wise  (Director)    &                   0                  more   Rated:    G    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Blu-ray Disc 1:', 'o\\xa0\\xa0\\xa0 Feature Film Remastered in 1080p Hi-Def with 7.1 DTS-HD Sound', 'o\\xa0\\xa0\\xa0 Your Favorite Things: An Interactive Celebration — All-New Immersive Viewing Experience with Behind-the-Scenes Images, On-Screen Lyrics, Trivia Track and Location Quiz', 'o\\xa0\\xa0\\xa0 Music Machine Sing-Along', 'o\\xa0\\xa0\\xa0 Audio Commentaries with Julie Andrews, Christopher Plummer and Director Robert Wise', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 Blu-ray Disc 2:', 'o\\xa0\\xa0\\xa0 NEW hour-long documentary THE SOUND OF A CITY: JULIE ANDREWS RETURNS TO SALZBURG', '·\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 NOTE: Digital subscription will work even if the codes are expired.']\n{'Genre': 'Drama, Musicals & Performing Arts/Musicals/General', 'Format': 'Blu-ray, Widescreen', 'Contributor': 'Julie Andrews, Christopher Plummer, Heather Menzies, Duane Chase, Robert Wise, Nicholas Hammond, Rodgers & Hammerstein, Charmian Carr, Eleanor Parker, Peggy Wood, Angela Cartwright, Richard HaydnJulie Andrews, Christopher Plummer, Heather Menzies, Duane Chase, Robert Wise, Nicholas Hammond, Rodgers & Hammerstein, Charmian Carr, Eleanor Parker, Peggy Wood, Angela Cartwright, Richard Haydn  See more', 'Language': 'English', 'Runtime': '2 hours and 56 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.5 x 5.3 x 6.7 inches; 1.6 Ounces', 'Item model number': '24543029564', 'Director': 'Robert Wise', 'Media Format': 'Blu-ray, Widescreen', 'Run time': '2 hours and 56 minutes', 'Release date': 'March 10, 2015', 'Actors': 'Julie Andrews, Christopher Plummer, Eleanor Parker, Richard Haydn, Peggy Wood', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, English, French', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nHappy\nFive Stars\nThe Secret Garden (Hallmark Hall of Fame)\nGennie James  (Actor),     Barret Oliver  (Actor),     Alan Grint  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n['Product description', \"Well-loved TV adaptation of Frances Hodgson Burnett's novel.\", 'Amazon.com', \"Mary Lennox (Gennie James) is a spoiled young British girl orphaned by an Indian epidemic. She is sent to Misselthwaite Manor in Yorkshire to live with a distant relative, Archibald Craven (Derek Jacobi), and there she becomes obsessed with a secret, overgrown garden. With the help of a local boy, Dickon, the garden and everyone around them--including Craven and his frail son, Colin--come to life again. Filmed on location at scenic Highclere Castle in Newbury, this Hallmark Hall of Fame presentation of Frances Hodgson Burnett's classic won an Emmy for Outstanding Children's Program. Although it can't top the 1949 version with Margaret O'Brien (or Agnieszka Holland's 1993 version), younger viewers may prefer this more straightforward retelling, whereas adults are sure to appreciate the fine performances by Jacobi and Billie Whitelaw (Mrs. Medlock). Colin Firth (\", \"Bridget Jones's Diary\", ') appears briefly as the adult Colin in this timeless, uplifting story for all ages.', '--Kathleen C. Fennessy']\n{'Genre': 'Drama', 'Format': 'Dolby, Color, NTSC', 'Contributor': 'Philip Locke, Alan Grint, Frances Hodgson Burnett, Colin Firth, Cassie Stuart, Barret Oliver, Karen Archer, Julian Glover, Billie Whitelaw, Jadrien Steele, Gennie James, Michael Hordern, Derek Jacobi, Lucy Gutteridge, Blanche HanalisPhilip Locke, Alan Grint, Frances Hodgson Burnett, Colin Firth, Cassie Stuart, Barret Oliver, Karen Archer, Julian Glover, Billie Whitelaw, Jadrien Steele, Gennie James, Michael Hordern, Derek Jacobi, Lucy Gutteridge, Blanche Hanalis  See more', 'Language': 'English (Dolby Digital 2.0 Surround)', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.01 Ounces', 'Director': 'Alan Grint', 'Media Format': 'Dolby, Color, NTSC', 'Run time': '1 hour and 40 minutes', 'Release date': 'May 21, 2002', 'Actors': 'Gennie James, Barret Oliver, Jadrien Steele, Michael Hordern, Billie Whitelaw', 'Subtitles': 'English', 'Studio': 'Hallmark', 'Writers': 'Blanche Hanalis, Frances Hodgson Burnett', 'Number of discs': '1'}\nHappy\nFive Stars\nEat Pray Love (Theatrical and Extended Cut) [Blu-ray]\nJulia Roberts  (Actor),     James Franco  (Actor),     Ryan Murphy  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'Liz Gilbert (Julia Roberts) is a modern woman on a quest to marvel at and travel the world while rediscovering and reconnecting with her true inner self in', 'Eat Pray Love', '. At a crossroads after a divorce, Gilbert takes a year-long sabbatical from her job and steps uncharacteristically out of her comfort zone, risking everything to change her life. In her wondrous and exotic travels, she experiences the simple pleasure of nourishment by eating in Italy; the power of prayer in India, and, finally and unexpectedly, the inner peace and balance of love in Bali. Based on an inspiring true story,', 'Eat Pray Love', 'proves that there really is more than one way to let yourself go and see the world.', 'Amazon.com', \"Elizabeth Gilbert's memoir of enlightenment gets the deluxe treatment at the hands of\", 'Glee', 'creator Ryan Murphy, who bathes every scene in a golden glow. Unaccustomed to being alone, Liz (Julia Roberts) exits her marriage to Stephen (Billy Crudup, quite good) only to enter into an affair with an actor (James Franco, curiously uncomfortable), who introduces her to meditation. Just as her editor, Delia (', 'Doubt', \"'s Viola Davis, making the most of a small role), longed to have a baby, Liz has longed to see the world. Delia persuades her to seize the day (plus, money presents no obstacle). First, she travels to Italy, where she noshes from Rome to Naples, making new friends along the way. Then, she heads to an ashram in India, where she meets a bride-to-be and a remorseful man (Richard Jenkins, heartbreaking), who nurture her altruistic side. Her sojourn ends in Bali, where she reunites with Ketut (Hadi Subiyanto, hilarious), the healer who first encouraged her to reassess her situation. While there, she befriends a single mother and a single father (\", 'No Country for Old Men', \"'s Javier Bardem) who falls for her charms. In an improvement over his version of\", 'Running with Scissors', \", Murphy combines two Oscar winners, two Oscar nominees, and four countries to follow one woman's path to fulfillment. Like\", 'Julie and Julia', 'and', 'How Stella Got Her Groove Back', \", Liz's story becomes more involving as she lets go of the superficial, but Murphy's movie still represents a triumph of escapism over spirituality.\", '--Kathleen C. Fennessy']\n{'Genre': 'Drama, Romance', 'Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Javier Bardem, Julia Roberts, Viola Davis, Richard Jenkins, Ryan Murphy, Billy Crudup, James Franco', 'Language': 'English', 'Runtime': '4 hours and 45 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.51 x 5.43 x 6.8 inches; 5.92 Ounces', 'Audio Description': 'English', 'Item model number': '15059349', 'Director': 'Ryan Murphy', 'Media Format': 'AC-3, Blu-ray, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 45 minutes', 'Release date': 'November 23, 2010', 'Actors': 'Julia Roberts, James Franco, Richard Jenkins, Viola Davis, Billy Crudup', 'Dubbed': 'French', 'Subtitles': 'English, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nNo movie cover.\nThree Stars\nGreater\nNeal McDonough  (Actor),     Quinton Aaron  (Actor),     David Hunt  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Product Description', 'GREATER follows the true story of Brandon Burlsworth who is perhaps the greatest walk-on in the history of college football. Brandon dreamed of playing for the Arkansas Razorbacks but was told he wasn t good enough to play Division I ball. Undeterred, Brandon took a risk and walked on in 1994. Written off by fellow teammates and coaches, Brandon displayed dogged determination in the face of staggering odds. The awkward kid who once was an embarrassment to his teammates and an annoyance to his coaches ended up becoming the most respected player in the history of the program, changing the lives of all he touched.', 'Review', '\"Burlsworth s story is undeniably touching\"- --LA times\"The best underdog sports movies since The Blind Side. It will make you stand up and cheer!\" --NYC movie guru\"Greater is a tremendous and inspiring film\" --Dove']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '8 x 5.75 x 0.5 inches; 7.05 Ounces', 'Item model number': '43297414', 'Director': 'David Hunt', 'Media Format': 'Dolby, NTSC, Widescreen, THX', 'Run time': '2 hours and 10 minutes', 'Release date': 'December 20, 2016', 'Actors': 'Neal McDonough, Quinton Aaron, Christopher Severio', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'Well Go Usa', 'Number of discs': '1'}\nLove it.\nFive Stars\nDolly Parton's Christmas of Many Colors: Circle of Love [DVD]\nAlyvia Alyn Lind  (Actor),     Jennifer Nettles  (Actor),     Stephen Herek  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Documentary\n[\"Dolly Parton's Christmas of Many Colors: Circle of Love (DVD)\", 'Coming off the phenomenal performance of last year’s holiday special and looking to recapture the enthusiasm of the nearly 16 million viewers who tuned in, the heartwarming story continues with the next chapter in the young life of legendary country singer Dolly Parton, Dolly Parton’s Christmas of Many Colors: Circle of Love. The film delivers Christmas joy and peril as an unexpected blizzard threatens the Parton family, while at the same time Dolly’s father (and his kids) make sacrifices to raise enough money to finally buy his loving wife the wedding ring he could never afford to give her. Meanwhile, an important person in little Dolly’s life begins to see that her amazing voice and musical gift might just be made for something bigger than rural Tennessee.', ']]>']\n{'Genre': 'Documentary, Musicals, Arts, Culture & Entertainment', 'Format': 'NTSC, Subtitled, DVD', 'Contributor': 'Alyvia Alyn Lind, Ricky Schroder, Sam Haskell, Gerald McRaney, Hudson Hickman, Stephen Herek, Jennifer Nettles, Pamela Long, Dolly PartonAlyvia Alyn Lind, Ricky Schroder, Sam Haskell, Gerald McRaney, Hudson Hickman, Stephen Herek, Jennifer Nettles, Pamela Long, Dolly Parton   See more', 'Initial release date': '2016-12-20', 'Language': 'English (Dolby Digital 5.1)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.64 Ounces', 'Item model number': '43382116', 'Director': 'Stephen Herek', 'Media Format': 'NTSC, Subtitled, DVD', 'Run time': '1 hour and 25 minutes', 'Release date': 'December 20, 2016', 'Actors': 'Alyvia Alyn Lind, Jennifer Nettles, Ricky Schroder, Gerald McRaney', 'Dubbed': 'English', 'Producers': 'Hudson Hickman, Dolly Parton, Sam Haskell, Pamela Long', 'Studio': 'Studio Distribution Services', 'Writers': 'Pamela Long', 'Number of discs': '1'}\nHappy\nFive Stars",
  "profile": "**User Summary:**\n\nThe user continues to demonstrate a strong preference for classic and family-friendly content, particularly within the drama and documentary genres. Their recent purchase and enthusiastic five-star rating highlight their ongoing appreciation for uplifting narratives that evoke emotional connections, especially those centered around themes of family values and personal growth. This latest interaction underscores their commitment to heartwarming storytelling, as they engage with content that resonates with their nostalgic sensibilities.\n\nWhile the user maintains a preference for DVD format, their choices indicate a consistent pursuit of high-quality viewing experiences, favoring productions that showcase esteemed directors and reputable actors. Their enthusiasm for adaptations of literary works remains evident, reflecting a dedication to well-crafted narratives that inspire and motivate.\n\nOverall, the user seeks enriching home entertainment that balances nostalgia with artistic quality, celebrating the emotional journeys of characters and the craftsmanship involved in filmmaking. Their ongoing engagement with heartwarming films reinforces their love for stories that connect deeply with audiences, emphasizing their interest in narratives that uplift and inspire.",
  "metrics": {
    "rouge1_f": 0.08282208588957055,
    "rouge2_f": 0.00511770726714432,
    "rougeL_f": 0.04498977505112474,
    "meteor": 0.02103726601408209,
    "bleu1": 1.2715647172630218e-06,
    "bleu2": 2.1550454014835596e-07,
    "bleu3": 4.401403233998114e-08,
    "bleu4": 1.9917768981766206e-08,
    "bertscore_precision": 0.2982713580131531,
    "bertscore_recall": 0.4507611393928528,
    "bertscore_f1": 0.35899415612220764
  }
}