{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Moroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nReview Date: 2016/01/02\nStore: Pure Body Naturals\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nReview Text: This is some great shampoo. I have tried several argan oil shampoos and this is by far the best. Great smell and leaves the hair soft before conditioning. Usually with shampoo, the hair feels dry but not with this. I even used this one time without conditioning afterwards and my hair was still soft and smelled really good.\nReview Title: I have tried several Argan oil shampoos and this is by far the best.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Helene Hair Brazilian Virgin Hair Human Hair Body Wave Top Lace Closure (4\"4\") Part 8-20 Inch Naturl Black Bleached Knots (18 Inch)\nHelene Hair\n{'Brand': 'Helene Hair', 'Color': 'Brown', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '13.5 x 5.4 x 1.5 inches; 0.35 Ounces', 'UPC': '889583690927'}\nThese closures never disappoint. I usually get the 10 or 12 inch closures but this time I got the 18 inch closure and its still beautiful. The hair is soft and luscious as always and the ends are healthy and full. I used these closure every time I make a wig I DO NOT WEAR SEW-INS only wigs. I have purchased over 15 of these closures, I love them and will continue to buy.\nGreat closure and great hair as ALWAYS!!\nMoroccan Argan Oil Shampoo, 8 Fl Oz - Smooths and Repairs - Sulfate Free - Natural - Imported from Morocco by Pure Body Naturals\nPure Body Naturals\n{'Brand': 'Pure Body Naturals', 'Item Form': 'Oil', 'Hair Type': 'All, Color Treated', 'Scent': 'Coconut', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3.9 x 5.91 x 5.91 inches; 8 Ounces', 'UPC': '646437736398 646437319751'}\nThis is some great shampoo. I have tried several argan oil shampoos and this is by far the best. Great smell and leaves the hair soft before conditioning. Usually with shampoo, the hair feels dry but not with this. I even used this one time without conditioning afterwards and my hair was still soft and smelled really good.\nI have tried several Argan oil shampoos and this is by far the best.",
  "profile": "**User Profile Summary:**\n\n- **Hair Products:** Holds a strong preference for high-quality human hair closures, particularly in body wave styles. Engages exclusively in wig-making rather than sew-ins.\n\n- **Brand Loyalty:** Demonstrates consistent purchasing behavior from a specific brand, reflecting satisfaction and trust in product performance, alongside a recent positive experience with a reputable shampoo brand.\n\n- **Product Length Preference:** Generally favors shorter hair lengths (10-12 inches), with an appreciation for longer options (up to 18 inches) for versatility, prioritizing healthy and full ends.\n\n- **Quality Expectations:** Expects softness and a natural appearance in hair care products, valuing healthy ends and effective results in every purchase.\n\n- **Reviewing Behavior:** Actively leaves enthusiastic reviews, highlighting strong recommendations for products that meet her standards and expressing intent to make future purchases based on satisfactory experiences. Recently provided a high rating for an Argan oil shampoo, indicating an appreciation for quality hair care products.\n\n- **Overall Trend:** Manifesting a discerning approach to hair care, the user emphasizes the importance of quality and effective performance. The consistency in preferences is evident, along with a growing interest in complementary hair care products that enhance her wig-making experience.",
  "metrics": {
    "rouge1_f": 0.22698072805139186,
    "rouge2_f": 0.043010752688172046,
    "rougeL_f": 0.13276231263383298,
    "meteor": 0.12555073594029134,
    "bleu1": 0.17572461928034377,
    "bleu2": 0.05568092536035632,
    "bleu3": 0.019870857905010655,
    "bleu4": 0.006682087619672164,
    "bertscore_precision": 0.4033471941947937,
    "bertscore_recall": 0.4356982707977295,
    "bertscore_f1": 0.4188990592956543
  }
}