{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 10Pcs Foldable Duo Angled Eyebrow Brush and Spoolie Brush Mascara Applicator Eyelash Separator Eyebrow Grooming Brush Tool\nReview Date: 2019/06/15\nStore: BTYMS\nAverage Rating: 4.1\nProduct Details: {'Brand': 'BTYMS', 'Recommended Uses For Product': 'Eyelashes, Eyebrow, For Mascara', 'Material': 'Plastic', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Package Dimensions': '6 x 2.4 x 0.7 inches; 0.81 Ounces'}\nReview Text: These turned out to be really well made little eyelash/eyebrow spoolies!  The brush side has soft bristles that are cut evenly and are securely attached to the base so there's been no bristle fallout anytime I use them. The spoolie side has a thick brush that works great to catch clumps and separate lashes. Both ends are easy to use, easy to clean, and the tool folds up for easy storage.  One thing I didn't overly like about this tool is how super lightweight it is - like 'light as a feather' light. Part of that is due to it only being just over four inches long, but from looking at the picture on the listing I expected these to weigh a bit more.  Another dislike is that none of the tools came with any protective sleeves on either end to protect the brush or spoolie. This was easily fixed by cutting up a drinking straw to slide over the brushes, but considering the nature of the brushes I had incorrectly thought that some type of cover would be on the brushes.  Still, for the price I can't gripe too much. These little guys do their jobs well and I have no complaints. I am happy to have backups for the one makeup tool that I seem to constantly lose or misplace.\nReview Title: Inexpensive but work perfectly\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "SALOCY Facial Mask Applicator,Facial Mask Brush 4 Piese with 2 Piese Cat ear Headbands\nSALOCY\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.8 x 4.9 x 1.7 inches; 2.4 Ounces', 'UPC': '756244688534'}\nLove the headbands, the brushes are pretty good. I took a pair of pliers and crimped down the metal onto the bristles so it held them better as I don't know how long the glue holding the bristles in will last after repeated washings. The handles are smooth and splinter free. The brush bristles are soft and won't scratch your skin, and smoothly applies masks from clay to gel. The bristles wash clean easily and haven't stained or changed color. The headbands are soft, totally adorable, and stay put. They wash well, but I've never put mine in the dryer and instead hang them up to air dry.\nGreat set for home spa\n10Pcs Foldable Duo Angled Eyebrow Brush and Spoolie Brush Mascara Applicator Eyelash Separator Eyebrow Grooming Brush Tool\nBTYMS\n{'Brand': 'BTYMS', 'Recommended Uses For Product': 'Eyelashes, Eyebrow, For Mascara', 'Material': 'Plastic', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '10', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Package Dimensions': '6 x 2.4 x 0.7 inches; 0.81 Ounces'}\nThese turned out to be really well made little eyelash/eyebrow spoolies!  The brush side has soft bristles that are cut evenly and are securely attached to the base so there's been no bristle fallout anytime I use them. The spoolie side has a thick brush that works great to catch clumps and separate lashes. Both ends are easy to use, easy to clean, and the tool folds up for easy storage.  One thing I didn't overly like about this tool is how super lightweight it is - like 'light as a feather' light. Part of that is due to it only being just over four inches long, but from looking at the picture on the listing I expected these to weigh a bit more.  Another dislike is that none of the tools came with any protective sleeves on either end to protect the brush or spoolie. This was easily fixed by cutting up a drinking straw to slide over the brushes, but considering the nature of the brushes I had incorrectly thought that some type of cover would be on the brushes.  Still, for the price I can't gripe too much. These little guys do their jobs well and I have no complaints. I am happy to have backups for the one makeup tool that I seem to constantly lose or misplace.\nInexpensive but work perfectly",
  "profile": "**User Profile Summary:**\n\n- **Product Interest:** Home spa and skincare accessories, with a recent emphasis on grooming tools for eyelashes and eyebrows.\n- **Key Preferences:**\n  - Prioritizes quality and durability of materials (e.g., brushes) with features like soft bristles and secure attachments.\n  - Prefers skin-friendly, practical items that enhance user experience and are easy to clean and maintain. \n- **Practicality:** Demonstrates a hands-on approach to product improvement, finding creative solutions for product protection and longevity, such as using drinking straws for storage.\n- **Aesthetic Appeal:** Values adorable and visually appealing items while maintaining functionality.\n- **Care Instructions:** Favors gentle care for products and appreciates easy-to-use tools for a seamless routine.\n- **Usage Context:** Engages in home spa activities and self-care rituals, indicating an interest in effective skincare and grooming practices.\n\nThe user's recent purchase reflects a trend towards investing in essential grooming tools that complement their skincare routine and enhance practical aspects of usage, including ease of cleaning and storage. The user's well-thought-out reviews suggest a discerning nature and a focus on balancing quality with affordability in their selections.",
  "metrics": {
    "rouge1_f": 0.2435897435897436,
    "rouge2_f": 0.04501607717041801,
    "rougeL_f": 0.11538461538461538,
    "meteor": 0.11468238711606646,
    "bleu1": 0.09900244620612265,
    "bleu2": 0.03327761208780069,
    "bleu3": 0.014034793881335097,
    "bleu4": 0.0043146391829056805,
    "bertscore_precision": 0.3936533033847809,
    "bertscore_recall": 0.4566904902458191,
    "bertscore_f1": 0.4228353798389435
  }
}