{
  "interaction_number": 17,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Haywire\nReview Date: 2022/08/27\nStore: Carano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Action & Adventure\nProduct Description: ['Directed by Oscar® winner* Steven Soderbergh (', 'Contagion', '), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,', 'HAYWIRE', 'is explosive movie entertainment.']\nAverage Rating: 4.2\nProduct Details: {'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'MFR031398152156#VG', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: I thought that this would be a good exciting movie. It was kinda boring.\nReview Title: Ok movie.\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "White Hunter Black Heart\nClint Eastwood  (Actor, Director, Producer),     Jeff Fahey  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['For a film of “excitement, wit and intelligence” (Rex Reed, New York Observer), your hunt is over. As star and director of White Hunter, Black Heart, Clint Eastwood crafts one of the most acclaimed movies of his enduring career. He plays brilliant, driven filmmaker John Wilson (loosely based on the legendary John Huston), who’s determined to turn his new project in Africa into a grand personal adventure hunting a wild elephant. Jeff Fahey, Marisa Berenson and George Dzundza co-star in this rugged and absorbing tale from the novel by co-screenwriter Peter Viertel, who worked with Huston in Africa in 1950 on The African Queen. Filmed in Zimbabwe and London, White Hunter, Black Heart is a bold trek into the heart of adventure. Set your sights.']\n{'Genre': 'Drama, Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Timothy Spall, George Dzundza, David Valdes, Burt Kennedy, Mel Martin, James Bridges, Clint Eastwood, Alun Armstrong, Marisa Berenson, Peter Viertel, Jeff FaheyTimothy Spall, George Dzundza, David Valdes, Burt Kennedy, Mel Martin, James Bridges, Clint Eastwood, Alun Armstrong, Marisa Berenson, Peter Viertel, Jeff Fahey   See more', 'Language': 'English (Dolby Digital 5.1), Unqualified, Portuguese (Dolby Digital 1.0)', 'Runtime': '1 hour and 52 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000120252DVD', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 52 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Jeff Fahey, George Dzundza, Alun Armstrong, Marisa Berenson', 'Dubbed': 'French, Portuguese', 'Subtitles': 'Portuguese, English, Thai, Japanese, Spanish, Korean, French', 'Producers': 'David Valdes, Clint Eastwood', 'Studio': 'Studio Distribution Services', 'Writers': 'Peter Viertel, James Bridges, Burt Kennedy', 'Number of discs': '1'}\nGreat movie.\nGreat movie\nBronco Billy\nClint Eastwood  (Actor, Director),     Sondra Locke  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Ask Clint Eastwood to select personal favorites among his movies and one choice might surprise you. “It’s an old-fashioned theme,” Eastwood says. “But if, as a film director, I ever wanted to say something, you’ll find it in Bronco Billy.” “One of the funniest and most touching films you’ll see this or any year” (Rona Barrett, ABC-TV) casts him as the ace sharpshooter and head of Bronco Billy’s Wild West Show, a down-at-the-heel traveling circus. Life’s been hard for Billy and his ragtag troupe. But their luck might change – in the unlikely person of a highfalutin society dame (Sondra Locke). You may already have a favorite Eastwood role. Watch Bronco Billy and chances are you’ll have another.']\n{'Genre': 'Comedy, Westerns', 'Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Bill McKinney, Dennis Hackin, Beverlee McKinsey, Geoffrey Lewis, Dan Vadis, Sam Bottoms, Robert Daley, Clint Eastwood, Woodrow Parfrey, Sierra Pecheur, Doug McGrath, Neal Dobrofsky, Sondra Locke, Merle Haggard, Walter Barnes, Scatman CrothersBill McKinney, Dennis Hackin, Beverlee McKinsey, Geoffrey Lewis, Dan Vadis, Sam Bottoms, Robert Daley, Clint Eastwood, Woodrow Parfrey, Sierra Pecheur, Doug McGrath, Neal Dobrofsky, Sondra Locke, Merle Haggard, Walter Barnes, Scatman Crothers   See more', 'Initial release date': '2010-06-01', 'Language': 'English (Dolby Digital 4.0), Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': 'WHV1000120192DVD', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Sondra Locke, Geoffrey Lewis, Scatman Crothers, Bill McKinney', 'Subtitles': 'English, French', 'Producers': 'Robert Daley, Neal Dobrofsky, Dennis Hackin', 'Studio': 'Studio Distribution Services', 'Writers': 'Dennis Hackin', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie.\nWay to go Clint.\nTightrope\nClint Eastwood  (Actor, Producer),     Geneviève Bujold  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Lured by the promise of kinky sex, two men prowl the French Quarter. One is a cop. The other is a killer. Clint Eastwood is Wes Block, a lawman walking a Tightrope separating him from the man he strives to be and the man he fears he is. When investigating brutal sex murders, he uncovers a link between himself and the suspect. To the killer, the only good hooker is a dead one – especially if she’s been with Block. Soon no woman who knows Block is safe, including those dearest to him (Genevieve Bujold and Alison Eastwood). Showcasing New Orleans at its moody best, writer/director Richard Tuggle (Escape from Alcatraz) adds shadings to Block that make him more than a stoic action hero. And Eastwood grabs the challenge with one of his best performances ever.']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Clint Eastwood, Geneviève Bujold', 'Initial release date': '2010-06-01', 'Language': 'English (Dolby Digital 5.1), Unqualified', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '120253', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Geneviève Bujold', 'Subtitles': 'Portuguese, Spanish, Korean, French, English, Japanese, Thai', 'Producers': 'Clint Eastwood', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nIt's ok.\nOk movie\nThe Beguiled (1971)\nClint Eastwood  (Actor),     Geraldine Page  (Actor),     Don Siegel  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n[\"Clint Eastwood and Geraldine Page star in this tense psychological drama of love and betrayal. During the Civil War a wounded Union soldier is sheltered by the headmistress and students of a girls' academy in the South. As his health returns his desire increases, but can he trust these enemy women not to turn him in? He takes his chances but soon realizes that his benefactress can't be trusted...with his love or with his life! His lustful ambition turns quickly against him and the story follows him through a series of nerve-shattering events, including realistic scenes that are among the boldest, most shocking ever witnessed on film. Directed by Don Siegel, with a sultry score by Lalo Schifrin, this bittersweet thriller of hidden passions is set in one of America's romantic eras.Bonus Content:\", 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 105 min', 'Director': 'Don Siegel', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 45 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Geraldine Page, Elizabeth Hartman, Jo Ann Harris, Darleen Carr', 'Dubbed': 'French', 'Subtitles': 'English', 'Producers': 'Don Siegel', 'Language': 'French (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Mono), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John B. Sherry, Grimes Grice', 'Number of discs': '1'}\nNot my kind of movie.\nOk movie.\nTrue Crime\nClint Eastwood  (Actor, Director, Producer),     Isaiah Washington  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases\n['Boozer, skirt chaser, careless father. You could create your own list of reporter Steve Everett’s faults but there’s no time. A San Quentin Death Row prisoner is slated to die at midnight – a man Everett has suddenly realized is innocent. In his 21st film as diredctor and 41st as star, Clint Eastwood memorably plays Everett in True Crime, a savvy beat-the-clock thriller. Isaiah Washington, Denis Leary, Lisa Gay Hamilton, James Woods, Diane Venora and others populate this suspense tale that tightens to nerve-frying intensity intercutting the parallel stories of the inmate and Everett’s scramble to save him…and perhaps lift his own life out of the trash heap along the way. Everett is harried, determined and trying not to self-destruct. And the clock is ticking.']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Contributor': 'Isaiah Washington, Sydney Poitier, Denis Leary, Andrew Klavan, James Woods, Paul Brickman, Clint Eastwood, Lisa Gay Hamilton, Larry Gross, Lili Fini Zanuck, Frances Fisher, Diane Venora, Richard D. Zanuck, Stephen Schiff, Tom RookerIsaiah Washington, Sydney Poitier, Denis Leary, Andrew Klavan, James Woods, Paul Brickman, Clint Eastwood, Lisa Gay Hamilton, Larry Gross, Lili Fini Zanuck, Frances Fisher, Diane Venora, Richard D. Zanuck, Stephen Schiff, Tom Rooker  See more', 'Initial release date': '2010-06-01', 'Language': 'English (Mono), French (Dolby Digital 1.0), Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000120099DVD', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, Dolby, Full Screen, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 8 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Isaiah Washington, Denis Leary, Lisa Gay Hamilton, James Woods', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Producers': 'Richard D. Zanuck, Tom Rooker, Clint Eastwood, Lili Fini Zanuck', 'Studio': 'Studio Distribution Services', 'Writers': 'Larry Gross, Paul Brickman, Stephen Schiff', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLike Clint better in westerns.\nOk\nJoe Kidd\nClint Eastwood  (Actor),     Robert Duvall  (Actor),     John Sturges  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', \"Clint Eastwood stars as former bounty hunter turned hired gunslinger, Joe Kidd, who finds himself in the middle of a range war in rough and rugged New Mexico. Following an armed uprising by local Mexican revolutionaries who claim they've been cheated out of their land, Kidd is hired to quell the rebellion by a wealthy land baron (Robert Duvall) with interests in the disputed territory. But Kidd's and his employer's interests are soon at odds when he falls for a beautiful Hispanic rebel in this top-notch action-adventure from acclaimed veteran western director John Sturges.\", 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', \"Clint Eastwood's stardom was supernova, thanks to\", 'Dirty Harry', '; John Sturges, the man behind', 'The Magnificent Seven', 'and a dozen other memorably leathery Westerns, was directing; and Elmore Leonard was the screenwriter. It just goes to show.', 'Joe Kidd', 'is a muddle and a drag, the shoddiest Eastwood vehicle since Rowdy Yates trod in his last cow flop. Kidd, first seen as a duded-up drunk sleeping one off in jail, is supposed to be a horse rancher and an expert tracker--just the fellow a rapacious land-grabber (Robert Duvall committing lazy villainy) needs to chase down the uppity Latino (John Saxon) who\\'s trying to reclaim the grabbed land for its rightful owners. Neither the characters nor the overland pursuit makes any sense, thanks to chasms in the continuity and no direction to speak of. An absurdly arbitrary assault-by-locomotive provides the climax; as Eastwood observed, \"Jesus, anything at this point--let\\'s end it.\"', '--Richard T. Jameson']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 88 min', 'Director': 'John Sturges', 'Media Format': 'Multiple Formats, Dolby, NTSC, Color, Widescreen, Letterboxed, Closed-captioned', 'Run time': '1 hour and 28 minutes', 'Release date': 'May 9, 2010', 'Actors': 'Clint Eastwood, Robert Duvall, John Saxon, Don Stroud, Stella Garcia', 'Dubbed': 'French, Spanish', 'Subtitles': 'English, Spanish', 'Producers': 'Sidney Beckerman', 'Language': 'French (Dolby Digital 2.0 Mono), Spanish (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Mono), Unqualified', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Elmore Leonard', 'Number of discs': '1'}\nNice movie.\nAction western.\nThe Eiger Sanction\nClint Eastwood  (Actor, Director),     George Kennedy  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['Product Description', 'Clint Eastwood directs and stars in this international intrigue action thriller that takes place on the Swiss Alps.Hemlock, a retired professional assassin (Eastwood), who has turned toward the calmer pursuit of art collecting, is suddenly forced out of retirement to hunt a deadly double agent who murdered a close friend. The hunt takes Eastwood on a breathtaking journey up the Swiss Alps with a team of mountain climbers - one of whom is the man he seeks though his identity is as yet unknown.The top-notch action film, based on the novel by Trevanian, features some of the most exciting mountain climbing sequences ever filmed.Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', 'Amazon.com', 'Clint Eastwood held the dual role of director and star of this 1975 spy thriller, which makes up for sluggish pacing with a breathtaking climax on a treacherous peak in the Swiss Alps. The plot kicks into gear when Eastwood, playing a retired assassin, is recruited back into a secret organization to avenge the murder of an old friend. He\\'s then blackmailed into making a second \"hit\"; this time his target is one of three men who will be attempting to conquer the Eiger, a dangerous peak in Switzerland. Himself an accomplished climber, Eastwood\\'s character joins the expedition with George Kennedy as leader of the ground crew. Shifting loyalties, apparent betrayals, and paranoid suspicion factor into the suspenseful climax on the sheer face of the mountain. This memorable sequence--for which Eastwood performed his own mountain-climbing stunts--is effectively intense, built on a standard plot of double-cross and intrigue that was intended to combine Eastwood\\'s screen persona with the global adventure of the James Bond films. For the most part it works--it\\'s not one of Eastwood\\'s better films, but it\\'s got some first-class thrills (and a sly performance by Jack Cassidy) to grab and hold your interest.', '--Jeff Shannon']\n{'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'Relay Time: 129 min', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen, Letterboxed', 'Run time': '2 hours and 9 minutes', 'Release date': 'December 15, 1998', 'Actors': 'Clint Eastwood, George Kennedy, Vonetta McGee, Jack Cassidy, Heidi Bruhl', 'Subtitles': 'English, Spanish, French', 'Producers': 'Robert Daley, Richard Zanuck', 'Language': 'English (Dolby Digital 2.0 Mono), Unqualified, Unknown (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Hal Dresner, Warren B. Murphy, Rod Whitaker', 'Number of discs': '1'}\nNot my kind of movie.\nFair\nHonkytonk Man / Pink Cadillac / City Heat\nClint Eastwood  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n['Honkytonk Man/Pink Cadillac/City Heat (DVD) (3FE) (Multi-Title)', \"Hollywood icon Clint Eastwood shows his on-screen versatility in three very different films. The star who grew up during the hard times of the 1930s takes on a Depression Era role as a rambling Honkytonk Man (Disc 1/Side A) and Dust Bowl drifter who hopes to land a Grand Ole Opry gig. The pace is lighter and loopier as Eastwood revs up a Pink Cadillac (Disc 1/Side B) to play a skip-tracer who nabs bail jumpers before the ink on their bogus I.D.s is dry. Bernadette Peters is the woman who slaps cuffs on the lawman's heart. Finally, Eastwood returns to Depression times for City Heat (Disc 2), teaming with Burt Reynolds in a hard-boiled and hilarious tale of jazz, bullets and bootleg gin in 1933 Kansas City. Drink up and duck!\", ']]>']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Clint Eastwood', 'Language': 'Unqualified', 'Runtime': '5 hours and 42 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Item model number': '12569768093', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '5 hours and 42 minutes', 'Release date': 'November 7, 2006', 'Actors': 'Clint Eastwood', 'Studio': 'WarnerBrothers', 'Number of discs': '2'}\nBoth are goid action movies.\nGreat combo.\nThunderbolt and Lightfoot\nClint Eastwood  (Actor),     Jeff Bridges  (Actor),     Michael Cimino  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Screen legends Clint Eastwood and Jeff Bridges star as a pair of modern-day outlaws in this bold, witty and tough action-packed crime thriller. Thunderbolt (Eastwood) is a former thief whose razor-sharp wits and steely nerves made him a master of his profession, but he's about to reenter the criminal world with a new partner: Lightfoot (Bridges), a brash young drifter whose energy and exuberance give the veteran a new outlook on life… their target: the seemingly impenetrable Montana Armored Depository. After forming an uneasy alliance with Thunderbolt's former partners in crime, Red Leary (George Kennedy, Cool Hand Luke) and Eddie Goody (Geoffrey Lewis, High Plains Drifter), they launch an amazing scheme that will test the limits of their endurance, and the power of their friendship. Fueled by explosive action, fascinating characters and a powerfully moving climax, Thunderbolt and Lightfoot is an adventure of the highest caliber and the directorial debut of the great Michael Cimino (The Deer Hunter).Special Features: Poster Gallery | Original Theatrical Trailer\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '1603', 'Director': 'Michael Cimino', 'Media Format': 'Multiple Formats, Anamorphic, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'February 1, 2020', 'Actors': 'Clint Eastwood, Jeff Bridges, George Kennedy, Geoffrey Lewis, Catherine Bach', 'Subtitles': 'English', 'Studio': 'Kino Studio Classics', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove the movie.\nGreat show.\nTwo Mules For Sister Sara\nClint Eastwood  (Actor),     Shirley MacLaine  (Actor),     Don Siegel  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Clint Eastwood is a hard-hitting high plains drifter who rides into town and single-handedly rescues a local nun (Shirley MacLaine) from a gang of attackers. After meeting a band of Mexican revolutionaries bent on resisting the French occupation of Mexico, the cowboy and Sister Sara decide to join forces with the freedom fighters and set off on a deadly mission to capture the enemy's garrison. But along the way, a steamy romance develops between them when the soft-spoken hero discovers the nun is not what she seems. Ending with a violent climax at the well-protected fort, this action-packed western classic cemented Eastwood's status as a true cinematic superstar!\", 'Bonus Content:', 'Theatrical Trailer', 'Theatrical Trailer', 'Recommendations', 'Recommendations', ']]>']\n{'Genre': 'Westerns, Action & Adventure', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Martin Rackin, Shirley MacLaine, Clint Eastwood, Alberto Morin, Carroll Case, Manolo Fabregas, Don Siegel, Albert MaltzMartin Rackin, Shirley MacLaine, Clint Eastwood, Alberto Morin, Carroll Case, Manolo Fabregas, Don Siegel, Albert Maltz  See more', 'Initial release date': '2010-08-22', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0), Unqualified, Spanish (Dolby Digital 2.0)', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 1.98 Ounces', 'Item model number': '2219706', 'Director': 'Don Siegel', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 54 minutes', 'Release date': 'August 22, 2010', 'Actors': 'Clint Eastwood, Shirley MacLaine, Manolo Fabregas, Alberto Morin', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Producers': 'Martin Rackin, Carroll Case', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Albert Maltz', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGood acting.\nGood western.\nA Perfect World\nKevin Costner  (Actor),     Clint Eastwood  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Academy Award winners* Kevin Costner and Clint Eastwood confront each other from opposite sides of the law in A Perfect World, an acclaimed, multilayered manhunt saga (directed by Eastwood) that rumbles down Texas backroads toward a harrowing collision with fate. Costner plays Butch Haynes, a hardened prison escapee on the lam with a young hostage (T.J. Lowther in a remarkable film debut) who sees in Butch the father figure he never had. Eastwood is wily Texas Ranger Red Garnett, leading deputies and a criminologist (Laura Dern) on a statewide pursuit. Red knows every road and pothole in the Panhandle. What's more, he knows the elusive Haynes – because their paths have crossed before.\", 'DVD Features:', 'Filmographies', 'Interactive Menus', 'Scene Access', 'Theatrical Trailer']\n{'Genre': 'Drama, Suspense', 'Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'John Lee Hancock, Leo Burmester, T.J. Lowther, Keith Szarabajka, David Valdes, Kevin Costner, Clint Eastwood, Paul Hewitt, Laura Dern, Mark Johnson, Bradley WhitfordJohn Lee Hancock, Leo Burmester, T.J. Lowther, Keith Szarabajka, David Valdes, Kevin Costner, Clint Eastwood, Paul Hewitt, Laura Dern, Mark Johnson, Bradley Whitford   See more', 'Initial release date': '2010-06-01', 'Language': 'English (Dolby Digital 5.1), Unqualified, French (Dolby Digital 4.0)', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WHV1000149786DVD', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Kevin Costner, Clint Eastwood, Laura Dern, T.J. Lowther, Keith Szarabajka', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, English', 'Producers': 'Mark Johnson, David Valdes', 'Studio': 'Studio Distribution Services', 'Writers': 'John Lee Hancock', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat show.\nGood movie\nEvery Which Way But Loose\nJames Fargo  (Director),     Clint Eastwood  (Actor),     Sondra Locke  (Actor)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n[\"Philo Beddoe is your regular, easygoing, truck-driving guy. He's also the best barroom brawler west of the Rockies. And he lives with a 165-pound orangutan named Clyde. Like other guys, Philo finally falls in love – with a flighty singer who leads him on a screwball chase across the American Southwest. Nothing’s in the way except a motorcycle gang, two sneaky off-duty cops and legendary brawler Tank Murdock. Every Which Way but Loose was a change of pace for Clint Eastwood – and it proved to be one of his most popular films. With a soaring country score and a solid supporting cast including Sondra Locke, Geoffrey Lewis, Beverly D’Angelo and the great Ruth Gordon, it’s in every which way possible a grand time for all.\"]\n{'Genre': 'Drama, Comedy', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': \"Geoffrey Lewis, Beverly D'Angelo, Sondra Locke, Robert Daley, Walter Barnes, James Fargo, Clint Eastwood, Jeremy Joe Kronsberg, Ruth Gordon, ManisGeoffrey Lewis, Beverly D'Angelo, Sondra Locke, Robert Daley, Walter Barnes, James Fargo, Clint Eastwood, Jeremy Joe Kronsberg, Ruth Gordon, Manis   See more\", 'Initial release date': '2010-06-01', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 0.01 Ounces', 'Item model number': '101350', 'Director': 'James Fargo', 'Media Format': 'Multiple Formats, NTSC, Color', 'Run time': '1 hour and 54 minutes', 'Release date': 'June 1, 2010', 'Actors': \"Clint Eastwood, Sondra Locke, Geoffrey Lewis, Beverly D'Angelo, Ruth Gordon\", 'Producers': 'Robert Daley', 'Studio': 'Studio Distribution Services', 'Writers': 'Jeremy Joe Kronsberg', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove the ape in this movie.\nGreat comedy show.\nHappy Feet Two\nElijah Wood  (Actor),     Pink  (Actor),     George Miller  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'The sequel to \"Happy Feet\", the Academy Award®-winning animated smash hit, \"Happy Feet Two\" returns audiences to the magnificent landscape of Antarctica. Mumble, The Master of Tap, has a problem because his tiny son, Erik, is choreo-phobic. Reluctant to dance, Erik runs away and encounters The Mighty Sven - a penguin who can fly! Mumble has no hope of competing with this charismatic new role model. But things get worse when the world is shaken by powerful forces. Erik learns of his father\\'s \"guts and grit\" as Mumble brings together the penguin nations and all manner of fabulous creatures - from tiny Krill to giant Elephant Seals - to put things right.', 'Amazon.com', 'The sequel', 'Happy Feet 2', \"begins a few years after the 2006 original ended: Mumble (voiced by Elijah Wood) is now married to Gloria (Pink) and the father of Erik (Ava Acres), a chick who's afraid to dance. When Erik sees the puffin Mighty Sven (Hank Azaria), he decides he can learn to fly: Sven is the leader of a cult that preaches if you believe it, it can happen. An unexplained seismic event causes a glacier to shift, trapping Gloria and all the other emperor penguins: Mumble, Erik, and two other chicks must rescue them before they starve. What begins as a familiar story about a diffident chick quickly becomes needlessly and hopelessly mired in subplots involving elephant seals, skua gulls, human explorers, and a pair of renegade krill (voiced by Brad Pitt and Matt Damon). The motion-capture animation is adequate at best, with snow and water splashing around the dancing penguins to hide the fact that their feet aren't making contact with the ground plane. Endless tracking shots over the cracking glaciers recall the second\", 'Ice Age', 'movie. The vocal performances feature a discordant mélange of accents, with African-American, Latino, and British penguins, surfer-dude krill, Australian seals, and \"fugeddaboutit\"', 'Jersey Shore', 'seagulls. Even more jarring is the presence of human actors who appear out of nowhere, start to help the trapped penguins, then disappear. The standard-issue poop and snot jokes do little to leaven the nonstop nattering.', 'Happy Feet 2', 'confirms 2011 as the year of the unnecessary sequel in American animation. (Rated PG for some rude humor and mild peril)', '--Charles Solomon']\n{'Genre': 'Musicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, ComedyMusicals & Performing Arts/Musicals, Kids & Family, Drama/Love & Romance, Animation, Comedy  See more', 'Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Elijah Wood, Pink, George Miller', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 39 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': 'WHV1000168080DVD', 'Director': 'George Miller', 'Media Format': 'Multiple Formats, AC-3, Animated, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 39 minutes', 'Release date': 'March 13, 2012', 'Actors': 'Elijah Wood, Pink', 'Subtitles': 'English, French, Spanish', 'Studio': 'Warner Bros. Pictures', 'Number of discs': '1'}\nLove the cartoon action show.\nIs alots of colorful action show\nThe Bridges of Madison County\nMeryl Streep  (Actor),     Jim Haynie  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['World-traveling National Geographic photographer Robert Kincaid and Iowa housewife Francesca Johnson aren’t looking to turn their lives upside down. Each is at a point in life where expectations are behind them. Yet four days after they meet, they don’t want to lose the love they’ve found. Academy Award winners* Meryl Streep and Clint Eastwood (earning her 10th Oscar nomination for her work here) and Clint Eastwood (who also produces and directs) bring blazing starpower and powerful conviction to the lovers chronicled in Robert James Waller’s rhapsodic bestseller.']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Contributor': 'Robert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim HaynieRobert James Waller, Meryl Streep, Kathleen Kennedy, Debra Monk, Victor Slezak, Annie Corley, Phyllis Lyons, Clint Eastwood, Sarah Kathryn Schmitt, Richard LaGravenese, Christopher Kroon, Jim Haynie  See more', 'Initial release date': '2010-06-01', 'Language': 'Unqualified', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '5.28 x 7.56 x 0.67 inches; 2.12 Ounces', 'Item model number': '120193', 'Director': 'Clint Eastwood', 'Media Format': 'Multiple Formats, Color, NTSC, Widescreen', 'Run time': '2 hours and 15 minutes', 'Release date': 'June 1, 2010', 'Actors': 'Clint Eastwood, Meryl Streep, Jim Haynie, Annie Corley, Victor Slezak', 'Producers': 'Clint Eastwood, Kathleen Kennedy', 'Studio': 'Studio Distribution Services', 'Writers': 'Richard LaGravenese', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOk show.\nNot a western but it's ok\nOverdrive\nFreddie Thorp  (Actor),     Ana de Armas  (Actor),     Antonio Negret  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n[\"From the writers of 2 Fast 2 Furious and the director of Taken, Overdrive is a high-octane, action-packed joyride. Legendary car thieves Andrew (Scott Eastwood) and Garrett (Freddie Thorp) are caught in the act of stealing from notorious crime boss Jacomo Morier. In order to win back their freedom they're put to the ultimate test - the theft of a priceless car from Morier's sworn enemy. While putting together a crew to pull off the daring heist they're joined by two beautiful women (Ana de Armas & Gaia Weiss) who are more dangerous than they look. The team has one week to put the plan in motion, steal the car, and make their escape or lose everything, including their lives.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.19 Ounces', 'Item model number': 'overdrive-1', 'Director': 'Antonio Negret', 'Media Format': 'Widescreen, AC-3, NTSC, Dolby, Subtitled', 'Run time': '1 hour and 33 minutes', 'Release date': 'August 28, 2018', 'Actors': 'Freddie Thorp, Ana de Armas, Scott Eastwood', 'Subtitles': 'Spanish', 'Studio': 'Paramount Pictures Home Entertainment', 'Number of discs': '1'}\nLots of action. Great movie to watch. Fast shipping.\nLots of action\nTransporter 1 and 2\nCorey Yuen  (Director),     Jason Statham  (Actor),     Shu Qi  (Actor)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"The Transporter (2002)Ex-Special Forces operator Frank Martin (Jason Statham) lives what seems to be a quiet life along the French Mediterranean, hiring himself out as a mercenary transporter who moves goods - human or otherwise - from one place to another. No questions asked. Dangerous complications ensue when he is hired to kidnap the feisty daughter of a lethal Chinese crime lord who's smuggling his fellow countrymen into France.Transporter 2 (2005)Mercenary Frank Martin (Jason Statham) has accepted a job that seems easy enough, as chauffeur and bodyguard to young Jack (Hunter Clary), son of crusading politician Jefferson Billings (Matthew Modine). The problem is that Billings is crusading against an international drug cartel. They retaliate by kidnapping Jack and infecting him with a deadly and highly contagious virus. Responsible for the boy, Frank must reclaim him and then find an antidote before scores of innocents are stricken.\"]\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.12 Ounces', 'Item model number': '34207203', 'Director': 'Corey Yuen', 'Media Format': 'NTSC, Multiple Formats, Widescreen', 'Release date': 'August 4, 2015', 'Actors': 'Jason Statham, Shu Qi, Matt Schulze, Francois Berleand, Ric Young', 'Studio': '20th Century Studios', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat action movies...\nGreat movie\nHaywire\nCarano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Directed by Oscar® winner* Steven Soderbergh (', 'Contagion', '), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,', 'HAYWIRE', 'is explosive movie entertainment.']\n{'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing', 'Language': 'English', 'Runtime': '1 hour and 33 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.4 Ounces', 'Audio Description': 'English', 'Item model number': 'MFR031398152156#VG', 'Media Format': 'Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'May 1, 2012', 'Actors': 'Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael', 'Subtitles': 'Spanish, English', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI thought that this would be a good exciting movie. It was kinda boring.\nOk movie.",
  "actual_interaction": {
    "rating": 3.0,
    "title": "Ok movie.",
    "text": "I thought that this would be a good exciting movie. It was kinda boring.",
    "images": [],
    "asin": "B007C4ZJ0S",
    "parent_asin": "B007C4ZJ0S",
    "user_id": "AG6ECFGMAQLE7T3V7WIKSKV6YMQA",
    "timestamp": "2022-08-27 18:42:35.810000",
    "helpful_vote": 0,
    "verified_purchase": true,
    "main_category": "Movies & TV",
    "title_meta": "Haywire",
    "average_rating": 4.2,
    "rating_number": 3380,
    "features": [],
    "description": [
      "Directed by Oscar® winner* Steven Soderbergh (",
      "Contagion",
      "), this dynamic action-thriller introduces mixed martial arts (MMA) superstar Gina Carano as Mallory Kane, a black-ops agent for a government security contractor. After freeing a Chinese journalist held hostage, Mallory is double-crossed and left for dead – by someone in her own agency. Suddenly the target of assassins who know her every move, Mallory unleashes the fury of her fighting skills to uncover the truth and turn the tables on her ruthless adversary. Featuring Carano performing her own high-adrenaline stunts and an all-star cast including Michael Fassbender, Ewan McGregor, Bill Paxton, Channing Tatum, Antonio Banderas and Michael Douglas,",
      "HAYWIRE",
      "is explosive movie entertainment."
    ],
    "price": 7.19,
    "images_meta": [
      {
        "thumb": "https://m.media-amazon.com/images/I/51GF4pTIaNL._SX38_SY50_CR,0,0,38,50_.jpg",
        "large": "https://m.media-amazon.com/images/I/51GF4pTIaNL.jpg",
        "variant": "MAIN",
        "hi_res": "https://m.media-amazon.com/images/I/61oZ45CZK+L._SL1000_.jpg"
      }
    ],
    "videos": [],
    "store": "Carano, Gina  (Actor),     Douglas, Michael  (Actor)    Rated:    R    Format: DVD",
    "categories": [
      "Movies & TV",
      "Featured Categories",
      "DVD",
      "Action & Adventure"
    ],
    "details": {
      "Genre": "Action",
      "Format": "Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen",
      "Contributor": "Carano, Gina, Douglas, Michael, Ross, Debby Lynn, Fassbender, Michael, Tatum, Channing",
      "Language": "English",
      "Runtime": "1 hour and 33 minutes",
      "Is Discontinued By Manufacturer": "No",
      "MPAA rating": "R (Restricted)",
      "Product Dimensions": "0.6 x 5.4 x 7.5 inches; 2.4 Ounces",
      "Audio Description": "English",
      "Item model number": "MFR031398152156#VG",
      "Media Format": "Multiple Formats, Closed-captioned, Color, AC-3, Dolby, NTSC, Subtitled, Widescreen",
      "Run time": "1 hour and 33 minutes",
      "Release date": "May 1, 2012",
      "Actors": "Carano, Gina, Douglas, Michael, Tatum, Channing, Ross, Debby Lynn, Fassbender, Michael",
      "Subtitles": "Spanish, English",
      "Studio": "Lionsgate",
      "Country of Origin": "USA",
      "Number of discs": "1"
    },
    "bought_together": null,
    "subtitle": NaN,
    "author": NaN
  }
}