{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Saving Grace\nReview Date: 2015/06/20\nStore: Brenda Blethyn  (Actor),     Craig Ferguson  (Actor, Writer),     Nigel Cole  (Director)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product description', 'Saving Grace (Widescreen/Full Screen)', 'Amazon.com', 'Imagine a Cheech and Chong pothead comedy, only instead of two scruffy lowlifes, the movie is about an aimless Scottish gardener and a middle-aged British widow with a green thumb. Grace (Brenda Blethyn of', 'Secrets and Lies', 'and', 'Little Voice', ') has just discovered that her recently deceased husband has left her with an enormous debt when her gardener Matthew (Craig Ferguson,', 'The Big Tease', ') asks her to help him tend to his small, personal-use marijuana crop. Grace soon realizes that they can turn her green house into a hydroponics laboratory and turn out a profitable crop--if only they can keep the local constables at bay and then find a dealer to actually sell the stuff.', 'Saving Grace', \"has well-developed characters, intelligent dialogue, a charming and capable cast, and clean, clear direction. But at heart it's still a marijuana comedy, with most of its funniest moments coming from the silly, stoned behavior of elderly ladies and other stuffy Brits. Nothing wrong with that, and Blethyn and Ferguson give the film a strong anchor. The ending goes a little over-the-top, but most of the movie is well-grounded in genuine human behavior. A subplot about Matthew's girlfriend's pregnancy is treated with respect and integrity. Sweet, silly, and sincere.\", '--Bret Fetzer']\nAverage Rating: 4.8\nProduct Details: {'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'Tchky Karyo, Clive Merrison, Valerie Edmond, Brenda Blethyn, Tristan Sturrock, Bill Bailey, Diana Quick, Craig Ferguson, Leslie Phillips, Mark Crowdy, Jamie Foreman, Martin Clunes, Nigel Cole, Phyllida LawTchky Karyo, Clive Merrison, Valerie Edmond, Brenda Blethyn, Tristan Sturrock, Bill Bailey, Diana Quick, Craig Ferguson, Leslie Phillips, Mark Crowdy, Jamie Foreman, Martin Clunes, Nigel Cole, Phyllida Law   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '2.35:1, 1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Director': 'Nigel Cole', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'December 19, 2000', 'Actors': 'Brenda Blethyn, Craig Ferguson, Martin Clunes, Tchky Karyo, Jamie Foreman', 'Studio': 'New Line Home Video', 'Writers': 'Craig Ferguson, Mark Crowdy', 'Number of discs': '1'}\nReview Text: yes\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Breaking Bad: Season 05 (Episode 1-8)\nBryan Cranston  (Actor),     Anna Gunn  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Uneasy lies the head that wears the crown. Bryan Cranston and Aaron Paul return in their Emmyr -winning roles of Walter White and Jesse Pinkman in the fifth explosive season of Breaking Bad. With Gus Fring dead, Walt's transformation from a well-meaning family man to ruthless drug kingpin is nearly complete. Forming a partnership with Jesse and Mike (Jonathan Banks), Walt proceeds to make a killing in the meth business until the fruits of his murderous schemes are threatened by a new development in the investigation led by his relentless brother-in-law Hank (Dean Norris). Executive produced by Vince Gilligan and Mark Johnson, the fifth season charts the murderous rise of Walter White as he reaches new highs...and new lows.\", 'Episodes in this season:', 'Live Free or Die', 'Live Free or Die', 'Madrigal', 'Madrigal', 'Hazard Pay', 'Hazard Pay', 'Fifty - One', 'Fifty - One', 'Dead Freight', 'Dead Freight', 'Buyout', 'Buyout', 'Say My Name', 'Say My Name', 'Gliding Over All', 'Gliding Over All']\n{'Genre': 'TV', 'Format': 'Multiple Formats, Box set, Closed-captioned, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Giancarlo Esposito, Charles Baker, Betsy Brandt, Anna Gunn, Christopher Cousins, Dean Norris, RJ Mitte, Bryan Cranston, Bob Odenkirk, Jonathan Banks, Steven Michael Quezada, Aaron PaulGiancarlo Esposito, Charles Baker, Betsy Brandt, Anna Gunn, Christopher Cousins, Dean Norris, RJ Mitte, Bryan Cranston, Bob Odenkirk, Jonathan Banks, Steven Michael Quezada, Aaron Paul   See more', 'Language': 'English', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 2.4 Ounces', 'Item model number': '43396409200', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 15 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Bryan Cranston, Anna Gunn, Aaron Paul, Dean Norris, Betsy Brandt', 'Dubbed': 'French', 'Subtitles': 'French, Spanish, Chinese, Korean, Portuguese, Thai', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '3'}\ngood\nFive Stars\nBreaking Bad - Season 03 (4 discs)\nBryan Cranston  (Actor),     Aaron Paul  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Winner of two 2010 Emmy Awards, including Outstanding Lead Actor in a Drama Series for Bryan Cranston and Outstanding Supporting Actor in a Drama Series for Aaron Paul,', 'Breaking Bad: The Complete Third Season', 'returns, hailed by the Los Angeles Times as \"the best show on television.\" Even though his cancer\\'s in remission, chemistry teacher-turned-meth maker Walter White (Cranston) still can\\'t catch a break. his wife (Anna Gunn) has filed for divorce, his DEA agent brother-in-law (Dean Norris) is out to bust him and a Mexican cartel just wants him dead. But with his family\\'s future still at stake Walt cooks up a deal that will make him a fortune, a scheme with a terrible price. Executive produced by Vince Gilligan and Mark Johnson.', 'Amazon.com', \"Here's how things are going for Walter White, the central character in\", 'Breaking Bad', ', as this outstanding cable series reaches its third season. By the end of the fourth episode, less than a third of the way through the year, Walt (played by Bryan Cranston, who won three straight Emmys for this role) has been arrested and put in jail twice; has been served with divorce papers by his wife, to whom he has finally confessed that he\\'s a crystal methamphetamine manufacturer; has had a serious falling out with his young partner in crime; and is the subject of a manhunt by two silent but very deadly members of a Mexican drug cartel. And it gets a lot worse. Of course, Walt is hardly the only character who\\'s afflicted, conflicted, and \"breaking bad.\" Wife Skyler (Anna Gunn) is in the excruciating position of knowing that she could blow the whistle on Walt and get him out of her and their children\\'s lives once and for all, while also realizing what that would do to her family. Hank (Dean Norris), the DEA agent who\\'s married to Skyler\\'s sister, becomes obsessed with figuring out who\\'s putting \"blue meth\" on the streets of Albuquerque, little knowing that it\\'s his own brother-in-law and leading to near-tragic consequences. And partner Jesse (Aaron Paul, another Emmy winner) is haunted by the fact that it was his drugs that killed his girlfriend, whose distraught father may have caused a hideously destructive plane collision over the city when he returned to his air traffic controller job too soon.', 'All of this is presented in an artful brew of black humor and frequently violent drama, with excellent acting, dialogue, and storytelling (the 10th episode, \"The Fly,\" takes place entirely in Walt and Jesse\\'s fancy new meth lab), and innovative film techniques (the opening scenes in episode one, and several thereafter, are shot with a beautiful, almost sepia-toned look). But it\\'s Walt, portrayed so memorably by Cranston, who remains the main draw, as this brilliant but self-destructive, angry man, prone to making calamitous decisions, gradually realizes that he is truly becoming Heisenberg, his criminal alter ego, and is in way over his head--and may very well be losing his mind in the process. One can only wonder how much lower creator Vince Gilligan and his team will take him in season four.', 'The bonus features are many and varied, with numerous offerings on all four discs. Audio commentary, available on the nine episodes, is provided by Gilligan, Cranston, Paul, and other actors and members of the team. Elsewhere, a variety of short but entertaining featurettes focus on behind-the-scenes details of individual shots (Walt deftly tossing a pizza on to the roof of his house), scenes (Walt impetuously torching a huge pile of cash, then trying to douse the blaze in his swimming pool), props (Walt’s custom-painted Pontiac Aztek), characters (an interview with the real-life brothers who portray the two murderous Mexican cousins), or the show’s music. Other offerings include pod casts, deleted scenes, a gag reel, and a series of promotional pieces produced for AMC (which airs the show) under the banner of “Inside', 'Breaking Bad', ',” in which members of the cast and crew discuss specific aspects of each episode (viewer beware, as these bits contain some spoilers).', '--Sam Graham']\n{'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Betsy Brandt, Anna Gunn, RJ Mitte, Dean Norris, Bryan Cranston, Aaron Paul', 'Language': 'English', 'Number Of Discs': '4', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 6.4 Ounces', 'Item model number': '40982209820', 'Media Format': 'Multiple Formats, AC-3, Box set, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '10 hours and 13 minutes', 'Release date': 'May 7, 2013', 'Actors': 'Bryan Cranston, Aaron Paul, Anna Gunn, RJ Mitte, Dean Norris', 'Subtitles': 'French, Spanish', 'Studio': 'Sony', 'Number of discs': '4'}\ngreat\nFive Stars\nBreaking Bad: Season 1\nBryan Cranston  (Actor),     Aaron Paul  (Actor)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'Emmy® Award winner Bryan Cranston stars as Walter White, a down-on-his-luck chemistry teacher struggling to make ends meet for his wife (Anna Gunn) and physically challenged son (RJ Mitte). Everything changes when Walter receives a startling diagnosis: terminal lung cancer. With only a few years to live and nothing to lose, Walter uses his training as a chemist to cook and sell crystal meth with one of his former students (Aaron Paul). As his status grows, so do his lies, but Walt will stop at nothing to make sure his family is taken care of after he’s gone, even if it means putting all their lives on the line. Executive produced by Vince Gilligan and Mark Johnson.', 'Amazon.com', 'No one would confuse the desperate dad Bryan Cranston plays in this character-driven drama with the fun-loving Hal from', 'Malcolm in the Middle', \". In AMC's\", 'Breaking Bad', ', Walter White lives in the suburbs with his wife--and wears tighty-whiteys--but the similarities end there. During the pilot, the cash-strapped chemistry teacher finds out he has inoperable lung cancer. He and Skyler (', 'Deadwood', \"'s Anna Gunn) have one son, Walter Jr. (R.J. Mitte), and a daughter on the way. With two years to get his affairs in order, Walter comes up with a wild plan: he and former student Jesse (Aaron Paul), a drug dealer, will open a meth lab.\", 'In the hands of creator Vince Gilligan (', 'The X-Files', '),', 'Bad', \"'s first season plays like the improbable offspring of\", 'Weeds', 'and', 'The Shield', '. With nothing left to lose, the Albuquerque 50-year-old uses his death sentence as a catalyst to break every rule he\\'s ever followed while keeping his family--including Skyler\\'s radiologist sister, Marie (Betsy Brandt), and her DEA agent husband, Hank (Dean Norris)--out of the loop. Throughout these seven episodes, Walt takes on a hostage, a dead body, and a partner who likes to sample his own product. Based on the description alone, the program shouldn\\'t work as well as it does, except Gilligan and company keep the situations psychologically believable and Emmy winner Cranston makes Walt surprisingly sympathetic as he swings between compassion and self-interest. As he tells his students, \"Chemistry is the study of change,\" a statement that applies equally well to the show, since Walt ends up in a very different place than the one he began. This three-disc set comes complete with cast and crew commentary, an installment of AMC\\'s', 'Shootout', ', two featurettes, deleted scenes, and screen tests.', '--Kathleen C. Fennessy']\n{'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Betsy Brandt, Anna Gunn, Dean Norris, RJ Mitte, Bryan Cranston, Aaron Paul', 'Language': 'Unqualified', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 4.64 Ounces', 'Item model number': '7806823', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '5 hours and 46 minutes', 'Release date': 'February 24, 2009', 'Actors': 'Bryan Cranston, Aaron Paul, Anna Gunn, Dean Norris, Betsy Brandt', 'Subtitles': 'Portuguese, French, Spanish', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '3'}\nservice\nFive Stars\nBreaking Bad: The Final Season\nBryan Cranston  (Actor, Producer),     Anna Gunn  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"It all ends with a bang! In the final episodes, Emmyr winners Bryan Cranston and Aaron Paul bring the saga of Breaking Bad to a bloody conclusion in their roles as meth kingpin Walter White and his guilt-ridden partner Jesse Pinkman. As each tries to get clear of the wreckage they left behind in the meth world, DEA agent Hank Schrader's obsessive pursuit of 'Heisenberg' gains steam, leading up to a shattering finale that will leave no one in Walt's world unscathed. Executive Produced by Vince Gilligan, Mark Johnson and Michelle MacLaren, the final episodes bring the unforgettable story of Walter White to its inevitable close.\", 'Episodes in this Season:', 'Blood Money', 'Blood Money', 'Buried', 'Buried', 'Confessions', 'Confessions', 'Rabid Dog', 'Rabid Dog', \"To'hajiilee\", \"To'hajiilee\", 'Ozymandias', 'Ozymandias', 'Granite State', 'Granite State', 'Felina', 'Felina']\n{'Genre': 'TV', 'Format': 'Multiple Formats, Box set, Color, Closed-captioned, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Contributor': 'Betsy Brandt, Laura Fraser, Diane Mercer, Anna Gunn, Dean Norris, RJ Mitte, Bryan Cranston, Bob Odenkirk, Aaron Paul, Jesse Plemons, Stewart A. LyonsBetsy Brandt, Laura Fraser, Diane Mercer, Anna Gunn, Dean Norris, RJ Mitte, Bryan Cranston, Bob Odenkirk, Aaron Paul, Jesse Plemons, Stewart A. Lyons  See more', 'Language': 'Unqualified (DTS ES 6.1), Unqualified (Dolby Digital 5.1), Unqualified (Dolby Surround 4.1)', 'Number Of Discs': '3', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 6.4 Ounces', 'Item model number': '202845', 'Media Format': 'Multiple Formats, Box set, Color, Closed-captioned, Dolby, AC-3, NTSC, Subtitled, Widescreen', 'Run time': '6 hours and 31 minutes', 'Release date': 'November 26, 2013', 'Actors': 'Bryan Cranston, Anna Gunn, Aaron Paul, Dean Norris, Betsy Brandt', 'Dubbed': 'French', 'Subtitles': 'French, Spanish', 'Producers': 'Bryan Cranston, Stewart A. Lyons, Diane Mercer', 'Studio': 'Sony Pictures Entertainment', 'Country of Origin': 'USA', 'Number of discs': '3'}\ngreat\nFive Stars\nSaving Grace\nBrenda Blethyn  (Actor),     Craig Ferguson  (Actor, Writer),     Nigel Cole  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product description', 'Saving Grace (Widescreen/Full Screen)', 'Amazon.com', 'Imagine a Cheech and Chong pothead comedy, only instead of two scruffy lowlifes, the movie is about an aimless Scottish gardener and a middle-aged British widow with a green thumb. Grace (Brenda Blethyn of', 'Secrets and Lies', 'and', 'Little Voice', ') has just discovered that her recently deceased husband has left her with an enormous debt when her gardener Matthew (Craig Ferguson,', 'The Big Tease', ') asks her to help him tend to his small, personal-use marijuana crop. Grace soon realizes that they can turn her green house into a hydroponics laboratory and turn out a profitable crop--if only they can keep the local constables at bay and then find a dealer to actually sell the stuff.', 'Saving Grace', \"has well-developed characters, intelligent dialogue, a charming and capable cast, and clean, clear direction. But at heart it's still a marijuana comedy, with most of its funniest moments coming from the silly, stoned behavior of elderly ladies and other stuffy Brits. Nothing wrong with that, and Blethyn and Ferguson give the film a strong anchor. The ending goes a little over-the-top, but most of the movie is well-grounded in genuine human behavior. A subplot about Matthew's girlfriend's pregnancy is treated with respect and integrity. Sweet, silly, and sincere.\", '--Bret Fetzer']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Contributor': 'Tchky Karyo, Clive Merrison, Valerie Edmond, Brenda Blethyn, Tristan Sturrock, Bill Bailey, Diana Quick, Craig Ferguson, Leslie Phillips, Mark Crowdy, Jamie Foreman, Martin Clunes, Nigel Cole, Phyllida LawTchky Karyo, Clive Merrison, Valerie Edmond, Brenda Blethyn, Tristan Sturrock, Bill Bailey, Diana Quick, Craig Ferguson, Leslie Phillips, Mark Crowdy, Jamie Foreman, Martin Clunes, Nigel Cole, Phyllida Law   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '2.35:1, 1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 1.6 Ounces', 'Director': 'Nigel Cole', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, Widescreen, NTSC', 'Run time': '1 hour and 33 minutes', 'Release date': 'December 19, 2000', 'Actors': 'Brenda Blethyn, Craig Ferguson, Martin Clunes, Tchky Karyo, Jamie Foreman', 'Studio': 'New Line Home Video', 'Writers': 'Craig Ferguson, Mark Crowdy', 'Number of discs': '1'}\nyes\nFive Stars",
  "profile": "The user maintains a strong focus on high-quality television series and films, particularly those with intense narratives and complex character dynamics. Their recent purchase reflects an ongoing commitment to critically acclaimed productions that emphasize character-driven storytelling and psychological depth, consistent with their preference for award-winning content featuring powerful performances.\n\nEngaging with high-stakes narratives that encourage binge-watching, the user demonstrates a dedication to immersive viewing experiences characterized by emotional engagement and moral complexities. Their latest acquisition, which combines elements of comedy with well-developed characters and intelligent dialogue, indicates a broader interest in narratives that, while perhaps lighter in tone, still resonate with genuine human behavior and complexity.\n\nThe user continues to pursue productions that reflect their appreciation for strong acting and thoughtful storytelling techniques, reinforcing their profile as an avid consumer of high-quality dramatic content. Their interactions consistently align with a passion for exploring narratives that delve into the human condition, effectively enhancing their enjoyment of both dramatic and character-centric stories, showcasing their diverse yet refined taste in entertainment. Overall, they remain committed to discovering content that offers both depth and insight, regardless of genre.",
  "metrics": {
    "rouge1_f": 0.06909090909090908,
    "rouge2_f": 0.007278020378457059,
    "rougeL_f": 0.03781818181818183,
    "meteor": 0.01994746971715357,
    "bleu1": 2.9547794496914825e-08,
    "bleu2": 1.0640120658035419e-08,
    "bleu3": 4.172743933233364e-09,
    "bleu4": 1.2372097722811308e-09,
    "bertscore_precision": 0.3082142472267151,
    "bertscore_recall": 0.4833028316497803,
    "bertscore_f1": 0.3763931691646576
  }
}