{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: X-MEN: DAYS OF FUTURE PAST\nReview Date: 2014/10/30\nStore: Hugh Jackman  (Actor),     James McAvoy  (Actor),     Bryan Singer  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: ['X-Men Unite! An all-star cast, including Hugh Jackman, Michael Fassbender, James McAvoy, Halle Berry, Jennifer Lawrence, Ellen Page, Ian McKellen and Patrick Stewart assemble and prepare for battle in this awesome adventure packed with nonstop action and excitement. As armies of murderous Sentinel robots hunt down mutants and humans alike, the unstoppable characters from the original X-MEN film trilogy join forces with their younger selves in an epic struggle to change the past; and save our future!']\nAverage Rating: 4.6\nProduct Details: {'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 12 minutes', 'Release date': 'October 14, 2014', 'Actors': 'Hugh Jackman, James McAvoy, Michael Fassbender, Jennifer Lawrence, Halle Berry', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Producers': 'Lauren Shuler Donner, Bryan Singer, Simon Kinberg, Hutch Parker', 'Studio': '20th Century Fox', 'Writers': 'Jane Goldman, Simon Kinberg, Matthew Vaughn', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Outstanding action Science fiction. Be sure to rematch X-Men first class to catch all of the references between the Professor and Wolverine.  Loved it!\nReview Title: Fast action\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Mel Brooks'], 'Producers': ['Mel Brooks'], 'Starring': ['Leslie Nielsen', 'Peter MacNicol', 'Steven Weber'], 'Studio': ['Warner Bros.']}\nLove Leslie Nielsen.  His silly slap-stick comedy always makes me laugh and Dracula: Dead and Loving it is one of my favorites.\nComedy as only Leslie Nielsen can\n10th Kingdom - The Epic Miniseries Event\nKimberly Williams-Paisley  (Actor),     Scott Cohen  (Actor),     David Carson  (Director),     Herbert Wise  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Two Worlds Come Together In One Fantastic Adventure!', 'A Magical Epic Adventure The Whole Family Will Enjoy!', 'Trust me...when you join us in The 10th Kingdom, you ll find fantasy and action and romance and adventure. It s a spectacular place to come and play.', 'Camryn Manheim', 'Join an all-star cast as they find fantasy, action, romance and adventure in the Emmy winning®', 'The 10th Kingdom', '! Beyond the mortal world lies Nine Kingdoms where the fantastic land of fairy tales and magic are brought to life and reinvented. The themes and ideas of folklore and mythology perform fully as the classic characters enter a vortex at the edge of the mortal world which leads them to', 'The 10th Kingdom', '...Central Park!', 'This ten part mini-series tells the tale of Prince Wendell (Daniel Lapaine) and the evil queen (Dianne Wiest) who has doomed him to spend the rest of his life as a dog. In order to recapture the throne Prince Wendell travels through the portal to the mythical kingdom of Manhattan and finds two ordinary mortals Virginia (Kimberly Williams-Paisley) and Tony (John Larroquette). Together they battle the evils of the parallel universe, and defend themselves from vile trolls, goblins and every fairy tale character imaginable! Stunning visual effects and a stellar cast create an epic adventure that will enchant audiences of all ages!', 'An all-star cast featuring a wealth of Emmy®, Oscar®, and Golden Globe®-wining and nominated talent including : John Larroquette (', 'Boston Legal', ',', 'The Practice), Kimberly Williams-Paisley (Nashville', ',', 'Father of the Bride), Scott Cohen (Love and Other Drugs', ',', 'Jacob s Ladder), Ann-Margret (Bye Bye Birdie', ',', 'Tommy), Rutger Hauer (Batman Begins', ',', 'Sin City), Daniel Lapaine (', 'Double Jeopardy), Camryn Manheim (', 'The Practice', '), Ed O Neil (', 'Modern Family', ',', 'Married with Children) and Dianne Wiest (Edward Scissorhands', ',', 'Parenthood', ')']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.52 Ounces', 'Item model number': '4098520982', 'Director': 'David Carson, Herbert Wise', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Surround Sound', 'Run time': '7 hours and 27 minutes', 'Release date': 'March 12, 2013', 'Actors': 'Kimberly Williams-Paisley, Scott Cohen, John Larroquette, Dianne Wiest, Camryn Manheim', 'Studio': 'Mill Creek Ent', 'Number of discs': '1'}\nI love the 10th Kingdom miniseries.  When I saw it at this low price I bought it for a friend.  I had purchased it for myself many years ago and paid $30.00 for the set.  Hours of good entertainment.\nOne of my favorite stories\nCSI: Crime Scene Investigation - Season 8\nMarg Helgenberger  (Actor),     Jorja Fox  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', 'CSI: Crime Scene Investigation', 'is a fast-paced drama about a passionate team of forensic investigators trained to solve crimes the old-fashioned way – by examining the evidence.', 'CSI: Crime Scene Investigation', 'is on the case 24-7, scouring the scene, collecting irrefutable evidence and finding the missing pieces that will solve the mystery.', 'Amazon.com', 'The eighth season of', 'CSI: Crime Scene Investigation', \"begins with the answer to the previous season's cliffhanger: Yes, CSI Sara Sidle (Jorja Fox) survives. But fans of this top-rated crime procedural won't be able to breathe a sigh of relief. By the end of the 17 episodes--which originally aired during the 2007-2008 television season--two fan favorites will be gone. This year,\", 'CSI', \"explores the complicated romance between Sara and head CSI Gil Grissom (William Petersen). But the storyline is weaved in so well with the gruesome cases that their relationship is never overpowering to the viewer. Though the show was truncated due to the Writers Guild strike, the flow of the series doesn't lose any momentum--not even with the loss of cast members or even episodes that center on peripheral supporting characters. Fellow CSIs Catherine Willows (Marg Helgenberger), Nick Stokes (George Eads), and Warrick Brown (Gary Dourdan) return to help solve seemingly unsolvable cases. But not all of the best moments involve whodunits. Some of the most compelling vignettes revolve around Warrick, who is battling a nasty prescription drug addiction as he tries to navigate his way through a messy divorce. Longtime fans of the series may remember child genius Hannah West (portrayed chillingly by Juliette Goglia), who helped get her brother acquitted of a murder charge in season six. She is back after her brother is once again charged with homicide. Sara--who had wrongfully believed that Hannah was just an innocent little girl--finds herself unable to distance herself from this case. There is a crossover ratings stunt episode with Jack Malone (Anthony LaPaglia) visiting from CBS' other drama\", 'Without a Trace', \". While both LaPaglia and Petersen are formidable, there really isn't room for both of them on one show. And let's face it, Petersen's our guy.\", '--Jae-Ha Kim']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Contributor': 'Marg Helgenberger, Jorja Fox', 'Language': 'English (Stereo), English (Dolby Digital 5.1), Spanish (Stereo), Unqualified', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.9 x 5.5 x 7.5 inches; 8.8 Ounces', 'Item model number': '6429087858', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Run time': '12 hours', 'Release date': 'October 14, 2008', 'Actors': 'Marg Helgenberger, Jorja Fox', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nOne of my favorite shows.  So happy to find this on Amazon at a fair price.\nLove CSI\nX-MEN: DAYS OF FUTURE PAST\nHugh Jackman  (Actor),     James McAvoy  (Actor),     Bryan Singer  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['X-Men Unite! An all-star cast, including Hugh Jackman, Michael Fassbender, James McAvoy, Halle Berry, Jennifer Lawrence, Ellen Page, Ian McKellen and Patrick Stewart assemble and prepare for battle in this awesome adventure packed with nonstop action and excitement. As armies of murderous Sentinel robots hunt down mutants and humans alike, the unstoppable characters from the original X-MEN film trilogy join forces with their younger selves in an epic struggle to change the past; and save our future!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 12 minutes', 'Release date': 'October 14, 2014', 'Actors': 'Hugh Jackman, James McAvoy, Michael Fassbender, Jennifer Lawrence, Halle Berry', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Producers': 'Lauren Shuler Donner, Bryan Singer, Simon Kinberg, Hutch Parker', 'Studio': '20th Century Fox', 'Writers': 'Jane Goldman, Simon Kinberg, Matthew Vaughn', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOutstanding action Science fiction. Be sure to rematch X-Men first class to catch all of the references between the Professor and Wolverine.  Loved it!\nFast action",
  "profile": "**User Profile Summary:**\n\n- **Comedy Preference:** Strong preference for classic slapstick and humorous content, particularly valuing the comedic style of Leslie Nielsen.\n- **Entertainment Themes:** Enjoys films and series that incorporate elements of violence, frightening scenes, and adult humor (including foul language and sexual content), while also appreciating family-friendly fantasy narratives, showcasing a diverse taste in genre. Recently demonstrated interest in crime dramas that merge character development with intense storytelling.\n- **Artistic Appreciation:** Demonstrates an appreciation for notable directors and producers renowned for comedic and fantasy films, with a specific interest in industry figures like Mel Brooks and Bryan Singer.\n- **Language Preference:** Prefers content in English, including availability of audio descriptions and closed captions for enhanced accessibility. \n- **Rating Trends:** Generally leans towards high ratings, with an average near 4.7, indicating a consistent positive evaluation of entertainment consumed, including family-friendly content rated above 4.8.\n- **Subtitles and Accessibility:** Shows a strong inclination towards content with subtitle options, favoring detailed engagement with material.\n- **Recent Interaction:** Recently enjoyed a science fiction action film, appreciating its fast-paced narrative and character connections, which aligns with the user’s growing taste for engaging storytelling.\n\nOverall, the user exhibits a love for classic comedies, engaging fantasy narratives, and increasingly character-driven dramas, all while maintaining a strong preference for accessible content.",
  "metrics": {
    "rouge1_f": 0.14915254237288136,
    "rouge2_f": 0.016293279022403257,
    "rougeL_f": 0.06101694915254237,
    "meteor": 0.04594798306673083,
    "bleu1": 0.0018091669224144953,
    "bleu2": 0.0005160617420774039,
    "bleu3": 0.00016350804939971875,
    "bleu4": 5.180148454702234e-05,
    "bertscore_precision": 0.37119731307029724,
    "bertscore_recall": 0.4839816987514496,
    "bertscore_f1": 0.4201522767543793
  }
}