{
  "interaction_number": 15,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Diagnosis Murder// Complete Collection/8 Seasons 178 Episodes\nReview Date: 2019/08/15\nStore: Dick Van Dyke  (Actor),     Michael Tucci  (Actor),     *  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Boxed Sets, Mystery & Suspense\nProduct Description: [\"Legendary, five-time Emmy Award-winner Dick Van Dyke stars as Dr. Mark Sloan, Chief of Internal Medicine at Community General Hospital. Sloan utilizes his medical expertise and natural sleuthing sensibilities to solve crimes alongside his homicide detective son. Van Dyke won legions of new fans with this dramatic role, but of course he's as charming as ever. Set includes three original TV movies that predate the television series and two that conclude the series. 178 episodes, 143 hrs, 32 DVDs.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Barry Van Dyke, Dick Van Dyke, *, Michael Tucci', 'Language': 'English, English', 'Number Of Discs': '32', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': '*', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '143 hours', 'Release date': 'December 2, 2016', 'Actors': 'Dick Van Dyke, Michael Tucci, Barry Van Dyke', 'Studio': 'Trin', 'Number of discs': '32'}\nReview Text: Mysteries without visual violence.  Love these.\nReview Title: Delightful mysteries\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Mel Brooks'], 'Producers': ['Mel Brooks'], 'Starring': ['Leslie Nielsen', 'Peter MacNicol', 'Steven Weber'], 'Studio': ['Warner Bros.']}\nLove Leslie Nielsen.  His silly slap-stick comedy always makes me laugh and Dracula: Dead and Loving it is one of my favorites.\nComedy as only Leslie Nielsen can\n10th Kingdom - The Epic Miniseries Event\nKimberly Williams-Paisley  (Actor),     Scott Cohen  (Actor),     David Carson  (Director),     Herbert Wise  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Two Worlds Come Together In One Fantastic Adventure!', 'A Magical Epic Adventure The Whole Family Will Enjoy!', 'Trust me...when you join us in The 10th Kingdom, you ll find fantasy and action and romance and adventure. It s a spectacular place to come and play.', 'Camryn Manheim', 'Join an all-star cast as they find fantasy, action, romance and adventure in the Emmy winning®', 'The 10th Kingdom', '! Beyond the mortal world lies Nine Kingdoms where the fantastic land of fairy tales and magic are brought to life and reinvented. The themes and ideas of folklore and mythology perform fully as the classic characters enter a vortex at the edge of the mortal world which leads them to', 'The 10th Kingdom', '...Central Park!', 'This ten part mini-series tells the tale of Prince Wendell (Daniel Lapaine) and the evil queen (Dianne Wiest) who has doomed him to spend the rest of his life as a dog. In order to recapture the throne Prince Wendell travels through the portal to the mythical kingdom of Manhattan and finds two ordinary mortals Virginia (Kimberly Williams-Paisley) and Tony (John Larroquette). Together they battle the evils of the parallel universe, and defend themselves from vile trolls, goblins and every fairy tale character imaginable! Stunning visual effects and a stellar cast create an epic adventure that will enchant audiences of all ages!', 'An all-star cast featuring a wealth of Emmy®, Oscar®, and Golden Globe®-wining and nominated talent including : John Larroquette (', 'Boston Legal', ',', 'The Practice), Kimberly Williams-Paisley (Nashville', ',', 'Father of the Bride), Scott Cohen (Love and Other Drugs', ',', 'Jacob s Ladder), Ann-Margret (Bye Bye Birdie', ',', 'Tommy), Rutger Hauer (Batman Begins', ',', 'Sin City), Daniel Lapaine (', 'Double Jeopardy), Camryn Manheim (', 'The Practice', '), Ed O Neil (', 'Modern Family', ',', 'Married with Children) and Dianne Wiest (Edward Scissorhands', ',', 'Parenthood', ')']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.52 Ounces', 'Item model number': '4098520982', 'Director': 'David Carson, Herbert Wise', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Surround Sound', 'Run time': '7 hours and 27 minutes', 'Release date': 'March 12, 2013', 'Actors': 'Kimberly Williams-Paisley, Scott Cohen, John Larroquette, Dianne Wiest, Camryn Manheim', 'Studio': 'Mill Creek Ent', 'Number of discs': '1'}\nI love the 10th Kingdom miniseries.  When I saw it at this low price I bought it for a friend.  I had purchased it for myself many years ago and paid $30.00 for the set.  Hours of good entertainment.\nOne of my favorite stories\nCSI: Crime Scene Investigation - Season 8\nMarg Helgenberger  (Actor),     Jorja Fox  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', 'CSI: Crime Scene Investigation', 'is a fast-paced drama about a passionate team of forensic investigators trained to solve crimes the old-fashioned way – by examining the evidence.', 'CSI: Crime Scene Investigation', 'is on the case 24-7, scouring the scene, collecting irrefutable evidence and finding the missing pieces that will solve the mystery.', 'Amazon.com', 'The eighth season of', 'CSI: Crime Scene Investigation', \"begins with the answer to the previous season's cliffhanger: Yes, CSI Sara Sidle (Jorja Fox) survives. But fans of this top-rated crime procedural won't be able to breathe a sigh of relief. By the end of the 17 episodes--which originally aired during the 2007-2008 television season--two fan favorites will be gone. This year,\", 'CSI', \"explores the complicated romance between Sara and head CSI Gil Grissom (William Petersen). But the storyline is weaved in so well with the gruesome cases that their relationship is never overpowering to the viewer. Though the show was truncated due to the Writers Guild strike, the flow of the series doesn't lose any momentum--not even with the loss of cast members or even episodes that center on peripheral supporting characters. Fellow CSIs Catherine Willows (Marg Helgenberger), Nick Stokes (George Eads), and Warrick Brown (Gary Dourdan) return to help solve seemingly unsolvable cases. But not all of the best moments involve whodunits. Some of the most compelling vignettes revolve around Warrick, who is battling a nasty prescription drug addiction as he tries to navigate his way through a messy divorce. Longtime fans of the series may remember child genius Hannah West (portrayed chillingly by Juliette Goglia), who helped get her brother acquitted of a murder charge in season six. She is back after her brother is once again charged with homicide. Sara--who had wrongfully believed that Hannah was just an innocent little girl--finds herself unable to distance herself from this case. There is a crossover ratings stunt episode with Jack Malone (Anthony LaPaglia) visiting from CBS' other drama\", 'Without a Trace', \". While both LaPaglia and Petersen are formidable, there really isn't room for both of them on one show. And let's face it, Petersen's our guy.\", '--Jae-Ha Kim']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Contributor': 'Marg Helgenberger, Jorja Fox', 'Language': 'English (Stereo), English (Dolby Digital 5.1), Spanish (Stereo), Unqualified', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.9 x 5.5 x 7.5 inches; 8.8 Ounces', 'Item model number': '6429087858', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Run time': '12 hours', 'Release date': 'October 14, 2008', 'Actors': 'Marg Helgenberger, Jorja Fox', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nOne of my favorite shows.  So happy to find this on Amazon at a fair price.\nLove CSI\nX-MEN: DAYS OF FUTURE PAST\nHugh Jackman  (Actor),     James McAvoy  (Actor),     Bryan Singer  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['X-Men Unite! An all-star cast, including Hugh Jackman, Michael Fassbender, James McAvoy, Halle Berry, Jennifer Lawrence, Ellen Page, Ian McKellen and Patrick Stewart assemble and prepare for battle in this awesome adventure packed with nonstop action and excitement. As armies of murderous Sentinel robots hunt down mutants and humans alike, the unstoppable characters from the original X-MEN film trilogy join forces with their younger selves in an epic struggle to change the past; and save our future!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 12 minutes', 'Release date': 'October 14, 2014', 'Actors': 'Hugh Jackman, James McAvoy, Michael Fassbender, Jennifer Lawrence, Halle Berry', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Producers': 'Lauren Shuler Donner, Bryan Singer, Simon Kinberg, Hutch Parker', 'Studio': '20th Century Fox', 'Writers': 'Jane Goldman, Simon Kinberg, Matthew Vaughn', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOutstanding action Science fiction. Be sure to rematch X-Men first class to catch all of the references between the Professor and Wolverine.  Loved it!\nFast action\nAs Seen On TV Richard Simmons Project H.O.P.E. Home Workout System DVD\nAs Seen On TV\nMovies & TV, TV\n['View larger', 'Richard Simmons Project HOPE', \"Richard Simmons Project HOPE is a 90-day at-home weight loss program designed especially for you. As America's most beloved fitness guru, Richard has been inspiring people for over 38 years to get off the couch and get into shape. Richard Simmons Project HOPE is based upon the science of Triple Training, which sequences cardio and toning workouts to maximize weight loss. Triple Training can help you burn up to 3X more fat than traditional cardio alone. (Actual results may vary). This three month progressive system includes one DVD for each month, featuring three brand new programs on each DVD for a total of nine workouts, created by Richard, for their ability to maximize weight loss, boost calorie burn, tone muscle and help you develop the body you've always wanted — and have FUN while you do it. The Nutrition Guide includes a 90-Day Meal Program calendar, customizable meals and snacks, as well as, delicious, healthy and easy-to-prepare recipes. You'll also get Richard's motivational tips and tricks, a substitution list, a maintenance plan, and so much more. The Success Guide provides instructional details about the Richard Simmons Project HOPE system, including how it works, Triple Training, Workout Tips, Richard's special brand of motivation, and so much more. This guide is packed with information and is an essential tool to maximize your results.\", 'Burn 3X More Fat', 'Richard’s three-month progressive weight-loss system features nine all-new energetic routines set to heart-pumping music designed to burn fat, sculpt muscle, and add fun to your workout. His Triple Training Method blends cardio and toning to help you increase energy and burn up to 3x more fat than with traditional cardio alone. Plus, each DVD comes with a Learn the Moves Guide that breaks down the steps and offers variations for intermediate and advanced levels. Best of all, each workout is 30 minutes or less.', 'Transform Your Body in 90 days', 'So come on! Millions of people struggle with their weight every day – now you can finally lose those extra pounds the right way and get the body you deserve. “I know how difficult it is to stick with a program with lots of complex rules and restrictions. I’ve made this program very simple and easy-to-follow and I’ve designed the workouts so everyone can do them. ” - Richard Simmons', 'View larger', 'Nine Workouts on Three DVDs & More', \"Enjoy nine Workouts on three DVDs set to get you in motion in no time! Also includes a Nutrition Guide and Success Guide to maximize your results with Richard's nutritional secrets, motivation and support.\", 'View larger', 'Commit, Push, and Burn!', 'Three DVDs over 90 days allows you to Commit, Push, and Burn! Month 1 (Commit) offers a jump-start to successful weight loss by upping your fitness potential and burning off body fat. Month 2 (Push) keeps the weight loss coming as you tone, sculpt, and reshape your body. Month 3 (Burn) gives you more reps and challenging moves to transform your body and change your life.', 'View larger', 'Nutrition Guide', \"Follow Richard's Food Mover Nutrition Guide, which includes a 90-Day Meal Program calendar, customizable meals and snacks, as well as, delicious, healthy and easy-to-prepare recipes.\", 'View larger', 'Triple Training Method', 'Blends cardio and toning workouts to maximize weight loss, increase energy and burn up to 3x more fat than with traditional cardio alone.', 'View larger', 'Learn The Moves Guide', 'Each DVD comes with a Learn the Moves Guide that breaks down the steps and offers variations for intermediate and advanced levels.', 'View larger', 'Featuring Hit Songs!', \"DVDs feature hit songs such as: 'Girls Just Wanna Have Fun', 'We Got The Beat', 'Need You Now', 'Summer of 69' and much, much more!\"]\n{'Item Package Dimensions L x W x H': '7.6 x 5.67 x 0.94 inches', 'Package Weight': '0.33 Kilograms', 'Brand Name': 'As Seen On TV', 'Country of Origin': 'United States', 'Number of Items': '1', 'Manufacturer': 'Gaiam', 'Part Number': '05-60631', 'Model Year': '2020', 'Best Sellers Rank': {'Movies & TV': 16585, 'DVD': 10137}, 'Date First Available': 'May 8, 2013', 'Brand': 'As Seen On TV', 'Cover Material': 'Paper', 'Year': '2020', 'Format': 'DVD', 'Target Audience': 'Adult', 'Binding': 'DVD'}\nI love the fact that on this series of DVDs Richard Simmons gives instructions on the exercises as well as the encouragement that is his trademark.  I love his oldies series, but often get lost as I move from one DVD to another.  With his instructions during each set and his introductory remarks I never get lost with these.  The music on these is more subtle, the exercises more intense.  Each month advances in difficulty so I feel that I am making more progress.  Feeling stronger every day.  Thank you Richard.\nMy all time favorite Richard Simmons workout!\nTonin' to the Oldies\nRated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n['Hey Everybody,', 'I am so excited to share my first-ever circuit-training workout and my brand-new, never before-seen \"Boogie Cords\" with you!\\xa0 Circuit training combines both cardiovascular training and muscle strengthening, all in the same workout!\\xa0 In this workout, we\\'ll be dancing and toning to some of your favorite songs like \"Twist and\\xa0Shout,\" \"The Lion Sleeps Tonight,\" and my favorite, \"Moon River.\"', 'You\\'ll strengthen your heart and lungs, and improve your muscular strength and endurance, all at the same time!\\xa0 How\\'s that for efficiency?\\xa0\\xa0You\\'ll see and feel a difference in your upper body muscles (chest, back, biceps, triceps and core) and lower body muscles (quads, hamstrings and glutes). \\xa0Before long, you might even be ready to try on your favorite \"Itsy Bitsy Teenie Weenie\\xa0Yellow Polka Dot Bikini!\"\\xa0 Be sure to send me a picture if you do!', 'All of the movements are fun and effective, and you\\'ll be having such a good time, you won\\'t even want to \"Stop! In the\\xa0Name of Love!\"', \"You don't need any weights to exercise along with\", \"Tonin' to the\\xa0Oldies\", 'either.\\xa0 My lightweight Boogie Cords give you a challenging low-impact workout without the stress or strain!', 'If you love to dance...if you love to smile and make new friends, you\\'re going to love sweatin\\' and tonin\\' along with me and my block party crew!\\xa0 Are you ready to take the \"work\" out of working out? \\xa0Then let\\'s go...the party\\'s about to start!', 'Love,', 'Richard Simmons']\n{'MPAA rating': 'NR (Not Rated)', 'Package Dimensions': '7.5 x 5.5 x 2.1 inches; 7.2 Ounces', 'Media Format': 'NTSC, Color', 'Studio': 'Word Entertainment'}\nOops, this DVD do not come with the toning cords which means it is useless.  Such a shame since I love Richard Simmons.  Will have to see if I can find the cords separately.  Watched the video and I am sure I'll love it once I find the cords.\nDid not include the toning cords necessary to do these exercises.\nRichard Simmons Sit Tight DVD - A Sittin' Down Workout\nFormat: DVD\nMovies & TV, Movies\n{'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces'}\nWonderful DVD for those of us who find ourselves unable stand.  The price on the Richard Simmons web site is much better.\nWonderful Dvd, bad price\nToys\nRobin Williams  (Actor),     Michael Gambon  (Actor),     Barry Levinson  (Director, Writer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"Enter a spectacular world of whimsy, fun and fantasy in this acclaimed visual extravaganza directed by Barry Levinson. Robin Williams stars as Leslie Zevo, a fun-loving adult who must save his late father's toy factory from his evil uncle (Michael Gambon), a war-loving general who builds weapons disguised as toys. Aided by his sister (Joan Cusack) and girlfriend (Robin Wright), Leslie sets out to thwart his uncle and restore joy and innocence to their special world.\", 'Amazon.com', 'There are two reasons to see', 'Toys', ': some phenomenal visual spectacle and the utterly adorable performance of Joan Cusack. The story: When the founder of the Zevo toy factory dies, he leaves it to his militaristic brother Leland (Michael Gambon) instead of to his whimsical son Leslie (Robin Williams). When Leland starts making war toys (and worse, actual weapons masquerading as toys), Leslie is forced to stop being capricious and take on some authority.', 'Toys', \"is supposedly about innocence and peace, but really it's director Barry Levinson's cry of anxiety about modern-day playthings, particularly video games--which is almost psychic of him, given how video games have started to devour the entertainment market. Fans of Williams will enjoy his performance; the visual design really is gorgeous; and Cusack, as Leslie's sister Alsatia, is so lovely she almost carries the film through its muddled themes. Almost.\", '--Bret Fetzer']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 3.84 Ounces', 'Item model number': '24543020530', 'Director': 'Barry Levinson', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 58 minutes', 'Release date': 'October 16, 2001', 'Actors': 'Robin Williams, Michael Gambon, Joan Cusack, Robin Wright, LL Cool J', 'Subtitles': 'English, Spanish', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1), French (Dolby Digital 2.0 Surround), Unqualified', 'Studio': '20th Century Fox', 'Writers': 'Barry Levinson, Valerie Curtin', 'Number of discs': '1'}\nI normally love Robin Williams, but I didn't like this movie.  Of all the movies I have purchased without first seeing it in the theater I have only thrown away two of them.  This was one of the two.\nNot his best movie\nStar Wars: The Force Awakens\nHarrison Ford  (Actor),     Mark Hamill  (Actor),     J.J. Abrams  (Director)    &                   0                  more   Rated:    PG-13    Format: Blu-ray\nMovies & TV, Featured Categories, Blu-ray\n['Product Description', \"Visionary director J.J. Abrams brings to life the motion picture event of a generation. As Kylo Ren and the sinister First Order rise from the ashes of the Empire, Luke Skywalker is missing when the galaxy needs him most. It's up to Rey, a desert scavenger, and Finn, a defecting stormtrooper, to join forces with Han Solo and Chewbacca in a desperate search for the one hope of restoring peace to the galaxy.\", 'Additional Features', 'How to redeem your digital code:  1. Find Code on Insert  2. Enter Code   3. Select Provider   4. Enjoy Movie!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Director': 'J.J. Abrams', 'Media Format': 'Blu-ray, Digital_copy, DVD+Blu-ray', 'Run time': '2 hours and 16 minutes', 'Release date': 'April 5, 2016', 'Actors': 'Harrison Ford, Mark Hamill, Carrie Fisher, Adam Driver, Daisy Ridley', 'Subtitles': 'French, Spanish, English', 'Language': 'French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), English (DTS-HD High Res Audio)', 'Studio': 'Walt Disney Studios', 'Writers': 'Screenplay by Lawrence Kasdan & J.J. Abrams and Mi', 'Number of discs': '3'}\nWe watch the original trilogy DVDs frequently, we love Star Wars.  We were looking forward to this latest release, counting down the days until we could see it at the theater.  We were so disappointed!  A lot of action, but no real story line or character development.  The best sections of the film were taken from older Star Wars movies.\nWe wanted to love it, were so disappointed\n{'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium', 'English Dialogue Boost: Low', 'Italiano', '한국어', '日本語', 'العربية', 'Português', 'Nederlands', 'Deutsch', 'Русский', 'हिन्दी', 'Español (España)', 'Indonesia', 'Español (Latinoamérica)', 'Polski', 'Türkçe', '中文（台灣）', '中文（中国）', 'Français'], 'Subtitles': ['English [CC]', 'العربية', 'Deutsch', 'Español (Latinoamérica)', 'Español (España)', 'Français', 'हिन्दी', 'Indonesia', 'Italiano', '日本語', '한국어', 'Nederlands', 'Polski', 'Português', 'Русский', 'Türkçe', '中文（简体）', '中文（繁體）'], 'Directors': ['Joe Nussbaum'], 'Producers': ['Pixie Wespiser'], 'Starring': ['Olivia Sanabia', 'Abby Donnelly', 'Aubrey Miller'], 'Studio': ['Amazon Studios']}\nAlthough written to entertain the preteen audience, I loved this show.  I admit that this was a late night binge watch which kept me entertained for hours.  So nice to have a good story that does not have graphic sex and violence.  Thank you Amazon. Can't wait for season 2.\nAbsolutely loved it\nRear Window [DVD]\nJames Stewart  (Actor),     Grace Kelly  (Actor),     Alfred Hitchcock  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Directed by the Master of Suspense, Alfred Hitchcock\\'s Rear Window is an edge-of-your-seat classic starring two of Hollywood\\'s most popular stars. When a professional photographer (James Stewart) is confined to a wheelchair with a broken leg, he becomes obsessed with watching the private dramas of his neighbors play out across the courtyard. When he suspects his neighbor of murdering his nagging wife, he enlists his socialite girlfriend (Grace Kelly) to help investigate the suspicious chain of events, leading to one of the most memorable and gripping endings in all of film history. Honored in AFI\\'s 100 Years…100 Movies for excellence in film, Rear Window has also been hailed as \"one of Alfred Hitchcock\\'s most stylish thrillers\" (Leonard Maltin\\'s Classic Movie Guide).', 'Bonus Content:', 'Rear Window Ethics: An Original Documentary', 'Rear Window Ethics: An Original Documentary', 'A Conversation with Screenwriter John Michael Hayes', 'A Conversation with Screenwriter John Michael Hayes', 'Production Photographs', 'Production Photographs', 'Production Notes', 'Production Notes', 'Re-Release Trailer Narrated by James Stewart', 'Re-Release Trailer Narrated by James Stewart', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Rent movie, Mystery movie, Alfred Hitchcock movie, DVD movie, Blu-ray movie, Oscar movie, Movie night, Drama, Best Director movie, Academy Award movie, 4K movie, Thriller movie, Mystery & Suspense/Thrillers, Buy movie, Suspense movie, Digital movie, Drama movie, Jimmy Stewart movie, Mystery & SuspenseRent movie, Mystery movie, Alfred Hitchcock movie, DVD movie, Blu-ray movie, Oscar movie, Movie night, Drama, Best Director movie, Academy Award movie, 4K movie, Thriller movie, Mystery & Suspense/Thrillers, Buy movie, Suspense movie, Digital movie, Drama movie, J…  See more', 'Format': 'Multiple Formats, Color, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Grace Kelly, Thelma Ritter, Alfred Hitchcock, Robert Burks, John Michael Hayes, Wendell Corey, Loren L. Ryder, James Stewart, Raymond BurrGrace Kelly, Thelma Ritter, Alfred Hitchcock, Robert Burks, John Michael Hayes, Wendell Corey, Loren L. Ryder, James Stewart, Raymond Burr  See more', 'Initial release date': '2012-09-04', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0)', 'Aspect Ratio': '1.66:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.56 Ounces', 'Item model number': '1123521', 'Director': 'Alfred Hitchcock', 'Media Format': 'Multiple Formats, Color, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 55 minutes', 'Release date': 'September 4, 2012', 'Actors': 'James Stewart, Grace Kelly, Raymond Burr, Wendell Corey, Thelma Ritter', 'Dubbed': 'French', 'Subtitles': 'Spanish', 'Producers': 'Alfred Hitchcock', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Michael Hayes', 'Number of discs': '1'}\nClassic movie. A great mystery without a lot of  violence and gore.\nGreat classic movie\nGreatest WWII Missions (Ike: Countdown to D-Day / Enigma / The Heroes of Telemark)\nTom Selleck  (Actor),     Kate Winslet  (Actor),     Robert Harmon  (Director),     Michael Apted  (Director)    &                   1                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['French and Spanish subtitles on Enigma only !!!']\n{'Genre': 'Drama', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Tom Selleck, Kate Winslet, Winslet, Kate, Robert Harmon, Kirk Douglas, Richard Harris, Michael Apted, Anthony Mann, Jeremy NorthamTom Selleck, Kate Winslet, Winslet, Kate, Robert Harmon, Kirk Douglas, Richard Harris, Michael Apted, Anthony Mann, Jeremy Northam   See more', 'Language': 'English', 'Runtime': '5 hours and 38 minutes', 'Aspect Ratio': '2.35:1, 1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '46146', 'Director': 'Robert Harmon, Michael Apted, Anthony Mann', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '5 hours and 38 minutes', 'Release date': 'June 16, 2015', 'Actors': 'Tom Selleck, Kate Winslet, Jeremy Northam, Kirk Douglas, Richard Harris', 'Dubbed': 'Thai', 'Subtitles': 'Thai', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '2'}\nSearched everywhere for the movie Enigma, found it in this set at a great price.  Enjoyed the movie Ike as well.\nNice set of war movies\nMurder, She Baked: Complete Collection\nAlison Sweeney  (Actor),     Cameron Mathison  (Actor),     Mark Jean  (Director),     Kristoffer Tabori  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Take one amateur sleuth. Mix in some eccentric Minnesota locals. Add a generous dollop of crackling suspense, and you've got the recipe for this delicious mystery series featuring Hannah Swensen, the cookie-baking heroine whose penchant for solving crime is definitely stirring things up. The Murder, She Baked: Complete Movie Collection contains all 5 original movies from the series: A Chocolate Chip Cookie Mystery, A Plum Pudding Mystery, A Peach Cobbler Mystery, A Deadly Recipe and Just Desserts.\"]\n{'Genre': 'Television, Television/Crime', 'Format': 'NTSC, Widescreen', 'Contributor': 'Cameron Mathison, Barbara Niven, Mark Jean, Kristoffer Tabori, Gabriel Hogan, Alison Sweeney', 'Language': 'English', 'Runtime': '7 hours', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.8 Ounces', 'Audio Description': 'English', 'Director': 'Mark Jean, Kristoffer Tabori', 'Media Format': 'NTSC, Widescreen', 'Run time': '7 hours', 'Release date': 'December 11, 2018', 'Actors': 'Alison Sweeney, Cameron Mathison, Gabriel Hogan, Barbara Niven', 'Studio': 'Hallmark', 'Country of Origin': 'USA', 'Number of discs': '2'}\nPros:  Hallmark did a wonderful job bringing Joanne Fluke's mystery series to the small screen.  The shows are entertaining and move quickly.  They are appropriate for the entire family.<br />Cons:  Only one of the five movies has captioning.  As an older adult with hearing problems I generally read the captions to keep up with the story line so I found this frustrating.\nGreat murder mysteries without the profanity and gore.  Love these!\nThe Commuter\nSuspense, Action, Cerebral, Ominous\n['A man who gets caught up in a criminal conspiracy during his daily commute home and works against the clock to stop a deadly attack to save the lives of his fellow train passengers.']\n{'Content advisory': ['Violence', 'alcohol use', 'foul language'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Jaume Serra'], 'Producers': ['Andrew Rona', 'Alex Heineman'], 'Starring': ['Liam Neeson', 'Vera Farmiga', 'Patrick Wilson']}\nHubby started watching this movie while I was reading a book.  It wasn't long before my book was put aside so that I could concentrate on the movie.  Enjoyed it so much that I'm about to watch it again.  Thanks Amazon\nAction packed, edge of your seat movie\nDiagnosis Murder// Complete Collection/8 Seasons 178 Episodes\nDick Van Dyke  (Actor),     Michael Tucci  (Actor),     *  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Mystery & Suspense\n[\"Legendary, five-time Emmy Award-winner Dick Van Dyke stars as Dr. Mark Sloan, Chief of Internal Medicine at Community General Hospital. Sloan utilizes his medical expertise and natural sleuthing sensibilities to solve crimes alongside his homicide detective son. Van Dyke won legions of new fans with this dramatic role, but of course he's as charming as ever. Set includes three original TV movies that predate the television series and two that conclude the series. 178 episodes, 143 hrs, 32 DVDs.\"]\n{'Genre': 'Television, Television/Crime', 'Format': 'Multiple Formats, Box set, Color, NTSC', 'Contributor': 'Barry Van Dyke, Dick Van Dyke, *, Michael Tucci', 'Language': 'English, English', 'Number Of Discs': '32', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 0.7 x 5.4 inches; 2.72 Ounces', 'Director': '*', 'Media Format': 'Multiple Formats, Box set, Color, NTSC', 'Run time': '143 hours', 'Release date': 'December 2, 2016', 'Actors': 'Dick Van Dyke, Michael Tucci, Barry Van Dyke', 'Studio': 'Trin', 'Number of discs': '32'}\nMysteries without visual violence.  Love these.\nDelightful mysteries",
  "profile": "**User Profile Summary:**\n\n- **Comedy Preference:** The user maintains a strong affinity for classic slapstick and humorous content, notably admiring the comedic styles of Leslie Nielsen and Robin Williams.\n- **Entertainment Themes:** Enjoys films and series featuring violence, frightening scenes, and adult humor, alongside family-friendly fantasy narratives. Recently expanded to include crime dramas with rich character development, classic suspenseful mysteries, engaging war dramas, and cozy mystery series that balance lightheartedness with intrigue. The user has shown an increased appreciation for cerebral suspense and action films, now also favoring mystery series that feature minimal visual violence.\n- **Artistic Appreciation:** Values outstanding directors and producers, particularly figures like Mel Brooks and Alfred Hitchcock, while expressing critical views towards J.J. Abrams.\n- **Language Preference:** Prefers English-language content and utilizes subtitles, audio descriptions, and closed captions to enhance engagement, especially in frustration with limited captioning in some viewed content.\n- **Rating Trends:** Generally favors high-rated content with an average around 4.7 and strongly prefers family-friendly options rated above 4.8, demonstrating a willingness to critically evaluate different genres.\n- **Subtitles and Accessibility:** Demonstrates a strong preference for accessible features, particularly in fitness programs and dramas, enhancing understanding and engagement.\n- **Recent Interactions:** Recently enjoyed classic mystery films and discovered new lighthearted murder mysteries that align with their interest in non-violent storytelling, appreciating suspenseful plots without excessive profanity or violence.",
  "metrics": {
    "rouge1_f": 0.06156371844859429,
    "rouge2_f": 0.009443646068569083,
    "rougeL_f": 0.02914016006566797,
    "meteor": 0.01676166416642174,
    "bleu1": 1.8503376037968317e-10,
    "bleu2": 7.1705707553353e-11,
    "bleu3": 2.3533807624869882e-11,
    "bleu4": 6.380894800270301e-12,
    "bertscore_precision": 0.36926835775375366,
    "bertscore_recall": 0.532080352306366,
    "bertscore_f1": 0.43596985936164856
  }
}