{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: As Seen On TV Richard Simmons Project H.O.P.E. Home Workout System DVD\nReview Date: 2015/01/19\nStore: As Seen On TV\nCategories: Movies & TV, TV\nProduct Description: ['View larger', 'Richard Simmons Project HOPE', \"Richard Simmons Project HOPE is a 90-day at-home weight loss program designed especially for you. As America's most beloved fitness guru, Richard has been inspiring people for over 38 years to get off the couch and get into shape. Richard Simmons Project HOPE is based upon the science of Triple Training, which sequences cardio and toning workouts to maximize weight loss. Triple Training can help you burn up to 3X more fat than traditional cardio alone. (Actual results may vary). This three month progressive system includes one DVD for each month, featuring three brand new programs on each DVD for a total of nine workouts, created by Richard, for their ability to maximize weight loss, boost calorie burn, tone muscle and help you develop the body you've always wanted — and have FUN while you do it. The Nutrition Guide includes a 90-Day Meal Program calendar, customizable meals and snacks, as well as, delicious, healthy and easy-to-prepare recipes. You'll also get Richard's motivational tips and tricks, a substitution list, a maintenance plan, and so much more. The Success Guide provides instructional details about the Richard Simmons Project HOPE system, including how it works, Triple Training, Workout Tips, Richard's special brand of motivation, and so much more. This guide is packed with information and is an essential tool to maximize your results.\", 'Burn 3X More Fat', 'Richard’s three-month progressive weight-loss system features nine all-new energetic routines set to heart-pumping music designed to burn fat, sculpt muscle, and add fun to your workout. His Triple Training Method blends cardio and toning to help you increase energy and burn up to 3x more fat than with traditional cardio alone. Plus, each DVD comes with a Learn the Moves Guide that breaks down the steps and offers variations for intermediate and advanced levels. Best of all, each workout is 30 minutes or less.', 'Transform Your Body in 90 days', 'So come on! Millions of people struggle with their weight every day – now you can finally lose those extra pounds the right way and get the body you deserve. “I know how difficult it is to stick with a program with lots of complex rules and restrictions. I’ve made this program very simple and easy-to-follow and I’ve designed the workouts so everyone can do them. ” - Richard Simmons', 'View larger', 'Nine Workouts on Three DVDs & More', \"Enjoy nine Workouts on three DVDs set to get you in motion in no time! Also includes a Nutrition Guide and Success Guide to maximize your results with Richard's nutritional secrets, motivation and support.\", 'View larger', 'Commit, Push, and Burn!', 'Three DVDs over 90 days allows you to Commit, Push, and Burn! Month 1 (Commit) offers a jump-start to successful weight loss by upping your fitness potential and burning off body fat. Month 2 (Push) keeps the weight loss coming as you tone, sculpt, and reshape your body. Month 3 (Burn) gives you more reps and challenging moves to transform your body and change your life.', 'View larger', 'Nutrition Guide', \"Follow Richard's Food Mover Nutrition Guide, which includes a 90-Day Meal Program calendar, customizable meals and snacks, as well as, delicious, healthy and easy-to-prepare recipes.\", 'View larger', 'Triple Training Method', 'Blends cardio and toning workouts to maximize weight loss, increase energy and burn up to 3x more fat than with traditional cardio alone.', 'View larger', 'Learn The Moves Guide', 'Each DVD comes with a Learn the Moves Guide that breaks down the steps and offers variations for intermediate and advanced levels.', 'View larger', 'Featuring Hit Songs!', \"DVDs feature hit songs such as: 'Girls Just Wanna Have Fun', 'We Got The Beat', 'Need You Now', 'Summer of 69' and much, much more!\"]\nAverage Rating: 4.4\nProduct Details: {'Item Package Dimensions L x W x H': '7.6 x 5.67 x 0.94 inches', 'Package Weight': '0.33 Kilograms', 'Brand Name': 'As Seen On TV', 'Country of Origin': 'United States', 'Number of Items': '1', 'Manufacturer': 'Gaiam', 'Part Number': '05-60631', 'Model Year': '2020', 'Best Sellers Rank': {'Movies & TV': 16585, 'DVD': 10137}, 'Date First Available': 'May 8, 2013', 'Brand': 'As Seen On TV', 'Cover Material': 'Paper', 'Year': '2020', 'Format': 'DVD', 'Target Audience': 'Adult', 'Binding': 'DVD'}\nReview Text: I love the fact that on this series of DVDs Richard Simmons gives instructions on the exercises as well as the encouragement that is his trademark.  I love his oldies series, but often get lost as I move from one DVD to another.  With his instructions during each set and his introductory remarks I never get lost with these.  The music on these is more subtle, the exercises more intense.  Each month advances in difficulty so I feel that I am making more progress.  Feeling stronger every day.  Thank you Richard.\nReview Title: My all time favorite Richard Simmons workout!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'frightening scenes', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Mel Brooks'], 'Producers': ['Mel Brooks'], 'Starring': ['Leslie Nielsen', 'Peter MacNicol', 'Steven Weber'], 'Studio': ['Warner Bros.']}\nLove Leslie Nielsen.  His silly slap-stick comedy always makes me laugh and Dracula: Dead and Loving it is one of my favorites.\nComedy as only Leslie Nielsen can\n10th Kingdom - The Epic Miniseries Event\nKimberly Williams-Paisley  (Actor),     Scott Cohen  (Actor),     David Carson  (Director),     Herbert Wise  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Two Worlds Come Together In One Fantastic Adventure!', 'A Magical Epic Adventure The Whole Family Will Enjoy!', 'Trust me...when you join us in The 10th Kingdom, you ll find fantasy and action and romance and adventure. It s a spectacular place to come and play.', 'Camryn Manheim', 'Join an all-star cast as they find fantasy, action, romance and adventure in the Emmy winning®', 'The 10th Kingdom', '! Beyond the mortal world lies Nine Kingdoms where the fantastic land of fairy tales and magic are brought to life and reinvented. The themes and ideas of folklore and mythology perform fully as the classic characters enter a vortex at the edge of the mortal world which leads them to', 'The 10th Kingdom', '...Central Park!', 'This ten part mini-series tells the tale of Prince Wendell (Daniel Lapaine) and the evil queen (Dianne Wiest) who has doomed him to spend the rest of his life as a dog. In order to recapture the throne Prince Wendell travels through the portal to the mythical kingdom of Manhattan and finds two ordinary mortals Virginia (Kimberly Williams-Paisley) and Tony (John Larroquette). Together they battle the evils of the parallel universe, and defend themselves from vile trolls, goblins and every fairy tale character imaginable! Stunning visual effects and a stellar cast create an epic adventure that will enchant audiences of all ages!', 'An all-star cast featuring a wealth of Emmy®, Oscar®, and Golden Globe®-wining and nominated talent including : John Larroquette (', 'Boston Legal', ',', 'The Practice), Kimberly Williams-Paisley (Nashville', ',', 'Father of the Bride), Scott Cohen (Love and Other Drugs', ',', 'Jacob s Ladder), Ann-Margret (Bye Bye Birdie', ',', 'Tommy), Rutger Hauer (Batman Begins', ',', 'Sin City), Daniel Lapaine (', 'Double Jeopardy), Camryn Manheim (', 'The Practice', '), Ed O Neil (', 'Modern Family', ',', 'Married with Children) and Dianne Wiest (Edward Scissorhands', ',', 'Parenthood', ')']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.52 Ounces', 'Item model number': '4098520982', 'Director': 'David Carson, Herbert Wise', 'Media Format': 'Multiple Formats, Box set, Full Screen, Color, NTSC, Surround Sound', 'Run time': '7 hours and 27 minutes', 'Release date': 'March 12, 2013', 'Actors': 'Kimberly Williams-Paisley, Scott Cohen, John Larroquette, Dianne Wiest, Camryn Manheim', 'Studio': 'Mill Creek Ent', 'Number of discs': '1'}\nI love the 10th Kingdom miniseries.  When I saw it at this low price I bought it for a friend.  I had purchased it for myself many years ago and paid $30.00 for the set.  Hours of good entertainment.\nOne of my favorite stories\nCSI: Crime Scene Investigation - Season 8\nMarg Helgenberger  (Actor),     Jorja Fox  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Paramount Home Entertainment, Drama\n['Product Description', 'CSI: Crime Scene Investigation', 'is a fast-paced drama about a passionate team of forensic investigators trained to solve crimes the old-fashioned way – by examining the evidence.', 'CSI: Crime Scene Investigation', 'is on the case 24-7, scouring the scene, collecting irrefutable evidence and finding the missing pieces that will solve the mystery.', 'Amazon.com', 'The eighth season of', 'CSI: Crime Scene Investigation', \"begins with the answer to the previous season's cliffhanger: Yes, CSI Sara Sidle (Jorja Fox) survives. But fans of this top-rated crime procedural won't be able to breathe a sigh of relief. By the end of the 17 episodes--which originally aired during the 2007-2008 television season--two fan favorites will be gone. This year,\", 'CSI', \"explores the complicated romance between Sara and head CSI Gil Grissom (William Petersen). But the storyline is weaved in so well with the gruesome cases that their relationship is never overpowering to the viewer. Though the show was truncated due to the Writers Guild strike, the flow of the series doesn't lose any momentum--not even with the loss of cast members or even episodes that center on peripheral supporting characters. Fellow CSIs Catherine Willows (Marg Helgenberger), Nick Stokes (George Eads), and Warrick Brown (Gary Dourdan) return to help solve seemingly unsolvable cases. But not all of the best moments involve whodunits. Some of the most compelling vignettes revolve around Warrick, who is battling a nasty prescription drug addiction as he tries to navigate his way through a messy divorce. Longtime fans of the series may remember child genius Hannah West (portrayed chillingly by Juliette Goglia), who helped get her brother acquitted of a murder charge in season six. She is back after her brother is once again charged with homicide. Sara--who had wrongfully believed that Hannah was just an innocent little girl--finds herself unable to distance herself from this case. There is a crossover ratings stunt episode with Jack Malone (Anthony LaPaglia) visiting from CBS' other drama\", 'Without a Trace', \". While both LaPaglia and Petersen are formidable, there really isn't room for both of them on one show. And let's face it, Petersen's our guy.\", '--Jae-Ha Kim']\n{'Genre': 'Feature', 'Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Contributor': 'Marg Helgenberger, Jorja Fox', 'Language': 'English (Stereo), English (Dolby Digital 5.1), Spanish (Stereo), Unqualified', 'Number Of Discs': '1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.9 x 5.5 x 7.5 inches; 8.8 Ounces', 'Item model number': '6429087858', 'Media Format': 'Multiple Formats, Color, Widescreen, NTSC, Closed-captioned', 'Run time': '12 hours', 'Release date': 'October 14, 2008', 'Actors': 'Marg Helgenberger, Jorja Fox', 'Studio': 'PARAMOUNT', 'Number of discs': '1'}\nOne of my favorite shows.  So happy to find this on Amazon at a fair price.\nLove CSI\nX-MEN: DAYS OF FUTURE PAST\nHugh Jackman  (Actor),     James McAvoy  (Actor),     Bryan Singer  (Director, Producer)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['X-Men Unite! An all-star cast, including Hugh Jackman, Michael Fassbender, James McAvoy, Halle Berry, Jennifer Lawrence, Ellen Page, Ian McKellen and Patrick Stewart assemble and prepare for battle in this awesome adventure packed with nonstop action and excitement. As armies of murderous Sentinel robots hunt down mutants and humans alike, the unstoppable characters from the original X-MEN film trilogy join forces with their younger selves in an epic struggle to change the past; and save our future!']\n{'Aspect Ratio': '2.40:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Bryan Singer', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Dubbed, Subtitled, Widescreen, NTSC', 'Run time': '2 hours and 12 minutes', 'Release date': 'October 14, 2014', 'Actors': 'Hugh Jackman, James McAvoy, Michael Fassbender, Jennifer Lawrence, Halle Berry', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French, English', 'Producers': 'Lauren Shuler Donner, Bryan Singer, Simon Kinberg, Hutch Parker', 'Studio': '20th Century Fox', 'Writers': 'Jane Goldman, Simon Kinberg, Matthew Vaughn', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOutstanding action Science fiction. Be sure to rematch X-Men first class to catch all of the references between the Professor and Wolverine.  Loved it!\nFast action\nAs Seen On TV Richard Simmons Project H.O.P.E. Home Workout System DVD\nAs Seen On TV\nMovies & TV, TV\n['View larger', 'Richard Simmons Project HOPE', \"Richard Simmons Project HOPE is a 90-day at-home weight loss program designed especially for you. As America's most beloved fitness guru, Richard has been inspiring people for over 38 years to get off the couch and get into shape. Richard Simmons Project HOPE is based upon the science of Triple Training, which sequences cardio and toning workouts to maximize weight loss. Triple Training can help you burn up to 3X more fat than traditional cardio alone. (Actual results may vary). This three month progressive system includes one DVD for each month, featuring three brand new programs on each DVD for a total of nine workouts, created by Richard, for their ability to maximize weight loss, boost calorie burn, tone muscle and help you develop the body you've always wanted — and have FUN while you do it. The Nutrition Guide includes a 90-Day Meal Program calendar, customizable meals and snacks, as well as, delicious, healthy and easy-to-prepare recipes. You'll also get Richard's motivational tips and tricks, a substitution list, a maintenance plan, and so much more. The Success Guide provides instructional details about the Richard Simmons Project HOPE system, including how it works, Triple Training, Workout Tips, Richard's special brand of motivation, and so much more. This guide is packed with information and is an essential tool to maximize your results.\", 'Burn 3X More Fat', 'Richard’s three-month progressive weight-loss system features nine all-new energetic routines set to heart-pumping music designed to burn fat, sculpt muscle, and add fun to your workout. His Triple Training Method blends cardio and toning to help you increase energy and burn up to 3x more fat than with traditional cardio alone. Plus, each DVD comes with a Learn the Moves Guide that breaks down the steps and offers variations for intermediate and advanced levels. Best of all, each workout is 30 minutes or less.', 'Transform Your Body in 90 days', 'So come on! Millions of people struggle with their weight every day – now you can finally lose those extra pounds the right way and get the body you deserve. “I know how difficult it is to stick with a program with lots of complex rules and restrictions. I’ve made this program very simple and easy-to-follow and I’ve designed the workouts so everyone can do them. ” - Richard Simmons', 'View larger', 'Nine Workouts on Three DVDs & More', \"Enjoy nine Workouts on three DVDs set to get you in motion in no time! Also includes a Nutrition Guide and Success Guide to maximize your results with Richard's nutritional secrets, motivation and support.\", 'View larger', 'Commit, Push, and Burn!', 'Three DVDs over 90 days allows you to Commit, Push, and Burn! Month 1 (Commit) offers a jump-start to successful weight loss by upping your fitness potential and burning off body fat. Month 2 (Push) keeps the weight loss coming as you tone, sculpt, and reshape your body. Month 3 (Burn) gives you more reps and challenging moves to transform your body and change your life.', 'View larger', 'Nutrition Guide', \"Follow Richard's Food Mover Nutrition Guide, which includes a 90-Day Meal Program calendar, customizable meals and snacks, as well as, delicious, healthy and easy-to-prepare recipes.\", 'View larger', 'Triple Training Method', 'Blends cardio and toning workouts to maximize weight loss, increase energy and burn up to 3x more fat than with traditional cardio alone.', 'View larger', 'Learn The Moves Guide', 'Each DVD comes with a Learn the Moves Guide that breaks down the steps and offers variations for intermediate and advanced levels.', 'View larger', 'Featuring Hit Songs!', \"DVDs feature hit songs such as: 'Girls Just Wanna Have Fun', 'We Got The Beat', 'Need You Now', 'Summer of 69' and much, much more!\"]\n{'Item Package Dimensions L x W x H': '7.6 x 5.67 x 0.94 inches', 'Package Weight': '0.33 Kilograms', 'Brand Name': 'As Seen On TV', 'Country of Origin': 'United States', 'Number of Items': '1', 'Manufacturer': 'Gaiam', 'Part Number': '05-60631', 'Model Year': '2020', 'Best Sellers Rank': {'Movies & TV': 16585, 'DVD': 10137}, 'Date First Available': 'May 8, 2013', 'Brand': 'As Seen On TV', 'Cover Material': 'Paper', 'Year': '2020', 'Format': 'DVD', 'Target Audience': 'Adult', 'Binding': 'DVD'}\nI love the fact that on this series of DVDs Richard Simmons gives instructions on the exercises as well as the encouragement that is his trademark.  I love his oldies series, but often get lost as I move from one DVD to another.  With his instructions during each set and his introductory remarks I never get lost with these.  The music on these is more subtle, the exercises more intense.  Each month advances in difficulty so I feel that I am making more progress.  Feeling stronger every day.  Thank you Richard.\nMy all time favorite Richard Simmons workout!",
  "profile": "**User Profile Summary:**\n\n- **Comedy Preference:** Strong preference for classic slapstick and humorous content, particularly valuing the comedic style of Leslie Nielsen.\n- **Entertainment Themes:** Enjoys films and series that incorporate elements of violence, frightening scenes, and adult humor (including foul language and sexual content), while also appreciating family-friendly fantasy narratives. Recently, the user has shown an interest in crime dramas that merge character development with intense storytelling and has expanded their genre exploration to include fitness and health-related content.\n- **Artistic Appreciation:** Demonstrates an appreciation for notable directors and producers renowned for comedic and fantasy films, with specific interests in industry figures like Mel Brooks and Bryan Singer.\n- **Language Preference:** Prefers content in English, including availability of audio descriptions and closed captions for enhanced accessibility.\n- **Rating Trends:** Generally leans towards high ratings, with an average near 4.7, indicating a consistent positive evaluation of entertainment, including family-friendly content rated above 4.8.\n- **Subtitles and Accessibility:** Strong inclination towards content with subtitle options, favoring detailed engagement with material.\n- **Recent Interaction:** Enjoyed a science fiction action film with a fast-paced narrative and character connections, while also engaging with workout programs that offer clear instruction, progressive difficulty, and motivational content.\n\nOverall, the user exhibits a love for classic comedies, engaging fantasy narratives, and increasingly character-driven dramas, enhancing their lifestyle with access to motivational fitness content and a commitment to personal health.",
  "metrics": {
    "rouge1_f": 0.1219407471017604,
    "rouge2_f": 0.012032660077352816,
    "rougeL_f": 0.05410047230571061,
    "meteor": 0.03483687125579829,
    "bleu1": 8.558995115940414e-05,
    "bleu2": 2.77114614597548e-05,
    "bleu3": 7.904006290453595e-06,
    "bleu4": 2.3757796297292753e-06,
    "bertscore_precision": 0.38393634557724,
    "bertscore_recall": 0.5085262656211853,
    "bertscore_f1": 0.43753477931022644
  }
}