{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Crazy, Stupid, Love\nReview Date: 2011/11/13\nStore: Steve Carell  (Actor),     Julianne Moore  (Actor),     Glenn Ficarra  (Director),     John Requa  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: ['Product Description', 'Steve Carell and Ryan Gosling lead an all-star cast in', 'Crazy, Stupid, Love', \". Fortysomething straight-laced Cal Weaver (Carell) is living the dream—good job, nice house, great kids and marriage to his high school sweetheart, Emily (Julianne Moore). So when Cal learns that his wife has cheated on him and wants a divorce, his “perfect” life quickly unravels. Cal, who hasn't dated in decades, stands out as the epitome of un-smooth so handsome player Jacob Palmer (Gosling) takes him on as wingman and protégé, opening Cal’s eyes to the many options before him: flirty women, manly drinks and a sense of style. Despite Cal's makeover and his many new conquests, the one thing that can’t be made over is his heart, which seems to keep leading Cal back to where he began. Brimming with inspired performances, critics are calling this gem of a romantic comedy “a movie that understands love” (Owen Gleiberman,\", 'Entertainment Weekly', ').', 'Amazon.com', 'Crazy, Stupid, Love', 'is a romantic comedy with a big heart--a refreshing change from its', 'Hangover', '-laden compatriots, and almost a throwback to a golden era of romance. For', 'Crazy, Stupid, Love', 'relies on the sharp writing by Dan Fogelman (animated hits like', 'Bolt', ',', 'Tangled', \") and the sparkly chemistry of its cast, led by Steve Carell, Ryan Gosling, Julianne Moore, and the emerging superstar Emma Stone. It's not that the plot is ground-breaking--maybe, in fact, the appeal of\", 'Crazy, Stupid, Love', \"is that it's all too relatable. Cal (Carell) is long married to Emily (Moore), until one day she drops divorce on him, out of the blue. Stunned, Cal tries to reassemble his life as a woefully unprepared single guy. Enter Jacob (Gosling, who's never been better) as a happy bachelor whose tips for Cal will be ones that even the most happily wed female viewers will secretly want their mates to hear. Marisa Tomei has a hilarious turn as a temptress who's way out of Cal's league. And Stone is the fresh-faced, fearless young woman who shakes the confident Jacob's supposedly solid world view.\", 'But it\\'s the interplay between the characters, the true humanness of their emotions--long missing from many contemporary \"romantic comedies\"--that set', 'Crazy, Stupid, Love', \"in a class of its own. Moore is more than just the weary, accusatory neglected wife--someone who's never stopped believing in the spark of love. Gosling could easily be his generation's Cary Grant--assured, quick-witted, sly, yet vulnerable. Carell once again shows his dramatic capabilities on top of his impeccable comic timing. And Stone is a revelation, lovely, delicate, vulnerable but strong.\", 'Crazy, Stupid, Love', \"will reaffirm the viewer's belief in all that's possible. Call us crazy. --\", 'A.T. Hurley']\nAverage Rating: 4.6\nProduct Details: {'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Glenn Ficarra, Marisa Tomei, Steve Carell, Julianne Moore, Ryan Gosling, John Requa, Emma Stone', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Warner Brothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '1000206288', 'Director': 'Glenn Ficarra, John Requa', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Release date': 'November 1, 2011', 'Actors': 'Steve Carell, Julianne Moore, Marisa Tomei, Ryan Gosling, Emma Stone', 'Subtitles': 'English, French, Spanish', 'Number of discs': '1'}\nReview Text: My spouse and I loved it!  It was surprisingly sweet and funny.  We laughed out loud throughout the movie!  Steve Carrell is wonderful.\nReview Title: One of the best of the year!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "The Talented Mr. Ripley\nMatt Damon  (Actor),     Gwyneth Paltrow  (Actor),     Anthony Minghella  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"To be young and carefree amid the blue waters and idyllic landscape of sun-drenched Italy in the late 1950's; that's the life Tom Ripley, the con artist, craves, and Dickie Greenleaf, the rich playboy, leads. When Dickie's father, a wealthy industrialist, commissions Ripley to bring his son home to America, Dickie and his beautiful expatriate girlfriend never suspect the dangerous extremes to which Ripley will go to make their lifestyle his own.\"]\n{'Genre': 'Feature', 'Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Contributor': 'Philip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth PaltrowPhilip Seymour Hoffman, Anthony Minghella, Matt Damon, Sergio Rubini, Cate Blanchett, Stefania Rocca, James Rebhorn, Philip Baker Hall, Fiorello, Patricia Highsmith, Jack Davenport, Celia Weston, Jude Law, Gwyneth Paltrow   See more', 'Language': 'English (Dolby Digital 5.1), Unknown (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround)', 'Runtime': '2 hours and 19 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.25 x 5.25 x 0.25 inches; 2.72 Ounces', 'Item model number': 'PARD331424D', 'Director': 'Anthony Minghella', 'Media Format': 'Anamorphic, Color, Multiple Formats, NTSC, Closed-captioned, Dolby, Widescreen', 'Run time': '2 hours and 19 minutes', 'Release date': 'June 27, 2000', 'Actors': 'Matt Damon, Gwyneth Paltrow, Jude Law, Cate Blanchett, Philip Seymour Hoffman', 'Dubbed': 'French', 'Subtitles': 'English', 'Studio': 'Paramount', 'Writers': 'Anthony Minghella, Patricia Highsmith', 'Number of discs': '1'}\nOne of my favorite movies.  Matt Damon's performance is perfect, Jude Law is wonderful and Gwyneth Paltrow is luminescent.  It is mysterious, haunting, and thought provoking.  The acting is intense and masterful and you cannot help but be drawn into the story.  The complex layers of the characters are slowly revealed and wonderfully portrayed.\nAmazing performances\nPenelope\nRichard Grant  (Actor),     Catherine O'Hara  (Actor),     Mark Palansky  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Featured Categories, DVD, Comedy\n['Born with the snout of a pig, young Penelope Wilhern (Christina Ricci) spends life a virtual prisoner in her home. Believing that the only way to break the curse is to marry one of her own kind, she meets a number of suitors, but all reject her. Two devious men, one with a grudge against the family, hire a man (James McAvoy) to pose as a suitor, but complications arise when he begins to fall in love with Penelope, and she makes a bid for freedom.']\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '6104618', 'Director': 'Mark Palansky', 'Media Format': 'Multiple Formats, Color, AC-3, Full Screen, NTSC, Subtitled, Dolby, Widescreen', 'Run time': '1 hour and 30 minutes', 'Release date': 'July 15, 2008', 'Actors': \"Richard Grant, Catherine O'Hara, Christina Ricci, Peter Dinklage, James McAvoy\", 'Subtitles': 'English', 'Producers': 'Jennifer Simpson, Reese Witherspoon, Scott Steindorff', 'Studio': 'Lionsgate', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis was such a fun movie.  The tale is great and the acting is wonderful.  James McAvoy is so cute and sweet.  I really enjoyed the sets, especially Penelope's bedroom, it is full of magic and imagination.  Her wardrobe leaves me drooling as well.  This is an entertaining and fun movie and I've been waiting for it to be released on DVD ever since I saw it in the theater.\nA wonderful fun movie\nBecoming Jane\nAnne Hathaway  (Actor),     James McAvoy  (Actor),     Julian Jarrold  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Miramax Home Entertainment, All Titles\n['Anne Hathaway (The Devil Wears Prada, The Princess Diaries) gives a radiant performance as a young, love-struck Jane Austen in the witty and engaging romantic comedy Becoming Jane from Miramax Films. It s the untold romance that inspired the novels of one of the world s most celebrated authors. When the dashing Tom Lefroy (James McAvoy, The Last King Of Scotland), a reckless and penniless lawyer-to-be, enters Jane s life, he offends the emerging writer s sense and sensibility. Soon their clashing egos set off sparks that ignite a passionate romance and fuel Jane s dream of doing the unthinkable marrying for love. Becoming Jane, also starring the acclaimed Maggie Smith, James Cromwell and Julie Walters, is an enchanting and imaginative film you ll fall head over heels for']\n{'Genre': 'Romance, Performing Arts', 'Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Contributor': 'Anne Hathaway, Julian Jarrold, James McAvoy', 'Language': 'English (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified, English (Dolby Digital 2.0)', 'Runtime': '2 hours', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Director': 'Julian Jarrold', 'Media Format': 'Multiple Formats, AC-3, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '2 hours', 'Release date': 'February 12, 2008', 'Actors': 'Anne Hathaway, James McAvoy', 'Dubbed': 'Spanish', 'Subtitles': 'English, Spanish, French', 'Studio': 'Miramax', 'Number of discs': '1'}\nBecoming Jane is a wonderful movie.  Anne Hathaway shines as Jane and embodies her spirit perfectly.  The script is fun and flirty with plenty of wit and charm.  They work in many references to Jane Austen's novels.  James McAvoy makes me drool, he is sweet and sexy.  Altogether it is a charming movie, although the ending, if you know anything about her life, isn't exactly what you hope for.\nFun and romantic\nClarissa Explains It All - Season One\nJoe O'Connor  (Actor),     Sean O'Neal  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Kids & Family\n[\"Clarissa brought clarity to murky teenage waters for five seasons on Nick. Now enjoy all 13 episodes from the first season, featuring Clarissa, her annoying little brother Ferguson, health-nut mom Janet, architect dad Marshall, and welcome next door neighbor, Sam. Episodes Clarissa's Revenge School Picture No T.V. Urge to Drive Clarissa News Network Haunted House the Bully New Addition Brain Drain Clarissa Makes a Cake Parents Who Say No Cool Dad Sick Days.\"]\n{'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.25 x 0.4 x 5.25 inches; 6.4 Ounces', 'Item model number': '2238147', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '5 hours and 28 minutes', 'Release date': 'December 19, 2017', 'Actors': \"Joe O'Connor, Sean O'Neal, Melissa Joan Hart, Elizabeth Hess, Jason Zimbler\", 'Language': 'Unqualified, English (Dolby Digital 2.0 Stereo)', 'Studio': 'Paramount Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI'm watching it as I type this and thoroughly enjoying myself.  I watched this show growing up and I am tickled to see it again.  I really wish they'd release all the seasons!  I guess I should just be grateful that season 1 made it onto DVD.  If you watched this show and loved it then, definitely get it because it's such a treat to watch it again.\nGreat memories!\nCrazy, Stupid, Love\nSteve Carell  (Actor),     Julianne Moore  (Actor),     Glenn Ficarra  (Director),     John Requa  (Director)    &                   1                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product Description', 'Steve Carell and Ryan Gosling lead an all-star cast in', 'Crazy, Stupid, Love', \". Fortysomething straight-laced Cal Weaver (Carell) is living the dream—good job, nice house, great kids and marriage to his high school sweetheart, Emily (Julianne Moore). So when Cal learns that his wife has cheated on him and wants a divorce, his “perfect” life quickly unravels. Cal, who hasn't dated in decades, stands out as the epitome of un-smooth so handsome player Jacob Palmer (Gosling) takes him on as wingman and protégé, opening Cal’s eyes to the many options before him: flirty women, manly drinks and a sense of style. Despite Cal's makeover and his many new conquests, the one thing that can’t be made over is his heart, which seems to keep leading Cal back to where he began. Brimming with inspired performances, critics are calling this gem of a romantic comedy “a movie that understands love” (Owen Gleiberman,\", 'Entertainment Weekly', ').', 'Amazon.com', 'Crazy, Stupid, Love', 'is a romantic comedy with a big heart--a refreshing change from its', 'Hangover', '-laden compatriots, and almost a throwback to a golden era of romance. For', 'Crazy, Stupid, Love', 'relies on the sharp writing by Dan Fogelman (animated hits like', 'Bolt', ',', 'Tangled', \") and the sparkly chemistry of its cast, led by Steve Carell, Ryan Gosling, Julianne Moore, and the emerging superstar Emma Stone. It's not that the plot is ground-breaking--maybe, in fact, the appeal of\", 'Crazy, Stupid, Love', \"is that it's all too relatable. Cal (Carell) is long married to Emily (Moore), until one day she drops divorce on him, out of the blue. Stunned, Cal tries to reassemble his life as a woefully unprepared single guy. Enter Jacob (Gosling, who's never been better) as a happy bachelor whose tips for Cal will be ones that even the most happily wed female viewers will secretly want their mates to hear. Marisa Tomei has a hilarious turn as a temptress who's way out of Cal's league. And Stone is the fresh-faced, fearless young woman who shakes the confident Jacob's supposedly solid world view.\", 'But it\\'s the interplay between the characters, the true humanness of their emotions--long missing from many contemporary \"romantic comedies\"--that set', 'Crazy, Stupid, Love', \"in a class of its own. Moore is more than just the weary, accusatory neglected wife--someone who's never stopped believing in the spark of love. Gosling could easily be his generation's Cary Grant--assured, quick-witted, sly, yet vulnerable. Carell once again shows his dramatic capabilities on top of his impeccable comic timing. And Stone is a revelation, lovely, delicate, vulnerable but strong.\", 'Crazy, Stupid, Love', \"will reaffirm the viewer's belief in all that's possible. Call us crazy. --\", 'A.T. Hurley']\n{'Genre': 'Drama/Love & Romance, Drama, Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Glenn Ficarra, Marisa Tomei, Steve Carell, Julianne Moore, Ryan Gosling, John Requa, Emma Stone', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Studio': 'Warner Brothers', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.08 Ounces', 'Item model number': '1000206288', 'Director': 'Glenn Ficarra, John Requa', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen, Subtitled', 'Release date': 'November 1, 2011', 'Actors': 'Steve Carell, Julianne Moore, Marisa Tomei, Ryan Gosling, Emma Stone', 'Subtitles': 'English, French, Spanish', 'Number of discs': '1'}\nMy spouse and I loved it!  It was surprisingly sweet and funny.  We laughed out loud throughout the movie!  Steve Carrell is wonderful.\nOne of the best of the year!",
  "profile": "**Updated User Profile Summary:**\n\nThis user exhibits a deep appreciation for cinematic artistry, notably within the drama genre, emphasizing complex character development and compelling narratives. Their recent interactions reflect a growing fondness for whimsical storytelling and engaging performances in comedy, particularly romantic comedies that weave humor with heartfelt themes. \n\nTheir latest review showcases a strong admiration for films that balance emotional depth with lighthearted moments, reinforcing their shift towards feel-good narratives that evoke nostalgia and joy. This evolution highlights their enjoyment of charming characters and witty writing, demonstrating a discerning taste for quality across genres.\n\nThe user remains committed to narratives that leave a lasting impact, seeking stories that blend both emotional engagement and humor. They continue to appreciate character-driven tales that resonate on a personal level while inviting laughter, contributing to their multifaceted cinematic interests. Their high ratings and enthusiastic reviews underline their dynamic palate, reflecting a desire to reconnect with formative media experiences while exploring new dimensions of storytelling that align with their love for imaginative aesthetics and clever writing. Overall, they showcase a vibrant engagement with film, celebrating a diverse array of narratives that inspire, amuse, and resonate.",
  "metrics": {
    "rouge1_f": 0.0846968238691049,
    "rouge2_f": 0.0038535645472061657,
    "rougeL_f": 0.04716073147256977,
    "meteor": 0.025162945193804565,
    "bleu1": 4.980544616736999e-06,
    "bleu2": 1.274870853000128e-06,
    "bleu3": 2.07087454513249e-07,
    "bleu4": 8.356148150795497e-08,
    "bertscore_precision": 0.31692424416542053,
    "bertscore_recall": 0.4808046221733093,
    "bertscore_f1": 0.3820311725139618
  }
}