{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/03/12\nAverage Rating: 4.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['William Shatner'], 'Producers': ['J. Craig Thompson'], 'Starring': ['William Shatner', 'Patrick Stewart', 'Avery Brooks'], 'Studio': ['Brainstorm Media']}\nReview Text: You don't think of the toll on the actors who play the role of Star Fleet captains.  This was an interesting look into the real people behind the captains.\nReview Title: Worthwhile.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Lost in Space\nStephen Hopkins  (Director),     William Hurt  (Actor),     Mimi Rogers  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Monsters & Mutants\n['Product Description', 'Lost in Space (DVD)', 'A family of space colonists, their pilot and a diabolical stowaway scientist become hopelessly lost beyond the galaxy when their mission is sabotaged. Marooned in an unknown and hostile region of the cosmos, they must band together to survive in this state-of-the art update of the classic television series.', ']]>', 'Amazon.com', \"Packed with more than 750 dazzling visual effects, this $70 million adventure does more (and less) than give the 1965-68 TV series a state-of-the-art face-lift. Aimed at an audience that wasn't born when the series originally aired, the sci-fi extravaganza doesn't even require familiarity, despite cameo appearances by several of the TV show's original cast members. Instead it's a high-tech hybrid of the original premise with enough sensory overload to qualify as a spectacular big-screen video game, supported by a time-travel premise that's adequately clever but hardly original. It's certainly never boring, and visually it's an occasionally awesome demonstration of special effects technology. But in its attempt to be all things to all demographics, the movie's more of a marketing ploy than a satisfying adventure, thankfully dispensing with the TV show's cheesy camp but otherwise squandering a promising cast in favor of eye-candy and ephemeral storytelling. In keeping with the movie's high-tech appeal, the DVD is a feature-packed marvel, including two audio commentaries, deleted scenes, two featurettes covering special effects and the original TV series (featuring complete biographies and episode guides), the original screenplay, and interactive games.\", '--Jeff Shannon']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure, Mystery & Suspense', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael DeLuca, William Hurt, Mace Neufeld, Jack Johnson, Matt LeBlanc, Mimi Rogers, Stephen Hopkins, Gary Oldman, Jared Harris, Irwin Allen, Dick Tufeld, Richard Saperstein, Heather Graham, Robert Rehme, Akiva Goldsman, Lacey ChabertMichael DeLuca, William Hurt, Mace Neufeld, Jack Johnson, Matt LeBlanc, Mimi Rogers, Stephen Hopkins, Gary Oldman, Jared Harris, Irwin Allen, Dick Tufeld, Richard Saperstein, Heather Graham, Robert Rehme, Akiva Goldsman, Lacey Chabert  See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': 'MFR794043466724#VG', 'Director': 'Stephen Hopkins', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'August 9, 2005', 'Actors': 'William Hurt, Mimi Rogers, Heather Graham, Lacey Chabert, Jack Johnson', 'Subtitles': 'English', 'Producers': 'Mace Neufeld, Robert Rehme, Richard Saperstein, Michael DeLuca', 'Studio': 'WarnerBrothers', 'Writers': 'Akiva Goldsman', 'Number of discs': '1'}\nArrived quickly.  I had a small problem getting it to play in one computer's drive, but it plays fine in a regular DVD player.  Probably the computer had a glitch.  Item was as described and arrived quickly.\nExcellent movie.\nTCM Greatest Classic Films Collection: Comedy (Arsenic and Old Lace / A Night at the Opera / The Long Long Trailer / Father of the Bride 1950)\nCary Grant  (Actor),     Marx Brothers  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['TCM Greatest Classic Films: Comedy (4FE) (DVD)', 'ARSENIC AND OLD LACE Cary Grant and a stellar cast romp through this classic farce based on the Broadway hit and breezily directed by Frank Capra. A frazzled drama critic’s two maiden aunts put a secret ingredient in their elderberry wine – and the resulting circus is howlingly hilarious, with a comically rubber-faced, rubber-legged Grant in the center ring. A NIGHT AT THE OPERA Grand opera equals grand comedy as the Marx Brothers cram a ship’s stateroom and more with wall-to-wall gags, one-liners, musical riffs and two hard-boiled eggs – all while skewering pompous schemes to sabotage an opera production. “Arguably their finest film” (4 Star Rating! - Leonard Maltin’s Movie Guide). THE LONG, LONG TRAILER Anyone know how to park this thing? Lucille Ball and Desi Arnaz play newlyweds who hit the honeymoon road with a 40-foot house trailer in tow in this slaphappily-ever-after comedy directed by Vincente Minnelli. FATHER OF THE BRIDE (1950) Spencer Tracy is the father and Elizabeth Taylor the bride in this comic celebration of an American rite (and wrongs) of passage. Here comes the bride, there goes dad’s wallet…and everyone’s heart. What sparkling fun!', ']]>']\n{'Genre': 'Classics, Comedy', 'Format': 'Multiple Formats, Color, Full Screen, Black & White, Subtitled, NTSC', 'Contributor': 'Spencer Tracy, Marx Brothers, Cary Grant, Desi Arnaz, Elizabeth Taylor, Lucille Ball', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '6 hours and 46 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': '400649', 'Media Format': 'Multiple Formats, Color, Full Screen, Black & White, Subtitled, NTSC', 'Run time': '6 hours and 46 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Cary Grant, Marx Brothers, Lucille Ball, Desi Arnaz, Spencer Tracy', 'Subtitles': 'English, French', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nArsenic & Old Lace is a must for any collection and the other three are definitely worth watching, too.  I admit I wouldn't have spent money on the Marx Brothers or Lucille Ball alone, but now that I have them, I'll watch.  Elizabeth Taylor is great in the original Father of the Bride.  Arsenic & Old Lace, though....  you gotta watch it.\nGreat value!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Cecil B. DeMille'], 'Producers': ['Cecil B. DeMille'], 'Starring': ['Betty Hutton', 'Cornel Wilde', 'Charlton Heston']}\n\"The Greatest Show on Earth\" is the best circus movie out there.  Made with the cooperation of Barnum & Bailey, it has some of the best acts and a good plot.  The train wreck is loosely based on a couple of real life train wrecks involving circus trains.  Charlton Heston is really good as the circus boss.  He stays behind the scenes and makes sure things run smoothly---not easy when you have a bunch of ego-centric performers!\nStill a good movie!\nThe Artist [DVD]\nJean Dujardin  (Actor),     Berenice Bejo  (Actor),     Michel Hazanavicius  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"Hollywood 1927. George Valentin (Academy Award Winner Jean Dujardin) is a silent movie superstar. The advent of the talkies will sound the death knell for his career and see him fall into oblivion. For young extra Peppy Miller (Berenice Bejo), it seems the sky's the limit - major movie stardom awaits. THE ARTIST tells the story of their interlinked destinies.\", 'Amazon.com', 'The Artist', 'is a love letter and homage to classic black-and-white silent films. The film is enormously likable and is anchored by a charming performance from Jean Dujardin, as silent movie star George Valentin. In late-1920s Hollywood, as Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he makes an intense connection with Peppy Miller, a young dancer set for a big break. As one career declines, another flourishes, and by channeling elements of', 'A Star Is Born', 'and', 'Singing in the Rain', ',', 'The Artist', 'tells the engaging story with humor, melodrama, romance, and--most importantly--silence. As wonderful as the performances by Dujardin and Bérénice Bejo (Miller) are, the real star of', 'The Artist', 'is cinematographer Guillaume Schiffman. Visually, the film is stunning. Crisp and beautifully contrasted, each frame is so wonderfully constructed that this sweet and unique little movie is transformed from entertaining fluff to a profound cinematic achievement. --', 'Kira Canny']\n{'Digital Copy Expiration Date': 'December 31, 2017', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '25291000', 'Director': 'Michel Hazanavicius', 'Media Format': 'DVD, NTSC', 'Run time': '1 hour and 41 minutes', 'Release date': 'June 26, 2012', 'Actors': 'Jean Dujardin, Berenice Bejo, James Cromwell, Penelope Miller, Malcolm McDowell', 'Subtitles': 'Spanish', 'Producers': 'Thomas Langmann', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nI bought this specifically because it was a silent movie and would go well on my Nook (its hard to hear).  Fits the bill.  Wish there were more silents for that purpose.\nGood movie\n{'Audio languages': ['English'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Jon Favreau'], 'Producers': ['Kevin Feige'], 'Starring': ['Robert Downey Jr.', 'Gwyneth Paltrow', 'Don Cheadle'], 'Studio': ['Marvel']}\nWatching The Avengers (which I purchased) gave me an appetite for more of the Black Widow.  This was good, but I rented it.\nHad to watch\n{'Subtitles': ['None available'], 'Directors': ['William Shatner'], 'Producers': ['J. Craig Thompson'], 'Starring': ['William Shatner', 'Patrick Stewart', 'Avery Brooks'], 'Studio': ['Brainstorm Media']}\nYou don't think of the toll on the actors who play the role of Star Fleet captains.  This was an interesting look into the real people behind the captains.\nWorthwhile.",
  "profile": "**Updated User Profile Summary:**\n\n- **Media Preferences:** The user maintains a passion for science fiction and fantasy films, particularly those featuring space exploration and impressive visual effects. Their interest in classic comedies has broadened to encompass circus-themed and silent films, indicating a fondness for nostalgic and unique cinematic experiences.\n\n- **Engagement with Content:** Recent interactions show an increased appreciation for character-driven narratives, especially those featuring female leads. The user is drawn to films that effectively combine spectacle with compelling storytelling, engaging with both modern adaptations and timeless classics.\n\n- **Viewing Habits:** Their emphasis on action, adventure, and humor persists, underpinned by a discerning, analytical perspective on film. This user demonstrates a growing fascination with visual artistry and narrative depth, particularly in the context of the actors’ personal journeys and their roles.\n\n- **Format & Convenience:** They continue to favor physical media formats like DVDs, seeking detailed descriptions and prompt delivery.\n\n- **Analytical Approach:** The user’s thoughtful reviews reflect an exploration of artistic and aesthetic elements in films, with an emphasis on character development and the experiences of actors in their roles.\n\n- **Satisfaction Level:** Their satisfaction with film selections remains high, often expressing positive ratings. The user’s evolving engagement with classic and character-centric narratives deepens their connection to the art of storytelling, enhancing their cinema appreciation.",
  "metrics": {
    "rouge1_f": 0.13144475920679888,
    "rouge2_f": 0.015882019285309135,
    "rougeL_f": 0.06458923512747876,
    "meteor": 0.04223890795682115,
    "bleu1": 0.00044445177414425516,
    "bleu2": 0.0001655298238082375,
    "bleu3": 2.152445468182311e-05,
    "bleu4": 7.768779258196723e-06,
    "bertscore_precision": 0.3559124767780304,
    "bertscore_recall": 0.5089819431304932,
    "bertscore_f1": 0.41890206933021545
  }
}