{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2012/04/26\nAverage Rating: 4.7\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Cecil B. DeMille'], 'Producers': ['Cecil B. DeMille'], 'Starring': ['Betty Hutton', 'Cornel Wilde', 'Charlton Heston']}\nReview Text: \"The Greatest Show on Earth\" is the best circus movie out there.  Made with the cooperation of Barnum & Bailey, it has some of the best acts and a good plot.  The train wreck is loosely based on a couple of real life train wrecks involving circus trains.  Charlton Heston is really good as the circus boss.  He stays behind the scenes and makes sure things run smoothly---not easy when you have a bunch of ego-centric performers!\nReview Title: Still a good movie!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Lost in Space\nStephen Hopkins  (Director),     William Hurt  (Actor),     Mimi Rogers  (Actor)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Monsters & Mutants\n['Product Description', 'Lost in Space (DVD)', 'A family of space colonists, their pilot and a diabolical stowaway scientist become hopelessly lost beyond the galaxy when their mission is sabotaged. Marooned in an unknown and hostile region of the cosmos, they must band together to survive in this state-of-the art update of the classic television series.', ']]>', 'Amazon.com', \"Packed with more than 750 dazzling visual effects, this $70 million adventure does more (and less) than give the 1965-68 TV series a state-of-the-art face-lift. Aimed at an audience that wasn't born when the series originally aired, the sci-fi extravaganza doesn't even require familiarity, despite cameo appearances by several of the TV show's original cast members. Instead it's a high-tech hybrid of the original premise with enough sensory overload to qualify as a spectacular big-screen video game, supported by a time-travel premise that's adequately clever but hardly original. It's certainly never boring, and visually it's an occasionally awesome demonstration of special effects technology. But in its attempt to be all things to all demographics, the movie's more of a marketing ploy than a satisfying adventure, thankfully dispensing with the TV show's cheesy camp but otherwise squandering a promising cast in favor of eye-candy and ephemeral storytelling. In keeping with the movie's high-tech appeal, the DVD is a feature-packed marvel, including two audio commentaries, deleted scenes, two featurettes covering special effects and the original TV series (featuring complete biographies and episode guides), the original screenplay, and interactive games.\", '--Jeff Shannon']\n{'Genre': 'Science Fiction & Fantasy, Action & Adventure, Mystery & Suspense', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Contributor': 'Michael DeLuca, William Hurt, Mace Neufeld, Jack Johnson, Matt LeBlanc, Mimi Rogers, Stephen Hopkins, Gary Oldman, Jared Harris, Irwin Allen, Dick Tufeld, Richard Saperstein, Heather Graham, Robert Rehme, Akiva Goldsman, Lacey ChabertMichael DeLuca, William Hurt, Mace Neufeld, Jack Johnson, Matt LeBlanc, Mimi Rogers, Stephen Hopkins, Gary Oldman, Jared Harris, Irwin Allen, Dick Tufeld, Richard Saperstein, Heather Graham, Robert Rehme, Akiva Goldsman, Lacey Chabert  See more', 'Language': 'Unqualified, English (Dolby Digital 5.1)', 'Runtime': '2 hours and 10 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.72 Ounces', 'Item model number': 'MFR794043466724#VG', 'Director': 'Stephen Hopkins', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 10 minutes', 'Release date': 'August 9, 2005', 'Actors': 'William Hurt, Mimi Rogers, Heather Graham, Lacey Chabert, Jack Johnson', 'Subtitles': 'English', 'Producers': 'Mace Neufeld, Robert Rehme, Richard Saperstein, Michael DeLuca', 'Studio': 'WarnerBrothers', 'Writers': 'Akiva Goldsman', 'Number of discs': '1'}\nArrived quickly.  I had a small problem getting it to play in one computer's drive, but it plays fine in a regular DVD player.  Probably the computer had a glitch.  Item was as described and arrived quickly.\nExcellent movie.\nTCM Greatest Classic Films Collection: Comedy (Arsenic and Old Lace / A Night at the Opera / The Long Long Trailer / Father of the Bride 1950)\nCary Grant  (Actor),     Marx Brothers  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['TCM Greatest Classic Films: Comedy (4FE) (DVD)', 'ARSENIC AND OLD LACE Cary Grant and a stellar cast romp through this classic farce based on the Broadway hit and breezily directed by Frank Capra. A frazzled drama critic’s two maiden aunts put a secret ingredient in their elderberry wine – and the resulting circus is howlingly hilarious, with a comically rubber-faced, rubber-legged Grant in the center ring. A NIGHT AT THE OPERA Grand opera equals grand comedy as the Marx Brothers cram a ship’s stateroom and more with wall-to-wall gags, one-liners, musical riffs and two hard-boiled eggs – all while skewering pompous schemes to sabotage an opera production. “Arguably their finest film” (4 Star Rating! - Leonard Maltin’s Movie Guide). THE LONG, LONG TRAILER Anyone know how to park this thing? Lucille Ball and Desi Arnaz play newlyweds who hit the honeymoon road with a 40-foot house trailer in tow in this slaphappily-ever-after comedy directed by Vincente Minnelli. FATHER OF THE BRIDE (1950) Spencer Tracy is the father and Elizabeth Taylor the bride in this comic celebration of an American rite (and wrongs) of passage. Here comes the bride, there goes dad’s wallet…and everyone’s heart. What sparkling fun!', ']]>']\n{'Genre': 'Classics, Comedy', 'Format': 'Multiple Formats, Color, Full Screen, Black & White, Subtitled, NTSC', 'Contributor': 'Spencer Tracy, Marx Brothers, Cary Grant, Desi Arnaz, Elizabeth Taylor, Lucille Ball', 'Language': 'English (Dolby Digital 1.0), Unqualified (DTS ES 6.1)', 'Runtime': '6 hours and 46 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 0.01 Ounces', 'Item model number': '400649', 'Media Format': 'Multiple Formats, Color, Full Screen, Black & White, Subtitled, NTSC', 'Run time': '6 hours and 46 minutes', 'Release date': 'November 3, 2009', 'Actors': 'Cary Grant, Marx Brothers, Lucille Ball, Desi Arnaz, Spencer Tracy', 'Subtitles': 'English, French', 'Studio': 'WarnerBrothers', 'Number of discs': '4'}\nArsenic & Old Lace is a must for any collection and the other three are definitely worth watching, too.  I admit I wouldn't have spent money on the Marx Brothers or Lucille Ball alone, but now that I have them, I'll watch.  Elizabeth Taylor is great in the original Father of the Bride.  Arsenic & Old Lace, though....  you gotta watch it.\nGreat value!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Cecil B. DeMille'], 'Producers': ['Cecil B. DeMille'], 'Starring': ['Betty Hutton', 'Cornel Wilde', 'Charlton Heston']}\n\"The Greatest Show on Earth\" is the best circus movie out there.  Made with the cooperation of Barnum & Bailey, it has some of the best acts and a good plot.  The train wreck is loosely based on a couple of real life train wrecks involving circus trains.  Charlton Heston is really good as the circus boss.  He stays behind the scenes and makes sure things run smoothly---not easy when you have a bunch of ego-centric performers!\nStill a good movie!",
  "profile": "**User Profile Summary:**\n\n- **Media Preferences:** The user enjoys science fiction and fantasy films with a particular interest in space exploration, adventure, and high visual effects. They also appreciate classic comedies and now have shown a fondness for classic circus-themed films, indicating a growing interest in nostalgic entertainment.\n\n- **Engagement with Content:** The user has a strong appreciation for movies that blend spectacle with engaging narratives, favoring both modern adaptations and timeless classics. Their enjoyment of films with rich visual elements continues to grow, complemented by a humorous twist in comedic genres.\n\n- **Viewing Habits:** They prioritize entertainment value, gravitating towards action, adventure, and humor. The user maintains a critical perspective, valuing the balance between visual stimulation and narrative depth.\n\n- **Format & Convenience:** Prefers physical media formats like DVDs and values accuracy in product descriptions along with prompt delivery. Minor technical issues do not significantly impact their overall satisfaction.\n\n- **Analytical Approach:** Provides thoughtful reviews assessing performance, direction, and aesthetic appeal. Their ratings reflect a blend of enjoyment and critical analysis, recently highlighted by their assessment of circus-themed films.\n\n- **Satisfaction Level:** Consistently exhibits a high level of satisfaction with purchases, often scoring films positively, even if initially hesitant. Their recent foray into classic films enriches their viewing preferences, enhancing their appreciation for entertaining narratives.",
  "metrics": {
    "rouge1_f": 0.13717848791894,
    "rouge2_f": 0.01717408274785324,
    "rougeL_f": 0.06858924395947,
    "meteor": 0.04840839078773654,
    "bleu1": 0.004416287677253665,
    "bleu2": 0.0012073271367227564,
    "bleu3": 0.00019035825432187886,
    "bleu4": 7.565527010220378e-05,
    "bertscore_precision": 0.3586084246635437,
    "bertscore_recall": 0.4772067368030548,
    "bertscore_f1": 0.4094932973384857
  }
}