{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: UJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nReview Date: 2021/05/11\nStore: UJM\nAverage Rating: 4.2\nProduct Details: {'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nReview Text: Okay, so these are not the best for beginners. I am new to makeup and lashes and I struggled HARD with these. The liner is hard to control and leaks a bit. I have had it seep into the corners of my eyes multiple times and it stings a little bit. The eyelashes stick on well everywhere except for the inside of the eyelid. The last magnet often lifts upward right by the tear duct. It is really hard to keep the whole lash down. I have successfully applied them once. Really would not recommend for beginners.\nReview Title: Not for begginers\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nThis took off layers of foundation and contouring easily, but was soft on the skin while removing them. I like the loops on each pad because I can hook a finger through the loop to keep the pad in place while I wash my face.\nSoft on skin, hard on makeup\nBiutee Poly Nail Gel Kit 15ml 0.53oz Pink Nail Extension Gel Builder Gel Long Lasting Nail Salon Nail Art Design DIY at Home Beginner Friendly…\nBiutee\n{'Package Dimensions': '3.5 x 2 x 1.5 inches; 0.81 Ounces'}\nThe polygel is very sticky and hard to smooth out on the mold. I used nail polish remover in between nails to make it a little easier. Once the gel was finally applied, I was impressed, but the nails only lasted two days before falling off during daily activities like washing my hair and doing the dishes. And that was after I put dip powder on top of the polygel for color. Also note that this is only the gel, you have to order a mold separately to help put them on.\nNot long lasting\n3 Packs Braiding Hair Extensions 165G Jumbo Braiding Hair High Temperature Synthetic Fiber Jumbo Braiding Hair Extensions ( Blue)\nUHair\n{'Brand': 'UHair', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural'}\nI was a little worried because the packaging was ripped when it came. And this is the packaging that within the Amazon package. Luckily all 3 packs were there. I was also worried because the hair looked really plastic-y .Once I started using it though, it was really easy to work with! I ended up cutting the hair to make shorter box braids though because it was so long. I would recommend ordering 2 to cover your whole head. I needed 6 packs to do a full head of box braids.\nGreat for box braids!\n6 Packs/Lot 26 Inch Pre-stretched Braiding Hair Professional Perm Yaki Synthetic Hair Braids(Ombre Brown Blond,#1B/30/27)\nAlishow\n{'Brand': 'Alishow', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '16.97 x 12.48 x 2.52 inches; 2.07 Pounds', 'UPC': '727196547491'}\nThis hair does not tangle much at all! It was great for making small box braids. I sealed the ends with boiling water which worked just fine. It took 2 rounds of dipping my hair in the water to seal them though. The hair is separated into bundles and separated with twist ties. I like the twist ties better than bundles that are separated with hair ties. The twist ties were easier to get off without tangling the hair. I used olive oil, edge control, and hair gel infused with castor oil to braid my hair. All of the products worked well with the hair. I would definitely get this again.\nGreat braiding hair!\nSenegalese Twist Crochet Braids Wavy Twist Crochet Hair 14 Inch 5 Packs Wavy Ends free Synthetic Hair Extension Curly Crochet Twist Hair (1B#)\nLiang Dian\n{'Brand': 'Liang Dian', 'Material': 'Synthetic', 'Extension Length': '14 Inches', 'Hair Type': 'Curly', 'Material Feature': 'Natural', 'Package Dimensions': '8.78 x 8.35 x 2.64 inches; 8.47 Ounces', 'UPC': '738631321149'}\nI had never crocheted hair in before these, but I had no issues! The hair came with a crochet tool and the loops were wide enough to work with, I only had to expand them a little bit when installing. It took me about 2 hours and all of the packs to do my hair and I love the result! They are much lighter than box braids and very low maintenance. I have gotten a ton of compliments about how they look! The hair also came with some little multi-colored hair jewels to spice up the twists, which was a nice little gift from the vendor!\nLightweight and so pretty!\nAltaba Long Wavy Wigs Ombre Red Synthetic Wigs Middle Part Natural Looking Heat Resistant Party Cosplay Full Wig for Women\nAltaba\n{'Material': 'Synthetic', 'Hair Type': 'Wavy', 'Style': 'Wavy', 'Special Feature': 'Glueless', 'Brand': 'Altaba'}\nI love the color and feel of this wig. It is vibrant, flowy, and truly makes me feel gorgeous. However, there is a distinct line across the middle part that I cannot pluck away so there is a clear line at the scalp separating the hair from the forehead. If I could just pluck the wig to have a better hairline, I would rate this higher.\nGorgeous color, not a great part\nUJM Magnetic Eyelashes 10 Pairs Reusable Magnetic Eyelash and Eyeliner Kit Natural Look False Lashes with Tweezers No Glue Needed Waterproof Magnetic Lashes\nUJM\n{'Brand': 'UJM', 'Item Dimensions LxWxH': '8 x 4 x 0.4 inches', 'Material Feature': 'Gluten Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Product Dimensions': '8 x 4 x 0.4 inches; 2.89 Ounces', 'Item model number': 'UJM-010'}\nOkay, so these are not the best for beginners. I am new to makeup and lashes and I struggled HARD with these. The liner is hard to control and leaks a bit. I have had it seep into the corners of my eyes multiple times and it stings a little bit. The eyelashes stick on well everywhere except for the inside of the eyelid. The last magnet often lifts upward right by the tear duct. It is really hard to keep the whole lash down. I have successfully applied them once. Really would not recommend for beginners.\nNot for begginers",
  "profile": "**User Summary:**\n\n- **Product Preference:** The user continues to prioritize reusable and eco-friendly beauty options while exploring versatile synthetic alternatives that uphold sustainability.\n\n- **Skin Sensitivity:** They favor gentle, all-skin-type products suitable for dry skin, maintaining a positive adaptability towards synthetic products and hair options.\n\n- **Functionality:** The user values practicality and effectiveness, particularly in hairstyling tools and beauty accessories. Their recent experiences indicate a growing interest in lightweight, low-maintenance options, while expressing challenges in usability—highlighted in their recent interactions involving cosmetics.\n\n- **Design Features:** They appreciate thoughtful design and usability, with a continued focus on aesthetic appeal. Their feedback emphasizes a desire for improved user experiences across product lines, particularly regarding application ease and functionality.\n\n- **Overall Satisfaction:** The user’s satisfaction with purchases remains high, underscored by a demand for durability and effective solutions. They have shown a preference for vibrant colors and practical designs, reflecting a strong commitment to both aesthetics and functionality.\n\n- **Review Style:** Their critical assessments emphasize product performance with particular attention to usability challenges. The user effectively highlights both the positive aspects and areas for improvement, especially concerning ease of use for beginners, reinforcing their interest in practical solutions that enhance their beauty routine.",
  "metrics": {
    "rouge1_f": 0.12914188615123193,
    "rouge2_f": 0.015319148936170214,
    "rougeL_f": 0.06966864910790144,
    "meteor": 0.05056026236676688,
    "bleu1": 0.008648252108032618,
    "bleu2": 0.0021267556179191366,
    "bleu3": 0.00036214991617517043,
    "bleu4": 0.00014958868189463037,
    "bertscore_precision": 0.36282485723495483,
    "bertscore_recall": 0.45972225069999695,
    "bertscore_f1": 0.4055662453174591
  }
}