{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 6 Packs/Lot 26 Inch Pre-stretched Braiding Hair Professional Perm Yaki Synthetic Hair Braids(Ombre Brown Blond,#1B/30/27)\nReview Date: 2020/10/11\nStore: Alishow\nAverage Rating: 4.7\nProduct Details: {'Brand': 'Alishow', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '16.97 x 12.48 x 2.52 inches; 2.07 Pounds', 'UPC': '727196547491'}\nReview Text: This hair does not tangle much at all! It was great for making small box braids. I sealed the ends with boiling water which worked just fine. It took 2 rounds of dipping my hair in the water to seal them though. The hair is separated into bundles and separated with twist ties. I like the twist ties better than bundles that are separated with hair ties. The twist ties were easier to get off without tangling the hair. I used olive oil, edge control, and hair gel infused with castor oil to braid my hair. All of the products worked well with the hair. I would definitely get this again.\nReview Title: Great braiding hair!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Natwag Makeup Remover Pads,18 Pack 3.74 Inch Reusable Microfiber Cleansing Pad with Laundry Bag Suitable for All Skin Types,3 Color Facial Cleansing Pad Set.\nNatwag\n{'Brand': 'Natwag', 'Skin Type': 'All Skin,Dry', 'Material Feature': 'Reusable', 'Unit Count': '18.00 Count', 'Number of Items': '18', 'Package Dimensions': '4.4 x 4.37 x 2.59 inches; 3.84 Ounces', 'UPC': '745103569701'}\nThis took off layers of foundation and contouring easily, but was soft on the skin while removing them. I like the loops on each pad because I can hook a finger through the loop to keep the pad in place while I wash my face.\nSoft on skin, hard on makeup\nBiutee Poly Nail Gel Kit 15ml 0.53oz Pink Nail Extension Gel Builder Gel Long Lasting Nail Salon Nail Art Design DIY at Home Beginner Friendly…\nBiutee\n{'Package Dimensions': '3.5 x 2 x 1.5 inches; 0.81 Ounces'}\nThe polygel is very sticky and hard to smooth out on the mold. I used nail polish remover in between nails to make it a little easier. Once the gel was finally applied, I was impressed, but the nails only lasted two days before falling off during daily activities like washing my hair and doing the dishes. And that was after I put dip powder on top of the polygel for color. Also note that this is only the gel, you have to order a mold separately to help put them on.\nNot long lasting\n3 Packs Braiding Hair Extensions 165G Jumbo Braiding Hair High Temperature Synthetic Fiber Jumbo Braiding Hair Extensions ( Blue)\nUHair\n{'Brand': 'UHair', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Material Feature': 'Natural'}\nI was a little worried because the packaging was ripped when it came. And this is the packaging that within the Amazon package. Luckily all 3 packs were there. I was also worried because the hair looked really plastic-y .Once I started using it though, it was really easy to work with! I ended up cutting the hair to make shorter box braids though because it was so long. I would recommend ordering 2 to cover your whole head. I needed 6 packs to do a full head of box braids.\nGreat for box braids!\n6 Packs/Lot 26 Inch Pre-stretched Braiding Hair Professional Perm Yaki Synthetic Hair Braids(Ombre Brown Blond,#1B/30/27)\nAlishow\n{'Brand': 'Alishow', 'Material': 'Synthetic', 'Extension Length': '26 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '16.97 x 12.48 x 2.52 inches; 2.07 Pounds', 'UPC': '727196547491'}\nThis hair does not tangle much at all! It was great for making small box braids. I sealed the ends with boiling water which worked just fine. It took 2 rounds of dipping my hair in the water to seal them though. The hair is separated into bundles and separated with twist ties. I like the twist ties better than bundles that are separated with hair ties. The twist ties were easier to get off without tangling the hair. I used olive oil, edge control, and hair gel infused with castor oil to braid my hair. All of the products worked well with the hair. I would definitely get this again.\nGreat braiding hair!",
  "profile": "**User Summary:**\n\n- **Product Preference:** The user shows a strong inclination towards reusable and eco-friendly beauty and hair care options, continuing to explore synthetic alternatives that provide versatility without compromising on sustainability.\n\n- **Skin Sensitivity:** They maintain a preference for gentle, all-skin-type products suitable for dry skin. Their recent experimentation with synthetic hair products indicates a focus on usability over direct skin interaction, reflecting adaptability in their product choices.\n\n- **Functionality:** The user values practicality and effectiveness, particularly for makeup removal, hairstyling, and hair extensions. Their recent experience with braiding hair highlights a keen interest in functional aspects such as tangle resistance and ease of use, enhancing their hairstyling routine.\n\n- **Design Features:** They appreciate thoughtful design in product packaging and usability. Positive experiences with product presentations, like using twist ties for hair bundles, suggest a preference for designs that enhance user convenience and reduce tangling.\n\n- **Overall Satisfaction:** While generally pleased with their purchases, the user remains discerning, prioritizing durability and reliability in their products. Their satisfaction with recent hair extensions indicates a continued focus on effective and dependable outcomes.\n\n- **Review Style:** They critically assess product performance based on usability, effectiveness, and overall experience, emphasizing functionality in beauty care and hairstyling consistently across their evaluations.",
  "metrics": {
    "rouge1_f": 0.19328859060402684,
    "rouge2_f": 0.02691790040376851,
    "rougeL_f": 0.09664429530201342,
    "meteor": 0.10009619498641732,
    "bleu1": 0.07719042643150612,
    "bleu2": 0.01667869594663911,
    "bleu3": 0.006312803830878602,
    "bleu4": 0.0021860718893921224,
    "bertscore_precision": 0.36250776052474976,
    "bertscore_recall": 0.44536924362182617,
    "bertscore_f1": 0.39968907833099365
  }
}