{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/04/30\nAverage Rating: 3.6\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Logan Thomas'], 'Producers': ['Aric Cushing', 'Logan Thomas'], 'Starring': ['Aric Cushing', 'Juliet Landau', 'Dale Dickey'], 'Studio': ['Ascent Releasing Entertainment']}\nReview Text: I thought this was a very well directed and suspenseful movie. The acting was good and the locale was a good choice. I wasn't really sure of what was going on until near the end, which was a plus for me.\nReview Title: The acting was good and the locale was a good choice\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nGreat writers, producers, director. Excellent cast. Story plot just keeps getting better. Excellent special effects and acting. I'm hooked. One of the best series on television today.\nTop Show on TV\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nThis series is  very well directed and produced. The scenery is fantastic of the English towns and countryside. The acting is superb. The plots are well executed and thought out. Love the character studies and watching how the relationships between the main characters develop over time. Just a great mystery series if you are a mystery buff.\nGreat Whodunit British series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Dan Reed', 'Maurice Phillips', 'Richard Spence', 'Stuart Orme'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nGreat production with fantastic actors and acting. Love the locations and scenery. Plots are well executed. Character studies are well executed and add to the plot's intrigue. Love how everything all weaves together in the end.\nGreat Mystery Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Hettie Macdonald', 'Metin Hüseyin', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whatley', 'Laurence Fox'], 'Studio': ['PBS']}\nI love the Inspector Lewis series and can't get enough of it. It is so well directed and written. The acting is superb, and I love the locale. The way the plot is interwoven with all of the character studies always keeps me guessing who dunnit. Can't wait to see each time how the relationship between Lewis and Laura evolves. Overall, it is just a great entertaining series for mystery buffs.\nFantastic Series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', \"David O'Neill\", 'Nicholas Renton', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox']}\nAnother great season of mystery and mayhem. Great directing, acting and writing on this show. Love the scenery and characterizations. Love seeing Lewis and Dr. Hobson taking their relationship to the next level, even though it is slow and steady. I hate it when each season ends. I can't get enough of this series.\nGreat Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', 'Daniel Reed', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Charlie Cox', 'Clare Holman', 'Kevin Whately'], 'Studio': ['PBS']}\nFinally! Lewis and Laura are a couple. It was a long time coming, but worth the suspense. This is the last season on my watchlist, but I hope it isn't the end of the series. Will Hathaway really resign? Will Lewis really retire? Too many questions are left unanswered. There has to be more seasons of this great series. I am too hooked for it to be the end. Masterpiece Theater has some of the best shows on TV. I will keep watching in hopes of seeing all my favorites again.\nFantastic Series!!!\n{'Subtitles': ['None available'], 'Directors': ['Logan Thomas'], 'Producers': ['Aric Cushing', 'Logan Thomas'], 'Starring': ['Aric Cushing', 'Juliet Landau', 'Dale Dickey'], 'Studio': ['Ascent Releasing Entertainment']}\nI thought this was a very well directed and suspenseful movie. The acting was good and the locale was a good choice. I wasn't really sure of what was going on until near the end, which was a plus for me.\nThe acting was good and the locale was a good choice",
  "profile": "**User Summary:**\n\nThis user continues to demonstrate a strong enthusiasm for high-quality television series, especially within the mystery genre, while also expanding their interest to well-crafted suspenseful films. Their latest interaction indicates an appreciation for skillful direction and strong performances, evidenced by their positive review of a film they found engaging and suspenseful. They value narratives that maintain a level of ambiguity, allowing for intrigue until the latter part of the story, aligning with their existing preference for intricate storytelling.\n\nThe user's recent review underscores their expectation for immersive experiences, noting the importance of setting, which enhances their overall viewing experience. Their consistent engagement with media showcasing deep character exploration and dynamic relationships persists, highlighting a cultivated taste for complex narratives that provide emotional and intellectual resonance. \n\nIn addition, the user remains supportive of talented directors and actors, appreciating their contributions to storytelling, which underlines their dedication to watching not only series but also high-quality films. This breadth of interest signifies a commitment to sophisticated storytelling across various formats. Overall, their media consumption journey is characterized by a continuous search for well-crafted narratives that captivate and resonate deeply, both in television and film.",
  "metrics": {
    "rouge1_f": 0.15274463007159905,
    "rouge2_f": 0.007177033492822966,
    "rougeL_f": 0.07875894988066826,
    "meteor": 0.04773147197700678,
    "bleu1": 0.00785967809076065,
    "bleu2": 0.0023599117391649434,
    "bleu3": 0.0008273500324303247,
    "bleu4": 0.0002757942719905949,
    "bertscore_precision": 0.322988361120224,
    "bertscore_recall": 0.4459220767021179,
    "bertscore_f1": 0.37462785840034485
  }
}