{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/02/12\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Dan Reed', 'Maurice Phillips', 'Richard Spence', 'Stuart Orme'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nReview Text: Great production with fantastic actors and acting. Love the locations and scenery. Plots are well executed. Character studies are well executed and add to the plot's intrigue. Love how everything all weaves together in the end.\nReview Title: Great Mystery Series\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nGreat writers, producers, director. Excellent cast. Story plot just keeps getting better. Excellent special effects and acting. I'm hooked. One of the best series on television today.\nTop Show on TV\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nThis series is  very well directed and produced. The scenery is fantastic of the English towns and countryside. The acting is superb. The plots are well executed and thought out. Love the character studies and watching how the relationships between the main characters develop over time. Just a great mystery series if you are a mystery buff.\nGreat Whodunit British series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Dan Reed', 'Maurice Phillips', 'Richard Spence', 'Stuart Orme'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nGreat production with fantastic actors and acting. Love the locations and scenery. Plots are well executed. Character studies are well executed and add to the plot's intrigue. Love how everything all weaves together in the end.\nGreat Mystery Series",
  "profile": "**User Summary:**\n\nThis user demonstrates a strong preference for high-quality television series, especially those characterized by compelling storytelling, excellent direction, and robust performances. They value narratives that showcase intricate character studies and relationship dynamics, indicating a focus on overall production quality. Their recent interactions reveal a specific admiration for British mystery series, emphasizing their enjoyment of well-executed plots, character development, and detailed English settings. \n\nWith a consistent interest in drama, science fiction, and mystery genres, this user appreciates works by talented writers and notable casts. Their ratings reflect a tendency to favor productions that deliver captivating viewing experiences, supported by impressive special effects and creative craftsmanship.\n\nTheir latest interaction highlights a particular delight in a series known for its strong performances, great locations, and masterfully woven plotlines, further solidifying their affinity for high-quality mystery storytelling. The user also shows a preference for content in English, reinforcing their inclination towards domestic productions. Overall, they prioritize shows that excel in narrative depth and production values, seeking stories that thoughtfully explore character relationships and culminate in compelling conclusions. This consistent pattern of media consumption showcases their commitment to discerning, high-caliber television experiences.",
  "metrics": {
    "rouge1_f": 0.22988505747126436,
    "rouge2_f": 0.04157043879907621,
    "rougeL_f": 0.09655172413793103,
    "meteor": 0.10261930503391989,
    "bleu1": 0.11072237546999131,
    "bleu2": 0.03424723718731684,
    "bleu3": 0.016083282647809404,
    "bleu4": 0.005217815001588865,
    "bertscore_precision": 0.37348878383636475,
    "bertscore_recall": 0.4317786395549774,
    "bertscore_f1": 0.4005240201950073
  }
}