{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/03/09\nAverage Rating: 4.8\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', 'Daniel Reed', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Charlie Cox', 'Clare Holman', 'Kevin Whately'], 'Studio': ['PBS']}\nReview Text: Finally! Lewis and Laura are a couple. It was a long time coming, but worth the suspense. This is the last season on my watchlist, but I hope it isn't the end of the series. Will Hathaway really resign? Will Lewis really retire? Too many questions are left unanswered. There has to be more seasons of this great series. I am too hooked for it to be the end. Masterpiece Theater has some of the best shows on TV. I will keep watching in hopes of seeing all my favorites again.\nReview Title: Fantastic Series!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nGreat writers, producers, director. Excellent cast. Story plot just keeps getting better. Excellent special effects and acting. I'm hooked. One of the best series on television today.\nTop Show on TV\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nThis series is  very well directed and produced. The scenery is fantastic of the English towns and countryside. The acting is superb. The plots are well executed and thought out. Love the character studies and watching how the relationships between the main characters develop over time. Just a great mystery series if you are a mystery buff.\nGreat Whodunit British series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Dan Reed', 'Maurice Phillips', 'Richard Spence', 'Stuart Orme'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nGreat production with fantastic actors and acting. Love the locations and scenery. Plots are well executed. Character studies are well executed and add to the plot's intrigue. Love how everything all weaves together in the end.\nGreat Mystery Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Hettie Macdonald', 'Metin Hüseyin', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whatley', 'Laurence Fox'], 'Studio': ['PBS']}\nI love the Inspector Lewis series and can't get enough of it. It is so well directed and written. The acting is superb, and I love the locale. The way the plot is interwoven with all of the character studies always keeps me guessing who dunnit. Can't wait to see each time how the relationship between Lewis and Laura evolves. Overall, it is just a great entertaining series for mystery buffs.\nFantastic Series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', \"David O'Neill\", 'Nicholas Renton', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox']}\nAnother great season of mystery and mayhem. Great directing, acting and writing on this show. Love the scenery and characterizations. Love seeing Lewis and Dr. Hobson taking their relationship to the next level, even though it is slow and steady. I hate it when each season ends. I can't get enough of this series.\nGreat Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', 'Daniel Reed', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Charlie Cox', 'Clare Holman', 'Kevin Whately'], 'Studio': ['PBS']}\nFinally! Lewis and Laura are a couple. It was a long time coming, but worth the suspense. This is the last season on my watchlist, but I hope it isn't the end of the series. Will Hathaway really resign? Will Lewis really retire? Too many questions are left unanswered. There has to be more seasons of this great series. I am too hooked for it to be the end. Masterpiece Theater has some of the best shows on TV. I will keep watching in hopes of seeing all my favorites again.\nFantastic Series!!!",
  "profile": "**User Summary:**\n\nThis user exhibits a strong enthusiasm for high-quality television series, especially within the mystery genre. Their latest interaction reveals a particular attachment to character-driven narratives, showcasing their appreciation for relationships that evolve over time. They express excitement over significant romantic developments in a series, underscoring a desire for suspenseful, intricate storytelling that leaves questions unanswered yet captivates their interest.\n\nTheir recent review highlights admiration for productions known for exceptional direction, compelling performances, and rich visual aesthetics, reaffirming their preference for immersive viewing experiences. The user is drawn to series that deliver deep character exploration and dynamic relationships, indicating a refined taste for narrative depth and complexity in dramas, especially those produced in English.\n\nThis interaction also reflects a commitment to ongoing engagement with masterful television content, as seen in their hope for future seasons of their favorite series. The user's ratings consistently demonstrate a dedication to sophisticated storytelling, particularly in drama and mystery genres, emphasizing compelling conclusions and thorough explorations of character relationships. Overall, their media consumption is marked by a passion for well-crafted, high-caliber television experiences that resonate emotionally and intellectually.",
  "metrics": {
    "rouge1_f": 0.15915119363395228,
    "rouge2_f": 0.005319148936170213,
    "rougeL_f": 0.07692307692307691,
    "meteor": 0.05293440736478711,
    "bleu1": 0.01100370703319594,
    "bleu2": 0.004082294123498597,
    "bleu3": 0.0017181342743067688,
    "bleu4": 0.0005277087065186897,
    "bertscore_precision": 0.33002883195877075,
    "bertscore_recall": 0.4452435374259949,
    "bertscore_f1": 0.3790750503540039
  }
}