{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/02/20\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Hettie Macdonald', 'Metin Hüseyin', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whatley', 'Laurence Fox'], 'Studio': ['PBS']}\nReview Text: I love the Inspector Lewis series and can't get enough of it. It is so well directed and written. The acting is superb, and I love the locale. The way the plot is interwoven with all of the character studies always keeps me guessing who dunnit. Can't wait to see each time how the relationship between Lewis and Laura evolves. Overall, it is just a great entertaining series for mystery buffs.\nReview Title: Fantastic Series!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nGreat writers, producers, director. Excellent cast. Story plot just keeps getting better. Excellent special effects and acting. I'm hooked. One of the best series on television today.\nTop Show on TV\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nThis series is  very well directed and produced. The scenery is fantastic of the English towns and countryside. The acting is superb. The plots are well executed and thought out. Love the character studies and watching how the relationships between the main characters develop over time. Just a great mystery series if you are a mystery buff.\nGreat Whodunit British series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Dan Reed', 'Maurice Phillips', 'Richard Spence', 'Stuart Orme'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nGreat production with fantastic actors and acting. Love the locations and scenery. Plots are well executed. Character studies are well executed and add to the plot's intrigue. Love how everything all weaves together in the end.\nGreat Mystery Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Hettie Macdonald', 'Metin Hüseyin', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whatley', 'Laurence Fox'], 'Studio': ['PBS']}\nI love the Inspector Lewis series and can't get enough of it. It is so well directed and written. The acting is superb, and I love the locale. The way the plot is interwoven with all of the character studies always keeps me guessing who dunnit. Can't wait to see each time how the relationship between Lewis and Laura evolves. Overall, it is just a great entertaining series for mystery buffs.\nFantastic Series!",
  "profile": "**User Summary:**\n\nThis user continues to exhibit a strong preference for high-quality television series, particularly those with engaging storytelling, exceptional direction, and powerful performances. Their latest interaction reveals a deep admiration for mystery series, particularly those that excel in character development and intricate plotlines, reaffirming their focus on overall production quality. The user appreciates narratives that are skillfully woven with character studies and relationship dynamics, seeking content that captivates and keeps them guessing.\n\nTheir ratings consistently reflect a dedication to productions that provide immersive viewing experiences, bolstered by impressive performances and well-crafted settings. The user particularly enjoys content produced in English, aligning with their affinity for British mystery series. Their recent review highlights a specific enjoyment of a mystery series known for its directing finesse, superb acting, and rich locales, showcasing their ongoing interest in well-executed narratives that thoughtfully explore character relationships.\n\nOverall, this user's media consumption exemplifies a commitment to discerning, high-caliber television experiences, marked by a preference for drama, science fiction, and mystery genres. They prioritize series that combine narrative depth, compelling conclusions, and detailed character explorations, reinforcing their passion for sophisticated storytelling in the realm of television.",
  "metrics": {
    "rouge1_f": 0.22344322344322345,
    "rouge2_f": 0.03676470588235294,
    "rougeL_f": 0.11355311355311355,
    "meteor": 0.08506280584629215,
    "bleu1": 0.06310735727819149,
    "bleu2": 0.02390600015967892,
    "bleu3": 0.009814056711295012,
    "bleu4": 0.002976831722971064,
    "bertscore_precision": 0.3488253951072693,
    "bertscore_recall": 0.42226332426071167,
    "bertscore_f1": 0.38204729557037354
  }
}