{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/03/09\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', \"David O'Neill\", 'Nicholas Renton', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox']}\nReview Text: Another great season of mystery and mayhem. Great directing, acting and writing on this show. Love the scenery and characterizations. Love seeing Lewis and Dr. Hobson taking their relationship to the next level, even though it is slow and steady. I hate it when each season ends. I can't get enough of this series.\nReview Title: Great Series\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nGreat writers, producers, director. Excellent cast. Story plot just keeps getting better. Excellent special effects and acting. I'm hooked. One of the best series on television today.\nTop Show on TV\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nThis series is  very well directed and produced. The scenery is fantastic of the English towns and countryside. The acting is superb. The plots are well executed and thought out. Love the character studies and watching how the relationships between the main characters develop over time. Just a great mystery series if you are a mystery buff.\nGreat Whodunit British series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Dan Reed', 'Maurice Phillips', 'Richard Spence', 'Stuart Orme'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nGreat production with fantastic actors and acting. Love the locations and scenery. Plots are well executed. Character studies are well executed and add to the plot's intrigue. Love how everything all weaves together in the end.\nGreat Mystery Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Hettie Macdonald', 'Metin Hüseyin', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whatley', 'Laurence Fox'], 'Studio': ['PBS']}\nI love the Inspector Lewis series and can't get enough of it. It is so well directed and written. The acting is superb, and I love the locale. The way the plot is interwoven with all of the character studies always keeps me guessing who dunnit. Can't wait to see each time how the relationship between Lewis and Laura evolves. Overall, it is just a great entertaining series for mystery buffs.\nFantastic Series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', \"David O'Neill\", 'Nicholas Renton', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox']}\nAnother great season of mystery and mayhem. Great directing, acting and writing on this show. Love the scenery and characterizations. Love seeing Lewis and Dr. Hobson taking their relationship to the next level, even though it is slow and steady. I hate it when each season ends. I can't get enough of this series.\nGreat Series",
  "profile": "**User Summary:**\n\nThis user maintains a strong enthusiasm for high-quality television series, demonstrating a particular fondness for mystery narratives that showcase engaging storytelling, exceptional direction, and powerful performances. Their latest interaction underscores a deep appreciation for series that excel in character development and intricate plotlines, further cementing their focus on production quality. They continue to seek immersive viewing experiences, particularly favoring series produced in English that highlight effective character studies and relationship dynamics.\n\nTheir recent review emphasizes their admiration for a mystery series known for its outstanding directing, impressive acting, and scenic backdrops, indicating a preference for visually rich and character-driven narratives. They express joy in witnessing the gradual development of relationships between key characters, showcasing a desire for nuanced portrayals of interpersonal dynamics. The user’s ratings reflect a consistent dedication to sophisticated storytelling, particularly in dramas and mysteries, with an inclination towards plots that maintain tension and complexity.\n\nOverall, this user's media consumption illustrates a commitment to discerning, high-caliber television experiences, marked by a preference for drama, science fiction, and mystery genres. Their focus remains on series that deliver narrative depth, compelling conclusions, and thorough character explorations, reaffirming their passion for well-crafted, immersive storytelling within the realm of television.",
  "metrics": {
    "rouge1_f": 0.18575851393188852,
    "rouge2_f": 0.027950310559006215,
    "rougeL_f": 0.09907120743034055,
    "meteor": 0.06960390355912743,
    "bleu1": 0.03969206111560782,
    "bleu2": 0.014568510057619482,
    "bleu3": 0.005917642691487315,
    "bleu4": 0.0017853485877889494,
    "bertscore_precision": 0.34362661838531494,
    "bertscore_recall": 0.42304709553718567,
    "bertscore_f1": 0.3792232573032379
  }
}