{
  "interaction_number": 11,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/09/26\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Michael Rymer', 'Guillermo Navarro', 'Vincenzo Natali', 'David Slade', 'Tim Hunter', 'John Dahl', 'Peter Medak', 'James Foley', 'David Semel', 'Marc Jobst'], 'Starring': ['Hugh Dancy', 'Mads Mikkelsen', 'Caroline Dhavernas'], 'Studio': ['Lionsgate']}\nReview Text: Don't know how I missed this series, but so glad I discovered it. Loved Silence of the Lambs and The Red Dragon, so this show has definitely got my interest. Couldn't stop watching it once I started. Pulled an all-nighter to finish the first season. Fantastic actors, writers, directors and producers make this a fantastic show. Loved all of the epicurean creations by Hannibal. Really added something to the show. The struggle between good and evil is a very interesting one to watch evolve.\nReview Title: Emotional Roller Coaster Ride of a show!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Greg Beeman', 'Olatunde Osunsanmi', 'Sergio Mimica-Gezzan', 'Adam Kane', 'Jonathan Frakes', 'David Solomon', 'Holly Dale', 'Frederick E.O. Toye', 'Carl Franklin', 'Anthony Hemingway'], 'Starring': ['Noah Wyle', 'Moon Bloodgood', 'Will Patton'], 'Studio': ['TNT']}\nGreat writers, producers, director. Excellent cast. Story plot just keeps getting better. Excellent special effects and acting. I'm hooked. One of the best series on television today.\nTop Show on TV\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nThis series is  very well directed and produced. The scenery is fantastic of the English towns and countryside. The acting is superb. The plots are well executed and thought out. Love the character studies and watching how the relationships between the main characters develop over time. Just a great mystery series if you are a mystery buff.\nGreat Whodunit British series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Bill Anderson', 'Bille Eltringham', 'Dan Reed', 'Maurice Phillips', 'Richard Spence', 'Stuart Orme'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton', 'Ted Childs'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox'], 'Studio': ['PBS']}\nGreat production with fantastic actors and acting. Love the locations and scenery. Plots are well executed. Character studies are well executed and add to the plot's intrigue. Love how everything all weaves together in the end.\nGreat Mystery Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Charles Palmer', 'Hettie Macdonald', 'Metin Hüseyin', 'Nicholas Renton'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whatley', 'Laurence Fox'], 'Studio': ['PBS']}\nI love the Inspector Lewis series and can't get enough of it. It is so well directed and written. The acting is superb, and I love the locale. The way the plot is interwoven with all of the character studies always keeps me guessing who dunnit. Can't wait to see each time how the relationship between Lewis and Laura evolves. Overall, it is just a great entertaining series for mystery buffs.\nFantastic Series!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', \"David O'Neill\", 'Nicholas Renton', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Clare Holman', 'Kevin Whately', 'Laurence Fox']}\nAnother great season of mystery and mayhem. Great directing, acting and writing on this show. Love the scenery and characterizations. Love seeing Lewis and Dr. Hobson taking their relationship to the next level, even though it is slow and steady. I hate it when each season ends. I can't get enough of this series.\nGreat Series\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brian Kelly', 'Daniel Reed', 'Tim Fywell'], 'Producers': ['Chris Burt', 'Damien Timmer', 'Michele Buck', 'Rebecca Eaton'], 'Starring': ['Charlie Cox', 'Clare Holman', 'Kevin Whately'], 'Studio': ['PBS']}\nFinally! Lewis and Laura are a couple. It was a long time coming, but worth the suspense. This is the last season on my watchlist, but I hope it isn't the end of the series. Will Hathaway really resign? Will Lewis really retire? Too many questions are left unanswered. There has to be more seasons of this great series. I am too hooked for it to be the end. Masterpiece Theater has some of the best shows on TV. I will keep watching in hopes of seeing all my favorites again.\nFantastic Series!!!\n{'Subtitles': ['None available'], 'Directors': ['Logan Thomas'], 'Producers': ['Aric Cushing', 'Logan Thomas'], 'Starring': ['Aric Cushing', 'Juliet Landau', 'Dale Dickey'], 'Studio': ['Ascent Releasing Entertainment']}\nI thought this was a very well directed and suspenseful movie. The acting was good and the locale was a good choice. I wasn't really sure of what was going on until near the end, which was a plus for me.\nThe acting was good and the locale was a good choice\n{'Subtitles': ['None available'], 'Directors': [\"Sloane U'Ren\"], 'Producers': ['Antony Neely', \"Sloane U'Ren\"], 'Starring': ['Henry Lloyd-Hughes', 'Camilla Rutherford', 'Patrick Godfrey'], 'Studio': ['GoDigital']}\nVery well acted and directed time travel film.\nFour Stars\n{'Content advisory': ['Nudity', 'violence', 'frightening scenes', 'substance use', 'alcohol use', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Michael Rymer', 'Guillermo Navarro', 'Vincenzo Natali', 'David Slade', 'Tim Hunter', 'John Dahl', 'Peter Medak', 'James Foley', 'David Semel', 'Marc Jobst']}\nExcellent series! Great writers, directors and actors. Can't get enough of it.\nAddictive Show!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Dan Lerner', 'Christine Moore', 'Kevin Dowling', 'Adam Kane', 'Adam Arkin', 'Daniel Attias', 'Paris Barclay', 'Matt Earl Beesley', 'Allen Coulter', 'Holly Dale'], 'Studio': ['CBS']}\nI have watched this show from the very beginning and I love it. Great writers, directors and actors. Love the story line. Glad Halle Berry decided to give TV a try.\nGreat series!\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Subtitles': ['None available'], 'Directors': ['Michael Rymer', 'Guillermo Navarro', 'Vincenzo Natali', 'David Slade', 'Tim Hunter', 'John Dahl', 'Peter Medak', 'James Foley', 'David Semel', 'Marc Jobst'], 'Starring': ['Hugh Dancy', 'Mads Mikkelsen', 'Caroline Dhavernas'], 'Studio': ['Lionsgate']}\nDon't know how I missed this series, but so glad I discovered it. Loved Silence of the Lambs and The Red Dragon, so this show has definitely got my interest. Couldn't stop watching it once I started. Pulled an all-nighter to finish the first season. Fantastic actors, writers, directors and producers make this a fantastic show. Loved all of the epicurean creations by Hannibal. Really added something to the show. The struggle between good and evil is a very interesting one to watch evolve.\nEmotional Roller Coaster Ride of a show!",
  "profile": "**User Summary:**\n\nThis user has a fervent passion for high-quality television series and suspenseful films, particularly those that feature intricate storytelling and rich mystery. Their recent interaction reveals a newfound appreciation for shows that provide an immersive experience, showcasing exceptional talent in both directing and acting. This user has a refined taste in content that transcends mere entertainment, reflecting their commitment to exploring well-crafted narratives that resonate emotionally and intellectually.\n\nTheir five-star reviews underscore a deep admiration for exemplary writing, direction, and acting, highlighting their willingness to engage with complex moral dilemmas, particularly in content exploring the struggle between good and evil. The user's recent feedback indicates they are particularly captivated by shows that feature strong character development and unique thematic elements, further solidifying their discerning palate.\n\nThe user embraces diverse stories while holding steadfast to their high standards for storytelling, showcasing their dedication to seeking out cinematic and television masterpieces that challenge and intrigue. Their enthusiasm for creators who excel in their craft, combined with a focus on compelling narratives, emphasizes their ongoing journey to discover and celebrate engaging, high-caliber content. Overall, the user's media consumption experience remains enriching and fulfilling, marked by an excitement for series that leave a lasting impact.",
  "metrics": {
    "rouge1_f": 0.13732394366197184,
    "rouge2_f": 0.021164021164021163,
    "rougeL_f": 0.06514084507042253,
    "meteor": 0.03844833975842751,
    "bleu1": 0.0012142995460985332,
    "bleu2": 0.0005218722450409569,
    "bleu3": 0.00026764247945495714,
    "bleu4": 0.00015259438491620417,
    "bertscore_precision": 0.3222592771053314,
    "bertscore_recall": 0.4393133223056793,
    "bertscore_f1": 0.37179064750671387
  }
}