{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: DARKLATER Butterfly Hair Clips for Girls,for Toddler Girls,Baby Girls and Women,Cute Hair Clips,Beautiful Hair Accessories,12 PCS\nReview Date: 2021/08/16\nStore: DARKLATER\nAverage Rating: 4.2\nProduct Details: {'Brand': 'DARKLATER', 'Hair Type': 'All', 'Age Range (Description)': 'Babies', 'Embellishment': 'Glitter', 'Theme': 'Butterfly', 'Package Dimensions': '5 x 3.35 x 0.67 inches; 1.13 Ounces', 'UPC': '750081432770'}\nReview Text: My daughter and I cannot get over how pretty these butterfly hair clips are. My daughter loves to wear all 12 in her hair, at the same time. The clips are soft, like the kind designed for babies and toddlers, so they are not sharp and pokey. They are easy to clip on and take out. They are lightweight and feel comfortable enough to wear all day long. I remove them from my daughter’s hair at bedtime so they don’t get crushed. The butterflies have a simple design. Their bodies and antennas are made from a thick material that has glitter built into it so it never sheds. The wings are made of fabric. Each and every butterfly clip in this set is well made and durable enough to wear frequently. We have gotten many compliments on these hair clips. They work well for teens and adults too. These are a great value for the money.\nReview Title: Gorgeous and comfortable butterfly hair clips.\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Mountain Falls Regular Nail Polish Remover for Natural Nails, with Vitamin E and Panthenol, 6 Fluid Ounce\nMountain Falls\n[\"Don't wait for your next spa day to treat yourself. Mountain Falls Regular Nail Polish Remover has been carefully formulated to quickly and gently care for your nails. The salon quality formula softens cuticles and contains Vitamin E. Our formula is free of Parabens and Phthalates. Try Mountain Falls Regular Nail Polish Remover today.\"]\n{'Brand': 'Mountain Falls', 'Item Form': 'Liquid', 'Material Feature': 'Natural', 'Item Weight': '0.4 Pounds', 'Unit Count': '6 Fl Oz', 'Package Dimensions': '8 x 4 x 2 inches; 6.4 Ounces', 'Manufacturer': 'Vi-Jon'}\nThis nail polish remover works very well. It quickly and completely removes nail polish from fingernails and toenails. It’s nice that they included vitamin E and panthenol in the formula. However, I always wash my hands and feet after using nail polish remover, so I don’t think the added panthenol and vitamin E stay on long enough to provide any significant benefits. This product works well enough to deserve 5 stars, but I detracted a star because of the retail cost. There are more affordable nail polish removers that work just as well as this does. The additions of panthenol and vitamin E do not justify the high retail price.\nWorks quickly and effectively, but is overpriced.\nRevitalizing N.M.F Intensive Hydrating Serum that treats Dull, Tired, Dry and Sensitive Skin from Manilla Natural Skincare\nManilla Natural Skincare\n{'Skin Type': 'mature', 'Product Benefits': 'Hydration', 'Brand': 'Manilla Natural Skincare', 'Material Feature': 'Natural', 'Recommended Uses For Product': 'Hydrating,Wrinkles', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '1.38 x 1.38 x 3.54 inches; 3.99 Ounces'}\nThis serum comes in a thick glass bottle and a convenient dropper that makes it easy to apply. The color looks cloudy so I shake it up before each use. It has a thin and watery gel-like texture that is easy to spread evenly over my face. It absorbs quickly into my skin and does not feel sticky nor uncomfortable. It has a sweet scent that is not overpowering. This serum makes my skin looking and feeling smoother than before.\nAbsorbs quickly and improves the look and feel of skin’s surface.\nDr. Au Anti-Aging Face Oil Retinol Serum by Au Natural Skinfood - Promotes Youthful, Glowing Skin | Collagen Boosting Wrinkle Repair | No Oily Residue - Just Soft to the Touch Skin | Day & Night Moisturizing treatment for Men and Women\nAÚ NATURAL SKINFOOD\n{'Brand': 'AÚ NATURAL SKINFOOD', 'Item Form': 'Oil', 'Number of Items': '1', 'Skin Type': 'Oily', 'Item Volume': '4 Fluid Ounces', 'Product Dimensions': '0.9 x 0.9 x 3.8 inches; 1.59 Ounces'}\nThis face oil makes my skin feel smooth and soft. It applies easily and does not feel too heavy nor greasy. This softens the appearance of the lines on my forehead and around my mouth, making them less pronounced. This has a very light and pleasant scent.\nHydrating face oil for soft and smooth skin.\nFRESHME Mud Mask - Facial Mask Kaolinite Clay Masks Cleansing and Moisturizing Brightening Smoothing Face Mask, 3.4 fl oz\nFRESHME\n{'Brand': 'FRESHME', 'Item Form': 'Clay', 'Product Benefits': 'Moisturizing', 'Skin Type': 'Acne Prone', 'Special Feature': 'Not Tested On Animals', 'Package Dimensions': '5.87 x 1.89 x 1.85 inches; 4.9 Ounces'}\nThis is unlike any clay mask that I have ever used before. This product is water based and does not dry on my skin like most clay masks do. After I apply this to my face and leave it on for about 15 minutes, it still feels moist and slick when I go to rinse it off. The texture of this mask is more gel-like than it is clay. It feels lightweight and does not leave my skin feeling too dry and tight. This mask is effective enough for use during the winter, when my skin tends to be more dry. The product packaging looks attractive, but I wonder if they intentionally misspelled the word “moisturizing” as “moistorizing”.\nWater based mask that does not dry on skin.\nEASYDEW Starter Moist Whip Foam 5.07 fl oz - Non-Drying, Gentle & Purifying Foaming Cleanser with Ceramide I Exfoliating Daily Face Wash that Removes Dirts and Makeup\nEASYDEW\n{'Item Form': 'Cream', 'Skin Type': 'All, Oily to combination skin, Normal to dry skin, Sensitive to acne-prone skin', 'Brand': 'EASYDEW', 'Scent': 'Light floral', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '2.28 x 1.81 x 7.01 inches; 6.74 Ounces', 'Manufacturer': 'Cosmax'}\nThis is one of my favorite facial cleansers. I love how this lathers into a rich and creamy foam. This does an excellent job of cleaning my skin. It completely removes makeup, including mascara. This cleanser leaves my skin looking clean and feeling soft and smooth.\nLuxuriously creamy lather that cleans and removes makeup.\nBalance White Mud Balancing Mask by Au Natural Skinfood | Rotorua Exfoliating Mask with 16+ Manuka Honey | Certified | Food For Your Skin | All Skin Types | Made in New Zealand | 1.7 oz\nAÚ NATURAL SKINFOOD\n{'Brand': 'AÚ NATURAL SKINFOOD', 'Item Form': 'Mask', 'Product Benefits': 'Exfoliates,Hydrates,Exfoliating', 'Scent': 'Honey', 'Skin Type': 'All', 'Product Dimensions': '9.65 x 6.1 x 1.77 inches; 1.7 Ounces'}\nDespite the high price for such a small amount of product you get, this mud mask really does work wonders for my skin. This mask is easy to apply. After spreading this over my entire face, I leave it on for 30 minutes before wiping it off with a wet washcloth. This mask leaves my skin feeling baby soft.\nExpensive, but effectively softens skin.\nHuxley Secret of Sahara Clay Mask Balanced Blend 4.23 fl. oz. | Korean Clay Mask to Refine Pores and Absorb Excess Oil and Sebum | Made with Moroccan Rhassoul Clay\nHuxley\n{'Brand': 'Huxley', 'Item Form': 'Clay', 'Skin Type': 'Sensitive', 'Special Feature': 'Hypoallergenic', 'Unit Count': '4.23 Fl Oz', 'Product Dimensions': '2.68 x 2.68 x 6.97 inches; 6.38 Ounces'}\nThis clay mask is nice because it is sheer enough so that it doesn’t harden and become too stiff and uncomfortable. It is lightly scented with a clean fragrance that smells pleasant when applying this to my face. The directions state to leave on for 5-10 minutes, and then to rinse it off before it is completely dry. I have noticed that if I do leave this mask on long enough for it to completely dry, it develops an unpleasant scent that smells like sulfur  when I go to remove it.\nWorks best when removed before it completely dries.\nILOJE Capsule CC Cream Comfortable Care SPF48 PA++ 1 pack\nILOJE\n{'Brand': 'ILOJE', 'Item Form': 'Cream', 'Unit Count': '1.01 Fl Oz', 'Number of Items': '1', 'Age Range (Description)': 'Adult', 'Product Dimensions': '1.89 x 0.98 x 4.53 inches; 1.69 Ounces'}\nI use this CC cream as my foundation makeup on days when I want to quickly and effortlessly enhance my complexion and blur imperfections. It dispenses from the tube as a gray color, but the formula contains encapsulated pigments that change color on contact with skin. After applying this to my face, the cream takes on a beige shade that blends well with my skin tone. At first, I thought it would be too orange for my fair skin, but the color really does adjust itself. This CC cream provides light coverage. I use a moisturizer under this because it does make my face feel a little dry.\nBlends to match medium to fair skin tones.\nReal Hair Extensions Clip in Human Hair 18'' Clip in Hair Extensions for Women 7pcs Ombre Hair Extensions Human Hair 120g Remy Hair Extensions(4/27)\nPLADIO\n{'Brand': 'PLADIO', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '7.99 x 4.84 x 1.54 inches; 7.37 Ounces'}\nThese hair extensions are lightweight and comfortable enough to wear for an entire day. I have brown hair with blonde highlights. I ordered these in the Ombré Chocolate Brown to Caramel Blonde color. This color matches my hair perfectly. These extensions make my hair look fuller and longer. I like how realistic and natural these look.\nLightweight, comfortable, and doesn’t look fake.\nSpanature Green Tea Hand & Body Lotion Travel Size Selection, 4 Pack, Revitalizing Moisturizer for Rough and Dry Skin, Nourishing and Gentle for All Skin Types, Made In Korea - 75 ml/2.53oz\nSpanature\n{'Brand': 'Spanature', 'Item Form': 'Lotion', 'Active Ingredients': 'Green tea', 'Unit Count': '1.00 Count', 'Number of Items': '4', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.9 x 2.1 x 1.9 inches; 8.8 Ounces'}\nThis bundle includes 4 travel sized hand lotions that come individually gift boxed. This is convenient for adding to gift baskets or as stocking stuffers. I like the generous size of each tube of lotion. The lotion is moisturizing, but not too greasy. This is a high quality lotion that actually softens hands and combats dryness. I like the pleasant scent of this Green Tea hand lotion. The scent is light and fresh, but not too sweet nor strong.\nHigh quality hand lotion that smells good and comes packaged for gifting.\nTraining Head Hairdressing Head Rainbow Synthetic Fiber Hair 24inch Mannequin Cosmetology Manikin Dolls Head for Hairdresser Styling Practicing with Free Clamp + DIY Hair Styling Braid Set\nSENSAIRUITE\n{'Brand': 'SENSAIRUITE', 'Material': 'Synthetic', 'Extension Length': '24 Inches', 'Hair Type': 'Straight', 'Material Feature': 'Natural', 'Package Dimensions': '11.26 x 6.93 x 6.5 inches; 1.83 Pounds'}\nI ordered this styling head so that my daughters, who are ages 6 and 15, and I can learn various hair braiding styles and techniques. This is a good styling head for us to practice on. It is easy to attach to tables and countertops. It stays securely in place without moving or falling off. I ordered this in the fun and vibrant Rainbow color because it looks cool and fits in with the decor in my daughters’ room. This styling head came with a small pack of hair ties and a hair clip. The synthetic hair tangles easily and comes out whenever we brush it. We like the thickness and length of the hair. For amateurs like us, this is a decent styling head to practice new hair styling techniques. I am glad that I got this instead of the styling head doll that my daughter originally wanted. The size, quality, and price of this are much better than the toy versions.\nGood quality and price for anyone learning to braid hair.\nBurt's Bees Baby Bath Time Kit with Ultra Gentle Lotion, Bubble Bath, Foaming Shampoo & Wash, Nourishing Baby Oil, and Face & Hand Cloths\nBurt's Bees\n['Babies deserve a fresh start in life with ingredients from nature that are gentle for their delicate skin. Experience our most popular natural Burts Bees Baby products together in one. Our gentle, effective and natural baby products cleanse, soften and help moisturize babys precious skin safely and naturally. Its easy to make bath time fun with the mild, tear-free bubble bath, then simply cleanse with the foaming 2-in-1 baby shampoo and body wash. Finish by moisturizing with ultra gentle lotion and nourishing baby oil to keep skin soft and fresh. A pack of face and hand cloths is handy for on-the-go cleansing. These baby care essentials are pediatrician tested, gentle enough to use every day and formulated without parabens, phthalates, SLS, petrolatum or synthetic fragrances, so you can feel good about caring for babys delicate skin. This new baby gift basket is a sweet gift for any baby shower occasion.']\n{'Item Form': 'Lotion', 'Skin Type': 'All', 'Brand': \"Burt's Bees\", 'Scent': 'See Individual Packaging', 'Material Feature': 'Cruelty Free', 'Product Dimensions': '11.5 x 6.44 x 3.19 inches; 3.13 Pounds', 'Item model number': 'TU_33789', 'UPC': '792850911796', 'Manufacturer': 'AmazonUs/BURBP'}\nI like the natural ingredients in all of the products included in this baby bath time kit. This gender neutral bath set would make an ideal and appreciated gift for any baby shower. The products are all hypoallergenic and gentle on delicate skin. Not only is this great for babies, but mothers can use it too. I especially like the nourishing baby oil because it is moisturizing and helps to relieve itchiness and improve the appearance of stretch marks.\nGender neutral skin care set that is suitable for moms and babies.\nINH Hi-Lites Rose Gold | Colored Hair Extensions Vegan Clip In Pink Hair Extensions For Women - 2 pieces, 20 inch\nINH\n{'Brand': 'INH', 'Material': 'Synthetic', 'Extension Length': '20 Inches', 'Hair Type': 'Color Treated', 'Material Feature': 'Vegan', 'Package Dimensions': '9.33 x 7.44 x 0.31 inches; 2.4 Ounces', 'UPC': '810073150232'}\nThese hair extensions are overpriced at $18 for only two strands. The quality of the hair is decent. The hair is soft and silky. These clip in quickly and easily. They are a convenient way to add instant fun and glamour to any hairstyle, but without the expense and commitment of actually bleaching and coloring your hair.\nDecent quality, but overpriced.\nDARKLATER Butterfly Hair Clips for Girls,for Toddler Girls,Baby Girls and Women,Cute Hair Clips,Beautiful Hair Accessories,12 PCS\nDARKLATER\n{'Brand': 'DARKLATER', 'Hair Type': 'All', 'Age Range (Description)': 'Babies', 'Embellishment': 'Glitter', 'Theme': 'Butterfly', 'Package Dimensions': '5 x 3.35 x 0.67 inches; 1.13 Ounces', 'UPC': '750081432770'}\nMy daughter and I cannot get over how pretty these butterfly hair clips are. My daughter loves to wear all 12 in her hair, at the same time. The clips are soft, like the kind designed for babies and toddlers, so they are not sharp and pokey. They are easy to clip on and take out. They are lightweight and feel comfortable enough to wear all day long. I remove them from my daughter’s hair at bedtime so they don’t get crushed. The butterflies have a simple design. Their bodies and antennas are made from a thick material that has glitter built into it so it never sheds. The wings are made of fabric. Each and every butterfly clip in this set is well made and durable enough to wear frequently. We have gotten many compliments on these hair clips. They work well for teens and adults too. These are a great value for the money.\nGorgeous and comfortable butterfly hair clips.",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Effectiveness:** The user values efficient solutions in beauty products, emphasizing effectiveness in their recent purchase. Their choice indicates a growing interest in playful and versatile hair accessories, reflecting a willingness to experiment with styles while maintaining a focus on practicality.\n\n- **Ingredient & Material Awareness:** The user's commitment to product quality and ethical formulations remains strong, with a preference for safe and gentle options. They continue to favor products that align with their values, highlighting their awareness of material quality.\n\n- **Cost Sensitivity:** Price awareness is significant in their purchasing decisions. The user appreciates value for money, demonstrated by their assessment of quality versus cost, favoring items that deliver both performance and convenience.\n\n- **Quality vs. Price:** The user strives to balance quality and affordability, indicating a readiness to invest in products that provide instant benefits and ease of use. Their purchasing behavior suggests they carefully evaluate the overall value of each item.\n\n- **Routine-Oriented:** The user’s choices reflect a focus on seamlessly integrating products into their established routines. They enjoy enhancing personal style while ensuring that these products are accessible for family engagement in beauty practices.\n\nOverall, the user expresses evolving preferences towards high-quality, functional beauty items that enhance personal experiences, maintaining a strong emphasis on ethical considerations, product transparency, and reliable performance.",
  "metrics": {
    "rouge1_f": 0.08893956670467502,
    "rouge2_f": 0.0076074553062000765,
    "rougeL_f": 0.04637020144431775,
    "meteor": 0.030316392900451992,
    "bleu1": 2.4220241293507336e-05,
    "bleu2": 8.371957530331256e-06,
    "bleu3": 1.1071509173931358e-06,
    "bleu4": 4.029894781000247e-07,
    "bertscore_precision": 0.37416940927505493,
    "bertscore_recall": 0.5065350532531738,
    "bertscore_f1": 0.43040528893470764
  }
}