{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: 2PCS Wine Red&Black mixed Brown 14''Short Curly Bob Wig with Air Bangs for Women Shoulder Length Wavy Wigs Synthetic Heat Resistant Fiber Hair Medium Length Glueless Wig for Daily Wear\nReview Date: 2021/06/15\nStore: OSWINMART\nAverage Rating: 3.7\nProduct Details: {'Material': 'Synthetic', 'Item Dimensions LxWxH': '14 x 9.5 x 8.5 inches', 'Hair Type': 'Curly', 'Special Feature': 'Glueless', 'Brand': 'OSWINMART', 'Product Dimensions': '14 x 9.5 x 8.5 inches; 1.08 Pounds', 'UPC': '732043538942'}\nReview Text: I like the darker one a lot. The lengths for both wigs are good, and the bangs work pretty well. Although I prefer the darker one, other people have commented that they like the reddish one better. So both work well and look good on. The darker one is super close to my real style on a good hair day, just with added bangs, so I am sure I will get a lot of use out of it.\nReview Title: Both are Great!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "AuroTrends Makeup Remover Towel,2 Pack Reusable Chemical-free Microfiber Makeup Remover Cloths,Magically and Gently Wipe Away Cosmetics,Sunscreen,Oil and Dirt,Set of 2 (Pink+Black)\nAuroTrends\n{'Brand': 'AuroTrends', 'Skin Type': 'All', 'Material Feature': 'Reusable', 'Unit Count': '2.0 Count', 'Number of Items': '2', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.52 x 2.72 x 1.42 inches; 6.4 Ounces'}\nThese are really soft. Also, even when they are soaking wet, they don't feel drippy. I am weird about having water on/in my face, and these cloths allow me to wash my face without triggering an odd anxious feeling. I really like these cloths and always keep one on hand.\nReally Soft\nTELETIES - Spiral Hair Coils - Ponytail Holder Hair Ties for Women - Phone Cord Hair Ties - Strong Grip, No Rip, Water Resistant, No Crease Hair Tie Coils - 3 pack (Large, Maliblu)\nTeleties\n{'Material': 'Fabric', 'Item Form': 'Spiral', 'Brand': 'Teleties', 'Hair Type': 'Curly', 'Number of Pieces': '3', 'Package Dimensions': '3 x 3 x 1.2 inches; 2.08 Ounces', 'UPC': '711841892807'}\nI love telephone cord style hair ties. They gather all of my hair into a ponytail or bun easily and, best of all, they don't give me headaches like more traditional hair elastics. These are a pretty combination of aqua blue and white, and they are very sturdy.\nNo Headaches\nRAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nRAREKIND\n{'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nEh. The color is bit more orange-y than I’d hoped for by the photo. It’s really thick. It doesn’t stay put or feel great on. I might try mixing it with some gloss if I liked the color more.\nNot thrilled\nReusable Cotton Swab Portable Silicone Swab Washable Cotton Swabs for Ear Cleaning Beauty Treatment Makeup Cotton Swab\nJAOYU\n{'Product Dimensions': '3.2 x 3.2 x 0.39 inches', 'UPC': '739232135913'}\nI was skeptical. I am autistic, and I hate the feel of water in my ears, so I use cotton swabs to dry my ears after a shower. This adds up to a lot of swabs and I felt guilty about putting that many into the trash when I could make a tiny difference environmentally. I didn't really think the silicone option would work. The cotton soaks up the water. But the little knobby end actually does pull the water out of my ear canal.<br /><br />The case is fine. I feel like the rubber bit that holds it together will eventually break. It is just flimsy. But, for now, it does its job. I ordered the blue, and it is a pretty dull blue, but the swab works, so whatever.\nIt Works\nKISSIO Lipstick Set,4Pcs Cigarette Matte Lipstick Set,Red Matte Pigmentation Lipstick,Long Lasting Waterproof Lipstick for women\nKISSIO\n{'Brand': 'KISSIO', 'Skin Type': 'All', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Product Benefits': 'Long Lasting,Cleansing,Moisturizing,Long-lasting,Makeup', 'Package Dimensions': '10.79 x 8.27 x 0.47 inches; 2.01 Ounces'}\nThese are fine. They don't stay very well though, and they make my lips a bit dry, so I still end up adding a lip balm over top, and that sort of ruins the matte finish. The color is good. I like the size of the container as well, like a lip balm.\nNice Colors\nLong Curly Wig for Women Black Long Wavy Wigs with Bangs Synthetic Replacement Wig Heat Resistant Natural Looking for Daily Party Cosplay (Black)\nGUDEMAY\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'GUDEMAY', 'Package Dimensions': '10.98 x 9.96 x 2.32 inches; 10.86 Ounces', 'UPC': '779880641428'}\n[[VIDEOID:da59496c84540ec5e1ead467d50fa820]] I adore this wig.<br /><br />So, it isn't black. It is brown. Or else, they accidentally sent me the brown version. Regardless, I love how it looks on. The hair doesn't have that super-shiny fake look of plastic. It falls nicely. I will post a photo.\nPretty!\n2PCS Wine Red&Black mixed Brown 14''Short Curly Bob Wig with Air Bangs for Women Shoulder Length Wavy Wigs Synthetic Heat Resistant Fiber Hair Medium Length Glueless Wig for Daily Wear\nOSWINMART\n{'Material': 'Synthetic', 'Item Dimensions LxWxH': '14 x 9.5 x 8.5 inches', 'Hair Type': 'Curly', 'Special Feature': 'Glueless', 'Brand': 'OSWINMART', 'Product Dimensions': '14 x 9.5 x 8.5 inches; 1.08 Pounds', 'UPC': '732043538942'}\nI like the darker one a lot. The lengths for both wigs are good, and the bangs work pretty well. Although I prefer the darker one, other people have commented that they like the reddish one better. So both work well and look good on. The darker one is super close to my real style on a good hair day, just with added bangs, so I am sure I will get a lot of use out of it.\nBoth are Great!",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user has expanded their interest in eco-friendly skincare and hair accessories to include stylish hairpieces, emphasizing the desire for aesthetic appeal combined with innovative, high-quality materials. Recent purchases reflect a critical eye for authenticity and visual impact.\n\n- **Material Preference:** The user continues to appreciate soft, high-quality materials, now embracing synthetic options that provide a natural feel. They exhibit a willingness to experiment with various textures, balancing quality and durability, especially within cosmetics.\n\n- **Skin Sensitivity:** Sensitivity to water and discomfort in ear care still significantly influence their choice of products. Their mixed experiences with cosmetics lead them to prioritize compatibility and performance for enhanced comfort.\n\n- **Functionality:** Practicality and effectiveness remain vital. The latest interaction underscores the user’s focus on both functionality and aesthetic appeal in hair accessories, with ongoing evaluation of performance for long-lasting satisfaction.\n\n- **Consistency in Purchasing:** The user persists in seeking reusable and practical solutions, with an evolving standard for aesthetics that values both visual appeal and reliability in hairpieces.\n\n- **Overall Satisfaction:** The user rates products based on comfort and practicality, showcasing a discerning approach to quality. Their commitment to enhancing their beauty routine emphasizes the balance of reliability, effectiveness, and visual charm, guided by principles of comfort, functionality, and environmental responsibility.",
  "metrics": {
    "rouge1_f": 0.15151515151515152,
    "rouge2_f": 0.0037950664136622396,
    "rougeL_f": 0.06628787878787878,
    "meteor": 0.06754331256374412,
    "bleu1": 0.01966478614924206,
    "bleu2": 0.004405109856441201,
    "bleu3": 0.0007270754424489032,
    "bleu4": 0.0002956548037148873,
    "bertscore_precision": 0.36867132782936096,
    "bertscore_recall": 0.4605250358581543,
    "bertscore_f1": 0.40951067209243774
  }
}