{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Long Curly Wig for Women Black Long Wavy Wigs with Bangs Synthetic Replacement Wig Heat Resistant Natural Looking for Daily Party Cosplay (Black)\nReview Date: 2021/03/31\nStore: GUDEMAY\nAverage Rating: 2.9\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'GUDEMAY', 'Package Dimensions': '10.98 x 9.96 x 2.32 inches; 10.86 Ounces', 'UPC': '779880641428'}\nReview Text: [[VIDEOID:da59496c84540ec5e1ead467d50fa820]] I adore this wig.<br /><br />So, it isn't black. It is brown. Or else, they accidentally sent me the brown version. Regardless, I love how it looks on. The hair doesn't have that super-shiny fake look of plastic. It falls nicely. I will post a photo.\nReview Title: Pretty!\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "AuroTrends Makeup Remover Towel,2 Pack Reusable Chemical-free Microfiber Makeup Remover Cloths,Magically and Gently Wipe Away Cosmetics,Sunscreen,Oil and Dirt,Set of 2 (Pink+Black)\nAuroTrends\n{'Brand': 'AuroTrends', 'Skin Type': 'All', 'Material Feature': 'Reusable', 'Unit Count': '2.0 Count', 'Number of Items': '2', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.52 x 2.72 x 1.42 inches; 6.4 Ounces'}\nThese are really soft. Also, even when they are soaking wet, they don't feel drippy. I am weird about having water on/in my face, and these cloths allow me to wash my face without triggering an odd anxious feeling. I really like these cloths and always keep one on hand.\nReally Soft\nTELETIES - Spiral Hair Coils - Ponytail Holder Hair Ties for Women - Phone Cord Hair Ties - Strong Grip, No Rip, Water Resistant, No Crease Hair Tie Coils - 3 pack (Large, Maliblu)\nTeleties\n{'Material': 'Fabric', 'Item Form': 'Spiral', 'Brand': 'Teleties', 'Hair Type': 'Curly', 'Number of Pieces': '3', 'Package Dimensions': '3 x 3 x 1.2 inches; 2.08 Ounces', 'UPC': '711841892807'}\nI love telephone cord style hair ties. They gather all of my hair into a ponytail or bun easily and, best of all, they don't give me headaches like more traditional hair elastics. These are a pretty combination of aqua blue and white, and they are very sturdy.\nNo Headaches\nRAREKIND Fade Matte Lipstick by Amorepacific - 10 Colors, Cruelty-Free Nourishing Lip Stick, Velvety-smooth, Long-Lasting Moisturizing Lipstick - 3.2g Maple Road\nRAREKIND\n{'Package Dimensions': '3.3 x 0.9 x 0.9 inches; 0.95 Ounces'}\nEh. The color is bit more orange-y than I’d hoped for by the photo. It’s really thick. It doesn’t stay put or feel great on. I might try mixing it with some gloss if I liked the color more.\nNot thrilled\nReusable Cotton Swab Portable Silicone Swab Washable Cotton Swabs for Ear Cleaning Beauty Treatment Makeup Cotton Swab\nJAOYU\n{'Product Dimensions': '3.2 x 3.2 x 0.39 inches', 'UPC': '739232135913'}\nI was skeptical. I am autistic, and I hate the feel of water in my ears, so I use cotton swabs to dry my ears after a shower. This adds up to a lot of swabs and I felt guilty about putting that many into the trash when I could make a tiny difference environmentally. I didn't really think the silicone option would work. The cotton soaks up the water. But the little knobby end actually does pull the water out of my ear canal.<br /><br />The case is fine. I feel like the rubber bit that holds it together will eventually break. It is just flimsy. But, for now, it does its job. I ordered the blue, and it is a pretty dull blue, but the swab works, so whatever.\nIt Works\nKISSIO Lipstick Set,4Pcs Cigarette Matte Lipstick Set,Red Matte Pigmentation Lipstick,Long Lasting Waterproof Lipstick for women\nKISSIO\n{'Brand': 'KISSIO', 'Skin Type': 'All', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Product Benefits': 'Long Lasting,Cleansing,Moisturizing,Long-lasting,Makeup', 'Package Dimensions': '10.79 x 8.27 x 0.47 inches; 2.01 Ounces'}\nThese are fine. They don't stay very well though, and they make my lips a bit dry, so I still end up adding a lip balm over top, and that sort of ruins the matte finish. The color is good. I like the size of the container as well, like a lip balm.\nNice Colors\nLong Curly Wig for Women Black Long Wavy Wigs with Bangs Synthetic Replacement Wig Heat Resistant Natural Looking for Daily Party Cosplay (Black)\nGUDEMAY\n{'Material': 'Synthetic', 'Hair Type': 'Curly', 'Style': 'Modern', 'Special Feature': 'Glueless', 'Brand': 'GUDEMAY', 'Package Dimensions': '10.98 x 9.96 x 2.32 inches; 10.86 Ounces', 'UPC': '779880641428'}\n[[VIDEOID:da59496c84540ec5e1ead467d50fa820]] I adore this wig.<br /><br />So, it isn't black. It is brown. Or else, they accidentally sent me the brown version. Regardless, I love how it looks on. The hair doesn't have that super-shiny fake look of plastic. It falls nicely. I will post a photo.\nPretty!",
  "profile": "**Updated User Profile Summary:**\n\n- **Product Preference:** The user continues to favor reusable, eco-friendly skincare and hair accessory solutions while exploring cosmetics, now demonstrating an interest in hairpieces. Their latest experience reflects a desire for aesthetic appeal paired with innovative, high-quality materials, highlighting a critical eye for authenticity in product appearance.\n\n- **Material Preference:** The user has shown a preference for soft, high-quality materials, now extending this appreciation to synthetic alternatives that feel more natural and manageable. Despite concerns about durability in cosmetics, their recent purchase indicates a willingness to experiment with different textures.\n\n- **Skin Sensitivity:** The user's sensitivity to water and discomfort in ear care still influences their choices, driving them to seek products that enhance comfort. Their mixed experiences with cosmetics suggest a careful evaluation of performance to ensure compatibility.\n\n- **Functionality:** Practicality and effectiveness remain paramount. The recent interaction emphasizes a balanced approach to functionality and aesthetic in hair accessories, alongside ongoing scrutiny of product performance for long-lasting satisfaction.\n\n- **Consistency in Purchasing:** The user maintains a consistent trend towards reusable and practical solutions. Their interest in hairpieces signifies an evolving aesthetic standard that seeks both visual appeal and reliability.\n\n- **Overall Satisfaction:** The user is likely to rate products based on their alignment with comfort and practicality. They show a discerning approach to quality, reflecting a commitment to enhancing their beauty routine with reliable, effective, and visually appealing solutions. Overall, comfort, functionality, and environmental responsibility continue to guide their preferences.",
  "metrics": {
    "rouge1_f": 0.160427807486631,
    "rouge2_f": 0.0021436227224008574,
    "rougeL_f": 0.0748663101604278,
    "meteor": 0.0755952380952381,
    "bleu1": 0.04555433459438634,
    "bleu2": 0.009362714528179824,
    "bleu3": 0.0016173720107953646,
    "bleu4": 0.0006727725001091392,
    "bertscore_precision": 0.3750423789024353,
    "bertscore_recall": 0.4576387107372284,
    "bertscore_f1": 0.4122440814971924
  }
}