{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Abbott and Costello Meet the Monsters Collection [DVD]\nReview Date: 2021/12/20\nStore: Bud Abbott  (Actor),     Lou Costello  (Actor),     Charles Lamont  (Director),     Charles Barton  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Comedy\nProduct Description: [\"Comedy meets horror when the screen's funniest duo, Bud Abbott and Lou Costello, encounter Universal's classic monsters in the Abbott and Costello Meet the Monsters Collection. In 1948, Universal Pictures paired its most popular comedy team with its hugely successful monsters launching an entirely new genre. These four outrageously funny films find Bud and Lou meeting Dracula, Frankenstein, the Wolf Man, the Invisible Man, Dr. Jekyll and Mr. Hyde and the Mummy. Co-starring horror legends Bela Lugosi, Boris Karloff and Lon Chaney Jr., this timeless collection continues to scare up laughs for audiences of all ages!\", 'Bonus Content:', 'Disc 1 - Abbott and Costello Meet Frankenstein:', 'Abbott & Costello Meet the Monsters', 'Abbott & Costello Meet the Monsters', 'Feature Commentary with Film Historian Gregory W. Mank', 'Feature Commentary with Film Historian Gregory W. Mank', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 1 - Abbott and Costello Meet the Invisible Man:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - Abbott and Costello Meet Dr. Jekyll and Mr. Hyde:', 'Feature Commentary with Film Historians Tom Weaver and Richard Scrivani', 'Feature Commentary with Film Historians Tom Weaver and Richard Scrivani', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - Abbott and Costello Meet the Mummy:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Comedy', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': 'John Grant, Charles Bradstreet, Robert Lees, Charles Lamont, Bud Abbott, Lon Chaney, Jr., Nancy Guild, Jane Randolph, Lou Costello, Frederic I. Rinaldo, Michael Ansara, Boris Karloff, Marie Windsor, Robert Arthur, Bela Lugosi, Glenn Strange, Lenore Aubert, Adele Jergens, William Frawley, Charles Barton, Frank Ferguson, Peggy King, Sheldon Leonard, Howard ChristieJohn Grant, Charles Bradstreet, Robert Lees, Charles Lamont, Bud Abbott, Lon Chaney, Jr., Nancy Guild, Jane Randolph, Lou Costello, Frederic I. Rinaldo, Michael Ansara, Boris Karloff, Marie Windsor, Robert Arthur, Bela Lugosi, Glenn Strange, Lenore Aubert, Adele Jergens,…  See more', 'Language': 'English (Dolby Digital 2.0)', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '34272126', 'Director': 'Charles Lamont, Charles Barton', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '5 hours and 23 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Bud Abbott, Lou Costello, Lon Chaney, Jr., Nancy Guild, Boris Karloff', 'Subtitles': 'Spanish, French', 'Producers': 'Howard Christie, Robert Arthur', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Grant, Robert Lees, Frederic I. Rinaldo', 'Country of Origin': 'USA', 'Number of discs': '2'}\nReview Text: I enjoyed these movies as much as I did when I was a kid. They are hilarious.\nReview Title: Abbott and Costello are timeless\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "A Charlie Brown Christmas 50th Anniversay Deluxe Edition (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n[\"Christmastime is here. Happiness and cheer. And for Peanuts fans everywhere, it just wouldn't be Christmas without this classic holiday delight. Christmas lights may be twinkling red and green, but Charlie Brown has the Yuletide blues. To get in the holiday spirit, he takes Lucy's advice and directs the Christmas play. And what's a Christmas play without a Christmas tree? But everyone makes fun of the short, spindly nevergreen Charlie Brown brings back - until the real meaning of Christmas works its magic once again.\", 'CHARLIE BROWN: Spruce up your Christmas cheer this year as Charlie takes on the spirit of Christmas in hopes to find the real magic of the season once again.', 'CHARLIE BROWN: Spruce up your Christmas cheer this year as Charlie takes on the spirit of Christmas in hopes to find the real magic of the season once again.', 'KEEPSAKE: It is the first TV special based on the comic strip Peanuts, by Charles M. Shultz. It has been honored with an Emmy and a Peabody Award and has become an annual tradition in the United States.', 'KEEPSAKE: It is the first TV special based on the comic strip Peanuts, by Charles M. Shultz. It has been honored with an Emmy and a Peabody Award and has become an annual tradition in the United States.', 'DELUXE ADDITION: This deluxe edition features It’s Christmastime Again, Charlie Brown. It also includes A Christmas Miracle: The Making of a Charlie Brown Christmas.', 'DELUXE ADDITION: This deluxe edition features It’s Christmastime Again, Charlie Brown. It also includes A Christmas Miracle: The Making of a Charlie Brown Christmas.', 'OFFICIALLY LICENSED: This Classic Charlie Brown story is officially licensed by Peanuts and is 100% authentic.', 'OFFICIALLY LICENSED: This Classic Charlie Brown story is officially licensed by Peanuts and is 100% authentic.', 'GIFTABLE: Gift this Anniversary Deluxe DVD for new generations and even older ones as the perfect stocking stuffer.', 'GIFTABLE: Gift this Anniversary Deluxe DVD for new generations and even older ones as the perfect stocking stuffer.']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Various', 'Initial release date': '2014-12-02', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000404554DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '25 minutes', 'Release date': 'December 2, 2014', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA favorite childhood memory. There’s nothing I don’t like about the movie.\nA precious Christmas tradition.\nUltimate Disaster Pack (Earthquake / Airport / The Hindenburg / Rollercoaster) [DVD]\nBurt Lancaster  (Actor),     Charlton Heston  (Actor),     James Goldstone  (Director),     Mark Robson  (Director, Producer)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Danger, destruction and mayhem…the Ultimate Disaster Pack features four blockbuster films filled with natural and manmade catastrophes that will blow you away. The pulse pounding action begins with Earthquake, an Academy Award-winning film about heroes rising after a catastrophic earthquake levels Los Angeles. The suspense continues with the original Airport, nominated for 10 Academy Awards including Best Picture, which launched the popular 1970s disaster film genre and became a box office smash. One of aviation's most infamous events in history is brought back to life in The Hindenburg, a gripping suspense thriller that reveals the intricate plots behind the historic airship disaster of 1937. Unexpected twists and turns await in Rollercoaster when a determined terrorist targets America's most popular attraction, and its riders, for senseless destruction. Featuring all-star casts that include Charlton Heston, Burt Lancaster, Dean Martin, George C. Scott, George Segal and many more, the Ultimate Disaster Pack will pull you in and never let you go!\"]\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseDrama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Dana Wynter, George Segal, George Fox, Jean Seberg, Dorothy Spencer, Gary Collins, Ava Gardner, Ronald Pierce, Ernest Laszlo, William Atherton, David Moriarty, Rene Auberjonois, Van Heflin, Peter Berkos, Stuart Gilmore, Roy Thinnes, George Kennedy, Don K. Sharpless, Gig Young, John A. Bolger, Jr., Burgess Meredith, George Seaton, Mario Puzo, Charlton Heston, Lorne Greene, Ross Hunter, Philip Lathrop, Melvin Metcalfe, Sr., Richard Roundtree, Robert Surtees, Leonard Peterson, Barbara Hale, Charles Durning, Edith Head, Nelson Gidding, Anne Bancroft, Barry Sullivan, Jacqueline Bisset, Richard Dysart, Genevieve Bujold, Burt Lancaster, John Mack, Richard Widmark, Victoria Principal, Robert Wise, James Goldstone, Helen Hayes, Dean Martin, Timothy Bottoms, Katherine Helmond, Henry Fonda, Barry Nelson, George C. Scott, Marjoe Gortner, Mark Robson, Lloyd Nolan, Maureen StapletonDana Wynter, George Segal, George Fox, Jean Seberg, Dorothy Spencer, Gary Collins, Ava Gardner, Ronald Pierce, Ernest Laszlo, William Atherton, David Moriarty, Rene Auberjonois, Van Heflin, Peter Berkos, Stuart Gilmore, Roy Thinnes, George Kennedy, Don K. Sharpless,…  See more', 'Initial release date': '2016-05-03', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'James Goldstone, Mark Robson, Robert Wise, George Seaton', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '8 hours and 25 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Burt Lancaster, Charlton Heston, George C. Scott, George Segal, Dean Martin', 'Subtitles': 'French', 'Producers': 'Mark Robson, Robert Wise, Ross Hunter', 'Studio': 'Studio Distribution Services', 'Writers': 'George Fox, Nelson Gidding, Mario Puzo, George Seaton', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI’m a disaster film collector.  I was pleased with this collection.\nIf you love disaster films this is a good collection to have. Great value at good price.\nA Night to Remember (The Criterion Collection) [DVD]\nKenneth More  (Actor),     Honor Blackman  (Actor),     Roy Ward Baker  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Criterion Collection, All\n['On April 14, 1912, just before midnight, the unsinkable Titanic struck an iceberg. In less than three hours, it had plunged to the bottom of the sea, taking with it more than 1,500 of its 2,200 passengers. In his unforgettable rendering of Walter Lord’s book of the same name,', 'A Night to Remember', ', the acclaimed British director Roy Ward Baker (', 'Don’t Bother to Knock', ') depicts with sensitivity, awe, and a fine sense of tragedy the ship’s final hours. Featuring remarkably restrained performances,', 'A Night to Remember', 'is cinema’s subtlest, finest dramatization of this monumental twentieth-century catastrophe.']\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'Multiple Formats, Black & White, NTSC, Subtitled, Widescreen', 'Contributor': 'Roy Ward Baker, Kenneth More, David McCallum, Tucker McGuire, Honor Blackman, Michael Goodliffe', 'Language': 'English', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'CRRN2134DVD', 'Director': 'Roy Ward Baker', 'Media Format': 'Multiple Formats, Black & White, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'March 27, 2012', 'Actors': 'Kenneth More, Honor Blackman, Michael Goodliffe, David McCallum, Tucker McGuire', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis version is the most historically accurate version out. Except for the actual sinking. We all know that the ship broke in half. But in 1958 they didn’t know that. I strongly recommend the 2 dvd special edition. It has an interview with Eva Hart, a Titanic survivor.  Very interesting.\nI strongly recommend the 2 dvd special edition\nThe Poseidon Adventure\nGene Hackman  (Actor),     Ernest Borgnine  (Actor),     Irwin Allen  (Director),     Ronald Neame  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"A clergyman leads survivors of a capsized luxury liner through the ship's innards to its highest point. Directed by Ronald Neame.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Special Edition, Widescreen', 'Contributor': \"Pamela Sue Martin, Red Buttons, Paul Gallico, Eric Shea, Ernest Borgnine, Arthur O'Connell, Fred Sadoff, Wendell Mayes, Jack Albertson, Gene Hackman, Shelley Winters, Stella Stevens, Roddy McDowall, Carol Lynley, Irwin Allen, Ronald Neame, Stirling SilliphantPamela Sue Martin, Red Buttons, Paul Gallico, Eric Shea, Ernest Borgnine, Arthur O'Connell, Fred Sadoff, Wendell Mayes, Jack Albertson, Gene Hackman, Shelley Winters, Stella Stevens, Roddy McDowall, Carol Lynley, Irwin Allen, Ronald Neame, Stirling Silliphant  See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 1.0), Spanish (Dolby Digital 1.0)', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2233166DVD', 'Director': 'Irwin Allen, Ronald Neame', 'Media Format': 'Multiple Formats, Color, NTSC, Special Edition, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'May 9, 2006', 'Actors': 'Gene Hackman, Ernest Borgnine, Shelley Winters, Red Buttons, Carol Lynley', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Paul Gallico, Stirling Silliphant, Wendell Mayes', 'Number of discs': '2'}\nI remember watching this when it came out in the 70’s. For disaster flick fans, I certainly recommend it.\nI certainly recommend it.\nThe Towering Inferno [DVD]\nPaul Newman  (Actor),     Steve McQueen  (Actor),     Irwin Allen  (Director),     John Guillermin  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n['Product description', 'The Towering Inferno', 'Amazon.com', \"Disaster movies used to work because there was little certainty as to who would survive. Not so in this film, really an amalgam of two original stories, about a group of well-to-do celebrants at the top floor of a skyscraper. Cheapo electrical wiring and bad construction management cause an enormous blaze at the lower floors, steadily rising to consume the revelers. Newman's an architect, McQueen a firefighter, and Fred Astaire a kind old gentleman, for which he was Oscar-nominated. O.J. Simpson plays a security guard who rescues a cat. Now that's a disaster.\", '--Keith Simanton']\n{'Genre': 'Action / adventure', 'Format': 'Closed-captioned, Color, DVD, AC-3, Widescreen, NTSC, THX, Letterboxed', 'Contributor': 'Fred Astaire, O.J. Simpson, Susan Blakely, Susan Flannery, Thomas N. Scortia, Steve McQueen, Paul Newman, William Holden, John Guillermin, Faye Dunaway, Richard Chamberlain, Jennifer Jones, Robert Wagner, Irwin Allen, Richard Martin Stern, Stirling Silliphant, Robert Vaughn, Frank M. RobinsonFred Astaire, O.J. Simpson, Susan Blakely, Susan Flannery, Thomas N. Scortia, Steve McQueen, Paul Newman, William Holden, John Guillermin, Faye Dunaway, Richard Chamberlain, Jennifer Jones, Robert Wagner, Irwin Allen, Richard Martin Stern, Stirling Silli…  See more', 'Language': 'English (Dolby Digital 2.0 Surround), English (Dolby Digital 5.1)', 'Runtime': '2 hours and 45 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.4 Ounces', 'Director': 'Irwin Allen, John Guillermin', 'Media Format': 'Closed-captioned, Color, DVD, AC-3, Widescreen, NTSC, THX, Letterboxed', 'Run time': '2 hours and 45 minutes', 'Release date': 'April 15, 2003', 'Actors': 'Paul Newman, Steve McQueen, William Holden, Faye Dunaway, Fred Astaire', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Frank M. Robinson, Richard Martin Stern, Stirling Silliphant, Thomas N. Scortia', 'Number of discs': '1'}\nHighly recommend for disaster film fans. To have been made in the 70’s, the special effects are pretty good. Good story line.\nHighly recommend for disaster film fans\nFollow Me, Boys!\nFred MacMurray  (Actor),     Vera Miles  (Actor),     Norman Tokar  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['After one year too many on the road with a ramshackle jazz band, Lem Siddons (Fred MacMurray) decides to put down roots. He marries sweetheart Vida Downey (Vera Miles) and embarks on a lifelong roller-coaster ride as a scoutmaster to a steady stream of high-spirited youngsters. Set against lovingly recreated scenes of 1930s America, this family classic shines with all the warmth and humor of Disney entertainment at its nostalgic best.|The movie marks Kurt Russell\\'s Disney film debut, as Whitey.|Variety wrote, \"The production catches the spirit of rural America in the \\'30s with moving charm, blending comedy, drama, and romance in a buildup toward an emotionally charged climax.\"']\n{'Genre': 'ACTION, Comedy, LIVE', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Contributor': 'Norman Tokar, Luana Patten, Lillian Gish, Madge Blake, Fred MacMurray, David Bailey, Vera Miles, Bill Booth, Elliot Reid, Louis Pelletier, Johnny Bangert, Kurt Russell, Ken Murray, Tol Avery, Charles Ruggles, Richard BakalyanNorman Tokar, Luana Patten, Lillian Gish, Madge Blake, Fred MacMurray, David Bailey, Vera Miles, Bill Booth, Elliot Reid, Louis Pelletier, Johnny Bangert, Kurt Russell, Ken Murray, Tol Avery, Charles Ruggles, Richard Bakalyan  See more', 'Language': 'Unqualified, English (Dolby Digital 2.0 Mono)', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.71 Ounces', 'Item model number': '3357900', 'Director': 'Norman Tokar', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Subtitled', 'Run time': '2 hours and 13 minutes', 'Release date': 'February 3, 2004', 'Actors': 'Fred MacMurray, Vera Miles, Lillian Gish, Charles Ruggles, Kurt Russell', 'Subtitles': 'Spanish', 'Studio': 'Walt Disney Home Entertainment', 'Writers': 'Louis Pelletier', 'Country of Origin': 'USA', 'Number of discs': '1'}\nLove this movie.\nDisney classics are awesome.\nStagecoach\nJohn Wayne  (Actor),     Claire Trevor  (Actor),     John Ford  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Product description', 'Stagecoach', 'Amazon.com', 'This landmark 1939 Western began the legendary relationship between John Ford and John Wayne, and became the standard for all subsequent Westerns. It solidified Ford as a major director and established Wayne as a charismatic screen presence. Seen today,', 'Stagecoach', \"still impresses as the first mature instance of a Western that is both mythic and poetic. The story about a cross-section of troubled passengers unraveling under the strain of Indian attack contains all of Ford's incomparable storytelling trademarks--particularly swift action and social introspection--underscored by the painterly landscape of Monument Valley. And what an ensemble of actors: Thomas Mitchell (who won a Best Supporting Actor Oscar as the drunken doctor), Claire Trevor, Donald Meek, Andy Devine, and the magical John Carradine. Due to the film's striking use of chiaroscuro lighting and low ceilings, Orson Welles watched\", 'Stagecoach', 'over and over while preparing for', 'Citizen Kane', '.', '--Bill Desowitz']\n{'Format': 'AC-3, Black & White, Closed-captioned, Dolby, NTSC', 'Contributor': 'Tim Holt, Ernest Haycox, Claire Trevor, Andy Devine, John Wayne, John Carradine, Louise Platt, Ben Hecht, Donald Meek, Dorothy Appleby, Berton Churchill, Tom Tyler, George Bancroft, Dudley Nichols, Thomas Mitchell, John FordTim Holt, Ernest Haycox, Claire Trevor, Andy Devine, John Wayne, John Carradine, Louise Platt, Ben Hecht, Donald Meek, Dorothy Appleby, Berton Churchill, Tom Tyler, George Bancroft, Dudley Nichols, Thomas Mitchell, John Ford   See more', 'Language': 'English (Dolby Digital 2.0 Mono)', 'Runtime': '1 hour and 36 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.01 Ounces', 'Director': 'John Ford', 'Media Format': 'AC-3, Black & White, Closed-captioned, Dolby, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'October 29, 1997', 'Actors': 'John Wayne, Claire Trevor, Andy Devine, John Carradine, Thomas Mitchell', 'Subtitles': 'English, Spanish, French', 'Studio': 'Warner Home Video', 'Writers': 'Ben Hecht, Dudley Nichols, Ernest Haycox', 'Number of discs': '1'}\nMy copy was so scratched it wouldn’t play.\nIt’s an awesome movie, just be careful who you buy from.\nThe Mighty Ducks Three-Pack (The Mighty Ducks / D2: The Mighty Ducks / D3: The Mighty Ducks)\nEmilio Estevez  (Actor),     Joss Ackland  (Actor),     Robert Lieberman  (Director),     Sam Weisman  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Boxed Sets, Comedy\n['THE MIGHTY DUCKS: Screen favorite Emilio Estevez (STAKEOUT, YOUNG GUNS) stars in THE MIGHTY DUCKS, the hilarious comedy that made moviegoers stand up and cheer! Tough trial lawyer Gordon Bombay (Estevez) never loses. But when he\\'s slapped with a community service assignment, he must coach a ragtag team of pee wee hockey players who can\\'t skate, can\\'t score, and can\\'t win! Reluctantly, Bombay takes on the assignment and soon realizes there are more important things than winning. Armed with this new attitude, feathers fly as Bombay and the Ducks battle along to the toughest game of their lives!~~D2: THE MIGHTY DUCKS: \"Duck Power triumphs again!\" (American Movie Classics) when everyone\\'s favorite peewee hockey team returns to the ice for more slapshot action and slapstick laughter! The Mighty Ducks are thrilled to be chosen to compete in the Junior Goodwill Games as Team USA. They\\'ll be facing off against the best teams from all over the world -- including the meanest team that ever sliced up the ice! Are they out of their league? Has Coach Bombay (Emilio Estevez) let the big time go to his head, forgetting that it\\'s just a game? But when a street hockey gang teaches the Ducks to get tough, the Coach remembers how to have fun ... and the Ducks show the world the true meaning of Duck Power!~~D3: THE MIGHTY DUCKS: Emilio Estevez and the original Ducks are back in this fast-moving comedy starring the most popular hockey team in movie history! After the Ducks win scholarships to a snooty private school, Coach Bombay (Estevez) announces that he\\'s moving on to greener pastures with the Goodwill Games. Shortly after the team arrives at Eden Hall Academy, they inherit a new coach who turns out to be their worst nightmare when he strips Charlie Conway (Joshua Jackson) of his position as captain! Then, with their scholarships on the line, they face their toughest rival -- the 10-time championship varsity team! The Ducks and their opponents engage in a series of hilarious pranks to warm up for their battle on the ice. And in a thrilling and climactic third-period battle, the Ducks must prove why they are called the Mighty Ducks! \"The quack attack is back!\" (USA Today) -- and D3 will have you and your family cheering!']\n{'Aspect Ratio': '1.85:1', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '1.91 x 5.46 x 7.63 inches; 8.8 Ounces', 'Item model number': 'IP8362', 'Director': 'Robert Lieberman, Sam Weisman, Stephen Herek', 'Media Format': 'Multiple Formats, Box set, Closed-captioned, Color, NTSC', 'Run time': '5 hours and 15 minutes', 'Release date': 'September 3, 2002', 'Actors': 'Emilio Estevez, Joss Ackland, Kathryn Erbe, Jeffrey Nordling, Lane Smith', 'Language': 'Unqualified', 'Studio': 'WALT DISNEY STUDIOS HOME ENTERTAINMENT', 'Writers': 'Jim Burnstein, Kenneth Johnson, Steven Brill', 'Country of Origin': 'USA', 'Number of discs': '3'}\nLove 1 & 2.  I like D-3. Im very glad I got these. Good deal.\nVery good deal.\n90 Lookin Laugh Cartoons /\nRated:    G    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n{}\nLove watching the old school cartoons.\nFun to watch\nAbbott and Costello Meet the Monsters Collection [DVD]\nBud Abbott  (Actor),     Lou Costello  (Actor),     Charles Lamont  (Director),     Charles Barton  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Comedy\n[\"Comedy meets horror when the screen's funniest duo, Bud Abbott and Lou Costello, encounter Universal's classic monsters in the Abbott and Costello Meet the Monsters Collection. In 1948, Universal Pictures paired its most popular comedy team with its hugely successful monsters launching an entirely new genre. These four outrageously funny films find Bud and Lou meeting Dracula, Frankenstein, the Wolf Man, the Invisible Man, Dr. Jekyll and Mr. Hyde and the Mummy. Co-starring horror legends Bela Lugosi, Boris Karloff and Lon Chaney Jr., this timeless collection continues to scare up laughs for audiences of all ages!\", 'Bonus Content:', 'Disc 1 - Abbott and Costello Meet Frankenstein:', 'Abbott & Costello Meet the Monsters', 'Abbott & Costello Meet the Monsters', 'Feature Commentary with Film Historian Gregory W. Mank', 'Feature Commentary with Film Historian Gregory W. Mank', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 1 - Abbott and Costello Meet the Invisible Man:', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - Abbott and Costello Meet Dr. Jekyll and Mr. Hyde:', 'Feature Commentary with Film Historians Tom Weaver and Richard Scrivani', 'Feature Commentary with Film Historians Tom Weaver and Richard Scrivani', 'Theatrical Trailer', 'Theatrical Trailer', 'Disc 2 - Abbott and Costello Meet the Mummy:', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': 'John Grant, Charles Bradstreet, Robert Lees, Charles Lamont, Bud Abbott, Lon Chaney, Jr., Nancy Guild, Jane Randolph, Lou Costello, Frederic I. Rinaldo, Michael Ansara, Boris Karloff, Marie Windsor, Robert Arthur, Bela Lugosi, Glenn Strange, Lenore Aubert, Adele Jergens, William Frawley, Charles Barton, Frank Ferguson, Peggy King, Sheldon Leonard, Howard ChristieJohn Grant, Charles Bradstreet, Robert Lees, Charles Lamont, Bud Abbott, Lon Chaney, Jr., Nancy Guild, Jane Randolph, Lou Costello, Frederic I. Rinaldo, Michael Ansara, Boris Karloff, Marie Windsor, Robert Arthur, Bela Lugosi, Glenn Strange, Lenore Aubert, Adele Jergens,…  See more', 'Language': 'English (Dolby Digital 2.0)', 'Number Of Discs': '2', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Item model number': '34272126', 'Director': 'Charles Lamont, Charles Barton', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '5 hours and 23 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Bud Abbott, Lou Costello, Lon Chaney, Jr., Nancy Guild, Boris Karloff', 'Subtitles': 'Spanish, French', 'Producers': 'Howard Christie, Robert Arthur', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Grant, Robert Lees, Frederic I. Rinaldo', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI enjoyed these movies as much as I did when I was a kid. They are hilarious.\nAbbott and Costello are timeless",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user enjoys classic holiday films, animated and family-friendly content, and has developed an appreciation for classic Westerns. They particularly favor humorous narratives that interweave thrilling storytelling with emotional depth.\n\n- **Traditions**: They cherish nostalgic experiences reminiscent of childhood, gravitating towards films that celebrate the holiday spirit and entertaining suspenseful narratives while maintaining historical authenticity.\n\n- **Movie Preferences**: The user has a strong affinity for vintage comedy, recently enjoying classic duos that blend humor with nostalgia. Their passion for light-hearted family films reflects a desire for character-driven entertainment that evokes fond memories.\n\n- **Gifting Attitude**: They seek collectibles that focus on quality, often looking for thoughtfully curated media that provides depth across genres, emphasizing their commitment to enriching their film collection.\n\n- **Quality Judgment**: While typically rating films highly based on personal enjoyment and cultural significance, the user remains vigilant about the quality of their purchases. Their recent enjoyment of timeless comedies exemplifies their preference for skillful storytelling that balances fun with historical context, reinforcing their dedication to enjoyable viewing experiences that celebrate nostalgia and entertainment in cinema.",
  "metrics": {
    "rouge1_f": 0.05520833333333334,
    "rouge2_f": 0.0036477331943720686,
    "rougeL_f": 0.026041666666666664,
    "meteor": 0.015010632531376392,
    "bleu1": 1.1640145731092037e-10,
    "bleu2": 4.4735277745541117e-11,
    "bleu3": 1.3207395110497726e-11,
    "bleu4": 4.039968081531952e-12,
    "bertscore_precision": 0.3242585361003876,
    "bertscore_recall": 0.49769484996795654,
    "bertscore_f1": 0.39267873764038086
  }
}