{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Poseidon Adventure\nReview Date: 2018/06/01\nStore: Gene Hackman  (Actor),     Ernest Borgnine  (Actor),     Irwin Allen  (Director),     Ronald Neame  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\nProduct Description: [\"A clergyman leads survivors of a capsized luxury liner through the ship's innards to its highest point. Directed by Ronald Neame.\"]\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Special Edition, Widescreen', 'Contributor': \"Pamela Sue Martin, Red Buttons, Paul Gallico, Eric Shea, Ernest Borgnine, Arthur O'Connell, Fred Sadoff, Wendell Mayes, Jack Albertson, Gene Hackman, Shelley Winters, Stella Stevens, Roddy McDowall, Carol Lynley, Irwin Allen, Ronald Neame, Stirling SilliphantPamela Sue Martin, Red Buttons, Paul Gallico, Eric Shea, Ernest Borgnine, Arthur O'Connell, Fred Sadoff, Wendell Mayes, Jack Albertson, Gene Hackman, Shelley Winters, Stella Stevens, Roddy McDowall, Carol Lynley, Irwin Allen, Ronald Neame, Stirling Silliphant  See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 1.0), Spanish (Dolby Digital 1.0)', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2233166DVD', 'Director': 'Irwin Allen, Ronald Neame', 'Media Format': 'Multiple Formats, Color, NTSC, Special Edition, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'May 9, 2006', 'Actors': 'Gene Hackman, Ernest Borgnine, Shelley Winters, Red Buttons, Carol Lynley', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Paul Gallico, Stirling Silliphant, Wendell Mayes', 'Number of discs': '2'}\nReview Text: I remember watching this when it came out in the 70’s. For disaster flick fans, I certainly recommend it.\nReview Title: I certainly recommend it.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "A Charlie Brown Christmas 50th Anniversay Deluxe Edition (DVD)\nVarious  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas\n[\"Christmastime is here. Happiness and cheer. And for Peanuts fans everywhere, it just wouldn't be Christmas without this classic holiday delight. Christmas lights may be twinkling red and green, but Charlie Brown has the Yuletide blues. To get in the holiday spirit, he takes Lucy's advice and directs the Christmas play. And what's a Christmas play without a Christmas tree? But everyone makes fun of the short, spindly nevergreen Charlie Brown brings back - until the real meaning of Christmas works its magic once again.\", 'CHARLIE BROWN: Spruce up your Christmas cheer this year as Charlie takes on the spirit of Christmas in hopes to find the real magic of the season once again.', 'CHARLIE BROWN: Spruce up your Christmas cheer this year as Charlie takes on the spirit of Christmas in hopes to find the real magic of the season once again.', 'KEEPSAKE: It is the first TV special based on the comic strip Peanuts, by Charles M. Shultz. It has been honored with an Emmy and a Peabody Award and has become an annual tradition in the United States.', 'KEEPSAKE: It is the first TV special based on the comic strip Peanuts, by Charles M. Shultz. It has been honored with an Emmy and a Peabody Award and has become an annual tradition in the United States.', 'DELUXE ADDITION: This deluxe edition features It’s Christmastime Again, Charlie Brown. It also includes A Christmas Miracle: The Making of a Charlie Brown Christmas.', 'DELUXE ADDITION: This deluxe edition features It’s Christmastime Again, Charlie Brown. It also includes A Christmas Miracle: The Making of a Charlie Brown Christmas.', 'OFFICIALLY LICENSED: This Classic Charlie Brown story is officially licensed by Peanuts and is 100% authentic.', 'OFFICIALLY LICENSED: This Classic Charlie Brown story is officially licensed by Peanuts and is 100% authentic.', 'GIFTABLE: Gift this Anniversary Deluxe DVD for new generations and even older ones as the perfect stocking stuffer.', 'GIFTABLE: Gift this Anniversary Deluxe DVD for new generations and even older ones as the perfect stocking stuffer.']\n{'Genre': 'Kids & Family', 'Format': 'Multiple Formats, Animated, Color, NTSC', 'Contributor': 'Various', 'Initial release date': '2014-12-02', 'Language': 'English', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': 'WHV1000404554DVD', 'Director': 'Various', 'Media Format': 'Multiple Formats, Animated, Color, NTSC', 'Run time': '25 minutes', 'Release date': 'December 2, 2014', 'Actors': 'Various', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '1'}\nA favorite childhood memory. There’s nothing I don’t like about the movie.\nA precious Christmas tradition.\nUltimate Disaster Pack (Earthquake / Airport / The Hindenburg / Rollercoaster) [DVD]\nBurt Lancaster  (Actor),     Charlton Heston  (Actor),     James Goldstone  (Director),     Mark Robson  (Director, Producer)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Action & Adventure\n[\"Danger, destruction and mayhem…the Ultimate Disaster Pack features four blockbuster films filled with natural and manmade catastrophes that will blow you away. The pulse pounding action begins with Earthquake, an Academy Award-winning film about heroes rising after a catastrophic earthquake levels Los Angeles. The suspense continues with the original Airport, nominated for 10 Academy Awards including Best Picture, which launched the popular 1970s disaster film genre and became a box office smash. One of aviation's most infamous events in history is brought back to life in The Hindenburg, a gripping suspense thriller that reveals the intricate plots behind the historic airship disaster of 1937. Unexpected twists and turns await in Rollercoaster when a determined terrorist targets America's most popular attraction, and its riders, for senseless destruction. Featuring all-star casts that include Charlton Heston, Burt Lancaster, Dean Martin, George C. Scott, George Segal and many more, the Ultimate Disaster Pack will pull you in and never let you go!\"]\n{'Genre': 'Drama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & SuspenseDrama, DVD Movie, Blu-ray Movie, Action & Adventure/Thrillers, Action & Adventure, Mystery & Suspense  See more', 'Format': 'DVD, NTSC, Subtitled', 'Contributor': 'Dana Wynter, George Segal, George Fox, Jean Seberg, Dorothy Spencer, Gary Collins, Ava Gardner, Ronald Pierce, Ernest Laszlo, William Atherton, David Moriarty, Rene Auberjonois, Van Heflin, Peter Berkos, Stuart Gilmore, Roy Thinnes, George Kennedy, Don K. Sharpless, Gig Young, John A. Bolger, Jr., Burgess Meredith, George Seaton, Mario Puzo, Charlton Heston, Lorne Greene, Ross Hunter, Philip Lathrop, Melvin Metcalfe, Sr., Richard Roundtree, Robert Surtees, Leonard Peterson, Barbara Hale, Charles Durning, Edith Head, Nelson Gidding, Anne Bancroft, Barry Sullivan, Jacqueline Bisset, Richard Dysart, Genevieve Bujold, Burt Lancaster, John Mack, Richard Widmark, Victoria Principal, Robert Wise, James Goldstone, Helen Hayes, Dean Martin, Timothy Bottoms, Katherine Helmond, Henry Fonda, Barry Nelson, George C. Scott, Marjoe Gortner, Mark Robson, Lloyd Nolan, Maureen StapletonDana Wynter, George Segal, George Fox, Jean Seberg, Dorothy Spencer, Gary Collins, Ava Gardner, Ronald Pierce, Ernest Laszlo, William Atherton, David Moriarty, Rene Auberjonois, Van Heflin, Peter Berkos, Stuart Gilmore, Roy Thinnes, George Kennedy, Don K. Sharpless,…  See more', 'Initial release date': '2016-05-03', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Mono), English (Dolby Digital 2.0 Stereo)', 'Aspect Ratio': '2.35:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.2 Ounces', 'Director': 'James Goldstone, Mark Robson, Robert Wise, George Seaton', 'Media Format': 'DVD, NTSC, Subtitled', 'Run time': '8 hours and 25 minutes', 'Release date': 'May 3, 2016', 'Actors': 'Burt Lancaster, Charlton Heston, George C. Scott, George Segal, Dean Martin', 'Subtitles': 'French', 'Producers': 'Mark Robson, Robert Wise, Ross Hunter', 'Studio': 'Studio Distribution Services', 'Writers': 'George Fox, Nelson Gidding, Mario Puzo, George Seaton', 'Country of Origin': 'USA', 'Number of discs': '2'}\nI’m a disaster film collector.  I was pleased with this collection.\nIf you love disaster films this is a good collection to have. Great value at good price.\nA Night to Remember (The Criterion Collection) [DVD]\nKenneth More  (Actor),     Honor Blackman  (Actor),     Roy Ward Baker  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Criterion Collection, All\n['On April 14, 1912, just before midnight, the unsinkable Titanic struck an iceberg. In less than three hours, it had plunged to the bottom of the sea, taking with it more than 1,500 of its 2,200 passengers. In his unforgettable rendering of Walter Lord’s book of the same name,', 'A Night to Remember', ', the acclaimed British director Roy Ward Baker (', 'Don’t Bother to Knock', ') depicts with sensitivity, awe, and a fine sense of tragedy the ship’s final hours. Featuring remarkably restrained performances,', 'A Night to Remember', 'is cinema’s subtlest, finest dramatization of this monumental twentieth-century catastrophe.']\n{'Genre': 'Drama, Documentary/Biography', 'Format': 'Multiple Formats, Black & White, NTSC, Subtitled, Widescreen', 'Contributor': 'Roy Ward Baker, Kenneth More, David McCallum, Tucker McGuire, Honor Blackman, Michael Goodliffe', 'Language': 'English', 'Runtime': '2 hours and 3 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.6 x 5.4 x 7.5 inches; 2.72 Ounces', 'Item model number': 'CRRN2134DVD', 'Director': 'Roy Ward Baker', 'Media Format': 'Multiple Formats, Black & White, NTSC, Subtitled, Widescreen', 'Run time': '2 hours and 3 minutes', 'Release date': 'March 27, 2012', 'Actors': 'Kenneth More, Honor Blackman, Michael Goodliffe, David McCallum, Tucker McGuire', 'Subtitles': 'English', 'Studio': 'Criterion Collection', 'Country of Origin': 'USA', 'Number of discs': '2'}\nThis version is the most historically accurate version out. Except for the actual sinking. We all know that the ship broke in half. But in 1958 they didn’t know that. I strongly recommend the 2 dvd special edition. It has an interview with Eva Hart, a Titanic survivor.  Very interesting.\nI strongly recommend the 2 dvd special edition\nThe Poseidon Adventure\nGene Hackman  (Actor),     Ernest Borgnine  (Actor),     Irwin Allen  (Director),     Ronald Neame  (Director)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, Action, General\n[\"A clergyman leads survivors of a capsized luxury liner through the ship's innards to its highest point. Directed by Ronald Neame.\"]\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC, Special Edition, Widescreen', 'Contributor': \"Pamela Sue Martin, Red Buttons, Paul Gallico, Eric Shea, Ernest Borgnine, Arthur O'Connell, Fred Sadoff, Wendell Mayes, Jack Albertson, Gene Hackman, Shelley Winters, Stella Stevens, Roddy McDowall, Carol Lynley, Irwin Allen, Ronald Neame, Stirling SilliphantPamela Sue Martin, Red Buttons, Paul Gallico, Eric Shea, Ernest Borgnine, Arthur O'Connell, Fred Sadoff, Wendell Mayes, Jack Albertson, Gene Hackman, Shelley Winters, Stella Stevens, Roddy McDowall, Carol Lynley, Irwin Allen, Ronald Neame, Stirling Silliphant  See more\", 'Language': 'English (Dolby Digital 2.0 Stereo), French (Dolby Digital 1.0), Spanish (Dolby Digital 1.0)', 'Runtime': '1 hour and 57 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'FOXS2233166DVD', 'Director': 'Irwin Allen, Ronald Neame', 'Media Format': 'Multiple Formats, Color, NTSC, Special Edition, Widescreen', 'Run time': '1 hour and 57 minutes', 'Release date': 'May 9, 2006', 'Actors': 'Gene Hackman, Ernest Borgnine, Shelley Winters, Red Buttons, Carol Lynley', 'Subtitles': 'English, Spanish', 'Studio': '20th Century Fox', 'Writers': 'Paul Gallico, Stirling Silliphant, Wendell Mayes', 'Number of discs': '2'}\nI remember watching this when it came out in the 70’s. For disaster flick fans, I certainly recommend it.\nI certainly recommend it.",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user has a strong affinity for classic holiday films, particularly animated and family-oriented content, alongside a pronounced interest in disaster films, showcasing a taste for high-stakes narratives and action-packed storytelling.\n- **Traditions**: Values nostalgic experiences that evoke childhood memories, seeking content that captures holiday spirit and intense narratives, with a keen appreciation for historical accuracy and depth in storytelling.\n- **Movie Preferences**: Enjoys timeless films linked to family gatherings and celebrations, as well as classic disaster films featuring ensemble casts and compelling narratives. Recently engaging with historical disaster themes highlights a growing interest in documentaries and biographical dramas that explore real-life events.\n- **Gifting Attitude**: Considers collectible media, particularly during holidays, as thoughtful gifts. Appreciates comprehensive collector's sets that delve into specific genres, emphasizing a desire for quality and depth in collections.\n- **Quality Judgment**: Rates content highly, reflecting personal enjoyment and cultural appreciation, with a willingness to recommend quality releases that enhance understanding of significant historical events.\n\nThe user's latest engagement reinforces their enjoyment of classic disaster narratives from notable eras, highlighting both nostalgia and appreciation for cinematic craftsmanship, blending family-friendly themes with thrilling stories.",
  "metrics": {
    "rouge1_f": 0.10436755530346001,
    "rouge2_f": 0.005678591709256105,
    "rougeL_f": 0.0476460578559274,
    "meteor": 0.03186277517549282,
    "bleu1": 9.111253939792237e-05,
    "bleu2": 2.1400650200566987e-05,
    "bleu3": 3.5890429764869896e-06,
    "bleu4": 1.4712971446135202e-06,
    "bertscore_precision": 0.33039432764053345,
    "bertscore_recall": 0.46089333295822144,
    "bertscore_f1": 0.3848828971385956
  }
}