{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: A Christmas Story (DVD)\nReview Date: 2020/01/28\nStore: Peter Billingsley  (Actor),     Melinda Dillon  (Actor)    Rated:    PG    Format: DVD\nCategories: Movies & TV, Holidays & Seasonal, Christmas, Comedy\nProduct Description: ['Product Description', 'Christmas Story, A (WBFE) (DVD)', \"It's the final days before Christmas in early 1940s Cleveland, and 9-year-old Ralphie wants one thing from Santa Clause more than anything else: a Red Ryder Carbine Action Air Rifle. As he trudges through the snow to school, faces the neighborhood bully and visits a malevolent department store Santa Clause, Ralphie connives, conspires and campaigns for the most fabulous Christmas present ever in this heartwarming, hysterical and sweetly nostalgic holiday film.\", ']]>', 'Amazon.com', \"Director Bob Clark's charming, touching, and very funny adaptation of humorist Jean Shepherd's nostalgic, autobiographical Yuletide novel,\", 'In God We Trust, All Others Pay Cash', ', remains essential holiday family viewing. Narrated by a man (Shepherd) recalling his childhood, the film looks back at the compulsive efforts of 7-year-old Ralphie (Peter Billingsley) as he tries every means possible to acquire his dream Christmas gift--a Daisy-brand Red Ryder repeating BB carbine with a compass mounted in the stock. Problem is, he lives in a Norman Rockwell-esque Midwestern town in the 1940s, where his parents, teachers, and even Santa Claus all warn Ralphie that \"he\\'ll shoot his eye out.\" Episodic in nature and seen entirely through the eyes of a child, the film offers a wonderful look at the day-to-day eccentricities that grew out of this conservative period. More interestingly, it cleverly captures childhood urgency, where even the most trivial fantasies or objects become immediate life-or-death necessities. While countless family Christmas movies serve up clichéd situations suffocating with preachy sermons, Clark\\'s acute eye for detail and odd mixture of warmth, satire, and quirky humor are the reasons why so many viewers have rediscovered this after it initially bombed in the theaters. Sentimental without being syrupy, it\\'s a true rarity: a holiday movie that adults and children can enjoy equally, for completely different reasons and regardless of the season.', '--Dave McCoy', 'Review', \"In short, A Christmas Story isn't just about Christmas; it's about childhood and it recaptures a time and place with love and wonder. It seems an instant classic, a film that will give pleasure to people not only this Christmas, but for many Christmases to come. --Jay Car, Boston GlobeThe cast is wonderful--especially McGavin, Billingsley and Petrella--the laughs are nonstop if rarely subtle, and the whole thing deserves to become a Christmastime classic. --TV Guide, StaffIt is pitch-perfect, telling the story through the enthusiastic and single-minded vision of its hero Ralphie, and finding in young Peter Billingsley a sly combination of innocence and calculation. --Roger Ebert, Chicago Sun-Times\", 'About the Actor', \"Peter Billingsley has been a member of the Hollywood community since he was a small child. After appearing on numerous television shows and films during his youth, the Emmy Award-nominated actor delivered a performance for the ages in the beloved holiday film, A Christmas Story (1983). Melinda Dillon made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969) and in Steven Spielberg's Close Encounters of the Third Kind (1977). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987).\", 'About the Director', \"Bob Clark is a director known for his '80s movies such as A Christmas Story (1983), Porky's (1982) and Rhinestone (1984).\", 'See more']\nAverage Rating: 4.8\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.33 Ounces', 'Item model number': '3349475', 'Director': 'Bob Clark', 'Media Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2007', 'Actors': 'Peter Billingsley, Melinda Dillon, Darren McGavin, Ian Petrella, Scott Schwartz', 'Subtitles': 'English, French, Spanish', 'Producers': 'Rene Dupont, Bob Clark', 'Studio': 'Studio Distribution Services', 'Writers': 'Jean Sheppard, Leigh Brown', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Every generation DVD\nReview Title: ONE OF A KIND FOREVER....\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Blink [DVD]\nMadeleine Stowe  (Actor),     Aidan Quinn  (Actor),     Michael Apted  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"A blind woman, whose sight has only recently been restored, thinks she's witnessed a brutal murder. Starring Madeline Stowe and Aidan Quinn. Directed by Michael Apted. Year: 1994 Director: Michael pted Starring: Madeleine Stowe, Aidan Quinn, James Remar\"]\n{'Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Madeleine Stowe, Michael Kirkpatrick, Caryn Cheever, Ray Clay, Glendon Gabbard, Kathryn Miller, Mark Nagel, Peter Friedman, Laurie Metcalf, Darryl Rocky Davis, Blake Whealy, Aidan Quinn, Renee Lockett-Lawson, Joe McConnell, James Remar, David Callahan, Jackie Samuel, Kevin Swerdlow, Bruce A. Young, Dallas J. Crawford, Ted Gilbert, Rick Le Fevour, Mary Ann Thebus, Mary Seibel, Tim Monsion, Mario Tanzi, Ed Cray, Michael Apted, Sean C. Cleland, Paul Dillon, Kate Buddeke, Joy Gregory, Matt Roth, Valerie Spencer, Greg Noonan, Michael P. Byrne, Michael Stuart Kirkpatrick, Louie, Debra Dusay, Les Podewell, Lia D. Mortensen, Lucina Paquet, Dr. Donna Alexander, Gene Janson, Bob Lanier, Lucy Childs, Anthony Cannata, Sam Sanders, Adele Robbins, Jackie Moran (II), Shirley Spiegler Jacobs, Don Forston, Heather Schwartz, Marilyn Dodds Frank, Kevin Matthews, Craig Winston Damon, Chantal WentworthMadeleine Stowe, Michael Kirkpatrick, Caryn Cheever, Ray Clay, Glendon Gabbard, Kathryn Miller, Mark Nagel, Peter Friedman, Laurie Metcalf, Darryl Rocky Davis, Blake Whealy, Aidan Quinn, Renee Lockett-Lawson, Joe McConnell, James Remar, David Callahan, Jackie Samue…  See more', 'Language': 'English', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 0.01 Ounces', 'Director': 'Michael Apted', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 46 minutes', 'Release date': 'October 7, 2003', 'Actors': 'Madeleine Stowe, Aidan Quinn, James Remar, Peter Friedman, Bruce A. Young', 'Subtitles': 'English', 'Studio': 'New Line Home Video', 'Number of discs': '1'}\nI enjoyed this movie a real time story. I will keep getting my old time DVD 's from amazon with the ease of purchase.\ngreat movie\nDerailed (Unrated Widescreen)\nJennifer Aniston  (Actor),     Vincent Cassel  (Actor),     Mikael Hafstrom  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Advertising executive Charles Schine is just another Chicago commuter who regularly catches the 8:43 A.M. train to work. But the one day he misses his train and meets Lucinda Harris, his life is changed forever. Lucinda is charming, beautiful and seductive. Despite the fact that each are married with children, their attraction to one another is magnetic. Lunch dates quickly become cocktails after work, and before long, Charles and Lucinda's infatuation leads them to a hotel room. Their seemingly perfect affair goes terribly awry when LaRoche, a brutal stranger, breaks into their room and holds them at gunpoint. This once illicit liaison turns into a nightmare more dangerous and violent than either could have ever imagined. Charles' life soon becomes filled with deception, blackmail, violence and crime. Unable to confide in his wife or speak to the police, Charles finds himself trapped in a world he doesn't recognize, with no trace of the life he once knew.\"]\n{'Genre': 'Thriller', 'Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Contributor': 'Jennifer Aniston, Mikael Hafstrom, Tom Conti, Melissa George, Clive Owen, Lorenzo Bonaventura, RZA, Vincent Cassel, Di Bonaventura Pictures; Miramax Films; Patalex V Productions LimitedJennifer Aniston, Mikael Hafstrom, Tom Conti, Melissa George, Clive Owen, Lorenzo Bonaventura, RZA, Vincent Cassel, Di Bonaventura Pictures; Miramax Films; Patalex V Productions Limited   See more', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '78649', 'Director': 'Mikael Hafstrom', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 21, 2006', 'Actors': 'Jennifer Aniston, Vincent Cassel, Tom Conti, Melissa George, Clive Owen', 'Subtitles': 'Spanish', 'Producers': 'Lorenzo Bonaventura', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '1'}\nLOVED THIS DERAILED MOVIE  GREAT ACTORS\nFive Stars\nThe Professional\nJean Reno  (Actor),     Gary Oldman  (Actor),     Luc Besson  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Jean Reno, Gary Oldman, Natalie Portman and Danny Aiello star in', 'Leon the Professional', ', a go-for-broke thriller about a professional assassin whose work becomes dangerously personal. Calling himself a \"cleaner,\" the mysterious Léon is New York\\'s top hit man. When his next-door neighbors are murdered, Léon becomes the unwilling guardian of the family\\'s sole survivor - 12-year-old Mathilda. But Mathilda doesn\\'t just want protection; she wants revenge. Training her in the deadly tricks of his trade, Léon helps her track the psychotic agent who murdered her family. From the electrifying opening to the fatal finale,', 'Leon the Professional', ', is a nonstop crescendo of action, suspense and surprises. Experience the uncut version, with 24 minutes of footage not included in the original U.S. theatrical version.']\n{'Genre': 'Action, Drama, Thriller, Suspense', 'Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, NTSC', 'Contributor': 'Gary Oldman, Danny Aiello, Jean Reno, Natalie Portman, Les Films du Dauphin, Luc Besson', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.56 Ounces', 'Item model number': 'ISBN 0072317949', 'Director': 'Luc Besson', 'Media Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 50 minutes', 'Release date': 'February 24, 1998', 'Actors': 'Jean Reno, Gary Oldman, Natalie Portman, Danny Aiello', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Luc Besson', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nGREAT MOVIE....... Having the actual DVD I can watch it antie anywhere even in the car.....\nGREAT MOVIE\nScandal At Scourie (1953)\nGreer Garson  (Actor),     Walter Pidgeon  (Actor),     Jean Negulesco  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Legendary Hollywood screen pair Greer Garson and Walter Pidgeon team for the ninth and last time in Scandal at Scourie, a heart-tugging Technicolor drama that has the duo facing obstacles with the kind of unbreakable love that saw them through aerial bombardments in Mrs. Miniver or the challenges of the medical unknown in Madame Curie. Set in Ontario, Canada, the story centers on Victoria and Patrick McChesney, whose decision to adopt an orphaned Catholic girl ignites controversy in their Protestant community. Patrick is accused of using the adoption to appeal to Catholic voeters and advance his political career. Victoria contends with self-righteous whispers about the child's out-of-wedlock birth. And an event in the child's past leads to a fear-mongering change that she is a pyromaniac. Passions and accusations rage. But like a ship plying stormy seas, the McChesney' love for each other and their child will prevail.\"]\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Linda Greer, Jean Negulesco, Agnes Moorehead, Walter Pidgeon, Archer MacDonald, Al Ferguson, Maudie Prickett, Eugene Bordon, Donna Corcoran, Patricia Tiernan, Nolan Leary, Margalo Gillmore, John Lupton, Robert Ross, Warren Farlow, George Davis, Max Willenz, Peter Roman, Philip Ober, Wayne Farlow, Matt Moore, Jack Bonigul, Tony Taylor, Gary Lee Jackson, Wilton Graff, Roger Moore, Howard Negley, Joann Arnold, Greer Garson, Ivan Triesault, Jill Martin, Owen McGiveney, Claude Guy, Michael Pate, Rudy Lee, Earl Lee, Alex Frazer, Philip Tonge, Ivis Goulding, Coral Hammond, Ida Moore, Rhys Williams, Perdita Chandler, Charles Watts, Vicki Joy Ereutzer, Kathleen Hartnagel, John Sherman, Ian Wolfe, Walter Baldwin, Arthur Shields, Victor Wood, Edwin H. KnopfLinda Greer, Jean Negulesco, Agnes Moorehead, Walter Pidgeon, Archer MacDonald, Al Ferguson, Maudie Prickett, Eugene Bordon, Donna Corcoran, Patricia Tiernan, Nolan Leary, Margalo Gillmore, John Lupton, Robert Ross, Warren Farlow, George Davis, Max Willenz, Pe…   See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': 'B00KWP6JOY', 'Director': 'Jean Negulesco', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 13, 2014', 'Actors': 'Greer Garson, Walter Pidgeon, Agnes Moorehead, Donna Corcoran, Arthur Shields', 'Producers': 'Edwin H. Knopf', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGREAT OLD TIME FAVORITE.......\nOLD TIME FAVORITE\nThe Time Machine [DVD]\nRod Taylor  (Actor),     Yvette Mimieux  (Actor),     George Pal  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Today's Deals, Spotlight Deals, Mother's Day Gift Ideas in Movies & TV\n['Time Machine, The (DVD) (Rpkg)', \"In this adaptation of H.G. Wells' classic novel, a scientist in 1880s Victorian England builds a vehicle to transport him through time. He first travels to 1917 and the horror of World War I. Next, he sets his destination for 1940 and the start of World War II. From there he travels to a future London when he barely escapes nuclear holocaust. Finally, he sets his destination for the year 802,701 C.E., when he meets an innocent race of people living in an idyllic land ... but this future may be the most dangerous of all his journeys in The Time Machine.\", ']]>']\n{'Genre': 'Science Fiction & Fantasy, Kids & Family, Action & Adventure', 'Format': 'AC-3, Dolby, Dubbed, DVD, NTSC, Subtitled, Widescreen', 'Contributor': 'David Duncan, George Pal, Sebastian Cabot, H.G. Wells, Rod Taylor, Alan Young, Yvette Mimieux, Tom HelmoreDavid Duncan, George Pal, Sebastian Cabot, H.G. Wells, Rod Taylor, Alan Young, Yvette Mimieux, Tom Helmore  See more', 'Initial release date': '2010-11-09', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1)', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '9044893225', 'Director': 'George Pal', 'Media Format': 'AC-3, Dolby, Dubbed, DVD, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'November 9, 2010', 'Actors': 'Rod Taylor, Yvette Mimieux, Alan Young, Sebastian Cabot, Tom Helmore', 'Dubbed': 'French', 'Subtitles': 'English, French', 'Studio': 'Studio Distribution Services', 'Writers': 'H.G. Wells, David Duncan', 'Country of Origin': 'USA', 'Number of discs': '1'}\nEVEERYONE LOVES THIS OLD TIME CLASSIC.....\nCLASSICS  NEVER DIE..\nDon't Blink\nBrian Austin Green  (Actor),     Robert Picardo  (Actor),     Travis Oates  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Fantasy\n['Ten people arrive at a secluded mountain resort to find it completely deserted. With no gas for the return trip, the visitors are forced to stay and investigate the mystery surrounding the abandoned lodge.']\n{'Genre': 'Horror', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Travis Oates, Mena Suvari, Robert Picardo, Brian Austin Green', 'Language': 'English', 'Runtime': '1 hour and 32 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Director': 'Travis Oates', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 32 minutes', 'Release date': 'October 14, 2014', 'Actors': 'Brian Austin Green, Robert Picardo, Mena Suvari', 'Studio': 'Vertical', 'Number of discs': '1'}\nGREAT MOVIE FOR WEEKEND WATCHING\nJUST DON'T BLINK.......\nSherlock Holmes (Prelude to Murder (Dressed to Kill) / Secret Weapon / Terror by Night / Woman in Green)\nBasil Rathbone  (Actor),     Nigel Bruce  (Actor),     Roy William Neill  (Director),     Howard Benedict  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n['In', 'Prelude to Murder', \"the legendary Sherlock Holmes must apply his keen ear for music to help solve this thrilling case. A trio of music boxes contains the hidden secret to vast riches, and a group of criminals is willing to kill for them. When the first of these victims is a friend of Dr. Watson, Holmes is on the case. This is the last of Basil Rathbone's portrayals of the iconic Sherlock Holmes, and certainly one of the best. This amazing colorization, created with a new cutting-edge digital technology, breathes new life into this already excellent film. Also included on this DVD is the original black-and-white version, beautifully restored as well. This is the definitive DVD edition of Prelude to Murder.<P>The legendary Sherlock Holmes squares off once again against his nemesis, the diabolically brilliant Professor Moriarty. Moriarty kidnaps the inventor of a new wartime bombsight, and threatens to sell the invention to the Nazis. England's fate hangs in the balance as Holmes and Watson must break a secret code of dancing men to stop the Nazis and rescue the inventor. The amazing colorization, created with a new cutting-edge digital technology, breathes new life into this already excellent film. Also included on this DVD is the original black-and-white version, beautifully restored as well. This is the definitive DVD edition of Sherlock Holmes and the\", 'Secret Weapon.', '<P>In <I>Terror by Night, the legendary Sherlock Holmes plunges into a thrill ride of a murder mystery set on a speeding passenger train. Holmes has been entrusted to guard the transport of the 400-carat diamond Star of Rhodesia, but when the gem is stolen, the murders start to mount. Only the masterful Holmes can deduce which of the eccentric and suspicious passengers is the true criminal. The amazing colorization, created with a new cutting-edge digital technology, breathes new life into this already excellent film. Also included on this DVD is the original black-and-white version, beautifully restored as well. This is the definitive DVD edition of', 'Terror by Night', 'for Sherlock Holmes fans.<P>The legendary Sherlock Holmes squares off once again against his nemesis, the diabolically brilliant Professor Moriarty. Four women are brutally murdered, and Scotland Yard thinks it is the random work of a madman. But Holmes and Watson follow a mysterious and beautiful woman into the nefarious world of blackmail and hypnotism. They deduce that something far more sinister is happening here the work of a criminal genius. The amazing colorization, created with a new cutting-edge digital technology, breathes new life into this already excellent film Also included on this DVD is the original black-and-white version, beautifully restored as well. This is the definitive DVD edition of', 'The Woman in Green.']\n{'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.6 Ounces', 'Item model number': 'LGNF511DVD', 'Director': 'Roy William Neill, Howard Benedict', 'Media Format': 'Box set, Multiple Formats, Color, Dolby, Full Screen, NTSC', 'Run time': '4 hours and 28 minutes', 'Release date': 'March 2, 2010', 'Actors': 'Basil Rathbone, Nigel Bruce', 'Language': 'Unqualified', 'Studio': 'Legend Films', 'Number of discs': '1'}\nWEEKEND MOVIE WATCHING.\nAN OLD TIME FAVORITE\nJacques Cousteau's Voyage to the Edge of the World\nJacques-Yves Cousteau  (Actor),     Phillippe Cousteau  (Actor, Director)    Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Documentary\n['On his ship, Calypso, as well as in a submarine, Jacques Cousteau and his crew sail from South America and travel to Antarctica. They explore islands, reefs, icebergs, fossils, active volcanic craters, and creatures of the ocean never before seen. This voyage took place in 1975, and Captain Cousteau became one of the first explorers ever to dive beneath the waters of the frozen South Pole. This DVD includes the original theatrical movie trailer as well. A true classic.']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '5822642', 'Director': 'Phillippe Cousteau', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 32 minutes', 'Release date': 'August 11, 2009', 'Actors': 'Jacques-Yves Cousteau, Phillippe Cousteau', 'Studio': 'Synergy Ent', 'Country of Origin': 'USA', 'Number of discs': '1'}\nJACQUES COUSTEAU'S  Adventures were always great to watch & still are........\nGREAT SCUBA DIVER\nA Christmas Story (DVD)\nPeter Billingsley  (Actor),     Melinda Dillon  (Actor)    Rated:    PG    Format: DVD\nMovies & TV, Holidays & Seasonal, Christmas, Comedy\n['Product Description', 'Christmas Story, A (WBFE) (DVD)', \"It's the final days before Christmas in early 1940s Cleveland, and 9-year-old Ralphie wants one thing from Santa Clause more than anything else: a Red Ryder Carbine Action Air Rifle. As he trudges through the snow to school, faces the neighborhood bully and visits a malevolent department store Santa Clause, Ralphie connives, conspires and campaigns for the most fabulous Christmas present ever in this heartwarming, hysterical and sweetly nostalgic holiday film.\", ']]>', 'Amazon.com', \"Director Bob Clark's charming, touching, and very funny adaptation of humorist Jean Shepherd's nostalgic, autobiographical Yuletide novel,\", 'In God We Trust, All Others Pay Cash', ', remains essential holiday family viewing. Narrated by a man (Shepherd) recalling his childhood, the film looks back at the compulsive efforts of 7-year-old Ralphie (Peter Billingsley) as he tries every means possible to acquire his dream Christmas gift--a Daisy-brand Red Ryder repeating BB carbine with a compass mounted in the stock. Problem is, he lives in a Norman Rockwell-esque Midwestern town in the 1940s, where his parents, teachers, and even Santa Claus all warn Ralphie that \"he\\'ll shoot his eye out.\" Episodic in nature and seen entirely through the eyes of a child, the film offers a wonderful look at the day-to-day eccentricities that grew out of this conservative period. More interestingly, it cleverly captures childhood urgency, where even the most trivial fantasies or objects become immediate life-or-death necessities. While countless family Christmas movies serve up clichéd situations suffocating with preachy sermons, Clark\\'s acute eye for detail and odd mixture of warmth, satire, and quirky humor are the reasons why so many viewers have rediscovered this after it initially bombed in the theaters. Sentimental without being syrupy, it\\'s a true rarity: a holiday movie that adults and children can enjoy equally, for completely different reasons and regardless of the season.', '--Dave McCoy', 'Review', \"In short, A Christmas Story isn't just about Christmas; it's about childhood and it recaptures a time and place with love and wonder. It seems an instant classic, a film that will give pleasure to people not only this Christmas, but for many Christmases to come. --Jay Car, Boston GlobeThe cast is wonderful--especially McGavin, Billingsley and Petrella--the laughs are nonstop if rarely subtle, and the whole thing deserves to become a Christmastime classic. --TV Guide, StaffIt is pitch-perfect, telling the story through the enthusiastic and single-minded vision of its hero Ralphie, and finding in young Peter Billingsley a sly combination of innocence and calculation. --Roger Ebert, Chicago Sun-Times\", 'About the Actor', \"Peter Billingsley has been a member of the Hollywood community since he was a small child. After appearing on numerous television shows and films during his youth, the Emmy Award-nominated actor delivered a performance for the ages in the beloved holiday film, A Christmas Story (1983). Melinda Dillon made her feature-film debut as an eccentric neighbor of Catherine Deneuve's in The April Fools (1969) and in Steven Spielberg's Close Encounters of the Third Kind (1977). Her warmth fostered two mother roles in the whimsical comedies A Christmas Story (1983) and Harry and the Hendersons (1987).\", 'About the Director', \"Bob Clark is a director known for his '80s movies such as A Christmas Story (1983), Porky's (1982) and Rhinestone (1984).\", 'See more']\n{'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '5.31 x 7.52 x 0.63 inches; 2.33 Ounces', 'Item model number': '3349475', 'Director': 'Bob Clark', 'Media Format': 'Closed-captioned, Color, Full Screen, NTSC', 'Run time': '1 hour and 34 minutes', 'Release date': 'October 30, 2007', 'Actors': 'Peter Billingsley, Melinda Dillon, Darren McGavin, Ian Petrella, Scott Schwartz', 'Subtitles': 'English, French, Spanish', 'Producers': 'Rene Dupont, Bob Clark', 'Studio': 'Studio Distribution Services', 'Writers': 'Jean Sheppard, Leigh Brown', 'Country of Origin': 'USA', 'Number of discs': '1'}\nEvery generation DVD\nONE OF A KIND FOREVER....",
  "profile": "**Updated User Profile Summary:**\n\n- **Movie Genre Preference:** The user maintains a strong appreciation for classic films and continues to expand their interest in documentaries, especially those centered on exploration and adventure. Their engagement with complex narratives blending drama and humor reflects a pursuit of well-crafted storytelling.\n\n- **Format Preference:** The user remains dedicated to the DVD format, valuing the nostalgic connection, practicality, and enhanced viewing experience it offers.\n\n- **Positive Rating Tendencies:** They consistently rate films highly, recently giving a 5-star review to a classic holiday film, indicating their keen eye for quality narratives that resonate across genres.\n\n- **Content Engagement:** The user enjoys a diverse array of cinematic styles, combining classic storytelling with humorous and heartwarming narratives. Their preferences illustrate an evolving cinematic landscape that values both emotional depth and intellectual enrichment.\n\n- **Actors and Directors:** Their admiration for legendary filmmakers and actors spans a variety of genres, highlighting a strong preference for skilled talent that contributes authenticity and charm to their viewing choices.\n\n- **Ease of Purchase:** The user prioritizes seamless purchasing experiences, continuously seeking quality selections to expand their film collection.\n\nOverall, the user is committed to exploring engaging narratives that blend emotional resonance with humor, sustaining a focus on the DVD format while appreciating nuanced storytelling in both classic films and joyous holiday features.",
  "metrics": {
    "rouge1_f": 0.06475020932179737,
    "rouge2_f": 0.00502652890254119,
    "rougeL_f": 0.036840636338264024,
    "meteor": 0.01700640652300524,
    "bleu1": 3.42270464671163e-08,
    "bleu2": 9.720209507594695e-09,
    "bleu3": 3.0753515684024792e-09,
    "bleu4": 9.736530899288328e-10,
    "bertscore_precision": 0.3400236964225769,
    "bertscore_recall": 0.49560314416885376,
    "bertscore_f1": 0.4033302962779999
  }
}