{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Scandal At Scourie (1953)\nReview Date: 2018/10/12\nStore: Greer Garson  (Actor),     Walter Pidgeon  (Actor),     Jean Negulesco  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Studio Specials, Warner Home Video, All Titles\nProduct Description: [\"Legendary Hollywood screen pair Greer Garson and Walter Pidgeon team for the ninth and last time in Scandal at Scourie, a heart-tugging Technicolor drama that has the duo facing obstacles with the kind of unbreakable love that saw them through aerial bombardments in Mrs. Miniver or the challenges of the medical unknown in Madame Curie. Set in Ontario, Canada, the story centers on Victoria and Patrick McChesney, whose decision to adopt an orphaned Catholic girl ignites controversy in their Protestant community. Patrick is accused of using the adoption to appeal to Catholic voeters and advance his political career. Victoria contends with self-righteous whispers about the child's out-of-wedlock birth. And an event in the child's past leads to a fear-mongering change that she is a pyromaniac. Passions and accusations rage. But like a ship plying stormy seas, the McChesney' love for each other and their child will prevail.\"]\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Linda Greer, Jean Negulesco, Agnes Moorehead, Walter Pidgeon, Archer MacDonald, Al Ferguson, Maudie Prickett, Eugene Bordon, Donna Corcoran, Patricia Tiernan, Nolan Leary, Margalo Gillmore, John Lupton, Robert Ross, Warren Farlow, George Davis, Max Willenz, Peter Roman, Philip Ober, Wayne Farlow, Matt Moore, Jack Bonigul, Tony Taylor, Gary Lee Jackson, Wilton Graff, Roger Moore, Howard Negley, Joann Arnold, Greer Garson, Ivan Triesault, Jill Martin, Owen McGiveney, Claude Guy, Michael Pate, Rudy Lee, Earl Lee, Alex Frazer, Philip Tonge, Ivis Goulding, Coral Hammond, Ida Moore, Rhys Williams, Perdita Chandler, Charles Watts, Vicki Joy Ereutzer, Kathleen Hartnagel, John Sherman, Ian Wolfe, Walter Baldwin, Arthur Shields, Victor Wood, Edwin H. KnopfLinda Greer, Jean Negulesco, Agnes Moorehead, Walter Pidgeon, Archer MacDonald, Al Ferguson, Maudie Prickett, Eugene Bordon, Donna Corcoran, Patricia Tiernan, Nolan Leary, Margalo Gillmore, John Lupton, Robert Ross, Warren Farlow, George Davis, Max Willenz, Pe…   See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': 'B00KWP6JOY', 'Director': 'Jean Negulesco', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 13, 2014', 'Actors': 'Greer Garson, Walter Pidgeon, Agnes Moorehead, Donna Corcoran, Arthur Shields', 'Producers': 'Edwin H. Knopf', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: GREAT OLD TIME FAVORITE.......\nReview Title: OLD TIME FAVORITE\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Blink [DVD]\nMadeleine Stowe  (Actor),     Aidan Quinn  (Actor),     Michael Apted  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"A blind woman, whose sight has only recently been restored, thinks she's witnessed a brutal murder. Starring Madeline Stowe and Aidan Quinn. Directed by Michael Apted. Year: 1994 Director: Michael pted Starring: Madeleine Stowe, Aidan Quinn, James Remar\"]\n{'Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Contributor': 'Madeleine Stowe, Michael Kirkpatrick, Caryn Cheever, Ray Clay, Glendon Gabbard, Kathryn Miller, Mark Nagel, Peter Friedman, Laurie Metcalf, Darryl Rocky Davis, Blake Whealy, Aidan Quinn, Renee Lockett-Lawson, Joe McConnell, James Remar, David Callahan, Jackie Samuel, Kevin Swerdlow, Bruce A. Young, Dallas J. Crawford, Ted Gilbert, Rick Le Fevour, Mary Ann Thebus, Mary Seibel, Tim Monsion, Mario Tanzi, Ed Cray, Michael Apted, Sean C. Cleland, Paul Dillon, Kate Buddeke, Joy Gregory, Matt Roth, Valerie Spencer, Greg Noonan, Michael P. Byrne, Michael Stuart Kirkpatrick, Louie, Debra Dusay, Les Podewell, Lia D. Mortensen, Lucina Paquet, Dr. Donna Alexander, Gene Janson, Bob Lanier, Lucy Childs, Anthony Cannata, Sam Sanders, Adele Robbins, Jackie Moran (II), Shirley Spiegler Jacobs, Don Forston, Heather Schwartz, Marilyn Dodds Frank, Kevin Matthews, Craig Winston Damon, Chantal WentworthMadeleine Stowe, Michael Kirkpatrick, Caryn Cheever, Ray Clay, Glendon Gabbard, Kathryn Miller, Mark Nagel, Peter Friedman, Laurie Metcalf, Darryl Rocky Davis, Blake Whealy, Aidan Quinn, Renee Lockett-Lawson, Joe McConnell, James Remar, David Callahan, Jackie Samue…  See more', 'Language': 'English', 'Runtime': '1 hour and 46 minutes', 'Aspect Ratio': '1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.25 x 0.5 inches; 0.01 Ounces', 'Director': 'Michael Apted', 'Media Format': 'AC-3, Closed-captioned, Color, Dolby, DVD, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 46 minutes', 'Release date': 'October 7, 2003', 'Actors': 'Madeleine Stowe, Aidan Quinn, James Remar, Peter Friedman, Bruce A. Young', 'Subtitles': 'English', 'Studio': 'New Line Home Video', 'Number of discs': '1'}\nI enjoyed this movie a real time story. I will keep getting my old time DVD 's from amazon with the ease of purchase.\ngreat movie\nDerailed (Unrated Widescreen)\nJennifer Aniston  (Actor),     Vincent Cassel  (Actor),     Mikael Hafstrom  (Director)    &                   0                  more   Rated:    Unrated    Format: DVD\nMovies & TV, Featured Categories, DVD, Drama\n[\"Advertising executive Charles Schine is just another Chicago commuter who regularly catches the 8:43 A.M. train to work. But the one day he misses his train and meets Lucinda Harris, his life is changed forever. Lucinda is charming, beautiful and seductive. Despite the fact that each are married with children, their attraction to one another is magnetic. Lunch dates quickly become cocktails after work, and before long, Charles and Lucinda's infatuation leads them to a hotel room. Their seemingly perfect affair goes terribly awry when LaRoche, a brutal stranger, breaks into their room and holds them at gunpoint. This once illicit liaison turns into a nightmare more dangerous and violent than either could have ever imagined. Charles' life soon becomes filled with deception, blackmail, violence and crime. Unable to confide in his wife or speak to the police, Charles finds himself trapped in a world he doesn't recognize, with no trace of the life he once knew.\"]\n{'Genre': 'Thriller', 'Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Contributor': 'Jennifer Aniston, Mikael Hafstrom, Tom Conti, Melissa George, Clive Owen, Lorenzo Bonaventura, RZA, Vincent Cassel, Di Bonaventura Pictures; Miramax Films; Patalex V Productions LimitedJennifer Aniston, Mikael Hafstrom, Tom Conti, Melissa George, Clive Owen, Lorenzo Bonaventura, RZA, Vincent Cassel, Di Bonaventura Pictures; Miramax Films; Patalex V Productions Limited   See more', 'Language': 'English (Dolby Digital 2.0), French (Dolby Digital 2.0), Unqualified', 'Runtime': '1 hour and 48 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 3.2 Ounces', 'Item model number': '78649', 'Director': 'Mikael Hafstrom', 'Media Format': 'Multiple Formats, Color, Dolby, Subtitled, Widescreen, NTSC', 'Run time': '1 hour and 48 minutes', 'Release date': 'March 21, 2006', 'Actors': 'Jennifer Aniston, Vincent Cassel, Tom Conti, Melissa George, Clive Owen', 'Subtitles': 'Spanish', 'Producers': 'Lorenzo Bonaventura', 'Studio': 'Lionsgate Home Entertainment', 'Number of discs': '1'}\nLOVED THIS DERAILED MOVIE  GREAT ACTORS\nFive Stars\nThe Professional\nJean Reno  (Actor),     Gary Oldman  (Actor),     Luc Besson  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Jean Reno, Gary Oldman, Natalie Portman and Danny Aiello star in', 'Leon the Professional', ', a go-for-broke thriller about a professional assassin whose work becomes dangerously personal. Calling himself a \"cleaner,\" the mysterious Léon is New York\\'s top hit man. When his next-door neighbors are murdered, Léon becomes the unwilling guardian of the family\\'s sole survivor - 12-year-old Mathilda. But Mathilda doesn\\'t just want protection; she wants revenge. Training her in the deadly tricks of his trade, Léon helps her track the psychotic agent who murdered her family. From the electrifying opening to the fatal finale,', 'Leon the Professional', ', is a nonstop crescendo of action, suspense and surprises. Experience the uncut version, with 24 minutes of footage not included in the original U.S. theatrical version.']\n{'Genre': 'Action, Drama, Thriller, Suspense', 'Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, NTSC', 'Contributor': 'Gary Oldman, Danny Aiello, Jean Reno, Natalie Portman, Les Films du Dauphin, Luc Besson', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified, Spanish (Dolby Digital 2.0 Surround)', 'Runtime': '1 hour and 50 minutes', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 0.56 Ounces', 'Item model number': 'ISBN 0072317949', 'Director': 'Luc Besson', 'Media Format': 'Multiple Formats, Full Screen, Closed-captioned, Color, NTSC', 'Run time': '1 hour and 50 minutes', 'Release date': 'February 24, 1998', 'Actors': 'Jean Reno, Gary Oldman, Natalie Portman, Danny Aiello', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Luc Besson', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nGREAT MOVIE....... Having the actual DVD I can watch it antie anywhere even in the car.....\nGREAT MOVIE\nScandal At Scourie (1953)\nGreer Garson  (Actor),     Walter Pidgeon  (Actor),     Jean Negulesco  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Legendary Hollywood screen pair Greer Garson and Walter Pidgeon team for the ninth and last time in Scandal at Scourie, a heart-tugging Technicolor drama that has the duo facing obstacles with the kind of unbreakable love that saw them through aerial bombardments in Mrs. Miniver or the challenges of the medical unknown in Madame Curie. Set in Ontario, Canada, the story centers on Victoria and Patrick McChesney, whose decision to adopt an orphaned Catholic girl ignites controversy in their Protestant community. Patrick is accused of using the adoption to appeal to Catholic voeters and advance his political career. Victoria contends with self-righteous whispers about the child's out-of-wedlock birth. And an event in the child's past leads to a fear-mongering change that she is a pyromaniac. Passions and accusations rage. But like a ship plying stormy seas, the McChesney' love for each other and their child will prevail.\"]\n{'Genre': 'Drama', 'Format': 'NTSC', 'Contributor': 'Linda Greer, Jean Negulesco, Agnes Moorehead, Walter Pidgeon, Archer MacDonald, Al Ferguson, Maudie Prickett, Eugene Bordon, Donna Corcoran, Patricia Tiernan, Nolan Leary, Margalo Gillmore, John Lupton, Robert Ross, Warren Farlow, George Davis, Max Willenz, Peter Roman, Philip Ober, Wayne Farlow, Matt Moore, Jack Bonigul, Tony Taylor, Gary Lee Jackson, Wilton Graff, Roger Moore, Howard Negley, Joann Arnold, Greer Garson, Ivan Triesault, Jill Martin, Owen McGiveney, Claude Guy, Michael Pate, Rudy Lee, Earl Lee, Alex Frazer, Philip Tonge, Ivis Goulding, Coral Hammond, Ida Moore, Rhys Williams, Perdita Chandler, Charles Watts, Vicki Joy Ereutzer, Kathleen Hartnagel, John Sherman, Ian Wolfe, Walter Baldwin, Arthur Shields, Victor Wood, Edwin H. KnopfLinda Greer, Jean Negulesco, Agnes Moorehead, Walter Pidgeon, Archer MacDonald, Al Ferguson, Maudie Prickett, Eugene Bordon, Donna Corcoran, Patricia Tiernan, Nolan Leary, Margalo Gillmore, John Lupton, Robert Ross, Warren Farlow, George Davis, Max Willenz, Pe…   See more', 'Language': 'English', 'Runtime': '1 hour and 30 minutes', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.5 x 5.5 x 0.5 inches; 0.8 Ounces', 'Item model number': 'B00KWP6JOY', 'Director': 'Jean Negulesco', 'Media Format': 'NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'June 13, 2014', 'Actors': 'Greer Garson, Walter Pidgeon, Agnes Moorehead, Donna Corcoran, Arthur Shields', 'Producers': 'Edwin H. Knopf', 'Studio': 'Warner Archive Collection', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGREAT OLD TIME FAVORITE.......\nOLD TIME FAVORITE",
  "profile": "**Updated User Profile Summary:**\n\n- **Movie Genre Preference:** The user continues to favor engaging narratives, expanding their interest to include classic dramas alongside their primary preference for thrillers. This reflects a broader appreciation for complex emotional dynamics and personal stakes across various film styles.\n- **Format Preference:** Their loyalty to the DVD format persists, demonstrating a nostalgic connection to physical media and the practical advantages it offers for viewing at their convenience.\n- **Positive Rating Tendencies:** The user maintains a trend of consistently awarding high ratings, as evidenced by their latest 5-star review, indicating a discerning taste and notable engagement with films that resonate deeply with them.\n- **Content Engagement:** The user's interest is not limited to contemporary thrillers; they also show an enthusiasm for classic films that capture strong narratives and emotional depth, highlighting their appreciation for multifaceted storytelling in both modern and vintage cinema.\n- **Actors and Directors:** Their continued enthusiasm for established actors and directors is evident, particularly those known for delivering powerful performances and engaging plots, reflecting a preference for familiar talent that enriches the viewing experience.\n- **Ease of Purchase:** They value convenient online purchasing experiences, showcasing a desire for efficiency in acquiring DVDs that align with their refined taste in films.\n\nOverall, the user appreciates skillfully crafted films with rich narratives, remains committed to the DVD format, and seeks quality selections, embracing both thrillers and classic dramas.",
  "metrics": {
    "rouge1_f": 0.10926365795724464,
    "rouge2_f": 0.004756242568370987,
    "rougeL_f": 0.05463182897862232,
    "meteor": 0.031801395157981124,
    "bleu1": 0.0005434123651279035,
    "bleu2": 0.00012759800962490136,
    "bleu3": 2.1392447657787065e-05,
    "bleu4": 8.76690730871943e-06,
    "bertscore_precision": 0.333892822265625,
    "bertscore_recall": 0.44432970881462097,
    "bertscore_f1": 0.3812752366065979
  }
}