{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Unny Club Black Square Lipstick (Magenta) | matte lipstick\nReview Date: 2020/09/08\nStore: UNNY CLUB\nAverage Rating: 3.3\nProduct Details: {'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.8 x 0.91 x 0.87 inches; 1.13 Ounces'}\nReview Text: I liked the very creamy texture, seemed to also be nicely pigmented. However, the magenta had more orangish tones than I would have liked. Still, I liked the lipstick and the tube is pretty cool; it is magnetic and the top snaps back on. I'm sure I would like some of the other colors better though.\nReview Title: Nice texture\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Blue Hair Extensions Tape in Human Hair 16\" Soft Straight Tape-in Brazilian Hair Extensions 30grams 20pcs Glue Remy Hair\nLicoville\n{'Brand': 'Licoville', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Style': 'Straight', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.3 x 4 x 0.7 inches; 1.59 Ounces', 'UPC': '746860435735'}\nMy hair is thin and tends to break off around my shoulders, so I got these for length. I only bought one pack to try them, but will get more. They are super comfortable, don't bother me when sleeping, haven't fallen out or anything, and blend into my hair which is dyed pink and purple fairly well. I have bought blue, pink, and purple so far.<br /><br />However, even though my hair is thin, I will need more than one pack. I'm happy to buy more though, now that I've tried them. I have a looped extensions brush and mostly use dry shampoo so my real hair won't fade too much, but no issues with washing or brushing the extensions.  too. Good value and I like them.\nI was impressed for the price\nUnny Club Black Square Lipstick (Magenta) | matte lipstick\nUNNY CLUB\n{'Brand': 'UNNY CLUB', 'Skin Type': 'Sensitive', 'Item Form': 'Stick', 'Finish Type': 'Matte', 'Age Range (Description)': 'Adult', 'Package Dimensions': '2.8 x 0.91 x 0.87 inches; 1.13 Ounces'}\nI liked the very creamy texture, seemed to also be nicely pigmented. However, the magenta had more orangish tones than I would have liked. Still, I liked the lipstick and the tube is pretty cool; it is magnetic and the top snaps back on. I'm sure I would like some of the other colors better though.\nNice texture",
  "profile": "**User Profile Summary:**\n\n- **Hair Extensions Usage:** User prefers tape-in human hair extensions, specifically looking for comfort and compatibility with dyed hair (pink and purple).\n- **Hair Texture Consideration:** The user has thin hair that tends to break, indicating a preference for lightweight products that do not cause additional damage or discomfort.\n- **Color Variety:** Shows a tendency to experiment with vibrant colors, having purchased extensions in blue, pink, and purple.\n- **Product Satisfaction:** Reports a positive initial experience with the first pack of extensions, leading to an intention to buy additional packs, suggesting a willingness to invest in products that meet their needs.\n- **Care Routine:** Utilizes a looped extensions brush and dry shampoo, indicating a proactive approach to maintaining the extensions and protecting the natural hair color.\n- **Value Sensitivity:** Considers price relative to value, expressing satisfaction for the product received at a reasonable cost.\n- **Cosmetic Preferences:** Enjoys cosmetics with creamy textures and good pigmentation, favoring products that are visually appealing and functional. Open to trying different shades, although prefers to avoid certain undertones.\n- **Overall Impression:** User values comfort, quality, and effectiveness in hair extensions and makeup, leaning towards products that integrate seamlessly with their unique style while being aesthetically pleasing.",
  "metrics": {
    "rouge1_f": 0.2973523421588595,
    "rouge2_f": 0.08997955010224949,
    "rougeL_f": 0.1710794297352342,
    "meteor": 0.15990311071769547,
    "bleu1": 0.21372382243088048,
    "bleu2": 0.0994900073164459,
    "bleu3": 0.06017931604159484,
    "bleu4": 0.040444684261099255,
    "bertscore_precision": 0.4285983443260193,
    "bertscore_recall": 0.4852786660194397,
    "bertscore_f1": 0.4551807940006256
  }
}