{
  "interaction_number": 1,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Blue Hair Extensions Tape in Human Hair 16\" Soft Straight Tape-in Brazilian Hair Extensions 30grams 20pcs Glue Remy Hair\nReview Date: 2019/08/10\nStore: Licoville\nAverage Rating: 2.6\nProduct Details: {'Brand': 'Licoville', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Style': 'Straight', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.3 x 4 x 0.7 inches; 1.59 Ounces', 'UPC': '746860435735'}\nReview Text: My hair is thin and tends to break off around my shoulders, so I got these for length. I only bought one pack to try them, but will get more. They are super comfortable, don't bother me when sleeping, haven't fallen out or anything, and blend into my hair which is dyed pink and purple fairly well. I have bought blue, pink, and purple so far.<br /><br />However, even though my hair is thin, I will need more than one pack. I'm happy to buy more though, now that I've tried them. I have a looped extensions brush and mostly use dry shampoo so my real hair won't fade too much, but no issues with washing or brushing the extensions.  too. Good value and I like them.\nReview Title: I was impressed for the price\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Blue Hair Extensions Tape in Human Hair 16\" Soft Straight Tape-in Brazilian Hair Extensions 30grams 20pcs Glue Remy Hair\nLicoville\n{'Brand': 'Licoville', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Style': 'Straight', 'Hair Type': 'Straight', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.3 x 4 x 0.7 inches; 1.59 Ounces', 'UPC': '746860435735'}\nMy hair is thin and tends to break off around my shoulders, so I got these for length. I only bought one pack to try them, but will get more. They are super comfortable, don't bother me when sleeping, haven't fallen out or anything, and blend into my hair which is dyed pink and purple fairly well. I have bought blue, pink, and purple so far.<br /><br />However, even though my hair is thin, I will need more than one pack. I'm happy to buy more though, now that I've tried them. I have a looped extensions brush and mostly use dry shampoo so my real hair won't fade too much, but no issues with washing or brushing the extensions.  too. Good value and I like them.\nI was impressed for the price",
  "profile": "**User Profile Summary:**\n\n- **Hair Extensions Usage:** User prefers tape-in human hair extensions, specifically looking for comfort and compatibility with dyed hair (pink and purple).\n- **Hair Texture Consideration:** The user has thin hair that tends to break, indicating a preference for lightweight products that do not cause additional damage or discomfort.\n- **Color Variety:** Shows a tendency to experiment with vibrant colors, having purchased extensions in blue, pink, and purple.\n- **Product Satisfaction:** Reports a positive initial experience with the first pack, leading to an intention to buy additional packs, suggesting a willingness to invest in products that meet their needs.\n- **Care Routine:** Utilizes a looped extensions brush and dry shampoo, indicating a proactive approach to maintaining the extensions and protecting the natural hair color.\n- **Value Sensitivity:** Considers price relative to value, expressing satisfaction for the product received at a reasonable cost.\n- **Overall Impression:** User values comfort, quality, and effectiveness in hair extensions, leaning towards products that integrate seamlessly with their unique style. \n\nThis summary captures key aspects of the user's preferences and behavior based on their review.",
  "metrics": {
    "rouge1_f": 0.3018867924528302,
    "rouge2_f": 0.11382113821138212,
    "rougeL_f": 0.1940700808625337,
    "meteor": 0.17964386852881076,
    "bleu1": 0.29075084965085435,
    "bleu2": 0.14863616517265102,
    "bleu3": 0.09277190590712502,
    "bleu4": 0.06334204389701274,
    "bertscore_precision": 0.46175283193588257,
    "bertscore_recall": 0.48409414291381836,
    "bertscore_f1": 0.4726596474647522
  }
}