{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Soccer Training:Backyard Soccer Drills\nReview Date: 2014/05/30\nStore: Lou Fratello  (Actor),     Soccer Tips  (Actor),     Marty Schupak  (Director),     Soccer Fundamentals  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Featured Categories, DVD, Kids & Family\nProduct Description: ['Product description', \"Opened but little-viewed, from private home...nice! ISBN 0-9748517-5-2. ** Buy more than one of our other soccer and basketball videos and we'll pay for shipping.\", 'Review', '\" 100% pure fun! Communities will love this \" --', 'Paul Fetonti, League Soccer coach', '\"a soccer mom & dad\\'s delight! Skills, fun & creativity\". --', 'Bruce Lambin, 25 Year Youth Coach', '\"an excellent resource for all soccer enthusiasts\" --', 'Michael Pfahl, National Alliance of Youth Sports', '\"quality drills in the confines in one\\'s own backyard. A definite score! --', 'Ralph Sharaga, Parent & Youth Coach']\nAverage Rating: 4.3\nProduct Details: {'Genre': 'Kids & Family, Sports', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Lou Fratello, Soccer Fundamentals, Soccer Equipment, Soccer Skills, Marty Schupak, Soccer Coaching, Youth Soccer, Soccer TipsLou Fratello, Soccer Fundamentals, Soccer Equipment, Soccer Skills, Marty Schupak, Soccer Coaching, Youth Soccer, Soccer Tips   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.84 Ounces', 'Director': 'Marty Schupak, Soccer Fundamentals, Soccer Coaching, Youth Soccer', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '36 minutes', 'Release date': 'January 29, 2005', 'Actors': 'Lou Fratello, Soccer Tips, Soccer Equipment, Soccer Skills', 'Studio': 'Youth Sports Club', 'Number of discs': '1'}\nReview Text: This video is a backyard production. Or that quality, the price could have been cheaper. A few important techniques are  covered but without a clear and concise understanding of the basics - it's a little hard to follow. If you are a coach and have played for years - this is a great video to use as an add on to your training. It reinforces a few important techniques!\nReview Title: It's hard to follow\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Frozen\nKristen Bell  (Actor),     Josh Gad  (Actor),     Chris Buck  (Director, Writer),     Jennifer Lee  (Director, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', \"Fearless optimist Anna teams up with Kristoff in an epic journey, encountering Everest-like conditions, and a hilarious snowman named Olaf in a race to find Anna's sister Elsa, whose icy powers have trapped the kingdom in eternal winter.\", 'Amazon.com', 'A sweet, magical film filled with great music, likable characters, and striking effects,', 'Frozen', 'is a fairy tale about overcoming obstacles and the power of true love. Princesses Anna and Elsa are sisters and the closest friends until one day Elsa discovers that she can no longer control her power to create ice and snow. Terrified for the safety of her sister and everyone around her, Elsa isolates herself and vows to never feel any sort of passionate emotion again in hopes of suppressing her powers. But when Elsa comes of age and is set to be crowned queen, she must open the gates of the palace and let in the public, not to mention her sister Anna. Things go horribly wrong and Anna pursues her sister into the mountains in an attempt to save Elsa and reverse the deep freeze that Elsa has inadvertently released on the kingdom of Arendelle. Along the way, Anna joins forces with Kristoff (Jonathan Groff), an ice seller with a strangely close relationship with his reindeer Sven, and Olaf (Josh Gad), a goofy snowman whom she suddenly remembers from early childhood. In the end, Anna and Elsa discover that only by embracing their deepest feelings do they have a chance of saving themselves and the kingdom. Inspired by \"The Snow Queen\" story by Hans Christian Andersen, the film has plenty of quirky, lovable characters along with a nice blend of corny humor, serious sentiment, suspense, and peril. Kristen Bell and Idina Menzel deliver rousing performances of great music that includes original songs by Kristen Anderson-Lopez and Robert Lopez and an original score by Christophe Beck, and the visual effects are simply stunning.', 'Frozen', 'definitely succeeds in captivating audiences young, old, and every age in between.', '--Tami Horiuchi']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Contributor': 'Jennifer Lee, Hans Christian Andersen, Kristen Bell, Menzel, John Lasseter, Chris Williams, Aimee Scribner, Jonathan Groff, Gad, Idina Menzel, Ciarán Hinds, Santino Fontana, Maia Wilson, Josh Gad, Alan Tudyk, Shane Morris, Groff, Bell, Stephen J. Anderson, Chris BuckJennifer Lee, Hans Christian Andersen, Kristen Bell, Menzel, John Lasseter, Chris Williams, Aimee Scribner, Jonathan Groff, Gad, Idina Menzel, Ciarán Hinds, Santino Fontana, Maia Wilson, Josh Gad, Alan Tudyk, Shane Morris, Groff, Bell, Stephen J. Anderson, Chris Buck  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '11941900', 'Director': 'Chris Buck, Jennifer Lee', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '1 hour and 42 minutes', 'Release date': 'March 18, 2014', 'Actors': 'Kristen Bell, Josh Gad, Idina Menzel, Jonathan Groff, Santino Fontana', 'Subtitles': 'French, Spanish, English', 'Producers': 'Aimee Scribner, John Lasseter', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Chris Buck, Hans Christian Andersen, Jennifer Lee, Shane Morris', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis film is great - and that is coming from a Disney hater! I haven't liked a Disney movie since The Fox & The Hound. However, the storyline of Frozen is awesome. At first you think this is going to be another big sister is a monster and poor little sister needs a man to save her and make all her decisions for her. Then you see that big sister is just in need of love and little sister is just in need of her big sister. The cute boy turns into the villian and the regular joe turns into the hottie with a HUGE heart! Plus the snowman is wonderfully loving and encouraging! I love that this fairytale's happy ending is family empowering! I love that this fairytale's happy ending doesn't stomp on any one difference in characters. except the rottenness of a selfish person. I really love this movie and so does my 14yo son!\nNot your everyday Disney movie\nRemember the Titans (Widescreen Edition)\nDenzel Washington  (Actor),     Will Patton  (Actor),     Boaz Yakin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Product Description', 'Academy Award(R)-winner Denzel Washington (Best Actor, TRAINING DAY, 2001) gives a victorious performance in this stirring and uplifting film. REMEMBER THE TITANS is a rousing celebration of how a town torn apart by resentment, friction, and mistrust comes together in triumphant harmony. The year is 1971. After leading his team to 15 winning seasons, football coach Bill Yoast (Will Patton) is demoted and replaced by Herman Boone (Washington), tough, opinionated, and as different from the beloved Yoast as he could be. How these two men overcome their differences and turn a group of hostile young men into champions, plays out in a remarkable and triumphant story full of soul and spirit. You and your family will never forget the Titans.', 'Amazon.com', \"With only one major star (Denzel Washington), an appealing cast of fresh unknowns, and a winning emphasis of substance over self-indulgent style, Boaz Yakin's\", 'Remember the Titans', 'is, like', 'Rudy', 'before it, a football movie that will be fondly remembered by anyone who sees it.', \"Set in Alexandria, Virginia, in 1971, the fact-based story begins with the integration of black and white students at T. C. Williams High School. This effort to improve race relations is most keenly felt on the school's football team, the Titans, and bigoted tempers flare when a black head coach (Washington) is appointed and his victorious predecessor (Will Patton) reluctantly stays on as his assistant. It's affirmative action at its most potentially volatile, complicated by the mandate that the coach will be fired if he loses a single game in the Titans' 13-game season. The players represent a hotbed of racial tension, but as the team struggles toward unity and gridiron glory,\", 'Remember the Titans', 'builds on several subplots and character dynamics to become an inspirational drama of', 'Rocky', '-like proportions.', 'Yakin--whose debut,', 'Fresh', \", was one of the best independent films of the 1990s--understands the value of connecting small scenes to form a rich climactic payoff. Likewise, Washington provides a solid dramatic foundation (his coach is obsessively harsh, but for all the right reasons) while giving his younger co-stars ample time in the spotlight. The result is a film that achieves what it celebrates: an enriching sense of unity that's unquestionably genuine. (Ages 9 and older)\", '--Jeff Shannon']\n{'Genre': 'Drama, ACTION, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, THXMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, THX  See more', 'Contributor': 'Nicole Ari Parker, Denzel Washington, Donald Adeosun Faison, Gregory Allen Howard, Ethan Suplee, Neal Ghant, Will Patton, Burgess Jenkins, Kip Pardue, Craig Kirkwood, Hayden Panettiere, Wood Harris, Ryan Gosling, Boaz Yakin, Kate Bosworth, Ryan Hurst, Earl PoitierNicole Ari Parker, Denzel Washington, Donald Adeosun Faison, Gregory Allen Howard, Ethan Suplee, Neal Ghant, Will Patton, Burgess Jenkins, Kip Pardue, Craig Kirkwood, Hayden Panettiere, Wood Harris, Ryan Gosling, Boaz Yakin, Kate Bosworth, Ryan Hurst, Earl Poitier  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified, English (DTS 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936144727', 'Director': 'Boaz Yakin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, THX', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 20, 2001', 'Actors': 'Denzel Washington, Will Patton, Wood Harris, Ryan Hurst, Donald Adeosun Faison', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Gregory Allen Howard', 'Number of discs': '1'}\nDuring a time when things were trying to change course along came a team to forge ahead. It's a touching movie with a almost happy ending. The power of love is strong and the sense to do what is good is even stronger.\nOne of Denzel's best.\nSoccer Training:Backyard Soccer Drills\nLou Fratello  (Actor),     Soccer Tips  (Actor),     Marty Schupak  (Director),     Soccer Fundamentals  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product description', \"Opened but little-viewed, from private home...nice! ISBN 0-9748517-5-2. ** Buy more than one of our other soccer and basketball videos and we'll pay for shipping.\", 'Review', '\" 100% pure fun! Communities will love this \" --', 'Paul Fetonti, League Soccer coach', '\"a soccer mom & dad\\'s delight! Skills, fun & creativity\". --', 'Bruce Lambin, 25 Year Youth Coach', '\"an excellent resource for all soccer enthusiasts\" --', 'Michael Pfahl, National Alliance of Youth Sports', '\"quality drills in the confines in one\\'s own backyard. A definite score! --', 'Ralph Sharaga, Parent & Youth Coach']\n{'Genre': 'Kids & Family, Sports', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Lou Fratello, Soccer Fundamentals, Soccer Equipment, Soccer Skills, Marty Schupak, Soccer Coaching, Youth Soccer, Soccer TipsLou Fratello, Soccer Fundamentals, Soccer Equipment, Soccer Skills, Marty Schupak, Soccer Coaching, Youth Soccer, Soccer Tips   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.84 Ounces', 'Director': 'Marty Schupak, Soccer Fundamentals, Soccer Coaching, Youth Soccer', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '36 minutes', 'Release date': 'January 29, 2005', 'Actors': 'Lou Fratello, Soccer Tips, Soccer Equipment, Soccer Skills', 'Studio': 'Youth Sports Club', 'Number of discs': '1'}\nThis video is a backyard production. Or that quality, the price could have been cheaper. A few important techniques are  covered but without a clear and concise understanding of the basics - it's a little hard to follow. If you are a coach and have played for years - this is a great video to use as an add on to your training. It reinforces a few important techniques!\nIt's hard to follow",
  "profile": "**User Profile Summary**\n\nThis user continues to showcase a strong appreciation for animated films, especially from Disney, reflecting a thoughtful engagement with narratives that focus on empowerment, emotional connections, and personal growth. They favor stories that emphasize family bonds, resilience, and meaningful life lessons, aligning with their inclination toward emotionally rich content.\n\nRecently, they expressed an interest in inspirational dramas that address unity and overcoming adversity, emphasizing their preference for narratives that challenge societal norms and celebrate triumph. The user values well-developed characters and emotional arcs that resonate with their appreciation for family-oriented stories. They enjoy light-hearted elements balanced with deeper themes, as seen in their enthusiasm for films with uplifting messages and positive resolutions.\n\nThe user's latest interaction reveals a burgeoning interest in sports-related content, particularly resources that aid coaching and skill development. Their feedback indicates a nuanced understanding of instructional materials, revealing a thoughtful approach to learning and improvement, whether in sports or cinema.\n\nOverall, their viewing preferences encompass a diverse range of genres, showcasing a comprehensive appreciation for storytelling that fosters connection, resilience, and inspiration, while also venturing into practical learning within the realm of physical activities.",
  "metrics": {
    "rouge1_f": 0.09338122113904566,
    "rouge2_f": 0.005136106831022086,
    "rougeL_f": 0.04720369420215495,
    "meteor": 0.03067350493826699,
    "bleu1": 1.919302106286364e-05,
    "bleu2": 5.553125816171749e-06,
    "bleu3": 8.536865336877649e-07,
    "bleu4": 3.351010547648151e-07,
    "bertscore_precision": 0.320473849773407,
    "bertscore_recall": 0.4801984429359436,
    "bertscore_f1": 0.38440456986427307
  }
}