{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2022/03/03\nAverage Rating: 3.2\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kipp Tribble'], 'Producers': ['Kipp Tribble', 'Kenny Yates', 'Patrick Rivera'], 'Starring': ['Bruce Davison', 'Andrea Sweeney Blanco', 'Kipp Tribble'], 'Studio': ['Terror Films']}\nReview Text: This film was fun to watch. Scary. Makes you careful about opening the door. The drug addict character is great!!! The scary guys are freaky.\nReview Title: The drug addict is a great character\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Frozen\nKristen Bell  (Actor),     Josh Gad  (Actor),     Chris Buck  (Director, Writer),     Jennifer Lee  (Director, Writer)    &                   1                  more   Rated:    PG    Format: DVD\nMovies & TV, Award Winners in Movies & TV, Oscar Central, Past Oscar Winners\n['Product Description', \"Fearless optimist Anna teams up with Kristoff in an epic journey, encountering Everest-like conditions, and a hilarious snowman named Olaf in a race to find Anna's sister Elsa, whose icy powers have trapped the kingdom in eternal winter.\", 'Amazon.com', 'A sweet, magical film filled with great music, likable characters, and striking effects,', 'Frozen', 'is a fairy tale about overcoming obstacles and the power of true love. Princesses Anna and Elsa are sisters and the closest friends until one day Elsa discovers that she can no longer control her power to create ice and snow. Terrified for the safety of her sister and everyone around her, Elsa isolates herself and vows to never feel any sort of passionate emotion again in hopes of suppressing her powers. But when Elsa comes of age and is set to be crowned queen, she must open the gates of the palace and let in the public, not to mention her sister Anna. Things go horribly wrong and Anna pursues her sister into the mountains in an attempt to save Elsa and reverse the deep freeze that Elsa has inadvertently released on the kingdom of Arendelle. Along the way, Anna joins forces with Kristoff (Jonathan Groff), an ice seller with a strangely close relationship with his reindeer Sven, and Olaf (Josh Gad), a goofy snowman whom she suddenly remembers from early childhood. In the end, Anna and Elsa discover that only by embracing their deepest feelings do they have a chance of saving themselves and the kingdom. Inspired by \"The Snow Queen\" story by Hans Christian Andersen, the film has plenty of quirky, lovable characters along with a nice blend of corny humor, serious sentiment, suspense, and peril. Kristen Bell and Idina Menzel deliver rousing performances of great music that includes original songs by Kristen Anderson-Lopez and Robert Lopez and an original score by Christophe Beck, and the visual effects are simply stunning.', 'Frozen', 'definitely succeeds in captivating audiences young, old, and every age in between.', '--Tami Horiuchi']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Contributor': 'Jennifer Lee, Hans Christian Andersen, Kristen Bell, Menzel, John Lasseter, Chris Williams, Aimee Scribner, Jonathan Groff, Gad, Idina Menzel, Ciarán Hinds, Santino Fontana, Maia Wilson, Josh Gad, Alan Tudyk, Shane Morris, Groff, Bell, Stephen J. Anderson, Chris BuckJennifer Lee, Hans Christian Andersen, Kristen Bell, Menzel, John Lasseter, Chris Williams, Aimee Scribner, Jonathan Groff, Gad, Idina Menzel, Ciarán Hinds, Santino Fontana, Maia Wilson, Josh Gad, Alan Tudyk, Shane Morris, Groff, Bell, Stephen J. Anderson, Chris Buck  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1)', 'Runtime': '1 hour and 42 minutes', 'Aspect Ratio': '2.20:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '11941900', 'Director': 'Chris Buck, Jennifer Lee', 'Media Format': 'Multiple Formats, Animated, Color, Dolby, NTSC, Subtitled, Widescreen, DTS Surround Sound', 'Run time': '1 hour and 42 minutes', 'Release date': 'March 18, 2014', 'Actors': 'Kristen Bell, Josh Gad, Idina Menzel, Jonathan Groff, Santino Fontana', 'Subtitles': 'French, Spanish, English', 'Producers': 'Aimee Scribner, John Lasseter', 'Studio': 'Walt Disney Studios Home Entertainment', 'Writers': 'Chris Buck, Hans Christian Andersen, Jennifer Lee, Shane Morris', 'Country of Origin': 'USA', 'Number of discs': '1'}\nThis film is great - and that is coming from a Disney hater! I haven't liked a Disney movie since The Fox & The Hound. However, the storyline of Frozen is awesome. At first you think this is going to be another big sister is a monster and poor little sister needs a man to save her and make all her decisions for her. Then you see that big sister is just in need of love and little sister is just in need of her big sister. The cute boy turns into the villian and the regular joe turns into the hottie with a HUGE heart! Plus the snowman is wonderfully loving and encouraging! I love that this fairytale's happy ending is family empowering! I love that this fairytale's happy ending doesn't stomp on any one difference in characters. except the rottenness of a selfish person. I really love this movie and so does my 14yo son!\nNot your everyday Disney movie\nRemember the Titans (Widescreen Edition)\nDenzel Washington  (Actor),     Will Patton  (Actor),     Boaz Yakin  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Fully Loaded DVDs, DTS\n['Product Description', 'Academy Award(R)-winner Denzel Washington (Best Actor, TRAINING DAY, 2001) gives a victorious performance in this stirring and uplifting film. REMEMBER THE TITANS is a rousing celebration of how a town torn apart by resentment, friction, and mistrust comes together in triumphant harmony. The year is 1971. After leading his team to 15 winning seasons, football coach Bill Yoast (Will Patton) is demoted and replaced by Herman Boone (Washington), tough, opinionated, and as different from the beloved Yoast as he could be. How these two men overcome their differences and turn a group of hostile young men into champions, plays out in a remarkable and triumphant story full of soul and spirit. You and your family will never forget the Titans.', 'Amazon.com', \"With only one major star (Denzel Washington), an appealing cast of fresh unknowns, and a winning emphasis of substance over self-indulgent style, Boaz Yakin's\", 'Remember the Titans', 'is, like', 'Rudy', 'before it, a football movie that will be fondly remembered by anyone who sees it.', \"Set in Alexandria, Virginia, in 1971, the fact-based story begins with the integration of black and white students at T. C. Williams High School. This effort to improve race relations is most keenly felt on the school's football team, the Titans, and bigoted tempers flare when a black head coach (Washington) is appointed and his victorious predecessor (Will Patton) reluctantly stays on as his assistant. It's affirmative action at its most potentially volatile, complicated by the mandate that the coach will be fired if he loses a single game in the Titans' 13-game season. The players represent a hotbed of racial tension, but as the team struggles toward unity and gridiron glory,\", 'Remember the Titans', 'builds on several subplots and character dynamics to become an inspirational drama of', 'Rocky', '-like proportions.', 'Yakin--whose debut,', 'Fresh', \", was one of the best independent films of the 1990s--understands the value of connecting small scenes to form a rich climactic payoff. Likewise, Washington provides a solid dramatic foundation (his coach is obsessively harsh, but for all the right reasons) while giving his younger co-stars ample time in the spotlight. The result is a film that achieves what it celebrates: an enriching sense of unity that's unquestionably genuine. (Ages 9 and older)\", '--Jeff Shannon']\n{'Genre': 'Drama, ACTION, LIVE', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, THXMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, THX  See more', 'Contributor': 'Nicole Ari Parker, Denzel Washington, Donald Adeosun Faison, Gregory Allen Howard, Ethan Suplee, Neal Ghant, Will Patton, Burgess Jenkins, Kip Pardue, Craig Kirkwood, Hayden Panettiere, Wood Harris, Ryan Gosling, Boaz Yakin, Kate Bosworth, Ryan Hurst, Earl PoitierNicole Ari Parker, Denzel Washington, Donald Adeosun Faison, Gregory Allen Howard, Ethan Suplee, Neal Ghant, Will Patton, Burgess Jenkins, Kip Pardue, Craig Kirkwood, Hayden Panettiere, Wood Harris, Ryan Gosling, Boaz Yakin, Kate Bosworth, Ryan Hurst, Earl Poitier  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Unqualified, English (DTS 5.1)', 'Runtime': '1 hour and 53 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.75 x 5.75 x 0.5 inches; 2.4 Ounces', 'Item model number': '786936144727', 'Director': 'Boaz Yakin', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, DTS Surround Sound, NTSC, Widescreen, THX', 'Run time': '1 hour and 53 minutes', 'Release date': 'March 20, 2001', 'Actors': 'Denzel Washington, Will Patton, Wood Harris, Ryan Hurst, Donald Adeosun Faison', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Gregory Allen Howard', 'Number of discs': '1'}\nDuring a time when things were trying to change course along came a team to forge ahead. It's a touching movie with a almost happy ending. The power of love is strong and the sense to do what is good is even stronger.\nOne of Denzel's best.\nSoccer Training:Backyard Soccer Drills\nLou Fratello  (Actor),     Soccer Tips  (Actor),     Marty Schupak  (Director),     Soccer Fundamentals  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Kids & Family\n['Product description', \"Opened but little-viewed, from private home...nice! ISBN 0-9748517-5-2. ** Buy more than one of our other soccer and basketball videos and we'll pay for shipping.\", 'Review', '\" 100% pure fun! Communities will love this \" --', 'Paul Fetonti, League Soccer coach', '\"a soccer mom & dad\\'s delight! Skills, fun & creativity\". --', 'Bruce Lambin, 25 Year Youth Coach', '\"an excellent resource for all soccer enthusiasts\" --', 'Michael Pfahl, National Alliance of Youth Sports', '\"quality drills in the confines in one\\'s own backyard. A definite score! --', 'Ralph Sharaga, Parent & Youth Coach']\n{'Genre': 'Kids & Family, Sports', 'Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Contributor': 'Lou Fratello, Soccer Fundamentals, Soccer Equipment, Soccer Skills, Marty Schupak, Soccer Coaching, Youth Soccer, Soccer TipsLou Fratello, Soccer Fundamentals, Soccer Equipment, Soccer Skills, Marty Schupak, Soccer Coaching, Youth Soccer, Soccer Tips   See more', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.75 x 0.53 inches; 3.84 Ounces', 'Director': 'Marty Schupak, Soccer Fundamentals, Soccer Coaching, Youth Soccer', 'Media Format': 'Multiple Formats, Color, Full Screen, NTSC', 'Run time': '36 minutes', 'Release date': 'January 29, 2005', 'Actors': 'Lou Fratello, Soccer Tips, Soccer Equipment, Soccer Skills', 'Studio': 'Youth Sports Club', 'Number of discs': '1'}\nThis video is a backyard production. Or that quality, the price could have been cheaper. A few important techniques are  covered but without a clear and concise understanding of the basics - it's a little hard to follow. If you are a coach and have played for years - this is a great video to use as an add on to your training. It reinforces a few important techniques!\nIt's hard to follow\nPirates of the Caribbean: Dead Man's Chest\nJohnny Depp  (Actor),     Orlando Bloom  (Actor),     Gore Verbinski  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, Live Action, All Titles\n['Product Description', \"Charming rogue pirate Captain Jack Sparrow (Johnny Depp) is back for a grand, swashbuckling, nonstop joyride filled with devilish pirate humor, monstrous sea creatures, and breathtaking black magic. Now Jack's got a blood debt to pay -- he owes his soul to the legendary Davy Jones, ghostly Ruler of the Ocean Depths . . . but ever-crafty Jack isn't about to go down without a fight. Along the way, dashing Will Turner (Orlando Bloom) and the beautiful Elizabeth Swann (Keira Knightley) get caught up in the thrilling whirlpool of misadventures stirred up in Jack's quest to avoid eternal damnation by seizing the fabled Dead Man's Chest!\", 'Amazon.com', 'Take the first', 'Pirates of the Caribbean', 'film, add a dash of', '20,000 Leagues Under the Sea', \"and a lot more rum. Shake well and you'll have something resembling\", \"Dead Man's Chest\", \", a bombastic sequel that's enjoyable as long as you don't think too hard about it. The film opens with the interrupted wedding of Will Turner (Orlando Bloom) and Elizabeth Swann (Keira Knightley), both of whom are arrested for aiding in the escape of Captain Jack Sparrow (Johnny Depp) in the first film. Their freedom can only be obtained by getting Captain Jack's compass, which is linked to a key that's linked to a chest belonging to Davy Jones, an undead pirate with a tentacle face and in possession of a lot of people's souls. If you're already confused, don't worry--plot is definitely not the strong suit of the franchise, as the film excels during its stunt pieces, which are impressively extravagant (in particular a three-way swordfight atop a mill wheel). It may help to know that Dead Man's Chest was filmed simultaneously with some of\", 'Pirates 3', \", so don't expect a complete resolution (think more\", 'The Empire Strikes Back', ') or the movie will feel a', 'lot', 'longer than it really is.', \"Bloom shows a tad bit more brawn this time around, but he's still every bit as pretty as the tomboyish Knightley. (Seriously, sometimes you think they could swap roles.) Bill Nighy (\", 'Love, Actually', \") weighs in as Davy Jones and Stellan Skarsgård appears as Will's undead father. But the film still belongs wholly to Depp, who in a reprise of his Oscar-nominated role gets all the belly laughs with a single widened eyeliner-ed gaze. He still runs like a cartoon hen and slurs like Keith Richards--and he's still one of the most fascinating movie characters in recent history.\", '--Ellen A. Kim', 'More', 'Pirates', 'at Amazon.com', 'Johnny Depp DVDs', 'Buy', 'Pirates of the Caribbean: Curse of the Black Pearl', 'Buy the Soundtrack']\n{'Genre': 'Action/Adventure', 'Format': 'Color, Dolby, Dubbed, NTSC, Subtitled, THX, Widescreen', 'Contributor': 'Lee Arenberg, Johnny Depp, Jonathan Pryce, Mackenzie Crook, Stellan Skarsgard, Gore Verbinski, Naomie Harris, Keira Knightley, Jack Davenport, Kevin R. McNally, Bill Nighy, Terry Rossio, Orlando Bloom, Ted ElliottLee Arenberg, Johnny Depp, Jonathan Pryce, Mackenzie Crook, Stellan Skarsgard, Gore Verbinski, Naomie Harris, Keira Knightley, Jack Davenport, Kevin R. McNally, Bill Nighy, Terry Rossio, Orlando Bloom, Ted Elliott  See more', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 5.1), Spanish (Dolby Digital 5.1), Unqualified', 'Runtime': '2 hours and 31 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.6 x 5.3 x 7.5 inches; 2.72 Ounces', 'Item model number': 'WD04098900DVD', 'Director': 'Gore Verbinski', 'Media Format': 'Color, Dolby, Dubbed, NTSC, Subtitled, THX, Widescreen', 'Run time': '2 hours and 31 minutes', 'Release date': 'December 5, 2006', 'Actors': 'Johnny Depp, Orlando Bloom, Keira Knightley, Stellan Skarsgard, Bill Nighy', 'Dubbed': 'French, Spanish', 'Subtitles': 'Spanish, French', 'Studio': 'WALT DISNEY PICTURES', 'Writers': 'Ted Elliott, Terry Rossio', 'Country of Origin': 'USA', 'Number of discs': '1'}\nOf course you know what you are getting. But this movie is great! It had a fantastic and mind blowing budget - so the post effects are great. The talent old and new is great. The locations and set design make the whole movie amazing! Of course the storyline is cute too! If you're thinking of buying - just do it. !!!\nOf course you know what you are getting.\nThe League: Season 2\nKatie Aselton  (Actor),     Mark Duplass  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['Product Description', \"Suit up for Season 2 of The League, the hilarious fantasy football comedy that elevates humiliation to an art form. After a wild road trip to Vegas to kick off the draft, the season hits its stride as Taco finds a toilet seat made out of cocaine, Ruxin goes to outrageous lengths to meet an NFL player, and Pete fashions a league loser's trophy from a bull's privates. Keep your head on a swivel for guest stars like Chad Ochocinco, Terrell Suggs and Josh Cribbs - plus unrated bonus features that go so far out of bounds, the censor must have swallowed his whistle!\", 'Amazon.com', 'Season two of', 'The League', 'finds our gleeful and endlessly petty competitors launching into a new football season--and because well-to-do nebbish Andre (Paul Scheer of comedy troupe Human Giant) won the last Shiva Bowl, he takes schemer Pete (mumblecore auteur Mark Duplass), hapless Kevin (Stephen Rannazzisi), insecure Ruxin (Nick Kroll), and dimwitted Taco (Jonathan Lajoie) to Vegas, where he has pimped out their trophy in his own image. Kevin\\'s wife Jenny (Katie Aselton) follows, demanding to be let into the league, which the men resist. But the series (now increased to 19 episodes) quickly returns to its natural environment of the urban and suburban wilds of Chicago, where everyone tries to undermine and take advantage of everyone else in the name of winning. Season two has found its groove, nicely balancing league skullduggery with other storylines, ranging from Kevin and Jenny\\'s daughter developing a potty mouth to a monkey stolen from a petting zoo to a high school reunion. The show occasionally veers into antics that are just a little too absurd (a sequence in which Ruxin drags Andre into a trial as an expert witness stretches credulity); it\\'s much more effective when the it digs into the well-observed social interplay, such as when Pete grandly lets Ruxin choose his lineup for an impending match, sending Ruxin into a frenzy of second-guessing. Also, the writers have a knack for coining terms and phrases that genuinely sound like the in-jokes of close friends, such as \"rosterbating\" and \"chameleon boyfriend\" (to mention some of the more printable ones). It\\'s hard to comprehend why these reprehensible people are engaging to watch, but somehow they are.', 'The League', 'will give you no understanding of how fantasy football leagues work, but you will come away with a play-by-play diagram of the male ego.', '--Bret Fetzer']\n{'Genre': 'TV', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen, Subtitled', 'Contributor': 'Mark Duplass, Katie Aselton, Nick Kroll', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4 Ounces', 'Item model number': 'MFR024543729358#VG', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen, Subtitled', 'Run time': '4 hours and 46 minutes', 'Release date': 'October 4, 2011', 'Actors': 'Katie Aselton, Mark Duplass, Nick Kroll', 'Subtitles': 'French, English, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nThe cover, case, and cd are of superb quality. However, the contents of the cd are not so great. I am pretty sure this review isn't about the show itself - so I will leave out my hardcore thoughts. I will say that unless you don't care about the content your kid watches, this isn't a good show for anyone under 16 or so... They are crude and .... Wait I said I wasn't going to critique the show. So yeah. great quality case and cd.\nThe cd quality is great\nThe League: Season 4\nJon Lajoie  (Actor),     Mark Duplass  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n[\"America's favorite pastime talking smack to your buddies and making their lives miserable is elevated to hilarious new heights in the uproarious Season Four of The League. This season kicks off with the arrival of Kevin and Jenny's baby...and the race to the Shiva Bowl is on! As Taco tangles with Chicago Bears great Jim McMahon and Andre's tailgating plans go horribly awry, the rest of the guys contend with dirty trades, circumcision debates, breast-a-lyzers and blackmail. Make these outrageously funny Season Four episodes of The League your number-one draft pick!\"]\n{'Genre': 'Comedy/Television', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Contributor': 'Nadine Velazquez, Jon Lajoie, Jonathan Lajoie, Mark Duplass, Stephen Rannazzisi, Katie Aselton, Nick Kroll, Paul Scheer, The LeagueNadine Velazquez, Jon Lajoie, Jonathan Lajoie, Mark Duplass, Stephen Rannazzisi, Katie Aselton, Nick Kroll, Paul Scheer, The League  See more', 'Language': 'English (Dolby Digital 5.1), Unqualified (Dolby Digital 5.1)', 'Number Of Discs': '2', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.93 Ounces', 'Item model number': '27461262', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '4 hours and 41 minutes', 'Release date': 'September 3, 2013', 'Actors': 'Jon Lajoie, Mark Duplass, Katie Aselton, Paul Scheer, Jonathan Lajoie', 'Subtitles': 'English, French, Spanish', 'Studio': '20th Century Fox', 'Number of discs': '2'}\nThe cover, case, and cd are of superb quality. However, the contents of the cd are not so great. I am pretty sure this review isn't about the show itself - so I will leave out my hardcore thoughts. I will say that unless you don't care about the content your kid watches, this isn't a good show for anyone under 16 or so... They are crude and .... Wait I said I wasn't going to critique the show. So yeah. great quality case and cd.\nWell if you must\nFoster's Home for Imaginary Friends - The Complete Season 1\nKeith Ferguson  (Actor),     Grey DeLisle  (Actor),     Craig McCracken  (Director),     Craig Kellman  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n[\"Foster's Home for Imaginary Friends is centered around, Bloo, an imaginary friend created by 8-year-old Mac. When Mom says Mac is too old for Bloo, Mac takes him to Madam Foster's Home for Imaginary Friends a vast Victorian mansion with endless rooms and hundreds of imaginary friends. At Foster's, wherever Bloo goes, mischief and mayhem follow!\"]\n{'Genre': 'Kids & Family, Animation', 'Format': 'Color, Animated, NTSC, Closed-captioned', 'Contributor': 'Keith Ferguson, Craig McCracken, Rob Renzetti, Grey DeLisle, Tom Kenny, Eric Pringle, Craig Kellman, Sean Marquette, Phil LaMarrKeith Ferguson, Craig McCracken, Rob Renzetti, Grey DeLisle, Tom Kenny, Eric Pringle, Craig Kellman, Sean Marquette, Phil LaMarr   See more', 'Language': 'French (Dolby Digital 2.0 Surround), English (Dolby Digital 2.0 Stereo), Spanish (Dolby Digital 2.0 Stereo), Unqualified', 'Number Of Discs': '2', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 3.21 Ounces', 'Item model number': '2228715', 'Director': 'Craig McCracken, Craig Kellman, Rob Renzetti, Eric Pringle', 'Media Format': 'Color, Animated, NTSC, Closed-captioned', 'Run time': '4 hours and 54 minutes', 'Release date': 'March 6, 2007', 'Actors': 'Keith Ferguson, Grey DeLisle, Sean Marquette, Phil LaMarr, Tom Kenny', 'Dubbed': 'Spanish, French', 'Subtitles': 'English, Spanish, French', 'Studio': 'Turner Home Entertainment', 'Number of discs': '2'}\nBlooregaurd Kazoo - It is Hawr in Toe Pee kah! Bloo is awesome - so of course this is awesome. The jokes are at the right level for a 4th or 5th grade level. There is a lot of value in these cartoon shows. Brightly colored and well scripted!\nBloo!!!!!\nZoolander (2001)\nVarious  (Actor, Director)    Rated:    PG-13    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Zoolander (DVD)', \"Clear the runway for Derek Zoolander (Ben Stiller), VH1's three-time mal e model of the year. His face falls when hippie-chic Hansel (Owen Wilson ) scooters in to steal this year's award. The evil fashion guru Mugatu ( Will Ferrell) seizes the opportunity to turn Der ek into a killing machi ne. It's a well-designed conspiracy and only with the help of Hansel and a few well-chosen accessories like M atilda (Christine Taylor) can Dere k make the world safe for male models everywhere.\", ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC', 'Contributor': 'Various', 'Runtime': '54 minutes', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Director': 'Various', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC', 'Run time': '54 minutes', 'Release date': 'March 12, 2002', 'Actors': 'Various', 'Language': 'English (Dolby Digital 5.1)', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nSo stupid it almost got funny.\nSlapstick humor\nTrading Places\nEddie Murphy  (Actor),     Dan Aykroyd  (Actor),     John Landis  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Warner Home Video, All Titles\n['Trading Places (DVD)', \"What happens when you combine the comic genius of Eddie Murphy with Dan Aykroyd and director John Landis? You get a timeless comedy classic lace d with sidesplitting, satiric humor. Murphy stars as a small-time con ar tist who gets a chance to switch lives with Aykr oyd's big-time stock ma rket maven. But their reversal of fortunes is just a cruel joke perpetra ted by two bored mega-rich brothers ( Don Ameche and Ralph Bellamy) as p art of an idle bet. When the truth comes out...the consequences are shee r comedy gold!\", ']]>']\n{'Genre': 'Comedy', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Eddie Murphy, Dan Aykroyd, Don Ameche, Denholm Elliott, John Landis, Ralph Bellamy', 'Language': 'English (Dolby Digital 5.1), French (Mono), Spanish (Mono)', 'Runtime': '1 hour and 10 minutes', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '370618', 'Director': 'John Landis', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 10 minutes', 'Release date': 'June 5, 2007', 'Actors': 'Eddie Murphy, Dan Aykroyd, Denholm Elliott, Ralph Bellamy, Don Ameche', 'Dubbed': 'Portuguese, French', 'Subtitles': 'English', 'Studio': 'Warner Bros.', 'Number of discs': '1'}\nDan and Eddie - almost as crazy funny as Gene and Richard... Good movie - funny storylilne - silly role-reversal depiction\nFunny\n{'Audio languages': ['English'], 'Subtitles': ['None available'], 'Directors': ['Arthur Pierson'], 'Producers': ['Bernard Ebert', 'Mike Stokey'], 'Starring': ['Taylor Holmes', 'Patrick Whyte', 'Queenie Leonard'], 'Studio': ['The Film Detective', 'LLC']}\nOld time classic display of an old written classic. It's nice to see a film storyline that follows the actual story! Black and white brings a greater command of the original aurhor's struggle with morality, humanity and generosity expressed in love for a fellow human. A reminder of how far we've currently strayed from loving our neighbors as ourselves.\nA must watch\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Troy Miller'], 'Producers': ['Mark Canton', 'Irving Azoff'], 'Starring': ['Michael Keaton', 'Kelly Preston', 'Mark Addy'], 'Studio': ['WARNER BROS.']}\nThis is a cute, good life lesson Christmas movie!\nCute talking snowman\nXanadu\nOlivia Newton-John  (Actor),     Gene Kelly  (Actor),     Robert Greenwald  (Director)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['Step into a magical world with superstars Olivia Newton-John (Grease) and Gene Kelly (Singin\\' in the Rain) as they take you through one of the most extraordinary musicals in the beloved film, Xanadu! A beautiful muse is sent from up above to inspire a struggling artist and help motivate him to open a roller-disco. The dazzling soundtrack includes the hit songs \"Magic,\" \"I\\'m Alive,\" \"All Over the World,\" \"Suddenly\" and the title song \"Xanadu.\" Throw on your roller-skates, turn up the volume and enjoy this sparkling out-of-this world fantasy!', 'Bonus Content:', 'Going Back to Xanadu', 'Going Back to Xanadu', 'Photo Gallery', 'Photo Gallery', 'Theatrical Trailer', 'Theatrical Trailer', ']]>']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '1108544', 'Director': 'Robert Greenwald', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC', 'Run time': '1 hour and 36 minutes', 'Release date': 'February 3, 2009', 'Actors': 'Olivia Newton-John, Gene Kelly, Michael Beck, The Tubes, Sandahl Bergman', 'Dubbed': 'French', 'Subtitles': 'English, Spanish, French', 'Producers': 'Lawrence Gordon', 'Language': 'English (Dolby Digital 5.1), French (Dolby Digital 2.0), Spanish (Dolby Digital 2.0 Stereo)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'John Farrar, Electric Light Orchestra', 'Country of Origin': 'USA', 'Number of discs': '1'}\nChildhood classic.\nNow we are here in Xanadu!!\n{'Content advisory': ['Violence', 'foul language'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Christopher Nolan'], 'Producers': ['Emma Thomas', 'Christopher Nolan'], 'Starring': ['Fionn Whitehead', 'Tom Glynn-Carney', 'Jack Lowden'], 'Studio': ['WARNER BROS.']}\nIn those moments when we choose what is right, even at our own risk for danger, the world is a better place.\nGreat movie. Even better life lesson.\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Kipp Tribble'], 'Producers': ['Kipp Tribble', 'Kenny Yates', 'Patrick Rivera'], 'Starring': ['Bruce Davison', 'Andrea Sweeney Blanco', 'Kipp Tribble'], 'Studio': ['Terror Films']}\nThis film was fun to watch. Scary. Makes you careful about opening the door. The drug addict character is great!!! The scary guys are freaky.\nThe drug addict is a great character",
  "actual_interaction": {
    "rating": 5.0,
    "title": "The drug addict is a great character",
    "text": "This film was fun to watch. Scary. Makes you careful about opening the door. The drug addict character is great!!! The scary guys are freaky.",
    "images": [],
    "asin": "B09PV8LQ9M",
    "parent_asin": "B09PV8LQ9M",
    "user_id": "AEV6W24ZQKBLESVSET5QFU3L6DSQ",
    "timestamp": "2022-03-03 04:02:13.028000",
    "helpful_vote": 1,
    "verified_purchase": true,
    "main_category": "Prime Video",
    "title_meta": null,
    "average_rating": 3.2,
    "rating_number": 21,
    "features": null,
    "description": null,
    "price": null,
    "images_meta": [
      {
        "360w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX360_FMwebp_.jpg",
        "480w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX480_FMwebp_.jpg",
        "720w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX720_FMwebp_.jpg",
        "1080w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1080_FMwebp_.jpg",
        "1440w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1440_FMwebp_.jpg",
        "1920w": "https://m.media-amazon.com/images/G/01/digital/video/web/Default_Background_Art_LTR._SX1920_FMwebp_.jpg",
        "variant": "MAIN"
      }
    ],
    "videos": [],
    "store": null,
    "categories": null,
    "details": {
      "Audio languages": [
        "English"
      ],
      "Subtitles": [
        "English [CC]"
      ],
      "Directors": [
        "Kipp Tribble"
      ],
      "Producers": [
        "Kipp Tribble",
        "Kenny Yates",
        "Patrick Rivera"
      ],
      "Starring": [
        "Bruce Davison",
        "Andrea Sweeney Blanco",
        "Kipp Tribble"
      ],
      "Studio": [
        "Terror Films"
      ]
    },
    "bought_together": null,
    "subtitle": null,
    "author": NaN
  }
}