{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The 100: Season 1\nReview Date: 2019/02/17\nStore: Eliza Taylor  (Actor),     Paige Turco  (Actor)    Rated:    NR    Format: DVD\nCategories: Movies & TV, Genre for Featured Categories, Drama\nProduct Description: ['The 100: The Complete First Season (DVD)', 'It’s been nearly 100 years since Earth was devastated by a nuclear apocalypse, with the only survivors being the 400 inhabitants of 12 international space stations that were in orbit at the time. Three generations later, the survivors number 4,000 — and resources are running out on their dying “Ark” (the 12 stations now linked together and repurposed to keep the survivors alive). Draconian measures including capital punishment and population control are the order of the day, as the leaders of the Ark take ruthless steps to ensure their future — including secretly exiling a group of 100 juvenile prisoners to the Earth’s surface to test whether it’s habitable. No one has set foot on the planet in nearly a century — until now. For the 100 on Earth, the alien planet they’ve never known is a mysterious realm that can be magical one moment and lethal the next.', ']]>']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, NTSC, Subtitled', 'Contributor': 'Elizabeth Craft, Eliza Taylor, Jason Rothenberg, Thomas McDonell, Paige Turco', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 4.8 Ounces', 'Item model number': '883929424382', 'Media Format': 'Multiple Formats, NTSC, Subtitled', 'Run time': '9 hours and 32 minutes', 'Release date': 'September 23, 2014', 'Actors': 'Eliza Taylor, Paige Turco, Thomas McDonell', 'Subtitles': 'Spanish, French', 'Producers': 'Jason Rothenberg, Elizabeth Craft', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nReview Text: Multiple scratches on disc 1 result in pauses and gaps in play.<br />Good show though.\nReview Title: Disappointed\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "Supernatural: Season 11 [DVD]\nJared Padalecki  (Actor),     Jensen Ackles  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Television\n['Supernatural: The Complete Eleventh Season (DVD)', \"The thrilling and terrifying journey of the Winchester brothers continues as SUPERNATURAL enters its 11th season. In the show's tenth season, the Winchesters faced their most personal threat yet. The all-powerful Mark of Cain threatened to consume Dean, turning him into one of the monsters he has spent his life hunting. Meanwhile, a formidable witch, Rowena, rose to power to claim her position at the right hand of the King of Hell, Crowley (Mark A. Sheppard). Once Rowena revealed herself to be Crowley's mother, the King was forced to choose between his family and the Winchesters - all while Sam, with the help of fallen angel Castiel (Misha Collins), Crowley, and some unlikely allies, wages a desperate battle to save Dean from the Mark of Cain. Will Sam be able to find a cure for the Mark in time? Will it be enough to save his brother? And a more frightening prospect ... does Dean even want to be saved?\", ']]>']\n{'Genre': 'Horror, Drama, Action & Adventure', 'Format': 'Box set, AC-3, Dolby, DVD, NTSC, Subtitled', 'Contributor': 'Jared Padalecki, Jeremy Carver, Mark Sheppard, Jensen Ackles, Misha Collins, Phil Sgriccia', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '6', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 7.84 Ounces', 'Media Format': 'Box set, AC-3, Dolby, DVD, NTSC, Subtitled', 'Run time': '16 hours and 52 minutes', 'Release date': 'September 6, 2016', 'Actors': 'Jared Padalecki, Jensen Ackles, Misha Collins, Mark Sheppard', 'Dubbed': 'English, Japanese', 'Subtitles': 'Portuguese, Spanish, French, Thai, Korean', 'Producers': 'Jeremy Carver, Phil Sgriccia', 'Studio': 'Studio Distribution Services', 'Number of discs': '6'}\nPretty much awesome as ever!\nLove it!\nA Company Man\nJi-seob So  (Actor),     Mi-yeon Lee  (Actor),     Sang-yoon Lim  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Independently Distributed, Action & Adventure\n['Product Description', \"Hyeong-do (SO Ji-sub) goes to the office every day, but isn't thrilled with the cubicles, the politics, his co-workers, or the management. His job is murder. Literally. At this company, death is all in a day's work. Hyeong-do is a corporate assassin, working for a company specializing in contract killings. He's one of the best, and a loyal employee. But when his new trainee gets killed on the job, he feels an obligation to care for the kid's family and taking his eye off the ball is not how a guy gets promoted. Now, Hyeong-do wants out of the cutthroat rat race to start a new life, but his colleagues have different plans - and retirement may come at a far bloodier price than expected.\", 'Review', '\"Slick and effective\" --Controlled Burning\"A blackly satirical comedy\" --Film Business Asia']\n{'Genre': 'Action & Adventure/Thrillers', 'Format': 'Multiple Formats, Color, Dolby, NTSC, THX, Widescreen', 'Contributor': 'Mi-yeon Lee, Sang-yoon Lim, Dong-jun Kim, Ji-seob So, Kyeong-yeong Lee, Do Won Kwak', 'Language': 'English', 'Runtime': '1 hour and 36 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WGUS1428DVD', 'Director': 'Sang-yoon Lim', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, THX, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'August 27, 2013', 'Actors': 'Ji-seob So, Mi-yeon Lee, Do Won Kwak, Dong-jun Kim, Kyeong-yeong Lee', 'Subtitles': 'English', 'Studio': 'Well Go Usa', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat movie. Fast shipping. Price so good I thought I was buying used and was surprised to get new!\nVery Happy\nA Better Tomorrow [DVD]\nLung Ti  (Actor),     Leslie Cheung  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['A Better Tomorrow']\n{'Format': 'Anamorphic, Color, Dolby, DVD, Widescreen, NTSC', 'Contributor': 'Leslie Cheung, John Woo, Waise Lee, Hing-Ka Chan, Kwok Leung Cheung, Lung Ti, Yun-Fat Chow, Suk-Wah Leung, Chi Fai Chan, San Nam Hung, Kenneth Tsang, Fui-On Shing, Hark Tsui, Emily ChuLeslie Cheung, John Woo, Waise Lee, Hing-Ka Chan, Kwok Leung Cheung, Lung Ti, Yun-Fat Chow, Suk-Wah Leung, Chi Fai Chan, San Nam Hung, Kenneth Tsang, Fui-On Shing, Hark Tsui, Emily Chu   See more', 'Language': 'English (Dolby Digital 2.0 Mono), Cantonese (Dolby Digital 5.1)', 'Runtime': '1 hour and 35 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '9 x 5.5 x 0.5 inches; 2.4 Ounces', 'Director': 'John Woo', 'Media Format': 'Anamorphic, Color, Dolby, DVD, Widescreen, NTSC', 'Run time': '1 hour and 35 minutes', 'Release date': 'January 16, 2001', 'Actors': 'Lung Ti, Leslie Cheung, Yun-Fat Chow, Emily Chu, Waise Lee', 'Subtitles': 'English', 'Studio': 'Starz / Anchor Bay', 'Writers': 'Hing-Ka Chan, John Woo, Suk-Wah Leung', 'Number of discs': '1'}\nFast Shipping, Good Price and a Chow Yun Fat Hong Kong flick...perfection!\nPerfect!\nThe Suspect\nGong Yoo  (Actor),     Hee-Soon Park  (Actor),     Sin-Yeon  (Director)    &                   0                  more   Format: DVD\nMovies & TV, Independently Distributed, Action & Adventure\n['Product Description', 'Dong-chul (Gong Yoo) is the best field agent in North Korea – until he is abandoned during a mission, his wife and daughter murdered. Hunted and on the run, torn between grief and vengeance, he takes a job as a night driver for the CEO of a powerful corporation. The chairman is brutally assassinated – but gives Dong-chul a pair of glasses before he dies. Now, he’s on the run again. Accused of murder, wanted for treason, and desperate to uncover the volatile national secrets hidden inside the glasses. Dong-Chul wants the truth. And he’ll start a war to get it.', 'DVD EXTRAS', 'English subtitles', 'Review', '“One of the best popcorn movies of the year” – The Seattle Times “Grown up and deadly serious” – Phildelphia Enquirer “Stunning set pieces” – The Los Angeles Times “Dizzying” – The Washington Post']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, THX', 'Contributor': 'You Jeong-Hun, Yoo Da-In, Sin-Yeon, Jo Seong-Ha, Jo Jae-Yoon Won, Kim Seong-Gyoon, Gong Yoo, Hee-Soon Park, Lee Hyun-Myung, Lim Sang-yunYou Jeong-Hun, Yoo Da-In, Sin-Yeon, Jo Seong-Ha, Jo Jae-Yoon Won, Kim Seong-Gyoon, Gong Yoo, Hee-Soon Park, Lee Hyun-Myung, Lim Sang-yun  See more', 'Language': 'Korean (Dolby Digital 5.1), Korean (Dolby Digital 2.0 Stereo)', 'Runtime': '2 hours and 17 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': 'WGUS1550DVD', 'Director': 'Sin-Yeon', 'Media Format': 'Multiple Formats, Color, Dolby, NTSC, Subtitled, Widescreen, THX', 'Run time': '2 hours and 17 minutes', 'Release date': 'July 22, 2014', 'Actors': 'Gong Yoo, Hee-Soon Park, Jo Seong-Ha, Yoo Da-In, Kim Seong-Gyoon', 'Subtitles': 'English', 'Producers': 'Lee Hyun-Myung, You Jeong-Hun', 'Studio': 'Well Go Usa', 'Writers': 'Lim Sang-yun', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat price, fast shipping and a fantastic movie!\nFantastic!\nStargate SG-1: S2 (VIVA/DVD)\nRichard Dean Anderson  (Actor),     Amanda Tapping  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sci Fi Channel, All Sci Fi Channel Shows\n['Stargate SG-1: S2 (VIVA/DVD)', ']]>']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7 x 5.5 x 0.75 inches; 11.2 Ounces', 'Item model number': '2221662', 'Media Format': 'Subtitled, Color, Widescreen, NTSC', 'Run time': '16 hours and 13 minutes', 'Release date': 'July 6, 2020', 'Actors': 'Richard Dean Anderson, Amanda Tapping, Christopher Judge, Michael Shanks', 'Language': 'Unqualified, English (Dolby Surround), French (Dolby Surround), Spanish (Dolby Surround)', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '5'}\nIt's a new dvd...hard to give it a bad rating.\nSeason 2\nStargate SG-1: Season 3\nRichard Dean Anderson  (Actor),     Amanda Tapping  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Studio Specials, Sci Fi Channel, All Sci Fi Channel Shows\n['Repackaged']\n{'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Michael Shanks, Richard Dean Anderson, Christopher Judge, Don S. Davis, Amanda Tapping, Teryl RotheryMichael Shanks, Richard Dean Anderson, Christopher Judge, Don S. Davis, Amanda Tapping, Teryl Rothery   See more', 'Language': 'English (Dolby Surround), French (Dolby Surround), Unqualified, Spanish (Dolby Surround)', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '7 x 5.5 x 1 inches; 6.4 Ounces', 'Item model number': '2221663', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Dolby, NTSC, Widescreen', 'Run time': '16 hours and 13 minutes', 'Release date': 'June 13, 2006', 'Actors': 'Richard Dean Anderson, Amanda Tapping, Christopher Judge, Michael Shanks, Don S. Davis', 'Studio': 'WarnerBrothers', 'Country of Origin': 'USA', 'Number of discs': '5'}\nNew dvd, as expected.\nGreat\nWolf Warrior\nJacky Wu  (Actor, Director),     Scott Adkins  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Featured Categories, DVD, Action & Adventure\n['Product Description', 'A Chinese special force soldier with extraordinary marksmanship is confronted by a group of deadly foreign mercenaries who are hired to assassinate him by a vicious drug lord.', 'Review', '\"Some of the most breathtaking martial arts combat scenes we\\'ve seen in quite some time\" --MovieCricket.com\"[WOLF WARRIOR is] what happens when you put two of the world\\'s most gifted fighters on screen together\" --Twitch\"[Wu Jing and Scott Adkins are] two of the best martial arts actors working today\" --Asian Film Strike']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '1639', 'Director': 'Jacky Wu', 'Media Format': 'Color, Dolby, NTSC, Multiple Formats, Subtitled, Widescreen, THX', 'Run time': '1 hour and 30 minutes', 'Release date': 'September 1, 2015', 'Actors': 'Jacky Wu, Scott Adkins, Kevin Lee', 'Subtitles': 'English', 'Language': 'English (Dolby Digital 2.0), English (Dolby Digital 5.1)', 'Studio': 'Well Go Usa', 'Number of discs': '1'}\nGreat movie. Fast ship. Quality product.\nGreat!\nKill Zone\nDonnie Yen  (Actor),     Simon Yam  (Actor),     Wilson Yip  (Director)    &                   0                  more   Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Lionsgate Home Entertainment, All Lionsgate Titles\n['A near retired inspector and his unit are willing to put down a crime boss at all costs while dealing with his replacement, who is getting in their way. Meanwhile, the crime boss sends his top henchmen to put an end to their dirty schemes.']\n{'Genre': 'Action', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Contributor': 'Donnie Yen, Simon Yam, Sammo Hung, Jing Wu, Wilson Yip, Carl Chang', 'Language': 'English (Dolby Digital 5.1)', 'Runtime': '1 hour and 33 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 4.8 Ounces', 'Item model number': 'DRGY79575DVD', 'Director': 'Wilson Yip', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Widescreen', 'Run time': '1 hour and 33 minutes', 'Release date': 'September 12, 2006', 'Actors': 'Donnie Yen, Simon Yam, Sammo Hung, Jing Wu', 'Subtitles': 'English, Spanish', 'Producers': 'Carl Chang', 'Studio': 'Lionsgate', 'Number of discs': '2'}\nFast ship, quality product, great flick.\nGreat!\nStargate Atlantis: Season 4\nJoe Flanigan  (Actor),     David Hewlett  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Studio Specials, Sci Fi Channel, All Sci Fi Channel Shows\n['Product Description', \"The STARGATE universe is exhilaratingly expanded and the epic feel of the franchise is perfected in this acclaimed spin-off of the STARGATE SG-1 series, itself spun-off from the 1994 blockbuster from director Roland Emmerich. In STARGATE: ATLANTIS, an international crew of scientists and soldiers finds yet another Stargate... one which leads to the Lost City of Atlantis. This Stargate, though, isn't on Earth but in the far-away Pegasus Galaxy, and the secret city holds a formidable new enemy-the Wraith. With this fourth season of the hit sci-fi series, things take a turn in a bleak new direction, with team leader Dr. Weir injured and captured by the evil Asurans as the damaged city of Atlantis drifts through space. Features: 5-Disc Set Keep Case Widescreen - 1.78 Audio: Dolby Digital 5.1 Surround - English Subtitles - English, French, Spanish Additional Release Material: Behind the Scenes - (4) Clips/ Highlights - Excerpts a Look Back at Season 4 Deleted Scenes: 1. Stargate Atlantis Bloopers 2. Line 21 - VAM, Deleted Scenes Text/ Photo Galleries - 1. Photo Gallery (Unspecified) 2. Production Design Gallery Episodes (20) Runtime: 900 minutes.\", 'Amazon.com', 'Replicators and Wraith. ZPMs and hyperdrives. Good guys, bad guys, and guys who could go either way. They’re all on hand for the fourth season (originally aired in 2007-08) of', 'Stargate Atlantis', ', still one of television’s finest sci-fi shows. There are a number of new developments in the course of this 20-episode run. The first is the departure of leader Dr. Elizabeth Weir (Torri Higginson), who’s gone from the team by the third episode, replaced by Col. Samantha Carter (Amanda Tapping, who will be familiar to', 'Stargate SG-1', 'fans after her long stint on that now-defunct series); seems Weir’s body contains “nanites,” the elements that make up the “sentient machines” known as the Replicators, which leads to her making a supreme sacrifice on behalf of her fellow humans. (Speaking of the Replicators, these bad boys are so formidable a threat to the entire known universe that even the Wraith--the cat-eyed, white-haired, weird-skinned, vampire-like Johnny Winter lookalikes who feed on humans--fear them, resulting in a rather fraught, on-again-off-again alliance with the Stargaters. Unfortunately, the Replicator-Wraith showdown, which could have made Godzilla v. Megalon look like a game of tag, isn’t exploited to nearly the degree one might have wished for.)', 'Meanwhile, the team’s personal lives are examined more closely this time, as Teyla (Rachel Luttrell) becomes pregnant, dreadlocked beefcake dude Ronon (Jason Momoa) considers rejoining his original tribe, irreverent hero Lt. Col. John Sheppard (Joe Flanigan) returns to Earth for his father’s funeral (where he runs into his ex-wife and estranged brother), and genius scientist Dr. Rodney McKay (David Hewlett, a good actor whose character’s incessant glass-half-empty, pessimistic whining is getting a bit old by now) once again meets up with his sister, who also made an appearance in Season Three. Overall, the fourth season contains several terrific stories (like “Adrift,” in which the entire city of Atlantis heads into space in search of a new home planet, “Tabula Rasa,” in which the crew is infected with amnesia, and “Trio,” described by its creators as the most logistically complex episode of the entire series), and a smattering that aren’t so hot. As always,', 'Atlantis', 'has terrific special effects, sets, and action (this show ain’t cheap to produce, and it shows), plenty of wit (Sheppard, upon being served a strange-looking meal by his captors: “Is that a form of torture?”), and a very generous selection of bonus features, which include commentaries for every episode, featurettes, and photo galleries.', '--Sam Graham', 'Beyond', 'Stargate: Atlantis – Season Four', 'on DVD', 'Stargate: Atlantis', '– Season One on DVD', 'Stargate: Atlantis', '– Season Two on DVD', 'Stargate: Atlantis', '– Season Three on DVD', 'Stills from', 'Stargate: Atlantis', '- Season Four (Click for larger image)']\n{'Genre': 'Science Fiction & Fantasy/Television, Television', 'Format': 'Multiple Formats, Color, Widescreen, Box set, NTSC', 'Contributor': 'Jason Momoa, David Hewlett, Amanda Tapping, Joe Flanigan, Torri Higginson', 'Language': 'Unqualified', 'Number Of Discs': '5', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.96 x 5.46 x 7.64 inches; 0.01 Ounces', 'Item model number': '4460882608', 'Media Format': 'Multiple Formats, Color, Widescreen, Box set, NTSC', 'Run time': '13 hours and 47 minutes', 'Release date': 'July 8, 2008', 'Actors': 'Joe Flanigan, David Hewlett, Jason Momoa, Torri Higginson, Amanda Tapping', 'Subtitles': 'English, French, Spanish', 'Studio': 'WarnerBrothers', 'Number of discs': '5'}\nSince disc 3 is covered with fine scratches and does not work at all ..<br /><br />Yeah, gonna have to go with One star.\nTerrifically Underwhelmed\nThe 100: Season 1\nEliza Taylor  (Actor),     Paige Turco  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Drama\n['The 100: The Complete First Season (DVD)', 'It’s been nearly 100 years since Earth was devastated by a nuclear apocalypse, with the only survivors being the 400 inhabitants of 12 international space stations that were in orbit at the time. Three generations later, the survivors number 4,000 — and resources are running out on their dying “Ark” (the 12 stations now linked together and repurposed to keep the survivors alive). Draconian measures including capital punishment and population control are the order of the day, as the leaders of the Ark take ruthless steps to ensure their future — including secretly exiling a group of 100 juvenile prisoners to the Earth’s surface to test whether it’s habitable. No one has set foot on the planet in nearly a century — until now. For the 100 on Earth, the alien planet they’ve never known is a mysterious realm that can be magical one moment and lethal the next.', ']]>']\n{'Genre': 'Drama, Fantasy, Science Fiction', 'Format': 'Multiple Formats, NTSC, Subtitled', 'Contributor': 'Elizabeth Craft, Eliza Taylor, Jason Rothenberg, Thomas McDonell, Paige Turco', 'Language': 'English (Dolby Digital 5.1)', 'Number Of Discs': '3', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 5.4 x 7.5 inches; 4.8 Ounces', 'Item model number': '883929424382', 'Media Format': 'Multiple Formats, NTSC, Subtitled', 'Run time': '9 hours and 32 minutes', 'Release date': 'September 23, 2014', 'Actors': 'Eliza Taylor, Paige Turco, Thomas McDonell', 'Subtitles': 'Spanish, French', 'Producers': 'Jason Rothenberg, Elizabeth Craft', 'Studio': 'Studio Distribution Services', 'Number of discs': '3'}\nMultiple scratches on disc 1 result in pauses and gaps in play.<br />Good show though.\nDisappointed",
  "profile": "**Updated User Profile Summary:**\n\n- **Interests**: The user continues to enjoy supernatural themes, horror, drama, action-thriller genres, and has a growing appreciation for impactful storytelling in Korean and Chinese cinema, along with martial arts films featuring charismatic actors from Hong Kong and South Korea.\n\n- **Content Type**: They favor comprehensive boxed sets and standalone films, particularly within action-adventure and martial arts genres, while showing an interest in science fiction series as well.\n\n- **Format Preference**: The user remains loyal to DVDs, valuing high-quality audio and subtitle options essential for their viewing experience.\n\n- **Engagement**: They actively engage with favored actors and directors across various genres while exploring independent and international films, demonstrating curiosity for global cinema.\n\n- **Rating Behavior**: Typically, the user rates content highly, reflecting satisfaction with their purchases. However, their recent experience with a damaged disc has led to a more critical perspective when it comes to product quality, as evidenced by a low rating for a recent purchase due to playback issues. They maintain high expectations for the integrity of the products, with a strong emphasis on presentation quality, particularly for box sets.\n\nThis latest interaction reinforces the user’s commitment to high-quality presentations and their readiness to express disappointment when expectations are not met, further highlighting their focus on character-driven storytelling.",
  "metrics": {
    "rouge1_f": 0.07759155803848541,
    "rouge2_f": 0.009316770186335402,
    "rougeL_f": 0.039726877715704524,
    "meteor": 0.022866878381024802,
    "bleu1": 8.552674612984533e-08,
    "bleu2": 3.172643757417614e-08,
    "bleu3": 4.120190388805335e-09,
    "bleu4": 1.4861791197044928e-09,
    "bertscore_precision": 0.3438693583011627,
    "bertscore_recall": 0.4922579526901245,
    "bertscore_f1": 0.4048962891101837
  }
}