{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: FENJUN HAIR Silky Straight Lace Front Wigs with Baby Hair Pre plucked Frontal Natural Looking Synthetic Hair Middle Parting 2# Black Color Long Straight Wigs for Women Girls\nReview Date: 2021/05/03\nStore: FENJUN HAIR\nAverage Rating: 2.9\nProduct Details: {'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Straight', 'Brand': 'FENJUN HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.38 x 9.29 x 1.57 inches; 14.39 Ounces'}\nReview Text: Good wig. I personally wouldn’t wear as an everyday wig, without a hat. It is soft, but you can tell this wig is synthetic by touch. The shine looks more natural, shine is not terrible. I would definitely use if I needed a wig for a costume. This wig does shed if you run your fingers through it, but it isn’t terrible shedding.\nReview Title: Good wig overall\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "25mm 3D Mink Lashes Full Volume Mink Eyelashes Fluffy Volume Dramatic 25mm Mink Lashes Extension Cruelty-free Siberian Mink Strip Eyelashes……… (LJ632AMIX)\nHICOCU\n['25mm 3D Mink Lashes Full Volume Mink Eyelashes Fluffy Volume Dramatic 25mm Mink Lashes Extension Cruelty-free Siberian Mink Strip Eyelashes']\n{'Color': 'LJ632AMIX', 'Brand': 'HICOCU', 'Material': 'Silk, Faux Mink, Mink Fur', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Package Dimensions': '5.43 x 5.31 x 0.75 inches; 0.63 Ounces', 'Manufacturer': 'HICOCU'}\nCute packaging. Lashes look and feel great. I tried on the longest/fullest pair.\nGreat lashes\nFENJUN HAIR Silky Straight Lace Front Wigs with Baby Hair Pre plucked Frontal Natural Looking Synthetic Hair Middle Parting 2# Black Color Long Straight Wigs for Women Girls\nFENJUN HAIR\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Straight', 'Brand': 'FENJUN HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.38 x 9.29 x 1.57 inches; 14.39 Ounces'}\nGood wig. I personally wouldn’t wear as an everyday wig, without a hat. It is soft, but you can tell this wig is synthetic by touch. The shine looks more natural, shine is not terrible. I would definitely use if I needed a wig for a costume. This wig does shed if you run your fingers through it, but it isn’t terrible shedding.\nGood wig overall",
  "profile": "**User Summary:**\n\n- **Beauty Products**: The user has a strong preference for high-quality beauty enhancements, specifically focusing on eyelashes, but has also shown interest in wigs as an alternative beauty accessory.\n- **Product Material**: Values cruelty-free, high-end materials; the recent wig purchase indicates an acceptance of synthetic products for specific occasions, though they still showcase a preference for natural aesthetics.\n- **Aesthetic Preferences**: Prefers dramatic, fluffy, and voluminous lash styles, alongside an inclination towards natural-looking wigs, demonstrating a desire for bold yet realistic appearance.\n- **Quality Over Quantity**: Consistently rates products highly, reflecting a keen eye for detail and quality. The wig purchase received a favorable rating, indicating a nuanced understanding of product characteristics, such as material feel and appearance.\n- **Brand Loyalty**: While previously engaged with a specific eyelash brand, the recent wig interaction suggests a willingness to explore other brands, albeit with a critical eye on quality.\n- **Positive Experience**: Generally maintains a positive outlook on product experiences, as evidenced by the enthusiastic review of eyelashes and a balanced review of the wig, highlighting both pros and cons while maintaining an overall favorable assessment.\n\nThis profile indicates a user who enjoys bold beauty enhancements while being open to diverse beauty products, balancing aesthetics with quality and practicality.",
  "metrics": {
    "rouge1_f": 0.1924882629107981,
    "rouge2_f": 0.014150943396226415,
    "rougeL_f": 0.0892018779342723,
    "meteor": 0.12670605581586578,
    "bleu1": 0.18910646628109062,
    "bleu2": 0.057124022259527514,
    "bleu3": 0.010416954229902043,
    "bleu4": 0.0044525535389552074,
    "bertscore_precision": 0.3846280574798584,
    "bertscore_recall": 0.4227684736251831,
    "bertscore_f1": 0.4027974307537079
  }
}