{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Large Hair Claw Clips for Thick Hair,4.3 Inches Nonslip Hair Claw Clips for Women/Girls,Strong Hold Nonslip Hair Clips Design Accessories (6color)\nReview Date: 2021/05/06\nStore: Eliamo\nAverage Rating: 4.8\nProduct Details: {'Brand': 'Eliamo', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal', 'Unit Count': '200.00 Count', 'Package Dimensions': '6.57 x 6.18 x 3.94 inches; 6.07 Ounces'}\nReview Text: Great hair clips. Awesome colors. They seem to be very durable. Hold hair up great. Great material.\nReview Title: Great hair clips\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "25mm 3D Mink Lashes Full Volume Mink Eyelashes Fluffy Volume Dramatic 25mm Mink Lashes Extension Cruelty-free Siberian Mink Strip Eyelashes……… (LJ632AMIX)\nHICOCU\n['25mm 3D Mink Lashes Full Volume Mink Eyelashes Fluffy Volume Dramatic 25mm Mink Lashes Extension Cruelty-free Siberian Mink Strip Eyelashes']\n{'Color': 'LJ632AMIX', 'Brand': 'HICOCU', 'Material': 'Silk, Faux Mink, Mink Fur', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Package Dimensions': '5.43 x 5.31 x 0.75 inches; 0.63 Ounces', 'Manufacturer': 'HICOCU'}\nCute packaging. Lashes look and feel great. I tried on the longest/fullest pair.\nGreat lashes\nFENJUN HAIR Silky Straight Lace Front Wigs with Baby Hair Pre plucked Frontal Natural Looking Synthetic Hair Middle Parting 2# Black Color Long Straight Wigs for Women Girls\nFENJUN HAIR\n{'Material': 'Synthetic', 'Hair Type': 'Straight', 'Style': 'Straight', 'Brand': 'FENJUN HAIR', 'Age Range (Description)': 'Adult', 'Package Dimensions': '11.38 x 9.29 x 1.57 inches; 14.39 Ounces'}\nGood wig. I personally wouldn’t wear as an everyday wig, without a hat. It is soft, but you can tell this wig is synthetic by touch. The shine looks more natural, shine is not terrible. I would definitely use if I needed a wig for a costume. This wig does shed if you run your fingers through it, but it isn’t terrible shedding.\nGood wig overall\nAmamba 100% Real Mink Magnetic Eyelashes With Eyeliner Set,Magnetic Eyeliner And Lashes kit,Upgrade 6 Magnets And Waterproof Eyeliner,With Reusable Lashes [5 Pairs]\nAmamba\n{'Package Dimensions': '5.67 x 5.39 x 0.75 inches; 2.08 Ounces', 'UPC': '784112270826'}\nThese lashes look and feel great. They are easy to use. Make sure to shake the liner before application, and to let it dry before applying lashes. Great ting ready has never been so easy. Who need mascara, and no hassle with messy glue.\nGreat magnetic lashes\nLarge Hair Claw Clips for Thick Hair,4.3 Inches Nonslip Hair Claw Clips for Women/Girls,Strong Hold Nonslip Hair Clips Design Accessories (6color)\nEliamo\n{'Brand': 'Eliamo', 'Hair Type': 'All', 'Age Range (Description)': 'Adult', 'Material': 'Plastic, Metal', 'Unit Count': '200.00 Count', 'Package Dimensions': '6.57 x 6.18 x 3.94 inches; 6.07 Ounces'}\nGreat hair clips. Awesome colors. They seem to be very durable. Hold hair up great. Great material.\nGreat hair clips",
  "profile": "**User Summary:**\n\n- **Beauty Products**: The user has a strong preference for high-quality beauty enhancements, particularly focusing on eyelashes while exploring wigs and hair accessories, such as claw clips, for added versatility.\n- **Product Material**: Values cruelty-free, high-end materials and demonstrates an openness to synthetic products. Recently purchased hair clips indicate a practical approach, balancing aesthetics with function.\n- **Aesthetic Preferences**: Enjoys dramatic, fluffy, and voluminous lash styles, along with natural-looking wigs and colorful hair accessories. Their latest purchase reflects a preference for vibrant colors and durable, functional items.\n- **Quality Over Quantity**: Consistently rates products highly, emphasizing a discerning taste for quality and durability. The recent positive experience with hair clips underscores their focus on effective, user-friendly beauty solutions.\n- **Brand Loyalty**: While previously loyal to a specific eyelash brand, the user remains open to new brands, illustrated by their exploration of different beauty products and hair accessories while maintaining critical evaluation.\n- **Positive Experience**: Generally maintains a positive outlook on product experiences, showcasing enthusiasm in reviews and balanced feedback that highlights both pros and cons.\n\nThis profile emphasizes a user who seeks bold beauty enhancements and practical hair accessories, prioritizing quality and ease of use, while continuing to experiment creatively within their beauty regimen.",
  "metrics": {
    "rouge1_f": 0.22033898305084748,
    "rouge2_f": 0.02040816326530612,
    "rougeL_f": 0.08135593220338982,
    "meteor": 0.09956440572495333,
    "bleu1": 0.10252105107473744,
    "bleu2": 0.028059211538744626,
    "bleu3": 0.004951287983363536,
    "bleu4": 0.002081852880725738,
    "bertscore_precision": 0.3515009880065918,
    "bertscore_recall": 0.39932870864868164,
    "bertscore_f1": 0.37389153242111206
  }
}