{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/04/19\nAverage Rating: 4.2\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['James Hawes', 'Paul Whittington', 'Bill Anderson', 'Marek Losey'], 'Producers': ['Francis Hopkinson', 'Andy Harries', 'Stephen Smallwood'], 'Starring': ['Stephen Tompkinson', 'Andrea Lowe', 'Lorraine Burroughs']}\nReview Text: Stories are good.  Sometimes Tompkinson's acting is a bit over the top.  Not sure why they pair him with such an insubordinate DC.\nReview Title: Decent Police Procedural set in Beautiful Yorkshire\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Colm McCarthy', 'Anthony Byrne'], 'Producers': ['Andrew Lowe (Element Films)', 'Rob Pursey'], 'Starring': ['Own McDonnell', 'Ian McElhinney']}\nWell written gritty police series set in beautiful scenic western Ireland.  Story lines deal with corruption, deal-making, insidious city crime in a small town, arson, drug smuggling and family conflicts.  Watched two series ... wish there were more.  Good acting, great locales, slight romance, plenty of conflict and lots more room for more episodes.\nSmall town policing - blurred ethical lines!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James Strong', 'Euros Lyn'], 'Producers': ['Jane Featherstone', 'Chris Chibnall', 'Richard Stokes'], 'Starring': ['David Tennant', 'Olivia Colman', 'Jodie Whittaker'], 'Studio': ['PBS']}\nReally enjoyed watching the first season of Broadchurch ... which I did in one sitting.  Couldn't wait to watch the next episode.  The cast was really good, plenty of drama and even the small town vigilantism was plausible.  I think this series was well written and acted and can't wait to see if there will be a Season 2 and how they would move on from the ending.  This series reminded me of the American series, The Killing.  Very believable storyline.\nGreat drama series - unpredictable ending\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Lasse Hallstrom'], 'Producers': ['Steven Spielberg', 'Oprah Winfrey', 'Juliet Blake'], 'Starring': ['Helen Mirren', 'Om Puri', 'Manish Dayal'], 'Studio': ['DreamWorks Pictures']}\nReally enjoyable movie!  All the actors were excellent.  Scenery is very beautiful but almost the entire movie takes place in one village.  I thoroughly enjoyed The Hundred Foot Journey as I have all of Lasse Halstrom's movies!\nAll the actors were excellent. Scenery is very beautiful but almost the entire ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James Strong', 'Jessica Hobbs', 'Jonathan Teplitzky', 'Mike Barker'], 'Producers': ['Jane Featherstone', 'Chris Chibnall', 'Richard Stokes'], 'Starring': ['David Tennant', 'Olivia Colman', 'Jodie Whittaker'], 'Studio': ['PBS']}\nReally enjoyed Season 1 and didn't know how they would do Season 2 (seeming to have wrapped everything up), but Season 2 was great!  The writers did wonderful job reintroducing the earlier unsolved missing and possibly murdered girls mystery; and the Season 1 murder trial and all the ramifications of prosecution and defense strategies and trial testimony were very engrossing!  This is very well written, well cast and well acted!  Can't wait for Season 3, and I hope they can keep the momentum up for a few more years!\nReally enjoyed Season 1 and didn't know how they would do ...\n{'Subtitles': ['None available'], 'Directors': ['Tim Fywell', 'Jim Loach', 'Mat King'], 'Producers': ['Emma Kingsman-Lloyd', 'Andy Harries', 'Charles Elton', 'Robert Murphy'], 'Starring': ['Stephen Tompkinson', 'Andrea Lowe', 'Caroline Catz'], 'Studio': ['BBC America']}\nEpisodes are good.  Tompkinson's acting is often overdone.  Like his new DC.\nEpisodes are good. Tompkinson's acting is often overdone\n{'Subtitles': ['None available'], 'Directors': ['James Hawes', 'Paul Whittington', 'Bill Anderson', 'Marek Losey'], 'Producers': ['Francis Hopkinson', 'Andy Harries', 'Stephen Smallwood'], 'Starring': ['Stephen Tompkinson', 'Andrea Lowe', 'Lorraine Burroughs']}\nStories are good.  Sometimes Tompkinson's acting is a bit over the top.  Not sure why they pair him with such an insubordinate DC.\nDecent Police Procedural set in Beautiful Yorkshire",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference**: Maintains a strong affinity for gritty crime and police dramas, particularly those that evolve over multiple seasons, alongside a consistent appreciation for feel-good movies emphasizing cultural and community themes.\n- **Themes**: Increased interest in complex narratives involving unresolved mysteries, the legal system, ethical dilemmas, and familial conflicts, while still valuing stories that highlight small community life and culinary elements.\n- **Setting**: Continues to favor scenic locations, especially picturesque regions that enhance narrative authenticity and depth.\n- **Content Sensitivity**: Open to mature themes like violence and substance use if they serve genuine storytelling, with a preference for diverse narratives.\n- **Storytelling Style**: Displays a passion for well-written, character-driven stories and enjoys balances between drama and lighter, uplifting moments, especially in multi-episode formats. However, tends to critique performances that come across as exaggerated or less nuanced.\n- **Viewing Experience**: Prefers series for character development but remains interested in compelling films. Appreciates the craftsmanship of renowned directors and actors.\n- **Overall Enjoyment**: Enthusiastic about authentic storylines and powerful performances. Recent experiences have prompted a critical view of certain acting styles, particularly over-the-top portrayals, indicating a nuanced evolution in taste towards authentic and subtle performances.",
  "metrics": {
    "rouge1_f": 0.1970310391363023,
    "rouge2_f": 0.018944519621109605,
    "rougeL_f": 0.08367071524966262,
    "meteor": 0.06702535689705463,
    "bleu1": 0.027853361885067943,
    "bleu2": 0.004331955287735795,
    "bleu3": 0.0008593402117203528,
    "bleu4": 0.0003831105530089069,
    "bertscore_precision": 0.35807132720947266,
    "bertscore_recall": 0.4442589282989502,
    "bertscore_f1": 0.3965359032154083
  }
}