{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/03/26\nAverage Rating: 4.8\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Lasse Hallstrom'], 'Producers': ['Steven Spielberg', 'Oprah Winfrey', 'Juliet Blake'], 'Starring': ['Helen Mirren', 'Om Puri', 'Manish Dayal'], 'Studio': ['DreamWorks Pictures']}\nReview Text: Really enjoyable movie!  All the actors were excellent.  Scenery is very beautiful but almost the entire movie takes place in one village.  I thoroughly enjoyed The Hundred Foot Journey as I have all of Lasse Halstrom's movies!\nReview Title: All the actors were excellent. Scenery is very beautiful but almost the entire ...\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Colm McCarthy', 'Anthony Byrne'], 'Producers': ['Andrew Lowe (Element Films)', 'Rob Pursey'], 'Starring': ['Own McDonnell', 'Ian McElhinney']}\nWell written gritty police series set in beautiful scenic western Ireland.  Story lines deal with corruption, deal-making, insidious city crime in a small town, arson, drug smuggling and family conflicts.  Watched two series ... wish there were more.  Good acting, great locales, slight romance, plenty of conflict and lots more room for more episodes.\nSmall town policing - blurred ethical lines!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James Strong', 'Euros Lyn'], 'Producers': ['Jane Featherstone', 'Chris Chibnall', 'Richard Stokes'], 'Starring': ['David Tennant', 'Olivia Colman', 'Jodie Whittaker'], 'Studio': ['PBS']}\nReally enjoyed watching the first season of Broadchurch ... which I did in one sitting.  Couldn't wait to watch the next episode.  The cast was really good, plenty of drama and even the small town vigilantism was plausible.  I think this series was well written and acted and can't wait to see if there will be a Season 2 and how they would move on from the ending.  This series reminded me of the American series, The Killing.  Very believable storyline.\nGreat drama series - unpredictable ending\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Lasse Hallstrom'], 'Producers': ['Steven Spielberg', 'Oprah Winfrey', 'Juliet Blake'], 'Starring': ['Helen Mirren', 'Om Puri', 'Manish Dayal'], 'Studio': ['DreamWorks Pictures']}\nReally enjoyable movie!  All the actors were excellent.  Scenery is very beautiful but almost the entire movie takes place in one village.  I thoroughly enjoyed The Hundred Foot Journey as I have all of Lasse Halstrom's movies!\nAll the actors were excellent. Scenery is very beautiful but almost the entire ...",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference**: Continues to enjoy gritty crime and police dramas with a strong narrative focus, while also appreciating feel-good movies with elements of culture and community.\n- **Themes**: Values stories that delve into corruption, ethical dilemmas, and family conflicts, alongside a growing interest in narratives showcasing culinary themes and life in small communities, particularly if they include cultural elements.\n- **Setting**: Still favors scenic locations, especially rural or small towns that enhance narrative authenticity, recently drawn to films set in picturesque villages.\n- **Content Sensitivity**: Remains open to mature themes such as violence and substance use, valuing authenticity in storytelling, with enjoyment of diverse content to create a richer viewing experience.\n- **Storytelling Style**: Loves well-written narratives with depth and strong character development, maintaining a tendency for high ratings on relatable content; has a new appreciation for films that balance drama with lighter, more uplifting moments.\n- **Viewing Experience**: Likely prefers series format for character arcs but also enjoys engaging films that can evoke strong emotional responses; recently highlighted a penchant for works by renowned directors and actors.\n- **Overall Enjoyment**: Shows enthusiasm for believable storylines and compelling performances, reflecting an appreciation for diverse narratives that resonate emotionally, whether in series or standalone films. \n\nThis summary reflects the user’s evolving taste with a blend of crime drama and feel-good storytelling, emphasizing their appreciation for complex yet uplifting narratives.",
  "metrics": {
    "rouge1_f": 0.256120527306968,
    "rouge2_f": 0.030245746691871453,
    "rougeL_f": 0.09416195856873823,
    "meteor": 0.1118227398258349,
    "bleu1": 0.13569484452087188,
    "bleu2": 0.037223863036644336,
    "bleu3": 0.01332529996838084,
    "bleu4": 0.004487153797132958,
    "bertscore_precision": 0.39372462034225464,
    "bertscore_recall": 0.4506355822086334,
    "bertscore_f1": 0.4202621579170227
  }
}