{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/06/08\nAverage Rating: 4.2\nProduct Details: {'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susanna White'], 'Producers': ['David Parfitt', 'Selwyn Roberts', 'Michele Buck', 'Damien Timmer', 'Ben Donald'], 'Starring': ['Benedict Cumberbatch', 'Rebecca Hall', 'Roger Allam'], 'Studio': ['HBO']}\nReview Text: Excellent WWI story about honor and love and societal expectations and destructive relationships and the toll they take on lives.  This was extremely well written, had a superb cast and was wonderfully produced.  Very well done all around.  I developed a whole new respect for Benedict Cumberbatch.  He's quite the actor!\nReview Title: Wonderfully Done Period Drama\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Content advisory': ['Violence', 'substance use', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English', 'English [CC]'], 'Directors': ['Colm McCarthy', 'Anthony Byrne'], 'Producers': ['Andrew Lowe (Element Films)', 'Rob Pursey'], 'Starring': ['Own McDonnell', 'Ian McElhinney']}\nWell written gritty police series set in beautiful scenic western Ireland.  Story lines deal with corruption, deal-making, insidious city crime in a small town, arson, drug smuggling and family conflicts.  Watched two series ... wish there were more.  Good acting, great locales, slight romance, plenty of conflict and lots more room for more episodes.\nSmall town policing - blurred ethical lines!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James Strong', 'Euros Lyn'], 'Producers': ['Jane Featherstone', 'Chris Chibnall', 'Richard Stokes'], 'Starring': ['David Tennant', 'Olivia Colman', 'Jodie Whittaker'], 'Studio': ['PBS']}\nReally enjoyed watching the first season of Broadchurch ... which I did in one sitting.  Couldn't wait to watch the next episode.  The cast was really good, plenty of drama and even the small town vigilantism was plausible.  I think this series was well written and acted and can't wait to see if there will be a Season 2 and how they would move on from the ending.  This series reminded me of the American series, The Killing.  Very believable storyline.\nGreat drama series - unpredictable ending\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]', 'Español'], 'Directors': ['Lasse Hallstrom'], 'Producers': ['Steven Spielberg', 'Oprah Winfrey', 'Juliet Blake'], 'Starring': ['Helen Mirren', 'Om Puri', 'Manish Dayal'], 'Studio': ['DreamWorks Pictures']}\nReally enjoyable movie!  All the actors were excellent.  Scenery is very beautiful but almost the entire movie takes place in one village.  I thoroughly enjoyed The Hundred Foot Journey as I have all of Lasse Halstrom's movies!\nAll the actors were excellent. Scenery is very beautiful but almost the entire ...\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['James Strong', 'Jessica Hobbs', 'Jonathan Teplitzky', 'Mike Barker'], 'Producers': ['Jane Featherstone', 'Chris Chibnall', 'Richard Stokes'], 'Starring': ['David Tennant', 'Olivia Colman', 'Jodie Whittaker'], 'Studio': ['PBS']}\nReally enjoyed Season 1 and didn't know how they would do Season 2 (seeming to have wrapped everything up), but Season 2 was great!  The writers did wonderful job reintroducing the earlier unsolved missing and possibly murdered girls mystery; and the Season 1 murder trial and all the ramifications of prosecution and defense strategies and trial testimony were very engrossing!  This is very well written, well cast and well acted!  Can't wait for Season 3, and I hope they can keep the momentum up for a few more years!\nReally enjoyed Season 1 and didn't know how they would do ...\n{'Subtitles': ['None available'], 'Directors': ['Tim Fywell', 'Jim Loach', 'Mat King'], 'Producers': ['Emma Kingsman-Lloyd', 'Andy Harries', 'Charles Elton', 'Robert Murphy'], 'Starring': ['Stephen Tompkinson', 'Andrea Lowe', 'Caroline Catz'], 'Studio': ['BBC America']}\nEpisodes are good.  Tompkinson's acting is often overdone.  Like his new DC.\nEpisodes are good. Tompkinson's acting is often overdone\n{'Subtitles': ['None available'], 'Directors': ['James Hawes', 'Paul Whittington', 'Bill Anderson', 'Marek Losey'], 'Producers': ['Francis Hopkinson', 'Andy Harries', 'Stephen Smallwood'], 'Starring': ['Stephen Tompkinson', 'Andrea Lowe', 'Lorraine Burroughs']}\nStories are good.  Sometimes Tompkinson's acting is a bit over the top.  Not sure why they pair him with such an insubordinate DC.\nDecent Police Procedural set in Beautiful Yorkshire\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['James Cameron'], 'Producers': ['Brooke Breton', 'James Cameron', 'Laeta Kalogridis', 'Jon Landau', 'Josh McLaglen', 'Janace Tashjian', 'Peter M. Tobyansen', 'Colin Wilson'], 'Starring': ['Sam Worthington', 'Sigourney Weaver', 'Zoe Saldana']}\nLoved all the special effects!  Will definitely watch Avatar 2.\nCharming!\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Israel Horovitz'], 'Producers': ['Rachael Horovitz', 'Gary Foster', 'Nitsa Benchetrit', 'David C. Barrot'], 'Starring': ['Kevin Kline', 'Kristin Scott Thomas', 'Maggie Smith']}\nInteresting story of the inheritance of an interest in a glorious Paris apartment with a sitting tenant with a lifetime lease and a totally hard luck guy just trying to get his hands on what he feels is overdue to him!  It's a bit dark, and even occasionally quite depressing, but does lift out of that to a satisfying conclusion.  Kevin Kline is wonderfully irreverent and can even be quite horrible when he wants to be! Very good cast!  Tip of the hat to Maggie Smith and Kristin Scott Thomas.\nDark Comedy, Exceptionally Good Cast\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Simon Langton'], 'Producers': ['Sue Birtwistle', 'Michael Wearing'], 'Starring': ['Alison Steadman', 'Julia Sawalha', 'Colin Firth'], 'Studio': ['Series']}\nGreat story, wonderful period costumes and social drama, excellent cast and and beautiful scenery.  How could you go wrong?\nClassic Austin, Beautifully Depicted\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Susanna White'], 'Producers': ['David Parfitt', 'Selwyn Roberts', 'Michele Buck', 'Damien Timmer', 'Ben Donald'], 'Starring': ['Benedict Cumberbatch', 'Rebecca Hall', 'Roger Allam'], 'Studio': ['HBO']}\nExcellent WWI story about honor and love and societal expectations and destructive relationships and the toll they take on lives.  This was extremely well written, had a superb cast and was wonderfully produced.  Very well done all around.  I developed a whole new respect for Benedict Cumberbatch.  He's quite the actor!\nWonderfully Done Period Drama",
  "profile": "**Updated User Profile Summary:**\n\n- **Genre Preference**: Maintains a strong affinity for gritty crime and police dramas while further appreciating ambitious sci-fi and dark comedies with intricate narratives. The user has a growing admiration for classic period pieces that deliver social drama, particularly those that explore themes of honor, love, and societal expectations.\n\n- **Themes**: Shows enthusiasm for complex narratives featuring unresolved mysteries, ethical dilemmas, and intimate familial conflicts, often enhanced by darkly comedic elements. The user's interest in stories that delve into societal issues and relationships continues to deepen, especially in richly developed community settings.\n\n- **Setting**: Values picturesque locations that enhance storytelling authenticity, with an emphasis on immersive world-building in period settings that contribute to character depth and narrative context.\n\n- **Content Sensitivity**: Open to mature themes like violence and substance use when integral to the storyline, embracing diverse and sometimes darker narratives.\n\n- **Storytelling Style**: Passionate about well-crafted, character-driven narratives that blend drama with uplifting moments. The user remains critical of performances lacking nuance, favoring subtle portrayals.\n\n- **Viewing Experience**: Prefers series for in-depth character development but is captivated by visually engaging films, gravitating towards authentic performances.\n\n- **Overall Enjoyment**: Enthusiastic about powerful performances and engaging storylines, particularly in period dramas that resonate emotionally, while maintaining excitement for sequels and visually impressive franchises.",
  "metrics": {
    "rouge1_f": 0.1534195933456562,
    "rouge2_f": 0.016666666666666666,
    "rougeL_f": 0.06099815157116451,
    "meteor": 0.051431818470852965,
    "bleu1": 0.005000558033267295,
    "bleu2": 0.0014461122100662257,
    "bleu3": 0.000603153398251814,
    "bleu4": 0.00018436268522855652,
    "bertscore_precision": 0.3638036251068115,
    "bertscore_recall": 0.4680712819099426,
    "bertscore_f1": 0.4094029664993286
  }
}