{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Mythbusters\nReview Date: 2013/06/17\nCategories: Unscripted, Documentary, Kids, Special Interest\nProduct Description: ['Adam Savage and Jamie Hyneman are at it again--getting to the bottom of popular myths one experiment at a time by combining science, curiosity, and inventiveness.  Watch as Adam, Jamie and the rest of the MythBusters team see what really happens when you take candy from a baby, if people really do get cold feet when they are afraid, what happens when poop literally hits the fan and much more in this season of MythBusters.']\nAverage Rating: 4.9\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alice Dallow', 'Lauren Gray Williams', 'Tabitha Lentle', 'Steve Christiansen', 'Peter Rees', 'Andrew Farrell', 'Brian Leckey', 'Rob Hammersley', 'Eric Haven'], 'Producers': ['Linda Wolkovitch']}\nReview Text: Mythbusters, what else can I say?  Your either a fan or your not. Since I'm a fan.. It's really cool how science and entertainment can come to together in such a way that can be imitated but never replicated\nReview Title: Mythbusters.. What else needs to be said?\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabrielle Salvatore', 'Ron Cornwall', 'Keith Koslov'], 'Producers': ['Matthew Ostrom', 'Laura Palumbo Johnson', 'Jordan Brodsky', 'Brian Flanagan', 'Dominick Pupa', 'Jonathan Partridge', 'Marni Ellis'], 'Studio': ['TLC']}\nDecent show if you like this kind of stuff. It was a test to see how the whole prime thing worked.\nWas new to Prime,\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Robert Zemeckis', 'Steve Starkey', 'Carl Sagan', 'Ann Druyan'], 'Starring': ['Jodie Foster', 'Matthew McConaughey', 'James Woods']}\nThis movie is one heck of a ride.  It will leave you guessing until the end, all the performances are really well done.  The special effects are still holding up but are showing their age, but all in all it's a very good story and isn't that what makes a good movie?\nWorth it!\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nStand up comedy at it's finest!  Yes there are some &#34;adult&#34; themes but it was very refreshing to watch a entertainer that wasn't dropping a F bomb and words related to it every 5 minutes.  Not that I find that kind of language offensive but to have a comedian not rely on those words to be funny... I'll be buying the DVD...\nFunny, Funny, Funny!\n{'Subtitles': ['None available'], 'Directors': ['KOBUN'], 'Producers': ['Shinsaku Tanaka', 'Ryuji Sekine', 'Hisato Usui', 'Takuro Hatakeyama'], 'Starring': ['Aoi Yuki', 'Daisuke Hirakawa', 'Rie Kugimiya'], 'Studio': ['A-Net Digital']}\nThe animation is different than the majority of the anime out there which is a plus, but since the \"censorship\" ink splashes detract from the visual which in this case has didn't really impact the storyline but did detract from the flow of the visuals.  That is why I gave it the rating I did.  Additionally since I am over 21 and live in a locality in which I am not prohibited in the viewing of adult images either of a sexual nature or of a violent nature I find that not having the option of choosing which version to watch rather distasteful\nMixed Bag\nMythbusters\nUnscripted, Documentary, Kids, Special Interest\n['Adam Savage and Jamie Hyneman are at it again--getting to the bottom of popular myths one experiment at a time by combining science, curiosity, and inventiveness.  Watch as Adam, Jamie and the rest of the MythBusters team see what really happens when you take candy from a baby, if people really do get cold feet when they are afraid, what happens when poop literally hits the fan and much more in this season of MythBusters.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alice Dallow', 'Lauren Gray Williams', 'Tabitha Lentle', 'Steve Christiansen', 'Peter Rees', 'Andrew Farrell', 'Brian Leckey', 'Rob Hammersley', 'Eric Haven'], 'Producers': ['Linda Wolkovitch']}\nMythbusters, what else can I say?  Your either a fan or your not. Since I'm a fan.. It's really cool how science and entertainment can come to together in such a way that can be imitated but never replicated\nMythbusters.. What else needs to be said?",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user maintains a strong interest in TV shows and documentary-style content, with an increasing appreciation for cinematic experiences, unique animation styles, and stand-up comedy. Their recent review emphasizes a love for engaging narratives that blend entertainment with educational elements, as seen in their positive experience with unscripted series that utilize scientific inquiry, while still expressing disappointment with censorship practices.\n\n- **Language & Accessibility:** They continue to favor English content with subtitles and prioritize audio descriptions for an inclusive viewing experience, remaining open to non-subtitled material if it aligns with their interests.\n\n- **Ratings Trends:** The user exhibits a balanced evaluation approach, with recent ratings averaging around 3.4, highlighting their discerning taste. They seek quality storytelling and performance, often favoring thought-provoking content.\n\n- **Engagement Level:** Their curiosity for varied content remains strong, as they explore genres that include stand-up comedy and unique animations. They appreciate fresh narratives and artistic expression, especially when combined with scientific or educational themes.\n\n- **Cautious Explorer:** The user's interest in sophisticated humor and adult themes indicates a preference for nuanced content, along with a critical perspective on elements like censorship that may detract from the overall experience.\n\nOverall, the user embodies a thoughtful media consumer, enthusiastically discovering diverse content while prioritizing quality storytelling and visual integrity.",
  "metrics": {
    "rouge1_f": 0.18944519621109607,
    "rouge2_f": 0.013568521031207599,
    "rougeL_f": 0.07848443843031123,
    "meteor": 0.07280917935051397,
    "bleu1": 0.04444595536947388,
    "bleu2": 0.00862278755554264,
    "bleu3": 0.003465353874414101,
    "bleu4": 0.0012365179167586888,
    "bertscore_precision": 0.352271169424057,
    "bertscore_recall": 0.4189767837524414,
    "bertscore_f1": 0.38273924589157104
  }
}