{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2013/04/17\nAverage Rating: 3.4\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['KOBUN'], 'Producers': ['Shinsaku Tanaka', 'Ryuji Sekine', 'Hisato Usui', 'Takuro Hatakeyama'], 'Starring': ['Aoi Yuki', 'Daisuke Hirakawa', 'Rie Kugimiya'], 'Studio': ['A-Net Digital']}\nReview Text: The animation is different than the majority of the anime out there which is a plus, but since the \"censorship\" ink splashes detract from the visual which in this case has didn't really impact the storyline but did detract from the flow of the visuals.  That is why I gave it the rating I did.  Additionally since I am over 21 and live in a locality in which I am not prohibited in the viewing of adult images either of a sexual nature or of a violent nature I find that not having the option of choosing which version to watch rather distasteful\nReview Title: Mixed Bag\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabrielle Salvatore', 'Ron Cornwall', 'Keith Koslov'], 'Producers': ['Matthew Ostrom', 'Laura Palumbo Johnson', 'Jordan Brodsky', 'Brian Flanagan', 'Dominick Pupa', 'Jonathan Partridge', 'Marni Ellis'], 'Studio': ['TLC']}\nDecent show if you like this kind of stuff. It was a test to see how the whole prime thing worked.\nWas new to Prime,\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Robert Zemeckis', 'Steve Starkey', 'Carl Sagan', 'Ann Druyan'], 'Starring': ['Jodie Foster', 'Matthew McConaughey', 'James Woods']}\nThis movie is one heck of a ride.  It will leave you guessing until the end, all the performances are really well done.  The special effects are still holding up but are showing their age, but all in all it's a very good story and isn't that what makes a good movie?\nWorth it!\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nStand up comedy at it's finest!  Yes there are some &#34;adult&#34; themes but it was very refreshing to watch a entertainer that wasn't dropping a F bomb and words related to it every 5 minutes.  Not that I find that kind of language offensive but to have a comedian not rely on those words to be funny... I'll be buying the DVD...\nFunny, Funny, Funny!\n{'Subtitles': ['None available'], 'Directors': ['KOBUN'], 'Producers': ['Shinsaku Tanaka', 'Ryuji Sekine', 'Hisato Usui', 'Takuro Hatakeyama'], 'Starring': ['Aoi Yuki', 'Daisuke Hirakawa', 'Rie Kugimiya'], 'Studio': ['A-Net Digital']}\nThe animation is different than the majority of the anime out there which is a plus, but since the \"censorship\" ink splashes detract from the visual which in this case has didn't really impact the storyline but did detract from the flow of the visuals.  That is why I gave it the rating I did.  Additionally since I am over 21 and live in a locality in which I am not prohibited in the viewing of adult images either of a sexual nature or of a violent nature I find that not having the option of choosing which version to watch rather distasteful\nMixed Bag",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to have a robust interest in TV shows and documentary-style content, with a growing appreciation for cinematic experiences and stand-up comedy. Their recent review highlights a preference for unique animation styles, though they express disappointment with censorship practices that detract from the visual experience. This reveals an ongoing quest for diverse and quality content, particularly in animation.\n\n- **Language & Accessibility:** The user prefers English content with subtitles and remains open to non-subtitled content if it aligns with their interests. They still prioritize audio descriptions, reflecting their desire for inclusive viewing experiences.\n\n- **Ratings Trends:** With recent reviews averaging around 3.4, the user demonstrates a balanced approach to evaluations, highlighting their discerning taste. They prefer thoughtful storytelling and performance across genres, seeking quality over mere entertainment.\n\n- **Engagement Level:** The user's curiosity for new content forms persists, evidenced by their exploration of diverse genres, including stand-up comedy and unique animations. They value fresh narratives and artistic expression.\n\n- **Cautious Explorer:** Their interest in sophisticated humor and engagement with adult themes underscore a preference for more nuanced content. However, they maintain a critical stance towards elements that hinder the overall viewing experience, such as censorship.\n\nOverall, the user represents a thoughtful and selective media consumer, eagerly exploring varied content while prioritizing quality storytelling and visual integrity.",
  "metrics": {
    "rouge1_f": 0.2081911262798635,
    "rouge2_f": 0.0273972602739726,
    "rougeL_f": 0.09556313993174059,
    "meteor": 0.09212556779291893,
    "bleu1": 0.09229251546189193,
    "bleu2": 0.02453558713458172,
    "bleu3": 0.013322164907954306,
    "bleu4": 0.007465751298986092,
    "bertscore_precision": 0.36396175622940063,
    "bertscore_recall": 0.41869714856147766,
    "bertscore_f1": 0.3894154727458954
  }
}