{
  "interaction_number": 7,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/02/13\nAverage Rating: 4.6\nProduct Details: {'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['History']}\nReview Text: This is basically an anti - conspiracy show which is refreshing out of all the pro-conspiracy type of entertainment out there.<br />There are some episodes that I feel are a little light on the details but overall a decent show\nReview Title: Interesting\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabrielle Salvatore', 'Ron Cornwall', 'Keith Koslov'], 'Producers': ['Matthew Ostrom', 'Laura Palumbo Johnson', 'Jordan Brodsky', 'Brian Flanagan', 'Dominick Pupa', 'Jonathan Partridge', 'Marni Ellis'], 'Studio': ['TLC']}\nDecent show if you like this kind of stuff. It was a test to see how the whole prime thing worked.\nWas new to Prime,\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Robert Zemeckis', 'Steve Starkey', 'Carl Sagan', 'Ann Druyan'], 'Starring': ['Jodie Foster', 'Matthew McConaughey', 'James Woods']}\nThis movie is one heck of a ride.  It will leave you guessing until the end, all the performances are really well done.  The special effects are still holding up but are showing their age, but all in all it's a very good story and isn't that what makes a good movie?\nWorth it!\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nStand up comedy at it's finest!  Yes there are some &#34;adult&#34; themes but it was very refreshing to watch a entertainer that wasn't dropping a F bomb and words related to it every 5 minutes.  Not that I find that kind of language offensive but to have a comedian not rely on those words to be funny... I'll be buying the DVD...\nFunny, Funny, Funny!\n{'Subtitles': ['None available'], 'Directors': ['KOBUN'], 'Producers': ['Shinsaku Tanaka', 'Ryuji Sekine', 'Hisato Usui', 'Takuro Hatakeyama'], 'Starring': ['Aoi Yuki', 'Daisuke Hirakawa', 'Rie Kugimiya'], 'Studio': ['A-Net Digital']}\nThe animation is different than the majority of the anime out there which is a plus, but since the \"censorship\" ink splashes detract from the visual which in this case has didn't really impact the storyline but did detract from the flow of the visuals.  That is why I gave it the rating I did.  Additionally since I am over 21 and live in a locality in which I am not prohibited in the viewing of adult images either of a sexual nature or of a violent nature I find that not having the option of choosing which version to watch rather distasteful\nMixed Bag\nMythbusters\nUnscripted, Documentary, Kids, Special Interest\n['Adam Savage and Jamie Hyneman are at it again--getting to the bottom of popular myths one experiment at a time by combining science, curiosity, and inventiveness.  Watch as Adam, Jamie and the rest of the MythBusters team see what really happens when you take candy from a baby, if people really do get cold feet when they are afraid, what happens when poop literally hits the fan and much more in this season of MythBusters.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alice Dallow', 'Lauren Gray Williams', 'Tabitha Lentle', 'Steve Christiansen', 'Peter Rees', 'Andrew Farrell', 'Brian Leckey', 'Rob Hammersley', 'Eric Haven'], 'Producers': ['Linda Wolkovitch']}\nMythbusters, what else can I say?  Your either a fan or your not. Since I'm a fan.. It's really cool how science and entertainment can come to together in such a way that can be imitated but never replicated\nMythbusters.. What else needs to be said?\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Hit Movies']}\nThis is one of those movies that is a great popcorn flick, but since Brad Bird directed it its a live action comic book\nBrad Bird, at it again\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['History']}\nThis is basically an anti - conspiracy show which is refreshing out of all the pro-conspiracy type of entertainment out there.<br />There are some episodes that I feel are a little light on the details but overall a decent show\nInteresting",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user maintains a strong interest in TV shows and documentary-style content, showcasing a particular appreciation for narratives that challenge conspiracy theories. Their recent review highlights a preference for content that offers a refreshing perspective on commonly held beliefs, while still valuing engaging storytelling. They continue to admire cinematic experiences, unique animation styles, and stand-up comedy, especially works that blend entertainment with educational elements.\n\n- **Language & Accessibility:** The user remains focused on English content with subtitles and emphasizes audio descriptions for an inclusive viewing experience, while being open to non-subtitled material that aligns with their interests.\n\n- **Ratings Trends:** The user's discerning taste is reflected in their ratings, with an average around 3.4. The recent review, rated 4.0, indicates their ability to appreciate quality storytelling, particularly in shows that provide nuanced perspectives on topical issues.\n\n- **Engagement Level:** Their exploration of diverse genres continues, with an ongoing curiosity for stand-up comedy and unique animations intertwined with scientific or educational themes. \n\n- **Cautious Explorer:** The user values sophisticated humor and adult themes, remaining critical of censorship that could undermine content quality.\n\nOverall, the user exemplifies a thoughtful media consumer, actively seeking a broad range of content that emphasizes quality storytelling and visual integrity while engaging with fresh, critical narratives.",
  "metrics": {
    "rouge1_f": 0.17828571428571427,
    "rouge2_f": 0.006872852233676976,
    "rougeL_f": 0.07771428571428571,
    "meteor": 0.059391898976141895,
    "bleu1": 0.018422542086331203,
    "bleu2": 0.0028479192786073746,
    "bleu3": 0.0005637859011235465,
    "bleu4": 0.00025107984410165275,
    "bertscore_precision": 0.3558160662651062,
    "bertscore_recall": 0.4470207393169403,
    "bertscore_f1": 0.396237850189209
  }
}