{
  "interaction_number": 9,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2014/05/31\nAverage Rating: 4.1\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Unavailable'], 'Producers': ['Bellevue Entertainment'], 'Studio': ['Unavailable']}\nReview Text: Very nicely produced series, a great deal of very beautiful scenery but there are times it seems like it's a advertisement for the national park service..\nReview Title: Travel anyone?\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabrielle Salvatore', 'Ron Cornwall', 'Keith Koslov'], 'Producers': ['Matthew Ostrom', 'Laura Palumbo Johnson', 'Jordan Brodsky', 'Brian Flanagan', 'Dominick Pupa', 'Jonathan Partridge', 'Marni Ellis'], 'Studio': ['TLC']}\nDecent show if you like this kind of stuff. It was a test to see how the whole prime thing worked.\nWas new to Prime,\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Robert Zemeckis', 'Steve Starkey', 'Carl Sagan', 'Ann Druyan'], 'Starring': ['Jodie Foster', 'Matthew McConaughey', 'James Woods']}\nThis movie is one heck of a ride.  It will leave you guessing until the end, all the performances are really well done.  The special effects are still holding up but are showing their age, but all in all it's a very good story and isn't that what makes a good movie?\nWorth it!\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nStand up comedy at it's finest!  Yes there are some &#34;adult&#34; themes but it was very refreshing to watch a entertainer that wasn't dropping a F bomb and words related to it every 5 minutes.  Not that I find that kind of language offensive but to have a comedian not rely on those words to be funny... I'll be buying the DVD...\nFunny, Funny, Funny!\n{'Subtitles': ['None available'], 'Directors': ['KOBUN'], 'Producers': ['Shinsaku Tanaka', 'Ryuji Sekine', 'Hisato Usui', 'Takuro Hatakeyama'], 'Starring': ['Aoi Yuki', 'Daisuke Hirakawa', 'Rie Kugimiya'], 'Studio': ['A-Net Digital']}\nThe animation is different than the majority of the anime out there which is a plus, but since the \"censorship\" ink splashes detract from the visual which in this case has didn't really impact the storyline but did detract from the flow of the visuals.  That is why I gave it the rating I did.  Additionally since I am over 21 and live in a locality in which I am not prohibited in the viewing of adult images either of a sexual nature or of a violent nature I find that not having the option of choosing which version to watch rather distasteful\nMixed Bag\nMythbusters\nUnscripted, Documentary, Kids, Special Interest\n['Adam Savage and Jamie Hyneman are at it again--getting to the bottom of popular myths one experiment at a time by combining science, curiosity, and inventiveness.  Watch as Adam, Jamie and the rest of the MythBusters team see what really happens when you take candy from a baby, if people really do get cold feet when they are afraid, what happens when poop literally hits the fan and much more in this season of MythBusters.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alice Dallow', 'Lauren Gray Williams', 'Tabitha Lentle', 'Steve Christiansen', 'Peter Rees', 'Andrew Farrell', 'Brian Leckey', 'Rob Hammersley', 'Eric Haven'], 'Producers': ['Linda Wolkovitch']}\nMythbusters, what else can I say?  Your either a fan or your not. Since I'm a fan.. It's really cool how science and entertainment can come to together in such a way that can be imitated but never replicated\nMythbusters.. What else needs to be said?\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Hit Movies']}\nThis is one of those movies that is a great popcorn flick, but since Brad Bird directed it its a live action comic book\nBrad Bird, at it again\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['History']}\nThis is basically an anti - conspiracy show which is refreshing out of all the pro-conspiracy type of entertainment out there.<br />There are some episodes that I feel are a little light on the details but overall a decent show\nInteresting\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Chris Sanders', 'Stephen C. Harris', 'Daniel Ollek', 'Hudie Ayalon', 'Mark Phillips', 'Eric Anderson', 'Courtney McKenna', 'Jesse Carter Russell', 'Merlin Camozzi', 'Renee Tod'], 'Studio': ['A&E Television Networks']}\nWho doesn't like a good ghost story?  Is very good that it's from real people, the only down side is that it seems like certain people just &#34;give up&#34; in this series and accept the abuse/etc from the ghosts\nThe real deal\n{'Subtitles': ['None available'], 'Directors': ['Unavailable'], 'Producers': ['Bellevue Entertainment'], 'Studio': ['Unavailable']}\nVery nicely produced series, a great deal of very beautiful scenery but there are times it seems like it's a advertisement for the national park service..\nTravel anyone?",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user continues to express a keen interest in TV shows and documentaries, especially those that explore real-life ghost stories and narratives challenging common beliefs. This is complemented by their appreciation for cinematic experiences, distinct animation styles, and stand-up comedy that incorporates educational elements.\n\n- **Language & Accessibility:** The user maintains a focus on English content with subtitles and places a strong emphasis on audio descriptions for inclusivity, while remaining open to non-subtitled materials that align with their interests.\n\n- **Ratings Trends:** Their ratings reflect a discerning eye, with an average hovering around 3.4. The recent review rated 4.1, displaying their enjoyment of well-produced content. However, the latest interaction rated 3.0, highlighting their critical viewpoint, particularly on content that feels overly promotional or lacks depth.\n\n- **Engagement Level:** The user continues to explore diverse genres, driven by curiosity for stand-up comedy and innovative animations intertwined with scientific or educational themes.\n\n- **Cautious Explorer:** Valuing sophisticated humor and adult themes, the user remains critical of censorship that could compromise content quality, as indicated by their nuanced evaluations of recent content.\n\nOverall, the user exemplifies a thoughtful media consumer who actively seeks quality storytelling and visual integrity, with an interest in narratives that deepen their understanding of entertainment and real-world phenomena.",
  "metrics": {
    "rouge1_f": 0.16850551654964893,
    "rouge2_f": 0.01407035175879397,
    "rougeL_f": 0.07823470411233702,
    "meteor": 0.05472777346232611,
    "bleu1": 0.008918700307932551,
    "bleu2": 0.002129874332406336,
    "bleu3": 0.00035913353381945785,
    "bleu4": 0.00014760951547855534,
    "bertscore_precision": 0.35582858324050903,
    "bertscore_recall": 0.44536352157592773,
    "bertscore_f1": 0.39559319615364075
  }
}