{
  "interaction_number": 14,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/09/08\nAverage Rating: 4.3\nProduct Details: {'Subtitles': ['None available'], 'Directors': ['Steven Suderman'], 'Producers': ['Steven Suderman'], 'Studio': ['FilmBuff']}\nReview Text: I thought that this would be about what was going on in America with the organic, small farms but instead this was about small farms in Canada.  I know that there are some things in common however there is a big difference in the economic landscape between the two countries.  It does bring home some of the aspects of farming ..\nReview Title: Eh, not bad\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Gabrielle Salvatore', 'Ron Cornwall', 'Keith Koslov'], 'Producers': ['Matthew Ostrom', 'Laura Palumbo Johnson', 'Jordan Brodsky', 'Brian Flanagan', 'Dominick Pupa', 'Jonathan Partridge', 'Marni Ellis'], 'Studio': ['TLC']}\nDecent show if you like this kind of stuff. It was a test to see how the whole prime thing worked.\nWas new to Prime,\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Robert Zemeckis'], 'Producers': ['Robert Zemeckis', 'Steve Starkey', 'Carl Sagan', 'Ann Druyan'], 'Starring': ['Jodie Foster', 'Matthew McConaughey', 'James Woods']}\nThis movie is one heck of a ride.  It will leave you guessing until the end, all the performances are really well done.  The special effects are still holding up but are showing their age, but all in all it's a very good story and isn't that what makes a good movie?\nWorth it!\n{'Subtitles': ['None available'], 'Directors': ['Egami'], 'Starring': ['Gabriel Iglesias'], 'Studio': ['Egami']}\nStand up comedy at it's finest!  Yes there are some &#34;adult&#34; themes but it was very refreshing to watch a entertainer that wasn't dropping a F bomb and words related to it every 5 minutes.  Not that I find that kind of language offensive but to have a comedian not rely on those words to be funny... I'll be buying the DVD...\nFunny, Funny, Funny!\n{'Subtitles': ['None available'], 'Directors': ['KOBUN'], 'Producers': ['Shinsaku Tanaka', 'Ryuji Sekine', 'Hisato Usui', 'Takuro Hatakeyama'], 'Starring': ['Aoi Yuki', 'Daisuke Hirakawa', 'Rie Kugimiya'], 'Studio': ['A-Net Digital']}\nThe animation is different than the majority of the anime out there which is a plus, but since the \"censorship\" ink splashes detract from the visual which in this case has didn't really impact the storyline but did detract from the flow of the visuals.  That is why I gave it the rating I did.  Additionally since I am over 21 and live in a locality in which I am not prohibited in the viewing of adult images either of a sexual nature or of a violent nature I find that not having the option of choosing which version to watch rather distasteful\nMixed Bag\nMythbusters\nUnscripted, Documentary, Kids, Special Interest\n['Adam Savage and Jamie Hyneman are at it again--getting to the bottom of popular myths one experiment at a time by combining science, curiosity, and inventiveness.  Watch as Adam, Jamie and the rest of the MythBusters team see what really happens when you take candy from a baby, if people really do get cold feet when they are afraid, what happens when poop literally hits the fan and much more in this season of MythBusters.']\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Alice Dallow', 'Lauren Gray Williams', 'Tabitha Lentle', 'Steve Christiansen', 'Peter Rees', 'Andrew Farrell', 'Brian Leckey', 'Rob Hammersley', 'Eric Haven'], 'Producers': ['Linda Wolkovitch']}\nMythbusters, what else can I say?  Your either a fan or your not. Since I'm a fan.. It's really cool how science and entertainment can come to together in such a way that can be imitated but never replicated\nMythbusters.. What else needs to be said?\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Brad Bird'], 'Producers': ['Tom Cruise', 'J.J. Abrams', 'Bryan Burk'], 'Starring': ['Tom Cruise', 'Jeremy Renner', 'Simon Pegg'], 'Studio': ['Hit Movies']}\nThis is one of those movies that is a great popcorn flick, but since Brad Bird directed it its a live action comic book\nBrad Bird, at it again\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Dennis Principe Jr.', 'Julie Auerbach', 'Russell McCarroll', 'Stewart Shields', 'Matthew Ginsburg', 'Gary Auerbach', 'Gail Berman', 'Ron Brody', 'Tina Gazzerro', 'Lloyd Braun'], 'Studio': ['History']}\nThis is basically an anti - conspiracy show which is refreshing out of all the pro-conspiracy type of entertainment out there.<br />There are some episodes that I feel are a little light on the details but overall a decent show\nInteresting\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Producers': ['Chris Sanders', 'Stephen C. Harris', 'Daniel Ollek', 'Hudie Ayalon', 'Mark Phillips', 'Eric Anderson', 'Courtney McKenna', 'Jesse Carter Russell', 'Merlin Camozzi', 'Renee Tod'], 'Studio': ['A&E Television Networks']}\nWho doesn't like a good ghost story?  Is very good that it's from real people, the only down side is that it seems like certain people just &#34;give up&#34; in this series and accept the abuse/etc from the ghosts\nThe real deal\n{'Subtitles': ['None available'], 'Directors': ['Unavailable'], 'Producers': ['Bellevue Entertainment'], 'Studio': ['Unavailable']}\nVery nicely produced series, a great deal of very beautiful scenery but there are times it seems like it's a advertisement for the national park service..\nTravel anyone?\nRWBY\nBarbara Dunkelman  (Actor),     Kara Eberle  (Actor),     Monty Oum  (Director)    &                   0                  more   Rated:    NR    Format: Blu-ray\nMovies & TV, Blu-ray, Movies\n['Product Description', 'From the creators of smash hit Red vs. Blue comes RWBY, a visually-stunning and hotly anticipated new anime series. A young hero, an exalted heiress, a troubled rogue, and a party girl… These are the four members of RWBY, a team brought together and trained for the sole purpose of combating the rampant evils that plague the fantastic world of Remnant.', 'Amazon.com', 'RWBY', \"(2013) is an anime-styled American web series from Rooster Teeth Studio; its title comes from the initials of the four main characters: Ruby, Weiss, Blake, and Yang. Ruby Rose is an eager, weapon-wielding 15-year-old who's about to enter the Beacon Academy to train to become a huntress, a warrior who fights the evils that plague the world of Remnant. She's put on a team with three other standard-issue young women: spoiled, self-assured Weiss Schnee; intellectual Blake Belladonna, who hides a dark past; and enthusiastic, supportive Yang Xiao Long. The uneasy quartet and their friends from other teams are soon training to handle weapons, carry out missions, slay monsters, and function as a team. As\", 'RWBY', 'was created for the web on an obviously limited budget, the animation and designs are minimal at best. Secondary characters appear as black silhouettes and important actions often take place off camera or behind a screen of dust. The episodes only last 16 minutes, including the opening and closing titles, which may be a more awkward length to direct than the standard half-hour. Sometimes too much action is crowded into too short a space; other episodes end before the story reaches a satisfactory conclusion. But the biggest problem with', 'RWBY', 'isn\\'t the minimal animation or erratic storytelling, but an utter lack of originality. Although director-cowriter Monty Oum begins his commentary talking about \"stories I always wanted to tell,\" he and cowriters Miles Luna and Kerry Shawcross borrow pretty much everything from various anime', 'shojo', 'adventures, boarding school training series, and adventure quests, including', 'Naruto', 'and', 'Fairy Tail', '. Like', 'Avatar: The Last Airbender', ',', 'RWBY', 'was created by American artists trying to capture the excitement and appeal of Japanese animation--but with notably less success. (Not rated; suitable for ages 10 and older: cartoon violence, violence against women, tobacco use)', '--Charles Solomon']\n{'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 5.92 Ounces', 'Item model number': '28928786', 'Director': 'Monty Oum', 'Media Format': 'Multiple Formats, Animated, Blu-ray, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 50 minutes', 'Release date': 'November 12, 2013', 'Actors': 'Barbara Dunkelman, Kara Eberle, Lindsay Tuggey, Arryn Zech', 'Studio': 'Cinedigm', 'Number of discs': '1'}\nIf I have to explain it, then you probably wouldn't understand.  But seriously, the music and story line are such that it's a really good story with character development along the way.  There are some minor things that some people would find problematic but the animation is pretty good considering,\nRWBY, what can I say?\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Don Hall', 'Chris Williams'], 'Producers': ['Roy Conli'], 'Starring': ['T.J. Miller', 'Jamie Chung', 'Maya Rudolph'], 'Studio': ['WALT DISNEY PICTURES']}\nPixar had rubbed off on Disney!  This really reminds me of a Pixar film, good characters that have depth to them,  an interesting take on the whole good guy / bad guy dynamic that is a nice surprise.  I rented this to just to see if I wanted to purchase this, and yeah, I will buy the bluray\nGood Movie\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Shawn Levy'], 'Producers': ['Shawn Levy', 'Chris Columbus', 'Mark Radcliffe'], 'Starring': ['Ben Stiller', 'Steve Coogan', 'Ricky Gervais'], 'Studio': ['Fox']}\nSame old story except that this was a set up from the beginning to get this series over and done with.. Thank goodness.. If you have ever seen the other ones.. you know what is going to happen through most of the film.\nTired and more tired\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Ron Howard'], 'Producers': ['Brian Grazer'], 'Starring': ['Tom Hanks', 'Daryl Hannah', 'Eugene Levy']}\nOldie but a goodie.  Worth a watch for us when feeling  nostalgic for the 80's..\nworth the price of rental\n{'Subtitles': ['None available'], 'Directors': ['Steven Suderman'], 'Producers': ['Steven Suderman'], 'Studio': ['FilmBuff']}\nI thought that this would be about what was going on in America with the organic, small farms but instead this was about small farms in Canada.  I know that there are some things in common however there is a big difference in the economic landscape between the two countries.  It does bring home some of the aspects of farming ..\nEh, not bad",
  "profile": "**Updated User Profile Summary:**\n\n- **Content Preference:** The user maintains a keen interest in TV shows and documentaries centered on real-life ghost stories, unique animations, and educational stand-up comedy. They appreciate storytelling with character development and narrative depth, but have recently shown fatigue towards repetitive themes in familiar series, which is reflected in their balanced ratings.\n\n- **Language & Accessibility:** Their focus remains on English-language content featuring subtitles and audio descriptions for inclusivity, though they remain open to selected non-subtitled materials that resonate with their interests.\n\n- **Ratings Trends:** Their average ratings have stabilized at around 4.7, indicating a more critical approach to content, even as they continue to appreciate high-quality storytelling. A recent rating of 3.0 for a documentary shows their discerning nature, as they highlighted significant differences in context and expectations from the content viewed.\n\n- **Engagement Level:** Currently active in genres like stand-up comedy and innovative animations, the user values character-driven stories enriched by music and well-crafted narratives. Their cautious evaluations reveal both enthusiasm for nostalgic favorites and a critical outlook on newer projects.\n\n- **Cautious Explorer:** They favor sophisticated humor and mature themes, emphasizing concerns regarding censorship's impact on narrative integrity. Their thoughtful media consumption seeks original, enriching storytelling across various formats.\n\nOverall, the user exemplifies a discerning viewer, balancing nostalgia with a desire for creativity and depth while remaining aware of issues within narrative predictability and contextual relevance.",
  "metrics": {
    "rouge1_f": 0.12821917808219177,
    "rouge2_f": 0.01535929786066923,
    "rougeL_f": 0.05698630136986301,
    "meteor": 0.03480980215746871,
    "bleu1": 0.00025101137454952886,
    "bleu2": 8.970548714839375e-05,
    "bleu3": 2.6443884837982575e-05,
    "bleu4": 8.080905187010436e-06,
    "bertscore_precision": 0.35927700996398926,
    "bertscore_recall": 0.47944357991218567,
    "bertscore_f1": 0.41075196862220764
  }
}