{
  "interaction_number": 10,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: The Last of the Mohicans\nReview Date: 2014/08/08\nStore: Daniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nCategories: Movies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\nProduct Description: ['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Starring Daniel Day Lewis and Wes Studi. Includes deleted footage. (1992) Running time: 117 minutes.']\nAverage Rating: 4.8\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '2200', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Mark Mann, Michael Mann, Hunt Lowry, Ned Dowd', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nReview Text: Great adventure and love story.\nReview Title: Enjoy\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Sweatin' To The Oldies Vol. 1 [DVD]\nRichard Simmons  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Genre for Featured Categories, Exercise & Fitness\n[\"This version is out of print.Amaray packaging. The 20th Anniversary edition of Sweatin to the Oldies is Richard Simmons classic workout from the late 80's available for the first time on DVD and including sixty minutes of brand new bonus material! It's a breakthrough exercise DVD that combines classic Rock 'n' Roll music from the 50's and 60's with energetic dance moves. Songs include: It's My Party, Peggy Sue, Dancing in the Street, Great Balls of Fire, He's a Rebel, Personality, Wipe Out Ain't No Mountain High Enough, On Broadway, and Beyond the Sea.\"]\n{'Genre': 'Exercise & Fitness, Special Interests', 'Format': 'Color, DVD, NTSC', 'Contributor': 'Richard Simmons', 'Language': 'Unqualified', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '7.75 x 5.5 x 0.5 inches; 2.24 Ounces', 'Media Format': 'Color, DVD, NTSC', 'Run time': '1 hour and 30 minutes', 'Release date': 'December 6, 2011', 'Actors': 'Richard Simmons', 'Studio': 'Time Life', 'Number of discs': '1'}\nMy wife loves to exercise to this video.  I love the songs , so it was a win-win!\nWe both like it.\nElmo's World - Dancing, Music, and Books\nBill Irwin  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Today's Deals, Featured Deals & New Releases, The Big DVD & Blu-ray Blowout\n[\"Come look at the world through the eyes of everyone's favorite three-year-old! Join Elmo as he explores his special world through dancing, music, and books. Meet Dorothy, Elmo's pet goldfish, and Mister Noodle, his friend. Children will move and groove with their favorite furry red monster.\", ']]>']\n{'Genre': 'Music, Kids & Family, DVD Movie, Blu-ray Movie, Muppets, Dancing, Books', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Contributor': 'Bill Irwin', 'Language': 'English (Dolby Digital 2.0), Unqualified', 'Number Of Discs': '1', 'Aspect Ratio': '1.33:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.32 Ounces', 'Item model number': 'Relay Time: 50 min', 'Media Format': 'Multiple Formats, Closed-captioned, Color, NTSC', 'Run time': '50 minutes', 'Release date': 'July 10, 2018', 'Actors': 'Bill Irwin', 'Studio': 'SHOUT! FACTORY', 'Number of discs': '1'}\nMy grand daughter and I along with her Nana watch this when she visits.  We all sing along and havea ball!\nElmo Delivers\nPutting Performance\nBobby Eldridge  (Actor),     Innovative  (Director)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Sports\n['In this DVD, Bobby Eldridge, the PurePoint Golf Head Professional, will take you through our unique system for putting a golf ball with accuracy and consistency. Once you know these secrets, you ll be able to fix alignment and distance problems that plague most golfers for life - literally overnight.']\n{'MPAA rating': 'Unrated (Not Rated)', 'Package Dimensions': '7.1 x 5.42 x 0.58 inches; 2.93 Ounces', 'Director': 'Innovative', 'Media Format': 'NTSC', 'Run time': '45 minutes', 'Release date': 'September 9, 2008', 'Actors': 'Bobby Eldridge', 'Studio': 'Pure Point Golf', 'Number of discs': '1'}\nThis video is terrific for the golfer who wants to improve their putting.\nPutt for dough\nForrest Gump (Two-Disc Special Collector's Edition)\nTom Hanks  (Actor),     Gary Sinise  (Actor),     Robert Zemeckis  (Director)    &                   0                  more   Rated:    PG-13    Format: DVD\nMovies & TV, Paramount Home Entertainment, Comedy\n['Hanks is Forrest Gump, who despite being mentally challenged, tried hard, is honest and places his trust in luck. He tells his life story to anyone who sits next to him at a bus stop, and the flashbacks follow Forrest and his good heart through some of the highlights of modern American history.Through the use of digital imagery, Forrest appears to interact in scenes with John F. Kennedy, John Lennon and George Wallace. \"Life is like a box of chocolates.\".']\n{'Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Contributor': 'Bob Penny, Michael Burgess, Robert Zemeckis, Geoffrey Blake, Charles Boswell, Peter Dobson, Harold G. Herthum, Brett Rice, Paul Raczkowski, Byron Minns, Gary Sinise, Tom Hanks, Jason McGuire, George Kelly, Mary Ellen Trainor, Mike Jolly, Afemo Omilami, Sonny Shroyer, John Galt, Dick Cavett, Nora DunfeeBob Penny, Michael Burgess, Robert Zemeckis, Geoffrey Blake, Charles Boswell, Peter Dobson, Harold G. Herthum, Brett Rice, Paul Raczkowski, Byron Minns, Gary Sinise, Tom Hanks, Jason McGuire, George Kelly, Mary Ellen Trainor, Mike Jolly, Afemo Omilami, Sonny…  See more', 'Language': 'English (Dolby Digital 5.1), English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified', 'Runtime': '2 hours and 21 minutes', 'Aspect Ratio': '2.35:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG-13 (Parents Strongly Cautioned)', 'Product Dimensions': '7.25 x 5.25 x 0.5 inches; 6.4 Ounces', 'Director': 'Robert Zemeckis', 'Media Format': 'Multiple Formats, Closed-captioned, Color, Widescreen, NTSC', 'Run time': '2 hours and 21 minutes', 'Release date': 'August 28, 2001', 'Actors': 'Tom Hanks, Gary Sinise, Geoffrey Blake, Charles Boswell, Michael Burgess', 'Subtitles': 'English', 'Studio': 'Paramount', 'Number of discs': '2'}\nWho does not like Forrest Gump?  Terrific movies. A classic for the ages.\nSimply one of the best\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Mark Rydell'], 'Starring': ['John Wayne', 'Roscoe Lee Browne', 'Bruce Dern']}\nOne of the best from the Duke.  Worth watching several times\nCowboys are for real\nLegends of the Fall (Special Edition)\nBrad Pitt  (Actor),     Anthony Hopkins  (Actor),     Edward Zwick  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', \"This is an epic story of three brothers bound by loyalty, tested by war, and torn apart by love. Brad Pitt stars as Tristan, the wildest of the Ludlow sons, whose failure to protect his brother puts his entire family on a path of betrayal and self-destruction. From the battlefields of Europe to the farthest reaches of civilization, LEGENDS OF THE FALL follows Tristan's turbulent journey from boyhood to manhood to legend. Also starring Anthony Hopkins, Aidan Quinn, Julia Ormond and Henry Thomas.\", 'Amazon.com', \"A box-office hit when released in 1994, this sprawling, frequently overwrought familial melodrama may get sillier as its plot progresses, but it's the kind of lusty, character-based epic that Hollywood should attempt more often. It's also an unabashedly flattering star vehicle for Brad Pitt as Tristan--the rebellious middle son of a fiercely independent Montana rancher and military veteran (Anthony Hopkins)--who is routinely at odds with his more responsible older brother, Alfred (Aidan Quinn), and younger brother, Samuel (Henry Thomas). From the battlefields of World War I to his adventures as an oceangoing sailor, Tristan's life is full of personal torment, especially when he returns to Montana and finds himself competing with Alfred over Samuel's beautiful widow (Julia Ormond), whose passion for Tristan disrupts the already turbulent Ludlow clan. Under the wide-open canopy of Big Sky country, this operatic tale unfolds with all the bloodlust, tragedy, and scenery-chewing performances you'd expect to find in a hokey bestselling novel (in fact, it's based on the acclaimed novella by Jim Harrison), but it's a potent mix that's highly entertaining. Not surprisingly, John Toll won an Academy Award for his breathtaking outdoor cinematography.\", '--Jeff Shannon', 'Set Contains:', \"For anyone who loves this sweeping melodrama, the extras in this special edition make it a must-have--even if you bought the disc in its initial release. Director Ed Zwick and Brad Pitt (on one track) inject a lot of humor into their stories on dealing with the film's production. The other commentary track has cinematographer John Toll (who won an Oscar) and art director Lilly Kilvert illuminating how the two technicians worked together to create the film's luscious look. They don't talk about technical specifications as much as how studies of time and place (and a few lucky accidents) can change a script. Kilvert also guides us through a short, intriguing segment on how modern Vancouver, British Columbia, was turned into rustic Helena, Montana. Instead of the usual hunt-and-find method of an isolated music score, a menu directly links you to each scene that features James Horner's music. Three deleted scenes give more weight to Tristan's (Pitt's character) world odyssey, but, as Zwick states, they were not essential to the final film.\", '--Doug Thomas', 'See more']\n{'Genre': 'Drama, Romance', 'Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Special Edition, Subtitled, WidescreenMultiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen   See more', 'Contributor': 'Brad Pitt, Edward Zwick, TriStar Pictures, Aidan Quinn, Julia Ormond, Marshall Herskovitz, Bill Wittliff, Anthony Hopkins, Henry ThomasBrad Pitt, Edward Zwick, TriStar Pictures, Aidan Quinn, Julia Ormond, Marshall Herskovitz, Bill Wittliff, Anthony Hopkins, Henry Thomas   See more', 'Language': 'English (Dolby Digital 5.1), Portuguese, French, Unqualified, Spanish', 'Runtime': '2 hours and 13 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.4 Ounces', 'Item model number': '78727', 'Director': 'Edward Zwick', 'Media Format': 'Multiple Formats, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Special Edition, Subtitled, Widescreen', 'Run time': '2 hours and 13 minutes', 'Release date': 'October 17, 2000', 'Actors': 'Brad Pitt, Anthony Hopkins, Aidan Quinn, Julia Ormond, Henry Thomas', 'Dubbed': 'Portuguese, French, Spanish', 'Subtitles': 'English, Spanish, French, Portuguese, Chinese, Georgian, Thai', 'Producers': 'Marshall Herskovitz, Bill Wittliff, Edward Zwick', 'Studio': 'Sony Pictures Home Entertainment', 'Number of discs': '1'}\nA truely masterful movies with great actors in terrific roles.\nA Timeless Classic\nStand By Me (Special Edition)\nWil Wheaton  (Actor),     River Phoenix  (Actor)    Rated:    R    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n{'Genre': 'Adventure, Drama, Comedy', 'Format': 'Multiple Formats, Closed-captioned, Color, NTSC, Special Edition, Subtitled, Widescreen', 'Contributor': \"Scott Beach, Kiefer Sutherland, Frances Lee McCain, Marshall Bell, Casey Siemaszko, Madeleine Swift, Wil Wheaton, Art Burke, Corey Feldman, Geanette Bobst, Popeye, River Phoenix, John Cusack, Jason Oliver, Bruce Kirby, William Bronder, Bradley Gregg, Jerry O'Connell, Gary Riley, Richard DreyfussScott Beach, Kiefer Sutherland, Frances Lee McCain, Marshall Bell, Casey Siemaszko, Madeleine Swift, Wil Wheaton, Art Burke, Corey Feldman, Geanette Bobst, Popeye, River Phoenix, John Cusack, Jason Oliver, Bruce Kirby, William Bronder, Bradley Gregg, Jerry O'C…   See more\", 'Language': 'Spanish, Portuguese, English, French', 'Runtime': '1 hour and 29 minutes'}\nIf you don't like this movie then you were never 12 years old and never had any friends at that age.  &#34;Only You Ace.&#34;  What a classic line!\nRemember When you were 12 years old?\n{'Content advisory': ['Nudity', 'violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English', 'English [Audio Description]', 'Français (Canada)', 'Español (España)', 'Italiano', 'Español (Latinoamérica)', 'Polski', '日本語', 'Português', 'Français (France)'], 'Subtitles': ['English [CC]', 'Dansk [CC]', 'Español (Latinoamérica) [CC]', 'Español (España) [CC]', 'Suomi [CC]', 'Français (Canada) [CC]', 'Français (France) [CC]', 'Italiano [CC]', 'Norsk Bokmål [CC]', 'Nederlands [CC]', 'Polski', 'Português [SDH]', 'Svenska [CC]'], 'Directors': ['Frank Darabont'], 'Producers': ['Niki Marvin'], 'Starring': ['Tim Robbins', 'Morgan Freeman', 'Bob Gunton']}\nhey if you got to be in prison with anyone Morgan Freeman ans Tim Robbins are the guys to hang out with.  Seriously, terrifc ccharactor acting and a feel good movie in a rotten place.  Redemption is a great ending.\nYep you will love it.\nToy Story 3\nTom Hanks  (Actor),     Tim Allen  (Actor),     Lee Unkrich  (Director)    &                   0                  more   Rated:    G    Format: DVD\nMovies & TV, Walt Disney Studios Home Entertainment, All Disney Titles\n['Product Description', 'The creative minds behind Disney•Pixar\\'s groundbreaking animated blockbusters invites you back inside the Toys\\' delightful world for a heartwarming and hilarious Hi-Definition movie experience you\\'ll never forget. All the original voice talent returns (including Tom Hanks and Tim Allen) plus new talent including Michael Keaton as Ken and Ned Beatty as Lots-O\\'-Huggin\\' Bear. It\\'s \"the biggest, best, most exciting Toy Story of them all,\" raves Access Hollywood.', 'As Andy gets ready to leave for college, Woody, Buzz, Jessie and the rest of the gang wonder if this is the end of the line. But, when a mix up lands them in the Sunnyside Day Care Center where they meet 14 new toys, they soon discover that a wild new adventure is just beginning! Take an amazing journey with some of the most beloved characters in movie history and discover what being a friend is truly all about.', '\"It\\'s everything a movie should be: hilarious, touching, exciting and clever,\" says USA Today. Buzzing with hours of exclusive bonus features, including an interactive trivia game and the Pixar short film Day and Night, Toy Story 3 goes to infinity and beyond on Blu-ray Hi-Def!', 'Meet the Characters', 'Woody', 'Woody is a cowboy sheriff with a pull-string that, when pulled proclaims Woody\\'s signature catchphrases from the 1950s TV show \"Woody\\'s Roundup.\" He\\'s always been Andy\\'s favorite toy. Even though his owner is now grown, the loyal sheriff Woody maintains a steadfast belief that Andy still cares about his toys. As the toys venture into their unknown future, Woody remains the voice of reason. As their dependable leader, he ensures that no toy gets left behind.', 'Buzz Lightyear', \"Buzz Lightyear is a heroic space ranger action figure, complete with laser beam, karate-chop action and pop-out wings. Buzz is a boy's dream toy who becomes a quick favorite of young Andy, and the closest of buddies with Woody. While Buzz's sole mission used to be defeating the evil Emperor Zurg, what he now cares about most is keeping his toy family together. Buzz's new mission is sidetracked along the way, however, when his journey brings out surprising aspects of his personality even he didn't know existed.\", 'Jessie', \"Jessie is an exuberant, rough-and-tumble cowgirl doll who's always up for a daring adventure to help critters in need. With Andy's imminent departure hanging over the toys, Jessie is afraid of being abandoned by her owner once again. She takes charge, insisting that the toys take control of their own destinies. But is it a decision they'll later regret!\", 'Rex', 'Rex may look like the most fearsome dinosaur in the toy box, but this tyrannosaurus is one of the most lovable toys of the bunch. Despite his endless worrying and insecurities about his small roar, Rex always comes through for his pals.', 'Hamm', \"A pink piggybank with a penchant for one-liners. He's still a know-it-all, or at least that's what he'd like everyone to believe.\", 'Mr. Potato Head', 'Mr. Potato Head is a wisecracking, hot-headed spud, complete with angry eyes. He\\'s the eternal pessimist with a tough plastic exterior, but his total devotion to his little \"sweet potato,\" Mrs. Potato Head, reveals a softer side..', 'Mrs. Potato Head', 'Mrs. Potato Head is Mr. Potato Head\\'s biggest fan. She adores her brave spud and is always willing to lend him a hand. Or an eye. While Mr. Potato Head\\'s \"sweet potato\" lives up to her pet name, she also shares her husband\\'s hair-trigger temper.', 'Bullseye', 'Bullseye is Woody\\'s trusty toy steed from the \"Woody\\'s Roundup\" gang. Bullseye can ride like the wind and leap across giant canyons in a single bound, especially when Woody is in the saddle.', 'Big Baby', 'Your little one with love this lifelike baby doll with his soft, cuddly fabric body and vinyl arms, legs, and face. With dazzling blue eyes that open and close, this realistic baby encourages nurturing play. Eighteen inches tall, he comes dressed in an adorable yellow onesie with matching bonnet, and has his own magical bottle of milk that disappears while he drinks! A perfect first doll for your special child. Machine washable on gentle cycle. Flame Retardant.', 'Chatter Telephone', \"Ring-ring! The Fisher-Price Chatter Telephone is a classic pull toy that has been inspiring giggles for many generations, while building motor skills and balance. Preschoolers can't resist the friendly face with eyes that move up and down when they pull the toy along, and the bright colors and pleasing sounds keep them happy and engaged. Chatter Telephone is ideal for the little hands in your life.\", 'Mr. Pricklepants', 'Frolic your afternoons away on woodland adventures with Mr. Pricklepants! This charming lederhosen-wearing hedgehog is from the Waldfreunde collection of premium imported plush toys. He may look prickly, but the plump and fuzzy Mr. Pricklepants is made strictly for cuddling! Hand wash and air dry. Restore fluffiness with fingers. Made in Germany.', 'Dolly', 'Dolly is a soft and sweet dress-up rag doll, and is the perfect gift for any young child! Her floppy body and sunny smile will make her an irresistible new member of your family. Dolly has purple hair, googly eyes and gently blushing cheeks. She comes with a pretty blue dress, but templates are included to create and sew your own outfits. Machine washable on gentle cycle.', 'Stretch', 'Stretch is a fun-loving under-the-sea octopus friend that shines in glittery purple. Kids can count her eight rubbery legs and dozens of sticky suckers that are sure to stand up to rough-and-tumble play and extreme stretching. Toss her high on the wall and watch her climb her way down! Clean in mild soap solution to remove dust and lint.', 'Twitch', 'Meet Twitch, the insectaloid warrior, where MAN + INSECT = AWESOME! This sturdy action figure stands over five inches tall, with more than 15 points of articulation, including ferocious chomping mandibles. Use his powerful wings and impenetrable exoskeleton to evade capture! Twitch is meticulously detailed and includes his signature magical battle staff and removable chest armor. For children ages 4 and up. Other insectaloid figures sold separately.', 'Trixie', \"Trixie is a perfect playmate for prehistoric playtime! Visit the era when dinosaurs ruled the Earth! Made of rigid, durable plastic and in friendly shades of blue and purple. Trixie features an expressive mouth and movable legs. This gentle Triceratops will feed any child's imagination. Also available: Tyrannosaurus Rex, Stegosaurus and Velociraptor.\", \"Lots-o'-Huggin' Bear\", \"Lots-o'-Huggin' Bear is a jumbo, extra-soft teddy bear with a pink and white plush body and a velvety purple nose. This lovable bear stands fuzzy heads and shoulders above other teddy bears because he smells like sweet strawberries! With a smile that will light up your child's face and a belly just asking to be hugged. Lots-o'-Huggin' Bear is sure to become a bedtime necessity. Stain-resistant. Spot clean plush surface with a damp cloth.\", 'Ken', \"Grab your binoculars and join Ken on a safari! A swinging bachelor who's always on the lookout for fun, Ken sports the perfect outfit for his eco-adventure: light blue shorts and a leopard-print shirt with short sleeves sure to keep him cool in the hot sun. And after his exciting expedition, Ken will be ready to hit the dance floor in style. His accessories include matching scarf, sensible loafers, and a fashion-forward gold belt. Dozens of additional Ken outfits sold separately.\", 'Meet the voices behind your favorite characters:', \"(From left to right) Tom Hanks as Woody, Tim Allen as Buzz, and Joan Cusack as Jesse  \\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0\\xa0 (From left to right) Ned Beatty as Lots-O', Don Rickles as Mr. Potato Head, and Michael Keaton as Ken\", 'Amazon.com', 'What made the original', 'Toy Story', 'so great, besides its significant achievement as the first-ever feature-length computer animated film, was its ability to instantly transport viewers into a magical world where it seemed completely plausible that toys were living, thinking beings who sprang to life the minute they were alone and wanted nothing more than to be loved and played with by their children.', 'Toy Story 3', \"absolutely succeeds in the very same thing--adults and children alike, whether they've seen the original film or not, find themselves immediately immersed in a world in which Woody (Tom Hanks), Buzz Lightyear (Tim Allen), Jessie (Joan Cusack), Mr. and Mrs. Potato Head (Don Rickles and Estelle Harris), Ham (John Ratzenberger), Rex (Wallace Shawn), the aliens, and the rest of Andy's toys remain completely devoted to Andy (John Morris) even as he's getting ready to pack up and leave for college. Woody scoffs at the other toys' worries that they'll end up in the garbage, assuring them that they've earned a spot of honor in the attic, but when the toys are mistakenly donated to Sunnyside Daycare, Woody is the only toy whose devotion to Andy outweighs the promise of getting played with each and every day. Woody sets off toward home alone while the other toys settle in for some daycare fun, but things don't turn out quite as expected at the daycare thanks to the scheming, strawberry-scented old-timer bear Lots-o'-Huggin' (Ned Beatty). Eventually, Woody rejoins his friends and they all attempt a daring escape from the daycare, which could destroy them all. The pacing of the film is impeccable at this point, although the sense of peril may prove almost too intense for a few young viewers. Pixar's 3-D computer animation is top-notch as always and the voice talent in this film is tremendous, but in the end, it's Pixar's uncanny ability to combine drama, action, and humor in a way that irresistibly draws viewers into the world of the film that makes\", 'Toy Story 3', 'such great family entertainment. (Ages 7 and older)', '--Tami Horiuchi', 'Review', 'Bonus Features', 'Day & Night Theatrical Short Three Studio Stories Plus Much More --Walt Disney Studios Home Entertainment', 'See more']\n{'Genre': 'Animation', 'Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, WidescreenMultiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen  See more', 'Contributor': 'Tom Hanks, Joan Cusack, Estelle Harris, Ned Beatty, Michael Keaton, Don Rickles, John Ratzenberger, Tim Allen, Lee Unkrich, Wallace ShawnTom Hanks, Joan Cusack, Estelle Harris, Ned Beatty, Michael Keaton, Don Rickles, John Ratzenberger, Tim Allen, Lee Unkrich, Wallace Shawn  See more', 'Language': 'Unqualified, English (Dolby Digital 5.1 EX)', 'Runtime': '1 hour and 43 minutes', 'Aspect Ratio': '1.78:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'G (General Audience)', 'Product Dimensions': '0.56 x 5.14 x 7.65 inches; 2.4 Ounces', 'Item model number': '786936805604', 'Director': 'Lee Unkrich', 'Media Format': 'Multiple Formats, AC-3, Animated, Closed-captioned, Color, Dolby, Dubbed, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 43 minutes', 'Release date': 'November 2, 2010', 'Actors': 'Tom Hanks, Tim Allen, Joan Cusack, Ned Beatty, Don Rickles', 'Dubbed': 'French, Spanish', 'Subtitles': 'English', 'Studio': 'Disney*Pixar', 'Country of Origin': 'USA', 'Number of discs': '1'}\nWoody and the guys and gals are just so entertaining even for adults.\nA good sequel\nThe Last of the Mohicans\nDaniel Day-Lewis  (Actor),     Madeleine Stowe  (Actor),     Michael Mann  (Director, Producer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Studio Specials, 20th Century Fox Home Entertainment, All Fox Titles\n['An epic adventure and passionate romance unfold against the panorama of a frontier wilderness ravaged by war. Starring Daniel Day Lewis and Wes Studi. Includes deleted footage. (1992) Running time: 117 minutes.']\n{'Genre': 'Action & Adventure', 'Format': 'Multiple Formats, Color, NTSC', 'Contributor': 'Madeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry, Eric Schweig, Michael McConnell, Terry Kinney, Alice Papineau, Jared Harris, Wes Studi, Ethan James Fugate, Curtis F. Gaston, Russell Means, Mike Phillips, Mark A. Baker, William J. Bozic Jr., Sheila Adams Barnhill, Jodhi May, Mark Mann, Mark J. Maracle, Don Tilley, Dennis J. Banks, Eric D. Sandgren, Dylan Baker, Sebastian Roche, Justin M. Rice, Steven Waddington, David Schofield, Joe Finnegan, Mac Andrews, Daniel Day-Lewis, Maurice Roeves, Malcolm Storry, Clark Heathcliffe, Scott Means, Patrice Chéreau, David Mark Farrow, Colm Meaney, Pete Postlethwaite, Michael Phillips, Thomas E. CummingsMadeleine Stowe, Gregory Zaragoza, Michael Mann, Eric A. Hurley, Edward Blatchford, Thomas John McGowan, Tracey Ellis, Ned Dowd, Mark Joy, Benton Jennings, Bonnie Timmermann, Tim Hopper, Patrick Fitzgerald, Steve Keator, Patrice Chereau, Hunt Lowry,…   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 57 minutes', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '0.6 x 5.4 x 7.6 inches; 0.01 Ounces', 'Item model number': '2200', 'Director': 'Michael Mann', 'Media Format': 'Multiple Formats, Color, NTSC', 'Run time': '1 hour and 57 minutes', 'Release date': 'January 23, 2001', 'Actors': 'Daniel Day-Lewis, Madeleine Stowe, Russell Means, Eric Schweig, Jodhi May', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Mark Mann, Michael Mann, Hunt Lowry, Ned Dowd', 'Studio': 'Fox Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nGreat adventure and love story.\nEnjoy",
  "profile": "**User Summary:**\n\nThis user continues to exhibit a robust dedication to fitness while actively nurturing family bonds through shared entertainment experiences. Their recent engagement with a beloved classic film underscores their appreciation for iconic cinema, enhancing joyful moments with family, particularly their granddaughter. This aligns with their broader interest in timeless storytelling that bridges generational gaps and fosters meaningful discussions.\n\nKey trends include:\n\n- **Fitness & Exercise**: Ongoing exploration of resources that promote well-being and healthy living, emphasizing the importance of physical activity.\n- **Nostalgia & Classic Entertainment**: A growing collection of cherished films, particularly those that evoke positive memories and encourage family viewing experiences, including strong narratives of adventure and romance.\n- **Family-focused**: All activities center on togetherness, contributing to health, happiness, and memorable moments, particularly through character-driven stories that resonate across generations.\n- **Positive Reception**: The user demonstrates a discerning taste, often providing high ratings for selections that effectively blend entertainment with impactful themes.\n\nOverall, this user actively seeks engaging and educational content that celebrates nostalgia, supports enjoyable recreational activities, and fosters strong family connections. Their commitment to creating joyful experiences through beloved films and fitness remains a consistent theme in their interactions.",
  "metrics": {
    "rouge1_f": 0.0479890310786106,
    "rouge2_f": 0.0027434842249657062,
    "rougeL_f": 0.025137111517367458,
    "meteor": 0.015168097075821283,
    "bleu1": 6.190517947776105e-11,
    "bleu2": 1.9706320167750575e-11,
    "bleu3": 2.8121183632030504e-12,
    "bleu4": 1.0634059293372768e-12,
    "bertscore_precision": 0.32911422848701477,
    "bertscore_recall": 0.5175950527191162,
    "bertscore_f1": 0.4023763835430145
  }
}