{
  "interaction_number": 2,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Creamily Women Short Bob Wig with Air Bangs Dark Brown Synthetic Chin Length Straight Hair Daily Wear Heat Resistant Full Replacement Wig\nReview Date: 2020/09/04\nStore: Creamily\nAverage Rating: 3.5\nProduct Details: {'Item Dimensions LxWxH': '12 x 4 x 1 inches', 'Hair Type': 'Straight', 'Brand': 'Creamily', 'Age Range (Description)': 'Adult', 'Product Dimensions': '12 x 4 x 1 inches; 6.46 Ounces'}\nReview Text: This wig is a lot shorter than it looks in the picture.  I know it says it's a bob and that it is.  It comes down to just above my chin.  It would make a nice wig for a flapper costume.  It isn't realistic.  It's very shiny!  The part is white and really stands out.  You could tone down the shine with dry shampoo.  But the overall look is fake.  I got the dark brown and it's almost black.  It does come with a wig cap to wear underneath.\nReview Title: Nice for a costume.\nRating: 4.0\n--------------------------------------------------",
  "reference_summary": "Ionic Hair Dryers for Women 1800W Blow Dryer with Diffuser Hot and Cool Settings Speed Adjustable Negative Ion Hair Dryer with 2 Concentrators,1 Hair Scalp Massager Brush for Curly Hair(LTD Edition)\nLassie\n{'Brand': 'Lassie', 'Power Source': 'Corded Electric', 'Hair Type': 'Curly', 'Number of Speeds': '2', 'Product Dimensions': '11.4 x 9.4 x 3.7 inches; 2.43 Pounds', 'Manufacturer': 'Lassie'}\nI have never used one of the Dyson hair dryers.  I have heard women LOVE them.  I am not ever going to spend $300 - $400 on a hair dryer.  No way!  This one looks a lot like a Dyson.  I can't imagine how a Dyson would be better than this one.  This one is great!  I LOVE it.  I have curly hair and it works wonderful for me.  I dry my hair upside down with the diffuser on cool.  That really helps to cut down on the frizz.  It takes awhile but it's worth it.  I change out the nozzle and use one of the other tools to dry and lift at my scalp.  It gives me a lot more volume.  The dryer is a little heavier than some of my other dryers.  Yes, I have several.  I also like that you don't get all hot and sweaty when drying your hair.  My husband loves that I don't heat up the bathroom!  I really can't say enough good about this dryer.  It is well worth the price.  If you want hot air, this probably isn't the best dryer for that.  It doesn't get really hot.  The cord is long.  I cut a piece of velcro to wrap around it and it works great to keep it untangled.  Highly recommend!!\nI would think it's comparable to the $400 dryers.\nCreamily Women Short Bob Wig with Air Bangs Dark Brown Synthetic Chin Length Straight Hair Daily Wear Heat Resistant Full Replacement Wig\nCreamily\n{'Item Dimensions LxWxH': '12 x 4 x 1 inches', 'Hair Type': 'Straight', 'Brand': 'Creamily', 'Age Range (Description)': 'Adult', 'Product Dimensions': '12 x 4 x 1 inches; 6.46 Ounces'}\nThis wig is a lot shorter than it looks in the picture.  I know it says it's a bob and that it is.  It comes down to just above my chin.  It would make a nice wig for a flapper costume.  It isn't realistic.  It's very shiny!  The part is white and really stands out.  You could tone down the shine with dry shampoo.  But the overall look is fake.  I got the dark brown and it's almost black.  It does come with a wig cap to wear underneath.\nNice for a costume.",
  "profile": "**User Profile Summary:**\n\n- **Product Preferences:** Values efficient and effective hair care tools, particularly for curly hair, while also exploring alternatives such as wigs for different styling needs. Shows a preference for high-quality, value-for-money products rather than high-end, expensive brands.\n- **Experience with Hair Dryers:** Experienced user with multiple hair dryers; prefers products that offer functionality (e.g., speed settings, diffusers) suited for curly hair. Cherishes features that reduce frizz and provide volume.\n- **Usage Style:** Tends to dry hair upside down for enhanced results, utilizing specific attachments for optimal styling.\n- **Comfort & Convenience:** Prioritizes comfort during use (e.g., avoiding overheating the bathroom, ease of handling), leaning towards products that are practical and user-friendly, such as those with long cords.\n- **Environmental Sensitivity:** Interested in minimizing excess heat generation, as indicated by a preference for cool settings.\n- **Overall Satisfaction:** Generally maintains a high level of satisfaction with purchased products, reflecting a positive attitude towards those meeting personal standards of performance and comfort. Recently expressed a more critical view regarding the realism of certain products, indicating a nuanced perspective on product quality.\n- **Sharing Experiences:** Willing to recommend products based on personal experience, suggesting a trust in peer feedback.\n\nThis profile highlights a practical, value-conscious user who prioritizes quality and comfort in hair care products, particularly for curly hair, while also being open to exploring creative styling options.",
  "metrics": {
    "rouge1_f": 0.22781065088757393,
    "rouge2_f": 0.032640949554896145,
    "rougeL_f": 0.10650887573964499,
    "meteor": 0.12970431836618557,
    "bleu1": 0.1490629412942997,
    "bleu2": 0.047453943934108324,
    "bleu3": 0.015056415873391333,
    "bleu4": 0.0047731904500825754,
    "bertscore_precision": 0.4079427719116211,
    "bertscore_recall": 0.4499821066856384,
    "bertscore_f1": 0.4279324412345886
  }
}