{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nReview Date: 2015/06/16\nAverage Rating: 4.9\nProduct Details: {'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nReview Text: The first and second seasons were better<br />This is pretty good<br />They need to go back to the original idea\nReview Title: I like Timothy Oliphant, but they should go back to the original idea of the series\nRating: 3.0\n--------------------------------------------------",
  "reference_summary": "It Might Get Loud\nJimmy Page  (Actor),     The Edge  (Actor),     Davis Guggenheim  (Director, Producer)    &                   0                  more   Rated:    PG    Format: DVD\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n['Product Description', 'A documentary on the electric guitar from the point of view of three significant rock musicians: The Edge, Jimmy Page, and Jack White. Starring: Jimmy Page, The Edge, Jack White', 'Amazon.com', 'Three generations of rock guitarists come together for', 'It Might Get Loud', ', a 2009 documentary directed by Davis Guggenheim (', 'An Inconvenient Truth', '). These are not just your garden-variety guitar gods: Jimmy Page, in his mid-\\'60s at the time of the film, founded Led Zeppelin, who dominated the 1970s following the breakup of the Beatles. As a member of U2, 48-year-old David Evans, better known as the Edge, created one of the most distinctive and influential sounds of the past quarter century. And 34-year-old Jack White (of the White Stripes, the Raconteurs, and the Dead Weather) was described by one music publication as \"the most significant rock \\'n\\' roll figure of the past ten years.\" Guggenheim, who followed the three around for the better part of a year, takes us into their individual lives, past and present. There are shots of Page as a young London session musician, with the Yardbirds and Zeppelin, at Headley Grange (the estate where much of the fourth Zep album was made), and at home with his record collection. The Edge takes us to the Dublin classroom where U2 first rehearsed, as well as to the practice room he uses now (never a virtuoso soloist, he developed a style based on texture and a mind-boggling array of effects); and White, whose insistence on authenticity is admirable but perhaps a tad self-conscious, constructs a \"guitar\" from a plank of wood, a piece of wire, and a Coke bottle (he also plays a recording by the primitive bluesman Son House, featuring just voice and handclaps, that White says is still his biggest inspiration). The three also converge on a Hollywood sound stage, where they chat and a do a little jamming on Zep\\'s \"In My Time of Dying\" (with all three playing slide guitar) and the Band\\'s \"The Weight.\" It\\'s hard to say if the film\\'s appeal will extend beyond guitar freaks and fans of these particular bands, but at the very least,', 'It Might Get Loud', \"offers some interesting insight into the soul and inspiration behind some of pop's best and most popular music.\", '--Sam Graham']\n{'Genre': 'Documentary, Musical', 'Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Contributor': 'Bono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas TullBono, Jimmy Page, Davis Guggenheim, The Edge, Jack White, Steel Curtain Pictures, LLC, Peter Afterman, Lesley Chilcott, The  Edge, Thomas Tull   See more', 'Language': 'Unqualified', 'Runtime': '1 hour and 38 minutes', 'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'PG (Parental Guidance Suggested)', 'Product Dimensions': '7.5 x 5.3 x 0.7 inches; 0.32 Ounces', 'Item model number': '6524754', 'Director': 'Davis Guggenheim', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, NTSC, Widescreen', 'Run time': '1 hour and 38 minutes', 'Release date': 'December 22, 2009', 'Actors': 'Jimmy Page, The Edge, Jack White, Bono, The  Edge', 'Producers': 'Thomas Tull, Davis Guggenheim, Lesley Chilcott, Peter Afterman', 'Studio': 'Sony Pictures Home Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\nI watched this because seeing Pagey in this kind of detail is rare.<br />One has to put up with Jack White (as white as they come, good name) and Dull Edge (incongruous seeing him on stage--or the same planet--with Jimmy Page) but overall is is worth it. I did have to go to \"mute\" on several occasions, when I could not stand it.\nSeeing Pagey here is worth putting up with the other two\nThe Cabin in the Woods\nSuspense, Comedy, Harrowing, Terrifying\n['A rambunctious group of five college friends steal away for a weekend of debauchery in an isolated country cabin, only to be attacked by horrific supernatural creatures in a night of endless terror and bloodshed.']\n{'Audio languages': ['English', 'English [Audio Description]'], 'Subtitles': ['English [CC]'], 'Directors': ['Drew Goddard'], 'Producers': ['Joss Whedon'], 'Starring': ['Kristen Connolly', 'Chris Hemsworth', 'Anna Hutchison']}\nThis is not your typical horror movie<br />If you liked \"Cube\" you will probably like this.<br /><br />Very entertaining.<br />I enjoyed the mix of folklore and technology<br />Pretty good surprise ending\nNot your typical horror movie\nJustin Bieber's Believe\nMusic Videos and Concerts, Documentary, Charming, Cheerful\n[\"Experience Justin Bieber's real story in this compelling documentary featuring thrilling never-before-seen concert footage, behind-the-scenes access and special appearances.\"]\n{'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Jon M. Chu'], 'Producers': ['Justin Bieber', 'Scooter Braun', \"Bill O'Dowd\", 'Usher Raymond IV', 'Garrett Grant'], 'Starring': ['Justin Bieber', 'will.i.am', 'Ellen DeGeneres']}\nOK, what happened to his pants????<br />Really not much more to say here<br />Except...what happened to his pants????<br />Is this Dysgenics or drugs?<br />Both?\nOK, what happened to his pants????\n{'Subtitles': ['None available'], 'Directors': ['---'], 'Producers': ['John H. Radulovic', 'Lou Fusaro'], 'Starring': ['Xander Berkeley', 'Sarah Clarke', 'Jenni Blong'], 'Studio': ['Vuguru']}\nThis is a great idea for a movie, or two or three...<br />I love Xander Berkeley, he has been one of my favorite character actors for many years.<br />He was great in 24<br />One wonders if the ultimate question &#34;Is he Satan?&#34; will ever be answered?<br />In the second one, which I have not finished yet (so don't ruin it for me!) it seems that Xander's character actually could have an enemy or at least an antagonist...he may FEAR someone, which makes it more complex..and interesting\nLove the idea for this movie and Xander is the best character actor for it\n{'Content advisory': ['Violence', 'alcohol use', 'foul language', 'sexual content'], 'Audio languages': ['English Dialogue Boost: High', 'English', 'English [Audio Description]', 'English Dialogue Boost: Medium'], 'Subtitles': ['English [CC]'], 'Directors': ['Ciaran Donnelly', 'Ken Girotti', 'Steve Saint Leger', 'Jeff Woolnough', 'Helen Shaver', 'Daniel Grou', 'David Frazee', 'Joshua Zimmerman', 'David Wellington', 'Johan Renck'], 'Starring': ['Travis Fimmel', 'Katheryn Winnick', 'Clive Standen'], 'Studio': ['History']}\nGood show that needed to be written<br />The Vikings did amazing things<br />History would not be the same without them\nVery good history. Fun stories\n{'Content advisory': ['Violence', 'alcohol use', 'smoking', 'foul language', 'sexual content'], 'Audio languages': ['English'], 'Subtitles': ['English [CC]'], 'Directors': ['Adam Arkin', 'Jon Avnet', 'Peter Werner', 'Michael Dinner', 'John Dahl', 'Bill Johnson', 'Michael W. Watkins', 'Gwyneth Horder-Payton', 'Don Kurt', 'Dean Parisot'], 'Producers': ['Fred Golan', 'Sarah Timberman', 'Carl Beverly', 'Michael Dinner', 'Graham Yost', 'Elmore Leonard']}\nThe first and second seasons were better<br />This is pretty good<br />They need to go back to the original idea\nI like Timothy Oliphant, but they should go back to the original idea of the series",
  "profile": "The user has a profound appreciation for rock music and iconic musicians, favoring documentaries that explore the lives and influences of legendary guitarists. Their primary interests lie in classic rock, with an emphasis on content celebrating well-known figures and the artistry of the genre. Despite personal biases, they remain open to diverse perspectives within the rock scene.\n\nRecent interactions reveal an expanding fascination with innovative storytelling in film, particularly enjoying a unique horror movie that weaves folklore with technology. This suggests a growing appreciation for narratives that challenge traditional genres and emphasize depth and originality. Their reviews highlight a strong affinity for character-driven stories and nuanced performances, seeking content that merges entertainment with informative insights.\n\nAdditionally, the user exhibits an interest in historical narratives, positively reviewing shows portraying significant events and figures. They maintain a critical stance on celebrity culture, valuing authenticity and detailed portrayals over pop music trends. In a recent review, they expressed a preference for returning to original concepts in series, indicating a discerning taste that values cohesion and integrity in storytelling. Overall, the user exemplifies a refined palate that seeks insightful storytelling and innovative approaches across music and film, navigating personal biases while engaging with broader cultural critiques.",
  "metrics": {
    "rouge1_f": 0.14545454545454545,
    "rouge2_f": 0.005826656955571741,
    "rougeL_f": 0.06545454545454547,
    "meteor": 0.04010365251727543,
    "bleu1": 0.00044597633533354083,
    "bleu2": 0.00010840740071909035,
    "bleu3": 1.7307785990334662e-05,
    "bleu4": 6.9234567610426185e-06,
    "bertscore_precision": 0.30654576420783997,
    "bertscore_recall": 0.45125263929367065,
    "bertscore_f1": 0.3650827705860138
  }
}