{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: WXJ13 20 Pieces EyeLash Cleansing Brush with Makeup Bag Lash Shampoo Brushes Extension Eyelash Nose Pore Deep Cleaning Brush\nReview Date: 2020/04/29\nStore: WXJ13\nAverage Rating: 4.5\nProduct Details: {'Brand': 'WXJ13', 'Recommended Uses For Product': 'Eyelashes', 'Material': 'Wood', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '20', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '7.24 x 5.75 x 1.73 inches; 8.82 Ounces'}\nReview Text: we use this for our Lash Diva's to do their lash baths with & we love them!<br />Brushes are soft<br />Order arrived quick<br />Prices are great\nReview Title: Good Quality\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "G2PLUS Eyelash Extension Adhesive Glue Pallet Sticker Pads,1-Inches Diameter (Small-100 Pads, 5 Sheets)\nG2PLUS\n{'Package Dimensions': '9 x 6 x 0.01 inches; 2.4 Ounces'}\nSticker was good but glue seems to dry out fast.\nThree Stars\nBESTIM INC(TM) Disposable 100PCS Glue Ring Pallet Holder for Tattoo Pigmen Eyelash Extension\nBESTIM INC\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.67 x 4.09 x 1.42 inches; 0.64 Ounces', 'UPC': '701828569334'}\nPrice is great.. Order came fast<br />I love using these glue rings.. Makes me lash faster\nFive Stars\nOllieroo Makeup Train Case Rose-Pink Lockable PU Artist Makeup Cosmetic Train Case with 4 Removable Rolling Wheels and 4 Keys\nOllieroo\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '23 x 16.75 x 12.25 inches; 16.95 Pounds', 'Item model number': 'HB01830'}\nI wish it had a Real lock on it. It came with 2 sets of keys but it does not lock.<br />Other then that box is cute and workable\nI wish it had a Real lock on it. ...\nThe Roots Naturelle Curly Hair Products Bouncy Curls (8 Ounce). Moisturizing Anti-frizz Cream for Natural Hair\nThe Roots Naturelle\n['Ultra Rich hydrating cream made specifically to create the spring in your curls that only nature can create. Olive and grape seed oils infuse moisture while our proteins strengthen and protect your tresses from frizz. Whether you have kinky, curly, afro or wavy curls, Bouncy curls will deliver the soft touchable curls you’ve always wanted. Directions: Perfect for daily styling. Apply to towel-dried hair. Massage in from root to tip saturating strands. Style as desired, allowing hair to dry naturally. Ingredients include: Panthenol (Pro-vitamin B5), Aloe Barbadensis Leaf Extract, Triticum Vulgare (Wheat Germ Oil), Olea Europea (Olive oil), Butyrospermum Parkii (Shea Butter), Cocos nucifera (Coconut Oil), Fragrance.']\n{'Hair Type': 'Wavy, Dry, Curly', 'Scent': 'Grape, Coconut', 'Liquid Volume': '8 Fluid Ounces', 'Item Form': 'Cream', 'Brand': 'The Roots Naturelle', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '3 x 3 x 3 inches; 9.6 Ounces', 'UPC': '794168040991 850605005562', 'Manufacturer': 'The Roots Naturelle'}\nI will be purchasing more. I bought this for my grandson and it makes his curls nice and moist\nI bought this for my grandson and it makes his curls nice and moist\nMoYo Natural Labs 8 oz Travel Bottles, Empty Travel Containers with Disc Caps, BPA Free PET Plastic Squeezable Toiletry/Cosmetic Bottles (Pack of 3, Pink)\nMoYo Natural Labs\n['MoYo Natural Labs, commercial grade plastic 8 OZ CONTAINER BPA free and made in the USA leak-proof travel size bottle set.MoYo Natural Labs PET bottles and shampoo containers are built to be re-used often, resisting rot and other chemicals. PET plastic creates no harmful emissions during its production or during useAt 8 oz, (236 ml) these squeezable, refillable, leakproof bottles guarantee you\\'re buying the best no leak secure disc cap that stays shut when you need it to.Made of PET #1 plastic that\\'s designed to last, our 8 oz industrial containers are perfect for all of your liquid toiletries, essential oil and beauty cosmetics. The benefits of EMPTY SHAMPOO BOTTLE Plastic: - 8 oz empty conditioner bottles meet FDA guidelines with long-lasting non-toxic plastic for your empty shampoo bottle. - Feel safe and secure with reusing your bottles over a long period of time. - Large neck making it easy to fill the bottle. - Leak-proof bottle design prevents wasting any of your valuable toiletries. - Perfect for all of your toiletry or food or liquid items that you wish to store as no spill bottles in your luggage - OUR 8 OZ CONTAINER PROMISE! If these lotion bottles from MoYo Natural Labs become compromised or leak in the first year, we\\'ll replace your small containers, even if it is your fault. We\\'re that confident that you\\'ll love your new large 8 oz bottle and will continue to use MoYo Natural Labs empty liquid dispenser in the future. CLICK the \"Add to Cart\" button to order the MoYo Natural Labs PET 8 oz shampoo bottle 8 ounce squeeze bottle today!']\n{'Brand': 'MoYo Natural Labs', 'Material': 'Plastic', 'Color': 'Pink', 'Capacity': '8 Ounces', 'Special Feature': 'Leak Proof', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.3 x 3.6 x 3.4 inches; 3.21 Ounces', 'Item model number': '8OZ-PINK-PET-DC-PK3', 'UPC': '669002967188', 'Manufacturer': 'MoYo Natural Labs'}\nPretty color but wasn’t worth the price\nWasn’t worth it\nWXJ13 20 Pieces EyeLash Cleansing Brush with Makeup Bag Lash Shampoo Brushes Extension Eyelash Nose Pore Deep Cleaning Brush\nWXJ13\n{'Brand': 'WXJ13', 'Recommended Uses For Product': 'Eyelashes', 'Material': 'Wood', 'Skin Type': 'All', 'Item Form': 'Wand', 'Number of Pieces': '20', 'Age Range (Description)': 'Adult', 'Ferrule Material': 'Aluminum', 'Skin Tone': 'All', 'Package Dimensions': '7.24 x 5.75 x 1.73 inches; 8.82 Ounces'}\nwe use this for our Lash Diva's to do their lash baths with & we love them!<br />Brushes are soft<br />Order arrived quick<br />Prices are great\nGood Quality",
  "profile": "**User Profile Summary:**\n\n- **Product Interest**: The user continues to focus on beauty and cosmetics accessories, particularly eyelash extensions, while maintaining an expanding interest in hair care products for curly hair. They remain keen on makeup organization solutions.\n\n- **Quality Conscious**: The user values durability and functionality across all product categories, reinforced by recent positive experiences with high-quality beauty accessories and hair care items.\n\n- **Satisfaction Improvement**: Although they typically rate products around average, they demonstrate an increasing expectation for superior performance and value. Their latest low rating for travel bottles highlights a desire for products that provide greater justification for cost.\n\n- **Preference for Value**: The user consistently seeks a balance between cost and quality, expecting practical benefits that enhance their beauty and hair routines. Aesthetics and functionality are essential in their beauty purchases.\n\n- **Review Style**: Known for providing analytical feedback, their recent review reflects heightened scrutiny towards value for money and overall product effectiveness. A recent purchase of cleansing brushes has received a positive review, emphasizing quality and performance.\n\n- **Purchasing Behavior**: Brand loyalty and a desire for products that improve efficiency in beauty routines remain strong. The user is actively searching for solutions that meet their expectations for both performance and value, particularly in their beauty and organizational needs.",
  "metrics": {
    "rouge1_f": 0.14638783269961977,
    "rouge2_f": 0.011428571428571427,
    "rougeL_f": 0.07034220532319392,
    "meteor": 0.060969515242378806,
    "bleu1": 0.01610180971239194,
    "bleu2": 0.004142327493389047,
    "bleu3": 0.0006737971699946533,
    "bleu4": 0.00027200823032772165,
    "bertscore_precision": 0.34440749883651733,
    "bertscore_recall": 0.4442979395389557,
    "bertscore_f1": 0.3880271017551422
  }
}