{
  "interaction_number": 12,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: X-Men Trilogy Pack Icon\nReview Date: 2018/06/07\nStore: Hugh Jackman  (Actor),     Halle Berry  (Actor),     Bryan Singer  (Director),     Brett Ratner  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nCategories: Movies & TV, Sci-Fi Series & Sequels, X-Men\nProduct Description: ['Triple DVD + Digital HD. X-Men 2: X-Men United: Born into a world filled with prejudice are children who possess extraordinary and dangerous powers - the result of unique genetic mutations. Cyclops unleashes bolts of energy from his eyes. Storm can manipulate the weather at will. Rogue absorbs the life force of anyone she touches. But under the tutelage of Professor Xavier (Patrick Stewart), these and other outcasts learn to harness their powers for the good of mankind. Now they must protect those who fear them as the nefarious Magneto (Ian McKellen), who believes humans and mutants can never co-exist, unveils his sinsiter plan for the future! X-Men 2: X-Men United: The evolution continues in this \"exhilarating thrill ride\" (Seattle Post-Intelligencer) that features the extraordinary original X-Men-along with amazing new mutants possessing fantastic powers that have to be seen to be believed. In the wake of a shocking attack on the President, the X-Men face their most dangerous mission ever. They must stand united with their deadliest enemies to combat a menace that threatens every mutant on the planet. But could this new alliance backfire and annihilate the human race? Patrick Stewart, Ian McKellen, Hugh Jackman, Hale Berry, Famke Janssen and Rebecca Romijn-Stamos star in this breathtaking, action-packed spectacle that \"may be the best superhero movie yet made!\" (San Francisco Examiner). X-Men 3: The Last Stand: Experience the awesome power of The X-Men\\'s epic, final battle. Join well-known mutant heroes and villains, and meet a cadre of all-new warriors - including Angel, Beast, Juggernaut and Colossus - in this thrilling, explosive adventure! After a controversial \"cure\" is discovered, mutants can choose to retain their superhuman abilities or give up their unique gifts and become \"normal.\" When peaceful mutant leader Charles Xavier (Patrick Stewart) clashes with his militant counterpart, Magneto (Ian McKellen), the battle lines are drawn for the war to end all wars. Bursting with nonstop action, spectacular special effects and exclusive extras, X-Men 3: The Last Stand is a force of nature that \"will blow you away!\"']\nAverage Rating: 4.7\nProduct Details: {'Genre': 'Action & Adventure', 'Format': 'NTSC, Widescreen', 'Contributor': 'Halle Berry, Patrick Stewart, Bryan Singer, Brett Ratner, Hugh Jackman, Ian McKellen', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '35344854', 'Director': 'Bryan Singer, Brett Ratner', 'Media Format': 'NTSC, Widescreen', 'Run time': '5 hours and 42 minutes', 'Release date': 'April 19, 2016', 'Actors': 'Hugh Jackman, Halle Berry, Patrick Stewart, Ian McKellen', 'Studio': '20th Century Studios', 'Number of discs': '1'}\nReview Text: great\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Shenandoah\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Westerns\n['Doug McClure & Glen Corbett']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 3.9 x 1 inches; 6.4 Ounces', 'Release date': 'April 30, 1996', 'Date First Available': 'December 31, 2006', 'Actors': 'Stewart, Hudson, Clark', 'Studio': 'Universal Studios Home Entertainment'}\nI will be ordering more vhs movies\nFive Stars\nSilverado\nKevin Kline  (Actor),     Scott Glenn  (Actor),     Lawrence Kasdan  (Director)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Director Lawrence Kasdan (The Big Chill) clearly set out to make an old-fashioned Western, but he couldn't help bringing a hip, self-conscious attitude to the proceedings. Silverado thus finds its own funky tone--sometimes rousing, sometimes winking. Four cowpokes converge on a little Western burg called Silverado; they're played by Kevin Kline (a distinctly modern kind of Western hero), Scott Glenn, Danny Glover, and the rowdy young Kevin Costner. Kasdan peppers the somewhat generic action with smart dialogue and a parade of quirky supporting players, including John Cleese as a sheriff who seems to have stepped straight from a Monty Python sketch into an Old West saloon. Bruce Broughton supplies the music, a real throwback to the glory days of thundering Western themes. One thing's for sure: Silverado's a lot more fun than the later Kasdan-Costner Western, Wyatt Earp. --Robert Horton\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Lawrence Kasdan', 'Release date': 'June 1, 1999', 'Date First Available': 'October 25, 2006', 'Actors': 'Kevin Kline, Scott Glenn, Kevin Costner, Danny Glover, Marvin J. McIntyre', 'Studio': 'Sony Pictures'}\nThe movie was great, and I well buy more from them  Richard\nGood co....\nReturn of the Magnificent Seven VHS\nYul Brynner  (Actor),     Robert Fuller  (Actor),     Burt Kennedy  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['OUT OF PRINT, BIG MGM BOOK STYLE BOX ART']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Burt Kennedy', 'Run time': '1 hour and 35 minutes', 'Release date': 'March 20, 1991', 'Date First Available': 'February 9, 2007', 'Actors': 'Yul Brynner, Robert Fuller, Julián Mateos, Warren Oates, Claude Akins', 'Studio': 'Fox Home Entertainme', 'Producers': 'Robert Goodstein, Ted Richmond', 'Writers': 'Larry Cohen'}\nGreat movie\nFive Stars\nDemetrius and The Gladiators VHS\nFormat: Videotape\nMovies & TV, Genre for Featured Categories, Drama\n[\"Rome, soon after the death of Christ. The depraved and mad Caligula is on the throne, obsessed with two things: the Robe, the garment that fell from Jesus' shoulders on the cross, and brutal gladiatorial displays. Victor Mature is the devout Christian entrusted with the Robe by Peter (Michael Rennie). But he turns his back on God, enters the arena, and becomes the most famous gladiator in Rome. Sharing the bed of the powerful and diabolical Messalina (Susan Hayward), he may even betray the Robe - and any hope he has for redemption!\"]\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'April 25, 2002', 'Actors': 'Mature, Hayward, Rennie', 'Studio': '20th Century Fox'}\nI love\nFive Stars\nDracula: Dead & Loving It\nLeslie Nielsen  (Actor),     Mel Brooks  (Actor, Director, Producer, Writer)    Rated:    PG-13    Format: VHS Tape\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n{'Is Discontinued By Manufacturer': 'No', 'Language': 'English, German', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Director': 'Mel Brooks', 'Run time': '1 hour and 28 minutes', 'Release date': 'February 4, 1997', 'Date First Available': 'October 25, 2006', 'Actors': 'Leslie Nielsen, Mel Brooks, Peter MacNicol, Steven Weber, Amy Yasbeck', 'Studio': 'Sony Pictures', 'Producers': 'Leah Zappy, Mel Brooks, Peter Schindler', 'Writers': 'Bram Stoker, Mel Brooks, Rudy De Luca, Steve Haberman'}\ngood movie\nFive Stars\nDracula [VHS]\nRated:    NR    Format: VHS Tape\nMovies & TV, Cult Movies, Horror\n['Product description', \"In 1999, Universal commissioned Philip Glass to compose a new score for Tod Browning's landmark horror classic Dracula, a common enough practice for silent films but unheard of for sound pictures. In some respects, Dracula lends itself to th\", 'Amazon.com', 'When Universal Pictures picked up the movie rights to a Broadway adaptation of', 'Dracula', \", they felt secure in handing the property over to the sinister team of actor Lon Chaney and director Tod Browning. But Chaney died of cancer, and Universal hired the Hungarian who had scored a success in the stage play: Béla Lugosi. The resulting film launched both Lugosi's baroque career and the horror-movie cycle of the 1930s. It gets off to an atmospheric start, as we meet Count Dracula in his shadowy castle in Transylvania, superbly captured by the great cinematographer Karl Freund. Eventually Dracula and his blood-sucking devotee (Dwight Frye, in one of the cinema's truly mad performances) meet their match in a vampire-hunter called Van Helsing (Edward Van Sloan). If the later sections of the film are undeniably stage bound and a tad creaky, Dracula nevertheless casts a spell, thanks to Lugosi's creepily lugubrious manner and the eerie silences of Browning's directing style. (After a mood-enhancing snippet of\", 'Swan Lake', 'under the opening titles, there is no music in the film.)', 'Frankenstein', ', which was released a few months later, confirmed the horror craze, and Universal has been making money (and countless spin-off projects) from its twin titans of terror ever since. Certainly the role left a lasting impression on the increasingly addled and drug-addicted Lugosi, who was never quite able to distance himself from the part that made him a star. He was buried, at his request, in his black vampire cape.', '--Robert Horton']\n{'Format': 'Black & White, NTSC', 'Contributor': 'Manners, Lugosi, Chandler', 'Language': 'English, Hungarian', 'Runtime': '1 hour and 15 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Run time': '1 hour and 15 minutes', 'Release date': 'August 22, 1991', 'Date First Available': 'December 7, 2006', 'Actors': 'Lugosi, Chandler, Manners', 'Studio': 'Universal Studios Home Entertainment'}\ngood movie\nFive Stars\nDarkman II: The Return of Durant\nLarry Drake  (Actor),     Arnold Vosloo  (Actor),     Bradford May  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction\n['Product Description', \"The crime-fighting master of disguises returns in this action-packed sequel to the hit motion picture. Hard Target's Arnold Vosloo stars as Darkman, and Larry Drake reprises his role as the sadistic villain Robert G. Durant. Co-starring Kim Delaney (NYPD Blue), Darkman II: The Return of Durant is filled with nonstop action, suspense and special effects which leave you on the edge of your seat from start to finish.\", 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', 'Sam Raimi created', 'Darkman', 'with a potential franchise in mind, and his original movie had enough flair to suggest a sequel was warranted. Unfortunately (or perhaps wisely--for Raimi), he handed over the straight-to-video sequel duties to rookie director Bradford May, and nobody bothered to come up with much of a screenplay. As a result,', 'Darkman\\xa0II', 'plays like a bad pilot for a proposed', 'Darkman', \"TV series, with Arnold Vosloo (best known as a villain in Jean-Claude Van Damme's\", 'Hard Target', \") doing his best to replace Liam Neeson in the title role. Sporting a dastardly scar and delivering lackluster punch lines as he kills his many enemies, Larry Drake returns from the first film as the villainous Durant, who wreaks havoc in his attempt to finance and manufacture the world's most destructive automatic weapons. As he supports the synthetic skin experiments of a like-minded scientist, the scarred hero known as Darkman thwarts Durant's ruthless plot, but the case proves costly for the intrepid crime reporter (Kim Delaney, pre-\", 'NYPD Blue', \") who allies herself with Darkman's efforts. Basically, this by-the-numbers plot serves as a tissue-thin vehicle for lots of explosions and gratuitous violence, and it's all about as inspired as a bad syndicated action show. Of interest only to those who were dazzled by the original\", 'Darkman', \", and even then it's a disappointment.\", '--Jeff Shannon']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'MHV62020323DVD', 'Director': 'Bradford May', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Run time': '1 hour and 32 minutes', 'Release date': 'June 1, 2010', 'Actors': \"Larry Drake, Arnold Vosloo, Kim Delaney, Renee O'Connor, Lawrence Dane\", 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'David Roessell, Sam Raimi, Robert Tapert', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Steven McKay', 'Number of discs': '1'}\ngood movies\nFive Stars\nPurgatory VHS\nSam Shepard  (Actor),     Eric Roberts  (Actor),     Uli Edel  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Westerns\n['A lost band of outlaws wanders into a peaceful little town. At first, they mistake the quiet inhabitants of Refuge for easy marks. Then they recognize Doc Holliday, Billy The Kid and Wild Bill Hickok and realize this town is really purgatory, the deciding ground between heaven and hell. Which makes them...dead.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Uli Edel', 'Run time': '1 hour and 34 minutes', 'Release date': 'March 28, 2000', 'Date First Available': 'September 29, 2006', 'Actors': 'Sam Shepard, Eric Roberts, Randy Quaid, Peter Stormare, Brad Rowe', 'Studio': 'Turner Home Ent', 'Producers': 'Daniel Schneider, David A. Rosemont, Gordon T. Dawson, Walton Dornisch', 'Writers': 'Gordon T. Dawson'}\ngood movie\nFive Stars\nDarkman [DVD]\nLiam Neeson  (Actor),     Frances McDormand  (Actor),     Sam Raimi  (Director, Writer)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction, Sci-Fi Action\n['Product Description', 'Dr. Peyton Westlake (Liam Neeson) is on the verge of realizing a major breakthrough in synthetic skin when a gang, led by the sadistic Robert G. Durant (Larry Drake), obliterates his laboratory. Burned beyond recognition and altered by an experimental medical procedure, Westlake attempts to rebuild his laboratory and reestablish ties with his former girlfriend Julie (Frances McDormand). But his most challenging task lies within himself. Torn between his desire to create a new life with Julie and his quest for revenge, the man known as Darkman begins to assume alternate identities in this stunning, fast-paced action thriller from director Sam Raimi.', 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', 'When attorney Julie Hastings (Frances McDormand) uncovers corrupt city real estate dealings, evil thugs attack her scientist boyfriend, Peyton Westlake (Liam Neeson). Left for dead after his lab is detonated, he miraculously survives when the ensuing blast hurls him into the nearby harbor. Treated as a John Doe at a city hospital, he is unknowingly submitted to radical therapy which numbs his nerves to feeling--but which heightens his strength and his emotions. Once conscious, Peyton escapes from the hospital and builds a ramshackle lab in an abandoned industrial plant. Horribly burned and scarred by the lab explosion, he uses synthetic skin to impersonate his would-be murderers and seek retribution for their evil deeds. Peyton also tries to reunite with Julie, who believes him to be dead. While the film has an average script, it is overcome by the flashy cinematography of Bill Pope, the bombastic score by Danny Elfman, and the well-choreographed direction of Sam Raimi. The director confidently walks the line between suspense, action, comedy, and romance as he examines a bitter, victimized antihero who risks becoming as monstrous on the inside as he appears on the outside.', '--Bryan Reesman']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 2.61 Ounces', 'Item model number': 'MHV61020179DVD', 'Director': 'Sam Raimi', 'Media Format': 'Multiple Formats, AC-3, Anamorphic, Closed-captioned, Color, Dolby, NTSC, Subtitled, Widescreen', 'Run time': '1 hour and 36 minutes', 'Release date': 'November 2, 2010', 'Actors': 'Liam Neeson, Frances McDormand, Larry Drake, Colin Friels, Nelson Mashita', 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'Robert Tapert', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Chuck Pfarrer, Sam Raimi, Ivan Raimi, Daniel Goldin, Joshua Goldin', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngood movie\nFive Stars\nCISCO KID DOUBLE FEATURE Vol 1: South Of Rio Grande & The Girl From San Lorenzo\nVarious  (Actor)    Rated:    Unrated    Format: DVD\nMovies & TV, Genre for Featured Categories, Horror\n[\"Of all the heroes of the Old West, few are as well loved or as easily recognized as the Cisco Kid, based on O'Henry's famous character. Together with his bumbling, but lovable amigo, Pancho, Cisco has entertained millions of children and adults for many years. This rough-in-tumble double-feature stars Duncan Renaldo as our dashing hero with Martin Garralaga and Leo Carrillo taking turns playing the ever-befuddled Pancho. In SOUTH OF THE RIO GRANDE (1945), the daring duo go to the aid of a rancher friend and his neighbors, whose ranches are being terrorized by a ruthless dictator and a gang of horse thieves. In the second part of our double-bill, THE GIRL FROM SAN LORENZO (1950), Cisco and Pancho must track down a criminal gang which has been robbing stagecoaches - disguised as Cisco and Pancho!\"]\n{'Genre': 'Westerns', 'Format': 'Multiple Formats, Black & White, NTSC', 'Contributor': 'Various', 'Language': 'English', 'Runtime': '2 hours', 'Aspect Ratio': '1.33:1', 'MPAA rating': 'Unrated (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 2.72 Ounces', 'Item model number': '2234394', 'Media Format': 'Multiple Formats, Black & White, NTSC', 'Run time': '2 hours', 'Release date': 'June 25, 2002', 'Actors': 'Various', 'Studio': 'VCI Entertainment', 'Country of Origin': 'USA', 'Number of discs': '1'}\ngreat\nFive Stars\nWar, 10-Movie Collection: The Eagle and The Hawk / The Last Outpost / Bengal Brigad / Jet Pilot / Ulzana's Raid / To Hell and Back / In Enemy Country / Raid on Rommel / Battle Hymn / Wake Island(Packaging may vary)\nBurt Lancaster  (Actor),     Alan Hale Jr.  (Actor)    Rated:    NR    Format: DVD\nMovies & TV, Boxed Sets, Action & Adventure\n[\"The Eagle and the Hawk: This powerful anti-war drama starsCary GrantandFredric Marchas rival pilots with opposing codes of honor during World War I. The Last Outpost: Blending action-adventure with romantic melodrama, this rousing saga follows a British prisoner (Cary Grant) who is rescued from a firing squad by his cellmate (Claude Rains). Wake Island: Based on a true story, this hard-hitting film follows a handful of U.S. Marines holding out against an overwhelming Japanese air, land and sea assault. Bengal Brigade: Set during British India in 1857, Captain Claybourne (Rock Hudson) is faced with restoring his reputation after being harshly disciplined for disobeying orders. To Hell and Back: Audie Murphy, the most decorated American soldier of WWII, plays himself in this gripping, action-packed battle saga featuring amazingly realistic war footage. Battle Hymn: Based on actual events during the Korean War, a remorseful bomber pilot (Rock Hudson) must come to terms with his past after an unthinkable accident. Jet Pilot: Heroic Air Force Colonel Jim Shannon (John Wayne) takes to the skies to save a beautiful Russian lady pilot (Janet Leigh) accused of being a spy. In Enemy Country: Wartime secret agents are on a mission to destroy a deadly new type of torpedo, hidden in a Nazi stronghold in France. Raid on Rommel: A British intelligence officer (Richard Burton) leads a daring attack on the German shore defenses at Tobruk during World War II. Ulzana's Raid: A scout (Burt Lancaster) is assigned to aid the cavalry in tracking down Ulzana and his band of renegade Indians in this fact-based story.\", ']]>']\n{'Genre': 'Drama, Romance, Suspense', 'Format': 'Multiple Formats, Box set, Color, NTSC, Black & White, Widescreen', 'Contributor': 'John Wayne, Audie Murphy, Arlene Dahl, Arnold Moss, Alan Hale Jr., Cary Grant, Anna Kashfi, Burt Lancaster, Janet Leigh, VariousJohn Wayne, Audie Murphy, Arlene Dahl, Arnold Moss, Alan Hale Jr., Cary Grant, Anna Kashfi, Burt Lancaster, Janet Leigh, Various  See more', 'Initial release date': '2013-06-04', 'Language': 'English (Dolby Digital 2.0)', 'Aspect Ratio': '2.35:1, 1.33:1, 1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 3.99 Ounces', 'Audio Description': 'English', 'Media Format': 'Multiple Formats, Box set, Color, NTSC, Black & White, Widescreen', 'Run time': '15 hours and 49 minutes', 'Release date': 'June 4, 2013', 'Actors': 'Burt Lancaster, Alan Hale Jr., Cary Grant, John Wayne, Anna Kashfi', 'Subtitles': 'German', 'Studio': 'Studio Distribution Services', 'Country of Origin': 'USA', 'Number of discs': '3'}\ngreat\nFive Stars\nX-Men Trilogy Pack Icon\nHugh Jackman  (Actor),     Halle Berry  (Actor),     Bryan Singer  (Director),     Brett Ratner  (Director)    &                   1                  more   Rated:    NR    Format: DVD\nMovies & TV, Sci-Fi Series & Sequels, X-Men\n['Triple DVD + Digital HD. X-Men 2: X-Men United: Born into a world filled with prejudice are children who possess extraordinary and dangerous powers - the result of unique genetic mutations. Cyclops unleashes bolts of energy from his eyes. Storm can manipulate the weather at will. Rogue absorbs the life force of anyone she touches. But under the tutelage of Professor Xavier (Patrick Stewart), these and other outcasts learn to harness their powers for the good of mankind. Now they must protect those who fear them as the nefarious Magneto (Ian McKellen), who believes humans and mutants can never co-exist, unveils his sinsiter plan for the future! X-Men 2: X-Men United: The evolution continues in this \"exhilarating thrill ride\" (Seattle Post-Intelligencer) that features the extraordinary original X-Men-along with amazing new mutants possessing fantastic powers that have to be seen to be believed. In the wake of a shocking attack on the President, the X-Men face their most dangerous mission ever. They must stand united with their deadliest enemies to combat a menace that threatens every mutant on the planet. But could this new alliance backfire and annihilate the human race? Patrick Stewart, Ian McKellen, Hugh Jackman, Hale Berry, Famke Janssen and Rebecca Romijn-Stamos star in this breathtaking, action-packed spectacle that \"may be the best superhero movie yet made!\" (San Francisco Examiner). X-Men 3: The Last Stand: Experience the awesome power of The X-Men\\'s epic, final battle. Join well-known mutant heroes and villains, and meet a cadre of all-new warriors - including Angel, Beast, Juggernaut and Colossus - in this thrilling, explosive adventure! After a controversial \"cure\" is discovered, mutants can choose to retain their superhuman abilities or give up their unique gifts and become \"normal.\" When peaceful mutant leader Charles Xavier (Patrick Stewart) clashes with his militant counterpart, Magneto (Ian McKellen), the battle lines are drawn for the war to end all wars. Bursting with nonstop action, spectacular special effects and exclusive extras, X-Men 3: The Last Stand is a force of nature that \"will blow you away!\"']\n{'Genre': 'Action & Adventure', 'Format': 'NTSC, Widescreen', 'Contributor': 'Halle Berry, Patrick Stewart, Bryan Singer, Brett Ratner, Hugh Jackman, Ian McKellen', 'Language': 'English', 'Number Of Discs': '1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'NR (Not Rated)', 'Product Dimensions': '0.7 x 7.5 x 5.4 inches; 0.01 Ounces', 'Item model number': '35344854', 'Director': 'Bryan Singer, Brett Ratner', 'Media Format': 'NTSC, Widescreen', 'Run time': '5 hours and 42 minutes', 'Release date': 'April 19, 2016', 'Actors': 'Hugh Jackman, Halle Berry, Patrick Stewart, Ian McKellen', 'Studio': '20th Century Studios', 'Number of discs': '1'}\ngreat\nFive Stars",
  "profile": "**User Profile Summary:**\n\n- **Preferred Format:** The user continues to prioritize VHS tapes while actively expanding their DVD collection, recently acquiring a notable action-centric boxed set on DVD.\n- **Genre Affinity:** Western films remain a staple in their viewing interests, alongside a burgeoning appreciation for horror and science fiction. The user exhibits a widening taste that includes cult classics, action narratives, and historical dramas, reflecting a diverse cinematic palate.\n- **Rating Behavior:** They consistently award top ratings (5.0) to films, emphasizing their preference for engaging storytelling and character depth, particularly in works featuring acclaimed actors.\n- **Review Engagement:** The user actively participates in the film community, contributing succinct and high-quality reviews that highlight narrative depth, character development, and filmmaking craft, showcasing a deep passion for quality cinema.\n- **Future Intentions:** The user aims to continue building both their VHS and DVD collections, particularly seeking films with compelling stories and performances from notable actors and esteemed directors, while maintaining a strong focus on storytelling quality, especially in action and science fiction genres.\n\nOverall, the user remains devoted to Western and action films while enhancing their cinematic exploration—prioritizing excellent storytelling and character-driven narratives across a broader array of genres.",
  "metrics": {
    "rouge1_f": 0.05811001410437235,
    "rouge2_f": 0.003951453570420547,
    "rougeL_f": 0.034414668547249644,
    "meteor": 0.01815317761141675,
    "bleu1": 1.0251124942950495e-08,
    "bleu2": 2.8218273865928994e-09,
    "bleu3": 9.190383652380842e-10,
    "bleu4": 2.952379333235607e-10,
    "bertscore_precision": 0.34560996294021606,
    "bertscore_recall": 0.49887505173683167,
    "bertscore_f1": 0.40833452343940735
  }
}