{
  "interaction_number": 8,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Purgatory VHS\nReview Date: 2018/03/03\nStore: Sam Shepard  (Actor),     Eric Roberts  (Actor),     Uli Edel  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nCategories: Movies & TV, Genre for Featured Categories, Westerns\nProduct Description: ['A lost band of outlaws wanders into a peaceful little town. At first, they mistake the quiet inhabitants of Refuge for easy marks. Then they recognize Doc Holliday, Billy The Kid and Wild Bill Hickok and realize this town is really purgatory, the deciding ground between heaven and hell. Which makes them...dead.']\nAverage Rating: 4.7\nProduct Details: {'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Uli Edel', 'Run time': '1 hour and 34 minutes', 'Release date': 'March 28, 2000', 'Date First Available': 'September 29, 2006', 'Actors': 'Sam Shepard, Eric Roberts, Randy Quaid, Peter Stormare, Brad Rowe', 'Studio': 'Turner Home Ent', 'Producers': 'Daniel Schneider, David A. Rosemont, Gordon T. Dawson, Walton Dornisch', 'Writers': 'Gordon T. Dawson'}\nReview Text: good movie\nReview Title: Five Stars\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "Shenandoah\nRated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Westerns\n['Doug McClure & Glen Corbett']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.4 x 3.9 x 1 inches; 6.4 Ounces', 'Release date': 'April 30, 1996', 'Date First Available': 'December 31, 2006', 'Actors': 'Stewart, Hudson, Clark', 'Studio': 'Universal Studios Home Entertainment'}\nI will be ordering more vhs movies\nFive Stars\nSilverado\nKevin Kline  (Actor),     Scott Glenn  (Actor),     Lawrence Kasdan  (Director)    &                   0                  more   Rated:    PG-13    Format: VHS Tape\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n[\"Director Lawrence Kasdan (The Big Chill) clearly set out to make an old-fashioned Western, but he couldn't help bringing a hip, self-conscious attitude to the proceedings. Silverado thus finds its own funky tone--sometimes rousing, sometimes winking. Four cowpokes converge on a little Western burg called Silverado; they're played by Kevin Kline (a distinctly modern kind of Western hero), Scott Glenn, Danny Glover, and the rowdy young Kevin Costner. Kasdan peppers the somewhat generic action with smart dialogue and a parade of quirky supporting players, including John Cleese as a sheriff who seems to have stepped straight from a Monty Python sketch into an Old West saloon. Bruce Broughton supplies the music, a real throwback to the glory days of thundering Western themes. One thing's for sure: Silverado's a lot more fun than the later Kasdan-Costner Western, Wyatt Earp. --Robert Horton\"]\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Lawrence Kasdan', 'Release date': 'June 1, 1999', 'Date First Available': 'October 25, 2006', 'Actors': 'Kevin Kline, Scott Glenn, Kevin Costner, Danny Glover, Marvin J. McIntyre', 'Studio': 'Sony Pictures'}\nThe movie was great, and I well buy more from them  Richard\nGood co....\nReturn of the Magnificent Seven VHS\nYul Brynner  (Actor),     Robert Fuller  (Actor),     Burt Kennedy  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Action & Adventure\n['OUT OF PRINT, BIG MGM BOOK STYLE BOX ART']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Burt Kennedy', 'Run time': '1 hour and 35 minutes', 'Release date': 'March 20, 1991', 'Date First Available': 'February 9, 2007', 'Actors': 'Yul Brynner, Robert Fuller, Julián Mateos, Warren Oates, Claude Akins', 'Studio': 'Fox Home Entertainme', 'Producers': 'Robert Goodstein, Ted Richmond', 'Writers': 'Larry Cohen'}\nGreat movie\nFive Stars\nDemetrius and The Gladiators VHS\nFormat: Videotape\nMovies & TV, Genre for Featured Categories, Drama\n[\"Rome, soon after the death of Christ. The depraved and mad Caligula is on the throne, obsessed with two things: the Robe, the garment that fell from Jesus' shoulders on the cross, and brutal gladiatorial displays. Victor Mature is the devout Christian entrusted with the Robe by Peter (Michael Rennie). But he turns his back on God, enters the arena, and becomes the most famous gladiator in Rome. Sharing the bed of the powerful and diabolical Messalina (Susan Hayward), he may even betray the Robe - and any hope he has for redemption!\"]\n{'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Media Format': 'Color, NTSC', 'Release date': 'April 25, 2002', 'Actors': 'Mature, Hayward, Rennie', 'Studio': '20th Century Fox'}\nI love\nFive Stars\nDracula: Dead & Loving It\nLeslie Nielsen  (Actor),     Mel Brooks  (Actor, Director, Producer, Writer)    Rated:    PG-13    Format: VHS Tape\nMovies & TV, Studio Specials, Sony Pictures Home Entertainment, All Sony Pictures Titles\n{'Is Discontinued By Manufacturer': 'No', 'Language': 'English, German', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.08 Ounces', 'Director': 'Mel Brooks', 'Run time': '1 hour and 28 minutes', 'Release date': 'February 4, 1997', 'Date First Available': 'October 25, 2006', 'Actors': 'Leslie Nielsen, Mel Brooks, Peter MacNicol, Steven Weber, Amy Yasbeck', 'Studio': 'Sony Pictures', 'Producers': 'Leah Zappy, Mel Brooks, Peter Schindler', 'Writers': 'Bram Stoker, Mel Brooks, Rudy De Luca, Steve Haberman'}\ngood movie\nFive Stars\nDracula [VHS]\nRated:    NR    Format: VHS Tape\nMovies & TV, Cult Movies, Horror\n['Product description', \"In 1999, Universal commissioned Philip Glass to compose a new score for Tod Browning's landmark horror classic Dracula, a common enough practice for silent films but unheard of for sound pictures. In some respects, Dracula lends itself to th\", 'Amazon.com', 'When Universal Pictures picked up the movie rights to a Broadway adaptation of', 'Dracula', \", they felt secure in handing the property over to the sinister team of actor Lon Chaney and director Tod Browning. But Chaney died of cancer, and Universal hired the Hungarian who had scored a success in the stage play: Béla Lugosi. The resulting film launched both Lugosi's baroque career and the horror-movie cycle of the 1930s. It gets off to an atmospheric start, as we meet Count Dracula in his shadowy castle in Transylvania, superbly captured by the great cinematographer Karl Freund. Eventually Dracula and his blood-sucking devotee (Dwight Frye, in one of the cinema's truly mad performances) meet their match in a vampire-hunter called Van Helsing (Edward Van Sloan). If the later sections of the film are undeniably stage bound and a tad creaky, Dracula nevertheless casts a spell, thanks to Lugosi's creepily lugubrious manner and the eerie silences of Browning's directing style. (After a mood-enhancing snippet of\", 'Swan Lake', 'under the opening titles, there is no music in the film.)', 'Frankenstein', ', which was released a few months later, confirmed the horror craze, and Universal has been making money (and countless spin-off projects) from its twin titans of terror ever since. Certainly the role left a lasting impression on the increasingly addled and drug-addicted Lugosi, who was never quite able to distance himself from the part that made him a star. He was buried, at his request, in his black vampire cape.', '--Robert Horton']\n{'Format': 'Black & White, NTSC', 'Contributor': 'Manners, Lugosi, Chandler', 'Language': 'English, Hungarian', 'Runtime': '1 hour and 15 minutes', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Run time': '1 hour and 15 minutes', 'Release date': 'August 22, 1991', 'Date First Available': 'December 7, 2006', 'Actors': 'Lugosi, Chandler, Manners', 'Studio': 'Universal Studios Home Entertainment'}\ngood movie\nFive Stars\nDarkman II: The Return of Durant\nLarry Drake  (Actor),     Arnold Vosloo  (Actor),     Bradford May  (Director)    &                   0                  more   Rated:    R    Format: DVD\nMovies & TV, Science Fiction & Fantasy, Science Fiction\n['Product Description', \"The crime-fighting master of disguises returns in this action-packed sequel to the hit motion picture. Hard Target's Arnold Vosloo stars as Darkman, and Larry Drake reprises his role as the sadistic villain Robert G. Durant. Co-starring Kim Delaney (NYPD Blue), Darkman II: The Return of Durant is filled with nonstop action, suspense and special effects which leave you on the edge of your seat from start to finish.\", 'Bonus Content:', 'Production Notes', 'Production Notes', 'Cast and Filmmakers', 'Cast and Filmmakers', 'Theatrical Trailer', 'Theatrical Trailer', ']]>', 'Amazon.com', 'Sam Raimi created', 'Darkman', 'with a potential franchise in mind, and his original movie had enough flair to suggest a sequel was warranted. Unfortunately (or perhaps wisely--for Raimi), he handed over the straight-to-video sequel duties to rookie director Bradford May, and nobody bothered to come up with much of a screenplay. As a result,', 'Darkman\\xa0II', 'plays like a bad pilot for a proposed', 'Darkman', \"TV series, with Arnold Vosloo (best known as a villain in Jean-Claude Van Damme's\", 'Hard Target', \") doing his best to replace Liam Neeson in the title role. Sporting a dastardly scar and delivering lackluster punch lines as he kills his many enemies, Larry Drake returns from the first film as the villainous Durant, who wreaks havoc in his attempt to finance and manufacture the world's most destructive automatic weapons. As he supports the synthetic skin experiments of a like-minded scientist, the scarred hero known as Darkman thwarts Durant's ruthless plot, but the case proves costly for the intrepid crime reporter (Kim Delaney, pre-\", 'NYPD Blue', \") who allies herself with Darkman's efforts. Basically, this by-the-numbers plot serves as a tissue-thin vehicle for lots of explosions and gratuitous violence, and it's all about as inspired as a bad syndicated action show. Of interest only to those who were dazzled by the original\", 'Darkman', \", and even then it's a disappointment.\", '--Jeff Shannon']\n{'Aspect Ratio': '1.85:1', 'Is Discontinued By Manufacturer': 'No', 'MPAA rating': 'R (Restricted)', 'Product Dimensions': '7.5 x 5.38 x 0.6 inches; 4 Ounces', 'Item model number': 'MHV62020323DVD', 'Director': 'Bradford May', 'Media Format': 'Multiple Formats, AC-3, Color, Dolby, Closed-captioned, NTSC, Subtitled, Widescreen, Letterboxed', 'Run time': '1 hour and 32 minutes', 'Release date': 'June 1, 2010', 'Actors': \"Larry Drake, Arnold Vosloo, Kim Delaney, Renee O'Connor, Lawrence Dane\", 'Dubbed': 'French', 'Subtitles': 'English, Spanish', 'Producers': 'David Roessell, Sam Raimi, Robert Tapert', 'Language': 'English (Dolby Digital 2.0 Surround), French (Dolby Digital 2.0 Surround), Spanish (Dolby Digital 2.0 Surround), Unqualified (DTS ES 6.1)', 'Studio': 'Universal Pictures Home Entertainment', 'Writers': 'Steven McKay', 'Number of discs': '1'}\ngood movies\nFive Stars\nPurgatory VHS\nSam Shepard  (Actor),     Eric Roberts  (Actor),     Uli Edel  (Director)    &                   0                  more   Rated:    Unrated    Format: VHS Tape\nMovies & TV, Genre for Featured Categories, Westerns\n['A lost band of outlaws wanders into a peaceful little town. At first, they mistake the quiet inhabitants of Refuge for easy marks. Then they recognize Doc Holliday, Billy The Kid and Wild Bill Hickok and realize this town is really purgatory, the deciding ground between heaven and hell. Which makes them...dead.']\n{'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '7.32 x 4.19 x 1.12 inches; 6.13 Ounces', 'Director': 'Uli Edel', 'Run time': '1 hour and 34 minutes', 'Release date': 'March 28, 2000', 'Date First Available': 'September 29, 2006', 'Actors': 'Sam Shepard, Eric Roberts, Randy Quaid, Peter Stormare, Brad Rowe', 'Studio': 'Turner Home Ent', 'Producers': 'Daniel Schneider, David A. Rosemont, Gordon T. Dawson, Walton Dornisch', 'Writers': 'Gordon T. Dawson'}\ngood movie\nFive Stars",
  "profile": "**Updated User Profile Summary:**\n\n- **Preferred Format:** VHS tapes remain the primary choice, with occasional interest in DVDs.\n- **Genre Affinity:** The user continues to show a strong preference for Western films, complemented by a growing appreciation for horror and science fiction. Their recent exploration of cult classics and action narratives indicates an expanding interest in diverse cinematic styles, including historical dramas and comedies that weave in humor.\n- **Rating Behavior:** The user consistently rates films highly, often awarding maximum ratings (5.0). Their latest interaction reinforces their discerning taste, focusing on quality storytelling and impactful characters.\n- **Review Engagement:** Actively provides concise reviews that prioritize narrative depth and character development, contributing meaningfully to the film community.\n- **Future Intentions:** Aims to keep acquiring VHS movies while being receptive to innovative DVD titles. The user is keen on discovering compelling stories featuring well-known actors and esteemed directors, maintaining a strong emphasis on high-quality storytelling.\n\nOverall, the user's dedication to Western and action films is evident, while their increasing interest in horror and science fiction highlights a broader exploration of diverse cinematic experiences. The recent purchase underscores their commitment to exceptional narratives within their preferred genres.",
  "metrics": {
    "rouge1_f": 0.09299839657936933,
    "rouge2_f": 0.007490636704119851,
    "rougeL_f": 0.052378407268840195,
    "meteor": 0.029726717992419546,
    "bleu1": 6.771769176069615e-05,
    "bleu2": 2.1339646268276755e-05,
    "bleu3": 3.2448415091811227e-06,
    "bleu4": 1.2666088366456415e-06,
    "bertscore_precision": 0.3415309190750122,
    "bertscore_recall": 0.47288304567337036,
    "bertscore_f1": 0.3966144621372223
  }
}