{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Water Wave Human Hair Bundles With Closure 12 14 16+10 Brazilian Virgin Wet and Wavy Human Hair 3 Bundles With Free Part Lace Closure Natural Black 70g/bundle(12/14/16+10)\nReview Date: 2020/12/10\nStore: Jiumido\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Jiumido', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Package Dimensions': '10.08 x 6.14 x 2.17 inches; 14.96 Ounces'}\nReview Text: Nice until you actually wash and put it in your hair. It sheds too much and has no weight to it in other words it thins out so much you can barely see the ends it doesn't look right. Other wet n wavy hair has a nice bounce and doesn't shed or become frizzy once washed.\nReview Title: Good for short term use only\nRating: 2.0\n--------------------------------------------------",
  "reference_summary": "18 inch Dark Brown Tape in Human Hair Extensions 20pcs/30g Long Straight Skin Weft Invisible Double Sided Tape +10pcs Replacement Tapes(18\", 2)\nBenehair\n{'Brand': 'Benehair', 'Material': 'Human Hair', 'Hair Type': 'Straight', 'Installation Type': 'tape', 'Package Dimensions': '13.78 x 7.8 x 0.75 inches; 2.96 Ounces', 'UPC': '758277455930'}\nThin but the tape quality is good\nLittle longer weft then normal\nCurly Tape in Hair Extensions Human Hair Brown Tape in Human Hair 18 Inch 50g 20pcs #4 Dark Brown Invisible Thick Tape in Hair Extensions Wave Hair\nHetto\n{'Brand': 'Hetto', 'Color': 'Brown', 'Material': 'Human Hair', 'Extension Length': '18 Inches', 'Hair Type': 'Wavy, Curly', 'Product Dimensions': '18 x 1 x 1 inches; 1.76 Ounces', 'Item model number': 'HA-LowSale-NW-Tape-#4-18-50g'}\nVery nice tape is durable.\nGood quality\nTape in Human Hair Extensions Wavy Black Tape in Hair Extensions 16 Inch Tape in Natural Wave Hair Extensions 20pcs/pack #1B Off Black Tape on Human Hair 50g\nUgeat\n{'Brand': 'Ugeat', 'Material': 'Human Hair', 'Extension Length': '16 Inches', 'Hair Type': 'Wavy', 'Installation Type': 'tape', 'Product Dimensions': '16 x 1 x 1 inches; 4.8 Ounces'}\nWaste of money. Doesn't stick enough to even stay in a full day. Its embarrassing to go to work and have them falling out.\nWill try another brand\nDFX Hair 100g body wave human hair bundles 9A Brazilian Virgin Hair Wavy Extensions True to Length (8 10 12 14, 4 bundles)\nDFX Hair\n{'Brand': 'DFX Hair', 'Material': 'Human', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Sew-In', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '6.9 x 3 x 2.6 inches; 15.2 Ounces'}\nThin thin bad. Stringy doesn't blend with natural hair sheds.\nNot worth the price\nAilisi Brazilian Virgin Kinky Curly Hair 3 Bundles With Closure 8A Unprocessed Brazilian Curly Human Hair Weave With Free Part Lace Closure (14\" 16\" 18\"+12\" Free Part)\nCBROSEY\n{'Brand': 'CBROSEY', 'Color': 'black', 'Material': 'Human Hair', 'Hair Type': 'Curly, Kinky', 'Installation Type': 'Weave', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '9.2 x 5.2 x 2.9 inches; 15.2 Ounces'}\nDry brittle unbrushable once you brush it doesn't curl anymore it's just puffy and not what I expected.\nTerrible sheds bad\nWater Wave Human Hair Bundles With Closure 12 14 16+10 Brazilian Virgin Wet and Wavy Human Hair 3 Bundles With Free Part Lace Closure Natural Black 70g/bundle(12/14/16+10)\nJiumido\n{'Brand': 'Jiumido', 'Material': 'Human Hair', 'Hair Type': 'Wavy', 'Material Feature': 'Natural', 'Installation Type': 'Weave', 'Package Dimensions': '10.08 x 6.14 x 2.17 inches; 14.96 Ounces'}\nNice until you actually wash and put it in your hair. It sheds too much and has no weight to it in other words it thins out so much you can barely see the ends it doesn't look right. Other wet n wavy hair has a nice bounce and doesn't shed or become frizzy once washed.\nGood for short term use only",
  "profile": "**User Summary:**\n\n- **Product Type Preference**: The user continues to prefer tape-in hair extensions for temporary installation but remains increasingly frustrated with adhesive performance. Recent experimentation with weave products has led to further dissatisfaction due to quality issues.\n  \n- **Material Preference**: While the user consistently favors human hair for a natural look, their recent experiences with wavy textures have made them more cautious and discerning when it comes to quality.\n  \n- **Quality Focus**: Recent purchases have been disappointing, particularly regarding thickness and adherence. The user's experiences with excessive shedding and poor performance have heightened their need for reliable, high-quality products.\n  \n- **Length Specification**: Although typically favoring longer extensions, the user's openness to shorter lengths is influenced by quality and thickness considerations following negative experiences with thinning hair.\n  \n- **Installation Method**: The user values the simplicity of tape-in extensions but has experienced growing frustration with the effectiveness of adhesives, prompting a reassessment of alternatives.\n  \n- **Dissatisfaction with Thickness**: Concerns about volume persist, especially after encountering products that lack density and shed excessively, diminishing the natural look and blend of their hair.\n\nOverall, the user is focused on finding premium-quality extensions that deliver both volume and durability, actively exploring options that meet their standards in light of their recent unsatisfactory experiences.",
  "metrics": {
    "rouge1_f": 0.19635343618513323,
    "rouge2_f": 0.014064697609001408,
    "rougeL_f": 0.08976157082748948,
    "meteor": 0.07503949447077408,
    "bleu1": 0.05610759097402792,
    "bleu2": 0.009501926994796416,
    "bleu3": 0.001939172895155238,
    "bleu4": 0.000876867854927676,
    "bertscore_precision": 0.3469998240470886,
    "bertscore_recall": 0.39182543754577637,
    "bertscore_f1": 0.36805278062820435
  }
}