{
  "interaction_number": 4,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Updated Magnetic Eyelashes with Eyeliner,5 Styles Natural & Dramatic Makeup Waterproof Magnetic Lashes with 2 Magnetic Eyeliner-No Glue Needed\nReview Date: 2020/05/29\nStore: Pleell\nAverage Rating: 3.9\nProduct Details: {'Brand': 'Pleell', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '1 Count', 'Package Dimensions': '5.8 x 5.5 x 0.8 inches; 2.4 Ounces', 'UPC': '738631164296'}\nReview Text: This is a great buy.  THESE LASHES ARE DEFINITELY A HIT! The price is excellent because you get two eyeliners and 5 pairs of various QUALITY LASHES! The company also offers just for trying another box for free because you purchase which is a WIN! They are long lasting and the BEST I have ever had and SUPER EASY to apply! I recommend these lashes you will not be disappointed!!<br /><br />Lachesha Hendrix<br />KingdomAppearance Makeup\nReview Title: AMAZING MAGNETIC LASHES!!!!\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 25mm Mink 3D Lashes Long Volume Mink Eyelashes False Strip Eyelashes 3 Pack\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Material': 'Mink Fur', 'Item Dimensions LxWxH': '6.7 x 4.4 x 0.5 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Product Dimensions': '6.7 x 4.4 x 0.5 inches; 0.81 Ounces', 'UPC': '680613003713'}\nTHESE LASHES WERE GREAT! They are amazing and they looked beautiful\nMust buy\nSEATTLE Eyelashes 5 Pairs Pack 3D Fake Eyelashes Mink Fur Hand-Made Dramatic Thick Crisscross Deluxe False Lashes Black Nature Fluffy Long Soft Reusable\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Material': 'Mink Fur', 'Item Dimensions LxWxH': '6.1 x 3.75 x 0.5 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Product Dimensions': '6.1 x 3.75 x 0.5 inches; 0.81 Ounces', 'UPC': '680613003638'}\nRecommend this purchase may have to curl up a little but they are beautiful! I love them! They give me the look I desire! You will not be disappointed!\nMust buy\nFalse Eyelashes 3D Lashes Pack, Fur Long Lashes Reusable Soft Fake Eyelashes 7 Pairs\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Material': 'Fur', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 6.6 x 0.2 inches; 5.61 Ounces', 'UPC': '680613003706'}\nBEaUty Beneath the Enhancement!!! These are amazing! You need to like long lashes and the quality far exceeded my expectations\nMust buy\nUpdated Magnetic Eyelashes with Eyeliner,5 Styles Natural & Dramatic Makeup Waterproof Magnetic Lashes with 2 Magnetic Eyeliner-No Glue Needed\nPleell\n{'Brand': 'Pleell', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '1 Count', 'Package Dimensions': '5.8 x 5.5 x 0.8 inches; 2.4 Ounces', 'UPC': '738631164296'}\nThis is a great buy.  THESE LASHES ARE DEFINITELY A HIT! The price is excellent because you get two eyeliners and 5 pairs of various QUALITY LASHES! The company also offers just for trying another box for free because you purchase which is a WIN! They are long lasting and the BEST I have ever had and SUPER EASY to apply! I recommend these lashes you will not be disappointed!!<br /><br />Lachesha Hendrix<br />KingdomAppearance Makeup\nAMAZING MAGNETIC LASHES!!!!",
  "profile": "**User Profile Summary**\n\n**Preferences:**\n- Beauty and Personal Care: The user maintains a strong interest in cosmetic products, particularly focusing on false eyelashes and eye cosmetics. Their recent purchase highlights an appreciation for versatile options, valuing both natural and dramatic styles.\n- Quality Focus: The user prioritizes high-quality materials, consistently showing a preference for cruelty-free and ethically sourced beauty products, reflecting a commitment to sustainable consumer practices.\n- Aesthetic Appeal: Visually striking products remain a key priority, as indicated by their enthusiasm for products that enhance beauty while being easy to use.\n\n**Behavior Patterns:**\n- Positive Engagement: The user is proactive in leaving enthusiastic reviews, often awarding top ratings and expressing satisfaction with their purchases, as evidenced by their recent 5-star feedback that praised the product's value, durability, and ease of application.\n- Influenced by Experience: Loyalty to brands and products that deliver positive experiences is evident in their willingness to try new offerings from favored companies and to recommend these products to others.\n\n**Trends:**\n- Cruelty-Free Options: The user continues to prioritize ethically sourced products, aligning with sustainable consumer practices.\n- Specific Product Types: There is a sustained interest in false eyelashes, reflecting a desire for variety within this niche and an appreciation for high-quality, visually appealing products.\n\nOverall, the user remains a discerning consumer dedicated to enhancing their beauty routine through ethical and aesthetically pleasing choices.",
  "metrics": {
    "rouge1_f": 0.19732441471571904,
    "rouge2_f": 0.020134228187919462,
    "rougeL_f": 0.0903010033444816,
    "meteor": 0.09346109428550636,
    "bleu1": 0.08272210903768829,
    "bleu2": 0.016252503488868426,
    "bleu3": 0.003484993362675802,
    "bleu4": 0.0016152447261963477,
    "bertscore_precision": 0.3557589650154114,
    "bertscore_recall": 0.3812868595123291,
    "bertscore_f1": 0.36808085441589355
  }
}