{
  "interaction_number": 5,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: JIMIRE 2 Different Styles False Eyelashes 14 Pairs Fluffy Volume False Lashes 3D Faux Mink Strip Eyelashes Pack\nReview Date: 2020/08/08\nStore: JIMIRE\nAverage Rating: 4.3\nProduct Details: {'Brand': 'JIMIRE', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.8 x 5.5 x 0.6 inches; 0.81 Ounces'}\nReview Text: These lashes by Jimire are absolutely beautiful. It is two different types of lashes in the package so you can choose your style for the day or evening look. They apply easily and look natural on the eyes. These lashes are not heavy and you can wear multiple times after each use. I highly recommend any lashes from this brand!!!!! My clients lived their looks and so did I!!\nReview Title: BEAUTIFUL LASHES!!! *MUST BUY!*\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "ALICROWN 25mm Mink 3D Lashes Long Volume Mink Eyelashes False Strip Eyelashes 3 Pack\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Material': 'Mink Fur', 'Item Dimensions LxWxH': '6.7 x 4.4 x 0.5 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Product Dimensions': '6.7 x 4.4 x 0.5 inches; 0.81 Ounces', 'UPC': '680613003713'}\nTHESE LASHES WERE GREAT! They are amazing and they looked beautiful\nMust buy\nSEATTLE Eyelashes 5 Pairs Pack 3D Fake Eyelashes Mink Fur Hand-Made Dramatic Thick Crisscross Deluxe False Lashes Black Nature Fluffy Long Soft Reusable\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Material': 'Mink Fur', 'Item Dimensions LxWxH': '6.1 x 3.75 x 0.5 inches', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Product Dimensions': '6.1 x 3.75 x 0.5 inches; 0.81 Ounces', 'UPC': '680613003638'}\nRecommend this purchase may have to curl up a little but they are beautiful! I love them! They give me the look I desire! You will not be disappointed!\nMust buy\nFalse Eyelashes 3D Lashes Pack, Fur Long Lashes Reusable Soft Fake Eyelashes 7 Pairs\nALICROWN HAIR\n{'Brand': 'ALICROWN HAIR', 'Material': 'Fur', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.6 x 6.6 x 0.2 inches; 5.61 Ounces', 'UPC': '680613003706'}\nBEaUty Beneath the Enhancement!!! These are amazing! You need to like long lashes and the quality far exceeded my expectations\nMust buy\nUpdated Magnetic Eyelashes with Eyeliner,5 Styles Natural & Dramatic Makeup Waterproof Magnetic Lashes with 2 Magnetic Eyeliner-No Glue Needed\nPleell\n{'Brand': 'Pleell', 'Material Feature': 'Natural', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Unit Count': '1 Count', 'Package Dimensions': '5.8 x 5.5 x 0.8 inches; 2.4 Ounces', 'UPC': '738631164296'}\nThis is a great buy.  THESE LASHES ARE DEFINITELY A HIT! The price is excellent because you get two eyeliners and 5 pairs of various QUALITY LASHES! The company also offers just for trying another box for free because you purchase which is a WIN! They are long lasting and the BEST I have ever had and SUPER EASY to apply! I recommend these lashes you will not be disappointed!!<br /><br />Lachesha Hendrix<br />KingdomAppearance Makeup\nAMAZING MAGNETIC LASHES!!!!\nJIMIRE 2 Different Styles False Eyelashes 14 Pairs Fluffy Volume False Lashes 3D Faux Mink Strip Eyelashes Pack\nJIMIRE\n{'Brand': 'JIMIRE', 'Material': 'Faux Mink', 'Material Feature': 'Cruelty Free', 'Item Form': 'Pair', 'Mounting Type': 'Eyelash Glue', 'Package Dimensions': '6.8 x 5.5 x 0.6 inches; 0.81 Ounces'}\nThese lashes by Jimire are absolutely beautiful. It is two different types of lashes in the package so you can choose your style for the day or evening look. They apply easily and look natural on the eyes. These lashes are not heavy and you can wear multiple times after each use. I highly recommend any lashes from this brand!!!!! My clients lived their looks and so did I!!\nBEAUTIFUL LASHES!!! *MUST BUY!*",
  "profile": "**User Profile Summary**\n\n**Preferences:**\n- **Beauty and Personal Care:** The user continues to exhibit a strong passion for cosmetic products, with a particular focus on false eyelashes and eye cosmetics. Their recent purchase demonstrates an appreciation for versatility, allowing them to select styles suitable for different occasions—from natural to dramatic looks.\n- **Quality Focus:** The user remains committed to high-quality materials, emphasizing a preference for cruelty-free and ethically sourced products, showcasing dedication to sustainable consumer practices.\n- **Aesthetic Appeal:** Visually striking and easy-to-use products are a top priority, which is evident in their enthusiastic exploration of false eyelashes that enhance beauty effectively.\n\n**Behavior Patterns:**\n- **Positive Engagement:** The user consistently leaves enthusiastic reviews, often assigning high ratings and commending product quality, durability, and user-friendliness. Their recent feedback reflects a strong sense of satisfaction, particularly regarding the diversity and ease of application of their chosen products.\n- **Influenced by Experience:** Loyalty to brands that provide satisfying experiences is highlighted by their willingness to try new offerings and recommend their favorite products to others, further solidifying their role as an enthusiastic advocate for quality items.\n\n**Trends:**\n- **Cruelty-Free Options:** The user continues to prioritize ethically sourced beauty products, aligned with their commitment to sustainability.\n- **Specific Product Interests:** Sustained interest in diverse, high-quality false eyelashes remains evident, indicating a growing appreciation for different styles within this niche.\n\nOverall, the user is a discerning consumer focused on enhancing their beauty routine through ethical, aesthetically pleasing choices.",
  "metrics": {
    "rouge1_f": 0.203527815468114,
    "rouge2_f": 0.021768707482993196,
    "rougeL_f": 0.08955223880597016,
    "meteor": 0.09101749050435565,
    "bleu1": 0.07896035138464266,
    "bleu2": 0.013001205710996406,
    "bleu3": 0.0026279484104852467,
    "bleu4": 0.001182424069811527,
    "bertscore_precision": 0.3723217844963074,
    "bertscore_recall": 0.3948662281036377,
    "bertscore_f1": 0.3832627534866333
  }
}