{
  "interaction_number": 6,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: Replacement Toothbrush Heads Compatible With Oral B Braun Electric Toothbrush, 4 Count\nReview Date: 2019/06/21\nStore: HDY\nAverage Rating: 4.4\nProduct Details: {'Brand': 'HDY', 'Size': '4 Count (Pack of 1)', 'Age Range (Description)': 'Adult', 'Item Firmness Description': 'Extra Soft', 'Number of Pieces': '4', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.43 x 0.39 x 2.76 inches; 0.81 Ounces', 'UPC': '632088377561', 'Manufacturer': 'HDY'}\nReview Text: I like to change my brush head frequently. This replacement brush is excellent and cleaned my teeth perfectly. My grandfather was a dentist and instilled in me the desire to keep my teeth and gums in good health. These replacement brushes are every bit as effective as the name brand ones.\nReview Title: Equal to name brand replacement brushes\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "MyGift Luxuriously Soft Padded Spa Bath Pillow / Cushion - Hinged Dual Sections, w/ Premium Suction Cups\nYRMJK\n['MyGift Luxuriously Soft Padded Spa Bath Pillow / Cushion - Hinged Dual Sections, w/ Premium Suction Cups']\n{'Brand': 'YRMJK', 'Item Dimensions LxWxH': '14.5 x 2 x 13 inches', 'Item Weight': '0.57 Pounds', 'Product Care Instructions': 'Hand Wash Only', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '14.5 x 2 x 13 inches; 9.12 Ounces', 'UPC': '887702050430', 'Manufacturer': 'HealthMarket'}\nThis bath pillow has made soaking much more pleasant. The suction cups really hold in place and the pillow cradles my head very comfortably. It is easy to keep clean and a perfect addition to my bathing. It was also a very good value price-wise. I am most pleased with this purchase.\nExcellent bath pillow with perfect suction\nNice 'n Easy Permanent Color 9G Light Golden Blonde 1 ea (Pack of 3)\nClairol\n['Product Description', \"The secret to our natural looking color is Clairol's exclusive ColorBlend Technology, which expertly blends 3 complementary tones into every shade. The result? Natural looking color that's perfectly true to you!\", 'From the Manufacturer', 'Get a shade that’s your most true, most you. Thanks to Color Blend Technology,', 'Nice ’n Easy', 'gives you expert highlights and lowlights without the salon. Nice ‘n Easy layers tones and highlights to make over your color. Every shade has our exclusive Color Blend Technology, combining rich tones with contouring highlights in just one step. Expert improvements in all golden shades give you color with high-def dimension and less brassiness. You’ll get dimensional, true-to-you hair color and 100% gray coverage no matter which shade you choose. It’s color that simply comes to life.', 'Expert Highlights & Lowlights in One Simple Step', 'Get color so true, all they see is you. Nice ‘n Easy gives you expert highlights and lowlights without the salon, bringing your look to life. Our expert Color Blend Technology enhances the natural variations in your hair, for a shade that’s true to you.', 'Key Features', 'Permanent liquid hair color with Precision Applicator', 'Permanent liquid hair color with Precision Applicator', 'Lasts up to 8 weeks', 'Lasts up to 8 weeks', '100% gray coverage', '100% gray coverage', 'Includes ColorSeal Conditioning Gloss to help seal in beautiful color and add intense shine', 'Includes ColorSeal Conditioning Gloss to help seal in beautiful color and add intense shine', 'Types of Hair Color', 'Compare Types of Clairol hair color.', 'Brand # of Shades Gray Coverage Color Type Color Lasts Works In Formula', \"Nice 'n Easy Perfect 10\", '24 100% Permanent Crème Color Up to 8 Weeks 10 minutes Micropearls forhigh-gloss color', \"Nice 'n Easy\", '42 100% Permanent Crème Color Up to 8 Weeks 25 minutes Color Blend Technologyfor highlights & lowlights', 'Color Blend Foam', '23 100% Permanent Foam Color Up to 8 Weeks 25 minutes Color Blend Technologyin a drip-free foam', \"Nice 'n Easy Root Touch-Up\", '18', 'formulated to matchany shade', '100% Permanent Crème Color Up to 3 weeks 10 minutes More shade choices,to match any shade,even salon color', '*', 'Natural Instincts', '23 Up to 50% Demi-PermanentCrème Color Up to 28 shampoos 10 minutes Clinically provenhealthier', '**', 'color withno ammonia', 'Natural Instincts Vibrant', '13 100% Permanent Crème Color Up to 8 weeks 10 minutes Anitoxidants helpfight damage', '* Among leading retail permanent shade and pre-formulated salon color** Natural Instincts non-permanent Level 2 vs. leading Triple protection permanent Level 3 color crème: based on amount of surface damage', 'Meet Your Perfect Match', 'Take the guesswork out of gorgeous. Try our quick tool and we’ll give you personalized, expert shade recommendations. Visit Clairol.com/MyShade.', 'Vibrant, Healthy-Looking Color', 'Enjoy stunning, healthy-looking color for up to 8 weeks.', 'view larger']\n{'Color': 'light golden blonde', 'Brand': 'Clairol', 'Item Form': 'Liquid', 'Unit Count': '1 Count', 'Material Feature': 'Natural', 'Package Dimensions': '7.2 x 6.5 x 3.7 inches; 1.85 Pounds', 'Manufacturer': 'HFC Prestige International U.S. LLC'}\nI was looking forward to trying this new Clairol &#34;Sun Kissed&#34; Natural Light Golden Blond haircolor and was hoping for great results. It begain with a very roomy pair of applicator gloves (man-sized) and an easy to pour solution into the applicator bottle containing the developer. I have been coloring my hair for most of my life and I applied the product and left to sit at my computer while the color did its thing. I was pleased that it didn't have a terrible odor and that it didn't drip. Those were two great positives. I did not look in the mirror until I renetered the bathroom and was shocked to see that the stuff on my head had turned a dark reddish shade.  I was hopeful that it would wash off in the shower and that my hair would appear a light golden blond as advertised and it did. While the change from my former product results gave me a surprise, it actually flatters my skin tone and I am glad I gave it a try. Will continue using it because I love the new shade on me. I added it to my Subscribe and Save products.<br /><br />My hair is mow varigated strawberry blond, but my hair was always varigated because some parts are white, some parts are grey, some parts I really can't see (the back of my head);  it is more strawberry blond than golden blond.<br /><br />I suspect that one's results will depend upon your own hair. I actually find the change refreshing.\nNatural Light Golden Blond  Results on My Hair\nLOT OF 4 AVON GLIMMERSTICKS WATERPROOF EYELINER SMOKEY GREY\nAVON\n{'Brand': 'AVON', 'Finish Type': 'Shimmery', 'Special Feature': 'Waterproof', 'Number of Items': '4', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.3 x 2.9 x 0.5 inches; 0.81 Ounces', 'UPC': '888761116754', 'Manufacturer': 'Avon'}\nReally like these eyeliner sticks in hard to find gray color. Easy to apply and long lasting\nGreat value in hard to find gray eyeliner pencils\nYes To Face Wipes for Women and Men, Sensitive Facial Cleansing Wipes for use as a Make Up Remover, Cleaning, Soothing, Cucumbers Aloe Vera (Pack of 2)\nYes To\n[\"Yes To Cucumbers Hypoallergenic Facial Wipes gently remove dirt, sweat and makeup (eye makeup too!) without the need to rinse. Whether you're out and about, going for a run, or having a late night, these wipes make it a snap to refresh on-the-go. Packed with green superfoods these all-natural, biodegradable wipes naturally refresh and rejuvenate all-in-one. Stay gorgeous, and go from zero to clean in seconds! Snap up the lid and snatch out a towelette! Gently glide across your face and neck. Feel refreshed? You should- your skin is clean, revitalized and nourished- in just a snap! These 95% natural, oil-free, non-comedogenic, hypoallergenic wipes are made with compostable, FSC certified fabric. They are petroleum free, SLS free, paraben free, and cruelty-free. Say Yes to Cucumbers Hypoallergenic Facial Wipes! These 2 pack wipes are specifically sold by the manfucaturer. We can&rsquo. INGREDIENTS Water, Glycerin, Cucumis Sativas (Cucumber) Extract, Aloe Barbadensis (Aloe) Extract, Camellia Sinensis (Green Tea) Extract, Sodium Chloride (Sea Salt), Carpylyl/Capryl Glucoside, Guar Hydroxypropyltrimonium Chloride, Polyglyceryl-4 Caprate, Caprylic/Capric Triglyceride, Sodium Benzoate, Potassium Sorbate, Citric Acid, Phenoxyethanol, Fragrance.\"]\n{'Brand': 'Yes To', 'Skin Type': 'Sensitive', 'Material Feature': 'Compostable Warning', 'Unit Count': '60 Count', 'Number of Items': '2', 'Product Dimensions': '4.6 x 3.75 x 5.5 inches; 14.4 Ounces', 'Item model number': '1024734', 'UPC': '815921024734', 'Manufacturer': 'Yes To Inc.', 'Country of Origin': 'USA', 'Domestic Shipping': 'Currently, item can be shipped only within the U.S. and to APO/FPO addresses. For APO/FPO shipments, please check with the manufacturer regarding warranty and support issues.', 'International Shipping': 'This item can be shipped to select countries outside of the U.S.  Learn More'}\nGreat makeup remover cloths for use at home or on the go. Soothing and hypoallergenic. Removes eye makeup easily and leaves skin feeling fresh and clean. Great for travel.\nGreat for removing makeup and for travel or on the go use\nLaClaire Foaming Botanical Facial Cleanser with Enriched Antioxidant Botanicals - Nourishing pH Balanced Face Wash (50 ml/1.65 oz), Made in the USA\nLaClaire\n['A gentle foaming cleanser utilizing natural beneficial antioxidant botanicals to draw out impurities, excess oil and pollutants. Our foaming cleanser removes debris without disrupting skin’s delicate PH balance. Use our cleanser to detoxify, purify and condition the skin’s natural barrier.']\n{'Item Form': 'Foam', 'Skin Type': 'Oily, Combination, Dry, Normal', 'Brand': 'LaClaire', 'Material Feature': 'Natural', 'Age Range (Description)': 'Adult', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '2.75 x 5.5 x 1.63 inches; 1.76 Ounces', 'UPC': '891040000682', 'Manufacturer': 'LaClaire'}\nThis is a lovely gentle foam that removed my makeup and prepared my skin for a good night's sleep. It comes in a very small container, but a little bit goes a long way.  It feels rich and very soothing and is made of many botanical ingedients. WHile the directions suggest that one avoid eyes, I didn't and kept them tightly shut while washing my face and then rinsing it thoroughly.\nGentle Foam Removes Makeup Including Eueliner and Mascara\nReplacement Toothbrush Heads Compatible With Oral B Braun Electric Toothbrush, 4 Count\nHDY\n{'Brand': 'HDY', 'Size': '4 Count (Pack of 1)', 'Age Range (Description)': 'Adult', 'Item Firmness Description': 'Extra Soft', 'Number of Pieces': '4', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '0.43 x 0.39 x 2.76 inches; 0.81 Ounces', 'UPC': '632088377561', 'Manufacturer': 'HDY'}\nI like to change my brush head frequently. This replacement brush is excellent and cleaned my teeth perfectly. My grandfather was a dentist and instilled in me the desire to keep my teeth and gums in good health. These replacement brushes are every bit as effective as the name brand ones.\nEqual to name brand replacement brushes",
  "profile": "**Updated User Profile Summary:**\n\n- **Bathing Comfort:** The user prioritizes comfort during bath time, favoring soothing and gentle products.\n\n- **Practicality:** They value functional features, especially user-friendly options that deliver effective results without compromising skin balance.\n\n- **Value Consciousness:** They are inclined towards products that offer good value for money, recognizing the importance of quality relative to price in their purchasing decisions.\n\n- **Positive Experience Expectation:** The user anticipates enhancements to their experience from products, reflected in their satisfaction with past purchases.\n\n- **Emphasis on Comfort and Quality:** Soft, high-quality items for relaxation and personal care remain a priority, with a consistent choice for soothing formulations.\n\n- **Self-Care and Experimentation:** Their willingness to try rejuvenating products demonstrates a commitment to self-expression and care, alongside a focus on beauty enhancements.\n\n- **Color and Finish Preferences:** They seek unique colors and finishes in makeup, continuing to prioritize practicality and durability.\n\n- **On-the-Go Solutions:** Recent interactions highlight a preference for convenient, effective products that suit travel and accommodate busy lifestyles.\n\n- **Health and Hygiene Awareness:** The user values dental care essentials, emphasizing frequent replacement of toothbrush heads and the effectiveness of products that support gum health, indicating a holistic approach to personal care.\n\nOverall, the user maintains a focus on comfort, practicality, and value while embracing new self-care and beauty options, and now integrates health-conscious choices into their personal care routine.",
  "metrics": {
    "rouge1_f": 0.11888479747501314,
    "rouge2_f": 0.010531858873091103,
    "rougeL_f": 0.05891635981062599,
    "meteor": 0.04192090537199402,
    "bleu1": 0.0008603023917024583,
    "bleu2": 0.000246711309077335,
    "bleu3": 3.50898772758889e-05,
    "bleu4": 1.324462161055727e-05,
    "bertscore_precision": 0.367754191160202,
    "bertscore_recall": 0.48679637908935547,
    "bertscore_f1": 0.41898372769355774
  }
}