{
  "interaction_number": 3,
  "interaction_summary": "=== Purchase Information ===\nProduct Title: LOT OF 4 AVON GLIMMERSTICKS WATERPROOF EYELINER SMOKEY GREY\nReview Date: 2017/12/08\nStore: AVON\nAverage Rating: 4.5\nProduct Details: {'Brand': 'AVON', 'Finish Type': 'Shimmery', 'Special Feature': 'Waterproof', 'Number of Items': '4', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.3 x 2.9 x 0.5 inches; 0.81 Ounces', 'UPC': '888761116754', 'Manufacturer': 'Avon'}\nReview Text: Really like these eyeliner sticks in hard to find gray color. Easy to apply and long lasting\nReview Title: Great value in hard to find gray eyeliner pencils\nRating: 5.0\n--------------------------------------------------",
  "reference_summary": "MyGift Luxuriously Soft Padded Spa Bath Pillow / Cushion - Hinged Dual Sections, w/ Premium Suction Cups\nYRMJK\n['MyGift Luxuriously Soft Padded Spa Bath Pillow / Cushion - Hinged Dual Sections, w/ Premium Suction Cups']\n{'Brand': 'YRMJK', 'Item Dimensions LxWxH': '14.5 x 2 x 13 inches', 'Item Weight': '0.57 Pounds', 'Product Care Instructions': 'Hand Wash Only', 'Is Discontinued By Manufacturer': 'No', 'Product Dimensions': '14.5 x 2 x 13 inches; 9.12 Ounces', 'UPC': '887702050430', 'Manufacturer': 'HealthMarket'}\nThis bath pillow has made soaking much more pleasant. The suction cups really hold in place and the pillow cradles my head very comfortably. It is easy to keep clean and a perfect addition to my bathing. It was also a very good value price-wise. I am most pleased with this purchase.\nExcellent bath pillow with perfect suction\nNice 'n Easy Permanent Color 9G Light Golden Blonde 1 ea (Pack of 3)\nClairol\n['Product Description', \"The secret to our natural looking color is Clairol's exclusive ColorBlend Technology, which expertly blends 3 complementary tones into every shade. The result? Natural looking color that's perfectly true to you!\", 'From the Manufacturer', 'Get a shade that’s your most true, most you. Thanks to Color Blend Technology,', 'Nice ’n Easy', 'gives you expert highlights and lowlights without the salon. Nice ‘n Easy layers tones and highlights to make over your color. Every shade has our exclusive Color Blend Technology, combining rich tones with contouring highlights in just one step. Expert improvements in all golden shades give you color with high-def dimension and less brassiness. You’ll get dimensional, true-to-you hair color and 100% gray coverage no matter which shade you choose. It’s color that simply comes to life.', 'Expert Highlights & Lowlights in One Simple Step', 'Get color so true, all they see is you. Nice ‘n Easy gives you expert highlights and lowlights without the salon, bringing your look to life. Our expert Color Blend Technology enhances the natural variations in your hair, for a shade that’s true to you.', 'Key Features', 'Permanent liquid hair color with Precision Applicator', 'Permanent liquid hair color with Precision Applicator', 'Lasts up to 8 weeks', 'Lasts up to 8 weeks', '100% gray coverage', '100% gray coverage', 'Includes ColorSeal Conditioning Gloss to help seal in beautiful color and add intense shine', 'Includes ColorSeal Conditioning Gloss to help seal in beautiful color and add intense shine', 'Types of Hair Color', 'Compare Types of Clairol hair color.', 'Brand # of Shades Gray Coverage Color Type Color Lasts Works In Formula', \"Nice 'n Easy Perfect 10\", '24 100% Permanent Crème Color Up to 8 Weeks 10 minutes Micropearls forhigh-gloss color', \"Nice 'n Easy\", '42 100% Permanent Crème Color Up to 8 Weeks 25 minutes Color Blend Technologyfor highlights & lowlights', 'Color Blend Foam', '23 100% Permanent Foam Color Up to 8 Weeks 25 minutes Color Blend Technologyin a drip-free foam', \"Nice 'n Easy Root Touch-Up\", '18', 'formulated to matchany shade', '100% Permanent Crème Color Up to 3 weeks 10 minutes More shade choices,to match any shade,even salon color', '*', 'Natural Instincts', '23 Up to 50% Demi-PermanentCrème Color Up to 28 shampoos 10 minutes Clinically provenhealthier', '**', 'color withno ammonia', 'Natural Instincts Vibrant', '13 100% Permanent Crème Color Up to 8 weeks 10 minutes Anitoxidants helpfight damage', '* Among leading retail permanent shade and pre-formulated salon color** Natural Instincts non-permanent Level 2 vs. leading Triple protection permanent Level 3 color crème: based on amount of surface damage', 'Meet Your Perfect Match', 'Take the guesswork out of gorgeous. Try our quick tool and we’ll give you personalized, expert shade recommendations. Visit Clairol.com/MyShade.', 'Vibrant, Healthy-Looking Color', 'Enjoy stunning, healthy-looking color for up to 8 weeks.', 'view larger']\n{'Color': 'light golden blonde', 'Brand': 'Clairol', 'Item Form': 'Liquid', 'Unit Count': '1 Count', 'Material Feature': 'Natural', 'Package Dimensions': '7.2 x 6.5 x 3.7 inches; 1.85 Pounds', 'Manufacturer': 'HFC Prestige International U.S. LLC'}\nI was looking forward to trying this new Clairol &#34;Sun Kissed&#34; Natural Light Golden Blond haircolor and was hoping for great results. It begain with a very roomy pair of applicator gloves (man-sized) and an easy to pour solution into the applicator bottle containing the developer. I have been coloring my hair for most of my life and I applied the product and left to sit at my computer while the color did its thing. I was pleased that it didn't have a terrible odor and that it didn't drip. Those were two great positives. I did not look in the mirror until I renetered the bathroom and was shocked to see that the stuff on my head had turned a dark reddish shade.  I was hopeful that it would wash off in the shower and that my hair would appear a light golden blond as advertised and it did. While the change from my former product results gave me a surprise, it actually flatters my skin tone and I am glad I gave it a try. Will continue using it because I love the new shade on me. I added it to my Subscribe and Save products.<br /><br />My hair is mow varigated strawberry blond, but my hair was always varigated because some parts are white, some parts are grey, some parts I really can't see (the back of my head);  it is more strawberry blond than golden blond.<br /><br />I suspect that one's results will depend upon your own hair. I actually find the change refreshing.\nNatural Light Golden Blond  Results on My Hair\nLOT OF 4 AVON GLIMMERSTICKS WATERPROOF EYELINER SMOKEY GREY\nAVON\n{'Brand': 'AVON', 'Finish Type': 'Shimmery', 'Special Feature': 'Waterproof', 'Number of Items': '4', 'Unit Count': '1.00 Count', 'Is Discontinued By Manufacturer': 'No', 'Package Dimensions': '5.3 x 2.9 x 0.5 inches; 0.81 Ounces', 'UPC': '888761116754', 'Manufacturer': 'Avon'}\nReally like these eyeliner sticks in hard to find gray color. Easy to apply and long lasting\nGreat value in hard to find gray eyeliner pencils",
  "profile": "**User Profile Summary:**\n\n- **Bathing Comfort:** The user highly values comfort during bath time, as evident from their positive review of a spa bath pillow that enhances their soaking experience.\n\n- **Practicality:** They appreciate functional features such as effective suction for stability and ease of cleaning, reflecting a preference for user-friendly products.\n\n- **Value Consciousness:** The user is inclined towards products that deliver good value for money, suggesting a habit of weighing quality against price in their purchasing decisions.\n\n- **Positive Experience Expectation:** Following satisfaction with previously purchased items, they expect new products to perform well and enhance their overall experience.\n\n- **Emphasis on Comfort and Quality:** The user prefers softness and quality in relaxation and personal care products, as indicated by their choice in cushioned items.\n\n- **Self-Care and Experimentation:** Their recent purchases indicate an openness to experimenting with their appearance, motivated by a desire for rejuvenation and self-expression. They embrace changes, as shown by their satisfaction with hair color results and their recent enjoyment of eyeliner that is both long-lasting and hard to find.\n\n- **Color and Finish Preferences:** The user has a particular interest in makeup options that offer unique colors and finishes, especially those that are practical, easy to apply, and provide durability.\n\nOverall, the user demonstrates a clear trend towards prioritizing comfort, practicality, value, self-care, and an exploratory approach to personal grooming and beauty products.",
  "metrics": {
    "rouge1_f": 0.17495987158908508,
    "rouge2_f": 0.02090032154340836,
    "rougeL_f": 0.07704654895666133,
    "meteor": 0.07203169825738108,
    "bleu1": 0.01308391299653711,
    "bleu2": 0.003831638882427326,
    "bleu3": 0.0011823928714482014,
    "bleu4": 0.00036967738535808133,
    "bertscore_precision": 0.3671431541442871,
    "bertscore_recall": 0.47388404607772827,
    "bertscore_f1": 0.41373997926712036
  }
}